{
  "imDbId": "tt0317705",
  "title": "The Incredibles",
  "fullTitle": "The Incredibles (2004)",
  "type": "Movie",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "The Incredibles",
  "url": "https://en.wikipedia.org/wiki/The_Incredibles",
  "plotShort": {
    "plainText": "The Incredibles is a 2004 American computer-animated superhero film produced by Pixar Animation Studios and released by Walt Disney Pictures. Written and directed by Brad Bird, it stars the voices of Craig T. Nelson, Holly Hunter, Sarah Vowell, Spencer Fox, Jason Lee, Samuel L. Jackson, and Elizabeth Peña. Set in a retro-futuristic version of the 1960s, the film follows Bob and Helen Parr, a couple of superheroes, known as Mr. Incredible and Elastigirl, respectively, who hide their powers in accordance with a government mandate, and attempt to live a quiet suburban life with their three children. However, Bob's desire to help people draws the entire family into a confrontation with a vengeful fan-turned-foe.\r\nBird, who was Pixar's first outside director, developed the film as an extension of the 1960s comic books and spy films from his boyhood and personal family life. He pitched the film to Pixar after Warner Bros.' box office disappointment of his first feature, The Iron Giant (1999), and carried over much of its staff to develop The Incredibles. The animation team was tasked with animating an all-human cast, which required creating new technology to animate detailed human anatomy, clothing, and realistic skin and hair. Michael Giacchino composed the film's orchestral score.\r\nThe Incredibles debuted at the El Capitan Theatre on October 24, 2004, and was released in theaters in the United States on November 5. It earned $632 million worldwide, finishing its theatrical run as the fourth-highest-grossing film of 2004. The Incredibles received widespread acclaim from critics and audiences, with praise for its animation, screenplay, action sequences, sound design, humor, voice acting, themes, music, and appeal to different age groups, and is frequently considered to be one of the greatest superhero movies of all time. It won two Academy Awards for Best Animated Feature and Best Sound Editing with two additional nominations for Best Original Screenplay and Best Sound Mixing, as well as winning the Annie Award for Best Animated Feature. It was the first entirely animated film to win the prestigious Hugo Award for Best Dramatic Presentation. A sequel, Incredibles 2, was released in June 2018.",
    "html": "<p>The Incredibles is a 2004 American computer-animated superhero film produced by Pixar Animation Studios and released by Walt Disney Pictures. Written and directed by Brad Bird, it stars the voices of Craig T. Nelson, Holly Hunter, Sarah Vowell, Spencer Fox, Jason Lee, Samuel L. Jackson, and Elizabeth Peña. Set in a retro-futuristic version of the 1960s, the film follows Bob and Helen Parr, a couple of superheroes, known as Mr. Incredible and Elastigirl, respectively, who hide their powers in accordance with a government mandate, and attempt to live a quiet suburban life with their three children. However, Bob's desire to help people draws the entire family into a confrontation with a vengeful fan-turned-foe.</p><p>Bird, who was Pixar's first outside director, developed the film as an extension of the 1960s comic books and spy films from his boyhood and personal family life. He pitched the film to Pixar after Warner Bros.' box office disappointment of his first feature, The Iron Giant (1999), and carried over much of its staff to develop The Incredibles. The animation team was tasked with animating an all-human cast, which required creating new technology to animate detailed human anatomy, clothing, and realistic skin and hair. Michael Giacchino composed the film's orchestral score.</p><p>The Incredibles debuted at the El Capitan Theatre on October 24, 2004, and was released in theaters in the United States on November 5. It earned $632 million worldwide, finishing its theatrical run as the fourth-highest-grossing film of 2004. The Incredibles received widespread acclaim from critics and audiences, with praise for its animation, screenplay, action sequences, sound design, humor, voice acting, themes, music, and appeal to different age groups, and is frequently considered to be one of the greatest superhero movies of all time. It won two Academy Awards for Best Animated Feature and Best Sound Editing with two additional nominations for Best Original Screenplay and Best Sound Mixing, as well as winning the Annie Award for Best Animated Feature. It was the first entirely animated film to win the prestigious Hugo Award for Best Dramatic Presentation. A sequel, Incredibles 2, was released in June 2018.</p>"
  },
  "plotFull": {
    "plainText": "The Incredibles is a 2004 American computer-animated superhero film produced by Pixar Animation Studios and released by Walt Disney Pictures. Written and directed by Brad Bird, it stars the voices of Craig T. Nelson, Holly Hunter, Sarah Vowell, Spencer Fox, Jason Lee, Samuel L. Jackson, and Elizabeth Peña. Set in a retro-futuristic version of the 1960s, the film follows Bob and Helen Parr, a couple of superheroes, known as Mr. Incredible and Elastigirl, respectively, who hide their powers in accordance with a government mandate, and attempt to live a quiet suburban life with their three children. However, Bob's desire to help people draws the entire family into a confrontation with a vengeful fan-turned-foe.\r\nBird, who was Pixar's first outside director, developed the film as an extension of the 1960s comic books and spy films from his boyhood and personal family life. He pitched the film to Pixar after Warner Bros.' box office disappointment of his first feature, The Iron Giant (1999), and carried over much of its staff to develop The Incredibles. The animation team was tasked with animating an all-human cast, which required creating new technology to animate detailed human anatomy, clothing, and realistic skin and hair. Michael Giacchino composed the film's orchestral score.\r\nThe Incredibles debuted at the El Capitan Theatre on October 24, 2004, and was released in theaters in the United States on November 5. It earned $632 million worldwide, finishing its theatrical run as the fourth-highest-grossing film of 2004. The Incredibles received widespread acclaim from critics and audiences, with praise for its animation, screenplay, action sequences, sound design, humor, voice acting, themes, music, and appeal to different age groups, and is frequently considered to be one of the greatest superhero movies of all time. It won two Academy Awards for Best Animated Feature and Best Sound Editing with two additional nominations for Best Original Screenplay and Best Sound Mixing, as well as winning the Annie Award for Best Animated Feature. It was the first entirely animated film to win the prestigious Hugo Award for Best Dramatic Presentation. A sequel, Incredibles 2, was released in June 2018.\r\nPlot\r\nOn the day of his wedding with Helen Truax (alias Elastigirl), superhero Bob Parr (alias Mr. Incredible) thwarts a civilian's attempted suicide by tackling him through a skyscraper window. Bob then discovers supervillain Bomb Voyage robbing the building, but is interrupted by his devoted fanboy Buddy Pine, who wants to be his sidekick. Bob rejects Buddy, and Voyage clips a bomb onto Buddy's cape; Bob manages to get the bomb off, but it destroys part of an el-train track, forcing Bob to abruptly stop an oncoming train. After his wedding, Bob is sued for collateral damage by the suicidal civilian and the injured train passengers. Similar lawsuits create a negative public attitude towards superheroes, so the government initiates the Superhero Relocation Program, banning all \"supers\" from using their powers in public and forcing them into hiding.\r\nFifteen years later, Bob—who has gained a significant amount of weight—and Helen live with their children, Violet, Dash, and baby Jack-Jack, in Metroville. Although he loves his family, Bob misses his superhero days and resents his mundane job as a claims adjuster, moonlighting as a vigilante with his best friend Lucius Best (alias Frozone). One day Bob's supervisor Gilbert Huph stops him from preventing a mugging, after which Bob assaults Huph in his rage, and is fired as a result. Later, a woman named Mirage secretly offers him a mission to subdue a giant \"Omnidroid\" robot loose on Nomanisan island. Bob succeeds by tricking the machine into ripping out its own power source. Rejuvenated by the action and higher pay, Bob improves his relationship with his family, and trains to get back into shape. He visits superhero costume designer Edna Mode when he discovers a tear in his old suit. Incorrectly assuming Helen knows of Bob's new job, Edna makes new suits for the entire family.\r\nSummoned back to Nomanisan, Bob discovers Mirage is working for Buddy. Now wealthy, he has invented many weapons that mimic superpowers. Embittered by Bob's rejection, Buddy has been calling himself Syndrome and has been perfecting the Omnidroid killing machine by making it fight and murder many superheroes. Syndrome intends to send an Omnidroid to attack Metroville, then defeat it publicly with secret controls, thereby gaining \"hero\" status. He then plans to sell his inventions to the world to make the term \"super\" irrelevant.\r\nHelen visits Edna and learns what Bob has been up to. She activates a beacon Edna built into the suits to find Bob, inadvertently causing Bob to be captured while infiltrating Syndrome's base. Helen borrows a private plane to fly to Nomanisan. Violet and Dash stow away, leaving Jack-Jack with a babysitter. Despite knowing that there are children on the plane, Syndrome shoots it down with missiles, but Helen and the kids survive and make it to the island. Disillusioned by Syndrome's callousness, Mirage releases Bob and informs him of his family's survival. Syndrome's guards pursue Dash and Violet, who fight them off with their powers and reunite with their parents. Syndrome imprisons the family, and follows the Omnidroid to Metroville. The Parrs escape to Metroville as well with Mirage's help.\r\nSyndrome's plan backfires when the Omnidroid's artificial intelligence recognizes that Syndrome's remote wrist control is a threat and shoots it off him, knocking Syndrome unconscious as he tries to flee. The Parrs and Lucius fight the Omnidroid; Helen and the kids retrieve the remote control, allowing Bob to destroy the robot's power source. The Parrs and Lucius are hailed by the public just as Syndrome awakens to see their victory. Returning home, the Parrs find Syndrome retaliating by abducting Jack-Jack to raise as a sidekick. As Syndrome flies away, Jack-Jack's own superpowers manifest and he escapes Syndrome's hold. Helen rescues the falling baby, and Bob knocks Syndrome into his plane's engine, causing it to explode.\r\nThree months later, the Parrs witness the arrival of supervillain the Underminer. They don their masks and suits, ready to face the new threat.\r\nVoice cast\r\nCraig T. Nelson as Bob Parr / Mr. Incredible, Helen's husband who possesses superhuman strength and endurance.\r\nHolly Hunter as Helen Parr / Elastigirl, Bob's wife who has the ability to shapeshift her body like rubber.\r\nSarah Vowell as Violet Parr, the Parrs' eldest child who can become invisible and generate force fields.\r\nSpencer Fox as Dashiell \"Dash\" Parr, the Parrs' second child who possesses superhuman speed.\r\nEli Fucile and Maeve Andrews as Jack-Jack Parr, the Parrs' baby son who demonstrates a wide range of superhuman abilities.\r\nJason Lee as Buddy Pine / IncrediBoy / Syndrome, Mr. Incredible's obsessed fan-turned-supervillain who uses his scientific prowess to give himself enhanced abilities.\r\nSamuel L. Jackson as Lucius Best / Frozone, Bob's best friend who can form ice from humidity.\r\nElizabeth Peña as Mirage, Syndrome's right-hand woman.\r\nBrad Bird as Edna \"E\" Mode, the fashion designer for the Supers.\r\nTeddy Newton as Newsreel Narrator, heard narrating the changing public opinion of the Supers.\r\nJean Sincere as Mrs. Hogenson, an elderly lady to whom Bob pretends to deny an insurance claim.\r\nBud Luckey as Rick Dicker, a government agent responsible for keeping the Parrs undercover.\r\nWallace Shawn as Gilbert Huph, Bob's demeaning boss.\r\nLou Romano as Bernie Kropp, Dash's teacher.\r\nMichael Bird as Tony Rydinger, Violet's love interest.\r\nDominique Louis as Bomb Voyage, a French supervillain who uses explosives.\r\nBret Parker as Kari, Jack-Jack's babysitter.\r\nKimberly Adair Clark as Honey, Frozone's wife.\r\nJohn Ratzenberger as The Underminer, a mole-like supervillain.\r\nProduction\r\nDevelopment and writing\r\nThe Incredibles as a concept dates back to 1993 when Bird sketched the family during an uncertain point in his film career. Personal issues had percolated into the story as they weighed on him in life. During this time, Bird had signed a production deal with Warner Bros. Feature Animation and was in the process of directing his first feature, The Iron Giant. Approaching middle age and having high aspirations for his filmmaking, Bird pondered whether his career goals were attainable only at the price of his family life. He stated, \"Consciously, this was just a funny movie about superheroes. But I think that what was going on in my life definitely filtered into the movie.\" After the box office failure of The Iron Giant, Bird gravitated toward his superhero story.\r\nHe imagined it as a homage to the 1960s comic books and spy films from his boyhood and he initially tried to develop it as a 2D cel animation. When The Iron Giant became a box office bomb, he reconnected with old friend John Lasseter at Pixar in March 2000 and pitched his story idea to him. Bird and Lasseter knew each other from their college years at CalArts in the 1970s. Lasseter was sold on the idea and convinced Bird to come to Pixar, where the film would be done in computer animation. The studio announced a multi-film contract with Bird on May 4, 2000. The Incredibles was written and directed solely by Brad Bird, a departure from previous Pixar productions which typically had two or three directors and as many screenwriters with a history of working for the company. In addition, it would be the company's first film in which all characters are human.\r\nThe dad is always expected in the family to be strong, so I made him strong. The moms are always pulled in a million different directions, so I made her stretch like taffy. Teenagers, particularly teenage girls, are insecure and defensive, so I made her turn invisible and turn on shields. And ten-year-old boys are hyperactive energy balls. Babies are unrealized potential.\r\n– Brad Bird, writer and director of The Incredibles.\r\nBird came to Pixar with the lineup of the story's family members worked out: a mom and dad, both suffering through the dad's midlife crisis; a shy teenage girl; a cocky ten-year-old boy; and a baby. Bird had based their powers on family archetypes. During production, Hayao Miyazaki of Studio Ghibli visited Pixar and saw the film's story reels. When Bird asked if the reels made any sense or if they were just \"American nonsense,\" Miyazaki replied, through an interpreter, \"I think it's a very adventurous thing you are trying to do in an American film.\"\r\nSyndrome was originally written as a minor character who assaults Bob and Helen at the beginning of the movie, only to die in an explosion that destroys the Parrs' house (in this version, the Smiths), but he was made the main antagonist because the filmmakers liked him more than the character of Xerek, who was intended to fulfill that role. The Snug character that Helen talks to at the phone in the final film was intended to fly Helen to Nomanisan Island and to die, but he was removed from that position when Lasseter suggested having Helen pilot the plane herself. Syndrome was based on Brad Bird himself.\r\nCasting\r\nHolly Hunter, cast as Helen Parr/Elastigirl, never voiced an animated character before and saw the role as an exciting opportunity to expand her repertoire. She was also drawn to the film by its unique and \"unconventional story about family and human dynamics\". Bird considered Hunter \"one of the finest actresses in the world\", capable of playing a \"sensitive\" character who also has \"a very sturdy center\". Spencer Fox was cast as Dash Parr, which was also his feature film debut. Brad Bird wanted to give Dash a realistic out-of-breath voice in certain scenes such as the jungle scene so he made Fox run four laps around the Pixar studio until he got tired. Samuel L. Jackson was cast as Lucius Best/Frozone, Bird cast him because he stated that he wanted the character to have the coolest voice. Lily Tomlin was originally considered for the role of Edna Mode, but later turned it down. After several failed attempts to cast Edna Mode, Bird took on her voice role himself. It was an extension of the Pixar custom of tapping in-house staff whose voices came across particularly well on scratch dialogue tracks. Sarah Vowell was offered the role of Violet unexpectedly; Bird wanted to cast Vowell as Violet after hearing her voice on the National Public Radio program, This American Life. Bird stated that she was \"perfect\" for the part and immediately called her to offer her the role.\r\nAnimation\r\nUpon Pixar's acceptance of the project, Brad Bird was asked to bring in his own team for the production. He brought up a core group of people he worked with on The Iron Giant. Because of this, many 2D artists had to make the shift to 3D, including Bird himself. Bird found working with CGI \"wonderfully malleable\" in a way that traditional animation is not, calling the camera's ability to easily switch angles in a given scene \"marvelously adaptable.\" He found working in computer animation \"difficult\" in a different way than working traditionally, finding the software \"sophisticated and not particularly friendly.\" Bird wrote the script without knowing the limitations or concerns that went hand-in-hand with the medium of computer animation. As a result, this was to be the most complex film yet for Pixar. The film's characters were designed by Tony Fucile and Teddy Newton, whom Bird had brought with him from Warner Bros. Like most computer-animated films, The Incredibles had a year-long period of building the film from the inside out: modeling the exterior and understanding controls that would work the face and the body—the articulation of the character—before animation could even begin. Bird and Fucile tried to emphasize the graphic quality of good 2D animation to the Pixar team, who had only worked primarily in CGI. Bird attempted to incorporate teaching from Disney's Nine Old Men that the crew at Pixar had \"never really emphasized.\"\r\nFor the technical crew members, the film's human characters posed a difficult set of challenges. Bird's story was filled with elements that were difficult to animate with CGI back then. Humans are widely considered to be the most difficult things to execute in animation. Pixar's animators filmed themselves walking to better grasp proper human motion. Creating an all-human cast required creating new technology to animate detailed human anatomy, clothing, and realistic skin and hair. Although the technical team had some experience with hair and cloth in Monsters, Inc. (2001), the amount of hair and cloth required for The Incredibles had never been done by Pixar up until this point. Moreover, Bird would tolerate no compromises for the sake of technical simplicity. Where the technical team on Monsters, Inc. had persuaded director Pete Docter to accept pigtails on Boo to make her hair easier to animate, the character Violet had to have long hair that obscured her face; in fact, this was integral to her character. Violet's long hair, which was extremely difficult to animate, was only successfully animated toward the end of production. In addition, animators had to adapt to having hair both underwater and blowing through the wind. Disney was initially reluctant to make the film because of these issues, thinking that a live-action film would be preferable, but Lasseter denied this.\r\nThe Incredibles was everything that computer-generated animation had trouble doing. It had human characters, it had hair, it had water, it had fire, it had a massive number of sets. The creative heads were excited about the idea of the film, but once I showed story reels of exactly what I wanted, the technical teams turned white. They took one look and thought, “This will take ten years and cost $500 million. How are we possibly going to do this?” So I said, “Give us the black sheep. I want artists who are frustrated. I want the ones who have another way of doing things that nobody's listening to. Give us all the guys who are probably headed out the door.” A lot of them were malcontents because they saw different ways of doing things, but there was little opportunity to try them, since the established way was working very, very well. We gave the black sheep a chance to prove their theories, and we changed the way a number of things are done here. For less money per minute than was spent on the previous film, Finding Nemo, we did a movie that had three times the number of sets and had everything that was hard to do. All this because the heads of Pixar gave us leave to try crazy ideas.\r\n— Brad Bird speaking to McKinsey Quarterly in 2008\r\nNot only did The Incredibles cope with the difficulty of animating CGI humans, but also many other complications. The story was bigger than any prior story at the studio, was longer in running time, and had four times the number of locations. Supervising technical director Rick Sayre noted that the hardest thing about the film was that there was \"no hardest thing,\" alluding to the amount of new technical challenges: fire, water, air, smoke, steam, and explosions were all additional to the new difficulty of working with humans. The film's organizational structure could not be mapped out like previous Pixar features, and it became a running joke to the team. Sayre said the team adopted “Alpha Omega,\" where one team was concerned with building modeling, shading, and layout, while another dealt with final camera, lighting, and effects. Another team, dubbed the \"character team,\" digitally sculpted, rigged, and shaded all of the characters, and a simulation team was responsible for developing simulation technology for hair and clothing. There were at least 781 visual effects shots in the film, and they were quite often visual gags, such as the window shattering when Bob angrily shuts the car door. Additionally, the effects team improved their modeling of clouds, using volumetric rendering for the first time.\r\nThe skin of the characters gained a new level of realism from a technology to mimic \"subsurface scattering.\" The challenges did not stop with modeling humans. Bird decided that in a shot near the film's end, baby Jack-Jack would have to undergo a series of transformations, and in one of the five planned he would turn himself into a kind of goo. Technical directors, who anticipated spending two months or even longer to work out the goo effect, stealing precious hours from production that had already entered its final and most critical stages, petitioned the film's producer, John Walker, for help. Bird, who had himself brought Walker over from Warner Bros. to work on the project, was at first immovable, but after arguing with Walker in several invective-laced meetings over the course of two months, Bird finally conceded. Bird also insisted that the storyboards define the blocking of characters' motions, lighting, and camera movements, which had previously been left to other departments rather than storyboarded.\r\nBird admitted that he \"had the knees of trembling under the weight\" of The Incredibles, but called the film a \"testament to the talent of the animators at Pixar,\" who were admiring the challenges the film provoked. He recalled, \"Basically, I came into a wonderful studio, frightened a lot of people with how many presents I wanted for Christmas, and then got almost everything I asked for.\"\r\nMusic\r\nThe Incredibles is the first Pixar film to be scored by Michael Giacchino. Brad Bird was looking for a specific sound as inspired by the film's retrofuturistic design – the future as seen from the 1960s. John Barry was the first choice to do the film's score, with a trailer of the film given a rerecording of Barry's theme to On Her Majesty's Secret Service. However, Barry did not wish to duplicate the sound of some of his earlier soundtracks; the assignment was instead given to Giacchino. Giacchino noted that recording in the 1960s was largely different from modern day recording and Dan Wallin, the recording engineer, said that Bird wanted an old feel, and as such the score was recorded on analog tapes. Wallin noted that brass instruments, which are at the forefront of the film's score, sound better on analog equipment rather than digital. Wallin came from an era in which music was recorded, according to Giacchino, \"the right way,\" which consists of everyone in the same room, \"playing against each other and feeding off each other's energy.\" Many of Giacchino's future soundtracks followed suit with this style of mixing. Tim Simonec was the conductor/orchestrator for the score's recording.\r\nThe film's orchestral score was released on November 2, 2004, by Walt Disney Records, three days before the film opened in theaters. It won numerous awards for best score including Los Angeles Film Critics Association Award, BMI Film & TV Award, ASCAP Film and Television Music Award, Annie Award, Las Vegas Film Critics Society Award and Online Film Critics Society Award and was nominated for Grammy Award for Best Score Soundtrack for Visual Media, Satellite Award and Broadcast Film Critics Association Award.\r\nThemes\r\nSeveral film reviewers drew precise parallels between the film and certain superhero comic books, like Powers, Watchmen, Fantastic Four, Justice League and The Avengers. The producers of the 2005 adaptation of Fantastic Four were forced to make significant script changes and add more special effects because of similarities to The Incredibles. Bird was not surprised that comparisons arose due to superheroes being \"the most well-trod turf on the planet,\" but noted that he had not been inspired by any comic books specifically, only having heard of Watchmen. He did comment that it was nice to be compared to it, since \"if you're going to be compared to something, it's nice if it's something good\".\r\nSome commentators took Bob's frustration with celebrating mediocrity and Syndrome's comment that \"when everyone's super, no one will be\" as a reflection of views shared by German philosopher Friedrich Nietzsche or an extension of Russian-American novelist Ayn Rand's Objectivism philosophy, which Bird felt was \"ridiculous.\" He stated that a large portion of the audience understood the message as he intended whereas \"two percent thought I was doing The Fountainhead or Atlas Shrugged.\" Some purported that The Incredibles exhibited a right-wing bias, which Bird also scoffed at. \"I think that's as silly of an analysis as saying The Iron Giant was left-wing. I'm definitely a centrist and feel like both parties can be absurd.\"\r\nThe film also explored Bird's dislike for the tendency of the children's comics and Saturday morning cartoons of his youth to portray villains as unrealistic, ineffectual, and non-threatening. In the film, Dash and Violet have to deal with villains who are perfectly willing to use deadly force against children. On another level, both Dash and Violet display no emotion or regret at the deaths of those who are trying to kill them, such as when Dash outruns pursuers who crash their vehicles while chasing him, or when both of them witness their parents destroy several attacking vehicles with people inside, in such a manner that the deaths of those piloting them is undeniable. Despite disagreeing with some analysis, Bird felt it gratifying for his work to be considered on many different levels, which was his intention: \"The fact that it was written about in the op/ed section of The New York Times several times was really gratifying to me. Look, it's a mainstream animated movie, and how often are those considered thought provoking?\"\r\nRelease\r\nMarketing\r\nA teaser trailer of The Incredibles premiered on May 30, 2003, and was attached to the screenings of Finding Nemo. Several companies released promotional products related to the film. In the weeks before the film's opening, there were also promotional tie-ins with SBC Communications (using Dash to promote the \"blazing-fast speed\" of its SBC Yahoo! DSL service) Tide, Downy, Bounce and McDonald's. Dark Horse Comics released a limited series of comic books based on the film. Toy maker Hasbro produced a series of action figures and toys based on the film. Kellogg's released an Incredibles-themed cereal, as well as promotional Pop-Tarts and fruit snacks, all proclaiming an \"Incrediberry Blast\" of flavor. Pringles included potato chips featuring the superheroes and quotes from the film. In July 2008, it was announced that a series of comic books based on the film would be published by BOOM! Studios in collaboration with Disney Publishing by the end of the year. The first miniseries by BOOM! was The Incredibles: Family Matters by Mark Waid and Marcio Takara, which was published from March to June 2009 and collected into a trade paperback published in July of that year.\r\nTheatrical\r\nThe Incredibles was released theatrically in the United States on November 5, 2004. In theaters, The Incredibles was accompanied by a short film, Boundin' (2003). The theatrical release also included a sneak peek for Star Wars: Episode III – Revenge of the Sith. While Pixar celebrated another triumph with The Incredibles, Steve Jobs was embroiled in a public feud with the head of its distribution partner, The Walt Disney Company. This would eventually lead to the ousting of Michael Eisner and Disney's acquisition of Pixar the following year. In March 2014, Disney CEO and chairman Bob Iger announced that the film would be reformatted and re-released in 3D. The Incredibles was re-released and digitally re-mastered for IMAX theaters (alongside its sequel, Incredibles 2) using their DMR Technology in a double feature on June 14, 2018.\r\nHome media\r\nThe film was first released on both VHS and a two-disc collector's edition DVD set on March 15, 2005. The DVD set was THX certified, consisted of widescreen and a pan and scan fullscreen versions and included two newly commissioned Pixar short films, Jack-Jack Attack and Mr. Incredible and Pals, which were made specifically for this home-video release, and Boundin', a Pixar short film that premiered alongside the feature film in its original theatrical release. The VHS release only featured the short, Boundin'. It was the highest-selling DVD of 2005, with 17.38 million copies sold. The film was also released on UMD for the Sony PSP. Disney released the film on Blu-ray in North America on April 12, 2011, and on 4K UHD Blu-ray on June 5, 2018; this marks Disney's first 4K Blu-ray reissue on the format.\r\nReception\r\nBox office\r\nThe Incredibles earned $261.4 million in the United States and Canada and $370.1 million in other territories, for a worldwide total of $631.6 million. It was the fourth-highest-grossing film of 2004, behind Shrek 2, Harry Potter and the Prisoner of Azkaban and Spider-Man 2.\r\nThe Incredibles was released with Alfie on November 5, 2004. It debuted earning $70.7 million from 3,933 theaters. This made it the second-highest opening weekend for an animated film, trailing only behind Shrek 2. The film opened in the number #1 spot at the box office, dominating Saw, The Grudge, Shark Tale, Ray, Ladder 49 and other films. Despite its opening, the overall Hollywood revenues fell, continuing a box office slump that had lingered for most of the fall season. The top 12 movies took in $136.1 million down to 5% from the same weekend the previous year, just after the openings of The Matrix Revolutions and Elf. For 15 years, The Incredibles had the biggest November opening weekend for an animated film until it was dethroned by Frozen II in 2019. It continued to rule the box office while staying ahead of The Polar Express. Its second weekend earnings dropped by 28% to $51 million, and followed by another $26 million the third weekend. The Incredibles completed its theatrical run in the United States and Canada on April 14, 2005.\r\nCritical response\r\nOn review aggregator website Rotten Tomatoes, The Incredibles holds an approval rating of 97% based on 248 reviews, with an average rating of 8.4/10. The website's critical consensus reads, \"Bringing loads of wit and tons of fun to the animated superhero genre, The Incredibles easily lives up to its name.\" Another review aggregator, Metacritic, which assigns a weighted average score to reviews from mainstream critics, gave The Incredibles an average score of 90 out of 100 based on 41 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale, making it Pixar's fourth film to receive this grade (after Toy Story 2, Monsters, Inc., and Finding Nemo).\r\nRoger Ebert of the Chicago Sun-Times gave the film three-and-a-half out of four, writing that the film \"alternates breakneck action with satire of suburban sitcom life\" and is \"another example of Pixar's mastery of popular animation.\" Peter Travers of Rolling Stone also gave the film three-and-a-half, calling it \"one of the year's best\" and saying that it \"doesn't ring cartoonish, it rings true.\" Giving the film three-and-a-half as well, People magazine found that The Incredibles \"boasts a strong, entertaining story and a truckload of savvy comic touches.\"\r\nEleanor Ringel Gillespie of The Atlanta Journal-Constitution was bored by the film's \"recurring pastiches of earlier action films\", concluding that \"the Pixar whizzes do what they do excellently; you just wish they were doing something else.\" Jessica Winter of The Village Voice criticized the film for \"playing as a standard summer action film\", despite being released in early November. Her review, titled as \"Full Metal Racket,\" noted that The Incredibles \"announces the studio's arrival in the vast yet overcrowded Hollywood lot of eardrum-bashing, metal-crunching action sludge.\"\r\nThe Incredibles was included on a number of best-of lists. It appeared on professional rankings from The Guardian based on retrospective appraisal, as one of the greatest films of the twenty-first century. Travers also named it as number 6 on his list of the decade's best films. Several publications have listed it as one of the best animated films, including: Entertainment Weekly (2009), IGN (2010), Insider, USA Today, Elle (all 2018), Rolling Stone (2019), Parade, Complex, Time Out New York, and Empire (all 2021). The Incredibles appeared on several lists of the best superhero films, by outlets including: Time (2011), Paste, Vulture, Marie Claire (all 2019), IGN (2020), Esquire, The Indian Express, and Parade (all 2021). In December 2021, the film's screenplay was listed number 48 on the Writers Guild of America's \"101 Greatest Screenplays of the 21st Century (So Far)\". Others have named it one of the best conservative films, best action films, and best political films.\r\nAccolades\r\nThe Incredibles led the 77th Academy Awards season with four nominations (including Best Original Screenplay and Sound Mixing). It received two Oscars: Best Animated Feature and Sound Editing. Joe Morgenstern of The Wall Street Journal called The Incredibles the year's best picture. Premiere magazine released a cross-section of all the top critics in America and The Incredibles placed at number three, whereas review aggregation website Rotten Tomatoes cross-referenced reviews that suggested it was its year's highest-rated film.\r\nThe film also received the 2004 Annie Award for Best Animated Feature and the 2005 Hugo Award for Best Dramatic Presentation, Long Form, and it was nominated for the 2004 Golden Globe Award for Best Motion Picture – Musical or Comedy. It also won the Saturn Award for Best Animated Film. The American Film Institute included it as one of the top 10 films of 2004.\r\nIt was included on Empire's 500 Greatest Films of All Time at number 400.\r\nVideo games\r\nIt has received several game adaptations: The Incredibles (2004), The Incredibles: When Danger Calls (2004), and The Incredibles: Rise of the Underminer (2005). Kinect Rush: A Disney–Pixar Adventure (2012) features characters and worlds from five Pixar films, including The Incredibles. Disney Infinity (2013) includes The Incredibles playset featuring the film's playable characters. Lego The Incredibles was released in June 2018.\r\nSequel\r\nA sequel, titled Incredibles 2, was released on June 15, 2018 and was once again a critical and commercial success.",
    "html": "<p>The Incredibles is a 2004 American computer-animated superhero film produced by Pixar Animation Studios and released by Walt Disney Pictures. Written and directed by Brad Bird, it stars the voices of Craig T. Nelson, Holly Hunter, Sarah Vowell, Spencer Fox, Jason Lee, Samuel L. Jackson, and Elizabeth Peña. Set in a retro-futuristic version of the 1960s, the film follows Bob and Helen Parr, a couple of superheroes, known as Mr. Incredible and Elastigirl, respectively, who hide their powers in accordance with a government mandate, and attempt to live a quiet suburban life with their three children. However, Bob's desire to help people draws the entire family into a confrontation with a vengeful fan-turned-foe.</p><p>Bird, who was Pixar's first outside director, developed the film as an extension of the 1960s comic books and spy films from his boyhood and personal family life. He pitched the film to Pixar after Warner Bros.' box office disappointment of his first feature, The Iron Giant (1999), and carried over much of its staff to develop The Incredibles. The animation team was tasked with animating an all-human cast, which required creating new technology to animate detailed human anatomy, clothing, and realistic skin and hair. Michael Giacchino composed the film's orchestral score.</p><p>The Incredibles debuted at the El Capitan Theatre on October 24, 2004, and was released in theaters in the United States on November 5. It earned $632 million worldwide, finishing its theatrical run as the fourth-highest-grossing film of 2004. The Incredibles received widespread acclaim from critics and audiences, with praise for its animation, screenplay, action sequences, sound design, humor, voice acting, themes, music, and appeal to different age groups, and is frequently considered to be one of the greatest superhero movies of all time. It won two Academy Awards for Best Animated Feature and Best Sound Editing with two additional nominations for Best Original Screenplay and Best Sound Mixing, as well as winning the Annie Award for Best Animated Feature. It was the first entirely animated film to win the prestigious Hugo Award for Best Dramatic Presentation. A sequel, Incredibles 2, was released in June 2018.</p><br/><h3>Plot</h3><p>On the day of his wedding with Helen Truax (alias Elastigirl), superhero Bob Parr (alias Mr. Incredible) thwarts a civilian's attempted suicide by tackling him through a skyscraper window. Bob then discovers supervillain Bomb Voyage robbing the building, but is interrupted by his devoted fanboy Buddy Pine, who wants to be his sidekick. Bob rejects Buddy, and Voyage clips a bomb onto Buddy's cape; Bob manages to get the bomb off, but it destroys part of an el-train track, forcing Bob to abruptly stop an oncoming train. After his wedding, Bob is sued for collateral damage by the suicidal civilian and the injured train passengers. Similar lawsuits create a negative public attitude towards superheroes, so the government initiates the Superhero Relocation Program, banning all \"supers\" from using their powers in public and forcing them into hiding.</p><p>Fifteen years later, Bob—who has gained a significant amount of weight—and Helen live with their children, Violet, Dash, and baby Jack-Jack, in Metroville. Although he loves his family, Bob misses his superhero days and resents his mundane job as a claims adjuster, moonlighting as a vigilante with his best friend Lucius Best (alias Frozone). One day Bob's supervisor Gilbert Huph stops him from preventing a mugging, after which Bob assaults Huph in his rage, and is fired as a result. Later, a woman named Mirage secretly offers him a mission to subdue a giant \"Omnidroid\" robot loose on Nomanisan island. Bob succeeds by tricking the machine into ripping out its own power source. Rejuvenated by the action and higher pay, Bob improves his relationship with his family, and trains to get back into shape. He visits superhero costume designer Edna Mode when he discovers a tear in his old suit. Incorrectly assuming Helen knows of Bob's new job, Edna makes new suits for the entire family.</p><p>Summoned back to Nomanisan, Bob discovers Mirage is working for Buddy. Now wealthy, he has invented many weapons that mimic superpowers. Embittered by Bob's rejection, Buddy has been calling himself Syndrome and has been perfecting the Omnidroid killing machine by making it fight and murder many superheroes. Syndrome intends to send an Omnidroid to attack Metroville, then defeat it publicly with secret controls, thereby gaining \"hero\" status. He then plans to sell his inventions to the world to make the term \"super\" irrelevant.</p><p>Helen visits Edna and learns what Bob has been up to. She activates a beacon Edna built into the suits to find Bob, inadvertently causing Bob to be captured while infiltrating Syndrome's base. Helen borrows a private plane to fly to Nomanisan. Violet and Dash stow away, leaving Jack-Jack with a babysitter. Despite knowing that there are children on the plane, Syndrome shoots it down with missiles, but Helen and the kids survive and make it to the island. Disillusioned by Syndrome's callousness, Mirage releases Bob and informs him of his family's survival. Syndrome's guards pursue Dash and Violet, who fight them off with their powers and reunite with their parents. Syndrome imprisons the family, and follows the Omnidroid to Metroville. The Parrs escape to Metroville as well with Mirage's help.</p><p>Syndrome's plan backfires when the Omnidroid's artificial intelligence recognizes that Syndrome's remote wrist control is a threat and shoots it off him, knocking Syndrome unconscious as he tries to flee. The Parrs and Lucius fight the Omnidroid; Helen and the kids retrieve the remote control, allowing Bob to destroy the robot's power source. The Parrs and Lucius are hailed by the public just as Syndrome awakens to see their victory. Returning home, the Parrs find Syndrome retaliating by abducting Jack-Jack to raise as a sidekick. As Syndrome flies away, Jack-Jack's own superpowers manifest and he escapes Syndrome's hold. Helen rescues the falling baby, and Bob knocks Syndrome into his plane's engine, causing it to explode.</p><p>Three months later, the Parrs witness the arrival of supervillain the Underminer. They don their masks and suits, ready to face the new threat.</p><br/><h3>Voice cast</h3><ul><li>Craig T. Nelson as Bob Parr / Mr. Incredible, Helen's husband who possesses superhuman strength and endurance.</li><li>Holly Hunter as Helen Parr / Elastigirl, Bob's wife who has the ability to shapeshift her body like rubber.</li><li>Sarah Vowell as Violet Parr, the Parrs' eldest child who can become invisible and generate force fields.</li><li>Spencer Fox as Dashiell \"Dash\" Parr, the Parrs' second child who possesses superhuman speed.</li><li>Eli Fucile and Maeve Andrews as Jack-Jack Parr, the Parrs' baby son who demonstrates a wide range of superhuman abilities.</li><li>Jason Lee as Buddy Pine / IncrediBoy / Syndrome, Mr. Incredible's obsessed fan-turned-supervillain who uses his scientific prowess to give himself enhanced abilities.</li><li>Samuel L. Jackson as Lucius Best / Frozone, Bob's best friend who can form ice from humidity.</li><li>Elizabeth Peña as Mirage, Syndrome's right-hand woman.</li><li>Brad Bird as Edna \"E\" Mode, the fashion designer for the Supers.</li><li>Teddy Newton as Newsreel Narrator, heard narrating the changing public opinion of the Supers.</li><li>Jean Sincere as Mrs. Hogenson, an elderly lady to whom Bob pretends to deny an insurance claim.</li><li>Bud Luckey as Rick Dicker, a government agent responsible for keeping the Parrs undercover.</li><li>Wallace Shawn as Gilbert Huph, Bob's demeaning boss.</li><li>Lou Romano as Bernie Kropp, Dash's teacher.</li><li>Michael Bird as Tony Rydinger, Violet's love interest.</li><li>Dominique Louis as Bomb Voyage, a French supervillain who uses explosives.</li><li>Bret Parker as Kari, Jack-Jack's babysitter.</li><li>Kimberly Adair Clark as Honey, Frozone's wife.</li><li>John Ratzenberger as The Underminer, a mole-like supervillain.</li></ul><br/><h3>Production</h3><h4>Development and writing</h4><p>The Incredibles as a concept dates back to 1993 when Bird sketched the family during an uncertain point in his film career. Personal issues had percolated into the story as they weighed on him in life. During this time, Bird had signed a production deal with Warner Bros. Feature Animation and was in the process of directing his first feature, The Iron Giant. Approaching middle age and having high aspirations for his filmmaking, Bird pondered whether his career goals were attainable only at the price of his family life. He stated, \"Consciously, this was just a funny movie about superheroes. But I think that what was going on in my life definitely filtered into the movie.\" After the box office failure of The Iron Giant, Bird gravitated toward his superhero story.</p><p>He imagined it as a homage to the 1960s comic books and spy films from his boyhood and he initially tried to develop it as a 2D cel animation. When The Iron Giant became a box office bomb, he reconnected with old friend John Lasseter at Pixar in March 2000 and pitched his story idea to him. Bird and Lasseter knew each other from their college years at CalArts in the 1970s. Lasseter was sold on the idea and convinced Bird to come to Pixar, where the film would be done in computer animation. The studio announced a multi-film contract with Bird on May 4, 2000. The Incredibles was written and directed solely by Brad Bird, a departure from previous Pixar productions which typically had two or three directors and as many screenwriters with a history of working for the company. In addition, it would be the company's first film in which all characters are human.</p><blockquote>The dad is always expected in the family to be strong, so I made him strong. The moms are always pulled in a million different directions, so I made her stretch like taffy. Teenagers, particularly teenage girls, are insecure and defensive, so I made her turn invisible and turn on shields. And ten-year-old boys are hyperactive energy balls. Babies are unrealized potential.</blockquote><p>– Brad Bird, writer and director of The Incredibles.</p><p>Bird came to Pixar with the lineup of the story's family members worked out: a mom and dad, both suffering through the dad's midlife crisis; a shy teenage girl; a cocky ten-year-old boy; and a baby. Bird had based their powers on family archetypes. During production, Hayao Miyazaki of Studio Ghibli visited Pixar and saw the film's story reels. When Bird asked if the reels made any sense or if they were just \"American nonsense,\" Miyazaki replied, through an interpreter, \"I think it's a very adventurous thing you are trying to do in an American film.\"</p><p>Syndrome was originally written as a minor character who assaults Bob and Helen at the beginning of the movie, only to die in an explosion that destroys the Parrs' house (in this version, the Smiths), but he was made the main antagonist because the filmmakers liked him more than the character of Xerek, who was intended to fulfill that role. The Snug character that Helen talks to at the phone in the final film was intended to fly Helen to Nomanisan Island and to die, but he was removed from that position when Lasseter suggested having Helen pilot the plane herself. Syndrome was based on Brad Bird himself.</p><h4>Casting</h4><p>Holly Hunter, cast as Helen Parr/Elastigirl, never voiced an animated character before and saw the role as an exciting opportunity to expand her repertoire. She was also drawn to the film by its unique and \"unconventional story about family and human dynamics\". Bird considered Hunter \"one of the finest actresses in the world\", capable of playing a \"sensitive\" character who also has \"a very sturdy center\". Spencer Fox was cast as Dash Parr, which was also his feature film debut. Brad Bird wanted to give Dash a realistic out-of-breath voice in certain scenes such as the jungle scene so he made Fox run four laps around the Pixar studio until he got tired. Samuel L. Jackson was cast as Lucius Best/Frozone, Bird cast him because he stated that he wanted the character to have the coolest voice. Lily Tomlin was originally considered for the role of Edna Mode, but later turned it down. After several failed attempts to cast Edna Mode, Bird took on her voice role himself. It was an extension of the Pixar custom of tapping in-house staff whose voices came across particularly well on scratch dialogue tracks. Sarah Vowell was offered the role of Violet unexpectedly; Bird wanted to cast Vowell as Violet after hearing her voice on the National Public Radio program, This American Life. Bird stated that she was \"perfect\" for the part and immediately called her to offer her the role.</p><h4>Animation</h4><p>Upon Pixar's acceptance of the project, Brad Bird was asked to bring in his own team for the production. He brought up a core group of people he worked with on The Iron Giant. Because of this, many 2D artists had to make the shift to 3D, including Bird himself. Bird found working with CGI \"wonderfully malleable\" in a way that traditional animation is not, calling the camera's ability to easily switch angles in a given scene \"marvelously adaptable.\" He found working in computer animation \"difficult\" in a different way than working traditionally, finding the software \"sophisticated and not particularly friendly.\" Bird wrote the script without knowing the limitations or concerns that went hand-in-hand with the medium of computer animation. As a result, this was to be the most complex film yet for Pixar. The film's characters were designed by Tony Fucile and Teddy Newton, whom Bird had brought with him from Warner Bros. Like most computer-animated films, The Incredibles had a year-long period of building the film from the inside out: modeling the exterior and understanding controls that would work the face and the body—the articulation of the character—before animation could even begin. Bird and Fucile tried to emphasize the graphic quality of good 2D animation to the Pixar team, who had only worked primarily in CGI. Bird attempted to incorporate teaching from Disney's Nine Old Men that the crew at Pixar had \"never really emphasized.\"</p><p>For the technical crew members, the film's human characters posed a difficult set of challenges. Bird's story was filled with elements that were difficult to animate with CGI back then. Humans are widely considered to be the most difficult things to execute in animation. Pixar's animators filmed themselves walking to better grasp proper human motion. Creating an all-human cast required creating new technology to animate detailed human anatomy, clothing, and realistic skin and hair. Although the technical team had some experience with hair and cloth in Monsters, Inc. (2001), the amount of hair and cloth required for The Incredibles had never been done by Pixar up until this point. Moreover, Bird would tolerate no compromises for the sake of technical simplicity. Where the technical team on Monsters, Inc. had persuaded director Pete Docter to accept pigtails on Boo to make her hair easier to animate, the character Violet had to have long hair that obscured her face; in fact, this was integral to her character. Violet's long hair, which was extremely difficult to animate, was only successfully animated toward the end of production. In addition, animators had to adapt to having hair both underwater and blowing through the wind. Disney was initially reluctant to make the film because of these issues, thinking that a live-action film would be preferable, but Lasseter denied this.</p><blockquote>The Incredibles was everything that computer-generated animation had trouble doing. It had human characters, it had hair, it had water, it had fire, it had a massive number of sets. The creative heads were excited about the idea of the film, but once I showed story reels of exactly what I wanted, the technical teams turned white. They took one look and thought, “This will take ten years and cost $500 million. How are we possibly going to do this?” So I said, “Give us the black sheep. I want artists who are frustrated. I want the ones who have another way of doing things that nobody's listening to. Give us all the guys who are probably headed out the door.” A lot of them were malcontents because they saw different ways of doing things, but there was little opportunity to try them, since the established way was working very, very well. We gave the black sheep a chance to prove their theories, and we changed the way a number of things are done here. For less money per minute than was spent on the previous film, Finding Nemo, we did a movie that had three times the number of sets and had everything that was hard to do. All this because the heads of Pixar gave us leave to try crazy ideas.</blockquote><p>— Brad Bird speaking to McKinsey Quarterly in 2008</p><p>Not only did The Incredibles cope with the difficulty of animating CGI humans, but also many other complications. The story was bigger than any prior story at the studio, was longer in running time, and had four times the number of locations. Supervising technical director Rick Sayre noted that the hardest thing about the film was that there was \"no hardest thing,\" alluding to the amount of new technical challenges: fire, water, air, smoke, steam, and explosions were all additional to the new difficulty of working with humans. The film's organizational structure could not be mapped out like previous Pixar features, and it became a running joke to the team. Sayre said the team adopted “Alpha Omega,\" where one team was concerned with building modeling, shading, and layout, while another dealt with final camera, lighting, and effects. Another team, dubbed the \"character team,\" digitally sculpted, rigged, and shaded all of the characters, and a simulation team was responsible for developing simulation technology for hair and clothing. There were at least 781 visual effects shots in the film, and they were quite often visual gags, such as the window shattering when Bob angrily shuts the car door. Additionally, the effects team improved their modeling of clouds, using volumetric rendering for the first time.</p><p>The skin of the characters gained a new level of realism from a technology to mimic \"subsurface scattering.\" The challenges did not stop with modeling humans. Bird decided that in a shot near the film's end, baby Jack-Jack would have to undergo a series of transformations, and in one of the five planned he would turn himself into a kind of goo. Technical directors, who anticipated spending two months or even longer to work out the goo effect, stealing precious hours from production that had already entered its final and most critical stages, petitioned the film's producer, John Walker, for help. Bird, who had himself brought Walker over from Warner Bros. to work on the project, was at first immovable, but after arguing with Walker in several invective-laced meetings over the course of two months, Bird finally conceded. Bird also insisted that the storyboards define the blocking of characters' motions, lighting, and camera movements, which had previously been left to other departments rather than storyboarded.</p><p>Bird admitted that he \"had the knees of trembling under the weight\" of The Incredibles, but called the film a \"testament to the talent of the animators at Pixar,\" who were admiring the challenges the film provoked. He recalled, \"Basically, I came into a wonderful studio, frightened a lot of people with how many presents I wanted for Christmas, and then got almost everything I asked for.\"</p><h4>Music</h4><p>The Incredibles is the first Pixar film to be scored by Michael Giacchino. Brad Bird was looking for a specific sound as inspired by the film's retrofuturistic design – the future as seen from the 1960s. John Barry was the first choice to do the film's score, with a trailer of the film given a rerecording of Barry's theme to On Her Majesty's Secret Service. However, Barry did not wish to duplicate the sound of some of his earlier soundtracks; the assignment was instead given to Giacchino. Giacchino noted that recording in the 1960s was largely different from modern day recording and Dan Wallin, the recording engineer, said that Bird wanted an old feel, and as such the score was recorded on analog tapes. Wallin noted that brass instruments, which are at the forefront of the film's score, sound better on analog equipment rather than digital. Wallin came from an era in which music was recorded, according to Giacchino, \"the right way,\" which consists of everyone in the same room, \"playing against each other and feeding off each other's energy.\" Many of Giacchino's future soundtracks followed suit with this style of mixing. Tim Simonec was the conductor/orchestrator for the score's recording.</p><p>The film's orchestral score was released on November 2, 2004, by Walt Disney Records, three days before the film opened in theaters. It won numerous awards for best score including Los Angeles Film Critics Association Award, BMI Film & TV Award, ASCAP Film and Television Music Award, Annie Award, Las Vegas Film Critics Society Award and Online Film Critics Society Award and was nominated for Grammy Award for Best Score Soundtrack for Visual Media, Satellite Award and Broadcast Film Critics Association Award.</p><br/><h3>Themes</h3><p>Several film reviewers drew precise parallels between the film and certain superhero comic books, like Powers, Watchmen, Fantastic Four, Justice League and The Avengers. The producers of the 2005 adaptation of Fantastic Four were forced to make significant script changes and add more special effects because of similarities to The Incredibles. Bird was not surprised that comparisons arose due to superheroes being \"the most well-trod turf on the planet,\" but noted that he had not been inspired by any comic books specifically, only having heard of Watchmen. He did comment that it was nice to be compared to it, since \"if you're going to be compared to something, it's nice if it's something good\".</p><p>Some commentators took Bob's frustration with celebrating mediocrity and Syndrome's comment that \"when everyone's super, no one will be\" as a reflection of views shared by German philosopher Friedrich Nietzsche or an extension of Russian-American novelist Ayn Rand's Objectivism philosophy, which Bird felt was \"ridiculous.\" He stated that a large portion of the audience understood the message as he intended whereas \"two percent thought I was doing The Fountainhead or Atlas Shrugged.\" Some purported that The Incredibles exhibited a right-wing bias, which Bird also scoffed at. \"I think that's as silly of an analysis as saying The Iron Giant was left-wing. I'm definitely a centrist and feel like both parties can be absurd.\"</p><p>The film also explored Bird's dislike for the tendency of the children's comics and Saturday morning cartoons of his youth to portray villains as unrealistic, ineffectual, and non-threatening. In the film, Dash and Violet have to deal with villains who are perfectly willing to use deadly force against children. On another level, both Dash and Violet display no emotion or regret at the deaths of those who are trying to kill them, such as when Dash outruns pursuers who crash their vehicles while chasing him, or when both of them witness their parents destroy several attacking vehicles with people inside, in such a manner that the deaths of those piloting them is undeniable. Despite disagreeing with some analysis, Bird felt it gratifying for his work to be considered on many different levels, which was his intention: \"The fact that it was written about in the op/ed section of The New York Times several times was really gratifying to me. Look, it's a mainstream animated movie, and how often are those considered thought provoking?\"</p><br/><h3>Release</h3><h4>Marketing</h4><p>A teaser trailer of The Incredibles premiered on May 30, 2003, and was attached to the screenings of Finding Nemo. Several companies released promotional products related to the film. In the weeks before the film's opening, there were also promotional tie-ins with SBC Communications (using Dash to promote the \"blazing-fast speed\" of its SBC Yahoo! DSL service) Tide, Downy, Bounce and McDonald's. Dark Horse Comics released a limited series of comic books based on the film. Toy maker Hasbro produced a series of action figures and toys based on the film. Kellogg's released an Incredibles-themed cereal, as well as promotional Pop-Tarts and fruit snacks, all proclaiming an \"Incrediberry Blast\" of flavor. Pringles included potato chips featuring the superheroes and quotes from the film. In July 2008, it was announced that a series of comic books based on the film would be published by BOOM! Studios in collaboration with Disney Publishing by the end of the year. The first miniseries by BOOM! was The Incredibles: Family Matters by Mark Waid and Marcio Takara, which was published from March to June 2009 and collected into a trade paperback published in July of that year.</p><h4>Theatrical</h4><p>The Incredibles was released theatrically in the United States on November 5, 2004. In theaters, The Incredibles was accompanied by a short film, Boundin' (2003). The theatrical release also included a sneak peek for Star Wars: Episode III – Revenge of the Sith. While Pixar celebrated another triumph with The Incredibles, Steve Jobs was embroiled in a public feud with the head of its distribution partner, The Walt Disney Company. This would eventually lead to the ousting of Michael Eisner and Disney's acquisition of Pixar the following year. In March 2014, Disney CEO and chairman Bob Iger announced that the film would be reformatted and re-released in 3D. The Incredibles was re-released and digitally re-mastered for IMAX theaters (alongside its sequel, Incredibles 2) using their DMR Technology in a double feature on June 14, 2018.</p><h4>Home media</h4><p>The film was first released on both VHS and a two-disc collector's edition DVD set on March 15, 2005. The DVD set was THX certified, consisted of widescreen and a pan and scan fullscreen versions and included two newly commissioned Pixar short films, Jack-Jack Attack and Mr. Incredible and Pals, which were made specifically for this home-video release, and Boundin', a Pixar short film that premiered alongside the feature film in its original theatrical release. The VHS release only featured the short, Boundin'. It was the highest-selling DVD of 2005, with 17.38 million copies sold. The film was also released on UMD for the Sony PSP. Disney released the film on Blu-ray in North America on April 12, 2011, and on 4K UHD Blu-ray on June 5, 2018; this marks Disney's first 4K Blu-ray reissue on the format.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The Incredibles earned $261.4 million in the United States and Canada and $370.1 million in other territories, for a worldwide total of $631.6 million. It was the fourth-highest-grossing film of 2004, behind Shrek 2, Harry Potter and the Prisoner of Azkaban and Spider-Man 2.</p><p>The Incredibles was released with Alfie on November 5, 2004. It debuted earning $70.7 million from 3,933 theaters. This made it the second-highest opening weekend for an animated film, trailing only behind Shrek 2. The film opened in the number #1 spot at the box office, dominating Saw, The Grudge, Shark Tale, Ray, Ladder 49 and other films. Despite its opening, the overall Hollywood revenues fell, continuing a box office slump that had lingered for most of the fall season. The top 12 movies took in $136.1 million down to 5% from the same weekend the previous year, just after the openings of The Matrix Revolutions and Elf. For 15 years, The Incredibles had the biggest November opening weekend for an animated film until it was dethroned by Frozen II in 2019. It continued to rule the box office while staying ahead of The Polar Express. Its second weekend earnings dropped by 28% to $51 million, and followed by another $26 million the third weekend. The Incredibles completed its theatrical run in the United States and Canada on April 14, 2005.</p><h4>Critical response</h4><p>On review aggregator website Rotten Tomatoes, The Incredibles holds an approval rating of 97% based on 248 reviews, with an average rating of 8.4/10. The website's critical consensus reads, \"Bringing loads of wit and tons of fun to the animated superhero genre, The Incredibles easily lives up to its name.\" Another review aggregator, Metacritic, which assigns a weighted average score to reviews from mainstream critics, gave The Incredibles an average score of 90 out of 100 based on 41 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale, making it Pixar's fourth film to receive this grade (after Toy Story 2, Monsters, Inc., and Finding Nemo).</p><p>Roger Ebert of the Chicago Sun-Times gave the film three-and-a-half out of four, writing that the film \"alternates breakneck action with satire of suburban sitcom life\" and is \"another example of Pixar's mastery of popular animation.\" Peter Travers of Rolling Stone also gave the film three-and-a-half, calling it \"one of the year's best\" and saying that it \"doesn't ring cartoonish, it rings true.\" Giving the film three-and-a-half as well, People magazine found that The Incredibles \"boasts a strong, entertaining story and a truckload of savvy comic touches.\"</p><p>Eleanor Ringel Gillespie of The Atlanta Journal-Constitution was bored by the film's \"recurring pastiches of earlier action films\", concluding that \"the Pixar whizzes do what they do excellently; you just wish they were doing something else.\" Jessica Winter of The Village Voice criticized the film for \"playing as a standard summer action film\", despite being released in early November. Her review, titled as \"Full Metal Racket,\" noted that The Incredibles \"announces the studio's arrival in the vast yet overcrowded Hollywood lot of eardrum-bashing, metal-crunching action sludge.\"</p><p>The Incredibles was included on a number of best-of lists. It appeared on professional rankings from The Guardian based on retrospective appraisal, as one of the greatest films of the twenty-first century. Travers also named it as number 6 on his list of the decade's best films. Several publications have listed it as one of the best animated films, including: Entertainment Weekly (2009), IGN (2010), Insider, USA Today, Elle (all 2018), Rolling Stone (2019), Parade, Complex, Time Out New York, and Empire (all 2021). The Incredibles appeared on several lists of the best superhero films, by outlets including: Time (2011), Paste, Vulture, Marie Claire (all 2019), IGN (2020), Esquire, The Indian Express, and Parade (all 2021). In December 2021, the film's screenplay was listed number 48 on the Writers Guild of America's \"101 Greatest Screenplays of the 21st Century (So Far)\". Others have named it one of the best conservative films, best action films, and best political films.</p><h4>Accolades</h4><p>The Incredibles led the 77th Academy Awards season with four nominations (including Best Original Screenplay and Sound Mixing). It received two Oscars: Best Animated Feature and Sound Editing. Joe Morgenstern of The Wall Street Journal called The Incredibles the year's best picture. Premiere magazine released a cross-section of all the top critics in America and The Incredibles placed at number three, whereas review aggregation website Rotten Tomatoes cross-referenced reviews that suggested it was its year's highest-rated film.</p><p>The film also received the 2004 Annie Award for Best Animated Feature and the 2005 Hugo Award for Best Dramatic Presentation, Long Form, and it was nominated for the 2004 Golden Globe Award for Best Motion Picture – Musical or Comedy. It also won the Saturn Award for Best Animated Film. The American Film Institute included it as one of the top 10 films of 2004.</p><p>It was included on Empire's 500 Greatest Films of All Time at number 400.</p><br/><h3>Video games</h3><p>It has received several game adaptations: The Incredibles (2004), The Incredibles: When Danger Calls (2004), and The Incredibles: Rise of the Underminer (2005). Kinect Rush: A Disney–Pixar Adventure (2012) features characters and worlds from five Pixar films, including The Incredibles. Disney Infinity (2013) includes The Incredibles playset featuring the film's playable characters. Lego The Incredibles was released in June 2018.</p><br/><h3>Sequel</h3><p>A sequel, titled Incredibles 2, was released on June 15, 2018 and was once again a critical and commercial success.</p><br/>"
  },
  "errorMessage": ""
}