{
  "imDbId": "tt0073486",
  "title": "One Flew Over the Cuckoo's Nest",
  "fullTitle": "One Flew Over the Cuckoo's Nest (1975)",
  "type": "Movie",
  "year": "1975",
  "language": "en",
  "titleInLanguage": "One Flew Over the Cuckoo's Nest (film)",
  "url": "https://en.wikipedia.org/wiki/One_Flew_Over_the_Cuckoo%27s_Nest_(film)",
  "plotShort": {
    "plainText": "One Flew Over the Cuckoo's Nest is a 1975 American psychological drama film directed by Miloš Forman, based on the 1962 novel of the same name by Ken Kesey. The film stars Jack Nicholson who plays a new patient at a mental institution alongside Louise Fletcher who plays an austere nurse. It also features a supporting cast of Will Sampson, Danny DeVito, Sydney Lassick, William Redfield, as well as Christopher Lloyd and Brad Dourif in their film debuts.\r\nFilming began in January 1975 and lasted three months, taking place on location in Salem, Oregon, and the surrounding area, as well as Depoe Bay on the north Oregon coast. The producers decided to shoot the film in the Oregon State Hospital, an actual mental hospital, as this was also the setting of the novel. The hospital is still in operation (as of 2022), though the original buildings seen in the film have been demolished. The film was released on November 19, 1975. Considered by many to be one of the greatest films ever made, One Flew Over the Cuckoo's Nest is No. 33 on the American Film Institute's 100 Years... 100 Movies list.\r\nThe film was the second to win all five major Academy Awards (Best Picture, Actor in Lead Role, Actress in Lead Role, Director, and Screenplay) following It Happened One Night in 1934, an accomplishment not repeated until 1991 with The Silence of the Lambs. It also won numerous Golden Globe and BAFTA Awards. In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress, and selected for preservation in the National Film Registry.",
    "html": "<p>One Flew Over the Cuckoo's Nest is a 1975 American psychological drama film directed by Miloš Forman, based on the 1962 novel of the same name by Ken Kesey. The film stars Jack Nicholson who plays a new patient at a mental institution alongside Louise Fletcher who plays an austere nurse. It also features a supporting cast of Will Sampson, Danny DeVito, Sydney Lassick, William Redfield, as well as Christopher Lloyd and Brad Dourif in their film debuts.</p><p>Filming began in January 1975 and lasted three months, taking place on location in Salem, Oregon, and the surrounding area, as well as Depoe Bay on the north Oregon coast. The producers decided to shoot the film in the Oregon State Hospital, an actual mental hospital, as this was also the setting of the novel. The hospital is still in operation (as of 2022), though the original buildings seen in the film have been demolished. The film was released on November 19, 1975. Considered by many to be one of the greatest films ever made, One Flew Over the Cuckoo's Nest is No. 33 on the American Film Institute's 100 Years... 100 Movies list.</p><p>The film was the second to win all five major Academy Awards (Best Picture, Actor in Lead Role, Actress in Lead Role, Director, and Screenplay) following It Happened One Night in 1934, an accomplishment not repeated until 1991 with The Silence of the Lambs. It also won numerous Golden Globe and BAFTA Awards. In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress, and selected for preservation in the National Film Registry.</p>"
  },
  "plotFull": {
    "plainText": "One Flew Over the Cuckoo's Nest is a 1975 American psychological drama film directed by Miloš Forman, based on the 1962 novel of the same name by Ken Kesey. The film stars Jack Nicholson who plays a new patient at a mental institution alongside Louise Fletcher who plays an austere nurse. It also features a supporting cast of Will Sampson, Danny DeVito, Sydney Lassick, William Redfield, as well as Christopher Lloyd and Brad Dourif in their film debuts.\r\nFilming began in January 1975 and lasted three months, taking place on location in Salem, Oregon, and the surrounding area, as well as Depoe Bay on the north Oregon coast. The producers decided to shoot the film in the Oregon State Hospital, an actual mental hospital, as this was also the setting of the novel. The hospital is still in operation (as of 2022), though the original buildings seen in the film have been demolished. The film was released on November 19, 1975. Considered by many to be one of the greatest films ever made, One Flew Over the Cuckoo's Nest is No. 33 on the American Film Institute's 100 Years... 100 Movies list.\r\nThe film was the second to win all five major Academy Awards (Best Picture, Actor in Lead Role, Actress in Lead Role, Director, and Screenplay) following It Happened One Night in 1934, an accomplishment not repeated until 1991 with The Silence of the Lambs. It also won numerous Golden Globe and BAFTA Awards. In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress, and selected for preservation in the National Film Registry.\r\nPlot\r\nIn the autumn of 1963, Randle McMurphy is on an Oregon work farm for the statutory rape of a 15-year-old girl. He pretends to be insane in order to get himself transferred to a mental institution and avoid hard labor. The ward is dominated by head nurse Mildred Ratched, a cold, passive-aggressive tyrant who intimidates her patients.\r\nThe other patients include young, anxious, stuttering Billy Bibbit; Charlie Cheswick, who is prone to temper tantrums; delusional, child-like Martini; the articulate, repressed homosexual Dale Harding; belligerent and profane Max Taber; epileptics Jim Sefelt and Bruce Fredrickson; quiet but violent-minded Scanlon; tall, deaf-mute Native American \"Chief\" Bromden; and several others with chronic conditions.\r\nRatched sees McMurphy's lively, rebellious presence as a threat to her authority, which she responds to by confiscating and rationing the patients' cigarettes and suspending their card-playing privileges. McMurphy finds himself in a battle of wills against Ratched. He steals a school bus, escaping with several patients to go fishing on the Pacific Coast and encouraging them to discover their own abilities and find self-confidence.\r\nAfter an orderly tells him that his prison sentence no longer applies to him since he has been committed, McMurphy makes plans to escape with Chief. He also learns that he, Chief, and Taber are the only non-chronic patients who have been involuntarily committed; the others have committed themselves and may leave at any time, but are too afraid to do so. After Cheswick bursts into a fit and demands his cigarettes from Ratched, McMurphy starts a fight with the orderlies and Chief intervenes to help him.\r\nMcMurphy, Chief, and Cheswick are sent to the Disturbed ward after the fight, and Chief inadvertently reveals to McMurphy that he can speak and hear normally. He has feigned deaf-muteness to avoid engaging with anyone, remembering the way in which alcoholism destroyed his father's life. After being subjected to electroconvulsive therapy, McMurphy returns to the ward pretending to be brain-damaged, but then reveals that the treatment has made him even more determined to defeat Ratched. McMurphy and Chief make plans to escape, but decide to throw a secret Christmas party for their friends after Ratched and the orderlies leave for the night.\r\nMcMurphy sneaks two prostitutes, Candy and Rose, and bottles of alcohol into the ward and bribes night orderly Turkle to allow the party. Afterward, McMurphy and Chief prepare to escape, inviting Billy to come with them. Billy refuses, but asks for a \"date\" with Candy; McMurphy arranges for him to have sex with her. McMurphy and the others get drunk, and McMurphy falls asleep instead of making his escape with Chief.\r\nRatched arrives in the morning to find the ward in disarray and most of the patients passed out. She discovers Billy and Candy together, and aims to embarrass Billy in front of everyone. Billy manages to overcome his stutter and stands up to Ratched. When she threatens to tell his mother, Billy cracks under the pressure and reverts to stuttering. Ratched has him placed in the doctor's office. Moments later, McMurphy punches an orderly when trying to escape out of a window with the Chief, causing the other orderlies to intervene. Meanwhile, Billy commits suicide by slitting his throat with broken glass. Ratched tries to ease the situation by calling for the day's routine to continue as usual, and an enraged McMurphy strangles Ratched. The orderlies subdue McMurphy, saving Ratched's life.\r\nSome time later, Ratched is wearing a neck brace and speaking with a weak voice, and Harding now leads the now-unsuspended card-playing. McMurphy is nowhere to be found, leading to rumors that he has escaped. Later that night, Chief sees McMurphy being returned to his bed. Chief greets him, elated that McMurphy had kept his promise not to escape without him, but discovers that McMurphy has been lobotomized. After tearfully hugging McMurphy, Chief smothers him to death with a pillow. He then tears a hydrotherapy console free of its floor mountings, throws it through a window, and escapes as the other inmates awaken and cheer for him.\r\nCast\r\nJack Nicholson as Randle Patrick \"R.P.\" McMurphy\r\nLouise Fletcher as Nurse Mildred Ratched\r\nWill Sampson as \"Chief\" Bromden\r\nWilliam Redfield as Dale Harding\r\nBrad Dourif as Billy Bibbit\r\nSydney Lassick as Charlie Cheswick\r\nChristopher Lloyd as Max Taber\r\nDanny DeVito as Martini\r\nDean Brooks as Dr. John Spivey\r\nWilliam Duell as Jim Sefelt\r\nVincent Schiavelli as Bruce Frederickson\r\nMichael Berryman as Ellis\r\nAlonzo Brown as Attendant Miller\r\nMwako Cumbaka as Attendant Warren\r\nNathan George as Attendant Washington\r\nMarya Small as Candy\r\nScatman Crothers as Night Guard Turkle\r\nPhil Roth as Woolsey\r\nLouisa Moritz as Rose\r\nPeter Brocco as Col. Matterson\r\nDelos V. Smith Jr. as Scanlon\r\nJosip Elic as Bancini\r\nMimi Sarkisian as Nurse Pilbow\r\nTed Markland as Hap Arlich\r\nMary Costa as Mrs. Johnson\r\nProduction\r\nThe title comes from a nursery rhyme read to Chief Bromden as a child by his grandmother, mentioned in the book:\r\nVintery, mintery, cutery, corn, Apple seed and apple thorn, Wire, briar, limber lock Three geese in a flock One flew East One flew West And one flew over the cuckoo's nest.\r\nActor Kirk Douglas—who had originated the role of McMurphy in the 1963–64 Broadway stage version of the Ken Kesey novel—had purchased the film rights to the story, and tried for a decade to bring it to the big screen, but was unable to find a studio willing to make it with him. Eventually, he sold the rights to his son Michael Douglas, who succeeded in getting the film produced—but the elder Douglas, by then nearly 60, was considered too old for the McMurphy role, Gene Hackman, James Caan, Marlon Brando, and Burt Reynolds were also considered, but all four turned down the role, which ultimately went to 37-year-old Jack Nicholson. Douglas brought in Saul Zaentz as co-producer.\r\nThe film's first screenwriter, Lawrence Hauben, introduced Douglas to the work of Miloš Forman, whose 1967 Czechoslovak film The Firemen's Ball had certain qualities that mirrored the goals of the present script. Forman flew to California and discussed the script page by page, outlining what he would do, in contrast with other directors who had been approached who were less than forthcoming. Forman wrote in 2012: \"To me, was not just literature, but real life, the life I lived in Czechoslovakia from my birth in 1932 until 1968. The Communist Party was my Nurse Ratched, telling me what I could and could not do; what I was or was not allowed to say; where I was and was not allowed to go; even who I was and was not\".\r\nZaentz, a voracious reader, felt an affinity with Kesey, and so after Hauben's first attempt he asked Kesey to write the screenplay. Kesey participated in the early stages of script development, but withdrew after creative differences with the producers over casting and narrative point of view; ultimately he filed suit against the production and won a settlement.\r\nHal Ashby, who had been an early consideration for director, suggested Jack Nicholson for the role of McMurphy. Nicholson had never played this type of role before. Production was delayed for about six months because of Nicholson's schedule. Douglas later stated in an interview that \"that turned out to be a great blessing: it gave us the chance to get the ensemble right\".\r\nCasting\r\nDanny DeVito was the first to be cast, reprising his role as the patient Martini from the 1971 off-Broadway production. Chief Bromden (who turns out to be the title character), played by Will Sampson, was found through the referral of Mel Lambert (who portrayed the harbormaster in the fishing scene), a used car dealer Douglas met on an airplane flight when Douglas told him they wanted a \"big guy\" to play the part. Lambert's father often sold cars to Native American customers and six months later called Douglas to say: \"the biggest sonofabitch Indian came in the other day!\"\r\nBud Cort was considered for the role of Billy Bibbit.\r\nMiloš Forman had considered Shelley Duvall for the role of Candy; coincidentally, she, Nicholson, and Scatman Crothers (who portrays Turkle) would all later appear as part of the main cast of the 1980 film adaptation of The Shining. While screening Thieves Like Us (1974) to see if she was right for the role, he became interested in Louise Fletcher, who had a supporting role, for the role of Nurse Ratched. A mutual acquaintance, the casting director Fred Roos, had already mentioned Fletcher's name as a possibility. Even so, it took four or five meetings, over a year, (during which the role was offered to other actresses such as Jeanne Moreau, Colleen Dewhurst, Ellen Burstyn, Angela Lansbury, Anne Bancroft, and Geraldine Page) for Fletcher to secure the role of Nurse Ratched. Her final audition was late in 1974, with Forman, Zaentz, and Douglas. The day after Christmas, her agent called to say she was expected at the Oregon State Hospital in Salem on January 4 to begin rehearsals.\r\nIn 2016, Fletcher recalled that Nicholson's salary was \"enormous\", while the rest of the cast worked at or close to scale. She put in 11 weeks, earning $10,000 before taxes.\r\nRehearsals\r\nPrior to commencement of filming, a week of rehearsals started on January 4, 1975, in Oregon, during which the actors watched the patients in their daily routine and at group therapy. Jack Nicholson and Louise Fletcher also witnessed electroconvulsive therapy being performed on a patient.\r\nFilming\r\nFilming began in January 1975, and concluded approximately three months later, and was shot on location in Salem, Oregon, and the surrounding area, as well as the coastal town of Depoe Bay, Oregon.\r\nThe producers decided to shoot the film in the Oregon State Hospital, an actual mental hospital, as this was also the setting of the novel. The hospital's director, Dean Brooks, was supportive of the filming and eventually ended up playing the character of Dr. John Spivey in the film. Brooks identified a patient for each of the actors to shadow, and some of the cast even slept on the wards at night. He also wanted to incorporate his patients into the crew, to which the producers agreed. Douglas recalls that it was not until later that he found out that many of them were criminally insane.\r\nAs Forman did not allow the actors to see the day's filming, this led to the cast losing confidence in him, while Nicholson also began to wonder about his performance. Douglas convinced Forman to show Nicholson something, which he did, and restored the actor's confidence.\r\nHaskell Wexler was fired as cinematographer and replaced by Bill Butler. Wexler believed his dismissal was due to his concurrent work on the documentary Underground, in which the radical militant group the Weather Underground were being interviewed while hiding from the law. However, Forman said he had terminated Wexler's services over artistic differences. Both Wexler and Butler received Academy Award nominations for Best Cinematography for One Flew Over the Cuckoo's Nest, though Wexler said there was \"only about a minute or two minutes in that film I didn't shoot\".\r\nAccording to Butler, Nicholson refused to speak to Forman: \"... never talked to Miloš at all, he only talked to me\".\r\nThe production went over the initial budget of $2 million and over-schedule, but Zaentz, who was personally financing the movie, was able to come up with the difference by borrowing against his company, Fantasy Records. The total production budget came to $4.4 million.\r\nRelease\r\nThe film premiered at the Sutton and Paramount Theatres in New York City on November 19, 1975. It was the second-highest-grossing film released in 1975 in the United States and Canada with a gross of $109 million, one of the seventh-highest-grossing films of all time at the time. As it was released toward the end of the year, most of its gross was in 1976 and was the highest-grosser for calendar year 1976 with rentals of $56.5 million.\r\nWorldwide, One Flew Over the Cuckoo's Nest grossed $163,250,000. The picture was the highest-grossing film released by UA up to that time.\r\nReception\r\nCritics praised the film, sometimes with reservations. Roger Ebert said:\r\nMiloš Forman's One Flew Over the Cuckoo's Nest is a film so good in so many of its parts that there's a temptation to forgive it when it goes wrong. But it does go wrong, insisting on making larger points than its story really should carry, so that at the end, the human qualities of the characters get lost in the significance of it all. And yet, there are those moments of brilliance.\r\nEbert later put the film on his \"Great Movies\" list. A.D. Murphy of Variety wrote a mixed review as well, as did Vincent Canby in The New York Times:\r\nA comedy that can't quite support its tragic conclusion, which is too schematic to be honestly moving, but it is acted with such a sense of life that one responds to its demonstration of humanity if not to its programmed metaphors.\r\nThe film opened and closed with original music by composer Jack Nitzsche, featuring an eerie bowed saw (performed by Robert Armstrong) and wine glasses. On the score, reviewer Steven McDonald:\r\nThe edgy nature of the film extends into the score, giving it a profoundly disturbing feel at times–even when it appears to be relatively normal. The music has a tendency to always be a little off-kilter, and from time to time, it tilts completely over into a strange little world of its own ...\r\nThe film won the \"Big Five\" Academy Awards at the 48th Oscar ceremony. These include the Best Actor for Jack Nicholson, Best Actress for Louise Fletcher, Best Direction for Forman, Best Picture, and Best Adapted Screenplay for Lawrence Hauben and Bo Goldman. The film has a 93% \"Certified Fresh\" rating at Rotten Tomatoes based on reviews from 115 critics, with an average rating of 9/10. The website's critics consensus reads: \"Jack Nicholson and Louise Fletcher are worthy adversaries in One Flew Over the Cuckoo’s Nest, with Miloš Forman’s more grounded and morally ambiguous approach to Ken Kesey’s surrealistic novel yielding a film of outsized power.\"\r\nKesey himself claimed never to have seen the movie, but said he disliked what he knew of it, a fact confirmed by Chuck Palahniuk, who wrote: \"The first time I heard this story, it was through the movie starring Jack Nicholson. A movie that Kesey once told me he disliked.\"\r\nIn 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in their National Film Registry.\r\nThe Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.\r\nPopular culture\r\nPantera singer Phil Anselmo released a music video called Choosing Mental Illness with his band Philip H. Anselmo & The Illegals. It pays tribute to the film One Flew Over the Cuckoo's Nest. The music video shows scenes recreated from the film with Anselmo playing McMurphy and the rest of the band playing other characters from the film, and Nurse Ratched played by actor Michael St. Michaels.\r\nAwards and nominations\r\nIn 2015, the film ranked 59th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world.\r\nAmerican Film Institute\r\nAFI's 100 Years... 100 Movies – #20\r\nAFI's 100 Years... 100 Heroes and Villains: Nurse Ratched – #5 Villain R.P. McMurphy - Nominated Hero\r\nNurse Ratched – #5 Villain\r\nR.P. McMurphy - Nominated Hero\r\nAFI's 100 Years... 100 Cheers – #17\r\nAFI's 100 Years... 100 Movies (10th Anniversary Edition) – #33",
    "html": "<p>One Flew Over the Cuckoo's Nest is a 1975 American psychological drama film directed by Miloš Forman, based on the 1962 novel of the same name by Ken Kesey. The film stars Jack Nicholson who plays a new patient at a mental institution alongside Louise Fletcher who plays an austere nurse. It also features a supporting cast of Will Sampson, Danny DeVito, Sydney Lassick, William Redfield, as well as Christopher Lloyd and Brad Dourif in their film debuts.</p><p>Filming began in January 1975 and lasted three months, taking place on location in Salem, Oregon, and the surrounding area, as well as Depoe Bay on the north Oregon coast. The producers decided to shoot the film in the Oregon State Hospital, an actual mental hospital, as this was also the setting of the novel. The hospital is still in operation (as of 2022), though the original buildings seen in the film have been demolished. The film was released on November 19, 1975. Considered by many to be one of the greatest films ever made, One Flew Over the Cuckoo's Nest is No. 33 on the American Film Institute's 100 Years... 100 Movies list.</p><p>The film was the second to win all five major Academy Awards (Best Picture, Actor in Lead Role, Actress in Lead Role, Director, and Screenplay) following It Happened One Night in 1934, an accomplishment not repeated until 1991 with The Silence of the Lambs. It also won numerous Golden Globe and BAFTA Awards. In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress, and selected for preservation in the National Film Registry.</p><br/><h3>Plot</h3><p>In the autumn of 1963, Randle McMurphy is on an Oregon work farm for the statutory rape of a 15-year-old girl. He pretends to be insane in order to get himself transferred to a mental institution and avoid hard labor. The ward is dominated by head nurse Mildred Ratched, a cold, passive-aggressive tyrant who intimidates her patients.</p><p>The other patients include young, anxious, stuttering Billy Bibbit; Charlie Cheswick, who is prone to temper tantrums; delusional, child-like Martini; the articulate, repressed homosexual Dale Harding; belligerent and profane Max Taber; epileptics Jim Sefelt and Bruce Fredrickson; quiet but violent-minded Scanlon; tall, deaf-mute Native American \"Chief\" Bromden; and several others with chronic conditions.</p><p>Ratched sees McMurphy's lively, rebellious presence as a threat to her authority, which she responds to by confiscating and rationing the patients' cigarettes and suspending their card-playing privileges. McMurphy finds himself in a battle of wills against Ratched. He steals a school bus, escaping with several patients to go fishing on the Pacific Coast and encouraging them to discover their own abilities and find self-confidence.</p><p>After an orderly tells him that his prison sentence no longer applies to him since he has been committed, McMurphy makes plans to escape with Chief. He also learns that he, Chief, and Taber are the only non-chronic patients who have been involuntarily committed; the others have committed themselves and may leave at any time, but are too afraid to do so. After Cheswick bursts into a fit and demands his cigarettes from Ratched, McMurphy starts a fight with the orderlies and Chief intervenes to help him.</p><p>McMurphy, Chief, and Cheswick are sent to the Disturbed ward after the fight, and Chief inadvertently reveals to McMurphy that he can speak and hear normally. He has feigned deaf-muteness to avoid engaging with anyone, remembering the way in which alcoholism destroyed his father's life. After being subjected to electroconvulsive therapy, McMurphy returns to the ward pretending to be brain-damaged, but then reveals that the treatment has made him even more determined to defeat Ratched. McMurphy and Chief make plans to escape, but decide to throw a secret Christmas party for their friends after Ratched and the orderlies leave for the night.</p><p>McMurphy sneaks two prostitutes, Candy and Rose, and bottles of alcohol into the ward and bribes night orderly Turkle to allow the party. Afterward, McMurphy and Chief prepare to escape, inviting Billy to come with them. Billy refuses, but asks for a \"date\" with Candy; McMurphy arranges for him to have sex with her. McMurphy and the others get drunk, and McMurphy falls asleep instead of making his escape with Chief.</p><p>Ratched arrives in the morning to find the ward in disarray and most of the patients passed out. She discovers Billy and Candy together, and aims to embarrass Billy in front of everyone. Billy manages to overcome his stutter and stands up to Ratched. When she threatens to tell his mother, Billy cracks under the pressure and reverts to stuttering. Ratched has him placed in the doctor's office. Moments later, McMurphy punches an orderly when trying to escape out of a window with the Chief, causing the other orderlies to intervene. Meanwhile, Billy commits suicide by slitting his throat with broken glass. Ratched tries to ease the situation by calling for the day's routine to continue as usual, and an enraged McMurphy strangles Ratched. The orderlies subdue McMurphy, saving Ratched's life.</p><p>Some time later, Ratched is wearing a neck brace and speaking with a weak voice, and Harding now leads the now-unsuspended card-playing. McMurphy is nowhere to be found, leading to rumors that he has escaped. Later that night, Chief sees McMurphy being returned to his bed. Chief greets him, elated that McMurphy had kept his promise not to escape without him, but discovers that McMurphy has been lobotomized. After tearfully hugging McMurphy, Chief smothers him to death with a pillow. He then tears a hydrotherapy console free of its floor mountings, throws it through a window, and escapes as the other inmates awaken and cheer for him.</p><br/><h3>Cast</h3><ul><li>Jack Nicholson as Randle Patrick \"R.P.\" McMurphy</li><li>Louise Fletcher as Nurse Mildred Ratched</li><li>Will Sampson as \"Chief\" Bromden</li><li>William Redfield as Dale Harding</li><li>Brad Dourif as Billy Bibbit</li><li>Sydney Lassick as Charlie Cheswick</li><li>Christopher Lloyd as Max Taber</li><li>Danny DeVito as Martini</li><li>Dean Brooks as Dr. John Spivey</li><li>William Duell as Jim Sefelt</li><li>Vincent Schiavelli as Bruce Frederickson</li><li>Michael Berryman as Ellis</li><li>Alonzo Brown as Attendant Miller</li><li>Mwako Cumbaka as Attendant Warren</li><li>Nathan George as Attendant Washington</li><li>Marya Small as Candy</li><li>Scatman Crothers as Night Guard Turkle</li><li>Phil Roth as Woolsey</li><li>Louisa Moritz as Rose</li><li>Peter Brocco as Col. Matterson</li><li>Delos V. Smith Jr. as Scanlon</li><li>Josip Elic as Bancini</li><li>Mimi Sarkisian as Nurse Pilbow</li><li>Ted Markland as Hap Arlich</li><li>Mary Costa as Mrs. Johnson</li></ul><br/><h3>Production</h3><p>The title comes from a nursery rhyme read to Chief Bromden as a child by his grandmother, mentioned in the book:</p><blockquote>Vintery, mintery, cutery, corn, Apple seed and apple thorn, Wire, briar, limber lock Three geese in a flock One flew East One flew West And one flew over the cuckoo's nest.</blockquote><p>Actor Kirk Douglas—who had originated the role of McMurphy in the 1963–64 Broadway stage version of the Ken Kesey novel—had purchased the film rights to the story, and tried for a decade to bring it to the big screen, but was unable to find a studio willing to make it with him. Eventually, he sold the rights to his son Michael Douglas, who succeeded in getting the film produced—but the elder Douglas, by then nearly 60, was considered too old for the McMurphy role, Gene Hackman, James Caan, Marlon Brando, and Burt Reynolds were also considered, but all four turned down the role, which ultimately went to 37-year-old Jack Nicholson. Douglas brought in Saul Zaentz as co-producer.</p><p>The film's first screenwriter, Lawrence Hauben, introduced Douglas to the work of Miloš Forman, whose 1967 Czechoslovak film The Firemen's Ball had certain qualities that mirrored the goals of the present script. Forman flew to California and discussed the script page by page, outlining what he would do, in contrast with other directors who had been approached who were less than forthcoming. Forman wrote in 2012: \"To me, was not just literature, but real life, the life I lived in Czechoslovakia from my birth in 1932 until 1968. The Communist Party was my Nurse Ratched, telling me what I could and could not do; what I was or was not allowed to say; where I was and was not allowed to go; even who I was and was not\".</p><p>Zaentz, a voracious reader, felt an affinity with Kesey, and so after Hauben's first attempt he asked Kesey to write the screenplay. Kesey participated in the early stages of script development, but withdrew after creative differences with the producers over casting and narrative point of view; ultimately he filed suit against the production and won a settlement.</p><p>Hal Ashby, who had been an early consideration for director, suggested Jack Nicholson for the role of McMurphy. Nicholson had never played this type of role before. Production was delayed for about six months because of Nicholson's schedule. Douglas later stated in an interview that \"that turned out to be a great blessing: it gave us the chance to get the ensemble right\".</p><h4>Casting</h4><p>Danny DeVito was the first to be cast, reprising his role as the patient Martini from the 1971 off-Broadway production. Chief Bromden (who turns out to be the title character), played by Will Sampson, was found through the referral of Mel Lambert (who portrayed the harbormaster in the fishing scene), a used car dealer Douglas met on an airplane flight when Douglas told him they wanted a \"big guy\" to play the part. Lambert's father often sold cars to Native American customers and six months later called Douglas to say: \"the biggest sonofabitch Indian came in the other day!\"</p><p>Bud Cort was considered for the role of Billy Bibbit.</p><p>Miloš Forman had considered Shelley Duvall for the role of Candy; coincidentally, she, Nicholson, and Scatman Crothers (who portrays Turkle) would all later appear as part of the main cast of the 1980 film adaptation of The Shining. While screening Thieves Like Us (1974) to see if she was right for the role, he became interested in Louise Fletcher, who had a supporting role, for the role of Nurse Ratched. A mutual acquaintance, the casting director Fred Roos, had already mentioned Fletcher's name as a possibility. Even so, it took four or five meetings, over a year, (during which the role was offered to other actresses such as Jeanne Moreau, Colleen Dewhurst, Ellen Burstyn, Angela Lansbury, Anne Bancroft, and Geraldine Page) for Fletcher to secure the role of Nurse Ratched. Her final audition was late in 1974, with Forman, Zaentz, and Douglas. The day after Christmas, her agent called to say she was expected at the Oregon State Hospital in Salem on January 4 to begin rehearsals.</p><p>In 2016, Fletcher recalled that Nicholson's salary was \"enormous\", while the rest of the cast worked at or close to scale. She put in 11 weeks, earning $10,000 before taxes.</p><h4>Rehearsals</h4><p>Prior to commencement of filming, a week of rehearsals started on January 4, 1975, in Oregon, during which the actors watched the patients in their daily routine and at group therapy. Jack Nicholson and Louise Fletcher also witnessed electroconvulsive therapy being performed on a patient.</p><h4>Filming</h4><p>Filming began in January 1975, and concluded approximately three months later, and was shot on location in Salem, Oregon, and the surrounding area, as well as the coastal town of Depoe Bay, Oregon.</p><p>The producers decided to shoot the film in the Oregon State Hospital, an actual mental hospital, as this was also the setting of the novel. The hospital's director, Dean Brooks, was supportive of the filming and eventually ended up playing the character of Dr. John Spivey in the film. Brooks identified a patient for each of the actors to shadow, and some of the cast even slept on the wards at night. He also wanted to incorporate his patients into the crew, to which the producers agreed. Douglas recalls that it was not until later that he found out that many of them were criminally insane.</p><p>As Forman did not allow the actors to see the day's filming, this led to the cast losing confidence in him, while Nicholson also began to wonder about his performance. Douglas convinced Forman to show Nicholson something, which he did, and restored the actor's confidence.</p><p>Haskell Wexler was fired as cinematographer and replaced by Bill Butler. Wexler believed his dismissal was due to his concurrent work on the documentary Underground, in which the radical militant group the Weather Underground were being interviewed while hiding from the law. However, Forman said he had terminated Wexler's services over artistic differences. Both Wexler and Butler received Academy Award nominations for Best Cinematography for One Flew Over the Cuckoo's Nest, though Wexler said there was \"only about a minute or two minutes in that film I didn't shoot\".</p><p>According to Butler, Nicholson refused to speak to Forman: \"... never talked to Miloš at all, he only talked to me\".</p><p>The production went over the initial budget of $2 million and over-schedule, but Zaentz, who was personally financing the movie, was able to come up with the difference by borrowing against his company, Fantasy Records. The total production budget came to $4.4 million.</p><br/><h3>Release</h3><p>The film premiered at the Sutton and Paramount Theatres in New York City on November 19, 1975. It was the second-highest-grossing film released in 1975 in the United States and Canada with a gross of $109 million, one of the seventh-highest-grossing films of all time at the time. As it was released toward the end of the year, most of its gross was in 1976 and was the highest-grosser for calendar year 1976 with rentals of $56.5 million.</p><p>Worldwide, One Flew Over the Cuckoo's Nest grossed $163,250,000. The picture was the highest-grossing film released by UA up to that time.</p><br/><h3>Reception</h3><p>Critics praised the film, sometimes with reservations. Roger Ebert said:</p><blockquote>Miloš Forman's One Flew Over the Cuckoo's Nest is a film so good in so many of its parts that there's a temptation to forgive it when it goes wrong. But it does go wrong, insisting on making larger points than its story really should carry, so that at the end, the human qualities of the characters get lost in the significance of it all. And yet, there are those moments of brilliance.</blockquote><p>Ebert later put the film on his \"Great Movies\" list. A.D. Murphy of Variety wrote a mixed review as well, as did Vincent Canby in The New York Times:</p><blockquote>A comedy that can't quite support its tragic conclusion, which is too schematic to be honestly moving, but it is acted with such a sense of life that one responds to its demonstration of humanity if not to its programmed metaphors.</blockquote><p>The film opened and closed with original music by composer Jack Nitzsche, featuring an eerie bowed saw (performed by Robert Armstrong) and wine glasses. On the score, reviewer Steven McDonald:</p><blockquote>The edgy nature of the film extends into the score, giving it a profoundly disturbing feel at times–even when it appears to be relatively normal. The music has a tendency to always be a little off-kilter, and from time to time, it tilts completely over into a strange little world of its own ...</blockquote><p>The film won the \"Big Five\" Academy Awards at the 48th Oscar ceremony. These include the Best Actor for Jack Nicholson, Best Actress for Louise Fletcher, Best Direction for Forman, Best Picture, and Best Adapted Screenplay for Lawrence Hauben and Bo Goldman. The film has a 93% \"Certified Fresh\" rating at Rotten Tomatoes based on reviews from 115 critics, with an average rating of 9/10. The website's critics consensus reads: \"Jack Nicholson and Louise Fletcher are worthy adversaries in One Flew Over the Cuckoo’s Nest, with Miloš Forman’s more grounded and morally ambiguous approach to Ken Kesey’s surrealistic novel yielding a film of outsized power.\"</p><p>Kesey himself claimed never to have seen the movie, but said he disliked what he knew of it, a fact confirmed by Chuck Palahniuk, who wrote: \"The first time I heard this story, it was through the movie starring Jack Nicholson. A movie that Kesey once told me he disliked.\"</p><p>In 1993, the film was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in their National Film Registry.</p><p>The Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.</p><br/><h3>Popular culture</h3><p>Pantera singer Phil Anselmo released a music video called Choosing Mental Illness with his band Philip H. Anselmo & The Illegals. It pays tribute to the film One Flew Over the Cuckoo's Nest. The music video shows scenes recreated from the film with Anselmo playing McMurphy and the rest of the band playing other characters from the film, and Nurse Ratched played by actor Michael St. Michaels.</p><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"9\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Michael Douglas</span> and <span>Saul Zaentz</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Miloš Forman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Jack Nicholson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td><span>Louise Fletcher</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Brad Dourif</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Adapted from Other Material</span></td><td><span>Lawrence Hauben</span> and <span>Bo Goldman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Haskell Wexler</span> and <span>Bill Butler</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Richard Chew</span>, <span>Lynzee Klingman</span> and <span>Sheldon Kahn</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score</span></td><td><span>Jack Nitzsche</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>Richard Chew, Lynzee Klingman and Sheldon Kahn</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Bodil Awards</span></td><td><span>Best Non-European Film</span></td><td>Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"8\"><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Direction</span></td><td>Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Leading Role</span></td><td>Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td>Louise Fletcher</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td>Brad Dourif</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Lawrence Hauben and Bo Goldman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>Haskell Wexler and Bill Butler</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Richard Chew, Lynzee Klingman and Sheldon Kahn</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Chicago International Film Festival</span></td><td>Best Feature</td><td>Miloš Forman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>César Awards</span></td><td colspan=\"2\"><span>Best Foreign Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>David di Donatello Awards</span></td><td><span>Best Foreign Director</span></td><td>Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Foreign Actor</span></td><td>Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress in a Motion Picture – Drama</span></td><td>Louise Fletcher</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Director – Motion Picture</span></td><td>Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Lawrence Hauben and Bo Goldman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>New Star of the Year – Actor</span></td><td>Brad Dourif</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"3\"><span>Golden Screen Awards</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Grammy Awards</span></td><td><span>Best Album of Best Original Score Written for a Motion Picture or Television Special</span></td><td>Jack Nitzsche</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Kansas City Film Critics Circle Awards</td><td>Best Director</td><td rowspan=\"2\">Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Kinema Junpo Awards</span></td><td>Best Foreign Director</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Los Angeles Film Critics Association Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Nastro d'Argento</span></td><td>Best Foreign Director</td><td>Miloš Forman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td><span>Best Actor</span></td><td>Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td><span>National Society of Film Critics Awards</span></td><td><span>Best Actor</span></td><td rowspan=\"2\">Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>New York Film Critics Circle Awards</span></td><td><span>Best Actor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Louise Fletcher</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>People's Choice Awards</span></td><td colspan=\"2\">Favorite Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Sant Jordi Awards</span></td><td>Best Foreign Actor</td><td>Jack Nicholson <small>(also for <i><span>Carnal Knowledge</span></i> and <i><span>The Passenger</span></i>)</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Drama Adapted from Another Medium</span></td><td>Lawrence Hauben and Bo Goldman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>In 2015, the film ranked 59th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world.</p><p>American Film Institute</p><ul><li>AFI's 100 Years... 100 Movies – #20</li><li>AFI's 100 Years... 100 Heroes and Villains: Nurse Ratched – #5 Villain R.P. McMurphy - Nominated Hero</li><li>Nurse Ratched – #5 Villain</li><li>R.P. McMurphy - Nominated Hero</li><li>AFI's 100 Years... 100 Cheers – #17</li><li>AFI's 100 Years... 100 Movies (10th Anniversary Edition) – #33</li></ul><br/>"
  },
  "errorMessage": ""
}