{
  "imDbId": "tt0198781",
  "title": "Monsters, Inc.",
  "fullTitle": "Monsters, Inc. (2001)",
  "type": "Movie",
  "year": "2001",
  "items": [
    {
      "publisher": "New Times (L.A.)",
      "author": "Robert Wilonsky",
      "link": "http://www.newtimesla.com/",
      "rate": "100",
      "content": "As giddy and antic as any great Warner Bros. cartoon of the 1930s and '40s -- it bears seeing more than once, if only to allow for the sight gags that play second fiddle to the plot, a rarity in animation -- but also resonant and real. In other words, it's the perfect movie."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "90",
      "content": "A terrific piece of work: smart, inventive and executed with state-of-the-art finesse."
    },
    {
      "publisher": "Charlotte Observer",
      "author": "Lawrence Toppman",
      "link": "",
      "rate": "88",
      "content": "It comes from Pixar, the animation studio that scored with the \"Toy Story\" series and \"A Bug's Life,\" and it has more zip and a tad less soul than those predecessors."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Mark Caro",
      "link": "",
      "rate": "88",
      "content": "The climax, featuring what's essentially a suspended roller coaster of closet doors, is as thrilling as it is imaginative."
    },
    {
      "publisher": "Seattle Post-Intelligencer",
      "author": "William Arnold",
      "link": "",
      "rate": "83",
      "content": "Not quite up to the exalted level of the two predecessors (\"Toy Story\" and \"Toy Story 2\"), be assured it's still the most eye-popping and thoroughly entertaining animated film to come down the pike so far this year."
    },
    {
      "publisher": "Film Threat",
      "author": "Michael Dequina",
      "link": "",
      "rate": "80",
      "content": "Confirms that despite all the technical tools at their disposal, one thing counts head and shoulders above razzle-dazzle eye candy (or anything else, for that matter): the story and characters, and Monsters, Inc. introduces worthy additions to the Pixar pantheon."
    },
    {
      "publisher": "New York Daily News",
      "author": "Jack Mathews",
      "link": "",
      "rate": "75",
      "content": "Rarely does an animated character merge as perfectly with the persona of the actor providing his voice as the star of Monsters, Inc. does with John Goodman."
    },
    {
      "publisher": "Portland Oregonian",
      "author": "Shawn Levy",
      "link": "",
      "rate": "67",
      "content": "It's a good movie, mind you, with great bits in it, but it still falls short of rapture."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "60",
      "content": "Though it has its charms, Monsters, Inc. does not measure up. As a childhood entertainment it is certainly fine, but Pixar's celebrated lure for adults is largely absent."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "50",
      "content": "But Monsters, Inc. -- directed by Pixar soldier Pete Docter, not by master digital comic John Lasseter -- turns out to be stingy on context, commentary, and the prism-ing view of pop culture that made the earlier films mint."
    }
  ],
  "errorMessage": ""
}