{
  "imDbId": "tt0198781",
  "title": "Monsters, Inc.",
  "fullTitle": "Monsters, Inc. (2001)",
  "type": "Movie",
  "year": "2001",
  "items": [
    {
      "username": "vchimpanzee",
      "userUrl": "https://www.imdb.com/user/ur2000855",
      "reviewLink": "https://www.imdb.com/review/rw0954846",
      "warningSpoilers": false,
      "date": "31 October 2004",
      "rate": "",
      "helpful": "79 out of 82 found this helpful.",
      "title": "Adorable, funny, perfect voice casting for the lead roles",
      "content": "I thought Billy Crystal and John Goodman were great. I like them anyway, but I can't imagine anyone else in their roles. John Goodman comes across as a warm, fuzzy teddy bear type in so many of his roles, and this time he was actually drawn that way. Crystal and Goodman were great together, even when their characters showed signs of not getting along. And Boo sounded so natural, so childlike. There's no way an adult could have done her lines the way they were executed.And the writing was so intelligent, this movie was not just for kids. There were a lot of clever jokes that kids might not get. Still, the warm and fuzzy qualities of so many of the monsters make this a perfect choice for kids as well as adults, and I really don't get why ABC couldn't give this a TV-G rating. It may have been a little violent or scary at times, but never all that intense. Kids see worse on Saturday morning."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0648075",
      "warningSpoilers": false,
      "date": "12 March 2003",
      "rate": "10",
      "helpful": "129 out of 144 found this helpful.",
      "title": "Does For Monsters What \"Toy Story\" Did For Toys!",
      "content": "Monsters, Inc.We were all, at one time, scared of monsters under the bed. Shadows of clothes in the closet. Weird sounds outside in the trees. I remember thinking there were all kinds of monsters in my room - not as much under my bed as in the closet. And once again, Pixar, who brought us \"Toy Story\" 1 & 2, plays on both adults' memories and children's dreams, making it equally enjoyable for both children and adults.John Goodman voices James P. Sullivan, known as \"Sulley\" to friends. He is a big, blue, hairy monster with horns on his head and hands the size of a watermelon. Billy Crystal is Mike Wazowski, his wisecracking, one-eyed best friend. Both of these monsters live in Monstropolis, a world where monsters roam freely. Their city is powered by a rare source of power - children's screams. That is where Monsters, Incorporated comes in. At Monsters, Inc., monsters like Sulley and Mike open portals into children's rooms - through closet doors - and scare the children, capturing their scream in a little yellow bottle. Sulley is the top-scarer, bringing in the most scares. But Randall (the always enjoyable - even when animated - Steve Buscemi), a wormy, multiple-armed lizard-monster with the ability to change appearances to its surroundings, is jealous of Sulley, and will attempt anything to get more scares...even if it means taking a child from the real world and bringing it into Monstropolis. But after the child escapes, Sulley and Mike reluctantly look after it, all the while trying to get it back to the real world before Mr. Waternoose (the late James Coburn) and others find out about the incident...\"Monsters, Inc.\" does for monsters what \"Toy Story\" did for toys. Pixar once again not only expands our mind, but our very worlds. I respect their company and commitment values very much, as you can read in my \"Toy Story\" review. They stick to the values that made Disney films so family-friendly back in the fifties and sixties: Respect for the audience, respect for quality, and respect for the audience's INTELLIGENCE, something Disney, who has recently coughed up a bunch of lousy, thoughtless sequels, has forgotten. Now, I know that LEGALLY Disney is co-creator of \"Toy Story\" and \"Monsters, Inc.,\" but they really are not. They just give Pixar the money and get their name branded on the front box of the film. And even then, I have heard multiple claims that Disney is very mean-spirited towards Pixar (read into sequel trouble for \"Toy Story 3\") and gives them the bare minimum.But that is straying off the subject. \"Monsters, Inc.\" is one of the most enjoyable animated films I have ever had the pleasure of viewing. I didn't enjoy it as much the first time, but I then bought it, and have since watched it many times. It is an instant classic. I will be watching it years from now, when I am old and frail and in a rocking chair. It ranks right up there with \"Toy Story\" 1 & 2, and all the OLDER Disney films from the 50's-70's. It has all the elements of a sweet, charming, emotional and pleasurably good-natured animated film. And, more coudos to Pixar: Thank you for not packing it full of the language and inappropriate content that Disney shoves into the dark recesses of their films nowadays.Not only has Pixar brought back the \"Family Film\" genre to what it should be, but it also redefines it. Pixar's animated films are some of the most thoughtful, imaginative and enjoyable animated films ever - not to mention 100 % family safe. Thank you, Pixar, for getting back on track.5/5 stars"
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw0648108",
      "warningSpoilers": false,
      "date": "21 January 2004",
      "rate": "10",
      "helpful": "63 out of 72 found this helpful.",
      "title": "Adorable movie with top class entertainment.",
      "content": "The best way to describe this movie in one word is; fun! \"Monsters, Inc.\" is a movie you can easily fall in love with. It has some great fun character, some awesome moments and some well placed comical moments. \"Monsters, Inc.\" is entertainment at its bests.The voice cast is amazing. John Goodman and Billy Crystal form a great leading duo. Steve Buscemi is a great villain and James Coburn has a great voice that fits his character perfectly. John Ratzenberger as always is very entertaining this time in a role as banished Yeti.The story itself is pretty simple but thats what makes it easy to follow and so much fun to watch. The movie not only knows how to entertaining but also knows how and when to emote. The combination of fun and emotional things is perfectly balanced and placed within the movie.There is some great dialog but the true power of \"Monsters, Inc.\" are the wonderful characters. Not is there only a wild variety of strange and weird characters but also some characters that are good for some serious laughs and Boo is simply adorable and a pretty fair representation of a kid in real life. Well done Pixar!Pure entertainment for the entire family!10/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "JohnDeSando",
      "userUrl": "https://www.imdb.com/user/ur1391596",
      "reviewLink": "https://www.imdb.com/review/rw0647805",
      "warningSpoilers": false,
      "date": "25 October 2001",
      "rate": "",
      "helpful": "91 out of 107 found this helpful.",
      "title": "`Monsters, Inc.' is the best animated feature this year and one of the greatest of all time.",
      "content": "You may admire the hair detail on Sully the Yeti's arm, but you will be amazed at the warmth of characterization in `Monsters, Inc.,' surpassing even the great `Shrek' earlier this year. Goodman and Crystal are a comedic team reminiscent of the zaniest Martin and Lewis days. Crystal's Borscht-belt routines brought smiles even to this jaded and admittedly tough-on-comedy critic. I thought Eddie Murphy's donkey in `Shrek' was smart and funny; Crystal's one-eyed monster is even better with its wry and annoying wit.Cleaning the environment of child contamination is a hilarious conceit that turns around the usual fears children have of monsters in closets. It is also a chilling parallel to the challenge of removing anthrax from today's letters. Generally, the allegorical underpinnings of animation are natural for the medium, powerful like the images of the novel `Animal Farm' for political and sociological levels of meaning. For example, the endless-door motif in this film is an ingenious metaphor for the scary and glorious possibilities the present and future hold for kids.Even before you see this feature, Pixar offers the short feature `For the Birds' -- a brilliant takeoff on Hitchcock's memorable film besides being a great commentary on diversity. The expressions around the animated eyes, as the little birds deal with the big bird interloper, are more expressive than those of most contemporary film actors, with the exception of Brando, Pacino, Depp, and Streep.The short trailer for `Star Wars II: Attack of the Clones' may precede the showing as it did ours for an added delight.`Monsters, Inc.' is the best animated feature this year and one of the greatest of all time."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1416189",
      "warningSpoilers": false,
      "date": "10 July 2006",
      "rate": "9",
      "helpful": "65 out of 76 found this helpful.",
      "title": "Nothing To Criticize Here - Very Solid Animated Film",
      "content": "This is a very entertaining animated film. I've seen it twice and enjoyed even more the second time. Billy Crystal said he enjoyed making this film as much as any film he's ever done, so that's a good testimony that you'll get some laughs and enjoy this movie as an adult, too. Kids will love it, I am sure. The \"monsters\" in here are funny-looking and almost lovable, nothing that would scare your kids (or you). Crystal has a bunch of funny lines but overall I found this to be as much if not more of a human interest story than a comedy. There is a lot of sentimentality to it, even overdone a bit at the end, but that's okay. There is absolutely nothing offensive in here, either. The colors look spectacular, too."
    },
    {
      "username": "george.schmidt",
      "userUrl": "https://www.imdb.com/user/ur0937743",
      "reviewLink": "https://www.imdb.com/review/rw0647948",
      "warningSpoilers": false,
      "date": "5 November 2001",
      "rate": "",
      "helpful": "68 out of 82 found this helpful.",
      "title": "An instant classic",
      "content": "MONSTERS, INC. (2001) **** (Voices of: Billy Crystal, John Goodman, James Coburn, Jennifer Tilly, Steve Buscemi, Mary Gibbs, Bonnie Hunt, Bob Peterson, John Ratzenberger, Frank Oz, Steve Susskind, Jeff Pidgeon, Sam \"Penguin\" Black, Daniel R. Gerson. (Dir: Peter Docter/Co-directors: David Silverman, Lee Unkrich)There's something undeniably magical about a Disney movie that brings out your inner child and the streak continues to manifest itself in the latest with its fine track record with upstarts Pixar (the \"Toy Story \" films) in delighting children of all ages in one of the year's funniest (and most fun) films.The childhood phenomena of imagining monsters lurking in one's bedroom closet or under the bed is in actuality a reality that exists solely for the world of the monsters to use all the energy extracted from a child's screams as their natural resource to power their communities and subsist in their parallel universe. Specifically Scream Heat (\"We Scare Because We Care\"), the corporate entity that harnesses the youngsters' reactions to its hard-working crew of creatures including our heroes James P. \"Sulley\" Sullivan (marvelously voiced by Goodman) and his best buddy Mike Wazowski (ditto Crystal). Sulley is a bear-like, blue and purple hairy and horned monster and Mike is a cyclopean lime green M&M clone. The two couldn't be more different yet both share their passion for their vocation and the only thing getting in their way is their rival colleague Randall Boggs (Buscemi, at his oiliest menacing), a reptilian nasty who wants to beat Sulley for the all-time factory record of most points racked up in a single day on the job at any cost. Watching the proceedings is Sulley's father-figure boss Henry J. Waternoose (Coburn) – a cross between a crab and Edward G. Robinson – whose main priority is avoiding any \"rolling blackouts\" (in one of the film's subtle jabs at the current climate in our nation). Mike is in love with cutie pie receptionist Celia (Tilly) who also sports one eye and is afoot taller than him, with a hairdo sporting a Medusa twist (snakes sit atop her head) who wants something from him besides excuses to their frequently put-upon dates together. One day after work Sulley accidentally lets into their world a tiny 4 year old girl – a big no-no – legend has it that one touch is toxic and fatal! – which causes mass havoc wreaked upon the populace as the authorities attempt to corral the tyke while decontaminating the infected workshop's workers (a running gag has the SWAT like DEA agents popping in at a moment's notice whenever a sign of human contact – i.e. a small cotton white sock attached to an unsuspecting monster – makes its ugly presence known!) Mike is in a panicky sweat that they will lose their jobs and tells Sulley he can't hide Boo (the nickname the big guy dubs the adorable tot) and they must return her to her bedroom. Easier said than done when Randall gets wind of the partners abetting the unsuspecting crime and he too has his plans to use Boo for his own selfish endeavors at any cost! The film is a laugh a minute romp and an incredible mix of state-of-the-art computer generated dynamics that truly enhance the candy-colored world of Mike & Sulley with its picture perfect depictions of moveable hair (see how Sulley's locks sway to and fro so naturally! A first for CGI imagery!) and expressiveness given to the one-eyed Mike who works his brow into a real sweat. Never before has voice talent been so perfectly matched and acted to a t than in the comic team of Crystal and Goodman with their characteristics smartly enhanced into their characters with Crystal's liberal use of his \"SNL\" Willy the Masochist (\"Oh I hate when that happens!\") and Goodman's burly, awshucks demeanor fits his soft-hearted meanie like a golden glove. Sulley is the true star of the show with his emotional overload not unlike a kid learning to make a new life transition as he discovers there's more to his existence than meets the eye (same for Mike; pun intended). When he realizes that Boo (by the way, nice job by the producers to use real-life 4 year old Gibbs, in easily the cutest turn by a child performer ever without making an audience gag) is not threatened by his hulking presence. The laughs are largely thanks to Crystal's myopic M&M who is always one-step behind his behemoth buddy and slow on the uptake as the plot proceeds with his sly one-liners, sudden bursts of unrestrained anger and confusion, and slapstick antics leads the film into uncharted territories of hysterical laughter and a great breakneck roller-coaster ride with Mike & Sulley attempting to find Boo's bedroom door with Randall in hot pursuit gives the film a giddy headrush of adrenaline. The film is witty, bright, upbeat and has its shares of incisiveness (I loved the use of HarryHausen's as a local chic eatery that all the monsters are dying to get into; in case of those who don't know Harryhausen, Ray Harryhausen, is the premier stop-motion animator pioneer who gave life to scores of sci-fi creatures including the fabled \"Sinbad\" flicks of the 1960s and 1970s among others) that will undoubtedly have its constituents clamoring for a sequel pronto. Arguably one of the best films and funniest of the year; I loved it and so will you (and your kids if you have any; if not all the more to see it again) An instant classic."
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw0648010",
      "warningSpoilers": false,
      "date": "19 September 2002",
      "rate": "",
      "helpful": "56 out of 68 found this helpful.",
      "title": "Superb animation, a most inventive story, fun for the whole family.",
      "content": "\"Monsters Inc\" came out on DVD this week, and now I have my own copy!! It is not very useful to try to evaluate this one against others since such an evaluation is so subjective. But I put it in the same superb category that such animated films as \"Toy Story\", \"A Bug's Life\", \"Shrek\", and \"Disney's Tarzan\" are in. First, the quality of the animation and the picture quality. Unbelievably good. I can categorically say it is the best picture quality I have seen on DVD, and the movement and facial expressions of the animated characters makes it almost feel like they are real. Second, the story. How inventive! The only thing separating the monster world from the real world are the doors. The company, Monsters Inc, must have millions of them in inventory, computerized for quick call-up to send in a monster to get screams and charge up their energy cells.The main characters are voiced by John Goodman (big, blue, hairy \"kitty\" with purple spots) and Billy Crystal (short, green, one-eyed monster) and their acting add so much. Plus the great music provided by Randy Newman. Overall an hour and a half of pure edge of your seat entertainment. And that doesn't even include the 3+ hours of extras on the second disk. You can select either standard or widescreen format, and I watched mine widescreen on a 16:9 HDTV with 5-channel surround system with powered subwoofer. Almost like being in a theater!!"
    },
    {
      "username": "Spleen",
      "userUrl": "https://www.imdb.com/user/ur0035229",
      "reviewLink": "https://www.imdb.com/review/rw0647808",
      "warningSpoilers": false,
      "date": "2 January 2002",
      "rate": "10",
      "helpful": "64 out of 79 found this helpful.",
      "title": "The best computer animated film of them all, and the most adult",
      "content": "Until now I couldn't bring myself to believe that computer animation was the equal of either stop motion animation or hand-drawn animation. All computer animated films looked a little (usually more than a little) too sterile, many were animated poorly (\"Antz\", \"Shrek\", \"Final Fantasy\"), and even the single unqualified success (\"Toy Story 2\") provided little evidence that a computer animated film COULD reach the heights other kinds of animation could. \"Toy Story 2\" had flawless character animation, but nothing as inspired as the best in \"Tarzan\" (released the same year, although I could have chosen almost any other Disney cartoon to make my point); effective art direction, but nothing to match \"Fantasia\" or \"The Nightmare Before Christmas\". And I thought that \"Toy Story 2\" was as good as the art was ever going to get.I was wrong. This is far better. And what's more, there's no sense whatever that the script (an unusually rich and uninhibited script) is bumping up against the limits of what the medium will allow. It's now been proven that computer animation CAN be just as good as any other kind. Whether it will be allowed to be in future is another question, but for now, I'm hopeful. What we have here is computer animation's first ENTIRELY unalloyed artistic delight, with every character gracefully and characteristically animated, every virtual set just right and pleasing to look at, and an eye-tickling mastery of colour, light and shade that I thought would forever elude CGI artists.It's not fair to judge anything good as \"Monsters, Inc.\" as though it were a children's movie, but I can't resist comparing it with \"Shrek\" - which emphatically IS a children's movie. \"Monsters, inc.\" is admittedly ABOUT children, in a sort of a way. The inhabitants of Monstropolis rely on children's screams for their energy, and the central story is kicked off when one of the monsters accidentally brings a small child (which he calls \"Boo\") into the city. But we never see things from her point of view. We see things from the point of view of the monsters, who are all adults - and who, like most adults, see children as frightening, almost incomprehensible members of another species. And they ARE. To be sure, Wazowski comes to feel strong affection for Boo, but she never becomes more than a humanoid pet (which is not to demean the relationship). This is a story about adults looking at childhood from the outside.\"Shrek\", of course, is a children's movie through and through. Its attention span is short, it has an unthinking mean streak, and children will have a whale of a time watching the central characters (the bigger they are, the more fun it is) act childishly and make poo-poo jokes. \"Monsters, Inc.\" has too much genuine wit, characters too rich, a world with too much depth, and a story at once too coherent and too complicated, to be PRIMARILY a film for children. This is not to say children won't like it. Maybe they will. (Who can say?) Here's the bonus: if they DO like it, it will (unlike \"Shrek\") actually have a beneficial effect. It will make them less frightened of the dark."
    },
    {
      "username": "theinaniloquent",
      "userUrl": "https://www.imdb.com/user/ur27698874",
      "reviewLink": "https://www.imdb.com/review/rw2503499",
      "warningSpoilers": false,
      "date": "15 October 2011",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "\"We scare because we care\"",
      "content": "Monsters generate their city's power by scaring children, but they are terribly afraid themselves of being contaminated by children, so when one enters Monstropolis, top scarer Sulley finds his world disrupted.Monster's Inc explores childhood fear, the fear of looking under your bed or looking at your open closet thinking a monster would pop out. Pixar of course wouldn't make it fearful, but brought lightheartedness to it and made a highly imaginative tale of a fictional world where monsters scare children to power their city. This film is illustrated with creative monsters and styled with classy/jazzy music. The feeling while watching this is amazing and the emotions you feel for the monsters is just magical. Pixar has once again OUTDONE their-selves with every project they have thought of. Monster's Inc is definitely one of the top Pixar movies and also one of the most creative. If you can outlook the childish themes and look deeper into the movie's heart and soul, you will definitely be immersed in Pixar's movie-making magic. Most people would complain about the animation because animated movies have this thing when where one sees one, it's automatically horrible and childish. If one is made by Pixar, I highly recommend you sit down and see what they can do to animations; you will be amazed. 10/10."
    },
    {
      "username": "jamesrupert2014",
      "userUrl": "https://www.imdb.com/user/ur58781741",
      "reviewLink": "https://www.imdb.com/review/rw4569570",
      "warningSpoilers": false,
      "date": "8 January 2019",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Monstrously clever and funny early Pixar CGI feature",
      "content": "Sully and Mike (voiced by John Goodman and Billy Crystal) are employees at Monsters Inc., a scream-fueled plant that provides power to Monsteropolis. Screams are generated by 'scarers' (and Sully is the best), who enter children's bedrooms via the closet and are harvested by their partners (in Sully's case, his best friend Mike). Extreme care must be taken, as children are highly toxic to monsters, so when one is accidently transported to the factory, pandemonium ensues. The film is the fourth of Pixar's full length animated features and like most of the studio's work, is excellent. The story is fun with a clever 'twist' to the ending, the animators manage to inject a tremendous amount of character and personality into the CGI characters, and the choice of voice talent is perfect (I especially liked Steve Buscemi as the chameleonic villain Randall). CGI technology has advanced considerably since the film was released but the imagery still holds up and the vast 'closet door' storage facility is great. Typical of the studio, there are a lot of amusing details in the background that are worth watching for. Good, timeless fun for all ages."
    },
    {
      "username": "jackgdemoss",
      "userUrl": "https://www.imdb.com/user/ur87808462",
      "reviewLink": "https://www.imdb.com/review/rw5363563",
      "warningSpoilers": false,
      "date": "29 December 2019",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "The animation even holds up at times.",
      "content": "I was recently gifted a \"100 movie advent calendar\" for Christmas. When you are ready to watch a movie you scratch one of the boxes off and it tells you what to watch. The first draw was Monsters, Inc. I haven't seen this classic for over 10 years, but my wife was pulling quotes out verbatim. The opening 10 minutes are executed to perfection. The characters are introduced nicely, the plot and obstacle to overcome laid out, the world built, and the comedic timing perfect. The compilation of Mike training Sully with scare exercises had me rolling. The movie does lose steam after this first 10 minutes but it certainly never sputters out. Monsters, Inc. is a classic for a reason, and is a must see."
    },
    {
      "username": "ahill-1",
      "userUrl": "https://www.imdb.com/user/ur1455511",
      "reviewLink": "https://www.imdb.com/review/rw0647790",
      "warningSpoilers": false,
      "date": "12 December 2001",
      "rate": "10",
      "helpful": "149 out of 165 found this helpful.",
      "title": "Now here's a story children and adults can relate too. Monsters in the closet.",
      "content": "While monsters in the closet may seem to be a scary reality for some children, `Monsters, Inc.' makes it light hearted by showing them it's all in a night's work. The characters are as charming as the cast that speaks for them.It's a learning experience children get to see how an industry works. Monsters, Inc. is an in-genius corporation that has scientifically learned how to channel children's screams into energy that is used for electrical power. It has monster employees, an assembly line of doors (which give monsters access to children's bedrooms), a top-flight training program and some of the top Monsters in the scaring business.There's a colorful Metropolis, filled with houses, buildings, businesses, cars and everything that makes a city run smoothly along with a population of colorful creatures. One of the colorful groups of creatures is the yellow swat team. Their job is to protect the Metropolis of Monsters, Inc. from human contamination.But what happens when a human child mysteriously gets through the bedroom door and terrorizes the city with screams and boo's. It's wondrous and funny. In the mist of all this is industrial crime, brought on by greed. But, the story ends on a very happy note.John Goodman is the voice of `Sulley' a colorful large blue-green ape like monster who's the star Monsters, Inc. employee. He's some type of monster, cut, cuddly, and he has a conscience that leads him to feelings of regret about scarring children. He becomes attached to Boo (voice of Mary Gibbs) a cute, little big-eyed girl who is mysteriously brought to Monsters, Inc. and in his quest to return her home becomes very attached to her.Sulley's best friend is Mike (voice of Billy Crystal) who's a funny looking green ball with stick legs and one huge eye. His comedy is seen through out the movie. Mike is Sulley's driving force, acting as his agent. Mike's job is to make sure Sulley remains the top Monsters, Inc. employee. But when it comes to laughter Mike proves he's on top.Mike's girl friend Celia (voice of Jennifer Tilley) is the stylish employee who has Mike's best interest at heart. Her job is to keep him out of trouble.I give Monsters, Inc. a ten. It is an animated movie that can be enjoyed by the whole family. It makes for great family fun."
    },
    {
      "username": "moviesknight",
      "userUrl": "https://www.imdb.com/user/ur114822238",
      "reviewLink": "https://www.imdb.com/review/rw5648449",
      "warningSpoilers": false,
      "date": "17 April 2020",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Screams to laughter",
      "content": "Hardwork doesnt guarantee success and so doesnt talent without hardwork. You may not be fit for the job, so choose the future correctly. But together we can make better future. The friendship to last long. Understanding each others power, strength and weakness. The core of our institution may be hollow and biased but are we strong enough to challenge the black sheeps in the institution? Fun with screams and laughter. Enjoy."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw1496136",
      "warningSpoilers": false,
      "date": "13 October 2006",
      "rate": "",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Gates Again",
      "content": "This is a resubmitted comment, the original was removed by a complaint from some anonymous aggrieved party. Let's hope the edits are sufficient this time.You already know that this is the usual Pixar fare, which is to say that it is excellent, better than any non-Pixar animated film. Sure, you also know that and you probably know the usual reason given: that Pixar spends more time on basic storytelling values than anyone else.Here are two elements of this that may deepen your appreciation. The first is that Pixar recognized early that 3D animation software allowed two types of advance in the third dimension. The first is obvious, that everything has depth and reflection and shadow more or less like reality.The second is that once these objects and scenes are defined in the computer, it is no extra work to move the camera anywhere. it can loop and swoop in ways that we never could have before. Pixar decided to exploit this in their storytelling here and later in \"Nemo.\"Nemo was set in an environment where there was no horizon so the camera could flow and the watery feel of the place could make the unfamiliar fluidity of the camera seem more natural. Here, is where they tested some of those perspectives in the three dimensional door warehouse and the extra dimensions of going in and out. Those scenes make this for me.The second interesting thing is some competitive background. In those days, there was a shooting war between Bill Gates, financier of Dreamworks Animation (and leader of Microsoft) and Steve Jobs of Pixar (and leader of Apple). This was in the heyday of Gates' dirty tricks and he was intent on burying Jobs forever. Pixar depended on the success of \"A Bug's Life\" their followon to \"Toy Story,\" so Dreamworks rushed \"Antz\" -- a cheapy -- to open a week or so before to steal the market.\"Bugs\" prevailed, sufficiently at least, and Pixar ramped up for their usual three year development of \"Monsters.\" Dreamworks, getting wind of this, went all out with \"Shrek,\" their \"monster\" movie that could be released six months earlier. It only took a year because the animation is less perfect. But they were overt in their attack this time: \"Shrek\" made literal fun of Disney, the Pixar partner. The head guy at Disney was the model for the blowhard King who reigned over a fairytale kingdom populated with -- can you guess? -- all the old Disney characters.Pixar/Jobs would never do something so spiteful. But perhaps they did subtly appreciate the use of windows and gates to the future that always seemed to go wrong. And now you can too.Ted's Evaluation -- 3 of 3: Worth watching."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2081622",
      "warningSpoilers": false,
      "date": "16 June 2009",
      "rate": "9",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Definitely one of the best films of 2001!",
      "content": "This was a wonderful movie, with colourful characters, a fun storyline, and a funny and sometimes touching script.(I liked Shrek as well, but I slightly preferred this) I don't think it is quite as good as Toy Story, but I found it an enormously entertaining film, it was much better than I expected. The animation was truly excellent, with colourful and engaging backgrounds, and no stiff movements as far as I could see. I wasn't hugely keen on the song playing over the end credits, but compared to the overall goodness of the film, that is such a minor criticism, and it is fair to say that people have different tastes in music. The script was very, very funny, particularly with the character Roz. The voice talents were fantastic, John Goodman and Billy Crystal were brilliant as Sulley and Mike, Steve Buschemi clearly has a lot of seedy fun as Randall, Jennifer Tilly is wonderfully innocent as Mike's girlfriend, and the late James Coburn is wholly convincing as Waternoose. And I loved the character of Boo, she was so cute, and I loved the ending, people complained it was overly-sentimental but I thought it was so sweet. The story, as is always the case with Pixar films is highly original and charming, and doesn't drag at all. Overall, a wonderful film, truly entertaining and a must-see, and if you are starting to lose faith in Disney and their countless sequels, this is perfect for you. 9.5/10 Bethany Cox."
    },
    {
      "username": "sati_84",
      "userUrl": "https://www.imdb.com/user/ur3298553",
      "reviewLink": "https://www.imdb.com/review/rw0648111",
      "warningSpoilers": false,
      "date": "24 April 2004",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "touching, emotional, original and hilarious masterpiece",
      "content": "I only watched it on DVD, but I wish I was at the theater, when Monsters, Inc. was released. Anyway, I was blown away. Sometimes I was rolling on the ground while laughing, sometimes I couldn't hold back my tears. Simply amazing, marvellous filmmaking.The animation is picture-perfect, the dialogue is brilliant, the story is truly original. Pixar's finest, I think, it's way better than Finding Nemo. A cinematic masterpiece, which is full of emotions and laughter. If you haven't seen it yet, then GO, RENT IT! You won't be disappointed, I guarantee it.Boo is the cutest animation movie character EVER.An obvious 10/10"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0647849",
      "warningSpoilers": false,
      "date": "11 February 2002",
      "rate": "",
      "helpful": "9 out of 11 found this helpful.",
      "title": "There's more for kids than adults, but it's still got plenty of laughs for adults",
      "content": "Monsters Mike Wazowski and Sulley are the best scare team in Monsters Inc. The company catches the screams of children to power the city of Monstropolis. However Sulley's main rival, Randall Boggs is up to no good and is working the rooms after the factory is shut. Sulley stays late one night to find a door has been left open and that a highly dangerous little girl gets trapped on the wrong side of the door. With the contamination unit closing in on them, Mike and Sulley must get the girl back into her room and uncover Randall's plot.From the Toy Story producing Pixar comes yet another child/adult cartoon. The story here will satisfy adults and children but it feels like an excuse for things to happen rather than a story in itself. Where Toy Story had layers of story this is quite straightforward. That's not to say it's not good, but it is more aimed towards the children than the adults.Similarly the majority of the comedy is aimed at children. The only consistent laughs for adults come from the original `one-eyed monster' (where was that joke!?) Mike - he delivers plenty of funny lines and his musical over the outtakes is the funniest thing in the whole film. The problem is that it doesn't have Toy Story's spread of backup characters to deliver one-liners, here we have the three main characters and a couple of baddies, other than that there are no really good support roles - even Celia is wasted as Mike's love interest.There are still more laughs than many real comedies! But it's unfortunate that it's only left to Mike to carry the adult humour. The animation here has really advanced from Toy Story - just check out Sulley's hairy coat to see the detail. At times you forget it's a cartoon - the characters and backgrounds just look so very real. The final chase through the many doors of the factory is really exciting visually and is pleasing to all.A great voice cast includes Crystal, Goodman, Coburn, Buscemi, and Tilly all do well, but Crystal is the only one that has much to do and he comes away with all the praise.Overall it is aimed more at kids than adults and it's not near the heights of Toy Story. However there is still lots to enjoy for all ages."
    },
    {
      "username": "MLDinTN",
      "userUrl": "https://www.imdb.com/user/ur1773414",
      "reviewLink": "https://www.imdb.com/review/rw0648074",
      "warningSpoilers": false,
      "date": "10 March 2003",
      "rate": "",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Funny and creative",
      "content": "This film had really cool, imaginative animation. Plus the plot was entertaining. I liked the idea of children's screams powering Monstropolis, cute and funny. The little girl, Boo, had such a funny, little laugh. I liked how all the monster characters had their own personalities. From the striking colors to the way the hair moved on Sully to the snow blizzard, the CGI was great. I also liked the expected chase scene because it was a little different in this movie. Here, Sully, Mike, and Boo travel through doors and come out in different places and out of different doors as they are being chased by the evil Randall as they search for Boo's door. I just really liked the uniqueness of these scenes. Also, the final scene was touching, and we get to see how Sully's character transform from a scarer to someone who just wants to make kids laugh. FINAL VERDICT: I highly recommend this for kids as well as adults. It is entertaining, cute, and funny."
    },
    {
      "username": "Howlin Wolf",
      "userUrl": "https://www.imdb.com/user/ur1046557",
      "reviewLink": "https://www.imdb.com/review/rw0647845",
      "warningSpoilers": false,
      "date": "9 February 2002",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Light, enjoyable fare that proves animation is still on top...",
      "content": "... when it comes to producing well-rounded, realised and consistently entertaining movies. Is it just me or have there been no REALLY awful animated films from the stables of the top studios like Pixar and Dreamworks, etc? The movie industry as a whole should perhaps sit up and take notice of the craft that goes into these movies. Both 'suits' and audiences are sure to benefit if that ever happens. Long may the tradition of quality animated movies be, I say! I actually bought a ticket for this last night after finding to my dismay that another premiere, \"From Hell\", was already sold out by the time I arrived. These are certainly two distinctly different films in theme! I was slightly grouchy, because, coupled with that minor disappointment, I'd had an argument with a friend on the way over to the theatre, and was now proceeding solo. I wouldn't say that \"Monsters Inc\" made me glad I missed \"From Hell\", but I still got a solidly entertaining film for my money. I just hope I don't miss \"Ocean's 11\" next week... For every plus-point to the movie I can also think of a criticism, but on the whole the good points JUST outweigh the bad. The setup may be a little too complicated for younger audiences and the supporting cast of voices is wasted. There was definitely not enough Steve Buscemi, whose bad guy just seemed like an afterthought to all the Keystone Cops esque capers of trying to get \"Boo\" out of Monstropolis. The script is pitched at a much younger level than \"Toy Story\" was, and so as a result adults may be bowled over by the animation, but slightly starved in the belly-laughs department. That said, there are still a couple of moments guaranteed to have older patrons guffawing heartily, just not enough for my liking. Even without laughter, the story is still diverting and inventive enough to fix your attention satisfactorily. The movie really comes into its own when the kid is introduced, as thereafter the action rarely pauses for breath. Good as the voice talents of Goodman and Crystal are, it is undoubtedly youngster Mary Gibbs who inadvertently steals the show. Her cute gurgles and shrieks are enough to put a smile on most people's faces and warm their hearts. The job the team did on collecting all her voice samples for the finished movie is nothing short of amazing; indeed, just like the animation achievements were as well. Goodman excels in his voice acting, making \"Sulley\" a truly memorable character. The animation is wonderful, and at times will make you unable to do anything else but gawp. Techniques in this arena seem to be moving at lightspeed, and in just a few years will make the graphics seen in \"Toy Story\" seem unremarkable. Just for this factor alone, \"Monsters Inc.\" deserves to be seen, but the likeable (if not always best used) cast and the imaginative plot add an extra dimension that make it worth your time. Nowhere near a \"Toy Story\" beater for sheer polish and appeal to all ages, but a commendable effort nonetheless. Well done! Altogether now... \"Put-that-thing-back-where-it-came-from-or-so-help-me...\" !"
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1006680",
      "warningSpoilers": false,
      "date": "25 January 2005",
      "rate": "8",
      "helpful": "10 out of 13 found this helpful.",
      "title": "More fun from Pixar",
      "content": "Set in a world of Monsters, where the most scary thing is a human child, there is a shortage of Power at the the Scream factory, a place where Monsters enter our world through the closets of young children to collect their Screams.Sully (John Goodman) the Top Scarer, stumbles upon a child who has somehow entered our world, with his buddy Mike Wazowski (Billy Crystal) Sully finds out that Human Children are not as dangerous as they are made out to be. And there is more to the Scream Factory than meets the eye.Brilliantly animated, with some hilarious characters, Monsters inc is another Pixar Delight for the whole family8/10"
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1278942",
      "warningSpoilers": true,
      "date": "30 January 2006",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "We Scare Because We Care!",
      "content": "''Monsters, Inc.'' is great! Before I have watched movies from Pixar like '' The Incredibles'',''Shrek'' or even ''Finding Nemo'', ''Monsters Inc.'' was one of the first movies made by Pixar that I watched and enjoyed a lot! The monsters like Mike and Sulley are charismatic and funny,and the story is very pleasant as well: In the monster's land, the monsters generate their city's power by scaring human children.One of the biggest companies of energy is the famous 'Monsters, Inc', where Mike and James Sullivan work. James is very famous in his work, since he is one of the 'scariest'and the one who produces the bigger amount of energy to the company. One night, however, Sully uncovers a devious plot to rid Monster city of it's power problems but accidentally lets a human little girl to enter the monster world. The funny thing is that the monsters really believes that children can contaminate them, so, everybody is afraid of children, specially the little girl who entered the monster's world. Mike and James call the little girl 'Boo'and after seeing she looks harmless, they try to send her back to her world. But many things, Randall included, are trying to not let their plan come true..."
    },
    {
      "username": "ManyGentleCuttlefish",
      "userUrl": "https://www.imdb.com/user/ur7764961",
      "reviewLink": "https://www.imdb.com/review/rw1411991",
      "warningSpoilers": false,
      "date": "6 July 2006",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "My personal favorite Pixar movie",
      "content": "Pixar. With only seven movies you've built yourself a reputation as the greatest current animation studio of them all. Dreamworks has made some good ones and 20th Century Fox's movies have made me chuckle a bit, and Disney has gone downhill in recent years. But you can consistently produce quality work with almost no stain on your track record (except A Bug's Life, the one Pixar movie I did not enjoy). But I've lost track of my thoughts.I'm here to talk about Monster's Inc., my personal favorite Pixar movie.I'm a doodler myself, and wan't to be an animator someday. And I love drawing monsters. Weird looking, many armed, strange-eyed creatures. That may have been the 1st reason Monster's Inc. appealed to me. So many of these creatures looked like something I would draw, and I spent much of my movie time looking at the creatures in the background.I also was captivated by the world that was created in Inc. A big problem for me in Pixar's newest movie Cars was lack of real explanation for their universe, like how they built their buildings. In Monster's Inc. the monster world is explained so much more in depth, and we really believe this world could exist. There's a beauty in watching the thousands of closet doors zoom around and I always get goosebumps from watching the \"scare montage\", because I now know the mechanics of the world these creatures live in. The characters in the world are also incredibly well realized. Mike and Sully both are easily relatable to, and even small characters have feelings and motivations we can understand. \"Boo\" actually behaves like a young child would, and that helped me believe she had real emotions. But the creature Randall is what stole the show for me. With his many arms, chameleon-like ability and sheer voice presence, it was hard for me to keep my eyes off of him. But what really made me love this movie so was the characters. When it comes time for the \"sad part\" of this movie, I was sad. I was actually seeing an animated cartoon that managed to make me feel for these animated creatures without being emotionally manipulative. And I'm not afraid to admit that I cry 4 out of 5 times at the ending.So, in the end, I can't recommend this film enough. I think this stands above all other Pixar productions and is definitely one of the best animated films I've had the pleasure of seeing."
    },
    {
      "username": "Pigalina",
      "userUrl": "https://www.imdb.com/user/ur4544760",
      "reviewLink": "https://www.imdb.com/review/rw1172543",
      "warningSpoilers": false,
      "date": "14 September 2005",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Fantastic",
      "content": "This film is great. It made me laugh out loud and made me feel sad when I was supposed to too. The monsters all live in a city called Monstropolis and they need the screams of children to power everything. Sully (the big blue furry monster) is the top scarer and he and his one-eyed green friend Mike work together at \"Monsters, Incorporated\" gathering screams. The monsters are terrified of the children however, thinking that if they get touched by a child they will die. One of the children (she ends up being known as Boo) gets into the monster world and everyone goes into a panic. Sully and Mike must return her to her home before she gets caught. Boo is a cute little character and that's a lot coming from me (I am not a huge fan of small children - it may be because she isn't real). There is also an evil creepy monster called Randal who is planning on kidnapping children to harvest as much scream as possible. The animation was great, I am always amazed at the patience that must go into animating hair, Sully is very hairy. As with all Pixar films there are \"bloopers\" during the credits which were really funny. With some of the rubbish that Disney seems to be coming out with (Little Mermaid 2, Jungle Book 2 anyone?), Disney/Pixar has to be the wave of the future."
    },
    {
      "username": "r96sk",
      "userUrl": "https://www.imdb.com/user/ur49400835",
      "reviewLink": "https://www.imdb.com/review/rw5913890",
      "warningSpoilers": false,
      "date": "17 July 2020",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Funny, wholesome, entertaining and touching",
      "content": "Always a pleasure to revisit this. 'Monsters, Inc.' is one of my favourite Disney animated films.The cast and characters are what sets this above the majority of the studio's other work, with so many memorable ones involved. John Goodman (Sully) and Billy Crystal (Mike) make for an outstanding duo in the lead roles, they are truly perfect for their respective roles.Elsewhere, you have the excellent Steve Buscemi portraying Randall to terrific effect. There are also memorable roles for James Coburn (Waternoose), Jennifer Tilly (Celia) and Bob Peterson (Roz). You, of course, also have Boo (Mary Gibbs) who is simply adorable.Everything else from the plot to the animation is fantastic, too - I have no faults with this film. Funny, wholesome, entertaining and touching. I see they're creating a television series, 'Monsters at Work', which could be good given it will have the same cast.A must-watch!"
    },
    {
      "username": "action4jackson",
      "userUrl": "https://www.imdb.com/user/ur1612807",
      "reviewLink": "https://www.imdb.com/review/rw0647885",
      "warningSpoilers": false,
      "date": "7 March 2002",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Great movie!",
      "content": "Great family film. One of the most underrated movies of the year. I took my 2 year old to see it. He loved it! He now has books and toys of Mike and Sully! This movie will be going into our library. We can't wait for the DVD release in September 2002!Just think they did not need a campaign of trailers, food chain promotions and commercials. If you have a solid story line and a genuine script people will come to see it!"
    }
  ],
  "errorMessage": ""
}