{
  "imDbId": "tt0120689",
  "title": "The Green Mile",
  "fullTitle": "The Green Mile (1999)",
  "type": "Movie",
  "year": "1999",
  "items": [
    {
      "username": "Movie-12",
      "userUrl": "https://www.imdb.com/user/ur0111563",
      "reviewLink": "https://www.imdb.com/review/rw0454593",
      "warningSpoilers": true,
      "date": "25 January 2000",
      "rate": "10",
      "helpful": "269 out of 314 found this helpful.",
      "title": "One of the most penetrating films of the past several years. **** out of ****",
      "content": "THE GREEN MILE (1999) ****Starring: Tom Hanks, David Morse, Michael Clarke Duncan, Bonnie Hunt, James Cromwell, Michael Jeter, Doug Hutchison, and Gary Sinise Written and directed by Frank Darabont. Running Time: 180 minutes. Rated R (for scenes of strong disturbing violence, language, and some sexuality)By Blake French:It's not everyday that a movie is able to change an audiences opinion on something. \"The Green Mile\" is a movie that made me think long and hard about supporting the death penalty. The film, based on a novel by Stephen King, contains such a variety of emotional events that it repels its audience away from its subject rather than glamorizing it. Only a handful of recent productions have been capable of such power. \"The Green Mile\" is truly one of the best films this year and is Oscar Worthy in many categories. It is a unique, three hour experience that must be seen to believe.The story is more of a personal narrative than an actual plot. The film offers an interesting perspective of the events that take place. It is seen through the eyes of a man who is over one hundred years of age, Paul Edgecomb, who is currently living in an old folks home with his friend, Elaine. During a very emotional day for Paul, he tells Elaine of a historical year in his experiences. She listens closely to his story.He tells of a particular year in the 1930's. The setting is a beautifully crafted prison hall. Paul explains he used to be a kind prison guard on death row in charge of overseeing the executions. In this year, several significant activities occurred in his life: he had a terribly painful urinary infection, and met a prisoner named John Coffey. This man has been sentenced to the electric chair for the rape and murder of two innocent little girls. This man isn't like anyone else Paul has seen, however. Aside from being massive in size, he is humble, mild mannered, and caring. After several miraculous events take place that may point to the thought that John Coffey might have magical powers from God, Paul begins to doubt the crimes this so called criminal has been convicted of.Throughout the story we witness three executions that in an electric chair. These capital punishment sequences have much power and significance. The electrocutions, one in particular, contain some of the most unsettling, disturbing material in film history. The movie is anti death penalty; we see the sometimes sadistic world from the prisoner guards point of view. It will put you in their shoes--and perhaps, change your opinion on the death penalty. I certainly had to think about my stand on this issue.I did have questions that were not really answered by the filmmakers. I wanted more on John Coffey's magical powers; the miracles aren't investigated enough to suit our pleas. I think the movie could have also stood on a firmer platform of religion. We assume that Coffey's abilities are a gift from God from the character's dialogue, but religion itself is more of a theme in the film than a message or plot point. I can perfectly see why the writers decided to leave these elements to the audiences imagination, to provoke participation. So I suppose my objections are not really flaws, just personal aspirations.\"The Green Mile\" contains so many vivid performances, I will not be able to honor everyone who deserves credit in my review. Michael Jeter, Gary Sinise, Doug Hutchison, James Cromwell, Bonnie Hunt, and David Morse are all superior in strength of their characters. Each contributes Oscar worthy performances, and if the Academy leaves these individuals out at Award time, they need to recheck their databases. Michael Clarke Duncan recently received a Golden Globe nomination for his supporting role, and he deserves it. Tom Hanks is just unspeakably brilliant in the leading role. He is right behind Kevin Spacey from \"American Beauty\" in the best performance of 1999.The message to \"The Green Mile\" is clear and understandable: justice isn't always just and the miracles can happen in the most unexpected of places. This film is one of the most penetrating dramas of the past several years. It will induce your mind to think about its subjects, and gradually build on you. \"The Green Mile\" is a movie that will stick with you long after the ending credits role by.Brought to you by Warner Bros."
    },
    {
      "username": "thinker1691",
      "userUrl": "https://www.imdb.com/user/ur3902771",
      "reviewLink": "https://www.imdb.com/review/rw2149288",
      "warningSpoilers": false,
      "date": "29 October 2009",
      "rate": "9",
      "helpful": "58 out of 65 found this helpful.",
      "title": "\" I knows you think I's a powerful man, but the darkness scares me boss \"",
      "content": "The world is teeming with wretched prisons wherein all manner of men are housed. Because these men are said to have committed a crime, the places are manifest and most men serving there, have earned their stay. However, as history has shown, there are innocent men incarcerated as well. Occasionally, one of these innocents are not only imprisoned, but are further remembered because their life becomes legend. In this case, the realization is nothing short of incredible as the new prisoner is a natural empath. Steven King the prolific American horror writer, chronicles this unusual story in a Louisanna prison where one Joe Coffee, (Michael Clarke Duncan) a huge, nay, enormous Black man, having been convicted of murder, is sentenced to be executed, by electrocution. Tom Hanks( And Dabbs Greer) plays Paul Edgecomb, an aging Prison Guard, who recalls his years in the state prison. Working on 'Death Row' or \" The Green Mile \", Mr. Edgecomb recalls Mr. Coffee's arrival and the strange events during his stay. With sympathetic Guards, like Brutus Howell (David Morse), Dean Stanton (Barry Pepper), Harry Terwilliger (Jeffery Demunn and one particular sadistic guard called Percy Wetmore (Doug Hutchison), Edgecomb recollects his discovery of the man's unusual healing powers and the surprising revelations concerning his innocence. The story is crafted by Steven King and it's application to the silver screen is perhaps one of the finest adaptation ever done. Duncan is magnificent and has a superb ability to allow the audience to learn his true purpose. Were it not for the sadistic behavior of Hutchison, who earned his ultimate reward, the story would not have carried it's genuine sympathetic awe which gave this movie it's Classic status. A great film and a must for true movie fans. ****"
    },
    {
      "username": "DemonKiki",
      "userUrl": "https://www.imdb.com/user/ur114667321",
      "reviewLink": "https://www.imdb.com/review/rw5709076",
      "warningSpoilers": false,
      "date": "5 May 2020",
      "rate": "10",
      "helpful": "74 out of 80 found this helpful.",
      "title": "'m sorry for what I am",
      "content": "You tell God the Father it was a kindness you done. I know you hurtin' and worryin', I can feel it on you, but you oughta quit on it now. Because I want it over and done. I do. I'm tired, boss. Tired of bein' on the road, lonely as a sparrow in the rain. Tired of not ever having me a buddy to be with, or tell me where we's coming from or going to, or why. Mostly I'm tired of people being ugly to each other. I'm tired of all the pain I feel and hear in the world everyday. There's too much of it. It's like pieces of glass in my head all the time. Can you understand?"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2170039",
      "warningSpoilers": true,
      "date": "7 December 2009",
      "rate": "10",
      "helpful": "47 out of 57 found this helpful.",
      "title": "The Least Of us",
      "content": "I'm glad that a number of reviewers have informed me that this highly unusual tale was a faithful adaption from the novel by Stephen King. I'm not much of a fiction reader so it is gratifying to hear that his vision got to the screen intact. I would not have guessed this film would have come from a horror story writer. No monsters from the id or any place else are present in this story set in the American South of the Thirties. But demons do exist in The Green Mile and there is a man named John Coffey who takes them unto himself.The Green Mile refers to the cell block housing the inmates scheduled for Death Row. In that cell block comes Michael Clarke Duncan who is close to seven feet tall and maybe weighing 400 pounds. He's also as docile as a baby lamb and whose only request is that they leave a night light burning because he gets a little afraid of a strange place in the dark.Of course the guards who have the typical white Alabama attitudes of the day don't quite know what to make of them, but Tom Hanks who captains the cell block and most of the rest find out just how special he is. And Hanks cannot believe that someone like Duncan could possibly be guilty of a double rape/murder of a child.This modern day parable of the Jesus story has King telling us that it is very possible that many of his kind have walked the earth with talents for healing. One of them got a religion worked around him, but they can come in all walks of life and certainly no one would expect one to come in the guise of an illiterate black Alabama sharecropper. But one of my favorite Bible verses has Jesus himself saying that what you do unto the least of my brethren you do unto me.Somebody of Michael Clarke Duncan's size and build is not going to get too many really good roles and he certainly hasn't played anything remotely like John Coffey again. Parts like that don't come along and the film seems almost to have been built around him. It's one of the most moving performance that has ever been put on film in history. And it's an incredibly difficult role, he's meek for his size and Uncle Tom like, but as we learn far from it. In fact Coffey is beyond what the ordinary human mind can comprehend. Duncan received one of four Academy Award nominations that The Green Mile got, in his case for Best Supporting Actor. Since the film is built around him, my only question is why was it the Supporting Actor category?The Green Mile was also nominated for Best Picture, Best Sound and Best Adapted Screenplay, but did not come home a winner in any of these. A pity that one of the best films of the Nineties could not get at least one Oscar.Where there's a Christ-like figure you also have some devil spawn villains and we have a pair of them in Sam Rockwell as another death row prisoner and David Hutchison as a rat of a prison guard with both connections and issues. What happens to them is both poetic and diabolical in true Stephen King tradition. Others in the cast of note are Bonnie Hunt as Mrs. Hanks, James Cromwell and Patricia Clarkson as the warden and his wife, David Morse and Barry Pepper as two other guards on the block and Michael Jeter as another prisoner with a remarkably trained 'circus' mouse.The Green Mile is a remarkable allegorical picture and might be considered for Easter time viewing if it has a season. It certainly will make folks think."
    },
    {
      "username": "oundjianm",
      "userUrl": "https://www.imdb.com/user/ur23740799",
      "reviewLink": "https://www.imdb.com/review/rw2546044",
      "warningSpoilers": false,
      "date": "8 January 2012",
      "rate": "10",
      "helpful": "125 out of 137 found this helpful.",
      "title": "Do not live your entire life without seeing this film!!!",
      "content": "GREATEST FILM I HAVE EVER SEEN. i remember seeing it when it first came out when i was 12 years old. now i just finished watching it and have gone through practically a whole box of tissues...that pure, love and honesty was portrayed so exquisitely well by Michael Clarke Duncan... it made me want to tear my hair out. If there is anything in this world which reminds me of true human love and compassion, it is this film. If you ever give up hope on humanity and the destruction which our disgusting race has brought to this world, watch \"The Green Mile\" Hopefully it will change your outlook a little bit like it just has mine.11/10 SHOULD HAVE WON ALL THE AWARDS AVAILABLE THE YEAR OF IT'S RELEASE."
    },
    {
      "username": "jlacerra",
      "userUrl": "https://www.imdb.com/user/ur1222967",
      "reviewLink": "https://www.imdb.com/review/rw0455029",
      "warningSpoilers": false,
      "date": "17 June 2001",
      "rate": "10",
      "helpful": "241 out of 297 found this helpful.",
      "title": "A one of a kind classic",
      "content": "This movie is a real gem. It is hard to find fault with it. Hanks is excellent in a role that clearly calls for him to suppress his natural slant toward humor. He is Paul Edgecomb; Tom Hanks is nowhere to be found. Yet he gives Edgecomb just the right flavor. One cannot find a single weak cast member! Michael Jeter should have got an Oscar. Michael Clark Duncan put just the right shading on his huge character to make him vulnerable and sympathetic.Flawlessly shot on perfect period sets, the whole production binds together to bring the extraordinary story into the realm of a believable and compelling study of human injustice and charity."
    },
    {
      "username": "deepaknarwal88",
      "userUrl": "https://www.imdb.com/user/ur21630717",
      "reviewLink": "https://www.imdb.com/review/rw2167297",
      "warningSpoilers": false,
      "date": "2 December 2009",
      "rate": "10",
      "helpful": "369 out of 384 found this helpful.",
      "title": "this movie can tear emotions out of anyone.",
      "content": "i expected this movie to be a normal and i just want to see it for Tom Hanks but as movie goes through i cry,i laugh and there comes a feeling which can't be described in words. i rate this movie as the best i have ever seen. some moments in the movie makes me hold my bed pillow in the tightest ever grip. i can guarantee that this movie will leave an impression in your mind for a long time. i even say that this movie is better than shawshank redemption.fantastic story, brilliant acting,mind boggling feelings and overall an unforgettable drama. if you have watched 1000 movies and not this then your movie watching journey is incomplete.i will also make sure that even my next generation should watch this one."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8925753",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Mixing an emotional drama with a Miracle!",
      "content": "As you may know, the movie is adapted from Stephen King's amazing novel.The director Frank Darabont showed this novels are quite amazing for adaptations. This wasn't the first time he directed one of those adaptations. He proved that with The Shawshank Redemption.The storyline is just too effective and great! Not only the storyline is good, the timeline order is the real key. If this movie was on chronological order, the movie would be half effective.Also the great chosen cast with so iconic performances makes the movie even more effective. Especially the brilliant performance by Michael Clarke Duncan.Cinematography is also quite amazing. I think we can see that in especially in the forest scenes and the rainy scene.I think Original Scores could be better. It's good when you're watching the movie but the Scores are not meant for listening after the movie. The Prestige has the similiar scores in my opinion. Not the type of the Scores are similar but they're not that iconic to listen. At least it was like that for me."
    },
    {
      "username": "Angel-54",
      "userUrl": "https://www.imdb.com/user/ur0136414",
      "reviewLink": "https://www.imdb.com/review/rw0454772",
      "warningSpoilers": false,
      "date": "16 June 2000",
      "rate": "",
      "helpful": "34 out of 37 found this helpful.",
      "title": "Like the drink only not spelled the same",
      "content": "This movie was spectacular!! I was watching it intently from beginning to end and did not even notice the time. This movie is a true masterpiece. Tom Hanks and Michael Clarke Duncan were wonderful and the supporting cast was fantastic.Based on a serial novel by Stephen King, the Green Mile is about Paul Edgecomb, a officer in charge of prisoners on death row and everything was the same as usual until the day that John Coffey (Clarke Duncan) was brought to the mile. Coffey is an extraordinary person and Paul Edgecomb never believed in miracles until the day he met one. This movie is one of the best adaptations of a Stephen King novel that I have ever seen. I think that I would recommend this movie to everyone, and even if you don't like King's work I am certain that you will love this flick. This movie was robbed at the Academy Awards, but never the less, it is still one of the most memorable movies I have ever seen. A small warning though, if you are a bit squeemish then you may need to hide your eyes for a few scenes, but don't miss out on this movie because of it. I give this movie a 9.5 out of 10!!!"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5506028",
      "warningSpoilers": false,
      "date": "24 February 2020",
      "rate": "",
      "helpful": "36 out of 45 found this helpful.",
      "title": "Great",
      "content": "Some of the supporting characters are a little two-dimensional, but 'The Green Mile' is an incredibly effective prison drama with terrific performances and a script that deals with grief in an innovative and emotionally resonant way."
    },
    {
      "username": "uniikki",
      "userUrl": "https://www.imdb.com/user/ur0129667",
      "reviewLink": "https://www.imdb.com/review/rw0454627",
      "warningSpoilers": false,
      "date": "10 February 2000",
      "rate": "10",
      "helpful": "431 out of 485 found this helpful.",
      "title": "A rare gem of casting and direction.",
      "content": "Frank Darabont returns to the directors chair with another adaptation of Stephen Kings novel. The events take place at a death row, the guards call the green mile. The story is a layered, rather character-driven fantasy tale of the events that transpire at \"the mile\" after the arrival of a giant man, John Coffey (Michael Duncan), convicted of the murder of two small girls. Actually this is not one single story, but several tied together seamlessly.A character-driven movie requires a lot from the cast, and fortunately when it comes to cast, The Green Mile delivers. As the poster of the movie tells, this movie stars Tom Hanks as Paul Edgecomb, senior prison guard of the mile, and as always he performs very well indeed. Yet the cast around him is even more spectacular, perhaps partially due to them being relatively unknown. With a face you know, one inevitably remembers previous performances, and the new role is coloured by this. Doug Hutchison as Percy Wetmore, a mean spirited prison guard was particularly impressive, yet his character could have been given more depth. The most captivating was the performance of Michael Duncan.It is hard to find a flaw in this movie. The camerawork is superb, cast wonderful and direction flawless. The movie's considerable length, a bit over three hours, is something that had me worried. Yet the marvellous cast and the peaceful yet firm pace of the movie held my attention progressively through the three hours right to the touching culmination. Many will find this movie to be too long, but I for one was delighted of the style, combination of simplicity of events and depth of characters and conversation.All in all the The Green Mile is a very touching drama, with the joys and sorrows of the life pictured with great skill, if not the best movie of the year. Five out of five."
    },
    {
      "username": "KathyT",
      "userUrl": "https://www.imdb.com/user/ur0225364",
      "reviewLink": "https://www.imdb.com/review/rw0454391",
      "warningSpoilers": false,
      "date": "15 December 1999",
      "rate": "10",
      "helpful": "655 out of 711 found this helpful.",
      "title": "As wonderful as the book!",
      "content": "\"The Green Mile\" is one of my favorite Stephen King books and I have read it several times. I was anxiously anticipating the film version, but was concerned that the emotional impact of the book could not be replicated on screen. Fortunately this wonderful story was adapted by Frank Darabont, who did such a magnificent job bringing King's \"Shawshank Redemption\" to the screen. He does the same high quality work with \"The Green Mile\". The story is faithful to the book, only losing details that were not important to the story anyway. The casting is superb - every actor is perfectly suited for his role and does an excellent job, although I would like to single out Doug Hutchison. His portrayal of the detestable Percy is right on the mark and suggests complexities in this character I had not discovered in the book. The length is about three hours and it seems that critics are complaining about that. I can't understand the complaints. The film never drags and is never dull, and it certainly didn't feel three hours long. The length is needed to tell this story the way it should be told, and the story is so very engrossing. Best of all, Darabont and the actors bring so much emotion ot the screen, that I cried like a baby through several scenes. \"The Green Mile\" will haunt you."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8780288",
      "warningSpoilers": false,
      "date": "5 January 2023",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "An incredible movie.",
      "content": "Paul Edgecomb and his team of prison guards get a surprise when John Coffey walks through the door, a man of huge stature, with a timid demeanour, but a special gift, but convicted for murdering two children.Is this one of the best ever adaptations from text to big screen ever made? I would argue so, twenty odd years on, and I am still captivated by the magic of The Green Mile.Not many films get me, this one always does, it's an incredibly moving film, one of those films where you will need your hankies for a few scenes. Many scenes hit hard throughout, some moving, some disturbing, there really is a richness to its content that is quite something.Plenty of outstanding scenes, I've always enjoyed that moment where the guards are first introduced to John, that scene towards the end though, (we all know which one,) that is such an incredibly powerful moment.Tom Hanks gives an outstanding performance, as indeed do the whole cast.The accompanying music works so well, the score enhances the film.It's quite a long film, but it's one of those will just fly by, you'll be so engrossed you won't even notice the hours ticking by.10/10."
    },
    {
      "username": "epluribusunum2010",
      "userUrl": "https://www.imdb.com/user/ur19219892",
      "reviewLink": "https://www.imdb.com/review/rw2669278",
      "warningSpoilers": false,
      "date": "5 September 2012",
      "rate": "10",
      "helpful": "112 out of 121 found this helpful.",
      "title": "Rest in Peace Michael Clarke Duncan",
      "content": "There's a reason why this Oscar winning tour de force is #67 ranked of all films on IMDb, despite the fact that it's 3 hours long and has some truly grisly scenes (not for the squeamish, children, or a first date.)It's chock full of outstanding performances, not only from Hanks, but also from the many supporting characters, all who are rich and full. It will seem slow to the impatient, but will be richly rewarding for those with the stamina to make it to the end. It will certainly get you thinking about capital punishment and perhaps different shades/degrees of evil. It is either a deeply moving spiritual tale or a wonderfully creepy journey down the rabbit hole of Stephen King's mind; take your pick. Either way, I put it right up there on my desert island list with the likes of Shawshank Redemption. It is definitely required watching."
    },
    {
      "username": "Matt-231",
      "userUrl": "https://www.imdb.com/user/ur0290023",
      "reviewLink": "https://www.imdb.com/review/rw0454386",
      "warningSpoilers": false,
      "date": "15 December 1999",
      "rate": "",
      "helpful": "316 out of 352 found this helpful.",
      "title": "True to the book, which is odd for a movie.",
      "content": "Having seen the movie, The Green Mile, and read the novel of the same name by Stephen King, I am glad to say that the movie stays true to the book, which in itself is a great read. I read the book in one setting about a year ago, and after seeing the movie, I didn't see one scene from the book, or one plot point, left out. There were a few minor changes from the book but which in no way detract from either work. As far as performances, I can imagine many people pointing to Michael Duncan as John Coffey or Tom Hanks as Paul Edgecomb as the best performances of the movie, and they are good, but I would hope that Michael Jeter would receive recognition for portraying Eduard Delacroix. He plays Delacroix exactly as I pictured him when I read the book. I can very well see why King himself said this is his favorite of the movies adapted from his novels. It is the only one played out as he had written it. I wouldn't compare this movie or the book to (Rita Hayworth and) The Shawshank Redemption because that would be unfair to both. They are both great, but are both different. The Green Mile isn't a movie about hope and friendship, as The Shawshank Redemption was, it is a movie about a miracle of a man, and the people he affects. But like The Shawshank Redemption, I give The Green Mile 4 out of 4 stars. Great story, great cast, great look."
    },
    {
      "username": "bldsimple2",
      "userUrl": "https://www.imdb.com/user/ur0485453",
      "reviewLink": "https://www.imdb.com/review/rw0455030",
      "warningSpoilers": true,
      "date": "11 December 1999",
      "rate": "10",
      "helpful": "91 out of 114 found this helpful.",
      "title": "Warning to Teamsters: Bring 5 Hankies",
      "content": "I went looking for an experience. Something that would take me to the limits of my own existence and remind me that even in the darkest corner of my own life, there was hope. I was reminded, instead that along with the triumph there must also be sacrifice. A part of me died in that theater, but I walked out feeling renewed, refreshed...and a little cursed.I think Paul Edgecomb feels the same way.Tom Hanks has to be the epitome of a Hollywood living legend...and the guy's only in his 40s. He went from scraping his way through sophomoric slap like The 'Burbs, Turner & Hooch, and Bachelor Party to rise up in the 90s as our towering \"everyman.\" Anyone who marvels in his \"simple guy in complicated circumstances\" roles such as Forrest Gump and Saving Private Ryan knows that he can deliver the goods...and an Oscar nomination (or win...or two...in aROW!!!) But Tom does something very interesting in The Green Mile. He lays back.The breakout performance in this film goes to Michael Clark Duncan (right now tied with Sixth Sense's Haley Joel Osment for my Best Supporting Actor vote). Crippled by his size, Mr. Duncan has a limit of the roles he can play. However, given the role of a child-like behemoth with Christ-like powers of healing, Duncan brings to the screen a performance that will transcend the Denzels and the Poitiers of the world.The Green Mile is Cell Block E in a Louisiana State Prison, death row. Paul Edgecomb run this wing with compassion, a startlingly different approach considering the legendary cruelty of southern prisons. He is surrounded by men in him employ who all share his philosophy that these men ultimately await the most devastating punishment. Why make their stay any more troubling.All save one: Percy Wetmore (Doug Hutchinson), relative of the Governor and always ready to remind anyone who disagrees his HIS methods just who got him his job. Percy hates everything about The Green Mile; the prisoners, other guards, even a tiny, brave mouse who befriends one of the inmates (Michael Jeter). It isn't until another new inmate is processed, a man they call \"Wild Bill\", that Percy will meet his equal.So where is the common thread? What is a messianic character doing on death row? What role will Tom Hanks play in his redemption? And what's this \"curse\" thing I brought up in the beginning of this review?If I could tell you, you wouldn't slap the money down on the box office and find it for yourself. Let me just tell you that the final blessings bestowed by John Coffey (Duncan) could make optimists and pessimists alike find a common ground. How you perceive the final moments will be up to how you impart on yourself...and the world.If John Coffey guilty of his crime? Are the fates of the characters in this film deserved? Half and half. Evil is punished, bu t goodness must bare witness...and that has a price as well. Will Tom Hanks win another Academy Award? He shouldn't. Is this a good film? No. It's an incredible film.I still weep for Paul Edgecomb."
    },
    {
      "username": "transylvanianfairy",
      "userUrl": "https://www.imdb.com/user/ur26618218",
      "reviewLink": "https://www.imdb.com/review/rw2829811",
      "warningSpoilers": false,
      "date": "11 July 2013",
      "rate": "10",
      "helpful": "44 out of 51 found this helpful.",
      "title": "It will stay with you for a long time.",
      "content": "The Shawshank Redemption is possibly my favorite movie ever. I had seen many movies before it, and I've certainly seen a lot after, but not many of them made me feel what that one did. Now, I have that feeling again. And once again, it comes from watching a Frank Darabont movie. I couldn't possibly explain the overload of emotions I experienced in the 3 hours it lasts. I have laughed. I have felt the emotions of every character. And most of all, I have cried. Very few movies have touched me like this one. Is there something to say about the acting that hasn't been said before? No, it isn't. You may have heard it is flawless, incredible, whatever. You did hear right, it absolutely is. I can't think of anyone in the whole movie that wasn't convincing in the least. The script has its funny moments, but it's incredibly deep, poignant and heartfelt. The characters are so \"human\" and unpretentious you can't help but adore them. But, well, there will be some you'd like to strangle. There has to be a villain everywhere, right? The Green Mile is a movie I will hardly forget. You can't possibly forget such an emotive story.What, you want to watch it? Great! But don't forget to have grab some tissues first."
    },
    {
      "username": "illbebackreviews",
      "userUrl": "https://www.imdb.com/user/ur28221379",
      "reviewLink": "https://www.imdb.com/review/rw2754704",
      "warningSpoilers": true,
      "date": "16 February 2013",
      "rate": "10",
      "helpful": "19 out of 24 found this helpful.",
      "title": "This movie blew me away, made me laugh, made me cry and me truly understand what the term 'sad' meant",
      "content": "Until I saw 'the Green Mile', I always thought that the 'Shawshank Redemption' and 'Forrest Gump' were the two saddest movies that I ever saw, but this movie actually blew me away for good.'The Green Mile' tells the tale of a few prison officers whose life changes when a supposed rapist/murderer gets sent to the prison they are in. During this time, they come to realize that he has a mysterious power that can be used for good and that the man may truly be innocent of all accused crimes.I love every single thing about 'the Green Mile', the same way I loved everything about 'The Shawshank Redemption' and 'Forrest Gump'. The acting in the movie was just perfected on all corners. Tom Hanks brilliantly portrays the complex character of Paul Edgecomb and the late Michael Clarke Duncan absolutely steals the show in an Oscar robbed performance as John Coffey. May he ever rest in peace. It wasn't, however, just those two who gave strong performances. The actors playing Brutus, Hal, Del, Percy, Wharton all did an unbelievable job at portraying how realistic prison life may truly be.The story is so emotionally moving that it is impossible to not like and connect with. The characters presented in the movie are some of the finest movie characters that I've ever seen. This film truly mastered characters and what they undergo during prison life.The directing and writing by Frank Darabont, the man behind 'The Shawshank Redemption' absolutely masters everything a film needs to get right once more and adds such layers to each character that we come to truly love by the end of the film.The tone to the movie is so dark that we are immediately thrown into the world presented in this movie. The movie is so sad on many occasions that I was truly left bawling my eyes out.**Spoilers*** The scene where Del is horribly executed to death was just too sad to look at. This movie made me sympathize with criminals more than any other movie.The last half hour made me truly cry all the way through it. The film doesn't attempt to out do itself and just masters it all. The ending to the movie just continued to make me cry.John Coffey's death is perhaps, the saddest death I've ever seen in movie history. It was such a moving scene that truly made me think twice about life.***Spoilers ended*** 'The Green Mile' is a superbly acted, directed, written movie with fascinating characters and a moving story that is sure to make everyone cry and be totally glad that they saw this movie. I however, do not think I will ever sit through this 3 hour movie, as I cannot bear to be emotionally connected to these characters. Watching 'The Green Mile' again and again is not easy, but that's a good thing about the movie."
    },
    {
      "username": "alan photog",
      "userUrl": "https://www.imdb.com/user/ur0566987",
      "reviewLink": "https://www.imdb.com/review/rw0454556",
      "warningSpoilers": false,
      "date": "9 January 2000",
      "rate": "10",
      "helpful": "709 out of 798 found this helpful.",
      "title": "Film was invented for creations like this.",
      "content": "The Green Mile is a masterwork. This is film as art, at it's very best. The depth of the cast is extraordinary, with all of the players delivering excellent performances. There is a clear sense here that all involved in the production knew that this was something special, and gave it their all. See this film if you truly enjoy actors giving everything to their craft. Watch for the countless subtleties of expression, and the great power that the cast creates with silence. This is evident in the opening sequence and remains throughout. Above all, Michael Duncan as John Coffey is exceptional. He brings gripping emotion to a unique, fascinating character.The Green Mile should bring you joy, laughter, and if you are like most in the theater this night, tears.BRAVO!"
    },
    {
      "username": "undeaddt",
      "userUrl": "https://www.imdb.com/user/ur81561331",
      "reviewLink": "https://www.imdb.com/review/rw4630022",
      "warningSpoilers": false,
      "date": "6 February 2019",
      "rate": "8",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Rest In Peace, Michael Clarke Duncan, you legend.",
      "content": "With this movie Tom Hanks proves why he is one of the all time best male actors that shook the world with their abnormal amazing acting roles. Among the TOP 100 IMDB rated movies, he has probably more than 4-5, including The Green Mile, Forest Gump and Saving Private Ryan, Captain Philips was also an amazing movie. But the spotlight in The Green Mile is reserved for Michael Clarke Duncan in the role of John Coffey. Nobody can count the amount of people that this person made cry in the early 2000's. He is the most adoring male human being that showed up on the movie screen in this century, his acting is out of this world and emotions are leaking out of every cell of his body. The fact that the actor died 7 years ago makes everyone 10 times more sad....rest in piece legend. Above all, we must not forget that this is another movie based on a Stephen King novel that succeded big time, which shows why we may consider King as the best novel writer of all time."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2391746",
      "warningSpoilers": false,
      "date": "27 February 2011",
      "rate": "9",
      "helpful": "21 out of 32 found this helpful.",
      "title": "Overlong, but haunting, thought-provoking, moving and engrossing",
      "content": "I am starting to like Stephen King's work more now, and I read the book. A wonderful book, that is faithfully(mostly) adapted into an equally wonderful film. My only complaint of The Green Mile is the length, I do think it is too long. However, The Green Mile is a film that is haunting, thought-provoking, moving and engrossing.The film is beautifully directed by Frank Darabont(director of the slightly superior The Shawshank Redemption), is beautifully shot with a foreboding setting and atmospheric cinematography and lighting and has an engrossing and haunting story that is well-paced too. Thomas Newman's score is positively hypnotic and very beautiful, with some great authentic song choices, my favourite being Wrap Your Troubles in Dreams(And Dream Your Troubles Away).The script is thoughtful too, and the movie also has a big emotional impact without feeling manipulative, I honestly couldn't help crying at the end of the movie. I have to say as well, the execution scenes were really quite harrowing. The performances are strong, Tom Hanks is excellent as the warden, as is Doug Hutchison who gives a credibility and complexity to a character that could have easily been clichéd and David Morse as Brutus. But Michael Clarke Duncan is the actor I want to give the real kudos to, he has a wonderful character and he absolutely nails it.Overall, a very, very good movie. Had it been shorter, it would have been perfect. 9/10 Bethany Cox"
    },
    {
      "username": "symonm",
      "userUrl": "https://www.imdb.com/user/ur16617575",
      "reviewLink": "https://www.imdb.com/review/rw2443337",
      "warningSpoilers": true,
      "date": "14 June 2011",
      "rate": "10",
      "helpful": "21 out of 27 found this helpful.",
      "title": "Another period prison based Darabont masterpiece!",
      "content": "In every way, this is a wonderful film and IMO deserves a rare 10/10 because it's hard personally for me to see how it could have been made any better. Hugely touching, emotive on every human level, a brilliant storyline, by all accounts a faithful screenplay and wonderfully cast. It's long, but the time flies.Hanks is superb here as is the inspired choice of Michael Clarke Duncan and in fact all of the cast. Even the mouse was brilliant!SPOILERS:It's the story of a simple man wrongly convicted of the worst type of crime. Set in a time where there is no real recourse to justice for such men and with a subplot that becomes the main focus of the film. Is John Coffey a gift from God and if so why are we allowing him to be legally murdered? That he ultimately doesn't mind, doesn't ease Paul's pain or the viewers pain at what we are watchingBoth Bitterbuck and Delacroix will make you question the death penaltyPercy's grossly offensive behaviour will make you question your humanity Paul Edgecomb will make you realise what a fantastically emotive actor Tom Hanks is and Duncan's John Coffey will make you weepHats off to you Mr Darabont once again and thank you for a truly beautiful film."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3510749",
      "warningSpoilers": true,
      "date": "24 July 2016",
      "rate": "9",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Supernatural prison drama is a feather in the cap for all involved",
      "content": "An excellent prison epic which proves to be another splendid adaptation of a Stephen King novel – the bar has certainly been raised in the '90s for such adaptations after all the trash we got in the 1980s (MAXIMUM OVERDRIVE anybody? Thought not). THE GREEN MILE is a splendid exploration of man's psychology, interactions with other men, and attitudes towards life and death emphasised by the uncomfortable Death Row setting. The characters in this film are vividly portrayed by many accomplished actors and actresses and the film works best as a slow-burning character drama packed with incident and occasionally fireworks. Of course being a King story there is a supernatural aspect to the tale (a prisoner is able to perform miracles) but this does not detract from the realism that the film offers in its story.The narrative is excellent, the film a visual triumph, the special effects work limited and therefore effective. Tom Hanks is great as Paul Edgecomb, the sweaty guard who comes to believe that one of his captives is an angel sent from heaven, but best of all is big Michael Clarke Duncan in an emotional performance that will have any decent viewer reaching for the handkerchiefs during the course of the movie. Also welcome are excellent supporting turns from David Morse, Michael Jeter, and Barry Pepper as fellow prison guards, James Cromwell as the sympathetic Warden and Harry Dean Stanton being weird as always. But the characters who really stick in the mind are the villains: Sam Rockwell as the sleazy, psychopathic inmate who causes no end of grief, and particularly Doug Hutchison as perverted guard Percy. Hutchison, most familiar from his encore performance as mutant killer Tooms in two X-FILES performances back when the show was good, is fantastic in his part and really loathsome – evil, mean and treacherous, but also cowardly, childish and unthinking - a wondrous turn.The film runs the gamut of emotions from A to Z. Love, fear, wonder, anger, everything in the human condition is explored here at one point or another. There are also a number of shockingly violent moments more powerful than any horror film – this is truly a prison movie for modern times. The worst scene has a prisoner frying on the electric chair but not dying. Ten minutes later he finally dies having emptied the building. A truly gruesome and disturbing moment. THE GREEN MILE is suspenseful, exciting, moving, and often profound – not to mention tear-jerking at key points. Thus it gets two thumbs up from this viewer. Watch out for Mr Jingles, the cutest and cleverest mouse ever seen in a movie (forget MOUSE HUNT for sure)."
    },
    {
      "username": "frankde-jong",
      "userUrl": "https://www.imdb.com/user/ur35683824",
      "reviewLink": "https://www.imdb.com/review/rw5846561",
      "warningSpoilers": false,
      "date": "22 June 2020",
      "rate": "7",
      "helpful": "9 out of 12 found this helpful.",
      "title": "A good film that is certainly not a remake of \"The Shawshank redemption\"",
      "content": "Frank Darabont as a director has only made 4 films. The most highly rated are \"The Shawshank redempion\" (1994) and \"The green mile\" (1999). At first glance these films have much in common. Both adapted from a book written by Stephen King, both situated in a prison and both about the friendship between a white and a black man.In fact the films are far more different than you are inclined to think. \"The green mile\" is more shocking as it is on death row. The story of \"The green mile\" also involves a supernatural element that \"The Shawshank ... \" as a more pure character study is missing.The character that contributes the most to the dfference between the two movies is the character of the black man. In \"The Shawshank ... \" Morgan Freeman plays the wise experienced inmate Ellis Redding. In \"The green mile\" Michael Duncan plays the somewhat ambigious John Coffey. On the hand he is a simpleton, reminding me of Lennie from \"Of mice and men\" (John Steinbeck). On the other hand he is \"a force of nature\" (I can't thnk of another discription that would not give away too much of the plot) whose initials only are very telling.Personally I prefer \"The Shawshank redemption\", which is more of a psycholigical drama. This is not to say that \"The green mile\" is only plot driven. With a running time of more than 3 hours Darabont takes his time to make individuals of his characters.In \"The green mile\" the guards are on average much more friendly than in \"The Shawshank ... \". There is one exception by the name of Percy Wetmore (Doug Hutchison). I think in preparing for his role Doug has taken a good look at Donald Sutherland as Attila in \"Novecento\" (1976, Bernardo Bertolucci)."
    },
    {
      "username": "thomaseb",
      "userUrl": "https://www.imdb.com/user/ur0593960",
      "reviewLink": "https://www.imdb.com/review/rw0454606",
      "warningSpoilers": false,
      "date": "31 January 2000",
      "rate": "10",
      "helpful": "160 out of 195 found this helpful.",
      "title": "Amazing and captivating rendition of the novel.",
      "content": "The length of the movie was perfect. It kept to the story to an amazing degree. The few changes didn't hurt the feeling nor the telling. The story itself is stirring and captivating. The casting of the parts and their portrayal were right on. This is one of the best movie versions of a Steven King novel I've ever seen, and I think I've seen them all. If you're prone to tears at a film, take extra tissues, you'll need them. The theater I was in was a mass of sniffles through the end credits. If you like fantasy/drama the film cannot be missed. There are some graphic scenes that may upset some, but this is Steven King. This is a movie I plan to add to my video collection as soon as the Letter Box version hits the shelves."
    }
  ],
  "errorMessage": ""
}