{
  "imDbId": "tt0086190",
  "title": "Star Wars: Episode VI - Return of the Jedi",
  "fullTitle": "Star Wars: Episode VI - Return of the Jedi (1983)",
  "type": "Movie",
  "year": "1983",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "'Return of the Jedi' is fun, magnificent fun. The movie is a complete entertainment, a feast for the eyes and a delight for the fancy. It's a little amazing how Lucas and his associates keep topping themselves."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "83",
      "content": "Best of all, a revisit with Jedi makes a viewer appreciate spectacle, presentation, mythology -- that, and the power of a bitchin' helmet to speak volumes in a language even an alien can understand. [Special Edition]"
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "75",
      "content": "Less original than the first \"Star Wars\" and less resonant than \"The Empire Strikes Back,\" but packed with fast-paced action and downright cuddly Ewoks."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "75",
      "content": "Cuteness is the watchword here. The dark, eerie atmosphere that oozed from every frame of \"The Empire Strikes Back\" is gone. Instead, for Return of the Jedi, we have good triumphing decisively over evil, a too-pat resolution to a love triangle, and walking teddy bears."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/?MI=18042",
      "rate": "70",
      "content": "The dialogue is repetitive (\"I won't give in to the dark side of the Force!\" \"You will!\") and significant characters from earlier films -- notably bounty hunter Boba Fett and Yoda -- are dispatched without fanfare, and the whole business has a slightly rushed, perfunctory feel at the same time that it feels oddly attenuated."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "https://www.washingtonpost.com/wp-srv/style/longterm/movies/review97/returnofthejedihowe.htm",
      "rate": "70",
      "content": "Brings things to an almost cheesy conclusion. Given the gripping, dark elements that creator George Lucas introduced in the two previous films, the third movies outcome smacks of PG-rated populism rather than artistic fulfillment. But the experience is still highly entertaining. [Special Edition]"
    },
    {
      "publisher": "Washington Post",
      "author": "",
      "link": "",
      "rate": "60",
      "content": "Ultimately, Jedi even backs off some of the more tantalizing possibilities suggested by the cliffhanging scenario of \"Empire.\" This inhibition appears to grow out of consideration for the feelings of the juvenile audience, which can enjoy an abundance of thrills and close calls while resting assured that nothing catastrophic is going to be fall the heroes."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1983/film/reviews/return-of-the-jedi-1200425674/",
      "rate": "40",
      "content": "Hamill is not enough of a dramatic actor to carry the plot load here, especially when his partner in so many scenes is really little more than an oversized gas pump, even if splendidly voiced by James Earl Jones."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "30",
      "content": "Downright repetitive! [30 May 1983]"
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/052583jedi.html",
      "rate": "20",
      "content": "Return of the Jedi doesn't really end the trilogy as much as it brings it to a dead stop. The film...is by far the dimmest adventure of the lot."
    }
  ],
  "errorMessage": ""
}