{
  "imDbId": "tt1201607",
  "title": "Harry Potter and the Deathly Hallows: Part 2",
  "fullTitle": "Harry Potter and the Deathly Hallows: Part 2 (2011)",
  "type": "Movie",
  "year": "2011",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-news/harry-potter-deathly-hallows-part-2-208839/",
      "rate": "100",
      "content": "Fully justifying the decision, once thought purely mercenary, of splitting J.K. Rowling's final book into two parts, this is an exciting and, to put it mildly, massively eventful finale that will grip and greatly please anyone who has been at all a fan of the series up to now."
    },
    {
      "publisher": "New York Post",
      "author": "Lou Lumenick",
      "link": "https://nypost.com/2011/07/12/wizard-of-awe/",
      "rate": "100",
      "content": "Everything a summer blockbuster should be but rarely is - a whip-smart, slam-bang piece of entertainment where we deeply care about the fate of the central characters."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "It's a climax of truly epic proportions."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "https://ew.com/article/2012/06/16/harry-potter-and-deathly-hallows-part-2/",
      "rate": "91",
      "content": "The thrilling conclusion to a phenomenal cinematic story 10 years in the telling, Harry Potter and the Deathly Hallows - Part 2 is proof that authentic movie excitement is its own form of magic."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "90",
      "content": "It is indeed impressive; and we mean not just this solid, satisfying final film - in which the Potter saga reaches its climax, if not quite its emotional apex - but the entirety of producer David Heyman's blockbuster franchise."
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "https://variety.com/2011/film/reviews/harry-potter-and-the-deathly-hallows-part-2-1117945605/",
      "rate": "80",
      "content": "With its accelerated rhythm, relentless flow of incident and wizard-war endgame, \"Part 2\" will strike many viewers as a much more exciting, involving picture than the slower, more atmospheric \"Part 1.\""
    },
    {
      "publisher": "Empire",
      "author": "Helen O'Hara",
      "link": "",
      "rate": "80",
      "content": "A worthy farewell that packs in as much action as its seven predecessors combined and manages not to stint on the emotional beats. Harry Potter leaves us as a quiet, bespectacled, corduroy-wearing hero for the ages."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/harry-potter-deathly-hallows-edelstein-review-2011/",
      "rate": "80",
      "content": "HPATDH 2 works like a charm. A funereal charm, to be sure, but then, there's no time left for larks."
    },
    {
      "publisher": "Arizona Republic",
      "author": "Bill Goodykoontz",
      "link": "https://help.azcentral.com/",
      "rate": "80",
      "content": "With shifting loyalties, unlikely heroes, truths revealed and a little help from friends, Harry Potter and the Deathly Hallows: Part 2 winds the series up in a most-satisfying fashion."
    },
    {
      "publisher": "New York Daily News",
      "author": "Elizabeth Weitzman",
      "link": "",
      "rate": "80",
      "content": "It's wonderful. Epic and heartbreaking and just as grand as it needs to be."
    }
  ],
  "errorMessage": ""
}