{
  "imDbId": "tt1201607",
  "title": "Harry Potter and the Deathly Hallows: Part 2",
  "fullTitle": "Harry Potter and the Deathly Hallows: Part 2 (2011)",
  "type": "Movie",
  "year": "2011",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2459610",
      "warningSpoilers": true,
      "date": "16 July 2011",
      "rate": "9",
      "helpful": "29 out of 33 found this helpful.",
      "title": "Gives meaning to the phrase, save the best until last",
      "content": "I have enjoyed all the films and love the books, and after how much I loved Deathly Hallows Part 1 this entry, continuing from exactly where the previous film left off, had a lot to live up to. It is less faithful to the mammoth but very interesting and wonderful book than its predecessor. However I found this, apart from one or two disjointed parts where you could tell that details had been left out and the arrival in Hogsmede and the duel between Mrs Weasley and Bellatrix seemed a little rushed, had more flow, was better paced and had more coherent storytelling and less of admiring the scenery than the previous entries.What stood out for me was not only the darkness of it, particularly the last thirty minutes or so which was a tad anti-climatic but very intense too and also Snape's death, but also the emotional impact. Gringotts(especially for the effects, the dragon being the standout), the moving Ressurrection stone sequence and Harry's final scene with Dumbedore were very well done, but my favourite was the Snape's memory sequence, which was beautifully done and quite poignant. Not only that, it's my favourite Harry Potter scene alongside the Three Brothers animated sequence and the Cave Scene. The 19 Years Later scene was quite affectionate as well, with the use of the original music and all.Once again, the production values are impeccable. The effects, apart from the odd ropey one in the Room of Requirement scene and Bellatrix's death, are excellent particularly at Gringotts, while the scenery and cinematography are magical with a touch of austerity too, and David Yates delivers his best directing job. There's also my favourite of Alexandre Desplat's scores, I loved his ones for Girl with a Pearl Earring and The King's Speech, the score was also one of the few good points about Twilight:New Moon and I found his score for the previous part very effective. What I loved though about this score was not just how beautiful, haunting and how incredibly melancholic it was, but also how much it enhanced the drama.The script is very good a vast majority of the time, doing a noble attempt to stick to the spirit of the book. The humour is less stilted and corny than I can find it to be, and when the tone is tense and poignant the writing does an above decent job reflecting that. The pacing is never dull, if deliberately less rushed(Goblet of Fire) or glacial(Deathly Hallows Part 1) as some of the other entries, and the storytelling is always interesting and compelling while never convoluted.The acting is very good. Rupert Grint is great as he consistently is, Emma Watson while not quite as good as she was in Deathly Hallows Part 1 gives one of her better performances of the series, Maggie Smith and John Hurt are always good value and while I didn't find him easy to warm to at first until Half-Blood Prince in his brief but relevant appearance Michael Gambon is also good. Helena Bonham-Carter, David Thewlis, Gary Oldman, Robbie Coltrane and Tom Felton while neither are at their best here bring a pleasing sheen to the film. Three actors in particular I found stood out and gave their best performances of the series. One is Daniel Radcliffe, at first I found him likable yet wooden with some questionable delivery, however overtime I think he's grown with more emotional range than usual. Two is Alan Rickman, while I have considered him one of the more consistent actors of this series him and the character of Snape really shine here, Rickman is especially good in the Snape's memory sequence. Three is Ralph Fiennes, I think it helps that like Snape Voldemort is given more scope here, that said Fiennes is appropriately sinister in the role and certainly looks the part.In conclusion, a wonderful film and for me the best of the series. And I still stand by my initial feeling that it was better filming the book as two movies, it would've have felt far too rushed as one. 9/10 Bethany Cox."
    },
    {
      "username": "nogodnomasters",
      "userUrl": "https://www.imdb.com/user/ur77881167",
      "reviewLink": "https://www.imdb.com/review/rw4492820",
      "warningSpoilers": true,
      "date": "3 December 2018",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "LIGHTNING HAS STRUCK",
      "content": "Perhaps this is the best place to review the series as well as the last installment. We have seen Daniel Radcliffe mature from a fairy bad actor to one that is fairly convincing, particularly in his standing up to Aberforth Dumbledore. Emma Watson has gone from awkward kid who wore her emotions on her sleeve to Maxim's top 100 Hottest women. The passing of Richard Harris was a major let down to the series as Michael Gambon couldn't really fill his shoes. The most interesting and complex character was that of Snape. Alan Rickman made the series with his portrayal. The casting of the quirky minor characters made the story most enjoyable, all the way down to Mrs. Fink. Rowling's use of classical mythology, astronomy and the occult made the series an incredible educational experience. One of my favorite characters was the under used Luna Lovegood. She was a breath of fresh air.The direction of Chris Columbus was by far the best as well as the screen adaptations, which more closely followed the books. Starting with the third installment, the audience got short changed (There, I said it) especially those who didn't read the books...such as myself. This wasn't a bad thing as it led to a bonding with my niece who did read the books and I would take her to the films so she could explain them to me. Like Hermione, she is one of those \"insufferable know-it-alls\" who loves to let you know what she knows. (Good luck with that brain surgeon thing.)In this final episode, the gang of 3 go after the remaining Horcrux(s) which are now easier to locate than in the last 2 films. This one follows the later films in that it lacks the humor of the earlier ones.The movie, like the series drives home the ideas of teamwork, friendship, and courage. Goblins, spiders, troll, elves, death eaters, a dragon, and of course he who we do not speak. Personally, I would have done the ending differently, especially with Snape and Malfoy. But I don't want to discuss any possible plot spoilers."
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw4149447",
      "warningSpoilers": false,
      "date": "30 April 2018",
      "rate": "8",
      "helpful": "54 out of 69 found this helpful.",
      "title": "The series ends on a very strong note.",
      "content": "The conclusion to the series hits some of the strongest emotional beats, mainly due to our long-standing connection with the characters, and provides some grand visual treats in the form of extended magical battles. While 'Harry Potter And The Deathly Hallows: Part 2 (2011)' may be the biggest in scale and it is entertaining, it does feel lacking in depth - since some things are left oddly unexplained - and instead comes across as an extended third act for its duration. It actually plays out like one long climax, with little of the build-up required to further invest the audience, but at least it's well paced and doesn't hang about. A strong note on which to end a phenomenal series. 8/10"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2933891",
      "warningSpoilers": false,
      "date": "2 January 2014",
      "rate": "7",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Satisfying end to the series",
      "content": "This movie continues right after the death of Dobby, and closes out the Harry Potter series. There is a lot of action in this one, and it closes out the series satisfactory.If there is any problem, it's that the ideas behind horcroxes are somewhat confusing. They never really explained it easily or clearly. It's a difficult subject that the passing movie goers would best served by reading the books. Even with the books, some aspects could still be murky. The need for explanations requires some slower sections. The pacing still goes well. It does a passable job. The most important part is the exciting battles. It's a thrilling end and a satisfying one for fans of the series."
    },
    {
      "username": "vila-ddt",
      "userUrl": "https://www.imdb.com/user/ur27027267",
      "reviewLink": "https://www.imdb.com/review/rw2459059",
      "warningSpoilers": false,
      "date": "15 July 2011",
      "rate": "",
      "helpful": "269 out of 307 found this helpful.",
      "title": "End of an era... End of our childhoods... End of Harry Potter",
      "content": "What can I say... This was by far the most amazing finale any fan could have asked for. I cried, I laughed, I was short of breath in many instances, I was disturbed, but overall I was thoroughly satisfied with the conclusion of this series. I felt something amazing after the movie ended, something I didn't feel after reading the book. Being able to watch the end of Harry Potter on the big screen really brought the impact of just how much this series has touched not only my life, but the lives of everyone around me. Deathly Hallows Part 2 is by far (in my opinion) the best movie of 2011 and quite possibly one of the best movies of all time. I don't want to give any spoilers I just want to express how happy I am with this film. It picks up where Part 1 left off, all of the characters get the closure they deserve, and the story just comes full circle!BRAVO!!! That is all I have to say. Thank you to everyone involved in these movies for taking the world on such an amazing journey. J.K Rowling, thank you for writing such a masterpiece that will truly live on in my heart, and so many others hearts for years to come.Go see this movie!"
    },
    {
      "username": "hjpog",
      "userUrl": "https://www.imdb.com/user/ur31638149",
      "reviewLink": "https://www.imdb.com/review/rw3380816",
      "warningSpoilers": false,
      "date": "26 December 2015",
      "rate": "10",
      "helpful": "135 out of 162 found this helpful.",
      "title": "My childhood..",
      "content": "At the start of J.K. Rowling, thank you for this wonderful series of books forever. I can tell you this current state of my childhood and my future. Sign up everywhere it has always been a part of Harry Potter's name. I'd say the most important series of my life. I owe my childhood such wonderful pass to the books and movies of this series. In this series, even though I know better than the series it has always been a special place for me in this series and it will always continue. This movie is definitely the best in the series. And the players is the most mature film. You feel throughout the film until the end of the final air and this is an amazing thing for fans like me. Book series as well as certainly never did. However, in each film it was pretty cool. And with incredible finale made this film. Harry certainly kept the best for last. Put all the music from the beginning to the end of the movie you are very successful and internal chills. You feel deeply cool is really going on. When the film ended up being a very big gap within you. Of course, you are a part of this world..."
    },
    {
      "username": "Loving_Silence",
      "userUrl": "https://www.imdb.com/user/ur23582121",
      "reviewLink": "https://www.imdb.com/review/rw2457681",
      "warningSpoilers": false,
      "date": "12 July 2011",
      "rate": "10",
      "helpful": "489 out of 687 found this helpful.",
      "title": "Harry Potter and the Deathly Hallows: Part II gets everything right to send off Harry on a cinematic high",
      "content": "I am a huge fan of the Harry Potter books, they're all so great and magical. But I didn't think the film series were perfect at all, but they were still great movies. With that, I was extremely excited to see the end of the film franchise, and impressed with the trailers. So I had high expectations. And thankfully it did not disappoint, Harry Potter and the Deathly Hallows: Part II, blew past my already high expectations and I was enthralled!The whole movie looked spectacular! The cinematography extremely well done, the art direction was incredible. The movie was beautiful to look at, the visuals were spectacular and truly Oscar worthy! The set designers, cinematographers really need to be awarded for their work, because it looks like they spend of time and money on the look of the film. The cast of the film was pretty much perfect, they should all be applauded too. Emma Watson, as usual is and great and she'll have a bright career ahead of her. Rupert Grint is pretty much great also, he is a fine actor indeed. Daniel Radcliffe did an amazing job and was very memorable as Harry Potter. Although I think Ralph Fiennes was the star of the film, he did unbelievable job as the evil, crazy Lord Voldemort, I think he deserves an Oscar Nomination for his role. The rest of the cast were also great too.We all grew up overtime with the series, we followed the adventures of Harry Potter for around 10 years, I think. It seems very weird that there will be no more Harry Potter films to look forward too. I will miss the franchise very much! However I am happy the series got an amazing ending. Harry Potter and the Deathly Hallows: Part II is not only the best film in the series, but it will probably be one of the best films of 2011. Everyone should see this film, even if they don't like past Harry Potter films."
    },
    {
      "username": "theycallmemrglass",
      "userUrl": "https://www.imdb.com/user/ur18874471",
      "reviewLink": "https://www.imdb.com/review/rw2456569",
      "warningSpoilers": false,
      "date": "7 July 2011",
      "rate": "9",
      "helpful": "300 out of 435 found this helpful.",
      "title": "An Exhilarating and Beautiful Conclusion to a Magnificent Saga.",
      "content": "I saw this at a preview screening in London.Deathly Hallows part 2 ends this incredibly well produced saga with tremendous grace and a beautifully orchestrated climax that I am sure will satisfy both lovers of the books and films.If you have read the books as I have you will be glad to know major key moments are intact. Much is missing but I won't dwell on that, no point, its how well this movie plays out and for me it rolls wonderfully between excitement, thrills and emotional drama towards a satisfactory (though a slightly rushed) conclusion. There are at least 2 sequences so powerful that I defy anyone not to at least stifle a tear or choke a little. One of those sequence is an exquisitely executed flashback that is pivotal to the whole story. I have to say, that despite the woes we book readers have when elements (big chunks of it too) are omitted from the movies, much credit still has to go to Steve Kloves for adapting the books for the big screen, cleverly weaving, changing and even adding new big elements to give a kinetic flow to the narrative and here it all comes together superbly.David Yates assured direction has nurtured our young actors in the last 4 films to blossom into even more adept actors who convey their characters with natural tones without overacting. Daniel Radcliffe had to carry this movie more than any other and has done so brilliantly complemented with great support from his two companions, Emma Watson and Rupert Grint.Pretty much all the characters we have met in all the movies have made an appearance in this finale but one actor stands out, Alan Rickman. His portrayal of Professor Snape has always been a joy to watch (if a little novel) but here his scenes will leave a dramatic engraving in my memory. Here he elevates his portrayal of one of the most complex character in young adult literature to an unforgettable piercingly emotional one.Another actor who really shines in the few scenes that he has, is Matthew Lewis as Neville Longbottom who we see gradually transforming over the past films from the clumsy bullied boy to a brave warrior in this final film. Many other British thespians of the series also have their few moments to shine especially Maggie Smith's Professor McGonagal who was a delight to watch as she takes charge of the defence of Hogwarth School.As for the spectacle of the battle and showdowns, while not at the scale of Lord of the Rings, I honestly cant think how it could have been done better as the film makers have intertwined heart stopping action with dramatic progressions in the narrative. Its actually more visceral and dynamic than the rather smaller scale battle of the brilliant novels (not to take anything away from Rowling's writing). Do I have any gripes? Yes I do. Although I applaud Steve Kloves for a difficult screenplay adaption...I think he could still have done better at explaining some odd anomalies that only readers of the book will understand. This might annoy you if you haven't read the books. But its a small gripe because what we get is delightful.What an amazing achievement to faithfully bring Rowling's epic saga to the big screen with the same cast and largely the same crew, maintaining the brilliant quality right to the end.Oh my god, its only just sinking in, this was the end....but what a great great end."
    },
    {
      "username": "akash_sebastian",
      "userUrl": "https://www.imdb.com/user/ur18279193",
      "reviewLink": "https://www.imdb.com/review/rw2458858",
      "warningSpoilers": true,
      "date": "15 July 2011",
      "rate": "7",
      "helpful": "280 out of 429 found this helpful.",
      "title": "Good Movie, But a Disappointing & Unsatisfying End to the series...",
      "content": "Overall, it may be said that the movie was good. The direction, cinematography & the special effects were brilliantly executed. The acting was good too. The children have grown so much.But, this isn't the way The Harry Potter saga was meant to end. A movie which is supposed to mark the End of an Era could have been much better. With the expectations I had, I was a little disappointed. It DID NOT have the depth and the emotional impact WASN'T nearly as good as the book. I was pleased with Part 1 because it stuck very well to the book. That's what I was expecting with this too. But no... they had to spoil it. What's the use of making the movie in two parts if they can't do justice to the book? They should have made it a Trilogy (as all great movies are made, like 'The Godfather Trilogy', 'The LOTR Trilogy', original 'Star Wars Trilogy', The Bourne Trilogy', etc.) or they should have increased the length of the 2 parts. Who forced them to fit the whole thing within 2hrs.15mins. each. ??(Every part of LOTR is over 3&1/2 hrs. long. No one had an issue with it). . *** SPOILERS **THE GOOD :Snape's and Voldemort's characters were played quite well.Throughout the series, Snape has been rather emotionless and monotonous. But, in the pensieve, we see a refreshingly new emotional side of him.Gringott's scene was nicely shown.They added the scene where Hermione & Ron destroy Hufflepuff's cup.They show the future (19 years later) scene. I thought it would be cut.THE BAD : (I have to mention these because I was disappointed as hell)My Biggest Disappointment - Snape's Memories. They showed the whole thing within a minute. They're some of the most interesting & touching scenes of the story. They just rushed through it, even excluding many of the memories. Fred's death. They don't even show it. Then later it was ridiculous to see Mrs. Weasley angry at Bellatrix when the latter was fighting Ginny.The battle was too short and didn't the magnitude and impact as in the book, with Centaurs, Goblins/Kreecher, Hagrid/Spiders, Ghosts, etc.They don't show the Common Rooms. I always imagined it while reading the books. But I badly wanted to see them in the movie.They don't show Harry using the Cruciatus Curse on the one of the Carrows.They wasted time in Nagini's chase.They don't mention about Teddy Lupin and that Harry was his Godfather. They don't mention the names of Harry's other two kids.No mention about the significance of the horcruxes.No mention of Bloody Baron and his link with Ravenclaw's diadem.No mention about how the Invisibility Cloak came into the possession of the Potters, how Harry and Voldemort are related through the Peverell brothers.They don't show how Dumbledore communicated with Snape after he died.Harry doesn't even mend is wand. He directly snaps the Elder Wand into two pieces...In the future scene, all the funny and cheerful dialogues are excluded. Everyone's just smiling and staring at each other. And moreover, none of the them seemed in their late thirties. Didn't the film-makers have enough money to hire good make-up artists.THE UGLY :Dumbledore's Story. He's my most favourite character in the book. There's nothing about him in the movie. They just say he had secrets (what secrets??). They don't even tell the story of Dumbledore sister, Ariana. They don't show him getting emotional at King's Cross.The use of ridiculous one-liners and humourless jokes when the situation is so intense and sad.Harry & Voldemort had their final fight in the middle of nowhere. No one was even around to watch it. (In the book, they were in the middle of the whole crowd.)Bellatrix and Voldemort die bursting into confetti!ALL IN ALL, it wasn't the send-off the series deserved. Someone who has grown up reading the books and watching the movies in the series will understand my woes..."
    },
    {
      "username": "moviexclusive",
      "userUrl": "https://www.imdb.com/user/ur23415028",
      "reviewLink": "https://www.imdb.com/review/rw2457961",
      "warningSpoilers": true,
      "date": "13 July 2011",
      "rate": "10",
      "helpful": "250 out of 402 found this helpful.",
      "title": "An exhilarating action-packed spectacle that delivers a magnificent finish to the beloved fantasy franchise",
      "content": "An incredible journey that began a decade ago finally arrives at its close with David Yates' \"Harry Potter and the Deathly Hallows: Part II\", as 'The Boy Who Lived' comes face to face with 'He Who Shall Not Be Named' in an epic showdown between good and evil. And what a showdown it is- tense, thrilling, breathtaking, and fitting of just about any superlative you can think of. Whereas the first instalment of the 'Deathly Hallows' emphasised the profound sense of loss and isolation among Harry, Ron and Hermoine, screenwriter Steve Kloves and director Yates leaves behind the moody atmosphere of the previous movie for newfound immediacy and urgency. This is all about that final battle where only one can live, and from start to finish- for once in a Harry Potter movie- the action is swift and relentless.Part II picks up right where the previous film left off- the dark Lord Voldemort smiles in evil triumph as he steals the most powerful wand in the world, i.e. the Elder Wand, from the tomb of beloved Hogwarts headmaster Professor Dumbledore (Michael Gambon). The next shot is equally ominous- students are marched rank-and-file through a Hogwarts courtyard, watched closely by cloaked Dementors hovering over the school grounds. If there was any need of a reminder of the danger facing our three protagonists, these opening sequences should just about refresh one's memory of what is at stake.There is precious little time to waste, and the first we get to see Harry, Ron and Hermione, they are already hatching a plan to break into Gringotts to retrieve a Horcrux. Their break-in settles upon a plan of deception that allows for some rare moments of levity in the film, as Helena Bonham Carter gets to ham it up as a polyjuice-disguised Hermoine impersonating Bellatrix Lestrange. This being the first 'Harry Potter' movie in 3D, Yates caters for some distinctive thrills in the additional dimension with a roller-coaster ride through the vault, culminating in a daring escape on the back of a dragon.But as readers of the book will tell you, the last stand happens back at Hogwarts, and true enough, after this thrilling early set-piece at Gringotts, the trio head back to the School of Witchcraft and Wizardry to confront their foes. It is also where the last Horcruxes are supposed to be, and Harry's return to the once sunny and cheery grounds now besieged by darkness and doom becomes a true test of allegiance. Fans will be glad that Kloves gives room for otherwise supporting characters to step into the limelight- in particular, Neville Longbottom (Matthew Lewis) emerges as one of the unlikeliest but also truest heroes on the side of good. The Hogwarts stalwarts also get a chance to show off their magic, and Yates gives each largely enough screen time for the heroic send-off they deserve.Yet he reserves the most emotional moment in the film for Severus Snape's (Alan Rickman) vindication, long thought to be the Judas Iscariot-equivalent in the Order and the one who pushed Dumbledore to his death. Yates delivers a truly poignant and deeply heartfelt revelation of Snape's true colours, and it is a farewell that even those who have read the book and can expect what is to come will be overwhelmed by its sheer emotional muscle. While Part II was always meant to be an action-packed spectacle, it is to Yates' credit that there is still as much heart as before in the storytelling.Though brief, this revelation also works brilliantly as a catalyst that propels Harry to come to terms with the sacrifice he has to make. Harry's realization of this leads up perfectly to the ultimate duel between him and Voldemort, one that is fierce, ferocious and- thanks to Yates' imagination- more exhilarating than reading it off the page. The outcome of that battle shouldn't be a secret by now, and when the 'happily-ever-after' coda in Rowling's book set 19 years later is also faithfully adapted here, you can't quite help but be moved by how it so properly gives the series closure.They are of course no longer kids here- Daniel Radcliffe, Rupert Grint and Emma Watson now young adults who have through the film series grown up right under our eyes. While Part I had greater emphasis on Ron and Hermoine, the focus here is squarely on Harry and Radcliffe truly shines in this instalment- his usual understated performance allowing his audience to appreciate the enormities of the challenge before Harry.That we can be so fully immersed in Harry's world is testament to the craft of each and every one of the technical team. Production designer Stuart Craig does a masterful job portraying the devastation around Hogwarts, complimented nicely by Eduardo Serra's beautiful cinematography and Mark Day's skillful editing. Alexandre Desplat's evocative score, which combines his own elegiac work with both the John Williams theme as well as Nicholas Hooper's mournful composition for the sixth movie, works magic with the visuals. And most deserving of credit is none other than director Yates himself, who has matured movie after movie to deliver a crowning achievement for the series.Pardon us if we have also taken this opportunity to extol the merits of the 'Harry Potter' franchise- it's really hard not to considering how this is the last time we will see the Potter-world in its current incarnation. It is this to which the movie is a farewell to, and it is as beautiful a farewell as it can be, packed with visual spectacle on a scale never before seen in any of the other films and fused with the same powerful emotion as Part I and the Yates films before. All good- even great- things have to come to an end, so there is really no better way to bid adieu than with this grand and glorious final chapter."
    },
    {
      "username": "faaiisal-50256",
      "userUrl": "https://www.imdb.com/user/ur104440968",
      "reviewLink": "https://www.imdb.com/review/rw7291509",
      "warningSpoilers": false,
      "date": "31 August 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "A 2021 opinion of someone who has not read the novel and watched the series at two different decades of his age",
      "content": "In the beginning, I want to thank the author j.k. Rowling, even tho I didn't read her books but I saw it in this magnificent series of films I didn't read it because English is not my mother language at that time and I didn't think the translated version will be as great as the original.But now after what I have seen in the series twice, I am considering reading it After I improved my English over the years.About the series, I saw it when I was younger nearly 10 and it was great but now when I saw it a second time while am 19 I understand it and appreciate it more it becomes greater, I wished I saw it in theater Yet None of its value has been lost by watching it on the tv.At third. As for the characters, there were great performances from all of them, but I loved the most harry and Hermione and comes second snape, Sirius, Hagrid, 2001's dumbledore, luna, Wesley.It's by far The largest number of great characters I've seen in one movie series.In the end. About this last part of the series, it created a perfect ending Any fan would seek for, I won't spoil by talking about details but I've experienced every emotion I have on it.It was really a masterpiece by all what it means."
    },
    {
      "username": "abisio",
      "userUrl": "https://www.imdb.com/user/ur0879559",
      "reviewLink": "https://www.imdb.com/review/rw2458801",
      "warningSpoilers": true,
      "date": "15 July 2011",
      "rate": "",
      "helpful": "90 out of 138 found this helpful.",
      "title": "In the future AVOID any movie with Mr. Yates as director",
      "content": "Harry Potter's saga had many directors; I will not go back again to who was the best (hint; a Mexican guy), but by far Mr. Yates was the worst. Mr. Yates was only interested in make an easy sell PRODUCT. The only reason the first was paced was to fill out two movies with only one book. Now, we are at the end so WHO CARES, let's just finish it, get the money and keep going. Clocking barely two hours, it feel rush and incomplete; missing lots of interesting (and even important) parts on one of the richer book of the series. Hermione and Ron do almost nothing; the others even less. Harry gets a lot of screen time but not necessary good scenes. Even the battle at Hogwarts (the only part Mr. Yates seems to be interested ) is a lame copy of \"The Two Towers\" without any kind of emotion. His direction so bad and unimaginative that when most of the characters die; we do not feel anything. In brief; worth seeing to understand how better the book is and because it is the last one; but AVOID any further movies with David Yates as director."
    },
    {
      "username": "TourettesPersonal",
      "userUrl": "https://www.imdb.com/user/ur18387520",
      "reviewLink": "https://www.imdb.com/review/rw2461074",
      "warningSpoilers": false,
      "date": "19 July 2011",
      "rate": "9",
      "helpful": "125 out of 184 found this helpful.",
      "title": "Better Ending",
      "content": "Endings are usually the problems of most movie series. They usually end up being mediocre & unsatisfying or they are made to cash in people. The great thing about Harry Potter movies, the filmmakers are taking their job seriously. Harry Potter and the Deathly Hallows Part 2 is a great ending of the series. It's more than throwing a lot of action and exposition. Harry Potter and the Deathly Hallows Part 2 is one of those conclusion that actually care about the series.Deathly Hallows part 1 is just the first and the half of the second act of the story. Deathly Hallows part 2 begins straight forward to its continuation of the last Harry Potter film. And of course, if you haven't seen Deathly Hallows Part 1 or any of the Harry Potter movies, you'll be confused to death. Obvious isn't it? It's pretty clever to make the whole Deathly Hallows story like a slow burn. It started from silent thrills, plans, and escapes to big and loud battles.The series doesn't only end with big and loud action. It also gives us some nostalgia from the old Harry Potter films. And we still get to see more of the characters. The movie itself is pretty exciting. It's a good choice to let David Yates direct the rest of the Potter films because he made this series darker and bolder. Aside from that the film still has its compelling moments like the Prince's Tale scene.No need to tell about the performances of Daniel Radcliffe, Rupert Grint, Emma Watson and the rest of the cast because they are obviously good to their characters but there is one actor here is worth mention and that is Alan Rickman. We already knew him as Snape but there is one scene where we see more of his character and his performance was excellent. The filmmaking, the special effects is obviously good. The music score really made the battle scenes epic and perfect for a final film.For me it's really hard to write a review about Harry Potter. Is it because I never read the books or I'm not really a huge fan but in my opinion Harry Potter is a successful series. If I rank all the movie conclusions, this could be number three because nothing beats Lord of the Rings and Star Wars. Either you're a fan or not, you'll love this series. And yes, this is another remarkable movie series."
    },
    {
      "username": "DonFishies",
      "userUrl": "https://www.imdb.com/user/ur1622466",
      "reviewLink": "https://www.imdb.com/review/rw2467291",
      "warningSpoilers": false,
      "date": "31 July 2011",
      "rate": "8",
      "helpful": "51 out of 78 found this helpful.",
      "title": "A breathtaking finale to an amazing series",
      "content": "Moments after I saw the very first trailer for Harry Potter and the Deathly Hallows, I was crawling with goosebumps and plagued with anxiety. After almost a decade, the franchise was coming to an end. I had already read the book, knew the plotting, and remembered the fates of all the characters, but the trailer left me in a near unfathomable state -- the end was coming, and there was nothing I could do to stop it.Picking up practically the exact moment where the first half of the left off, the film begins with Harry (Daniel Radcliffe), Ron (Rupert Grint) and Hermione (Emma Watson) still on the trail for the elusive Horcruxes that make up Voldemort's (Ralph Fiennes) soul. Rather quickly, it becomes apparent that the group will need to travel back to Hogwarts, and it is there that the final battle to determine the fate of the wizarding community, and the world at large, begins.Harry Potter and the Deathly Hallows Part 2 is a fitting finale for one of the best and most consistent series of the past decade. It is a simply wondrous spectacle that extends and concludes the story wonderfully. While the story and effects are just as great as always, it is the final battle we have all been waiting for that delivers in spades. It is everything you imagined it would be and more. Splitting the films may still be a debatable decision, but the film is able to stand on its own much the same way the previous part did. It is that good, and that gripping. It may be the shortest Harry Potter film, but it is also the only one that feels like it knows exactly where it wants to navigate itself to with each new scene. Grint, Watson and especially Radcliffe are simply stunning in their performances. They have grown up with these characters, and have gotten progressively stronger as actors with each new film. But here, they have totally immersed themselves into their roles, and the results are nothing short of magical. They are exactly how you remember them written in the book, and move from sadness, to courageous, to fearful, and more, with such passion and conviction that you forget they are simply acting. Their styles are that strong, and help provide the emotional crux the film leans on and never from. Even with their varying screen times, the supporting cast is impeccable as always. Alan Rickman is spectacular and simply devastating as the devious Professor Snape. Maggie Smith finally gets some real time to shine as Professor McGonagall, as does Julie Walters as Molly Weasley (who gets the greatest line in the film). Jason Isaacs, Helena Bonham Carter, George Harris, Tom Felton, Michael Gambon and Matthew Lewis also perfect their characters, and help deliver awesome performances all around.But the supporting screen time is dominated by Fiennes as Voldemort. When Harry and his friends are not the focal point, Fiennes simply owns everyone. His performance always ranked amongst the best of the series, and he does not let the finale slow him down. He is horrifically evil in his interpretation, and frequently compares to his absolutely and terrifyingly brilliant performance as Amon Goeth in Schindler's List. The fear that courses through the characters' veins at the very sight or mention of his name, courses equally through the audience. Even when he is being darkly hilarious, Fiennes is downright petrifying. He is the stuff that nightmares are made of. His work is just that close to perfect in the role that it gives an almost genuine authenticity that should not come so effortlessly.But like all Harry Potter films however, the cohesive product is not without its faults.My main gripe with the film come out of the sheer fact that because it was split off into two parts, it allowed some of the more useless and careless sections of prose to make it into the film. Much like the extended and excruciatingly long camping trip from the first half, the second half gets dragged down by the addition of standout moments from the book that felt awful the first time you read them, and come off even worse on the screen. I know they are pandering to the audience, and adding just as much as they possibly could to make the film feel complete, but there was a reason so much was cut out of the other books when they made the leap to the big screen. This is the shortest of the saga by a long shot, and the chaotic pace makes it feel like it could have been even shorter had they chopped more out.My other gripe is the 3D. The filmmakers said they did not have the right amount of time to convert the first half properly, so they just scrapped the plans. The movie looked amazing anyway, and I found myself puzzled at what exactly would have been three-dimensional about it about the second part. Save for a scene early on involving a rather badly rendered dragon, there is not much else that takes advantage of the added 3D. The majority of the film just looks and acts normal, never exploring the format, and never giving the audience a reason to care or change their minds on the quickly dying trend. In what feels like a blink of the eye, the Harry Potter film series is over. Harry Potter and the Deathly Hallows Part 2 has arrived, and with it, an incredible end to the franchise. It stumbles in some places because of the inane and disappointing prose of the book, but the filmmakers have stayed true to their book and film fans, and delivered a tremendously worthy finale. It is one of the strongest films of the year, and one of the best film finales ever conceived. 8.5/10.(An extended review also appeared on http://www.geekspeakmagazine.com)."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3412002",
      "warningSpoilers": true,
      "date": "10 February 2016",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Action packed, genuine heart and emotional drama made this movie, a very engrossing magical epic spectacle. It has everything, a finale should have.",
      "content": "While, personally, I'm not the biggest fan of the books in which these films was based on, I do have to say, this movie is a great movie to end the Harry Potter film series with. 10 points to Griffindor & director David Yates! Author J.K Rowling would be proud. The movie is very memorable. It's so unlike the other movies, which I found to be somewhat boring or below average. For me, personally, this movie, by far, is the best movie in the 2001 to 2011 film series, because how entertaining, it was. To all of the millions of Harry Potter fans around the world; most of them, agree with my statement. Unlike the other movies that are cut into two formulaic plot directions; one being the subplot is which tells the student life of Harry Potter at Hogwarts, while the other, being about the mystery that Harry Potter must uncovered that year. This most recent one has Harry Potter (Daniel Radcliffe) and his gang of misfits, Hermione Granger (Emma Watson) & Ron Weasley (Rupert Grint) going to various settings away from Hogwarts, in a last ditch attempt to their school from the oncoming invasion of Dark Lord Voldemort (Ralph Fiennes). The only way, they can stop this, is to find, all the missing objects call Horcruxes; that hold a part of a Voldermont's soul, protecting him or her from death. Seeing how epic in scope, this main plot is, it was no surprised that this 2007's novel with the same name, was adapted into two feature-length parts, with Part 1, being released in November 2010, and Part 2 was released in July 2011. While, some people might have complaints about why the final book being split, I'm not one of those. However, I'm starting to hate the recent trends of films, split into multiple parts; in which this movie brought back. Still, I do understand why the studios felt like they had to. After all, there is still way too exposition sub-stories from supporting characters from the book to fit, even in two films. Despite the film omitting a lot of things, the movie is stil mostly faithful to the source material, with only a few things, change that I didn't like. One of the biggest faults of the film is how both young and old Lily Evans (Ellie Darcey-Alden & Geraldine Somerville) doesn't have the same eye color as Harry Potters. The reason why this is a big deal, is because how much, everybody in the film series, point out how Harry Potter remind them of his mother, because of his eyes. It makes no sense. Another big jarring confusing plot-holes, is how wizards, can or cannot being able to use, other people's wands. In the film, one thing that really baffled me, is how Voldermont thinks that he can't use the elder wand, until he kills Professor Severus Snape (Alan Rickman). Yet, it's show, before-then, that he can indeed use that wand to do magic and other people's wand. The same with Harry Potter. It's weird, how the film makes it seem like they can't do magic without a wand, but yet, they show, them, just doing that with potions. Also, why does people still die in this universe, if Harry Potter has all of the three deadly hallows? Oh Snap! Didn't they establish that one of the wizards knows, how to heal himself with magic, if it's a bleeding wound? How is that character, even dead? Also, how can a living object become a horcrux? It doesn't make sense. In my opinion, don't bother, trying to understand the logic of all the wizard terms, because it will take you out of the fantasy movie, and give you a headache. The movie is full of unbelievable, deux ex machina that is very confusing, and not very logical. You just have to go with it. Nevertheless, I still don't get, why this movie is continuing its insulting black & white one-dimensional views of good Vs evil. A good example in this movie, is how everybody still treat Slytherin's house as an evil community of people, when the movie show that, there are mostly not!? Another thing, that bug me, is the fact, that the underage students weren't evacuated from Hogswarts. I guess, the school is trying to continue, its high death count record of being one of the most dangerous schools, ever. I swear, it always seems like the castle is always in danger. So, I wouldn't call the battle plot, anything new. It is very clichés and prediction. Despite that, the battle sequences are well done. Visual and special effects masterpiece. Lots of heart-breaking, yet fun moments. The music by composter John Williams really set the tone of the film, as always. The pacing for this film is also not a drag. Very well-pace. It's the shortest of all 9 films. The main cast was surprising better, too. Yes, they still, have that wooden delivery in some of their lines, but at least, it's more emotional driven than a normal read-through. Also, the over the top hammy lines by the season actors weren't so annoying this time, because how few lines, they were given. However, I didn't like the Epilogue ending as much as other people did. I can understand why a lot of people don't like it; in a way it feels a bit jumbled because so many characters of this new generation are introduced too quickly, and it's a bit much to take in. I personally am not too keen on the idea. It felt like sequel baiting. After all, it's clear, by Warner Bros that we haven't seen the last of this world completely, as spin-offs movies are indeed, coming soon. Overall: In the meantime, I urge you all to revisit the world of Harry Potter for yourself. Check out all 9 movies. It will be a trip, worth taking."
    },
    {
      "username": "nilanna999",
      "userUrl": "https://www.imdb.com/user/ur26297308",
      "reviewLink": "https://www.imdb.com/review/rw2460400",
      "warningSpoilers": true,
      "date": "17 July 2011",
      "rate": "6",
      "helpful": "22 out of 31 found this helpful.",
      "title": "Explain, movie!! EXPLAIN!!!",
      "content": "Everything that could have been said about this movie has probably been said.WHAT I LIKED: -I feel like I was the only one who really appreciated the use of humor in the movie, it was perfect. I loved the jokes and their timing. While this wasn't close to a comedy, it kept the charming humor of the previous Harry Potter movies and I appreciated that the movie didn't take itself TOO seriously.-Showing Hermione destroying the Horcrux. This was a scene I really hoped they'd show. In the book it was a brief mention. In the movie, they show the full scene. I also liked that, if they couldn't have Ron's comment defending the house elves as the reason Hermione kissed him, this was the next best reason.-Neville and Luna had larger roles in this movie. I was particularly pleased with Luna's larger role and that she had the guts to put Harry in his place.-The CGI was pretty good.-The acting is VERY good.-They change JK Rowling's plan in one minor way- by putting Neville and Luna together. TOO CUTE!! And just perfect!! -The original HP theme from the first movie at the end. It made me very emotional. I loved that they used John William's piece instead of making a new one. How sweet.WHAT I DIDN'T LIKE -The timing was all wrong. The scene in which Mrs. Weasley kills Bellatrix Lestrange is just bizarrely placed, almost like they would have cut that scene if her one-liner hadn't become so famous.-Since when do people explode when they die? -Harry kills Voldemort without using his famous spell... it's just a random burst of red light from his wand. Not only that, Voldemort bursts into ashes. Random. An there's no dialog between them, just fighting. There's no one to see Harry finish him. A terrible way to change a great scene from the book.-There was NO explanation for ANYTHING!! I mean it, they set up Gridelwald's story... then never do anything with it. They never mention the third of the Deathly Hallows- the cloak. They never explain why Harry knows that Lupin has a son. They don't explain Dumbledore's back story, and so hinting to it is just frustrating. They never explain what happens to Harry's wand. They even don't explain why Harry isn't killed for real when Voldemort kills him. All in all, as a reader of the book, I understood it all but anyone who hadn't read it would be pretty lost.-Snape's flashbacks. They were okay but I hated the scenes of him crying over Lily's body in Godric's Hollow. EW!! It was creepy, never mentioned in the book, and almost seemed stalkerish. It didn't make me want to like Snape, it made me cringe!! Not only that, they never really explain that Snape was never Voldemort's after Lily's death.-Young Lily's eyes are very much BROWN in the flashbacks. They couldn't have put in some colored contacts? -No one looked 19 years older in the future scene. They looked weird. The prosthetic team failed miserably.-The future scene didn't show the kids much. Actually there was no dialog except between Harry and Albus. They couldn't have made the movie 5 minutes longer? All in all, they really should have explained more like in the last movie. It felt rushed. And confusing. Not the worst of the Potter movies (Goblet of Fire was worst) but not the best (Chamber of Secrets was best). So I gave it a 6. Pretty good. But not great."
    },
    {
      "username": "cchip96",
      "userUrl": "https://www.imdb.com/user/ur23874203",
      "reviewLink": "https://www.imdb.com/review/rw2458754",
      "warningSpoilers": false,
      "date": "14 July 2011",
      "rate": "10",
      "helpful": "201 out of 287 found this helpful.",
      "title": "\"It all ends\" well",
      "content": "This movie could not do any better, it ended the Harry Potter series with a bang. It is a good balance from the first part of The Deathly Hallows. The first part was more of a drama, while part two was action packed left and right. This may be my favorite movie of the series, though all of them are equally amazing. I have read the books, and there are definitely major changes in the movie, but I find they fit perfectly well with the story, even if it isn't the original plot. Even for those who haven't read the books (why wouldn't you?!), it is equally enjoyable. This movie, along with the rest in the series, will be loved for years and years to come."
    },
    {
      "username": "Students_SimoneVeil",
      "userUrl": "https://www.imdb.com/user/ur86177282",
      "reviewLink": "https://www.imdb.com/review/rw5335730",
      "warningSpoilers": false,
      "date": "20 December 2019",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Awesome Harry Potter",
      "content": "The plot is very original and incredible, I think it is one of the best film ever. IF you love fantasy movies you should watch this. The cast is excellent, I love Emma Watson in this movie, she plays very well. In my opinion, this movie is the best adventure movie in the world because the plot is really awesome. Thank you JK Rowling and Steve Naves ! The special effects are incredible and the soundtrack epic. I think it the greatest movie. It lasts 2 hours and 10 minutes but it is not boring. Even is you don't like drama, adventure and Fantasy movies, you must watch this one, it will change your opinion."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw2457883",
      "warningSpoilers": true,
      "date": "13 July 2011",
      "rate": "",
      "helpful": "11 out of 17 found this helpful.",
      "title": "Jarndyce and Jarndyce",
      "content": "I have read only a small portion from the books, but enough to understand the woman's approach. I have, however, attentively watched all the films. This comment applies to the entire saga with some attention to the final two.Charles Dickens invented a style of writing that is well suited to some kinds of cinematic adventure. What he would do is invent a world, and thoroughly understand its dynamics. These really were invented worlds, though today they appear as though he was writing about his own. He was an absolute genius at discovering certain objects and characters in these worlds and giving them powerful names. Then he would let his characters loose; he literally would write and publish the first episodes of what we read today as whole books. He would send the chapters out, trusting that his named entities would weave their own story. The result is pure joy when reading because the world is whole enough to carry us.It is also why his books all end clumsily.Rowling works very much in this style, the first chapters sent aloft while the story is still soft; the impressive ability to name things; the creation of a universe of sorts. As though she understands this, her alternative world is extended not from our modern technological one, but from Dickens' Victorian England. The filmmakers, starting with Columbus, understood this and adapted what they supposed we supposed were Victorian manners, costumes and architecture. The dragons are sourced not from modern models but from drawings of that period.So the strength is that we are sucked into the world. Usual offenses from clumsy plots, unnecessary events, artificially placed combat and all are made invisible because we care not about the story per se, but the world that supports it. We care less about any of the characters, than the names the carry. That is Dickens' gift. I do like a few names Rowling devised; they are worthy.Otherwise (meaning without the Victorian art, and Dickensian names) we may just as well be watching a Michael Bay film.The previous film had a folding device I appreciated. We are told a story that is supposed to be central, the story of the 'Deathly Hallows.' Now as it turns out, the three objects described in the story are not any more central than any of the other named objects, but we don't know that in the seventh film. The story is told in a shadow puppet form, one we have seen a couple times already this year. The level of abstraction is the same from the Harry Potter universe as that universe is from ours, which is why it matters in the end that Harry destroys one of the three objects.Previous films, starting with the fourth I believe, had the 'pensieve,' a clever device which allows Harry to see movies of the past. The dynamics of the thing are strange because they are supposed to be recreated memories, but the viewer sees them cinematically. We gloss over the difficulty just as we do with alien invaders speaking English. I did appreciate the design of this thing as it evolved in the films, but it retains the inkflows. That works well in combination with the inkflow-like trails of Voldemort's flying minions.Lily Evans as a redheaded girl is adorable.Ted's Evaluation -- 3 of 3: Worth watching."
    },
    {
      "username": "rsre4-1",
      "userUrl": "https://www.imdb.com/user/ur16164386",
      "reviewLink": "https://www.imdb.com/review/rw2459063",
      "warningSpoilers": true,
      "date": "15 July 2011",
      "rate": "",
      "helpful": "421 out of 690 found this helpful.",
      "title": "Too Bad It Ended Like This",
      "content": "OVerall it was okay, and will make a bunch of money. But David Yates was not the best to direct the Potter films. His method always seems to be to just get through the movie as quick as possible. This has been true since OOTP. The problem is that such a quick pace leaves out many key scenes and doesn't allow the viewer to make more of an emotional investment in the story and the characters. Deathly Hallows 2 was no different. It was enjoyable enough, I suppose. But could have been so much better with just an additional 10 minutes of movie. A few additional scenes and extending a few of them just a little more could have added greater depth and emotion.Spoiler alert: Just some scenes that could have been added or extended: Snapes memories- a few more scenes to greater establish his closeness with Lilly and his role in fighting Voldemort. It would have helped to explain why Harry named one of his kids after a man he had hated for 7 years. And a few more lines to show his reluctance to have to be the one to kill Dumbledore. This would have shown Snapes greater respect and love for him.Slightly extend the scene leading up to Mrs. Weasley fighting Belatrix. A few more seconds to establish Jinny's peril in the fight before Mrs. Weasly stepping in and uttering her great line. IT happened so fast, you could miss that Jinny was even fighting Belatrix if you blink at the wrong time.SHould have shown the death of Fred and Percy's reuniting with the family. This wouldn't have taken very long and Fred deserved to have his death scene, rather than just being an afterthought body on a stretcher.SHould have shown a few more individual fight sequences, especially with Hagrid. I was beginning to wonder if Hagrid was even going to appear. And there was no emotion from him when he thought Harry was dead.Extend the scene of Mrs. Malfoy and Harry to better explain why she lied to Voldemort about Harry being dead.Should have shown more entities involved in the fight, like parents, Hogsmead residence, the elves as lead by Kreacher - rather than showing mainly an army of kids fighting the Death Eaters.MOre of the school's teachers in the fight.The final confrontation between Harry and Voldemort could have been done better and stayed truer to the book.OVer all, Yates' Harry Potter movies have been rather emotionless and anti-climatic. DH2, sadly, was no different."
    },
    {
      "username": "ephoratus",
      "userUrl": "https://www.imdb.com/user/ur24572890",
      "reviewLink": "https://www.imdb.com/review/rw2458293",
      "warningSpoilers": false,
      "date": "13 July 2011",
      "rate": "10",
      "helpful": "290 out of 442 found this helpful.",
      "title": "Epic End",
      "content": "Even though I consider myself to be a huge HP fan I never thought I would actually give a movie from this series straight 10 out of 10. Just saw the movie today and the word epic is almost an understatement. This movie really lives up to the promises that have been made. Further more it is (in my opinion at least) the movie that stays most loyal to the book. I did miss some scenes from the book yet nothing relevant was left out. I don't want to give out any spoilers 'cause I don't want to ruin it for you but if you have read the book it will be very easy to follow and if not - well I think it still makes sense most of the time. I highly recommend you to watch it whether you're a fan or not. 10/10"
    },
    {
      "username": "jburtroald95",
      "userUrl": "https://www.imdb.com/user/ur20744367",
      "reviewLink": "https://www.imdb.com/review/rw2463890",
      "warningSpoilers": true,
      "date": "24 July 2011",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "I can't believe this is the last Harry Potter review I'll ever get to write!",
      "content": "Fifteen years of tireless, incredible hard work from some of the best of Britain's storytelling talent, supported by an equally faithful and eagerly devoted fan base, now culminates in the cinematic experience of a lifetime. Ever since the frothily juvenile but still undeniably good quality Harry Potter and the Philosopher's Stone first hit cinema screens in 2001, the Harry Potter saga has experienced countless crucial plot developments, more and more introductions of new characters and actors, several new directors and frequent changes of tone, all to give an astounding and vastly rewarding end result. As a stand-alone film, this largely action heavy film would most likely be dismissed as merely glitzy uninspired bore, but our familiarity and previously established emotional connection with these characters and their stories means that we are holding our breath during every dangerous moment instead sitting back indifferently and indulging in ego- boosting cynicism. Today's moviegoers will not just simply throw away their sympathy and compassion at any tortured, miserable face a director puts on the screen, unless the film in question is a serious depiction of a real-life tragedy. However, when it comes to the Harry Potter characters, there is a remarkable type of long-term relationship that has been built over our long period of acquaintanceship with them, transcending the usual barriers that are placed in front of fictional characters and ultimately making this an impossibly lovable and endlessly enthralling movie.Part 2 of the final chapter initially continues in the vein of its taut yet gloomy predecessor, showing our three effortlessly likable main heroes on their believably difficult quest to locate and destroy Lord Voldemort's horcruxes. Whilst searching, they must constantly be on the lookout for any of the dark lord's ever more numerous agents who are trying furiously to hunt them down. In addition to the vicious death eaters, many other wizard folk who were formerly opposing him have now begun to join his side of the battle out of a deep-seated fear. Others have simply found it easier and simpler to continue drifting along living sheltered lives and being, for the moment, cocooned from the horrors taking place outside. After the comically inept Ministry of Magic was swiftly overthrown, most of its employees have been compliantly carrying on with their everyday work, even though they know what they are contributing to. The same applies to the sedentary yet sinister Gringotts goblins, as we see when the trio makes a clumsy infiltration of the almost impenetrable wizard bank in order to find the next horcrux in a frivolously entertaining early action sequence that, like the opening sequences of the similarly paced Indiana Jones series, is a wonderful appetiser.However, nostalgically like the first six Potter installments, the bulk of this film takes place at the historic Hogwarts School of Witchcraft and Wizardry, placing the search for the remaining horcruxes in a profoundly different environment and atmosphere. Instead of feeling alone and helpless surrounded by nonchalant and corrupt citizens, they are amongst the most loyal and supportive friends anyone could wish for. The infallible trust and beautiful hope we see in their eyes as they see that Harry has arrived to rally them all into finally facing off the forces of evil that are oppressing them is astonishingly touching.However, this is all sadly a double-edged sword, with terrible consequences being presented as well as good points. Voldemort predicted that Harry would return to Hogwarts at some point to seek the aid of his old allies and is ready for him when he arrives. When he makes a full-scale siege on the castle in order to extract Harry, the hundreds of teachers and older students as well as the surviving members of the Order put up a fiercely brave struggle against a colossal dark army of snatchers, giants and death eaters. With the ongoing fatalities and mortal injuries, Harry's conscious is pricked by the thought that he is letting them down as \"the Chosen One\" by not being able to defend them. Our empathy is certainly with Harry as the guilt and the doubts overwhelm him, but it is clear that his friends would much rather die in this horrific battle then join Voldemort and gutlessly scavenge an undeserved existence. They stare in the face of terrible danger and somehow know that this can be overcome in the end.This rebellious spirit is supported Voldemort's visible deterioration. He cares only about avoiding death at any cost, and so he has in fact resorted to scavenging that miserable existence, with horrifying results. As the horcruxes are disappearing, he is experiencing a gradual destruction of the soul that is far worse than death. His final demise is far from sudden: the direction from David Yates drops small hints and artistic allusions that show the formerly great and powerful figure slowly being reduced to nothing. That this has all been depicted so effectively is largely attributed to the masterful acting from Ralph Feinnes, who has managed brilliantly to create a very fascinating character. It is often mentioned that the cast is filled with an abundance of accomplished British actors that help significantly to lift the status of the films. While there are countless acting veterans listed in the credits, apart from Feinnes, it is really only Rickman, Gambon, Maggie Smith and Helena Bonham Carter that are given a decent amount to flourish with. Matthew Lewis is another standout, giving a terrific performance incredibly noble, righteous and heroic Neville Longbottom.Harry Potter and the Deathly Hallows: Part 2 is a film undoubtedly about loyalty, and both its characters and its fans are in the end rewarded by it. For that, and all of the other reasons, I look forward to seeing this gem soar up the top 250 as far as it can possibly go, and I hope it really pushes the buttons of the arrogant anti-Potter cynics when it land near the top."
    },
    {
      "username": "annbss",
      "userUrl": "https://www.imdb.com/user/ur69373227",
      "reviewLink": "https://www.imdb.com/review/rw5741857",
      "warningSpoilers": false,
      "date": "16 May 2020",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Childhood/teens favorite movie saga!",
      "content": "Harry Potter is one of my favorite childhood movies ever. I discovered my passion for films and movies by watching these and I still adore all of them. There's absolutely no doubt about it. I always have an interest about the kind of movies I like. So, Harry Potter has been quite a journey. Emma Watson, Daniel Radcliffe and Rupert Grint have been awesome from start to finish. These are the best memories that I can keep on forever. This is a lifetime movie. It brings adventure, travel, humor, sports, and a spectacular epic soundtrack and storyline throughout this whole process of filmmaking. There's also a sense of generosity and above all love. So, I'd highly recommend watching the movie saga."
    },
    {
      "username": "Houmatt",
      "userUrl": "https://www.imdb.com/user/ur0369136",
      "reviewLink": "https://www.imdb.com/review/rw2459058",
      "warningSpoilers": true,
      "date": "15 July 2011",
      "rate": "5",
      "helpful": "89 out of 148 found this helpful.",
      "title": "Am I the only one to be disappointed??? ***spoilerrific***",
      "content": "Yeah. I came out of the film disappointed. Not feeling like I had a good time.Don't get me wrong, it was a good movie. But there are things that brought it down and too many of them for it to be forgivable.1) Dumbledore's brother and sister. You know what I mean. Referred to and never followed upon.2) The kiss. Didn't happen in the Chamber of Secrets. In fact, did the Chamber scene happen at all? In the book, it happens after Ron expresses concern for the welfare of the elves (in light of Dobby's heroic death) in the outbreak of a fire at Hogwarts. Here, it is given to you as a variation of the \"We're alive! Let's kiss!\" movie cliché'.3) Fred's death should have been on screen. Period.4) The Avada Kedavra curse didn't make bodies disintergrate. Until Voldemort (and perhaps Bellatrix, too?). What? 5) The roles of Matthew Lewis and Evanna Lynch (Neville and Luna respectively) were enough to warrant their names as part of the supporting cast. To only see their names in the full cast is scandalous to say the least.(And, yes, I am aware two-time Oscar winner Emma Thompson gets the same treatment. I know she makes two small appearances, but again, she has two bloody Oscars! Either she is very humble or she needs a better agent.) 6) They really should have stuck with the CGI aging. Except for maybe Ginny and Draco, none of them looked like they were 36."
    },
    {
      "username": "saarvardi",
      "userUrl": "https://www.imdb.com/user/ur2812446",
      "reviewLink": "https://www.imdb.com/review/rw2457029",
      "warningSpoilers": false,
      "date": "11 July 2011",
      "rate": "9",
      "helpful": "17 out of 26 found this helpful.",
      "title": "They finally got it right!",
      "content": "While never an avid Harry Potter fan, I have watched all eight Harry Potter films on the big screen over the past decade. It's been a long, bumpy ride, with some films stronger than others - mainly the first few (in my own honest opinion). After a while, however, it all felt like the biggest cinematic tease ever. I mean, we've been told about Voldermort ever since the beginning, and we've known all along that the saga will end with this big, epic fight between good and evil... err, I mean Harry vs. Voldermort. However, that never came (except for a few teases here and there), and when the producers decided to postpone the inedible and split the last film into two, it became ever so frustrating.Thanks god, then, that Harry Potter and the Deathly Hallows: Part 2 came along to right all the wrongs the previous films have made and to give us the proper closure we've all been waiting for. Finally, after all this time, we get to see the main protagonist for more than a glance. We get resolutions to plot lines that began in parts 6 & 7, Hogwarts makes an awesome comeback for one, final stand between forces between both sides, and there are even some twists and turns that echo all the way back to parts 1 & 2.So yes, THIS is the Harry Potter we've all been waiting for all along: edgy, dark, more mature and complex than ever before, with solid performances from all involved (especially Ralph Fiennes, who gets some space to play with his character, and that guy that plays Neville Longbottom, who grew up to become quite a man from that mousy little kid he once was). But more so - and unlike any of the other films in the series – HP7b stands as an independent piece (alongside its 2010 counterpart), and doesn't leave the viewer unsatisfied. Here, we get a proper ending, we know this is the Harry Potter to end all 800 or so films that came before, and it seems that the producers knew this and gave it all they could. I only wish they've done this more often during the previous films, instead of saving the best for last.All in all, this is THE best Harry Potter I've seen from all the eight, and a truly exciting roller coaster of a film, filled with top notch storytelling alongside impressive special effects (even the 3D felt appropriate and relevant). I gave it a very solid 9 out of 10."
    }
  ],
  "errorMessage": ""
}