{
  "imDbId": "tt1979320",
  "title": "Rush",
  "fullTitle": "Rush (2013)",
  "type": "Movie",
  "year": "2013",
  "items": [
    {
      "publisher": "Total Film",
      "author": "James Mottram",
      "link": "",
      "rate": "100",
      "content": "Utterly gripping. Aided by two punchy lead turns, an Oscar-worthy script and stunning in-car footage, Howard’s race film delivers top-gear drama. A piston- and heart-pumping triumph."
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2013/film/reviews/rush-review-ron-howard-1200596801/",
      "rate": "100",
      "content": "Not just one of the great racing movies of all time, but a virtuoso feat of filmmaking in its own right, elevated by two of the year’s most compelling performances."
    },
    {
      "publisher": "Film.com",
      "author": "Laremy Legel",
      "link": "",
      "rate": "86",
      "content": "Rush is one of those rare sports movies that’s compelling as both a drama and a spectacle."
    },
    {
      "publisher": "The Playlist",
      "author": "Kevin Jagernauth",
      "link": "",
      "rate": "83",
      "content": "Rush is a pretty thrilling piece of pop entertainment. It's excitingly assembled and moves like a bullet, highly engaging and nerve-wracking when it needs to be and light on its feet elsewhere."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/rush-film-review-619675/",
      "rate": "80",
      "content": "Chris Hemsworth and Daniel Bruhl excel as, respectively, British wild man and hedonist James Hunt and Austrian by-the-books tactician Niki Lauda."
    },
    {
      "publisher": "The Telegraph",
      "author": "David Gritten",
      "link": "https://www.telegraph.co.uk/films/",
      "rate": "80",
      "content": "Rush has sex, glamour, a fair degree of wit and a breathless, pedal-to-the-metal spirit. But its greatest achievement may be to underline that there are real men, all vulnerable flesh and blood, inside those infernal machines."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "It rarely deviates from formula, but Rush wins big, delivering the most exciting F1 footage created for film. Like Hunt, it is sexy, funny, full of thrills. Like Lauda, it is intelligent, a bit blunt, but ultimately touching."
    },
    {
      "publisher": "The Guardian",
      "author": "Henry Barnes",
      "link": "https://www.theguardian.com/film/2013/sep/06/rush-review",
      "rate": "80",
      "content": "What Rush has to offer is a great human drama, two dangerously talented men pushing each other to risky victory and a superb script, delivered with some mastery by Hemsworth and Brühl."
    },
    {
      "publisher": "Time Out London",
      "author": "Dave Calhoun",
      "link": "",
      "rate": "80",
      "content": "Rush is fast, slippery, stormy and dangerous."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Chris Nashawaty",
      "link": "",
      "rate": "75",
      "content": "Rush hits a few potholes, but in the end it reveals the psyches of two men who only feel alive when they're cheating death."
    }
  ],
  "errorMessage": ""
}