{
  "imDbId": "tt1979320",
  "title": "Rush",
  "fullTitle": "Rush (2013)",
  "type": "Movie",
  "year": "2013",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3429340",
      "warningSpoilers": false,
      "date": "10 March 2016",
      "rate": "9",
      "helpful": "44 out of 45 found this helpful.",
      "title": "Was really surprised by how good this was",
      "content": "Despite not being an auto racing fan, the stories of the rivalry between James Hunt and Niki Lauda and Lauda's accident are well known and on research was big news in the 70s. 'Rush' did seem intriguing, Ron Howard has done some good work in the past and my sister and her boyfriend absolutely raving about it. However having no knowledge of auto racing and having never found it my cup of tea there was a touch of intrepidation. As well as the worry as to whether there was going to be any bias and whether it was going to stray from the facts. After watching 'Rush', this viewer is so glad that she gave it a chance because it was a gripping and entertaining film from start to finish, and quite easily Howard's best work in some time.Some occasional rushed pacing and some weak dialogue, that lacked flow, sounded awkward and stuck out like a sore thumb against everything else that was done to such a professional level, were the only drawbacks to overall one of 2013's better films. The time period is very evocatively depicted, there is a real sense of time and place, there is wonderful vibrant colour throughout, the editing is slick, clever and gives the race scenes the thrills they need and the photography is similarly audaciously slick and like the cinematographer was part of the action itself, especially good in the climactic Japanese race sequence. Hans Zimmer's score is not his best work by all means, but it went with the racing theme remarkably well and does capture the mid-70s time period and the atmosphere of the sport to such great effect (again the final race in Japan stood out). The sound effects also help, having a real authenticity.For a film about auto racing, one does have to talk about how 'Rush' deals with the race sequences. The good news is that they are absolutely thrilling and keeps one to the edge of their seat, while all of them are brilliantly done, showing how glamorous and also dangerous the sport is (not many sports films I've seen have properly and fully captured the spirit of the sport it's portraying in the way Rush did) the highlight is the climactic Japanese race, which was both exhilarating and moving (masterful if having to sum it up in one word). Howard not only depicts the mid- 70s as if the viewer were transported back in time and part of the period (such was the evocativeness of the atmosphere) and adopts a visual style that never looks cheap and as said like the cinematographer was there part of the action, but he shows here that he knows how to tell a story. The storytelling is always compelling, thoughtful, informative and thrilling with a surprising amount of emotional impact, found myself really identifying with Lauda.The film is faithful to the facts, the rivalry between Hunt and Lauda is genuinely engaging and are shown a lot of respect and dimension here. Neirher Hunt or Lauda are one-dimensional here and, although Lauda is the more sympathetically drawn of the two, one does not takes sides with one or the other. It also is tightly paced and assured, never getting bogged down in too much back story, too much soap- opera, too much sentimentality or technical jargon/minutiae (that would likely have gone over the heads of first-time viewers or non-fans of the sport). All the supporting performances are well-done, though some with not much to do, with Olivia Wilde and Christian McKay faring the strongest. It is however the two leads that carry 'Rush' cast wise, both of them as close to perfect as one can get. Daniel Brühl gives Niki Lauda a real brooding intensity and genuine poignancy, making it very easy to feel sorry for him, while swaggering Chris Hemsworth has never been better as Hunt.All in all, a gripping and hugely entertaining film. Has its imperfections but they are far outweighed by the number of things 'Rush' does right. 9/10 Bethany Cox"
    },
    {
      "username": "rogerdarlington",
      "userUrl": "https://www.imdb.com/user/ur1911738",
      "reviewLink": "https://www.imdb.com/review/rw2869858",
      "warningSpoilers": false,
      "date": "15 September 2013",
      "rate": "",
      "helpful": "134 out of 154 found this helpful.",
      "title": "Bound to win Academy Award nominations - and rightly so",
      "content": "In 1976, the rivalry between two brilliant racing car drivers, the British James Hunt and the Austrian Nikki Lauda, came to a head in the almost literally life-and-death struggle of the Formula One championship. American director Ron Howard (\"Apollo 13\", \"A Beautiful Mind\", \"Frost/Nixon\") and British scriptwriter Peter Morgan (both play and screenplay of \"Frost/Nixon\") have done a terrific job bringing the titanic struggle to the big screen, aided by some excellent casting and powerful sound and cinematography. Those were the days when most years a couple of drivers would be killed, so the stakes could not be higher.Sensibly the car racing does not over-dominate, since this is essentially a character- driven conflict, but when the racing is on screen - notably in the final race - the excitement is visceral. The Australian Chris Hemsworth (previously best known as \"Thor\") and the Spanish-born German Daniel Brühl (\"Inglourious Basterds\") are so good as the British and Austrian drivers respectively that the dialect coaches should receive a special commendation. Arguably Brühl gives the stronger performance which should auger well for his future career.A great strength of this tale is that there is not a hero or a villain. Both drivers had privileged backgrounds and were superbly talented, but both were flawed. although in very contrasting ways, including styles of thinking, driving and womanising (Olivia Wilde as model Suzy Miller and Alexandra Maria Lara as aristocratic Marlene Knaus respectively).I never saw the recent film \"Senna\" (2010) so \"Rush\" reminded me most of the much older \"Grand Prix\" (1966), but what is stunning about \"Rush\" is that it all happened. A season of the fastest sport in the world decided in the last race by one point - you couldn't make it up. Rush to see the movie."
    },
    {
      "username": "tomgillespie2002",
      "userUrl": "https://www.imdb.com/user/ur3741220",
      "reviewLink": "https://www.imdb.com/review/rw2944750",
      "warningSpoilers": false,
      "date": "19 January 2014",
      "rate": "8",
      "helpful": "71 out of 81 found this helpful.",
      "title": "Thrilling character study",
      "content": "As Asif Kapadia's gripping and extremely moving 2010 documentary Senna proved, cinema audiences have a thirst for the larger-than-life characters that inhabit the Formula One track. The sport itself is frightfully dull (although I'm sure plenty will disagree with that), but the sportsmen willing to lay down their life for a kick and a trophy are infinitely more fascinating, especially in the days of lax safety rules. The sport nowadays is little more than advertising on wheels, but when the likes of James Hunt and Niki Lauda battled it out on the track, epic rivalries were created, and no matter how talented these men were at driving these \"coffins on wheels\", every race could spell out death. Rush portrays the clash of two opposing personalities. The long-haired, dashing Englishman James Hunt (Chris Hemsworth) was all about the adrenaline, embracing the post-race parties and lying with the many women that would throw themselves at him. He was reckless, willing to risk his life and others in order to win, but, as described in the film, there was no better driver in the world in terms of raw talent. His rival, Austrian Niki Lauda (Daniel Bruhl), was focused, clinical, and even helped design the cars he would drive. He was the early-night type, 'rat-faced' and cold. In every sense, he's the perfect villain. But where Rush succeeds the most is challenging our early conceptions of these two characters. There's little fun to be had with Lauda, but played by Bruhl, he evolves into the underdog of the movie, perhaps the only one that actually gives a damn about his own life and the life of his opponents. This, naturally, leads to tragedy and a particularly wince-inducing scene in which Lauda requires having his lungs vacuumed, but it's at this point that we realise just what these two drivers mean to each other. As Lauda watches Hunt claw back some points in the 1976 Formula One season, it becomes clear that these two need each other to survive. Their hatred of one another only serves to fuel the flames, and leads to Lauda's defiant early return to the driver's seat, scarred and bandaged. Fast cars, beautiful women and exotic locations hardly sounds like a recognisable workload for Ron Howard, one of the most play-it-easy directors out there. His past films have been unjustifiably successful, critically and commercially, never stamping a recognisable directorial trait onto his work. Yet here, although the bright sheen of the 70's initially takes some getting used to, he has managed to create a world that is very much alive, using snappy editing, a pumping soundtrack and some growing sound design to re-create this world for petrol-heads. But he doesn't neglect his characters, and evokes the great work done on Frost/Nixon (2008), which was also a study of two giant, clashing personalities coming together on the world stage. Rush is an exhilarating experience, able to distinguish each race from the next and literally putting us in the driver's seat with the use of digital cameras. Although it occasionally drifts into formulaic territory with the introduction of the 'wives' (played by Oivia Wilde and Alexandra Maria Lara, respectively), Howard cleverly uses this as an insight into Hunt and Lauda's personalities. Hemsworth is very good in his first 'proper' post-Thor role, but it is Bruhl that you take away from the film. How he gets you to initially loath him, only to be cheering him on at the climax is the work of a great actor, and it's a crime that he has been snubbed by the Academy this year. Hopefully this will inspire a host of decent sports movies, as Rush proves that you can mix character study and even existential musings with the thrill of sport."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw5795524",
      "warningSpoilers": false,
      "date": "3 June 2020",
      "rate": "9",
      "helpful": "23 out of 24 found this helpful.",
      "title": "A super cool movie",
      "content": "A super cool movie Beautiful story and wonderful acting main actors"
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw3011968",
      "warningSpoilers": false,
      "date": "8 May 2014",
      "rate": "8",
      "helpful": "22 out of 24 found this helpful.",
      "title": "What's This? A Ron Howard Movie That Isn't Intolerable?",
      "content": "I never thought I would ever watch a Ron Howard movie again much less write a good review of one.Howard hasn't made a movie since \"Parenthood\" that has not bored me to tears and almost angered me with its pedestrian refusal to take any risks. He's turned into a lesser version of Steven Spielberg -- his films are just as maudlin and emotionally manipulative, but they lack Spielberg's technical panache.However, the great reviews of \"Rush\" and the awards attention that swirled briefly around Daniel Bruhl got my butt in the seat for it, and I was surprised by actually liking it. It's a lean, mean telling of the intense rivalry between race car drivers James Hunt and Niki Lauda. You don't need to care much about race car driving (I certainly don't) to enjoy the story, particularly that of Lauda, who overcame a devastating accident to return to the track. Bruhl is as good as everyone said he was at the time, and Chris Hemsworth, as Hunt, is serviceable if nothing special. This is still a Ron Howard film, so don't expect it to push any boundaries, but it's much more technically daring than anything else he's made, the cinematography and editing putting the audience in the driver's seat more than once.Grade: A-"
    },
    {
      "username": "CalRhys",
      "userUrl": "https://www.imdb.com/user/ur24740649",
      "reviewLink": "https://www.imdb.com/review/rw2889189",
      "warningSpoilers": true,
      "date": "28 September 2013",
      "rate": "",
      "helpful": "124 out of 134 found this helpful.",
      "title": "A Gripping, Adrenaline-Ridden Fuel Ride From Howard",
      "content": "Just come out the cinema in York from watching Rush! Oh my god! One of the most intense films I have watched in a very long time with gripping performances from Hemsworth and Brühl! An extremely clever script from Peter Morgan in which he doesn't pick sides, but instead allows the audience to view these characters in their own light.I am a huge fan of F1 so when viewing a film relating to that sport it would be questionable that there are some anachronisms or minor problems. But no! There was not a single fault with this film, it is the most realistic sports film I have viewed! A film that portrays the rivalry between the British and Austrian world champions and the fateful crash. With some powerful dialogue from Lauda and Hunt.Even if you aren't a fan of F1, the intense action and no-holds adrenaline should keep you entertained from start to finish. With a great sway of emotions from melancholy to ecstatic! This film deserves the acclaimed reviews it has been receiving."
    },
    {
      "username": "bm2759",
      "userUrl": "https://www.imdb.com/user/ur43702084",
      "reviewLink": "https://www.imdb.com/review/rw2870476",
      "warningSpoilers": false,
      "date": "16 September 2013",
      "rate": "10",
      "helpful": "275 out of 301 found this helpful.",
      "title": "F1 finally has an amazing film",
      "content": "This is an amazing film. I can't recommend it highly enough for F1 fans like me, sports fans, or anyone interested in a story of rivalry i.e. something different to the unoriginal junk movies which get churned out each year.All the crew involved should pat themselves on the back. They've done a fabulous job making this film critique, explore and honour two memorable F1 drivers.James Hunt's fun, party lifestyle along with his brash and raw driving talent. This is contrasted against Niki Lauda's methodical thinking, technical brilliance and professional lifestyle. These two characters are total opposites but as their lives are explored it also acknowledges the value of an enemy, i.e. something to beat. I believe this is a commentary on human nature in that the best of us shines when we have something to beat or overcome.Do yourself a favour and see it now."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2978473",
      "warningSpoilers": false,
      "date": "12 March 2014",
      "rate": "7",
      "helpful": "22 out of 26 found this helpful.",
      "title": "Quite good.",
      "content": "I enjoyed \"Rush\", as have a ton of other people. As of today, it's #142 on IMDb and it was nominated for Best Picture. While my score of 7.0 is slightly less than the current 8.3, I was glad I saw this film.I was surprised because I thought the film would be very much like the classic race films \"Le Mans\" and \"Grand Prix\"--two 1960s films about Formula 1 racing. However, it was very different. These older films focused on the driving itself--and both had amazing camera-work. Additionally, the films seemed much like watching the races yourself (particularly \"Le Mans\"). However, both films were a bit light on plot. \"Rush\", on the other hand, had surprisingly little (and slightly underwhelming) race scenes--mostly because this was NOT the focus of the movie. Instead, it was more of a character study of the two drivers, Niki Lauda and James Hunt. How the men were similar and how they were significantly different is the focus of the film.The acting was very good and the film engaging. I could say more but, frankly, the film's been out for some time and it already has more than 350 reviews, so I'll just wrap it up now.PLEASE NOTE: The scenes after the 'big crash' are very hard to watch--particularly those in the hospital. This along with the crudeness of the language and brief nudity make this a film you might not want to show to your kids."
    },
    {
      "username": "joechang-1",
      "userUrl": "https://www.imdb.com/user/ur6149395",
      "reviewLink": "https://www.imdb.com/review/rw2868861",
      "warningSpoilers": false,
      "date": "13 September 2013",
      "rate": "10",
      "helpful": "230 out of 271 found this helpful.",
      "title": "The best movie this year so far!",
      "content": "Mr. Ron Howard is a great story teller, this movie is about human nature, love and tears.It is difficult to make a good movie about car racing, especially to make one for the time period from 1970 to 1976. I don't know how they did it to bring those old F1 cars back to life. You will feel like you are really there watching the racing, it's really unbelievable.It is truly touching to see each character played their perfect role for this movie, Chris Hemsworth did a great performance, he is such a talented and devoted actor. Daniel Brühl also did a great job on portraying the eccentric and unsociable legendary F1 driver Niki Lauda.A great movie is like having a great meal, a good starter, a good soup/salad, a good main course and a good dessert, well balanced. Rush is that good meal, it's a fun ride!I have to say I really enjoyed watching this movie. Thank you Mr. Ron Howard for making this masterpiece."
    },
    {
      "username": "Muttley_McLad",
      "userUrl": "https://www.imdb.com/user/ur23178078",
      "reviewLink": "https://www.imdb.com/review/rw2870243",
      "warningSpoilers": true,
      "date": "15 September 2013",
      "rate": "10",
      "helpful": "285 out of 315 found this helpful.",
      "title": "Chris Hemsworth as James Hunt? Really??!",
      "content": "Really. His performance in Rush came as a huge surprise. This is his best performance by quite some margin, a role which he plays with a great deal of maturity and respect. He plays Hunt with just the right level of arrogance, cockiness, confidence and audacity to convince you that he was real life 70's playboy James Hunt, a man destined to live fast and die young.Bruhl is superb as Niki too. It's a role that he deserves much recognition for, particularly his accent and mannerisms. Lauda was one of the first of a new generation of professional driver, driving the old playboy characters out of the sport and Bruhl nails this icy determination to succeed magnificently. A particular nod goes to Christian McKay's portrayal as the slightly eccentric, petrol head extraordinaire, ever so aristocratic but hopelessly financially incompetent Lord Hesketh. The camera work is spectacular, none less so than with some very creative angles of the beautifully filmed on track action. The brief in-helmet camera shots are inspired, giving you a glimpse of the drivers world. CGI work will be spotted by the keen eyed, but you have to consider that without it that there are certain scenes involving priceless period machinery (the sound of a Cosworth DFV firing up and filling the cinema was worth the ticket price alone) that would be just impossible to film as accurately as they were depicted here with real machinery. As a result, they are able to use the CGI sparingly and to good effect.The main facts of the 1976 season are on the whole handled very accurately. Certainly, some liberties are taken with poetic licence, but this is still a scripted film and not a documentary. The factually heavy writing of the script along with beautifully filmed and liberal use of period machinery being recorded at pace on real asphalt will be enough to keep the fans of the sport well represented.It's a gripping telling of the 1976 Formula 1 season, which whilst not sharing the same shear spectacle of Howard's other 'too unbelievable to be true' film Apollo 13, Rush tells a story which would be just too unbelievable in terms of human bravery and personal destiny for any fictional story to be given credence. It's a tale which will be enough to hold the unfamiliar or casual viewer's attention with a steel firm grip to see how the different personalities handle the pressures of life both on and off the track and how rising to the top takes it's tole on these two polar opposite real life gladiators of the race track.With the lead actors clearly committed to giving their best performances yet and a tastefully handled script, Ron Howard delivers a visually impressive account of events that may well become one of his most respected directorial efforts yet.10/10"
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw2884671",
      "warningSpoilers": true,
      "date": "11 October 2013",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "No better script than reality",
      "content": "Originally I planned on not watching \"Rush\" at the theater, simply because I lost interest into Formula 1 considerably since the Schumacher years. However, finally curiosity got the better of me and I decided to give it a go. Which proved a pretty great choice as Ron Howard's latest movie makes for a very entertaining two hours. I was vaguely aware of the year season 1976, the developments and outcome of the driver championship and Lauda's spectacular crash of course as you get pretty much reminded here every second weekend when you see him being the co-host of current Formula One coverage. Putting Daniel Brühl into perspective to what I see there, I think he nailed Lauda's character and his very own Viennese charm. Of course, it's different to compare with Lauda now being roughly 35 years older than in the movie and I was not even born the year Lauda ended his career, but I think he made a good job in portraying him. Aside from all comparisons to what Lauda was really like, he definitely created an interesting character that had your eyes glued to the screen during every scene he was in. It's not surprising Brühl is in talks for his first Oscar nomination and it's nice to see him back so strongly, after I was a bit disappointed by his work in recent years, especially in \"Inglourious Basterds\" where his performance wouldn't make my top5 of the film despite having a pretty interesting character.While Brühl kinda sways between lead and supporting territory, the movie's clear lead is Chris Hemsworth as Lauda's equally talented competitor James Hunt. In fact, he is around 5 years younger than Brühl, but his character is slightly older. I believe Hemsworth made a couple smart career choices recently and, after thoroughly enjoying the first Thor movie, I'm pretty curious about the second, which comes out soon. His character here is a bon vivant who loves drinks, ladies and the sweet life, the polar opposite to Lauda's stubborn lone wolf. And these exact opposites are the basis of the film, the reason why it works so well as an intriguing character study of two extremes clashing. Their personalities also reflect directly on the women with them. While Olivia Wilde as Hunt's wife disappears almost as quickly as she entered the picture, Alexandra Maria Lara as Lauda's wife stays there till the end and we see a good portrayal from her as somebody who's attracted to the danger (their first meeting in the civilian's car), but at the same time constantly worried about her husband's well-being and powerless as she can do nothing but hope for the best.All in all, I recommend this film a lot. Really, you don't have to know anything about Formula One or racing in general in order to enjoy it for being a great character study. I haven't seen a full race either in maybe a bit less than ten years and it still felt like a compelling watch. The motorsports circus is really just the stage for the two protagonists and except very close to the end there's not that much racing action included anyway. And when there is, it always comes with an impact on the relationship between the two. But even if it's just the stage, all the scenes at the race tracks were executed very convincingly and I never thought that it's all just make-believe. They also managed to convey the aura of the Formula One from the 1970s that has sadly lost a lot of its charm by now. Howard knew that he had to make a film that appeals to the masses and Formula 1, compared to NASCAR, Indy 500 etc., has never been a sport that created too much interest in North America, which is why you don't really find American drivers participating that often either. He managed very nicely and it's a great example of a rivalry that pushed each of the rivals to the limit, often in a good way, and occasionally beyond. What I also liked about it is that it definitely ends on a positive note, possibly with the best scene of the movie with Hunt and Lauda meeting at the hangar, which sums up their relationship perfectly. Subtle criticism for the other's lifestyle, occasional mindgames, but also respect. It's always nice to go out in style as we usually tend to remember the ending more than everything that was before and, if badly executed, it can hurt the film's overall perception a lot. Not so here. Very well done as almost the entire rest of the movie. With this character clash, screenwriter Peter Morgan succeeds at least as much as with the one in Frost/Nixon."
    },
    {
      "username": "Vartiainen",
      "userUrl": "https://www.imdb.com/user/ur30163554",
      "reviewLink": "https://www.imdb.com/review/rw2981856",
      "warningSpoilers": false,
      "date": "18 March 2014",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Way more than just a Formula 1 sports film",
      "content": "I liked this film a lot more than I would have anticipated. Sure I knew going in that the two main leads were both brilliant actors - Hemsworth especially has become a recent favourite of mine - but they both exceeded my wildest expectations. They became James Hunt (Hemsworth) and Niki Lauda (Daniel Brühl), down to the smallest of detail, the most delicate of nuance. The 1976 racing season was before my time, but even though I'm just a casual Formula 1 fan, I had heard about it and I knew who these two were. They were such large characters, such giants in their chosen field, that had this film not captured them perfectly, it wouldn't have been half as good as it is now. Luckily Howard's directing and the performances of these two are some of the finest I've seen in a long time.I also really like the fact that Rush is more than just a sports film about racing. It's a character study about two masters of their craft, embedded in deep rivalry. Both of them know that they stand unopposed, except for that one man, who's their polar opposite in both personality and driving style, yet who is just as capable. That's a great setting for a movie and Rush beautifully explores the possibilities given to it. You buy the rivalry and by the time of the final race I found myself at the edge of my seat, even though I already knew the outcome.It's also great how the movie never takes sides. It's not a film about Niki Lauda - even though he was involved in its making - nor is it about James Hunt. It's about them both and about the sport as a whole.To sum it up, I'd say this is the best sports movie I've seen in my life. But it's that because it's more than a simple example of its genre. It's a brilliant character study, an interesting period piece, a gripping drama and yes, at its core, a film with furiously fast cars. Highly recommended."
    },
    {
      "username": "robertjenkins456",
      "userUrl": "https://www.imdb.com/user/ur46647298",
      "reviewLink": "https://www.imdb.com/review/rw2869976",
      "warningSpoilers": false,
      "date": "15 September 2013",
      "rate": "9",
      "helpful": "379 out of 409 found this helpful.",
      "title": "Well worth the wait!",
      "content": "The film is just over 2 hours long, but when it was over it seemed like I had been in the cinema about 30 minutes. The film centres on the battle for the 1976 Formula 1 World Championship, and the rivalry between the Austrian \"professor\" Nikki Lauda and the British playboy James Hunt. The two are depicted as enemies, but in actual fact they were good friends who trusted and respected each other on, as well as off-track. This bit of artistic licence does not spoil the film and is reasonable in order to make the battle between the two for the F1 crown more intense. The film is nicely paced. We are introduced to both characters through their own narrative and scenes that leave the watcher in no doubt as to their background and philosophy on life. The two are first seen in competition in 1970 at a Formula 3 race at Crystal Palace (where they have a coming together) and sets the scene for the rivalry throughout the film. I'm not sure if this is further artistic licence. The two definitely did race each other in F3, but I am not convinced as to whether this actual incident occurred. After that we are given a whistle stop journey between 1973 (when Hunt came into F1) to 1975. We are shown the dangerous nature of F1 at the time with the Francois Cevert accident at Watkins Glen in gory detail – although this does not seem like gratuitous, but necessary to bring home just how unforgiving the sport was back then – and it truly was (of the top 12 points scorers in 1976, F1 cars were to claim 3, 1 ended up in a wheelchair and 1 had his career ended by a leg crunching crash). We are then taken to 1976 and that titanic struggle for the World Crown. Only one real issue here – the British Grand Prix result, but I suspect this was simplified in the interests of time. The casting is superb. Chris Hemsworth, an Aussie, does an excellent job on public schoolboy James Hunt, while Daniel Bruhl both sounds and looks frighteningly like the Austrian. There is little room for a supporting cast amongst the drivers which is a shame – only Clay Regazzoni has a part of any real substance. Peterson, Watson, Depailler, Scheckter, Andretti et al could have featured a little more I think. What did their contemporaries think of the two protagonists? The supporting cast is mainly required for Hunt – Lord Hesketh, \"Bubbles\" Horsley and Teddy Mayer / Tyler Alexander of McLaren, while the Ferrari team principals are rarely seen. The love angle is perfectly catered for by Olivia Wilde (Hunt's first wife Suzy) and the gorgeous Alexandra Maria Lara - of Downfall fame – as the future Marlene Lauda. Both give quality performances. The attention to detail is superb. Although the tracks are not the actual ones (for understandable reasons) the cars, the helmets, the sponsors are all authentic. The film \"feels\" like it's happening in the 70's. For anyone interested in great personal stories, F1, the 70's, cars or just like to see a great film, then Rush is for you."
    },
    {
      "username": "TheSquiss",
      "userUrl": "https://www.imdb.com/user/ur34414709",
      "reviewLink": "https://www.imdb.com/review/rw2863897",
      "warningSpoilers": true,
      "date": "5 September 2013",
      "rate": "8",
      "helpful": "37 out of 47 found this helpful.",
      "title": "A dazzling story of F1, rivalry, respect & cheating death.",
      "content": "Those who have seen the trailer will know that Rush is the 'Formula 1 film'. The presence of Ron Howard's and Chris Hemsworth's names above the title may put some bums on seats but the fact of it being a film about motor racing will undoubtedly ostracize some potential viewers.So stop right there. Rush is not a movie about motor racing for speed fans any more than Titanic was about sailing for merchant seamen. Rush is a superbly shot, directed, edited and performed film that transcends the sport of motor racing, just as the principal protagonists themselves did almost forty years ago.The rivalry between F1 drivers James Hunt (Hemsworth) and Niki Lauda (Daniel Brühl) is common knowledge. Just a couple of minutes trawling through Google's gifts will tell you how many championships each driver won, how they met, how they sparred, how they lived and (nearly) died Rush isn't a film that tells you their story. Rush is the film that takes you into their world and shows you how that story unfolded in all its fast, crazy, riotous, dazzling, cynical, brash excess. By the end you may still not want to be an F1 driver or even watch a grand prix, but you sure as hell will wish you could have been there for at least some of the 70s.Howard has provided us with a mixed bag of films over the years with schmaltzy, flicks (A Beautiful Mind), thoughtful biopics (Frost/Nixon), compelling dramas (Apollo 13) and utter twaddle (Angels and Demons). So which category would Rush fall into? The tension Howard creates is ridiculous. Pistons pump, colours blur, the scream of engines deafen us. The editing is so tight it feels as though something will snap. The anticipation prickles the skin and, though we already know what and when, it is almost too much for us to watch it unfold. Technically, Rush verges on exquisite. The digital creation blends flawlessly with the live action and the skids, tumbles, crashes and explosions are horrifying.But it isn't just with the speed and madness around the track where Howard guides perfectly. The hospital scenes when Lauda is treated are almost grotesque. We find ourselves shying away from the visuals, involuntarily grimacing at Lauda's agony even when he demands more pain in order to drive him towards recovery and revenge.Rush boasts one of the finest film scores of the year so far with Hans Zimmer proving why he is among the busiest composers in Hollywood. It's not that the score that makes the film, but it enhances it beautifully, adding emotional colour to the startling visuals to magnify the tension.The joint leads are on impeccable form. Hemsworth portrays Hunt as the playboy we wish we could be (or bed) and his charisma doesn't ooze, it gushes. He is arrogant, cocksure, charming and handsome. He makes it obvious why men wanted Hunt's life and so many women welcomed him into theirs. It is a confident, full performance from Hemsworth that marks him out yet again as an actor with a certain chameleon-like quality and undeniable star power. Immediately we like Hunt but as 123 minutes rush by, he evolves into a flawed man we admire but ultimately decide we don't really want to be and, in some ways, pity. It's a fine performance that engages us on every level.When Brühl's (The Edukators, Inglorious Basterds) Lauda strides onto the screen, it is with purpose, his Austrian directness and confidence taken as conceit and arrogance. He does not suffer fools (or almost anyone else) whether they are subordinates, rivals or the men paying for his drive. Supremely confident to the exclusion of social niceties, the Lauda we observe puts our backs up immediately but, just as the Hunt on screen evolves, so, too, does Lauda and by the film's end our allegiance has wavered. It is a sensitive performance from Brühl and his understanding of the man he portrays and clear admiration for him infects us thoroughly.Some of the dialogue is lumpy, there are numerous liberties taken with the truth (though not to the extent that U571 completely rewrote history!) and much is glossed over. Howard has perhaps tried too hard to appeal to a mass audience by focusing on the principal women in the drivers' lives, notably Hunt's wife, Suzy (Olivia Wilde) and Brühl's, Marlene (Alexandra Maria Lara). In Marlene's case, she is relatively impactful on her husband's life, suffering through his accident with him. In Suzy's case, however, though she was influential on a period of Hunt's career, it is difficult to see her as anything other than a bystander in his life and yet Howard sees fit to return to her though she is far from his thoughts.These are minor quibbles that make Rush a very good film instead of a 'great'. Nevertheless, my companion for the film who has no interest in motor racing and less knowledge gave a simple summary: \"Excellent.\" Me? I'm a fair weather F1 fan. If there is a realistic hope of Button, Hamilton and Di Resta winning or there's been enough hype, I'm there. Otherwise it's Formula what? But, as I wrote, Rush transcends the sport. I was gripped throughout, I gritted my teeth, I gasped, clenched my buttocks and willed the drivers to the finish, on the track, in the hospital and in life.For more reviews from The Squiss, subscribe to my blog and like the Facebook page."
    },
    {
      "username": "rob-armstrong-913-212512",
      "userUrl": "https://www.imdb.com/user/ur24398978",
      "reviewLink": "https://www.imdb.com/review/rw2864275",
      "warningSpoilers": false,
      "date": "6 September 2013",
      "rate": "10",
      "helpful": "363 out of 415 found this helpful.",
      "title": "Excellent",
      "content": "What a breath of fresh air... A brilliant film in every respect. I was lucky enough to this movie at a special preview and I cant tell you how great a film this is... At first you think its about racing cars, but its not it really does give you an insight into the human condition...The rivalry between Hunt and Lauder is just played brilliantly... The race sequences are superb, really taking you back to the 70s... The heyday of this awesome sport. It shows the end of an era where the gentlemen drivers begin to give way to professional sportsmen and the end (in my opinion) of the excitement of the sport. It shows what a pale reflection today's F1 is of this once great sport, and what great characters we have lost...A real must see movie"
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw4062041",
      "warningSpoilers": false,
      "date": "14 February 2018",
      "rate": "",
      "helpful": "5 out of 5 found this helpful.",
      "title": "admirable work",
      "content": "Story of a sportiv rivalry. at first sigh, nothing more. but this \"more\" is the most exciting. the performances, the art of director to explore details, the atmosphere, the confrontation itself, the fair play, differences between Niki Lauda and James Hunt and the choices. and, sure, amazing science to give the feeling of the racing competition. more a film about people than a film about sport, \"Rush\" is one of seductive tools for understand the essence of competition and the force of choices. so, an admirable work."
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw3021094",
      "warningSpoilers": false,
      "date": "23 May 2014",
      "rate": "",
      "helpful": "5 out of 5 found this helpful.",
      "title": "1976 was an exciting year in Formula One racing.",
      "content": "This is a Ron Howard film of a predominantly true telling of the 1976 year of Formula One racing. Featured are the world champion from 1975, Austrian Niki Lauda, and his rival Brit James Hunt, seeking the world championship. Lauda and Hunt were quite opposites, the Austrian the focused, precise, calculating racer. It was a profession he was very good at. The Brit a flamboyant risk-taker, a womanizer who enjoyed a good drunk after a victory, and who nervously vomited before a big race.The actors chosen are excellent, with costuming and makeup resembling the real racers quite closely. The Aussie Chris Hemsworth puts on his best British accent as James Hunt, and Daniel Brühl (full name ' Daniel César Martín Brühl González Domingo ') is authentic as Niki Lauda.This is much more than a telling of the racing season. In the hands of director Ron Howard we are treated to selective slow motion and stop action, and even POV shots of the racing engine's intake and exhaust valves at work from inside the combustion chamber. In slow motion, of course!Surely some archival footage was used, but they recreated certain racing situations very realistically. Overall the cinematography (shot digitally) and the sound track are superb. A very enjoyable movie, of two fierce competitors who gained deep respect for each other, in spite of their attempts to bury each other on the track.Their spouses were capably played by Olivia Wilde as Suzy Miller Hunt and Alexandra Maria Lara as Marlene Lauda. Of note, Hunt died at a relatively young age of 45, but Lauda is still going strong in his 60s, as an aviation entrepreneur.June 2019 edit: Lauda died recently so I took the opportunity to watch this again. I enjoyed it almost as much now, 5 years after my first viewing."
    },
    {
      "username": "RichardvonLust",
      "userUrl": "https://www.imdb.com/user/ur22201610",
      "reviewLink": "https://www.imdb.com/review/rw2945872",
      "warningSpoilers": false,
      "date": "20 January 2014",
      "rate": "10",
      "helpful": "25 out of 29 found this helpful.",
      "title": "Daniel Bruhl even beats Oscar bound Leonardo",
      "content": "Niki Lauder is among the most well known personalities in the history of Formula One. Even today millions of Germans watch his TV presentation at every race. We know his manner and speech extremely well and any actor portraying him faces an uphill if not impossible task. But Daniel Bruhl delivers a performance so wonderfully convincing in his faithful and profound portrayal that he should clearly be among the Oscar nominees for Best Actor. The story of Lauda's famous struggle with Hunt in 1976 has become the stuff of legends. And perhaps this production has used some artistic license to enhance them. But the film isn't really about the thrilling story of those events. That's just the vehicle for a much deeper drama examining the ever relevant dialectic between hedonism and pragmatism. It's about the self beneath the skin rather than the glamor of the surface: a concept normally quite alien to the Oscar awarding Hollywood elite. So poor Daniel Bruhl must await another vehicle to display his superb talents. And one day he might be remembered internationally in his career as Niki was himself."
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw2873032",
      "warningSpoilers": false,
      "date": "21 September 2013",
      "rate": "8",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Ron Howard shows what he does best",
      "content": "The true story of the rivalry between F1 drivers James Hunt and Niki Lauda and the 1976 Formula One season is one of those stories where true life is more extraordinary then fiction. Fortunately two men with great experience at adapting true life stories, Ron Howard and Peter Morgan, have taken this project on, giving us a movie that is about a clash of ideals and personalities as well as about the drive of motor sports.James Hunt (Chris Hemsworth) and Niki Lauda (Daniel Brühl) are racing drivers with different approaches and philosophies whose rivalry starts in Formula Three racing. Hunt is a good looking playboy who enjoys drinking, partying and sex and has charisma to boot. Lauda is a serious minded, extremely determined, technically astute and is able to get the most out of a car, but is a cold, distant man who drives people away. Soon the men's rivalry see them battling it out in Formula One leading to the 1976 season where back-stabbing, danger and disaster affects the sport.As a sports movie Rush is a very well made and entertaining film that focuses on its characters ideals and differences. Hemsworth and Brühl are in top form as they play these very different men. Lauda is a self- determined man who is willing to risk everything to get into F1, but easily rubs people the wrong way, whilst Hunt had a greater support network, media friendly but is a loose cannon. Both end up becoming each other's hubris as they take bigger risks in a sport that already dangerous.As well as the focus of their profession, Rush looks at the personal lifestyles of the two drivers, particularly Hunt's as he womanizes as Lauda settles down with a woman. Hunt is a thrill seeker who uses pure talent whilst Lauda is aware of the risks of his profession, but does not want to add to them.To anyone who knows about Niki Lauda is he suffers a tragedy and the easy route would have been to make Rocky style picture about someone overcoming adversity. Fortunately, Howard and Morgan made something more interesting by showing both men to be faulted, that Lauda is not a man who is easy to like, making personal digs against and being a very sore loser.At a running of two hours, three minutes, Rush moves along at a very brisk pace. The first 40 to 45 minutes focuses on a six year period as the rivalry builds up. Many story elements are dealt with quickly. A great example of this is when Hunt meets model Suzy Miller (Olivia Wilde, who does an impressive English accent) in the team garages and the next scene is them getting married. Rush is a movie that tackles many story elements with broad brushstrokes. It does seem like a longer cut may exist.Even though the film is called Rush, Howard and Morgan build up to the racing segments. We get a F3 race near the beginning and then we have a long wait the F1 races. Howard and Morgan focus on three main races in the 1976 season, Nürburgring, Germany, Monza, Italy and Fuji, Japan. Howard shows his technical acumen with the racing sequences, as we get up close to the action on screen with camera being place many on the parts of the cars, in the driving seat and even in the engine and in the air gun during a tyre change. There are intense, exciting sequences as Howard uses stylistic flashes and slo-mo as we see how dangerous races were in the 70s. Morgan also uses a similar montage trick he used in The Damned United to quickly build a picture of the '76 season with Howard using title cards to the sequence a bit of flash.The story about James Hunt or Niki Lauda could have made for a compelling movie on their own terms, but Howard and Morgan give us two films in one. Rush is a very well-made, engaging and compelling sports flick that is character driven and is about the build-up as well as the racing.Please visit www.entertainmentfuse.com"
    },
    {
      "username": "Quietb-1",
      "userUrl": "https://www.imdb.com/user/ur20243955",
      "reviewLink": "https://www.imdb.com/review/rw2879807",
      "warningSpoilers": true,
      "date": "2 October 2013",
      "rate": "7",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Couldn't get much Louda.",
      "content": "On of the best Grand Prix movies ever made.RUSH is a testosterone race fest. Ron Howard deserves credit for taking a redundant series of races and making them interesting and watchable. Good performances all around. The movie is elevated by an outstanding Hans Zimmer score. Excellent cinematography and ear pounding sound of engines put the viewer in the action.The hospital scenes are a bit tough for the faint of heart. The quiet face to face scene at the end between the competitors takes the movie to a higher level.This one should be seen and heard on a big screen."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2999233",
      "warningSpoilers": false,
      "date": "16 April 2014",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Solid filmmaking from Ron Howard",
      "content": "Based on the true story of the Formula 1 racing rivals brash English playboy James Hunt (Chris Hemsworth) and his tough methodical uncompromising opponent Austrian driver Niki Lauda (Daniel Brühl) during the 1970s.Director Ron Howard has great skills to put together a top notch movie. The racing action is exciting. The 70s style looks good. I love all the cars. Everybody is great in this. I do have two minor problems. I hate most narrations and this is no exception. It is good for exposition but mostly takes the audience out of the movie. However a narration from the real Niki Lauda at the end would be great.The other problem is more basic. The movie follows both drivers equally. Although it's filled with details from both men, it's not as easy to fully commit to either men. A more traditional structure would follow one protagonist and it would be a more compelling story. My personal preference would be to follow Hunt up to the Nürburgring Nordschleife race. Then they could go back to Niki Lauda's story from the beginning showing the other side of the story all the way to the end. That way it would minimize the back and forth and maximize the rooting interest. Nevertheless this is a very solid thrilling movie. It's compelling and well worth the praise that it gets."
    },
    {
      "username": "CANpatbuck3664",
      "userUrl": "https://www.imdb.com/user/ur63857399",
      "reviewLink": "https://www.imdb.com/review/rw4634675",
      "warningSpoilers": false,
      "date": "9 February 2019",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Criminally Underrated and Extremely Involving",
      "content": "Formula One racing isn't a sport that I watch regularly but I certainly respect it more than its competing leagues. The tracks are complex, the opportunities to pass are limited and the pit stops must be carefully timed. But this movie isn't current F1 racing, this movie largely takes place in the late 1960s till the mid 1970s where it was far more dangerous and that much more invigorating because of it. We get a classic storyline of two rivals with two very different styles, they had to respect each other due to the sheer magnificence of their driving.There are so many things that I want to praise this movie for. I guess I'll start with how thrilling the world of 1970s Formula One is. The cinematography, the sound effects and the camera angles make this as close to a racing experience as you can imagine. I literally felt like I was in one of the cars racing and I haven't had a theatre experience like that in a while. It was like being on a roller coaster, I got caught up in the \"Rush\" so to speak. The racing sequences are exciting, and the movie does a great job reminding you of how dangerous the sport is. One of the taglines for the film is \"more powerful than the fear of death is the will to win\" I couldn't agree more. People are decapitated, ripped apart, cars burst into flames, this is not a sport for the weak hearted. The movie is involving, white-knuckle tense and I couldn't turn away for even a moment.Perhaps the biggest credit to Rush is how balanced and even the story is between the two main characters. Neither man is a hero, they both are arrogant jerks who are only interested in their own success. Lauda is cold, calculating, pompous but he has the wit and the skill to back up his big talk. Hunt on the other hand is like the handsome jock you knew in school. He is just as cocky, determined and unlikeable as Lauda but has the drive to win and the silver tongue to gain acceptance from the racing community. The movie does a great job showing you the virtues and faults of both men and amazingly enough you want both to come out on top. A good comparison on how well layered and how well balanced the characters are would be Warrior, another favourite of mine. It's a feat in storytelling and they pull it off perfectly here.The acting in the movie is superb to say the least. Both leading actors give excellent nuanced performances that would be worthy of Oscar consideration. Chris Hemsworth seems like a logical choice for the charismatic and determined Hunt. Detractors from this movie claim that it's another typical Hemsworth performance, but I was really surprised with how effective he was at portraying the gauntlet of emotions that Hunt goes through. He has a ton of natural screen presence, but this movie shows he's got real leading man skills (outside of Thor) If I was forced to pick between them though, I would credit Daniel Bruhl with the best performance. I've only seen him in Inglorious Basterds but in this movie he does a flawless accent and has so many levels to his acting job as Lauda. You believe he is Lauda and he's just so wonderfully unlikeable, I would give him the Best Supporting Actor Oscar. Lauda is a complex man with a strict code and due to Bruhlh's performance he's captivating.I've talked about the dual leads enough but another pleasant surprise about this movie is that it features some strong female characters. Olivia Wilde is only in the movie for a short period of time but she's good. Olivia is more known for her amazing good looks but she's a better actress than she's given credit for and has done some good work (House, Deadfall etc.). She's talented and she makes the most of her screen time. I also really enjoyed the performance of Alexandra Maria Lara as Marlene who is the woman who eventually marries Niki. She's feisty and she's a good match for Niki. She's strong, beautiful and she plays a critical role in shaping where Niki heads in the course of the movie. With a cast that lacks proven Oscar contenders, the acting is Oscar calibre and is one more firing piston in the proverbial engine that is this movie.Much like any classic, the movie runs the gauntlet of emotions so well. This movie was sold to audiences through the trailers as an action/sports movie but it's more of a drama with some solid action scenes in it. I've gone on about how much it involves the audience in its plot but what I haven't mentioned is how tense and thrilling the end is. Its lean back in your seat and hold your breath type nerve wracking. The movie has its comedic moments as well, largely thanks to Hemsworth's charm and timing. The movie touches all the bases, making you want to cheer your favourite racer when they cross the finish line first and then drop your jaw in awe when they risk it all, almost killing themselves in the process.Rush had all the action you could want but turned out to be a superbly crafted drama. It's a beautiful movie with some Oscar calibre acting and wonderfully stylish moments. It's my favourite movie of 2013 and it's one of the bigger pleasant surprises I've ever seen in a theatre. I'm giving Rush a 9.5/10 rounding up to a 10/10."
    },
    {
      "username": "Bob-45",
      "userUrl": "https://www.imdb.com/user/ur0018365",
      "reviewLink": "https://www.imdb.com/review/rw2961898",
      "warningSpoilers": false,
      "date": "16 February 2014",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Precision craftsmanship",
      "content": "When my wife and I first saw the US trailer for \"Rush,\" my wife asked me, \"Do you want to see it?\" \"Well, it IS a 'racing movie,\" I replied. I have mixed emotions about NOT watching the international trailer, before watching \"Rush,\" because I would certainly have held much higher expectations. First and foremost, \"Rush\" is NOT about Chris Hemsworth's pecs; nor, for that matter, is it that much about about Chris Hemworth's character, James Hunt. \"Rush\" is about two extraordinary men's visions of life and their approaches to racing; and, it is viewed from James Hunt's most famous challenger, Nicki Lauder. Lauder is a technocrat; a man who, at least, appears to \"know the price of everything and the value of nothing.\" Hunt is free spirit; one of simultaneously knows the value of everything and nothing. Hunt and Lauder are presented in much the same manner as the two main characters of \"Lonesome Dove\". Like, \"Lonesome Dove,\" \"Rush\" is majestic in its presentation of these two lives. \"Rush\" is poetic in its presentation, absolute precision,from its score, to its cinematography, to its performances to the most both memorable and appropriate score I have heard since \"The Good, The Bad & The Ugly\".If you have not seen \"Rush,\" watch the international trailer, available on YouTube. This trailer is the perfect encapsulation of the movie. If you still are not interested, don't bother. However, I hope you are as impressed as I with my favorite film of 2013."
    },
    {
      "username": "simonedwards_1",
      "userUrl": "https://www.imdb.com/user/ur3332895",
      "reviewLink": "https://www.imdb.com/review/rw2864006",
      "warningSpoilers": false,
      "date": "4 September 2013",
      "rate": "9",
      "helpful": "116 out of 136 found this helpful.",
      "title": "Well made, Well Acted, Surprisingly Good Movie",
      "content": "As a Cineworld Card Holder I was invited to a screening last night of Ron Howards new movie Rush.Before I start...I am not a F1 fan, but I knew enough of the history of the main protagonists to appreciate the film. The main set pieces of the film set a year before I was born in 1976, so mainly my knowledge was based on my Fathers recollection of the events. I'd seen James Hunt in interviews and recently watched footage with Niki Lauda so got an idea of the characters.The film is bang on in period, cars fashion and sets the tone excellently, the cinematography is nothing short of breathtaking and the fx are very much in keeping with the period, no ridiculous CGI.The acting, on the whole is nothing short of miraculous, Hemsworth and Bruhl are fantastic, particularly Hemsworth, who's accent, mannerisms and natural acting was a big surprise. I could see a few awards for this role. I have seen Bruhl in quite a few films and I am always impressed so this just continues the trend. All the support actors are very good in smaller roles.The film is well paced for 2 hours and quite graphic, particularly a few accident scenes.Direction: Ron Howard - nice job, I'm not a massive fan and particularly after the da vinci/Angels fiasco's a big return to decent form. The flair was there but played safe (As normal) but let the story and the actors take centre stage.If you like History in F1, a well documented rivalry and a film that capture this, watch it. It is similar to the excellent Control, Moneyball etc but with a bit of heart.8 1/2 out of 10"
    },
    {
      "username": "tj_seabrook",
      "userUrl": "https://www.imdb.com/user/ur22578758",
      "reviewLink": "https://www.imdb.com/review/rw2864757",
      "warningSpoilers": false,
      "date": "7 September 2013",
      "rate": "10",
      "helpful": "163 out of 192 found this helpful.",
      "title": "Superb all round",
      "content": "Having seen the trailers and TV set-up (BBC as a Grand Prix insert) I was thinking OK so I've probably seen the best of this and it's going to be 'clunky' in parts or too far up it's own a$$.But hey we can all be wrong, Ron Howard has added depth to a story I knew well, the presentation has a feel for the era the colour's are sometimes harsh and edgy.The set pieces are well researched, the owners of some of the classic F1 hardware must have had an enjoyable time (not quite so sure about the Insurance Underwriters).Where the story hits the spot for me is the acting of the main protagonists, they have life and depth. Hemsworths presentation of James Hunt is uncanny it's like a documentary he's almost as good as Daniel Day-Lewis in Lincoln.If your not a F1 fan or from the 70's it may not be more than a blokes film, but give it a go it is going to end up being a important as Apollo 13 in the life of Mr Howard and quite frankly is by far the best car racing movie ever"
    }
  ],
  "errorMessage": ""
}