{
  "imDbId": "tt2096673",
  "title": "Inside Out",
  "fullTitle": "Inside Out (2015)",
  "type": "Movie",
  "year": "2015",
  "items": [
    {
      "username": "pickle-92642",
      "userUrl": "https://www.imdb.com/user/ur126297403",
      "reviewLink": "https://www.imdb.com/review/rw7383760",
      "warningSpoilers": true,
      "date": "26 September 2021",
      "rate": "9",
      "helpful": "17 out of 17 found this helpful.",
      "title": "Classic for the new generation? Yes!",
      "content": "I just knew this was gonna be amazing. Such a great idea for an animated movie, even by Pixar's standards. It's truly a perfectly executed vision that did not disappoint on almost all levels. There's a lot of fun to be had with this, it's one of the funnier and more thought provoking Pixar movies. The scene where Bing Bong disappears is also extremely sad. I could also tell that this is one of Pixar's more mature films, about the struggles of growing up. It explored Nostalgia for most of the movie without even using the word. When sadness touched a core memory and turned it blue, it was a symbol for Riley feeling nostalgic for her best memories. In my book, this is yet another Pixar classic."
    },
    {
      "username": "Phil_Chester",
      "userUrl": "https://www.imdb.com/user/ur1845755",
      "reviewLink": "https://www.imdb.com/review/rw6431251",
      "warningSpoilers": false,
      "date": "1 January 2021",
      "rate": "",
      "helpful": "96 out of 163 found this helpful.",
      "title": "Not for young children",
      "content": "I confess that I had to watch this twice before I could properly assess it. It's definitely not a young children's film, as there's precious little to entertain them, but it does have much to consider for older children and (young) adults. As a rumination on what drives us all through life, this is very effective, but I do feel that the story lacks something for making Riley so isolated in her world. Perhaps if she interacted a bit more in the story, this would be a more involving film, but the reflections on lost innocence do add some poignancy and lift this film slightly above average."
    },
    {
      "username": "Animany94",
      "userUrl": "https://www.imdb.com/user/ur78948186",
      "reviewLink": "https://www.imdb.com/review/rw3865673",
      "warningSpoilers": false,
      "date": "23 November 2017",
      "rate": "10",
      "helpful": "78 out of 137 found this helpful.",
      "title": "Mandatory watch for children and parents alike.",
      "content": "I did exactly what I was supposed to when watching this brilliant movie, I felt all the emotions at some point. Pixar did it again with Inside Out. For a long time I had stubbornly repeated that Toy Story would always be my favourite from Pixar, but I changed my mind shortly after watching this one. Like Toy Story you were offered a setup every adult can identify. Growing up learning how to control your feelings and learning the importance of every one of them. It is okay to be angry, sad, happy and afraid as long as we are taught how to manage them. The idea of having this control panel inside a human body has been done before by Osmosis Jones (2001), but let's say with much less success. Inside out takes it to the highest level of perfection. I loved the way Pixar made this world inside the main character of Riley, it is very creatively done and was in some ways just how I had imagined it. I must admit that I cried a couple of times during the movie, because it has some really touching moments. You should be feeling all emotions when watching Inside Out. It is a must watch."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3283511",
      "warningSpoilers": false,
      "date": "24 July 2015",
      "rate": "10",
      "helpful": "54 out of 102 found this helpful.",
      "title": "Pixar's best film since Toy Story 3 and one of their finest overall",
      "content": "Most of Pixar's films are wonderful (short films too), and while the three films made after Toy Story 3 weren't up to their top standards they were still better than most animation companies at their worst. Inside Out was nothing short of a masterwork, Pixar's best since Toy Story 3 and one of their best overall.Pixar films can be relied upon to have great animation, and Inside Out certainly does have great animation. No, wonderful animation and some of the company's most ingeniously inventive, with gorgeously vibrant colours, a very imaginatively rendered setting (and the lands even more ingeniously done, the next land more so than the last), very meticulous and beautifully modelled backgrounds and clever character designs that match the emotions more than ideally. Michael Giacchino's sparkling, rousing and very charming score is one of my personal favourite scores of the year so far, and every bit as great as his score for Up.A superb job was done with the script here too, the comedy is clever and witty without ever being forced and balances subtly with the drama, the drama is some of the most truly poignant of any Pixar film and it doesn't ever feel manipulative or overdone and it's very smartly insightful. The story, not one of THE most innovative concepts but is one of the more imaginative uses of it and is quite original for Pixar actually, goes at a slightly steadier pace than other Disney films, but still captivated. It was very easy to completely connect with Riley and her situation and this was easily the Pixar film since Toy Story 3 that I connected with emotionally the most, also one of Pixar's most moving stories quite easily.Loved the characters too, Anger, Fear, Disgust and Bing Bong (the imaginary friend and the 'epitome of immaturity', without ever being annoying, his back story did bring a tear to the eye) stole every scene they were in, and even Sadness managed to crack some funny one-liners even in her depressive state. Joy also positively lights up the screen and Riley was easy to connect with and much more than just a stereotypical teen girl. The voice acting is splendid. Amy Poehler is note perfect as Joy with her spirited banter giving the character so much life while also bringing a human element to her as well, Lewis Black gives an explosively barn-storming turn as Anger, Phyllis Smith is amusing and affecting, Bill Hader and Mindy Kaling are similarly priceless and in a way that makes the characters of Fear and Disgust endearing rather than annoying, Richard Kind is innocently charming and Kyle MacLachlan and Diane Lane are appropriately compassionate.Overall, a masterful return to form for Pixar. It's their best since Toy Story 3 and one of their best overall as well. 10/10 Bethany Cox"
    },
    {
      "username": "matthewssilverhammer",
      "userUrl": "https://www.imdb.com/user/ur19752191",
      "reviewLink": "https://www.imdb.com/review/rw3265450",
      "warningSpoilers": false,
      "date": "26 June 2015",
      "rate": "10",
      "helpful": "191 out of 390 found this helpful.",
      "title": "Best Pixar Since Toy Story",
      "content": "After some ho-hum years and too many sequels, Pixar is back and better than ever with Inside Out, a boldly unique animated film that renews our faith in what a giant studio can do with an original concept. Docter combines the strengths of his two Pixar masterworks here: the endless inventiveness of Monster's Inc. and the poignant strength of Up. A truly fantastic mixture of fantasy-adventure-comedy and small-family-drama, it's a genius work of conception, execution and emotion that will go down in the annals of Disney animation as an instant and enduring classic. It follows Joy, the leading-emotion of an 11-year-old girl, as she tries to navigate a big change in her young life. Much like Toy Story 3, we're shown the inherent difficulties of growing up through a fresh viewpoint, learning what makes you \"you\". It's a convoluted idea that's nearly impossible to explain, and yet Pixar nails it, perfectly shifting between its parallel universes with ease. The humor throughout will undoubtedly have kids and adults in equal stitches, with fantastic turns from everyone, notably Poehler, Smith, Black, and Kind. However, this film's high-point may be the multiple emotional gut-punches that will reduce parents to tears. That fearlessness to be gloomy is basically the thesis of the film: true joy comes when every emotion is allowed to be recognized and dealt with healthfully. It's quite a psychologically complex stance to take for a film that manages to be so kid-friendly. This wonderful balancing act helps make Inside Out worthy of the \"M\" word (masterpiece) and gives it the distinction of being Pixar's best since the unparalleled Toy Story."
    },
    {
      "username": "Sweetigal85",
      "userUrl": "https://www.imdb.com/user/ur14551063",
      "reviewLink": "https://www.imdb.com/review/rw3718559",
      "warningSpoilers": true,
      "date": "28 May 2017",
      "rate": "10",
      "helpful": "65 out of 109 found this helpful.",
      "title": "A brilliant depiction of adolescence",
      "content": "As an adult, I love animated films but the trailers made this one look like it was really just for kids. I gave it a shot anyway and I didn't expect to love it--but it's depth absolutely shocked me. Not only is it a whimsical, funny film, but the poetry is off the charts.The creators of this film truly remember what it was like to be a child and continue to express understanding to children's feelings today. Riley is a light hearted little girl on the cusp of adolescence, approaching that turbulent age where everything changes and it seems like there is no one there to help you.Riley's emotions are portrayed using colorful creatures inside her head. Joy has been the ringleader of the emotions up until now, but Riley's life changes are starting to shake things up and Sadness has begun to take over. Truly amazing how this was depicted! Absolutely brilliant.As a kid, adults are often dismissing your emotions and never listening to you when you need them most. Often times kids cannot express themselves and turn to anger, panic or disgust, all emotions that will only heighten your problems as Riley comes to learn.When Joy finally lets Sadness take the reins and Riley opens up to her parents and they actually LISTEN to her...it is breathtaking.Don't miss out on this movie, definitely a must see! Amazing voice cast, beautiful visuals and a wonderful message to people of all ages."
    },
    {
      "username": "Reckno64",
      "userUrl": "https://www.imdb.com/user/ur98088930",
      "reviewLink": "https://www.imdb.com/review/rw4753700",
      "warningSpoilers": false,
      "date": "31 March 2019",
      "rate": "10",
      "helpful": "16 out of 25 found this helpful.",
      "title": "The fact that this movie has so many 1 star reviews is proof that there is no point in making great movies anymore......",
      "content": "I hate to see so many 1 star reviews claiming this movie was \"too depressing\". Everyone who said that missed the point completely. Growing up ain't all sunshine and rainbows, it comes with a lot of hardships and that's what this movie is about. Riley's emotions try to help her through the difficulty of moving to a new place that isn't all its cracked up to be, and in the process Joy accidentally sends Riley into a deep depression. Sounds depressing, but what makes this movie great is how realistic her depression feels as Joy and Sadness try to help Riley out of it. I feel like this movie's message is \"Growing up will be tough, but you will get through it and there are people who will always help you through it.\" and that is a VERY important message for children.Throughout the movie there are plenty of good jokes, gorgeous animation, and a beautiful score by Michael Giacchino (idk how to spell that....) Again, just my two cents, but I think this a great movie, if very different and a bit more depressing by Pixar standards.REALLY starting to think people are just coming to trash all of Pixar's most recent movies out of jealousy or something. There's no way so many people think this movie is garbage. If the good movies are really getting this many bad reviews, it's no wonder the quality of animated movies is going down. There's just no reason to try anymore......"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw3263647",
      "warningSpoilers": false,
      "date": "23 June 2015",
      "rate": "",
      "helpful": "26 out of 53 found this helpful.",
      "title": "The Older You Are the More You'll Like It",
      "content": "Inside Out (2015) *** 1/2 (out of 4)Eleven-year-old Riley has a wonderfully fun childhood thanks to the emotions working inside of her. Joy (Amy Poehler), Sadness (Phyllis Smith), Fear (Bill Hader), Anger (Lewis Black) and Disgust (Mindy Kaling) all help keep the young girl moving forward but when her family moves from Minnesota to San Fransisco it throws everyone for a loop and soon Joy and Sadness find themselves lost in her system and trying to find their way back.INSIDE OUT is certainly another winner from Pixar who are clearly the experts of the family movie. What really amazes me about the studio is that they're actually just making adult movies that kids happen to enjoy because of the pretty characters on the screen. I say this because films like this one, UP and WALL-E really do have adult stories dealing with adult issues yet somehow the studios are able to keep kids entertained while their parents get a lot more of the jokes and the emotions that the story provides. This one here is an incredibly touching story from a parent's point of view simply because of the changes that their kids go through.There's no doubt that the animation is the star of this picture and we're really treated to some wonderful images. I especially loved the use of colors in the picture and how various colors had a certain emotion attached to it. This is certainly excellent once our adventure begins as there's a \"long term memory\" section where these wonderful color marble like things are collection. Just the site of this are a true treat for the eyes. All of the \"emotion\" characters are perfectly brought to life with both Joy and Anger really standing out. The human characters are also quite entertaining and there's no doubt that the Bing Bong character will go down as a favorite decades from now.As I said, this film is going to work a lot better for older kids and adults as I'm sure the majority of young children aren't fully going to grasp the idea of emotions and how they effect our lives. The story itself is quite charming throughout and I was surprised at how many adult issues they were able to work on throughout the running time. Fans of Pixar are certainly going to love this as it's another winner that manages to work no matter what your age is. Still, I think the older you are the more you'll enjoy it."
    },
    {
      "username": "Giacomo_De_Bello",
      "userUrl": "https://www.imdb.com/user/ur35307871",
      "reviewLink": "https://www.imdb.com/review/rw3320763",
      "warningSpoilers": false,
      "date": "21 September 2015",
      "rate": "9",
      "helpful": "76 out of 155 found this helpful.",
      "title": "9/10",
      "content": "94 minutes of pure joy and emotion. A return to masterclass from pixar and not only that, probably their best work outside of Toy Story 1 and 2. This film does deserves every bit of praise it has got and more. I will say without hesitation that if you haven't seen this film, believe me you should.Lets just start easy by saying that the animation is something other-wordily. We are beyond the point where anyone needs to express the fact that pixar's animation is gorgeous, but the fact is this animation is some of the most intelligent and dense animation I have ever seen. There are easter eggs in every single frame and more than that every visual element in the movie is well rounded and clearly thought out which makes the storytelling so much more gripping. Talking about storytelling, rarely does a film do visual storytelling so brilliantly. Five minutes into the movie I was in and I knew how things were rolling. This s really a lesson on how to think things out visually and how to use visuals to your advantage as much as it is possible, combining them to smart, engaging ideas.And now to the layers the film has. The deepness of its themes, the intelligence of its story, the subtext behind every action and word, the comedic touches, the insanely funny pop culture references, the poetic approach to joy and sadness, the emotional depth, everything, I'm telling you everything here is gut wrenching. There isn't one scene where you feel time is being wasted, there isn't one word a character speaks that doesn't feel genuine, there isn't one idea that is boring or unoriginal. This film is beyond emotionally engaging, this film gives you a mirror on which to reflect your life and think about it, but no wait it doesn't stop there, it also gives you the opportunity to laugh about it, that no matter what is going on there is also space for a laugh and for lightness. Wow.After a second viewing I have settled on the problem I originally had and can now honestly say this film really just has nitpick issues, it's truly a great one and definitely the best we've been given in 2015 so far. After my first viewing I was all enthusiastic about everything above, but I also was left a little confused by the mythology the film uses and wasn't quite sure it always fit. Upon a second viewing I guarantee that there is no such problem. The mythology is perfect and works with a solid and thought out logic that takes into account the chaos of life. What doesn't quite work is the fact that the film does have a few really minor shortcuts or conveniences that may stick out and I honestly wanted a little bit more of the control center room scenes and see some more of how it worked there, but then again I am really nitpicking.Incredible for me to say it, but I really want a sequel to this film, it's incredible. I want to see another two hours of the five emotions battling in out in the life of Riley and her further struggles, especially want to see the teenage years. This idea is truly amazing and special and it is so inspiring to me, I just really want a sequel to this film and that's the first time I've ever said that in my life.Trust me this film deserves every single bit of your attention and heart, it will take you on a roller-coaster of emotions and entertainment that is absolutely delightful and will also leave you thinking for days."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3260671",
      "warningSpoilers": false,
      "date": "18 June 2015",
      "rate": "9",
      "helpful": "23 out of 48 found this helpful.",
      "title": "Aside from a few slow portions in the middle, a marvelous film from Disney.",
      "content": "One important note: If you go see \"Inside Out\" be sure to get there on time so that you can see the short that precedes it, \"Lava\". It's an amazing short film--one of the best CGI shorts I've ever seen. But, like \"Inside Out\", its audience really is adults, not kids.This film appears to have been inspired by a now defunct but wonderful exhibit at Epcot at Disney World. Cranium Command was a strange movie which featured lots of film clips and audio animatronics to embody the various emotions battling within a young boy. Here in \"Inside Out\", you have a group of entities that also embody the feelings...but in a young girl. When the film focuses on these five emotions, it's at its best---clever, fun and often sweet and tender. Unfortunately, the film loses its way a bit in the middle--and seems to have succumbed to some distractions. Fortunately, it finds its way very well at the end-- and ending which is incredibly satisfying and perhaps might require some Kleenex.The film is incredibly well animated and I was impressed by the 3-D version as it used this technology well. Additionally, the story is nothing like any CGI film I've ever seen. My only reservation is that the story might be a bit difficult for children to understand and the plot seems much more for older kids, teens and, especially, adults."
    },
    {
      "username": "james-calver",
      "userUrl": "https://www.imdb.com/user/ur26666505",
      "reviewLink": "https://www.imdb.com/review/rw3501562",
      "warningSpoilers": false,
      "date": "9 July 2016",
      "rate": "9",
      "helpful": "579 out of 930 found this helpful.",
      "title": "I feel like everybody has missed the point",
      "content": "I am not normally one to write reviews, but I couldn't help reading several for this film on this site that just did't seem to understand where I think the film was supposed to be coming from.The majority of the complaints I saw were that the film was 'too depressing for a children's film', but whilst I see where they are coming from in some regards, every child who I have seen watch this film (I work in a cinema) has absolutely loved it, and laughed out loud almost constantly. They are not old enough to realise the message the film is trying to convey: that life isn't all about happiness. I applaud the attempt from Pixar to make a film that is not only hilarious in places, but is also a major comment on what life is like to be a younger teenager, transitioning through one of the most important moments of life. From a more personal perspective, why should everything we show our children gloss over the reality of life, and try to make them believe everything is rosy 24/7? Again, what this film does brilliantly through the message I took away at the end was that life will never be 100% full of happiness, but that is fine. Why does it have to be? A little bit of sadness is necessary. If a person was never sad, they would be inhumane. Overall then, I suppose my review is more of a comment on the type of film we exhibit to children, and how the Nanny-state we live in looks to protect them from most of lives inevitabilities. Either way, what can't be ignored is that this film is equal parts sad, and equal parts what I am sure will become a timeless classic in years to come."
    },
    {
      "username": "SquigglyCrunch",
      "userUrl": "https://www.imdb.com/user/ur53150945",
      "reviewLink": "https://www.imdb.com/review/rw3320174",
      "warningSpoilers": false,
      "date": "20 September 2015",
      "rate": "6",
      "helpful": "174 out of 395 found this helpful.",
      "title": "An Interesting Concept with a Handful of Inconsistencies",
      "content": "Inside Out is the hit Disney-Pixar animated movie about emotions, specifically emotions living inside a person's brain in a somewhat human form and controlling how people react to things. It's an interesting concept, and for the most part it's presented well, but there are flaws for sure. The plot is, like I already said, interesting but flawed. It bothers me that people are saying that this is an incredibly original concept despite the fact that it's been done before. It's just the most popular use of the idea, but it's not the original. The story itself, however, has a handful of really good ideas, but there are inconsistencies with it too. The disappointing part is that most of the inconsistencies are actually pointless scenes that don't add to the story but instead end up taking away from it. There aren't a lot of them, but there's enough to take away from the movie itself. Most of the inconsistencies would spoil the movie, so you'll just have to watch it to understand. Other than that the ideas are good and some are even pretty amusing. The characters are okay. I found the most interesting characters to be the parents personally, with Riley being as flat as a pancake and everyone else just not being important enough to even remember by the time the credits roll. For a movie about emotion, Riley really isn't presented in a very realistic way. Sure, at times she's good, but most of the time her character is just inconsistent. The parents were, on the other hand, much more consistent, and funnier most of the time. I think that this movie had a great beginning and a great ending, it was just the middle stuff that struggled. It's a very emotionally intense movie, especially towards the end. I felt much more into the movie at these points, and even on my third watch I got a bit emotional about the ending. The movie felt a little too short as well, but maybe that's because I've seen it so many times already. Overall Inside Out is just good. I think that I loved it so much originally (I gave it a 10/10) because of the ending. It was pretty emotional the first time, but after the second watch I started to question it. By the third watch I found inconsistencies and a handful of things that I just didn't like about the movie. Ideas and such that just weren't nearly as good as I remember. In the end I'd still certainly recommend this movie, but if you want to really love it then don't analyze it, because otherwise you'll notice the things that I did (probably)."
    },
    {
      "username": "michaelRokeefe",
      "userUrl": "https://www.imdb.com/user/ur0449021",
      "reviewLink": "https://www.imdb.com/review/rw3264061",
      "warningSpoilers": true,
      "date": "24 June 2015",
      "rate": "3",
      "helpful": "118 out of 297 found this helpful.",
      "title": "Emotions...what are you doing?",
      "content": "INSIDE OUT is a colorful animated feature that I doubt if Disney and Pixar realize is probably too complex for the viewers they intend to reach. Riley(Kaitlyn Dias)is an 11 year old girl, who is really upset with her mom(Diane Lane)and dad's(Kyle MacLachlan)decision to uproot and move the family to San Francisco. Riley is separated from her friends and is just not so happy with dealing with a new house, school and city. She would rather be back in Minnesota playing hockey.Most of the film takes place inside Riley's young brain where she must deal with five emotions that dwell in Headquarters; there is Joy(Amy Poehler), Sadness(Phyllis Smith), Anger(Louis Black), Disgust(Mindy Kailing) and Fear(Bill Hader)that jostle to and fro trying to dominate control. Joy tends to be Riley's most important emotion trying to anchor her within a positive attitude.Other actors lending their voices: Richard Kind, Bobby Moynihan, Dave Goetz, Frank Oz, John Cooley and Paula Pell."
    },
    {
      "username": "PipAndSqueak",
      "userUrl": "https://www.imdb.com/user/ur6499406",
      "reviewLink": "https://www.imdb.com/review/rw3285379",
      "warningSpoilers": true,
      "date": "27 July 2015",
      "rate": "1",
      "helpful": "341 out of 785 found this helpful.",
      "title": "Misery on a stick",
      "content": "OK, playtime's over Pixar, now get over it. This film is so plainly a prequel – c.f. references to a 'puberty' button on the new 'emote' console in the character Rileys brain - you will fail to find anything of entertaining value for your 100 minute investment. You may harbour fond memories of Toy Story, Finding Nemo, The Incredibles and Ratatouille – all unique, funny, thrilling and entertaining. But, that is not what you will get with Inside Out. 'Joy', after all, is banished to long-term memory and can't get back in charge of the console. (Since when was a single emotion ever 'in charge' anyway?). Inside Out can be taken as a metaphor for the poor sops who work for the Disney Corporation. Yes, they started out with true optimism about the life journey they had chosen, (with Pixar). Then, all of a sudden they are 'taken over' by a less than friendly peer. To compound this, they are moved from their original 'playpen' to a new post industrial work lot. All is grim. Sadness takes hold and taints everything that is done. Even 'Joy' begins to sob with sadness and grief. Save us from this self-indulgent misery. Not only is it inappropriate as kiddie oriented movie fodder, those of us who are sentient, self-aware adults can do without this additional mock unhappiness. By the way, most human brains have a 'fat controller' who orchestrates proceedings keeping everything on an even keel – even if that is 'sadness' for a while. Riley's brain seems to be lobotomised – even before puberty has hit. Give this film a wide berth, in fact, it might be best if someone scuttles this ship before the pestilence it's carrying spreads."
    },
    {
      "username": "Radu_A",
      "userUrl": "https://www.imdb.com/user/ur20315186",
      "reviewLink": "https://www.imdb.com/review/rw3343618",
      "warningSpoilers": false,
      "date": "26 October 2015",
      "rate": "2",
      "helpful": "225 out of 498 found this helpful.",
      "title": "8.4 for shallow techno new age gibberish going nowhere?",
      "content": "A young girl's five emotions try to solve her identity crisis caused by moving, but when the wrong levers in brain's control center are pushed, things go awry. That synopsis made me push watching this further and further ahead to, but I loved Docter's masterpiece \"Up\" so I had to watch this in a theater while I still could. Me and my partner thought, well, not really expecting much, so it will probably be OK. But oh what a disappointment it was. OK, I admit we are not teens. And love Japanese animation. And I do not appreciate Disney because of their marketing bonanza and ill-fitting gender stereotypes. But this film is so chock-full of fantasy-killing and misguided ideological messages that I am flabbergasted. It is beyond me how so little viewers find offense with the messages, and that these are thoroughly inappropriate for kids. Like for instance: 1) You are not in control of your emotions, your emotions control you. 2) Thought and reason have no influence at all on your decisions. 3) If you do not keep your emotions in check, you will lose your memories. If you lose your memories, you will become emotionally unresponsive. 4) There is only one good emotion (joy). There are four negative ones (sadness, anger, disgust, fear). That is it. That is what everyone feels. To hell with love. Or desire. Or curiosity. Or faith. 5) In order to grow up, your joyful memories have to become sad memories. Why? Good question. That is the climax of the movie and there is no explanation why this should be the case.None of this makes any sense. The whole plot is completely incoherent. These messages hold no educational value whatsoever. And strangely this seems to be more obvious to children than to adults - I heard a boy asking his parents what any of that was supposed to mean. This is obviously made and marketed for tech-savvy young parents who think they should take their kids to something more \"challenging\" than \"Planes 2\". The parents look like what an ad exec at Disney imagines Google employees to look like - mom wears cute specs, dad a hipster beard and it is set in San Francisco on top of that. The whole thing is probably the most in-your-face marketing device posing for a movie that I have ever seen. And everybody seems to be literally buying it.Well, not everybody. Some of the reviewers here do have similar issues, so all is not lost for the human race. If you care for an alternative story about a girl away from home struggling to adapt, there is the fantastic new Ghibli feature \"When Marnie was there\". That film has everything \"Inside Out\" has not: a story, believable characters, imagination, mystery, and most importantly: heart."
    },
    {
      "username": "djangozelf-12351",
      "userUrl": "https://www.imdb.com/user/ur61770220",
      "reviewLink": "https://www.imdb.com/review/rw3338678",
      "warningSpoilers": true,
      "date": "19 October 2015",
      "rate": "1",
      "helpful": "399 out of 887 found this helpful.",
      "title": "Poor imagination and no fun turns the movie upside down.",
      "content": "This still had some appeal as a trailer but sadly as a whole it felt flat pretty fast.The whole movie had a depressing effect and this became more obvious as the movie progressed.The basic story was some what ridiculous about only 5 characters controlling your brain similar to the factions in divergent(same screenplay writer perhaps?)Of the 5 characters 2 are highlighted and both of them (Joy and Sadness)are just annoying and the 3 side characters are totally forgettable.Problem here is they always react the same making it very predictable and there for equals boring.It has not been a good animation year, only the penguins worked and Minions and now this one really failed miserable.So,please ,put the fun and laughs back in these movies and stop with putting adult subjects in to kids movies. That might have worked once but at this point you're overdoing it.I think this one was rushed and not as well worked out as previous installments by pixar and I do hope they find they're way again and return to the classics we all know and love.Re-animate."
    },
    {
      "username": "PennyReviews",
      "userUrl": "https://www.imdb.com/user/ur25790270",
      "reviewLink": "https://www.imdb.com/review/rw3402521",
      "warningSpoilers": true,
      "date": "25 January 2016",
      "rate": "3",
      "helpful": "67 out of 160 found this helpful.",
      "title": "Good enough",
      "content": "Inside Out is the story of how emotions work in our minds (in a girl's mind to be precise). The emotions, Joy and Sadness, wonder around the girl's mind, aiming to find a way back to the controlling room where they can help her through a big change in her life. The story is interesting, but it gets boring towards the end, as the one twist follows the other. Joy is a control freak, dictating every emotions' move and pretty much dominating the girl's mood. Other than that, and the overjoy-full mood, Inside out is funny and entertaining. The colours are vivid and the action enough to make a good movie. But I guess the whole control room, memories, dreams etc etc are kind of confusing, with all the islands and the maze. So 3 out of 10."
    },
    {
      "username": "MuviFan73",
      "userUrl": "https://www.imdb.com/user/ur57213624",
      "reviewLink": "https://www.imdb.com/review/rw3325618",
      "warningSpoilers": false,
      "date": "29 September 2015",
      "rate": "7",
      "helpful": "36 out of 76 found this helpful.",
      "title": "Great ride through emotions!",
      "content": "Inside out is movie about emotions. Various emotions depicted in the movie are joy, fear, disgust, anger and sadness. The movie is about a girl who grows up to 11 years of age and then faces, what we can say, her first major mental breakdown resulting in a sad core memory formation. This happens because of the reason they move from Minnesota to a new place. The dull phase of her life is gradually overcome as the movie progresses as she learns to handle emotions more nicely.A human brain consists of various parts. It's fair to say that activity in certain part is responsible for a specific emotion. The movie has portrayed it very nicely. Human brain is very complicated structure. How it works majorly remains a mystery. The work done in the movie is a great representation of available information. The movie shows how a human being matures in terms of his emotions. Its shown how the girl learns to handle multiple emotions in terms of memory.My personal favorite emotions(characters) go in order anger, fear, joy, disgust, and sadness. Anger being the most liked one. The movie is wonderful, great job done by creators. Fairly recommended."
    },
    {
      "username": "RforFilm",
      "userUrl": "https://www.imdb.com/user/ur26680166",
      "reviewLink": "https://www.imdb.com/review/rw3260569",
      "warningSpoilers": false,
      "date": "18 June 2015",
      "rate": "10",
      "helpful": "53 out of 117 found this helpful.",
      "title": "Inside Out is that emotional journey that has been missing from the movies for years. This is one of the best animated stories of all time!",
      "content": "Inside Out may be the most cartoony story Pixar has released but it is also the most complex and mature. On the one hand, the majority of it is set within the mind of an eleven year old girl and her imagination, but the movie bears in mind (no pun intended) that the human brain is a complex organ that operates on many levels and circuits. The subconscious, abstract thought, memory and emotion all had to be given a physical form for Inside Out. Like a lot of people, I trust Pixar, yet didn't think that they had the talent to pull off something as unique, but crazy as the idea intended. I like to think of my brain running like a computer with perfectly synthesized control in place that's ready to deal with the many problems of the real world as the machine is quick to place the right emotion in time. Not every emotion is correct, but with the right mindset, the solution eventually comes. Everyone thinks differently and I wouldn't have been surprised if the film's focus picked a different approach. Inside Out also presents a human mind that does run like a machine, but actually gives a personality to each emotion to run it. A girl named Riley is living happily with her family in Minnesota. Her goofy and friendly personality is thanks to the emotion that runs her the most, Joy (played by Amy Poehler). She works with the other emotions, Fear (played by Bill Hader), Anger (played by Lewis Black), Disgust (played by Mindy Kaling), and not so much with Sadness (played by Phyllis Smith) to ensure that Riley remains that happy kid she is. But as with life, every kid has to come to their first big event that begins their journey into a full human. In this case it's a move.Riley's family moves from Minnesota to San Francisco, and the emotions are having a hard time figuring out the best reaction. Joy would like to continue for Riley to stay happy, but Sadness starts to have the effect of changing past memories from happy to sad. A fight between Joy and Sadness causes them to be sent to long term memory, leaving the other emotions to run Riley. The child clearly has trouble adapting to the big city life and starts to shut herself out, even considering running away. Joy and Sadness must get back to headquarters to fix Riley, but Joy may not know what's best for everyone. Like Toy Story, Monsters Inc, Finding Nemo and Up, Inside Out is a buddy trip story that works because of it's leads. Amy Poehler and Phyllis Smith make a great time that work off of each other well. It's not just these two as all folks casted are well known comedians that are well placed in their roles. It kind of reminded me of The Lego Movie, but while that was meant to be a full comedy, Inside Out is one of the biggest emotional journeys ever put on screen.I would love to see the writing process that this movie went though as both stories (the real world and the world inside Riley) connect and play so well that either could operate on their own, but they still need each other. Riley represents that hard part of childhood when they discover that the world is such a big place that we all go through what she did; fear about what could happen to us, disgust at what we don't understand, anger when things go wrong, sadness when we are at our lowest, and joy when we finally realize that things can still go well even after all of that.I'll give this five happy memories out of five. Pixar has officially returned to form! Inside Out is the kind of movie that everyone will talk about for a long time; the kind of word of mouth that no one could ever buy; the one that kids will love the imagination from; the one that adults will find fascinating and emotional. Inside Out is a perfect movie and needs to be seen. It's not that you should consider watching this, but you NEED to see this."
    },
    {
      "username": "rusoviet",
      "userUrl": "https://www.imdb.com/user/ur5314775",
      "reviewLink": "https://www.imdb.com/review/rw3401551",
      "warningSpoilers": false,
      "date": "23 January 2016",
      "rate": "1",
      "helpful": "188 out of 420 found this helpful.",
      "title": "The film got a 8+ because in the first 12 minutes.....",
      "content": "....voila the heroine, upon arriving in San Francisco, has the GLBT seal of approval, aka the 'de rigeur' long-T multi-colored Jessie Jacksonska 'mo fo' acceptance attire. Even allowing for that it wasn't long before the film meandered into 'Esalen' idiocy and bluntly this mess is an agenda driven film.Boring - the animation was 'cheap' almost close to the Hanna Barbera crud of some 50 years ago - not well drawn Compare it to a great cartoon film 'Wreck It Ralph' - no agenda, no corny 'angst' a great film filled with classic one liners and actors that bring a smile to every single scene."
    },
    {
      "username": "darkbytes",
      "userUrl": "https://www.imdb.com/user/ur3982547",
      "reviewLink": "https://www.imdb.com/review/rw3262286",
      "warningSpoilers": false,
      "date": "21 June 2015",
      "rate": "1",
      "helpful": "282 out of 598 found this helpful.",
      "title": "Just a remake of a Japanese movie",
      "content": "This is just a remake of a Japanese movie called \"Poison Berry in my Brain\" which is an adaptation of a Comic by Setona Mizushiro release 2 YEARS ago!!!, They both contain exactly the same amount of \"personalities\" (5) making decisions in the brain, arranged in the same kind of room with the same table in the center!!! Pixar has had a rough last 2 years, with their movies under-performing at the Box-Office and with the critics... but can Pixar at least acknowledge what its based on?The Manga, or comic the Japanese movie is based on came out on 2013, it's really hard for us to believe that it wasn't read by someone in Oixar, them being big fans of Japanese Anime and comics..."
    },
    {
      "username": "zzyzx000-124-271558",
      "userUrl": "https://www.imdb.com/user/ur27405742",
      "reviewLink": "https://www.imdb.com/review/rw3326236",
      "warningSpoilers": true,
      "date": "30 September 2015",
      "rate": "1",
      "helpful": "344 out of 738 found this helpful.",
      "title": "Pixar has struck out",
      "content": "I don't have a lot of reasons to give. All I can say is that every other Pixar movie I have rated a 10. I love animations, and the artwork for this one is top notch. Pixar has been terrific at delivering great stories until this one. I even love CARS, which many others found fault with. I wasn't in a bad mood when watching this one. I had great expectations. It's simply sucks. It's made a lot of money and has over an 8 rating, so I'm in the minority here. I want to caution someone like me to save their money so please read the other reviews with a 1 star rating. Maybe that will help guide you to a different movie to watch."
    },
    {
      "username": "texxas-1",
      "userUrl": "https://www.imdb.com/user/ur13044000",
      "reviewLink": "https://www.imdb.com/review/rw3486378",
      "warningSpoilers": true,
      "date": "12 June 2016",
      "rate": "1",
      "helpful": "174 out of 382 found this helpful.",
      "title": "I wouldn't recommend this film to anyone, let alone children",
      "content": "The trailer was so misleading. It portrayed the film as funny, but this film is anything but. It starts off where 11 year old Riley moves from Minnesota to California which she is unhappy about. She gets to the gloomy grey house in a gloomy grey street and you feel her depression and disappointment. It was California but there was no sunshine to speak of. You wouldn't expect this kind of bleakness in a film aimed at young people let alone children. The film barely gave Riley any screen time and spent most of the time on emotions Joy and Sadness, who were both trapped outside brain headquarters and trying to get back. Sadness has to be the most annoying, unlike-able character. On the way they meet Bing Bong, Riley's old imaginary elephant friend. Seeing him cry because he's sad Riley no longer plays with him made me cry, but it gets worse, when he and Joy get trapped in a dump and both try to escape, they can't get out together because he's to heavy,so he let's her go alone, she looks back to see him disappearing into thin air while saying \"take Riley to the moon for me\". This was a Bambi sad moment. We never get reunited with Bing Bong and never see or hear from him again, this is such a downer, he was innocent,helpful and likable.There was one scene where Riley introduces herself to her new classmates and then bursts into tears because she didn't want to be there, I couldn't help but think this was an overreaction. Since Joy and Sadness were no longer in her mind she's only left with Disgust,Anger and Fear (these characters had nowhere near enough screen time and were much more entertaining than Joy and Sadness). She decides to steal money from her mother and run away back to Minnesota, but as soon as she's on the bus, Sadness and Joy have made it back to headquarters and Joy orders Sadness to do her work. Riley suddenly feels sadness and realising she'll miss her family changes her mind and runs back home. As soon as she sees her parents she starts crying and says she doesn't like living here. Her parents comfort her and the film ends there.So the moral of the story is its okay to cry and that all our emotions are important,even the bad ones. If Riley didn't feel sadness she would have never seen sense and went ahead with her stupid plan and probably end up being raped and murdered.Once the film is over you don't feel happy, nothing good really happened it was just wall to wall misery. Bing Bongs death, Riley being isolated from her parents, ditching her hobbies, losing her two important emotions, losing her old friends, hating her new house, eating lunch alone at her new school and running away. This is a Disney film right? Talk about putting bad ideas in children heads. After the film was over I felt sad for the rest of the day and night. I wish I never watched this."
    },
    {
      "username": "drdeathforpresident",
      "userUrl": "https://www.imdb.com/user/ur8598392",
      "reviewLink": "https://www.imdb.com/review/rw3267676",
      "warningSpoilers": true,
      "date": "30 June 2015",
      "rate": "1",
      "helpful": "321 out of 686 found this helpful.",
      "title": "inside out of your mind",
      "content": "what a complete waste of time - read all the wonderful reviews that are misleading, obviously these are the people that go to Disneyland about 20 times a year - incredibly slow paced, especially after \"JOY\" & \"SADNESS\" get sucked into another dimension where they befriend Bing Bong, Riley's imaginary friend. Wow - it took forever. Bing Bong is the films JAR JAR BINKS, just so annoying and irritating. This is a definite G rated film. I did not see any adult themes whatsoever. This movie makes Winnie The Pooh look like a horror film. This is for 12 year old girls. Parents are so delusional(thanks for the positive reviews Mom & Dad)"
    },
    {
      "username": "Stephan_fr",
      "userUrl": "https://www.imdb.com/user/ur96504282",
      "reviewLink": "https://www.imdb.com/review/rw6270808",
      "warningSpoilers": false,
      "date": "14 November 2020",
      "rate": "1",
      "helpful": "80 out of 177 found this helpful.",
      "title": "Convoluted mess without entertainment value.",
      "content": "Love them or hate them, Disney movies have always had one thing in common: they tried to transport you into a magical world populated with interesting, colorful characters.\"Inside Out' foregoes that tradition and seems to be trying to explain basic principles of psychology to young audiences. The result is a mess: not only is it not 'fun', it's also constantly shoehorning painful exposition mechanism by having characters explain what's on screen.I just don't see kids below 10 enjoying this in the least. And as an adult, there are better ways to learn about psychology than watching an animated film.Utterly bizarre."
    }
  ],
  "errorMessage": ""
}