{
  "imDbId": "tt2096673",
  "title": "Inside Out",
  "fullTitle": "Inside Out (2015)",
  "type": "Movie",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Inside Out (2015 film)",
  "url": "https://en.wikipedia.org/wiki/Inside_Out_(2015_film)",
  "plotShort": {
    "plainText": "Inside Out is a 2015 American computer-animated film directed by Pete Docter from a screenplay he co-wrote with Meg LeFauve and Josh Cooley. Produced by Pixar Animation Studios, it stars the voices of Amy Poehler, Phyllis Smith, Richard Kind, Bill Hader, Lewis Black, Mindy Kaling, Kaitlyn Dias, Diane Lane, and Kyle MacLachlan. The film follows the inner workings inside the mind of a young girl named Riley, who adapts to her family's relocation, as five personified emotions administer her thoughts and actions.\r\nDocter conceived Inside Out in late 2009 after noticing changes in his daughter's personality as she grew older, and it was subsequently green-lit. Based on the remembrances of Docter and the film's co-writer and co-director Ronnie del Carmen, they adopted an idea involving emotions for the film. During production, the filmmakers consulted psychologists and neuroscientists in order to achieve greater accuracy in their portrayal of the mind. Development on Inside Out lasted for five and a half years, on an approximate $175 million budget, and the film faced production difficulties, including story changes.\r\nInside Out debuted out of competition at the 68th Cannes Film Festival on May 18, 2015, and was released in the United States on June 19. The film received positive reviews for its craftsmanship, screenplay, subject matter, plot, and vocal performances (particularly those of Poehler, Smith, Kind, and Black). Organizations like the National Board of Review and the American Film Institute named it as one of the top ten films of 2015. Inside Out earned $858.8 million worldwide, finishing its theatrical run as the seventh-highest-grossing film of 2015. The film was nominated for two awards at the 88th Academy Awards, winning Best Animated Feature, and received numerous other accolades. A sequel, Inside Out 2, is in production and set for release on June 14, 2024.",
    "html": "<p>Inside Out is a 2015 American computer-animated film directed by Pete Docter from a screenplay he co-wrote with Meg LeFauve and Josh Cooley. Produced by Pixar Animation Studios, it stars the voices of Amy Poehler, Phyllis Smith, Richard Kind, Bill Hader, Lewis Black, Mindy Kaling, Kaitlyn Dias, Diane Lane, and Kyle MacLachlan. The film follows the inner workings inside the mind of a young girl named Riley, who adapts to her family's relocation, as five personified emotions administer her thoughts and actions.</p><p>Docter conceived Inside Out in late 2009 after noticing changes in his daughter's personality as she grew older, and it was subsequently green-lit. Based on the remembrances of Docter and the film's co-writer and co-director Ronnie del Carmen, they adopted an idea involving emotions for the film. During production, the filmmakers consulted psychologists and neuroscientists in order to achieve greater accuracy in their portrayal of the mind. Development on Inside Out lasted for five and a half years, on an approximate $175 million budget, and the film faced production difficulties, including story changes.</p><p>Inside Out debuted out of competition at the 68th Cannes Film Festival on May 18, 2015, and was released in the United States on June 19. The film received positive reviews for its craftsmanship, screenplay, subject matter, plot, and vocal performances (particularly those of Poehler, Smith, Kind, and Black). Organizations like the National Board of Review and the American Film Institute named it as one of the top ten films of 2015. Inside Out earned $858.8 million worldwide, finishing its theatrical run as the seventh-highest-grossing film of 2015. The film was nominated for two awards at the 88th Academy Awards, winning Best Animated Feature, and received numerous other accolades. A sequel, Inside Out 2, is in production and set for release on June 14, 2024.</p>"
  },
  "plotFull": {
    "plainText": "Inside Out is a 2015 American computer-animated film directed by Pete Docter from a screenplay he co-wrote with Meg LeFauve and Josh Cooley. Produced by Pixar Animation Studios, it stars the voices of Amy Poehler, Phyllis Smith, Richard Kind, Bill Hader, Lewis Black, Mindy Kaling, Kaitlyn Dias, Diane Lane, and Kyle MacLachlan. The film follows the inner workings inside the mind of a young girl named Riley, who adapts to her family's relocation, as five personified emotions administer her thoughts and actions.\r\nDocter conceived Inside Out in late 2009 after noticing changes in his daughter's personality as she grew older, and it was subsequently green-lit. Based on the remembrances of Docter and the film's co-writer and co-director Ronnie del Carmen, they adopted an idea involving emotions for the film. During production, the filmmakers consulted psychologists and neuroscientists in order to achieve greater accuracy in their portrayal of the mind. Development on Inside Out lasted for five and a half years, on an approximate $175 million budget, and the film faced production difficulties, including story changes.\r\nInside Out debuted out of competition at the 68th Cannes Film Festival on May 18, 2015, and was released in the United States on June 19. The film received positive reviews for its craftsmanship, screenplay, subject matter, plot, and vocal performances (particularly those of Poehler, Smith, Kind, and Black). Organizations like the National Board of Review and the American Film Institute named it as one of the top ten films of 2015. Inside Out earned $858.8 million worldwide, finishing its theatrical run as the seventh-highest-grossing film of 2015. The film was nominated for two awards at the 88th Academy Awards, winning Best Animated Feature, and received numerous other accolades. A sequel, Inside Out 2, is in production and set for release on June 14, 2024.\r\nPlot\r\nWithin the mind of a young girl named Riley are the basic emotions that control her actions: Joy, Sadness, Fear, Disgust, and Anger. Her experiences become memories, stored as colored orbs, which are sent into long-term memory each night. The aspects of five most important \"core memories\" within her personality incorporate the form of five floating islands. Joy acts as the leader, and she and the rest of the emotions try to limit Sadness's influence.\r\nAt the age of 11, Riley moves from Minnesota to San Francisco for her father's new job. She at first has poor experiences: the new house is cramped and old, her father hardly has any time for her, a local pizza parlor only serves pizza topped with broccoli, which she detests, and the moving van with their belongings was misdirected to Texas. On Riley's first day at her new school, Sadness retroactively turns joyous memories sad, which causes Riley to cry in front of her class and creates a sad core memory. Joy tries to dispose of it by using a vacuum tube, but accidentally knocks the other core memories loose during a struggle with Sadness, disabling the personality islands. Joy, Sadness, and the core memories are sucked out of Headquarters.\r\nIn Joy and Sadness's absence, Anger, Fear, and Disgust are forced to take control of Riley with disastrous results, distancing Riley from her parents, friends, and hobbies. Her disused personality islands gradually crumble, and fall into the \"Memory Dump\", where things fade to non-existence as they are forgotten. Finally, Anger resolves to run away to Minnesota, believing it will restore Riley's happiness.\r\nWhile navigating the vast long-term memory area, Joy and Sadness encounter Bing Bong, Riley's imaginary friend, who suggests riding the \"train of thought\" back to Headquarters. After several adventures and mishaps, the trio eventually catch the train; however, it halts when Riley falls asleep, then derails entirely with the collapse of another island. Afraid that all the core memories will become sad, Joy abandons Sadness and tries to ride a \"recall tube\" back to the Headquarters. The ground below the tube collapses, breaking it and sending Joy and Bing Bong plunging into the Memory Dump.\r\nAfter discovering a sad memory that turned happy when Riley's parents and friends comforted her, Joy understands Sadness's purpose of alerting others when Riley is emotionally overwhelmed and needs help. Joy and Bing Bong try to use Bing Bong's chant-fueled wagon rocket to escape the Memory Dump. They fail to fully ascend, due to their combined weight, until Bing Bong jumps out at the last moment and fades away.\r\nJoy reunites with Sadness and they return to Headquarters, discovering that Anger's idea has disabled the console, rendering Riley apathetic as she boards a bus to Minnesota. To the surprise of the others, Joy hands control of the console to Sadness, who is able to reactivate it and prompt Riley to return to her parents. As Sadness re-installs the core memories, transforming them from happy to sad, Riley tearfully confesses to her parents that she misses her old life. Her parents comfort her and admit they also miss Minnesota. Joy and Sadness work the console together, creating a new core memory consisting of happiness and sadness; a new island forms, representing Riley's acceptance of her new life in San Francisco.\r\nA year later, Riley, now at the age of 12, has adapted to her new home, made new friends, and returned to her old hobbies while acquiring a few new ones. Inside Headquarters, her emotions admire Riley's new personality islands, and are given a newly expanded console with room for them all to work together.\r\nVoice cast\r\nAmy Poehler as Joy\r\nPhyllis Smith as Sadness\r\nRichard Kind as Bing Bong\r\nBill Hader as Fear\r\nLewis Black as Anger\r\nMindy Kaling as Disgust\r\nKaitlyn Dias as Riley\r\nDiane Lane as Mom\r\nKyle MacLachlan as Dad\r\nPaula Poundstone as Forgetter Paula\r\nBobby Moynihan as Forgetter Bobby\r\nPaula Pell as the dream director and Mom's Anger\r\nDave Goelz as Subconscious Guard Frank\r\nFrank Oz as Subconscious Guard Dave\r\nJosh Cooley as Jangles\r\nFlea as Mind Worker Cop Jake\r\nJohn Ratzenberger as Fritz\r\nCarlos Alazraqui as a helicopter pilot\r\nPeter Sagal as Clown's Joy\r\nRashida Jones as Cool Girl's emotions\r\nThemes and analysis\r\nA central theme of Inside Out is the consequences and portrayal of emotions and memories. Those depicted in the film are \"honest\" and \"generous\"; their goal is maintaining Riley's life. Natasha Moore of the Australian ABC News detailed the film's theme: \" Riley's carefree life gets more complicated, Joy's attempts to deliver uninterrupted happiness become increasingly neurotic.\" Nicole Markotic argued that the film explores the relationship between \"the many and the one\", demonstrating that people have \"composite\" personalities. The different components of one person's personality are vital for that person's \"emotional and psychological balance\". Depression and sadness are distinct in the film, and this distinction is meant to \" individuals strategies to avoid suppressing crucial feelings\". Writing in the British Journal of Psychiatry, Hannah Marcarian and Paul O. Wilkinson agree that this validation of different emotions helps people express themselves.\r\nRuth Bettelheim of USA Today wrote that human responses to physical and social environments evolved over millions of years, and have not yet been fully understood, as shown by the film not including Riley's bodily sensation and their possible effect on mental states. Primatologist Louise Barrett thought the film showed disconnection between characters who are not relating to each other, or to their own emotions; but moments of personal harmony lead to positive interpersonal connections. According to USA Today's Jamie Altman, the film shows that major environmental changes can be \"difficult, but not impossible, to overcome\", recommending it to college students experiencing homesickness or sadness.\r\nProduction\r\nDevelopment\r\nThe development of Inside Out began in late 2009, when director Pete Docter felt anxiety about his adolescent daughter Elie's progressing introversion. Docter approached Ronnie del Carmen to become a co-director, and he eventually accepted the offer, citing his \"accidental\" animation work. They relived their past experiences and histories to adopt an idea involving emotions for the film, aiming to depict them with strong, caricatured personalities. Docter had decided to make it after del Carmen determined most of the film's aspects had narrow appeal.\r\nThe directors and producer Jonas Rivera researched the mind with the help of psychologist Paul Ekman and the University of California, Berkeley professor of psychology Dacher Keltner. Pixar animator Dan Holland and his team allowed some psychologists and specialists to accurately develop the film's story. Production designer Ralph Eggleston authorized neuroscientists to design the locations in Riley's mind using DNA-based cues and photographs of neuronal flashes. In Keltner and Ekman's opinion, they emphasized the emotions' formation of social lives and interactions, which can moderate themselves.\r\nWhile Keltner focused on Sadness that strengthens relationships, Ekman identified seven emotions with \"universal signals\" early: anger, fear, sadness, disgust, joy, contempt, and surprise. Therefore, Docter removed surprise from Inside Out after he corroborated that it and fear were similar; contempt was abandoned also by the filmmakers. Two of Joy's initial names, happiness and an unrelated optimism, were combined with Joy. A total of 27 emotions, including irritation, envy, greed, gloom, despair, depression, love, schadenfreude, ennui, shame, embarrassment, and hope, were considered for the film before reducing to their possible value. Its finalized, streamlined scope featured a condensed story and the emotions' traits.\r\nInside Out was green-lit in October 2009, after Docter was interested in forming the main character's story arc. Chief creative officer John Lasseter offered little input on the film due to his focus on restructuring Walt Disney Animation Studios, and it was the first for Pixar without involvement of co-founder and former Apple CEO Steve Jobs, who died in 2011. Executives at Disney and Pixar were positive at Docter's proposal, but acknowledged it was difficult to advertise. The film spent five and a half years in development, with an approximate $175 million budget. Docter and Eggleston described this an intricate and lengthy process. As such, first-time directors were likely ineligible to work on the film.\r\nWriting\r\nIn 2010, Docter and the filmmaking team met to discuss aspects about Inside Out, including its setting, rules, and reels. Docter then recruited a small story team to develop the film's plotline and design its characters within 12 months; their main challenge was to deal with its multilayered technique. Though the film's script was deemed ambitious and ingenious, screenwriter Michael Arndt spent a year on it before leaving the project in early 2011; he was attributed with additional story material.\r\nTo promote diverse input, half of the story team were women, at a time when the animation industry consisted largely of men. Although Inside Out's focus was about a girl, research found that females age 11 to 17 were more attuned to expressions and emotions than younger girls. Docter decided that Riley was not a main character, but her role as a setting. He considered the lead emotion as female, since Riley had the same gender. Other emotions were assigned between male and female. Del Carmen influenced the film's story development based around his upbringing, and preferred the idea of hockey's popularity in Minnesota, becoming a core concept. Docter also discarded an initial idea about Riley falling into a deep depression. Creation of storyboards for Inside Out took two to three years, and included seven to eight screenings for Pixar's \"brain trust\" (a small group of creative leaders who oversee its development on all films).\r\nThe filmmakers were responsible for expressing the characters' personal traits, talents, and contrasts. Inside Out's design team researched more of her personality's distinct directions, after Docter was concerned over Joy's displeasure. Designer Albert Lozano wanted Joy with tomboyish and \"mischievous\" characteristics. Amy Poehler helped the team to write Joy, illustrating a broad range of happiness after facing difficulties. With LeFauve's help, the team envisioned Joy as vulnerable and intangible because she was \"unapologetically positive\". From the outset, the idea persisted about Joy's potential to excessively manipulate youth, setting off Riley's \"social storms\".\r\nIn one instance, Riley was to have wanted the lead role as a turkey in a Thanksgiving Day pageant. Ultimately, Docter found that plot idea to be too unfamiliar, and sought something to replace it. Several drafts emerged, including: the characters cultivating ideas after falling to \"Idea Fields\"; and Bing Bong recruiting at a large, exiled entourage from Riley's childhood. Richard Kind later defined his character as \"the fading of childhood\" when Inside Out's development had progressed. In October 2011, Diane Disney Miller convinced Docter to reduce Inside Out's distractions and reprioritize the story. Docter determined that the concept of personality islands could integrate the mind world's geography and story.\r\nIn 2012, the film was put into production after several screenings and suggestions, and evaluated after three months. Editor Kevin Nolting said that seven versions of the film were created before the production began. The difficult part was to balance the film's tone, for example, how viewers would respond to Joy's cheerful nature while feeling negative about the mess that Joy manipulated in Riley. Rivera credited Poehler for fleshing out these aspects of Joy's nature. Eggleston recommended that the film be set to take place in the mind rather than in the brain, as such a few scenes about the brain were dropped.\r\nAn early version of Inside Out focused on Joy and Fear getting lost together. In July 2012, Pixar filmmakers held an evaluation screening of the film. Docter came to find that storyline nonfunctional, and was reluctant to be fired. In 2013, Docter was still unsure about what Joy had learned from Fear to develop her characterization, eventually reached a breakthrough to integrate emotions and relationships within the film. Storyboarding was reworked to replace Fear with Sadness and give Sadness a \"much juicier\" role. Docter's altercation between Joy and Sadness lacked the film's emotional ending. To address the issue, he changed a scene where Riley is separating from her friend in its subsequent portions. Islands of Friendship and Personality became Joy and Sadness's outings in the film to maintain its continuity.\r\nOver the course of storyboarding, 27 sequences and 178,128 outlines were developed, with 127,781 remaining upon completion. According to Cooley, 10 plot rewrites of Inside Out and 10 unabridged scenes of Riley’s mind were made. Initial storyboarding differentiated the importance of Riley's story arc than emotions, but Rivera considered the film's balance was \"about 75 percent inside, 25 percent out\". In early 2013, the filmmakers made seven to eight distinct openings for the film. The brain trust eventually locked the picture and its story. After Cooley and Meg LeFauve contributed the film's rewrite, they were credited as screenwriters. Docter, Cooley, and LeFauve worked on experiences with raising their own children into the screenplay. Cooley highlighted these as emotions and subsequently created them. Production of the film concluded in May 2015, after three years.\r\nCasting\r\nVoice recording began in 2013 and ended in 2014. Casting focused on actors that have personas identical to the emotions they voiced. As Inside Out contained several veterans of Saturday Night Live (SNL), the film's team spent a week at that program for research on a live television sequence. Poehler and Phyllis Smith had three voice recording sessions. Once Smith got a call for traveling to Pixar's headquarters in Emeryville, California, Rivera chose her after watching a lunch scene in Bad Teacher (2011). He contacted Docter and remarked, \"I think we found our Sadness.\" Poehler was hired as the last of the emotions' cast.\r\nFear was inspired by Don Knotts. According to Lozano, Knotts had wide eyes. Docter said, \" was the kind of guy who could bring sophistication and then flip on a dime\". Bill Hader was cast as Fear after he and the filmmakers visited the set of SNL in New York City for a week, and also assisted at the story room. His casting was assumed until his stay ended, but he asked to contact fellow SNL veteran Poehler that it was secret. Hader later reaffirmed his involvement in Inside Out. In all recording sessions, he instructed his screaming voice for his role of Fear.\r\nWhen the story was pitched by Mindy Kaling, she said that it sounded \"really beautiful\" and joined the cast. Disgust was described as akin to the looks of April Ludgate and Veruca Salt. Docter exemplified Lewis Black for Anger, and he was cast after the filmmakers kept him in mind as expected, having realized Black's voice. Kind was cast to voice Bing Bong, who tried to convey the same \"sort of innocence\" of his previous Pixar roles, and wound up not taking part in pre-release promotion as the producers decided to keep the character a secret.\r\nAnimation\r\nAnimation of Inside Out took a year and a half. About 48 animators (including supervisors Shawn Krause and Victor Navone, and director Jamie Roe), and 350 artists (35 of them lighting–led by cinematographer Kim White–and 10 layout) and technicians were involved in the production of the film. Two other animation teams were also produced: one was separate for abstract sequence and another was crowded for the character process. The team utilized unique technology to locate every part of the human body.\r\nDocter imagined that with emotions for characters, they could \"push the level of caricature\" to both design and \"style of movement\" to degrees. To this end, they emulated the styles of animators Tex Avery and Chuck Jones. Docter informed Krause and Navone to push the graphic caricature of each character rather than sticking to the rigid behavior of each RenderMan model. This required an artist to draw over characters in Inside Out during dailies, using a Wacom Cintiq. The team spent over three years on enhancing the dinnertime scene, the first one to do so. Sketches resembled the emotions were superior by the filmmakers, despite the rules broke within such boundaries. After the characters were brought to finalized forms, they were proposed for 3D models using desktop computers. The filmmakers studied dailies and understand animation until Docter gave the film's finalized shots for their approval on lighting and rendering.\r\nThrough the simulation department, the motion of the characters' hair and their garments were added. Eggleston's production design arrived, moving forward for added placements that included their original inspiration for lighting Joy. Pixar co-founder Edwin Catmull believed the characters' attributes have a lesser extent of humanoid forms, brighter colors, and strange shapes due to their possession of force fields. Rendering took 33 hours. All aspects of Inside Out were eventually merged to a single image, having an animation spread across 1,600 shots. The film took three weeks of animation to create three seconds of footage.\r\nEggleston's diagram was made of pastels shaped Joy, having her increased illumination and making her Pixar's crucial character. Instead of being solid, Joy's effervescence was derived from pinwheels, Champagne, and sparklers. Lozano thought that Joy would look like Audrey Hepburn. For Joy to become brightened, the RenderMan team turned real light from a geometry, and Docter suggested to design her with \"sprite-like and golden\" modifications. The filmmakers worked for eight months on Joy's aura, but encountered difficulties related to time and budget. Lasseter requested that it be applied for each emotion instead. Eggleston described this technique, \"You could hear the core technical staff just hitting the ground, the budget falling through the roof\". Docter and his six-designer team spent approximately 18 months finalizing Joy's look. Overall, the process on making Joy ran for three years.\r\nDesign and cinematography\r\nEggleston was tasked with outlining Inside Out's worlds. Its design faithfully reflected Pixar films Up (2009), Toy Story 3 (2010), and the intended 1950s Broadway musicals, which Navone tightened its aspects and was emphasized by freeform techniques. The mind world's layout and cinematography took inspiration from Casablanca (1942). Around 300 different designs of Headquarters were developed. Pixar researched films within the Hollywood's golden age for set constructions. They performed master moving shots in combining them into a single scene, the longest of which were 48 seconds or 1,200 frames. In envisaging how the mind's interior would be depicted, the filmmakers concentrated on the word \"electrochemical\" and was considered for various options using electricity.\r\nDirector of photography Patrick Lin placed Inside Out's camera language into the mind and real worlds for determining and differentiating them; they were respectively described as superior and inferior. The real world had problems created through lens distortion and out-of-focus shots. Even so, directorial changes countered the camera's complex usage. Two types of camera lenses (Arri/Zeiss Ultra Prime and Cooke S4), with distinct camera movements and predetermined paths, were used for both worlds. An inherent mechanical procedure using a dolly, track, crane, and boom was used in the mind one; and biological cameras like zoom, Steadicam, and hand-held in the real one. Lin's crew supervised Riley's story arc as these cameras were applied in the film across three acts: first was Steadicam, followed by two were hand-held.\r\nThe use of scale progressions, which measured the worldbuilding size of the main characters, were made for handling the development of them and Riley and Joy's arcs. Staging was used for Inside Out's story, while framing for its theme. One of the film's parts was described as earliest and reserved, and had closeups for adults indicated for growing up, especially for Joy and Riley. The cameras were created by their crew have attached sensors and were \"rough\" and \"physical\"; these were improved in Inside Out after using them in Pixar's short film The Blue Umbrella (2013). For projecting Inside Out's environment, they used humans to surround it for the development and assembly of the film's scenes. Layout supported Inside Out's virtual scenes, making them blocked and animated.\r\nMusic\r\nMichael Giacchino served as composer for Inside Out. He began planning in January 2015, before concluding that May. While in the music session, Docter felt its score \"bittersweet\" and \"nostalgic\" after he \"grew up playing the violin and bass\". Giacchino wanted to create something more emotionally monumental for Inside Out's score, when compared to his score from Up. The producers first met with Giacchino to discuss the film's concept and screen it for him. In response, he composed an eight-minute suite of music, unconnected to the film, based on his emotions viewing it. Rivera remarked that as both Giacchino and Docter were musicians, and they discussed the film in terms of story and character. In accordance with its creative preference, a progressive soundscape was made by sound designer Ren Klyce, who was joined by Rivera. Docter took a four-year discussion where his piano sessions considered forgetfulness, and a chewing gum advertising jingle was disturbing.\r\nMarketing and release\r\nDisney spearheaded the marketing campaign. Their strategy entailed aggressive social media engagement, a worldwide publicity tour, and the creation of five colorful character posters. Leading up to its release, Inside Out was test screened for children, since executives were concerned about the film's appeal to younger viewers.\r\nThe 95-minute Inside Out debuted out of competition at the 68th Cannes Film Festival on May 18, 2015, followed by a premiere on June 16, at the El Capitan Theatre in Los Angeles. Inside Out was originally scheduled for general release on May 30, 2014, but it was pushed back to June 19, 2015. The film was also released in 3D, as well as Dolby Vision, one of the earliest films to adopt the format. In theaters, Inside Out was accompanied by a short film, Lava (2014).\r\nWalt Disney Studios Home Entertainment released Inside Out for digital download on October 13, 2015, and on Blu-ray and DVD on November 3. Physical copies contain behind-the-scenes featurettes, audio commentary, deleted scenes, and two shorts: Lava and Riley's First Date? (2015). The film earned a revenue of $95.5 million with 5.3 million copies sold, making it the second best-selling title of 2015 behind Jurassic World. In 2019, Inside Out was released on 4K Ultra HD Blu-ray.\r\nReception\r\nBox office\r\nInside Out earned $356.9 million in the United States and Canada and $501.9 million in other territories, for a worldwide total of $858.8 million. It was the seventh-highest-grossing film of 2015. Deadline Hollywood calculated the film's net profit as $279.51 million, accounting for production budgets, marketing, talent participations, and other costs; box office grosses and home media revenues placed it sixth on their list of 2015's \"Most Valuable Blockbusters\".\r\nIn the United States and Canada, Inside Out was released with Dope on June 19, 2015. It earned $34.3 million on its first day, including $3.7 million from Thursday night previews. The film debuted in second place behind Jurassic World, earning $90.4 million from 3,946 theaters (3,100 in 3D); it was the first for Pixar not to do so at first. For any film that broke a such record during the opening weekend, Inside Out surpassed The Day After Tomorrow's (2004) $68.7 million. Inside Out's successful opening was attributed to its Cannes premiere, CinemaCon and Fathom Events screenings, its critical reception, good word-of-mouth, and Father's Day weekend. The film attracted a mostly female audience, with about 63 percent; 71 percent for families; and 59, 46, and 38 percent being under 25, 18, and 12 years of age, respectively. Additionally, it had the highest opening weekend for an original film, surpassing Avatar (2009). Its second weekend earnings dropped by 42 percent to $52.1 million, and followed by another $29.8 million the third weekend. By July 19, the film's domestic earnings topped $300 million. Inside Out completed its theatrical run in the United States and Canada on December 10, 2015, as the year's fourth highest-grossing film. In July 2020, due to the COVID-19 pandemic closing most theaters worldwide and limiting what films played, Inside Out returned to 442 theaters (mostly drive-ins) and earned $340,000.\r\nWorldwide, Inside Out earned $40.3 million in its opening weekend in 37 markets. On its opening weekend elsewhere, the top countries were China ($11.7 million), the United Kingdom ($11.5 million), Mexico ($8.6 million), Russia ($7.6 million), Italy ($7.4 million), Germany ($7.1 million), and South Korea ($5.2 million). In Russia, Inside Out was the first Pixar film to earn more than one billion rubles. By September 20, 2015, the film's offshore gross had exceeded $408.8 million. As of December 2021, its top international markets were the United Kingdom ($59.5 million), Japan ($32.9 million), South Korea ($32.7 million), Germany ($31.6 million), and France ($30.1 million).\r\nCritical response\r\nInside Out has an approval rating of 98% based on 379 professional reviews on the review aggregator website Rotten Tomatoes, with an average rating of 8.9/10. Its critical consensus reads, \"Inventive, gorgeously animated, and powerfully moving, Inside Out is another outstanding addition to the Pixar library of modern animated classics.\" Metacritic (which uses a weighted average) assigned Inside Out a score of 94 out of 100 based on 55 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale. Before the release of Inside Out, fans and critics were concerned by a perceived overdependence on sequels on the part of Pixar, which was only exacerbated by the announcement of Toy Story 4 (2019), and their films declining in quality. Likewise, DreamWorks Animation's competition with Pixar was disappointingly lacking, leading to speculation that computer-animated films were \"in a funk\".\r\nCritics praised Inside Out's craftsmanship that was attributed to Docter's expertise, describing it as a return to form for Pixar. Peter Debruge (Variety), Kenneth Turan (Los Angeles Times), and Todd McCarthy (The Hollywood Reporter) praised the film. Debruge and Turan described it as the best, with his and McCarthy's evaluations were meant \"sophisticated\" and \"audacious\". Turan and Richard Brody (The New Yorker) cited the film's engaging visuals, responsibility to emotions, characterization of solutions, and narrow aspects of Riley's imagination; Debruge and Anthony Lane (The New Yorker) encouraged its originality. Vulture's David Edelstein suggested them that the film made a \"new pop-culture touchstone\". Despite these overall reviews, The Guardian critic Peter Bradshaw and Slant Magazine writer Christopher Gray assessed the film as slightly inferior to Pixar's best.\r\nThe scriptwriting, plot, and subject matter were sources of praise. Forbes's Scott Mendelson thought that its qualities of narration provided a purpose, whereas Leigh Singer of IGN conveyed the film's tropes: child devotion, teamwork, and confused chases. Singer expressed the \"tried-and-tested\" journey had an unprecedented \"licence to go\". In contrast, Rene Rodriguez, writing for the Miami Herald, expressed concern over the film's plot. Rodriguez cited its aspects, including its story skipping from the beginning to the end, and events involving inside Riley's head having thin goals. Ann Hornaday (The Washington Post) and A. O. Scott (The New York Times) appreciated its entertaining subject matter, promoting mental health by The Hindu's Udhav Naig, the body language by ComicBook.com's Chase Magnett, and the human movements by USA Today's Brian Truitt and Reason's Kurt Loder. On the other hand, Naig panned the film's misinterpretation of brain functions. Matt Zoller Seitz of RogerEbert.com emphasized the film's script that has clear connections to its aspects, including Joy's comprehension should \"what things mean, and what the other emotions ought to 'do' for Riley\".\r\nReviews for the actors' performances were very positive in the media, with their work described as \"wonderful\" and \"excellent\". Edelstein laboriously commended Poehler's acting, indicating that she had \"supernatural exuberance but the semi-tonal quavers of doubt that keep that from being cloying or cartoonish.\" Joy was viewed as a heartful character and Sadness was a superfluous disapproval to the \"secret side\" by Tim Grierson of Paste, whereas Vox's Alex Abad-Santos felt that because of its appealing voice cast. Magnett credited Grierson's examination that reached these roles to their extent with accommodation, and made Anger the \"most perfect\" one due to his routine having a culmination, having a \"sense of humor and genuine care\". While Seitz took Sadness to have more value of her contribution, others, such as Jessica Kiang (IndieWire) and Tasha Robinson (The Dissolve), cited character development as one of its strengths.\r\nInside Out was included on a number of best-of lists. It was listed on many critics' top ten lists in 2015, ranking fourth. The film appeared on professional rankings from BBC, The New York Times, Empire, and The Independent based on retrospective appraisal, as one of the greatest films of the twenty-first century. Inside Out appeared on several lists of the best films of the 2010s in 2019, by outlets including: IndieWire, The A.V. Club, The Independent, RogerEbert.com, /Film, Time Out London, GamesRadar+, and the Los Angeles Times. Several publications have listed it as one of the best animated films, including: Harper's Bazaar (2017), Insider, USA Today, Elle (all 2018), Rolling Stone (2019), Esquire (2020), Parade, Complex, Time Out New York, and Empire (all 2021). In December 2021, the film's screenplay was listed number 29 on the Writers Guild of America's \"101 Greatest Screenplays of the 21st Century (So Far)\".\r\nAccolades\r\nAt the 88th Academy Awards, Inside Out received a nomination for Best Original Screenplay and won Best Animated Feature. The film's other nominations include fourteen Annie Awards (winning ten), two British Academy Film Awards (winning one), three Critics' Choice Movie Awards (winning one), and a Golden Globe Award (which it won). It was named one of the ten best films of 2015 by the National Board of Review (where it also won Best Animated Film) and the American Film Institute.\r\nLegacy\r\nInside Out sparked various Internet meme reactions, including Joy and Disgust similarizing the Philippine supercouple named AlDub; and the real-world core memories montaging personal moments, which began spreading on TikTok. During the COVID-19 pandemic, it was one of the 35 films recommended people watch by The Independent.\r\nThree lawsuits followed Inside Out's release. Pediatrician Denise Daniels sued Disney and Pixar in 2017 for including the film's personified emotions to the television series The Moodsters. Two similar suits were followed in 2018: author Carla J. Masterson sued Disney for infringing her books What’s on the Other Side of the Rainbow? and The Secret of the Golden Mirror, and another was brought by the United States District Court for the Northern District of California, who said that both films (owned by Canadian student Damon Pourshian, and Disney and Pixar) titled Inside Out were equivalent. Pourshian's suit was later green-lit by an Ontario court in 2021. The outcomes of these lawsuits were unknown, while Daniels's one was rejected, resulting the ineligibility of being copyrighted.\r\nOther media\r\nDisney Infinity 3.0 (2015) includes a platformer-type Inside Out playset featuring the emotions as playable characters. A mobile Puzzle Bobble-style game, Inside Out: Thought Bubbles, was released in 2015 for some app stores. Lasting for three levels, Google started a Made with Code event for the film that December, named \"Inside HQ\", with fans wishing to start a programming on the tutorial to recreate scenes using Blocky, a mini-game whose snippets used to resolve issues.\r\nInside Out Emotional Whirlwind, a spinner ride, ran since 2019 at Disney California Adventure. Emotions at Play with Pixar's Inside Out is an exhibit at the Children's Museum of Pittsburgh, that has been in operation since 2021. It features activities based on set pieces from the film. A sweet shop Inside Out: Joyful Sweets opened on Disney Wish in July 2022.\r\nSequel\r\nA sequel, titled Inside Out 2, has been announced to be in development for a June 14, 2024 release. The film will follow Riley as a teenager, with a \"new set of personified emotions\". Amy Poehler will be reprising the role of Joy, while Mindy Kaling and Bill Hader will not be returning as Disgust and Fear, following reports of a contract dispute.",
    "html": "<p>Inside Out is a 2015 American computer-animated film directed by Pete Docter from a screenplay he co-wrote with Meg LeFauve and Josh Cooley. Produced by Pixar Animation Studios, it stars the voices of Amy Poehler, Phyllis Smith, Richard Kind, Bill Hader, Lewis Black, Mindy Kaling, Kaitlyn Dias, Diane Lane, and Kyle MacLachlan. The film follows the inner workings inside the mind of a young girl named Riley, who adapts to her family's relocation, as five personified emotions administer her thoughts and actions.</p><p>Docter conceived Inside Out in late 2009 after noticing changes in his daughter's personality as she grew older, and it was subsequently green-lit. Based on the remembrances of Docter and the film's co-writer and co-director Ronnie del Carmen, they adopted an idea involving emotions for the film. During production, the filmmakers consulted psychologists and neuroscientists in order to achieve greater accuracy in their portrayal of the mind. Development on Inside Out lasted for five and a half years, on an approximate $175 million budget, and the film faced production difficulties, including story changes.</p><p>Inside Out debuted out of competition at the 68th Cannes Film Festival on May 18, 2015, and was released in the United States on June 19. The film received positive reviews for its craftsmanship, screenplay, subject matter, plot, and vocal performances (particularly those of Poehler, Smith, Kind, and Black). Organizations like the National Board of Review and the American Film Institute named it as one of the top ten films of 2015. Inside Out earned $858.8 million worldwide, finishing its theatrical run as the seventh-highest-grossing film of 2015. The film was nominated for two awards at the 88th Academy Awards, winning Best Animated Feature, and received numerous other accolades. A sequel, Inside Out 2, is in production and set for release on June 14, 2024.</p><br/><h3>Plot</h3><p>Within the mind of a young girl named Riley are the basic emotions that control her actions: Joy, Sadness, Fear, Disgust, and Anger. Her experiences become memories, stored as colored orbs, which are sent into long-term memory each night. The aspects of five most important \"core memories\" within her personality incorporate the form of five floating islands. Joy acts as the leader, and she and the rest of the emotions try to limit Sadness's influence.</p><p>At the age of 11, Riley moves from Minnesota to San Francisco for her father's new job. She at first has poor experiences: the new house is cramped and old, her father hardly has any time for her, a local pizza parlor only serves pizza topped with broccoli, which she detests, and the moving van with their belongings was misdirected to Texas. On Riley's first day at her new school, Sadness retroactively turns joyous memories sad, which causes Riley to cry in front of her class and creates a sad core memory. Joy tries to dispose of it by using a vacuum tube, but accidentally knocks the other core memories loose during a struggle with Sadness, disabling the personality islands. Joy, Sadness, and the core memories are sucked out of Headquarters.</p><p>In Joy and Sadness's absence, Anger, Fear, and Disgust are forced to take control of Riley with disastrous results, distancing Riley from her parents, friends, and hobbies. Her disused personality islands gradually crumble, and fall into the \"Memory Dump\", where things fade to non-existence as they are forgotten. Finally, Anger resolves to run away to Minnesota, believing it will restore Riley's happiness.</p><p>While navigating the vast long-term memory area, Joy and Sadness encounter Bing Bong, Riley's imaginary friend, who suggests riding the \"train of thought\" back to Headquarters. After several adventures and mishaps, the trio eventually catch the train; however, it halts when Riley falls asleep, then derails entirely with the collapse of another island. Afraid that all the core memories will become sad, Joy abandons Sadness and tries to ride a \"recall tube\" back to the Headquarters. The ground below the tube collapses, breaking it and sending Joy and Bing Bong plunging into the Memory Dump.</p><p>After discovering a sad memory that turned happy when Riley's parents and friends comforted her, Joy understands Sadness's purpose of alerting others when Riley is emotionally overwhelmed and needs help. Joy and Bing Bong try to use Bing Bong's chant-fueled wagon rocket to escape the Memory Dump. They fail to fully ascend, due to their combined weight, until Bing Bong jumps out at the last moment and fades away.</p><p>Joy reunites with Sadness and they return to Headquarters, discovering that Anger's idea has disabled the console, rendering Riley apathetic as she boards a bus to Minnesota. To the surprise of the others, Joy hands control of the console to Sadness, who is able to reactivate it and prompt Riley to return to her parents. As Sadness re-installs the core memories, transforming them from happy to sad, Riley tearfully confesses to her parents that she misses her old life. Her parents comfort her and admit they also miss Minnesota. Joy and Sadness work the console together, creating a new core memory consisting of happiness and sadness; a new island forms, representing Riley's acceptance of her new life in San Francisco.</p><p>A year later, Riley, now at the age of 12, has adapted to her new home, made new friends, and returned to her old hobbies while acquiring a few new ones. Inside Headquarters, her emotions admire Riley's new personality islands, and are given a newly expanded console with room for them all to work together.</p><br/><h3>Voice cast</h3><ul><li>Amy Poehler as Joy</li><li>Phyllis Smith as Sadness</li><li>Richard Kind as Bing Bong</li><li>Bill Hader as Fear</li><li>Lewis Black as Anger</li><li>Mindy Kaling as Disgust</li><li>Kaitlyn Dias as Riley</li><li>Diane Lane as Mom</li><li>Kyle MacLachlan as Dad</li><li>Paula Poundstone as Forgetter Paula</li><li>Bobby Moynihan as Forgetter Bobby</li><li>Paula Pell as the dream director and Mom's Anger</li><li>Dave Goelz as Subconscious Guard Frank</li><li>Frank Oz as Subconscious Guard Dave</li><li>Josh Cooley as Jangles</li><li>Flea as Mind Worker Cop Jake</li><li>John Ratzenberger as Fritz</li><li>Carlos Alazraqui as a helicopter pilot</li><li>Peter Sagal as Clown's Joy</li><li>Rashida Jones as Cool Girl's emotions</li></ul><br/><h3>Themes and analysis</h3><p>A central theme of Inside Out is the consequences and portrayal of emotions and memories. Those depicted in the film are \"honest\" and \"generous\"; their goal is maintaining Riley's life. Natasha Moore of the Australian ABC News detailed the film's theme: \" Riley's carefree life gets more complicated, Joy's attempts to deliver uninterrupted happiness become increasingly neurotic.\" Nicole Markotic argued that the film explores the relationship between \"the many and the one\", demonstrating that people have \"composite\" personalities. The different components of one person's personality are vital for that person's \"emotional and psychological balance\". Depression and sadness are distinct in the film, and this distinction is meant to \" individuals strategies to avoid suppressing crucial feelings\". Writing in the British Journal of Psychiatry, Hannah Marcarian and Paul O. Wilkinson agree that this validation of different emotions helps people express themselves.</p><p>Ruth Bettelheim of USA Today wrote that human responses to physical and social environments evolved over millions of years, and have not yet been fully understood, as shown by the film not including Riley's bodily sensation and their possible effect on mental states. Primatologist Louise Barrett thought the film showed disconnection between characters who are not relating to each other, or to their own emotions; but moments of personal harmony lead to positive interpersonal connections. According to USA Today's Jamie Altman, the film shows that major environmental changes can be \"difficult, but not impossible, to overcome\", recommending it to college students experiencing homesickness or sadness.</p><br/><h3>Production</h3><h4>Development</h4><p>The development of Inside Out began in late 2009, when director Pete Docter felt anxiety about his adolescent daughter Elie's progressing introversion. Docter approached Ronnie del Carmen to become a co-director, and he eventually accepted the offer, citing his \"accidental\" animation work. They relived their past experiences and histories to adopt an idea involving emotions for the film, aiming to depict them with strong, caricatured personalities. Docter had decided to make it after del Carmen determined most of the film's aspects had narrow appeal.</p><p>The directors and producer Jonas Rivera researched the mind with the help of psychologist Paul Ekman and the University of California, Berkeley professor of psychology Dacher Keltner. Pixar animator Dan Holland and his team allowed some psychologists and specialists to accurately develop the film's story. Production designer Ralph Eggleston authorized neuroscientists to design the locations in Riley's mind using DNA-based cues and photographs of neuronal flashes. In Keltner and Ekman's opinion, they emphasized the emotions' formation of social lives and interactions, which can moderate themselves.</p><p>While Keltner focused on Sadness that strengthens relationships, Ekman identified seven emotions with \"universal signals\" early: anger, fear, sadness, disgust, joy, contempt, and surprise. Therefore, Docter removed surprise from Inside Out after he corroborated that it and fear were similar; contempt was abandoned also by the filmmakers. Two of Joy's initial names, happiness and an unrelated optimism, were combined with Joy. A total of 27 emotions, including irritation, envy, greed, gloom, despair, depression, love, schadenfreude, ennui, shame, embarrassment, and hope, were considered for the film before reducing to their possible value. Its finalized, streamlined scope featured a condensed story and the emotions' traits.</p><p>Inside Out was green-lit in October 2009, after Docter was interested in forming the main character's story arc. Chief creative officer John Lasseter offered little input on the film due to his focus on restructuring Walt Disney Animation Studios, and it was the first for Pixar without involvement of co-founder and former Apple CEO Steve Jobs, who died in 2011. Executives at Disney and Pixar were positive at Docter's proposal, but acknowledged it was difficult to advertise. The film spent five and a half years in development, with an approximate $175 million budget. Docter and Eggleston described this an intricate and lengthy process. As such, first-time directors were likely ineligible to work on the film.</p><h4>Writing</h4><p>In 2010, Docter and the filmmaking team met to discuss aspects about Inside Out, including its setting, rules, and reels. Docter then recruited a small story team to develop the film's plotline and design its characters within 12 months; their main challenge was to deal with its multilayered technique. Though the film's script was deemed ambitious and ingenious, screenwriter Michael Arndt spent a year on it before leaving the project in early 2011; he was attributed with additional story material.</p><p>To promote diverse input, half of the story team were women, at a time when the animation industry consisted largely of men. Although Inside Out's focus was about a girl, research found that females age 11 to 17 were more attuned to expressions and emotions than younger girls. Docter decided that Riley was not a main character, but her role as a setting. He considered the lead emotion as female, since Riley had the same gender. Other emotions were assigned between male and female. Del Carmen influenced the film's story development based around his upbringing, and preferred the idea of hockey's popularity in Minnesota, becoming a core concept. Docter also discarded an initial idea about Riley falling into a deep depression. Creation of storyboards for Inside Out took two to three years, and included seven to eight screenings for Pixar's \"brain trust\" (a small group of creative leaders who oversee its development on all films).</p><p>The filmmakers were responsible for expressing the characters' personal traits, talents, and contrasts. Inside Out's design team researched more of her personality's distinct directions, after Docter was concerned over Joy's displeasure. Designer Albert Lozano wanted Joy with tomboyish and \"mischievous\" characteristics. Amy Poehler helped the team to write Joy, illustrating a broad range of happiness after facing difficulties. With LeFauve's help, the team envisioned Joy as vulnerable and intangible because she was \"unapologetically positive\". From the outset, the idea persisted about Joy's potential to excessively manipulate youth, setting off Riley's \"social storms\".</p><p>In one instance, Riley was to have wanted the lead role as a turkey in a Thanksgiving Day pageant. Ultimately, Docter found that plot idea to be too unfamiliar, and sought something to replace it. Several drafts emerged, including: the characters cultivating ideas after falling to \"Idea Fields\"; and Bing Bong recruiting at a large, exiled entourage from Riley's childhood. Richard Kind later defined his character as \"the fading of childhood\" when Inside Out's development had progressed. In October 2011, Diane Disney Miller convinced Docter to reduce Inside Out's distractions and reprioritize the story. Docter determined that the concept of personality islands could integrate the mind world's geography and story.</p><p>In 2012, the film was put into production after several screenings and suggestions, and evaluated after three months. Editor Kevin Nolting said that seven versions of the film were created before the production began. The difficult part was to balance the film's tone, for example, how viewers would respond to Joy's cheerful nature while feeling negative about the mess that Joy manipulated in Riley. Rivera credited Poehler for fleshing out these aspects of Joy's nature. Eggleston recommended that the film be set to take place in the mind rather than in the brain, as such a few scenes about the brain were dropped.</p><p>An early version of Inside Out focused on Joy and Fear getting lost together. In July 2012, Pixar filmmakers held an evaluation screening of the film. Docter came to find that storyline nonfunctional, and was reluctant to be fired. In 2013, Docter was still unsure about what Joy had learned from Fear to develop her characterization, eventually reached a breakthrough to integrate emotions and relationships within the film. Storyboarding was reworked to replace Fear with Sadness and give Sadness a \"much juicier\" role. Docter's altercation between Joy and Sadness lacked the film's emotional ending. To address the issue, he changed a scene where Riley is separating from her friend in its subsequent portions. Islands of Friendship and Personality became Joy and Sadness's outings in the film to maintain its continuity.</p><p>Over the course of storyboarding, 27 sequences and 178,128 outlines were developed, with 127,781 remaining upon completion. According to Cooley, 10 plot rewrites of Inside Out and 10 unabridged scenes of Riley’s mind were made. Initial storyboarding differentiated the importance of Riley's story arc than emotions, but Rivera considered the film's balance was \"about 75 percent inside, 25 percent out\". In early 2013, the filmmakers made seven to eight distinct openings for the film. The brain trust eventually locked the picture and its story. After Cooley and Meg LeFauve contributed the film's rewrite, they were credited as screenwriters. Docter, Cooley, and LeFauve worked on experiences with raising their own children into the screenplay. Cooley highlighted these as emotions and subsequently created them. Production of the film concluded in May 2015, after three years.</p><h4>Casting</h4><p>Voice recording began in 2013 and ended in 2014. Casting focused on actors that have personas identical to the emotions they voiced. As Inside Out contained several veterans of Saturday Night Live (SNL), the film's team spent a week at that program for research on a live television sequence. Poehler and Phyllis Smith had three voice recording sessions. Once Smith got a call for traveling to Pixar's headquarters in Emeryville, California, Rivera chose her after watching a lunch scene in Bad Teacher (2011). He contacted Docter and remarked, \"I think we found our Sadness.\" Poehler was hired as the last of the emotions' cast.</p><p>Fear was inspired by Don Knotts. According to Lozano, Knotts had wide eyes. Docter said, \" was the kind of guy who could bring sophistication and then flip on a dime\". Bill Hader was cast as Fear after he and the filmmakers visited the set of SNL in New York City for a week, and also assisted at the story room. His casting was assumed until his stay ended, but he asked to contact fellow SNL veteran Poehler that it was secret. Hader later reaffirmed his involvement in Inside Out. In all recording sessions, he instructed his screaming voice for his role of Fear.</p><p>When the story was pitched by Mindy Kaling, she said that it sounded \"really beautiful\" and joined the cast. Disgust was described as akin to the looks of April Ludgate and Veruca Salt. Docter exemplified Lewis Black for Anger, and he was cast after the filmmakers kept him in mind as expected, having realized Black's voice. Kind was cast to voice Bing Bong, who tried to convey the same \"sort of innocence\" of his previous Pixar roles, and wound up not taking part in pre-release promotion as the producers decided to keep the character a secret.</p><h4>Animation</h4><p>Animation of Inside Out took a year and a half. About 48 animators (including supervisors Shawn Krause and Victor Navone, and director Jamie Roe), and 350 artists (35 of them lighting–led by cinematographer Kim White–and 10 layout) and technicians were involved in the production of the film. Two other animation teams were also produced: one was separate for abstract sequence and another was crowded for the character process. The team utilized unique technology to locate every part of the human body.</p><p>Docter imagined that with emotions for characters, they could \"push the level of caricature\" to both design and \"style of movement\" to degrees. To this end, they emulated the styles of animators Tex Avery and Chuck Jones. Docter informed Krause and Navone to push the graphic caricature of each character rather than sticking to the rigid behavior of each RenderMan model. This required an artist to draw over characters in Inside Out during dailies, using a Wacom Cintiq. The team spent over three years on enhancing the dinnertime scene, the first one to do so. Sketches resembled the emotions were superior by the filmmakers, despite the rules broke within such boundaries. After the characters were brought to finalized forms, they were proposed for 3D models using desktop computers. The filmmakers studied dailies and understand animation until Docter gave the film's finalized shots for their approval on lighting and rendering.</p><p>Through the simulation department, the motion of the characters' hair and their garments were added. Eggleston's production design arrived, moving forward for added placements that included their original inspiration for lighting Joy. Pixar co-founder Edwin Catmull believed the characters' attributes have a lesser extent of humanoid forms, brighter colors, and strange shapes due to their possession of force fields. Rendering took 33 hours. All aspects of Inside Out were eventually merged to a single image, having an animation spread across 1,600 shots. The film took three weeks of animation to create three seconds of footage.</p><p>Eggleston's diagram was made of pastels shaped Joy, having her increased illumination and making her Pixar's crucial character. Instead of being solid, Joy's effervescence was derived from pinwheels, Champagne, and sparklers. Lozano thought that Joy would look like Audrey Hepburn. For Joy to become brightened, the RenderMan team turned real light from a geometry, and Docter suggested to design her with \"sprite-like and golden\" modifications. The filmmakers worked for eight months on Joy's aura, but encountered difficulties related to time and budget. Lasseter requested that it be applied for each emotion instead. Eggleston described this technique, \"You could hear the core technical staff just hitting the ground, the budget falling through the roof\". Docter and his six-designer team spent approximately 18 months finalizing Joy's look. Overall, the process on making Joy ran for three years.</p><h4>Design and cinematography</h4><p>Eggleston was tasked with outlining Inside Out's worlds. Its design faithfully reflected Pixar films Up (2009), Toy Story 3 (2010), and the intended 1950s Broadway musicals, which Navone tightened its aspects and was emphasized by freeform techniques. The mind world's layout and cinematography took inspiration from Casablanca (1942). Around 300 different designs of Headquarters were developed. Pixar researched films within the Hollywood's golden age for set constructions. They performed master moving shots in combining them into a single scene, the longest of which were 48 seconds or 1,200 frames. In envisaging how the mind's interior would be depicted, the filmmakers concentrated on the word \"electrochemical\" and was considered for various options using electricity.</p><p>Director of photography Patrick Lin placed Inside Out's camera language into the mind and real worlds for determining and differentiating them; they were respectively described as superior and inferior. The real world had problems created through lens distortion and out-of-focus shots. Even so, directorial changes countered the camera's complex usage. Two types of camera lenses (Arri/Zeiss Ultra Prime and Cooke S4), with distinct camera movements and predetermined paths, were used for both worlds. An inherent mechanical procedure using a dolly, track, crane, and boom was used in the mind one; and biological cameras like zoom, Steadicam, and hand-held in the real one. Lin's crew supervised Riley's story arc as these cameras were applied in the film across three acts: first was Steadicam, followed by two were hand-held.</p><p>The use of scale progressions, which measured the worldbuilding size of the main characters, were made for handling the development of them and Riley and Joy's arcs. Staging was used for Inside Out's story, while framing for its theme. One of the film's parts was described as earliest and reserved, and had closeups for adults indicated for growing up, especially for Joy and Riley. The cameras were created by their crew have attached sensors and were \"rough\" and \"physical\"; these were improved in Inside Out after using them in Pixar's short film The Blue Umbrella (2013). For projecting Inside Out's environment, they used humans to surround it for the development and assembly of the film's scenes. Layout supported Inside Out's virtual scenes, making them blocked and animated.</p><h4>Music</h4><p>Michael Giacchino served as composer for Inside Out. He began planning in January 2015, before concluding that May. While in the music session, Docter felt its score \"bittersweet\" and \"nostalgic\" after he \"grew up playing the violin and bass\". Giacchino wanted to create something more emotionally monumental for Inside Out's score, when compared to his score from Up. The producers first met with Giacchino to discuss the film's concept and screen it for him. In response, he composed an eight-minute suite of music, unconnected to the film, based on his emotions viewing it. Rivera remarked that as both Giacchino and Docter were musicians, and they discussed the film in terms of story and character. In accordance with its creative preference, a progressive soundscape was made by sound designer Ren Klyce, who was joined by Rivera. Docter took a four-year discussion where his piano sessions considered forgetfulness, and a chewing gum advertising jingle was disturbing.</p><br/><h3>Marketing and release</h3><p>Disney spearheaded the marketing campaign. Their strategy entailed aggressive social media engagement, a worldwide publicity tour, and the creation of five colorful character posters. Leading up to its release, Inside Out was test screened for children, since executives were concerned about the film's appeal to younger viewers.</p><p>The 95-minute Inside Out debuted out of competition at the 68th Cannes Film Festival on May 18, 2015, followed by a premiere on June 16, at the El Capitan Theatre in Los Angeles. Inside Out was originally scheduled for general release on May 30, 2014, but it was pushed back to June 19, 2015. The film was also released in 3D, as well as Dolby Vision, one of the earliest films to adopt the format. In theaters, Inside Out was accompanied by a short film, Lava (2014).</p><p>Walt Disney Studios Home Entertainment released Inside Out for digital download on October 13, 2015, and on Blu-ray and DVD on November 3. Physical copies contain behind-the-scenes featurettes, audio commentary, deleted scenes, and two shorts: Lava and Riley's First Date? (2015). The film earned a revenue of $95.5 million with 5.3 million copies sold, making it the second best-selling title of 2015 behind Jurassic World. In 2019, Inside Out was released on 4K Ultra HD Blu-ray.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Inside Out earned $356.9 million in the United States and Canada and $501.9 million in other territories, for a worldwide total of $858.8 million. It was the seventh-highest-grossing film of 2015. Deadline Hollywood calculated the film's net profit as $279.51 million, accounting for production budgets, marketing, talent participations, and other costs; box office grosses and home media revenues placed it sixth on their list of 2015's \"Most Valuable Blockbusters\".</p><p>In the United States and Canada, Inside Out was released with Dope on June 19, 2015. It earned $34.3 million on its first day, including $3.7 million from Thursday night previews. The film debuted in second place behind Jurassic World, earning $90.4 million from 3,946 theaters (3,100 in 3D); it was the first for Pixar not to do so at first. For any film that broke a such record during the opening weekend, Inside Out surpassed The Day After Tomorrow's (2004) $68.7 million. Inside Out's successful opening was attributed to its Cannes premiere, CinemaCon and Fathom Events screenings, its critical reception, good word-of-mouth, and Father's Day weekend. The film attracted a mostly female audience, with about 63 percent; 71 percent for families; and 59, 46, and 38 percent being under 25, 18, and 12 years of age, respectively. Additionally, it had the highest opening weekend for an original film, surpassing Avatar (2009). Its second weekend earnings dropped by 42 percent to $52.1 million, and followed by another $29.8 million the third weekend. By July 19, the film's domestic earnings topped $300 million. Inside Out completed its theatrical run in the United States and Canada on December 10, 2015, as the year's fourth highest-grossing film. In July 2020, due to the COVID-19 pandemic closing most theaters worldwide and limiting what films played, Inside Out returned to 442 theaters (mostly drive-ins) and earned $340,000.</p><p>Worldwide, Inside Out earned $40.3 million in its opening weekend in 37 markets. On its opening weekend elsewhere, the top countries were China ($11.7 million), the United Kingdom ($11.5 million), Mexico ($8.6 million), Russia ($7.6 million), Italy ($7.4 million), Germany ($7.1 million), and South Korea ($5.2 million). In Russia, Inside Out was the first Pixar film to earn more than one billion rubles. By September 20, 2015, the film's offshore gross had exceeded $408.8 million. As of December 2021, its top international markets were the United Kingdom ($59.5 million), Japan ($32.9 million), South Korea ($32.7 million), Germany ($31.6 million), and France ($30.1 million).</p><h4>Critical response</h4><p>Inside Out has an approval rating of 98% based on 379 professional reviews on the review aggregator website Rotten Tomatoes, with an average rating of 8.9/10. Its critical consensus reads, \"Inventive, gorgeously animated, and powerfully moving, Inside Out is another outstanding addition to the Pixar library of modern animated classics.\" Metacritic (which uses a weighted average) assigned Inside Out a score of 94 out of 100 based on 55 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale. Before the release of Inside Out, fans and critics were concerned by a perceived overdependence on sequels on the part of Pixar, which was only exacerbated by the announcement of Toy Story 4 (2019), and their films declining in quality. Likewise, DreamWorks Animation's competition with Pixar was disappointingly lacking, leading to speculation that computer-animated films were \"in a funk\".</p><p>Critics praised Inside Out's craftsmanship that was attributed to Docter's expertise, describing it as a return to form for Pixar. Peter Debruge (Variety), Kenneth Turan (Los Angeles Times), and Todd McCarthy (The Hollywood Reporter) praised the film. Debruge and Turan described it as the best, with his and McCarthy's evaluations were meant \"sophisticated\" and \"audacious\". Turan and Richard Brody (The New Yorker) cited the film's engaging visuals, responsibility to emotions, characterization of solutions, and narrow aspects of Riley's imagination; Debruge and Anthony Lane (The New Yorker) encouraged its originality. Vulture's David Edelstein suggested them that the film made a \"new pop-culture touchstone\". Despite these overall reviews, The Guardian critic Peter Bradshaw and Slant Magazine writer Christopher Gray assessed the film as slightly inferior to Pixar's best.</p><p>The scriptwriting, plot, and subject matter were sources of praise. Forbes's Scott Mendelson thought that its qualities of narration provided a purpose, whereas Leigh Singer of IGN conveyed the film's tropes: child devotion, teamwork, and confused chases. Singer expressed the \"tried-and-tested\" journey had an unprecedented \"licence to go\". In contrast, Rene Rodriguez, writing for the Miami Herald, expressed concern over the film's plot. Rodriguez cited its aspects, including its story skipping from the beginning to the end, and events involving inside Riley's head having thin goals. Ann Hornaday (The Washington Post) and A. O. Scott (The New York Times) appreciated its entertaining subject matter, promoting mental health by The Hindu's Udhav Naig, the body language by ComicBook.com's Chase Magnett, and the human movements by USA Today's Brian Truitt and Reason's Kurt Loder. On the other hand, Naig panned the film's misinterpretation of brain functions. Matt Zoller Seitz of RogerEbert.com emphasized the film's script that has clear connections to its aspects, including Joy's comprehension should \"what things mean, and what the other emotions ought to 'do' for Riley\".</p><p>Reviews for the actors' performances were very positive in the media, with their work described as \"wonderful\" and \"excellent\". Edelstein laboriously commended Poehler's acting, indicating that she had \"supernatural exuberance but the semi-tonal quavers of doubt that keep that from being cloying or cartoonish.\" Joy was viewed as a heartful character and Sadness was a superfluous disapproval to the \"secret side\" by Tim Grierson of Paste, whereas Vox's Alex Abad-Santos felt that because of its appealing voice cast. Magnett credited Grierson's examination that reached these roles to their extent with accommodation, and made Anger the \"most perfect\" one due to his routine having a culmination, having a \"sense of humor and genuine care\". While Seitz took Sadness to have more value of her contribution, others, such as Jessica Kiang (IndieWire) and Tasha Robinson (The Dissolve), cited character development as one of its strengths.</p><p>Inside Out was included on a number of best-of lists. It was listed on many critics' top ten lists in 2015, ranking fourth. The film appeared on professional rankings from BBC, The New York Times, Empire, and The Independent based on retrospective appraisal, as one of the greatest films of the twenty-first century. Inside Out appeared on several lists of the best films of the 2010s in 2019, by outlets including: IndieWire, The A.V. Club, The Independent, RogerEbert.com, /Film, Time Out London, GamesRadar+, and the Los Angeles Times. Several publications have listed it as one of the best animated films, including: Harper's Bazaar (2017), Insider, USA Today, Elle (all 2018), Rolling Stone (2019), Esquire (2020), Parade, Complex, Time Out New York, and Empire (all 2021). In December 2021, the film's screenplay was listed number 29 on the Writers Guild of America's \"101 Greatest Screenplays of the 21st Century (So Far)\".</p><h4>Accolades</h4><p>At the 88th Academy Awards, Inside Out received a nomination for Best Original Screenplay and won Best Animated Feature. The film's other nominations include fourteen Annie Awards (winning ten), two British Academy Film Awards (winning one), three Critics' Choice Movie Awards (winning one), and a Golden Globe Award (which it won). It was named one of the ten best films of 2015 by the National Board of Review (where it also won Best Animated Film) and the American Film Institute.</p><h4>Legacy</h4><p>Inside Out sparked various Internet meme reactions, including Joy and Disgust similarizing the Philippine supercouple named AlDub; and the real-world core memories montaging personal moments, which began spreading on TikTok. During the COVID-19 pandemic, it was one of the 35 films recommended people watch by The Independent.</p><p>Three lawsuits followed Inside Out's release. Pediatrician Denise Daniels sued Disney and Pixar in 2017 for including the film's personified emotions to the television series The Moodsters. Two similar suits were followed in 2018: author Carla J. Masterson sued Disney for infringing her books What’s on the Other Side of the Rainbow? and The Secret of the Golden Mirror, and another was brought by the United States District Court for the Northern District of California, who said that both films (owned by Canadian student Damon Pourshian, and Disney and Pixar) titled Inside Out were equivalent. Pourshian's suit was later green-lit by an Ontario court in 2021. The outcomes of these lawsuits were unknown, while Daniels's one was rejected, resulting the ineligibility of being copyrighted.</p><br/><h3>Other media</h3><p>Disney Infinity 3.0 (2015) includes a platformer-type Inside Out playset featuring the emotions as playable characters. A mobile Puzzle Bobble-style game, Inside Out: Thought Bubbles, was released in 2015 for some app stores. Lasting for three levels, Google started a Made with Code event for the film that December, named \"Inside HQ\", with fans wishing to start a programming on the tutorial to recreate scenes using Blocky, a mini-game whose snippets used to resolve issues.</p><p>Inside Out Emotional Whirlwind, a spinner ride, ran since 2019 at Disney California Adventure. Emotions at Play with Pixar's Inside Out is an exhibit at the Children's Museum of Pittsburgh, that has been in operation since 2021. It features activities based on set pieces from the film. A sweet shop Inside Out: Joyful Sweets opened on Disney Wish in July 2022.</p><br/><h3>Sequel</h3><p>A sequel, titled Inside Out 2, has been announced to be in development for a June 14, 2024 release. The film will follow Riley as a teenager, with a \"new set of personified emotions\". Amy Poehler will be reprising the role of Joy, while Mindy Kaling and Bill Hader will not be returning as Disgust and Fear, following reports of a contract dispute.</p><br/>"
  },
  "errorMessage": ""
}