{
  "imDbId": "tt0074958",
  "title": "Network",
  "fullTitle": "Network (1976)",
  "type": "Movie",
  "year": "1976",
  "items": [
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0148846",
      "warningSpoilers": true,
      "date": "24 August 2001",
      "rate": "",
      "helpful": "171 out of 204 found this helpful.",
      "title": "It Is More Than a Film, It Is Like a Crystal Ball",
      "content": "\"Network\". If there was ever a film that foreshadowed to events of the future it would be \"Network\". Much like \"Midnight Cowboy\" seven years earlier, \"Network\" was hailed because it took risks and it was like nothing that the cinema had ever experienced before. Both films were great when they were initially released, but few great films become so much better with time like \"Midnight Cowboy\" and \"Network\". The fictional fourth network of 1976 is UBS. Ratings are bad and the network desperately needs some new show to give them a boost to challenge NBC, CBS, and ABC. Enter the network's national news anchorman (Peter Finch in his posthumous Oscar-winning role). He, like the network, is going through a crossroads. His wife has just passed away, he is about to be fired, and he is slowly losing his mind. The firing is imminent and he decides that he will announce to the world that he will commit suicide on his last evening news broadcast. Of course a national frenzy starts, but Finch surprises all by showing just how crazy he is. Instead of committing suicide, he goes on the air and becomes a modern-day Moses to some with crazed ravings and outlandish statements that really are just the ramblings of a man slowly spinning out-of-control. Faye Dunaway (Oscar-winning) and Robert Duvall are the key people at the network who find a way to market Finch and boost anemic ratings. Finch is given a variety show which could be best described as \"The Tonight Show\" gone stark-raving mad. He gets on stage and basically says whatever is on his mind and the crowds love it. Co-worker and close personal friend William Holden (Oscar-nominated) knows that Finch is out of control, but cannot do anything and eventually is let go due to his disapproval and interference. Holden though has fallen in love, or lust, with the unfeeling Dunaway. Wife Beatrice Straight (in an Oscar-winning performance in which she has less than 10 minutes of screen-time) learns of what is going on and more trouble ensues for Holden on the home-front. Finch meanwhile continues his ravings as he hears voices in his head telling him what he must do each time he is asked to perform. Soon his act grows stale as the public tires of his antics and the network must always defend speeches that they themselves do not really understand. Finch's \"15 minutes\" of fame eventually come to an end, but not in the conventional way that one may think. \"Network\" is a cinematic masterpiece because it is so strong in the major elements of the industry. The acting is exceptional. There were five performing nominations from this film (Ned Beatty was the fifth) and three wins. The only other film to accomplish that was \"A Streetcar Named Desire\" from 1951. Sidney Lumet was great before this film, but he became even greater afterwards. This is arguably his greatest directing job. The screenplay by Paddy Chayefsky is one of the smartest ever written. It is insightful and has a real depth to it. \"Network\" was looked upon as a sort of \"far-fetched black comedy\" in 1976. However, \"Network\" is a film that is all too realistic 25 years later. In many ways the fictional UBS station is much like the FOX station which came on the air in the late-1980s and stole audiences with wild shows that were quite different from the other three networks. Reality television, perverted talk shows, and other types of variety programming run wild today. \"Network\" did not have much to do with all this occurring, but it is like those who worked on the film had a crystal ball into the future. A great movie that becomes greater as time passes. 5 stars out of 5."
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1026099",
      "warningSpoilers": true,
      "date": "22 February 2005",
      "rate": "10",
      "helpful": "151 out of 177 found this helpful.",
      "title": "The Age of Network",
      "content": "Thirty years after its release to public praise and multiple Oscar wins, Network is one of those films that instead of dating badly or becoming a product of its time has actually grown and become even more relevant today, and if it were re-released in 2006 for its actual thirtieth anniversary not on film but on national television right at the beginning of the fall season (complete with the most lurid reality TV shows and inane TV pleasers), it would only become more justified in its story.The story of the failing network that didn't have a show on the Nielsen Top 20 and resorted to extreme measures to ensure that this changed seems so today: we see how channels that once had failing ratings churned out shock television right smack in the daytime while still applying Standard and Practices to other \"prime-time\" shows that could be taken the \"wrong\" way. Jerry Springer, Maury Povich, Rikki Lake, Oprah, Mark Burnett, MTV -- they're all here under different guises, all competing to have their voices heard on television, all eventually becoming as ratings-hungry and establishment-friendly as the CEOs running the show.Today we don't quite have Howard Beales ranting and raving about the ills of society on national TV (although they do \"tell\" us how we should feel, when we should laugh if we're too stupid to get the joke, who to vote for, the \"truth\" about the tobacco industry). Today media is all the rage and televises even a fart if it deems it interesting and guarantees more viewers. Today shows like \"20/20\" or \"60 Minutes\" bring us 'exclusives' even if it's at the cost of journalistic integrity. And now, with 'reality TV' still the dominating novel trend even in little-seen cable channels, creating stereotypes in leaps and bounds while claiming authenticity of the events depicted, there hasn't yet been a need to create a lunatic who could sermonize everything and make us Mad as Hell. On this aspect alone NETWORK has dated: the 70s were all about counterculture, anti-establishment, revolution, leftists, Patty Hearsts, Lennon and Yoko, \"Nova\", the Mansons, the hippies, the Earth-lovers, the militants. Nowadays, buff bodies parade themselves in shows containing outlandish competitions where eating the most grotesque concoctions are the norm, or enduring a barrage of extreme insults has become entertainment (i. e. \"American Idol\") and the very concept of dignity flies out the window. Of course, after signing an extensive release form in which they free the network of all responsibilities if something goes wrong because we all know networks can't be held liable for any faux pas. In short, nowadays people from all over try to become the next It person and outlast their 15 minutes of fame. Nowadays, everyone has their own reality TV show depicting their 24 hour day activities. I wonder if Diana Christensen isn't alive and well and exerting absolute control over the networks in general, bringing anything and everything that can garner a little bit of shock value (Boy Meets Boy, or any reality TV self-made \"villain/villainess\") and eventual ratings, taking over actual scripted shows with real actors.NETWORK is a powerful movie of which I can't praise enough about even if its screenplay, by Paddy Chayefsky is a little too verbose. No one talks the way he makes his characters talk, using impassioned speeches with big, even archaic, words, and more than once the script makes the characters go completely over the top but even then it makes its point. Of the actors, William Holden's quiet portrayal of a former television exec, Max Schumacher, who has a conscience, but still feels some attraction to danger and risks his own family to experience is who is at the heart of this crazy story who was ahead of its time. Peter Finch's Howard Beale never comes through enough as a real human being: just someone who was pushed too hard and decided to shut down for the remainder of his life. But Holden holds the moral glue of the story, and interestingly enough, is wise to know that his affair, perfectly scripted as he even states, will end on a high note -- he'll return to his sanity and his wife, and Diana Christensen will bask in her own executive madness, since this is all she knows and holds dear. In her last words -- \"Let's kill the son of a bitch.\" -- she informs us this is all she is about without so much as batting an eye. Who comes, who goes, is irrelevant to her, as long as the network can be number one. And that is the inhuman reality of television -- a media directed to entertain humans."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw2103096",
      "warningSpoilers": false,
      "date": "28 July 2009",
      "rate": "9",
      "helpful": "36 out of 40 found this helpful.",
      "title": "\"The World Is A Business, Mr. Beale\"",
      "content": "In 1976 when this film came out, there was no cable television, no internet, no cell phones. All that existed, apart from newspapers and radio, were three or four \"broadcast\" television channels. Since then, technology has exploded with a cornucopia of communication devices. Which renders the story in \"Network\" painfully dated. And yet ...The story's theme is as valid now as it was thirty-three years ago. The theme is that the ratings business has corrupted television, because ad revenue, and therefore profit, is tied to the ratings. Programs and events then, and now, get aired if, and only if, they are likely to result in high ratings. It's all very seamy, very dishonorable, very shabby, and very relevant to today's world of ten thousand channels.Though most of the characters in \"Network\" end up being corrupted by television, Howard Beale (Peter Finch) is one who does not. His vision is pure. And he speaks the truth: \"... television is an ... amusement park ... a circus, a carnival, a traveling troupe of ... story tellers ... jugglers, sideshow freaks ... and football players ... You're never going to get any truth from us (television) ... We lie like hell ... We deal in illusions, none of it is true. But you people ... believe the illusions ... You do whatever the tube tells you ... you even think like the tube\". Worse yet, people elect their leaders based on how they look and sound, and how their words are interpreted by boob tube \"pundits\".\"Network\" is a film wherein thematic import is conveyed almost entirely through dialogue. Some of the dialogue devolves into speechifying, which may come across to viewers as preachy. Still, the film's message was highly prophetic. Except for the film's climax, everything predicted in this film has already happened. And credit should go to script writer Paddy Chayefsky for his futuristic vision.Some parts of the film seem superfluous in retrospect, like the romance between two main characters. But the film has a sense of realism, helped along by the use of technical jargon and a general absence of background music. The film's technical elements, including direction, casting, acting, editing, and cinematography, are fine.As social commentary, \"Network\" is one of the best films ever made, despite a dated, time-bound, story. That \"there are no nations, only currency\" is becoming increasingly obvious, and as Ned Beatty's arrogant character explains in a frighteningly ominous tone: \"The world is a business, Mr. Beale\"."
    },
    {
      "username": "dead47548",
      "userUrl": "https://www.imdb.com/user/ur9521536",
      "reviewLink": "https://www.imdb.com/review/rw1796611",
      "warningSpoilers": false,
      "date": "8 January 2008",
      "rate": "10",
      "helpful": "156 out of 180 found this helpful.",
      "title": "One of the best of all time.",
      "content": "I can't put it more perfectly than Turner Classic Movies' Robert Osborne who said \"What was originally a satire is a stinging mirror of television news today.\" I strain to think of a film that is a more brilliant take on society, and all of the flaws it has. It's obedience and entertainment by those who rebel, no matter how insane they are. The exploitation of those in peril for any kind of economic profit. And the fact that everything Beale preaches is completely true and completely bashes the people who are producing him. I was amazed by how much he sells out while continuing to rant about how terrible the people he works for are, and the fact that they just keep him on the air because they want ratings.It couldn't be more related to today. Turn on the news and you see videos of how horrific the war on terror is and how horrific American society has become, but it stays on the air because people don't want to see the good things in life. They care about the bad and the corrupt. People must have laughed it off back then, but it was such a foreshadow to the near future. The performances are just as brilliant as the social commentary. Each actor becomes so absorbed into their characters that you can't even tell they're acting. It feels like you're watching these people in their daily lives, interacting and becoming more and more corrupt. Finch and Dunaway easily give two of the greatest performances of all time. I could write 20 more pages about it's brilliance, but I'll stop now to keep me from rating. I just have to say that it's so rare to find a film as incredibly flawless as this."
    },
    {
      "username": "cchase",
      "userUrl": "https://www.imdb.com/user/ur0541468",
      "reviewLink": "https://www.imdb.com/review/rw1160445",
      "warningSpoilers": false,
      "date": "28 August 2005",
      "rate": "9",
      "helpful": "133 out of 158 found this helpful.",
      "title": "Prescient...",
      "content": "It is the only word I can come up with to describe this masterfully savage satire, and IMHO, it's the only word that need be used.Once I had seen ALTERED STATES and read the novel, I was hungry to find out more about the late novelist/playwright/screenwriter Paddy Chayefsky, and sought out this movie. It blew me away years ago, but I find it even more stunning now. Not just because of the writing, Sidney Lumet's taut direction or the Oscar-caliber performances by everyone involved, all of which are almost beyond being lauded with superlatives.But what knocks me out is how Chayefsky seemed less to be writing from the power of his imagination, than channeling Our Times Now. As if he was capable of some form of mental time travel; able to look into the Nineties and beyond to see the coming of SURVIVOR, or Maury Povich, Jerry Springer, Bill O'Reilly and Paris Hilton. Even HE probably didn't know how he knew, but he sure as hell felt it and wrote it down for us to marvel over today.Sure, there are political and cultural analogies throughout the picture that are dated. But the core of his vision remains startlingly clear and eerily prophetic. As for Howard Beale, there is not one single \"celebrity\" who mirrors that character today, but maybe he is a composite of several different personalities with whom we have become all too familiar in the world of \"news-fo-tainment.\" Or maybe he simply hasn't materialized yet. Maybe that is just how far ahead of its time NETWORK really was.After all, being \"mad as hell\" nowadays has so many more layers of meaning than it did nearly thirty years ago..."
    },
    {
      "username": "DKosty123",
      "userUrl": "https://www.imdb.com/user/ur4067661",
      "reviewLink": "https://www.imdb.com/review/rw3642234",
      "warningSpoilers": true,
      "date": "19 February 2017",
      "rate": "9",
      "helpful": "26 out of 30 found this helpful.",
      "title": "A Great Film About 20 Years After & Before It Was Needed",
      "content": "This film though not noticed enough now, is one of the great films. Peter Finch put just about everything he has into Howard Biel. In fact he died of a heart attack after the film was released and he was out promoting it. Certain films have impact, and this one still does.In a way, this is a higher budget, bigger star update of the 1950's film \"A Face In The Crowd\" starring Andy Griffith and Patricia Neal. Howard Biel is very much the character Lonsome Rhodes was in that film. The difference is that while the earlier film went totally off the deep end, this one stops at just the right spot. The issue Howard Biel highlights here of Foreign Money and Big Corporations and Big Government taking over the world and screwing the little person- well let's fast forward to when it happened after the movie was made.When Government decided it had to tax Senior Citizens Social Security benefits for starters as this requires some Senior Citizens as high as in their 90's to have to file income taxes. Then they are paying taxes on top of benefits they earned that were already taxed.Then in the 1990's, Howard Biel would have come in handy when NAFTA passed by a corrupt Federal Government, which had started in 1986 to offshore jobs by changing the Federal Tax Code, the working man needed someone to stand up and say \"We're Mad As Hell and we're not going to take this anymore!\" Black people needed it when a huge Federal Program threw thousands of blacks in jail during the 1990's too. Then when the Big Banks talked a willingly corrupt government in the 1990's into deregulating them, removing restrictions FDR put in place to prevent the system from another 1929 meltdown, we needed Biel again.Then in the 2000's, when big drug companies bribed a government into passing a drug law that made them wealthy and then allowed them to put out dangerous new drugs like \"opoids\" without regard with what they do to the public? Of course then 2 political parties who have disregarded any chance of term limits and have made themselves rich by sucking the taxpayers dry like kittens do their mom-ma cat?Could a real Howard Biel have really done anything about that? Unfortunately the answer is no, because the big corporations, big money, mass media and corrupt governments appear to have won since this movie was made. Even though there are 2 great films warning us this could happen, we are at a point today where a whole lot of little people are no longer counted in a system that is rigged.Yes, we should be \"Mad as Hell\" about it, but the out of touch media and those kittens living in a glass bubble still have not woken up as reality is being more hidden today than it was in 1976.With William Holden, Faye Dunaway, and a huge cast, Sidney Lumet brings off a classic here that even has cameos from John Chancellor and Walter Cronkite. This movie portrays things as they are. Heed the warning, and educate yourselves as to what has happened since 1976. Even today's protesters need to watch this to really understand what they are doing, and why."
    },
    {
      "username": "Coxer99",
      "userUrl": "https://www.imdb.com/user/ur0257957",
      "reviewLink": "https://www.imdb.com/review/rw0148806",
      "warningSpoilers": false,
      "date": "2 May 1999",
      "rate": "10",
      "helpful": "79 out of 99 found this helpful.",
      "title": "Network",
      "content": "Engrossing satire from Paddy Chayefsky and Sidney Lumet about sensationalism and the almighty dollar in television. All the performances astound, especially Beatty as the tycoon who tells Peter Finch his ideal America and his ideal philosophy on where America is heading. The film is a fine mix of black comedy and drama, brought to life by Chayefsky's incredible script and Lumet's superb direction. Dunaway won a much deserved Oscar for her performance. It's a performance that makes your jaw drop to the floor from start to finish. She makes being a bitch look so darn good."
    },
    {
      "username": "Putzberger",
      "userUrl": "https://www.imdb.com/user/ur8587271",
      "reviewLink": "https://www.imdb.com/review/rw1249596",
      "warningSpoilers": false,
      "date": "28 December 2005",
      "rate": "10",
      "helpful": "264 out of 310 found this helpful.",
      "title": "We Have Seen the Future, And It Sucks",
      "content": "This movie came out when I was nine years old, and I saw it on network TV the following year, lured by the brouhaha that surrounded the use of the \"barnyard epithet\" during prime time. I loved this movie before I understood it, and I worship it now. Like \"Elmer Gantry\" or \"1984,\" it's a work of didactic art that only fails on an imaginative level -- Sinclair Lewis couldn't grasp how debased evangelism would become, Orwell couldn't foresee the excesses of Mao or Pol Pot, and Chayevsky couldn't envision the absolute decline of television from a vast wasteland to a malevolent sewer. Fox News, reality TV, even the OJ chase, \"Network\" anticipates every vile bit of it.Now, it's ridiculously overwritten -- NO ONE is as articulate as the characters in this film, and most certainly, no one who works in television is as literate as Diana Christensen (the Faye Dunaway character). I doubt that poet laureates or even Eminem could spew as witty an aside as \"muttering mutilated Marxism.\" But damn if that isn't part of its charm. Plus, outside of Max Schumacher (William Holden), the characters are pretty much archetypes instead of real people (the Robert Duvall character might as well wear a black cape and top hat), but their two-dimensionality works as a good metaphor for Max's seduction into the \"shrieking nothingness\" or television. Plus the actors are so superb they make screeching caricatures into almost-sympathetic characters: Duvall is a credible and charismatic villain, Finch is a fine mad prophet and Faye Dunaway manages to make a shrill, manipulative, soulless neurotic so damn cute and sexy you'll want to leave your wife for her, too, just as long as she promises to keep sitting cross-legged on your desk and hitching up her skirt. (Therein lies the real eroticism, forget the intentionally mechanical, unerotic coupling later in the flick). Anyway, this is complex, high art masquerading as popular entertainment, go rent it now."
    },
    {
      "username": "bankofmarquis",
      "userUrl": "https://www.imdb.com/user/ur10919398",
      "reviewLink": "https://www.imdb.com/review/rw4057899",
      "warningSpoilers": false,
      "date": "9 February 2018",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Eerily prescient classic",
      "content": "\"I'M MAD AS HELL, AND I'M NOT GOING TO TAKE IT ANYMORE!\"One of the most famous lines in film history is as impactful today as it was when it was first uttered by fictitious news anchor Howard Beale in Paddy Chayefsky's (seemingly) parody of where TV and TV news is heading, 1976's NETWORK.The astonishing thing about this terrific motion picture is how prescient it is. News is now entertainment. Appeal to the disaffected masses. Drive our message to the viewers. Be provocative. The 6:00 news had \"less than 1 minute of hard news, the rest was sex, scandal, brutal crime sports, children with incurable diseases and lost puppies.\"Sound familiar? This isn't from today, it came from this movie that was made 42 years ago as a cautionary tale of what might happen.Besides the social ramifications, how does this film hold up? Quite well, indeed. A rare 10 star BankofMarquis film. Starting with the great Paddy Chayefsky's Oscar winning Screenplay. This was the capper on a brilliant career from Chayefsky - who also won Oscar's for his screenplay for 1972's THE HOSPITAL (I'll have to check that one out) and 1956's MARTY.What does a terrific screenplay do? It attracts top-level talent clamoring to be in this - and they all deliver. Start with Faye Dunaway who won the Lead Actress Oscar for her role as Entertainment Head Diane Christensen - a driven, work hard, play hard individual who has the idea to make news \"entertainment\". Lost in the fog of time (and MOMMIE DEAREST) is the fact that in the mid-1970's, Dunaway was, perhaps, the greatest leading actress of the day and her skills are in sharp display in this film.Joining Dunaway in terrific supporting turns are Robert Duvall, following his turns as Tom Hagen in GODFATHER I and II, as network head, Frank Hackett, Ned Beatty as Ned Jennings, President of the company that owns the network - he has a speech towards the tail end of this film that is as good - both in performance and in the way that it is shot - as anything put upon the screen - it was masterful. Speaking of masterful, Beatrice Straight won the Oscar for Best Supporting Actress in one of the shortest performances to ever win. She is in this film for about 6 minutes in total - but she won her Oscar for a 5 minute scene that is, most definately Oscar-worthy.And then there are the leading men. William Holden gives one of the last great performances of his extraordinary career as the \"voice of reason in this film\". He is our everyman caught up in the bizarre, absurd circumstances that evolve around him. It is his effort to try to make sense of this insanity that jumps off the screen. Holden was, deservedly, nominated for a Best Actor in a Leading Role Oscar, but lost (rightfully so) to Peter Finch's turn as crazed newsman turned prophet, Howard Beale. His maniacal (but not over the top) turn is one for the ages. If you do nothing else, see this film for his performance (but there is so, so much more to love here). Unfortunately, Finch passed away from a heart attack in between his Oscar nomination and win, and was the first posthumous winner in an acting role (sadly, Heath Ledger would join this \"club\" years later).Finally, enough cannot be said about Sidney Lumet's direction. A movie like this would not succeed without a sure, steady and seasoned hand at the helm - and this is how I would describe Lumet's direction. He lets the camera roll and lets the actors and the screenplay take center stage, not drawing attention away, but adding to the themes of the film throughout - especially in Beatty's speech at the end.NETWORK was nominated for (but did not win) the Oscar for Best Film of 1976. Did it lose out to other nominees ALL THE PRESIDENT'S MEN or TAXI DRIVER? Nope, it lost to ROCKY.Let that sink in.If you get a chance to watch (or rewatch) this film, I highly recommend you do so. For me, it was GREAT to watch this on the big screen with an audience, one of the reasons I love - and will continue to attend - the SECRET CINEMA series of films.Letter Grade: A+10 (out of 10) stars and you can take that to the Bank(OfMarquis)"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1380736",
      "warningSpoilers": false,
      "date": "29 May 2006",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Not just the sharp-as-a-tack dialog, but the key performances and the look of the film are enduring",
      "content": "This is one of those works that is emblematic of what can be done with a director who knows his craft and chooses a style that is both controlled and not controlling, a writer who can let out some wild scenes and incredible exposition and make it practically believable (maybe more so today), and a cast that understand their creative forces at work. After seeing the film I was actually struck just as much, for example, by William Holden's performance as I was by Peter Finch, though the latter usually gets most of the credit (and rightfully so, in an Oscar-winning turn beating out De Niro in Taxi Driver if one can believe that). But then one has to take into account their different levels of skill in their performances, and how they both deliver even more than what is required. Holden, for me, is just as good here as he is in his best work (Sunset Blvd, The Wild Bunch), but in the role of the worn-out, dedicated professional who in his own way has had about as enough bs that can be taken as the main character. Yet Holden also knows his performance needs to be more reserved, and as his story gets more complicated he has to make some subtle choices as perhaps the only really sane person in the film. His work here is accomplished in the style of one sense, while Finch, who plays a character going back and forth between being totally nuts and knowing more than anyone else out there in TV land, takes his role with a heedless abandon.In short, this is one of the more fearless looks at the media ever presented on film, and it's even more relevant today perhaps than when it was first released. It's sad that not only did Lumet and Paddy Chayevsky think that what they were doing (aside from the ending) was all true, but that as the decades have passed since Regan's to-do with changing the rules of journalism, it's gotten worse. It was actually kind of shocking to see one or two of the revelations from Finch in some scenes, and the connection made in the 3rd act with Saudi Arabia is one of my favorite parts of the film (particularly the speech by Ned Beatty in one of the all-time great one-scene roles). News, basically, now is like everything else on TV, where you get what you pay for via the advertising, but not as it should really be with the news as it is. Howard Beale, basically, is like one of those ultra-symbollic (but relatable) characters in movies, in a demented way like Stewart in Mr. Smith Goes to Washington, where the truth has to be spoken by someone, but who in America will listen (or, ironically, who won't if it's shelled out right in front of the cameras).In other words, this is one of those films that does ask a viewer to think about what is being shown- an 'informed' public (which is growing less and less as the media becomes smaller and more controlled via government and regulations)- while still providing acting that sticks and lines of dialog that are among the best in 70's films. Faye Dunaway is the female counterpart to her older male stars and is just as good, being like a very cold, typical businesswoman who only makes things feel like she does, as if something was lost in youth. Duvall is also good here, if maybe not at his very best, in a role as a TV exec. But there are bit parts that are really good too, like the black female militant member who complains at a meeting about the grosses of showing footage on TV. And in a small way, like the films of Brooks and Monty Python, Lumet understands how to film things very realistically (though the style appropriately changed from start to finish) so that the satire within can spring out. Even an over-the-top scene like Beale's first Mad-as-Hell speech works on this level.Overall, this is a really amazing film, with enoughs scathing, dark material mixed with the truth that should and isn't presented to those who rely solely on programming. \"Because you're on television, dummy\" are the last words Beatty says to Beale in their scene after Beale asks \"why me?\" By the end, as the film reaches its ultimate climax, one might wonder if his question is relatable to all TV, not just the news. Why is it what you say to people through this abstract medium important, or not? The answers, looking at how the news is run now, should be obvious. Maybe Lumet's best outside of his more 'urban' films (i.e. Serpico, The Pawnbroker, Dog Day Afternoon)."
    },
    {
      "username": "MichaelMargetis",
      "userUrl": "https://www.imdb.com/user/ur5077160",
      "reviewLink": "https://www.imdb.com/review/rw1158233",
      "warningSpoilers": false,
      "date": "25 August 2005",
      "rate": "9",
      "helpful": "109 out of 136 found this helpful.",
      "title": "\"I'm mad as hell and I'm not gonna take it anymore!\" - Howard Beale",
      "content": "#1 Best Film of 1976'Network' is Paddy Chafesky's riveting and grim tale of the sleaze surrounding the American television industry. Winner of the Academy Award for Best Original Screenplay, 'Network' is without a doubt one of the most powerful, influential and meaningful films ever made. One of the reasons 'Network' was so well received by both film critics and movie-going audiences was because it possessed a certain quality that most films unfortunately lack -- intricate and involving characters in realistic situations. 'Network' definitely makes my list of the top 10 films of the 70s, and it's an absolute shame it didn't pick up the well-deserved 'Best Picture' Oscar at the Academy Awards ceremony in 1976.The film follows a low-rated television network trying to keep it's head above water. The network, UBS, has decided to fire an aging veteran news anchor, Howard Beale (Peter Finch), in an act of desperation to boost ratings. Beale is given a two-week notice, and instead of going out with his tale between his legs, Beale announces on live television he was fired and is going to kill himself. This raises panic and chaos at UBS, until they get the memo that Beale's crazed rant just bumped the ratings significantly. The UBS execs, Diana Christensen (Faye Dunaway) and Frank Hackett (Robert Duvall) decide to give Beale his own show where he complains and screams bout the problems with the world, while Beale's best friend (William Holden) feels it's inappropriate for the network to take advantage of a mentally-ill man. Besides exploiting a mentally unstable man, the company execs also work out a weekly program with a anti-establishment African-American communist, Laureen Hobbs (Marlene Warfield) following political terrorists and their violent outbursts.The film also stars Beatrice Straight as Schumacher's boring wife, Conchetta Ferrell was an assistant working for the network and Ned Beatty who plays the sinister boss of the UBS television network who always gets what he wants.'Network' boasts one of the finest and most intricate screenplays ever written that rightfully earned Paddy Chafesky the Oscar for Best Screenplay. Sidney Lumet's directing is absolutely incendiary and the movie has an incredibly strong cast. Faye Dunaway gives what is perhaps her very best screen performance as the cutthroat Network executive, while Robert Duvall is just as brilliant as the ruthless Frank Hackett (which should have earned him an Oscar nomination, period!) Beatrice Straight is solid in her role (not quite Oscar-worthy if you ask me, though) and Marlene Warfield is just as great as the sassy pinko sistah (excuse me for that phrasing). The two performers who really steal the show however are William Holden and Peter Finch. Both nominated for Best Actor in a Leading Role at the Academy Awards in 1977, Peter Finch gives a startling and powerful performance as the 'mad-as-hell' (not to mention crazy-as-hell) Howard Beale, while William Holden gives a subtle but none-the-less outstanding performance as the conflicted Max Schumacher. It's hard to say who was better, but if I absolutely had to decide I'd choose Holden's non-Oscar-winning performance slightly over Finch's sympathy Oscar-winning performance (he still was extraordinary,m though). I honestly believe if Finch hadn't died just after the film, Holden would have taken home the Oscar gold for Best Leading Actor, both were still magnificent though. The only player in the cast that I felt wasn't that great was Ned Beatty. In a role far-deserving from an Oscar nomination (which he for some odd reason received), Beatty plays the angry little man role he always does. Besides Beatty's performance and marginal pacing problems towards the middle (you are gonna get that in any 70s film that isn't a Kubrick film), the movie is utterly perfect.I can't recommend you seeing 'Network' highly enough. If you want a carefully made motion picture that makes you think and reflect on how cutthroat our society has become (especially TV broadcasting), 'Network' is a absolute must. What are you waiting for, go out and rent 'Network'! It might just alter your perspective on things. Grade: A-MADE MY TOP 300 LIST AT #46"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1334618",
      "warningSpoilers": false,
      "date": "6 April 2006",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "It's What Television Has Become",
      "content": "Imagine a world where the news is controlled by conglomerates, where bad taste is the norm, where we no longer want journalists but entertainers, where we will exploit anyone for ratings. Oh, wait, that's what happened. This movie was an omen. Watch it today and you will see that what seemed shocking and incredible, is much like many of our news networks today. We have right and left slinging mud. We have reality shows that make the news, full of disgusting interactions among people. The Jerry Springer influence is all over the place. We even have shows to create our next entertainers. Don't be surprised if in the near future we televise executions. \"Network\" saw the handwriting on the wall and simply put it out there. Like Capra's \"Meet John Doe,\" this is the blood lust of the populace laid bare. It's a reflection of a nation that is so full of itself that it has become bored with the mundane and the pleasurable. This movie capitalizes on those feelings. Now we find out that huge corporations are buying up newspapers and television stations and have the blessing of the power structure in Washington. Can you say \"1984.\" I used to think that this was conspiracy theory. Let's hope that what Faye Dunnaway is planning in this film doesn't come totally true because when news is manipulated, we lose our last bit of control of the decision makers."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6055275",
      "warningSpoilers": false,
      "date": "2 September 2020",
      "rate": "8",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Piston Rods, One & All...",
      "content": "Give 'em what they want, and they'll want even more. More relevant today than ever, the media heroin entices and addicts: parasites on your dependency: the pushers own your soul, your mind is not your own - stick your head out of the window and yell......."
    },
    {
      "username": "Andrea-Orsini-1",
      "userUrl": "https://www.imdb.com/user/ur7440304",
      "reviewLink": "https://www.imdb.com/review/rw1803766",
      "warningSpoilers": false,
      "date": "20 January 2008",
      "rate": "10",
      "helpful": "212 out of 228 found this helpful.",
      "title": "A Prophet known as Paddy Chayefsky",
      "content": "To think that this blackest of black comedies was made in 1976 could only means two things: 1) Nothing has changed or 2) Paddy Chayefsky was seeing the future with the most disturbing clarity. I endorse the later of the two because I believe things have changed since 1974 - I wasn't born yet, but I know because of my parents, the movies, literature, etc, etc, etc. Peter Finch as the mad prophet of the airwaves gives Chayefsky a riveting and powerful voice. The scenes between old chums Finch and William Holden are some of the best written scenes in any American movie until the Coen brothers emerged. Finch is superb, superb! and Holden, at the end of a legendary career, gives a performance of such ferocious sincerity that I rediscovered the man, the actor and felt the need to revisit some of his opus. From Golden Boy to Sunset Boulevard, Holden was a man who carried his own discomfort as a weapon. Extraordinary! However, the most alarming character in the whole thing is Faye Dunaway's. She is magnificent in her thin, nervous, bra-less attitude. She is a monster of commercial amorality. Everything in this incredible movie moves with the precision of an inspired clairvoyant's vision. Duvall's executive, Beatrice Straight's betrayed wife and Ned Beatty's god like big shot makes this one of the most frightening, entertaining, funniest, remarkable film from the 70's. Sidney Lumet proves once more that he's as good as his material. Here he is at his zenith."
    },
    {
      "username": "corazontvc",
      "userUrl": "https://www.imdb.com/user/ur61348829",
      "reviewLink": "https://www.imdb.com/review/rw3865843",
      "warningSpoilers": true,
      "date": "23 November 2017",
      "rate": "9",
      "helpful": "36 out of 38 found this helpful.",
      "title": "Only surprise is, it wasn't cynical enough",
      "content": "I recently rewatched this movie I've seen at least a dozen times and capture something new every time. It's a complete no holds barred hollowing out of the television industry, and, while television isn't the all looming force it once was (500 channels as opposed to around 7 including PBS and VHF and UHF at the time of this movie, depending on location), it still has much to say about the dissociation from reality that viewing things on a screen can create, especially when what you're witnessing is designed for the most craven response.Plot is quite simple: long time news anchor (Howard Beale) has breakdown after being fired and loses it on air, bigwigs (Diana Christensen) notice said breakdown brought in more ratings than ever before and nurture this tendency until a monster is created that is against their best interests ($$) and now must destroy this monster. All in the way this is portrayed is what makes it so much more.This is a deeply cynical movie, and quite prescient. A few years after this movie, the TV world was going to experience crudity on levels it had never imagined before. Morton Downey Jr. to Geraldo would usher in an age of the normalization of TV as spectacle, prurience and depravity we are very much still engaged in today. The kernel of the idea of capturing eyeballs with such content has simply been even more economically fine-tuned by other mediums, especially the Internet. Want to see beheadings, torture porn or video of people being shot to death? Sure you do. Diana predicted it. The natural progression of major character Diana's ideas are present for all to see. Only, it may not have been cynical enough in some ways. Could they have predicted reality TV? Or the endless line of meaninglessly competitive shows like Cupcake Wars? Jackass? At the beginning, it even toys with the idea of 'The Death Hour', filled with suicides and assassinations and car wrecks. We haven't seen anyone purposely killed on live TV to get ratings by a network, to my knowledge, but I doubt that is far away based on current trajectory.Not to mention the brilliant critique of business by Arthur Jensen's (Ned Beatty) epic speech to Howard Beale. We are all just a subsidiary to business interests, AS IT SHOULD BE. The richest 1% own half the world's wealth. This was not an accident or survival of the fittest in a meritocracy, this was planned from the inception.While the dialogue is brilliant, this dialogue is meant to convey ideas, not especially to capture how people really talk in various situations. It is more theatric than realistic. That brings us to probably the weakest part of the movie, the romantic aspect. It plays a parallel plot to the main one, and while it does serve to show that Diana is a 'Humanoid' in Beale's terms-seemingly human, but not really-it's also the weakest element. Hence, the lack of one star.A point must be made about Faye Dunaway. This is her greatest movie. Bonnie and Clyde may have opened the door, but this broke it down. She encapsulates the inherent cynicism and calculating nature of Diana Chirstensen (play on offspring of Christ?) with near perfection. Her sheer physical presence is something to behold as well. From her impossibly high cheekbones to her lithe figure wrapped in chic 70's elegance, she steals every scene she's in. Just do yourself a favor and don't look up her more recent pics, plastic surgery is not her friend.Will young people like this movie? Not if they want a fist bumping silly night, but if they sense they are being manipulated and want to know why, this is one place that was at ground zero."
    },
    {
      "username": "rupie",
      "userUrl": "https://www.imdb.com/user/ur0307374",
      "reviewLink": "https://www.imdb.com/review/rw0148816",
      "warningSpoilers": false,
      "date": "7 January 2000",
      "rate": "9",
      "helpful": "68 out of 89 found this helpful.",
      "title": "perhaps the blackest black comedy ever",
      "content": "When this movie came out in '76 I didn't bother seeing it because I rejected the premise as implausible; the very idea that a network anchor would go nuts on the air and become a hook for ratings seemed ridiculous on its face.Would that it were so.Today we have Jerry Springer, Maury Povich, Howard Stern, etc. Etc. Etc. At the beginning of the movie a drunken Max Schumacher (William Holden) fantasizes about a show called \"the Death Hour\" comprised of films of car crashes, suicides, train wrecks, and so forth, to be put on Sunday night in prime time. \"It'll blow Disney outta the f------g water!\" he laughs. A few years back some network put exactly such a show - \"Eye Witness Videos\" - on the air. On Sunday night. In prime time. In short, as most everyone here has commented, \"Network\"'s horrifying vision - brilliantly written by the incredibly prescient Paddy Chayevsky - has been truly and frighteningly prophetic, and rings absolutely true today. The movie is totally over the top yet penetratingly incisive.The movie is a veritable feast of tour-de-force acting from all involved. In particular William Holden's wrenching performance as the burned-out but still sensitive Max is drop-jaw stunning. I feel he, not Finch, should have gotten the Oscar, though Finch's work is not exactly chopped liver either. And what a brilliant device on Chayevsky's part to make the lunatic Howard Beale the only one of the bunch with clarity of vision.That the film is intended to be a satire and a comedy is clear from the narration, especially the final comment about Beale becoming the first man to be killed because of lousy ratings. But it is without doubt the blackest black comedy ever filmed.A lasting legend of the filmmaking art."
    },
    {
      "username": "kirkintha26",
      "userUrl": "https://www.imdb.com/user/ur10188256",
      "reviewLink": "https://www.imdb.com/review/rw1724702",
      "warningSpoilers": false,
      "date": "4 September 2007",
      "rate": "10",
      "helpful": "44 out of 46 found this helpful.",
      "title": "A rare honest movie",
      "content": "\"Network\" is a fantastic movie that illustrates just how the \"mob\" and the media can exploit even the best intentions for mutual profit.Howard Beale (Peter Finch) is an on-air personality that, after finding he is not bankable anymore, snaps and starts to speak his own uncensored, and highly inflammable commentary about the hypocrisy of modern life.In his mad-hatter routine, somehow he sparks his audience's interest, and in a twist of fame finds himself, the not bankable as prime market share for prime time television. And naturally, his bosses and those who stand to profit from his actions, use his fame to better their own cause.Beale's rise to stardom is only one facet of this intricate story about how the mob influences media. Throughout \"Network\" we as the audience are constantly shown, to nausea, how ruthless popularity and trend mold what we see as consumers of entertainment. Most of the main characters are in fact trapped in their roles - and powerless to the bottom line, which is that media relies on advertisement and ratings to generate revenue.In fact, I believe that is what the point of \"Network\" is - this movie shows us, that \"news\" is entertainment, and how we as viewers (whichever demographic you are) are willing to suspend all common sense, class, independence, honor, integrity for a few moments of triumph or more pragmatically, how we relish tragedy.\"Network\" is too heavy for most people - it is meant for people who do not like TV, who think that product placement is ridiculous, and in general do not like to think of themselves as a \"market\". If you need your reality spoon fed to you, this movie is not for you.However, if you have had enough, and wish to feel for a moment like you are an empowered free thinker, i would humbly suggest that this movie is for you."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2361142",
      "warningSpoilers": false,
      "date": "30 December 2010",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Superb film with one of the finest screenplays ever written",
      "content": "Network is simply brilliant in every aspect. There is nothing actually here that I can fault. It is a compelling, brilliantly written, beautifully acted movie and more.The film does look great. The cinematography is excellent, while the scenery, locations and costumes are top notch. Sidney Lumet, a solid director a vast majority of the time does a exemplary job directing too, in fact Network is probably his best-directed film.Then there is the screenplay. I still stand by my thoughts that Network has one of the best screenplays ever, scathing yet daring and sophisticated and intelligent. And it is flawlessly delivered by William Holden, Peter Finch, Robert Duvall and Faye Dunnaway who in turn give wonderful performances and a stellar support cast.All in all, it is a superb film, and I'd say it is one of the best of the 70s. 10/10 Bethany Cox"
    },
    {
      "username": "malikroberts16",
      "userUrl": "https://www.imdb.com/user/ur7097734",
      "reviewLink": "https://www.imdb.com/review/rw1402109",
      "warningSpoilers": false,
      "date": "25 June 2006",
      "rate": "10",
      "helpful": "117 out of 136 found this helpful.",
      "title": "It's so prophetic it's scary",
      "content": "Now, here is a film that everyone needs to see, especially today.Children should be raised on the truth instead of fiction.Television seduces, entertains, divides, desensitizes, and corrupts not just kids but adults as well. It's gotten so bad over the years it's like some kind of a disease now. Most people believe everything they see, read, and hear. Fortunately for me, I'm not most people. There are things that I question and there are things that I know are very wrong. Lying to the American people in every possible way is very, very wrong.I've never seen anyone open up their window and stick out their head and yell that they're as mad as hell and they're not gonna take this anymore. I've never seen anyone say that they were a human being and that their life had value. We're so screwed up in the head we don't even deserve to be called human beings. We're like pre-programmed, numbered, clones enslaved from the cradle to the grave; clones that are programmed and structured to obey authority of all kinds.\"Network\" deserved the Best Picture Oscar for '76, but it lost to \"Rocky\". How the Academy of Motion Picture Arts and Sciences allowed that to happen is beyond me.That's all I have to say about that."
    },
    {
      "username": "dataconflossmoor",
      "userUrl": "https://www.imdb.com/user/ur1855181",
      "reviewLink": "https://www.imdb.com/review/rw1069703",
      "warningSpoilers": true,
      "date": "28 April 2005",
      "rate": "10",
      "helpful": "108 out of 143 found this helpful.",
      "title": "Guess What?..Everything is a Commodity!!",
      "content": "Groundbreaking is the term for this movie...It is considered one of the hundred best movies ever made and for very good reason...Director Sidney Lummet has a reputation for the director of the non-conventional!!...A cogency for making the absolute truth a guileless villain, a rude awakening for television viewers, and a stubborn scripture for facts is what purports a film like Network as a masterpiece for the prolific and intellectual!! You could not ask for better acting!! The acting in this movie is second to none!! Robert Duvall, William Holden, Faye Dunaway, Peter Finch, Ned Beatty and a whole list of others...Perhaps the best acting in any film made whatsoever!! It starts with Howard Beale (Peter Finch) a victim of his own human pitfalls...Ossified and dejected from his declining years going from bad to worse, he becomes isolated, desultory ,morbid and morose and feels his life has no meaning, he threatens suicide on live television and is discarded as being a wacko!!...At first!!..but guess what!! he's a hit!!...So the ratings crazed cutthroats make him an instant success by labeling him \"The Angry Prophet Denouncing the Hypocracies of Our Time\"...As long as we've gone this far, let's break all of the rules...Bring on the terrorists, the soothsayers, the insurectionaries, the financial gurus, the faith healers, and the para military radicals, to reduce the severity of hard bitten news to a side show of carnival freaks!!! William Holden plays the old school business man with \"primal doubts\" about his life in general...\"male menopause\" with \"defineable features\" He is happily married yet after being bombarded from all sides in the autumn of his years, he is frightened that the new generation is impervious to basic tenets of human morality such as ethics and compassion...The woman with whom he gets involved, is callous not because she is vindictive, but because she is emotionless!! This woman (Faye Dunaway) is the \"Television Incarnate\" Ice Queen who reduces time and space to \"split seconds and instant replays\" the daily business of life is a \"corrupt comedy\" and the only redeeming quality to modern marvels and a \"radiant eruption of Democracy\" is that it gets a 32 share!!...This acting performance is perhaps the best acting performance I have ever seen...The type of person Dianna Christensen was supposed to be was played out perfectly...The delivery of the elaborated monologues and diatribes were absolutely remarkable....She was ideologically explosive yet person-ably obtuse. You knew why she wasn't the drinking type...she was too emotionally detached...In the thick of women's liberation, whereby a woman wanted to be just like a man, this movie portrayed how being just like a man had it's drawbacks!! \"Arousing quickly, consummating prematurely\" and suffering from the cumbersome fate of being crippled by ineptitude at everything else but your work, made Dianna Christensen perennially wistful of testosterone laden aggression!! Aggregately, she invoked societal demise through channels of deductive reasoning!! Director, Sidney Lummet, was insistent that Dianna Christensen be utterly devoid of vulnerability!! Mr Hackett (Robert Duvall) played the hatchet man for the CCA...A rough around the edges errand boy for Mr Jensen (Ned Beatty) who viewed this network as his big chance and that whatever worked worked ..Scruples were never an issue, and ratings were pending exchange!! Howard Beale (Peter Finch) the \"Angry prophet denouncing the hypocrisies of our time\" surprised even himself with his charismatic clout with the naive television audience!!! He was the UBS star-lighted \"Mad Prophet of the airways\"...He could arouse anger and counter-culture overzealousness just by appearing crazy!!! One speech Mr Jensen (Ned Beatty) was a bit role but incredibly powerful in his delivery of the basic concept that ideology is for sale and that television is the ultimate vehicle for manipulation!! Paddy Chayefsky is pioneer with this film as an acrimonious depiction for making world phenomena such as the fall of Communism and landing man on the moon to be minimized to a market share!!!..The terms entertainment and egalitarianism now became pejorative!!!! The movie audience is hit with the terrifying reality that a societal caprice will induce the avaricious to capitulate to human catastrophe...Give Paddy Chayefsky and Sidney Lummet credit for unveiling the revelation that ratings and the dollar take precedence over humanity!!! Howard Beale, the decrepit alcoholic, euphemistically transformed to the prescient paragon of intuitiveness, was alright so long as his innocuous chastisements did not disrupt worldwide pecuniary acquisitions!! Once they did, he was quelled, and thus deemed a total ratings chart disaster!! Ultimately, Howard Beale, the once disheveled dipsomania-cal curmudgeon, turned Messianic Savonarola, becomes the typification of the corporate guinea pig!!!!This movie is avant-garde in it's ability to convey the message of greed first democracy second, or third, depending on the sponsors of the Howard Beale Show... An incident was determined traumatic or not traumatic by it's lucrative marketability potential!! Terrorism is not terrorism if it means ratings!!! The character assassination of all the people in this movie was at the grass roots level!! Their avoidable flaws were entrenched as irreconcilable!! Any people with any conscience whatsoever (William Holden & his wife) were decimated by reveille with selfishness, now it is imperative that they pick up the pieces!! How many imitations of this movie have there been...thousands!! Network however was the first movie of it's kind to effectively portray the concept of \"dying Democracy and dehumanization\" probably the best movie of it's kind as well... This is an illustration of how heinous tragedy has to be stomached by the television audience, their response to clinical trauma transcends the impact suffered by the actual victims involved!! It is a proverbial case of ratings eclipsing reality!! The film \"Network\" resonates itself to a point whereby the American people are reduced to meager by-products of the Fortune 500!! I wish there could be a movie of this caliber made again!! I am angry that there has not been a sensationalistic masterpiece to come around for some time, and I'm as mad as hell and I'm not going to take it anymore!!!"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1600256",
      "warningSpoilers": false,
      "date": "16 February 2007",
      "rate": "9",
      "helpful": "19 out of 27 found this helpful.",
      "title": "Exceptional but certainly NOT a picture you should let your kids see",
      "content": "This is one of the most cynical films of all time, with a very dark and sometimes humorous look at the banality of television and the stupidity of the public. At the same time, since it's so cynical and dark, it features some exceptionally adult dialog that even today should exclude kids from watching it. Now I do understand why such rough language was used (after all, this is a harsh \"wrinkles and all\" look at television), but it's a shame really as the film COULD be an excellent civics lesson to our kids--especially teens. Watching the contempt that network programmers have for intelligence and decency is an important lesson and makes this an exceptional film.Just how far a network will go for ratings is the major thrust of the film? The evening news anchorman of UBS News (a great acronym) is losing his mind. However, when he actually has a nervous breakdown and announces he's going to kill himself on the air, even the soul-less people at the network are even initially upset--that is until the ratings come in for this an the following broadcast when the same announcer uses tons of profanity. Then, instead of disavowing themselves from it, they bathe in the horrible spectacle of a person losing his hold on reality! And, in turn, this sort of crap programming results in even more controversial and pointless shows--such as one that glorifies terrorists and encourages these killers to film their exploits so they can be shown on TV! The sickest and funniest aspect of this was the business meeting the network bigwigs had with the terrorists when it was becoming obvious that these Communist Radicals were actually becoming astute Capitalists and were concerned with profits and residuals!! There's a lot more to the film than this. In particular, there is a relationship between William Holden and Faye Dunaway that is actually intended as a representation of the shallowness of the media. In other words, Holden is seduced by Miss Dunaway--just like the public is often seduced by glitz without substance or depth. This parallel story is exceptional and Dunaway received an Oscar for her wonderful part. Oddly, while Holden was also exceptional in the film, the Oscar for Best Actor was given to Peter Finch (the insane anchor man) even though he is really more of a supporting character. Both he and Holden were up for the award. Beatrice Straight received the Best Supporting Actress for her very brief appearance in the film. While she WAS excellent, she was only on screen a tiny fraction of the film. So, choosing her and Finch as Oscar recipients both seem like odd choices in hindsight. Paddy Cheyevsky, not surprisingly, also garnered an Oscar for his insightful script.All in all, while not one of the very greatest films I have seen, it certainly is a must-see for film fans and a wonderful example of cynicism and dark humor."
    },
    {
      "username": "wes-connors",
      "userUrl": "https://www.imdb.com/user/ur15896852",
      "reviewLink": "https://www.imdb.com/review/rw2371261",
      "warningSpoilers": false,
      "date": "17 January 2011",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Paddy Chayefsky Gets Mad at the Media",
      "content": "With his ratings in the toilet, and cancellation looming, veteran newscaster Peter Finch (as Howard Beale) decides to go out with a \"BANG!\" and announces he will commit suicide on his last broadcast. Boozy \"UBS\" network news chief William Holden (as Max Schumacher) decides to let his drinking buddy go before the camera one last time to apologize, and bow out with some dignity. Instead, Mr. Finch goes on another tirade. Of course, the ratings skyrocket, and Finch becomes a TV demagogue. Next, his popular news show is given to entertainment division executive Faye Dunaway (as Diana Christensen), who uses it to build a sensationalistic and successful schedule for the \"Network\". With uncanny direction from Sidney Lumet, \"Network\" is a bottomless pit of great performances, with Holden and Finch demonstrating the best use of vulgar language in at least a decade.Writer Paddy Chayefsky's award-winning warning was taken for satire in 1976, and is now considered a blueprint for success. Everything in this film was happening then, and continues on a larger scale. Mr. Chayefsky was a television original, and had a front row seat when he witnessed television's \"vast wasteland\" grow to unmanageable proportions. Perversely, the real networks responded to this film by turning their news coverage over to entertainment divisions (one rather blatantly, and famously). The end of the Fairness Doctrine helped insure a future of garbage, with no end in sight. Presently, we have 24-hour news channels delivering less information than was once available in less than 30 minutes. \"BREAKING NEWS!\" headlines everything from a politician's assassination to a supermodel's hangnail. You need to yell, \"I'm mad as hell, and I'm not going to take this anymore!\" ********** Network (11/14/76) Sidney Lumet ~ William Holden, Peter Finch, Faye Dunaway, Robert Duvall"
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw4519098",
      "warningSpoilers": true,
      "date": "18 December 2018",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "The \"1984\" of the 1970's.",
      "content": "Back in the mid 1970's, cable TV was a luxury. There were three networks, two forms of channels to surf (UHF and VHF), and the national news was either in print format or available through only ABC, CBS or NBC. Women anchors were few, let alone executives, so Faye Dunaway's character here (Diana Christensen) is far ahead of her time, and admittedly \"one of the boys\". Peter Finch's fictional network national news anchorman Howard Beale has been through the ringer and has been given his notice, and like \"Meet John Doe's\" Long John Willoughby, plans to kill himself. Unlike Willoughby, however, his suicide is planned to be real from his own lips, where Gary Cooper's \"Meet John Doe\" character only planned to disappear after the circulation scheme created by columnist Barbara Stanwyck passed its target date. It's the people behind the scenes in \"Network\" who pull the strings here, and instead of just newspaper owner Edward Arnold in that Frank Capra classic, you've got bigwigs from around the world it seems playing puppet master with Finch's life. Sidney Lumet, one of the great directors of the modern era of cinema, leads the way for what is considered one of the all time classics of the past 40 years.With one of the greatest ensembles ever assembled for a big budget cinematic release, \"Network\" grabs you from the moment of Lee Richardson's voice popping up to narrate Beale's story. Gradually, you get to meet the important people involved behind the scenes which includes Vice President of programming Dunaway, Finch's old pal, executive William Holden, and Robert Duvall as the head of a conglomorate who has bought up the network for its own selfish purposes. Others behind the scenes in smaller but equally important parts include veteran actors William Prince, Wesley Addy, Jordan Charney and Ned Beatty, each add to the bubbling volcano boiling within the network, not only focusing on the news program, but potential series Dunaway considers to help build up ratings which seem to be at an all time low, having it at the bottom of the four.TV series of the time from other networks are mentioned as ratings giants dominating the airwaves, and political events and tensions are added in fictional subplots to create even more tension. Marlene Warfield and Arthur Burghardt get an interesting subplot as members of a black extremist group whose cause becomes Dunaway's prize ratings cash cow, even though you can tell that she really could care less about any cause except pushing her own career up the ladder. Dunaway's affair with Holden causes a split between him and his long devoted wife (Oscar winner Beatrice Straight in probably the greatest cameo in motion picture history) and leads Holden to see what is behind the dwindling soul of the very troubled Dunaway. As she reveals the history of her failed love life (a husband who ran off with another man and her inadequacies in bed), you see someone with one direction in life that is easy to see ending with either suicide or a mental hospital. Twists involving her at the end might even have you drop your jaw in shock. By this point, there's no turning back for her, and it really makes you feel sorry for her as well as her victims.While the temptation is there to compare her performance to her notorious role of Joan Crawford in \"Mommie Dearest\", the subtle nuances Dunaway utilizes here makes her fascinating to watch. Diane Christensen has been compared to several powerful women in business who had reputations for being horrible to work for, the character of Diane is written as more commanding than demanding, somebody you might respect at first glance for her intelligence and beauty, but once subtleties make her real character known, she becomes closer to Sigourney Weaver's comical executive in \"Working Girl\" rather than Meryl Streep's nasty Miranda Priestly in \"The Devil Wears Prada\". The scenes between Holden and Dunaway exploring the nuances of their relationship show a very damaged woman, a fascinating view into the future of people obsessed with social media and unable to see reality past the push of their finger from their electronic devices.Then, there's the powerful cameo of Ned Beatty as one of the heads of the social destructive conglomerate, tearing Finch down for taking things too far in his sudden fame after his \"I'm as mad as hell!\" declaration and basically threatening to destroy the agendas Beatty, Duvall and others have set up in their attempts to manipulate and control society. Like Ms. Straight, Beatty takes over the film for one five minute scene and becomes unforgettable. It is with his appearance that this film delves into the darkness of the future from 1976 which now seems to be our present. A well received Broadway version of \"Network\" has opened to raves and sold-out performances, and dismisses any notion film historians have made in discussing the relevance of \"Network\" in movie history. There was much tension at the 1977 Academy Awards because of the powerful competition \"Network\" faced (two films, \"All the President's Men\" and \"Taxi Driver\", also show dark glimpses into American society; the winner, \"Rocky\", was a crowd pleaser that stood the test of time), but winning three out of the four acting awards as well as screenplay, \"Network\" is a modern classic that film students will be discussing for years."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1719837",
      "warningSpoilers": false,
      "date": "27 August 2007",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Sidney Lumet Sees Into the Future of American Broadcasting",
      "content": "\"Network\" is hard to describe.It's not hard to see why Sidney Lumet's acidic tirade about American news networks caused a sensation back when it was released. The famous refrain that becomes the mantra of Peter Finch's character, a news anchor who has lost his stomach for the kind of crap he's asked to spew out night after night and decides to do something about it, is \"I'm mad as hell, and I'm not gonna take it anymore!\" This could have been the refrain for America at large in 1976, after assassinations, a failed military conflict and political scandals had pretty much decimated any faith Americans still had in their nation. The fact that that same phrase could be a refrain for America today shows how ahead of its time and relevant this movie was and is. The story seemed outrageous then. Finch's character decides that he's going to kill himself on network television, and the network chief, played by Faye Dunaway in a blistering ball-buster performance, rather than react in horror, sees only the potential for sky-high ratings and a boost to her career. Sadly, in this age of reality television and sensationalistic journalism, the premise no longer seems very outrageous.So as a satire I think \"Network\" holds up expertly, but as a movie, I think it shows its age. Paddy Chayefsky, who wrote the screenplay, stages the film's action as a series of monologues and speeches, and the overall result can be a bit tedious, like a film version of an essay. The writing feels like it might work better on stage than on screen. But Sidney Lumet, who was coming off a high with \"Dog Day Afternoon\" the year before, happens to be a director who's always had a knack for giving stagey material a cinematic quality, so he's perfectly matched with Chayefsky. And there are no quibbles with the acting. Finch and Dunaway are fierce and get the showiest moments, but Robert Duvall and William Holden, in quieter roles, do outstanding work as well. Ned Beatty and Beatrice Straight give two of the smallest Oscar-nominated performances ever. Both each have essentially one scene, but both do quite memorable things with them, and Beatty's in particular is one of the most grotesquely fascinating cameos ever captured on film.An essential film from the 1970s whose impact is blunted now only because the film was so prophetic. How many movies can you say that about? Grade: A"
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw2928898",
      "warningSpoilers": true,
      "date": "26 December 2013",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Exciting, outlandish, and frighteningly relevant.",
      "content": "Two reasons why \"Network\" has me in its grip: 1. Its stellar cast, which features terrific performances from everyone: William Holden, Peter Finch, Faye Dunaway, Robert Duvall and Ned Beatty. Between the crackling dialog and their adept acting, they make this series of people-talking-to-each-other-in-offices captivating. Dunaway makes bitchiness a thrill to watch, and Beatty's firebrand speech is electrifying.2. The script. Aside from the dialog, Chayefsky has created a world in which sensationalism and the almighty dollar trump common decency and the truth. But it's not so crazy because it's eerily prophetic. The news organization depicted herein foreshadows our current media culture; trash/reality TV, current events delivered via \"personalities\", conglomerate-owned news outfits, the very idea of \"infotainment\" - all of it was concocted almost 40 years ago. Every absurdist idea Chayefsky had in this movie has come to fruition. It didn't have to, but we let it happen. To watch \"Network\" is to go back to a time when this ridiculous ratings-at-all-cost television could never actually happen. And the beauty of this movie is that it's able to end on a darkly hilarious note. One that always leaves me with a cynical smile.10/10"
    }
  ],
  "errorMessage": ""
}