{
  "imDbId": "tt0074958",
  "title": "Network",
  "fullTitle": "Network (1976)",
  "type": "Movie",
  "year": "1976",
  "language": "en",
  "titleInLanguage": "Network (1976 film)",
  "url": "https://en.wikipedia.org/wiki/Network_(1976_film)",
  "plotShort": {
    "plainText": "Network is a 1976 American satirical drama film released by Metro-Goldwyn-Mayer, written by Paddy Chayefsky and directed by Sidney Lumet. It is about a fictional television network, the Union Broadcasting System (UBS), and its struggle with poor ratings. The film stars Faye Dunaway, William Holden, Peter Finch (in his final film role), Robert Duvall, Wesley Addy, Ned Beatty, and Beatrice Straight.\r\nNetwork received widespread critical acclaim, with particular praise for the screenplay and performances. The film was a commercial success, with nine Oscar nominations at the 49th Academy Awards, including Best Picture, that led to four wins: Best Actor (Finch), Best Actress (Dunaway), Best Supporting Actress (Straight), and Best Original Screenplay.\r\nIn 2000, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". In 2002, it was inducted into the Producers Guild of America Hall of Fame as a film that has \"set an enduring standard for American entertainment\". In 2005, the two Writers Guilds of America voted Chayefsky's script one of the 10 greatest screenplays in the history of cinema.It is widely considered one of the greatest screenplays of all time. Dunaway (Chinatown, 1974), Duvall (The Godfather, 1972) and Holden (Sunset Boulevard, 1950) appear in one other film each from the same WGA top ten list. In 2007, the film was 64th among the 100 greatest American films as chosen by the American Film Institute, a ranking slightly higher than the one AFI had given it ten years earlier.",
    "html": "<p>Network is a 1976 American satirical drama film released by Metro-Goldwyn-Mayer, written by Paddy Chayefsky and directed by Sidney Lumet. It is about a fictional television network, the Union Broadcasting System (UBS), and its struggle with poor ratings. The film stars Faye Dunaway, William Holden, Peter Finch (in his final film role), Robert Duvall, Wesley Addy, Ned Beatty, and Beatrice Straight.</p><p>Network received widespread critical acclaim, with particular praise for the screenplay and performances. The film was a commercial success, with nine Oscar nominations at the 49th Academy Awards, including Best Picture, that led to four wins: Best Actor (Finch), Best Actress (Dunaway), Best Supporting Actress (Straight), and Best Original Screenplay.</p><p>In 2000, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". In 2002, it was inducted into the Producers Guild of America Hall of Fame as a film that has \"set an enduring standard for American entertainment\". In 2005, the two Writers Guilds of America voted Chayefsky's script one of the 10 greatest screenplays in the history of cinema.It is widely considered one of the greatest screenplays of all time. Dunaway (Chinatown, 1974), Duvall (The Godfather, 1972) and Holden (Sunset Boulevard, 1950) appear in one other film each from the same WGA top ten list. In 2007, the film was 64th among the 100 greatest American films as chosen by the American Film Institute, a ranking slightly higher than the one AFI had given it ten years earlier.</p>"
  },
  "plotFull": {
    "plainText": "Network is a 1976 American satirical drama film released by Metro-Goldwyn-Mayer, written by Paddy Chayefsky and directed by Sidney Lumet. It is about a fictional television network, the Union Broadcasting System (UBS), and its struggle with poor ratings. The film stars Faye Dunaway, William Holden, Peter Finch (in his final film role), Robert Duvall, Wesley Addy, Ned Beatty, and Beatrice Straight.\r\nNetwork received widespread critical acclaim, with particular praise for the screenplay and performances. The film was a commercial success, with nine Oscar nominations at the 49th Academy Awards, including Best Picture, that led to four wins: Best Actor (Finch), Best Actress (Dunaway), Best Supporting Actress (Straight), and Best Original Screenplay.\r\nIn 2000, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". In 2002, it was inducted into the Producers Guild of America Hall of Fame as a film that has \"set an enduring standard for American entertainment\". In 2005, the two Writers Guilds of America voted Chayefsky's script one of the 10 greatest screenplays in the history of cinema.It is widely considered one of the greatest screenplays of all time. Dunaway (Chinatown, 1974), Duvall (The Godfather, 1972) and Holden (Sunset Boulevard, 1950) appear in one other film each from the same WGA top ten list. In 2007, the film was 64th among the 100 greatest American films as chosen by the American Film Institute, a ranking slightly higher than the one AFI had given it ten years earlier.\r\nPlot\r\nHoward Beale, longtime evening TV anchorman for the UBS Evening News, learns from friend and news division president Max Schumacher that he has just two more weeks on the air because of declining ratings. The following night, Beale announces on live broadcast that he will commit suicide on next Tuesday's broadcast. UBS tries to immediately fire Beale, but Schumacher intervenes so that Beale can have a dignified farewell. Beale promises to apologize for his outburst, but once on the air, he launches into a rant about life being \"bullshit.\" Beale's outburst causes ratings to spike, and much to Schumacher's dismay, the UBS upper echelons decide to exploit the situation. When Beale's ratings soon top out, programming chief Diana Christensen reaches out to Schumacher with an offer to help \"develop\" the show. He declines the professional proposal, but accepts her more personal pitch; the two begin an affair.\r\nWhen Schumacher decides to end Beale's \"angry man\" format, Christensen persuades her boss, Frank Hackett, to slot the evening news show under the entertainment programming division so she can develop it. Hackett bullies the UBS executives to consent and fire Schumacher. In one impassioned diatribe, Beale galvanizes the nation, persuading viewers to shout \"I'm as mad as hell, and I'm not going to take this anymore!\" from their windows. Beale is soon hosting a new program called The Howard Beale Show, top-billed as \"the mad prophet of the airwaves\". The show becomes the most highly rated program on television, and Beale finds new celebrity preaching his angry message in front of a live studio audience that, on cue, chants his signature catchphrase: \"We're as mad as hell, and we're not going to take this anymore!\" Schumacher and Christensen's romance withers as the show flourishes, but in the flush of high ratings, the two ultimately find their way back together, and Schumacher separates from his wife of over 25 years for Christensen.\r\nChristensen, seeking just one more hit show, cuts a deal with a band of terrorists called the Ecumenical Liberation Army (ELA) for a new docudrama series, The Mao Tse-Tung Hour, for the upcoming fall season, for which the ELA will provide exclusive footage of their activities. Her liaison, Communist Party USA representative Laureen Hobbs, initially objects to the promotion of violent terrorism, believing Americans are \"not yet ready for open revolt\" and that the ELA will harm left-wing causes in America, but relents after Christensen promises her total editorial control of the weekly prime time program.\r\nWhen Beale discovers that Communications Corporation of America (CCA), the conglomerate parent of UBS, will be bought out by an even larger Saudi conglomerate, he launches an on-screen tirade against the deal and urges viewers to pressure the White House to stop it. This panics top network brass because UBS's debt load has made the merger essential for its survival. Beale meets with CCA chairman Arthur Jensen, who explicates his own \"corporate cosmology\" to Beale, describing the inter-relatedness of the participants in the international economy and the illusory nature of nationality distinctions. Jensen persuades Beale to abandon his populist message and preach his new \"evangel\".\r\nChristensen's fanatical devotion to her job and emotional emptiness ultimately drive Schumacher away and back to his wife, and he warns his former lover that she will self-destruct if she continues running her career at its current pace.\r\nAudiences find Beale's new sermons on the dehumanization of society depressing and ratings start to slip, yet Jensen will not allow UBS to fire Beale, despite protestations from Hackett, who fears a loss of ad revenue, and Hobbs, who fears that Beale's slipping ratings will harm viewer numbers for The Mao Tse-Tung Hour. Seeing its two-for-the-price-of-one value – solving the Beale problem plus sparking a boost in season-opener ratings – Christensen, Hackett, and the other executives decide to hire the ELA to assassinate Beale on the air. The assassination succeeds, putting an end to The Howard Beale Show and kicking off the second season of The Mao Tse-Tung Hour.\r\nA voice-over proclaims, \"This was the story of Howard Beale: the first known instance of a man who was killed because he had lousy ratings.\"\r\nCast\r\nFaye Dunaway as Diana Christensen\r\nWilliam Holden as Max Schumacher\r\nPeter Finch as Howard Beale\r\nRobert Duvall as Frank Hackett\r\nWesley Addy as Nelson Chaney\r\nNed Beatty as Arthur Jensen\r\nJordan Charney as Harry Hunter\r\nConchata Ferrell as Barbara Schlesinger\r\nDarryl Hickman as Bill Herron\r\nRoy Poole as Sam Haywood\r\nWilliam Prince as Edward George Ruddy\r\nBeatrice Straight as Louise Schumacher\r\nMarlene Warfield as Laureen Hobbs\r\nIn addition, Lee Richardson provides various moments of narration advancing additional plot details.\r\nProduction\r\nDevelopment and writing\r\nNetwork came only two years after the first on-screen suicide in television history, of television news reporter Christine Chubbuck in Sarasota, Florida. The anchorwoman was suffering from depression and loneliness, was often emotionally distant from her co-workers, and shot herself on camera as stunned viewers watched on July 15, 1974. Chayefsky used the idea of a live death as his film's terminating focal point, to say later in an interview, \"Television will do anything for a rating... anything!\" However, Dave Itzkoff's book (Mad as Hell: The Making of Network and the Fateful Vision of the Angriest Man in Movies) allows that whether Chayefsky was inspired by the Chubbuck case remains unclear, that Chayefsky's screenplay notes on the week of the live death have nothing about the incident in them, and grants it is an eerie parallel. It was to be months later that actual direct reference was made, Chayefsky writing for Beale to bray that he \"will blow my brains out right on the air ... like that girl in Florida\", which met with a delete. Sidney Lumet made the categorical statement that the character of Howard Beale was never based on any real-life person.\r\nBefore beginning his screenplay, Chayefsky visited network TV offices. He was surprised to learn that television executives did not watch much television. \"The programs they put on 'had to' be bad, had to be something they wouldn't watch,\" he remarked. \"Imagine having to work like that all your life.\" According to Dave Itzkoff, what Chayefsky saw while writing the screenplay during the midst of Watergate and the Vietnam War was the entirety of America's anger being broadcast in everything from sitcoms to news reports. He concluded that Americans \"don't want jolly, happy family type shows like Eye Witness News\" ... \"the American people are angry and want angry shows.\" When he began writing his script he had intended on a comedy, but instead directed his frustration at the content being broadcast on television—which he described as \"an indestructible and terrifying giant that is stronger than the government\"—into the screenplay. It became a \"dark satire about an unstable news anchor and a broadcasting company and a viewing public all too happy to follow him over the brink of sanity.\" The character of network executive Diana Christiansen was based on NBC daytime television programming executive Lin Bolen, which Bolen disputed.\r\nChayefsky and producer Howard Gottfried had just come off a lawsuit against United Artists, challenging the studio's right to lease their previous film, The Hospital, to ABC in a package with a less successful film. Despite this recent legal action, Chayefsky and Gottfried signed a deal with UA to finance Network, until UA found the subject matter too controversial and backed out. Undeterred, Chayefsky and Gottfried shopped the script around to other studios, and eventually found an interested party in Metro-Goldwyn-Mayer. Soon afterward, United Artists reversed itself and looked to co-finance the film with MGM, since the latter had an ongoing distribution arrangement with UA in North America. Since MGM agreed to let UA back on board, the former (through United Artists as per the arrangement) controlled North American/Caribbean rights, with UA opting for overseas distribution.\r\nCasting\r\nIn his notes, Chayefsky jotted down his ideas about casting. For Howard Beale, who would eventually be played by Peter Finch, he envisioned Henry Fonda, Cary Grant, James Stewart and Paul Newman. He went so far as to write Newman, telling him that \"You and a very small handful of other actors are the only ones I can think of with the range for this part.\" Lumet wanted Fonda, with whom he had worked several times, but Fonda declined the role, finding it too \"hysterical\" for his taste. Stewart also found the script unsuitable, objecting to the strong language. Early consideration was given to real-life newscasters Walter Cronkite and John Chancellor, but neither was open to the idea. Although not mentioned in Chayefsky's notes, George C. Scott, Glenn Ford and William Holden reportedly also turned down the opportunity to play Beale, with Holden instead playing Max Schumacher: For that role, Chayefsky had initially listed Walter Matthau and Gene Hackman. Ford was under consideration for this part as well, and was said to be one of two final contenders. Holden finally got the edge because of his recent box-office success with The Towering Inferno.\r\nProducers were wary that Finch, an Australian, wouldn't be able to sound authentically American; they demanded an audition before his casting could be considered. An actor of considerable prominence, Finch reportedly responded, \"Bugger pride. Put the script in the mail.\" Immediately realizing that the role was a plum, he even agreed to pay his own fare to New York for a screen test. He prepared for the audition by listening to hours of broadcasts by American newscasters, and by weeks of reading the international editions of The New York Times and the Herald Tribune into a tape recorder, then listening to playbacks with a critical ear. Gottfried recalled that Finch \"was nervous as hell at that first meeting over lunch and just like a kid auditioning. Once we'd heard him, Sidney Lumet, Paddy, and I were ecstatic because we knew it was a hell of a part to cast.\" Finch cinched the deal with Lumet by playing him the tapes of his newspaper readings.\r\nFaye Dunaway wanted Robert Mitchum to play Max Schumacher, but Lumet refused, believing that Mitchum wasn't sufficiently urbane. For the role of Diana Christensen, Chayefsky thought of Candice Bergen, Ellen Burstyn, and Natalie Wood, while the studio suggested Jane Fonda, with alternate candidates Kay Lenz, Diane Keaton, Marsha Mason and Jill Clayburgh. Lumet wanted to cast Vanessa Redgrave in the film, but Chayefsky did not want her. Lumet argued that he thought she was the greatest English-speaking actress in the world, while Chayefsky, a proud Jew and supporter of Israel, objected on the basis of her support of the PLO. Lumet, also a Jew, said \"Paddy, that's blacklisting!\", to which Chayefsky replied, \"Not when a Jew does it to a Gentile.\"\r\nDunaway was cast as Diana in September 1975. Lumet told her that he would edit any attempts on her part to make her character sympathetic and insisted on presenting her without any vulnerability. Lumet cast Robert Duvall as Frank Hackett. Duvall saw Hackett as a \"vicious president Ford\". On Duvall, Lumet said: \"What's fascinating about Duvall is how funny he is.\" Ned Beatty was cast as Arthur Jensen on the recommendation of director Robert Altman after the original actor failed to live up to Lumet's standards. Beatty had one night to prepare a four-page speech, and was finished after one day's shooting. Beatrice Straight played Louise Schumacher, Max's wife, on whom he cheats with Diana. Straight had won a Tony Award in 1953 for playing an anguished wife who is similarly cheated on in Arthur Miller's The Crucible.\r\nFilming\r\nAfter two weeks of rehearsals, filming started in Toronto in January 1976. Lumet recalled that Chayefsky was usually on set during filming, and sometimes offered advice about how certain scenes should be played. Lumet allowed that his old friend had the better comic instincts of the two, but when it came to the domestic confrontation between Holden and Straight, the four-times-married director had the upper hand: \"Paddy, please, I know more about divorce than you!\" Finch, who had suffered from heart problems for many years, became physically and psychologically exhausted by the demands of playing Beale.\r\nThere was some concern that the combination of Holden and Dunaway might create conflict on the set, since the two had sparred during an earlier co-starring stint in The Towering Inferno. According to biographer Bob Thomas, Holden had been incensed by Dunaway's behavior during the filming of the disaster epic, especially her habit of leaving him fuming on the set while she attended to her hair, makeup and telephone calls. One day, after a two-hour wait, Holden reportedly grabbed Dunaway by the shoulders, pushed her against a soundstage wall and snapped, \"You do that to me once more, and I'll push you through that wall!\"\r\nLumet and cinematographer Owen Roizman worked out a complicated lighting scheme that in Lumet's words would \"corrupt the camera\". Lumet recalled: \"We started with an almost naturalistic look. For the first scene between Peter Finch and Bill Holden, on Sixth Avenue at night, we added only enough light to get an exposure. As the movie progressed, camera setups became more rigid, more formal. The lighting became more and more artificial. The next-to-final scene—where Faye Dunaway, Robert Duvall, and the three network gray suits decide to kill Peter Finch—is lit like a commercial. The camera setups are static and framed like still pictures. The camera had also become a victim of television.\"\r\nRelease\r\nThe film premiered in New York City on November 27, 1976, and went into wide release shortly afterward.\r\nCritical reception\r\nNetwork opened to acclaim from critics, and became one of the big hits of 1976–77. Vincent Canby, in his November 1976 review of the film for The New York Times, called the film \"outrageous ... brilliantly, cruelly funny, a topical American comedy that confirms Paddy Chayefsky's position as a major new American satirist\" and a film whose \"wickedly distorted views of the way television looks, sounds, and, indeed, is, are the satirist's cardiogram of the hidden heart, not just of television but also of the society that supports it and is, in turn, supported.\" Gene Siskel of the Chicago Tribune gave the film four stars out of four, calling it \"a very funny movie that takes an easy target and giddily beats it to death.\" Charles Champlin of the Los Angeles Times put the film on his list of the 10 best of the year.\r\nIn a review of the film written after it received its Academy Awards, Roger Ebert called it a \"supremely well-acted, intelligent film that tries for too much, that attacks not only television but also most of the other ills of the 1970s,\" though \"what it does accomplish is done so well, is seen so sharply, is presented so unforgivingly, that Network will outlive a lot of tidier movies.\" Seeing it a quarter-century later, Ebert added the film to his Great Movies list and said the film was \"like prophecy. When Chayefsky created Howard Beale, could he have imagined Jerry Springer, Howard Stern, and the World Wrestling Federation?\"; he credits Lumet and Chayefsky for knowing \"just when to pull out all the stops.\"\r\nNot all reviews were positive: Pauline Kael in The New Yorker, in a review subtitled \"Hot Air\", criticized the film's abundance of long, preachy speeches; Chayefsky's self-righteous contempt for not only television itself but also television viewers; and the fact that almost everyone in the movie, particularly Robert Duvall, has a shouting rant: \"The cast of this messianic farce takes turns yelling at us soulless masses.\" Gary Arnold of The Washington Post declared that \"the movie is too sternly, monotonously preachy for either persuasion or casual amusement.\" Michael Billington wrote, \"Too much of this film has the hectoring stridency of tabloid headlines\", while Chris Petit in Time Out described it as \"slick, 'adult', self-congratulatory, and almost entirely hollow\", adding that \"most of the interest comes in watching such a lavishly mounted vehicle leaving the rails so spectacularly.\"\r\nOn Rotten Tomatoes the film has an approval rating of 92% based on 73 reviews, with an average rating of 8.50/10. The site's critics consensus states, \"Driven by populist fury and elevated by strong direction, powerful acting, and an intelligent script, Network's searing satire of ratings-driven news remains sadly relevant more than four decades later.\" On Metacritic it has a weighted average score of 83 out of 100, based on 16 critics, indicating \"universal acclaim\".\r\nLegacy\r\nScreenwriter Aaron Sorkin wrote that \"no predictor of the future—not even Orwell—has ever been as right as Chayefsky was when he wrote Network.\" The film ranks at number 100 in Empire magazine's list of the 500 Greatest Films of All Time.\r\nIn popular culture\r\nThe film's catchphrase \"I'm as mad as hell, and I'm not going to take this anymore!\" and its derivatives have been referenced in a variety of media.\r\n\"Telecide\", the last song on The Tubes' 1979 album Remote Control references the \"mad as hell\" line specifically and the film's themes more broadly.\r\nIn the 1989 comedy UHF, also set in a failing TV station looking for a ratings breakthrough, janitor Stanley Spadowski (Michael Richards) becomes a star and catapults the TV station to great success after his on-air improvisation of a rant about his mop that crescendos with his exhortation to \"stand right up\" and \"run to a window and say, 'Hey, these floors are dirty as hell and I'm not gonna take it anymore!\"\r\nArthur Jensen's speech to Beale is extensively sampled in \"America Number One\" by Consolidated (1990) and \"Corporate Slave\" by Snog (1992).\r\nThe \"Mad as Hell\" monologue is sampled in the 2009 track \"Recession\" by Dutch hardstyle artist The Prophet, post-rock group Maybeshewill's song \"Not for Want of Trying\" on their album of the same name (2008), English speaking French rap duo Chill Bump's intro to their award-winning song \"Life Has Value\" from their 2012 release Hidden Strings, in the song \"Lullaby\" by Scottish singer/songwriter Gerry Cinnamon on his debut album Erratic Cinematic (2017), in the song \"I Am The Night\" from Perturbator's second album I Am the Night (2013), and in the song \"Dice of a Generation\" by artist DEMONDICE on her album \"American Saikoro\" (2018).\r\nThe first Animaniacs episode \"De-Zanitized\" (1993) spoofs the conference scene with Beale and Arthur Jensen.\r\nSpike Lee's film Bamboozled (2000) parallels and references \"Network\" in its exploration of race and cynicism in television and popular culture.\r\nIn the first episode of Studio 60 on the Sunset Strip (2006), a character's on-air breakdown is compared to that of Beale by news reporters.\r\nIn Episode 15 of Season 4 of Boston Legal (2007), \"Tabloid Nation\", a lawyer character uses the film as evidence in his closing arguments to prove how debased modern American TV culture has become.\r\nMad As Hell, a satirical Australian news show starring Shaun Micallef which began in 2012, takes its title from Finch's monologue; the various different incarnations of the opening sequence all feature visual references to the sequence of viewers yelling from their windows into the street.\r\nThe 2014 documentary film Mad as Hell, about the news series The Young Turks, takes its title from the monologue.\r\nIn Better Call Saul's first episode \"Uno\" (2015), Jimmy McGill quotes part of Jensen's diatribe when he is lambasting the board of his brother's law firm, addressing Howard Hamlin, then tells his confused audience that his quote came from Network. The same camera angle is employed in both instances.\r\nStage adaptation\r\nA stage adaptation by Lee Hall premiered in the Lyttleton Theatre at the National Theatre in London in November 2017. The play was directed by Ivo Van Hove featuring Bryan Cranston making his UK stage debut as Howard Beale, and Michelle Dockery as Diana. It opened on Broadway on December 6, 2018, with Cranston reprising his role as Beale, and with Tatiana Maslany as Diana and Tony Goldwyn as Max Schumacher.\r\nAwards and honors\r\nAt the Academy Awards, Network won three of the four acting awards. As of 2023, it is the second of only three films which have accomplished this feat, preceded by A Streetcar Named Desire (1951) and followed by Everything Everywhere All at Once (2022).\r\nPeter Finch died before the 1977 ceremony and was the only performer to win a posthumous acting Academy Award (until 2009 when Heath Ledger won Best Supporting Actor). The statuette itself was collected by Finch's widow, Eletha Finch, after Chayefsky invited her onstage.\r\nBeatrice Straight's performance as Louise Schumacher occupied only five minutes and two seconds of screen time, making it the shortest performance to win an Oscar as of 2022 (breaking Gloria Grahame's nine minute and 32 second screen time record for The Bad and the Beautiful in 1953).\r\nAmerican Film Institute\r\nAFI's 100 Years...100 Movies – #66\r\nAFI's 100 Years...100 Laughs – Nominated\r\nAFI's 100 Years...100 Heroes & Villains: Diana Christensen – Nominated Villain\r\nDiana Christensen – Nominated Villain\r\nAFI's 100 Years...100 Movie Quotes: \"I'm as mad as hell, and I'm not going to take this anymore!\" – #19\r\n\"I'm as mad as hell, and I'm not going to take this anymore!\" – #19\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) – #64\r\nNotes\r\n",
    "html": "<p>Network is a 1976 American satirical drama film released by Metro-Goldwyn-Mayer, written by Paddy Chayefsky and directed by Sidney Lumet. It is about a fictional television network, the Union Broadcasting System (UBS), and its struggle with poor ratings. The film stars Faye Dunaway, William Holden, Peter Finch (in his final film role), Robert Duvall, Wesley Addy, Ned Beatty, and Beatrice Straight.</p><p>Network received widespread critical acclaim, with particular praise for the screenplay and performances. The film was a commercial success, with nine Oscar nominations at the 49th Academy Awards, including Best Picture, that led to four wins: Best Actor (Finch), Best Actress (Dunaway), Best Supporting Actress (Straight), and Best Original Screenplay.</p><p>In 2000, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". In 2002, it was inducted into the Producers Guild of America Hall of Fame as a film that has \"set an enduring standard for American entertainment\". In 2005, the two Writers Guilds of America voted Chayefsky's script one of the 10 greatest screenplays in the history of cinema.It is widely considered one of the greatest screenplays of all time. Dunaway (Chinatown, 1974), Duvall (The Godfather, 1972) and Holden (Sunset Boulevard, 1950) appear in one other film each from the same WGA top ten list. In 2007, the film was 64th among the 100 greatest American films as chosen by the American Film Institute, a ranking slightly higher than the one AFI had given it ten years earlier.</p><br/><h3>Plot</h3><p>Howard Beale, longtime evening TV anchorman for the UBS Evening News, learns from friend and news division president Max Schumacher that he has just two more weeks on the air because of declining ratings. The following night, Beale announces on live broadcast that he will commit suicide on next Tuesday's broadcast. UBS tries to immediately fire Beale, but Schumacher intervenes so that Beale can have a dignified farewell. Beale promises to apologize for his outburst, but once on the air, he launches into a rant about life being \"bullshit.\" Beale's outburst causes ratings to spike, and much to Schumacher's dismay, the UBS upper echelons decide to exploit the situation. When Beale's ratings soon top out, programming chief Diana Christensen reaches out to Schumacher with an offer to help \"develop\" the show. He declines the professional proposal, but accepts her more personal pitch; the two begin an affair.</p><p>When Schumacher decides to end Beale's \"angry man\" format, Christensen persuades her boss, Frank Hackett, to slot the evening news show under the entertainment programming division so she can develop it. Hackett bullies the UBS executives to consent and fire Schumacher. In one impassioned diatribe, Beale galvanizes the nation, persuading viewers to shout \"I'm as mad as hell, and I'm not going to take this anymore!\" from their windows. Beale is soon hosting a new program called The Howard Beale Show, top-billed as \"the mad prophet of the airwaves\". The show becomes the most highly rated program on television, and Beale finds new celebrity preaching his angry message in front of a live studio audience that, on cue, chants his signature catchphrase: \"We're as mad as hell, and we're not going to take this anymore!\" Schumacher and Christensen's romance withers as the show flourishes, but in the flush of high ratings, the two ultimately find their way back together, and Schumacher separates from his wife of over 25 years for Christensen.</p><p>Christensen, seeking just one more hit show, cuts a deal with a band of terrorists called the Ecumenical Liberation Army (ELA) for a new docudrama series, The Mao Tse-Tung Hour, for the upcoming fall season, for which the ELA will provide exclusive footage of their activities. Her liaison, Communist Party USA representative Laureen Hobbs, initially objects to the promotion of violent terrorism, believing Americans are \"not yet ready for open revolt\" and that the ELA will harm left-wing causes in America, but relents after Christensen promises her total editorial control of the weekly prime time program.</p><p>When Beale discovers that Communications Corporation of America (CCA), the conglomerate parent of UBS, will be bought out by an even larger Saudi conglomerate, he launches an on-screen tirade against the deal and urges viewers to pressure the White House to stop it. This panics top network brass because UBS's debt load has made the merger essential for its survival. Beale meets with CCA chairman Arthur Jensen, who explicates his own \"corporate cosmology\" to Beale, describing the inter-relatedness of the participants in the international economy and the illusory nature of nationality distinctions. Jensen persuades Beale to abandon his populist message and preach his new \"evangel\".</p><p>Christensen's fanatical devotion to her job and emotional emptiness ultimately drive Schumacher away and back to his wife, and he warns his former lover that she will self-destruct if she continues running her career at its current pace.</p><p>Audiences find Beale's new sermons on the dehumanization of society depressing and ratings start to slip, yet Jensen will not allow UBS to fire Beale, despite protestations from Hackett, who fears a loss of ad revenue, and Hobbs, who fears that Beale's slipping ratings will harm viewer numbers for The Mao Tse-Tung Hour. Seeing its two-for-the-price-of-one value – solving the Beale problem plus sparking a boost in season-opener ratings – Christensen, Hackett, and the other executives decide to hire the ELA to assassinate Beale on the air. The assassination succeeds, putting an end to The Howard Beale Show and kicking off the second season of The Mao Tse-Tung Hour.</p><p>A voice-over proclaims, \"This was the story of Howard Beale: the first known instance of a man who was killed because he had lousy ratings.\"</p><br/><h3>Cast</h3><ul><li>Faye Dunaway as Diana Christensen</li><li>William Holden as Max Schumacher</li><li>Peter Finch as Howard Beale</li><li>Robert Duvall as Frank Hackett</li><li>Wesley Addy as Nelson Chaney</li><li>Ned Beatty as Arthur Jensen</li><li>Jordan Charney as Harry Hunter</li><li>Conchata Ferrell as Barbara Schlesinger</li><li>Darryl Hickman as Bill Herron</li><li>Roy Poole as Sam Haywood</li><li>William Prince as Edward George Ruddy</li><li>Beatrice Straight as Louise Schumacher</li><li>Marlene Warfield as Laureen Hobbs</li></ul><p>In addition, Lee Richardson provides various moments of narration advancing additional plot details.</p><br/><h3>Production</h3><h4>Development and writing</h4><p>Network came only two years after the first on-screen suicide in television history, of television news reporter Christine Chubbuck in Sarasota, Florida. The anchorwoman was suffering from depression and loneliness, was often emotionally distant from her co-workers, and shot herself on camera as stunned viewers watched on July 15, 1974. Chayefsky used the idea of a live death as his film's terminating focal point, to say later in an interview, \"Television will do anything for a rating... anything!\" However, Dave Itzkoff's book (Mad as Hell: The Making of Network and the Fateful Vision of the Angriest Man in Movies) allows that whether Chayefsky was inspired by the Chubbuck case remains unclear, that Chayefsky's screenplay notes on the week of the live death have nothing about the incident in them, and grants it is an eerie parallel. It was to be months later that actual direct reference was made, Chayefsky writing for Beale to bray that he \"will blow my brains out right on the air ... like that girl in Florida\", which met with a delete. Sidney Lumet made the categorical statement that the character of Howard Beale was never based on any real-life person.</p><p>Before beginning his screenplay, Chayefsky visited network TV offices. He was surprised to learn that television executives did not watch much television. \"The programs they put on 'had to' be bad, had to be something they wouldn't watch,\" he remarked. \"Imagine having to work like that all your life.\" According to Dave Itzkoff, what Chayefsky saw while writing the screenplay during the midst of Watergate and the Vietnam War was the entirety of America's anger being broadcast in everything from sitcoms to news reports. He concluded that Americans \"don't want jolly, happy family type shows like Eye Witness News\" ... \"the American people are angry and want angry shows.\" When he began writing his script he had intended on a comedy, but instead directed his frustration at the content being broadcast on television—which he described as \"an indestructible and terrifying giant that is stronger than the government\"—into the screenplay. It became a \"dark satire about an unstable news anchor and a broadcasting company and a viewing public all too happy to follow him over the brink of sanity.\" The character of network executive Diana Christiansen was based on NBC daytime television programming executive Lin Bolen, which Bolen disputed.</p><p>Chayefsky and producer Howard Gottfried had just come off a lawsuit against United Artists, challenging the studio's right to lease their previous film, The Hospital, to ABC in a package with a less successful film. Despite this recent legal action, Chayefsky and Gottfried signed a deal with UA to finance Network, until UA found the subject matter too controversial and backed out. Undeterred, Chayefsky and Gottfried shopped the script around to other studios, and eventually found an interested party in Metro-Goldwyn-Mayer. Soon afterward, United Artists reversed itself and looked to co-finance the film with MGM, since the latter had an ongoing distribution arrangement with UA in North America. Since MGM agreed to let UA back on board, the former (through United Artists as per the arrangement) controlled North American/Caribbean rights, with UA opting for overseas distribution.</p><h4>Casting</h4><p>In his notes, Chayefsky jotted down his ideas about casting. For Howard Beale, who would eventually be played by Peter Finch, he envisioned Henry Fonda, Cary Grant, James Stewart and Paul Newman. He went so far as to write Newman, telling him that \"You and a very small handful of other actors are the only ones I can think of with the range for this part.\" Lumet wanted Fonda, with whom he had worked several times, but Fonda declined the role, finding it too \"hysterical\" for his taste. Stewart also found the script unsuitable, objecting to the strong language. Early consideration was given to real-life newscasters Walter Cronkite and John Chancellor, but neither was open to the idea. Although not mentioned in Chayefsky's notes, George C. Scott, Glenn Ford and William Holden reportedly also turned down the opportunity to play Beale, with Holden instead playing Max Schumacher: For that role, Chayefsky had initially listed Walter Matthau and Gene Hackman. Ford was under consideration for this part as well, and was said to be one of two final contenders. Holden finally got the edge because of his recent box-office success with The Towering Inferno.</p><p>Producers were wary that Finch, an Australian, wouldn't be able to sound authentically American; they demanded an audition before his casting could be considered. An actor of considerable prominence, Finch reportedly responded, \"Bugger pride. Put the script in the mail.\" Immediately realizing that the role was a plum, he even agreed to pay his own fare to New York for a screen test. He prepared for the audition by listening to hours of broadcasts by American newscasters, and by weeks of reading the international editions of The New York Times and the Herald Tribune into a tape recorder, then listening to playbacks with a critical ear. Gottfried recalled that Finch \"was nervous as hell at that first meeting over lunch and just like a kid auditioning. Once we'd heard him, Sidney Lumet, Paddy, and I were ecstatic because we knew it was a hell of a part to cast.\" Finch cinched the deal with Lumet by playing him the tapes of his newspaper readings.</p><p>Faye Dunaway wanted Robert Mitchum to play Max Schumacher, but Lumet refused, believing that Mitchum wasn't sufficiently urbane. For the role of Diana Christensen, Chayefsky thought of Candice Bergen, Ellen Burstyn, and Natalie Wood, while the studio suggested Jane Fonda, with alternate candidates Kay Lenz, Diane Keaton, Marsha Mason and Jill Clayburgh. Lumet wanted to cast Vanessa Redgrave in the film, but Chayefsky did not want her. Lumet argued that he thought she was the greatest English-speaking actress in the world, while Chayefsky, a proud Jew and supporter of Israel, objected on the basis of her support of the PLO. Lumet, also a Jew, said \"Paddy, that's blacklisting!\", to which Chayefsky replied, \"Not when a Jew does it to a Gentile.\"</p><p>Dunaway was cast as Diana in September 1975. Lumet told her that he would edit any attempts on her part to make her character sympathetic and insisted on presenting her without any vulnerability. Lumet cast Robert Duvall as Frank Hackett. Duvall saw Hackett as a \"vicious president Ford\". On Duvall, Lumet said: \"What's fascinating about Duvall is how funny he is.\" Ned Beatty was cast as Arthur Jensen on the recommendation of director Robert Altman after the original actor failed to live up to Lumet's standards. Beatty had one night to prepare a four-page speech, and was finished after one day's shooting. Beatrice Straight played Louise Schumacher, Max's wife, on whom he cheats with Diana. Straight had won a Tony Award in 1953 for playing an anguished wife who is similarly cheated on in Arthur Miller's The Crucible.</p><h4>Filming</h4><p>After two weeks of rehearsals, filming started in Toronto in January 1976. Lumet recalled that Chayefsky was usually on set during filming, and sometimes offered advice about how certain scenes should be played. Lumet allowed that his old friend had the better comic instincts of the two, but when it came to the domestic confrontation between Holden and Straight, the four-times-married director had the upper hand: \"Paddy, please, I know more about divorce than you!\" Finch, who had suffered from heart problems for many years, became physically and psychologically exhausted by the demands of playing Beale.</p><p>There was some concern that the combination of Holden and Dunaway might create conflict on the set, since the two had sparred during an earlier co-starring stint in The Towering Inferno. According to biographer Bob Thomas, Holden had been incensed by Dunaway's behavior during the filming of the disaster epic, especially her habit of leaving him fuming on the set while she attended to her hair, makeup and telephone calls. One day, after a two-hour wait, Holden reportedly grabbed Dunaway by the shoulders, pushed her against a soundstage wall and snapped, \"You do that to me once more, and I'll push you through that wall!\"</p><p>Lumet and cinematographer Owen Roizman worked out a complicated lighting scheme that in Lumet's words would \"corrupt the camera\". Lumet recalled: \"We started with an almost naturalistic look. For the first scene between Peter Finch and Bill Holden, on Sixth Avenue at night, we added only enough light to get an exposure. As the movie progressed, camera setups became more rigid, more formal. The lighting became more and more artificial. The next-to-final scene—where Faye Dunaway, Robert Duvall, and the three network gray suits decide to kill Peter Finch—is lit like a commercial. The camera setups are static and framed like still pictures. The camera had also become a victim of television.\"</p><br/><h3>Release</h3><p>The film premiered in New York City on November 27, 1976, and went into wide release shortly afterward.</p><h4>Critical reception</h4><p>Network opened to acclaim from critics, and became one of the big hits of 1976–77. Vincent Canby, in his November 1976 review of the film for The New York Times, called the film \"outrageous ... brilliantly, cruelly funny, a topical American comedy that confirms Paddy Chayefsky's position as a major new American satirist\" and a film whose \"wickedly distorted views of the way television looks, sounds, and, indeed, is, are the satirist's cardiogram of the hidden heart, not just of television but also of the society that supports it and is, in turn, supported.\" Gene Siskel of the Chicago Tribune gave the film four stars out of four, calling it \"a very funny movie that takes an easy target and giddily beats it to death.\" Charles Champlin of the Los Angeles Times put the film on his list of the 10 best of the year.</p><p>In a review of the film written after it received its Academy Awards, Roger Ebert called it a \"supremely well-acted, intelligent film that tries for too much, that attacks not only television but also most of the other ills of the 1970s,\" though \"what it does accomplish is done so well, is seen so sharply, is presented so unforgivingly, that Network will outlive a lot of tidier movies.\" Seeing it a quarter-century later, Ebert added the film to his Great Movies list and said the film was \"like prophecy. When Chayefsky created Howard Beale, could he have imagined Jerry Springer, Howard Stern, and the World Wrestling Federation?\"; he credits Lumet and Chayefsky for knowing \"just when to pull out all the stops.\"</p><p>Not all reviews were positive: Pauline Kael in The New Yorker, in a review subtitled \"Hot Air\", criticized the film's abundance of long, preachy speeches; Chayefsky's self-righteous contempt for not only television itself but also television viewers; and the fact that almost everyone in the movie, particularly Robert Duvall, has a shouting rant: \"The cast of this messianic farce takes turns yelling at us soulless masses.\" Gary Arnold of The Washington Post declared that \"the movie is too sternly, monotonously preachy for either persuasion or casual amusement.\" Michael Billington wrote, \"Too much of this film has the hectoring stridency of tabloid headlines\", while Chris Petit in Time Out described it as \"slick, 'adult', self-congratulatory, and almost entirely hollow\", adding that \"most of the interest comes in watching such a lavishly mounted vehicle leaving the rails so spectacularly.\"</p><p>On Rotten Tomatoes the film has an approval rating of 92% based on 73 reviews, with an average rating of 8.50/10. The site's critics consensus states, \"Driven by populist fury and elevated by strong direction, powerful acting, and an intelligent script, Network's searing satire of ratings-driven news remains sadly relevant more than four decades later.\" On Metacritic it has a weighted average score of 83 out of 100, based on 16 critics, indicating \"universal acclaim\".</p><br/><h3>Legacy</h3><p>Screenwriter Aaron Sorkin wrote that \"no predictor of the future—not even Orwell—has ever been as right as Chayefsky was when he wrote Network.\" The film ranks at number 100 in Empire magazine's list of the 500 Greatest Films of All Time.</p><h4>In popular culture</h4><p>The film's catchphrase \"I'm as mad as hell, and I'm not going to take this anymore!\" and its derivatives have been referenced in a variety of media.</p><p>\"Telecide\", the last song on The Tubes' 1979 album Remote Control references the \"mad as hell\" line specifically and the film's themes more broadly.</p><p>In the 1989 comedy UHF, also set in a failing TV station looking for a ratings breakthrough, janitor Stanley Spadowski (Michael Richards) becomes a star and catapults the TV station to great success after his on-air improvisation of a rant about his mop that crescendos with his exhortation to \"stand right up\" and \"run to a window and say, 'Hey, these floors are dirty as hell and I'm not gonna take it anymore!\"</p><p>Arthur Jensen's speech to Beale is extensively sampled in \"America Number One\" by Consolidated (1990) and \"Corporate Slave\" by Snog (1992).</p><p>The \"Mad as Hell\" monologue is sampled in the 2009 track \"Recession\" by Dutch hardstyle artist The Prophet, post-rock group Maybeshewill's song \"Not for Want of Trying\" on their album of the same name (2008), English speaking French rap duo Chill Bump's intro to their award-winning song \"Life Has Value\" from their 2012 release Hidden Strings, in the song \"Lullaby\" by Scottish singer/songwriter Gerry Cinnamon on his debut album Erratic Cinematic (2017), in the song \"I Am The Night\" from Perturbator's second album I Am the Night (2013), and in the song \"Dice of a Generation\" by artist DEMONDICE on her album \"American Saikoro\" (2018).</p><p>The first Animaniacs episode \"De-Zanitized\" (1993) spoofs the conference scene with Beale and Arthur Jensen.</p><p>Spike Lee's film Bamboozled (2000) parallels and references \"Network\" in its exploration of race and cynicism in television and popular culture.</p><p>In the first episode of Studio 60 on the Sunset Strip (2006), a character's on-air breakdown is compared to that of Beale by news reporters.</p><p>In Episode 15 of Season 4 of Boston Legal (2007), \"Tabloid Nation\", a lawyer character uses the film as evidence in his closing arguments to prove how debased modern American TV culture has become.</p><p>Mad As Hell, a satirical Australian news show starring Shaun Micallef which began in 2012, takes its title from Finch's monologue; the various different incarnations of the opening sequence all feature visual references to the sequence of viewers yelling from their windows into the street.</p><p>The 2014 documentary film Mad as Hell, about the news series The Young Turks, takes its title from the monologue.</p><p>In Better Call Saul's first episode \"Uno\" (2015), Jimmy McGill quotes part of Jensen's diatribe when he is lambasting the board of his brother's law firm, addressing Howard Hamlin, then tells his confused audience that his quote came from Network. The same camera angle is employed in both instances.</p><br/><h3>Stage adaptation</h3><p>A stage adaptation by Lee Hall premiered in the Lyttleton Theatre at the National Theatre in London in November 2017. The play was directed by Ivo Van Hove featuring Bryan Cranston making his UK stage debut as Howard Beale, and Michelle Dockery as Diana. It opened on Broadway on December 6, 2018, with Cranston reprising his role as Beale, and with Tatiana Maslany as Diana and Tony Goldwyn as Max Schumacher.</p><br/><h3>Awards and honors</h3><p>At the Academy Awards, Network won three of the four acting awards. As of 2023, it is the second of only three films which have accomplished this feat, preceded by A Streetcar Named Desire (1951) and followed by Everything Everywhere All at Once (2022).</p><p>Peter Finch died before the 1977 ceremony and was the only performer to win a posthumous acting Academy Award (until 2009 when Heath Ledger won Best Supporting Actor). The statuette itself was collected by Finch's widow, Eletha Finch, after Chayefsky invited her onstage.</p><p>Beatrice Straight's performance as Louise Schumacher occupied only five minutes and two seconds of screen time, making it the shortest performance to win an Oscar as of 2022 (breaking Gloria Grahame's nine minute and 32 second screen time record for The Bad and the Beautiful in 1953).</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Howard Gottfried</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td><span>Sidney Lumet</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Actor</span></td><td><span>Peter Finch</span> <small><b>(posthumous award)</b></small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>William Holden</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td><span>Faye Dunaway</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Ned Beatty</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Beatrice Straight</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Written Directly for the Screen</span></td><td><span>Paddy Chayefsky</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Owen Roizman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td rowspan=\"2\"><span>Alan Heim</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"9\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td><i>Network</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Direction</span></td><td>Sidney Lumet</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Best Actor in a Leading Role</span></td><td>Peter Finch <small><b>(posthumous award)</b></small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>William Holden</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td>Faye Dunaway</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td><span>Robert Duvall</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Paddy Chayefsky</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Alan Heim</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td>Jack Fitzstephens, Marc Laub, Sanford Rackow, James Sabat and <span>Dick Vorisek</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>David di Donatello Awards</span></td><td><span>Best Foreign Actress</span></td><td>Faye Dunaway</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Sidney Lumet</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Peter Finch <small><b>(posthumous award)</b></small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Motion Picture – Drama</span></td><td>Faye Dunaway</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Sidney Lumet</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Paddy Chayefsky</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Japan Academy Film Prize</span></td><td colspan=\"2\"><span>Outstanding Foreign Language Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Kansas City Film Critics Circle Awards</td><td>Best Actress</td><td>Faye Dunaway</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Los Angeles Film Critics Association Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Sidney Lumet</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Paddy Chayefsky</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"4\"><span>National Society of Film Critics Awards</span></td><td><span>Best Actor</span></td><td>William Holden</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td><span>Best Actress</span></td><td>Faye Dunaway</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Robert Duvall</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td><span>Best Screenplay</span></td><td>Paddy Chayefsky</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td><span>Best Actress</span></td><td>Faye Dunaway</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td><span>Best Screenplay</span></td><td>Paddy Chayefsky</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Producers Guild of America Awards</span></td><td colspan=\"2\">PGA Hall of Fame – Motion Pictures</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Saturn Awards</span></td><td colspan=\"2\"><span>Best Science Fiction Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Drama – Written Directly for the Screen</span></td><td>Paddy Chayefsky</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><h4>American Film Institute</h4><ul><li>AFI's 100 Years...100 Movies – #66</li><li>AFI's 100 Years...100 Laughs – Nominated</li><li>AFI's 100 Years...100 Heroes & Villains: Diana Christensen – Nominated Villain</li><li>Diana Christensen – Nominated Villain</li><li>AFI's 100 Years...100 Movie Quotes: \"I'm as mad as hell, and I'm not going to take this anymore!\" – #19</li><li>\"I'm as mad as hell, and I'm not going to take this anymore!\" – #19</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) – #64</li></ul><br/><h3>Notes</h3><p></p><br/>"
  },
  "errorMessage": ""
}