{
  "imDbId": "tt0046438",
  "title": "Tokyo Story",
  "fullTitle": "Tokyo Story (1953)",
  "type": "Movie",
  "year": "1953",
  "items": [
    {
      "username": "EUyeshima",
      "userUrl": "https://www.imdb.com/user/ur3608743",
      "reviewLink": "https://www.imdb.com/review/rw1237040",
      "warningSpoilers": false,
      "date": "12 December 2005",
      "rate": "10",
      "helpful": "216 out of 234 found this helpful.",
      "title": "Ozu's Quietly Brilliant Masterpiece Deserves Your Attention",
      "content": "I think this movie is amazing for reasons I was not expecting. I had heard of Yasujiro Ozu's \"Tokyo Story\" for several years but never had an opportunity to see it until Criterion resuscitated it as part of their DVD collection. Over fifty years old, this wondrous 1953 film resonates just as deeply today. Those outside Japan rarely get to see a Japanese film classic that doesn't involve samurai warriors in medieval battles. This one, however, is a subtly observed family drama set in post-WWII Japan, and it is the quietude and lack of pretense of Ozu's film-making style that makes this among the most moving of films.The plot centers on Shukishi and Tomi, an elderly couple, who traverse the country from their southern fishing village of Onomichi to visit their adult children, daughter Shige and son Koichi, in Tokyo. Leading their own busy lives, the children realize their obligation to entertain them and pack them off to Atami, a nearby resort targeted to weekend revelers. Returning to Tokyo unexpectedly, Tomi visits their kindly daughter-in-law, Noriko, the widow of second son Shoji, while Shukishi gets drunk with some old companions. The old couple realizes they have become a burden to their children and decide to return to Onomichi. They also have a younger daughter Kyoko, a schoolteacher who lives with them, and younger son Keizo works for the train company in Osaka. By now the children, except for Kyoko and the dutiful Noriko, have given up on their parents, even when Tomi takes ill in Osaka on the way back home. From this seemingly convoluted, trivial-sounding storyline, fraught with soap opera possibilities, Ozu has fashioned a heartfelt and ultimately ironic film that focuses on the details in people's lives rather than a single dramatic situation.What fascinates me about Ozu's idiosyncratic style is how he relies on insinuation to carry his story forward. In fact, some of the more critical events happen off-camera because Ozu's simple, penetrating observations of these characters' lives remain powerfully insightful without being contrived. Ozu scholar David Desser, who provides insightful commentary on the alternate audio track, explains this concept as \"narrative ellipses\", Ozu's singularly effective means of providing emotional continuity to a story without providing all the predictable detail in between. Ozu also positions his camera low throughout his film to replicate the perspective of someone sitting on a tatami mat. It adds significantly to the humanity he evokes. There are no melodramatic confrontations among the characters, no masochistic showboating, and the dialogue is deceptively casual, as even the most off-hand remark bears weight into the story. The film condemns no one and its sense of inevitability carries with it only certain resigned sadness. What amazes me most is how the ending is so cathartic because the characters feel so real to me, not because there are manipulative plot developments, even death, which force me to feel for them.I just love the performances, as they have a neo-realism that makes them all the more affecting. Chishu Ryu and Chieko Higashiyama are wonderfully authentic as Shukishi and Tomi, perfectly conveying the resignation they feel about their lives and their children without slipping into cheap sentimentality. Higashiyama effortlessly displays the sunny demeanor of a grandmother, so when sadness does take over in her life, it becomes all the more haunting. In particular, she has a beautiful scene where Tomi looks forlornly at her grandchild wondering what he will be when he grows up and whether she will live to see what happens. Even more heartbreaking is the scene where Shukishi and Tomi sit in Ueno Park realizing their children have no time for them and are resigned to the fact that they need to find a place to sleep for the night. The closest the film has to a villain is Shige, portrayed fearlessly by Haruko Sugimura, who is able to show respect, pettiness and conniving in a realistically mercurial fashion. Watch her as she complains about the expensive cakes her husband bought for her parents (as she selfishly eats them herself) or how she finagles Koichi to co-finance the trip to Atami or how she shows her frustration when her parents come home early from the spa. So Yamamura (familiar to later Western audiences as Admiral Yamamoto in \"Tora! Tora! Tora!\") displays the right amount of indifference as Koichi, and Kyoko Kagawa has a few sharp lines toward the end of the film as the disappointed Kyoko.But the best performance comes from the legendary Setsuko Hara, a luminous actress whose beauty and sensitivity remind me of Olivia de Havilland during the same era. As Noriko, she is breathtaking in showing her character's modesty, her unforced generosity in spite of her downscale status and her constant smile as a mask for her pain. She has a number of deeply affecting moments, for instance, when Noriko explains to Shukishi and Tomi how she misses her husband, even though it is implied he was a brutalizing alcoholic; or the touching goodbye to Kyoko; or her pained embarrassment over the high esteem that Shukishi holds for her kindness. Don't expect fireworks or any shocking moments, just a powerfully emotional film in spite of its seemingly modest approach. The two-disc DVD set has the commentary from Desser on the first disc, as well as the trailer. On the second disc, there are two excellent documentaries. One is a comprehensive 1983, two-hour feature focused on Ozu's life and career, and the second is a 40-minute tribute from several international movie directors."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw0050722",
      "warningSpoilers": true,
      "date": "22 March 2004",
      "rate": "9",
      "helpful": "76 out of 87 found this helpful.",
      "title": "Universal appeal of Tokyo Story",
      "content": "As with every great work, the film has its own unique perfection in style, rhythm, details, and artist's vision - but Tokyo Story is very universal in its appeal - it is for every parent, every son or daughter - for everyone. It was made 50 years ago in Japan, about people who lived far away, but it is also about all of us, our families, our problems, our guilt and our search for love and meaning.Ozu's film does not require one to be a movie buff or to try to solve complex symbolism to appreciate and love it. It brings smiles because it is a comedy (for at least the first 2/3) and sadness with a high drama of the last 1/3 of the film.Yasujiro Ozu's quiet and deceptively simple film tells a story of an elderly couple who travel to Tokyo to see their grown up children and their families - son, daughter and daughter-in-law who is a widow of their middle son that was killed during the World War II. Their children love them, of course but they are too busy with their own lives and jobs to spend much time with them. Their young grandchildren don't know them and not too eager to try to know their grandparents better. Only the widowed daughter-in-law is the one who is really happy with their arrival and tries to make their visit pleasurable. After parents return home, children receive a telegram with the sad news that the mother became critically ill. Now it is their turn to make a journey.Ozu does not judge anybody, but beneath the quiet politeness, smiles, and soft voices there is a sad, inevitable, and powerful alienation of generations in the modern world of big cities. The simple family melodrama has been told with intensity, humanity, and honesty of character.P.S. The first thing I wanted to do after I finished watching this film was to pick up the phone and call my mom. Just to hear her voice."
    },
    {
      "username": "851222",
      "userUrl": "https://www.imdb.com/user/ur4405474",
      "reviewLink": "https://www.imdb.com/review/rw4263930",
      "warningSpoilers": false,
      "date": "1 August 2018",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Great movie",
      "content": "Greetings from Lithuania.\"Tokyo Story\" (1953) is an ageless story about family, love and realizing of true values in life. This is a sad but at the same time inspiring story - but enough about stories - this movie shows life as it is - still. I loved the performances in this movie by simply everyone involved, as well as great directing and amazing writing. Although the movie is 2 h 15 min long and its a black and white \"old\" movie don't be fooled - this is a great movie that makes you think about your life and especially the people you love and that you have to love them while their are still here with you, because life is very short and better make most of it with the people you love. Great movie."
    },
    {
      "username": "GyatsoLa",
      "userUrl": "https://www.imdb.com/user/ur14908520",
      "reviewLink": "https://www.imdb.com/review/rw1633160",
      "warningSpoilers": false,
      "date": "8 April 2007",
      "rate": "10",
      "helpful": "117 out of 128 found this helpful.",
      "title": "A cinema of tears",
      "content": "I can vividly remember the first time i saw this movie - it was during a festival of Japanese movies in an art house cinema here in Dublin. I must admit to never having heard of Ozu before, i went out of boredom and casual curiosity. I was embarrassed at the end to find myself in tears. I quickly wiped them away in that subtle way guys do when they don't want anyone to know, and got out to leave. What struck me was that even as the credits were finishing, I was one of the first to go. As i walked up the aisle I realized that most of the nearly full cinema was still sitting quietly, without the usual post movie chatter - and more than half of the audience had tears pouring down their faces. I have never, ever witnessed that in a cinema.Since then, i've watched it on DVD, and had to think a lot about why such a simple movie is so powerful, and so many people rate it as one of the greatest ever. And why i find myself agreeing with that rating, i truly think it is in the top 10 ever made - certainly the top 5 of any I've seen. But its hard at first to know why. It doesn't have the greatest script of any movie, there are few things in it that are truly original. The acting is great, but not the greatest ever seen, and the technical qualities are just average. I've come to the conclusion that the reason for its greatness is that it comes closest to pure art in cinema. By pure art, i mean art that in its simplicity but technical genius still reveals deep truths about our lives. When i think about Tokyo Story I don't find myself comparing it to other movies, instead I think of a Rembrandt self portrait, a Vermeer painting, or my favourite short story, 'The Dead' by James Joyce. It is simple, unadorned, and deeply wise. I realise in writing this I'm rapidly approaching pseuds corner, but this is my genuine conclusion (writing as someone who is shamefully uneducated in most of the arts).Of course there have been many great movies about families, about growing old, about the nature of life.... but I think somehow Ozu achieved a sort of perfection with Tokyo Story. Thats why its the only movie I would give a '10' to."
    },
    {
      "username": "howard.schumann",
      "userUrl": "https://www.imdb.com/user/ur0491610",
      "reviewLink": "https://www.imdb.com/review/rw0050710",
      "warningSpoilers": true,
      "date": "21 April 2003",
      "rate": "",
      "helpful": "57 out of 69 found this helpful.",
      "title": "Things are the way that they are and it is perfect",
      "content": "Ozu's Tokyo Story is a serene and contemplative look at the breakdown in the relationship between grown children and their elderly parents shortly after World War II. The film concerns itself with problems many of us must face: the struggle to maintain a self-fulfilling life independent of parental expectations, the changes in relationships wrought by time, and the inevitability of separation and loss. Ozu does not point the finger at either parents or children but, like many of his films, offers a thoughtful meditation on the transitory nature of life.As the film opens, we see an empty street, empty train tracks and an empty pier, perhaps an early indicator of the sense of loss that pervades the film. An elderly father, Shukishi Hirayama (Chishu Ryu) and his wife Tomi (Chieko Higashiyama) are preparing to travel by train to visit their children in Tokyo. When they arrive, they are met with indifference by daughter Shige (Haruko Sugimura), their grandchildren Minoru (Zen Murase) and Isamu (Mitsuhiro Mori), and son Koichi (So Yamamura), a Tokyo pediatrician. When Koichi is called to visit a patient and Shige cannot leave her beauty salon, the Harayamas postpone a sightseeing trip and start to complain that they expected the children would be living in more comfortable circumstances. Their widowed daughter-in-law Noriko (Setsuko Hara), however, welcomes them warmly and gives them the experience of being appreciated.To give themselves some breathing room, the children pool their resources and send their parents to Atami, a health spa. Their visit, however, is cut short when the noise and crowds make going home seem like a better alternative. When they get back to Tokyo, Shige tells them she has a meeting scheduled at her house and Tomi decides to spend the night with Noriko. Shukishi, in a very humorous scene, goes out drinking with old friends and shows up late at night at Shige's house completely drunk. When the elderly parents return to Onomichi, the mother suddenly becomes very ill and the entire family, including youngest son Keizo from Osaka, must come and visit them. The moment of epiphany comes when the youngest daughter Kyoko (Kyoko Kagawa) asks Noriko whether or not life is disappointing. Her answer mirrors Ozu's concept of mono no aware, that we cannot avoid the sadness of life, but her beaming face tells us that things are just the way that they are and that it is perfect."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2764245",
      "warningSpoilers": false,
      "date": "8 March 2013",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Beautiful and deeply moving",
      "content": "Why did it take so long for me to see this film? I don't know why that is, other than being behind with my movie watching due to studying, and I am still kicking myself because Tokyo Story was one of the best films I've seen in quite some time. I haven't seen enough of Yasujiro Ozu's work to judge him as an overall director, but seeing Tokyo Story it is very easy to see why anybody would consider it one of his finest achievements or him as a master film-maker. Tokyo Story is beautifully shot, everything looks homely and evocative and the shots, frame and cinematography are done to perfection. And Ozu directs very sensitively and assuredly, it is said that he specialised in middle-class family melodramas and I have no trouble believing that. The story is quiet and meditatively paced but never bored me, because every bit of writing, family scene and character was dealt with in such a poignant and intelligent manner. Tokyo Story is also helped by some truly wonderful acting. Setsuko Hara just epitomises gentle kindness, making us warm to Noriko easily, while Chishu Ryu and Chieko Higashiyama play their roles with nuanced and affecting dignity. In conclusion, a beautiful and deeply moving film in all respects. 10/10 Bethany Cox"
    },
    {
      "username": "KFL",
      "userUrl": "https://www.imdb.com/user/ur0075285",
      "reviewLink": "https://www.imdb.com/review/rw0050706",
      "warningSpoilers": false,
      "date": "14 May 2002",
      "rate": "9",
      "helpful": "119 out of 136 found this helpful.",
      "title": "The excuses we make to justify our neglect of others",
      "content": "An appreciation of this movie may demand some understanding of Japanese culture. The Japanese are rather reserved, and were even more reserved back in the early 1950's, when this film is set. No embracing, even of parents, children, siblings; no dramatic histrionics; even a death scene in this movie is much quieter than a Westerner might expect.Consequently I can't really blame several reviewers here for calling this movie boring and slow-paced. But it is not at all slow-paced from a different cultural perspective. It just depends on what you're used to.If you do take the time to watch and try to understand it, you'll find an engrossing analysis of the dynamic of a middle-class family, the rift that grows up between generations, and of the many excuses we find ourselves making to justify our neglect for others, even those dearest to us. These themes are universal, but are couched in a postwar Japanese idiom, and so probably less accessible to the average Western viewer.I have wondered awhile about a speech at the end by Noriko, the widowed daughter-in-law, in which she denies that she's such a good person (though her actions in the movie indicate otherwise). I'm still not sure I understand her motives in saying this. For the most part, however, this movie will not leave you puzzled, but it may leave you a bit wiser, and a bit more reluctant to make those excuses."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw6278761",
      "warningSpoilers": false,
      "date": "16 November 2020",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Just Too Real",
      "content": "An elderly Japanese couple come to Tokyo to visit children and grandchildren. From the beginning, we get a sense that they are looked at as a nuisance, even though they have not seen their family for years. While they visit, the children are hard pressed to take a little time for them. We see that they have settled into their lives (rather depressing lives) and into themselves. The kindest person is a young woman who the widow of one of the sons. She is kind an compassionate. True, not a lot happens, but as we go through the two hours, it is painful how tense things are and what an edge there is. I've seen these kinds of relationships in my extended family and in the families of others. This is a very well constructed film."
    },
    {
      "username": "Cheesedemon28",
      "userUrl": "https://www.imdb.com/user/ur2913139",
      "reviewLink": "https://www.imdb.com/review/rw0050725",
      "warningSpoilers": false,
      "date": "8 May 2004",
      "rate": "10",
      "helpful": "90 out of 108 found this helpful.",
      "title": "\"Isn't Life Depressing?\"",
      "content": "Two women are sitting on tatami mats. They are smiling and talking. One ofthem says, \"Isn't life depressing?\" Wow... that pretty much says it.Tokyo Story is defenitely one of the finest movies ever made. Easy. I don't care what anyone says: slow or not, this is one of Ozu's finest films. Very few movies have made my cry, but I did indeed weep at this movie. All of the actingperformances are very believeable, especially Hara's. The interesting knee- level tatami cinematography suits the film perfectly. Even the music isimpeccable. What really gets me with Tokyo Story is how stunningly realistic it is. From the dialogue to the story, everything feels like real life. No matter what language you speak, what culture or country you hail from, this element is universal.It's pretty much perfect... every character is fleshed out, there are no plot holes left open... I can't find anything to complain about it! 50 years after its release and it's still very contemporary... damn. I give it **** out of ****."
    },
    {
      "username": "Stroheim-3",
      "userUrl": "https://www.imdb.com/user/ur0274689",
      "reviewLink": "https://www.imdb.com/review/rw0050699",
      "warningSpoilers": false,
      "date": "27 October 1999",
      "rate": "10",
      "helpful": "68 out of 82 found this helpful.",
      "title": "FANTASTIC",
      "content": "I need to say this: THIS MOVIE IS ABSOLUTELY FANTASTIC!!! Sure it starts off slowly, but the fact of the matter is the film is a great story of a family and the alienation associated with aging. This is the kind of movie that will make you reflect upon your own family and how you treat them.I had never seen an Ozu film before, but now I feel as if I must see them all. His use of cinematic space is incredible. He breaks all sorts of conventions with his cinematography such as violating the axis of action. This gives the viewer the sense of a large, open, unrestricted world.Going with this realism, the characters seem real; not for a moment did I see the people on the screen as actors. They were the family, and you as the viewer feels what they feel. Part of this comes from the use of head-on-shots such that the characters are speaking TO you.It is a fantastic, moving piece of work and arguably one of the best films ever made."
    },
    {
      "username": "bobbie-16",
      "userUrl": "https://www.imdb.com/user/ur1479234",
      "reviewLink": "https://www.imdb.com/review/rw0050707",
      "warningSpoilers": false,
      "date": "17 June 2002",
      "rate": "10",
      "helpful": "33 out of 39 found this helpful.",
      "title": "beautiful meditation on old age and family; simple and moving",
      "content": "I can't take my mind off this movie. The story is both universally human (old age, the end of life, parents and children) and specifically Japanese. The movie tells the viewer so much about Japanese middle class life in the 1950s: eating and sleeping; mourning the war dead; clothes and home furnishings; spoiled kids; a doctor's office; a schoolroom; life in Tokyo and small towns; how family members talk to each other; old men's drinking habits; a resort hotel. But while we see all these details of a real time and place, we are constantly drawn into reflection on the meaning of human life and relationships. The reflection emerges effortlessly from the simple narrative and the specifics. The director never annoyingly tells us how to feel, he is not preaching and not drawing attention to himself. (There is none of that \"hey, I'm making a moving movie\" crud that you get in Hollywood treatment of these topics). He just lets the story unfold in a quiet, natural way. It's not for folks who only like \"action\" movies. I put \"action\" in quotes because this movie is about the real action in life--enjoying life, sharing it with others, facing the end of it."
    },
    {
      "username": "spqrclaudius",
      "userUrl": "https://www.imdb.com/user/ur2653831",
      "reviewLink": "https://www.imdb.com/review/rw0050726",
      "warningSpoilers": false,
      "date": "14 July 2004",
      "rate": "10",
      "helpful": "95 out of 109 found this helpful.",
      "title": "Extraordinary Portrayal of Real Life",
      "content": "A fantastic film that belies the simplicity of its plot, Tokyo Story is the tale of a vacation gone sadly awry, with an elderly man and woman visiting from the countryside pushed to the sidelines by their busy children in the city. The younger generation (and by extension the \"new\" Japan) turns its back on the family from which it arose- because of selfishness, because of necessity, or because it's simply the way of the world. The movie provides no easy answers- its melancholy ambiguity is part of its charm. Whatever the case, Ozu delights in portraying the details of everyday life. The emotional resonances of this movie are extraordinary, and some shots (a child picking flowers, an old couple framed by the sea, a woman sitting forlornly at her work desk) are enough to give a sensitive film-goer the shivers. Despite the testimony of some critics, the film is not totally devoid of melodramatic elements (some stock characters and cloying musical motifs spring readily to mind), but the film is founded upon such an obvious love and respect for the importance of real-world interactions that it's hard not to be anything other than enthralled by it."
    },
    {
      "username": "ghmcal",
      "userUrl": "https://www.imdb.com/user/ur4138535",
      "reviewLink": "https://www.imdb.com/review/rw0951103",
      "warningSpoilers": true,
      "date": "24 October 2004",
      "rate": "",
      "helpful": "178 out of 205 found this helpful.",
      "title": "Too subtle and yet too obvious",
      "content": "This film is commonly called one of the masterpieces of international film. Indeed, a well-known \"intro to film\" textbook uses it as a case study in notable film-making. But, as more than one reviewer so far has pointed out, 'Tokyo Story' is slow, obscure, and sometimes seemingly sterile. Understanding how a great classic could be seemingly soulless requires some study - of Japanese culture, as others have pointed out, of film technique, and of ourselves. Fortunately, that understanding more than fully repays itself, as is true of any great piece of art.I should begin by warning the first time viewer that the film is not in any familiar style. Other reviewers have mentioned the camera, the angles, the acting, the elision - I hardly need dwell on these. Those used to Hollywood films of almost any era will find 'Tokyo Story' odd and unsettling, just because the style is so different. And of course the culture is radically different. In this forum one can hardly even begin to discuss the way that Japanese fathers discuss their children amongst themselves, or the marriage culture of 1950s Japan. But I think the film is great even if one has no understanding of continuity editing, or post-war Japan, or a dozen other obscure topics. This is, after all, the central feature of great art: Even those of us who do not fully understand still realize, in some unspeakable way, that we are in the presence of something great.The most common accusations leveled against this film, oddly, assert alternatively that it is a cold, soulless exercise in technique or, on the other hand, that it is a soap opera, with no real substance. I think neither of those is true. There can be no question that it is easily seen as cold. Nothing really happens, by modern standards. It is merely a family that comes and goes and lives and dies. Of course, to those who accuse it of being a soap opera, that death is the foremost evidence of its manipulative guilt. But, for those who have seen it, recall the mother's stroke, or where Keizo is told to look one last time - would a soap opera elide such a supremely emotional scenes?No, 'Tokyo Story' is neither cold nor manipulative. Rather, it slowly brings you into a family that, while perhaps totally unlike your own, is at its base just the same. Then it allows those things to happen that must someday happen to all of us - growing up, moving away, and that unspeakable, inescapable end. It is not easy; it is not obvious; but it is not obscure, either. After it all, I can only tell you this: If you have lived long enough to know how it feels to leave your parents and only realize far too late, as it seems we all do, the value of what you have left behind, then 'Tokyo Story' will reward you perfectly. And these things - we all do these very things, so 'Tokyo Story' is universal, is Art."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2999262",
      "warningSpoilers": false,
      "date": "16 April 2014",
      "rate": "7",
      "helpful": "10 out of 15 found this helpful.",
      "title": "A Movie to Make You Think about Parents' Seniority and Children Indifference and Selfishness",
      "content": "In Onomichi, Hiroshima, the retired Shukishi Hirayama (Chishû Ryû) and his wife Tomi Hirayama (Chieko Higashiyama) live with their single daughter, the teacher Kyôko (Kyôko Kagawa). They decide to travel in a long voyage by train to Tokyo to visit their children, the doctor Koichi Hirayama (Sô Yamamura) and the hairdresser Shige Kaneko (Haruko Sugimura). However, Koichi and Shige can not afford time to spend with their parents but the widow sister-in-law Noriko Hirayama (Setsuko Hara) gives attention to them and go on sightseeing through Tokyo with the old couple. Shukishi and Tomi note that their children do not have time for them and they decide to return to Onomichi. Along their trip, Tomi does not feel well and they stop in Osaka to visit their son Keizo Hirayama (Shirô Osaka). Soon each son and daughter receives a telegram from Onomichi with sad news.\"Tôkyô monogatari\" is a sad story of family indifference, selfishness and farewell directed by Yasujirô Ozu using his traditional style with a steady camera and centralized filming. This movie makes the viewer thinks about parents' seniority and children indifference and selfishness that cannot spend time with them. Makes also think how short life is and how soon the son or daughter will become the old parent that he or she neglected. My vote is seven.Title (Brazil): \"Era Uma Vez em Tóquio\" (\"Once Upon a Time in Tokyo\")"
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0050695",
      "warningSpoilers": true,
      "date": "21 December 2001",
      "rate": "7",
      "helpful": "33 out of 60 found this helpful.",
      "title": "From the If-It's-Boring-It-Must-Be-A-Masterpiece school of filmmaking",
      "content": "SPOILERSUnfortunately, I'm from the If-It-Doesn't-Move,-Poke-It-With-A-Stick school of film criticism. No, I'm just kidding. I like a lot of slow-moving movies. No, Tokyo Story has problems up the wazoo. It's not that it's a bad movie, either. I actually liked it, marginally. 7/10, for sure. I do feel that it's vastly overrated - about as overrated as movies come. It's very often considered one of the ten best films ever made. Personally, I don't think Yasujiro Ozu gives human existence enough credit. Life is never this uninteresting, nor are people. I have lost family recently, and I could relate stories about funerals that have such enormous depth that they would blow this thing away.I've heard so much about the amazing restraint of Ozu's style that I really just have to question it. I have seen one other Ozu film - Bakushu is its Japanese name; I can't remember whether it's Late or Early Spring. It was boring, too, but interesting culturally. It really was stale, with almost no movement whatsoever. Tokyo Story is clearly Ozu's most famous film, and, I have to say, the style here is not restrained at all. There are only two tracking shots in the whole film - that's what people usually point to when they're looking for stylistic techniques to point out. One person I've talked to said: \"In Tokyo Story, there's only one tracking shot [sic], and it cuts like a knife.\" I'd say that the one he's talking about does add to the poignancy a little, and so does the one he forgot. It didn't, however, affect me greatly. In fact, only a couple of individual shots touched me at all. As for the rest of Ozu, he does position his camera lower to the ground than probably any other director - a technique that isn't really very noticeable. Otherwise, it's not too much different from Hollywood. In fact, most Hollywood films of the era have limited or no tracking shots just based on their budgets. The editing patterns are almost identical to anything you'd find anywhere else, except for this odd and annoying type of cross-cutting that pops up whenever two people converse. I don't get that; it's really choppy, rather jarring for a movie that seems to want to be so realistic.And that's where I think this film's critical prominence lies, in its realism. I don't understand it, but whenever any film tries to be realistic or naturalistic, critics and most film buffs develop a raging erection. I know what real life is like, and I'd much rather see it exaggerated. To tell you the truth, as I said above, I don't think Ozu is presenting real life in Tokyo Story (or Bakushu). Real life has much more drama than this film. This is doing the opposite of hyperbolizing; it's minimizing real life. In real life, when a family meets around the dinner table, as the family does at the end of this film, there're a million circumstances effecting the outcome of that meal. Not so in this film. Ozu reduces them to types: the nice old couple, the too-busy adults, the selfish wife, the compassionate widow, etc. They do have character. I wouldn't want to undermine that too much. But in real life, they'd be so much more complex and interesting. I suggest that you attend a relative stranger's Christmas dinner, as a ghost, if necessary. It would be infinitely more complex.I do have to give the film credit for the complex issues that it raises. Its main themes have to deal with the callousness of the adult generation, and the disappointment in the elderly generation. It deals with these themes well whenever it gets around to dealing with them. A more brilliant writer would have had more with the grandchildren, but Ozu is content to have just a bit of it at the beginning. But, really, what does he bring out in the film that you didn't know already? I have a feeling that the same people who love this movie are right at the moment as I write this (12/19/2001) apprehensive about their parents or in-laws showing up for Christmas, and will breathe a sigh of relief when they leave. And I bet those same people will watch this movie when they're older and say, \"Hey, my kids are just like those a**holes!\"There are better movies about aging out there. Check out the Icelandic film Children of Nature, about an old man whose family is so annoyed at his presence in their home that they quickly move him to a nursing home, where he meets his high school sweetheart. They had been forced out of their homes in a more inhospitable part of the island years before, and together they conspire to go back there and die. Tokyo Story fans will certainly hate it, for the mere fact that it is, well, entertaining and fantastical. Another one I like a lot is by the Ozu-enthusiast's greatest enemy - the dreaded Akira Kurosawa, who often delivered amusing quips against Ozu when he was interviewed by the press; he thought Ozu was a bore, too. The film is Rhapsody in August, and I can hear the laughter already from the Ozu sector. I promise you all that that film will become more beloved and important as the years go on. Right now, it is in critical limbo for the silliest reason: Richard Gere is in the movie for about 15 minute. And it's actually one of his best performances, if you'd just give him a chance. That film is much better in dealing with the paradoxes of the three generations's relationships."
    },
    {
      "username": "elvircorhodzic",
      "userUrl": "https://www.imdb.com/user/ur65733095",
      "reviewLink": "https://www.imdb.com/review/rw3574030",
      "warningSpoilers": false,
      "date": "3 November 2016",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Life is simple and unique. That's very true.",
      "content": "TOKYO STORY is a film that has a moderate tone, unobtrusive style and quiet family story. An elderly couple from the provinces coming to Tokyo to visit their grown children. The story shows how the children, preoccupied with their daily lives, do not show enough care for their parents, as opposed to the former daughter-whose husband died in the war. At first glance, everything in this film seems simple and clear, but on the other hand is a sensitive topic and family discord, somewhat generational conflict with fairly deep emotions without excessive melodrama.Staff are interesting, a little strange, however, show sincere emotion without many words. Of course, you need to understand Japanese culture, which I somehow fascinated. The story can be identified three generations of which is the oldest in a harmonious relationship. Although it can be concluded that it is not always the case. The younger do not have time for yourself and not for others.Most people do not live. Survive. Understanding and tranquility in fact represent the fund in relation to the sentiment and satire. People consciously or unconsciously influence the lives of others. People woven in one's life are there, even when they are not physically present.Setsuko Hara as Noriko Hirayama really is a beauty. She plays a woman who has all the prerequisites that clearly says \"Life is disappointing\", but again full of mercy, kept calm and beautiful smile that does not come off from the face. Well, sometimes that smile accompanies large tear."
    },
    {
      "username": "Farzad-Doosti",
      "userUrl": "https://www.imdb.com/user/ur54838084",
      "reviewLink": "https://www.imdb.com/review/rw7176002",
      "warningSpoilers": false,
      "date": "29 July 2021",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Now that I am alone, I feel that the days are too long.",
      "content": "Japanese cinema is full of great and creative directors. From Kurosawa and Mizugochi to more modern filmmakers like Kobayashi and Nagisa Oshima and Shishihara. Yet Ozu, like a detached taffeta of them all, deserves the title of the most Japanese filmmaker in the history of cinema. A filmmaker who, if they show you a shot of a film you have not seen before, you will immediately know that it was made by artist Yasujiro Ozu.The Tokyo Story is one of the best films ever made and one of the most important works of art of the twentieth century. As an artist and, of course, a great teacher, Ozu slowly creates the structure of his masterpiece with his inherent camera and inherent calmness, so that the viewer suddenly finds himself in the middle of it without realizing it.\"The passage of irreversible moments\" Life is the field of our right and wrong choices, and the Tokyo Story is a small corner of this life and choices, and with all its beauties and ugliness, it is full of flips and lessons. Look at the Tokyo Story movie not as a fun movie but as a lasting impact on your life forever, so that we may pay a little more attention to what we have today that may not be tomorrow."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1116234",
      "warningSpoilers": false,
      "date": "1 July 2005",
      "rate": "8",
      "helpful": "14 out of 25 found this helpful.",
      "title": "exceptionally crafted but depressing",
      "content": "This is a marvelous movie with exceptional acting throughout. However, it is also INCREDIBLY bleak and sad, so be forewarned!!! The story begins with an older Japanese couple (grandma and grandpa) packing to go to Tokyo to see their grown son, daughter and daughter-in-law (whose husband, their 2nd son, was killed in the war). However, despite their letting everyone know they were coming, they are treated as inconveniences. The only one who showed them any consideration was the daughter-in-law. Particularly disgusting was their daughter, who ALWAYS told her husband to spend LESS on her parents, as they wouldn't know any better. Lovely kids, huh?! Anyways, after spending their time in Tokyo, they return to their hometown and grandma becomes deathly ill. You can probably guess where this is going. Despite all this, the grandparents continually say they've got good kids, even though they seem like selfish jerks."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3123385",
      "warningSpoilers": false,
      "date": "13 November 2014",
      "rate": "7",
      "helpful": "7 out of 11 found this helpful.",
      "title": "slow but mesmerizing",
      "content": "Elderly couple Shūkichi and Tomi Hirayama go to Tokyo to visit their children and their families. Their oldest son Kōichi has a family of four. Shige is married and runs a hair salon. Both of them are extremely busy and pay for expensive trips for their parents. Their daughter-in-law Noriko is widowed after the war. She is the most caring but mother Tomi notes a loneliness in Noriko's life. However Noriko is not feeling well.There is a quietness and stillness about the camera style. The characters sometimes talk directly into the camera which can be distracting. It's a naturalistic feel. These people feel real and their emotions have depth. It's a slow movie but it doesn't feel boring. It's kind of mesmerizing like watching a real family."
    },
    {
      "username": "harry_tk_yung",
      "userUrl": "https://www.imdb.com/user/ur1606763",
      "reviewLink": "https://www.imdb.com/review/rw0050692",
      "warningSpoilers": true,
      "date": "6 March 2003",
      "rate": "",
      "helpful": "8 out of 12 found this helpful.",
      "title": "A few observations",
      "content": "(some spoilers)Why would anyone want to write anything about a film released half a century ago? There are two most obvious reasons: (a) the author has only recently seen it and (b) the film is timeless, just as relevant today as when it was first released. In this case, it is both.Over the last half-century, Tokyo Story has found its way into the top ten list of numerous film critics. Much have been said about the reason why. What I'm trying to do here is just to make several observations, about things in this film that particularly strike me.One is on the scene at the Tokyo train terminal, when the old couple returns home after their visit in Tokyo. Most of us in today's world would have plenty of experience is saying farewell. Less of us would have experience in saying farewell to people whom we just may not see again. Still less of us (only those who have been around long enough) would have experience in saying farewell to people who expect that they may not see us again. Those of us in this last category would probably sense what I am referring to about the scene. The old women, in a completely matter-of-course manner, said to her children that now that they have had this reunion, if anything happens afterwards, they need not come (to the small town where the old couple lives). So plainly delivered, this line is one of the things that make Tokyo Story stand above other films with similar situations and similar dialogues.Another is a very haunting static image. Leading towards it is the part when the old couple's son, a very busy medical doctor, scraps the plan of a family outing. While the somewhat rebellious older grandson sulks, the grandmother successfully coaxes the younger son to go outside to play in a somewhat desolate industrial area. The grandmother, somewhat predictably, asks the little guy what he wants to do when he grows up, and equally predictably, the question is beyond his grasp, as he continues to pluck at the tall grasses. Then comes this last shot of the sequence, a distant shot of old on the right side of the screen and the young on the left. Regardless of what message you get out of this shot, the image is haunting."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1450279",
      "warningSpoilers": false,
      "date": "16 August 2006",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "I need to see it again even after two times; a beautiful mix of simplicity, nuance, style and humility",
      "content": "I was shown Yasujiro Ozu's Tokyo Story- my first Ozu film- in an Art-film class some years ago, and I watched it again a couple of months ago. This has to be a truly indelible Japanese film, even to those who might dismiss it dimly as 'slow' or one where nothing happens. Actually, if you're going by traditional plot, not a lot does happen. But then again, not a lot happens on Seinfeld, either. In fact, maybe on repeat viewings, this could become the serene, Japanese tragic-comic equivalent of Seinfeld. After two viewings I get the 'jist' of the characters, their simple objectives and how they live their lives, but there's still much that can be taken in, it's hard to describe. While I'm not sure I've seen one of the ten best films ever made, as it has been for some critics and audiences, I do think it's a very unique film, one that moves in a way akin to an Italian neo-realist film, but filmed with a very particular eye that sets it apart from them.In terms of how its characters go about in the story, it is really closer to a work of De Sica or other, as it is centrally about the importance of family, and how a family and its members through the petty parts and especially through the tragic times has to stick together. The family unit here involves a couple of grandparents (Chishu Ryu and Chieko Higashiyama, who have those funny, dependent, though truthful ways about them as elders of the common ilk) who come to visit the rest of their family, and aside from (more than any other) daughter-in-law Noriko (played in such a wonderfully every-day, compassionate way by the great Setsuko Hara), they're dealt with the 'it's the old folks again'. This is particular by their own real daughter, who seems most ungrateful for their arrival. They send them to a resort, but then something un-expected happens, which turns the situation around and ground the henpecking to an immediate halt.Some scenes still stick in my head even when I least expect them going about my days, much as the aforementioned Seinfeld episodes seem to do. I loved the gentleness in one scene where Noriko is offered a gift by the grandmother, it rings perfectly true to the everyday, but it's handled in such a way that could not have been done as well in another film. There's also a great deal of humility, with moments of amusement, when two male characters (one of them the grandfather I believe) get drunk. And throughout the film, Ozu creates impressionable compositions, setting him apart with just this film alone for me as a remarkable artist; I still remember certain shots of the houses and scapes (his specific way of shooting characters in the interiors is really neat too). In the class our teacher told us this was part of what were called 'handkerchief films' or something close to that in Japan, where audiences would bring hander-chiefs with them from crying so much during the film. I can see why; probably the best that can be said of Tokyo Story is how he pulls so much out of so little, and the interest that is always constant, even through little domestic squabble scenes, quiet moments with the elders (the old man has a look that's perfect throughout), and the more intense ones later on. In short, it's definitely at least one of the very best Japanese films of the 1950s, in the same rank as Kurosawa's best films."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1215738",
      "warningSpoilers": false,
      "date": "14 November 2005",
      "rate": "9",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Almost Unbearably Sad",
      "content": "This was my introduction to Ozu, and I have to say that I thought it was at times unbearably sad, and all the more so because of its misleading simplicity.In \"Tokyo Story,\" a mother and father make a trip to Tokyo to visit their three children and their children's families. Time, distance, and the children's busy lives have caused them to drift away from their parents; the mother and father learn that their children have become different people from those they used to know, and must face the uneasy conclusion that they may not like the people they have become.Ozu has created a prototype for cinematic minimalism. The camera hardly ever moves; static shots are edited together to give the movie whatever momentum it has. This style can become admittedly frustrating; I found myself fidgeting more than once. However, it also helps give images a more profound impact than they might otherwise have, because there are few distractions. As a result, a simple shot from behind of two old people sitting on the edge of a wall watching the sea in silence becomes achingly beautiful. Ozu is able to communicate their feelings of loneliness, regret and obsoleteness without a word or strain of music. He takes the exact opposite approach from that of a filmmaker like Steven Spielberg, and it works beautifully.And the movie is not as simple as it appears. For underneath the story about this one family and its dynamics, there is a larger story about the changes taking place in a post-war Tokyo, and the increasing divide between generations. Shot after shot of factory chimneys, power lines, and construction sites serve to both highlight the progress of a city about to take off and the inevitability of certain traditions being left behind.You will have to have patience with this movie, I won't lie to you about that. But I found that its subtle and haunting effects stayed with me for days after I had seen it.Grade: A"
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2095548",
      "warningSpoilers": true,
      "date": "13 July 2009",
      "rate": "",
      "helpful": "11 out of 19 found this helpful.",
      "title": "Honor thy father and thy mother",
      "content": "\"Tradition is the illusion of permanence.\" - Woody AllenYasujiro Ozu's \"Tokyo Story\" finds an elderly Japanese couple visiting their adult children in Tokyo city. They intend to spend time with their offspring, but the kids are too engulfed in their own lives to make much time for their mother and father.Having seemingly lost the ability to relate to their parents, the self-absorbed kids thus shuttle the couple off to a luxury spa and hotel, all the while resenting their parents for the expense. Even the couple's grandchildren treat them with a great deal of scorn. The eldest grandson grows angry when he learns that he has to share his study with his grandparents and later throws a tantrum when the family cancels plans to visit a restaurant.Ignored by their family, the elderly couple wander about Tokyo city, visiting friends and soaking up the scenery. They receive more affection from strangers, old friends and the wife of one of their dead sons, than they do from blood relatives. The film ends with the family's frail mother predictably dying. Though her children take a few moments to mourn her loss, stating that they regret not treating their mother better whilst she lived, they promptly return to their old selves, their dead mother quickly forgotten.So what we have here is a simple morality tale. Ozu is a traditionalist, and the majority of his films view with bittersweet sadness how the traditional family unit has disintegrated in an increasingly urbanized post-war Japan. And yet, while Ozu waxes nostalgically for some ideal familial bond, his films are also about the \"inevitability of change\". One need only look at the titles of Ozu's better known films (Early Spring, Late Spring, Early Autumn and Late Autumn) to see that he's attached to a very specific form of Japanese seasonality. In \"Tokyo Story\" he makes this point quite literally when he has one character state that all families unavoidably drift apart, pulled in their own individual directions. The result is that \"Tokyo Story\" has an oddly counterproductive tone, Ozu both acknowledging the inevitability of change and mourning the loss of some idealized good old days. Typical of Ozu, the director's camera is always distant, austere and motionless. He doesn't sledge hammer his points and maintains a very remote tone throughout. This has led to critics and fans applying buzzwords like \"un-sentimental\" and \"restrained\" to \"Tokyo Story\". But is the film really \"restrained\", or is Ozu's emotionally inert quietness fooling us into thinking we're watching something of depth and complexity?Consider, for example, a scene in which the daughter pokes fun at her mother's weight, only for the mother to die at the end of the film. Instead of delving into the couple's relationship, Ozu opts for simple button pushing, forcing us into the easy position of hating the daughter and pitying the mother. Ozu's aloof style therefore disguises the shallowness of his material, whilst also denying us the satisfaction of what is really shameless domestic melodrama.Like Dreyer, Ozu thus has a tendency of packaging very sentimental and simplistic morality lessons in what can at times be a very challenging aesthetic. In other words, \"Tokyo Story\" is more challenging stylistically, than it is intellectually, morally, or emotionally. It is neither complex nor nuanced, its solemn style completely at odds with what is really a very easy and agreeable lesson.Still, it's not all black and white. If the sons and daughters don't have time for their parents its only because they are genuinely busy. Ozu even makes one son a hectic doctor in an attempt to absolve the boy of all guilt. Afterall, how can we hate a kid for cancelling a diner date with his parents when he's absent only because he's out saving lives?The waters are muddied further when late in the film the father reveals that he is disappointed that his children are not more successful. It gradually becomes clear that he has relied on the success of his children to validate his own life. Throw in the fact that the mother is a bit of an airhead, the father was once a drunk and that both parent's constantly put on a ridiculous facade of kindness, and it's hard not to empathise with their offspring. The kid's may be dismissive of their parents, but the parents, we learn, are equally dismissive of them.7.9/10 – An influential film, viewed as a masterpiece by many. Still, peel back its uptight stoicism and \"Tokyo Story\" reveals itself to be a pretty condescending message movie. Much of Ozu's filmography is like this, hiding sentimentality behind an austere aesthetic. Consider all the pavlovian heart attacks and wistfulness in \"End of Summer\", his sentimentalizing of the unemployed in \"Tokyo Chorus\", his fondness for abandoned, kindly old parents (Tokyo Story, Late Spring), the way he scorns (and celebrates!) modernisation (Good Morning) and mourns the way time rips all children away from the elderly (Late Autumn). Worth one viewing."
    },
    {
      "username": "jordondave-28085",
      "userUrl": "https://www.imdb.com/user/ur157865736",
      "reviewLink": "https://www.imdb.com/review/rw8897959",
      "warningSpoilers": false,
      "date": "28 February 2023",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Untimely",
      "content": "(1953) Tokyo Story/Tôkyô monogatari (In Japanese with English subtitles) DRAMA/ SOCIAL COMMENTARYCo-written and directed by Yasujirô Ozu focusing on a particular situation anyone can relate depicting a time if parents ever felt unwanted by their already grown up children and their families. Two elders, Shukishi Hirayama (film veteran Chishû Ryû) and his wife Tomi Hirayama (Chieko Higashiyama) visiting Tokyo to see their already married son and daughter and their grandchildren. But upon their visit saw them as a burden to their busy lives even after not seeing each other for a very long time. It's realistically poignantly portrayed despite the time and setting."
    },
    {
      "username": "Koyama22",
      "userUrl": "https://www.imdb.com/user/ur20862145",
      "reviewLink": "https://www.imdb.com/review/rw2282869",
      "warningSpoilers": false,
      "date": "20 July 2010",
      "rate": "10",
      "helpful": "17 out of 22 found this helpful.",
      "title": "A meditative masterpiece",
      "content": "I first watched Tokyo Story in a classroom some time ago and witnessed something curious. I have never seen a group of people so choked up over a film, ever. The most curious thing about it though is that most could not place what exactly made them so emotional. There are moments in Tokyo Story in which you are hit with a wall of emotions, surprised and overwhelmed that this simple little film could evoke such feelings. It's something about the characters, the honesty, the way everything hits home despite the cultural and time-period barriers.Tokyo Story takes a deep look at familial relations in postwar Japan. Simply, it boils down to this: two aging parents (played by Ryu Chishu and Higashiyama Chieko) live far away from their children, who are in a quickly modernizing Tokyo. The children in Tokyo are quite selfish and focused on their own busy lives in the hustle-and-bustle of the city. The key character in this film, though, is Noriko (Hara Setsuko), the widow of one of the parents' sons who died in the war. Noriko turns out to be more active with her husband's parents than their own children are.The parents decide to make their first, and possibly final, trip to Tokyo in order to see their children and view the spectacle of the city. The only person that can make significant time for them, however, is Noriko; the children are busy with work and even send their parents away to a spa! In one heartfelt scene, the mother, Tomi, spends the night at Noriko's in which she begs her to re-marry and apologizes for the burden that her son has caused. During this time, the father, Shukichi, is out drinking with old friends and admits to them that he is disappointed with his children, agreeing with his friends who feel the same way.Ozu Yasujiro is considered to be one of the world's greatest filmmakers and Tokyo Story is considered his masterpiece. There is no reason to deny this. Ozu's camera is often a topic of discussion–it usually sets itself at the level of people sitting on the floor (tatami), which allows the viewer to feel like they are sitting right with the characters. It is usually always a calm camera, and very rarely pans. His films are also often slowly paced and meditative, choosing to avoid showing important events which later are revealed through dialogue. Ozu's direction of children has always been brilliant, they are never a weak point in his films and he often bases his stories on child characters (though not here).Tokyo Story contains all of the elements that make Ozu's films popular with film students and cinephiles today. His calm, observant camera; his real-life, non-embellished characters; his attention to detail and the emotional emphasis on certain objects; his perfectly timed music; among other things, contribute ultimately to the warmth and effectiveness of the film. Ozu's passion for filmmaking knew no bounds.Tokyo Story will not appeal to everybody, especially today. The typical moviegoer will either dismiss the film because it is \"old\" or \"black and white,\" or find it boring. To the cautious and attentive viewers who allow themselves to connect with the characters and feel the story, Tokyo Story is a rewarding experience. Tokyo Story, along with Ozu's other films, is a good example of film as an art. Aimed at telling a story and depicting true life on camera, it is much less of the \"entertainment\" experience that people have come to expect from the movies today. There are no explosions, violence, chase scenes, or over- the-top characters here. This is Ozu. This is one of the greatest films ever made."
    }
  ],
  "errorMessage": ""
}