{
  "imDbId": "tt0036775",
  "title": "Double Indemnity",
  "fullTitle": "Double Indemnity (1944)",
  "type": "Movie",
  "year": "1944",
  "items": [
    {
      "publisher": "The New Yorker",
      "author": "Pauline Kael",
      "link": "https://www.newyorker.com/goings-on-about-town/movies/double-indemnity",
      "rate": "100",
      "content": "This shrewd, smoothly tawdry thriller, directed by Billy Wilder, is one of the high points of nineteen-forties films. Barbara Stanwyck’s Phyllis Dietrichson—a platinum blonde who wears tight white sweaters, an anklet, and sleazy-kinky shoes—is perhaps the best acted and the most fixating of all the slutty, cold-blooded femmes fatales of the film-noir genre."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-double-indemnity-1944",
      "rate": "100",
      "content": "To describe the story is to miss the nuances that make it tantalizing."
    },
    {
      "publisher": "The Telegraph",
      "author": "Marc Lee",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/11357407/Double-Indemnity-review-thrilling.html",
      "rate": "100",
      "content": "Film noir is the most intoxicating of Hollywood cocktails, and none is more potent than Double Indemnity...It breaks the rules of filmmaking with breathtaking confidence and is all the more satisfying for"
    },
    {
      "publisher": "",
      "author": "Empire",
      "link": "https://www.empireonline.com/movies/reviews/double-indemnity-review/",
      "rate": "100",
      "content": "Film noir at its finest, a template of the genre, etc. Billy Wilder in full swing, Barbara Stanwyck's finest hour, and Fred MacMurray makes a great chump."
    },
    {
      "publisher": "",
      "author": "The Guardian",
      "link": "https://www.theguardian.com/film/filmblog/2011/nov/29/my-favourite-film-double-indemnity",
      "rate": "100",
      "content": "I love Double Indemnity because it's about a couple who are cheap and greedy, but achieve a kind of tragic heroism; because it has one of the great father-son relationships (although they aren't actually father and son); because it's a thoroughly cynical thriller redeemed by just a fading touch of romance. And it also has a trio of superb performances."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/double-indemnity-review-1944-movie-996685/",
      "rate": "100",
      "content": "It is in the clandestine scheming of the sex-hungry man and the cunning woman, in the methodical method of their plotting the husband's murder that Wilder builds the suspense that pounds and drives to a staggering climax. There are at least three instances of suspense so great that the heart almost stops beating. The highest praise one can give the Sistrom production is to say that it is like a masterpiece of mystery fiction coming vividly to life on the screen. As you cannot lay down such a book until it has been read through, neither then can you shake off the witchery exerted over you by this film from its very opening scene."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1944/film/reviews/double-indemnity-2-1200414382/",
      "rate": "100",
      "content": "Indemnity is rapidly moving and consistently well developed. It is a story replete with suspense, for which credit must go in a large measure to Billy Wilder’s direction."
    },
    {
      "publisher": "Empire",
      "author": "Kim Newman",
      "link": "https://www.empireonline.com/movies/reviews/empire-essay-double-indemnity-review/",
      "rate": "100",
      "content": "Superlative crime yarn adapted with precision and skill from the classic James M. Cain novel."
    },
    {
      "publisher": "Slant Magazine",
      "author": "",
      "link": "",
      "rate": "75",
      "content": "Visually drab and flabby around the edges. Its seamy tale of murder is not layered in any way; what you see (or, in Wilder’s case, hear) is what you get."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9E03E4D7143EE03BBC4F53DFBF66838F659EDE",
      "rate": "40",
      "content": "Such folks as delight in murder stories for their academic elegance alone should find this one steadily diverting, despite its monotonous pace and length...But the very toughness of the picture is also the weakness of its core, and the academic nature of its plotting limits its general appeal."
    }
  ],
  "errorMessage": ""
}