{
  "imDbId": "tt0057012",
  "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
  "fullTitle": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964)",
  "type": "Movie",
  "year": "1964",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "A masterpiece... The genius of Dr. Strangelove is that it's possible to laugh -- and laugh hard -- while still recognizing the intelligence and insight behind the humor."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The film is a model of barely controlled hysteria in which the absurdity of hypermasculine Cold War posturing becomes devastatingly funny--and at the same time nightmarishly frightening in its accuracy."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/1999-08-12/dr-strangelove-or-how-i-learned-to-stop-worrying-and-love-the-bomb/",
      "rate": "100",
      "content": "More lethal than a nuclear waste dump, Kubrick's komedy at least kills us with laughter... It's one of the greatest - and undoubtably the most hilarious - antiwar statements ever put to film."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "Seen after 30 years, Dr. Strangelove seems remarkably fresh and undated - a clear-eyed, irreverant, dangerous satire. And its willingness to follow the situation to its logical conclusion - nuclear annihilation - has a purity that today's lily-livered happy-ending technicians would probably find a way around."
    },
    {
      "publisher": "Dallas Observer",
      "author": "Gregory Weinkauf",
      "link": "",
      "rate": "100",
      "content": "Kubrick's comic gem sparkles with enduring relevance."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "100",
      "content": "The hard-charging originality of the screenplaythe equivalent of turning \"The Hot Zone\" into a Farrelly comedysuggests a deficient legacy of credit to Terry Southern's corner."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "100",
      "content": "Is Dr. Strangelove Kubrick's best movie? Along with ''Paths of Glory,\" absolutely."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "George C. Scott as the fiery Pentagon general who seizes on the crisis as a means to argue for total annihilation of Russia offers a top performance, one of the best in the film. Odd as it may seem in this backdrop, he displays a fine comedy touch."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "80",
      "content": "Yet some of the laughs come too easy and linger too long; for the film's message to have maximum impact, the laughter has to stick in your throat."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/013064kubrick-strange.html",
      "rate": "70",
      "content": "The ultimate touch of ghoulish humor is when we see the bomb actually going off, dropped on some point in Russia, and a jazzy sound track comes in with a cheerful melodic rendition of \"We'll Meet Again Some Sunny Day.\" Somehow, to me, it isn't funny. It is malefic and sick."
    }
  ],
  "errorMessage": ""
}