{
  "imDbId": "tt0057012",
  "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
  "fullTitle": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964)",
  "type": "Movie",
  "year": "1964",
  "items": [
    {
      "username": "elvircorhodzic",
      "userUrl": "https://www.imdb.com/user/ur65733095",
      "reviewLink": "https://www.imdb.com/review/rw3766827",
      "warningSpoilers": true,
      "date": "29 July 2017",
      "rate": "10",
      "helpful": "105 out of 119 found this helpful.",
      "title": "\"Gentlemen, you can't fight in here! This is the War Room.\"",
      "content": "DR. STRANGELOVE.... is a satirical black comedy or rather an ironic approach to decisions and information in the Cold War madness. The smart choice is the mother of all wisdom. It is loosely based on Peter George's novel \"Red Alert\".A crazy American general has ordered, due a bizarre reason, a nuclear attack on the Soviet Union. A bit absentminded captain has realized that a general has lost his mind. Meanwhile, a President meets with his top Pentagon advisors, including a passionate super-hawk general, who sees this as an opportunity to do something about Communism in general and Russians in particular. However, the Russians have an \"automatic\" response...This film loses all touch with the reality on the one side, and yet, it directly affects an image of a disturbed political reality on the other side. The irony stems from human stupidity, irresponsibility, suspicion and arrogance. Mr. Kubrick has created a satirical hopeless situation, through a conflict of mentality and a sense of patriotism, after which, a bizarre - moral winner rises. The highlight of satire is that world diplomacy rejects itself on multiple occasions.However, there is a lot of questions. Why give so much power in hands of a few people? One of them, I mean all, are mostly crazy. Why use energy resources to build nuclear weapons? Probably because we do not have better things to do. Is it wise to make fun of a defense system of the strongest force in the world? Of course it is, one day, we have to stop being afraid of each other.That's why this film is a satirical warning in an universal time, because we live in a time of a political satire with very serious consequences.I am thrilled with a fact that this film does not have a trace of cynicism. Of course, there is plenty of satire, sarcasm, irony, perhaps exaggerated caricature, but there is no cynicism. Mr. Kubrick, you're a genius! The characterization is excellent.Peter Sellers (Captain Lionel Mandrake, President Merkin Muffley and Dr. Strangelove, the wheelchair-using nuclear war expert and former Nazi) is simply awesome as a kind of voice of reason, incompetence and insanity at the same time. It is a strange kind of patriot, savior and avenger.Sterling Hayden (Brigadier General Jack D. Ripper) is a paranoid ultra-nationalist, who shows his madness through a serious facial expression.George C. Scott (General Buck Turgidson) is the personification of chauvinism. He expresses his anger and paranoia of communism in a very comical way."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2928529",
      "warningSpoilers": false,
      "date": "26 December 2013",
      "rate": "10",
      "helpful": "211 out of 240 found this helpful.",
      "title": "Sharp and outrageously entertaining",
      "content": "I never really bought into the Kubrick hype. I mean: don't get me wrong; I like all of his films very much - but to me, they all feel somewhat over-constructed and lack a natural flow. And then I finally got to see 'Dr.Strangelove'. Wow. What a terrific, pitch black satire. This film is so wild and mean and funny - and Peter Sellers gives THE performance of his career. Unlike in any of Kubrick's later works, there's a sense of playfulness here that gives the whole movie a crazy kind of energy; I'm guessing that Seller's love for improvisation forced Kubrick to ditch his usual perfectionism to a certain degree (and the film is all the better for it). Sharp, outrageously entertaining comedy/satire by one of the most revered directors of the past century. 10 out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw1183970",
      "warningSpoilers": true,
      "date": "1 October 2005",
      "rate": "10",
      "helpful": "146 out of 216 found this helpful.",
      "title": "The only movie that makes you laugh at the end of the world.",
      "content": "This movie is absolutely brilliant! It might not be THE best movie ever made but it certainly is one of the most entertaining and fun movies ever made. It isn't even Kubrick's best but it certainly is perhaps his most accessible and entertaining movie.The movie its story and humor are subtle and perfectly makes fun of the whole Cold War situation in the '60's. With some subtle dialog Kubrick perfectly makes fun of a very serious and relevant topic. I mean, the story of this movie isn't that unlikely and could had actually really happened. As a matter of fact, it could still happen today. It's frightening but thanks to Kubrick's directing the movie never really becomes serious and remains fun, hilarious and entertaining from beginning till end. It is the only movie that makes you laugh at the end of the world.The actors are also what makes this movie fun to watch. Peter Sellers is nothing short of brilliant in the three different roles that he plays; Group Captain (G/C) Lionel Mandrake/President Merkin Muffley/Dr. Strangelove. But also George C. Scott is comically brilliant in this movie as Gen. 'Buck' Turgidson and he perhaps plays his very best role. Other actors that stood out were; Slim Pickens and Peter Bull. This movie also marks James Earl Jones his very first appearance in a movie.This is perhaps the most subtle and 'darkest' comedies ever made. Everything about it is shear brilliance and even now 40 years later, it hasn't lost any of its power. The movie still looks like it could had been made a couple of months ago. A movie that will never feel outdated or too 'old fashioned' to watch. In 50 years from now, this movie will be just as good and hilarious, as it is now. Mark my words.The movie is filled with some truly classic long sequences and has countless unforgettable moments and dialog in it. Especially the last sequence, involving Dr Strangelove, is absolutely priceless and unforgettable.Brilliant, brilliant, brilliant!10/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "TBJCSKCNRRQTreviews",
      "userUrl": "https://www.imdb.com/user/ur2093818",
      "reviewLink": "https://www.imdb.com/review/rw0983449",
      "warningSpoilers": false,
      "date": "22 December 2004",
      "rate": "10",
      "helpful": "157 out of 245 found this helpful.",
      "title": "Still laughing, long past the end credits...",
      "content": "Who'd have thought that Kubrick had such a great sense of humor? I mean, in most of his films, there are snippets of humor, and Barry Lyndon has a definite irony, but I hadn't expected him to be able to direct such a hilarious and thoroughly entertaining comedy. I had known for a while that this was the highest rated Kubrick film here on IMDb, so naturally, I was excited to find out if it was really his best film. Even though I haven't seen Lolita, Spartacus, Eyes Wide Shut or his first few films(the shorts he made before his feature), and even though I thoroughly enjoyed his other films, this very well may be his best film. Made in a period of time where the thought of nuclear war was a terrifying idea, that was believed to be a reasonable fear, the film takes this idea and turns it around, makes us laugh at it. The film was made during the Cold War, which must have taken quite a lot of guts on Kubrick's side... then again, he did start out, intending to make a thriller/suspense film about the subject, but ultimately realized that a comedy with a lighthearted look on the situation would be a better idea. So, he turned the idea of impending doom from nuclear holocaust into a black comedy. Personally, I think he did a damn good job of it. I haven't laughed that hard and for so long at any one time for quite a while... in fact, I might never have. The comedy isn't overplayed, in fact most of it is presented in a dead-pan, matter-of-fact-like type of way... what's even more hilarious is that the better part of it is completely accurate. No dumb stereotypes, no old clichés... just logic and simple, good old-fashioned observation. The plot is excellent, and very well-paced. In my opinion, Kubrick's most well-paced film. The plot takes off almost immediately and moves at a great pace throughout the film. The acting is flawless. Absolutely flawless. Not something completely unusual for a Kubrick film, but still. George C. Scott and Peter Sellers are amazing. Normally, I'm not too fond of Sellers, but here he was brilliant. The characters are well-written, diverse and interesting. The cinematography is great. Just like Kubrick's other films, this one has some very memorable scenes, one of which(the bomb-riding sequence) has been referenced and spoofed a huge number of times... possibly more times than any other sequence in Kubrick's films, which is quite impressive. The dialog is well-written, well-delivered and memorable. Plenty of quotable lines. I can't really say much more about the movie without ruining one or more of the innumerable great jokes... so I'll just suggest you see it. Seriously, if you enjoy Kubrick's sense of humor as seen limited in his other movies, you're going to enjoy this film. Maybe not as much as I did, but you'll most likely laugh. A lot. I recommend this to any fan of Kubrick, black comedies, Peter Sellers or just comedies with a dark basic theme to watch this. I can't praise it enough. See it, unless you are offended by the themes the film presents. You won't regret it. I know I didn't. Not by a long shot. Hilarious film with a provocative plot and basic idea. 10/10"
    },
    {
      "username": "Sickfrog",
      "userUrl": "https://www.imdb.com/user/ur0019730",
      "reviewLink": "https://www.imdb.com/review/rw0081304",
      "warningSpoilers": false,
      "date": "14 August 1998",
      "rate": "10",
      "helpful": "390 out of 505 found this helpful.",
      "title": "Laughing at Fear",
      "content": "What makes this film so powerful is the message that it made at the time of its release. This film came out at a height of paranoia of the nuclear age and the Cold War, right around the time of the Cuban Missile Crisis. This film depicts a horrible, tragic incident in which a breach in the government and a few diplomatic mistakes result in nuclear holocaust. So, why didn't this film inspire panic? Because of the brilliant way in which Kubrick presents it... as a satire. The scariest thing about this film in retrospect is not how it depicts the impending doom of the Cold War, but how it makes you laugh at it. By presenting it with humor, it conveys just how much of a farce the nuclear arms race was in real life. And I don't think that any other film has captured the absurdity of war nearly as well as this one has. And I am not likely to believe that one ever will. In my opinion, Kubrick has never made a better film since. And kudos to George C. Scott for his astounding performance, as well as Peter Sellers for the most versatile acting I've seen from an actor in one film, and to Sterling Hayden, for performing the most serious, yet the most hilarious role in film with perfect accuracy. Beware of fluoridation!"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0081387",
      "warningSpoilers": true,
      "date": "9 June 2002",
      "rate": "",
      "helpful": "108 out of 179 found this helpful.",
      "title": "As funny and as sharp and as relevant as it was almost 40 years ago",
      "content": "When US General Jack D. Ripper orders wing attack plan R into operation he sets his plane on an irrecoverable bombing run into Russia. Powerless to stop them with the relevant three letter access code the President of America and his advisors plan to warn Russia as best they can to prevent as many of the planes reaching their targets as possible. However when the Russian Ambassador warns of the doomsday machine  a machine that will destroy all life on earth in response to a nuclear attack things become desperate. With one plane making a desperate run to it's target things look bleak.Now well respected as a superb satire on the arms race this is one of my favourite Kubrick films. It is less cold than some of this later work and is genuinely funny without losing it's point. The story focuses on three main areas of the attack  the military base where one crazed man launches the attack, the war room at the pentagon and the plane making the bombing run. All these have comedy inherent in them  although thew war room is by far the best. The story is an satire on the futility and danger of the nuclear deterrent while also scattered with fantastic dialogue. It may not sound funny but trust me  it is.The characters are all great and well done by the cast. Peter Sellers excels in each of his roles and shows his quality. As Mandrake he is funny in a very British way, as The President he has great one sided conversations with his Russian counterpart as well as great dialogue including the legendary `Gentlemen you can't fight in here  this is the war room'. However as Dr Strangelove he is hilarious  the character himself is a swipe at those who change political sides but maybe still hold onto their old ideologies. Sterling Hayden is great as General Ripper  he delivers his madness with a straight face throughout (or maybe no-one told him it was a comedy!). Slim Pickens is good and has the most famous scene from the film that has been copied in many things including Homer's fantasy in The Simpsons. However for me the standout is George C. Scott  not exactly a comedy actor he is frantic and over the top with his communist paranoia.Overall this is a classic and deserves to be. It is sharp today as it was then and even more relevant. The comedy is still fresh and the dialogue is great  quite simply, when Scott implores the president to act quickly as `we must not have a mineshaft gap!' then you've arrived!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2028262",
      "warningSpoilers": false,
      "date": "24 February 2009",
      "rate": "9",
      "helpful": "23 out of 34 found this helpful.",
      "title": "Gentlemen, You can't fight in here! This is the War Room!",
      "content": "I didn't quite understand all of the jokes, but I enjoyed this movie enormously. It is essentially one of the best satirical comedies out there. Peter Sellers was hilarious here in no less than 3 roles. My personal favourite was the president. My favourite line of the film is actually in the title of this review, as Dad and I watched this at midnight and couldn't stop laughing. I loved Sellers also as the man in the wheelchair Strangelove, who tries to impersonate Hitler, I think. There was a brilliant performance from fine actor George C. Scott, who I really admire. I personally think there isn't enough of these two stars on television, I really don't. I noticed a young James Earl Jones too, and the camera-work and direction were both excellent. Got to love the music, I did, a bit ironic, but that was the intention. Great movie! 9/10. Bethany Cox"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1521603",
      "warningSpoilers": false,
      "date": "15 November 2006",
      "rate": "10",
      "helpful": "30 out of 46 found this helpful.",
      "title": "This gets better with repeated viewings--what a film!",
      "content": "I saw this film originally when I was about 12 and I wasn't super-impressed by it--particularly since my father was a bit like George C. Scott's character in the film!! However, years later (long after the threat from nuclear annihilation from the Soviet Union has greatly diminished), I was a lot older and experienced and thought the film was brilliant--and not the \"Commie Plot\" my Dad had envisioned!The film features some amazing performances that are absolutely mesmerizing. Sterling Hayden is excellent as the schizophrenic general that orders a first strike on the USSR--he's gruff, weird but pretty believable. However, his performance is unfortunately overshadowed by two other actors. My favorite of these was George C. Scott. Although he didn't need to do the amazing multiple roles that Peter Sellers did (the man was AMAZING), the one character he played was hilarious and chilling. He was the Chairman of the Joint Chief of Staff and you just have to see and hear him to believe him. Although technically NOT schizophrenic like Hayden, he was a totally insane general that actually seemed to look forward to a nuclear war with the \"!@&%@# Ruskies!\". His swagger and bravado was perfectly balanced with all the truly stupid things the character unintentionally said--again and again.Now as for Sellers, he was such a great character actor but all too often, he was remembered more for Inspector Clousseau (a good character, but only one of MANY the man was capable of doing) or he was remembered for all the BAD movies he did in his lifetime. It seems for every great film he made (such as THE MOUSE THAT ROARED or BEING THERE), he also made crap (such as THE PRISONER OF ZENDA or THE FIENDISH PLOT OF FU MANCHU). His lack of discernment tended to hide his brilliance. And, in Dr. Strangelove he was absolutely brilliant--playing three totally different roles. As the British Colonel, he was quite believable and underplayed the role. As the President, he was a little more comical and yet pretty convincing. And, as Dr. Strangelove, he was an over-the-top ex-Nazi (not all that \"ex\" if you ask me) madman. The variety was stunning and almost without precedent--except for a very similar multiple role situation Sellers also played in 1959's THE MOUSE THAT ROARED--another brilliant comedy about nuclear war.In addition to the great acting and writing, I do have to take my hat off to Stanley Kubrick. In past IMDb reviews, I was not particularly kind to several of his \"masterpieces\" (I am one of those who actually disliked 2001, CLOCKWORK ORANGE and BARRY LYNDON). However, I hope I am intellectually honest enough to view his films individually (PATHS OF GLORY, THE KILLING and SPARTACUS were wonderful).The bottom line is that this is a great film and can be enjoyed by anyone who has a decent handle on world events and history. Unfortunately, for a generation that now is at times obsessed with Paris Hilton and SURVIVOR, I also believe that the film is quickly becoming one that is simply beyond the capacity of many to even comprehend, as they can't even remember the past and have no trouble living that way."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0081379",
      "warningSpoilers": false,
      "date": "13 February 2000",
      "rate": "10",
      "helpful": "112 out of 198 found this helpful.",
      "title": "Kubrick takes a whack at comedy- and the cold war",
      "content": "Stanley Kubrick always likes to try something new with each movie he does, and this proves it. This is truly one of the grittiest, and best dark comedies I've ever seen with some crude moments and some odd ones (who'd think to have Slim Pickens riding a bomb on it's way down). It turns into a flat out masterpiece though with the spectacular acting by Peter Sellers (in three separate roles), George C. Scott (his facial expressions are a crack up every time), and a supporting cast of crazies in a government of loons, the most impressive of these being the incomparable Sterling Hayden in his best dramatic/funny role. It contains a resonance as well that sticks till today, as corruption and pig-headedness rules in all sorts of governments, but most of all in those with the most power. It's almost worth it just for the opening credits and end sequence with \"we'll meet again\"."
    },
    {
      "username": "francozeff",
      "userUrl": "https://www.imdb.com/user/ur74111639",
      "reviewLink": "https://www.imdb.com/review/rw3709880",
      "warningSpoilers": false,
      "date": "17 May 2017",
      "rate": "10",
      "helpful": "88 out of 108 found this helpful.",
      "title": "Russians In The War Room",
      "content": "Spectacular and chilling to watch Dr. Strangelove in May 16, 2017. I'm not going to talk about prophecy not even coincidence. Art has a way to warn, express or simply entertain in a way that its relevance will always be renewed. That opening with George C Scott's secretary, in her underwear, answering the phone for her boss in the most professional tone imaginable, is a masterful way to introduce us to the normal absurdity we're about to embark on. Terry Southern's extraordinary script (sharing credit with Peter George and Stanley Kubrick himself) is a masterpiece of intention and execution. The film doesn't have a moment of emptiness nor a single cheap shot. Everything works with the irrational logic of tradition and set standards. How can something so serious and ultimately terrifying can be so funny. I think that's the definition of film art. I don't want to sound pompous but that's exactly how I feel. I've seen a 1966 movie by Stanley Kubrick in 2017 that's better, more relevant, ingenious and even revolutionary than anything we've seen in a long, long time. Peter Sellers, fantastic three times over (and he was also going to play the Slim Pickens part) George C Scott in one of the greatest comic performances ever put on film and Sterling Hayden in a frighteningly credible show of abuse of power, complete the pleasures of this remarkable film."
    },
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw0081453",
      "warningSpoilers": false,
      "date": "5 June 2003",
      "rate": "10",
      "helpful": "114 out of 215 found this helpful.",
      "title": "A must see !!! ***** out of ****",
      "content": "Who else than Stanley Kubrick could take a serious subject like the cold war and tell the story like a comedy ??? He proves his genius in this film more like in any other film of his. It's the story about one general ( with the very appropriate name Jack D. Ripper) gone mad and he launches an attack on Russia all by himself. He's mad, but still smart enough to prevent that anyone can stop him. He's got this strange ( but very funny ) theories about body-fluids, but his men respect him and do everything he says. So 34 fully-armed plains are sent to as many targets. Meanwhile his Colonel, Mandrake, tries to talk sense to him and the president and another General are trying to warn the Russian prime minister. You can have nothing but great respect for Peter Sellers. He plays three roles in this film and every single one of them is flawless. The doctor Strangelove character is hilarious and creepy at the same time. His appearances as the doctor are, along with the telephone conversations between the president and the Russian Prime minister the funniest moments in the film... Also the classic bomb-ride of Major Kong off course. George C. Scott is clearly having fun in his role and the debut of James Earl Jones is also definitely worth mentioning. Like I said already...a must see film if you're a film lover in general."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw1918429",
      "warningSpoilers": true,
      "date": "26 July 2008",
      "rate": "",
      "helpful": "32 out of 56 found this helpful.",
      "title": "Ethnic cleansing",
      "content": "Stanley Kubrick directs \"Dr Strangelove.\" The plot? General Ripper, a manic US general, orders a nuclear attack on Russia. He believes the \"purity of his essence\" has been contaminated by the enemy, the mere existence of whom threatens his gene pool. To maintain the purity of his lineage, Ripper thus initiates \"Attack Plan R\", an order which results in the 843rd bomb wing leaving their fail safe points and proceeding into enemy airspace. In response, the Russians reveal that they are in possession of a \"doomsday device\". Throughout the film, Americans and Soviets will attempt to defend and propagate political ideologies that mutually define the other as a danger to purity.Ripper, like most of the film's characters, is sexually dysfunctional. He misinterprets his post coital fatigue (or erectile dysfunctions) as a Communist plot and believes that \"the enemy\" is sapping his \"sexual essence\". To reassert both himself and his masculinity, Ripper sees it as his duty to deny or destroy Russia. As he gains power, Ripper munches on phallic cigars and unsheathes huge, eroticised machine guns.Group Captain Lionel Mandrake (Peter Sellers) tries to stop Ripper, but is himself too weak and effeminate to overpower the psychotic general. Mandrake, a nervous flight commander named after a flightless male duck, has a broken leg, frequently stammers and proves not \"masculine\" enough to overpower the deranged Ripper. This tension between masculine/feminine/creation/destruction permeates the entire film.Enter Buck Turgidson (George C Scott), a warmonger who seeks to capitalise on Ripper's sneak attack. The ball's already rolling, he says, so let's roll along with it. Buck's name is symbolic of sexual virility (Buck: vibrant male, turgid: swollen).But once again, Sellers plays the effeminate foil to his hyper-masculine counterpart. He's President Merkin Muffley, a bald and small man, unable to commit to combat and constantly seeking to \"work with the enemy\". \"Merkin\" and \"muff\" are slang terms for pubic wigs and female pubic hair respectively.On the other side of the Atlantic we join Major Kong, a George Bushesque Texan warmonger. His B52 bomber is making a run for a Russian base at La Putta (the whore). Unfortunately, a Russian missile damages the aircraft's radio and they are unable to receive the recall code. Kubrick's films frequently deal with systems, machines and communication networks breaking down. Here, a bizarre and complex series of freak accidents - impurities or oversights in the system - essentially leads to Armageddon.The recall code is itself discovered by Captain Mandrake. An acronym for \"Purity of Essence\" and \"Peace on Earth\", the code points to both party's fascist mindset: for peace to arise, there can only be one pure lineage. The Other must be eradicated. When Kong reaches his target, he rides a bomb down to ground zero. This activates the \"doomsday device\", blanketing the earth in a series of atomic explosion. Like most Kubrick films, the film climaxes with a system failure. The irony here is, not only that base human drives result in intrinsically corrupt and inherently stupid systems, but that it's precisely a series of fail safes and precautions, a neurotic desire for total control, that kill us. Once an irrationality (or rather, super rationality) is introduced via the psychotic Ripper, the system self destructs.Before the film's iconic finale, its cast of world leaders listen as Dr Strangelove, a wheelchair bound ex-Nazi professor, describes the steps \"necessary\" to preserve life. With passages equating US presidents to \"fuhrers\" and with world leaders discussing fascist policies and eugenics, its clear what power and ideology has ultimately triumphed. The film ends with bombs going off in tandem with the \"newly risen\" capacity of Strangelove and his Nazi affiliations.With \"Strangelove\" Kubrick recognised the inherent beauty of the mushroom cloud as well as its horror. Spectators often embrace apocalypse, or unconsciously desire some idealised notion of it. But rather than the arms race, it is libidinal drives which Kubrick satirizes. Think Major Kong straddling a 20 megaton thermonuclear bomb as it plummets towards a soviet ICBM site, hollering inane Texan war whoops as he falls. If violence always has a sexual element, and vice versa, this is warfare as a kind of sexual hysteria, Kong whipping his bomb in a masturbatory frenzy, hat in hand, before the screen is engulfed in the brilliant over-exposure of nuclear detonation, the perfect oneness of pleasure, where the intersecting vectors of sex, death and speed collide headfirst in an orgasmic explosion of fission, fcking and fallout. The great black joke of \"Strangelove\" is that war stems from the phallus and that nuclear stalemate is a kind of sexual frustration (or strange love) to the technocratically evolved male; there are forever strong, dangerous unconscious drives conspiring to launch the ultimate attack. No surprise then that the film is awash with sexual imagery. Phallic Guns, cigars, swimsuits, playboy centrefolds, dominant young bucks, sexually dysfunctional wheelchair bound degenerates and a narrative book-ended by copulating aircrafts and an atomic ejaculation...the film's entire semiotic language is a consistent ballet of creation (sex) and destruction (war). This is combat out of obedience to the crotch, war as the drive to dominate and possess (there is a \"mating-warring association\" deep in the male brain, dominance associated with the phallus; think how phrases like \"f*** you up\" and \"get some action\" have double meanings), man seemingly raping/pillaging to create space for his dark cycles of creations.The film is also unique in the way it blends genres (comedy/thriller/documentary). Kubrick's camera is initially detached, godlike and methodical, coolly milking the suspense, while the film's second half, with its outrun missiles and nervous faces awaiting annihilation, plays likes a precursor to contemporary \"ticking clock\" action movies. Kubrick changes aesthetics styles once again for the film's (now much copied) ground battles, which incorporate urgent documentary-like war footage. The rest of the film swings between comedy/satire, and straight drama. This results in strange and complex juxtapositions.10/10 - Masterpiece."
    },
    {
      "username": "Ignorant Bastard",
      "userUrl": "https://www.imdb.com/user/ur1236855",
      "reviewLink": "https://www.imdb.com/review/rw0081230",
      "warningSpoilers": false,
      "date": "26 June 2001",
      "rate": "",
      "helpful": "212 out of 313 found this helpful.",
      "title": "Truly, an incredible and innovative movie",
      "content": "Stanley Kubrick's first and only comedic masterpiece is still the finest ever made. I love everything in the movie: the brilliant acting, sensational script, flawless direction, and even those quirky visual effects. Not only was this film hilarious, it was a breakthrough for the entire film industry when first released. In addition to it's amazing satirical basis, the film also played a major role in how films were advertised and marketed... as if Peter Seller's performance wasn't enough! The sets were also very convincing and just plain great! So realistic in fact, that the FBI almost investigated how they got the B-52 Bomber replicated to near perfection!In the end, 'Dr. Strangelove: or How I Learned to Stop Worrying and Love the Bomb' is the best comedy. It's also another milestone in film making and another reason to be astonished when looking at the work of Stanley Kubrick.An obvious perfect ***** / *****"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1852843",
      "warningSpoilers": false,
      "date": "6 April 2008",
      "rate": "9",
      "helpful": "11 out of 17 found this helpful.",
      "title": "Going Toe to Toe with the 'Rooskies'",
      "content": "As a film Dr. Strangelove was so well received that a more serious film on the same topic, Failsafe, failed to find an audience. Yet Strangelove made you think as well as entertain which is the ultimate object of any great work of cinema.General Jack D. Ripper has sent out the Strategic Air Command bombers and locked down Burpelson Air Force Base so that higher ups can't interfere. He's struck back at the dirty Communists for pushing fluoridation of the water supply which he feels has interfered with his bodily functions.Ripper might want to have checked with the Air Force Chief of Staff, General Buck Turgidson who when we meet him seems to have all his bodily functions working just fine. A second opinion on Ripper's lack of bodily functions might have revised his reason on why his particular functions weren't doing well.Of course his actions have created a crisis and President Muffley of the United States is busy trying to talk to Premier Kissoff of the USSR to prevent a nuclear war. That is in case those SAC bombers can't be recalled. One of the bombers commanded by Major Kong is anxious to do battle with the 'Rooskies'.Director Stanley Kubrick went poaching on the black comedy normally that would be the province of Billy Wilder. But even Wilder in his wildest dreams never used those wonderful Dickensian names for his characters that Kubrick is so delighting in. My favorite however is the part played by Keenan Wynn as the army colonel commanding the tactical force that liberates Burpelson, Colonel Bat Guano.Jack D. Ripper is played by Sterling Hayden a man consumed by his lack of bodily functions. This is a takeoff on Army General Edwin Walker who commanded US troops in Germany and was relieved when it was discovered he was indoctrinating his troops with John Birch Society propaganda which included their fears about fluoridation of water. Curiously enough that cause was actually taken up by other than fanatic right-wingers, people like Ralph Nader. Could Ripper have been right after all?George C. Scott is cigar chomping, bodily functioning spoof of legendary SAC commander Curtis LeMay. He's having quite the difficult time in deciding just who to root for in this crisis.Peter Sellers got an Oscar nomination for playing three different characters in Dr. Strangelove. Sellers is President Muttley, Colonel Mandrake of the RAF an exchange officer serving under Sterling Hayden and the crazed former Nazi nuclear scientist Dr. Strangelove. Watching the film, it's almost hard to believe this is the same man using three different voices and appearances that makeup alone could not explain. Sellers lost to his fellow British player Rex Harrison for My Fair Lady.In fact Dr. Strangelove also lost as Best Picture to My Fair Lady. Of course George Bernard Shaw never put his legendary wit to the issue of mutual nuclear annihilation. Neither did Billy Wilder, but I have a feeling those two talents together couldn't have done any better than Stanley Kubrick.The image that stays in your mind from the film I guarantee will be Slim Pickens as Major Kong riding that hydrogen bomb down to its 'Rooskie' target like a bucking bronco.Hopefully we won't meet Major Kong again, who knows where and who knows when."
    },
    {
      "username": "archyon",
      "userUrl": "https://www.imdb.com/user/ur0893561",
      "reviewLink": "https://www.imdb.com/review/rw0081182",
      "warningSpoilers": false,
      "date": "14 October 2000",
      "rate": "10",
      "helpful": "300 out of 429 found this helpful.",
      "title": "Frighteningly hilarious",
      "content": "This movie is possibly the best comedy ever made, only with one fact against it: it's not very \"comical\". Hilarious? Yes. Comical? Absolutely not. The horrors of the nuclear war caused by a simple mistake materialize before us, directed with skill by the late maestro, Kubrick.There are simply not enough words to describe Peter Sellers's BRILLIANT performance in three roles: A british officer, the U.S president and Dr. Strangelove. He is hilarious as the british officer, with his wonderful accent, gloomy and neurotic as the president and simply insane as Dr. Strangelove.Also note that this movie includes a performance by very young James Earl Jones, who we now all know as the voice behind Darth Vader.The ending scene is also a masterpiece."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0081388",
      "warningSpoilers": false,
      "date": "9 June 2002",
      "rate": "9",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Superlative.",
      "content": "The best black comedy ever made. I could watch it a thousand times and still laugh. Oh -- dated, sure. There no longer is a Soviet Union, although there are plenty of people willing to barbecue one another nuclearly -- as in India and Pakistan. I'd like to mention the writer on this, the late Terry Southern, who had lots of input into some pretty funny movies, not to mention his short stories or novellas. He's the guy who came up with \"pre-version.\" Kubrik did a fine job. He lost his sense of humor afterward. The acting couldn't be better. George C. Scott embeds himself in one's brain as the general. And Peter Sellers. \"Look, Mein Fuhrer -- I can VALK!\" They wanted him to play King Kong, the pilot, but it didn't work out. Doesn't matter. It's hard to imagine how he would have improved upon Slim Pickens. \"Two pairs a nylon stockin's. Two pair a prophylactics. Shoot. A fella could have a good time on this in Vegas.\" Sterling Hayden as the mad general gives his best performance ever, even managing to inject a note of pathos into his delusions. For what it's worth, the final target they attack, \"the missile complex at Laputa\", comes from Swift's satire, \"Gulliver's Travels,\" in which Laputa is the name of a flying island.After the Doomsday Device has gone off and begun to irradiate the entire globe, Sellers, as Dr. Strangelove, opines that it might be possible for selected humans to survive in the deepest of mine shafts. I wanted to make some reference to a Mine Shaft Gesellschaft but couldn't figure out an easy way to fit it in. So I'm shoe-horning it in here. Not that it makes much difference because so few will twig. The final scenes. Credits roll. Atomic blast follows atomic blast whilst Vera sings \"Keep Smiling.\" DO NOT MISS THIS ONE. If you miss it, you will miss something worth seeing."
    },
    {
      "username": "Woodyanders",
      "userUrl": "https://www.imdb.com/user/ur8239592",
      "reviewLink": "https://www.imdb.com/review/rw3775061",
      "warningSpoilers": true,
      "date": "7 August 2017",
      "rate": "9",
      "helpful": "13 out of 22 found this helpful.",
      "title": "Please no fighting in the war room",
      "content": "Stanley Kubrick's wickedly hilarious end-of-the-world black comedy gem about an impending nuclear war caused by human error straddles a fine line between being fiercely funny and genuinely chilling throughout: As evident by the gross behavior and arrogant attitudes of various high-ranking officials in positions of power that they are neither smart nor mature enough to properly handle, the greatest threat to mankind's safety isn't the existence of nuclear weapons; instead it's such all too real and unavoidable human foibles as pride, stupidity, and incompetence that we should all be more worried about.The savagely mocking script by Kubrick, Peter George, and Terry Southern pulls zero punches in its no-holds-barred satirizing of said foibles and offers numerous uproarious moments of inspired dark humor: The meek and ineffectual President Merkin Muffley (Peter Sellers in one of three bravura performances) informing the drunken Soviet premier over the phone about the nuclear strike, the hysterically loony speech made by unhinged paranoid General Jack D. Ripper (robustly played with snarly aplomb by Sterling Hayden) about preserving his precious bodily fluids, gung-ho redneck bomber pilot Major 'King' Kong (a marvelously spirited portrayal by Slim Pickens) riding a nuclear missile like a bucking bronco on its final drop while whooping it up, and the gloriously insane plan for survival that batty ex-Nazi adviser Dr. Strangelove (Sellers again at his most sublimely deranged) proposes to President Muffley.Moreover, the zestful acting from the first-rate cast keeps this movie humming: Sellers pulls off a terrific troika of impressive and highly distinctive turns as Muffley, Strangelove, and uptight RAF group captain Lionel Mandrake, George C. Scott has a field day as bellicose commie-bashing hawk General 'Buck' Turgidson, Keenan Wynn does his usual sturdy work as the gruff Colonel 'Bat' Guano, Peter Bull likewise excels as the shifty Russian ambassador Alexi de Sadesky, Tracy Reed briefly steams things up as sexy secretary Miss Scott, and James Earl Jones handles himself well in his film debut as the thorough Lieutenant Lothar Zogg. Kudos are also in order for Gilbert Taylor's sharp black and white cinematography and Laurie Johnson's rousing military marching band score. Worthy of its classic status."
    },
    {
      "username": "Dr_Coulardeau",
      "userUrl": "https://www.imdb.com/user/ur3836774",
      "reviewLink": "https://www.imdb.com/review/rw3705548",
      "warningSpoilers": true,
      "date": "11 May 2017",
      "rate": "10",
      "helpful": "16 out of 27 found this helpful.",
      "title": "Better laugh at absurdity than cry",
      "content": "This film has become a cultish film because of the subject of course but especially because of the tone that is really entirely conveyed by two actors, Peter Sellers and his three roles and George C. Scott. We could add Slim Pickens in the batch with his phenomenal dive into nuclear annihilation at the end. The subject is central in our post WW2 world since it has to do with nuclear weapons and war. These weapons have only been used once, in fact twice, by the USA against Japan in 1945. The deterring effect of the possession of such weapons is supposed to keep the world as peaceful as it can be, though we all know it is not exactly true since wars have been going on practically constantly since 1945, for oil, for uranium, for who knows what other resources or tribal heritage from the centuries of slavery imposed onto black Africa, or the centuries of rife between sects in some religions. But they were always limited geographically. Most of these wars, apart from the direct colonial wars of Great Britain (not so many) and France (essentially two in Indochina and in Algeria) were the deeds of the USA: Korea, Vietnam, and the Middle East, and should I not mention Granada and Panama? The Soviet Union only had one in Afghanistan and they stepped out of it in front of the resistance from the Taliban and the Mujahedeen, armed and financed by the USA and the CIA. These movements gave rise to Al Qaeda and later ISIS. In 1964 just after the missile crisis in Cuba the world had just gone through a terrible scare and Stanley Kubrick wanted to produce a film that would make the world realize how dangerous these weapons can be and how little we can stop them when they are already in the air. He decided to make it a comedy by using Peter Sellers in three different parts in which his improvising was able to make a real hit on the psyche of an audience. And it is a success and it is still valid.The argument is that there will always be some crazy guy who will be able to bypass all limitations and firewalls to play a trick on the world, on the USSR at the time and Russia nowadays, or even China for the more reckless, and manage a bomb and today a missile to reach the other side and start the ABSOLUTELY AUTOMATIC responding defense that would become a tremendous back-attack or act of final justified but lethal compensation. As the one who started the scare in this film, and the final holocaust, says so well just before committing suicide \"I believe there is another life on the other side!\" That is in the drastic situation the most humorous, a very black humor indeed, remark you can utter.The mad Nazi scientist Dr. Strangelove is the most frighteningly hilarious character you can imagine, selling his nuclear knowledge and knowhow to the USA with only one intention: to get to the nuclear holocaust he had been preparing in Germany for Hitler and he was not able to perform or achieve. He is mad, he is deranged, he is physically handicapped, he is erratic and his artificial arm is only remembering his glorious Nazi time and is taking over from time to time to salute his leader, Heil and Heil again. All that is dealt with humorously but it is dramatic and today in the situation of two wars, in Afghanistan on one side, and in Iraq- Syria on the other hand, plus the Korean situation that is poisoned by the unpredictable erratic attitude of President Trump in front of a young leader in North Korea who is either right to resist American imperialism or wrong to endanger the survival of the whole planet, today we can feel it resonate with strength and power. Can there be any reasonable tempered, and well-tempered at that, moderate and realistic compromise to find a solution to the problem without having the USA continuing in their unacceptable track of dictating what one man, one president wants, even when this is purely unethical and absurd? No one in the world, and certainly not any god in existence, has the right to dictate to other countries what they have to do and what norms they have to respect and implement: the one size fits all of the Monroe Doctrine has to be once and for all sent back to the prop-store of an out-of-use theater.Dr. Jacques COULARDEAUTO DIE IN ORDER TO SURVIVE, WHAT A JOY! Amazon February 11, 2001Kubrick touches a very sensitive subject in this film, a subject that should remind us of man's supreme ability at destroying himself and surviving his own destruction. He points out how any nuclear protocol has a hole somewhere or a loophole to go around any kind of security precautions. Nuclear weapons are our unredeemable doom. They can only lead to a catastrophe. And humanity is such that it will enjoy destroying itself and then mobilize its intelligence to just survive in order to start again. There is no hope what so ever. Kubrick deals with this subject in a very humorous way but every detail is there to show that the patriotic motivation of any man justifies in his mind any possible crime or just folly. Man is a fool and his foolishness can know no end. Dr Jacques COULARDEAU, Paris Universities II and IX."
    },
    {
      "username": "cartesianthought",
      "userUrl": "https://www.imdb.com/user/ur56387266",
      "reviewLink": "https://www.imdb.com/review/rw3471276",
      "warningSpoilers": false,
      "date": "16 May 2016",
      "rate": "6",
      "helpful": "94 out of 163 found this helpful.",
      "title": "...I don't get it",
      "content": "Yeah. It was funny. It was entertaining. It's not a bad movie by any means. I think Kubrick did a great job with the visuals and the settings. Beyond that, it's not very dramatic or suspenseful. There's not much depth or intellect. I laughed modestly a few times, but mostly, the humor consists of lazy military stereotypes. The premise was interesting. I could've done with less cockpit and gun firing scenes. Perhaps the general and his descent into madness could've used more fleshing out. I don't know. It feels like it's missing something. Maybe it's one of these meme movies like Napoleon Dynamite that you either \"get\" or you don't."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw5244353",
      "warningSpoilers": false,
      "date": "8 November 2019",
      "rate": "9",
      "helpful": "9 out of 15 found this helpful.",
      "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
      "content": "'Gentlemen. You can't fight here this is the war room.'Stanley Kubrick is not someone who immediately comes to mind as a director of an absurdist black comedy. Yet he co-wrote and directed Dr Strangelove at a time the cold war was raging in the real world.General Jack D Ripper (Sterling Hayden) who sees a communist plot everywhere has flipped his lid. He has executed a plan that allows him to override the American president and launch a nuclear attack on the Soviet Union.In the war room, the hawkish General Turgidson (George C Scott) sees a tactical advantage on a nuclear first strike against the Soviets. President Merkin Muffley (Peter Sellers) tries to placate the Russian president in a phone call and prevent an all out nuclear war. Although the conversation is always one sided, we never see the Russian president.Colonel Mandrake (Peter Sellers) a British executive officer attached to Ripper tries to stop him but Ripper has gone bat crazy.Finally former Nazi German Dr Strangelove (Peter Sellers) now a scientific advisor to President Muffley has an idea to survive in underground mines and eventually repopulate the planet.It is spooky to think that there are several people like Ripper and Turgidson about serving in various governments around the world. Even Dr Strangelove comes across as real, even with his arm trying to do a Nazi salute. Many ex Nazi scientists were employed by foreign governments after the second world war.It is a grim black comedy about paranoia and it works because everyone is playing it straight. Slim Pickens as Major King Kong was not even aware that this was a comedy.George C Scott plays it broad but still makes Turgidson scary and silly at the same time. He gives a great performance, Sellars gives a better one in three different roles.The film has some great lines, wonderful set design such as the iconic war room and well known scenes such as Pickens sitting on a bomb as it is dropped from a plane."
    },
    {
      "username": "imseeg",
      "userUrl": "https://www.imdb.com/user/ur84924605",
      "reviewLink": "https://www.imdb.com/review/rw4513078",
      "warningSpoilers": false,
      "date": "15 December 2018",
      "rate": "9",
      "helpful": "12 out of 21 found this helpful.",
      "title": "\"Gentlemen, you can't fight in here, this is the war room!\" Silly movie, with a serious message.",
      "content": "Slowburning, satyrical nuclear war comedy about an american general who goes bananas and starts a nuclear attack on his own.The bad: This movie is dated. And it shows: the special effects give me headaches, because they are so clumsily done. And there are lots of those clumsy effects. But it is a comedy, so who cares? Most of the jokes are completely silly, which sometimes irritates me a bit. But hey, it is a comedy, so who cares if it is completely silly now and then. The speed of this story might be way to slow for some viewers, but acting is really great and hilarious, so that evens things out a lot, for me personally.The good: Despite all of these minor flaws that are mentioned above, \"Dr Strangelove\" is still an impressive movie about the total madness of nuclear war. However silly this comedy might be, it has got a serious message for all us viewers: a nuclear war will mean the end of all of us. There are no winners, only losers in a nuclear war, however hard some try to convince us folks of the opposite. This movie is about all those people who think that nuclear war can be good IF we strike first. Because IF WE DON'T have nuclear powers, THEY will have them. These twisted paranoid ideas could mean the end of the world as we know it and director Stanley Kubrick made a great classic comedy about it.When watching this classic movie, one must not forget that the director made this movie in an era in which the americans came close to nuclear war with the russians during the \"bay of pigs\" conflict in Cuba during the sixties. However silly this movie might be, it has got a very serious message about the dangers of nuclear power. THAT particular message is what makes \"Dr. Strangelove\" a timeless classic."
    },
    {
      "username": "justusmcqueen",
      "userUrl": "https://www.imdb.com/user/ur1061483",
      "reviewLink": "https://www.imdb.com/review/rw0081201",
      "warningSpoilers": false,
      "date": "16 February 2001",
      "rate": "10",
      "helpful": "262 out of 394 found this helpful.",
      "title": "The Ultimate Black Comedy",
      "content": "Few films are able to take a deadly serious issue and place it within the context of a broad comedy successfully. Dr. Strangelove does exactly that. Kubrick's masterpiece illustrates in brilliant fashion the idiocy of nuclear war and the idiots who are orchestrating it. What strikes one most however in this cinematic gem are the individual characterisations of Sellers, Scott, Hayden and Pickens. To refer to them as memorable roles is a gross understatement. With names such as President Merkin Muffley, General \"Buck\" Turgidson, General Jack D. Ripper and Major T.J. \"King\" Kong, you know that these characters will not be soon forgotten. Other features of the film such as the remarkably designed \"war room\" set, the hand-held camera techniques employed by Kubrick and the black and white cinematography of Gilbert Taylor only add to the power and impact of \"Strangelove.\" Quite simply, the greatest American film by the greatest American director."
    },
    {
      "username": "Bored_Dragon",
      "userUrl": "https://www.imdb.com/user/ur56005872",
      "reviewLink": "https://www.imdb.com/review/rw4436818",
      "warningSpoilers": false,
      "date": "4 November 2018",
      "rate": "5",
      "helpful": "10 out of 17 found this helpful.",
      "title": "I'm glad Kubrick gave up on comedy",
      "content": "I understood sarcasm and the message this movie brings, but the idea doesn't make a good movie. This was one of the most boring movies I have ever seen, and I've seen thousands. In what universe this may pass as a comedy?! Besides a few mediocre jokes, most of it wasn't funny at all. I barely endured to the end and I wouldn't watch it again even if my life depended on it. For entertainment qualities I would rate it zero out of ten, but because the essential idea is good I'll compromise with4,5/10"
    },
    {
      "username": "thinker1691",
      "userUrl": "https://www.imdb.com/user/ur3902771",
      "reviewLink": "https://www.imdb.com/review/rw1968964",
      "warningSpoilers": false,
      "date": "1 November 2008",
      "rate": "9",
      "helpful": "27 out of 55 found this helpful.",
      "title": "\" Mr. President , . . We Must Not Allow a Mine-Shaft Gap!!! \"",
      "content": "In all the years of film making, Peter Sellers never disappointed an audience. No matter what the part, he always seem to find the perfect voice and therefore, his character. If you put him together with other equally great character actors like, George C. Scott who plays maniacal Gen. 'Buck' Turgidson and Sterling Hayden as the insane Brig. Gen. Jack D. Ripper (Jack The Ripper?) and the Slim Pickens as Maj. T.J. 'King' Kong, James Erle Jones as Lt. Lothar Zogg, the bombardier and Peter Bull as the Russian Ambassador Alexi de Sadesky, then you not only have an award winning film, but the secret formula for a Classic. The story is set in the sixties, during the Cold War and a lunatic Air Wing Commander intentionally gives the \"Gold Code Signal for his wing to attack Russia. What follows is a dramatic minute ticking film, designed to illuminate the military's ignorance, stupidity and final acquiescence of the doomsday, 'Fail-Safe' device. The entire movie is a comedy of errors and one reflected of Standly Kubrick's genius. The one sequence where Major Kong rides a nuclear missal to its target is synonymous with the mentality of the pentagon. Through the passage of time, this superb movie has not only become a Dark Classic, but a possible statement of the future reality of the human race. ****"
    },
    {
      "username": "RufusT",
      "userUrl": "https://www.imdb.com/user/ur0156574",
      "reviewLink": "https://www.imdb.com/review/rw0081235",
      "warningSpoilers": false,
      "date": "19 January 1999",
      "rate": "10",
      "helpful": "95 out of 161 found this helpful.",
      "title": "Outstanding, timeless classic!",
      "content": "One of the best films ever made, this remains timeless despite changes in technology, foreign policy and world politics; the military/political madness remains the same. Gets better all the time, with successive viewings and its luster has not dimmed since its first release.With three show-stopping performances from Sellers (amongst his best work, if not THE BEST), and an unexpectedly hilarious turn by George C. Scott (if Sellers weren't SO dead on-target, Scott would easily steal the show), STRANGELOVE is filled with cartoonish, over-the-top characters that, despite the lunacy, still ring true. Special mention must be made for Sterling Heyden's controlled, brooding paranoia as General Jack D. Ripper. He's funny, he's scary.All-in-all, a brilliant piece of work by all involved."
    }
  ],
  "errorMessage": ""
}