{
  "imDbId": "tt0118715",
  "title": "The Big Lebowski",
  "fullTitle": "The Big Lebowski (1998)",
  "type": "Movie",
  "year": "1998",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3348121",
      "warningSpoilers": false,
      "date": "3 November 2015",
      "rate": "",
      "helpful": "475 out of 546 found this helpful.",
      "title": "The film with the highest rewatchability factor of all time",
      "content": "It's actually kind of hard to describe this movie (and what's so great about it) to people who don't already know it and love it; as with many cult films, The Big Lebowski will either speak to you (in which case you will become a fervent follower of His Dudeness and abide by his code for the rest of your life) or, if it doesn't, the film will either leave you completely indifferent or you'll even downright hate it.I believe it's a very funny film and I'm sure it can be rightfully called a comedy, but don't expect punchlines, gags, jokes or slapstick - it's not that kind of comedy. If you want to enjoy this film, you have to meet Jeffery \"The Dude\" Lebowski on his terms, hang out with him and his bowling buddies and follow them at a their (perhaps somewhat leisurely) pace through this weird and unbelievable tale about nihilism, theft (of a car and, more importantly: a Creedence Clearwater Revival tape), kidnapping, abstract art, porn and - of course - bowling. The story is actually kind of simple. You see, some no-good German nihilists urinated on The Dude's rug - and this kind of aggression just won't stand against The Dude. With the help of his bowling buddies, he will do everything in his power to get someone to pay for his rug - or possibly get a new one (because that rug really tied the room together). So he embarks on this worthy quest during which he will encounter many wondrous things and fascinating people (even Jesus - who is NOT the messiah but a very naughty man).With Jeff Bridges in the leading role, the Coen brothers have found the perfect actor to incorporate one of the most iconic characters that has ever been created. But it's not just The Dude that makes this a winner; the whole film is such an inspired folly and simply inventive filmmaking at its finest (the hilarious dream sequence alone is worth the price of admission). The supporting cast is outstanding (J.Turturro, J.Goodman and S.Buscemi among many others), the song choices are perfect and the dialog is the funniest, most quotable in any comedy I've ever seen. This - for me - is without a doubt the film with the highest rewatchability factor of all time. 10 stars out of 10.Favorite Films: http://www.imdb.com/list/ls054200841/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/"
    },
    {
      "username": "OttoVonB",
      "userUrl": "https://www.imdb.com/user/ur1559834",
      "reviewLink": "https://www.imdb.com/review/rw0406938",
      "warningSpoilers": false,
      "date": "5 December 2002",
      "rate": "10",
      "helpful": "156 out of 191 found this helpful.",
      "title": "The Most Quotable Film of All Time",
      "content": "Those Coen brothers have an ear for language. You feel it in the sing-songy banalities of Fargo, and in the noiresque machine-gun dialogue of Miller's Crossing, but neither of these can prepare you for the feast for the ears that is The Big Lebowski.Channeling the opaque mysteries of Raymond Chandler, the Coens throw LA resident bum and Bowling aficionado Jeff Lebowski (\"The Dude\" to his friends) into a strange triple-crossing case of kidnapping, ransoms, nihilists and urinated-upon rugs. It is the equivalent of throwing unrelenting forces at an immovable object, the Dude's bemused stoicism at constant odds with the world around him. He'd much rather be bowling with crazed Vietnam Vet Walter (John Goodman) and pure silent soul Donnie (Steve Buscemi).As with so much of the Coens' output, style is more than half the point: not just visual, though ace DP Roger Deakins paints an alluring canvas, but tonal and auditory. This is an insanely funny head-trip of a movie, with wonderfully idiosyncratic characters, down to the smallest part. Who better than the Coens to reinvent the comedy of errors?This is without a doubt one of their very best, a personal favorite, an unmissable film and the kind of experience that will plant an indelible smile on your face. Do yourself and see this now, if you haven't already."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0406945",
      "warningSpoilers": false,
      "date": "27 December 2002",
      "rate": "",
      "helpful": "386 out of 529 found this helpful.",
      "title": "My favourite Coen brothers movie and one of the most entertaining and original comedies ever made!",
      "content": "My favourite Coen brothers movie changes over the years as I watch and rewatch their amazingly original and consistently surprising oeuvre. When I first saw 'The Big Lebowski' on its original release I enjoyed it but thought it was a bit of a slight \"fun\" movie with less depth than many of their previous works. Now, a few years and several viewing later, I have come to realise just how accomplished a movie it is, and it has become one of my all time favourite movies. Other film makers have attempted to weave together various genres, styles and images in a similarly eclectic, postmodern fashion, but few do it as seamlessly and with such wit as Ethan and Joel Coen. 'The Big Lewboski' is an extremely smart film, but it doesn't shout \"look at me! Aren't I clever?\". It sucks you in from the get go, and bottom line it is FUNNY, and as it is a comedy that's what counts the most! Everything about the movie is perfect, the script, the direction, set design, costumes, and the wonderful soundtrack (one of the most brilliant ever assembled, it includes lesser known Dylan and Elvis Costello numbers, Creedence classics, and songs from cult favourites like Yma Sumac, Captain Beefheart, Moondog, Esquivel and garage gods The Monks). Plus of course the actors, who are well cast and virtually flawless. Jeff Bridges ('Fat City', 'Starman') IS The Dude, and it's impossible to think of anyone else acting the role. Coen regulars John Goodman, Steve Buscemi, John Turturro, Peter Stomare, and Jon Polito are all on board, as well as Julianne Moore ('Boogie Nights'), David Huddleston ('Capricorn One'), Philip Seymour Hoffman ('Magnolia') and Sam Elliot ('Mask'), even surprise cameos from Ben Gazzara ('The Killing Of A Chinese Bookie') and singer Jimmie Ray Gilmore. I can't fault 'The Big Lebowski', it is one of the most original and entertaining comedies ever made and a genuine modern classic. It's movies like this that keep me watching despite the endless mountain of mindless garbage that Hollywood continually spews out. If only every movie in the box office Top Ten was as inspired and amusing as this one!"
    },
    {
      "username": "butterfinger",
      "userUrl": "https://www.imdb.com/user/ur2938199",
      "reviewLink": "https://www.imdb.com/review/rw0947647",
      "warningSpoilers": false,
      "date": "16 October 2004",
      "rate": "",
      "helpful": "649 out of 847 found this helpful.",
      "title": "Simply Beautiful",
      "content": "It's a travesty that most critics only read The Big Lebowski at its most superficial level and called it a modern take on a Raymond Chandler potboiler. I simply can't begin to perceive how one could sit down in front of this cinematic pop-poetry, as it plates gold on the silver screen, and not feel so incredibly alive. The dream sequence Busbee Berkley musical numbers are unique and awe-inspiring; the humor is rich, subtle, and clever in the way it satirizes politically correct arrogance; the free-flowing story avoids (even pokes fun at) nonessentials like plot points and pay-offs. But what really makes this film such a masterpiece, such a panacea, is the incredible humanism, the care that the Coen brothers put in developing The Dude (Jeff Bridges), Walter (John Goodman), Donnie (Steve Buscemi-tremendously endearing), and Brandt (magnificently played by Phillip Seymour Hoffman). Looking at the films use of Sam Elliott to play The Stranger, who constantly rambles about the many wonders of The Dude (among other things), it is clear that the film is an ode to a Dudist way of life. And in a time where so many film promise that they have the answer to the worlds problems and end up as slick, stylistic show-off films, what more could one ask for than a good-hearted film like this? Not to mention the performance by Jeff Bridges, which ranks among the best performances of the nineties; he has a relaxed slouch, a goofy smile, an enthusiastic dance, and his buttons can only be pushed by Walter, who John Goodman plays with charm and fury. The Coen brothers have always been considered 'cold' filmmakers, but there is nothing here but warmth and humanity (as is the case with the Coens' Fargo). What we have here is one of the greatest achievements in modern cinema and if you can't see that, grab a White Russian, hit the bowling ally, and find your inner-Dude as soon as possible."
    },
    {
      "username": "trashgang",
      "userUrl": "https://www.imdb.com/user/ur12844960",
      "reviewLink": "https://www.imdb.com/review/rw6808733",
      "warningSpoilers": false,
      "date": "12 April 2021",
      "rate": "8",
      "helpful": "24 out of 30 found this helpful.",
      "title": "indeed a cult classic",
      "content": "More than 20 years it took me to have a look at this cult classic. Finally did it and I do undestand the fuss about it.Not a flick for everybody that I can tell because a lot of talking is done but it's the talking that starts to get funny after a while. In fact, a bunch of loser trying to solve a abduction and trying to hold the money for themselves goes terribly wrong.After a while you even want the talking to go on and on. And some art flick here and there it was indeed a hell of a ride, funny, stupid but genious in its kind.Gore 0/5 Nudity 1/5 Effects 3/5 Story 4/5 comedy 2/5."
    },
    {
      "username": "Amyth47",
      "userUrl": "https://www.imdb.com/user/ur45390749",
      "reviewLink": "https://www.imdb.com/review/rw4416525",
      "warningSpoilers": false,
      "date": "24 October 2018",
      "rate": "9",
      "helpful": "10 out of 12 found this helpful.",
      "title": "The Dude Abides...!",
      "content": "My Rating : 9/10You either hate it or love it. I am in love with 'The Big Lebowski'! I love most of the Coen Brothers' work and this one is right up there with Fargo and No Country For Old Men. It's super funny and can be watched again and again. I think I watch it once a year and always have a great time.One that I highly recommend. Go watch it! And then watch it again and again.AN AWESOME CULT FILM."
    },
    {
      "username": "Coxer99",
      "userUrl": "https://www.imdb.com/user/ur0257957",
      "reviewLink": "https://www.imdb.com/review/rw0406846",
      "warningSpoilers": false,
      "date": "24 February 1999",
      "rate": "10",
      "helpful": "232 out of 390 found this helpful.",
      "title": "The Dude Abides!!!",
      "content": "No movie has entertained me more in the last year than this film. It's delightfully written, directed with poise and acted with extravagance and excellence. I do admit that this is a film that I had to see six times to get. Every time I watch it I learn something new. The genius of the film lies within a game I think the Coen brothers play with their audiences. There are the touches of the masters in many of their films. In \"The Hudsucker Proxy,\" it was Preston Sturges and Frank Capra. In \"Raising Arizona,\" I felt a touch of Sam Fuller. In this film, I felt many touches of greatness, but more specifically I felt John Sayles or even John Cassevettes in spots. The camera was manipulated beautifully and I felt a tinge of their talents lurking in at many a turn. The performances are astounding, especially Goodman as the deranged bowler still living deep within the jungles of the Vietcong. Huddleston is also quite wonderful as the title character. Turturro gives a fine cameo as \"Jesus,\" coupled with a rousing and humurous version of the Eagles, \"Hotel California,\" done in Espanol. I hope this is a film that is looked at with more seriousness. It is, once you dig deep, a fine piece of filmmaking."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2198959",
      "warningSpoilers": false,
      "date": "28 January 2010",
      "rate": "9",
      "helpful": "24 out of 36 found this helpful.",
      "title": "A wonderful film...with the word f#@$ used 102030841 times!",
      "content": "I tried watching this film on TV a few years ago, but I made the mistake of doing so with my kids nearby. In the first 10 minutes of so, I heard 'f#@$' (a word you are NOT allowed to use even once on IMDb) dozens of times. Realizing that the film was NOT family-friendly, I turned it off despite all the very positive reviews I'd read for it. However, considering I've seen all the Coen Brothers films except this one, I knew that eventually I'd get back to seeing it. Nearly a decade has passed, and I finally got around to seeing this cult favorite.Considering that there are nearing 1000 reviews for this film, I won't bother discussing the plot--it's been explained to death. Besides, the plot, believe it or not, is not all that important. As a mystery film, the mystery is figured out early in the film. So, despite this, why is the film so good--good enough that I gave it a 9 and many consider it their favorite film ever? Well, the Coen Brothers' bizarre and surreal style really make this film and off the top of my head I can only think of two of their films I liked better, THE HUDSUCKER PROXY (their most underrated film) and OH BROTHER, WHERE ART THOU? (their film that gets better with each viewing). This is very good company, as these two other films are absolutely brilliant--and I consider THE BIG LEBOWSKI to be much more interesting that the much ballyhooed FARGO (which, inexplicably, won two Oscars--despite not being among the brothers' best films because it's way too normal--sort of like a Coen Brothers film for those who don't get the more bizarre Coen Brothers films).What, in particular, did I like? Well, the characters were THE best part of the film--as only the Coens can create such quirky and unique characters. Simply put, there is no one like Lebowski in any of the thousands and thousands of films I'd seen before--and uniqueness is something I value most in a film. The alcoholic, lazy and hopelessly pathetic guy is like no hero you'll ever see in a film! The usual quirky characters are here as well--in spades! What I also loved were the little movies within the movie. When Lebowski got knocked out, you got to see his bizarre dreams that were more like films than dreams--particularly the one later in the film that just killed me it was so funny and stylish. Believe it or not, the dream is a phallic-filled song and dance film...directed by a famous porno director (though without actual nudity). It just has to be seen to be believed and only HUDSUCKER PROXY had stranger and more entertaining interludes. In fact, I found myself laughing out loud at this great scene...and a few more.Overall, a highly imaginative and wonderfully quirky film with very little plot and gobs of cursing. NOT family-friendly or a film to show your mother (unless you DO want to give her a heart attack), but still well worth seeing. Oh, and by the way, the version often shown on TV recently is an edited version with many of the expletives removed. The original actors provided alternative words for the f-bomb and it's done reasonably seamlessly. Frankly, I don't think it hurts the film and you still get to hear words like penis which have not been changed."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw3155863",
      "warningSpoilers": true,
      "date": "4 January 2015",
      "rate": "10",
      "helpful": "34 out of 52 found this helpful.",
      "title": "It's good knowin' he's out there. The Dude. Takin' 'er easy for all us sinners.\"",
      "content": "Looks like while making \"The Big Lebowski\" (1998)– weird, nutty, outrageously funny and deliciously twisted movie, the brothers Ethan and Joel Coens, known for their unique and dry humor, sat back, laughed out loud, and had fun. \"Big Lebowski\" turned as one of the funniest comedies ever made. It is funny because of the incredibly off-beat characters, their weirdness, flaws, their interactions, the surreal situations they found themselves in, and perfectly written and delivered hilarious dialogs. There is the story, of course, which is based on the case of mistaken identity with the following kidnapping, villainous nihilists, vanguard erotic flying painter, the bowler named Jesus but the story is truly secondary to the delicious craziness of the movie.Some reviewers call Big Lebowski misfire and deranged mess, saying that the story is convoluted with the characters we would not care about a bit. It was also interesting to read the reviews that were written upon its release and compared it to Coens' \"Fargo\" that had been made a year earlier than the adventure of Jeffrey \"the Dude\" Lebowski (Jeff Bridges).\"Fargo\" could be Coens' masterwork but it does not make Lebowski any worse. It was dismissed as the inferior film and was predicted not to stand the future re-watch. The time has proved the predictions wrong. \"The Dude\" Lebowski - middle-aged pot smoking, White Russian drinking, bowling enthusiast ex-hippie, and his friends, Polish Catholic converted Jew, \"more Jewish than Tevye\" Vietnam veteran Walter with anger management problems (John Goodman) and timid, little slow, \"sweet prince\" Donny (unusually quiet Steve Buscemi) have become the cult figures, the beloved characters, for millions of film lovers of different generations, not only the baby- boomers.The Coen Brothers have made twenty films, and all of them are treasure, including their contribution in the 2006 anthology, Paris, je t'aime. I've seen all their films and I want to repeat the title of my review on their latest, \"Burn after reading\" - The Coen Brothers don't make bad movies, because they don't know how. Their films, Including the cult favorite, Big Lebowski, should not be missed. They are clever, darkly funny, and beautiful without being pretty pictures. In short, they are first class entertainment."
    },
    {
      "username": "innocuous",
      "userUrl": "https://www.imdb.com/user/ur2362867",
      "reviewLink": "https://www.imdb.com/review/rw2034954",
      "warningSpoilers": false,
      "date": "9 March 2009",
      "rate": "4",
      "helpful": "104 out of 174 found this helpful.",
      "title": "I just don't get it.",
      "content": "TBL is not a terrible movie, but I apparently just don't get it. My lady-friend's daughter is always telling her that she should see TBL in order to understand some of the \"in-humor\" and comments of her generation. I kept telling my friend that I really didn't think that the movie would be what she expected, but we watched it together anyway. (I had already seen it a couple times.) My friend was flabbergasted, as she couldn't identify any phrases, humorous scenes, or references that she had ever heard or seen her daughter's group use. She didn't like the movie, either, and was actually checking to make sure that it was the same movie her daughter had recommended.I feel the same way. Frankly, this movie is boring and pretentious. I love most of the Coens' work, but not this film. It goes into a category, along with \"Young Frankenstein\", of movies about which other people make a fuss and I just don't get. Maybe I'm slow.Anyway, if your idea of fun is watching a laid-back dude drink White Russians and a lot of unnecessary one-dimensional characters get layered on, go ahead. It's just not my cup of tea."
    },
    {
      "username": "cleaf",
      "userUrl": "https://www.imdb.com/user/ur3224215",
      "reviewLink": "https://www.imdb.com/review/rw0407064",
      "warningSpoilers": false,
      "date": "28 March 2004",
      "rate": "10",
      "helpful": "819 out of 1,046 found this helpful.",
      "title": "You can watch it a million times, and yet, it will never get old",
      "content": "The Big Lebowski is the type of movie that is so funny, and so clever, you want nothing more but to meet the Coen brothers, congratulate them personally for their unique talent, and get inside their heads and find out what makes these two geniuses \"tick\". The main characters are Jeff Bridges (who plays such broad roles like The Muse, The Contender, and Sea Biscuit), John Goodman (who should have won an oscar for best supporting actor for his character, Walter Sobchak)Juliane Moore (Maude Lebowski)and Steve Buscemi (who is unique in every Coen Brother movie).The first time I saw this movie, I will admit that I enjoyed it, but did not fully appreciate its level of humor and raw talent. I thought the middle section was a bit too depressing and long. But trust me, this is a movie that gets more funny every time you see it, even if it's your thousandth time seeing it. Its level of comedy, action, brutality, and vulgarity become that much more evident and important.The characters are brilliantly written by the coen brothers, and, likewise, are brilliantly portrayed by the actors. The Big Lebowski is like no other film. It will make you laugh and it will make you cry. There is no other film such as TBL that is sharp and witty all the way through. One of the Joel and Ethan Coen's best, and one of the movie industry's best comedic film of all time. You want to go see this flick."
    },
    {
      "username": "Ricky_Roma__",
      "userUrl": "https://www.imdb.com/user/ur5767111",
      "reviewLink": "https://www.imdb.com/review/rw1187624",
      "warningSpoilers": false,
      "date": "5 October 2005",
      "rate": "",
      "helpful": "66 out of 106 found this helpful.",
      "title": "The Deadbeat Lebowski",
      "content": "How can anyone not dig The Dude? In a world where energetic go-getters are idolised and looked up to, it's nice to know that there are fat, indolent, scruffy, pot smoking, beer drinking bums out there taking it easy. Or they would be if people would leave their rugs alone The Big Lebowski is a film where the plot is entirely inconsequential; it doesn't matter. It's just a mere device to set The Dude on his way. The joy is in watching him interact with all the weirdos in Los Angeles and in listening to the dialogue  the script is the most quotable since Withnail and I. Therefore it's the perfect film to just sit back and absorb.Picking a favourite scene in a film that is jam packed with great moments and wonderful lines of dialogue is a near impossibility, but you'd be hard pressed to beat the scene with the Malibu police chief. \"I don't like your jerk-off name. I don't like your jerk-off face. I don't like your jerk-off behaviour. And I don't like you jerk-off.\" And then to cap it off he throws his mug at The Dude's head. Brilliant! And making it even funnier is the scene that immediately follows it where the taxi driver throws The Dude out of his cab.But another favourite is Jesus. He only has two scenes but both are hilarious. (I hope the Coens make 'The Passion of the Jesus.') And I love the flashback where you see him knocking on doors to tell his neighbours that he's a pederast. Especially good is the way that a large, bearded man with a dirty shirt answers the door (I always crack up at the breath Jesus takes when he sees the man  I also noticed, for the first time, that Jesus in that flashback is visibly showing in his tight jeans; he's not a small guy).But then there's the scene where The Dude first meets Maude Lebowski (excellently played by Julianne Moore). \"I'm sorry if your stepmother is a nympho, but \" And I also like the little dig at the porno film they're watching: \"The plot is ludicrous.\" But the comment isn't really aimed at the porno film; the film is talking about itself. It knows the plot is nonsensical but it also knows that it doesn't matter  it's best to just let it wash over you.Mentioning porno has reminded me of Jackie Treehorn. Is there a better visual gag in modern cinema than The Dude scratching a notepad for a message or telephone number only to find a cartoon of a man with a gigantic erection? Well, maybe there is, because even earlier in the film there's the moment where The Dude spends a long time making a homemade device to keep intruders out only for him to forget the fact that his door opens outwards instead of inwards  he nails a bit of wood to the floor, props a chair up to the door handle to keep people out and the very second he walks away, the door opens and the chair comes tumbling down. Pure genius! And Jackie Treehorn's brainless goons are brilliant too. \"You're not dealing with morons here.\" Oh yes we are. But the film's all the better for it.But I'm not sure what my favourite line in the film would be  again it's almost impossible to pick just one. But \"I still jerk-off manually\" would have to be up there, as would virtually every line Walter spews (\"The Chinaman is not the issue \"). However, if I was forced (at gunpoint) to choose, I'd have to go with a piece of Dude wisdom: \"Fortunately, I'm adhering to a pretty strict, uh, drug regiment to keep my mind, you know, uh, limber.\" And The Dude's reaction when Maude tells him that she's trying to conceive is magnificent.Yet another brilliant scene is the Larry scene. Walter and The Dude are trying to get information out of some kid but the kid just stares impassively at them, so Walter destroys his car  or what he thinks is his car. Now at this moment I could quote the real dialogue, but the TV version dialogue is perhaps even better. \"Do you see what happens, Larry? Do you see what happens when you find a stranger in the Alps?\" It's even better than: \"Fun you, melon farmer!\" Then there are the nihilists. \"We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your johnson.\" But try as they might to intimidate, the only scary thing about the nihilists is the techno music they listen to. Well, that and their obsession with the male member.But I could quote lines from The Big Lewbowski all day. I just dig the film so much because it puts a goofy grin on my face; its stupidity is remarkably intelligent. Plus, in the end, it's actually quite heartfelt  if the film's about anything, it's about friendship well, that and smoking pot, drinking beer, bowling and keeping hold of your johnson. Yeah, the world's a better place with The Dude in it."
    },
    {
      "username": "bandw",
      "userUrl": "https://www.imdb.com/user/ur0171876",
      "reviewLink": "https://www.imdb.com/review/rw2790910",
      "warningSpoilers": false,
      "date": "1 May 2013",
      "rate": "2",
      "helpful": "110 out of 204 found this helpful.",
      "title": "The Big Bust",
      "content": "I recently saw an interview with Jeff Bridges where he commented that he has become personally identified with \"The Dude,\" the character he plays in this movie. He also noted that \"The Big Lebowski\" has developed a cult following. The interviewer added some praise. That, together with the high rating on IMDb, convinced me to give this a shot. Early on I realized that the story was not to be taken seriously. This movie is a series of loosely connected comedy sketches (well, some hardly connected at all). The result is an absurdest comedy that had very few laughs for me.I did not find The Dude at all appealing as a person. How much is there to admire in someone whose life goals seem to be bowling and drinking white Russians? I do give Bridges credit for inhabiting the role. John Goodman's character really grated on me--his passions seem to be bowling and the f word. The positives: the scenes with John Turturro gave me some laughs; the scenes filmed from within a bowling ball were an interesting curiosity; some non sequiturs were worth a few chuckles.I guess one person's humor is another person's tedium. I found this movie to be tedious."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6193626",
      "warningSpoilers": false,
      "date": "21 October 2020",
      "rate": "9",
      "helpful": "14 out of 22 found this helpful.",
      "title": "Characters, Plot, Dialogue...",
      "content": "... roll them into a smoke and ignite, if these necessary constituents of any great film burn bright, take a long deep draw and savour their infusion. This original, unique and superbly performed film does just that - something to be relished and luxuriate within while allowing you to put life's irritants into perspective."
    },
    {
      "username": "CuriosityKilledShawn",
      "userUrl": "https://www.imdb.com/user/ur0102816",
      "reviewLink": "https://www.imdb.com/review/rw0406597",
      "warningSpoilers": true,
      "date": "25 September 1998",
      "rate": "6",
      "helpful": "37 out of 69 found this helpful.",
      "title": "You see what happens, Larry?",
      "content": "It's hard to pick out one line of dialogue in particular for two reasons. One-almost everything said in this film is downright hilarious. And Two-the F word is spoken 281 times so there's not many sentences that don't contain it. 144 sentences also end in 'man'.Jeff 'The Dude' Lebowski is a man living a minimalistic existence. He has no job, no ambitions and no worries. His days, be they weekdays or weekends, are spent bowling, driving around or having the occasional acid flashback. His pals are Walter Sobchak, a security expert and half-crazed Vietnam vet and Donny, a humble, mousy little man who is left out of almost every conversation.The Dude is happy with his easy-going life of nothingness until two thugs ambush him in his house believing him to the OTHER Jeff 'The Big' Lebowski, the millionaire with a trouble-making wife who owes money all over town. These thugs are none too happy with their dumb error and re-assert themselves by peeing on The Dude's rug.This very much displeases The Dude as this rug really tied the room together and since he cannot track down the 'Chinaman' thug responsible he decides to take it out of the Big Lebowski, as it's now HIM who owes a new rug. The Dude is welcomed into the Big Lebowski's mansion by Brandt the butler, a man so appallingly sycophantic he'd make Weylon Smither's look bad. But his millionaire namesake is not so ready and willing to give hand-outs and basically tells The Dude to get lost.At this point things become quite complicated as a bunch of ex-pop star Nihilist thugs, a powerful pornographer, a dejected feminist daughter, a Brother Seamus (NOT an Irish Monk), a joyriding teenager, a revolting pederast champion bowler, Saddam Hussein, a mysterious cowboy and a doctor who is insistent on him removing his shorts all make The Dude's life suddenly a helluva lot more interesting. The plot thickens and thickens and the dude is dragged to dozens of different places across LA, going from limo to limo, never too far from a white Russian or a doobie.There are zillions of idiosyncrasies in this film that keeps it new and interesting every time you watch it. Every scene and every line of dialogue is so memorable that, like me, you'll be acting the film out for years. Even on a 100th viewing you'll notice dramatic ironies, character arcs and ingenious wordplay that went right over your head before.The acting is superb. I am a fan of Jeff Bridges but he completely disappears in this film. He truly BECOMES The Dude and shows little of his recognisable self. John Goodman, in probably the most under-rated role of his career, is the world's angriest man. Bringing frustration and smart-ass arrogance to every scene (though he's almost always right). Set well over a decade after 'nam (and during the first Gulf conflict) Walter seems to be suffering from perpetual, ever-lasting post-traumatic stress syndrome as he blows up in any situation. Take a look at his 'minor' confrontation with Smokey for example.It's not about plot, or even characters. It's about a certain moment in time, the early 90s. And the definitive man of that time was the Dude. The rug-peeing just happened to occur simultaneously."
    },
    {
      "username": "boe_dye",
      "userUrl": "https://www.imdb.com/user/ur15899300",
      "reviewLink": "https://www.imdb.com/review/rw2118923",
      "warningSpoilers": false,
      "date": "29 August 2009",
      "rate": "1",
      "helpful": "256 out of 487 found this helpful.",
      "title": "boe_dye sez: it wasn't funny, it wasn't not funny, it wasn't much of anything really",
      "content": "Certain movies you can sort of understand why they are cult classics, other films such as this one, seem to be funny and intelligent because someone said it was funny and intelligent and therefore must be funny and intelligent.I suppose you could find deeper meaning in this, or perhaps the meaning was right there on the surface. But like many of the Coen Brothers films that I have watched I either like them or I don't.The ones that I liked usually have a strong story behind them, the ones that I don't like seem to be more of a \"day in the life of\" story about people who really don't seem to matter and about events that no one really cares about.Maybe there is some type of amusement in trivial matters, making bored college frat boys feel more intelligent then they really are, but I need something deeper for intellectual stimulation.For my comedy, I don't need slapstick or pie in the face humor to make me laugh. Cynicism, witty dialogue, sarcasm, commentary and so on, not one line random events that happen out of no where with no real context and then expected to be funny.(which is not to say that slapstick pie in the face humor doesn't make me laugh at times...) A very random film with very to little no substance to it. A few quirky one liners here and there, but in all honesty I was more looking at the clock waiting for this film to end then I was looking at the film waiting for it to be entertaining.Yet for some reason it has a cult following and there it is... However one should keep in mind that cults generally comprise of brainwashed individuals who really can't think for themselves anyways and generally follow wherever they are pointed to like mindless sheople..."
    },
    {
      "username": "michael_the_nermal",
      "userUrl": "https://www.imdb.com/user/ur10840477",
      "reviewLink": "https://www.imdb.com/review/rw1836674",
      "warningSpoilers": true,
      "date": "10 March 2008",
      "rate": "1",
      "helpful": "322 out of 634 found this helpful.",
      "title": "What's the Point? It isn't funny",
      "content": "Spoilers ahead.I frankly do not understand why \"The Big Lebowski\" has been elevated to the point of being considered one of the best cult classics of all-time. Why this cult around the character of \"The Dude\", one of the blandest, flavorless, most uninteresting comedy protagonists ever to be put on celluloid? He's simply some dopey hippie who loves to hang around a John Goodman cardboard-cutout Vietnam vet gone loco (real Vets should raise their fists in anger over such an overdone, unfunny, disrespectful and insulting characterization) and a seldomly-seen Steve Buscemi, who doesn't really do much. The plot winds into so many different twists and turns and includes so many supporting characters, all of whom seek The Dude's bag of money, that trying to understand this movie is like trying to untangle the Gordian Knot by hand. What's the point of placing layer upon layer upon layer of weird, uninteresting characters to the point that you forget what the hell this movie is about? Nihilist German rockers? Some sicko Hugh Hefner clone? A gorgeous yet incomprehensible avant-garde artist who wants to have \"The Dude's\" baby? A strange drugstore cowboy who serves as some sort of Greek chorus? Stop it! \"Pee-Wee's Big Adventure\" had an array of weird characters, but it succeeded because it had a straightforward plot and brilliant acting and writing. The Coen's monstrosity has little wit or signs of superb comic writing, and all of their characters, though weird, are totally boring and flavorless. For weird characters to work, they must act totally off-the-wall and twisted beyond realism. The weirdos in \"Lebowski\" are actually regular, and seem like a mish-mash of all-too-real rejects from a yuppie coffee bar.Who likes this stuff? I have just seen \"No Country for Old Men\", and, like \"Lebowski\", that was poorly written in terms of a smooth plot; and, like \"Lebowski\", lacked any interesting characters. I'll give \"Fargo\" a chance; otherwise, the Coen Brothers ain't reeling me in with their weird, clunky movies."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3058510",
      "warningSpoilers": false,
      "date": "30 July 2014",
      "rate": "6",
      "helpful": "22 out of 40 found this helpful.",
      "title": "unique, weird, but not that funny",
      "content": "It's 1990. Jeff Lebowski (Jeff Bridges) is a lazy bum who insists on being called Dude. Two thugs break in to shake him down and pee on his rug. They soon realize they're mistaken. They're looking for the millionaire Jeffrey Lebowski (David Huddleston) whose young wife Bunny ran up a debt. The Dude's unstable friend Walter Sobchak (John Goodman) convinces him to go see the rich Lebowski for compensation for the rug. Later Bunny is kidnapped for a $1M ransom. Rich Lebowski asks the Dude to do the ransom hand off. Walter tries to double cross the kidnappers but the drop off goes terribly wrong. The money is stolen. All the while, the Dude and Walter is in a bowling tournament with Donny Kerabatsos (Steve Buscemi). Maude Lebowski (Julianne Moore) is Lebowski's daughter who wants the Dude to recover the money from the kidnappers.This is crazy Coen movie. This is a weird black comedy. It reminds me of the craziest parts of 'Raising Arizona'. It's a little too meandering with weird characters coming in every few minutes. This is much more weird than funny. I found only a few big laughs like the fking toe. On the other hand, it is completely unique. A lot of it is weird for weird's sake. It's a lot of weird. I get the sense that this is a great movie to have a good smoke while watching it."
    },
    {
      "username": "southdavid",
      "userUrl": "https://www.imdb.com/user/ur0715971",
      "reviewLink": "https://www.imdb.com/review/rw4360846",
      "warningSpoilers": false,
      "date": "25 September 2018",
      "rate": "9",
      "helpful": "6 out of 8 found this helpful.",
      "title": "A Perfect Strike !",
      "content": "Recently given a one night cinematic return to mark 20 years since its initial release. \"The Big Lebowski\" remains on the highpoints of the Coen Brothers remarkable career of excellence. Their farcical homage to Raymond Chandler stars Jeff Bridges, as \"The Dude\" whose real name, Jeff Lebowski drags him into a plot to ransom the wife of his namesake, played by David Huddleston. Blackmailers come to the wrong address, rugs are pissed on and threats are made. Eventually the \"Big\" Lebowski chooses \"The Dude\" to be the bag man for the ransom drop off. A decision that all involved soon come to regret. Twenty years has allowed me to watch \"The Big Lebowski\" a few times, and to be fair it's a film that improves with each watch. The plot is nothing special, in fact it's almost non-existant. The character revolve around each other and at the end of it you're no wiser as to who, if anyone, actually kidnapped Bunny (Tara Reid) or what happened to the $1M dollars. . But you come to appreciate that the plot isn't as important as the characters and what characters they are. Jeff Bridges gives a career best performance as \"The Dude\".... Mumbling and \"man-ing\" his way through the film, which belies the wit that he sometimes allows a glimpse of. It is one of the funniest, most quotable movies of all time. Full of the Coen's regular acting troop, some of whom show up for just one or two scenes, make their memorable mark and then are never heard from again. It is a stone cold classic, and we'll still be watching it in another twenty years."
    },
    {
      "username": "davispittman",
      "userUrl": "https://www.imdb.com/user/ur58619720",
      "reviewLink": "https://www.imdb.com/review/rw3224093",
      "warningSpoilers": false,
      "date": "21 April 2015",
      "rate": "2",
      "helpful": "51 out of 100 found this helpful.",
      "title": "I don't understand why this is loved by so many!",
      "content": "This movie is truly awful! It's supposed to be some legendary comedy, but it IS NOT funny! This movie is just really weird and stupid. Literally nothing makes sense in it, i hate every character except Julianne Moore's. The dude is so stupid and annoying, and so is John Goodman! I was struggling to understand what in the world the plot was about, and i never laughed, not once! This movie's ONLY saving grace was Julianne Moore, she actually did a good job, and i liked her character, but everything else....nope! 2/10. Save your time for a much better comedy, and just movie in general, such as Plains trains and automobiles, or a million other better ones!"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0407115",
      "warningSpoilers": false,
      "date": "9 September 2004",
      "rate": "10",
      "helpful": "23 out of 43 found this helpful.",
      "title": "Arguably the Coen Brother's funniest work, with a superb lead in Bridges",
      "content": "The Big Lebowski, whether you laugh during the film or not, is assuredly one of the most laid-back of the nineties. I don't mean that by saying that its main fan-base are slackers or hippies or other, but that the whole tone of the film has that air to it. The plot the Coens construct, which is as wonderfully convoluted as a 40's mystery tale (the kinds of stories they get inspired by- The Big Sleep was most likely their title goof), almost gets in the way of the main character and his friends' lives. \"The Dude\" Jeff Lebowski (Jeff Bridges) has a good, if devoid of \"meaning\", life- he bowls constantly with his crazed, Vietnam-vet friend Walter (John Goodman, also very note-worthy) and quiet friend Donny (Steve Buscemi, a fine performance based mostly on reactions), with the occasional setback or weirdo to confront him (i.e. John Turturro's Jesus, a highlight in the film's most absurd moments). Enter in a group of deranged ex-musicians turned nihilists (which include the likes of Peter Stormare and Flea), a pornographer, and a rich man with the same name as Lebowski and his family, and the Dude's cycle is turned upside down, though not knocking into his chemical intake.On top of The Big Lebowski, at the core, one of the most odd, off-the-wall, and creative of the Coens' scripts, with a interesting story and dialog as real as it is sometimes insane, the casting is near perfect, if not so already. It's been said by the Coens that they write some of the parts specifically for the actors, and it shows because it's pulled off. Aside from some usual Coen regulars that don't disappoint, Bridges, for lack of a better term, displays his versatility in taking on this role. Often his roles are of the normal-Joe or the businessman, but what the Coens see is that with the right character he can be funny, and make the people around him just as funny. Not to say there aren't serious parts in the film, where he's put into a rut of conflict by way of the plot. But by the time the audience starts to shift its mindset, another strange, surreal, and/or hallucinogenic bit is kicked in. Throw in some unique production design, and Roger Deakins' expert eye on the scenes (will there ever be another film that captures bowling the way this film does, or at least in such scope and lack of subtlety?), and The Big Lebowski ends up as a cult classic. Not the kind of film that could really play for long in a multiplex (it made back its budget during its run, but not by much), yet one that will continue to have at least a little relevance in not just the indie crowd and Coen fans, but with the kinds of movie viewers who like to have a film on during a party or get-together. In fact, I'd say this beats films like Dazed and Confused and Mallrats as being something that can appeal to a younger (and older, depends) viewing crowd with its ridiculous set-pieces and still be a considerable artistic achievement. Look at it this way, think of the silliest, though smartest Cheech and Chong or Three Stooges film you've seen, and when filtered through a mindset that's loaded with European and film-noir influences, and you'll get The Big Lebowski. Not to mention it's one of the most quotable comedies of the 90's, and has a toe-tapping soundtrack. A+"
    },
    {
      "username": "TheUnknown837-1",
      "userUrl": "https://www.imdb.com/user/ur6321000",
      "reviewLink": "https://www.imdb.com/review/rw2578528",
      "warningSpoilers": false,
      "date": "9 March 2012",
      "rate": "5",
      "helpful": "17 out of 29 found this helpful.",
      "title": "Obnoxious characters swamped in a story that is much too pretentious and complicated for its own good",
      "content": "Here are the highlights of \"The Big Lebowski.\" The opening scene with Jeff Bridges, as a never-do-well being comically ambushed by two men in his home, one of whom urinates on his living room rug. Mr. Bridges again, dropping a joint on his crotch while he's driving and careening into a trash can. Mr. Bridges yet again babbling absolute nonsense, trying to fake his way out of a jam. Mr. Bridges, yes he, being bonked in the head with a ceramic mug.You would think that these moments, coupled with the fact that Mr. Bridges plays the lead, would make \"The Big Lebowski\" a deliriously funny comedy. But alas, it's just valiantly unsuccessful. For Mr. Bridges is far more interesting than the dopey character that's been written for him by his directors, the much-lauded Joel and Ethan Coen. And those highlights were predominantly jabs of slapstick: the only truly funny moments in the film, much more than the pseudo-insights of American culture and pornography. Another great moment, this one featuring John Goodman, has him bashing up a would-be perpetrator's car with a crowbar, only to have a neighbor (the real owner of the car) come screaming out of the house, taking the crowbar, and bashing in Mr. Bridges's car instead.In other words, when the writer/directors go for simplistic and old-fashioned slapstick, coupled with their terrific wide-screen techniques and misc en scene, really works. It's the rest of their pretentious sense of humor that does not work. For once again, they have nose-dived into a pool of complexity, stretching out for something they don't quite have the understanding to reach. They have the ideas; what they lack is the patience to compose it in a way that not only communicates their ideas to the audience, but make it fascinating at the same time. For example, they add some pornographic subtext to the game of bowling (they might just be the only filmmakers to ever do that) but what exactly it means comes up very fuzzily. As is the show-stopping moment where Mr. Bridges goes into a drug-induced hallucination with him and Julianne Moore in an unnervingly peculiar bowling/sex extravaganza. What exactly, do I mean? I'm not sure, and I am not about to watch the film a second time, because it had me restless thirty minutes in.Mr. Bridges does a nice enough job playing a character so sloppy and whiny that it borders on the ridiculous. And not in a good way. It's funny to have him cry out \"I'm the Dude!\" the first few times, but when it happens again and again for two hours, it really wears thin. As does John Goodman screaming at Steve Buscemi \"Shut the (expletive) up, Donny!\" Speaking of Mr. Goodman, he pours a lot of energy into his role, and I guess I cannot honestly say his performance is bad, but it became tiring seeing him on-camera after a while. The fault lies in the character, who is much too obnoxious and redundant to be funny. Mr. Buscemi gives a much more likable performance for a much more likable character, but is hardly on screen. How sad is that? Well, not his denouement.Surround these characters with a lumpy story far too complicated for its own good and you've got a dull picture. \"The Big Lebowski\" is clearly aiming to make commentaries of such, as demonstrated by Sam Elliott's out-of-the-blue appearances here and there in the picture, but they become lost in a pretentiously muddled screenplay.The Coen brothers are good directors. They have great craftsmanship. A key moment is when the camera takes a bowling ball's point-of-view as it thunders down a lane. Slow-motion shots of the pins scattering, though gimmicky and seen before, are also fun to look at. So they can direct; they have talent! Immense talent. But they really do need to hire somebody to rework their screenplays, for that is where they fall short more often than not. Come the end of \"The Big Lebowski,\" I was not pondering over what Sam Elliott had just said in his closing speech, and what it had to do with all that happened in the two hours before, but instead, this.In the scene where Mr. Bridges and Mr. Goodman are having a would-be sentimental moment by the ocean, who was that character I saw walking on the hill crest in the top-right section of the screen?"
    },
    {
      "username": "RodrigAndrisan",
      "userUrl": "https://www.imdb.com/user/ur20962118",
      "reviewLink": "https://www.imdb.com/review/rw5372515",
      "warningSpoilers": false,
      "date": "1 January 2020",
      "rate": "2",
      "helpful": "11 out of 18 found this helpful.",
      "title": "Greatest film ever? Really?",
      "content": "Everybody exaggerates by lifting this film in glory, considering it a super masterpiece. I don't. It's just another ordinary American movie, it didn't even make me laugh, although it's kind of like Comedy. Jeff Bridges and John Goodman are the same as in all their other films and the script is as trivial and already known from many other films, nothing original, mistaken identity. Steve Buscemi is the same too, having an almost silent role here. The only more special ones are Julianne Moore and John Turturro. With their performances they don't save the film being just an average mediocre production made in the movie making factory on the treadmill also called Hollywood."
    },
    {
      "username": "Movieguy-47",
      "userUrl": "https://www.imdb.com/user/ur0401171",
      "reviewLink": "https://www.imdb.com/review/rw0406524",
      "warningSpoilers": false,
      "date": "29 July 1999",
      "rate": "",
      "helpful": "154 out of 286 found this helpful.",
      "title": "Respectable Raunch",
      "content": "The Coen brothers (Joel and Ethan) are the most innovative and, perhaps, the best filmmakers working today. Or they at least rank along side the likes of Martin Scorsese and rising director star Quentin Tarantino. Think about it: \"Blood Simple\" was the best film of 1984; \"Raising Arizona\" was the best film of 1987; \"Miller's Crossing\" was the best movie of 1990; \"Barton Fink\" was the best movie of 1991; and \"Fargo\" was the best movie of 1996. Now comes their latest effort, \"The Big Lebowski,\" which, while it isn't in quite the same league as the above films, is still one of the most thoroughly entertaining movies of 1998.It tells the shambling story of a man named Jeff Lebowski, who calls himself The Dude (Jeff Bridges). The Dude's apartment gets broken into and a thief urinates on his rug. He finds out that the criminals were not looking for him, but looking for the OTHER Jeff Lebowski, the disabled millionaire (played by David Huddleston). That's all I can tell you. The rest is really too bizarre and complicated to put into words; but it's bizarre and complicated in the best ways of the words.Still, what I'll remember most about \"The Big Lebowski\" is the outstanding number of utterly terrific performances. Bridges delivers the best performance of his career and probably the best of the year as a bum lie-about who just wants to be left alone. John Goodman is the real comic gem here as the forever-loudmouthed Walter, The Dude's bowling partner and best friend. Steve Buscemi co-stars as the dimwitted, bug-eyed Donny, the third bowling partner; there's a small but interestingly offbeat spot for Julianne Moore; and John Torturro stops in, as Jesus the bowler, for what is probably the best walk-on performance in years. If you are a Coen brothers fan or like humor that is distinctly offbeat, you have found your movie. As a rather avid moviegoer, I found the film to be a great excersise in pointless extremeties and respectable raunch. Rated R. 117 minutes. 10 out of 10."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2304184",
      "warningSpoilers": false,
      "date": "1 September 2010",
      "rate": "9",
      "helpful": "7 out of 11 found this helpful.",
      "title": "Goodman and Bridges, Oh My!",
      "content": "This is one of those movies I never got around to seeing. It is one of the most delightful black comedies of all time. Watching the byplay between the frenetic John Goodman and Jeff Bridges is priceless. The plot is all over the place and we are played once in a while, but the excitement is in the journey, not the end. Bridges' character is the laid back, sixties protest type who is accosted one day (a case of mistaken identity) as a couple of thugs beat him and one pees on his rug. This sets in motion and effort to find the man who shares his name and get his rug replaced (he ultimately steals one of the man's rugs). This sets off John Goodman (a poster child for anger management). They become involved in a kidnapping drop and I can't begin to explain the rest. Suffice it to say, these guys have a great chemistry and all Bridges can do is watch the dominoes fall. Goodman has made a career of playing lovable psychos for the Coen Brothers. This may be his masterpiece."
    }
  ],
  "errorMessage": ""
}