{
  "imDbId": "tt0118715",
  "title": "The Big Lebowski",
  "fullTitle": "The Big Lebowski (1998)",
  "type": "Movie",
  "year": "1998",
  "language": "en",
  "titleInLanguage": "The Big Lebowski",
  "url": "https://en.wikipedia.org/wiki/The_Big_Lebowski",
  "plotShort": {
    "plainText": "The Big Lebowski (/ləˈbaʊski/) is a 1998 crime comedy film written, produced, and directed by Joel and Ethan Coen. It stars Jeff Bridges as Jeffrey \"The Dude\" Lebowski, a Los Angeles slacker and avid bowler. He is assaulted as a result of mistaken identity, then learns that a millionaire, also named Jeffrey Lebowski (David Huddleston), was the intended victim. The millionaire Lebowski's trophy wife is kidnapped, and millionaire Lebowski commissions The Dude to deliver the ransom to secure her release. The plan goes awry when the Dude's friend, Walter Sobchak (John Goodman), schemes to keep the ransom money for the Dude and himself. Sam Elliott, Julianne Moore, Steve Buscemi, John Turturro, Philip Seymour Hoffman, Tara Reid, David Thewlis, Peter Stormare, Jon Polito, and Ben Gazzara also appear in supporting roles.\r\nThe film is loosely inspired by the work of Raymond Chandler. Joel Coen stated, \"We wanted to do a Chandler kind of story – how it moves episodically, and deals with the characters trying to unravel a mystery, as well as having a hopelessly complex plot that's ultimately unimportant\". The original score was composed by Carter Burwell, a longtime collaborator of the Coen brothers.\r\nThe Big Lebowski received mixed reviews at the time of its release. Over time, reviews have become largely positive, and the film has become a cult favorite, noted for its eccentric characters, comedic dream sequences, idiosyncratic dialogue, and eclectic soundtrack. In 2014, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". A spin-off, titled The Jesus Rolls, was released in 2020, with Turturro reprising his role and also serving as writer and director.",
    "html": "<p>The Big Lebowski (/ləˈbaʊski/) is a 1998 crime comedy film written, produced, and directed by Joel and Ethan Coen. It stars Jeff Bridges as Jeffrey \"The Dude\" Lebowski, a Los Angeles slacker and avid bowler. He is assaulted as a result of mistaken identity, then learns that a millionaire, also named Jeffrey Lebowski (David Huddleston), was the intended victim. The millionaire Lebowski's trophy wife is kidnapped, and millionaire Lebowski commissions The Dude to deliver the ransom to secure her release. The plan goes awry when the Dude's friend, Walter Sobchak (John Goodman), schemes to keep the ransom money for the Dude and himself. Sam Elliott, Julianne Moore, Steve Buscemi, John Turturro, Philip Seymour Hoffman, Tara Reid, David Thewlis, Peter Stormare, Jon Polito, and Ben Gazzara also appear in supporting roles.</p><p>The film is loosely inspired by the work of Raymond Chandler. Joel Coen stated, \"We wanted to do a Chandler kind of story – how it moves episodically, and deals with the characters trying to unravel a mystery, as well as having a hopelessly complex plot that's ultimately unimportant\". The original score was composed by Carter Burwell, a longtime collaborator of the Coen brothers.</p><p>The Big Lebowski received mixed reviews at the time of its release. Over time, reviews have become largely positive, and the film has become a cult favorite, noted for its eccentric characters, comedic dream sequences, idiosyncratic dialogue, and eclectic soundtrack. In 2014, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". A spin-off, titled The Jesus Rolls, was released in 2020, with Turturro reprising his role and also serving as writer and director.</p>"
  },
  "plotFull": {
    "plainText": "The Big Lebowski (/ləˈbaʊski/) is a 1998 crime comedy film written, produced, and directed by Joel and Ethan Coen. It stars Jeff Bridges as Jeffrey \"The Dude\" Lebowski, a Los Angeles slacker and avid bowler. He is assaulted as a result of mistaken identity, then learns that a millionaire, also named Jeffrey Lebowski (David Huddleston), was the intended victim. The millionaire Lebowski's trophy wife is kidnapped, and millionaire Lebowski commissions The Dude to deliver the ransom to secure her release. The plan goes awry when the Dude's friend, Walter Sobchak (John Goodman), schemes to keep the ransom money for the Dude and himself. Sam Elliott, Julianne Moore, Steve Buscemi, John Turturro, Philip Seymour Hoffman, Tara Reid, David Thewlis, Peter Stormare, Jon Polito, and Ben Gazzara also appear in supporting roles.\r\nThe film is loosely inspired by the work of Raymond Chandler. Joel Coen stated, \"We wanted to do a Chandler kind of story – how it moves episodically, and deals with the characters trying to unravel a mystery, as well as having a hopelessly complex plot that's ultimately unimportant\". The original score was composed by Carter Burwell, a longtime collaborator of the Coen brothers.\r\nThe Big Lebowski received mixed reviews at the time of its release. Over time, reviews have become largely positive, and the film has become a cult favorite, noted for its eccentric characters, comedic dream sequences, idiosyncratic dialogue, and eclectic soundtrack. In 2014, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". A spin-off, titled The Jesus Rolls, was released in 2020, with Turturro reprising his role and also serving as writer and director.\r\nPlot\r\nIn 1991, slacker and avid bowler Jeffrey \"The Dude\" Lebowski is attacked in his Los Angeles home by two enforcers for porn kingpin Jackie Treehorn, to whom a different Jeffrey Lebowski's wife owes money. One of the thugs urinates on the Dude's rug before the two realize that they have the wrong man and leave.\r\nConsulting his bowling partners, Vietnam veteran Walter Sobchak and fall guy Donny Kerabatsos, the Dude visits wealthy philanthropist Jeffrey Lebowski (\"the big Lebowski\"), requesting compensation for the rug. Lebowski refuses, but the Dude tricks his assistant Brandt into letting him take a similar rug from the mansion. Outside, he meets Bunny, Lebowski's trophy wife, and her German nihilist friend Uli. Soon afterwards, Bunny is apparently kidnapped, and Lebowski hires The Dude to deliver the requested ransom money, one million dollars. That night, another group of thugs ambush the Dude, taking his replacement rug on behalf of Lebowski's daughter Maude, who has a sentimental attachment to it.\r\nThe kidnappers arrange to collect the ransom. Convinced that the kidnap was a ruse by Bunny, Walter schemes to keep the money for the Dude and himself, substituting it with a bag of his dirty laundry. The plan fails, the kidnappers leave with Walter's bag, and he and The Dude return to the bowling alley, leaving the briefcase of money in the car trunk. While they bowl, the car is stolen. The Dude is soon confronted by Lebowski, who hands him an envelope from the kidnappers containing a severed toe, supposedly Bunny's. Maude asks the Dude to help recover the money, which her father illegally withdrew from the family's charity foundation.\r\nThe Dude receives a phone call from the police telling him that his car has been found and taken to an impound lot. While retrieving the car, he notices that the briefcase is missing and finds a piece of homework belonging to a teenager named Larry Sellers. Walter and the Dude drive to Larry's house and interrogate him, but are unable to get any information out of him. Walter tries to intimidate Larry by smashing a brand new sports car that he believes the teenager purchased with the stolen money, but attracts the attention of the car's real owner, who destroys the Dude's car in retaliation, believing it to be Walter's.\r\nThe Dude is abducted by Jackie Treehorn's thugs and taken to see the porn kingpin, who demands to know where Bunny is and what happened to his money. The Dude tells Treehorn that Bunny faked her kidnapping and that his money is with Larry Sellers. The Dude passes out after drinking a spiked White Russian given to him by Treehorn, and has an intense dream in which he envisions an elaborate, Busby Berkeley-style musical sequence featuring himself and Maude. When he comes to, he is arrested and taken to a local police station, where the police chief threatens him and warns him to stay out of Malibu. On the ride home, the Dude is thrown out of his taxi after complaining about the driver's selection of The Eagles' music on the car radio. At that moment, Bunny drives by in her car, with all her toes shown to be intact. In a later scene, it is revealed that the severed toe came from the girlfriend of one of the nihilists.\r\nReturning home, The Dude finds Maude, who has sex with him. She explains that she is trying to become pregnant by a father with whom she will not have to interact socially. She reveals that her father has no money of his own; his wealth came from her late mother.\r\nThe Dude and Walter confront Lebowski, and find that Bunny has returned, having simply gone out of town without telling anyone. He explains that Bunny's nihilist friends had taken the opportunity to try and blackmail Lebowski, who, in turn, had tried to embezzle money from the family charity, blaming its disappearance on the blackmailers. The Dude believes the briefcase given to him never contained any money. An enraged Walter insists that Lebowski is faking his paralysis and violently lifts him out of his wheelchair, but discovers that the paralysis is real.\r\nWhile Walter and The Dude are bowling, an angry Jesus Quintana bursts into the bowling alley. Walter had previously stated that since he is shomer Shabbas, he could not bowl on a Saturday. In a profanity-laden tirade, Quintana implies that he does not believe that Walter's religious reasons for not wanting to bowl on Saturday are sincere. Although Quintana's bowling partner Liam attempts to restrain him, Quintana threatens Walter and The Dude with sexual violence and storms out. In a final confrontation outside of the bowling alley, the nihilists set fire to the Dude's car, and demand the ransom money. Walter fights them off, but during the altercation, Donny dies from a heart attack. Walter scatters Donny's ashes from a cliff overlooking the Pacific Ocean, but they are blown back over himself and the Dude by an updraft. The Dude loses his temper and yells at Walter, who consoles him, and the two then go bowling.\r\nAt the alley, the Dude encounters the Stranger, the film's narrator, who sums up everything that happened in the movie, noting that while he \"didn't like seeing Donny go,\" he remains optimistic and reveals that Maude is pregnant with a \"little Lebowski on the way.\"\r\nCast\r\nJeff Bridges as Jeffrey \"The Dude\" Lebowski\r\nJohn Goodman as Walter Sobchak\r\nJulianne Moore as Maude Lebowski\r\nSteve Buscemi as Donny Kerabatsos\r\nDavid Huddleston as Jeffrey \"The Big\" Lebowski\r\nPhilip Seymour Hoffman as Brandt\r\nTara Reid as Bunny Lebowski\r\nJohn Turturro as Jesus Quintana\r\nSam Elliott as The Stranger\r\nDavid Thewlis as Knox Harrington\r\nBen Gazzara as Jackie Treehorn\r\nPeter Stormare, Torsten Voges, and Flea as Uli Kunkel/Karl Hungus, Franz, and Kieffer, the nihilists\r\nJon Polito as Da Fino\r\nPhilip Moon and Mark Pellegrino as Treehorn's thugs\r\nJimmie Dale Gilmore as Smokey\r\nJack Kehler as Marty, The Dude's landlord\r\nDom Irrera as Tony, the chauffeur\r\nHarry Bugin as Arthur Digby Sellers\r\nJesse Flanagan as Larry Sellers\r\nLeon Russom as the Malibu Police Chief\r\nWarren Keith as Francis Donnelly, funeral director\r\nMarshall Manesh as Doctor\r\nAsia Carrera as Sherry, porn actress\r\nAimee Mann as Franz's girlfriend\r\nRichard Gant and Christian Clemenson as cops\r\nProduction\r\nDevelopment\r\nThe Dude is mostly inspired by Jeff Dowd, an American film producer and political activist the Coen brothers met while they were trying to find distribution for their first feature, Blood Simple.: 90 Dowd had been a member of the Seattle Seven, liked to drink White Russians, and was known as \"The Dude\".: 91–92 The Dude was also partly based on a friend of the Coen brothers, Peter Exline (now a member of the faculty at USC's School of Cinematic Arts), a Vietnam War veteran who reportedly lived in a dump of an apartment and was proud of a little rug that \"tied the room together\".: 188 Exline knew Barry Sonnenfeld from New York University and Sonnenfeld introduced Exline to the Coen brothers while they were trying to raise money for Blood Simple.: 97–98 Exline became friends with the Coens and in 1989, told them all kinds of stories from his own life, including ones about his actor-writer friend Lewis Abernathy (one of the inspirations for Walter), a fellow Vietnam vet who later became a private investigator and helped him track down and confront a high school kid who stole his car.: 99 As in the film, Exline's car was impounded by the Los Angeles Police Department and Abernathy found an 8th grader's homework under the passenger seat.: 100\r\nExline also belonged to an amateur softball league but the Coens changed it to bowling in the film, because \"it's a very social sport where you can sit around and drink and smoke while engaging in inane conversation\".: 195 The Coens met filmmaker John Milius when they were in Los Angeles making Barton Fink and incorporated his love of guns and the military into the character of Walter.: 189 John Milius introduced the Coen Brothers to one of his best friends, Jim Ganzer, who would have been another source of inferences to create Jeff Bridges' character. Also known as the Dude, Ganzer and his gang, typical Malibu surfers, served as inspiration as well for Milius's film Big Wednesday.\r\nBefore David Huddleston was cast as \"Big\" Jeffrey Lebowski, the Coens considered Robert Duvall (who did not like the script), Anthony Hopkins (who wasn't interested in playing an American), Gene Hackman (who was taking a break from acting at the time), Norman Mailer, George C. Scott, Jerry Falwell, Gore Vidal, Andy Griffith, William F. Buckley, and Ernest Borgnine. The Coens' top choice was Marlon Brando, but he was unable to star in the film due to health issues. Charlize Theron was considered for the role of Bunny Lebowski.\r\nAccording to Julianne Moore, the character of Maude was based on artist Carolee Schneemann, \"who worked naked from a swing\", and on Yoko Ono.: 156 The character of Jesus Quintana, an opponent of The Dude's bowling team, was inspired in part by a performance the Coens had seen John Turturro give in 1988 at the Public Theater in a play called Mi Puta Vida in which he played a pederast-type character, \"so we thought, let's make Turturro a pederast. It'll be something he can really run with,\" Joel said in an interview.: 195\r\nThe film's overall structure was influenced by the detective fiction of Raymond Chandler. Ethan said, \"We wanted something that would generate a certain narrative feeling – like a modern Raymond Chandler story, and that's why it had to be set in Los Angeles ... We wanted to have a narrative flow, a story that moves like a Chandler book through different parts of town and different social classes.\" The use of the Stranger's voice-over also came from Chandler as Joel remarked, \"He is a little bit of an audience substitute. In the movie adaptation of Chandler it's the main character that speaks off-screen, but we didn't want to reproduce that though it obviously has echoes. It's as if someone was commenting on the plot from an all-seeing point of view. And at the same time rediscovering the old earthiness of a Mark Twain.\": 169\r\nThe significance of the bowling culture was, according to Joel, \"important in reflecting that period at the end of the fifties and the beginning of the sixties. That suited the retro side of the movie, slightly anachronistic, which sent us back to a not-so-far-away era, but one that was well and truly gone nevertheless.\": 170\r\nScreenplay\r\nThe Coen Brothers wrote The Big Lebowski around the same time as Barton Fink. When the Coen brothers wanted to make it, John Goodman was filming episodes for Roseanne and Jeff Bridges was making the Walter Hill film Wild Bill. The Coens decided to make Fargo in the meantime.: 189 According to Ethan, \"the movie was conceived as pivoting around that relationship between the Dude and Walter\", which sprang from the scenes between Barton Fink and Charlie Meadows in Barton Fink.: 169 They also came up with the idea of setting the film in contemporary L.A., because the people who inspired the story lived in the area.: 41 When Pete Exline told them about the homework in a baggie incident, the Coens thought that that was very Raymond Chandler and decided to integrate elements of the author's fiction into their script. Joel Coen cites Robert Altman's The Long Goodbye as a primary influence on their film, in the sense that The Big Lebowski \"is just kind of informed by Chandler around the edges\".: 43 When they started writing the script, the Coens wrote only 40 pages and then let it sit for a while before finishing it. This is a normal writing process for them, because they often \"encounter a problem at a certain stage, we pass to another project, then we come back to the first script. That way we've already accumulated pieces for several future movies.\": 171 In order to liven up a scene that they thought was too heavy on exposition, they added an \"effete art-world hanger-on\", known as Knox Harrington, late in the screenwriting process. In the original script, the Dude's car was a Chrysler LeBaron, as Dowd had once owned, but that car was not big enough to fit John Goodman so the Coens changed it to a Ford Torino.: 93\r\nPre-production\r\nPolyGram and Working Title Films, which had funded Fargo, backed The Big Lebowski with a budget of $15 million. In casting the film, Joel remarked, \"we tend to write both for people we know and have worked with, and some parts without knowing who's going to play the role. In The Big Lebowski we did write for John and Steve, but we didn't know who was getting the Jeff Bridges role.\" Mel Gibson was originally considered for the role of The Dude, but he didn't take the pitch too seriously. In preparation for his role, Bridges met Dowd but actually \"drew on myself a lot from back in the Sixties and Seventies. I lived in a little place like that and did drugs, although I think I was a little more creative than the Dude.\": 188 The actor went into his own closet with the film's wardrobe person and picked out clothes that he had thought the Dude might wear.: 27 He wore his character's clothes home because most of them were his own. The actor also adopted the same physicality as Dowd, including the slouching and his ample belly.: 93 Originally, Goodman wanted a different kind of beard for Walter but the Coen brothers insisted on the \"Gladiator\" or what they called the \"Chin Strap\" and he thought it would go well with his flattop haircut.: 32\r\nFor the film's look, the Coens wanted to avoid the usual retro 1960s clichés like lava lamps, Day-Glo posters, and Grateful Dead music: 95 and for it to be \"consistent with the whole bowling thing, we wanted to keep the movie pretty bright and poppy\", Joel said in an interview.: 191 For example, the star motif, featured predominantly throughout the film, started with the film's production designer Richard Heinrichs' design for the bowling alley. According to Joel, he \"came up with the idea of just laying free-form neon stars on top of it and doing a similar free-form star thing on the interior\". This carried over to the film's dream sequences. \"Both dream sequences involve star patterns and are about lines radiating to a point. In the first dream sequence, the Dude gets knocked out and you see stars and they all coalesce into the overhead nightscape of L.A. The second dream sequence is an astral environment with a backdrop of stars\", remembers Heinrichs.: 191 For Jackie Treehorn's Malibu beach house, he was inspired by late 1950s and early 1960s bachelor pad furniture. The Coen brothers told Heinrichs that they wanted Treehorn's beach party to be Inca-themed, with a \"very Hollywood-looking party in which young, oiled-down, fairly aggressive men walk around with appetizers and drinks. So there's a very sacrificial quality to it.\": 91\r\nCinematographer Roger Deakins discussed the look of the film with the Coens during pre-production. They told him that they wanted some parts of the film to have a real and contemporary feeling and other parts, like the dream sequences, to have a very stylized look.: 77 Bill and Jacqui Landrum did all of the choreography for the film. For his dance sequence, Jack Kehler went through three three-hour rehearsals.: 27 The Coen brothers offered him three to four choices of classical music for him to pick from and he chose Modest Mussorgsky's Pictures at an Exhibition. At each rehearsal, he went through each phase of the piece.: 64\r\nPrincipal photography\r\nActual filming took place over an eleven-week period with location shooting in and around Los Angeles, including all of the bowling sequences at the Hollywood Star Lanes (for three weeks) and the Dude's Busby Berkeley dream sequences in a converted airplane hangar. According to Joel, the only time they ever directed Bridges \"was when he would come over at the beginning of each scene and ask, 'Do you think the Dude burned one on the way over?' I'd reply 'Yes' usually, so Jeff would go over in the corner and start rubbing his eyes to get them bloodshot.\": 195 Julianne Moore was sent the script while working on The Lost World: Jurassic Park. She worked only two weeks on the film, early and late during the production that went from January to April 1997 while Sam Elliott was only on set for two days and did many takes of his final speech.: 46\r\nThe scenes in Jackie Treehorn's house were shot in the Sheats-Goldstein Residence, designed by John Lautner and built in 1963 in the Hollywood Hills.\r\nDeakins described the look of the fantasy scenes as being very crisp, monochromatic, and highly lit in order to afford greater depth of focus. However, with the Dude's apartment, Deakins said, \"it's kind of seedy and the light's pretty nasty\" with a grittier look. The visual bridge between these two different looks was how he photographed the night scenes. Instead of adopting the usual blue moonlight or blue street lamp look, he used an orange sodium-light effect.: 79 The Coen brothers shot much of the film with wide-angle lens because, according to Joel, it made it easier to hold focus for a greater depth and it made camera movements more dynamic.: 82\r\nTo achieve the point-of-view of a rolling bowling ball the Coen brothers mounted a camera \"on something like a barbecue spit\", according to Ethan, and then dollied it along the lane. The challenge for them was figuring out the relative speeds of the forward motion and the rotating motion. CGI was used to create the vantage point of the thumb hole in the bowling ball.\r\nSoundtrack\r\nThe original score was composed by Carter Burwell, a veteran of all the Coen Brothers' films. While the Coens were writing the screenplay they had Kenny Rogers' \"Just Dropped In (to See What Condition My Condition Was in)\", the Gipsy Kings' cover of \"Hotel California\", and several Creedence Clearwater Revival songs in mind. They asked T-Bone Burnett (who would later work with the Coens on O Brother, Where Art Thou? and Inside Llewyn Davis) to pick songs for the soundtrack of the film. They knew that they wanted different genres of music from different times but, as Joel remembers, \"T-Bone even came up with some far-out Henry Mancini and Yma Sumac.\" Burnett was able to secure songs by Kenny Rogers and the Gipsy Kings and also added tracks by Captain Beefheart, Moondog and Bob Dylan's \"The Man in Me\". However, he had a tough time securing the rights to Townes Van Zandt's cover of the Rolling Stones' \"Dead Flowers\", which plays over the film's closing credits. Former Stones manager Allen Klein owned the rights to the song and wanted $150,000 for it. Burnett convinced Klein to watch an early cut of the film and remembers, \"It got to the part where the Dude says, 'I hate the fuckin' Eagles, man!' Klein stands up and says, 'That's it, you can have the song!' That was beautiful.\" Burnett was going to be credited on the film as \"Music Supervisor\", but asked his credit to be \"Music Archivist\" because he \"hated the notion of being a supervisor; I wouldn't want anyone to think of me as management\".\r\nFor Joel, \"the original music, as with other elements of the movie, had to echo the retro sounds of the Sixties and early Seventies\".: 156 Music defines each character. For example, \"Tumbling Tumbleweeds\" by Bob Nolan was chosen for the Stranger at the time the Coens wrote the screenplay, as was \"Lujon\" by Henry Mancini for Jackie Treehorn. \"The German nihilists are accompanied by techno-pop and Jeff Bridges by Creedence. So there's a musical signature for each of them\", remarked Ethan in an interview.: 156 The character Uli Kunkel was in the German electronic band Autobahn, an homage to the band Kraftwerk. The album cover of their record Nagelbett (bed of nails) is a parody of the Kraftwerk album cover for The Man-Machine and the group name Autobahn shares the name of a Kraftwerk song and album. In the lyrics the phrase \"We believe in nothing\" is repeated with electronic distortion. This is a reference to Autobahn's nihilism in the film.\r\nReception\r\nBox office\r\nThe Big Lebowski received its world premiere at the 1998 Sundance Film Festival on January 18, 1998, at the 1,300-capacity Eccles Theater. It was also screened at the 48th Berlin International Film Festival before opening in North America on March 6, 1998, in 1,207 theaters. It grossed $5.5 million on its opening weekend, finishing up with a gross of $18 million in the United States, just above its US$15 million budget. The film's worldwide gross outside of the US was $28.7 million, bringing its worldwide gross to $46.7 million.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 79% based on 186 reviews, with an average score of 7.3/10. The website's critics consensus reads, \"The Big Lebowski's shaggy dog story won't satisfy everybody, but those who abide will be treated to a rambling succession of comic delights, with Jeff Bridges' laconic performance really tying the movie together.\" Metacritic, which uses a weighted average, has assigned the film a score of 71 out of 100 based on reviews from 23 critics, indicating \"generally favorable reviews.\" Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.\r\nMany critics and audiences have likened the film to a modern Western, while many others dispute this, or liken it to a crime novel that revolves around mistaken identity plot devices. Peter Howell, in his review for the Toronto Star, wrote: \"It's hard to believe that this is the work of a team that won an Oscar last year for the original screenplay of Fargo. There's a large amount of profanity in the movie, which seems a weak attempt to paper over dialogue gaps.\" Howell revised his opinion in a later review, and in 2011 stated that \"it may just be my favourite Coen Bros. film.\"\r\nTodd McCarthy in Variety magazine wrote: \"One of the film's indisputable triumphs is its soundtrack, which mixes Carter Burwell's original score with classic pop tunes and some fabulous covers.\" USA Today gave the film three out of four stars and felt that the Dude was \"too passive a hero to sustain interest,\" but that there was \"enough startling brilliance here to suggest that, just like the Dude, those smarty-pants Coens will abide.\"\r\nIn his review for The Washington Post, Desson Howe praised the Coens and \"their inspired, absurdist taste for weird, peculiar Americana – but a sort of neo-Americana that is entirely invented – the Coens have defined and mastered their own bizarre subgenre. No one does it like them and, it almost goes without saying, no one does it better.\"\r\nJanet Maslin praised Bridges' performance in her review for The New York Times: \"Mr. Bridges finds a role so right for him that he seems never to have been anywhere else. Watch this performance to see shambling executed with nonchalant grace and a seemingly out-to-lunch character played with fine comic flair.\" Andrew Sarris, in his review for the New York Observer, wrote: \"The result is a lot of laughs and a feeling of awe toward the craftsmanship involved. I doubt that there'll be anything else like it the rest of this year.\" In a five star review for Empire Magazine, Ian Nathan wrote: \"For those who delight in the Coens' divinely abstract take on reality, this is pure nirvana\" and \"in a perfect world all movies would be made by the Coen brothers.\" Roger Ebert of the Chicago Sun-Times gave the film three stars out of four, describing it as \"weirdly engaging.\" In a 2010 review, he raised his original score to four stars out of four and added the film to his \"Great Movies\" list.\r\nHowever, Jonathan Rosenbaum wrote in the Chicago Reader: \"To be sure, The Big Lebowski is packed with show-offy filmmaking and as a result is pretty entertaining. But insofar as it represents a moral position—and the Coens' relative styling of their figures invariably does—it's an elitist one, elevating salt-of-the-earth types like Bridges and Goodman ... over everyone else in the movie.\" Dave Kehr, in his review for the Daily News, criticized the film's premise as a \"tired idea, and it produces an episodic, unstrung film.\" The Guardian criticized the film as \"a bunch of ideas shoveled into a bag and allowed to spill out at random. The film is infuriating, and will win no prizes. But it does have some terrific jokes.\"\r\nLegacy\r\nSince its original release, The Big Lebowski has become a cult classic. Ardent fans of the film call themselves \"achievers\". Steve Palopoli wrote about the film's emerging cult status in July 2002. He first realized that the film had a cult following when he attended a midnight screening in 2000 at the New Beverly Cinema in Los Angeles and witnessed people quoting dialogue from the film to each other.: 129 Soon after the article appeared, the programmer for a local midnight film series in Santa Cruz decided to screen The Big Lebowski and on the first weekend they had to turn away several hundred people. The theater held the film over for six weeks, which had never happened before.: 130\r\nAn annual festival, Lebowski Fest, began in Louisville, Kentucky, United States, in 2002 with 150 fans showing up, and has since expanded to several other cities. The festival's main event each year is a night of unlimited bowling with various contests including costume, trivia, hardest- and farthest-traveled contests. Held over a weekend, events typically include a pre-fest party with bands the night before the bowling event as well as a day-long outdoor party with bands, vendor booths and games. Various celebrities from the film have attended some of the events, including Jeff Bridges who attended the Los Angeles event. The British equivalent, inspired by Lebowski Fest, is known as The Dude Abides and is held in London.\r\nDudeism, a religion devoted largely to spreading the philosophy and lifestyle of the film's main character, was founded in 2005. Also known as The Church of the Latter-Day Dude (a name parody of The Church of Jesus Christ of Latter-day Saints), the organization has ordained over 220,000 \"Dudeist Priests\" all over the world via its website.\r\nTwo species of African spider are named after the film and main character: Anelosimus biglebowski and Anelosimus dude, both described in 2006. Additionally, an extinct Permian conifer genus is named after the film in honor of its creators. The first species described within this genus in 2007 is based on 270-million-year-old plant fossils from Texas, and is called Lebowskia grandifolia.\r\nEntertainment Weekly ranked it 8th on their Funniest Movies of the Past 25 Years list. The film was also ranked No. 34 on their list of \"The Top 50 Cult Films\" and ranked No. 15 on the magazine's \"The Cult 25: The Essential Left-Field Movie Hits Since '83\" list. In addition, the magazine also ranked The Dude No. 14 in their \"The 100 Greatest Characters of the Last 20 Years\" poll. The film was also nominated for the prestigious Grand Prix of the Belgian Film Critics Association. The Big Lebowski was voted as the 10th best film set in Los Angeles in the last 25 years by a group of Los Angeles Times writers and editors with two criteria: \"The movie had to communicate some inherent truth about the L.A. experience, and only one film per director was allowed on the list.\" Empire magazine ranked Walter Sobchak No. 49 and the Dude No. 7 in their \"The 100 Greatest Movie Characters\" poll. Roger Ebert added The Big Lebowski to his list of \"Great Movies\" in March 2010.\r\nSpin-off\r\nThe Coen brothers have stated that they will never make a sequel to The Big Lebowski. Nevertheless, John Turturro expressed interest in reprising his role as Jesus Quintana, and in 2014, he announced that he had requested permission to use the character. In August 2016, it was reported that Turturro would reprise his role as Jesus Quintana in The Jesus Rolls, a spin-off of The Big Lebowski, based on the 1974 French film Going Places, with Turturro starring, writing, and directing. It was released in 2020. The Coen brothers, although having granted Turturro the right to use the character, were not involved, and no other character from The Big Lebowski was featured in the film.\r\nStella Artois commercial\r\nOn January 24, 2019, Jeff Bridges posted a 5-second clip on Twitter with the statement: \"Can't be living in the past, man. Stay tuned\" and showing Bridges as the Dude, walking through a room as a tumbleweed rolls by. The clip was a teaser trailer for an ad during Super Bowl LIII which featured Bridges reprising the role of The Dude for a Stella Artois commercial.\r\nUse as social and political analysis\r\nThe film has been used as a tool for analysis on a number of issues. In September 2008, Slate published an article that interpreted The Big Lebowski as a political critique. The center piece of this viewpoint was that Walter Sobchak is \"a neocon,\" citing the film's references to then President George H. W. Bush and the first Gulf War.\r\nA journal article by Brian Wall, published in the feminist journal Camera Obscura, uses the film to explain Karl Marx's commodity fetishism and the feminist consequences of sexual fetishism.\r\nIn That Rug Really Tied the Room Together, first published in 2001, Joseph Natoli argues that The Dude represents a counter narrative to the post-Reaganomic entrepreneurial rush for \"return on investment\" on display in such films as Jerry Maguire and Forrest Gump.\r\nIt has been used as a carnivalesque critique of society, as an analysis on war and ethics, as a narrative on mass communication and US militarism and other issues.\r\nHome media\r\nUniversal Studios Home Entertainment released a \"Collector's Edition\" DVD on October 18, 2005, with extra features that included an \"introduction by Mortimer Young\", \"Jeff Bridges' Photography\", \"Making of The Big Lebowski\", and \"Production Notes\". In addition, a limited-edition \"Achiever's Edition Gift Set\" also included The Big Lebowski Bowling Shammy Towel, four Collectible Coasters that included photographs and quotable lines from the film, and eight Exclusive Photo Cards from Jeff Bridges' personal collection.\r\nA \"10th Anniversary Edition\" was released on September 9, 2008, and features all of the extras from the \"Collector's Edition\" and \"The Dude's Life: Strikes and Gutters ... Ups and Downs ... The Dude Abides\" theatrical trailer (from the first DVD release), \"The Lebowski Fest: An Achiever's Story\", \"Flying Carpets and Bowling Pin Dreams: The Dream Sequences of the Dude\", \"Interactive Map\", \"Jeff Bridges Photo Book\", and a \"Photo Gallery\". There are both a standard release and a Limited Edition which features \"Bowling Ball Packaging\" and is individually numbered.\r\nA high-definition version of The Big Lebowski was released by Universal on HD DVD format on June 26, 2007. The film was released in Blu-ray format in Italy by Cecchi Gori.\r\nOn August 16, 2011, Universal Pictures released The Big Lebowski on Blu-ray. The limited-edition package includes a Jeff Bridges photo book, a ten-years-on retrospective, and an in-depth look at the annual Lebowski Fest. The film is also available in the Blu-ray Coen Brothers box set released in the UK; however, this version is region-free and will work in any Blu-ray player.\r\nFor the film's 20th Anniversary, Universal Pictures released a 4K Ultra HD Blu-ray version of the film, which was released on October 16, 2018.",
    "html": "<p>The Big Lebowski (/ləˈbaʊski/) is a 1998 crime comedy film written, produced, and directed by Joel and Ethan Coen. It stars Jeff Bridges as Jeffrey \"The Dude\" Lebowski, a Los Angeles slacker and avid bowler. He is assaulted as a result of mistaken identity, then learns that a millionaire, also named Jeffrey Lebowski (David Huddleston), was the intended victim. The millionaire Lebowski's trophy wife is kidnapped, and millionaire Lebowski commissions The Dude to deliver the ransom to secure her release. The plan goes awry when the Dude's friend, Walter Sobchak (John Goodman), schemes to keep the ransom money for the Dude and himself. Sam Elliott, Julianne Moore, Steve Buscemi, John Turturro, Philip Seymour Hoffman, Tara Reid, David Thewlis, Peter Stormare, Jon Polito, and Ben Gazzara also appear in supporting roles.</p><p>The film is loosely inspired by the work of Raymond Chandler. Joel Coen stated, \"We wanted to do a Chandler kind of story – how it moves episodically, and deals with the characters trying to unravel a mystery, as well as having a hopelessly complex plot that's ultimately unimportant\". The original score was composed by Carter Burwell, a longtime collaborator of the Coen brothers.</p><p>The Big Lebowski received mixed reviews at the time of its release. Over time, reviews have become largely positive, and the film has become a cult favorite, noted for its eccentric characters, comedic dream sequences, idiosyncratic dialogue, and eclectic soundtrack. In 2014, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". A spin-off, titled The Jesus Rolls, was released in 2020, with Turturro reprising his role and also serving as writer and director.</p><br/><h3>Plot</h3><p>In 1991, slacker and avid bowler Jeffrey \"The Dude\" Lebowski is attacked in his Los Angeles home by two enforcers for porn kingpin Jackie Treehorn, to whom a different Jeffrey Lebowski's wife owes money. One of the thugs urinates on the Dude's rug before the two realize that they have the wrong man and leave.</p><p>Consulting his bowling partners, Vietnam veteran Walter Sobchak and fall guy Donny Kerabatsos, the Dude visits wealthy philanthropist Jeffrey Lebowski (\"the big Lebowski\"), requesting compensation for the rug. Lebowski refuses, but the Dude tricks his assistant Brandt into letting him take a similar rug from the mansion. Outside, he meets Bunny, Lebowski's trophy wife, and her German nihilist friend Uli. Soon afterwards, Bunny is apparently kidnapped, and Lebowski hires The Dude to deliver the requested ransom money, one million dollars. That night, another group of thugs ambush the Dude, taking his replacement rug on behalf of Lebowski's daughter Maude, who has a sentimental attachment to it.</p><p>The kidnappers arrange to collect the ransom. Convinced that the kidnap was a ruse by Bunny, Walter schemes to keep the money for the Dude and himself, substituting it with a bag of his dirty laundry. The plan fails, the kidnappers leave with Walter's bag, and he and The Dude return to the bowling alley, leaving the briefcase of money in the car trunk. While they bowl, the car is stolen. The Dude is soon confronted by Lebowski, who hands him an envelope from the kidnappers containing a severed toe, supposedly Bunny's. Maude asks the Dude to help recover the money, which her father illegally withdrew from the family's charity foundation.</p><p>The Dude receives a phone call from the police telling him that his car has been found and taken to an impound lot. While retrieving the car, he notices that the briefcase is missing and finds a piece of homework belonging to a teenager named Larry Sellers. Walter and the Dude drive to Larry's house and interrogate him, but are unable to get any information out of him. Walter tries to intimidate Larry by smashing a brand new sports car that he believes the teenager purchased with the stolen money, but attracts the attention of the car's real owner, who destroys the Dude's car in retaliation, believing it to be Walter's.</p><p>The Dude is abducted by Jackie Treehorn's thugs and taken to see the porn kingpin, who demands to know where Bunny is and what happened to his money. The Dude tells Treehorn that Bunny faked her kidnapping and that his money is with Larry Sellers. The Dude passes out after drinking a spiked White Russian given to him by Treehorn, and has an intense dream in which he envisions an elaborate, Busby Berkeley-style musical sequence featuring himself and Maude. When he comes to, he is arrested and taken to a local police station, where the police chief threatens him and warns him to stay out of Malibu. On the ride home, the Dude is thrown out of his taxi after complaining about the driver's selection of The Eagles' music on the car radio. At that moment, Bunny drives by in her car, with all her toes shown to be intact. In a later scene, it is revealed that the severed toe came from the girlfriend of one of the nihilists.</p><p>Returning home, The Dude finds Maude, who has sex with him. She explains that she is trying to become pregnant by a father with whom she will not have to interact socially. She reveals that her father has no money of his own; his wealth came from her late mother.</p><p>The Dude and Walter confront Lebowski, and find that Bunny has returned, having simply gone out of town without telling anyone. He explains that Bunny's nihilist friends had taken the opportunity to try and blackmail Lebowski, who, in turn, had tried to embezzle money from the family charity, blaming its disappearance on the blackmailers. The Dude believes the briefcase given to him never contained any money. An enraged Walter insists that Lebowski is faking his paralysis and violently lifts him out of his wheelchair, but discovers that the paralysis is real.</p><p>While Walter and The Dude are bowling, an angry Jesus Quintana bursts into the bowling alley. Walter had previously stated that since he is shomer Shabbas, he could not bowl on a Saturday. In a profanity-laden tirade, Quintana implies that he does not believe that Walter's religious reasons for not wanting to bowl on Saturday are sincere. Although Quintana's bowling partner Liam attempts to restrain him, Quintana threatens Walter and The Dude with sexual violence and storms out. In a final confrontation outside of the bowling alley, the nihilists set fire to the Dude's car, and demand the ransom money. Walter fights them off, but during the altercation, Donny dies from a heart attack. Walter scatters Donny's ashes from a cliff overlooking the Pacific Ocean, but they are blown back over himself and the Dude by an updraft. The Dude loses his temper and yells at Walter, who consoles him, and the two then go bowling.</p><p>At the alley, the Dude encounters the Stranger, the film's narrator, who sums up everything that happened in the movie, noting that while he \"didn't like seeing Donny go,\" he remains optimistic and reveals that Maude is pregnant with a \"little Lebowski on the way.\"</p><br/><h3>Cast</h3><ul><li>Jeff Bridges as Jeffrey \"The Dude\" Lebowski</li><li>John Goodman as Walter Sobchak</li><li>Julianne Moore as Maude Lebowski</li><li>Steve Buscemi as Donny Kerabatsos</li><li>David Huddleston as Jeffrey \"The Big\" Lebowski</li><li>Philip Seymour Hoffman as Brandt</li><li>Tara Reid as Bunny Lebowski</li><li>John Turturro as Jesus Quintana</li><li>Sam Elliott as The Stranger</li><li>David Thewlis as Knox Harrington</li><li>Ben Gazzara as Jackie Treehorn</li><li>Peter Stormare, Torsten Voges, and Flea as Uli Kunkel/Karl Hungus, Franz, and Kieffer, the nihilists</li><li>Jon Polito as Da Fino</li><li>Philip Moon and Mark Pellegrino as Treehorn's thugs</li><li>Jimmie Dale Gilmore as Smokey</li><li>Jack Kehler as Marty, The Dude's landlord</li><li>Dom Irrera as Tony, the chauffeur</li><li>Harry Bugin as Arthur Digby Sellers</li><li>Jesse Flanagan as Larry Sellers</li><li>Leon Russom as the Malibu Police Chief</li><li>Warren Keith as Francis Donnelly, funeral director</li><li>Marshall Manesh as Doctor</li><li>Asia Carrera as Sherry, porn actress</li><li>Aimee Mann as Franz's girlfriend</li><li>Richard Gant and Christian Clemenson as cops</li></ul><br/><h3>Production</h3><h4>Development</h4><p>The Dude is mostly inspired by Jeff Dowd, an American film producer and political activist the Coen brothers met while they were trying to find distribution for their first feature, Blood Simple.: 90 Dowd had been a member of the Seattle Seven, liked to drink White Russians, and was known as \"The Dude\".: 91–92 The Dude was also partly based on a friend of the Coen brothers, Peter Exline (now a member of the faculty at USC's School of Cinematic Arts), a Vietnam War veteran who reportedly lived in a dump of an apartment and was proud of a little rug that \"tied the room together\".: 188 Exline knew Barry Sonnenfeld from New York University and Sonnenfeld introduced Exline to the Coen brothers while they were trying to raise money for Blood Simple.: 97–98 Exline became friends with the Coens and in 1989, told them all kinds of stories from his own life, including ones about his actor-writer friend Lewis Abernathy (one of the inspirations for Walter), a fellow Vietnam vet who later became a private investigator and helped him track down and confront a high school kid who stole his car.: 99 As in the film, Exline's car was impounded by the Los Angeles Police Department and Abernathy found an 8th grader's homework under the passenger seat.: 100</p><p>Exline also belonged to an amateur softball league but the Coens changed it to bowling in the film, because \"it's a very social sport where you can sit around and drink and smoke while engaging in inane conversation\".: 195 The Coens met filmmaker John Milius when they were in Los Angeles making Barton Fink and incorporated his love of guns and the military into the character of Walter.: 189 John Milius introduced the Coen Brothers to one of his best friends, Jim Ganzer, who would have been another source of inferences to create Jeff Bridges' character. Also known as the Dude, Ganzer and his gang, typical Malibu surfers, served as inspiration as well for Milius's film Big Wednesday.</p><p>Before David Huddleston was cast as \"Big\" Jeffrey Lebowski, the Coens considered Robert Duvall (who did not like the script), Anthony Hopkins (who wasn't interested in playing an American), Gene Hackman (who was taking a break from acting at the time), Norman Mailer, George C. Scott, Jerry Falwell, Gore Vidal, Andy Griffith, William F. Buckley, and Ernest Borgnine. The Coens' top choice was Marlon Brando, but he was unable to star in the film due to health issues. Charlize Theron was considered for the role of Bunny Lebowski.</p><p>According to Julianne Moore, the character of Maude was based on artist Carolee Schneemann, \"who worked naked from a swing\", and on Yoko Ono.: 156 The character of Jesus Quintana, an opponent of The Dude's bowling team, was inspired in part by a performance the Coens had seen John Turturro give in 1988 at the Public Theater in a play called Mi Puta Vida in which he played a pederast-type character, \"so we thought, let's make Turturro a pederast. It'll be something he can really run with,\" Joel said in an interview.: 195</p><p>The film's overall structure was influenced by the detective fiction of Raymond Chandler. Ethan said, \"We wanted something that would generate a certain narrative feeling – like a modern Raymond Chandler story, and that's why it had to be set in Los Angeles ... We wanted to have a narrative flow, a story that moves like a Chandler book through different parts of town and different social classes.\" The use of the Stranger's voice-over also came from Chandler as Joel remarked, \"He is a little bit of an audience substitute. In the movie adaptation of Chandler it's the main character that speaks off-screen, but we didn't want to reproduce that though it obviously has echoes. It's as if someone was commenting on the plot from an all-seeing point of view. And at the same time rediscovering the old earthiness of a Mark Twain.\": 169</p><p>The significance of the bowling culture was, according to Joel, \"important in reflecting that period at the end of the fifties and the beginning of the sixties. That suited the retro side of the movie, slightly anachronistic, which sent us back to a not-so-far-away era, but one that was well and truly gone nevertheless.\": 170</p><h4>Screenplay</h4><p>The Coen Brothers wrote The Big Lebowski around the same time as Barton Fink. When the Coen brothers wanted to make it, John Goodman was filming episodes for Roseanne and Jeff Bridges was making the Walter Hill film Wild Bill. The Coens decided to make Fargo in the meantime.: 189 According to Ethan, \"the movie was conceived as pivoting around that relationship between the Dude and Walter\", which sprang from the scenes between Barton Fink and Charlie Meadows in Barton Fink.: 169 They also came up with the idea of setting the film in contemporary L.A., because the people who inspired the story lived in the area.: 41 When Pete Exline told them about the homework in a baggie incident, the Coens thought that that was very Raymond Chandler and decided to integrate elements of the author's fiction into their script. Joel Coen cites Robert Altman's The Long Goodbye as a primary influence on their film, in the sense that The Big Lebowski \"is just kind of informed by Chandler around the edges\".: 43 When they started writing the script, the Coens wrote only 40 pages and then let it sit for a while before finishing it. This is a normal writing process for them, because they often \"encounter a problem at a certain stage, we pass to another project, then we come back to the first script. That way we've already accumulated pieces for several future movies.\": 171 In order to liven up a scene that they thought was too heavy on exposition, they added an \"effete art-world hanger-on\", known as Knox Harrington, late in the screenwriting process. In the original script, the Dude's car was a Chrysler LeBaron, as Dowd had once owned, but that car was not big enough to fit John Goodman so the Coens changed it to a Ford Torino.: 93</p><h4>Pre-production</h4><p>PolyGram and Working Title Films, which had funded Fargo, backed The Big Lebowski with a budget of $15 million. In casting the film, Joel remarked, \"we tend to write both for people we know and have worked with, and some parts without knowing who's going to play the role. In The Big Lebowski we did write for John and Steve, but we didn't know who was getting the Jeff Bridges role.\" Mel Gibson was originally considered for the role of The Dude, but he didn't take the pitch too seriously. In preparation for his role, Bridges met Dowd but actually \"drew on myself a lot from back in the Sixties and Seventies. I lived in a little place like that and did drugs, although I think I was a little more creative than the Dude.\": 188 The actor went into his own closet with the film's wardrobe person and picked out clothes that he had thought the Dude might wear.: 27 He wore his character's clothes home because most of them were his own. The actor also adopted the same physicality as Dowd, including the slouching and his ample belly.: 93 Originally, Goodman wanted a different kind of beard for Walter but the Coen brothers insisted on the \"Gladiator\" or what they called the \"Chin Strap\" and he thought it would go well with his flattop haircut.: 32</p><p>For the film's look, the Coens wanted to avoid the usual retro 1960s clichés like lava lamps, Day-Glo posters, and Grateful Dead music: 95 and for it to be \"consistent with the whole bowling thing, we wanted to keep the movie pretty bright and poppy\", Joel said in an interview.: 191 For example, the star motif, featured predominantly throughout the film, started with the film's production designer Richard Heinrichs' design for the bowling alley. According to Joel, he \"came up with the idea of just laying free-form neon stars on top of it and doing a similar free-form star thing on the interior\". This carried over to the film's dream sequences. \"Both dream sequences involve star patterns and are about lines radiating to a point. In the first dream sequence, the Dude gets knocked out and you see stars and they all coalesce into the overhead nightscape of L.A. The second dream sequence is an astral environment with a backdrop of stars\", remembers Heinrichs.: 191 For Jackie Treehorn's Malibu beach house, he was inspired by late 1950s and early 1960s bachelor pad furniture. The Coen brothers told Heinrichs that they wanted Treehorn's beach party to be Inca-themed, with a \"very Hollywood-looking party in which young, oiled-down, fairly aggressive men walk around with appetizers and drinks. So there's a very sacrificial quality to it.\": 91</p><p>Cinematographer Roger Deakins discussed the look of the film with the Coens during pre-production. They told him that they wanted some parts of the film to have a real and contemporary feeling and other parts, like the dream sequences, to have a very stylized look.: 77 Bill and Jacqui Landrum did all of the choreography for the film. For his dance sequence, Jack Kehler went through three three-hour rehearsals.: 27 The Coen brothers offered him three to four choices of classical music for him to pick from and he chose Modest Mussorgsky's Pictures at an Exhibition. At each rehearsal, he went through each phase of the piece.: 64</p><h4>Principal photography</h4><p>Actual filming took place over an eleven-week period with location shooting in and around Los Angeles, including all of the bowling sequences at the Hollywood Star Lanes (for three weeks) and the Dude's Busby Berkeley dream sequences in a converted airplane hangar. According to Joel, the only time they ever directed Bridges \"was when he would come over at the beginning of each scene and ask, 'Do you think the Dude burned one on the way over?' I'd reply 'Yes' usually, so Jeff would go over in the corner and start rubbing his eyes to get them bloodshot.\": 195 Julianne Moore was sent the script while working on The Lost World: Jurassic Park. She worked only two weeks on the film, early and late during the production that went from January to April 1997 while Sam Elliott was only on set for two days and did many takes of his final speech.: 46</p><p>The scenes in Jackie Treehorn's house were shot in the Sheats-Goldstein Residence, designed by John Lautner and built in 1963 in the Hollywood Hills.</p><p>Deakins described the look of the fantasy scenes as being very crisp, monochromatic, and highly lit in order to afford greater depth of focus. However, with the Dude's apartment, Deakins said, \"it's kind of seedy and the light's pretty nasty\" with a grittier look. The visual bridge between these two different looks was how he photographed the night scenes. Instead of adopting the usual blue moonlight or blue street lamp look, he used an orange sodium-light effect.: 79 The Coen brothers shot much of the film with wide-angle lens because, according to Joel, it made it easier to hold focus for a greater depth and it made camera movements more dynamic.: 82</p><p>To achieve the point-of-view of a rolling bowling ball the Coen brothers mounted a camera \"on something like a barbecue spit\", according to Ethan, and then dollied it along the lane. The challenge for them was figuring out the relative speeds of the forward motion and the rotating motion. CGI was used to create the vantage point of the thumb hole in the bowling ball.</p><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">The Big Lebowski: Original Motion Picture Soundtrack</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">Various artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">February 24, 1998</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><ul><li><span>Rock</span></li><li><span>classical</span></li><li><span>jazz</span></li><li><span>country</span></li><li><span>folk</span></li><li><span>pop</span></li></ul></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">51</span>:<span class=\"s\">45</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Mercury</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><span class=\"mw-redirect\">T-Bone Burnett</span>, <span class=\"mw-redirect\">Joel Coen</span>, <span class=\"mw-redirect\">Ethan Coen</span></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span class=\"mw-redirect\">Coen Brothers</span> film soundtracks chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"><i><span class=\"mw-redirect\">Fargo</span></i><br>(1996)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>The Big Lebowski: Original Motion Picture Soundtrack</b></i><br>(1998)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"><i><span>O Brother, Where Art Thou?</span></i><br>(2000)</td></tr></tbody></table></td></tr></tbody></table><p>The original score was composed by Carter Burwell, a veteran of all the Coen Brothers' films. While the Coens were writing the screenplay they had Kenny Rogers' \"Just Dropped In (to See What Condition My Condition Was in)\", the Gipsy Kings' cover of \"Hotel California\", and several Creedence Clearwater Revival songs in mind. They asked T-Bone Burnett (who would later work with the Coens on O Brother, Where Art Thou? and Inside Llewyn Davis) to pick songs for the soundtrack of the film. They knew that they wanted different genres of music from different times but, as Joel remembers, \"T-Bone even came up with some far-out Henry Mancini and Yma Sumac.\" Burnett was able to secure songs by Kenny Rogers and the Gipsy Kings and also added tracks by Captain Beefheart, Moondog and Bob Dylan's \"The Man in Me\". However, he had a tough time securing the rights to Townes Van Zandt's cover of the Rolling Stones' \"Dead Flowers\", which plays over the film's closing credits. Former Stones manager Allen Klein owned the rights to the song and wanted $150,000 for it. Burnett convinced Klein to watch an early cut of the film and remembers, \"It got to the part where the Dude says, 'I hate the fuckin' Eagles, man!' Klein stands up and says, 'That's it, you can have the song!' That was beautiful.\" Burnett was going to be credited on the film as \"Music Supervisor\", but asked his credit to be \"Music Archivist\" because he \"hated the notion of being a supervisor; I wouldn't want anyone to think of me as management\".</p><p>For Joel, \"the original music, as with other elements of the movie, had to echo the retro sounds of the Sixties and early Seventies\".: 156 Music defines each character. For example, \"Tumbling Tumbleweeds\" by Bob Nolan was chosen for the Stranger at the time the Coens wrote the screenplay, as was \"Lujon\" by Henry Mancini for Jackie Treehorn. \"The German nihilists are accompanied by techno-pop and Jeff Bridges by Creedence. So there's a musical signature for each of them\", remarked Ethan in an interview.: 156 The character Uli Kunkel was in the German electronic band Autobahn, an homage to the band Kraftwerk. The album cover of their record Nagelbett (bed of nails) is a parody of the Kraftwerk album cover for The Man-Machine and the group name Autobahn shares the name of a Kraftwerk song and album. In the lyrics the phrase \"We believe in nothing\" is repeated with electronic distortion. This is a reference to Autobahn's nihilism in the film.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Writer(s)</th><th scope=\"col\" style=\"width:30%\">Performer</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>The Man in Me</span>\"</td><td><span>Bob Dylan</span></td><td>Dylan</td><td class=\"tracklist-length\">3:08</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"<span>Her Eyes Are a Blue Million Miles</span>\"</td><td><span>Captain Beefheart</span></td><td>Beefheart</td><td class=\"tracklist-length\">2:54</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"My Mood Swings\"</td><td><span>Elvis Costello</span> and <span>Cait O'Riordan</span></td><td>Costello</td><td class=\"tracklist-length\">2:10</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"<span>Ataypura</span>\"</td><td>Moises Vivanco</td><td><span>Yma Sumac</span></td><td class=\"tracklist-length\">3:03</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Traffic Boom\"</td><td><span>Piero Piccioni</span></td><td>Piccioni</td><td class=\"tracklist-length\">3:15</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"I Got It Bad &amp; That Ain't Good\"</td><td><span>Duke Ellington</span> and <span>Paul Francis Webster</span></td><td><span>Nina Simone</span></td><td class=\"tracklist-length\">4:07</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Stamping Ground\" (The track actually includes two songs, starting with \"Theme\", which then leads to \"Stamping Ground\")</td><td><span>Moondog</span></td><td>Moondog</td><td class=\"tracklist-length\">5:11</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"<span>Just Dropped In (To See What Condition My Condition Was In)</span>\"</td><td><span>Mickey Newbury</span></td><td><span>Kenny Rogers</span> &amp; <span class=\"mw-redirect\">The First Edition</span></td><td class=\"tracklist-length\">3:21</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Walking Song\"</td><td><span>Meredith Monk</span></td><td>Monk</td><td class=\"tracklist-length\">2:55</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"<span class=\"mw-redirect\">Glück das mir verblieb</span>\" (from <i><span>Die tote Stadt</span> </i>)</td><td><span>Erich Wolfgang Korngold</span></td><td>Ilona Steingruber, <span>Anton Dermota</span> and the Austrian State Radio Orchestra</td><td class=\"tracklist-length\">5:08</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"<span>Lujon</span>\"</td><td><span>Henry Mancini</span></td><td>Mancini</td><td class=\"tracklist-length\">2:38</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"<span>Hotel California</span>\"</td><td><span>Don Henley</span>, <span>Glenn Frey</span> and <span>Don Felder</span></td><td>The <span>Gipsy Kings</span></td><td class=\"tracklist-length\">5:47</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Technopop\" (Wie Glauben)</td><td><span>Carter Burwell</span></td><td>Burwell</td><td class=\"tracklist-length\">3:21</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"<span>Dead Flowers</span>\"</td><td><span>Mick Jagger</span> and <span>Keith Richards</span></td><td><span>Townes Van Zandt</span></td><td class=\"tracklist-length\">4:47</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"4\" scope=\"row\"><span>Total length:</span></th><td>51:45</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Other music used (not on soundtrack album)</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Writer(s)</th><th scope=\"col\" style=\"width:30%\">Performer</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>Tumbling Tumbleweeds</span>\"</td><td><span>Bob Nolan</span></td><td><span>Sons of the Pioneers</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Mucha Muchacha\"</td><td><span>Juan García Esquivel</span></td><td>Esquivel</td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"I Hate You\"</td><td>Gary Burger, David Havlicek, Roger Johnston, Thomas E. Shaw and Larry Spangler</td><td><span>The Monks</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"<span>Requiem in D Minor</span>: Introitus and Lacrimosa\"</td><td><span>Wolfgang Amadeus Mozart</span></td><td>The <span class=\"mw-redirect\">Slovak Philharmonic Orchestra</span> and Choir</td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span>Run Through the Jungle</span>\"</td><td><span>John Fogerty</span></td><td><span>Creedence Clearwater Revival</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Behave Yourself\"</td><td><span>Booker T. Jones</span>, <span>Steve Cropper</span>, <span class=\"mw-redirect\">Al Jackson, Jr.</span> and Lewie Steinberg</td><td><span class=\"mw-redirect\">Booker T. &amp; the MG's</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"<span>Standing on the Corner</span>\"</td><td><span>Frank Loesser</span></td><td><span>Dean Martin</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"<span>Tammy</span>\"</td><td><span>Jay Livingston</span> and <span>Ray Evans</span></td><td><span>Debbie Reynolds</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"We Venerate Thy Cross\"</td><td>traditional</td><td>The Rustavi Choir</td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"<span class=\"mw-redirect\">Lookin' Out My Back Door</span>\"</td><td>John Fogerty</td><td>Creedence Clearwater Revival</td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Gnomus\" (from <i><span>Pictures at an Exhibition</span></i>)</td><td><span>Modest Mussorgsky</span>, arranged for orchestra by <span>Maurice Ravel</span>.</td><td> </td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"<span>Oye Como Va</span>\"</td><td><span>Tito Puente</span></td><td><span>Santana</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Piacere Sequence\"</td><td>Teo Usuelli</td><td>Usuelli</td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"<span>Branded</span> Theme Song\"</td><td>Alan Alch and <span>Dominic Frontiere</span></td><td> </td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"<span>Peaceful Easy Feeling</span>\"</td><td><span>Jack Tempchin</span></td><td><span>Eagles</span></td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"<span>Viva Las Vegas</span>\"</td><td><span>Doc Pomus</span> and <span>Mort Shuman</span></td><td><span>ZZ Top</span> (with Bunny Lebowski); and <span>Shawn Colvin</span> (closing credits).</td><td class=\"tracklist-length\"> </td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Dick on a Case\"</td><td>Carter Burwell</td><td>Burwell</td><td class=\"tracklist-length\"> </td></tr></tbody></table><br/><h3>Reception</h3><h4>Box office</h4><p>The Big Lebowski received its world premiere at the 1998 Sundance Film Festival on January 18, 1998, at the 1,300-capacity Eccles Theater. It was also screened at the 48th Berlin International Film Festival before opening in North America on March 6, 1998, in 1,207 theaters. It grossed $5.5 million on its opening weekend, finishing up with a gross of $18 million in the United States, just above its US$15 million budget. The film's worldwide gross outside of the US was $28.7 million, bringing its worldwide gross to $46.7 million.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 79% based on 186 reviews, with an average score of 7.3/10. The website's critics consensus reads, \"The Big Lebowski's shaggy dog story won't satisfy everybody, but those who abide will be treated to a rambling succession of comic delights, with Jeff Bridges' laconic performance really tying the movie together.\" Metacritic, which uses a weighted average, has assigned the film a score of 71 out of 100 based on reviews from 23 critics, indicating \"generally favorable reviews.\" Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.</p><p>Many critics and audiences have likened the film to a modern Western, while many others dispute this, or liken it to a crime novel that revolves around mistaken identity plot devices. Peter Howell, in his review for the Toronto Star, wrote: \"It's hard to believe that this is the work of a team that won an Oscar last year for the original screenplay of Fargo. There's a large amount of profanity in the movie, which seems a weak attempt to paper over dialogue gaps.\" Howell revised his opinion in a later review, and in 2011 stated that \"it may just be my favourite Coen Bros. film.\"</p><p>Todd McCarthy in Variety magazine wrote: \"One of the film's indisputable triumphs is its soundtrack, which mixes Carter Burwell's original score with classic pop tunes and some fabulous covers.\" USA Today gave the film three out of four stars and felt that the Dude was \"too passive a hero to sustain interest,\" but that there was \"enough startling brilliance here to suggest that, just like the Dude, those smarty-pants Coens will abide.\"</p><p>In his review for The Washington Post, Desson Howe praised the Coens and \"their inspired, absurdist taste for weird, peculiar Americana – but a sort of neo-Americana that is entirely invented – the Coens have defined and mastered their own bizarre subgenre. No one does it like them and, it almost goes without saying, no one does it better.\"</p><p>Janet Maslin praised Bridges' performance in her review for The New York Times: \"Mr. Bridges finds a role so right for him that he seems never to have been anywhere else. Watch this performance to see shambling executed with nonchalant grace and a seemingly out-to-lunch character played with fine comic flair.\" Andrew Sarris, in his review for the New York Observer, wrote: \"The result is a lot of laughs and a feeling of awe toward the craftsmanship involved. I doubt that there'll be anything else like it the rest of this year.\" In a five star review for Empire Magazine, Ian Nathan wrote: \"For those who delight in the Coens' divinely abstract take on reality, this is pure nirvana\" and \"in a perfect world all movies would be made by the Coen brothers.\" Roger Ebert of the Chicago Sun-Times gave the film three stars out of four, describing it as \"weirdly engaging.\" In a 2010 review, he raised his original score to four stars out of four and added the film to his \"Great Movies\" list.</p><p>However, Jonathan Rosenbaum wrote in the Chicago Reader: \"To be sure, The Big Lebowski is packed with show-offy filmmaking and as a result is pretty entertaining. But insofar as it represents a moral position—and the Coens' relative styling of their figures invariably does—it's an elitist one, elevating salt-of-the-earth types like Bridges and Goodman ... over everyone else in the movie.\" Dave Kehr, in his review for the Daily News, criticized the film's premise as a \"tired idea, and it produces an episodic, unstrung film.\" The Guardian criticized the film as \"a bunch of ideas shoveled into a bag and allowed to spill out at random. The film is infuriating, and will win no prizes. But it does have some terrific jokes.\"</p><br/><h3>Legacy</h3><p>Since its original release, The Big Lebowski has become a cult classic. Ardent fans of the film call themselves \"achievers\". Steve Palopoli wrote about the film's emerging cult status in July 2002. He first realized that the film had a cult following when he attended a midnight screening in 2000 at the New Beverly Cinema in Los Angeles and witnessed people quoting dialogue from the film to each other.: 129 Soon after the article appeared, the programmer for a local midnight film series in Santa Cruz decided to screen The Big Lebowski and on the first weekend they had to turn away several hundred people. The theater held the film over for six weeks, which had never happened before.: 130</p><p>An annual festival, Lebowski Fest, began in Louisville, Kentucky, United States, in 2002 with 150 fans showing up, and has since expanded to several other cities. The festival's main event each year is a night of unlimited bowling with various contests including costume, trivia, hardest- and farthest-traveled contests. Held over a weekend, events typically include a pre-fest party with bands the night before the bowling event as well as a day-long outdoor party with bands, vendor booths and games. Various celebrities from the film have attended some of the events, including Jeff Bridges who attended the Los Angeles event. The British equivalent, inspired by Lebowski Fest, is known as The Dude Abides and is held in London.</p><p>Dudeism, a religion devoted largely to spreading the philosophy and lifestyle of the film's main character, was founded in 2005. Also known as The Church of the Latter-Day Dude (a name parody of The Church of Jesus Christ of Latter-day Saints), the organization has ordained over 220,000 \"Dudeist Priests\" all over the world via its website.</p><p>Two species of African spider are named after the film and main character: Anelosimus biglebowski and Anelosimus dude, both described in 2006. Additionally, an extinct Permian conifer genus is named after the film in honor of its creators. The first species described within this genus in 2007 is based on 270-million-year-old plant fossils from Texas, and is called Lebowskia grandifolia.</p><p>Entertainment Weekly ranked it 8th on their Funniest Movies of the Past 25 Years list. The film was also ranked No. 34 on their list of \"The Top 50 Cult Films\" and ranked No. 15 on the magazine's \"The Cult 25: The Essential Left-Field Movie Hits Since '83\" list. In addition, the magazine also ranked The Dude No. 14 in their \"The 100 Greatest Characters of the Last 20 Years\" poll. The film was also nominated for the prestigious Grand Prix of the Belgian Film Critics Association. The Big Lebowski was voted as the 10th best film set in Los Angeles in the last 25 years by a group of Los Angeles Times writers and editors with two criteria: \"The movie had to communicate some inherent truth about the L.A. experience, and only one film per director was allowed on the list.\" Empire magazine ranked Walter Sobchak No. 49 and the Dude No. 7 in their \"The 100 Greatest Movie Characters\" poll. Roger Ebert added The Big Lebowski to his list of \"Great Movies\" in March 2010.</p><h4>Spin-off</h4><p>The Coen brothers have stated that they will never make a sequel to The Big Lebowski. Nevertheless, John Turturro expressed interest in reprising his role as Jesus Quintana, and in 2014, he announced that he had requested permission to use the character. In August 2016, it was reported that Turturro would reprise his role as Jesus Quintana in The Jesus Rolls, a spin-off of The Big Lebowski, based on the 1974 French film Going Places, with Turturro starring, writing, and directing. It was released in 2020. The Coen brothers, although having granted Turturro the right to use the character, were not involved, and no other character from The Big Lebowski was featured in the film.</p><h4>Stella Artois commercial</h4><p>On January 24, 2019, Jeff Bridges posted a 5-second clip on Twitter with the statement: \"Can't be living in the past, man. Stay tuned\" and showing Bridges as the Dude, walking through a room as a tumbleweed rolls by. The clip was a teaser trailer for an ad during Super Bowl LIII which featured Bridges reprising the role of The Dude for a Stella Artois commercial.</p><h4>Use as social and political analysis</h4><p>The film has been used as a tool for analysis on a number of issues. In September 2008, Slate published an article that interpreted The Big Lebowski as a political critique. The center piece of this viewpoint was that Walter Sobchak is \"a neocon,\" citing the film's references to then President George H. W. Bush and the first Gulf War.</p><p>A journal article by Brian Wall, published in the feminist journal Camera Obscura, uses the film to explain Karl Marx's commodity fetishism and the feminist consequences of sexual fetishism.</p><p>In That Rug Really Tied the Room Together, first published in 2001, Joseph Natoli argues that The Dude represents a counter narrative to the post-Reaganomic entrepreneurial rush for \"return on investment\" on display in such films as Jerry Maguire and Forrest Gump.</p><p>It has been used as a carnivalesque critique of society, as an analysis on war and ethics, as a narrative on mass communication and US militarism and other issues.</p><br/><h3>Home media</h3><p>Universal Studios Home Entertainment released a \"Collector's Edition\" DVD on October 18, 2005, with extra features that included an \"introduction by Mortimer Young\", \"Jeff Bridges' Photography\", \"Making of The Big Lebowski\", and \"Production Notes\". In addition, a limited-edition \"Achiever's Edition Gift Set\" also included The Big Lebowski Bowling Shammy Towel, four Collectible Coasters that included photographs and quotable lines from the film, and eight Exclusive Photo Cards from Jeff Bridges' personal collection.</p><p>A \"10th Anniversary Edition\" was released on September 9, 2008, and features all of the extras from the \"Collector's Edition\" and \"The Dude's Life: Strikes and Gutters ... Ups and Downs ... The Dude Abides\" theatrical trailer (from the first DVD release), \"The Lebowski Fest: An Achiever's Story\", \"Flying Carpets and Bowling Pin Dreams: The Dream Sequences of the Dude\", \"Interactive Map\", \"Jeff Bridges Photo Book\", and a \"Photo Gallery\". There are both a standard release and a Limited Edition which features \"Bowling Ball Packaging\" and is individually numbered.</p><p>A high-definition version of The Big Lebowski was released by Universal on HD DVD format on June 26, 2007. The film was released in Blu-ray format in Italy by Cecchi Gori.</p><p>On August 16, 2011, Universal Pictures released The Big Lebowski on Blu-ray. The limited-edition package includes a Jeff Bridges photo book, a ten-years-on retrospective, and an in-depth look at the annual Lebowski Fest. The film is also available in the Blu-ray Coen Brothers box set released in the UK; however, this version is region-free and will work in any Blu-ray player.</p><p>For the film's 20th Anniversary, Universal Pictures released a 4K Ultra HD Blu-ray version of the film, which was released on October 16, 2018.</p><br/>"
  },
  "errorMessage": ""
}