{
  "id": "nm1497472",
  "name": "Nancy Carlsson-Paige",
  "role": "Additional Crew, Actress",
  "image": "https://imdb-api.com/images/original/nopicture.jpg",
  "summary": "Nancy Carlsson-Paige. Actress: Stuck on You. Nancy Carlsson-Paige was born on 9 February 1944 in the USA. She is an actress, known for Stuck on You (2003), Zoom (1997) and FETCH! with Ruff Ruffman (2006). She was previously married to Kent Damon.",
  "birthDate": "1944-02-09",
  "deathDate": null,
  "awards": "",
  "height": "",
  "knownFor": [
    {
      "id": "tt0338466",
      "title": "Stuck on You",
      "fullTitle": "Stuck on You (2003)",
      "year": "2003",
      "role": "Quickee Burger Patron",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYwODE1MTc3NF5BMl5BanBnXkFtZTcwMjQxMzQyMQ@@._V1_Ratio0.6767_AL_.jpg"
    },
    {
      "id": "tt0143081",
      "title": "Zoom",
      "fullTitle": null,
      "year": null,
      "role": "Additional Crew",
      "image": "https://m.media-amazon.com/images/M/MV5BMTI1Njc3MTA4M15BMl5BanBnXkFtZTcwMTMyODgxMQ@@._V1_Ratio0.6767_AL_.jpg"
    },
    {
      "id": "tt0496195",
      "title": "FETCH! with Ruff Ruffman",
      "fullTitle": null,
      "year": null,
      "role": "Additional Crew",
      "image": "https://m.media-amazon.com/images/M/MV5BZjQ0ODUyZDUtNTJkOS00MzVmLTk1ZTQtMDc0MjIyNmVhODczXkEyXkFqcGdeQXVyMzAxNTY5MzY@._V1_Ratio0.6767_AL_.jpg"
    },
    {
      "id": "tt1337599",
      "title": "Consuming Kids: The Commercialization of Childhood",
      "fullTitle": "Consuming Kids: The Commercialization of Childhood (2008)",
      "year": "2008",
      "role": "Self",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk0ODczNzQwNF5BMl5BanBnXkFtZTcwNjk2NjAyMg@@._V1_Ratio0.6767_AL_.jpg"
    }
  ],
  "castMovies": [
    {
      "id": "tt0496195",
      "role": "Additional Crew",
      "title": "FETCH! with Ruff Ruffman",
      "year": "2006-2010",
      "description": "(TV Series) (child development advisor - 100 episodes) - The FETCH Finale (2010) ... (child development advisor) - Long Glen Silver and the Pursuit of the Golden Fetchie! (2010) ... (child development advisor) - Snoop Dog (2010) ... (child development advisor) - Go Belugas Go! (2010) ... (child development advisor) - Wolfing Down Some Barbeque (2010) ... (child development advisor) - Birds Are Handy! (2010) ... (child development advisor) - Ruff Follows His Dream (2010) ... (child development advisor) - Look What the Dog Dug Up! (2010) ... (child development advisor) - That Sculpture Isn't Yours, It's Mime (2010) ... (child development advisor) - Eureka Is Not a Brand of Dog Food (2010) ... (child development advisor) - Who Wants to Trade for Some Old Tracks? (2010) ... (child development advisor) - The Legend of Ruffman's Gold (2010) ... (child development advisor) - How Much Frosting Can You Bear? (2010) ... (child development advisor) - A Whole Flock of Cheese (2010) ... (child development advisor) - It's Ruff in the Ring (2010) ... (child development advisor) - Ruffman Manor Is Haunted (2010) ... (child development advisor) - The Ol' Shell Game (2010) ... (child development advisor) - You Can't Teach an Orange Dog New Tricks (2010) ... (child development advisor) - Game Show Isle (2010) ... (child development advisor) - Ruff Fetches the FETCHers (2010) ... (child development advisor) - Fetch Finale IV: The Prophecy Fulfilled! (2009) ... (child development advisor) - How to Really Train Your Dog (2009) ... (child development advisor) - Gearing Up for Getting Ruff's Goat (2009) ... (child development advisor) - Ruff's Yard Sale Makes a Racket (2009) ... (child development advisor) - Laser/Candid Camera (LePurr Strikes) (2009) ... (child development advisor) - Ruff Needs His Herring Checked (2009) ... (child development advisor) - Shrimp a la Cart (2009) ... (child development advisor) - Is It a Bird? Is It a Plane? It's... Ruffmanman! (2009) ... (child development advisor) - Ruff Bounces Back (2009) ... (child development advisor) - Blossom Bawls While Ruff Has a Ball with Balls (2009) ... (child development advisor) - How to Break the Ice and Also Waddle on It (2009) ... (child development advisor) - How Not to Impress the Press (2009) ... (child development advisor) - Doggie Duties (2009) ... (child development advisor) - Ruff Rocks the (Environmentally Sustainable) House! (2009) ... (child development advisor) - Finding Eight-Legged Tights Isn't Easy (2009) ... (child development advisor) - Ruff's Just Fueling Around (2009) ... (child development advisor) - Ruff Pigs Out and Has a Whale of a Time (2009) ... (child development advisor) - The Ruffmeal Needs More Roughage (2009) ... (child development advisor) - Don't Like Fencing? Try Fencing! (2009) ... (child development advisor) - Season Four Is Canceled (2009) ... (child development advisor) - Finale (2008) ... (child development advisor) - The Ol' Switcheroo (2008) ... (child development advisor) - Just Toying with Ruff (2008) ... (child development advisor) - The People vs. Grandma Ruffman (2008) ... (child development advisor) - I'll Ruff and I'll Ruff and I'll Blow Your House Down (2008) ... (child development advisor) - Feeling Sheepish Ruff? (2008) ... (child development advisor) - Arrgh - All Me Eggs Are Cracked! (2008) ... (child development advisor) - Dog of the Rings (2008) ... (child development advisor) - Socket to Me (2008) ... (child development advisor) - Will They Like the Show? It's a Shoe-In! (2008) ... (child development advisor) - What's Bugging Ruff (2008) ... (child development advisor) - The DogVinci Code (2008) ... (child development advisor) - Do-Se-Dos and Do-Se-Don'ts (2008) ... (child development advisor) - There's Food Safety and Then There's Food Safety (2008) ... (child development advisor) - How Not to Impress a Poodle's Mother (2008) ... (child development advisor) - Mission Improbable (2008) ... (child development advisor) - Mr. Ruffman Goes to Washington (2008) ... (child development advisor) - Just Call Him Spot (2008) ... (child development advisor) - When Home Is a House of Cards (2008) ... (child development advisor) - The Debut of Smell-o-Vision (2008) ... (child development advisor) - The Grand Prizeless Grand Finale (2007) ... (child development advisor) - CSI Ruff (2007) ... (child development advisor) - Take Me Out to the Fashion Show (2007) ... (child development advisor) - Scruff Ruffman at Large! (2007) ... (child development advisor) - How to Get Dogs and Doggerel in Better Shape (2007) ... (child development advisor) - A Lobster Bake? Oh Buoy! (2007) ... (child development advisor) - Tape Loops and Loop-the-Loops (2007) ... (child development advisor) - Yippee Tie Yie Yay, Get Along Little Doggies (2007) ... (child development advisor) - Mush if by Land, Mush Mush if by Sea, Part 2 (2007) ... (child development advisor) - Mush If By Land, Mush Mush If By Sea, Part 1 (2007) ... (child development advisor) - Ruff's Bowling Is Going Downhill (2007) ... (child development advisor) - Roughing It with Ruff (2007) ... (child development advisor) - The Small Fork Is For Dessert (Unless You're A Dolphin) (2007) ... (child development advisor) - I'm OK, You're Okra (2007) ... (child development advisor) - Reducing the Calories and Cats in Your Life (2007) ... (child development advisor) - The Mystery of Dogtopia and Catlantis (2007) ... (child development advisor) - Ruff's Big Break (2007) ... (child development advisor) - You Lucky Dog (2007) ... (child development advisor) - Ruff's Case of Blues in the Brain (2007) ... (child development advisor) - Ruff Ruffman Breaks the Mold (2007) ... (child development advisor) - The Dogcathalon Finale (2006) ... (child development advisor) - Ruff Ruffman Spaces Out (2006) ... (child development advisor) - Scat Cat, Scat (2006) ... (child development advisor) - Relaxin' with Ruff (2006) ... (child development advisor) - Don't Put the Kart Before the Sea Lion (2006) ... (child development advisor) - Tryin' Chef (2006) ... (child development advisor) - Grandma Ruffman's Recipe for Success (2006) ... (child development advisor) - Send in the Clowns (2006) ... (child development advisor) - That Doesn't Float My Boat (2006) ... (child development advisor) - It's Raining Cats and Dogs (2006) ... (child development advisor) - This Old... Lemonade Stand (2006) ... (child development advisor) - The Mystery of the Missing Thing in the Haunted Castle (2006) ... (child development advisor) - B.L.T. For Breakfast? (2006) ... (child development advisor) - To Bee or Not to Bee (2006) ... (child development advisor) - Saturday Night with a Slight Fever (2006) ... (child development advisor) - Ye Olde Colonial Episode (2006) ... (child development advisor) - Cats? I Thought You Said Kites! (2006) ... (child development advisor) - How to Get Out Your Inner Hip Hop (2006) ... (child development advisor) - Good Dancing and Bad Teeth (2006) ... (child development advisor) - 3-2-1 Blast-Off! (2006) ... (child development advisor)"
    },
    {
      "id": "tt0143081",
      "role": "Additional Crew",
      "title": "Zoom",
      "year": "2002",
      "description": "(TV Series) (advisor - 1 episode) - America's Kids Remember (2002) ... (advisor)"
    },
    {
      "id": "tt0338466",
      "role": "Actress",
      "title": "Stuck on You",
      "year": "2003",
      "description": "Quickee Burger Patron"
    },
    {
      "id": "tt0119217",
      "role": "Actress",
      "title": "Good Will Hunting",
      "year": "1997",
      "description": "Harvard Square Extra (uncredited)"
    },
    {
      "id": "tt1567665",
      "role": "Self",
      "title": "Play Again",
      "year": "2010",
      "description": "(Documentary)"
    },
    {
      "id": "tt1337599",
      "role": "Self",
      "title": "Consuming Kids: The Commercialization of Childhood",
      "year": "2008",
      "description": "(Documentary) Self"
    },
    {
      "id": "tt0169455",
      "role": "Self",
      "title": "Inside the Actors Studio",
      "year": "2007",
      "description": "(TV Series) Self - Matt Damon (2007) ... Self (uncredited)"
    }
  ],
  "errorMessage": ""
}