{
  "imDbId": "tt0021749",
  "title": "City Lights",
  "fullTitle": "City Lights (1931)",
  "type": "Movie",
  "year": "1931",
  "items": [
    {
      "publisher": "The Dissolve",
      "author": "Scott Tobias",
      "link": "",
      "rate": "100",
      "content": "There’s dignity and folly to The Tramp in City Lights, and everything in between."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-city-lights-1931",
      "rate": "100",
      "content": "If only one of Charles Chaplin's films could be preserved, “City Lights” (1931) would come the closest to representing all the different notes of his genius. It contains the slapstick, the pathos, the pantomime, the effortless physical coordination, the melodrama, the bawdiness, the grace, and, of course, the Little Tramp--the character said, at one time, to be the most famous image on earth."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/city-lights-review/",
      "rate": "100",
      "content": "Both funny and touching, this showcases Chaplin at his best."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/city-lights",
      "rate": "100",
      "content": "Of all Chaplin's films (with the possible exception of Modern Times), City Lights offers the fullest characterization of the Tramp. He's a loner who comes and goes almost like a dream figure or a drunken angel. Without family, friends, or a place to live, he stands outside of our reality, sometimes trying to fit in and sometimes not caring whether or not he does. Yet, like a child, he is a complete innocent with a pure heart and the best motives."
    },
    {
      "publisher": "",
      "author": "New York Daily News",
      "link": "https://www.nydailynews.com/entertainment/movies/city-lights-shines-chaplin-brilliance-1931-review-article-1.2513696",
      "rate": "100",
      "content": "We're exhausted because we laughed so much and so heartily at City Lights that we feel considerably weakened. Here's praying that we fast regain our strength so that we may journey to the George M. Cohan theatre to see Charlie again - and again - in this new heart-breaking masterpiece of comedy which he offers pantomimically to a worldful of movie-goers...City Lights is excruciatingly funny and terribly, terribly sad. It makes you chuckle hysterically. You have the greatest time imaginable, and yet, occasionally you find little hurty lumps in your throat."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://www.nytimes.com/1931/02/07/archives/chaplin-hilarious-in-his-city-lights-tramps-antics-in-nondialogue.html",
      "rate": "100",
      "content": "It was a joyous evening. Mr. Chaplin's shadow has grown no less."
    },
    {
      "publisher": "",
      "author": "Los Angeles Times",
      "link": "https://www.latimes.com/socal/glendale-news-press/entertainment/andy-klein/tn-gnp-dvd-review-city-lights-beams-on-new-criterion-release-20131118-story.html",
      "rate": "100",
      "content": "Its last few moments are among the most brilliant (and risky) endings in film history."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "100",
      "content": "A beautiful example of Chaplin's ability to turn narrative fragments into emotional wholes. The two halves of the film are sentiment and slapstick. They are not blended but woven into a pattern as eccentric as it is sublime."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "The movie exemplifies everything that was great and grating about the filmmaker’s artistry: his impeccable physical slapstick (see the boxing match) and his overreliance on embarrassing sentimentality; his intuitive understanding of the medium and frequent displays of the mammoth martyr complex that informed the comedian’s every move."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1931/film/reviews/city-lights-1200410506/",
      "rate": "70",
      "content": "It’s not Chaplin’s best picture, because the comedian has sacrificed speed to pathos, and plenty of it. This is principally the reason for the picture running some 1,500 or more feet beyond any previous film released by him. But the British comic is still the consummate pantomimist, unquestionably one of the greatest the stage or screen has ever known. Certain sequences in “City Lights” are hilarious."
    }
  ],
  "errorMessage": ""
}