{
  "imDbId": "tt0021749",
  "title": "City Lights",
  "fullTitle": "City Lights (1931)",
  "type": "Movie",
  "year": "1931",
  "items": [
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0007532",
      "warningSpoilers": false,
      "date": "12 September 2004",
      "rate": "10",
      "helpful": "153 out of 172 found this helpful.",
      "title": "Lady and the Tramp, before animation and at the start of talkies- one of the most wonderful films ever conceived and executed",
      "content": "If there is one Charlie Chaplin film to recommend, as others have pointed to in the past, City Lights is the one. Though Chaplin played his Tramp character superbly in other movies, like Modern Times and The Gold Rush, City Lights displays the Tramp at his funniest, his bravest, his most romantic, and his most sympathetic. It's tough for filmmakers in recent days to bring the audience so close emotionally with the characters, but it's pulled off. The film centers on three characters- the Tramp, the quintessential, funny homeless man who blends into the crowd, but gets caught in predicaments. He helps a drunken businessman (Myers, a fine performance in his own right) from suicide, and becomes his on and off again friend (that is, when it suits him and doesn't notice his 'friend's' state). The other person in the Tramp's life is the Blind Flower Girl (Virginia Cherrill, one of the most absorbing, beautiful, and key female performances in silent film), who are quite fond of each other despite the lack of total perception. The emotional centerpiece comes in obtaining rent and eye surgery money, which leads to a (how else can I put it) magical boxing match where it's basically a 180 from the brutality and viscerality of a match in say Raging Bull. Though there is no dialog, the film achieves a timelessness- it's essentially a tale of two loners who find each other, lose each other, and find each other again (the last scene, widely discussed by critics for decades, is moving if not tear-inducing). And it's never, ever boring- once you get along with the Tramp, you find the little things about him, the reaction shots, the little things he does after the usual big gag (look to the ballroom scene for examples of this, or when he gets a bottle of wine poured down his pants without the other guy noticing). Truth be told, if this film makes you indifferent, never watch Chaplin again. But if you give yourself to the film, you may find it's one of the most charming from the era, or perhaps any era."
    },
    {
      "username": "EUyeshima",
      "userUrl": "https://www.imdb.com/user/ur3608743",
      "reviewLink": "https://www.imdb.com/review/rw1239665",
      "warningSpoilers": true,
      "date": "16 December 2005",
      "rate": "10",
      "helpful": "89 out of 100 found this helpful.",
      "title": "Chaplin's Masterpiece...and Oh Those Last Five Minutes!",
      "content": "Let me join the consensus and call Charlie Chaplin's \"City Lights\" a masterpiece. It's only 81 minutes long, but they are among the best 81 minutes you could spend at the movies, and the last five minutes are simply exquisite. Keep your Kleenex box at arm's length as I doubt if there has been a more honestly heartbreaking scene captured on film. When the formerly blind girl gives the Little Tramp a flower and ultimately says \"Yes, I can see now\", the scene takes on such emotional gravity as to defy explanation.Chaplin was at his zenith in 1928 when he started a journey of more than two years to develop and film this story, and the Little Tramp had already been a familiar character to audiences for over a decade. He had already made the classics \"The Gold Rush\" (1925) and \"The Circus\" (1928) starring his character, so it's obvious he felt a need to take a slightly different direction and deepen the character this time. The advent of talkies didn't stop Chaplin from making this \"Comedy Romance in Pantomime\" (as he subtitled it), as he knew giving the Little Tramp a voice would limit his appeal as a universal character. What I particularly enjoyed in this film is how the Little Tramp fancies himself as a well-mannered gentleman in spite of all the circumstances that bring him down, even going to prison for love. It is this self-delusion and his subsequent mistaken identity as a millionaire that leads him to the blind flower girl, played in an effectively plaintive manner by Virginia Cherrill. Her performance is a greatly underrated element in this film, as she displays the right amount of vacant innocence to make the last minutes so memorable. Simply compare her to the screen test shown of Georgia Hale, Chaplin's leading lady in \"The Gold Rush\" and an obviously more experienced actress than Cherrill, as Hale struggles to show the right balance between condescension and beatific revelation when she realizes the Little Tramp is the \"wealthy\" gentleman who paid for the restoration of her sight.Of course, this would not be a Chaplin film without the brilliance of his comedy routines and there is a treasure trove of classic scenes - the rising and lowering of the street elevator, the shifting musical chairs scene at the nightclub, the mock suicide at the canal and especially the boxing scene, which has been imitated by so many lesser filmmakers (and was according to the footage included as a DVD extra, inspired by an earlier Chaplin short \"The Champion\" from 1915). Even a simple moment, for example, when the Little Tramp mistakes a piece of thread from his vest for a ball of twine, is impressive for the sheer delicacy of the moment. And special mention needs to go to Chaplin's musical score, where he beautifully interweaves José Padilla's \"La Violetta\" as his love theme.The transfer to DVD is very good, and the 2-DVD set has plenty of extras though they vary in quality. The Serge Bromberg documentary provides an informative supplement to the film, and the footage of Chaplin from a Vienna press tour is fascinating since it captures the long-forgotten worldwide frenzy he created back then. The aforementioned Georgia Hale screen test is a worthwhile addition but runs on a bit too long. The 10-minute home movie of Chaplin's trip to Bali has a certain anthropological interest but seems rather pointless otherwise. Regardless, the movie itself is rewarding enough and an exquisite jewel that completely justifies Chaplin's reputation as one of the world's leading filmmakers."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0007479",
      "warningSpoilers": false,
      "date": "29 May 2001",
      "rate": "",
      "helpful": "48 out of 54 found this helpful.",
      "title": "Chaplin's Classic of Humor and Humanity",
      "content": "Charlie Chaplin's \"City Lights\" contains a blend of humor and humanity that make it memorable for everyone who watches it. Although made very much in the old-fashioned silent film tradition, much of it is timeless, too.After a few minutes of slapstick at the beginning, Charlie's \"little tramp\" character makes two acquaintances. He meets a blind girl selling flowers, who mistakes him for a rich man, and the two become very fond of each other. Then he meets a real millionaire, who is drunk, depressed, and about to commit suicide. In a comic scene, the tramp persuades the millionaire not to go through with it, making himself a devoted friend.The tramp soon learns that there is an operation that could give the girl her sight, and tries to think of some way he could help. His scenes with the girl and her grandmother are moving, while his determination to help lead him into some comic escapades - his attempt to win money in a boxing match being particularly funny, and one of Chaplin's best comic pieces. Meanwhile, when his millionaire friend is drunk, he dotes on the tramp, but when sober he forgets who the tramp is, leading to more amusing scenes and occasional trouble for Charlie.All of the comedy leads up to a finale that is one of the best-remembered scenes in any film. \"City Lights\" shows the power of the camera in the hands of a master, who without words can move his audience or make them laugh. Anyone who appreciates good cinema should see it at least once."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0007474",
      "warningSpoilers": false,
      "date": "22 December 2000",
      "rate": "10",
      "helpful": "97 out of 115 found this helpful.",
      "title": "You can't go wrong with Charlie Chaplin, but City Lights is even better than Chaplin's films usually are.",
      "content": "Chaplin takes himself a little more seriously in City Lights, and the results are spectacular. The musical score which Chaplin composed for the film was one of the many highlights, and even though Charlie's performance is much more dramatic than usual in some scenes, the hilarious comedy for which he is known and loved is still abundant. City Lights is so well made that it is one of the very few movies in which the obvious flaws can be gladly overlooked. Yes, you can clearly see the string holding Chaplin up in the sidesplittingly funny boxing scene, but who cares? That is such classic slapstick that little things like that really don't matter. Besides, let's keep in mind that this movie was made seventy years ago. Chaplin does a phenomenal job in his traditional role of the tramp, and develops a perfectly convincing romantic relationship with the blind flower girl on the sidewalk. His friendship with the drunken rich guy is hilarious, but it also makes a significant comment about the problems of alcohol. This is truly a great film, which should not be forgotten."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1693812",
      "warningSpoilers": false,
      "date": "15 July 2007",
      "rate": "9",
      "helpful": "54 out of 65 found this helpful.",
      "title": "One Of Chaplin''s Best & Most Endearing Films",
      "content": "I always thought this was one of Charlie Chaplin's nicest, most under-appreciated silent movie gems. Then I discovered it really wasn't underrated; it's rated very high on most critics' lists. It may be that I usually hear about some of his other movies than I do this one.Part of the reason I think so highly of this is simply that I'm a sentimentalist and story in this film is a very touching one. It's a romance between Charlie's tramp character (no name) and a blind girl, who also had no name in this film. Virginia Cherill, who played the blind woman and had a wholesome, pretty face which I found very attractive.I'm not always a huge fan of pantomime except for some great comedians of the era like Chaplin, Harold Lloyd and Buster Keaton, but Chaplin was so good at it and this is one of the last of dying breed as \"talkies\" were out in full force by 1931. Chaplin was at his best in silent movies, anyway, and his comedy routines are legendary. He gave me a lot of laughs in this film, as always, and I particularly laughed (I love slapstick) at the boxing scene. Kudos, too, to Harry Myers as the \"eccentric millionaire.\"There's a lot of drama as well as humor in this 86-minute gem as the Tramp tries to aid a blind girl, raising money so she can get an operation to restore her sight.Comedy, romance, drama (with suffering) all combine to make this an extraordinary piece of entertainment. It's hard to believe this movie was not up for one, single Academy Award."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw1827794",
      "warningSpoilers": false,
      "date": "26 February 2008",
      "rate": "",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Masterpiece",
      "content": "City Lights (1931) **** (out of 4)Charlie Chaplin returns as The Tramp and this time he falls in love with a blind girl (Virginia Cherrill) and sets out to help her. The Tramp eventually meets a suicidal drunk (Harry Myers) and their friendship leads to what might eventually help the girl he loves.Chaplin made great films before and after CITY LIGHTS but for my money this here is his greatest film as well as one of the greatest films ever made. Not only is it one of the funniest movies ever made but I'd also argue that it's one of the greatest love stories, if not the greatest. It really says a lot when a movie can conqueror two genres at one time but CITY LIGHTS is simply one of the greatest movies ever made.I think it says a lot that you get one classic scene after another and there's really not a weak spot to be found here. Being 1931 it took some real guts for Chaplin to deliver a silent film and I think he knew that he had to deliver something special because people had moved onto sound. He certainly delivered something special as this here was easily the funniest film he had made up to this point. The opening sequence with the introduction of The Tramp was priceless and we got one hilarious scene after another from that point. The scenes with the drunk are downright hilarious as is another scene where The Tramp is trying to eat but without much success. The cigar sequence is a masterpiece as is the by the water. In fact, the story between The Tramp and the drunk would have made a terrific movie on its own. Just like the stuff with The Tramp and the blind girl would have made a perfect film. What's so special is that you get both stories wrapped up in one and it really delivers.Chaplin played The Tramp countless times but he was never better than he is here. Just check out the timing in countless scenes including the boxing match and you can't help but be impressed with the actor. Myers also deserves a lot of credit as the drunk as his timing has to match that of Chaplin throughout and the two men do a wonderful job together. Then you've got Cherrill who wasn't a professional actor but the director makes her shine throughout.CITY LIGHTS contains one great scene after another and all of the laughs lead up to one of the most powerful endings in film history. There's really not enough great things that can be said about this film as it continues to get better with each passing year."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1860291",
      "warningSpoilers": false,
      "date": "19 April 2008",
      "rate": "9",
      "helpful": "76 out of 91 found this helpful.",
      "title": "A one-man virtuoso performance",
      "content": "Once again Chaplin plays his famous creation, the beloved Tramp The noble Little Fellow meets and falls in love with a blind flower girl She assumes he is wealthy man and offers him a flower, which he attentively accepts with his last penny One night by chance he rescues a drunken millionaire from drowning The rich gentleman becomes a generous friend when drunk but doesn't recognize the tramp when sober Chaplin takes the blind girl under his wing, and takes flight with the millionaire's money to cure her blindness \"City Lights\" engaged a true genius in a graceful and touching performance which arouses profound feelings and joy with great simplicity of style and tragic tale Each scene was the result of hard-working detail and planning"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1897291",
      "warningSpoilers": false,
      "date": "22 June 2008",
      "rate": "",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Wonderful set-pieces make the film",
      "content": "As always the little tramp is fleeing the long arm of the law when he is mistaken for a wealthy man by a blind girl selling flowers by the roadside. While he longs to help her the tramp knows he cannot. However when he is at his lowest he stumbles upon a drunken man who he helps out who may be able to help him in turn  if the two of them can sober up long enough.In response to seeing some modern trash posing as \"comedies\" recently (Little Man, Norbit, Pluto Nash  I'm looking at you) I decided to check out some comedies that have stood the test of time  a few Chaplin films being among them. City Lights is one of those film that you will think you have seen even when you have not. I knew I had never actually seen it but the wonderful opening scene on the statue and the scenario of the blind girl by the side of the road were very familiar to me and I was right into it from the start. As was often the case, this film has a thin narrative but one that allows for several scenarios for Chaplin to work his magic. And so he does with some classic sequences across the whole film.The statue scene is memorable for how he makes so much out of so little but the brilliant choreography of the boxing match had me rolling with laughter as it moved so beautifully and imaginatively around the ring. Chaplin is a master and this is just one of many films that shows it as he creates a great little clown that we care about but can also laugh at. His support do no more than that  support him  but yet they are also roundly good. Cherrill provides attractive heart despite her simple character, while Myers, Garcia, Mann and a few others do good physical work alongside Chaplin.City Lights is a really great film that is all the more impressive for still feeling fresh and funny more than seventy years after it was made. The simple narrative is the frame but it is the wonderful and frequent set-pieces that tickle and also stick in the mind. So tonight you might be looking at your film queue with lots of modern comedies but it is worth bumping this classic to the top of the list instead."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6162972",
      "warningSpoilers": false,
      "date": "10 October 2020",
      "rate": "8",
      "helpful": "16 out of 18 found this helpful.",
      "title": "The Caring Clochard...",
      "content": "A good deal of silent black and white cinema is a chore to endure but the cream of that era still manages to rise to the top and compete, in its own unique and original way, with the cinema that followed over the decades up to and including today. A significant number of those films were written and performed by Charlie Chaplin and, if you watched nothing other than the films he made from that period, including this, your appreciation of his genius and talent would flower and grow, your vision of sincerity and generosity restore and your enchantment of the simpler and more genuine things in life embellish."
    },
    {
      "username": "Thunderbuck",
      "userUrl": "https://www.imdb.com/user/ur1500205",
      "reviewLink": "https://www.imdb.com/review/rw0973440",
      "warningSpoilers": false,
      "date": "6 December 2004",
      "rate": "",
      "helpful": "77 out of 88 found this helpful.",
      "title": "Amusing comedy sets up SPECTACULAR ending",
      "content": "This is my favorite Chaplin film, but I don't want that to diminish his other work, either. MODERN TIMES was an outstanding work of social satire, THE GOLD RUSH was great slapstick, and even the largely-neglected MONSIEUR VERDOUX strikes a certain unforgettable tone. Chaplin didn't make a bad movie, and I'm not even sure that CL is his best, exactly. But it IS my favorite, if only for the ending.That ending has been the subject of much comment here. I think it's a masterpiece in a single scene. Chaplin's little tramp has never seemed less like a character and more like a living, breathing human being. It's a monument to understated sentimentality.To me, the rest of the film exists largely to set the context for that one magnificent piece of celluloid. Yes, the boxing scene is great, and the scene where he rescues the millionaire is also wonderful, but it's that ending that makes us all love this movie."
    },
    {
      "username": "lugonian",
      "userUrl": "https://www.imdb.com/user/ur0853359",
      "reviewLink": "https://www.imdb.com/review/rw0007508",
      "warningSpoilers": false,
      "date": "15 February 2003",
      "rate": "10",
      "helpful": "61 out of 78 found this helpful.",
      "title": "True Blind Love",
      "content": "CITY LIGHTS (United Artists, 1931), written, directed and starring Charlie Chaplin (1889- l977), is a silent comedy-drama released at the height of the sound era. Distributing a movie in the silent film tradition at the time when silents were considered a fad, Chaplin gambled with this production, and made it pay off. Although Chaplin hails THE GOLD RUSH (1925) as the one movie he would most want to be remembered, CITY LIGHTS nearly dims out his GOLD RUSH and at the same time, practically places his other silent masterpiece, THE CIRCUS (1928) to oblivion. CITY LIGHTS has stood the test of time, balancing perfectly a mixture of comedy and drama, but in Chaplin's case, pathos.Subtitled, \"A comedy romance in pantomime,\" the story opens in the early morning where the mayor is dedicating a statue to the citizens of the city. After the unveiling, the crowd finds a little tramp (Charlie Chaplin) sleeping on the lap of one of the figures. As he tries to climb down, he encounters one problem after another. This opening scene alone is priceless. With such a great beginning, Chaplin adds in more comedic insertions blended into the plot. The theme to CITY LIGHTS is remembered mainly about a tramp's love for a blind girl. However, there is a subplot, involving the tramp's involvement with a millionaire drunk, which, by far, takes up more time than the sentimental love story. These two segments actually set the pattern. First segment, set in the afternoon, finds Charlie walking down the street, examining a nude statue in a shop, being annoyed by some newsboys making fun of his tattered clothing. He encounters a beautiful blonde girl (Virginia Cherrill) selling flowers. After she drops one of her flowers, Charlie notices her feeling about the sidewalk for it, thus, realizing she's blind. Smitten by her beauty, he picks it up and pays her for it. Minutes later, the slamming of a limousine door is heard, with the girl believing the kind gentleman, Charlie, to be a millionaire. Second segment, set at night, finds Charlie encountering a drunk (Harry Myers) trying to commit suicide by drowning himself. Just as Charlie is about to save him, he in turn falls into the river. The drunk, in gratitude for saving his life, takes Charlie under his wing to accompany him to various night clubs until dawn. By morning, the millionaire, now sober, fails to recognize or remember Charlie and orders orders his butler to escort this stranger out of his mansion. This running gag that's repeated in the story might play itself as repetitious, but Chaplin manages to breathe new life and funnier routines through his encounters with the drunk and their all night binges. By day, Charlie looks after the blind girl and worries when she's not at her usual corner selling flowers. Finding that she's ill and being cared by her grandmother (Florence Lee), whose behind with her rent and threatened with eviction, Charlie offers to help by obtaining and losing various jobs, ranging from street-cleaning to fighting in a boxing match. Reading in a newspaper of a European doctor who restores sight for the blind, Charlie gives the girl $1,000 for an operation, the money offered to him by the drunken millionaire, who, after sober, accuses Charlie of robbing him, has his arrested and serving jail time. The climatic finish is truly the best thing Chaplin has ever done and certainly one not to be missed.Featured in the supporting cast are Henry Bergman, Allan Garcia, Albert Austin, and Hank Mann. While much has been discussed about Chaplin's performance, his co-star, Virginia Cherrill, as the blind girl (no name given), should not go without mention. Even though her future film career consisted of forgettable programmers, and at one time being one of the future wives of film actor, Cary Grant, her performance is excellent by all means. Although it's been said that future film star Jean Harlow (1911-1937) appears as an unbilled extra in the night club sequence, she is visible in a surviving still photograph, but no such scene appears in the finished product. Unlike THE GOLD RUSH, CITY LIGHTS had limited showings in revival houses in later years, and was never allowed to be distributed to television. Being first introduced to CITY LIGHTS at New York City's revival movie house, The Regency Theater, formerly located on Broadway and 67th Street, in 1979, the memorable thing about this event are the roars of laughter from its theater packed audience. There was one man, probably a big fan reliving his childhood memories, whose laughter almost drowned out the underscoring of the film. No doubt he was having more fun watching this movie than anyone else. Watching CITY LIGHTS surrounded by an appreciative audience theater is one way to truly appreciate and experience the feel of silent film comedy, and to think back as to how the audience reacted in same back in 1931.After Chaplin's death in December of 1977, CITY LIGHTS, along with his other silent features, were not only resurrected for a new generation to endure, but became readily available on video cassette at the time of Chaplin's 100th birthday, 1989. In later years, CITY LIGHTS was frequently revived on various cable channels, ranging from Turner Network Television (TNT) in the early 1990s, American Movie Classics up to 2001, and finally Turner Classic Movies. The complete musical soundtrack that accompanies CITY LIGHTS happens to be the original score composed to perfection by Chaplin himself. Much has been written and said about CITY LIGHTS over the years. To learn more about the making, difficulties and long term preparations to CITY LIGHTS, either watch Kevin Blownlow's 1980 documentary, Hollywood: A Celebration of the American Silent Film, as narrated by James Mason, or Brownlow's other documentaries dedicated entirely to Chaplin's career, including outtakes to CITY LIGHTS as well as scenes involving Virginia Cherrill's temporary replacement, Georgia Hale, Chaplin's co-star in THE GOLD RUSH. (****)"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0007499",
      "warningSpoilers": true,
      "date": "30 April 2002",
      "rate": "",
      "helpful": "22 out of 27 found this helpful.",
      "title": "Seeing and Being Seen",
      "content": "Spoilers herein.For me, this film falls not into the category of favorite films (I'm a Marx brothers kind of guy) but earns instead a place on a very short list of most important movies.That's because it has two features that I truly appreciate.It is as pure a vision of its creator as is possible. Nearly all other films are engineered from prior work. Not so with a small list of projects from Welles, Kurosawa, Eisenstein, ... and this one project of Chaplin's. They are wholly original, springing from some nether world.But the other element is the one that impresses the most. This film is about itself, about the art of visual narrative. Chaplin was intelligent enough to know that what he was doing was new. The issues are centered on what the audience `sees,' so while he struggles with what and how the audience sees, he builds that into the fabric of the story.The primary framing is about the blind girl who falls in love with him by `seeing' him in her own way. Then `sees' him at the end in a different way. The rich man recognizes the tramp when drunk but does not when he is not. Nearly all the jokes, indeed every element of the film is about this same dynamic: the elevator which is not seen but then was, the burglars the same, the Tramp on the statue, on the barrel. Even seeing the cigar before the bum does. Even us seeing the soap and the foreman not.The `seeing' is carried over to `hearing' with the politician and whistle jokes. And then even further as Charlie turns his back on the new technology of giving us speech and instead `shows' us something else: he writes and conducts an amazing score instead. This is truly amazing (and one reason to take Mike Figgis seriously).No wonder Orson Welles considered this the most important film ever made. But as to the best to watch? Because film is so derivative, my own gold standard for the Tramp is Robert Downey's (and to some extent Depp's). Comic timing is something that evolves, and those men make a more effective Tramp for my modern ability to see.Trivia: Chaplin found the `blind' girl in a group of spectators at a fight and was struck with how her expressions reflected what she saw. She's pretty as well of course, but certainly not the prettiest Chaplin knew. See how Chaplin separately works in both the fight (a performance) and her reaction to his performance in the film."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2295186",
      "warningSpoilers": false,
      "date": "14 August 2010",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "In my honest opinion, this is Charlie Chaplin's masterpiece",
      "content": "As much as I loved The Kid, The Gold Rush, Modern Times and The Great Dictator, City Lights is the film I consider Charlie Chaplin's masterpiece. And there are several reasons why this is so for me.I love how City Lights is filmed, once again the cinematography is stunning as are the costumes and sets. The music is also a delight(though my favourite soundtrack in a Chaplin movie is the one for Modern Times) with plenty of themes that stuck in my head, while the sound effects are wonderfully incorporated and the subtitles easy to understand. The comedy is brilliantly done, the scene in the boxing ring is not only one of my favourite scenes in a Chaplin movie(along with the final sequence and the dance of the bread rolls of The Gold Rush, the final scene of The Kid and the speech from The Great Dictator) but ever in a comedy, while there is a very touching love story between the Tramp and the little blind girl(played touchingly by Virginia Cherrill) he falls in love with. And I also found the close-up climax achingly poignant because of its beauty and ambiguity. Chaplin is superb, his pantomime skills and physical humour are extremely well judged and he is acts beautifully with Cherrill.Overall, yet another Chaplin masterpiece, yet for me this is the best of them all. 10/10 Bethany Cox"
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2407574",
      "warningSpoilers": true,
      "date": "2 April 2011",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A cinematic triumph ... a universal masterpiece ...",
      "content": "Charlie Chaplin was the greatest film-maker of all-time and only two words are enough to measure up the greatness of his talent and its cultural significance in Cinema's history: \"City Lights\", a title that resonates in my heart as the most inspiring triumph of the human spirit. \"City Lights\" is not just a film; it's a cinematic gift from a genius, who sublimated the simplicity of the pantomime to create the greatest and most universal romantic comedy that ever enchanted the silver screen.The universality and emotionality of the film have remained intact, and continue to provoke the laughs and the tears of movie lovers all over the world even after 80 years. It's an incredible achievement because it stood the test of time and transcended the geographical barriers when other classics are more appreciated in a sort of sentimental and magnanimous way, as if we're trying to repress the feeling that some elements have obviously dated. But Chaplin's film hasn't dated because it chose to be dated from the start, at the time of its release. It was a silent movie in the talking era, when all the fans were enthusiastic of hearing shouts, screams, cars, declarations of loves, bad-ass dialogs and all that new stuff, Chaplin, in an admirable confidence, did what he did the best, the pantomime, the only language that could fit for the most fascinating cinematic character: the Little Tramp.And what could have been a timely weakness quickly became the film's ticket for immortality. 1931's audiences applauded the film as a celebration of humanism that could never be imitated again. And only a movie with no words could have touched the hearts of so many people in the world, precisely, during an era where laughs and cheers, trust and optimism were needed. It didn't take a political or a denunciative approach to inspire the hearts, only laughs, cheers and the depiction of the most beautiful and valuables virtues of humanity. No speeches needed, words were as meaningless as these hilarious squawks we heard at the beginning. This gibberish talk is Chaplin reminding us of the futility of words, and we trust him. Maybe, dialogs make you miss the essential in a film.Antoine De Saint Exupéry, who wrote \"The Little Prince\", said: \"One sees well only with the heart. The essential is invisible to the eyes.\" I guess for Chaplin, who shared the same humanism of the French writer and pilot, you could translate his view on dialogs by this paraphrase : \"One sees well only with the eyes and the heart. The essential is inaudible to the ears\" No need for words but in \"City Lights\", our ears are enchanted by the beautiful \"flower girl\" melody, and sadness and happiness that inhabit the film has never been so graciously embodied. And while we float in this atmosphere, the action that follows is the tribute of Chaplin's comic genius, his body language and facial expressions are so rich, so fragile I can imagine my inner child being amused by this film, while I'm moved as an adult, by the purity of the character who wants to help this blind girl who sells flowers. \"The Little Tramp\" is the quintessential clown without a make-up and a true hero, a word often overused, but not in this case.The Tramp is a hero because of his altruistic nature. He's apolitical but indirectly highlights the social gaps in the modern cities, without letting the film fall into political denunciation. He saves a rich man who wants to commit a suicide and after having developed a fondness for him, the rich makes him discover the world, amusements, dance clubs, parties, all the decadence of the bourgeoisie where the Tramp obviously doesn't fit. But he stands, as a friend, and uses the friendship to help the blind girl who believes he's a rich man. It's the myth of the Charming Prince revisited by Chaplin, through a character driven by his heart. And despise this nobility of spirit, he's constantly bullied, hit, misunderstood. And this is where resides the sadness of the film, the struggle of the Tramp in this journey into the injustices of society. But he's a man, who gets hit but hits back, never remaining a victim, victims are helpless, the girl is helpless, if he becomes so, she has no salvation, the girl is his inspiration, and the only one who never harms him in the film.And boy, how many hits did he get ... of course, I'm referring to the hilarious legendary boxing scene ... probably one of the greatest Chaplin's moments. It has the format of his short stories, but here it does have a particular meaning, since we know what drives him to do so, he wants to get the money to pay the rent for the blind girl, his challenge is our hope, and we hope he'll get it. And as the ultimate tragic hero, not only he'll help her, but he'll get enough money to cure her blindness, before going to jail, rejected by the same rich friend who gave him the money. Rich are so rich, they're perverted by money, and treat friends as they deal with valuable things, but things have no value, love, feeling and generosity have.And the value of these things are illustrated in one of the greatest, if not the greatest concluding scene ever, where the blind girl, now cured, after giving the rose to the Tramp, understands that he is the \"rich man\", the Charming Prince who haunted her dreams. The Tramp is anxious, and timidly asks her if she can see now. The answer of the girl and the breathtaking concluding smile of the Tramp create the most beautiful and inspiring ending ever. Because she had just realized that she saw the essential, which ironically, was invisible to the eyes."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw2064641",
      "warningSpoilers": false,
      "date": "10 May 2009",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "The Zen-Like Little Tramp",
      "content": "Waddling along with his cane and derby hat, and that tiny mustache, the little tramp (Charles Chaplin) is visually unlike any character in film history. The tramp is kind-hearted, always dignified. He's a simple soul who in \"City Lights\" tries to help out a young blind woman (well played by Virginia Cherrill). This is a silent film, of course, but the tramp's body language is his speech.The really noticeable feature of the tramp character is how he blends into everyday life. He's more or less ignored by many, laughed at by others. The girl's grandmother never \"sees\" him at all. And only when the millionaire is drunk does he \"see\" the tramp as a friend. Curious ... and deep.The tramp gets into his fair share of trouble, but only through his bumbling efforts to help the girl. The boxing match is a hoot, and very well choreographed, as are all the skits. And what a beginning for a film, with city leaders spouting gibberish, probably as Chaplin's dig at the \"talkies\". Then the way Chaplin makes his grand entrance ... just terrific!Melancholy at times, the film's music really tugs at your heartstrings. Maybe it's sentimental and manipulative. But given the abiding and Zen-like qualities of the tramp, some sentimentality is quite appropriate. And the music is choreographed totally in sync with the plot action.Production design is sparse and at times drab. That the film was made during the Great Depression is beyond obvious.Comedy here is simple and effective. The main character expresses heart and humanity. The little tramp is an unforgettable character. And \"City Lights\" is a wonderful film."
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw2312568",
      "warningSpoilers": false,
      "date": "19 September 2010",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "\"Tomorrow the birds will sing\"",
      "content": "The victory of the sound picture over the silent was a speedy and decisive one. The first full-length talkies were released in 1928. By 1929 theatres were being forced to convert to sound in order to stay in business. By 1930 silent film production by the major studios was completely discontinued and the medium became generally viewed as an anachronism. But in 1931 a new silent picture was released that, far from being an embarrassing failure, became the fourth-highest grossing picture of the year, being even more popular than such classics as the Bela Lugosi Dracula and The Public Enemy. The picture was City Lights and its producer, writer, director, editor, composer and star was Mr Charlie Chaplin.Chaplin was of course primarily a comedian, and his humour was of broad appeal, but audiences of the time were not exactly starved of easy comedy. The Marx Brothers were making great strides on the verbal quipping front, and the ever-popular Laurel and Hardy had made a successful transition to sound. What makes Charlie stand out, and what gave him a level of accessibility that allowed him to continue with his slapstick antics well into the sound era, is his equal devotion to story which allowed him a scope for social commentary, empathetic characterisation and deep poignancy. Of all Chaplin's silent pictures, City Lights is probably his least memorable in the funny stakes. The number of classic gags here is fairly small. Not since The Kid a decade earlier has Chaplin given story so much precedence. City Lights is riddled with coincidence and plot contrivance, but it's a tale of such beauty and sincerity that this does not matter. Within this story, the comedy becomes functional, often serving to puncture a schmaltzy moment before it becomes overdone. Ironically it is the occasional forays into slapstick that help keep City Lights real.As if to snub the talkie, City Lights is a remarkable achievement in complex visual narrative, even only occasionally relying upon title cards and then often only as an embellishment to the more comedy-driven moments. Most plot points and character traits are implied rather than stated, which gives the picture a continual smoothness – another thing that would have gone down well with audiences glad to see the back of the intrusive title card. Out of necessity Chaplin's technical approach is more overt than his usual. He often cuts to a close-up to give us a necessary reaction, and there are even some whip-pans in the scene where he and the flower girl first meet, but all of this is in keeping with the rhythm and tone of the picture. Those whip pans after all reflect an abrupt emotional moment, and are in no way a blatant or showy manoeuvre.But what really makes City Lights work, what makes it connect, is the man himself on the screen. Those additional close-ups, once a rarity for a man who acted mainly with his body, now show off a capability for intense facial acting. An older, more meditative Chaplin may have been keeping the traditions of silent cinema alive, but his own career trajectory was entering new ground, where emotional expression was increasingly intimate and personal. The result is profoundly moving."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw2055054",
      "warningSpoilers": true,
      "date": "19 April 2009",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Charlo at the top of his game.",
      "content": "Charlie Chaplin made some extremely funny shorts but of his longer films, this is one of the best, along with \"The Gold Rush\" and \"Modern Times.\" Two stories are woven together. One is Charlie's on-again off-again friendship with a wealthy drunk. The guy has a case of multiple personality. When drunk he showers Charlie with friendship and gifts. When he's sober he doesn't recognize Charlie at all.The second story involves a pretty, blind flower girl who, given certain distances, angles, and lighting, resembles Uma Thurman. Charlie falls for her and accepts a thousand dollars from the drunken rich guy in order to pay for the operation that will refurbish her eyeballs.Charlie is accused of stealing the thousand bucks but when he appeals to the rich guy, he's sober and won't support Charlie's story. Charlie manages to get the money to the girl anyway but then is picked up by the police and spends some time in jail. When he emerges from the Crowbar Hotel, broke and bitter, he bumps into the now sighted girl and she recognizes him by his voice and the feel of his hands. The happy ending.There's sentimentality in the story of course. There often is in Chaplin's later films. But, as usual, it's somehow tempered. Here, it's undercut by irony.When Charlie meets the wealthy toff, the guy is about to kill himself because his wife left him. He ties a noose around his neck and a big rock to the other end of the rope. He's about to hurl himself and the rock into the river when Charlie intervenes, gives him a pep talk, and changes his mind. His spirit revived, the rich guy spread his arms to the sky, dropping the boulder that falls on Charlie's foot.And when Chaplin meets the blind flower girl, she's enthralled by his gentleness. Unseen by her, the smitten Charlie tip toes behind her to the nearby water fountain where she fills a pail. Her expression is dreamy and far away as the pail fills. Charlie is sitting on a bench next to the fountain, himself enraptured. Then she empties the pail by throwing the water in Charlie's face. Well, it's not the blind Mr. Muckle busting all the light bulbs in W. C. Fields' general store, but what is? A note. There have been some comic prize fights recorded on film, not counting the Dempsey-Tunney debacle, but I don't think any are as funny as the one Chaplin has choreographed here.It's hard to imagine the kind of talent that could pull off a story like this in a medium like this. Black and white, and silent. Applause, please."
    },
    {
      "username": "minister_of_silly_walks",
      "userUrl": "https://www.imdb.com/user/ur64212521",
      "reviewLink": "https://www.imdb.com/review/rw4622243",
      "warningSpoilers": false,
      "date": "2 February 2019",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The Tramp does it again!",
      "content": "Shot in a time when silent films were already vanishing from the big screens \"City Lights\" is a masterfully executed comedy by the one and only Charlie Chaplin. Even without dialog Chaplin manages to tell a story between two loners looking to companionship in a world that has almost forgot about them. Funny, emotional and timeless!"
    },
    {
      "username": "Rokol",
      "userUrl": "https://www.imdb.com/user/ur3335565",
      "reviewLink": "https://www.imdb.com/review/rw0998203",
      "warningSpoilers": false,
      "date": "13 January 2005",
      "rate": "9",
      "helpful": "48 out of 58 found this helpful.",
      "title": "Classic Chaplin",
      "content": "City Lights is simply put one of the best movies out there. Every scene is classic and had a huge impact on the history of film-making. Chaplin's last 'silent' film tells the story of a poor little man the tramp played by Chaplin who falls in love with a blind flower girl. He becomes friends with a wealthy man who constantly tries to commit suicide. The man only recognizes the tramp character when he is drunk. To impress the flower girl the tramp uses the man's wealth to make her fall in love with him. The only problem is that when the man is sober he doesn't recognize the tramp anymore. On top of this the flower girl has to pay 22 dollars of rent or she will be thrown out of her apartment. Now the tramp desperately seeks for jobs in the city to help his love. Out of this simple plot great comedy and heart breaking moments come forth.The outcome of the movie is to almost all people known. It is regarded as one of the best endings ever taped on film. The movie itself still is masterpiece more than 70 years after it's release. I personally rate this as Chaplin's second best I have seen so far. My favorite remains The Gold Rush. Still this movie gets 5/5 stars from me."
    },
    {
      "username": "Petey-10",
      "userUrl": "https://www.imdb.com/user/ur0222418",
      "reviewLink": "https://www.imdb.com/review/rw1677632",
      "warningSpoilers": false,
      "date": "20 June 2007",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Looking for love...and happiness",
      "content": "In the beginning you find our poor little tramp sleeping on a statue.Then he runs into a suicidal and drunken millionaire, whose life he saves.And what would our poor little tramp be without love? Even poorer and more miserable.The woman he falls for is a flower girl, and she's blind.And this blind flower girl thinks the tramp is a rich man.But he's only rich at heart.He wants to help the girl, he wants her to see.But if she does see, would she love him? Our poor little tramp? Nobody is better at combining tragedy and comedy better than Charles Chaplin was.This is a fact I have mentioned in previous Chaplin reviews and this is something all the movie lovers have probably noticed.City Lights (1931) is one great example of those movies where comedy meets tragedy.Take the scene with the Eccentric Millionaire for example.He is there ready to jump into the water when our little tramp wanders to the spot.Soon they're both in the water.Comedy meets tragedy, laughter meets tears.I could mention plenty of other examples but you can see it all by watching this movie.If you already have, watch it again.It's a true classic that will not age.And the acting performances...they're all superb.Besides Chaplin there is Virinia Cherrill as A Blind Girl.She is so beautiful...such a good actress.And then there's Florence Lee as her grandmother.Harry Myers is fantastic as the moody millionaire.And so is Al Ernest Garcia as his Butler.The Keystone Kop Hank Mann plays A Prizefighter.The big man Henry Bergman is known from other Chaplin films also.Here he plays the Mayor/Blind Girls downstairs neighbor.Jean Harlow can be seen as an Extra in restaurant scene.The original music made by Charlie himself is masterly.Chaplin didn't want to give up silent pictures.And why would he have? Things could very well be told without words.He did use some simple sound effects in this film and then Modern Times (1936).City Lights is filled with memorable scenes like when Charlie goes boxing.And when he goes dancing drunk is hilarious.And let's not forget the ending.The ending is beautiful."
    },
    {
      "username": "BYUmogul",
      "userUrl": "https://www.imdb.com/user/ur1000374",
      "reviewLink": "https://www.imdb.com/review/rw0007476",
      "warningSpoilers": false,
      "date": "6 February 2001",
      "rate": "",
      "helpful": "43 out of 50 found this helpful.",
      "title": "A classic film made with love and precision",
      "content": "Film has become a medium that is strongly influenced by nostalgia. Old films have become journeys to the past; ways to visit times and people that no longer are. Since film is an art that is based on the innovation of previous works, it has an element of nostalgia in its foundation. We look on the old to find what elements should make up the new. In City Lights, and other silent works of film, a passion emerges that is uniquely honest and sincere. While watching the film, I was impressed that Chaplin really did love the story, the sets, the crew; the whole project. While this may not have been the complete reality, it felt that way, and thus made the film more enjoyable. In silent films the audience is forced to be completely reliable on the visual elements of the film; there are no elaborate sound effects or dialogue to provoke an emotional response.Since film is at its very core a visual medium, I find silent films to be the basic form of the medium. I don't use the word basic here in a demeaning sense, but I compare the beauty of silent films to the beauty of early European art, before the concept of perspective was developed in the Renaissance. Many books and tomes featured people as tall as the castles they stood in; these works of art were not technologically advanced, but they were, and are, beautiful. The same example is found when comparing early darreographs of wild animals to contemporary photographs found in National Geographic. There is a warmth found in City Lights, and other Chaplin films (The Kid, Modern Times) that would be lost in the sea of cinematic technology that floods films today. Maybe it's just that with simplicity comes honesty, and honesty is perhaps the most powerful emotion that can cross through the screen and be felt by the viewer."
    },
    {
      "username": "harry-76",
      "userUrl": "https://www.imdb.com/user/ur0239428",
      "reviewLink": "https://www.imdb.com/review/rw0007475",
      "warningSpoilers": false,
      "date": "20 January 2001",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Sublime Chaplin Masterpiece",
      "content": "Chaplin was a unique presence in the history of the early cinema. Coming up through the ranks, he gradually achieved a god-like stature, being awarded total control of every facet of the production.Not only was he often the sole person who knew what the end product was to be (as in \"The Kid\") but he was also allowed to elaborately improvise in the creative process. This often meant doing countless scores of retakes over days, weeks and even months; holding up the cast and crew for days while he brooded over just what to do next; and even (in the case of \"The Gold Rush\") cancelling expensive weeks of location shooting and returning to the studio to start all over again.He cleverly duped chief studio- and bank chiefs into somehow going along with his free-wheeling and gross inclinations, thus mesmerizing their conservative senses into supporting his hit-and-miss schemes and trial-and-error \"madness.\"In other words, Chaplin used the entire productional company as merely as his paintbrush, with which he toyed at his pleasure to create his personal canvases. Fortunately, he was a genius, and at the right place in time to be allowed to get away with such unprecedented extravagence.It was a young and growing industry when Chaplin began emerging, and there were no set rules. People were still trying to figure out just what could be done with the medium -- and Chaplin helped to establish its early parameters.He was certainly and autocrat, yet that doesn't really matter when it comes to film works. It's the product that counts. In the case of \"City Lights,\" all the blood-sweat-and-tears that it took to achieve the finished product was more than worth the effort. Now that all the frustration, anger, and outrage associated with the behind-the-scenes unfoldment of this highly troubled production are well in the past, what remains is a genuinely moving film classic. Sometimes great enterprises require considerable hardship to forge them into being. The greater the achievement, often the greater the challenge and period of endurance. Whatever the case, we are the appreciative recipients of this masterwork, which takes its place besides \"Modern Times\" and \"The Gold Rush\" as one of Chaplin's consummate expressions."
    },
    {
      "username": "the-fearless-america",
      "userUrl": "https://www.imdb.com/user/ur56393956",
      "reviewLink": "https://www.imdb.com/review/rw3297304",
      "warningSpoilers": false,
      "date": "14 August 2015",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "The Most Touching Ending I've Seen In My Entire Life !",
      "content": "If i have to choose which movie have the best ending, it is very easy to choose city lights, it is very very easy. Chaplin was genius, seriously genius. This is the movie that truly inspire me. After i watch city lights, i just know there is such a movie power that exist in this world that can move and touch me really deep. I never feel such a sharp sensation ever from any hundred movies i watch before. and this movie, pierce me through the heart within silent. only gesture, eye- contact, and camera-works with no dialogue.sometimes i try to analyze deeply, why this movie have such a magnificent power. i think the reason is the connection between scenes. if we ask ourself what makes a good ending ? maybe the answer is how good you make the scene before the ending. how good you correlate the prologue and epilogue and also between them. how you fill the mid-duration of a movie. if the director took a right decision, a movie will not have any wasted scenes. its only genius film-maker can do and chaplin is one of them.silent movie such as city light is a hard-kind of movie to made. it needs next level of acting skill from the actors and actresses because there are no dialogue in it. and most of the duration, this movie is flawless in casting. and the ending scene were unbelievable and unpredictable. maximum genuine art-beauty of silent movie.i recommend everybody to watch this movie at least once. this movie is special. it definitely will pierce you."
    },
    {
      "username": "Captain_Couth",
      "userUrl": "https://www.imdb.com/user/ur0361658",
      "reviewLink": "https://www.imdb.com/review/rw1033570",
      "warningSpoilers": true,
      "date": "5 March 2005",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Top ten favorites. City Lights",
      "content": "City Lights (1931) is not only Charles Chaplin's great achievement but it also happens to be one of my top ten favorite films of all time. The emotion and effort that Chaplin put into this film cannot be recreated or matched by anyone. A classic tale about the Little Tramp giving up his livelihood for the benefit of others. Filmed during the height of the Great Depression the situation of life in America has never been caught like this before.The Tramp is hoboing around town doing whatever odd jobs he can find. One day during one of his outings he meets an attractive woman who has an eye sight problem. Smitten, the Tramp vows that she'll see once again. So, he does whatever he has to do to get this young woman to see. He befriends a wealthy drunkard after he saves his life. The problem is that he only recognizes him when he's sloshed out of his gourd. What really moves this film is the great lengths that the Tramp will put his body through for love. When the final scene is shown, you'll understand why many people (including myself) have called this one of the greatest films ever made. Pure magic.A true masterpiece."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2966362",
      "warningSpoilers": true,
      "date": "22 February 2014",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Iconic",
      "content": "The lovable tramp (Charles Chaplin) loves the blind flower girl (Virginia Cherrill). However through a series of misunderstandings, she thinks that he's actually a wealthy gentleman. He never dissuade her of the misconception. One night, he encounters a drunken wealthy gentleman (Harry Myers) who is about to commit suicide. The tramp rescues the drunk, and befriends him. However every time the rich drunk sobers up, he forgets about his tramp friend. When the blind girl needs $22 for rent, the tramp struggles to come up with the money. He even goes into a boxing match. Nothing works until he runs into the rich drunk once again. The drunk gives him $1000, but a misunderstanding makes the tramp a fugitive suspected of stealing the money. The tramp escapes and gives the blind guy all the money to pay the rent as well as fix her eyes. Later he is caught by the police and sent to jail. When he finally leaves the jail, he is in an even worst shape. The blind girl had her eyes fixed, and in a touching moment, she recognizes the tramp by feeling his hand.There are two great scenes in this movie. The first is the boxing match. It is a movie classic that needs to be seen by all movie lovers. It's funny to see the wires attach to Chaplin and the glove. And the slapstick humor is absolutely hilarious. It is still gut busting funny even today. The other is the final scene where the blind girl recognizes the tramp. It is the conclusion of an emotionally rich story of sacrifice."
    }
  ],
  "errorMessage": ""
}