{
  "imDbId": "tt0021749",
  "title": "City Lights",
  "fullTitle": "City Lights (1931)",
  "type": "Movie",
  "year": "1931",
  "language": "en",
  "titleInLanguage": "City Lights",
  "url": "https://en.wikipedia.org/wiki/City_Lights",
  "plotShort": {
    "plainText": "City Lights is a 1931 American silent romantic comedy-drama film written, produced, directed by, and starring Charlie Chaplin. The story follows the misadventures of Chaplin's Tramp as he falls in love with a blind girl (Virginia Cherrill) and develops a turbulent friendship with an alcoholic millionaire (Harry Myers).\r\nAlthough sound films were on the rise when Chaplin started developing the script in 1928, he decided to continue working with silent productions. Filming started in December 1928 and ended in September 1930. City Lights marked the first time Chaplin composed the film score to one of his productions and it was written in six weeks with Arthur Johnston. The main theme, used as a leitmotif for the blind flower girl, is the song \"La Violetera\" (\"Who'll Buy my Violets\") from Spanish composer José Padilla. Chaplin lost a lawsuit to Padilla for not crediting him.\r\nCity Lights was immediately successful upon release on January 30, 1931, with positive reviews and worldwide rentals of more than $4 million. Today, many critics consider it not only the highest accomplishment of Chaplin's career, but one of the greatest films of all time. Chaplin biographer Jeffrey Vance believes \"City Lights is not only Charles Chaplin's masterpiece; it is an act of defiance\" as it premiered four years into the era of sound films which began with the premiere of The Jazz Singer (1927). In 1991, the Library of Congress selected City Lights for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\". In 2007, the American Film Institute ranked it 11th on its list of the best American films ever made. In 1949, the critic James Agee called the film's final scene \"the greatest single piece of acting ever committed to celluloid\".",
    "html": "<p>City Lights is a 1931 American silent romantic comedy-drama film written, produced, directed by, and starring Charlie Chaplin. The story follows the misadventures of Chaplin's Tramp as he falls in love with a blind girl (Virginia Cherrill) and develops a turbulent friendship with an alcoholic millionaire (Harry Myers).</p><p>Although sound films were on the rise when Chaplin started developing the script in 1928, he decided to continue working with silent productions. Filming started in December 1928 and ended in September 1930. City Lights marked the first time Chaplin composed the film score to one of his productions and it was written in six weeks with Arthur Johnston. The main theme, used as a leitmotif for the blind flower girl, is the song \"La Violetera\" (\"Who'll Buy my Violets\") from Spanish composer José Padilla. Chaplin lost a lawsuit to Padilla for not crediting him.</p><p>City Lights was immediately successful upon release on January 30, 1931, with positive reviews and worldwide rentals of more than $4 million. Today, many critics consider it not only the highest accomplishment of Chaplin's career, but one of the greatest films of all time. Chaplin biographer Jeffrey Vance believes \"City Lights is not only Charles Chaplin's masterpiece; it is an act of defiance\" as it premiered four years into the era of sound films which began with the premiere of The Jazz Singer (1927). In 1991, the Library of Congress selected City Lights for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\". In 2007, the American Film Institute ranked it 11th on its list of the best American films ever made. In 1949, the critic James Agee called the film's final scene \"the greatest single piece of acting ever committed to celluloid\".</p>"
  },
  "plotFull": {
    "plainText": "City Lights is a 1931 American silent romantic comedy-drama film written, produced, directed by, and starring Charlie Chaplin. The story follows the misadventures of Chaplin's Tramp as he falls in love with a blind girl (Virginia Cherrill) and develops a turbulent friendship with an alcoholic millionaire (Harry Myers).\r\nAlthough sound films were on the rise when Chaplin started developing the script in 1928, he decided to continue working with silent productions. Filming started in December 1928 and ended in September 1930. City Lights marked the first time Chaplin composed the film score to one of his productions and it was written in six weeks with Arthur Johnston. The main theme, used as a leitmotif for the blind flower girl, is the song \"La Violetera\" (\"Who'll Buy my Violets\") from Spanish composer José Padilla. Chaplin lost a lawsuit to Padilla for not crediting him.\r\nCity Lights was immediately successful upon release on January 30, 1931, with positive reviews and worldwide rentals of more than $4 million. Today, many critics consider it not only the highest accomplishment of Chaplin's career, but one of the greatest films of all time. Chaplin biographer Jeffrey Vance believes \"City Lights is not only Charles Chaplin's masterpiece; it is an act of defiance\" as it premiered four years into the era of sound films which began with the premiere of The Jazz Singer (1927). In 1991, the Library of Congress selected City Lights for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\". In 2007, the American Film Institute ranked it 11th on its list of the best American films ever made. In 1949, the critic James Agee called the film's final scene \"the greatest single piece of acting ever committed to celluloid\".\r\nPlot\r\nCitizens and dignitaries are assembled for the unveiling of a new monument to \"Peace and Prosperity\". After droning speeches, the veil is lifted to reveal the Little Tramp asleep in the lap of one of the sculpted figures. After several minutes of slapstick, he manages to escape the assembly's wrath to perambulate the city. He rebukes two newsboys who taunt him for his shabbiness, and while coyly admiring a nude statue has a near-fatal encounter with a sidewalk elevator.\r\nThe Tramp encounters the beautiful flower girl on a street corner and in the course of buying a flower realizes she is blind; he is instantly smitten. The girl mistakes the Tramp for a wealthy man when the door of a chauffeured automobile slams shut as he departs.\r\nThat evening the Tramp saves a drunken millionaire from suicide. The millionaire takes the Tramp – his new best friend – back to his mansion for champagne, then (after another abortive suicide attempt) out for a night on the town. After helping the millionaire home the next morning, he sees the flower girl en route to her street-corner. He gets some money from the millionaire and catches up to the girl; he buys all her flowers and drives her home in the millionaire's car.\r\nAfter the Tramp leaves, the flower girl tells her grandmother (Florence Lee) about her kind and wealthy friend. Meanwhile, the Tramp returns to the mansion, where the millionaire – now sober – does not remember him and throws him out. Later that day, the millionaire is once again intoxicated and, seeing the Tramp on the street, invites him home for a lavish party. But the next morning history repeats itself: the millionaire is again sober and the Tramp is again out on his ear.\r\nFinding that the girl is not at her usual street-corner, the Tramp goes to her apartment, where he overhears a doctor tell the grandmother that the girl is very ill: \"She has a fever and needs careful attention.\" Determined to help, the Tramp takes a job as a street sweeper.\r\nOn his lunch break, he brings the girl groceries while her grandmother is out selling flowers. To entertain her he reads a newspaper aloud; in it is a story about a Viennese doctor's blindness cure. \"Wonderful, then I'll be able to see you\", says the girl – and the Tramp is struck by what may happen should she gain her sight and discover that he is not the wealthy man she imagines. He also finds an eviction notice the girl's grandmother has hidden. As he leaves, he promises the girl that he will pay the rent.\r\nThe Tramp returns to work to find himself fired – he has been late once too often. A boxer convinces him to fight in a fake bout; they will \"go easy\" on each other and split the prize money. But the boxer flees on learning he is about to be arrested and is replaced by a no-nonsense fighter who knocks the Tramp out despite the Tramp's creative and nimble efforts to keep out of reach.\r\nThe Tramp encounters the drunken millionaire a third time and is again invited to the mansion. The Tramp relates the girl's plight and the millionaire gives him money for her operation. Burglars knock the millionaire out and take the rest of his money. The police find the Tramp with the money given to him by the millionaire, who because of the knock on the head does not remember giving it. The Tramp evades the police long enough to get the money to the girl, telling her he will be going away for a time; in due course he is apprehended and imprisoned.\r\nMonths later the Tramp is released. He goes to the girl's customary street corner but she is not there. We learn that the girl – her sight restored – now runs a busy flower shop with her grandmother. But she has not forgotten her mysterious benefactor, whom she imagines to be rich and handsome: when an elegant young man enters the shop she wonders for a moment whether \"he\" has returned.\r\nThe Tramp happens by the shop, where the girl is arranging flowers in the window. He stoops to retrieve a flower discarded in the gutter. After a brief skirmish with his old nemeses, the newsboys, he turns to the shop's window through which he suddenly sees the girl, who has been watching him without (of course) knowing who he is. At the sight of her he is frozen for a few seconds, then breaks into a broad smile. The girl is flattered and giggles to her employee, \"I've made a conquest!\" Via pantomime through the glass she offers him a fresh flower (to replace the crushed one he took from the gutter) and a coin.\r\nSuddenly embarrassed, the Tramp begins to shuffle away, but the girl steps to the shop door and again offers the flower, which he shyly accepts. She takes his hand and presses the coin into it, then abruptly stops and her smile turns to a look of puzzlement as she recognizes the touch of his hand. She runs her fingers along his arm, his shoulder, his lapels, then gasps, \"You?\" The Tramp nods and asks, \"You can see now?\" The girl replies, \"Yes, I can see now\", and presses his hand to her heart with a tearful smile. Relieved and elated, the Tramp smiles back.\r\nCast\r\nVirginia Cherrill as a blind girl\r\nFlorence Lee as her grandmother\r\nHarry Myers as an eccentric millionaire\r\nAl Ernest Garcia as his butler (credited as Allan Garcia)\r\nHank Mann as a prizefighter\r\nCharlie Chaplin as A Tramp\r\nUncredited Cast\r\nRobert Parrish as newsboy\r\nHenry Bergman as Mayor and blind girl's downstairs neighbor\r\nEddie Baker as boxing match referee\r\nAlbert Austin as street sweeper/burglar\r\nJean Harlow as extra in nightclub scene (cut from film)\r\nProduction\r\nPre-production\r\nChaplin's feature The Circus, released in 1928, was his last film before the motion picture industry embraced sound recording and brought the silent movie era to a close. As his own producer and distributor (part owner of United Artists), Chaplin could still conceive City Lights as a silent film. Technically the film was a crossover, as its soundtrack had synchronized music and sound effects but no spoken dialogue. The dialogue was presented on intertitles. Chaplin was first contacted by inventor Eugene Augustin Lauste in 1918 about making a sound film, but he never ended up meeting with Lauste. Chaplin was dismissive about \"talkies\" and told a reporter that he would \"give the talkies three years, that's all.\" He was also concerned about how to adjust the Little Tramp to sound films.\r\nIn early 1928, Chaplin began writing the script with Harry Carr. The plot gradually grew from an initial concept Chaplin had considered after the success of The Circus, where a circus clown goes blind and has to conceal his handicap from his young daughter by pretending that his inability to see are pratfalls. This inspired the Blind Girl. The first scenes Chaplin thought up were of the ending, where the newly cured blind girl sees the Little Tramp for the first time. A highly detailed description of the scene was written, as Chaplin considered it to be the center of the entire film.\r\nFor a subplot, Chaplin first considered a character even lower on the social scale, a black newsboy. Eventually he opted for a drunken millionaire, a character previously used in the 1921 short The Idle Class. The millionaire plot was based on an old idea Chaplin had for a short in which two millionaires pick up the Little Tramp from the city dump and show him a good time in expensive clubs before dropping him back off at the dump, so when he woke up, the Tramp would not know if it was real or a dream. This was rewritten into a millionaire who is the Tramp's friend when drunk but does not recognize him when sober.\r\nChaplin officially began pre-production of the film in May 1928 and hired Australian art director Henry Clive to design the sets that summer. Chaplin eventually cast Clive in the role of the millionaire. Although the film was originally set in Paris, the art direction is inspired by a mix of several cities. Robert Sherwood said that \"it is a weird city, with confusing resemblances to London, Los Angeles, Naples, Paris, Tangiers and Council Bluffs. It is no city on earth and it is all cities.\"\r\nOn August 28, 1928, Chaplin's mother Hannah Chaplin died at the age of 63. Chaplin was distraught for several weeks and pre-production did not resume until mid fall of 1928. Psychologist Stephen Weissman has hypothesized that City Lights is highly autobiographical, with the blind girl representing Chaplin's mother, while the drunken millionaire represents Chaplin's father. Weissman also compared many of the film's sets with locations from Chaplin's real childhood, such as the statue in the opening scene resembling St. Mark's Church on Kennington Park Road and Chaplin referring to the waterfront set as the Thames Embankment.\r\nChaplin had interviewed several actresses to play the blind flower girl but was unimpressed with them all. While seeing a film shoot with bathing women in a Santa Monica beach, he found a casual acquaintance, Virginia Cherrill. Cherrill waved and asked if she would ever get the chance to work with him. After a series of poor auditions from other actresses, Chaplin eventually invited her to do a screen test. She was the first actress to subtly and convincingly act blind on camera due to her near-sightedness, and Cherrill signed a contract on November 1, 1928.\r\nPrincipal photography\r\nFilming for City Lights officially began on December 27, 1928, after Chaplin and Carr had worked on the script for almost an entire year. On the set, Chaplin was noted for doing many more \"takes\" than other directors at the time. Production began with the first scene at the flower stand where the Little Tramp first meets the Blind Flower Girl. The scene took weeks to shoot, and Chaplin first began to have second thoughts about casting Cherrill. Years later, Cherrill said, \"I never liked Charlie and he never liked me.\" In his autobiography, Chaplin took responsibility for his on-set tensions with Cherrill, blaming the stress of making the film for the conflict. \"I had worked myself into a neurotic state of wanting perfection\", he remembered. Filming the scene continued until February 1929 and again for ten days in early April before Chaplin put the scene aside to be filmed later. He then shot the opening scene of the Little Tramp waking up in a newly unveiled public statue. This scene involved up to 380 extras and was especially stressful for Chaplin to shoot. During this part of shooting, construction was being done at Chaplin Studios because the city of Los Angeles had decided to widen La Brea Avenue and Chaplin was forced to move several buildings away from the road.\r\nChaplin then shot the sequence where the Little Tramp first meets the millionaire and prevents him from committing suicide. During filming, Henry Clive suddenly decided that he did not want to jump into the tank of cold water in the scene, causing Chaplin to storm off the set and fire Clive. He was quickly replaced by Harry Myers, who Chaplin had known while under contract at Keystone Studios. Chaplin finished shooting the sequence on July 29, 1929, with exteriors at Pasadena Bridge. Chaplin then shot a sequence that was eventually cut from the film involving the Little Tramp attempting to retrieve a stick that was stuck in a grate. The scene included a young Charles Lederer; Chaplin later praised the scene, but insisted that it needed to be cut. He then continued filming the scenes with the millionaire until September 29, 1929.\r\nIn November, Chaplin began working with Cherrill again in some of the Flower Girl's less dramatic scenes. While waiting for her scenes for several months, Cherrill had become bored and openly complained to Chaplin. During the filming of one scene, Cherrill asked Chaplin if she could leave early so that she could go to a hair appointment. Chaplin fired Virginia Cherrill and replaced her with Georgia Hale, Chaplin's co-star in The Gold Rush. Although Chaplin liked her screen test, even he realized he had shot far too much already to reshoot all of the flower girl's scenes. Chaplin also briefly considered sixteen-year-old actress Violet Krauth, but he was talked out of this idea by his collaborators. Chaplin finally re-hired Cherrill to finish City Lights. She demanded and got a raise to $75 per week. Approximately seven minutes of test footage of Hale survives and is included on the DVD release; excerpts were first seen in the documentary Unknown Chaplin along with an unused opening sequence.\r\nChaplin then cast Florence Lee as the Blind Girl's grandmother and shot scenes with Cherrill and Lee for five weeks. In late 1929, Chaplin re-shot the first Flower Shop scene with Cherrill. This time, the scene was completed in six days and Chaplin was happy with Cherrill's performance. Chaplin had been shooting the film for a year and was only a little more than half way finished. From March to April 1930, Chaplin shot the scenes inside of the millionaire's house at the Town House on Wilshire Boulevard. He hired Joe Van Meter and Albert Austin, whom he had known since his days working for Fred Karno, as the burglars. In the late spring of 1930, Chaplin shot the last major comedy sequence: the boxing match. Chaplin hired Keystone actor Hank Mann to play the Tramp's opponent. The scene required 100 extras; Chaplin took four days to rehearse, and then six to shoot it, between June 23 and 30. Chaplin was initially nervous over the attendance for this scene so he invited his friends to be extras. Over 100 extras were present. Chaplin's performance in the scene was so humorous that more people arrived daily to be an extra.\r\nIn July and August, Chaplin finished up six weeks of smaller scenes, including the two scenes of the Tramp being harassed by newsboys, one of whom was played by a young Robert Parrish.\r\nIn September 1930, Chaplin finished the shooting of the iconic final scene which took six days. Chaplin said that he was happy with Cherrill's performance in the scene, and that she had eventually understood the role. When talking about his directing style on set, Chaplin stated that \"everything I do is a dance. I think in terms of dance. I think more so in City Lights.\"\r\nFrom October to December 1930, Chaplin edited the film and created the title cards. When he completed the film, silent films had become generally unpopular. But City Lights was one of the great financial and artistic successes of Chaplin's career, and it was his personal favorite of his films. Especially fond of the final scene, he said, \"n City Lights just the last scene ... I'm not acting ... Almost apologetic, standing outside myself and looking ... It's a beautiful scene, beautiful, and because it isn't over-acted.\"\r\nThe amount of film used for the project was uncharacteristic for the time and was a sign of the long production process. Chaplin shot 314,256 feet of film, and the completed film ran 8,093 feet. This made a shooting ratio of approximately 38.8 feet of film for each foot of film that made it in the final version.\r\nMusic\r\nCity Lights marked the first time Chaplin composed the film score to one of his productions. While Chaplin preferred his films to have live sound, by the 1930s most theaters had gotten rid of their orchestras. Many of his critics claimed he was doing it to grab more credit. Chaplin, whose parents and many members of the Chaplin family were musicians, was struggling with the professional musicians he hired and took it upon himself to compose the score. It was written in six weeks with Arthur Johnston and included over one hundred musical cues. Chaplin told a reporter that \"I really didn't write it down. I la-laed and Arthur Johnson wrote it down, and I wish you would give him credit because he did a very good job. It is all simple music, you know, in keeping with my character.\" The intention was to have a score that would translate the characters' emotions through its melodies. The score was recorded in five days with musical arranger Alfred Newman.\r\nThe main theme used as a leitmotif for the blind flower girl is the song \"La Violetera\" (\"Who'll Buy my Violets\") from Spanish composer José Padilla. Chaplin was unable to secure the original song performer, Raquel Meller, in the lead role, but used her song anyway as a major theme. Chaplin lost a lawsuit to Padilla (which took place in Paris, where Padilla lived) for not crediting him. Some modern editions released for video include a new recording by Carl Davis.\r\nRelease, reception, and legacy\r\nTwo weeks prior to the premiere, Chaplin decided to have an unpublicized preview at Los Angeles' Tower Theatre. It went poorly, attracting a small and unenthusiastic crowd. Better results were seen at the gala premiere on January 30, 1931, at the Los Angeles Theater. Albert Einstein and his wife were the guests of honor, and the film received a standing ovation. It next premiered at the George M. Cohan Theater in New York where Chaplin closely supervised the release, spending the day doing interviews, and previously spending $60,000 on the advertising, as he was frustrated with what UA's publicists had come up with. Chaplin demanded half of the total gross, and considering audiences would be more attracted by the film itself than its technology, he demanded higher ticket prices compared to talkies.\r\nChaplin was nervous about the film's reception because silent films were becoming obsolete by then, and the preview had undermined his confidence. Nevertheless, City Lights became one of Chaplin's most financially successful and critically acclaimed works. Following the good reception by American audiences, with estimated theatrical rentals of $2 million, a quarter of which came from its 12-week run at the Cohan, Chaplin went on a sixteen-day world tour between February and March 1931, starting with a premiere at London's Dominion Theatre on February 27. The film was enthusiastically received by Depression-era audiences, earning $4.25 million in worldwide rentals during its initial release.\r\nReviews were mostly positive. A film critic for the Los Angeles Examiner said that \"not since I reviewed the first Chaplin comedies way back in the two-reel days has Charlie given us such an orgy of laughs.\" The New York Times reviewer Mordaunt Hall considered it \"a film worked out with admirable artistry\". Variety declared it was \"not Chaplin's best picture\" but that certain sequences were \"hilarious\". The New Yorker wrote that it was \"on the order of his other, perhaps a little better than any of them\" and that it gave an impression \"not often—oh, very seldom—found in the movies; an indefinable impression perhaps best described as a quality of charm.\" On the other hand, Alexander Bakshy of The Nation was highly critical of City Lights, objecting to the silent format and over-sentimentality and describing it as \"Chaplin's feeblest\".\r\nThe popularity of City Lights endured, with the film's re-release in 1950 again positively received by audiences and critics. In 1949, the critic James Agee wrote in Life magazine, that the final scene was the \"greatest single piece of acting ever committed to celluloid.\" Richard Meryman called the final scene one of the greatest moments in film history. Charles Silver, Curator of Film at the Museum of Modern Art, stated that the film is so highly regarded because it brought forth a new level of lyrical romanticism that had not appeared in Chaplin's earlier works. He adds that like all romanticism, it is based in the denial of the real world around it. When the film premiered, Chaplin was much older, he was in the midst of another round of legal battles with former spouse Lita Grey, and the economic and political climate of the world had changed. Chaplin uses the Girl's blindness to remind the Tramp of the precarious nature of romanticism in the real world, as she unknowingly assaults him multiple times. Film.com critic Eric D. Snider said that by 1931, most Hollywood filmmakers either embraced sound films, resigned themselves to their inevitability, or just gave up making movies, yet Chaplin held firm with his vision in this project. He also noted that few in Hollywood had the clout to make a silent film at that late date, let alone do it well. One reason was that Chaplin knew the Tramp could not be adapted to talking movies and still work.\r\nSeveral well-known directors have praised City Lights. Orson Welles said it was his favorite film. In a 1963 interview in the American magazine Cinema, Stanley Kubrick rated City Lights as fifth among his top ten films. In 1972, the renowned Russian director Andrei Tarkovsky placed City Lights as fifth among his top ten and said of Chaplin, \"He is the only person to have gone down into cinematic history without any shadow of a doubt. The films he left behind can never grow old.\" The acclaimed French filmmaker Robert Bresson placed this film as first and second on his top ten films of all time. George Bernard Shaw called Chaplin \"the only genius to come out of the movie industry\". Celebrated Italian director Federico Fellini often praised this film, and his Nights of Cabiria refers to it. In the 2003 documentary Charlie: The Life and Art of Charles Chaplin, Woody Allen said it was Chaplin's best picture. Allen is said to have based the final scene of his 1979 film Manhattan on its final scene. Chaplin biographer Jeffrey Vance has summarized all the best criticism and all the notable filmmakers who have singled out City Lights as their favorite Chaplin film throughout the decades in the Criterion Collection audio commentary track for the film. Vance has written that among all the praise afforded the film can be added that \"City Lights also holds the distinction of being Chaplin's own favorite of all his films.\"\r\nFrench experimental musician and film critic Michel Chion has written an analysis of City Lights, published as Les Lumières de la ville. Slavoj Žižek used the film as a primary example in his essay \"Why Does a Letter Always Arrive at Its Destination?\". Film critic Roger Ebert of Chicago Sun-Times gave the film four stars out of four writing the film \"contains the slapstick, the pathos, the pantomime, the effortless physical coordination, the melodrama, the bawdiness, the grace, and, of course, the Little Tramp--the character said, at one time, to be the most famous image on earth.\" He added the film in his Great Movies list. Chaplin's original \"Tramp\" suit from the film was donated by him to the Museum of Natural History of Los Angeles County.\r\nCity Lights was released as a dual-format Blu-ray and DVD by the Criterion Collection in 2013, both of which include trailers of the film, archival footage from production, and an audio commentary track by Chaplin biographer and scholar Jeffrey Vance, among others. The new cover was illustrated by Canadian cartoonist Seth.\r\nAccolades\r\nIn 1952, Sight and Sound magazine revealed the results of its first poll for \"The Best Films of All Time\"; City Lights was voted #2, after Vittorio DeSica's Bicycle Thieves. In 2002, City Lights ranked 45th on the critics' list. That same year, directors were polled separately and ranked the film as 19th overall. In 1991, the Library of Congress selected City Lights for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\". In 2007, the American Film Institute's tenth anniversary edition of 100 Years... 100 Movies ranked City Lights as the 11th greatest American film of all time, an improvement over the 76th position on the original list. AFI also chose the film as the best romantic comedy of American cinema in 2008's \"10 Top 10\". The Tramp was number 38 on AFI's list of the 50 Best Heroes, and the film ranked at 38th among the funniest films, 10th among the greatest love stories, and 33rd on the most inspiring films.\r\nThe film is recognized by American Film Institute in these lists:\r\n1998: AFI's 100 Years...100 Movies – #76\r\n2000: AFI's 100 Years...100 Laughs – #38\r\n2002: AFI's 100 Years...100 Passions – #10\r\n2003: AFI's 100 Years...100 Heroes & Villains: The Tramp – #38 Hero\r\nThe Tramp – #38 Hero\r\n2006: AFI's 100 Years...100 Cheers – #33\r\n2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #11\r\n2008: AFI's 10 Top 10: #1 Romantic Comedy Film\r\n#1 Romantic Comedy Film\r\nThe Village Voice ranked the film at number 37 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. The film was included in Time's All-Time 100 best movies list in 2005. In 2006, Premiere issued its list of \"The 100 Greatest Performances of all Time\", putting Chaplin's performance as \"The Tramp\" at No. 44. City Lights was ranked seventeenth on Cahiers du cinéma's 100 Greatest Films, a 2008 poll of 78 film historians and critics organized by Claude-Jean Philippe. In the 2012 Sight & Sound polls, it was ranked the 50th-greatest film ever made in the critics' poll and 30th in the directors' poll. In the earlier 2002 version of the list the film ranked 45th among critics and 19th among directors. In 2015, City Lights ranked 18th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. The film was voted at No. 21 on the list of \"The 100 greatest comedies of all time\" by a poll of 253 film critics from 52 countries conducted by the BBC in 2017. In 2021 the film ranked 16th on Time Out magazine's list of The 100 best movies of all time.",
    "html": "<p>City Lights is a 1931 American silent romantic comedy-drama film written, produced, directed by, and starring Charlie Chaplin. The story follows the misadventures of Chaplin's Tramp as he falls in love with a blind girl (Virginia Cherrill) and develops a turbulent friendship with an alcoholic millionaire (Harry Myers).</p><p>Although sound films were on the rise when Chaplin started developing the script in 1928, he decided to continue working with silent productions. Filming started in December 1928 and ended in September 1930. City Lights marked the first time Chaplin composed the film score to one of his productions and it was written in six weeks with Arthur Johnston. The main theme, used as a leitmotif for the blind flower girl, is the song \"La Violetera\" (\"Who'll Buy my Violets\") from Spanish composer José Padilla. Chaplin lost a lawsuit to Padilla for not crediting him.</p><p>City Lights was immediately successful upon release on January 30, 1931, with positive reviews and worldwide rentals of more than $4 million. Today, many critics consider it not only the highest accomplishment of Chaplin's career, but one of the greatest films of all time. Chaplin biographer Jeffrey Vance believes \"City Lights is not only Charles Chaplin's masterpiece; it is an act of defiance\" as it premiered four years into the era of sound films which began with the premiere of The Jazz Singer (1927). In 1991, the Library of Congress selected City Lights for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\". In 2007, the American Film Institute ranked it 11th on its list of the best American films ever made. In 1949, the critic James Agee called the film's final scene \"the greatest single piece of acting ever committed to celluloid\".</p><br/><h3>Plot</h3><p>Citizens and dignitaries are assembled for the unveiling of a new monument to \"Peace and Prosperity\". After droning speeches, the veil is lifted to reveal the Little Tramp asleep in the lap of one of the sculpted figures. After several minutes of slapstick, he manages to escape the assembly's wrath to perambulate the city. He rebukes two newsboys who taunt him for his shabbiness, and while coyly admiring a nude statue has a near-fatal encounter with a sidewalk elevator.</p><p>The Tramp encounters the beautiful flower girl on a street corner and in the course of buying a flower realizes she is blind; he is instantly smitten. The girl mistakes the Tramp for a wealthy man when the door of a chauffeured automobile slams shut as he departs.</p><p>That evening the Tramp saves a drunken millionaire from suicide. The millionaire takes the Tramp – his new best friend – back to his mansion for champagne, then (after another abortive suicide attempt) out for a night on the town. After helping the millionaire home the next morning, he sees the flower girl en route to her street-corner. He gets some money from the millionaire and catches up to the girl; he buys all her flowers and drives her home in the millionaire's car.</p><p>After the Tramp leaves, the flower girl tells her grandmother (Florence Lee) about her kind and wealthy friend. Meanwhile, the Tramp returns to the mansion, where the millionaire – now sober – does not remember him and throws him out. Later that day, the millionaire is once again intoxicated and, seeing the Tramp on the street, invites him home for a lavish party. But the next morning history repeats itself: the millionaire is again sober and the Tramp is again out on his ear.</p><p>Finding that the girl is not at her usual street-corner, the Tramp goes to her apartment, where he overhears a doctor tell the grandmother that the girl is very ill: \"She has a fever and needs careful attention.\" Determined to help, the Tramp takes a job as a street sweeper.</p><p>On his lunch break, he brings the girl groceries while her grandmother is out selling flowers. To entertain her he reads a newspaper aloud; in it is a story about a Viennese doctor's blindness cure. \"Wonderful, then I'll be able to see you\", says the girl – and the Tramp is struck by what may happen should she gain her sight and discover that he is not the wealthy man she imagines. He also finds an eviction notice the girl's grandmother has hidden. As he leaves, he promises the girl that he will pay the rent.</p><p>The Tramp returns to work to find himself fired – he has been late once too often. A boxer convinces him to fight in a fake bout; they will \"go easy\" on each other and split the prize money. But the boxer flees on learning he is about to be arrested and is replaced by a no-nonsense fighter who knocks the Tramp out despite the Tramp's creative and nimble efforts to keep out of reach.</p><p>The Tramp encounters the drunken millionaire a third time and is again invited to the mansion. The Tramp relates the girl's plight and the millionaire gives him money for her operation. Burglars knock the millionaire out and take the rest of his money. The police find the Tramp with the money given to him by the millionaire, who because of the knock on the head does not remember giving it. The Tramp evades the police long enough to get the money to the girl, telling her he will be going away for a time; in due course he is apprehended and imprisoned.</p><p>Months later the Tramp is released. He goes to the girl's customary street corner but she is not there. We learn that the girl – her sight restored – now runs a busy flower shop with her grandmother. But she has not forgotten her mysterious benefactor, whom she imagines to be rich and handsome: when an elegant young man enters the shop she wonders for a moment whether \"he\" has returned.</p><p>The Tramp happens by the shop, where the girl is arranging flowers in the window. He stoops to retrieve a flower discarded in the gutter. After a brief skirmish with his old nemeses, the newsboys, he turns to the shop's window through which he suddenly sees the girl, who has been watching him without (of course) knowing who he is. At the sight of her he is frozen for a few seconds, then breaks into a broad smile. The girl is flattered and giggles to her employee, \"I've made a conquest!\" Via pantomime through the glass she offers him a fresh flower (to replace the crushed one he took from the gutter) and a coin.</p><p>Suddenly embarrassed, the Tramp begins to shuffle away, but the girl steps to the shop door and again offers the flower, which he shyly accepts. She takes his hand and presses the coin into it, then abruptly stops and her smile turns to a look of puzzlement as she recognizes the touch of his hand. She runs her fingers along his arm, his shoulder, his lapels, then gasps, \"You?\" The Tramp nods and asks, \"You can see now?\" The girl replies, \"Yes, I can see now\", and presses his hand to her heart with a tearful smile. Relieved and elated, the Tramp smiles back.</p><br/><h3>Cast</h3><ul><li>Virginia Cherrill as a blind girl</li><li>Florence Lee as her grandmother</li><li>Harry Myers as an eccentric millionaire</li><li>Al Ernest Garcia as his butler (credited as Allan Garcia)</li><li>Hank Mann as a prizefighter</li><li>Charlie Chaplin as A Tramp</li></ul><p>Uncredited Cast</p><ul><li>Robert Parrish as newsboy</li><li>Henry Bergman as Mayor and blind girl's downstairs neighbor</li><li>Eddie Baker as boxing match referee</li><li>Albert Austin as street sweeper/burglar</li><li>Jean Harlow as extra in nightclub scene (cut from film)</li></ul><br/><h3>Production</h3><h4>Pre-production</h4><p>Chaplin's feature The Circus, released in 1928, was his last film before the motion picture industry embraced sound recording and brought the silent movie era to a close. As his own producer and distributor (part owner of United Artists), Chaplin could still conceive City Lights as a silent film. Technically the film was a crossover, as its soundtrack had synchronized music and sound effects but no spoken dialogue. The dialogue was presented on intertitles. Chaplin was first contacted by inventor Eugene Augustin Lauste in 1918 about making a sound film, but he never ended up meeting with Lauste. Chaplin was dismissive about \"talkies\" and told a reporter that he would \"give the talkies three years, that's all.\" He was also concerned about how to adjust the Little Tramp to sound films.</p><p>In early 1928, Chaplin began writing the script with Harry Carr. The plot gradually grew from an initial concept Chaplin had considered after the success of The Circus, where a circus clown goes blind and has to conceal his handicap from his young daughter by pretending that his inability to see are pratfalls. This inspired the Blind Girl. The first scenes Chaplin thought up were of the ending, where the newly cured blind girl sees the Little Tramp for the first time. A highly detailed description of the scene was written, as Chaplin considered it to be the center of the entire film.</p><p>For a subplot, Chaplin first considered a character even lower on the social scale, a black newsboy. Eventually he opted for a drunken millionaire, a character previously used in the 1921 short The Idle Class. The millionaire plot was based on an old idea Chaplin had for a short in which two millionaires pick up the Little Tramp from the city dump and show him a good time in expensive clubs before dropping him back off at the dump, so when he woke up, the Tramp would not know if it was real or a dream. This was rewritten into a millionaire who is the Tramp's friend when drunk but does not recognize him when sober.</p><p>Chaplin officially began pre-production of the film in May 1928 and hired Australian art director Henry Clive to design the sets that summer. Chaplin eventually cast Clive in the role of the millionaire. Although the film was originally set in Paris, the art direction is inspired by a mix of several cities. Robert Sherwood said that \"it is a weird city, with confusing resemblances to London, Los Angeles, Naples, Paris, Tangiers and Council Bluffs. It is no city on earth and it is all cities.\"</p><p>On August 28, 1928, Chaplin's mother Hannah Chaplin died at the age of 63. Chaplin was distraught for several weeks and pre-production did not resume until mid fall of 1928. Psychologist Stephen Weissman has hypothesized that City Lights is highly autobiographical, with the blind girl representing Chaplin's mother, while the drunken millionaire represents Chaplin's father. Weissman also compared many of the film's sets with locations from Chaplin's real childhood, such as the statue in the opening scene resembling St. Mark's Church on Kennington Park Road and Chaplin referring to the waterfront set as the Thames Embankment.</p><p>Chaplin had interviewed several actresses to play the blind flower girl but was unimpressed with them all. While seeing a film shoot with bathing women in a Santa Monica beach, he found a casual acquaintance, Virginia Cherrill. Cherrill waved and asked if she would ever get the chance to work with him. After a series of poor auditions from other actresses, Chaplin eventually invited her to do a screen test. She was the first actress to subtly and convincingly act blind on camera due to her near-sightedness, and Cherrill signed a contract on November 1, 1928.</p><h4>Principal photography</h4><p>Filming for City Lights officially began on December 27, 1928, after Chaplin and Carr had worked on the script for almost an entire year. On the set, Chaplin was noted for doing many more \"takes\" than other directors at the time. Production began with the first scene at the flower stand where the Little Tramp first meets the Blind Flower Girl. The scene took weeks to shoot, and Chaplin first began to have second thoughts about casting Cherrill. Years later, Cherrill said, \"I never liked Charlie and he never liked me.\" In his autobiography, Chaplin took responsibility for his on-set tensions with Cherrill, blaming the stress of making the film for the conflict. \"I had worked myself into a neurotic state of wanting perfection\", he remembered. Filming the scene continued until February 1929 and again for ten days in early April before Chaplin put the scene aside to be filmed later. He then shot the opening scene of the Little Tramp waking up in a newly unveiled public statue. This scene involved up to 380 extras and was especially stressful for Chaplin to shoot. During this part of shooting, construction was being done at Chaplin Studios because the city of Los Angeles had decided to widen La Brea Avenue and Chaplin was forced to move several buildings away from the road.</p><p>Chaplin then shot the sequence where the Little Tramp first meets the millionaire and prevents him from committing suicide. During filming, Henry Clive suddenly decided that he did not want to jump into the tank of cold water in the scene, causing Chaplin to storm off the set and fire Clive. He was quickly replaced by Harry Myers, who Chaplin had known while under contract at Keystone Studios. Chaplin finished shooting the sequence on July 29, 1929, with exteriors at Pasadena Bridge. Chaplin then shot a sequence that was eventually cut from the film involving the Little Tramp attempting to retrieve a stick that was stuck in a grate. The scene included a young Charles Lederer; Chaplin later praised the scene, but insisted that it needed to be cut. He then continued filming the scenes with the millionaire until September 29, 1929.</p><p>In November, Chaplin began working with Cherrill again in some of the Flower Girl's less dramatic scenes. While waiting for her scenes for several months, Cherrill had become bored and openly complained to Chaplin. During the filming of one scene, Cherrill asked Chaplin if she could leave early so that she could go to a hair appointment. Chaplin fired Virginia Cherrill and replaced her with Georgia Hale, Chaplin's co-star in The Gold Rush. Although Chaplin liked her screen test, even he realized he had shot far too much already to reshoot all of the flower girl's scenes. Chaplin also briefly considered sixteen-year-old actress Violet Krauth, but he was talked out of this idea by his collaborators. Chaplin finally re-hired Cherrill to finish City Lights. She demanded and got a raise to $75 per week. Approximately seven minutes of test footage of Hale survives and is included on the DVD release; excerpts were first seen in the documentary Unknown Chaplin along with an unused opening sequence.</p><p>Chaplin then cast Florence Lee as the Blind Girl's grandmother and shot scenes with Cherrill and Lee for five weeks. In late 1929, Chaplin re-shot the first Flower Shop scene with Cherrill. This time, the scene was completed in six days and Chaplin was happy with Cherrill's performance. Chaplin had been shooting the film for a year and was only a little more than half way finished. From March to April 1930, Chaplin shot the scenes inside of the millionaire's house at the Town House on Wilshire Boulevard. He hired Joe Van Meter and Albert Austin, whom he had known since his days working for Fred Karno, as the burglars. In the late spring of 1930, Chaplin shot the last major comedy sequence: the boxing match. Chaplin hired Keystone actor Hank Mann to play the Tramp's opponent. The scene required 100 extras; Chaplin took four days to rehearse, and then six to shoot it, between June 23 and 30. Chaplin was initially nervous over the attendance for this scene so he invited his friends to be extras. Over 100 extras were present. Chaplin's performance in the scene was so humorous that more people arrived daily to be an extra.</p><p>In July and August, Chaplin finished up six weeks of smaller scenes, including the two scenes of the Tramp being harassed by newsboys, one of whom was played by a young Robert Parrish.</p><p>In September 1930, Chaplin finished the shooting of the iconic final scene which took six days. Chaplin said that he was happy with Cherrill's performance in the scene, and that she had eventually understood the role. When talking about his directing style on set, Chaplin stated that \"everything I do is a dance. I think in terms of dance. I think more so in City Lights.\"</p><p>From October to December 1930, Chaplin edited the film and created the title cards. When he completed the film, silent films had become generally unpopular. But City Lights was one of the great financial and artistic successes of Chaplin's career, and it was his personal favorite of his films. Especially fond of the final scene, he said, \"n City Lights just the last scene ... I'm not acting ... Almost apologetic, standing outside myself and looking ... It's a beautiful scene, beautiful, and because it isn't over-acted.\"</p><p>The amount of film used for the project was uncharacteristic for the time and was a sign of the long production process. Chaplin shot 314,256 feet of film, and the completed film ran 8,093 feet. This made a shooting ratio of approximately 38.8 feet of film for each foot of film that made it in the final version.</p><h4>Music</h4><p>City Lights marked the first time Chaplin composed the film score to one of his productions. While Chaplin preferred his films to have live sound, by the 1930s most theaters had gotten rid of their orchestras. Many of his critics claimed he was doing it to grab more credit. Chaplin, whose parents and many members of the Chaplin family were musicians, was struggling with the professional musicians he hired and took it upon himself to compose the score. It was written in six weeks with Arthur Johnston and included over one hundred musical cues. Chaplin told a reporter that \"I really didn't write it down. I la-laed and Arthur Johnson wrote it down, and I wish you would give him credit because he did a very good job. It is all simple music, you know, in keeping with my character.\" The intention was to have a score that would translate the characters' emotions through its melodies. The score was recorded in five days with musical arranger Alfred Newman.</p><p>The main theme used as a leitmotif for the blind flower girl is the song \"La Violetera\" (\"Who'll Buy my Violets\") from Spanish composer José Padilla. Chaplin was unable to secure the original song performer, Raquel Meller, in the lead role, but used her song anyway as a major theme. Chaplin lost a lawsuit to Padilla (which took place in Paris, where Padilla lived) for not crediting him. Some modern editions released for video include a new recording by Carl Davis.</p><br/><h3>Release, reception, and legacy</h3><p>Two weeks prior to the premiere, Chaplin decided to have an unpublicized preview at Los Angeles' Tower Theatre. It went poorly, attracting a small and unenthusiastic crowd. Better results were seen at the gala premiere on January 30, 1931, at the Los Angeles Theater. Albert Einstein and his wife were the guests of honor, and the film received a standing ovation. It next premiered at the George M. Cohan Theater in New York where Chaplin closely supervised the release, spending the day doing interviews, and previously spending $60,000 on the advertising, as he was frustrated with what UA's publicists had come up with. Chaplin demanded half of the total gross, and considering audiences would be more attracted by the film itself than its technology, he demanded higher ticket prices compared to talkies.</p><p>Chaplin was nervous about the film's reception because silent films were becoming obsolete by then, and the preview had undermined his confidence. Nevertheless, City Lights became one of Chaplin's most financially successful and critically acclaimed works. Following the good reception by American audiences, with estimated theatrical rentals of $2 million, a quarter of which came from its 12-week run at the Cohan, Chaplin went on a sixteen-day world tour between February and March 1931, starting with a premiere at London's Dominion Theatre on February 27. The film was enthusiastically received by Depression-era audiences, earning $4.25 million in worldwide rentals during its initial release.</p><p>Reviews were mostly positive. A film critic for the Los Angeles Examiner said that \"not since I reviewed the first Chaplin comedies way back in the two-reel days has Charlie given us such an orgy of laughs.\" The New York Times reviewer Mordaunt Hall considered it \"a film worked out with admirable artistry\". Variety declared it was \"not Chaplin's best picture\" but that certain sequences were \"hilarious\". The New Yorker wrote that it was \"on the order of his other, perhaps a little better than any of them\" and that it gave an impression \"not often—oh, very seldom—found in the movies; an indefinable impression perhaps best described as a quality of charm.\" On the other hand, Alexander Bakshy of The Nation was highly critical of City Lights, objecting to the silent format and over-sentimentality and describing it as \"Chaplin's feeblest\".</p><p>The popularity of City Lights endured, with the film's re-release in 1950 again positively received by audiences and critics. In 1949, the critic James Agee wrote in Life magazine, that the final scene was the \"greatest single piece of acting ever committed to celluloid.\" Richard Meryman called the final scene one of the greatest moments in film history. Charles Silver, Curator of Film at the Museum of Modern Art, stated that the film is so highly regarded because it brought forth a new level of lyrical romanticism that had not appeared in Chaplin's earlier works. He adds that like all romanticism, it is based in the denial of the real world around it. When the film premiered, Chaplin was much older, he was in the midst of another round of legal battles with former spouse Lita Grey, and the economic and political climate of the world had changed. Chaplin uses the Girl's blindness to remind the Tramp of the precarious nature of romanticism in the real world, as she unknowingly assaults him multiple times. Film.com critic Eric D. Snider said that by 1931, most Hollywood filmmakers either embraced sound films, resigned themselves to their inevitability, or just gave up making movies, yet Chaplin held firm with his vision in this project. He also noted that few in Hollywood had the clout to make a silent film at that late date, let alone do it well. One reason was that Chaplin knew the Tramp could not be adapted to talking movies and still work.</p><p>Several well-known directors have praised City Lights. Orson Welles said it was his favorite film. In a 1963 interview in the American magazine Cinema, Stanley Kubrick rated City Lights as fifth among his top ten films. In 1972, the renowned Russian director Andrei Tarkovsky placed City Lights as fifth among his top ten and said of Chaplin, \"He is the only person to have gone down into cinematic history without any shadow of a doubt. The films he left behind can never grow old.\" The acclaimed French filmmaker Robert Bresson placed this film as first and second on his top ten films of all time. George Bernard Shaw called Chaplin \"the only genius to come out of the movie industry\". Celebrated Italian director Federico Fellini often praised this film, and his Nights of Cabiria refers to it. In the 2003 documentary Charlie: The Life and Art of Charles Chaplin, Woody Allen said it was Chaplin's best picture. Allen is said to have based the final scene of his 1979 film Manhattan on its final scene. Chaplin biographer Jeffrey Vance has summarized all the best criticism and all the notable filmmakers who have singled out City Lights as their favorite Chaplin film throughout the decades in the Criterion Collection audio commentary track for the film. Vance has written that among all the praise afforded the film can be added that \"City Lights also holds the distinction of being Chaplin's own favorite of all his films.\"</p><p>French experimental musician and film critic Michel Chion has written an analysis of City Lights, published as Les Lumières de la ville. Slavoj Žižek used the film as a primary example in his essay \"Why Does a Letter Always Arrive at Its Destination?\". Film critic Roger Ebert of Chicago Sun-Times gave the film four stars out of four writing the film \"contains the slapstick, the pathos, the pantomime, the effortless physical coordination, the melodrama, the bawdiness, the grace, and, of course, the Little Tramp--the character said, at one time, to be the most famous image on earth.\" He added the film in his Great Movies list. Chaplin's original \"Tramp\" suit from the film was donated by him to the Museum of Natural History of Los Angeles County.</p><p>City Lights was released as a dual-format Blu-ray and DVD by the Criterion Collection in 2013, both of which include trailers of the film, archival footage from production, and an audio commentary track by Chaplin biographer and scholar Jeffrey Vance, among others. The new cover was illustrated by Canadian cartoonist Seth.</p><h4>Accolades</h4><p>In 1952, Sight and Sound magazine revealed the results of its first poll for \"The Best Films of All Time\"; City Lights was voted #2, after Vittorio DeSica's Bicycle Thieves. In 2002, City Lights ranked 45th on the critics' list. That same year, directors were polled separately and ranked the film as 19th overall. In 1991, the Library of Congress selected City Lights for preservation in the United States National Film Registry as being \"culturally, historically, or aesthetically significant\". In 2007, the American Film Institute's tenth anniversary edition of 100 Years... 100 Movies ranked City Lights as the 11th greatest American film of all time, an improvement over the 76th position on the original list. AFI also chose the film as the best romantic comedy of American cinema in 2008's \"10 Top 10\". The Tramp was number 38 on AFI's list of the 50 Best Heroes, and the film ranked at 38th among the funniest films, 10th among the greatest love stories, and 33rd on the most inspiring films.</p><p>The film is recognized by American Film Institute in these lists:</p><ul><li>1998: AFI's 100 Years...100 Movies – #76</li><li>2000: AFI's 100 Years...100 Laughs – #38</li><li>2002: AFI's 100 Years...100 Passions – #10</li><li>2003: AFI's 100 Years...100 Heroes & Villains: The Tramp – #38 Hero</li><li>The Tramp – #38 Hero</li><li>2006: AFI's 100 Years...100 Cheers – #33</li><li>2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #11</li><li>2008: AFI's 10 Top 10: #1 Romantic Comedy Film</li><li>#1 Romantic Comedy Film</li></ul><p>The Village Voice ranked the film at number 37 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. The film was included in Time's All-Time 100 best movies list in 2005. In 2006, Premiere issued its list of \"The 100 Greatest Performances of all Time\", putting Chaplin's performance as \"The Tramp\" at No. 44. City Lights was ranked seventeenth on Cahiers du cinéma's 100 Greatest Films, a 2008 poll of 78 film historians and critics organized by Claude-Jean Philippe. In the 2012 Sight & Sound polls, it was ranked the 50th-greatest film ever made in the critics' poll and 30th in the directors' poll. In the earlier 2002 version of the list the film ranked 45th among critics and 19th among directors. In 2015, City Lights ranked 18th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. The film was voted at No. 21 on the list of \"The 100 greatest comedies of all time\" by a poll of 253 film critics from 52 countries conducted by the BBC in 2017. In 2021 the film ranked 16th on Time Out magazine's list of The 100 best movies of all time.</p><br/>"
  },
  "errorMessage": ""
}