{
  "imDbId": "tt1205489",
  "title": "Gran Torino",
  "fullTitle": "Gran Torino (2008)",
  "type": "Movie",
  "year": "2008",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "https://ew.com/article/2009/01/12/gran-torino-3/",
      "rate": "91",
      "content": "A movie at once understated and radical, deceptively unremarkable in presentation and ballsy in its earnestness. Don't let the star's overly familiar squint fool you: This is subtle, perceptive stuff."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "Above all, it feels like a summation of everything he (Eastwood) represents as a filmmaker and a movie star, and perhaps also a farewell."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment/la-et-torino12-2008dec12-story.html",
      "rate": "90",
      "content": "Perhaps the best thing about Schenk's script is that it enticed Eastwood to end his self-imposed acting hiatus and bring his one-of-a-kind aura back to the screen."
    },
    {
      "publisher": "The New York Times",
      "author": "Manohla Dargis",
      "link": "https://www.nytimes.com/2008/12/12/movies/12tori.html?ref=movies",
      "rate": "90",
      "content": "Mr. Eastwood is also an adept director of his own performances and, perhaps more important, a canny manipulator of his own iconographic presence."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "88",
      "content": "A lifetime in movies runs through this prime vintage Eastwood performance. You can't take your eyes off him. The no-frills, no-bull Gran Torino made my day."
    },
    {
      "publisher": "Wall Street Journal",
      "author": "Joe Morgenstern",
      "link": "",
      "rate": "80",
      "content": "It's a meditation, as affecting as it is entertaining, on the limits of violence and the power of unchained empathy."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/gran-torino",
      "rate": "75",
      "content": "An amazingly over-the-top anti-racism parable but, despite its obvious shortcomings, it is nevertheless effective and affecting."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "https://www.avclub.com/",
      "rate": "75",
      "content": "Eastwood directs with his usual relaxed pace and bursts of intensity, a style that's pleasing to watch--and which, also as usual, never fully compensates for any shortcomings of the script handed to him."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "70",
      "content": "Highlighted by the star's vastly entertaining performance, this funny, broad but ultimately serious-minded drama about an old-timer driven to put things right in his deteriorating neighborhood looks to be a big audience-pleaser."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "60",
      "content": "Eastwood has always had the gift for comedy in his acting repertoire, but he indulges in it only rarely. His fans might embrace this return to comedy."
    }
  ],
  "errorMessage": ""
}