{
  "imDbId": "tt1205489",
  "title": "Gran Torino",
  "fullTitle": "Gran Torino (2008)",
  "type": "Movie",
  "year": "2008",
  "items": [
    {
      "username": "ametaphysicalshark",
      "userUrl": "https://www.imdb.com/user/ur11842025",
      "reviewLink": "https://www.imdb.com/review/rw1990728",
      "warningSpoilers": false,
      "date": "15 December 2008",
      "rate": "",
      "helpful": "740 out of 878 found this helpful.",
      "title": "Yet another Eastwood gem",
      "content": "I feel like I should let everyone reading this know of my inherent bias in favor of this film. I have seen twenty eight films from Clint Eastwood as director and have liked the vast majority of them, and loved a good number of them (my average rating for the 28 films is 7.9). Still, something felt off about \"Gran Torino\" based on the trailer. I read it as Eastwood trying to be 'badass' again, trying to be Dirty Harry again. \"Gran Torino\" is not that. Walt Kowalski may have similarities with Dirty Harry, and could possibly be read as a significantly older version of Harry (it's a stretch), but he is a distinctive, memorable character on his own, and I'd go as far as saying that it's one of Eastwood's finest performances, and one which gives him a chance to show off his dramatic and comedic chops.I'm not going to argue that \"Gran Torino\" has perfect acting from the younger supporting cast. It doesn't. In fact, some of them are downright bad at times, but the film works in spite of its flaws. This screenplay was probably written with Eastwood in mind (I am not sure of the behind-the-scenes details on this) and it shows. He captures Kowalski perfectly. The film is surprisingly humorous, something that isn't being captured well enough in advertising. It's absolutely hilarious at times (watch as Kowalski attempts to make a man out of Thao by teaching him how to talk like men do), and Eastwood handles the shifts in tone brilliantly. When the film takes a dark turn towards the end I sat on the edge of my seat in suspense, fully aware of where it was heading but still mesmerized by Eastwood's tour-de-force direction. This is an artist at his prime as an actor and as a director.Whether or not \"Gran Torino\" will hold up as one of Eastwood's great films remains to be seen, and the film feels like it would be good for multiple viewings. The characterization is strong and not simplistic at all, you could argue that Kowalski is just another grouchy war vet, but Eastwood's beautiful, nuanced performance as well as some neat little touches in the screenplay (particularly towards the end) which I won't discuss in detail to avoid spoiling anything (and it's really fun to watch this movie unfold, Eastwood keeps the film moving at a wonderfully involving pace) would prove you wrong. The film works on yet another level as a deconstruction of Eastwood's image. I don't mean that as a negative, it just adds to the film's strength as a character study.It's a more intimate film than Eastwood's other film this year, \"Changeling\", and also on a smaller scale than many of his other films, but it's just as ambitious in many ways. This is not a politically correct film about a grouchy old racist suddenly turning into the most tolerant person around, it is a film about a man who, near the end of his life, is forced to confront his demons, and on the sunnier side about a man who finds true friendship where he least expected it. By the end of \"Gran Torino\" I had forgiven any flaws it might have, and was completely satisfied with the film, which far exceeded my expectations. I have a feeling that \"Gran Torino\", which has already been met with strongly positive reviews (but is still being described as a 'minor' Eastwood film by some), will eventually become an especially important part of Eastwood's filmography."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw2041497",
      "warningSpoilers": true,
      "date": "22 March 2009",
      "rate": "9",
      "helpful": "66 out of 89 found this helpful.",
      "title": "Clint's best performance since Million Dollar Baby",
      "content": "I saw Gran Torino opening weekend and after hearing rave reviews, I was looking forward to it. After seeing it, I realized what people were excited about, it was Clint's performance, this is a man you do not want to mess with. He's the perfect good guy with a bad guy's lust for vengeance. I love his growls, he sounds like a great guard dog, I would love to just have him by my door if a salesman comes by to make that noise. I can't believe what a triple threat Clint is: he's a writer, director, and an actor, not to mention that he's great at all three of them. He presents Gran Torino with grace and style of an old man that society has forgotten about because of his bad mood not realizing that deep down, he's truly a good man.Walt Kowalski, a retired Polish American Ford automobile assembly line worker and a Korean War veteran, lives with his dog Daisy in a changing neighborhood which is dominated by immigrants. At the start of the movie, Walt is attending his wife's funeral, bristling at the shallow eulogy of young Father Janovich. Similarly, he has little patience with his two sons, Mitch and Steve, and their families, who show little regard for Walt's grief or the memory of their dead mother. Walt's sons see him as \"always disappointed\" with them and their families, unaware of their obnoxiousness. Walt's teenage Hmong neighbors, a shy Thao Vang Lor and his feisty sister Sue, live with their widowed mother and grandmother. The Hmong gang, at that point, tries to persuade Thao to join them. Thao's initiation is to steal Walt's prized car, a 1972 Gran Torino Sport. Walt interrupts the robbery, pointing a rifle in Thao's face and forcing him to flee. After a few days, Spider and his gang return. With Sue at his side, Thao manages to verbally confront them to no avail. The gang drags Thao off his porch in an attempt to assault him. His family tries desperately to fend off Spider and his cohorts. The conflict ends when Walt, who fought in the United States Army's 1st Cavalry Division, threatens the gang members with his M1 Garand rifle and orders them to get off his lawn. They leave the neighborhood, telling Walt to watch his back.After seeing Sue being harassed by three black teenagers, while her \"date\" cannot help her, Walt steps in to rescue her, confronting the teenagers and threatening them with a pistol. Sue gets to know Walt, and invites him to a family barbecue on his birthday, bringing him closer to her family, explaining Hmong culture and that during the Vietnam War they fought on \"his\" side. Sue, Thao, and their mother visit Walt the next day, with Thao's family forcing him to work for Walt for a week to atone for his attempted theft of the Gran Torino. Walt has Thao clean up the neighborhood until his debt is paid and shows Thao the ways of American men. Meanwhile, the Hmong gang keeps pressuring Thao to join them. But when he refuses, the Hmong gang goes too far in getting their revenge leading to Walt wanting more than punishment, he wants justice.I highly recommend Gran Torino if you get the chance to see it, it has terrific performances and a touching story. I'm really surprised that Clint didn't get more recognition for his strength in Walt, he became that character and I loved how he protected the family that he once hated. It was wonderful to see all these characters develop and grow together, they had great chemistry and made this movie into a great one. I think down the line, Gran Torino is going to be considered a classic, this is a terrific movie and deserves it's praise.9/10"
    },
    {
      "username": "Kevin-42",
      "userUrl": "https://www.imdb.com/user/ur0076091",
      "reviewLink": "https://www.imdb.com/review/rw1989879",
      "warningSpoilers": false,
      "date": "14 December 2008",
      "rate": "",
      "helpful": "306 out of 390 found this helpful.",
      "title": "Eastwood excels at storytelling",
      "content": "Gran Torino - They don't make them like they used to....Mr. Eastwood has a knack for storytelling. Instead of being preachy or having an all to obvious agenda, he lets his viewers make up their own minds. His characters don't have a message, they have a life and make no excuses for who they are. In so many subtle and intelligent ways we are allowed to make our own choices. Like with Kowalski in the movie, you are not confronted with a role model hammering home all those \"life's important messages\", but rather with a movie saying \"Look! This is the way it worked out for me. And I think I know a few tricks that might help you, but in the end it's your own life. However, you have to trust me when I say that there are a some things you don't want to see or experience!\". Some people will leave this movie entirely untouched, others will certainly be crying their guts out. Not because some people \"get it\" and others \"don't\", but because it is a brilliant piece of entertainment reaching out to every viewer in its own specific way.Eastwood's acting is top notch again, although the years have not been very kind to his voice. The rest of the cast are fine, but one can certainly spot their more amateurish backgrounds here and there which is the main reason why I could not give this one a 10/10.Apart from that there is little to criticize. It's not an action movie, not a drama movie and certainly not a comedy (even though you get a few laughs out of this one). It's simply a good story about life.....and death."
    },
    {
      "username": "dk777",
      "userUrl": "https://www.imdb.com/user/ur80922659",
      "reviewLink": "https://www.imdb.com/review/rw6510512",
      "warningSpoilers": false,
      "date": "21 January 2021",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "Gran Torino",
      "content": "Clint Eastwood is simply great both in front of and behind the camera.Eastwood is as great as Walt Kowalski, a man who, behind his rough exterior, deeply feels the world around him. Through humor and deep emotions, this film shows us that people are complicated and life is unpredictable.Such films are rare, and nowadays they are almost non-existent. The development of the main character and the depiction of his emotions and internal conflict are interesting, which is exactly the basis of the film.There is also a bit of humor in the film, located exactly where it should be and thus creates that necessary balance against the cruel reality.The script is brilliant, and Clint Eastwood turned it into a great film, managing to evoke tension and feelings, as well as the inner struggle of the characters.The film is superbly directed and easily guides the viewer through the story. The cinematography is excellent, as is the photography. The soundtrack fits perfectly into the atmosphere of the film.This is an old-fashioned drama with interesting characters that are not one-dimensional but complicated and layered. Unfortunately, the actor who plays the character of Thao is simply not a good actor, but the rest of the cast played their parts excellently.I was particularly impressed by Ahney Her in the role of Sue, and Clint Eastwood is equally excellent in the role of Walt Kowalski. Also, Christopher Carley excellently portrayed the character of Father Janovich, a young and somewhat naive priest, whose character is also interesting and develops throughout the film.A great, powerful and inspiring film."
    },
    {
      "username": "woljm45",
      "userUrl": "https://www.imdb.com/user/ur9556826",
      "reviewLink": "https://www.imdb.com/review/rw1990983",
      "warningSpoilers": false,
      "date": "16 December 2008",
      "rate": "10",
      "helpful": "455 out of 559 found this helpful.",
      "title": "Clint Eastwood shows you why he still should be in FRONT of the camera",
      "content": "With his performance Eastwood shows you why people like himself, Jack Nicholson, or Paul Newman only come around once in a lifetime. Though Eastwood would rather focus on directing, he can still carry a movie with his on screen presence, and he's pure dynamite in \"Gran Torino\". Perhaps the poor box office results of \"hollywoody\" movies like Absolute Power, True Crime, Space Cowboys, and Blood Work, caused Eastwood to shy away from acting, but given cutting edge material to work with as \"Million Dollar Baby\" and \"Gran Torino\", he's as good as ever. His character as the racist and salty war vet makes you think of that old guy we've all had on our blocks with the garbage door open, the million tools hanging everywhere, and always fixing or building something. I found myself not wanting the movie to end because the scenes between himself and the various Hmong characters where priceless. There may be complaints over the racist remarks and scenes, but Eastwood pulls it off in a way a real person like that would talk or act to a point where it ends up being lighthearted. I'm not going to give the plot away, but if you like your Clint Eastwood as a hard-nosed tough guy with foul language alla Dirty Harry or Heartbreak Ridge, you'll love this movie!!"
    },
    {
      "username": "Len9876",
      "userUrl": "https://www.imdb.com/user/ur10724921",
      "reviewLink": "https://www.imdb.com/review/rw1989533",
      "warningSpoilers": false,
      "date": "13 December 2008",
      "rate": "10",
      "helpful": "514 out of 699 found this helpful.",
      "title": "Another top-notch, Clint Eastwood film that entertains and teaches.",
      "content": "Manohla Dargis writes in the New York Times: \"Dirty Harry is back, in a way, in \"Gran Torino,\" not as a character but as a ghostly presence. He hovers in the film, in its themes and high-caliber imagery, and of course most obviously in Mr. Eastwood's face. It is a monumental face now, so puckered and pleated that it no longer looks merely weathered, as it has for decades, but seems closer to petrified wood. Words like flinty and steely come to mind, adjectives that Mr. Eastwood ... expressively embodies with his usual lack of fuss and a number of growls.\" More praise for Eastwood comes from Joe Morgenstern in the Wall Street Journal, who comments: \"No one makes movies like Gran Torino any more, and more's the pity. This one, with Clint Eastwood as director and star, is concerned with honor and atonement, with rough justice and the family of man. It raises irascibility to the level of folk art, takes unapologetic time-outs for unfashionable moral debates, revives acting conventions that haven't been in fashion for half a century and keeps you watching every frame as Mr. Eastwood snarls, glowers, mutters, growls and grins his way through the performance of a lifetime.\" Elizabeth Weitzman in the New York Daily News remarks that \"it's clearly a career-capping work.\" Kenneth Turan in The Los Angeles Times writes that the movie \"is impossible to imagine without the actor in the title role. The notion of a 78-year-old action hero may sound like a contradiction in terms, but Eastwood brings it off, even if his toughness is as much verbal as physical. Even at 78, Eastwood can make 'Get off my lawn' sound as menacing as 'Make my day,' and when he says 'I blow a hole in your face and sleep like a baby,' he sounds as if he means it.\"There are at least four reason why I like this film: 1. Clint Eastwood shows that the character he is playing is willing to serve in a war-- and die if necessary--to preserve freedom (and he has a medal to prove it), 2. he has grown old and the whole world has changed (and everyone around him seems to indicate--in one way or another--that he is no appreciated or needed), 3. even with a transformation, he demonstrates that people tend to be reactive--rather than responsive--and are slow to change (this is particularly true with bias, discrimination, and prejudice), and 4. that tolerance can lead to understanding (he tries to give tough love, but he becomes softer in his response--instead of his reaction--after giving and receiving genuine love). It seems that everyone around him wants his Gran Torino and everything else he owns, before he even has died, instead of being interested in him. He lives in a community that is transformation, and he knows absolutely nothing about culture, diversity, ethnicity, race, or sexual orientation. He does know about aging, however (if nowhere else, he learns about it from people's adverse and negative reactions, everywhere around him). He isn't exactly treated with dignity and respect, so why should he treat anyone else with dignity and respect? And, trust must be earned.If this is Clint Eastwood's last film, I can only say that that his performance, in this stunning film, is what legends are made of. There are some wonderful performances in \"Milk\" (Sean Penn), \"Australia\" (Hugh Jackman and Nicole Kidman), \"Changeling\" (Angelina Jolie and director Clint Eastwood), and \"The Dark Knight\" (a riveting performance by \"Brokeback Mountain's\" Heath Ledger). In viewing all of these films, there are performances that are not only superb, but they evoke every one of the emotions and carry the intellect and intelligence of human cognitions to the highest pinnacle of excellence. As a gay person, I must say that I am moved by Sean Penn's portrayal of Harvey Milk, I am moved by the romantic chemistry between Hugh Jackman and Nicole Kidman, and I would be remiss if I did not mention Angelina Jolie's flawless and moving performance. But, I give the top honor to Clint Eastwood for giving us films that educate and entertain. And, \"Gran Torino\" (2008) is no exception. One cannot walk away from a Clint Eastwood film, without saying that they haven't learned something, or without saying (just like the legendary Ethel Merman used to sing) 'there's no business (quite) like show business'. I rank \"Gran Torino\" (2008) a 10 out of 10. Clint Eastwood's performance is more than another version of 'Dirty Harry'. In fact, his portrayal is reminiscent of the Paul Newman character in \"Nobody's Perfect\"."
    },
    {
      "username": "Simon_Says_Movies",
      "userUrl": "https://www.imdb.com/user/ur7051754",
      "reviewLink": "https://www.imdb.com/review/rw2016990",
      "warningSpoilers": false,
      "date": "27 January 2009",
      "rate": "9",
      "helpful": "55 out of 72 found this helpful.",
      "title": "Sour Humour and Pure Badassery",
      "content": "If movies like Indiana Jones, Iron Man and The Dark Knight were the thoroughbred hits of 2008, then Clint Eastwood's Gran Torino is the dark horse. This rousing crowd-pleaser is sure to surprise many, through its copious sour humour and pure badassery, while managing to still be an affecting and sombre dramatic entry in Eastwood's long-enduring and wildly successful career in front of and behind the camera.You know that a movie has something going for it when it can a) pack in so many one-liners you can't bring yourself to remember them after the show from oversaturation of the brain, b) be unboundedly racist yet still never seen exploitative or condescending and c) make a pure, grit- and-nails, grimacing anti-hero, one man army out of a seventy-eight year old man. What is likely to surprise the most number of viewers is how funny this movie really is. Eastwood's direction and line delivery as a diamond-hard antisocial veteran is bang-on, but never makes the film into a farce or embarrassment. This is due in part to the handling of the more touching dramatic moments which anchors the film in reality and reminds us of what is at play, so to speak.Following the death of his wife, Walt Kowalski (Eastwood) has nothing left but his dog to truly be with. His two sons and their families drift in and out, but Walt's less then cheerful demeanour and their impartiality keeps them in different worlds and in different times. Walt is peppered by visits from Father Janovich (Christopher Carley) of the local church at the request of his late wife to 'keep an eye on him', but has little place for religion on his heavy conscience; about as much time as he has for his new Hmong neighbours that move in next door. That is until the family's youngest son Thao (Bee Vang) begins to be harassed by a local gang who persuade him to steal Walt's prized Gran Torino as initiation. Saving Thao in an ensuing altercation, Walt sweeps the fatherless teen away from the pressures of the criminal life and puts him to work at the request of his mother. Thao and his sister Sue (Ahney Her) befriend Walt in a way, and for a reason none can truly explain.All of the Hmong actors in Gran Torino are pure novices who have never acted before and this is readily apparent. While a weak link, the film as a whole is so satisfying it is really a moot point as it serves as no thorough determent. The arc of Walt is simple and easy to predict, but then anything but would not work. Many scenes with the cultural clashes are funny and touching as with an unspoken dynamic with the elderly grandmother of the Lor family next door. A number of exchanges between the few remaining people in Walt's life who he still respects such as his barber and a construction worker who gets Thao a job, are nothing short of comic genius and piece the Walt character into a true three- dimensional individual.With a great song by Jamie Cullum to conclude the film (which stands as a horrendous Oscar snub, equalled only by the additional snub of the Bruce Springsteen Song from The Wrestler), Gran Torino is a pure gem; a film that both draws unexpected laughs, soft smiles and tears from an audience that is happy to oblige, as well as salute a screen legend in another iconic role that proves even at an old age a dark horse can still kick you in the face."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2519395",
      "warningSpoilers": false,
      "date": "16 November 2011",
      "rate": "9",
      "helpful": "18 out of 24 found this helpful.",
      "title": "A very well done and powerful film",
      "content": "I saw Gran Torino mainly as an admirer of Clint Eastwood, both as an actor and as director. And I was very impressed, there were parts that amused me and others that had me moved. Gran Torino was a very well made and beautifully directed movie, complete with a fitting soundtrack, a strong script with smooth enough tone shifts and a powerful message that is well conveyed and one that I think many, myself included, would identify with. The story is mostly engaging with an interesting protagonist, but there are a few moments where it is hackneyed and predictable, which is my only criticism of this movie. In regard to the acting, Clint Eastwood gives a very commanding performance and the kids are also very good mostly. Overall, very well done. 9/10 Bethany Cox"
    },
    {
      "username": "come2whereimfrom",
      "userUrl": "https://www.imdb.com/user/ur4995240",
      "reviewLink": "https://www.imdb.com/review/rw1990597",
      "warningSpoilers": true,
      "date": "15 December 2008",
      "rate": "8",
      "helpful": "182 out of 268 found this helpful.",
      "title": "Great whether in front or behind the camera.",
      "content": "Hot on the heels of 'Changeling' Eastwood is back and as well as directing he is back in front of the camera. He plays Walt Kowalski a recently widowed ex-Vietnam veteran who harbours slight racism and bitterness which isn't helped by the changing world he now lives in alone. He has relatives but they only seem to call when they want something and his grandkids have already started deciding what they will have of his when he dies. He has a few mates he drinks with in the pub but other than that his neighbourhood is being overrun by immigrants and gang warfare. Walt's next door neighbours are a Hmong family with no father figure and after the son tries to steal his prize car, the 'Grand Torino' of the title, Walt decides to try and reform the boy and hopefully as time passes learn about their culture and change his mind before he dies. As with all Eastwood films where you begin isn't where you will end up and the story takes many turns that will test all of your emotions, I laughed, I cried and I got angry it's a real roller-coaster. But its Clint's aged 'Dirty Harry' in Walt that steals the show and anytime he is on screen he is mesmerising which means that the supporting cast members are barely noticeable. At times it plays like Lynch's 'Straight Story' with sprinkles of 'Taxi Driver' but the real beauty is in the old fashioned storytelling, something that Clint is a dab hand at, mix that with the modern day context and you have a gripping and enthralling film. It's no wonder that so many 'best of year' lists contain this film, they should, it is that good and it proves that even at 78 Eastwood is a force to be reckoned with when it comes to movies in front or behind the camera or in the case of 'Grand Torino' both."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8794942",
      "warningSpoilers": false,
      "date": "12 January 2023",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Strong performance from the leading man, very good film.",
      "content": "After his wife dies, Korean Water veteran Walt Kowalski busies his life with small household jobs and snarling at his family, until his young neighbour tries to steal his car.It's a film you really do need to be in the mood for, as it is an intense watch, and could definitely be seen as heavy going. What I've always enjoyed about it, the touches of humour that pop up every now and then, I also think the film is very relatable.What stands out, is the superb direction, the powerful storyline, and the performance of the leading man.I think Clint Eastwood does a really fine job as Walt, he really is a tormented soul, you really do feel as though he's a man on the edge, totally disillusioned by life and everything around him, I'd seen it a great performance. I think Bee Vang is great as Thao too.When I first saw it, and still to this day, his spitting really does gross me out, although it fits the character, designed to make us feel strongly about him perhaps.8/10."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3510755",
      "warningSpoilers": false,
      "date": "24 July 2016",
      "rate": "9",
      "helpful": "13 out of 17 found this helpful.",
      "title": "This unusual Eastwood drama turns out to be one of his very best films",
      "content": "Once rumoured to be another film in the DIRTY HARRY saga, GRAN TORINO is actually much, much more than a crime film. It's not even an action film, or a thriller, despite containing elements from those genres: in actual fact, it's a solid human drama about human relationships, along with ruminations on plenty of issues affecting today's world: immigration, integration into society, crime, violence, friendship, life and death, regret. I can't imagine anyone but Clint Eastwood starring in this film. Eastwood plays his usual character, except older, more frail than more; perhaps the word I'm thinking of is 'more human'. Whatever, he's absolutely astounding in this film, giving a brilliant performance as Walt Kowalski, a foul-mouthed, irritable old racist who gradually uncovers his humanity as the story progresses.Eastwood surrounds himself with a cast of unknowns, and these actors are also triumphant. Bee Vang, as Thao, Eastwood's initial enemy and then friend, has to be singled out as giving one of the best turns, and he's matched by Ahney Her who plays his sister, Sue. I loved the performances of these two actors, who successfully manage to hold their own against Clint.GRAN TORINO is a film firmly rooted in reality, which is why there are no gung-ho heroics here, no scenes of grandeur. The ending is particularly true to life, a neat twist that defies audience expectations. The script is sparkling and witty, never losing focus of the main themes, and also particularly moving without being sentimental. It's a difficult line to walk, but this film manages it. In all, a delight and one of the best Eastwood movies I've watched. This one's a keeper."
    },
    {
      "username": "scottedwards007",
      "userUrl": "https://www.imdb.com/user/ur2971524",
      "reviewLink": "https://www.imdb.com/review/rw1989782",
      "warningSpoilers": false,
      "date": "13 December 2008",
      "rate": "9",
      "helpful": "326 out of 432 found this helpful.",
      "title": "Clint is the best director in Hollywood and still one of the great actors",
      "content": "seeing the trailer for this film kinda made me expect id be watching Dirty Harry in the suburbs.What I saw was a bittersweet superbly written, well acted story of humanity and friendship,this film is something that we can all relate to in some way, and isn't Hollywooded up in anyway, the film tells it story without any un needed hidden undertones that so many mainstream directors do to films.Eastwood is excellent as the hard nosed war vet, and his direction is perfect as always, and supporting cast did there job just fine tooClint Eastwood was perfect for the role and as director, as he has the knack of taking a story and making a film for the audience to get sucked into the story, and not for critics to pick apart....great film making,"
    },
    {
      "username": "CinemaAddict",
      "userUrl": "https://www.imdb.com/user/ur5575417",
      "reviewLink": "https://www.imdb.com/review/rw1989287",
      "warningSpoilers": false,
      "date": "12 December 2008",
      "rate": "10",
      "helpful": "747 out of 981 found this helpful.",
      "title": "An absolute cinematic gem!",
      "content": "As Clint Eastwood reaches the end of his life, he presents us with yet another performance which is nothing short of legendary. Wishing to preserve the element of surprise, I will not reveal anything by trying to analyse this great work of art. I will say this. There are similar qualities to his previous work, but I would say that both his directing and acting have reached a level of maturity comparable to that of an excellent wine. The story was compelling and, mixed with the drama was a refined touch of humour; the perfect combination for a pleasant evening. I would like to finish by thanking Mr. Eastwood for sharing this touching moment with his audience at a time when most of the cinematic \"art\" produced in Hollywood consists of stunts and bad jokes."
    },
    {
      "username": "willkoofus",
      "userUrl": "https://www.imdb.com/user/ur85596742",
      "reviewLink": "https://www.imdb.com/review/rw4720150",
      "warningSpoilers": false,
      "date": "13 March 2019",
      "rate": "10",
      "helpful": "130 out of 145 found this helpful.",
      "title": "Laughed at the start. Cried at the end",
      "content": "A modern day masterpiece. There is really no movie that is so funny, however, so moving at the same time. A true cultural masterpiece that puts political correctness to shame. We are all equal and Gran Torino does a fine job of letting us know. One of Clint Eastwood's greatest. Acting and directing."
    },
    {
      "username": "bill2594",
      "userUrl": "https://www.imdb.com/user/ur2425771",
      "reviewLink": "https://www.imdb.com/review/rw1989278",
      "warningSpoilers": false,
      "date": "10 December 2008",
      "rate": "10",
      "helpful": "705 out of 902 found this helpful.",
      "title": "Amazing Film...Eastwood deserves an Oscar!!!",
      "content": "I saw the film and it was unbelievable. Clint Eastwood will have you laughing so hard you almost pee yourself while at the same time breaking your heart and making you want to cry. The movie takes you on a roller-coaster ride and the entire theater stood up in applause afterward. I highly recommend this film and if Eastwood doesn't get nominated for an Oscar something is truly wrong!!! The screening I saw was held at the Writer's Guild, so the room was filled with SAG, WGA, DGA, and other industry related people who I would wage know their movies. At points the entire room was laughing so loud I couldn't hear, and then minutes later all you could hear were the sniffles from people crying. The film has drama, comedy, and action and Clint Eastwood really creates a character that you care about and cheer for...again!"
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7274045",
      "warningSpoilers": false,
      "date": "27 August 2021",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "our grandfather Clint continues to do good work",
      "content": "This is a better job than I expected. Despite his age, our grandfather Clint continues to do good work."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2028962",
      "warningSpoilers": false,
      "date": "25 February 2009",
      "rate": "9",
      "helpful": "17 out of 29 found this helpful.",
      "title": "Teaching The Work Ethic",
      "content": "At the ripe old age of 78 Clint Eastwood is starting on a whole new career of playing tough old timers who are way past the day when they get the girl in their movies. Except as surrogate daughters which he's done in his past two films, four years apart though they be.In Million Dollar Baby Eastwood plays the gruff very blue collar fight manager Frank Dunn who takes on female prize fighter Hilary Swank and she becomes a surrogate daughter to him. In Gran Torino the process is somewhat reversed, Eastwood is a recently widowed retired auto worker Walt Kowalski, still living in the family home in Detroit in a rapidly changing neighborhood. In fact that neighborhood's been changing for decades, the latest influx being Asians. Despite his gruffness, his outright racism, Eastwood almost in spite of himself gets drawn into an Asian family of Hmong people and develops a father/children relationship with a brother and sister, Bee Vang and Ahney Her. He becomes closer to them than he is with his own children whom he feels have forgotten the American work ethic.Actor Clint Eastwood a veteran of over 50 years in film and television is a man who knows himself and knows the limits and changes that age and infirmity have placed upon him. As his most famous screen character so aptly remarked a man has to know his limitations. Director Clint Eastwood is nothing short of a genius in the performances he got from the two young Asian kids, both of whom were making their screen debuts and in fact from the rest of his Asian cast members, most of whom were new. Both the boy and the girl were just fabulous and so real as kids, not at all like Hollywood teen player types.And both kids face some very typical choices that all youngsters face today, especially those growing up in areas at or below the poverty line. Especially the boy who's being pressured to join a gang. Clint himself is facing old age issues, but he still mentors the kids and in the end does what a man's got to do.It took four years for actor Eastwood to reappear on the screen again. But it was worth the wait. With two back to back hits like Million Dollar Baby and Gran Torino, I just hope I don't have to wait another four years for Clint to reappear."
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw2002942",
      "warningSpoilers": false,
      "date": "6 January 2009",
      "rate": "9",
      "helpful": "40 out of 63 found this helpful.",
      "title": "Clint Eastwood Closes Out His Career With A Bang",
      "content": "My expectations coming in to see Gran Torino were very high and it certainly did not disappoint. Of course Clint Eastwood reputation has only gotten even better since his recent success as a director but this time it his performance that leads the way.Clint Eastwood had if not the best performance, one of the best performances this year. His performance was vivid and magical to watch. Vivid may seem like a head scratcher of a word to use but his way of displaying his maliciousness, antisocial and cynical attitude to the many people around him including his family. Yet over the course of the movie his attitude changes towards a Hmong family who are his neighbors. When one of the boys (Thao) from the neighbors' attempts to rob him of his Gran Torino, the family sends him to work for Walt (Clint Eastwood) as punishment. While Thao works for Walt, Walt begins to form a protective fatherly type bond over Thao. In this way as well Eastwood's performance is very vivid showing how his cold bitter attitude can transform into a very warm selfless demeanor towards one family.Gran Torino was also written and directed very well. Especially since a relatively unknown cast played to beyond anyone could have expected. Some how Clint Eastwood manages to continue to maximize the potential of the material he is given.This was a very heart-warming film in my mind throughout. The ending of the film is probably more of an ending to Eastwood's career as an actor rather than that of the movie itself. It does not leave him in the place he is looked at as a vigilante but rather in the place of the man that stands up for his morals and for the people he is loyal to."
    },
    {
      "username": "areatw",
      "userUrl": "https://www.imdb.com/user/ur66517869",
      "reviewLink": "https://www.imdb.com/review/rw3868287",
      "warningSpoilers": false,
      "date": "26 November 2017",
      "rate": "8",
      "helpful": "11 out of 16 found this helpful.",
      "title": "Impressive character-driven drama with a memorable ending",
      "content": "If there's any Clint Eastwood film that sums up his 'jack of all trades' reputation, then this one has got to be it. There's nothing that the guy doesn't do, and this peculiar yet powerful character study is the perfect example of that. 'Gran Torino' is a very smart and hugely enjoyable drama film with a brilliant ending that tops off what is a truly great story.It is a story built on characters and friendship where you would least expect to find it. The character development is excellent, and rarely will you find such a convincing and diverse bunch of characters that work so well together. The film's strength is definitely in its simplicity, with the stripped back, raw approach complementing the storyline perfectly. 'Gran Torino' is an impressive character-driven drama with a memorable ending."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2188216",
      "warningSpoilers": true,
      "date": "8 January 2010",
      "rate": "10",
      "helpful": "14 out of 24 found this helpful.",
      "title": "Like morphing Archie Bunker with Dirty Harry...this one is full of surprises.",
      "content": "The movie begins with Clint Eastwood's wife dying. You can immediately see that he's a nasty old man who has little, if any, connection with his kids and grandkids (some of which ARE pretty unlikable). He also lives in a community that is now filled with Asians and Chicanos (and gangs) and he hates them—and they don't particularly like him either. At this point, it's hard to like the crusty old guy. He's nasty to the well-meaning priest that's trying to help him cope with the wife's death and he just wants everyone to leave him alone.Later, despite Eastwood's character wanting his privacy, he is forced to get involved—though it's NOT for altruistic reasons. An Asian gang is trying to force a neighbor kid to join them by kidnapping him. Unfortunately for Eastwood, the gang is loud and come on his property and he responds by holding them at gunpoint---telling them to leave or die! Unexpectedly, the next day, his Asian neighbors begins bringing him food, flowers and other gifts. Why? Because they, too, have been terrorized by the gangs and they wanted to thank him. In addition, the teen he saved from kidnapping thanks him. and admits that he'd tried to steal Eastwood's prize old car (a Gran Torino in mint condition) the prior night. Eastwood graciously responds that if he ever sees the kid again on his property, he'll \"blow his head off\"! This Eastwood character talks a lot like Archie Bunker combined with Dirty Harry---and he just wants to be left alone!! Where the film goes next is somewhat predictable, but how it all ends is simply amazing--and practically impossible to predict. I'd say more, but I really don't want to spoil the film.The film excels with its witty and very gritty dialog. However, be forewarned that the film has very, very rough language. Not only is there a lot of cursing, but the film has tons of racial epithets--so many that the strongly politically correct out there might just have a stroke if they watch it! While it is vulgar and gross, it was fitting for the story--as gang life is not pretty and sanitizing it too much would have severely impacted the film's realism.Overall, a great film with expert direction, story and acting. It's clearly one of the best films I've seen of the last decade."
    },
    {
      "username": "schroederagustavo",
      "userUrl": "https://www.imdb.com/user/ur80309494",
      "reviewLink": "https://www.imdb.com/review/rw5926708",
      "warningSpoilers": true,
      "date": "23 July 2020",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Gran Torino Review",
      "content": "A very good Eastwood movie, both in terms of performance and direction by the man himself. It has, I think, a great message about today's youth, the values that society used to hold, back when men used to be men, about redemption and about judging other people by the content of their character, rather than the color of their skin. The only thing I see holding down this otherwise great film, is sometimes the dialogue of the film and the stereotypes that the family of Eastwood's character plays are a little too \"on the nose\". The family, for example, filled with ungrateful people with no values whatsoever who are only interested in what will happen to Walt's possessions as soon as he dies, often seem caricatures, characters overly simplified in order for the message to come across that they are soulless creatures and to place the emphasis that Walt comes to value and grow a much better relationship with his Asian neighbors, despite all of his initial racism and prejudice towards them. But putting that aside, Gran Torino is truly a very good film, perhaps one of Eastwood's best."
    },
    {
      "username": "machngunjoe",
      "userUrl": "https://www.imdb.com/user/ur5252199",
      "reviewLink": "https://www.imdb.com/review/rw2092472",
      "warningSpoilers": false,
      "date": "7 July 2009",
      "rate": "5",
      "helpful": "84 out of 156 found this helpful.",
      "title": "Mainly for Clint Eastwood fans",
      "content": "Despite all the rave reviews, which I don't understand, I didn't think this movie was made very well. It was mainly the acting and the writing. CLint Eastwoods performance was great, but everybody else was bad. From the Young preacher to the main Hmong characters the acting was forced and you could tell that all these people had never done a movie before, which according to IMDb is mostly true.Right off the bat you saw the actor who played the preacher was of considerably less caliber than anyone else in the scenes. The Hmong actor during a climatic scene with Clint Eastwood seemed fake, forced and just not very good. Again if everybody was that bad maybe no one would have noticed but they were up against a veteran actor, so it was quite noticeable.The writing was a little empty and it didn't take a guru to see right through the plot.I know Clint Eastwoods movies are plain movies, usually low budget, with fresh new actors, and simple plot lines, with the exception of his latest WWII movies and Mystic River. Although the revenue must be very high for this movie cause I'm sure it was dirt cheap to make considering all the aspects, but this certainly isn't a must see even if it is his last acting movie."
    },
    {
      "username": "ethlaid",
      "userUrl": "https://www.imdb.com/user/ur129732545",
      "reviewLink": "https://www.imdb.com/review/rw7026358",
      "warningSpoilers": false,
      "date": "13 June 2021",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Very powerful lesson",
      "content": "A very touching film that brings out a different but still great side of Clint Eastwood."
    },
    {
      "username": "GManfred",
      "userUrl": "https://www.imdb.com/user/ur19281585",
      "reviewLink": "https://www.imdb.com/review/rw2008526",
      "warningSpoilers": true,
      "date": "17 January 2009",
      "rate": "",
      "helpful": "24 out of 48 found this helpful.",
      "title": "Didn't make my day",
      "content": "I am a Clint Eastwood fan, but not lately.He has decided to reveal a human side of himself - went to the Wizard and acquired a heart. He also revealed he is a wooden actor and a plodding, predictable director. Gran Torino is uninteresting at best and tedious at worst,worse even than Million Dollar Baby,and contains some of the worst actors ever subjected to the silver screen. I did enjoy the Christ-image at the end as he is sprawled on the lawn,which was an unintentional touch of humor. He says he is going to continue directing pictures and maybe next time he could hire a professional screenwriter.Speaking of directing, the Directors of the IMDb website should monitor entries more carefully.Currently, Gran Torino has an 8.5 ranking, which is a travesty.Since this puts it in with some mighty good movies,modern filmgoers obviously haven't a clue regarding what makes a good picture.Perhaps a separate category could be designated for films made after,say,1980.That might separate the film lovers from the dilettantes."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw2024603",
      "warningSpoilers": false,
      "date": "17 February 2009",
      "rate": "",
      "helpful": "33 out of 76 found this helpful.",
      "title": "Poor performances, weak material and clunky development  Eastwood being a gruff and watchable lead cannot redeem the many problems here",
      "content": "Having been recently widowed, Korean war veteran Walt Kowalski finds himself all alone in a community that has seen all his former neighbours replaced with members of the Hmong community. Racist, aggressive, distant from his family, Walt is living out his days with beer on his porch, watching the world go by with a gruff sense of disgust. When he finds his neighbour's son trying to steal his car  a prize 1972 Gran Torino  Walt finds his hatred justified but, when he stands up to the gang that had forced Thao into the crime, he is hailed as a local hero by his neighbours and finds himself drawn into the life of Thao and his family.Gran Torino is one of the films that benefited from the Oscar buzz around one certain aspect. Much like Mickey Rourke's performance made people think that The Wrestler was perhaps a better all round film than it was, so talk of an acting Oscar for Eastwood has put this film into the public mind as being \"Oscar-worthy\", even if that has been knocked into a cocked hat before it reached the UK. This perception is the only thing I can think of that has motivated so many IMDb users to vote so highly on this title (well, that and the fact that some users will vote 10 or 0 and nothing in between) because this is not a particularly good film by any means. If you read the boards all you will hear about is the standard of acting being a problem but for me the problems start with the script. You see this is a film that really needs convincing and careful character development to make it work. Sadly this is not what we get as the film is written in steps without a lot of attention to getting between these steps in a way that feels real or convincing. The overall arch of the film is engaging in these steps and I did not have an issue with the actual plot but too often it just feels clunky and clumsy in the writing and it gets weaker and weaker as it goes on. Those doubting my concerns over Walt's transformation being rushed and unconvincing can surely not have doubts over the minor characters  the priest talking to Walt towards the end of the film is perhaps one of the worst written changes in character I've seen! As director, Eastwood cannot fix the problems with the script but he is almost good enough to cover it in his own performance. He does this by being what we already know he is  a big gruff presence that can effortlessly fill a cinema screen. This makes him watchable but the material limits him and fortunately the Oscar voters have not been taken in by sentimentality on this occasion. By comparison though he is fantastic because the commendable idea of casting Hmong actors in their debut performances backfires badly with key players failing to deliver. Bee Vang's Thao doesn't have anything like the range required  he is OK when being natural but anything more demanding is flat. Ahney Her's Sue doesn't even really manage that and, while a \"nice\" presence she doesn't feel natural and I didn't engage with her or see why Walt would. This problem is not so obvious in the rest of cast they are mostly playing clichés or just hanging around. One person without the excuse of language or inexperience is Carley who is pretty awful but in fairness is given probably the weakest material out of everyone.The whole thing is a really weak film that sums it all up perfectly with a terrible song with terrible singing from Eastwood. This is the final misjudgement of many but the root of it all is the script which takes a basic premise and delivers it in chunky blocks that don't really scan and pushes the viewer away when it should draw them in. Things that should have an impact don't really work because of this and, although Eastwood is a solid presence, he cannot find much to really work with. The performances outside of him are roundly poor and the main players lack the range to deliver when required. The end result is a really poor film and it is embarrassing to see so many users here stepping it claiming it as a piece of greatest  see it for yourself if you wish, but let me assure you it is nothing of the sort, no matter how much I tried to go with it."
    }
  ],
  "errorMessage": ""
}