{
  "imDbId": "tt1205489",
  "title": "Gran Torino",
  "fullTitle": "Gran Torino (2008)",
  "type": "Movie",
  "year": "2008",
  "language": "en",
  "titleInLanguage": "Gran Torino",
  "url": "https://en.wikipedia.org/wiki/Gran_Torino",
  "plotShort": {
    "plainText": "Gran Torino is a 2008 American drama film directed and produced by Clint Eastwood, who also starred in the film. The film co-stars Christopher Carley, Bee Vang, and Ahney Her. This was Eastwood's first starring role since 2004's Million Dollar Baby. The film features a large Hmong American cast, as well as one of Eastwood's younger sons, Scott. Eastwood's oldest son, Kyle, provided the score. Set in Highland Park, Michigan, it is the first mainstream American film to feature Hmong Americans. Many Lao Hmong war refugees resettled in the U.S. following the establishment of a socialist government in Laos in 1975.\r\nThe story follows Walt Kowalski, a recently widowed Korean War veteran alienated from his family and angry at the world. Walt's young neighbor, Thao Vang Lor, is pressured by his cousin into trying to steal Walt's prized 1972 Ford Torino for his initiation into a gang. Walt thwarts the theft and subsequently develops a relationship with the boy and his family.\r\nGran Torino opened in a limited theatrical release in the United States on December 12, 2008, before expanding wide on January 9, 2009. It grossed $270 million worldwide, making it Eastwood's second highest-grossing film to-date. The film received positive reviews from critics for Eastwood's direction and performance; within the Hmong community in the United States, the film was generally praised but also received criticism for its cultural inaccuracies.",
    "html": "<p>Gran Torino is a 2008 American drama film directed and produced by Clint Eastwood, who also starred in the film. The film co-stars Christopher Carley, Bee Vang, and Ahney Her. This was Eastwood's first starring role since 2004's Million Dollar Baby. The film features a large Hmong American cast, as well as one of Eastwood's younger sons, Scott. Eastwood's oldest son, Kyle, provided the score. Set in Highland Park, Michigan, it is the first mainstream American film to feature Hmong Americans. Many Lao Hmong war refugees resettled in the U.S. following the establishment of a socialist government in Laos in 1975.</p><p>The story follows Walt Kowalski, a recently widowed Korean War veteran alienated from his family and angry at the world. Walt's young neighbor, Thao Vang Lor, is pressured by his cousin into trying to steal Walt's prized 1972 Ford Torino for his initiation into a gang. Walt thwarts the theft and subsequently develops a relationship with the boy and his family.</p><p>Gran Torino opened in a limited theatrical release in the United States on December 12, 2008, before expanding wide on January 9, 2009. It grossed $270 million worldwide, making it Eastwood's second highest-grossing film to-date. The film received positive reviews from critics for Eastwood's direction and performance; within the Hmong community in the United States, the film was generally praised but also received criticism for its cultural inaccuracies.</p>"
  },
  "plotFull": {
    "plainText": "Gran Torino is a 2008 American drama film directed and produced by Clint Eastwood, who also starred in the film. The film co-stars Christopher Carley, Bee Vang, and Ahney Her. This was Eastwood's first starring role since 2004's Million Dollar Baby. The film features a large Hmong American cast, as well as one of Eastwood's younger sons, Scott. Eastwood's oldest son, Kyle, provided the score. Set in Highland Park, Michigan, it is the first mainstream American film to feature Hmong Americans. Many Lao Hmong war refugees resettled in the U.S. following the establishment of a socialist government in Laos in 1975.\r\nThe story follows Walt Kowalski, a recently widowed Korean War veteran alienated from his family and angry at the world. Walt's young neighbor, Thao Vang Lor, is pressured by his cousin into trying to steal Walt's prized 1972 Ford Torino for his initiation into a gang. Walt thwarts the theft and subsequently develops a relationship with the boy and his family.\r\nGran Torino opened in a limited theatrical release in the United States on December 12, 2008, before expanding wide on January 9, 2009. It grossed $270 million worldwide, making it Eastwood's second highest-grossing film to-date. The film received positive reviews from critics for Eastwood's direction and performance; within the Hmong community in the United States, the film was generally praised but also received criticism for its cultural inaccuracies.\r\nPlot\r\nCantankerous, bigoted Korean War veteran and retired Ford factory worker Walt Kowalski is widowed after 50 years of marriage. His aging neighborhood in Highland Park in Metro Detroit was formerly populated by working-class white families but has become filled with gang violence and poor southeast Asian immigrants, including Walt's next-door neighbors, the Vang Lor family. Adding to his isolation, Walt is emotionally detached from his family; he angrily rejects his son's suggestion he move to a retirement community and lives alone with his elderly labrador, Daisy. A chronic tobacco user, Walt suffers from coughing fits, occasionally with blood, which he conceals from his family. As requested by Walt's late wife, her priest, Father Janovich, tries to comfort Walt and persuade him to go to confession. Despite on multiple occasions being impolitely turned away by Walt, dismissing him as young and inexperienced, Father Janovich repeatedly tries to get through to him.\r\nWalt catches Thao Vang Lor attempting to steal his Ford Torino as a coerced initiation into a Hmong gang run by Thao's cousin, \"Spider.\" Even after this failed attempt the gang nonetheless wants to take Thao with them, but Walt drives them off with his M1 Garand, earning the Hmong community's respect. As penance, Thao's mother makes him work for Walt, who has him do different jobs in the neighborhood. The two soon form a grudging mutual respect, and Walt mentors Thao, helping him obtain a construction job and giving him social and dating advice. Walt rescues Thao's sister, Sue, from the unwanted advances of three rough youths and bonds with her as well. Walt consults his doctor, who gives him a gloomy prognosis that he conceals from his family.\r\nSpider's gang continues to pressure Thao and assaults him on his way home from work. Walt visits the gang's house and attacks a member as a warning. In retaliation, the gang rapes Sue and injures Thao in a drive-by shooting. The members of the community, including Sue, refuse to report the crimes out of fear. The following day, an enraged Thao seeks Walt's help to exact revenge; Walt convinces him to return later that day. Walt makes personal preparations: He mows his lawn, buys a suit, gets a haircut and finally makes his confession to Father Janovich.\r\nWalt takes Thao to his basement and gives him his Silver Star, then tells him that he is still haunted by the memory of killing an enemy soldier who was ready to surrender and that he wants to spare Thao from becoming a murderer. He locks Thao in the basement and heads to the gang's residence. The gang members point their guns at Walt, who loudly berates them for their crimes, drawing the attention of the neighbors. Walt puts a cigarette in his mouth, slowly reaches into his jacket pocket and pulls his hand out quickly, as if he were drawing a gun. Thinking he is about to fire, the gang members shoot and kill him. Walt's hand opens to reveal his Zippo lighter with First Cavalry insignia — he was unarmed and sacrificed himself to save the Vang Lor family. Sue, following Walt's directions, frees Thao, and they drive to the scene in Walt's Gran Torino.\r\nA police officer tells Thao and Sue that the gang members have been arrested for murder and the surrounding neighbors have all come forward as witnesses. Father Janovich conducts Walt's funeral, which is attended by his family and many of the Hmong community, puzzling his family. Afterward, Walt's last will and testament is read. Much to the surprise of Walt's family, Walt leaves his house to the church and his cherished Gran Torino to Thao, on the condition that Thao does not modify the car in any way. Sometime later, Thao drives the car along Detroit's Jefferson Avenue with Daisy at his side.\r\nCast\r\nClint Eastwood as Walt Kowalski\r\nBee Vang as Thao Vang Lor, a young Hmong teenager\r\nAhney Her as Sue Lor, Thao's older sister\r\nChristopher Carley as Father Janovich\r\nDoua Moua as Fong \"Spider,\" Thao's cousin\r\nSonny Vue as Smokie, Spider's right-hand man\r\nElvis Thao as Hmong Gangbanger No. 1\r\nBrian Haley as Mitch Kowalski, Walt's older son\r\nBrian Howe as Steve Kowalski, Walt's younger son\r\nGeraldine Hughes as Karen Kowalski, Mitch's wife\r\nDreama Walker as Ashley Kowalski, Mitch and Karen's daughter\r\nMichael E. Kurowski as Josh Kowalski, Mitch and Karen's son\r\nJohn Carroll Lynch as Martin, an Italian American barber friend of Walt's\r\nChee Thao as Grandma Vang Lor, the matriarch of Thao's family\r\nChoua Kue as Youa, Thao's eventual girlfriend\r\nScott Eastwood as Trey, Sue's date\r\nAfter holding casting calls in Fresno, California, Detroit, Michigan, and Saint Paul, Minnesota, Eastwood selected ten Hmong lead actors and supporting actors. Of them, only one was not a first time actor. Of the Hmong cast, five, including Bee Vang, one of the principal actors, were from the state of Minnesota. Ahney Her comes from Lansing, Michigan. The casting agency Pound & Mooney recruited thirty actors and over 500 extras. The firm recruited many Hmong actors from a Hmong soccer tournament in Macomb County, Michigan. Sandy Ci Moua, a Hmong actress based in the Twin Cities, assisted with the film's casting of Hmong actors.\r\nProduction\r\nGran Torino was written by Nick Schenk and directed by Clint Eastwood. It was produced by Village Roadshow Pictures, Media Magik Entertainment and Malpaso Productions for film distributor Warner Bros. Eastwood co-produced with his Malpaso partners Robert Lorenz and Bill Gerber. Eastwood has stated he enjoyed the idea \"that it dealt with prejudice, that it was about never being too old to learn\".\r\nShooting began in July 2008. Hmong crew, production assistants, consultants, and extras were used. The film was shot over five weeks. Joel Cox and Gary D. Roach, the editors, cut the film so it was under two hours long. The crew spent over $10 million while shooting the film in Detroit.\r\nIn the early 1990s, Schenk became acquainted with the history and culture of the Hmong while working in a factory in Minnesota. He also learned how they had sided with the South Vietnamese forces and its US allies during the Vietnam War, only to wind up in refugee camps, at the mercy of North Vietnamese Communist forces, when US troops pulled out and the government forces were defeated. Years later, he was deciding how to develop a story involving a widowed Korean War veteran trying to handle the changes in his neighborhood when he decided to place a Hmong family next door and create a culture clash. He and Dave Johannson, Schenk's brother's roommate, created an outline for the story. According to Schenk, each night he used a pen and paper to write the script while in Grumpy's, a bar in Northeast Minneapolis, while not working at his day jobs. He recalled writing 25 pages within a single night in the bar. He recalled asking the bartender, who was his friend, questions about the story's progress. Some industry insiders told Schenk that a film starring an elderly main character could not be produced, as the story could not be sold, especially with an elderly main character who used language suggesting that he held racist views. Through a friend, Schenk sent the screenplay to Warner Bros. producer Bill Gerber. Eastwood was able to direct and star on the project as filming for Invictus was delayed to early 2009, leaving sufficient time for filming Gran Torino during the previous summer. Eastwood said that he had a \"fun and challenging role, and it's an oddball story.\"\r\nAccording to Schenk, aside from changing Minneapolis references to Detroit references, the production headed by Eastwood \"didn't change a single syllable\" in the script. Schenk added that the concept of the producers not making any substantial revisions to a submitted script \"never happens.\" Eastwood said that he stopped making significant revisions after attempting to change the script of Unforgiven and later deciding to return to the original revision, believing that his changes were \"emasculating\" the product.\r\nSelection of Detroit for production and setting\r\nThe original script was inspired by the Northeast community of Minneapolis, Minnesota, but filmmakers chose to shoot in Michigan, becoming one of the first productions to take advantage of the state's new law that provided lucrative incentive packages to film productions. Bill Huizenga, from Zeeland, Michigan, who once served in the Michigan House of Representatives, helped write and coordinate the State of Michigan's incentive package to the film creators. The film ultimately received a 42% tax credit. Bruce Headlam of The New York Times said \"That helped make it easy for Warner Bros. to sign off on bankrolling the movie, something that hasn’t always been a given in the studio’s relationship with the director.\"\r\nProducer Robert Lorenz said that while the script was originally set in Minnesota, he chose Michigan as the actual setting as Kowalski is a retired car plant worker. Metro Detroit was the point of origin of the Ford Motor Company. Schenk said that sometimes the lines in the movie feel out of place with the Detroit setting; for instance a line about one of Walt's sons asks if Walt still knows a person who has season tickets for Minnesota Vikings games was changed to being about a person with Detroit Lions tickets. Schenk said \"They don't sell out in Detroit. And so that bothered me. It seemed really untrue to me.\"\r\nShooting locations\r\nLocations, all within Metro Detroit, included Highland Park, Center Line, Warren, Royal Oak, and Grosse Pointe Park. The house depicting Walt Kowalski's house is on Rhode Island Street in Highland Park. The Hmong gang house is located on Pilgrim Street in Highland Park. The house depicting the residence of one of Walt's sons is on Ballantyne Road in Grosse Pointe Shores. The church used in the film, Saint Ambrose Roman Catholic Church, is in Grosse Pointe Park. The hardware store, Pointe Hardware, is also in Grosse Pointe Park. VFW Post 6756, used as the location where Walt meets friends to drink alcohol, is in Center Line.\r\nThe barber shop, Widgren's Barber Shop, is along 11 Mile Road, near Center Street, in Royal Oak. The shop, founded in 1938, in a space now occupied by another business, moved to its current location, west of its original location, in 1970. The film producers selected that shop out of 60 candidates in Metro Detroit. According to Frank Mills, the son-in-law of owner Ted Widgren, the producers selected it because they liked \"the antique look inside.\" Eastwood asked Widgren to act as an extra in the barber shop scene. In the area around the barbershop, vehicle traffic had to be stopped for three to five minutes at a time, so traffic in the area slowed down.\r\nShooting and acting\r\nOf the entire cast, only a few were established actors; the Hmong actors had relatively little experience, and some were not proficient in English. Jeff Baenen said that Eastwood used a \"low-key approach to directing.\" Eastwood said that \"I’d give them little pointers along the way, Acting 101. And I move along at a rate that doesn’t give them too much of a chance to think.\" Bee Vang said that he originally felt fright, but was able to ease into the acting. Baenen said that Eastwood was a \"patient teacher\" of the first-time actors. According to Vang, Eastwood did not say \"action\" whenever filming a particular shoot began.\r\nVang said that he had studied the script as if it were a textbook. According to Vang, after the first film cut ended, Vang did not hear a response from Eastwood. When Vang asked if something was wrong, other people told Vang that if Eastwood did not make a comment, then his performance was satisfactory. Vang added that Eastwood encouraged ad-libbing with the Hmong actors. Ahney Her said that she liked the improvisation work, even when she was required to translate between the English and Hmong languages. When asked if the in-character racial slurs offended the actors in real life, Ahney said that she did not feel offense. Vang said, \"I was called so many names that I can’t say here because of how vulgar they were. It disturbed me quite a lot, but at the end of the day it was just a script.\"\r\nVang said in a 2011 program that Eastwood did not allow the Hmong actors to change their lines, despite what he said in the earlier interviews.\r\nHmong people and culture during the production\r\nNick Schenk said that he became friends with many Hmong coworkers while employed at a VHS factory in Bloomington, Minnesota. In regards to Schenk's stories of his interactions with the Hmong people, Laura Yuen of Minnesota Public Radio said \"That sense of humor and curiosity permeate the script, even though the Gran Torino trailers make the movie look like, by all measures, a drama.\"\r\nEastwood wanted Hmong as cast members, so casting director Ellen Chenoweth enlisted Hmong organizations and set up calls in Detroit, Fresno and Saint Paul; Fresno and Saint Paul have the two largest Hmong communities in the United States, while Detroit also has an appreciable population of Hmong. Chenoweth recruited Bee Vang in St. Paul and Ahney Her in Detroit.\r\nThe screenplay was written entirely in English. Therefore, the actors of Gran Torino improvised the Hmong used in the film. Louisa Schein, author of Hmong Actors Making History Part 2: Meet the Gran Torino Family, said before the end of production that \"some of the lines actors ad-libbed in Hmong on camera will be tricky to translate back for subtitles.\" Schenk had input from Hmong people when writing the script. Dyane Hang Garvey served as a cultural consultant, giving advice on names, traditions, and translations.\r\nVang later argued that the use of the Hmong people did not seem relevant to the overall plot. He said \"there is no real reason for us to be Hmong in the script\" and that even though Walt Kowalski had fought in Korea, he had still confused the Hmong with Koreans and other Asian ethnic groups. In a 2011 program Vang said that Hmong actors were treated unfairly on the set, and that Eastwood did not give tips on how to build the characters. Vang also claimed other white cast members made Hmong actors feel excluded by assuming the Hmong speakers did not understand English. Vang said that some important lines that the Hmong characters said in the Hmong language were not subtitled, so audiences developed a skewed perception of the Hmong people.\r\nCultural accuracies and inaccuracies\r\nBee Vang, as paraphrased by Jeff Baenen of the Associated Press, said in 2009 that the film's portrayal of the Hmong is \"generally accurate.\" Regarding the result, Vang said \"his film is not a documentary. We can't expect 101 percent correctness.\"\r\nDuring the filming, Hmong cast members addressed what they believed to be cultural inaccuracies that were being introduced. Cedric Lee, a half-Hmong who worked as a production assistant and a cultural consultant, said that \"Some things were over-exaggerated for dramatic purposes. Whether it was our job or not, I still felt some responsibility to speak our mind and say something, but at the same time, the script was what it was. We didn’t make the final decision.\"\r\nIn 2011, Vang said while many Hmong had objected to some elements, the producers selected the viewpoints of the Hmong cultural consultants which \"had the most amenable take on the matter and would lend credence to whatever Hollywood stereotypes the film wanted to convey.\" Vang further said that \"this was a white production, that our presence as actors did not amount to control of our images.\"\r\nLouisa Schein and Va-Megn Thoj, authors of \"Gran Torino’s Boys and Men with Guns: Hmong Perspectives,\" said \"Perhaps the most commonly voiced Hmong objections to the film concern its myriad cultural inaccuracies, exaggerations and distortion.\" Schein also said that \"he actors struggle, too, with their culture being made into spectacle.\" Even though a real Hmong shaman acts as a Hmong shaman in the film, Schein said that \"his expertise was overridden by the screenplay and the filming, which distorted the ceremonial scenes by making them inaccurately exotic.\" Vang said that the tea ceremonies depicted in the film were not correctly performed. Even though, in the film, Hmong characters feel offense when Walt touches a girl on the head, Schein said that in real life in Hmong culture it is okay to touch a person on the head. In other segments of the film, the Hmong shaman touches a baby's head without any negative criticism. Schein adds that Spider touches Thao Vang Lor's head \"without consequence.\" Christine Wilson Owens, author of \"Hmong Cultural Profile,\" said \"Most traditional Hmong elders, especially men, do not want strangers to touch their heads, or those of their children, due to their religious beliefs and personal values.\"\r\nThao and Sue Lor wear Hmong clothing to Walt Kowalski's funeral. Hmong do not ordinarily wear traditional Hmong clothing to funerals. Grandma Lor spits a betel nut she had been chewing to show contempt for Walt Kowalski, even though the Hmong do not chew betel nuts. The Hmong shaman reads Walt's personal character, when in real life he would communicate with the spirit world. In the film the shaman himself does a sacrifice of a chicken in a manner that Schein and Thoj say is \"in dramatic ceremonial fashion,\" when in real life an assistant would do this \"perfunctorily.\" The authors said that the hu plis ceremony done in honor of the baby has an incorrect spatial layout, that the clothing and grooming of the Hmong gangs is not correct, and \"the obsequious making of offerings on doorstep\" are not accurate. While Thao himself cleans dishes, Schein and Thoj add that he would not do this alone because he is in a house with other female family members. Schein and Thoj also add that there is \"inconsistent use of the two Hmong dialects within one family.\" They also argue that members of a Hmong clan would not show aggression towards a member of a fellow clan and that they would not rape a member of their own clan, like the gang in the film rapes Sue. Sharon Her, a Hmong writer from New York, argued that the film had \"confusion of Asian customs\" and that \"Hmong people do not use favors as a method of atonement nor do they endlessly shower individuals with gifts out of gratitude.\" Her added, \"An early draft of the script even had names misspelled and referenced Chinese surnames, a sloppy mistake that was easily corrected.\"\r\nRelease\r\nTheatrical\r\nIn the film's opening weekend of wide release in the US, it grossed $29.5 million. As of 2021, it has taken in $269,958,228 worldwide.\r\nHome media\r\nThe film was released on June 9, 2009, in the United States in both standard DVD format and Blu-ray. The disc includes bonus materials and extra features. A featurette is included and a documentary about the correlation of manhood and the automobile. The Blu-ray version presents the film in 2.40:1 ratio format, a digital copy, and the audio in multiple languages.\r\nAbout 4 million DVD units have been sold as of 2012, generating $67.4 million in revenue. Another 332,000 Blu-rays were sold, for $4.9 million, bringing the total to $72.3 million in home video sales.\r\nReception\r\nCritical response\r\nRotten Tomatoes reports that 81% of 237 surveyed critics gave the film positive write-ups; the average score is 7.10/10. The site's consensus states: \"Though a minor entry in Eastwood's body of work, Gran Torino is nevertheless a humorous, touching, and intriguing old-school parable.\" At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film has received an average score of 72 based on 34 reviews. Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.\r\nAfter seeing the film, The New York Times described the requiem tone captured by the film, calling it as \"a sleek, muscle car of a movie made in the USA, in that industrial graveyard called Detroit\". Manohla Dargis compared Eastwood's presence on film to Dirty Harry and the Man with No Name, stating: \"Dirty Harry is back, in a way, in Gran Torino, not as a character, but as a ghostly presence. He hovers in the film, in its themes and high-caliber imagery, and of course, most obviously, in Mr. Eastwood's face. It is a monumental face now, so puckered and pleated that it no longer looks merely weathered, as it has for decades, but seems closer to petrified wood.\"\r\nThe Los Angeles Times also praised Eastwood's performance and credibility as an action hero at the age of 78. Kenneth Turan said of Eastwood's performance, \"It is a film that is impossible to imagine without the actor in the title role. The notion of a 78-year-old action hero may sound like a contradiction in terms, but Eastwood brings it off, even if his toughness is as much verbal as physical. Even at 78, Eastwood can make 'Get off my lawn' sound as menacing as 'Make my day', and when he says 'I blow a hole in your face and sleep like a baby', he sounds as if he means it\".\r\nRoger Ebert wrote that the film is \"about the belated flowering of a man's better nature. And it's about Americans of different races growing more open to one another in the new century.\" Sang Chi and Emily Moberg Robinson, editors of Voices of the Asian-American and Pacific Islander Experience: Volume 1, said that within the mainstream media, the film received \"critical acclaim\" \"for its nuanced portrayal of Asian Americans.\" Louisa Schein and Va-Megn Thoj, authors of \"Gran Torino's Boys and Men with Guns: Hmong Perspective,\" said that the mainstream critical response was \"centered on Eastwood's character and viewed the film mainly as a vision of multicultural inclusion and understanding.\"\r\nNicole Sperling, columnist for Entertainment Weekly, called it a drama with \"the commercial hook of a genre film\" and described it further as \"a meditation on tolerance wrapped in the disguise of a movie with a gun-toting Clint Eastwood and a cool car\". Chi and Robinson said that within the Asian-American community, some criticized \"depictions of Hmong men\" and \"the archetypical white savior trope that permeated the film\".\r\nReception in relation to the Hmong\r\nClint Eastwood's decision to cast Hmong actors, including amateur actors, received a positive reception in Hmong communities. Tou Ger Xiong, a Hmong storyteller and performance artist from the Minneapolis-St. Paul area who had auditioned for a role in the film, said that he had respect for the film because the producers actually cast Hmong instead of asking other Asian-Americans to mimic Hmong. Xiong also argued \"First things first, let's get our foot in the door. Complain later.\" Dyane Hang Garvey, who served as a cultural consultant for the film production, said that the film was not intended to be a documentary on the Hmong people and that it positively highlights, as paraphrased by Laura Yuen of Minnesota Public Radio, \"the close-knit nature of the Hmong community in Detroit\". Doua Moua, a Hmong actor in the film, said that he had no regrets in playing a gang member, because, in Yuen's words, \"gangs consumed his brother's life while they were growing up in Saint Paul\". Moua added that many first generation Hmong are affected by gangs and drift into gangs due to a lack of father figures.\r\nLouisa Schein, a Rutgers University anthropologist who is an expert on the Hmong culture, approved the concept of Hmong achieving visibility in the popular culture of the United States, but believed that the film may be promoting out of date stereotypes of the Hmong. Schein said that her Hmong friends were \"touched\" by the film's portrayal of Hmong culture redeeming and reaching out to Walt Kowalski.\r\nSchein further added that the film seemed to give little prominence to the history of the Hmong, and that only two male Hmong, Thao and a gang member, were given depth in the story. Schein said \"I feel a lot of the plot about the Eastwood character is driven by the fact that he is a veteran. Yet there is no possibility for representing the fact that the Hmong were veterans too.\" An individual established a blog, eastwoodmovie-hmong.com, documenting what the author believed to be cultural inaccuracies of the film's depiction of the Hmong.\r\nDavid Brauer of MinnPost said that some Hmong liked Gran Torino and that many believed that the film was offensive. In 2009, actor Bee Vang said that he was satisfied with the outcome of the film. Brauer said that in an opinion editorial released in 2011, Vang \"isn't kind to the Clint Eastwood film\". Krissy Reyes-Ortiz of The Bottom Line of the University of California Santa Barbara said, based on Vang's testimony in a 2011 program, that \"Though many of the people who have seen the film may have gotten a sense of satisfaction and joy from seeing that Walt overcame his racism, the people who acted as the Hmong members in the movie did not\" and that \"They were offended by the traces of racism that were included in the movie and that they experienced themselves on set\". Some Hmong on internet message boards had posted criticisms of the film. In 2020, Vang said, \"Hmong around the country were furious about its negative stereotypes and cultural distortions\" and that they confronted him when he spoke at events. Vang added that he engaged in \"explaining my obligation as an actor while also recognizing that, as a Hmong-American, I didn't feel that I could own the lines I was uttering.\" Vang has stated that he was uncomfortable with the reaction of white audiences to the film, finding their laughter at the playing off of racial slurs as humor \"unnerving\" and \"one more excuse for ignoring white supremacy and racism.\"\r\nPhilip W. Chung of AsianWeek said that Eastwood, portraying a white man, was the \"main weapon\" of the film even though screenwriter Nick Schenk \"does his best to portray Hmong culture and the main Hmong characters with both depth and cultural sensitivity\". Chung argued that \"Gran Torino might have been another \"'white man saves the day' story\" but that \"What Eastwood has really created is not a story about the white man saving the minority (though it can be read on that level and I'm sure some will) but a critical examination of an iconic brand of white macho maleness that he played a significant part in creating.\"\r\nAwards and nominations\r\nGran Torino was recognized by the American Film Institute as one of the Ten Best Films of 2008. Clint Eastwood's performance has also garnered recognition. He won an award for Best Actor from the National Board of Review, he was nominated for the Broadcast Film Critics Association (Critics' Choice Awards) and by the Chicago Film Critics Association Awards for Best Actor. An original song from the film, \"Gran Torino\" (performed by Jamie Cullum), was nominated for the Golden Globe Award for Best Original Song. The Art Directors Guild nominated Gran Torino in the contemporary film category.\r\nThe film, however, was ignored by the Academy of Motion Picture Arts and Sciences at the 81st Academy Awards when it was not nominated for a single Oscar, which led to heated criticism from many who felt that the Academy had also deliberately snubbed Revolutionary Road and Changeling (which Eastwood also directed) from the five major categories.\r\nIn 2010, the film was named Best Foreign Film at the César Awards in France.\r\nDerivative works\r\nMark D. Lee and Cedric N. Lee, two Hmong filmmakers from Detroit, directed a documentary called Gran Torino: Next Door, about how Bee Vang and Ahney Her were chosen for their roles in the film and the Hmong actors' off-set activities. It was released on Blu-ray. Vang acted in a YouTube parody of one scene in Gran Torino, titled \"Thao Does Walt: Lost Scenes from Gran Torino.\" The YouTube parody addresses a scene involving a barbershop, and the views of masculinity in the original scene.\r\nImpact\r\nFrom 2019 onwards, Gran Torino has been part of the focus topic \"The Ambiguity of Belonging\" in the German Abitur in Baden-Württemberg in the subject English.",
    "html": "<p>Gran Torino is a 2008 American drama film directed and produced by Clint Eastwood, who also starred in the film. The film co-stars Christopher Carley, Bee Vang, and Ahney Her. This was Eastwood's first starring role since 2004's Million Dollar Baby. The film features a large Hmong American cast, as well as one of Eastwood's younger sons, Scott. Eastwood's oldest son, Kyle, provided the score. Set in Highland Park, Michigan, it is the first mainstream American film to feature Hmong Americans. Many Lao Hmong war refugees resettled in the U.S. following the establishment of a socialist government in Laos in 1975.</p><p>The story follows Walt Kowalski, a recently widowed Korean War veteran alienated from his family and angry at the world. Walt's young neighbor, Thao Vang Lor, is pressured by his cousin into trying to steal Walt's prized 1972 Ford Torino for his initiation into a gang. Walt thwarts the theft and subsequently develops a relationship with the boy and his family.</p><p>Gran Torino opened in a limited theatrical release in the United States on December 12, 2008, before expanding wide on January 9, 2009. It grossed $270 million worldwide, making it Eastwood's second highest-grossing film to-date. The film received positive reviews from critics for Eastwood's direction and performance; within the Hmong community in the United States, the film was generally praised but also received criticism for its cultural inaccuracies.</p><br/><h3>Plot</h3><p>Cantankerous, bigoted Korean War veteran and retired Ford factory worker Walt Kowalski is widowed after 50 years of marriage. His aging neighborhood in Highland Park in Metro Detroit was formerly populated by working-class white families but has become filled with gang violence and poor southeast Asian immigrants, including Walt's next-door neighbors, the Vang Lor family. Adding to his isolation, Walt is emotionally detached from his family; he angrily rejects his son's suggestion he move to a retirement community and lives alone with his elderly labrador, Daisy. A chronic tobacco user, Walt suffers from coughing fits, occasionally with blood, which he conceals from his family. As requested by Walt's late wife, her priest, Father Janovich, tries to comfort Walt and persuade him to go to confession. Despite on multiple occasions being impolitely turned away by Walt, dismissing him as young and inexperienced, Father Janovich repeatedly tries to get through to him.</p><p>Walt catches Thao Vang Lor attempting to steal his Ford Torino as a coerced initiation into a Hmong gang run by Thao's cousin, \"Spider.\" Even after this failed attempt the gang nonetheless wants to take Thao with them, but Walt drives them off with his M1 Garand, earning the Hmong community's respect. As penance, Thao's mother makes him work for Walt, who has him do different jobs in the neighborhood. The two soon form a grudging mutual respect, and Walt mentors Thao, helping him obtain a construction job and giving him social and dating advice. Walt rescues Thao's sister, Sue, from the unwanted advances of three rough youths and bonds with her as well. Walt consults his doctor, who gives him a gloomy prognosis that he conceals from his family.</p><p>Spider's gang continues to pressure Thao and assaults him on his way home from work. Walt visits the gang's house and attacks a member as a warning. In retaliation, the gang rapes Sue and injures Thao in a drive-by shooting. The members of the community, including Sue, refuse to report the crimes out of fear. The following day, an enraged Thao seeks Walt's help to exact revenge; Walt convinces him to return later that day. Walt makes personal preparations: He mows his lawn, buys a suit, gets a haircut and finally makes his confession to Father Janovich.</p><p>Walt takes Thao to his basement and gives him his Silver Star, then tells him that he is still haunted by the memory of killing an enemy soldier who was ready to surrender and that he wants to spare Thao from becoming a murderer. He locks Thao in the basement and heads to the gang's residence. The gang members point their guns at Walt, who loudly berates them for their crimes, drawing the attention of the neighbors. Walt puts a cigarette in his mouth, slowly reaches into his jacket pocket and pulls his hand out quickly, as if he were drawing a gun. Thinking he is about to fire, the gang members shoot and kill him. Walt's hand opens to reveal his Zippo lighter with First Cavalry insignia — he was unarmed and sacrificed himself to save the Vang Lor family. Sue, following Walt's directions, frees Thao, and they drive to the scene in Walt's Gran Torino.</p><p>A police officer tells Thao and Sue that the gang members have been arrested for murder and the surrounding neighbors have all come forward as witnesses. Father Janovich conducts Walt's funeral, which is attended by his family and many of the Hmong community, puzzling his family. Afterward, Walt's last will and testament is read. Much to the surprise of Walt's family, Walt leaves his house to the church and his cherished Gran Torino to Thao, on the condition that Thao does not modify the car in any way. Sometime later, Thao drives the car along Detroit's Jefferson Avenue with Daisy at his side.</p><br/><h3>Cast</h3><ul><li>Clint Eastwood as Walt Kowalski</li><li>Bee Vang as Thao Vang Lor, a young Hmong teenager</li><li>Ahney Her as Sue Lor, Thao's older sister</li><li>Christopher Carley as Father Janovich</li><li>Doua Moua as Fong \"Spider,\" Thao's cousin</li><li>Sonny Vue as Smokie, Spider's right-hand man</li><li>Elvis Thao as Hmong Gangbanger No. 1</li><li>Brian Haley as Mitch Kowalski, Walt's older son</li><li>Brian Howe as Steve Kowalski, Walt's younger son</li><li>Geraldine Hughes as Karen Kowalski, Mitch's wife</li><li>Dreama Walker as Ashley Kowalski, Mitch and Karen's daughter</li><li>Michael E. Kurowski as Josh Kowalski, Mitch and Karen's son</li><li>John Carroll Lynch as Martin, an Italian American barber friend of Walt's</li><li>Chee Thao as Grandma Vang Lor, the matriarch of Thao's family</li><li>Choua Kue as Youa, Thao's eventual girlfriend</li><li>Scott Eastwood as Trey, Sue's date</li></ul><p>After holding casting calls in Fresno, California, Detroit, Michigan, and Saint Paul, Minnesota, Eastwood selected ten Hmong lead actors and supporting actors. Of them, only one was not a first time actor. Of the Hmong cast, five, including Bee Vang, one of the principal actors, were from the state of Minnesota. Ahney Her comes from Lansing, Michigan. The casting agency Pound & Mooney recruited thirty actors and over 500 extras. The firm recruited many Hmong actors from a Hmong soccer tournament in Macomb County, Michigan. Sandy Ci Moua, a Hmong actress based in the Twin Cities, assisted with the film's casting of Hmong actors.</p><br/><h3>Production</h3><p>Gran Torino was written by Nick Schenk and directed by Clint Eastwood. It was produced by Village Roadshow Pictures, Media Magik Entertainment and Malpaso Productions for film distributor Warner Bros. Eastwood co-produced with his Malpaso partners Robert Lorenz and Bill Gerber. Eastwood has stated he enjoyed the idea \"that it dealt with prejudice, that it was about never being too old to learn\".</p><p>Shooting began in July 2008. Hmong crew, production assistants, consultants, and extras were used. The film was shot over five weeks. Joel Cox and Gary D. Roach, the editors, cut the film so it was under two hours long. The crew spent over $10 million while shooting the film in Detroit.</p><p>In the early 1990s, Schenk became acquainted with the history and culture of the Hmong while working in a factory in Minnesota. He also learned how they had sided with the South Vietnamese forces and its US allies during the Vietnam War, only to wind up in refugee camps, at the mercy of North Vietnamese Communist forces, when US troops pulled out and the government forces were defeated. Years later, he was deciding how to develop a story involving a widowed Korean War veteran trying to handle the changes in his neighborhood when he decided to place a Hmong family next door and create a culture clash. He and Dave Johannson, Schenk's brother's roommate, created an outline for the story. According to Schenk, each night he used a pen and paper to write the script while in Grumpy's, a bar in Northeast Minneapolis, while not working at his day jobs. He recalled writing 25 pages within a single night in the bar. He recalled asking the bartender, who was his friend, questions about the story's progress. Some industry insiders told Schenk that a film starring an elderly main character could not be produced, as the story could not be sold, especially with an elderly main character who used language suggesting that he held racist views. Through a friend, Schenk sent the screenplay to Warner Bros. producer Bill Gerber. Eastwood was able to direct and star on the project as filming for Invictus was delayed to early 2009, leaving sufficient time for filming Gran Torino during the previous summer. Eastwood said that he had a \"fun and challenging role, and it's an oddball story.\"</p><p>According to Schenk, aside from changing Minneapolis references to Detroit references, the production headed by Eastwood \"didn't change a single syllable\" in the script. Schenk added that the concept of the producers not making any substantial revisions to a submitted script \"never happens.\" Eastwood said that he stopped making significant revisions after attempting to change the script of Unforgiven and later deciding to return to the original revision, believing that his changes were \"emasculating\" the product.</p><h4>Selection of Detroit for production and setting</h4><p>The original script was inspired by the Northeast community of Minneapolis, Minnesota, but filmmakers chose to shoot in Michigan, becoming one of the first productions to take advantage of the state's new law that provided lucrative incentive packages to film productions. Bill Huizenga, from Zeeland, Michigan, who once served in the Michigan House of Representatives, helped write and coordinate the State of Michigan's incentive package to the film creators. The film ultimately received a 42% tax credit. Bruce Headlam of The New York Times said \"That helped make it easy for Warner Bros. to sign off on bankrolling the movie, something that hasn’t always been a given in the studio’s relationship with the director.\"</p><p>Producer Robert Lorenz said that while the script was originally set in Minnesota, he chose Michigan as the actual setting as Kowalski is a retired car plant worker. Metro Detroit was the point of origin of the Ford Motor Company. Schenk said that sometimes the lines in the movie feel out of place with the Detroit setting; for instance a line about one of Walt's sons asks if Walt still knows a person who has season tickets for Minnesota Vikings games was changed to being about a person with Detroit Lions tickets. Schenk said \"They don't sell out in Detroit. And so that bothered me. It seemed really untrue to me.\"</p><h4>Shooting locations</h4><p>Locations, all within Metro Detroit, included Highland Park, Center Line, Warren, Royal Oak, and Grosse Pointe Park. The house depicting Walt Kowalski's house is on Rhode Island Street in Highland Park. The Hmong gang house is located on Pilgrim Street in Highland Park. The house depicting the residence of one of Walt's sons is on Ballantyne Road in Grosse Pointe Shores. The church used in the film, Saint Ambrose Roman Catholic Church, is in Grosse Pointe Park. The hardware store, Pointe Hardware, is also in Grosse Pointe Park. VFW Post 6756, used as the location where Walt meets friends to drink alcohol, is in Center Line.</p><p>The barber shop, Widgren's Barber Shop, is along 11 Mile Road, near Center Street, in Royal Oak. The shop, founded in 1938, in a space now occupied by another business, moved to its current location, west of its original location, in 1970. The film producers selected that shop out of 60 candidates in Metro Detroit. According to Frank Mills, the son-in-law of owner Ted Widgren, the producers selected it because they liked \"the antique look inside.\" Eastwood asked Widgren to act as an extra in the barber shop scene. In the area around the barbershop, vehicle traffic had to be stopped for three to five minutes at a time, so traffic in the area slowed down.</p><h4>Shooting and acting</h4><p>Of the entire cast, only a few were established actors; the Hmong actors had relatively little experience, and some were not proficient in English. Jeff Baenen said that Eastwood used a \"low-key approach to directing.\" Eastwood said that \"I’d give them little pointers along the way, Acting 101. And I move along at a rate that doesn’t give them too much of a chance to think.\" Bee Vang said that he originally felt fright, but was able to ease into the acting. Baenen said that Eastwood was a \"patient teacher\" of the first-time actors. According to Vang, Eastwood did not say \"action\" whenever filming a particular shoot began.</p><p>Vang said that he had studied the script as if it were a textbook. According to Vang, after the first film cut ended, Vang did not hear a response from Eastwood. When Vang asked if something was wrong, other people told Vang that if Eastwood did not make a comment, then his performance was satisfactory. Vang added that Eastwood encouraged ad-libbing with the Hmong actors. Ahney Her said that she liked the improvisation work, even when she was required to translate between the English and Hmong languages. When asked if the in-character racial slurs offended the actors in real life, Ahney said that she did not feel offense. Vang said, \"I was called so many names that I can’t say here because of how vulgar they were. It disturbed me quite a lot, but at the end of the day it was just a script.\"</p><p>Vang said in a 2011 program that Eastwood did not allow the Hmong actors to change their lines, despite what he said in the earlier interviews.</p><h4>Hmong people and culture during the production</h4><p>Nick Schenk said that he became friends with many Hmong coworkers while employed at a VHS factory in Bloomington, Minnesota. In regards to Schenk's stories of his interactions with the Hmong people, Laura Yuen of Minnesota Public Radio said \"That sense of humor and curiosity permeate the script, even though the Gran Torino trailers make the movie look like, by all measures, a drama.\"</p><p>Eastwood wanted Hmong as cast members, so casting director Ellen Chenoweth enlisted Hmong organizations and set up calls in Detroit, Fresno and Saint Paul; Fresno and Saint Paul have the two largest Hmong communities in the United States, while Detroit also has an appreciable population of Hmong. Chenoweth recruited Bee Vang in St. Paul and Ahney Her in Detroit.</p><p>The screenplay was written entirely in English. Therefore, the actors of Gran Torino improvised the Hmong used in the film. Louisa Schein, author of Hmong Actors Making History Part 2: Meet the Gran Torino Family, said before the end of production that \"some of the lines actors ad-libbed in Hmong on camera will be tricky to translate back for subtitles.\" Schenk had input from Hmong people when writing the script. Dyane Hang Garvey served as a cultural consultant, giving advice on names, traditions, and translations.</p><p>Vang later argued that the use of the Hmong people did not seem relevant to the overall plot. He said \"there is no real reason for us to be Hmong in the script\" and that even though Walt Kowalski had fought in Korea, he had still confused the Hmong with Koreans and other Asian ethnic groups. In a 2011 program Vang said that Hmong actors were treated unfairly on the set, and that Eastwood did not give tips on how to build the characters. Vang also claimed other white cast members made Hmong actors feel excluded by assuming the Hmong speakers did not understand English. Vang said that some important lines that the Hmong characters said in the Hmong language were not subtitled, so audiences developed a skewed perception of the Hmong people.</p><h4>Cultural accuracies and inaccuracies</h4><p>Bee Vang, as paraphrased by Jeff Baenen of the Associated Press, said in 2009 that the film's portrayal of the Hmong is \"generally accurate.\" Regarding the result, Vang said \"his film is not a documentary. We can't expect 101 percent correctness.\"</p><p>During the filming, Hmong cast members addressed what they believed to be cultural inaccuracies that were being introduced. Cedric Lee, a half-Hmong who worked as a production assistant and a cultural consultant, said that \"Some things were over-exaggerated for dramatic purposes. Whether it was our job or not, I still felt some responsibility to speak our mind and say something, but at the same time, the script was what it was. We didn’t make the final decision.\"</p><p>In 2011, Vang said while many Hmong had objected to some elements, the producers selected the viewpoints of the Hmong cultural consultants which \"had the most amenable take on the matter and would lend credence to whatever Hollywood stereotypes the film wanted to convey.\" Vang further said that \"this was a white production, that our presence as actors did not amount to control of our images.\"</p><p>Louisa Schein and Va-Megn Thoj, authors of \"Gran Torino’s Boys and Men with Guns: Hmong Perspectives,\" said \"Perhaps the most commonly voiced Hmong objections to the film concern its myriad cultural inaccuracies, exaggerations and distortion.\" Schein also said that \"he actors struggle, too, with their culture being made into spectacle.\" Even though a real Hmong shaman acts as a Hmong shaman in the film, Schein said that \"his expertise was overridden by the screenplay and the filming, which distorted the ceremonial scenes by making them inaccurately exotic.\" Vang said that the tea ceremonies depicted in the film were not correctly performed. Even though, in the film, Hmong characters feel offense when Walt touches a girl on the head, Schein said that in real life in Hmong culture it is okay to touch a person on the head. In other segments of the film, the Hmong shaman touches a baby's head without any negative criticism. Schein adds that Spider touches Thao Vang Lor's head \"without consequence.\" Christine Wilson Owens, author of \"Hmong Cultural Profile,\" said \"Most traditional Hmong elders, especially men, do not want strangers to touch their heads, or those of their children, due to their religious beliefs and personal values.\"</p><p>Thao and Sue Lor wear Hmong clothing to Walt Kowalski's funeral. Hmong do not ordinarily wear traditional Hmong clothing to funerals. Grandma Lor spits a betel nut she had been chewing to show contempt for Walt Kowalski, even though the Hmong do not chew betel nuts. The Hmong shaman reads Walt's personal character, when in real life he would communicate with the spirit world. In the film the shaman himself does a sacrifice of a chicken in a manner that Schein and Thoj say is \"in dramatic ceremonial fashion,\" when in real life an assistant would do this \"perfunctorily.\" The authors said that the hu plis ceremony done in honor of the baby has an incorrect spatial layout, that the clothing and grooming of the Hmong gangs is not correct, and \"the obsequious making of offerings on doorstep\" are not accurate. While Thao himself cleans dishes, Schein and Thoj add that he would not do this alone because he is in a house with other female family members. Schein and Thoj also add that there is \"inconsistent use of the two Hmong dialects within one family.\" They also argue that members of a Hmong clan would not show aggression towards a member of a fellow clan and that they would not rape a member of their own clan, like the gang in the film rapes Sue. Sharon Her, a Hmong writer from New York, argued that the film had \"confusion of Asian customs\" and that \"Hmong people do not use favors as a method of atonement nor do they endlessly shower individuals with gifts out of gratitude.\" Her added, \"An early draft of the script even had names misspelled and referenced Chinese surnames, a sloppy mistake that was easily corrected.\"</p><br/><h3>Release</h3><h4>Theatrical</h4><p>In the film's opening weekend of wide release in the US, it grossed $29.5 million. As of 2021, it has taken in $269,958,228 worldwide.</p><h4>Home media</h4><p>The film was released on June 9, 2009, in the United States in both standard DVD format and Blu-ray. The disc includes bonus materials and extra features. A featurette is included and a documentary about the correlation of manhood and the automobile. The Blu-ray version presents the film in 2.40:1 ratio format, a digital copy, and the audio in multiple languages.</p><p>About 4 million DVD units have been sold as of 2012, generating $67.4 million in revenue. Another 332,000 Blu-rays were sold, for $4.9 million, bringing the total to $72.3 million in home video sales.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Rotten Tomatoes reports that 81% of 237 surveyed critics gave the film positive write-ups; the average score is 7.10/10. The site's consensus states: \"Though a minor entry in Eastwood's body of work, Gran Torino is nevertheless a humorous, touching, and intriguing old-school parable.\" At Metacritic, which assigns a weighted average score out of 100 to reviews from mainstream critics, the film has received an average score of 72 based on 34 reviews. Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.</p><p>After seeing the film, The New York Times described the requiem tone captured by the film, calling it as \"a sleek, muscle car of a movie made in the USA, in that industrial graveyard called Detroit\". Manohla Dargis compared Eastwood's presence on film to Dirty Harry and the Man with No Name, stating: \"Dirty Harry is back, in a way, in Gran Torino, not as a character, but as a ghostly presence. He hovers in the film, in its themes and high-caliber imagery, and of course, most obviously, in Mr. Eastwood's face. It is a monumental face now, so puckered and pleated that it no longer looks merely weathered, as it has for decades, but seems closer to petrified wood.\"</p><p>The Los Angeles Times also praised Eastwood's performance and credibility as an action hero at the age of 78. Kenneth Turan said of Eastwood's performance, \"It is a film that is impossible to imagine without the actor in the title role. The notion of a 78-year-old action hero may sound like a contradiction in terms, but Eastwood brings it off, even if his toughness is as much verbal as physical. Even at 78, Eastwood can make 'Get off my lawn' sound as menacing as 'Make my day', and when he says 'I blow a hole in your face and sleep like a baby', he sounds as if he means it\".</p><p>Roger Ebert wrote that the film is \"about the belated flowering of a man's better nature. And it's about Americans of different races growing more open to one another in the new century.\" Sang Chi and Emily Moberg Robinson, editors of Voices of the Asian-American and Pacific Islander Experience: Volume 1, said that within the mainstream media, the film received \"critical acclaim\" \"for its nuanced portrayal of Asian Americans.\" Louisa Schein and Va-Megn Thoj, authors of \"Gran Torino's Boys and Men with Guns: Hmong Perspective,\" said that the mainstream critical response was \"centered on Eastwood's character and viewed the film mainly as a vision of multicultural inclusion and understanding.\"</p><p>Nicole Sperling, columnist for Entertainment Weekly, called it a drama with \"the commercial hook of a genre film\" and described it further as \"a meditation on tolerance wrapped in the disguise of a movie with a gun-toting Clint Eastwood and a cool car\". Chi and Robinson said that within the Asian-American community, some criticized \"depictions of Hmong men\" and \"the archetypical white savior trope that permeated the film\".</p><h4>Reception in relation to the Hmong</h4><p>Clint Eastwood's decision to cast Hmong actors, including amateur actors, received a positive reception in Hmong communities. Tou Ger Xiong, a Hmong storyteller and performance artist from the Minneapolis-St. Paul area who had auditioned for a role in the film, said that he had respect for the film because the producers actually cast Hmong instead of asking other Asian-Americans to mimic Hmong. Xiong also argued \"First things first, let's get our foot in the door. Complain later.\" Dyane Hang Garvey, who served as a cultural consultant for the film production, said that the film was not intended to be a documentary on the Hmong people and that it positively highlights, as paraphrased by Laura Yuen of Minnesota Public Radio, \"the close-knit nature of the Hmong community in Detroit\". Doua Moua, a Hmong actor in the film, said that he had no regrets in playing a gang member, because, in Yuen's words, \"gangs consumed his brother's life while they were growing up in Saint Paul\". Moua added that many first generation Hmong are affected by gangs and drift into gangs due to a lack of father figures.</p><p>Louisa Schein, a Rutgers University anthropologist who is an expert on the Hmong culture, approved the concept of Hmong achieving visibility in the popular culture of the United States, but believed that the film may be promoting out of date stereotypes of the Hmong. Schein said that her Hmong friends were \"touched\" by the film's portrayal of Hmong culture redeeming and reaching out to Walt Kowalski.</p><p>Schein further added that the film seemed to give little prominence to the history of the Hmong, and that only two male Hmong, Thao and a gang member, were given depth in the story. Schein said \"I feel a lot of the plot about the Eastwood character is driven by the fact that he is a veteran. Yet there is no possibility for representing the fact that the Hmong were veterans too.\" An individual established a blog, eastwoodmovie-hmong.com, documenting what the author believed to be cultural inaccuracies of the film's depiction of the Hmong.</p><p>David Brauer of MinnPost said that some Hmong liked Gran Torino and that many believed that the film was offensive. In 2009, actor Bee Vang said that he was satisfied with the outcome of the film. Brauer said that in an opinion editorial released in 2011, Vang \"isn't kind to the Clint Eastwood film\". Krissy Reyes-Ortiz of The Bottom Line of the University of California Santa Barbara said, based on Vang's testimony in a 2011 program, that \"Though many of the people who have seen the film may have gotten a sense of satisfaction and joy from seeing that Walt overcame his racism, the people who acted as the Hmong members in the movie did not\" and that \"They were offended by the traces of racism that were included in the movie and that they experienced themselves on set\". Some Hmong on internet message boards had posted criticisms of the film. In 2020, Vang said, \"Hmong around the country were furious about its negative stereotypes and cultural distortions\" and that they confronted him when he spoke at events. Vang added that he engaged in \"explaining my obligation as an actor while also recognizing that, as a Hmong-American, I didn't feel that I could own the lines I was uttering.\" Vang has stated that he was uncomfortable with the reaction of white audiences to the film, finding their laughter at the playing off of racial slurs as humor \"unnerving\" and \"one more excuse for ignoring white supremacy and racism.\"</p><p>Philip W. Chung of AsianWeek said that Eastwood, portraying a white man, was the \"main weapon\" of the film even though screenwriter Nick Schenk \"does his best to portray Hmong culture and the main Hmong characters with both depth and cultural sensitivity\". Chung argued that \"Gran Torino might have been another \"'white man saves the day' story\" but that \"What Eastwood has really created is not a story about the white man saving the minority (though it can be read on that level and I'm sure some will) but a critical examination of an iconic brand of white macho maleness that he played a significant part in creating.\"</p><h4>Awards and nominations</h4><p>Gran Torino was recognized by the American Film Institute as one of the Ten Best Films of 2008. Clint Eastwood's performance has also garnered recognition. He won an award for Best Actor from the National Board of Review, he was nominated for the Broadcast Film Critics Association (Critics' Choice Awards) and by the Chicago Film Critics Association Awards for Best Actor. An original song from the film, \"Gran Torino\" (performed by Jamie Cullum), was nominated for the Golden Globe Award for Best Original Song. The Art Directors Guild nominated Gran Torino in the contemporary film category.</p><p>The film, however, was ignored by the Academy of Motion Picture Arts and Sciences at the 81st Academy Awards when it was not nominated for a single Oscar, which led to heated criticism from many who felt that the Academy had also deliberately snubbed Revolutionary Road and Changeling (which Eastwood also directed) from the five major categories.</p><p>In 2010, the film was named Best Foreign Film at the César Awards in France.</p><h4>Derivative works</h4><p>Mark D. Lee and Cedric N. Lee, two Hmong filmmakers from Detroit, directed a documentary called Gran Torino: Next Door, about how Bee Vang and Ahney Her were chosen for their roles in the film and the Hmong actors' off-set activities. It was released on Blu-ray. Vang acted in a YouTube parody of one scene in Gran Torino, titled \"Thao Does Walt: Lost Scenes from Gran Torino.\" The YouTube parody addresses a scene involving a barbershop, and the views of masculinity in the original scene.</p><br/><h3>Impact</h3><p>From 2019 onwards, Gran Torino has been part of the focus topic \"The Ambiguity of Belonging\" in the German Abitur in Baden-Württemberg in the subject English.</p><br/>"
  },
  "errorMessage": ""
}