{
  "imDbId": "tt0086879",
  "title": "Amadeus",
  "fullTitle": "Amadeus (1984)",
  "type": "Movie",
  "year": "1984",
  "items": [
    {
      "publisher": "L.A. Weekly",
      "author": "F. X. Feeney",
      "link": "",
      "rate": "100",
      "content": "Remains the most popularly successful film ever to render the inner life of an artist."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "https://www.chicagotribune.com/entertainment/things-to-do/",
      "rate": "100",
      "content": "It still soars, but now it seems richer, more expansive. Amadeus reminds us that movies can be lyrical as well as vulgar, ambitious as well as playful, brilliant as well as down and dirty -- just like Amadeus himself."
    },
    {
      "publisher": "New Times (L.A.)",
      "author": "Gregory Weinkauf",
      "link": "http://www.newtimesla.com/",
      "rate": "100",
      "content": "One of the finest qualities of Amadeus is that it reminds us of those rare occasions when an Oscar sweep is actually merited."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "100",
      "content": "Perfect pitch."
    },
    {
      "publisher": "New York Daily News",
      "author": "Jack Mathews",
      "link": "",
      "rate": "100",
      "content": "Amadeus is about as close to perfection as movies get."
    },
    {
      "publisher": "",
      "author": "The A.V. Club",
      "link": "http://survey-smiles.com/",
      "rate": "90",
      "content": "The superbly edited original version of Amadeus used overlapping sound cues for a lively flow between scenes, and the new version breaks up some of that flow with lengthy, talky interludes. Still, Ondrícek's breathtaking images and Forman's essential craft are best appreciated on the big screen, and another theatrical run for Amadeus is a welcome gift, no matter how much this edition unnecessarily gilds what's already a near-perfect lily"
    },
    {
      "publisher": "Baltimore Sun",
      "author": "Michael Sragow",
      "link": "https://www.baltimoresun.com/entertainment/movies/bal-to.amadeus26apr26.story?coll=bal%2Dartslife%2Dmovies",
      "rate": "83",
      "content": "Except for the Mozart music and Tharp movements around the edges, Amadeus plays like a monument to mediocrity. The movie belongs to Salieri."
    },
    {
      "publisher": "Portland Oregonian",
      "author": "",
      "link": "",
      "rate": "83",
      "content": "The big-screen reissue offers a rare chance to admire the marvelous production details."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Liam Lacey",
      "link": "",
      "rate": "75",
      "content": "Amadeus needs an additional 20 minutes running time like \"The Magic Flute\" needs a drum solo. Though the production is gussied up with more frills and decoration than a Viennese dessert trolley, Forman is generally workmanlike in his visual style and very uneven with his handling of actors."
    },
    {
      "publisher": "Chicago Reader",
      "author": "",
      "link": "",
      "rate": "60",
      "content": "It binds up introductory lessons in music appreciation, Freudian psychology, and fanciful history with a pulp thriller plot."
    }
  ],
  "errorMessage": ""
}