{
  "imDbId": "tt0086879",
  "title": "Amadeus",
  "fullTitle": "Amadeus (1984)",
  "type": "Movie",
  "year": "1984",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0208335",
      "warningSpoilers": false,
      "date": "16 November 2003",
      "rate": "10",
      "helpful": "54 out of 58 found this helpful.",
      "title": "One of those movies that you'll never forget",
      "content": "I remember as a child, my sister told me to watch this film. That it was the best film she ever saw. I didn't watch it until I turned 10; finally I sat myself down and watched it. I fell in love with it.Based on the life of Wolfgang Amadeus Mozart, played a terrific and hilarious performance by Tom Hulce. This also has the life of Antonio Salieri, a great and well deserved Oscar winning performance by F. Murray Abraham. Despite the story not being accurate, come on! This is a great movie that was a gigantic Oscar waiting to happen. Congrats to Amaudeus for bringing the beauty of classical music into out living rooms.The story is that we start off with an older and more suicidal Salieri who blames himself for Mozart's death. When a priest comes to ask Salieri to plead forgiveness to the lord and wants to council him, Salieri describes who he was and how music inspired his life, he plays a few notes from his opera's that were masterpieces, the priest just looks at him not knowing the music. Salieri just looks at him with a smile and says \"Ah, how about...?\", he plays Mozart's most famous work and the priest gets excited saying \"Oh, how charming! I'm sorry, I didn't know you wrote that!\" smiling and knowing how it will please Salieri, Salieri just looks at him with a emotionless face \"I didn't. That was Mozart, Wolfgang Amadeus Mozart\" and you see the priest's embarrassment. Just great and a perfectly played out performance by Abraham and Frank.Tom Hulce gives Mozart this crazy and annoying yet nevertheless funny laugh that you can't help but laugh at it every time he does it. He brings such life to Mozart and an immaturity that I think some of us can relate too in being spoiled and always knowing you're the best at your talent. He marries Constanze played by Elizabeth Berridge and she does it remarkably well. Constanze is obviously the more mature one and is the only woman who can try to tame Mozart's crazy ways. When Salieri gets a little jealous that the emperor played by an under rated Jeffrey Jones, since he is the emperor's tutor, then the emperor demands more of Mozart and his music. Salieri vs. Mozart: on the next celebrity death match!\"Amadeus\" is a fantastic movie that anyone could easily love and enjoy. It's definitely a must see for movie fans and anyone in general who is just looking for a good movie. This was the best picture of 1984 and it's well deserved, just trust me and the awesome reviews it's getting!10/10"
    },
    {
      "username": "possumopossum",
      "userUrl": "https://www.imdb.com/user/ur9780741",
      "reviewLink": "https://www.imdb.com/review/rw1531034",
      "warningSpoilers": true,
      "date": "26 November 2006",
      "rate": "9",
      "helpful": "134 out of 146 found this helpful.",
      "title": "The Movie That Made Me Appreciate Mozart",
      "content": "Before I saw this movie, I respected Mozart's genius, but his music wasn't my cup of tea. Beethoven was more to my taste, I tended more toward heavier classics. But this movie moved me to tears, especially at the end when they did Mozart's REQUIEM while he was working on what was to be his last piece of music. Now, I'm a Mozart fiend. This was a great movie. True, there are some historical inaccuracies. Anyone who has studied music history knows that Sallieri did not help Mozart with his Requiem. It was a student of his named Sussmayer. But it does make this story ironic, that the man who was so dedicated to the ruination of Mozart ended up helping him in the end. (I question the historical accuracy of that as well.) I recently bought the director's cut to this movie. Until I saw the director's cut, Sallieri seemed like a more sympathetic character, someone who just couldn't buy a break. Who can't identify with that? But after seeing the director's cut and seeing what I think is an important scene between Sallieri and Mozart's wife, he seemed more like a jerk. You also understand why Frau Mozart was so rude to Sallieri at the end of the movie, whereas before, you see the next to the last scene and you think, \"Whoa! Where did this come from?\" This was a great movie, for entertainment value only. If you want historical accuracy, watch a documentary or read a biography from the library or something. Because of this movie, I am now a rabid Mozart fan. If the movie can make Mozart converts, then it can't be bad at all."
    },
    {
      "username": "miknnik",
      "userUrl": "https://www.imdb.com/user/ur4690600",
      "reviewLink": "https://www.imdb.com/review/rw1587248",
      "warningSpoilers": false,
      "date": "30 January 2007",
      "rate": "10",
      "helpful": "119 out of 123 found this helpful.",
      "title": "True Gem for Movie and Music Fans",
      "content": "I'd like to point out a few facts before I review the movie. First of all, Mozart died at home surrounded by his family, pupil and a priest. Secondly, the plot of Amadeus is not exactly original. Rimsky-Korsakov wrote a short opera called \"Mozart and Salieri\" with the bare bones of the story and the identical characterization of the two composers, and he used Pushkin's drama for the libretto. So, the rumor that Salieri killed Mozart has been around for almost a couple of centuries though we all know there isn't an iota of veracity in it.That being said, Peter Shaffer's movie adaptation of his own play is still an astounding achievement. Have you ever seen a movie based on your favorite book and come out of the movie theater rather disappointed though the film version faithfully followed the storyline of the book? Amadeus is definitely not one of those movies. Shaffer clearly understands the difference between stage and film; the story is more elaborate in the movie, and some of the lengthy lines are replaced with more subtle images and close-ups.I'm often surprised to find that people don't get that Amadeus is the story of the fictionalized character, Antonio Salieri, not the real one, who adored Mozart's music but hated everything else about him. In other words, the movie viewers are seeing Mozart through Salieri's eyes. Needless to say, his view is rather slanted. If you have read Shaffer's original play, you probably remember he describes Mozart's laugh 'grating.' In the film, this annoying laugh becomes more symbolic. Though Salieri speaks in front of a Catholic priest, he is actually having a one-sided discourse with God. At one point, he declares, \"One day, I will laugh at you. Before I leave this earth, I will laugh at you.\" But as he is wheeled out of his room by an aide at the asylum, what we hear is that screeching laugh of Mozart--or is it? It becomes obvious as we watch that this movie is called Amadeus because that's what Salieri wished to be--God's beloved.The movie might give some viewers who don't know much about Mozart a wrong impression that he was a cad, and it gives incorrect information on some of his music (e.g.; the count in The Marriage of Figaro sings \"Contessa perdono\" AFTER he learns that the woman dressed in the maid's clothes is his own wife. There's no mistaken identity here. Read the title of the song--Countess, forgive me!), but these are minor offenses. Though I am a die-hard Mozart fan, I can laugh at tongue-in-cheek references to Amadeus in other movies. My favorite? In Guarding Tess, a secret service agent tells his partner, \"He (Mozart)'s a jerk. One day, a guy shows up with a mask, and he drops dead.\" What's not to like about Amadeus? The tale Peter Shaffer tells is gripping, the actors are first- rate, and, of course, there's music. The selection of Mozart's music in the movie is excellent; you can truly enjoy the beauty of his music no matter how much or how little you know about it. In case you are wondering, a little tune Mozart plays on his back and hands crossed as a penalty at a party is Viva Bacchus from The Abduction from the Seraglio, a duet for Pedrillo and Osmin. Pedrillo, while singing this song, is trying to get Osmin, the harem guard, drunk to help his master rescue his true love. No wonder Schikaneder calls it 'our song.' And the improvised version of Salieri's welcome march is actually a famous song, Non piu andrai farfallone amoroso, from The Marriage of Figaro.As I said, I'm a huge Mozart fan, so my rating may be somewhat biased, but what the heck, I gladly give ten stars to Amadeus. I watched it close to a hundred times over the years, and it still gives me a great pleasure every time I see (and hear) it."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2217648",
      "warningSpoilers": false,
      "date": "7 March 2010",
      "rate": "10",
      "helpful": "22 out of 26 found this helpful.",
      "title": "Absolutely brilliant!- funny, charming and touching, a masterpiece!",
      "content": "I adore classical music, and Mozart is one of my favourite composers. When I came across Amadeus in my local charity shop, I knew I had to buy it. I watched it, and I loved it from start to finish. It is true it is not necessarily a true depiction of Mozart's life, but I was so blown away by the quality of the acting, sets, costumes and music that I forgot about that. The film is just gorgeous to look at, Vienna in the film (Prague in real life) looks beautiful, but the sets and costumes are colourful and lavish. The music is utterly majestic, from the Marriage of Figaro, Queen of the Night(brilliantly sung in what is one of the most difficult colouratura arias ever), Requiem in D minor to Don Giovanni, it was a feast to the ears. The script I thought was of exceptional quality particularly during the finale of Marriage of Figaro(one of the most beautiful tender moments in any opera is where the countess forgives her husband), and the direction was very fine. As many reviewers have pointed out, this is more about the mediocrity and envy of Salieri than it is of the eccentric genius of Mozart, thus the story was compelling and intriguing. The acting is wonderful; Tom Hulce is excellent as Wolfgang Amadeus Mozart, yeah his laugh is a tad grating, but I loved the manic and eccentric interpretation Hulce gave. Elizabeth Berridge is suitably petite and alluring as wife Constanze while Jeffrey Jones is delightful as Emperor Joseph II. For me though, F Murray Abraham gave the film's best performance, for he was absolutely outstanding as Salieri. Overall, brilliant film, gorgeous to watch, amazing music and essentially a must see! 10/10 Bethany Cox"
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2192530",
      "warningSpoilers": false,
      "date": "16 January 2010",
      "rate": "9",
      "helpful": "22 out of 27 found this helpful.",
      "title": "To give everything you have to music and come up short",
      "content": "At the tender age of 26, when I still thought no film was complete without a car chase and a big explosion, Amadeus had me hooked. I went to see it multiple times back in 1984 during its initial release, back when the theater was empty whenever it played and before it was nominated by the Academy.This film is an unusual biography, and I often like to compare it with Ed Wood, since both Ed Wood and Salieri were men who gave everything they had to their respective crafts and came up short. Salieri, a contemporary of Mozart, has only one dream - to be a great composer. Predating the prosperity gospel by about two hundred years, Salieri mistakes obsessing with God over his own earthly desires with actual godliness, even being happy when his father - who objects to Salieri's musical interests - chokes to death and leaves Salieri free to pursue his musical dreams. He chalks this up to God's will for his career. Problems begin when Salieri meets a twenty-something Mozart at the court of the Emperor in Vienna, where Salieri is the court composer. Mozart is everything Salieri is not - profane, forward, and a great composer. Salieri starts down the road to insanity as he realizes the childish Mozart has all of the gifts he ever wanted and has been denied. However, Salieri is not an outright failure as was Ed Wood. In many ways he is something worse than a ridiculous failure - he is mediocre, and worse yet, he knows it.Salieri,angry at God for honoring a profane ungrateful boy like Mozart while ignoring his own one desire to be a great composer, swears to destroy Mozart. The strange thing is, as long as Mozart is alive, Salieri is the honored composer, not Mozart, though this just seems to infuriate Salieri even more. Salieri seems to be the only person in Vienna who recognizes Mozart's talent. This just begs the question - why did it never occur to Salieri that being able to recognize something as valuable before anyone else does is a talent in and of itself? After all, in 1975 the second best thing to being Bill Gates would have been to have recognized his genius and invested heavily in his success. But I digress.The cinematography and art direction on this film are outstanding. The visuals start out light and festive, matching Mozart's mood and prospects. As poverty, illness, and the guilt of his father's death close in on Mozart during the second half of the film, the mood and visuals become very dark to match what is happening in Mozart's own life. Highly recommended."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0208238",
      "warningSpoilers": false,
      "date": "26 September 2000",
      "rate": "",
      "helpful": "99 out of 138 found this helpful.",
      "title": "Dominant Best Picture Winner of 1984",
      "content": "\"Amadeus\" is a great film that is deep, thought-provoking, and overall exceptional. The film deals with the last few months of Wolfgang Amadeus Mozart's (Oscar-nominee Tom Hulce) life, told in flashbacks by an old, washed-up musician named Antonio Salieri (Oscar-winner F. Murray Abraham). Salieri tells of the genius, the ingenuity, and the insanity of the young musician who died mysteriously at the age of 35. Salieri's jealousy may have led him to kill the young composer, but that is something that will never be known. \"Amadeus\" is an interesting commentary that tries to fill holes in history and succeeds amazingly. By mixing fact and probable fiction, the film-makers succeeded in creating a truly remarkable motion picture that is easily one of the best of the 1980s. 5 stars out of 5."
    },
    {
      "username": "JamesHitchcock",
      "userUrl": "https://www.imdb.com/user/ur2955724",
      "reviewLink": "https://www.imdb.com/review/rw2305234",
      "warningSpoilers": false,
      "date": "3 September 2010",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "The Patron Saint of Mediocrities",
      "content": "Most films about composers- Ken Russell's \"The Music Lovers\" about Tchaikovsky and \"Immortal Beloved\" about Beethoven are examples- rely upon the cliché of the creative artist as tortured, neurotic genius. Perhaps we like to console ourselves for the fact that we are not ourselves geniuses with the thought that genius must be paid for in mental suffering. Of course, not all composers fit this stereotype- Haydn was stoical in the face of misfortune (including a miserably unhappy marriage), Rossini was a noted bon viveur and it was often said of Felix Mendelssohn that his forename (Latin for \"happy\") well suited his character. But when did you last see a biopic of Haydn, Rossini or Mendelssohn? \"Song of Norway\" told the story of Grieg, another composer who doesn't really fit the \"tormented genius\" label, but it bombed at the box-office. \"Amadeus\", however, attempts to overturn this cliché with a vengeance. The Mozart portrayed in the early scenes is about the least tormented genius who ever lived, obnoxiously hearty and cheerful, without the slightest doubt about his own talents. The tormented character is his rival, Antonio Salieri, but Salieri is no genius; in his own mind he is a hopeless mediocrity whose talents pale into insignificance besides Mozart's. The story is told as a confession made by the now elderly, half- mad Salieri to a priest in 1823, long after Mozart's death, the earlier scenes being seen in flashback. As a young man, the deeply pious Salieri vows that if God will make him a great composer he will live a chaste, virtuous life and use his talents to God's glory. At first Salieri believes that his vow has been accepted. He quickly achieves fame and is appointed Court Composer to Emperor Joseph II. When Mozart arrives in Vienna, however, Salieri realises that the young man's music has a transcendent beauty which his own can never match. Salieri's attitude towards his rival is not one of simple jealousy. Were Mozart a man of his own austere, puritanical stamp Salieri would not resent him nearly so much. Mozart, however, is very far from being puritanical. He is not a bad man, but he is very young, and his are a young man's faults- brashness, overweening self-confidence, a bawdy sense of humour, a keen eye for a pretty girl and a lack of respect for authority. (Actually, those last two are not really faults at all). His most irritating characteristic is his high-pitched laugh like a braying jackass. In Salieri's eyes, however, Mozart is a vulgar upstart, a smutty, sex-obsessed boy. Salieri believes that God has cheated him, by denying him the musical talent he deserves and giving it to an unworthy recipient. (The title is an appropriate one; Amadeus was not only Mozart's middle name but is also Latin for \"beloved of God\"). Salieri therefore plots a diabolical revenge against both Mozart and God. The director Milo Forman took the brave decision to cast little-known actors in the three main roles, F. Murray Abraham as Salieri, Tom Hulce as Mozart and Elizabeth Berridge as Mozart's beautiful young wife Constanze. In each case, however, that decision paid off admirably. Constanze has sometimes had a bad press from biographers, but here Berridge portrays her as strong-willed but loving and kind-hearted. Both Abraham and Hulce were nominated for \"Best Actor\" Oscars, and it was Abraham who won. Good as Abraham is as the gloomy, saturnine Salieri, a man eaten up with obsessive hatred, I still think that Hulce should have beaten him. There is a remarkable contrast between the brash young jackass of the early scenes and the Mozart of the later ones- a more mature, serious family man who has learnt the meaning of responsibility and who is for the first time starting to experience worries- about his finances, about his health, about his career. Hulce's achievement is that he not only makes these two Mozarts equally believable but also indicates that they are not two distinct individuals but rather two aspects of the same complex personality. There are also good performances from Jeffrey Jones as the conscientious but bumbling and musically tone deaf Emperor Joseph and Roy Dotrice as Mozart's autocratic father Leopold.\"Amadeus\" is not, and is not intended as, a factually accurate biopic of Mozart. As Peter Shaffer, who wrote both the screenplay and the play on which it was based, was well aware, there is no real evidence that Salieri was obsessively jealous of Mozart, and absolutely none to support the old legend that he murdered him. He was not in reality a celibate puritan- he had a wife, eight children and a mistress. Shaffer uses this legend as the basis of a fictional story which explores complex questions about the nature of artistic creativity and the relationship between man and God. The film, deservedly, won the \"Best Picture\" Oscar for 1984; indeed, it is in my view one of the finest films of the eighties. It works on a number of levels- as a lavish piece of \"heritage cinema\" recreating the Europe of the late 18th century (the sets and costumes are particularly fine), as an intellectual exploration of philosophical issues, as a well-acted human drama, as a fictionalised study of a great man. The soundtrack is heavenly, but that is only to be expected, containing as it does some of Mozart's greatest music. The film has had a curious side effect. It could have condemned Salieri to perpetual infamy as a jealous minor composer who was supposedly responsible for the death of a great one. Instead, it seems to have led to a revival of interest in his work; he is certainly better known today than he was in 1984. Many musicians would now regard him as something far more than the \"patron saint of mediocrities\". God may have answered Salieri's prayers long after his death. 10/10"
    },
    {
      "username": "OriginalMovieBuff21",
      "userUrl": "https://www.imdb.com/user/ur3341647",
      "reviewLink": "https://www.imdb.com/review/rw0208362",
      "warningSpoilers": false,
      "date": "27 September 2004",
      "rate": "10",
      "helpful": "86 out of 119 found this helpful.",
      "title": "An Excellent film of describing Mozart's life from wealthy with great fame that shatters in pieces",
      "content": "Amadeus is one tremendous film. The acting was great. Tom Hulce did wonderful and I have only seen him once in a film and that was Animal House. The rest of the cast was great to like F. Murry Abraham did a terrific job in his performance. The music was brilliant, I have never seen a film with such great performances in their plays. I really did admire this movie, everything in it was very interesting and after I watched the film I did a little research on Mozart. The script and directing was superb and the cinematography was brilliant. I couldn't of asked for a better film than Amadeus. I'm glad I saw this film!Hedeen's outlook: 10/10!! **** A+"
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3528652",
      "warningSpoilers": true,
      "date": "20 August 2016",
      "rate": "9",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Rock me Amadeus! Amadeus is a beautiful musical masterpiece",
      "content": "Extraordinary! On the page it looked nothing! The beginning simple, almost comic. Just a pulse. And then, suddenly, high above it, beautiful music. A single note, hanging there, unwavering. Until a clarinet took it over, sweetened it into a phrase of such delight! This was no composition by a performing monkey! This was a music I had never heard. Filled with such longing, such unfulfillable longing. It seemed to me that I was hearing the voice of God. Director Milos Forman's Best Picture winning drama was indeed a masterpiece. Based on Peter Shaffer's extravagant 1980 Broadway play with the same name. The film tells a fictionalized biography of tortured genius and Viennese child prodigy Wolfgang Amadeus Mozart (Tom Hulce). Also, the story was presented in a way that was very unique at the time. It was through the eyes of fellow jealous composer Antonio Salieri (F. Murray Abraham) who finds the deeply crude and childish behavior of Mozart, unworthy of such praise. Driven by his attempt to outshine Mozart, Salieri must find a way to gain the audience of the Austrian Aristocrats, before it's too late. Without spoiling the movie, too much, a lot of people had complain that this movie wasn't historical accuracy. In my opinion, a lot of this criticize wasn't needed. To the film credit, Amadeus never claims to be a true story. It's normal for films like this, to sometimes diverge from historical facts in order to explore more fundamental and universal human issues and to achieve a dramatic effect. Yet, the film had more fact than fiction than most people are willing to taken. It did a lot of homework to get, as accuracy as possible. So, when I hear, some of the main complains that the critics point out about the film. I had to question, their short-temper justice. I felt like they were misinform. Many of the so-call historical inaccuracies were somewhat true. It's true that Antonio Salieri later claims he killed Mozart. Even Mozart toward the end of his life, swears that he's believe that he been poison, but in terms of Salieri doing it; its indeed historical fiction; due to the fact that most historians dismissed his mad ravings with that of a person whom clearly had his sanity deteriorated & the fact that Mozart fell ill while in Prague on Sept 6. 1791 where Salieri was clearly not there. Another claim, these critics spoke of, is how the film, portray a masked man wanting to commissioned a requiem from him in order to steal his work. In truth, it was very likely at the time for people to anonymously commissioned requiems from famous composers and pass them as them, off; but there was no reason why Salieri needed to. After all, his music was a lot more popular at the time, than Mozart. It wasn't, because Mozart was lazy. It was, because he was a fading child star, who had drug problems which both historians and film critics fail to notice that kept him working. I thought that Tom Hulce's immature performance as Mozart was very accuracy as it was very well documented that the composer had those characteristic traits even if it's a little exaggerated. However, the ever-present, idiotic giggle does get a little too annoying at times. About the fact that Salieri and Mozart were fighting for certain imperial jobs, it was true, but the reason why Mozart was never given a position on the emperor's courts, wasn't, because Salieri's envy of Mozart, but the fact, that Mozart's music doesn't sound typical 'Galant' & he wasn't noble. There was no reason why Salieri really needed to steal his work, as he was rich enough, and Mozart's work was a little too controversial at the time for basing works on Austrian's past banned materials and not being tradition. About Mozart's constant embarrassment of Salieri, such as seducing Salieri's lover, Catarina Cavalieri (Christine Ebersole). There is no evidence that Mozart slept with her. In reality, it is very likely that Salieri slept with Catarina, as it was generally known, at the time, that she was his mistress, and if they were still together years after 'The Abduction from the Seraglio'. If anything, Mozart and Salieri were, if not best of friends, at least on peaceable terms with one another, when it comes to sexual and musical conquest. He wasn't a saint at all. He even educated Mozart's younger son Franz Xaver Mozart, after the composer death. While, yes it's true that Mozart's work outlive, Salieri. It wasn't because Mozart work was better than Salieri. It was, because German nationalism began to take shape in Vienna with the birth of Romantic nationalism during the Napoleonic Wars. Italians were often view, as scapegoat of the war since Napoleon was one; thus Italian culture like it's music was somewhat banned from most European cultures during the mid19th century. This short ban, cause hits like Salieri to be nearly forgotten. It wasn't until, the late 20th century that most of Salieri's work was reintroduce into western culture with this film. The film was well-received by both critics and audiences alike with its lavish set and period costume design, music, visuals, and its acting. If the film had any faults, it would be the fact that the movie has pacing problems. It's way too damn long. 2h 40min is too much. It could had been cut down. Ultimately, the 1984 awards were monopolized by Amadeus with eight wins: Best Picture, Best Actor (F. Murray Abraham), Best Director, Best Screenplay Adaptation, Best Art/Set Direction, Best Sound, Best Costume Design, and Best Makeup. It became the 7th film in Oscar history to win eight Oscars. Overall: It's visually interesting, has dramatic intrigue acting from F. Murray Abraham, hilarious comedy, and introduced people to a part of history that was phenomenally fascinating and surprising, mostly true. I highly recommended this film."
    },
    {
      "username": "dr_foreman",
      "userUrl": "https://www.imdb.com/user/ur1052098",
      "reviewLink": "https://www.imdb.com/review/rw0208340",
      "warningSpoilers": false,
      "date": "23 January 2004",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "my number one",
      "content": "Now, this is my idea of a movie - spectacle, religion, sex, envy, and some of the most stirring music ever composed. And it all seems so modern; a bad visit from Mozart's father is awkward in the same way as a bad visit with my own parents! Here's a film that makes ancient history seem like yesterday, using the same trick employed by all classic films - solid characterization.It's a shame that so many of these actors never did much else, but maybe that's a blessing in disguise because it allows them to embody their characters without other movie associations getting in the audience's way.I was worried that the extended edition would hurt the film's pacing (most extended editions are a bad idea - the material was cut for a reason!). But in fact, all of the restored scenes are excellent. I should have expected no less! Beautiful costumes, beautiful locations, beautiful everything...very fittingly, \"Amadeus\" stands above and apart from the mediocrity."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3137072",
      "warningSpoilers": false,
      "date": "6 December 2014",
      "rate": "9",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Great F. Murray Abraham and Tom Hulce's laugh",
      "content": "The movie opens with an elderly Antonio Salieri (F. Murray Abraham) confessing to killing Wolfgang Amadeus Mozart (Tom Hulce). He used to be one of the great composers of Europe but has since been forgotten. As a boy, he was jealous of Mozart. He was delighted that his boorish father died. He works his way up to being the court composer to Emperor Joseph II (Jeffrey Jones) in Vienna. He is eager to meet Mozart but finds a flamboyant immature sex-fiend. Soon his admiration turns into jealousy of Mozart's Godly gift. Mozart marries Constanze (Elizabeth Berridge).Director Milos Forman injects a lot of energy into a period piece. Tom Hulce's laugh is infectious. However it's F. Murray Abraham that is the true driver of this movie. It's his jealousy and scheming heart that creates the depths for Mozart. His older self gives so much color to his disgust for Mozart. And the music is operatic. It is not just beautiful and grand but it's also hilarious. There's also special mention to Jeffrey Jones."
    },
    {
      "username": "sol-",
      "userUrl": "https://www.imdb.com/user/ur1355003",
      "reviewLink": "https://www.imdb.com/review/rw1022448",
      "warningSpoilers": false,
      "date": "16 February 2005",
      "rate": "10",
      "helpful": "18 out of 25 found this helpful.",
      "title": "My brief review of the film",
      "content": "A lavish, highly enjoyable production, the film is one of the finest biopics ever made, not just because of excellent production values, or the mystery element about the title person's death, but because it brings more to the depicted section of Mozart's life than just that. The film brings up and dives into deep religious issues and how important such religious beliefs were in the eighteenth century, and also it brings up some ideas about the profane mixed with the sacred. The whole production is wonderfully set to classical music, and it is technically superb in every area, with very good costumes and editing, as well as some fine acting, particularly from by Jeffrey Jones, who is as delightful as ever as Emperor Joseph. Nevertheless the film feels a bit lively in excess at times, and it never quite feels like it is in Vienna with the mixed accents, but still it is a quite a stunning achievement and simply superb entertainment. The film deservedly won 8 Academy Awards including Best Picture. A director's cut of the film was released too, running an extra twenty minutes at no detriment to the film."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3307200",
      "warningSpoilers": false,
      "date": "29 August 2015",
      "rate": "",
      "helpful": "9 out of 12 found this helpful.",
      "title": "beautiful",
      "content": "a beautiful film. in special manner because not the historical accuracy , not the subject itself are the pillars but a precise web of music, acting, locations. it is not a film about Mozart but about the force of genius. and admirable job of a great director who propose a story in which each detail becomes significant. not a competition between composers but the desire to understand. not only a great show but an inspired one. because the viewer is part of it. because the build of Requiem has the force to create to public special emotions. again and again. because not the names are important, not the old story by Pushkin who is the roots of play is important but the magnificent art to transform it in a memorable film who use each possibility of the play recreating a period and its characters. Tom Hulce is one of many Mozarts who could be imagine. but he has the inspiration to give an unique version, different by real person but more than a character. F. Murray Abraham is Salieri in a fascinating manner. vulnerable and cruel, fragile and dark. a film who must see. for its extraordinary magic."
    },
    {
      "username": "Alec-11",
      "userUrl": "https://www.imdb.com/user/ur0371191",
      "reviewLink": "https://www.imdb.com/review/rw0208186",
      "warningSpoilers": true,
      "date": "26 June 1999",
      "rate": "",
      "helpful": "282 out of 340 found this helpful.",
      "title": "A rare masterpiece",
      "content": "SPOILER: Amadeus is an extremely well written story, covering the last ten years of Mozart's massively prolific yet unusual life. I have read much that it paints a rather inaccurate picture of the genius's life, and yet I am not dissuaded from ranking this film as one of the greatest made. The historical problem should be addressed first, because it draws the most criticism. I would advise anyone to shut out the self-righteous whining of those people who fancy themselves as Mozart experts, when they really have little solid evidence for their assertions. History is only seen by us in fragments, be they documents or eye witness accounts. These fragments certainly do not amount to a full picture of events, and so Milos Forman and Peter Schaeffer are perfectly entitled to form their own story of genius.This issue aside, the picture is one of fantastic colour and scale, crammed with lavish costumes and wonderful architecture. This keeps the eyes occupied, but the ears get the biggest reward. The film uses a large amount of Mozart's music, and does so in a way which is carefully considered. For example, when the insane and enfeebled Antonio Salieri (F. Murray Abraham) reminisces on the sheer beauty of Mozart's compositions, we hear music to match his words, \"And there... an oboe, high and unwavering... until a clarinet takes over, and forms a phrase of such longing...\" The effect is deeply moving. Examples of this collaboration of music and picture are many; when Mozart (Tom Hulce) swaggers through the streets of Vienna taking swigs from a bottle of wine, we hear a jolly piano concerto; and he is hurled into a mass grave to the sorrowful Lacrimosa of his requiem mass. The music should move any viewer, however much they confess to hating anything classical. If you haven't seen this film, watch, or rather listen, for the scene where Salieri inspects samples of Mozart's music. The originality in switching the music as he turns the pages is profound. The acting is superb, particularly from Abraham. Hulce's cackle provides comic relief, and his wonderfully child-like mannerisms are testament not only to his acting skills, but to Forman's exceptional direction and vision. On the other hand, we are shown two moments of antithesis, namely when he is composing at his billiards table (his face taking on a look of such mature concentration), and when he is dictating his Confutatis to Salieri. Yes, we do get to see Mozart compose, and talk about tonic, dominant, second measures, etc. I would have preferred to have seen more of his thought processes though, because Forman's glimpse of how Mozart applied his genius is extremely exciting to watch, but short lived. Characterisations are brilliantly engineered. Salieri is scheming and yet outwardly indifferent to Mozart. We can see that he loves the music of his superior, and yet is torn apart by his own inadequacy. Inadequacy is a fitting word for Salieri's skill as portrayed by Forman, who wanted to give the greatest contrast possible in terms of the virtuosity of the two men, without making Salieri look like a complete cretin. He is, after all, known as maestro Salieri. Constanze Mozart (Elizabeth Berridge) is on first appearances a giggling girl, and yet through the course of the film we are shown that she is very shrewd, and is ruthless when dealing with finance. Roy Dotrice's Leopold Mozart has a masterful air, and maintains an oppressive paternal hold over his son even after his death, the analogy being the use of an enveloping cloak. The cloak is used as part of Leopold's street wear, but is also part of the costume of the statue in the first showing of Don Giovanni, where Salieri is certain that the imposing figure of the giant statue represents the recently deceased Leopold. In short, Forman presents us with a marvelous psychological essay on weakness and power, both superficial and real. This is obviously no average biographical motion picture, but a film conceived with an intelligence nearing that of it's subject. We are shown Mozart's virtuosity several times, which again provides wonderful excitement. He not only plays variations of his music thought up on the spot (at the party scene) but plays them in the styles of other composers, upside down. He infuriates Salieri by arranging a welcoming march actually written for Mozart (and taken to be wonderful by the Italian up to this point), showing off his outstanding skills whilst looking around at the assembled courtiers and cackling with glee. Those who have watched this scene with me have either laughed or smiled in sheer wonderment at a majestic combination of music, acting and direction. This film is a gem, combining sometimes ridiculous comedy with deep tragedy. On the negative side, it would benefit opera buffs more than concert goers, because opera is the dominant musical genre of the movie. (Specially designed opera productions have been woven into the film; greatly extending it's length but adding that extra colour and vibrancy). The film becomes heavy and slow moving as it nears its astonishingly refreshing conclusion at the lunatic asylum, noticeable largely due to the contrast with a lighter beginning. This may test the patience of some viewers, but once the credits roll, I guarantee that the majority of those who have watched Amadeus will be struck by the passing of such a wonderfully colourful and rewarding masterpiece, and will not want to move from their seats until the tranquil piano concerto fades away. The film deserves all its eight Oscars, and I give it 9 out of 10."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0208337",
      "warningSpoilers": true,
      "date": "4 December 2003",
      "rate": "9",
      "helpful": "45 out of 75 found this helpful.",
      "title": "Competently directed, extremely well-acted, exquisitely mounted...",
      "content": "'Amadeus' won eight Academy Awards with its highly fictionalized account of the life of 18th-century composer Wolfgang Amadeus Mozart... The film explores the essence of our strength and weakness, our essay on love, our darker side as human beings... Both Mozart and Salieri were born with unusual talents, but were overcome by emotions of love, faith, hate, pride, rage, repugnance, envy and falseness...F. Murray Abraham gives a tremendous performance as Antonio Salieri, the forgotten composer of Vienna who unfairly compares his own skill to a better man in the field, harboring in his heart a violent and uncontrolled anger, causing the poison of his own malice... Tom Hulce is remarkable as the over-excited genius, with a high-pitched giggle, whose unique music shows a continuous growth in expressive power...Jeffrey Jones gives a delightful performance as the 'musical king' who does not censor things lightly...Elizabeth Berridge is the perplexed and tempted woman who delivers the Court Composer a portfolio filled with her husband's manuscripts, and is horrified in hearing that 'some service deserves service in return.'Christine Ebersole is the young, high-spirited soprano, emotionally disturbed by Mozart's dramatic change...Richard Frank is the Chaplain, at the hospital, who hears Salieri's faults...Roy Dotrice is the menacing figure in a long, gray cape and dark gray hat...Nicholas Kepros is the Prince-Archbishop of Salzburg who seems quite sure that Mozart has sold himself to Vienna...Vincent Schiavelli is Salieri's valet who tries to tempt his master to open the door with a favorite dessert...Cynthia Nixon is the young maid-servant who is invited to go to Mozart's house and offer her services... Roderick Cook is the harsh and highly correct Emperor's Chamberlain who makes certain to a passionate Mozart that a little modesty would suit him better... Charles Kay is the corpulent man, highly conscious of his position as Director of the Opera, who rips out several pages of Mozart's music...Jonathan Moore is the kindly and educated Imperial Librarian who argues that opera is here to ennoble human spirits... Simon Callow is the impresario who asks the enchanted Amadeus to write for him a proper part with a couple of catchy songs, and he will guarantee him a 'luxurious triumph.'Kenneth McMillan is the prosperous merchant who treats his dogs like his own children...One of my favorite sequence is when a bewildered Mozart is received by the Emperor who is practicing a little March of Welcome composed by the illustrious Salieri... After some comments and remarks, Mozart, returns the manuscript back to the Emperor, and sits on the piano to play Salieri's musical composition demonstrating to the Emperor that he already had it in his head 'on one hearing only.' Mozart plays the first half of the march with great precision, then proceeds to modify the written score so that it turns out into a much better march... Filmed in Prague with a joyous music from Mozart's phenomenal repertoire, Milos Forman's 'Amadeus' is a masterpiece of drama intelligent and moving, handsomely filmed, competently directed, extremely well-acted, exquisitely mounted... The script gives a thought-provoking scenario that is clever, believable and interesting..."
    },
    {
      "username": "mstomaso",
      "userUrl": "https://www.imdb.com/user/ur3824745",
      "reviewLink": "https://www.imdb.com/review/rw1247684",
      "warningSpoilers": false,
      "date": "26 December 2005",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Landmark historical speculation",
      "content": "Amadeus presents a heavily fictionalized, speculative portrayal of Wolfgang Amadeus Mozart's last years, focusing powerfully on his relationship with Italian composer Anthony Saliere, and Mozart's wife, Constanzia. My review is based on first seeing the theatrical release in the theater during its first run, and then viewing the director's cut twice. In my opinion, the director's cut is a much better film, though the theatrical release would still earn an 8 from me. Do not approach this movie looking for some objective presentation of historic fact. Do not go into this film expecting to see a tribute to one of the world's greatest composers. Do not see Amadeus in order to understand the workings of musical genius. Inasmuch as all of these are incomprehensible - probably as much to those who lived them as they are today - Amadeus fails to achieve any of these laudable goals. What is does achieve - and quite well - is the blending of elements of Mozart's personality, aspects of his historical context, and an ingenious plot which is spelled out in a very clever narrative style. The truth you get out of Amadeus - as with most good historical fiction films and novels, is the truth of the feeling of a particular time and place.Amadeus immerses its audience in Europe's 18th century, but has just enough anachronism in its script to prevent losing its audience there. Mozart is a young prodigy who struggles with his own ego, over-sensitivity, arrogance, and self-destructiveness against a world which does not really know what to make of him. Salieri (Abraham) is his most ardent fan and admirer, but harbors a deep personal and professional jealousy, as well as an overwhelming self-centered guilt, and an even deeper conviction that his own perceived inadequacies reflect on his relationship to his creator. The third character, much better developed in the director's cut than in previous versions, is Mozart's wife Constanzia (Berridge) - seemingly the only fully rational and practical person among the principal roles. The film narrates the twists and turns of fate - the intrigues and folklore - which, even today tend to crowd out the facts of this part of Mozart's life. Hulce, playing Mozart in what is easily his greatest performance to date, utters a couple of highly anachronistic and off-color remarks in the course of the film. ISince I do not hold historical FICTION to some arbitrary standard of authenticity, I can say that my reaction to these was probably exactly as they were intended: (1) Either Mozart was so creatively explosive that he occasionally happened upon 20th century phraseology through sheer coincidence and/or (2) We are supposed to find these phrases a little shocking and they are used as plot devices to give the film a sense of surreality. Either way, the films works very well as a work of art and a good story, and what some describe as problems of authenticity are, to my mind, nothing more than artistic license. Most movies are not meant to be encyclopedic recitations of 'what really happened'. Keep that in mind before you commit to watching this. The only danger with regard to this film is that it is SO compellingly portrayed that some people are likely to walk away from it believing that this REALLY is what happened. F. Murray Abraham, who almost always does well, exceeds himself in this film, and well deserved his Oscar. Hulce is remarkable and the supporting cast are easily up to the task. The directing is subtle enough to be somewhat refreshingly unnoticeable, and the script and editing are excellent (at least in the director's cut). Very little can be said about the use of period music and costume which has not been said in the numerous awards and the high praise received from critics. This is a great film. Highly recommended for adults of any age."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0208251",
      "warningSpoilers": false,
      "date": "8 February 2001",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Excellent in the director's cut, though still long.",
      "content": "Amadeus actually caught my attention, in parts. It has excellent performances from F. Murray Abraham as a semi-famous musician who is incredibly jealous yet fascinated with the prodigy Amadeus, played to utter perfection by Thomas Hulce (love that laugh). The theme of competition is one that director Milos Forman latches onto and gets enough juice and dramatic tension to pull off the epic nature of the film, both personal and extreme. Often quite good, however suffers from the overlong-ness and sometimes it is impossible to keep attention, however it snaps back every once in a while. Period detail and is to the dot. And the music makes up anything else I could want in a film. A-"
    },
    {
      "username": "johndoherty",
      "userUrl": "https://www.imdb.com/user/ur0788778",
      "reviewLink": "https://www.imdb.com/review/rw0208249",
      "warningSpoilers": false,
      "date": "4 February 2001",
      "rate": "10",
      "helpful": "217 out of 283 found this helpful.",
      "title": "One of the greatest films of all time.",
      "content": "One of the greatest movies of all time. This is a movie that speaks for itself. Beautiful Cinematography and stellar performances by all especially F. Murray Abraham who carries the film. Tom Hulce was a terrific choice for this movie. True this is historically incorrect but it doesn't matter this film works on so many different levels... the music ahhh the music. Mozart is pure genius and his music touches this film and everyone involved. You can just sense that Mozart's inspiration drove everyone on this film to perfection. A must see film for all!"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1741166",
      "warningSpoilers": false,
      "date": "5 October 2007",
      "rate": "9",
      "helpful": "10 out of 15 found this helpful.",
      "title": "The Mercurial Genius",
      "content": "Long after his rival died at a young age and his world essentially obliterated by the Napoleonic wars, Antonio Salieri as played by F. Murray Abraham looks back on his life from the confines of an insane asylum. Everywhere the music of Wolfgang Amadeus Mozart is played and hummed familiarly by even the masses. Scholars study Salieri, the people from all walks of life listen to the notes that Amadeus put down for posterity.Amadeus is a wonderful recreation of the court at Schonbrunn Palace in Vienna during the age of reason. The Hapsburgs have now become the House of Hapsburg-Lorraine as a result of Maria Theresa becoming the first female monarch of their empire. The empire and the court are now ruled by her son Joseph as played by Jeffrey Jones. What I liked about the film is that author Peter Shaffer obviously researched with great care the period this rivalry between Salieri and Mozart takes place. Jones remarks on more than one occasion about letters he got from his sister Antoinette from the French court and what she's observing, but not quite understanding.Mozart is played by young Tom Hulce and in one of the few times that two actors from the same film got nominated in the same acting category, Hulce and Abraham were both up for Best Actor and Abraham won as opposed to both of them canceling each other out. It really would be hard to live on the difference in their performances, without a good Mozart and an equally good Salieri, the film would not be the masterpiece it is.And it did win for Best Picture, Best Director for Milos Forman and a flock of other Oscars, all well deserved. Besides those already mentioned I think you will enjoy Elizabeth Berridge as Mozart's long suffering wife and Roy Dotrice as his more staid and settled father who can't cope with a mercurial genius of a son any better than Abraham can.And Amadeus brought a revival of interest in the old classical masters and that's always a good thing."
    },
    {
      "username": "SevenOfNine63",
      "userUrl": "https://www.imdb.com/user/ur3766540",
      "reviewLink": "https://www.imdb.com/review/rw1040201",
      "warningSpoilers": true,
      "date": "15 March 2005",
      "rate": "10",
      "helpful": "28 out of 31 found this helpful.",
      "title": "Genius",
      "content": "It is because of this movie that I began listening to Classical music. Up to the age of 20 I wouldn't listen to anything but rock, rap, hip hop, punk. Then I fell in love with Mozart. And because of this epiphany I went on to listen to other styles of music such as country (Patsy Cline, Loretta Lynn, Hank Williams), Edith Piaf, Al Jolson, and so on. This movie is breathtaking. A knockout and I wish I could see it on the big screen! Tom Hulce was wonderful as Mozart! Elizabeth Berridge who plays his wife Constanza looks eerily like the real Constanza judging from portraits of the great composer's wife. F. Murray Abraham deservedly won the Oscar for his outstanding turn as Mozart's arch enemy-fellow composer Antonio Salieri who was NOT a 'mediocrity'! He was a brilliant composer in his own right. It is just that there are the fair, the good, the great-and then there are the gifted. Wolfgang Amadeus Mozart was one of the gifted. When it comes to music even the un-trained ear can tell that God kissed the man right on the lips. And there was nothing Salieri could do about it. He could train in music for a million years and he still could not come close to the genius that was Mozart-who's \"Eine Kleine Nachtmuzik\" is recognizable today even to non-classical music fans."
    },
    {
      "username": "mario_filipe",
      "userUrl": "https://www.imdb.com/user/ur3478335",
      "reviewLink": "https://www.imdb.com/review/rw0208351",
      "warningSpoilers": false,
      "date": "23 May 2004",
      "rate": "10",
      "helpful": "32 out of 36 found this helpful.",
      "title": "A movie of a genius, directed by another one !",
      "content": "I thought that it would be impossible to make a movie like this one! Peter Schaffer's original play inspired Milos Forman, the great czech film maker, that surprised the world with \"One flew over the cuckoo's nest\" (1975). The sublime, almost over-human performance by Frank Murray Abraham (the Mozart enemy and secret admirer, Salieri) is one of the keys for the movie success, mostly to it's depth. The perfect sense of timing by Milos Forman is admirable, he knows when to play wich music. All the scenarios: opera houses, palaces, streets, etc., are details absolutely harmonious! One of this classic secret was that Forman gathered \"the\" team, perfect team work.We can just admire it, laugh, cry, reflect, most of all, listen to it. See it, it's 10/10.Thank you Mr. Forman..."
    },
    {
      "username": "happipuppi13",
      "userUrl": "https://www.imdb.com/user/ur3329978",
      "reviewLink": "https://www.imdb.com/review/rw2414627",
      "warningSpoilers": true,
      "date": "16 April 2011",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Amedeus : Director's Cut Completes The Story",
      "content": "I have seen the original version of \"Amedeus\" 6 times and no doubt, it is and always will be a deservedly crowned masterpiece and Best Picture. While I agree with that 100% , I've always had this feeling that there could or should have been more to it.Not because the original was cut by 20 minutes but because it seemed to have more focus on the absurdity of W. Amedues Mozart himself.(Wolfgang Amedeus Mozart 27 January 1756 - 5 December 1791 age 35.)Yes, he's the title character, but the point of view of the story is told by Salieri (August 18, 1750 - May 7, 1825) and it seems, aside from his aged version of himself and the times we see his young self on screen, in the original cut, his story of his disillusionment with God seems too quick.In this director's version, we find out more than we had before about this. Scenes of him quietly praying but at the same time crying out to God to help him have as great a gift as Mozart.Every failure and snub he receives in his life, from the arrival of the young genius culminates in his declaring God his enemy and burning the Holy Cross in the fireplace. The new scenes help build it to a better climax on that note.Along with this the expanded story of when Mozrt's wife secretly visits Salieri to show her husband's work to him,to gain a paid teaching post. This leads to the deleted section of Salieri telling her to \"come back in the evening\" , for illicit purposes.Once she later arrives and removes her top garment exposing herself,for whatever reason, he decides to instead have her shown out the door. I'm assuming out of his own sense of decency, he decided not to go through with it. It's Mozart he wants to punish, not her. Even though he has just the same.Lastly, there's also the funny scenes with Mozart trying to instruct a nervous young girl while her family and dogs make constant noise. It's something that causes him to storm out and feel indignant at having to put up with something like this. It adds only a little to the overall story.With the film expanded to 3 hours,again, I feel I saw a much more complete storyline, with both Salieri & Mozrt represented equally on screen. .... but whether in it's original form or this version, there's no way I'd ever rate \"Amedeus\" less than 10 stars.That'd be like telling Mozart his music has \"too many notes\",so...well, there it is. {END}"
    },
    {
      "username": "XenoCorpse",
      "userUrl": "https://www.imdb.com/user/ur1436739",
      "reviewLink": "https://www.imdb.com/review/rw0208144",
      "warningSpoilers": true,
      "date": "28 November 2001",
      "rate": "",
      "helpful": "37 out of 48 found this helpful.",
      "title": "A brilliant film for people with an attention span.",
      "content": "What can I say that hasn't been said? Amadeus is a truly wonderful film, and as it is told from the point of view of an insane, elderly Salieri, I forgive it's historical inaccuracy. What I fail to understand is how the majority of people who watch this film and don't like it can say it's \"stupid how Mozart dies\". They seem to be under the impression that he died of working hard and stress, or just being driven mad. PAY ATTENTION PEOPLE! There are SO MANY scenes of Mozart drinking. There are scenes of him SNEAKING OUT to go drinking. There are scenes of his wife finding bottles littered around the house. Keep in mind that alcohol brewed in Vienna during Mozart's time was pretty potent stuff. History says Mozart died of an \"unknown feverish illness\", but it seems clear to me that the filmmaker was trying desperately to make the viewer see that his vision of Mozart drank himself to death BECAUSE of the stress. Observe Mozart's final hours. His skin, his eyes, his fever. How can the public at large, no matter HOW old you are, not recognize that this movie suggests Mozart dying of cirrhosis of the liver? Therein lies the brilliance of the movie. They never SAY this is the cause. Could it have been poison? Salieri doesn't remember it that way, but then, he could be omitting that detail. More likely it was Mozart's own drinking problem that killed him in this movie. Like so many geniuses, Mozart was his own killer. Legendary talent and fame that burns brightly always accompanies a life that winks out of existence quickly. The message of this movie would then seem to be that Salieri WAS blessed by God, and that Mozart was the cursed one. Salieri was blessed with long life, while Mozart died poor and young. The irony is that Salieri, being a true artist, recognizes that his long life of mediocrity will not- CAN not- measure up to Mozart's legend, despite his short life. Salieri would trade that long life for a short life that guaranteed him people knew his music forever... And in the end, he is forgotten like the rest of us. Is there a villain in this movie? No. There are only two victims, and a great amount of wonderful music and dialogue."
    },
    {
      "username": "DRIAINCLARK",
      "userUrl": "https://www.imdb.com/user/ur1680983",
      "reviewLink": "https://www.imdb.com/review/rw0208159",
      "warningSpoilers": false,
      "date": "1 April 2002",
      "rate": "",
      "helpful": "115 out of 151 found this helpful.",
      "title": "Ravishing in sound and vision",
      "content": "The unseen star of this film is the Academy of St Martin's in the Field, London. Buy the soundtrack and you will be rewarded with some of the most stunning music you can hear. Mozart's music excells with brilliant treatment and dies with a bad performance. And that, after all, is what the film is about. Without his music, Mozart would be lost in time, a fate that the narrator of the story, the composer Salieri, saw as his own. Ironically, while Salieri has indeed been completely overshadowed by Mozart, his music still survives and has its followers.But beyond the music this is an outstanding film. Set in the prettiest and most flamboyant century of the last millennium, it is visually stunning and the writer's portrayal of jealousy is perceptive. The casting of the Austrian King and courtiers, (indeed all the actors in this film) that Mozart needed to impress capture the gentility and courtesy of the time, and also subtly shows their growing indignation and impatience at Mozart's personality and behaviour; the presentation of Mozart as punk musician is probably the only failing in the film. As a theatrical device to show that genius can come in disastrous packages it succeeds well, but anyone with any historic sense of social ettiquette or manners will know that Mozart's sill y behaviour would be well wide of the truth, as might, perhaps, be the concept of Salieri as murderer-in-chief. Only in the final scenes is Mozart's brilliance as a composer truly explored in what amounts to a deconstruction of his final composition - his moving, uncompleted and poignant Requiem mass.Another unintended star in this film are the candle lit sets and theatres of the 18th Century; their operas and drama ooze a magic that is lacking in the present world and which modern producers might well try to reintroduce; so lovely are these buildings with their flickering lights and theatrical techniques that one is left desperate to to seek out these rare theatres to experience them.This film leaves one breathless from its visual beauty, its magnificent score and the choreography, indeed, of the two together. Mozart's life had the air of tragedy, and his undoubted genius speaks to us now and forever. This film is a monument to the skills of the writer, maker, performers and, of course, Mozart's music. If you have not yet done so, see it."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5633728",
      "warningSpoilers": false,
      "date": "12 April 2020",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "It's good",
      "content": "I really don't understand the hype for this movie. It's good; not the best thing ever."
    }
  ],
  "errorMessage": ""
}