{
  "imDbId": "tt0056172",
  "title": "Lawrence of Arabia",
  "fullTitle": "Lawrence of Arabia (1962)",
  "type": "Movie",
  "year": "1962",
  "items": [
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0077919",
      "warningSpoilers": true,
      "date": "6 August 2002",
      "rate": "",
      "helpful": "177 out of 216 found this helpful.",
      "title": "Makes a Strong Case for Best Film Ever.",
      "content": "The definitive epic of the cinema's history. \"Lawrence of Arabia\" is hands-down the finest production of the 1960s and makes a strong case as the best movie ever made. The titled character (Oscar-nominee Peter O'Toole in his career-defining role) dies in a freak motorcycle accident in the early-1930s in his homeland of England. In spite of being honored by the nation, many knew nothing of him. Some loved him, others despised him, but no one seemed to know the man at all. Flashbacks immediately start as we meet the character during World War I. He is a lieutenant assigned to mundane duties, but suddenly he is thrust into a greater role in North Africa. He is to assist a Saudi Arabian prince (Alec Guinness). The goal is to fight off the dreaded Turkish regime that poses a threat to the Arabs. If the Turks take over this land in Africa, what will it mean for the English? This concern leads to those in charge (most notably Claude Rains) wanting the titled character to help the Arabs to win their freedom back from the Turks. With the help of allies Omar Sharif (Oscar-nominated) and Anthony Quinn, among a whole host of others, O'Toole starts to assist the Arabs in their all-or-nothing task. An ambitious American journalist (Arthur Kennedy) wants to tell O'Toole's story in the hopes of getting the U.S. interested in the war (basically trying to get his nation involved in World War I by presenting them with a larger-than-life hero). During the venture O'Toole becomes a bit war-crazed and looks at himself as a sort of Christ-like figure who thinks of himself as immortal. O'Toole proves to be someone who is very at home in combat and when the combat is over, will he be able to function properly? Franklin J. Schaffner's \"Patton\" benefited greatly from David Lean's (Oscar-winning for directing) masterpiece. This Best Picture Oscar winner from 1962 just grows in importance as the years pass by. \"Lawrence of Arabia\" is a thinking person's film that is much, much deeper than it appears on the surface (and it appears deep on the surface to start with). The film deals with a slice of history that really did not seem that important back during World War I, but the situations in the Middle East now are greatly due to T.E. Lawrence's acts nearly a century ago. Did leading the Arabs to freedom make the world a safer place? This is the main question that Lean's film raises. Guinness' character is someone who changes almost immediately near the end of the production and it is a somewhat frightening foreshadower of things to come. A monumental milestone in film-making that stands so tall against all the other great productions of all eras. 5 stars out of 5."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1070007",
      "warningSpoilers": false,
      "date": "29 April 2005",
      "rate": "10",
      "helpful": "92 out of 113 found this helpful.",
      "title": "Majesty in the Desert",
      "content": "The moment David Lean makes you aware you are in the hands of a master comes early on in \"Lawrence of Arabia.\" Lawrence (Peter O'Toole) holds a lit match close to his lips and with one quick puff of air blows it out. Before the action is even completed, however, Lean has cut to a shot of a desert vista, with the sun slowly rising over the lip of the horizon. It's one of the most famous elliptical edits in cinema history, second maybe only to the bone/spaceship cut in \"2001: A Space Odyssey.\" And it's only the first of countless memorable moments in \"Lawrence of Arabia.\" The appeal of David Lean epics has always been his ability as a director to maintain an equilibrium between the scope of his films and the characters in them. Character development is never sacrificed to massive set pieces or knock-your-socks-off action sequences. \"Lawrence of Arabia\" has these elements too, but at heart it's a character study of one remarkable man. Lean seemed to understand that impressive landscapes alone are not inherently interesting; but if you place a fascinating character among those impressive landscapes, you can have movie magic.\"Lawrence\" feels unlike other historical epics of its time. In most \"big\" films--I'm thinking of movies like \"Ben-Hur,\" \"Spartacus,\" \"Cleopatra,\" all movies that premiered roughly around the same time as \"Lawrence\"--one gets the sense that directors framed compositions based on how much they were able to fit into their widescreen lenses. One rarely sees characters filmed from anything closer than a medium shot, and usually the background is stuffed to overflowing with garish art direction. Everything feels static and wooden. But in \"Lawrence,\" Lean keeps his frames constantly alive by juxtaposing huge landscape shots with extreme close-ups of actor faces. In one especially brutal scene, after a battle that results in the slaughter of many people, the action cuts to a close-up of O'Toole, looking panicked and crazed, gripping a bloody knife in his hand as if he's reluctant to drop it, obviously both disturbed and titillated by the carnage he just witnessed. It's moments like that---not just an impressive battle scene but a character's reactions to the results of that scene---that set \"Lawrence\" apart from other standard epics.And of course, I have to reserve space in my review for the performance of Mr. O'Toole. He is perhaps my favorite actor, not one of the most prolific, but certainly one of the most unpredictable. He has a flair for choosing eccentric characters that give him almost unlimited room in which to perform. He carries \"Lawrence of Arabia\" almost singlehandedly on his slim shoulders. That's not to say the supporting cast isn't great, but O'Toole towers above them all. O'Toole understands that the most influential figures in history could also be the most difficult and ruthless when they needed to be, and he gives Lawrence an incredibly complex characterization, leaving his audience in doubt as to whether he should be worshiped or feared, or perhaps both.Lean would never direct an equal to \"Lawrence of Arabia\" again. His later films are certainly more than watchable, and \"A Passage to India\" is even quite remarkable in its own way, but we would never get another \"Lawrence.\" Even more reason to appreciate it now.My Grade: A+"
    },
    {
      "username": "rupie",
      "userUrl": "https://www.imdb.com/user/ur0307374",
      "reviewLink": "https://www.imdb.com/review/rw0077836",
      "warningSpoilers": false,
      "date": "15 June 1999",
      "rate": "9",
      "helpful": "417 out of 554 found this helpful.",
      "title": "a memento from the days when they made real movies",
      "content": "It is, in a way, depressing to watch this movie today. One winds up contrasting it with the sort of technologically slick and aesthetically shallow spectacles, like \"Titanic\", that garner the sort of adulation that a truly great movie like \"Lawrence\" received in its day, and one realizes how far we have fallen.Ignore David Lean's painterly technique, the way he fills the screen like a canvas. Ignore Freddie Young's stunning cinematography in fulfillment of Lean's vision. Ignore the fabulous score by Maurice Jarre. Ignore the stupendous cast. Ignore the topnotch script.What we have, beyond all this, is an absolutely gripping and psychologically perplexing character study of a uniquely enigmatic individual that keeps us on the edge of our seats for the full length of the movie. \"Lawrence\", at over 200 minutes, goes by faster than many a movie of half its length, due to Lean's brilliant pacing and direction, and superb acting all around. To make a comparison in the world of music, this movie, like Mahler's 8th symphony, is a universe contained within itself.Of course, it is an exercise in self-denial and philistinism to watch this movie in anything other than the wide-screen - or \"letterbox\" - format, due to Lean's complete use of every inch of the wide screen. To watch it otherwise is to miss half of Lean's intention.To use a hackneyed phrase, they simply don't make 'em like this anymore."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0077794",
      "warningSpoilers": false,
      "date": "4 October 2001",
      "rate": "",
      "helpful": "40 out of 53 found this helpful.",
      "title": "A Vision that Defines Itself",
      "content": "A man has an inner drive that makes him peculiar and intense. He goes to the desert and falls in love with it and its people. Gaining powerful sponsors, he has a grand vision that he accomplishes by inspiring and directing thousands. But in a very short time, that grand work is compromised and disassembled by fat cats in offices who are concerned with different values.True of both Lawrence and Lean. The legacy of Lawrence is still in violent disarray (I write this a short time after the Sept 11 attacks on New York). But Lean's vision was saved, and what a vision! Of this picture, it can be said that it is perfect if only because it is so visionary that it defines its own rules.Lean's vision is also lean, with vast zones of sonic and visual silence -- several meditations on the unperceived. Though there is a story (who are you?) this is really a film of TE's 'Seven Pillars,' which creates a romantic vision of sculpted natural forces. So powerful a depiction that Islam experienced a faddish attraction in the West, a place now enjoyed by Tibetan Buddhism. That was before.See here the original Obiwan, every intonation, movement and dress. See here Peter O'Toole's personality become completely entwined with the character, who is as fictionalized by our eye as by Lowell's. See the most expressive, anthropomorphic train wreck in history.Watch a particularly interesting brand of acting by the 'Arabs.' Macho men are acting anyway, so an actor can play an actor when he lands such a role.The star of the film is the clever eye of God, not the clockmaker or judge of the west but the chess player of the mirage. Its face is clearest in my mind when the Turk holds TE down for torture and smiles. Its hand in the creaking of Feisal's tent -- who would ever imagine the wind acting? (Kurosawa's 'Ran' at the beginning is the only other example I know.)I have a few films I admire for various. mostly intellectual qualities. But in the direct matter of visual storytelling, this one tops my list."
    },
    {
      "username": "maureenmcqueen",
      "userUrl": "https://www.imdb.com/user/ur18666067",
      "reviewLink": "https://www.imdb.com/review/rw4233399",
      "warningSpoilers": false,
      "date": "10 July 2018",
      "rate": "10",
      "helpful": "151 out of 165 found this helpful.",
      "title": "Peter O'Toole as Lawrence, what a treat!",
      "content": "Did you know that Cary Grant had been approached to play it? Yes, as well as Albert Finney and that made a lot more sense but it was Albert Finney who said, have you considered Peter O'Toole? Who? - Yes, I love that story. It goes to prove that certain things are meant to happen. I'm sorry if I'm going on about it. But I saw Lawrence Of Arabia for the nth time in a 70mm print in a crowded theater and what came across as the one major reason this film will be relevant forever is Peter O'Toole. His performance is timeless because it is unique. Cinematic and theatrical but always true. David Lean brilliantly created a sense of intimacy in O'Toole's eyes within the vast, arid landscape. I know the film has its detractors. I heard once director Michael Apted call it a \"silly movie\" Wow, I had Michael Apted's quote in my mind when I saw the film last and for the life of me, I don't know what he meant. I love this film."
    },
    {
      "username": "MidniteRambler",
      "userUrl": "https://www.imdb.com/user/ur3207164",
      "reviewLink": "https://www.imdb.com/review/rw0078011",
      "warningSpoilers": false,
      "date": "23 May 2004",
      "rate": "10",
      "helpful": "207 out of 239 found this helpful.",
      "title": "Simultaneously personal and panoramic",
      "content": "Sweeping, epic and literate version of British adventurer and soldier T E Lawrence's experiences in Arabia during the First World War. Lawrence, miraculously well played by Peter O'Toole, \"went native\" when sent into the desert to find Alec Guinness's Prince Feisal. Before long he was striking out himself against the Turkish Ottoman Empire, which still held sway in the region at the beginning of the last century. Lawrence's efforts to unify the various Arab factions are particularly prescient.Lawrence became an inspirational warlord whose neutral presence amongst the Arab tribes, lead by Omar Sharif and Anthony Quinn, amongst others, served to glue together shifting and uneasy alliances. As well as wrestling with himself, with his own demons, and with the cruel desert environment, the Englishman was also faced with culture clashes which pitted not only the imperialists against the indigenous populations, but also the mercenary practices of the Arab guerillas against the discipline of the British army. In the end, Lawrence himself does not know which side he is on, nor which party he belongs to. Set against a backdrop of the Arabian desert, the nomadic allies under Lawrence's direction, attack and disrupt the Turks' efforts to maintain control of the territory, whilst the elephant - the British army and its heavy guns under General Jack Hawkins - pushes ever deeper into the area: not until his job is done does Lawrence learn that the French and British governments have carved up the middle-east between them and that the battle-lines for the 21st century are already being drawn.Scripted by the inimitable Robert Bolt and directed by David Lean, Lawrence of Arabia is one of those films without a weakness, despite drawing complaints for its near four hour length. The dialogue, cinematography, soundtrack and especially direction are superlative; likewise the supporting actors. But it is O'Toole at his charismatic best who steals the show in his starring debut; he never looked back. It may take an effort to watch this movie, but is well worth the ride and will, by the bye, provide some insight into the fractious and volatile world of Arab politics. One of the best films ever made."
    },
    {
      "username": "caseyt-48511",
      "userUrl": "https://www.imdb.com/user/ur70082814",
      "reviewLink": "https://www.imdb.com/review/rw4235683",
      "warningSpoilers": true,
      "date": "12 July 2018",
      "rate": "10",
      "helpful": "37 out of 43 found this helpful.",
      "title": "A True Must See",
      "content": "\"Lawrence of Arabia\" is either the greatest movie ever made, or the second greatest. The true power and scope has only been matched by few other films. It is a film that really does stand the test of time. In an age where special effect driven films are king(as much as i like those), it is great to watch a film where you truly see thousands of people charging a fort on horse, and camel, back. It's a long ride, but it is never boring. It is full of fantastic characters acted out by even better actors. Peter O'Toole should have won every acting award available to win. His performance is consistently ranked among the greatest in movie history.It's not only a wonderful film but a symbolic one. This could have easily fallen into typical tropes but it almost always manages to subvert epic conventions and challenge us. Lawrence clearly doesn't want the English to interfere with the new Arab state. He wants them to be independent after they were conquered for so long. He genuinely cares. But unfortunately, little to no promises were kept. The English and other countries cut up the Middle East and changed everything in the name of empire... No wonder Lawrence looks so sad at the end. He knows what's about to happen to his friends and allies that he fought so hard with. There would be no true freedom for them.Omar Sharif and Claude Rains are also deserving of much praise. The music is extraordinary and captures each scene very well. The personal journey of Lawrence is fascinating as well. He isn't your average epic hero. He's flawed, egotistical and by the end of the film he has lost his way. He started to see the revolt as being about him when it wasn't. He began to believe the legend that had evolved around him. He saw himself as a god but was brought down hard.David Lean's direction is practically flawless and proved that he is still one of the best directors ever. All in all, David Lean's masterpiece is a timeless, must see movie that has not been diminished by time."
    },
    {
      "username": "iain_connell",
      "userUrl": "https://www.imdb.com/user/ur4665941",
      "reviewLink": "https://www.imdb.com/review/rw1007619",
      "warningSpoilers": false,
      "date": "26 January 2005",
      "rate": "10",
      "helpful": "431 out of 512 found this helpful.",
      "title": "Still my personal favourite",
      "content": "I first saw this film on its release, aged 13, and it forms an important part of my transition towards adulthood. I am pleased to see that it consistently rates 20something in the IMDb listings, even from others (whom I envy, for I can't see it with fresh eyes) who are seeing it for the first time. Pleasing too is that some of those are also teenagers, for whom a forty-three year old film must itself seem part of the past. As for the minority who are bored by intentionally slow pacing (and for whom punctuation, paragraphing and grammar are a lost art), I suggest they learn a little about the history of film-making (from which it may become apparent that much of today's fast editing techniques were invented in the 1920s: try Eisenstein's October, for example).From the universally admired cinematography of Freddie Young, the long shot of Omar Sharif's floating mirage entry, the pre-CGI battles and pan-up scene changes, to O'Toole's florid but career-defining performance and the (then) novel time-shift narrative, this film set standards not matched even by Lean himself, and, as many reviewers have commented, financially and practically unlikely to be attempted today. I too have rarely seen such clarity of image outside of Imax, and in my view the script by Robert Bolt (and I now have learnt, an uncredited Michael Wilson) is the finest in cinema. Maurice Jarre's music and some of the acting style now seem a little excessive, but repeated viewing (around 35 times in my case) does not diminish the impact and quality, and the restoration and now DVD release still, after all these years, approaches the effect of that first 1962 viewing.It is rare that repeated watching of a film (as opposed to a live performance) does this, and the reasons go beyond the photography, performances and editing. In my opinion, it is because the characterisation and storytelling encourage an appreciation of the ambiguity and inconsistency behind our motives and behaviour, and, in a wartime scenario, in the contrast between political expedience and personal morality. For a 13-year old, this opened a window into the adult world, and it explains why the story has resonance far beyond its setting. The film doesn't require an understanding of middle-east politics (though it does have some very current relevance), but it does require an ability to look, listen and understand. The fact that so many people rate it so highly says everything about its wider impact. When The Matrix and even Lord of the Rings have slipped out of the ratings (and the adolescents who inhabit these pages have grown up), I believe this film will still be in the 20s or 30s, perhaps enabling young people to once again see the world through adult eyes.Like Ali, I fear Lawrence. I fear the power of art to change us, to challenge our preconceptions. Every time I see this film I learn a little more, discover something new. When I was 13 I didn't understand much, but this film helped me to see that I wanted more, knew more, than my peers. I can't rate it more highly than that."
    },
    {
      "username": "Instant_Palmer",
      "userUrl": "https://www.imdb.com/user/ur39322316",
      "reviewLink": "https://www.imdb.com/review/rw4965939",
      "warningSpoilers": false,
      "date": "29 June 2019",
      "rate": "10",
      "helpful": "32 out of 38 found this helpful.",
      "title": "David Lean's Masterpiece is a Cinematic Treasure (now in 4K UHD!) 💯",
      "content": "The film that inspired Steven Spielberg to pursue a career as a film maker for good reason - 'Lawrence of Arabia' is a cinematic treasure - the greatest \"Epic\" movie, and one of the 5 greatest films ever made by almost everyone's standard.The spectacularly gorgeous and awe inspiring cinematography of Freddie Young tips the scale for me in favor of 'Lawrence Of Arabia' as Film's greatest work of art in the Epic genre, surpassing 'Citizen Kane', and The 'Shawshank Redemption', landing at #2 on my lMDb \"Top 5 Greatest Films\" ever made list (see herein), topped only by 'The Godfather' (#1).The immensity and scale of the desert creates the perfect canvas on which Lean paints his masterpiece - We shall never again see authentic location shoots on this truly epic scale, as granted permission for such is virtually impossible today.Restoration efforts in 1988 led by Spielberg and Scorsese saved most of what would have been a tragic loss.Now available in 4K UHD, the film has never looked better.My grandmother took me to see 'Lawrence Of Arabia' at a beautifully restored baroque theatre when I was 12, as the film was periodically shown in such art film houses for years after its release - It is an event I will never forget."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2237667",
      "warningSpoilers": false,
      "date": "18 April 2010",
      "rate": "10",
      "helpful": "25 out of 35 found this helpful.",
      "title": "Quite simply movie-making on the grandest scale",
      "content": "At 17, I love David Lean, his films are filled with beautiful images and he also directs with real flair. Lawrence of Arabia is a perfect example of movie-making at its finest, the whole film is absolutely phenomenal in every aspect: Whether it is the film's visual style. Lawrence of Arabia is filled with absolutely beautiful images, such as the mirage that introduced us to Omar Sharif. I don't think this could be possible without the astounding cinematography, or the stunning, picturesque Morrocan, Saudi Arabian, Spanish and English locations. The shots of the desert were visually jaw dropping and the battle scenes are unforgettable. But that is the thing with Lean, all of the films I have seen of his are visually stunning, Passage to India, Oliver Twist, Great Expectations, Brief Encounter and Bridge on the River Kwai all but to name a few.Whether it is the film's music score. I used to listen with real enthusiasm to Classic FM at the Movies every Saturday (on the radio that is), and along with the main theme of Gone With the Wind, the score's main theme was one of the main themes that stuck out most. Maurice Jarre's score is nothing short of outstanding, swift, sweeping, epic and even iconic. I could very well say it is probably one of my all time favourite movie scores.Whether it is the film's screenplay. The screenplay is intelligent and is like a withering satire on the mentality of Lawrence's superiors, who go by the book. Like the screenplays for Casablanca, Shawshank Redemption, It's a Wonderful Life and All About Eve, the screenplay here has lines that are a) quotable and that b)linger long into the memory, just like the story the film tells.Whether it is the film's acting. Peter O'Toole is the easiest starting point, for he gives one of the best performances I have ever seen on film. His performance is so flamboyant and brilliant, it just highlights what a great actor he is. He nails Lawrence's complex character like a fitted glove, he is enigmatic and charismatic like TE Lawrence was like in real life. Supporting him all the way like iron are Alec Guiness, Claude Rains, Jack Hawkins and Jose Ferrer. Their characters aren't as complex as Lawrence's but they are still fully fleshed out and intriguing.The film is very long, but thanks to the quality of the visuals, direction, screenplay, music and acting there is no time whatsoever wasted. Quite simply one of the best movies ever made, movie-making on the grandest scale. 10/10 Bethany Cox"
    },
    {
      "username": "Le-Samourai",
      "userUrl": "https://www.imdb.com/user/ur3056788",
      "reviewLink": "https://www.imdb.com/review/rw0956062",
      "warningSpoilers": true,
      "date": "1 November 2004",
      "rate": "",
      "helpful": "108 out of 122 found this helpful.",
      "title": "A Majestic Masterpiece Beyond All Other",
      "content": "Spoilers herein. There are films that define a time. There are films that define a genre. There are films that define cinema. 'Lawrence of Arabia' defines all of the above. Within its frames 'Lawrence of Arabia' captures the essence of a man, a time and place with unparalleled cinematic magic. Though a winner of 7 Oscars and one of the Top 100 ticket sellers of all time, most people were not able to see 'Lawrence of Arabia' the way it was intended until 1989 (and I still imagine most people have only seen it during one of its annual Christmas TV viewings). Steven Spielberg, Martin Scorsese and Robert Harris deserve massive applause for their efforts to restore this film to its 2.20:1 widescreen, 220 minute glory. I, myself (thankfully) have never seen any other version of this film. So when I first saw the film it was in its untainted glory and it's an experience I shall never forget. Never before had I seen a film that blurred the lines between storytelling and art so much. Never before had I seen a film so assured in visual storytelling. Never before had I been so transplanted into a film's world. The awesome acting, the stupendous story, the remarkable visuals, the sublime script, the fascinating dialogue and majestic music all combine to make a film like none other.'Lawrence of Arabia' is played out in five acts, each one of them represents a different part of Lawrence's psyche. The first act is Lawrence's introduction into Arabia where he is very much an Englishman  albeit an outcast. The second act concerns his assimilation into Arabia, the taking of Aqaba and his rise to deity. The third portrays Lawrence at the peak of his military career and his growing egotism. The fourth act is his capture, torture, mental breakdown and dissertation of his troops. The fifth concerns his comeback, revenge and both his greatest and most flawed accomplishment: the slaughter of Turks and the liberation of Damascus. Every scene in these acts is essential to the development of his persona. Lean and Bolt raise the question of who Lawrence was, but they never answer the question. This is one factor that brings me back to the film time and time again  each time I watch the film I am left with a different perception of Lawrence's character.The film contains an all star cast including Peter O'Toole, Omar Sharif, Alec Guinness, Jack Hawkins and Claude Rains. Only 'JFK' rivals it in my view. Of course, there was been many all star casts that haven't performed to their usual standards, but it is not the case here. Everyone is on top of there game especially Peter O'Toole who gives the greatest cinematic performance I have ever seen. From extremes of joyous extremes and heated contempt he dominates the screen with undeniable screen presence and charisma. Many an actor would be lost on screen amidst all the sand, but O'Toole never is. Watch Lawrence's scene in the mess hall near the beginning then watch his immense 'No prisoners' scene  the change is remarkable. Omar Sharif is also superb and it is easy to see why he became a big international star following his charismatic performance.I have never been a fan of desert films and find the majority of them boring, but Freddie Young's 70mm widescreen photography brings the desert alive in such an exciting and absorbing way. The film is simply full of memorable and beautiful scenes such as Sharif's introduction, the long pan over the assault on Aqaba or the glorious reveal from a purple flag of Lawrence and Sheriff Ali leading their final army. 'Lawrence of Arabia' is a unique visual experience and one you will not forget in a hurry.Although it comes in at over three and a half hours, 'Lawrence of Arabia' never lulls and if not for the forced DVD intermission I doubt I would move at all while watching it. The innovative editing (including some of the most famous examples of direct-cutting) keeps the film moving at a brisk pace. There are no gratuitous scenes. Every scene is a required piece of the puzzle. Maurice Jarre's phenomenal music also helps keep the film going. I'm sure some of the scenes of people crossing the desert would have been tedious without his music, but with his majestic music transplanted over the images they are simply compulsive viewing. The epic action scenes are breath-taking in their scope and execution. But what gives them their impact is that Lean (perhaps limited by censorship laws) is not concerned with the visceral thrill of battle, but rather the effect they have on the battlers. What drives men to war and what do they get from it. And thankfully the action scenes are succinct and progressive with no blasted shaky-cam or CGI troops. Everything you see on screen is real and was performed, which just adds to the gob-smacking sense of the shots. It is this sense of realism that deepens the experience.If one's respect for 'Lawrence of Arabia' is not enamored after viewing the film, perhaps it will be when thinking that we will NEVER see a film like this again. No studio would take the risk of a project this big that excludes many of their 'key demographics' and 'film rules'. There are no talking parts for women. There is no love interest. There is no happy ending. 'Lawrence of Arabia' a product of Hollywood showing its balls, which for many a year it seems to have lost. 'Lawrence of Arabia' is an awe-inspiring Goliath of cinematic perfection. The best film I can lay claim to having seen."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0077857",
      "warningSpoilers": true,
      "date": "29 November 1999",
      "rate": "10",
      "helpful": "84 out of 125 found this helpful.",
      "title": "A film that literally excites the senses...",
      "content": "David Lean's \"Lawrence of Arabia\" is one of the few films that legitimately deserves to be called great It appears on virtually all \"ten best\" lists and reveals deeper layers of meaning with repeated viewings Lean, a man devoted to the art, gives \"Lawrence of Arabia\" its spectacular values... He unifies the sand and the sun to flame out the silver screen... Maurice Jarre's terrific music escorts the appearance and disappearance of the sun below the horizon in the sleepy desert...\"Lawrence of Arabia\" is a prodigious labor, a masterful mixture of fact and artistry, a masterpiece of intimate moment and spectacular largesse, a film that literally excites the senses... In a visual sense, Lean combines a sure sense of place with an approach to the action that he borrows from an unlikely sourceJohn Ford Lean turns his vast desert canvas into another Monument Valley, and when his Bedouins ride across it, they are not far removed from Ford's cavalry In many of the early scenes, the stately gait of the camel's walk gives the film a slower pace, and this is precisely what Lean is trying to achieve Lean even manages to surpass Ford with his understanding of the relationship between his characters and the landscape; how the desert changes those who go into it The film is the story of a solitary adventurer who always knew he was different, but in Arabia he discovers that his proportions are heroic... Perhaps this is the secret of Lawrence of the legends  that at the bottom of all the violent action is a protagonist about whom one cares... A puzzling personality whom one glimpses but never fully understands... Throuhout the picture one has a sense of a man discovering his own unique dimensions...Lawrence's mission, largely his own creation, is to unite the feuding Bedouin tribes under the leadership of Prince Feisal (Alec Guinness), and to keep the British politicians, as personified by Mr. Dryden (Claude Rains), from putting the Arabs under their colonial thumb after World War I is over It is accomplished through a semi-episodic series of battles and raids where Lawrence is sometimes accompanied by Ali (Omar Sharif) and Sheik Auda (Anthony Quinn), and equally difficult bureaucratic struggles he faces with Gen. Allenby (Jack Hawkins).All the conventional elements of the genre are at peaks of excellence here: The stretch desert with its white golden sands; peril, anywhere and everywhere; dangerfor Lawrence of Arabia is a film about guerrilla warfare; prowessLawrence crosses Sinai on foot; physical tortureLawrence in the hands of the Turkish bey; impossible mission Lawrence takes the seaport of Jordan from behind; ruthlessnessLawrence shouting 'take no prisoners' leading his men to put to death a Turkish column... Every component is here, everything one needs for a great adventure film, many spectacular sequences, each of them so perfect: Lean cuts to the sun again and again, turning it into a character; the scene in Feisal's tent when Lawrence first talks with the king; Lawrence striding on top of a captured train, parading before rows of cheering Arabs; the scene between Lawrence and Ferrer illuminating Lawrence's strange perversity, a mixture of masochism and repressed homosexuality; the scene when a Beduin prince appears on his camel, an exceedingly long take in which a strange figure is first resolved out of waves of heat and then, as he approaches, becomes a frightening threat to Lawrence's escort at the desert well...The photography, the script and the acting are so superb that \"Lawrence of Arabia\" becomes a lavish epic winner of 7 Academy Awards for Best Picture, Directing, Color, Cinematography, Sound, Muscial Score and Film Editing..."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1603271",
      "warningSpoilers": false,
      "date": "19 February 2007",
      "rate": "9",
      "helpful": "19 out of 26 found this helpful.",
      "title": "A Complex Man In Epic Events",
      "content": "Although having just watched Lawrence Of Arabia again though I am bowled over by the size of the epic, I still can't believe that for the entire length of the film, the word oil was not mentioned. If it were done today it sure would be.T.E. Lawrence's story fascinates people today more than ever because he was in the center of the events that gave us the Middle East we have today. In the previous century and a half questions about that area revolved around the Ottoman Empire, the so-called sick man of Europe for that conglomerate of territory spilled into quite a bit of Europe. What's to happen if one country gets control of the place should that aging and decrepit empire falls apart. The question was postponed right up to World War I when Ottoman Turkey committed itself to the Central Powers. It was time then for the various peoples still under Ottoman control to rise and rise they did. In Arabia a young staff officer named T.E. Lawrence gained the trust and confidence of many Arab leaders and had a lot to do with uniting them and forming an army to chase fellow Moslems, the Turks out of the area and helping the British and French win in the Eastern theater of World War I. If going native which was the expression used by the British for one of their's who starts to identify with those he's supposed to subjugate than T.E. Lawrence went native in a big way. When his fellow countrymen did not keep pledges made to his Arabs he opted for a life of obscurity which is what he got until his death in 1935.David Lean when he couldn't get Marlon Brando for the part, opted instead for a young Irish player named Peter O'Toole who he had seen in the Walt Disney version of Kidnapped two years earlier in a small role. It was a felicitous choice as O'Toole became the star he remains to this day as a result of Lawrence of Arabia.It's a complex role and one you have to keep the audience interested in for over four hours. O'Toole runs the whole range of emotions here. We see him as idealistic, as arrogant, as humble, as honorable, as a stone killer, even a bit of a fathead at times. Sometimes a few of these mixed together at different points. Although David Lean got him a stellar supporting cast, if your Lawrence isn't any good, the film would flop. But Peter O'Toole was up to the challenge, he got the first of seven Oscar nominations. In this particular year he had some stiff competition with Burt Lancaster for Birdman of Alcatraz, Jack Lemmon for The Days of Wine and Roses, Marcello Mastroianni for Divorce Italian Style and the eventual winner Gregory Peck for To Kill a Mockingbird.Omar Sharif also making his first film for a world market got an Oscar nomination for Best Supporting Actor. Such Lean veterans as Alec Guinness, Jack Hawkins, and Anthony Quayle got plum roles. Anthony Quinn and Arthur Kennedy are the Americans in this film. Kennedy plays the fictitious Jackson Bentley who is really Lowell Thomas. Presumably Lowell Thomas did not want his name used here, but Thomas got his career started in the news field by reporting on T.E. Lawrence in this backwater theater of World War I, making his name famous and launching Thomas's own career in the process.One thing ever so gingerly hinted at was T.E. Lawrence's homosexuality. You can see it in his relationship with the two young men Daoud and Farraj played by John Dimech and Michel Roy. There is the alleged incident of gang rape when he's taken by Turkish soldiers led by their commander at Deraa, Jose Ferrer. It too is part of Lawrence's story though if Lawrence of Arabia were made today, they would be far more explicit.They would also be more explicit about oil instead of these unnamed 'British interests' that Lawrence is supposed to be really concerned with. You do get the idea that all they're interested in is the right of transit in the Suez Canal and the right to say who has the right of transit.Still Lawrence of Arabia is one sweeping epic both capturing the grandeur of the Arabian desert with the complexity of the issues and the man surrounding the desert campaign in World War I."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2161672",
      "warningSpoilers": true,
      "date": "21 November 2009",
      "rate": "10",
      "helpful": "18 out of 24 found this helpful.",
      "title": "A sweeping epic with many layers of complexity",
      "content": "It's hard for the small screen to do justice to such a sweeping cinematographic epic, but there is much more to this film than its visual majesty. The film has one of the most beautiful and recognized scores in the history of cinema, a fascinating subject in the person of T.E. Lawrence himself, one of the most literate screenplays ever written, and a wonderful supporting cast nearing perfection. It is a shame that unless you take the time to buy the DVD and invest the almost four hours it takes to watch it, you are likely to miss out on one of the best films ever made. It is precisely because of its length that it is seldom seen on TV anymore. The backdrop of the film is that the British, in the midst of fighting World War I, are aiding the Arab struggle for independence from the Turks since anything that ties up the Turks accomplishes the British goal of destroying the Ottoman Empire and thus aids in the war effort. T. E. Lawrence is first enlisted to help advise the Arabs in their military goals, but goes on to lead them in a series of stunning military victories that goes way beyond what the British expected of the Arabs, and quite frankly, way beyond what the British wanted. You see, the British had designs on claiming Arabia for themselves after the war ends, years before it was discovered that Arabia was sitting on the world's richest oil supply.However, this is really an oversimplification of a very complex film. This movie is so multi-faceted that you could tackle reviewing it from several angles. To me one of the most fascinating aspects of the film is the complex relationship and contrast between Sheriff Ali (Omar Sharif), fellow tribesman and counsel to Prince Feisal, and T.E. Lawrence (Peter O'Toole). When the two first meet Ali shoots down Lawrence's Arab companion who is taking him to first meet Feisel because the man is drinking from Ali's well and does not have permission to do so. An outraged Lawrence chastises Ali citing that Arabia will never be great as long as they war amongst themselves and that he is \"barborous and cruel\". Towards the end of the film, though, there is a reversal of roles as Ali tries to stop a massacre that Lawrence is not only allowing his troops to participate in, but seems to be genuinely enjoying. Ali is a man who has a good bead on who he is and what he believes. Not having this quality is Lawrence's greatest shortcoming. Lawrence either believes he is much less than he is or much more, depending on his latest exploits and who has talked to him last. Ali clearly sees this problem, and by the end of the film Ali is Lawrence's fast friend - in fact his only true friend. You see, Lawrence is being used by both the Arabs and the British. This becomes immensely clear when at the end of the film Prince Feisel, who has always seemed to be genuine towards Lawrence, says during negotiations with the British \"Lawrence is a double-edged sword - We are equally glad to be rid of him, are we not?\". By the way, the role of Ali has to be Sharif's finest hour as an actor. I always thought Dr. Zhivago was that finest role, and it is still a great performance, but this one is even better.There are so many other themes going on in this film - the thin line between madness and heroism, the worth of a single human life versus the welfare of an entire army or a nation, the sometimes less than honorable motives behind those fighting for the honorable goal independence, the contrast between western and Arab values - that you could go on forever. That is why I strongly recommend this film. You'll probably come away with something a little different on each viewing."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8756187",
      "warningSpoilers": false,
      "date": "25 December 2022",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "One of the greatest films of all time.",
      "content": "Disobedient Army officer Lawrence attempts to unite several Arab tribes in a battle against The Turks during The Great War.Why has it taken me into my 40's to watch this masterpiece?Is it the greatest movie of all time, personally for me it isn't, but it can certainly make a claim to be, and I totally understand and appreciate why for so many, this is the ultimate movie.Not that I claim to be a historian, or even know the story or events that took placed, but based on what I just watched, this truly is a masterpiece. The story is captivating, it holds your attention, for what is let's be fair is a very, very long running time.I'm something of a novice when it comes to the great historical epics, from those I've seen, this is the standout.Peter O'Toole delivers possibly his greatest ever performance, his on screen presence is nothing short of enchanting, he is truly phenomenal here, I can think of no finer performance.I bet many fans went weak at the knees at the sight of Omar Sharif here, what an absolutely brilliant actor, what a vision.The scale of this film is incredible, and where modern films rely on CGI and special effects, this had none of that, relying only on people and animals, the sheers size, the stunts, the extras, it's a quite breathtaking feast for the eyes. The camera work is magical.What cinema goers in 1962 must have thought when they watched this.10/10."
    },
    {
      "username": "rbhagwat",
      "userUrl": "https://www.imdb.com/user/ur4416913",
      "reviewLink": "https://www.imdb.com/review/rw0984262",
      "warningSpoilers": true,
      "date": "23 December 2004",
      "rate": "10",
      "helpful": "294 out of 362 found this helpful.",
      "title": "Review-proof",
      "content": "I first saw this movie on a scratchy VHS almost twenty years ago (I was 10). Liked it (sort of-enjoyed the battle scenes and the train blowing up), but didn't understand why my dad was so crazy about it.The next time was on laserdisc (remember those?) almost 10 years ago and I was hooked. I finally got it - the conflict, the performances, the music, the dialogue - all mesmerising.But it was only in 2002, when I saw the 40th-anniversary reissue on 70mm that I was completely blown away seeing the scale, the enormity of Lean's accomplishment. There were scenes that gave me goosepimples (the opening credits, the cut from the matchstick to the desert sunrise, \"nothing is written\" - others too numerous to mention).The point of this rather rambling review is this - a movie that can evoke such passion in its admirers stands by itself, beyond reviews or criticism. If you haven't seen it yet I envy you, because you get to experience it for the first time."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0077801",
      "warningSpoilers": true,
      "date": "29 December 2001",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "Who, me? Neurotic?",
      "content": "When this film was released in 1962 I was seeing a shrink. Nothing serious, just the usual ontological Angst. You know, \"What's it all about?\" \"Why have I developed this sudden taste for houseflies?\" When I described my torment to him he tilted his head and asked, 'Have you seen Lawrence of Arabia'? Okay, this film has been analyzed to death, and with good reason. It's one of the best films ever made. David Lean has a way of doing things, and he's never done it better than here. 'The Bridge on the River Kwai' may be more watchable, if you're not in a patient mood, but isn't -- couldn't be -- more thought provoking.Every role seems played to perfection. Peter O'Toole is a marvelous Lawrence, Homeric and naive. Anthony Quayle, Jack Hawkins, Alec Guiness, all do their best, which is more than good enough. Each is a jewel of a performance. I don't think I've ever watched a funnier scene than the change on politician Claude Raines' face when Hawkins, as General Allenby of the British Army, tells Lawrence that the British have no ambitions in Arabia. Lawrence accepts his word. Raines is sipping champagne and his eyes drift upwards and his mouth purses with amused disbelief -- how could anybody like Lawrence be so damned stupid? The editing is unimpeachable. Everyone applauds Stanley Kubrick for his cut in \"2001: A Space Odyssey\", when the bone flung in the air becomes a space ship. It's like the moment at which the clucking chicken turns into a guitar in \"Sergeant Pepper's Lonely Hearts Club Band.\" But there's a more quiet and equally effective cut here, when T. E. Lawrence in Cairo blows out a match and in the blink of an eye we are watching a crimson sun rise over a desert horizon so flat and blank it looks drawn with a ruler.If you want an isolated example of good writing and direction, watch the scene in which Lawrence and his men derail a passenger train and shoot it full of holes, killing everyone aboard. Lawrence shouts a cease fire, but his Arabs pay no attention and continue to riddle the cars. He runs out in front of them, shouting, but they still fire on the train. It takes two flares to get them to come to a ragged stop. That's the way real life generally is -- messy, chaotic, and with a jagged edge. Then compare this with a similar scene in \"Khartoum,\" made shortly afterwards. During a battle, every extra follows direction and obeys every order at once, running and riding from place to place like figures in a video game. I won't even bring up more recent \"epics\" like \"Pearl Harbor\" and \"Titanic.\" The most tragic moment doesn't involve death but Lawrence's disillusionment. When his plans for Arabian independence collapse, he's called in for a final conference with General Allenby. His expression is vacuous, far away, his voice distant and distracted. As he turns to leave, Prince Faisal says to him, 'Of course, what I OWE you' -- and there is a quick shot Lawrence turning to leave the room -- 'is beyond evaluation.' But the next shot, lasting a second, is only of Lawrence's back swiftly disappearing through the curtain. How easy it would have been for a director less thoughtful than Lean, less respectful of the audience, to have Lawrence stop in the doorway -- give us a close up here -- turn back to Faisal and clearly state some sort of fateful exit line: 'You're all hypocrites,' or \"Frankly, my dear, I don't give a damn,\" or something. Then leave, while trumpets of triumph blare. Instead Lawrence gets in a truck and leaves the dust and the camels and the Arabs, unimportantly, dismally, heart-breakingly, behind."
    },
    {
      "username": "kenjha",
      "userUrl": "https://www.imdb.com/user/ur2590596",
      "reviewLink": "https://www.imdb.com/review/rw1357780",
      "warningSpoilers": false,
      "date": "2 May 2006",
      "rate": "8",
      "helpful": "15 out of 21 found this helpful.",
      "title": "Landscape of Arabia",
      "content": "The story of T. E. Lawrence as he fights for the Arab cause becomes a sprawling screen epic, magnificently photographed under the keen eye of Lean. The film made O'Toole a star and boasts an all-star. This is a fine film, but is extremely overrated. The plot, what little there is of it, is generally uninteresting and rambling, causing the middle part of the film to drag terribly. An hour or so could easily have been trimmed from the middle, thereby producing a tighter and more compelling story. The acting is uneven, with Guinness underacting and Quinn overacting as Arabs. Ultimately, though, the cinematography and score manage to compensate somewhat for the weaknesses in the script."
    },
    {
      "username": "bleakeye",
      "userUrl": "https://www.imdb.com/user/ur0988365",
      "reviewLink": "https://www.imdb.com/review/rw0077900",
      "warningSpoilers": false,
      "date": "2 March 2001",
      "rate": "10",
      "helpful": "125 out of 172 found this helpful.",
      "title": "Heroism brilliantly shown",
      "content": "When it come to making epics, David Lean is the master and what better proof than this masterpiece. \"Lawrence Of Arabia\" was first shown in 1962 and after almost 40 years later, it is still beautiful. The story of T. E. Lawrence is wonderfully brought to us by David Lean, director of another masterpiece called \"The Bridge On The River Kwai\".David Lean has shown us a man's long, yet never boring (at least for me) journey into the deserts of Arabia. Lawrence (Peter O'Toole) is an ordinary man that becomes a hero (at least in my eyes) during his extensive tenure in Arabia. He becomes a traveler, a great man, and a leader to the people that he has associated with. Only director David Lean could have given us a movie experience like this.An assortment of phenomenal actors are collected for this movie and what a cast! Peter O'Toole, Omar Sharif, Anthony Quinn, Alec Guiness and so much more portray their characters with intensity and believability. Never have I been so impressed. As Lawrence, Peter O'Toole plays the role of which his name is most associated with and is surprising for me that he made the role his own because before I got a chance to see this movie I imagined a man opposite from someone like Peter O'Toole. Omar Sharif as Ali is one of the most charismatic characters in film history. I will not say anymore about the cast because I'm allowed only 1,000 words to use in my comment.Will all do respect to classics such as \"Gone With The Wind\" and even \"Bridge on the River Kwai\"this is without a doubt the most exciting epic of all time. I highly recommend it!"
    },
    {
      "username": "nisitpav",
      "userUrl": "https://www.imdb.com/user/ur6043209",
      "reviewLink": "https://www.imdb.com/review/rw1157268",
      "warningSpoilers": false,
      "date": "24 August 2005",
      "rate": "10",
      "helpful": "261 out of 342 found this helpful.",
      "title": "The best movie of all motion picture history",
      "content": "I first watched \"Lawrence of Arabia\" when I was about 11 years old. Being a big fan of Steven Spielberg at that time, I was sort of awed by the fact that this was his personal favorite (check the \"conversation with Steven Spielberg\" featurette in the special features disk and you'll really see Spielberg's affection for that film)Over the years, Lawrence remained among my DVD collection, and I can't say I actually watched it since that first time, when, by the way, I didn't really like it. But \"time does things to movies\", and when I watched it again last year, I found my eyes to be weeping at the end. It instantly became one of my favorite movies.Since then I learned a lot about the history of cinema, and I also learned a great deal about the movies of Sir David Lean. I found my self watching films like \"Brief Encounter\", \"The Bridge on the River Kwai\", \"Doctor Zhivago\", \"Ryan's Daughter\", and the underrated, \"A passage to India\". Lean became one of my favorite directors, and, just a few months ago, I decided to watch Lawrence with some friends. Although I had seen it a couple of times before, this time it was a different experience altogether: from the starting credits, to the blowing of the match, the crossing of the Nefud dessert, finding Gassim and bringing him back to the camp, the invasion of Aqaba, his torture and rape (?), Lawrence's laugh after the slap by the \"outrageaous\" guy, his being left alone, to the final gaze to the motorcycle. I sensed something when I watched that film, which leaves my with the undoubted feeling that \"Lawrence of Arabia\" is the greatest film ever made. For me, this is it. Ever since '62, it's been a downfall. No other film has managed to reach Lawrence in its poetic greatness. Few do come very close (Vertigo for instance).If we are to classify the two complete different cinematic styles, it would be those of Hitchcock and Ford. Hitch was a very \"confined\" director. He captured his movies from the point of view of one character. His movies took place, most of the time, in closed spaces. In a sense, Hitchcock's films were a journey in people's emotions and a study in people's characters. On the other hand, Ford was an open director. He wasn't confined to one character, or one location, his films where actual journeys. His basis was mostly on theme, and his main ability was to amaze with his imagery. Thus, these are the two different shooting styles....Well, Lean combines both.Which is basically why his best film, Lawrence, is the best film of all times. But not only in terms of style. Also, in terms of content. The intelligent script written by Robert Bolt, the powerhouse performances by O'Toole and Shariff (a shame they didn't get the statuette), but also, the ultimately heroic yet tragic figure of T.E. Lawrence, contribute in making this the most visually and emotionally sweeping film of the last 111 years.Such a shame that Lean retired for 14 years after \"Ryan's Daughter\", there's no way to know where he would have gotten."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1395420",
      "warningSpoilers": false,
      "date": "17 June 2006",
      "rate": "8",
      "helpful": "26 out of 44 found this helpful.",
      "title": "Memorable Visuals, Sound & Acting, Yet It Peters Out",
      "content": "I'm doing this review despite not having seen the movie in a number of years but what I remember best is some fantastic desert cinematography from the point when \"Lawrence\" (Peter O'Toole) arrives in the desert until about the last third of this 3-and-half-hour film. There are just numerous spectacular desert scenes and, of course, this was a must to be seen in widescreen. Fortunately, that has been available for many years, even on VHS. Between the direction of David Lean and the photography of Freddie Young, this is a fabulous visual treat, one to be treasured.Unfortunately, the story as well as the great visuals, seem to dissipate in the last hour-plus of the movie. It just kind of peters out, like Lawrence's desert campaign.The acting is superb with the possible exception of Anthony Quinn, who overacts. Two of the all-time greats - Alec Guiness and Omar Sharif - also added life to this monumental epic story. This was O'Toole's first role, too, and probably his most famous and some think his best. After this film and for a short period afterwords, O'Toole was looked upon as the premier actor in the business.For a film this long and with such little action, it's amazing it entertains as well as it does. For those who need some pretty women to aid in the story, forget it: in fact, there are NO women that I can remember. It gets by with the cinematography, O'Toole intense acting portraying a real-life vain, courageous, stubborn and obsessed Englishman trying to unite the Arabs to fight the Turks.Another very memorable and impressive aspect of this movie was the soundtrack. Is it my imagination or were soundtracks (like this one) more important and remembered better than movies in the last quarter of a decade? The main theme song is played throughout the film and I still remember it 44 years later."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2683533",
      "warningSpoilers": false,
      "date": "4 October 2012",
      "rate": "",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Marvelous Epic",
      "content": "Lawrence of Arabia (1962) **** (out of 4) I'm really not sure I could add anything original to what has already been said about David Lean's masterpiece epic. The story is pretty simple as for nearly three hours we follow T.E. Lawrence (Peter O'Toole) who rises to the top as a hero but quickly things take a turn for worse. LAWREANCE OF ARABIA is certainly one of the most memorable epics that has ever been made and I think it's one of those films that just beg for a large screen and in particular a theater screen. Watching it at its 50th Anniversary re-release, one really has to be amazed at the pure grand scale of it all. Did it have to run for nearly three hours? Probably not but if you took anything out of the picture it simply wouldn't have that epic feel. Today movies are long for no reason what so ever whereas in the past and with films like this they were long for a purpose. The film is pretty much flawless but I think the greatest thing it does is the visual scale of everything. Those opening shots of the desert are just marvelous to see on a large screen and those beautiful shots of the sun rising and falling. The entire scope of the sand, the mountains and the eventual battles are just something truly marvelous to behold. It's also important that the story itself didn't get lost in this massive production and Lean really does a remarkable job at telling the story and especially during the second half when the film really does focus on Lawrence and his downfall. O'Toole, Alec Guinness, Jack Hawkins, Omar Sharif and Anthony Quinn are all marvelous in their performances and you really can't see anyone else playing the parts. Add in the marvelous score, the wonderful cinematography and you've really got a film that deserves its legendary status."
    },
    {
      "username": "poofta1970",
      "userUrl": "https://www.imdb.com/user/ur4009562",
      "reviewLink": "https://www.imdb.com/review/rw0939999",
      "warningSpoilers": true,
      "date": "3 October 2004",
      "rate": "10",
      "helpful": "216 out of 294 found this helpful.",
      "title": "I am totally gobsmacked!",
      "content": "I am totally amazed by some of the negative responses to this film. Yes it is a long film; a very long film. Perhaps this is a symptom of the short attention spans of people today. But you know what? I wish it was 3 or 4 times longer. Every time this film finishes I compare it to the badly acted special effects laden rubbish that passes for 'epic' cinema these days and wish that T.E Lawrence had his motorcycle accident at 93 (rather than 47 as he did in 1935) so I could have had more of Peter O' Toole's electrifying performance.The cinematography is acknowledged as being some of the the best in any film ever. When Mr Lean wanted to capture a sun rise, he stood in the dark (in a REAL desert) and waited for the sun to REALLY rise (No computerized nonsense in this film). As for the reviewer who thought Lawrence looked like a homosexual because he had a 'effeminate' walk, well ... I can only hope that one day he joins the 21st century; hero's aren't all musclebound apes, leaders aren't all fluffy paragons of virtue, and so what if he did turn out to be homosexual?If you and you dad like watching a man being whipped before being violated there is, I believe, a wealth of material available to cater for your taste at your local pornography shop.In my opinion its one of the best films ever made and certainly the best film I've seen based on real events.Forget the length feel the quality."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2160301",
      "warningSpoilers": true,
      "date": "19 November 2009",
      "rate": "",
      "helpful": "18 out of 29 found this helpful.",
      "title": "I Like My Epics Gay",
      "content": "\"It's no wonder that nearly all the great founders of religion came out of the desert. It makes you feel terribly small, and also, in a strange way, quite big.\" – David LeanSome brief points...1. Of all of David Lean's films, \"Lawrence of Arabia\" is perhaps his most beautiful. Here's a director who waited months for the perfect sunset, who spent hours composing every shot. 2. Virtually every other sequence in \"Lawrence of Arabia\" is logistical nightmare, Lean having to frame grand compositions, choreograph huge crowds, build vast sets and manage hordes of animals.3. Lean's \"Attack on Aqaba\" sequence is staggering. Lean built an entire town, with over 300 buildings, all for a single unbroken shot which tracks an army as it swarms a coastal city. When Lean's camera finally draws to a halt, revealing the Mediterranean Sea and Aqaba's massive coastal cannons, we can't help but gasp.4. A super influential film. You look at \"Lawrence\" today and you see bits of \"Star Wars\", \"Close Encounters\", \"2001: A Space Odyssey\", \"Indiana Jones\", \"Kingdom of Heaven\" etc, all over the place. The film contributed hugely to our cinematic vocabulary.5. Unusual for a film this size, there was no second unit photography. Lean shot everything himself, too much of a perfectionist to abdicate duty.6. Though it attempts to convey the intricacies of imperialistic politics and touches upon racial difference and homosexuality, the film's sense of geography and politics are a bit muddled, and its portrayal of Thomas Lawrence hardly factual. Indeed, because of people like Lawrence, and various other events, both before and after the infamous Sykes-Picot agreement, the Middle East was carved up and artificially divided for the very purpose of destabilisation and proxy rule. The problems of this period extend to our era.7. In his biography, Lean states: \"I think the whole of this creativity is sex. There's no two ways about it. And if you want to go and make a good movie, the fact of it is that sex is terribly important. If you want to make a good movie, get yourself a new, wonderful woman and that movie will be fifty, if not seventy, percent better than it would have been if she hadn't existed. It lights everything up. You see, I think lack of energy and tiredness is sexual failure.\"8. In a way, the film's also about Lean himself, and the way the alienation of Lawrence's homosexuality mirrors that of the artist. Lean was born to strict Quaker parents who banned him from going to the cinema. In response, he developed a fondness for the desert and a passion for exotic locales (on screen and off). \"Lawrence of Arabia\" itself almost plays as a kind of autobiography, a story about a man/director who travels to the desert, falls in love with its people, gains wealthy financing, has a grand vision and realises his dreams by managing, inspiring and directing thousands of men. In a way, the film is less about Lawrence the man than it is about creativity as a kind of libidinal drive; a sort of big budget take on Freudian sublimation, creative energy stemming directly from the libido.9. Watching the film again, its amazing how preoccupied it is with personal identity and sexuality. The film opens with a scene which demonstrates that \"nobody really knew who Lawrence was\" and that any effort to \"sketch\" him on screen is \"an exercise in futility\". Later in the film a man ominously shouts \"Who Are You?\" when he sees Lawrence, and all throughout the film Lawrence is seen to be extremely conflicted, unsure how to act, how to dress, unsure of his very place in the world. Is he Arabic? Is he British? Is he masculine? Is he feminine? Which culture does he most identify with? Why has he turned his back on his country?10. Of course Peter O'Toole portrays Lawrence as a very effeminate man. He's homosexual, sexually repressed and sexually conflicted. This is a guy who's psyche is so damaged by being rejected and alienated that his ego compensates by writing its own history, by creating an image of himself as an \"epic hero\", the \"perfect man\" who conquers nations and rallies thousands behind him. Watch how he admits to being sexually aroused by guns and sadomasochism, but reacts violently when a foreign General makes homosexual advances toward him. It's almost as though Lawrence's entire \"hero persona\" simply extends from this timid guy's desire to assert his own sexuality.11. The film is suffused with sexual innuendos and homosexual jabs, ranging from subtle lines (\"That's not the kind of man I am!\") to more blatant signals (Lawrence dancing alone, obsessed with shaving etc).12. Interesting too is the way Lean and screenwriter Robert Bolt turn Lawrence's masochism into a kind of psycho-sexual anti-war statement. After taking part in a massacre, Lawrence slowly turns his back on his masters. \"War is the villain of the piece,\" screenwriter Robert Bolt would say years later, \"for it takes this fine and hardy man and turns his own best qualities against him, filling him with revulsion for himself.\" 13. The film is often praised for its visuals, but few mention how innovative Lean's sound design is. Lean uses the wind as music, makes excellent use of ambient or incidental noises and uses bubbles of silence to create some extraordinary moments of tension. He creates a wonderful aural tapestry.8.5/10 – This may be the gayest epic of all time."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2964523",
      "warningSpoilers": false,
      "date": "20 February 2014",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "One of the greatest movie of all times",
      "content": "T.E. Lawrence (Peter O'Toole) has a minor function in Cairo during WWI. Nobody really cares about the Bedouin uprising against the Turks except for Lawrence and the Arab Bureau. He's sent for 3 months since he would be of no great lost. He learns the ways of the desert, and memorably encounters Sheriff Ali (Omar Sharif) at a well. He finds Prince Feisal (Alec Guinness) harassed by superior weapons, and the British unwilling to take Aqaba from the sea. So Lawrence proposes to take Aqaba from the desert and Feisal gives him 50 men.Director David Lean's vision is absolutely beautiful. The desert is beyond gorgeous. Peter O'Toole is brilliant. There is nothing inferior. It is all first rate. The bigger the screen, the better the movie looks. This is simply one of the best of all times."
    }
  ],
  "errorMessage": ""
}