{
  "imDbId": "tt0092005",
  "title": "Stand by Me",
  "fullTitle": "Stand by Me (1986)",
  "type": "Movie",
  "year": "1986",
  "items": [
    {
      "publisher": "Empire",
      "author": "Emma Cochrane",
      "link": "https://www.empireonline.com/movies/reviews/stand-review/",
      "rate": "100",
      "content": "The entire cast is superb and it so perfectly paced, that the story unfolds with wit, pathos and sensitivity and completely free of emotional shortcuts."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Sheila Benson",
      "link": "https://www.latimes.com/entertainment/movies/la-et-mn-stand-by-me-review-20160820-snap-story.html",
      "rate": "100",
      "content": "Stand By Me is the summer's great gift, a compassionate, perfectly performed look at the real heart of youth. It stands, sweet and strong, ribald, outrageous and funny, like its heroes themselves--a bit gamy around the edges, perhaps, but pure and fine clear through. It's one of those treasures absolutely not to be missed."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/books/8566133/25-years-of-Stand-by-Me.html",
      "rate": "100",
      "content": "Stand By Me is one of those films that stands up to the test of time. It may never top any critic’s “films of the century” list, like Citizen Kane, or Raging Bull, but it has a charm and depth that seems to resonate with each generation."
    },
    {
      "publisher": "Time Out London",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "The Ben E King theme song and all the imagery of tousled adolescents preening themselves like miniature James Deans rekindle memories of old jeans commercials, but the film is so well-observed and so energetically acted by its young cast that mawkishness is kept at bay."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/stand-by-me",
      "rate": "88",
      "content": "The richness of its tapestry, densely woven from human emotions and character interaction, ensure it will never lose that relevance."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Chris Nashawaty",
      "link": "https://ew.com/article/2011/03/17/stand-me-2/",
      "rate": "83",
      "content": "Rob Reiner’s film is all about the journey, not the destination. And all of his young actors are great — Wheaton as the sensitive narrator, Feldman as the slightly crazy wild card, and especially Phoenix as the tough-yet-tender doomed soul."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "https://content.time.com/time/subscriber/article/0,33009,962128,00.html",
      "rate": "80",
      "content": "Stand By Me is a shuck. It trumpets its sensitivity while reveling in coarseness. And at its climax it suggests that manhood can be found through the barrel of a gun. Maybe this is how Rambo discovered puberty. Maybe real kids should be discouraged from following his example."
    },
    {
      "publisher": "IGN",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Stand by Me is easily one of the best Stephen King adaptations and one of the best coming-of-age stories ever made."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/stand-by-me/review/2030279608/",
      "rate": "75",
      "content": "A sentimental film that works because of its unsentimental moments--in particular, its sometimes embarassingly honest portrayal of what interests boys and how they talk about it. Reiner elicits some excellent performances from his young cast (River Phoenix is a standout) and Kiefer Sutherland is memorable as a menacing teen hood."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://www.nytimes.com/reviews/movies?res=9B02E3DF153AF93BA3575BC0A960948260",
      "rate": "40",
      "content": "Some of their horsing around, 1950ish style, is comical, but too much of what they do is only too plainly imposed by the movie makers. Rob Reiner's direction hammers in every obvious element in an obvious script."
    }
  ],
  "errorMessage": ""
}