{
  "imDbId": "tt1675434",
  "title": "The Intouchables",
  "fullTitle": "The Intouchables (2011)",
  "type": "Movie",
  "year": "2011",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/intouchables-the",
      "rate": "88",
      "content": "Enjoy this movie for what it is - the kind of motion picture that can cause Champaign-like giddiness - and don't obsess over how true-to-life this work of fiction is."
    },
    {
      "publisher": "Salon",
      "author": "Andrew O'Hehir",
      "link": "https://www.salon.com/2012/05/22/the_intouchables_racial_comedy_french_style/",
      "rate": "80",
      "content": "Let me come clean right now and tell you that I enjoyed The Intouchables quite a bit. If you're looking for a lightweight summer change of pace, with just a smidgen of Continental flair, here it is."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "67",
      "content": "The power dynamic may charm the French, but it's likely to push the cringe buttons of local moviegoers in Obama's post-\"The Green Mile America.\" Apart from the wince-inducing moments, The Intouchables is often a pleasant buddy picture."
    },
    {
      "publisher": "Movieline",
      "author": "Stephanie Zacharek",
      "link": "http://movieline.com/2012/05/24/review-at-last-america-can-live-love-laugh-with-french-megahit-the-intouchables/",
      "rate": "60",
      "content": "Actually, The Intouchables isn't bad - its merely shameless, but at least it's overtly so."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Sam Adams",
      "link": "https://www.avclub.com/the-intouchables-1798172933",
      "rate": "58",
      "content": "Sy and Cluzet give their parts more conviction than they deserve, even when the former is forced to re-enact the falsetto-singing-in-the-bubblebath bit from Pretty Woman. But even their energy can't revive a corpse this dead."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/untouchables-intouchables-film-review-240178/",
      "rate": "50",
      "content": "Corny, calculating and commercial...Their slickly executed culture-clash character piece is stuffed chock full of hard-knock life lessons that owe much more to the conventions of the screen than the tough realities of social deprivation and of the severely handicapped."
    },
    {
      "publisher": "Time Out",
      "author": "Keith Uhlich",
      "link": "",
      "rate": "40",
      "content": "Cluzet and Sy nonetheless make for ingratiating foils; the extended opening sequence in which the duo outwits a pair of cops like a hell-raising Laurel and Hardy could be a stellar short comedy if it weren't married to the deadly self-serious shtick that follows."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Joseph Jon Lanthier",
      "link": "",
      "rate": "38",
      "content": "A cheeky dream-drama about the friendship between a rich, white quadriplegic and a penurious black job-seeker, the premise of The Intouchables alone nearly renders analysis redundant."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/2011/film/reviews/untouchable-1117946269/",
      "rate": "20",
      "content": "Though never known for their subtlety, French co-helmers/scripters Eric Toledano and Olivier Nakache have never delivered a film as offensive as \"Untouchable,\" which flings about the kind of Uncle Tom racism one hopes has permanently exited American screens."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "",
      "rate": "20",
      "content": "The plot becomes disastrously condescending: the black man, who's crude, sexy, and a great dancer, liberates the frozen white man. The handsome Omar Sy jumps all over the place, and he's blunt and grating. Francois Cluzet acts with his eyebrows, his nose, his forehead. It's an admirable performance, but the movie is an embarrassment. [28 May 2012, p.78]"
    }
  ],
  "errorMessage": ""
}