{
  "imDbId": "tt0054215",
  "title": "Psycho",
  "fullTitle": "Psycho (1960)",
  "type": "Movie",
  "year": "1960",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-psycho-1960",
      "rate": "100",
      "content": "What makes Psycho immortal, when so many films are already half-forgotten as we leave the theater, is that it connects directly with our fears: Our fears that we might impulsively commit a crime, our fears of the police, our fears of becoming the victim of a madman, and of course our fears of disappointing our mothers."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/11025424/Psycho-review.html",
      "rate": "100",
      "content": "Hitchcock's mischievous genius for audience manipulation is everywhere: in the noirish angularity of the cinematography, in his use of Bernard Herrmann's stabbing string score, in the ornithological imagery that creates a bizarre sense of preying and being preyed upon."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Bill Weber",
      "link": "",
      "rate": "100",
      "content": "Felt in the full impact of a theatrical screening (with the pleasure of seeing patrons reflexively kick or stiffen at the sight of Miles startled by her mirrored reflection), its power is not just that of a showman’s calibrated scare machine, but of a somber fugue on the trapped 20th-century creatures who inhabit its world, clawing but never budging an inch."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/psycho-review/",
      "rate": "100",
      "content": "Timeless classic. Superb performances and the infamous shower scene make this the perfect nightmare."
    },
    {
      "publisher": "The New Yorker",
      "author": "Richard Brody",
      "link": "https://www.newyorker.com/culture/richard-brody/the-greatness-of-psycho",
      "rate": "100",
      "content": "Psycho, in its dark and sordid extravagance, remains utterly contemporary, in its subject as well as in its production."
    },
    {
      "publisher": "",
      "author": "New York Daily News",
      "link": "https://www.nydailynews.com/entertainment/psycho-mind-teasing-terrifying-1960-review-article-1.2260158",
      "rate": "100",
      "content": "The obvious thing to say is that Hitch has done it again; that the suspense of his picture builds up slowly but surely to an almost unbearable pitch of excitement. Psycho is a murder mystery. It isn’t Hitchcock’s usual terrifier, a shocker of the nervous system; it’s a mind-teaser."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1960/film/reviews/psycho-1200419814/",
      "rate": "90",
      "content": "Perkins gives a remarkably effective in-a-dream kind of performance as the possessed young man. Others play it straight, with equal competence."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/psycho",
      "rate": "88",
      "content": "Psycho is a brilliant excursion into fear that pushes many of our primal buttons, but it lacks the story and character complexity of Vertigo and Rear Window."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=EE05E7DF173DE273BC4F52DFB066838B679EDE",
      "rate": "70",
      "content": "The consequence in his denouement falls quite flat for us. But the acting is fair. Mr. Perkins and Miss Leigh perform with verve, and Vera Miles, John Gavin, and Martin Balsam do well enough in other roles."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://time.com/vault/issue/1960-06-27/page/53/",
      "rate": "50",
      "content": "What is offered instead is merely gruesome. The trail leads to a sagging, swamp-view motel and to one of the messiest, most nau seating murders ever filmed. At close range, the camera watches every twitch, gurgle, convulsion and hemorrhage in the process by which a living human becomes a corpse...The nightmare that follows is expertly gothic, but the nausea never disappears."
    }
  ],
  "errorMessage": ""
}