{
  "imDbId": "tt0054215",
  "title": "Psycho",
  "fullTitle": "Psycho (1960)",
  "type": "Movie",
  "year": "1960",
  "items": [
    {
      "username": "telegonus",
      "userUrl": "https://www.imdb.com/user/ur1116241",
      "reviewLink": "https://www.imdb.com/review/rw0072083",
      "warningSpoilers": false,
      "date": "5 September 2001",
      "rate": "10",
      "helpful": "348 out of 369 found this helpful.",
      "title": "It's the Little Things",
      "content": "So much has been written about this film that all I can do is add my own voice of approval and say that I consider it to be a masterpiece, and add a few things often overlooked or not commented on that add so much to the movie's cumulative power. It's often the little things that make a film work. Here are a few examples:a.) The absolute realism of the first twenty minutes of so, which are so true to life that they might have come from a documentary on how people lived in America forty years ago. There isn't a false note,--or a missed one--as each vocal inflection and raised eyebrow carries great meaning even if, on the surface, not much appears to be happening.b.) Marion and the motorcycle cop. The cop is dark and sinister in appearance, due mostly to the bright desert sun, and never takes off his sunglasses. His conduct is at all times professional; he never raises his voice, and comes across as calm and rather perceptive; and he seems truly concerned over Marion Crane's fate, though he is unaware of her actual predicament. Marion is, alas, a bad actress, and the cop sees through this, if not to the heart of the matter, yet we don't want him to follow her. Despite his appearance the cop is not the angel of death but rather Marion's last chance. Had she confessed to her crime she would have escaped the fate that awaited her; and if she had just been a little less clever, and driven more slowly, and the skies remained clear, he might have followed her to the motel and intervened on her behalf.c.) California Charlie. John Anderson is wonderful as the fast-talking, semi-streetwise small town used car salesman. At the end of almost every other line of dialogue he seems on the verge of discovering who Marion really is, then pulls back or comes to the wrong conclusion. He senses that she is being watched by the cop; but he also wants to make a sale. The scenes at the used car lot are both highly realistic,--and perfectly acted and timed--and also a little frightening, from the opening, \"I'm in no mood for trouble\", to the final \"hey!\" just before Marion drives away. We know that something isn't right, but the problem isn't with the car lot; it's Marion's plight casts a dark shadow over all her scenes there, despite the brightest sunlight imaginable.d.) Chitchat with Norman. Once Marion and Norman settle down for a light meal in the parlor their conversation turns to general things, and Norman is a good observer, if a bit awkward socially. Without actually lying Marion gives herself away with a throwaway line (\"Sometimes just once is enough\", in a reference to private traps) and Norman seems to catch her drift, if not the actual meaning of what she's saying, and allows it to pass. We can see that he is moody when he angrily leans forward and delivers an angry, though controlled tirade against putting people in institutions. Every camera angle and line of dialogue in this scene has meaning and carries enormous weight, and yet the drama plays out in a light, relaxed mode, and the performers seems truly connected to one another at its conclusion, strangers no more. This is in my opinion the best written and most beautifully acted, edited and photographed scene I have ever seen in a movie. The handling of every nuance is prodigal and masterful, and the end result nothing less than staggering.e.) The sheriff's house. When Sam and Lila wake up the sheriff and his wife in the middle of the night we see a splendid example of people talking to one another without either party understanding what is in fact going on. The result is a mini-comedy of manners; but it is also good exposition, as we learn of Mrs. Bates' death (and the dress she was buried in, \"periwinkle blue\"). John McInyre's sheriff dominates this scene (and no other), and expertly delivers its punchline, \"Well if that's Mrs. Bates in the window, who's that buried up in Greenlawn Cemetary\".f.) Arbogast and Norman. The private detective's interview with Norman is played low-key, and yet we sense the tension in Norman's voice and manner, and know that Arbogast does, too. Something is amiss. This is beyond the question of who killed Marion. The stakes feel very high in this sparring match, and though Norman wins on a technicality, we know that Arbogast is coming back for more.g.) The shrink's explanation. This part of the film has been criticized by many for being a sop thrown to the audience. I disagree. After all, the movie came out in 1960, and by the standards of the time some explanation seems in order, and Dr. Simon Oakland is as good a man for the job as I can imagine. His analysis of Norman's pathology is cogent and extremely well delivered. Yet throughout his speech, with all its Freudian brilliance, the doctor offered a take on the story that we in the audience, even if we can accept it, can never be satisfied with. He can explain the character of Norman Bates rationally, but he cannot make our response to his story and its effect on us feel ultimately safe, feel somehow in control and finalized. Yes, one can put people like Norman under the microscope, and even dissect what one sees, but this doesn't stop such events as unfolded in the movie any less likely to occur. Ask Milton Arbogast. In conclusion I'd like to say that great films are made up of outstanding little things, not just big moments or fancy effects. There is in fact nothing fancy about Psycho, which is on the surface is a somewhat plain-looking movie. Only when one looks beneath the surface does one see the teeming millions of small things,--gestures, glances, sudden changes in lighting, razor-sharp editing, and all above the refusal on the part of the director to let any one factor dominate--that we understand the meaning of the word genius, the meaning of the word creative."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3670710",
      "warningSpoilers": false,
      "date": "25 March 2017",
      "rate": "10",
      "helpful": "48 out of 52 found this helpful.",
      "title": "Always holds me from beginning to end...",
      "content": "...from the first time I saw it at age 14 until today whenever I run across it.This is the rare example of a much-ballyhooed film that is truly deserving of all the hype surrounding it. It would have been nice to have experienced the film without any knowledge of the plot twists. Unfortunately, for most viewers, the big surprises are not possible since so many of the scenes are part of our popular culture.There were, however, so many unexpected surprises. The opening scene with Janet Leigh and John Gavin in the hotel room was amazing and (pardon the cliché) so real. Hitchcock and Janet Leigh did a brilliant job of pulling us into Marion Crane's story, that of a woman in love with a divorced man who might as well be married considering his heavy financial obligations that leave him unable to marry in a practical sense even though he can in a legal sense. He doesn't even have a proper home - just a room in the back of the store he owns. Marion is then seemingly set up as the center of the movie as she thinks she has found a solution to her problems - a felonious one. Then the focus is skillfully shifted to the Norman Bates character as the \"protagonist\" victimized by his insane mother (or so it seemed) and then the focus is shifted once again to Marion's sister's search. The movie was adapted from a novel so some of the original audience would have been familiar with the plot of the book. In the novel, Norman Bates was a middle-aged man. I think it was a brilliant stroke to have the Norman of the film as a man in his twenties, a boy who never grew up in a man's body. Anthony Perkins is so identified today with his role of Norman Bates that it was surprising to see how endearingly he played him in the early scenes. And he did one of the best stammers I've ever seen in a movie when he was being questioned by the private detective (Martin Balsam) who is also searching for Marion. I also wasn't expecting to see how protective the local sheriff and his wife were of Norman when they were being questioned about him and his mother. You could tell they didn't want somebody (Norman) whom they thought had been dealt a bad hand to have anymore publicity and scrutiny than he already had.This film is mentioned in the documentary \"Moguls and Movie Stars\" as an example of how films were becoming more like TV as the 60s began - spartan art design and a script that was bold in the amount of sex and violence it had, even if the vast majority is implied. You have to be impressed by the versatility that is Hitchcock. Making movies in England? No problem. Making movies in the American studio system? No problem. Modernizing to deal with the evaporation of the production code? Again, no problem. Weird factoid - for you TCM fans out there Robert Osborne is credited as \"man\" in Psycho, although I don't remember him ever mentioning it. The only person it could possibly be unless he never comes close to having his face on camera is the parson as the sheriff and his wife are exiting church. See what you think."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1506203",
      "warningSpoilers": true,
      "date": "25 October 2006",
      "rate": "10",
      "helpful": "170 out of 196 found this helpful.",
      "title": "The More I See This, The Better It Gets",
      "content": "When I watched this for the first time in over 30 years, I was surprised how little action there was since I had remembered this as some intense horror movie. Of course, I was young and more impressionable so I guess I just remembered those few dramatic, sensational scenes such as Janet Leigh murdered in the shower and the quick other murder at the top of the stairs. Basically, that was about it, action-wise, BUT I have no complaints because the more I watch this film, the more I like it. It has become my favorite Alfred Hitchcock movie, along with Rear Window.I mention the lack of action, and blood, too, because younger people who might be watching this for the first time are not going to see the kind of horror film they're accustomed to seeing. A generation back, movie makers tended to build up characters and suspense, so there was a lot more storytelling and less action than you see today. Also, this movie doesn't have the shock value today for audiences, either, not after years of Freddie Krueger-type blood-and-guts seen in the past 30 years.But, what you WILL see in this movie is (1) superb acting; (2) a fascinating lead character; (3) excellent photography, and (4) a bizarre story.\"Norman Bates\" is one of the most famous fictional names in film history, thanks to this film and the great work portraying him by Anthony Perkins. \"Norman\" is a nutcase, as it turns out and the more you know all about him, the more fun it is to study Perkins and his character \"Norman\" in subsequent viewings. He really has the guy down pat. However, it isn't just Perkins' film; the supporting is just fine with Leigh, whose figure is still awesome no matter how many times you see it; Martin Balsam as the private detective; Vera Miles and John Gavin. Everyone contributes.What makes me really enjoy this movie is the cinematography. I bought this on VHS when it became available on widescreen. Later, of course, I got the DVD. Each time, I appreciate John Russell's camera-work and Hitchcock's direction more and more. I wonder if this isn't Hitchcock's best job of directing as his camera angles and lighting are outstanding. On the DVD, the blacks, whites and grays are just super and the famous house next to the Bates Motel never looked better. That house really looks eerie.The sound effects in here don't hurt. When Balsam is attacked, the accompanying frightening music never fails to bring chills down my spine. The music literally \"screams\" at you.I went 35 years between showings but now have watched this five times in the past four years. I love it and look forward to seeing it again. Many people here think this is Hitchcock's greatest film. Add me to that list."
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw0072358",
      "warningSpoilers": false,
      "date": "10 August 2004",
      "rate": "10",
      "helpful": "226 out of 268 found this helpful.",
      "title": "Movie At The Crossroads Of Time",
      "content": "What can you say about a film that's been talked about to death? Just this: If you've never seen it, you owe it to yourself to do so, not because it's a way of paying homage to the one true master of modern film, but because it's so fun to watch.Janet Leigh plays a bored office drone who decides to steal some loot from her boss's obnoxious client and parlay it into a new life with her all-too-distant boyfriend. All is going more or less according to plan until she stops in at the wrong motel, where she befriends a friendly if somewhat nerdy desk clerk only to find it causes problems with that clerk's possessive mother, who as her boy explains, \"is not herself today.\" I'll say she isn't, and so would Leigh's Marion Crane, who maybe should have put up that \"Do-Not-Disturb\" sign before taking a shower.You can feel the decade literally shifting out of '50s and into '60s with this one. Even the opening shot, where the camera looks over a Western U.S. city in the middle of the afternoon and zooms in on what looks exactly like the Texas School Book Depository overlooking Dealey Plaza. Norman Rockwell touches abound, like the decor of the motel, but look at what's going on around it. People dress well, they still wear fedoras and jackets, but in their tense conversations and hooded gazes you can feel the culture just ticking away like a time bomb waiting to explode.Most especially, there's Anthony Perkins, who plays motel clerk Norman Bates in a very oddly naturalistic way, complete with facial tics and half-swallowed words, not the polished image one expected to see then. Just compare him with John Gavin, who plays Marion's boyfriend in the standard-actor-of-the-day way. Perkins manages to be so weirdly magnetizing, even in small moments like the way he stumbles on the word \"falsity\" or notes how creepy he finds dampness to be.He shines in bigger scenes, too, like his tense chat with Martin Balsam's boorish but diligent private detective character, Arbogast, who along with Perkins and Leigh delivers a landmark performance. The way both actors play out the awkwardness in their conversation makes you literally sweat. Then again, you're always uneasy around Norman. You definitely feel wary of him right away, but you find yourself liking him, too, even when he's busy covering up \"Mother's\" misdeeds. Not since Bela Legosi played Dracula did you get a horror movie with such a compelling central figure.If you are sampling the many other comments here, be sure to look up Merwyn Grote's. He makes an interesting, compelling case for how director Alfred Hitchcock used his television series as a template for \"Psycho.\" Certainly \"Psycho\" looks more like early 1960s television than any of the more sumptuous fare Hitchcock had been bringing to screen at the time. Not only is it in black-and-white, not color, but the sets; a ramshackle motel, a mothbally old house, a couple of cheap looking bedrooms, a bathroom in a used-car dealership, are deliberately low class.It's thrilling to see Hitchcock move so effectively outside his normal element, and move things along with such clinical detachment and low-key technical finesse. Thrilling, too, to realize this is one of his most accomplished products; made by a man who was experienced enough to know how the game was played, and daring enough still to break the rules; indeed, start a whole new ballgame.Is it the best Hitchcock movie? It's definitely one of his best, right up there with \"The 39 Steps\" and \"Strangers On A Train\" and \"Sabotage\" and \"Shadow Of A Doubt.\" He only once again came close to making as good a film, with \"The Birds,\" while Janet Leigh and Anthony Perkins never escaped the greatness they helped create here. Poor John Gavin had to quit the biz entirely, and became an ambassador.Often imitated, parodied, referenced, and analyzed to death, \"Psycho\" still isn't played out nearly 45 years after it came out. You owe it to yourself to pay a visit to the Bates Motel; Norman has a room ready."
    },
    {
      "username": "arichmondfwc",
      "userUrl": "https://www.imdb.com/user/ur4238363",
      "reviewLink": "https://www.imdb.com/review/rw3711438",
      "warningSpoilers": false,
      "date": "19 May 2017",
      "rate": "10",
      "helpful": "131 out of 140 found this helpful.",
      "title": "Anthony's Norman",
      "content": "Getting into Hitchcock's Psycho, 57 years after its original release is like assisting to a masterclass of sorts. We can now identify what made this little lurid tale into a classic. Hitchcock himself, naturally, but now we know the first director's cut was a major disappointment and that Alma Reville - Hitch's wife - took over, re edited and the results have been praised, applauded and studied ever since. Janet Leigh's Marion Crane created a movie landmark with her shower scene. Bernard Herrmann and his strings created an extra character that we recognize as soon as it reappears under any disguise but, what shook me the most now in 2017 is Anthony Perkins as Norman Bates. His performance has evolved with the passing of time and its effect has remain as chilling, as moving, as funny and as real as it was in 1960. It's interesting to watch Gus Van Sant's 1998 version with Vince Vaugh as Norman Bates. If you look at the film, shot by shot with Berrnard Herrmann's strings - it's pretty fantastic. - Play it in black and white if you can. The problem and it is a monumental problem, we wait for Janet Leigh and Anthony Perkins, if the casting of Anne Heche was really bad - not a hint of Janet Leigh's humanity, the casting of Vince Vaughn was incomprehensible. Not just not credible for a moment but annoying, very annoying. Anthony Perkins brought something profoundly personal to Norman Bates and as a consequence we connected with his sickness. We felt for him. Okay, sorry, I didn't mean to go there but I felt compelled to because I saw again Psycho (1960) ad Psycho (1998) at 24 hours from each other and realized that the main flaw of the 1998 versions is the absence of Anthony Perkins."
    },
    {
      "username": "littlemartinarocena",
      "userUrl": "https://www.imdb.com/user/ur12449122",
      "reviewLink": "https://www.imdb.com/review/rw1768523",
      "warningSpoilers": false,
      "date": "23 November 2007",
      "rate": "10",
      "helpful": "207 out of 236 found this helpful.",
      "title": "Hitchcock and Herrmann",
      "content": "Robert Bloch wrote the original work, Joseph Stefano adapted it into a tight screenplay but it was Alfred Hitchcock with the extraordinary complicity of Bernard Herrmann who transformed this lurid tale into a classic, horror masterpiece. The score propels us into the moment before the moment arrives provoking the sort of anticipation that verges on the unbearable. The fact that the key scenes have become iconic film moments: copied, imitated, emulated and parodied, have not diminished its impact, not really. The anticipation, underlined by Herrmann's strings, creates a sort of craving for the moment to arrive. That doesn't happen very often. No amount of planning can produce it or re-produce it - otherwise how do you explain the Gus Van Sant version - so, the only possible explanation is an accident, a miraculous film accident and those do happen. Everything falls into place so perfectly that even the things that one may argue are below the smart standard of the film, are needed, the film without every frame is not quite the film. Try to turn away after the climax during Simon Oakland's long explanation. You can't. I couldn't. Partly because you know you'll soon be confronting those eyes, that fly, the car..."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2171117",
      "warningSpoilers": false,
      "date": "9 December 2009",
      "rate": "10",
      "helpful": "42 out of 51 found this helpful.",
      "title": "A film that you see once, and never forget...",
      "content": "I am a huge fan of Hitchcock, and have really liked all of the movies of his I have seen so far. My top 5 favourites are Vertigo, North By Northwest, Rear Window, Rebecca and this masterpiece. Before I saw this, I considered Vertigo as his masterpiece. After seeing this movie, I think Psycho outshines Vertigo.Psycho is a film that you see once and never forget, and one of the few movies out there that has left me traumatised. The infamous shower scene is without doubt one of the most terrifying murder scenes in any film. When I first saw that scene on the 100 Greatest American Films, I was so terrified and I admit it I have never recovered. I had a similar experience watching the Disney film Sleeping Beauty with Maleficent enticing Aurora to the spinning wheel, and Mrs Gulch turning into the Wicked Witch in the Wizard of Oz.The shower scene isn't the only effective or chilling scene in the film- in the events leading up to that scene I was biting my nails. The scene with the old woman in the chair also made me jump out of my skin. The whole of Psycho is terrifying, suspenseful and shocking. Two elements made this so. One was Hitchock's direction. The great director proves how truly great he is by directing Psycho in a masterful way, and manages to deliver the shocks when needed. The other is Bernard Hermann's music. What a creepy score! I loved his score for Vertigo and Miklos Rozsa's for Spellbound, but the high violin motif in the shower scene is the main reason why that scene in particular is so effective. I admit it, when I hear that motif, I start screaming. There is just something about it that makes your blood run cold.Other pros are a good plot, a well constructed screenplay and beautiful black and white cinematography that is perfect in conveying the creepy mood. And the ending did surprise me. The acting though was exemplary, with Janet Leigh giving one of the deservedly most memorable female performances in a Hitchcock movie, and Vera Miles also giving a stellar performance. Stealing the film is Antony Perkins as Norman Bates, he didn't just play creepy, he WAS creepy, his face, his voice, his mannerisms.. in short it is one of the most chilling performances of all time. All in all, a Hitchcock masterpiece! 10/10 Bethany Cox"
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0072234",
      "warningSpoilers": true,
      "date": "16 November 2002",
      "rate": "10",
      "helpful": "98 out of 124 found this helpful.",
      "title": "One of the greatest horror/suspense films ever!",
      "content": "Alfred Hitchock is the master of suspense and Psycho is probably his most famous film. Because, let's face it, one way or another, you have seen or heard of this film. It's been made fun of, been remade(unfortunately), not to mention that this movie's word will be spred from generation to generation. I came across it very young, my parents used to tell me how scary it was and how I wouldn't want to take a shower after watching this film. I didn't believe them, but when I watched it, I for the first time pulled the blanket over my head, it was that frightening! The thing that is so amazing about Psycho is how much of an impact it made, and understandably why it did. It ranked in over 60 million dollars at the box office, now this was the time where tickets were like 50 cents at the theater, now if you compare that to today, that's Titanic like money! It broke many taboo's, like this was the first film to show a toilet being flushed, isn't that interesting? My high school teacher said that her and her mom saw Psycho when it was first released in theaters and she actually ran out of the theater terrified! Alfred did so well keeping us glued to our seats with all his great twists! This was before The Sixth Sense, I mean, the ending is just such a mind blower! But I won't give spoilers.Janet Leigh plays Marion Crane, a woman who is in love with a divorced man Sam Loomis. He says once he pays his ex wife off with the alimony, they'll get married. When Marion's boss asks her to put their most valued client's money, $40,000 to be exact, and bring it to the bank. She has other plans though, she takes the money for herself and flee's the city, but not before her boss sees her driving off. Shaky enough, huh? But she pulls over to get a nap in, and a police officer asks if she's OK, but she gets shaky and just wants to drive off. The policemen fallows her since she is so shaky and she ends up buying a different car. She gets caught in a giant rainstorm and pulls over to the Bates Motel.She meets there, the owner, a pleasant and polite young man, Norman Bates. He lives in the house next to the motel with his mother. Marion checks in and Norman offers her dinner, they have a conversation mostly about his mom and Marion is concerned when she heard screams from the house that sounded like his mom. Norman gets on the defenses and asks Marion some questions as well, she says she is going to a \"private island\". Norman is very attracted to her, you can tell immediately, and she leaves knowing that she has to get out of the trap she set for herself back in Phoenix. As she's taking a shower before bed, a mysterious figure comes to the curtain and opens it stabbing Marion violently several times causing her to die. Norman cleans up the mess and gets rid of her body not knowing about her money and throwing that away too.Marion's boyfriend, Sam and her sister, Lola, hire a private detective to find her. The private detective comes across The Bates Motel and doesn't end up coming back after trying to \"talk\" to the mother. Lola and Sam are concerned and decide to investigate for themselves, but will they end up coming back to the city alive? Psycho is just one of those movies you have to see before you die. It's one of the most important films of our time and will never be forgotten. It's a true treasure with terrific actors and a terrifying plot that will give you nightmares for weeks! Please don't let that scare you, I'm just having fun, but it is a freaky film! Watch it in the dark! It has a better effect, I think. Over 40 years and this film is still horrifying as if it were made today! 10/10"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1681310",
      "warningSpoilers": false,
      "date": "26 June 2007",
      "rate": "8",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Hithcock masterpiece in his most accomplished and perfect movie",
      "content": "This famous film with known story tells about Marion Crane (Janet Leigh) , she works in a Phoenix (Arizona) office, when his employer trusts her some money . Seeing the opportunity to take the cash and beginning a new life along with her fiancé Sam (John Gavin) . Larcenous Marion leaves Phoenix and heads with her car towards California where her lover with debts is owner a store . When is caught in a storm and pursued by a policeman , she leaves the highway and enters Bates hotel . The hotel with twelve rooms (and 12 showers) is managed by a strange young (Anthony Perkins) who seems to be submitted by his overbearing mother , she's living at a creaky mansion nearly hotel. Then, rare things start to happen . Later on , a detective named Arbogast (Martin Balsam) , her sister (Vera Miles) and Sam (John Gavin) are looking for Marion , asking for help a stubborn sheriff (John McIntire).¨Psycho¨ was not only Hitchcock's biggest successful movie , but was a phenomenon in its own right . The picture is a magnum opus in the terror genre and its immediate impact and its future influence was enormous and cannot be over emphasised . It's the quinta-essential shocker that created an authentic sub-genre about psycho-killers and continuing until nowadays . The shower image is one of the most studied , copied and analysed sequences in cinema history and has obtained a notoriety what exceeds of the movie itself . Terrific performance by Anthony Perkins in an immortal role as Norman Bates and sensational Janet Leigh with Oscar nomination included that was the only one in her long career. Inventive and superbly constructed plot , filled with delicious black humor by writer Joseph Stefano based on Robert Bloch's novel. The highlight of the film is , of course , the shower scene , it was made with 70 cameras to shot the 45 seconds of footage and the creepy sound effects were realized by stabbing a knife into a melon . Magnificent credit titles by Saul Bass , he's usual on Hitchcock films .Excellent black and white cinematography by cameraman John Russell , as Hitch thought it would be very gory in colour . Bernard Herrmann's legendary musical score copied and endlessly imitated , aids to create a thrilling atmosphere . Film is directed with exquisite taste and intelligence by master Hitchcock who makes an impeccable control of every scene and maneuvers your emotions , infusing with a deliciously macabre wit , it makes ¨Psycho¨ far superior to the several movies what tried duplicate , or imitate it ; these are the following ones : ¨Psycho II¨ (1983) by Richard Franklin , ¨Psycho III¨ (1986) by Anthony Perkins himself and for cable television : ¨Psycho IV¨ (1990) by Mick Garris. Hitchcock's Psycho belongs to his best period in the 5os and 60s when he produced his finest works , perfecting the art of suspense in a series of masterpieces : ¨Dial M¨, ¨Rear window¨, ¨Vertigo¨, ¨North by Nortwest¨, ¨Birds¨ and specially ¨Psycho¨ , all of them are still studied and copied today . Rating : Indispensable and essential classic movie."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw0072087",
      "warningSpoilers": false,
      "date": "5 October 2001",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Tight and Terrifying",
      "content": "When Hitchcock tells a tale, he engages the mind of the audience. We don't need to see knives tearing into flesh, people being strangled on the screen, or gunshots ripping through a brain. And still, when we are finished, we are more uncomfortable than had we watched the actual murder. In Psycho, it's all about vulnerability. Janet Leigh is in a state of great agitation and needs to trust someone. Unfortunately it is the master taxidermist, Anthony Perkins. His Norman Bates, with his nervous tics, his analytical surmises, his understatement, are master-pieces of madness. This film is what every student should see. It is montage; it is tautness; it is the best kind of storytelling. The things which were still with me a month after seeing this for the first time were as follows:1. The house. That ominous house, peering down, Poe-like from the hill above the motel. How can architecture better capture threat.2. The scene with the patrolman.3. The conversation Norman when Marion first stops at the motel.4. The shower scene. I can still hear the theramin (used again at the end), and the blood flowing down the shower drain.5. The killing of Martin Balsam on the stairs (he also used this perspective in Vertigo and Topaz).6. The \"conversations\" with Mother.7. The naked light bulb swinging as the rocker turns around and Norman coming into the basement.What a great director. He saw everything and knew how to fill every minute with suspense. A truly masterly film."
    },
    {
      "username": "llihilloh",
      "userUrl": "https://www.imdb.com/user/ur0766521",
      "reviewLink": "https://www.imdb.com/review/rw0072021",
      "warningSpoilers": false,
      "date": "25 November 2000",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "This is what good movies are all about.",
      "content": "This is one of the best movies ever created and Alfred Hitchcock is one of the most intriguing film makers ever to live. (in my opinion) There's just so much to say about this film I hardly know where to start.I first saw this movie about five years ago and wasn't impressed at all. Of course, I was about ten years old at the time. I didn't think that the famous shower scene was anything to frightening and the characters seemed a little boring. A little less than a year ago, I became very interested in the history of the film and not so much of the film itself. I read articles, reviews, anything that I could get my hands on. Then, Psycho was shown on AMC and I immediately thought that it was a masterpiece. Shame on me for not appreciating it sooner.The film as a whole is spectacular, but I like to break it down into little sections. First, I was very surprised and impressed with the actors that played Marion Crane and Norman Bates. Janet Leigh isn't given to much exposure to the film since she is killed off in about the middle of it. I thought that she did a good but not great job. On the other hand, Anthony Perkins blew me away. Both Norman and Anthony are very interesting. Norman's life that is set up and shown to us is so well depicted that I can't imagine anybody else playing the part. All of the characters including Arbogast, Lila, and Sam are so well created. Obviously, the plot is so unique and odd that you can't help but smile at it. A young woman on the run after stealing $40,000, and then accidentally falls into the wrong hands of a psychopath. It's great! The best thing is that nobody has ever done anything quite like it, and they won't be able to because then the magic will be gone. Even though the ever so famous shower scene is said to be one of the most chilling death scenes in history, I think that it may be a little overrated. I love it as much as the next person, but it's not all that scary. Who said it was supposed to be scary? Nobody, I know. But the majority of the Psycho audience gathers it to be very frightening. I do still think that it is one of the greatest and shocking scenes ever. The setting is very well set up as well. The Bates motel and house is so cleverly created that it brings a special atmosphere to the audience. It has something about it that you just can't forget.Finally, that music played throughout the film is one of the most spookiest sounds I have ever heard. Great job to the music composers and to Hitchcock for this scary addition to the movie. I think it's safe to say that everybody has heard of Psycho, but not everyone has seen it. For those of you who still haven't seen this amazing flick, go see it! It's a must see."
    },
    {
      "username": "darkjosh",
      "userUrl": "https://www.imdb.com/user/ur0712029",
      "reviewLink": "https://www.imdb.com/review/rw0072009",
      "warningSpoilers": false,
      "date": "12 September 2000",
      "rate": "9",
      "helpful": "277 out of 348 found this helpful.",
      "title": "Perkins Is Remarkable",
      "content": "Most modern-day horror films make the killer to be an absolutely inhuman, grotesque, unimaginable monster in order to scare the audience out of its wits. Most of the time, however, these stereotypes create a generic murderer a raving, ranting, clearly demented psychopath. One of the few memorable cinematic killers that does not adhere to these restraints and cliches is, of course, Anthony Hopkins' Hannibal Lecter, whom manages to effectively cause the audience to recoil without such drek as the aforementioned devices.Anthony Perkins' skillfully crafts his performance as Norman Bates, avoiding a ranting, raving, drooling, murder-happy, manic characterization; instead his performance as Norman is subtle, creepy, cool, and unsettling. He is brilliant; from his quiet conversations with Marion Crane amidst the stuffed birds, to his weasling wimpiness when confronted by Arbogast, his performance is so exact that it chills the viewer, all without the unnecessary disturbing images prevalent in more modern films (read The Cell, Henry: Portrait of A Serial Killer).Perkin's fine performance, a tight script, and Bernstein's classic score make Psycho a film that is now and will always be remembered as one of the pinnacles of the horror genre."
    },
    {
      "username": "Chris-332",
      "userUrl": "https://www.imdb.com/user/ur0186789",
      "reviewLink": "https://www.imdb.com/review/rw0071958",
      "warningSpoilers": true,
      "date": "19 January 2000",
      "rate": "10",
      "helpful": "124 out of 148 found this helpful.",
      "title": "Hitchcock did it all in this one.",
      "content": "When Psycho came out, the horror industry of movies was merely monsters, zombies, werewolves, and vampires. So when Psycho hit screens, the audience was finally introduced to psychological thrillers. It hit with such a huge bang that the audience was shocked...with fear and suspense. Psycho created what the thriller genre is today. It sliced through clique monster movies and changed it forever. Still today when you look at Norman Bates and his extremely freaky look when you see him watching the inspector's car sinking into the swamp sends chills down my spine. And when Marion Crane met her bloody demise in the middle of the movie, Hitchcock proved to everyone that this movie is different, different from every other movie you have ever seen. The cinematography in this movie is fabulous, the music is marvelously freaky, the acting is magnificent, the story is exceptional, and everything else about the movie is great. Too bad the sequels and the new remake was complete trash."
    },
    {
      "username": "Whizzer-2",
      "userUrl": "https://www.imdb.com/user/ur0448871",
      "reviewLink": "https://www.imdb.com/review/rw0072192",
      "warningSpoilers": false,
      "date": "1 October 1999",
      "rate": "10",
      "helpful": "61 out of 70 found this helpful.",
      "title": "Perkins Irreplaceable?",
      "content": "Hitchcock was very fortunate to have cast the young Anthony Perkins in the leading role. At the time there were some other young aspiring actors who might have qualified for the part, namely: Michael J. Pollard; Jack Nicholson; Bruce Dern, Dean Stockwell, Victor Buono and Dennis Hopper. However, it's hard for me to imagine anyone other than Perkins playing Norman Bates with complete authenticity, it's seems the role was simply made for him and only him. Could you possibly imagine anyone other than Nicholson in the role of Randall P. McMurphy in \"One Flew Over The Cuckoo's Nest\" or Dennis Hopper as Billy in \"Easy Rider\"? Keep in mind the introverted, insecure Mama's Boy was not really PSYCHOpathic as Hannibal The Cannibal was in \"Silence of the Lambs\" - a cold-blooded killer with no conscience - but rather criminally insane, plagued by schizophrenic delusions and seriously in need of multiple reality-checks. Anthony Hopkins did a wonderful job as the vicious Hannibal, and also as Corky, the schizo-killer ventriloquist in \"Magic\". I think he just might have pulled off a convincing Norman, but don't believe he was available back then. Oh well, so much for speculation...Perkins did a great job."
    },
    {
      "username": "majikstl",
      "userUrl": "https://www.imdb.com/user/ur0650655",
      "reviewLink": "https://www.imdb.com/review/rw0072347",
      "warningSpoilers": true,
      "date": "13 June 2004",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "It was a dark and stormy night...",
      "content": "(((((SPOILERS))))For most people, the most memorable scene in Alfred Hitchcock's PSYCHO, indeed it's most famous scene, is the shower sequence. It has been broken down and analyzed ad nauseam as an example of the fine art of editing. It is a great sequence, but to me the best scene in PSYCHO occurs just before that. Janet Leigh as Marion Crane, on the run from having committed a crime, sits in the parlor behind the Bates Motel's office and discusses nothing and everything with Anthony Perkins as Norman Bates, the motel's lonely proprietor. It is a chat between strangers who desperately need to talk to someone, anyone, but have no one to whom they can confide. It is a beautifully written and acted scene, which serves as the calm before the storm. For all of its flashiness and sleight-of-hand gore, the shower sequence isn't nearly as effective at showing what a master filmmaker Hitchcock was. It is in the parlor scene that the entire narrative spins around; as the audience is prompted to switch their allegiance from Marion to Norman. Nothing really happens in the scene, other than two characters talking, but how things are said reveals as much as what is actually said. Here Marion comes to terms with her mistake and decides to pull herself out of her \"private trap.\" Norman introduces us, indirectly, to Mother and wins our sympathy, which is vital to the way the rest of the film plays out. The scene very skillfully sets the mood of uneasiness that propels us into the upcoming murder, even as it suggests that Marion is achieving a sense of inner peace. Madness is revealed, danger is suggested, yet the audiences is coolly and cruelly lulled into an almost tranquil state. It is obvious something is coming, but not so soon. Then the shower curtain is ripped aside and blood begins to splatter.The measure of a film like PSYCHO is not how cleverly it fools you the first time, but how irrelevant its surprises are to enjoying it time after time. Indeed, compare it to Gus Van Sant's 1998 remake, or even Brian De Palma's 1980 semi-remake, DRESSED TO KILL, and the power of the film is obvious. Van Sant's version, though a scene for scene imitation is barely watchable even once, especially if you are already familiar with the plot; and while De Palma's homage is stylish and intriguing the first time around, its psychology and plot tricks don't stand up on repeated viewings. By contrast, Hitchcock's PSYCHO can be viewed repeatedly with full awareness and appreciation of knowing what is coming up next. I think an element of Hitchcock's genius is apparent in that he doesn't treat his major plot twist as a just a gimmick. The entire first half of PSYCHO could have been treated as just a shaggy dog story, a prelude marking time until Norman Bates' story takes center stage. But Hitchcock realized that Janet Leigh's story had to be presented with all due gravity, otherwise the shift to Anthony Perkins' story wouldn't be nearly as effective. Neither Van Sant nor De Palma seemed to understand this, especially De Palma who treats the Angie Dickinson scenes in DRESSED with a cruel, condescending sense of humor. Hitchcock's PSYCHO works as a whole, but could very easily have been presented as two independent episodes of \"Alfred Hitchcock Presents.....\" Marion Crane's story is not just a build up (though Hitchcock himself claimed that killing off his leading lady was all meant as a joke on the audience), but as a complete story unto itself, replete with the type of shocking twist ending that was the hallmark of Hitchcock's television anthology. Likewise, the Norman Bates half of PSYCHO, is a complete suspense tale in its own right. The shower scene is the bridge between the two stories, but it is the scene in the parlor that cements the two tales -- and the fates of the two protagonist. And if you look at PSYCHO as two separate parts of a whole, then Marion's story is revealed to be the more complete of the two. Norman's story, while beautifully done, is essentially a mystery story; Sam, Lila and Arbogast are trying to solve a whodunit: what happened to Marion and the $40,000? The cleverness of Hitchcock and screenwriter Joseph Stefano is that they let us think we know the answer right off the bat, building to a conclusion where it is revealed how completely we have been fooled. In the end, we know little more than Lila and Sam. To some extent, this is the real gimmick of the film. On the other hand, Marion's story allows Hitchcock to make so much out of so little. He creates tension, even though there is no tangible threat. Marion is on the run with stolen funds, but the theft hasn't even been discovered yet. All of the danger is strictly in her mind: What will happen when...? She is a smart woman who has done something very stupid, but proceeds even as her fears grow and grow. But cinematically the suspense is created out of mundane things: a policeman's face at the car window, rain and windshield wipers slashing across the screen, the glare of on coming headlights. Mix this with the haunting voice overs of accusing voices and Bernard Herrmann incredible musical violence and the effect is hypnotic. But these imagined dangers do not prepare Marian or the audience for the real dangers ahead.And something has to be said for Janet Leigh. Always overshadowed by Anthony Perkins' iconic performance, Leigh never gets her due (though she was nominated for an Oscar, she lost to Shirley Jones in ELMER GANTRY). But she dominates the first half of the film with a vivid performance that is sexual, humorous and bittersweet. So much of her role depends on the subtlety of her facial expressions: her sad smile at pretending to believe Sam's excuses for not marrying her, her bemused glances at the flirtatious old millionaire, her self-satisfied smirks as she thinks about how people will react to discovering her crime, her mixture of concern and fear as she talks to Norman in the backroom parlor. Plus, she displays an attitude that is both smart and sexy. It is one of the great film performance.It's easy to take PSYCHO for granted now; it has been imitated so many times in so many ways by far lesser talents. Indeed, it's one negative is that it inspired so may pale imitations, including its own three sequels and a very bad remake. Yet even so, PSYCHO remains a one and only original. And its iconic status can't be denied; it redefined the concepts of what a Hitchcock film was and what a horror film could be."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3057477",
      "warningSpoilers": false,
      "date": "28 July 2014",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Hitch's masterwork",
      "content": "PSYCHO truly is an excellent film, a movie which, along with the same year's PEEPING TOM, managed to kick start a new genre of psychological thrillers which continues to this day. It's perfectly made, with an excellent story (thanks to the reliable schlockmeister Robert Bloch), a great script adaptation, and assured direction from Hitchcock.It's hard to know what stands out here the most: the brooding cinematography, in which features such as the Bates Motel become characters in their own right, or Anthony Perkins's most famous role. Perkins encapsulates Bates perfectly, making him a bogeyman far more frightening than the OTT fantasy creations of a Freddy Krueger or Jason Vorhees.Watching it today, it's tough to imagine sitting through it without knowing the various twists beforehand, but they must have been mind-blowing to newcomers. And one of the things I like best is that the film is already great, and thrilling, even before the action shifts to the Bates Motel. Add in a great Martin Balsam performance and you have one of the greatest masterworks of 20th century cinema, in my humble opinion."
    },
    {
      "username": "revival05",
      "userUrl": "https://www.imdb.com/user/ur0678462",
      "reviewLink": "https://www.imdb.com/review/rw0071974",
      "warningSpoilers": false,
      "date": "19 April 2000",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "One of the best movies ever made!",
      "content": "**Please excuse me for some spelling mistakes** This is the BEST HORROR/THRILLER/SCARY MOVIE IN THE WORLD! I just love this movie! Since I am a true movielover I do not mind that it is in black and white at all. The actors were great and still today it is a bit creepy when the thievish Marion Crane chooses the wrong place to spend the night on (and the wrong shower, ha ha ha). Perkins is SO perfect as Norman Bates and the voice of mother really made me shiver. The movie is filled with classic lines that I won't forget even if I'll isolate myself for 20 years. For those who can't stand old movies, or are'nt any real movielovers this will be a sleeping pill. But for us with a good taste it will be a very good experience. Don't get me wrong, i mean ''The Blair Witch project'' for example is scarier than ''Psycho'' but ''Psycho'' is creepier and better than any other thriller! Watch out for the remake from 1998, it really sucks!!!!!! 10 out of 10 OF COURSE!!!!!!!!"
    },
    {
      "username": "mardalsfossen01",
      "userUrl": "https://www.imdb.com/user/ur89799951",
      "reviewLink": "https://www.imdb.com/review/rw4505785",
      "warningSpoilers": false,
      "date": "11 December 2018",
      "rate": "9",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Chills! Thrilling to the end!",
      "content": "I have never seen a movie that gave me this type of chills. VERY recommendable Horror/Mystery/Thriller! This movie is so far more than the one bathroom scene everybody knows. Watch it, you won't be disappointed!"
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw1206665",
      "warningSpoilers": false,
      "date": "1 November 2005",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Hitchcock at his scariest",
      "content": "\"Psycho\", the Hitchcock masterpiece of 1960, is still a scary ride. TCM presented it on Halloween night, which was an appropriate way to add to all the horror being shown on television.As the film opens, we are treated to Saul Bass' titles that herald some of what one is expecting will come in the film. Then, one hears the magnificent opening bars of Bernard Herrmann's music score and one realizes this is not an ordinary movie. The crisp black and white cinematography by John Russell, as well as the intelligent editing by George Tomasini, surpass any doubt this was one of Alfred Hitchcock's best work. Of course, the film owes a debt to Joseph Stefano who adapted the Robert Bloch novel, in which the movie is based, with great flair.\"Psycho\" works because of the wonderful cast assembled for the movie. Anthony Perkins was an actor who could play anything. His range was enormous, as he shows in the film. His Norman Bates shows a man that appears to be in complete control of himself. We watch him as he begins to unravel when confronted first by Arbogast, and then by Sam Loomis. Mr. Perkins' performance is one of the best he ever gave in his film career.Janet Leigh who plays Marion Crane is perfect as the small would be criminal who happens to be in the wrong place, at the wrong time. It's a tribute to Ms. Leigh's talent that she underplays Marion because she is battling with her own conscience as she realizes the enormity of what she has done. Alas, she was not going to make good on her resolve.The supporting cast is also interesting. Martin Balsam plays the private detective well. He is instrumental in cracking Norman's confidence, but of course, it comes with a high price he must pay for trying to shake the sick man. Vera Miles and John Gavin are seen as Marion's sister and boyfriend.\"Psycho\" will remain an exercise in horror by a man who knew how to scare us, Alfred Hitchcock!"
    },
    {
      "username": "mark-lovellsamuels",
      "userUrl": "https://www.imdb.com/user/ur21813682",
      "reviewLink": "https://www.imdb.com/review/rw2102488",
      "warningSpoilers": false,
      "date": "27 July 2009",
      "rate": "10",
      "helpful": "283 out of 295 found this helpful.",
      "title": "The Perkins Factor",
      "content": "No matter how many times one sits through this Hitchcock classic, Anthony Perkins always manages to surprise you. It is a sensational performance - for which he didn't even get an Oscar nomination - I have no way of knowing how much preparation he dedicated to the creation of Norman Bates, maybe no more than usual, but the details of his performance are astonishing. Never a false move and if you follow the film looking into his eyes, you'll be amazed as I was. The madness and the tenderness, the danger and the cravings. A mamma's boy with hellish implications and yet we see, we feel connected to the human being, we are not horrified by him but of his circumstances. In short, we kind of understand him. That alone puts him miles and miles away from other cinematic monsters. From Richard Attenborough as the real life Christie in \"10 Rillington Place\" to the hideous, unredeemable Christian Bale in \"American Psycho\". Here Hitchcock and Herrman create an universe that Anthony Perkins inhabits with the same kind of electricity, nerve and shyness that Norman Bates projects throughout the film. Janet Leigh falls for it if not him. She, like us, sees the boy trying to escape his dutiful son's trap. He is in my list of the 10 most riveting characters ever to be captured on film."
    },
    {
      "username": "Brian-272",
      "userUrl": "https://www.imdb.com/user/ur0656262",
      "reviewLink": "https://www.imdb.com/review/rw0072015",
      "warningSpoilers": false,
      "date": "4 November 2000",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "A classic. Hitchcock's greatest film. Everything is perfectly done and the film has the most famous scene in movie history you know the scene \"The Shower Scene\".",
      "content": "Hitchcock's 1960 classic Psycho has it all to start with romance, embezzlement, disappearance, secrets, voyeurism, a dead corpse, a split personality of a man who thinks from time to time he's his dead mother and of course death in the most famous scene of all time the scene of Janet Leigh getting stabbed to death in the shower. The first time I saw Psycho as a kid and seeing the shower scene it terrified me so much I actually became afraid to take a shower I had great fear of getting stabbed to death even in my own home. As any child would do myself included they grow away from the terror of scare scenes as age increases, but recently I have looked at the famous shower scene from a different perspective. Many are unaware but it took seven days to shoot the shower scene, seventy camera positions for the forty-five seconds of very famous footage not an actual bare breast or plunging knife is to be found in the final cut, just illusion through montage. Now I begin my discussion on montage for those who don't know it's meaning or importance. Montage is a distinct type of editing that brings more drama to film and it links shots of film together and the editing separates and makes a film different from other forms of art. Montage was developed from the Soviet Union. Montage was used in very distinct ways in Psycho mostly crafted from Russian editor and director Eisenstein whose editing technique clashing of images or more properly known as a graphic match in film. Actually both similar terms can be explained first clashing of images create conflict just as in the shower scene the images flashing quickly of the knife and Janet Leigh's body symbolize the action and drama of the film while tied to the music of the Psycho shower scene. The term graphic match is very symbolic to show that life goes down the drain. To explain in the shower scene as Janet Leigh is stabbed and her body slides down with the shower curtain breaking the camera does a very close angle shot of her eye and then the camera slowly but surely makes it way to the blood and water flowing down the drain to symbolize death. This is a great example of graphic match it does exactly what it says by taking two unlike objects as in this case an eye and a drain of a tub to compare the action and drama that just unfolded in a scene with blood and water going down the drain symbolizing death while the eye open and an open drain show that life is no more. Finally enough about the famous shower scene everyone should know by now the story and technique behind it and how it was done to perfection, but I end my discussion of the scene I don't what you to think that your in a cinema history class! Hey don't forget how great a film Psycho is it has several other good reasons for it's classic ranking besides the shower scene with montage to start the intelligent directing of Alfred Hitchcock he simply was the master at keeping people in suspense and Psycho is full of suspense from start to finish. Also another interesting moment is to notice Hitchcock as the pedestrian outside the office in the very first few minutes of Psycho it was common for Alfred to make small appearances in his movies. And Anthony Perkins was great as the best and most liked Psycho character of our time the famous Norman Bates. The character had such intelligent wit and yet evil twisted means. So make reservations to the Bates Motel you will enjoy this classic of strange happenings at a rundown motel. I added this movie to my video library just this year and I recommend that anyone add Psycho to a personal movie collection of their own. After 40 years and beyond we all still have the right to go a little mad."
    },
    {
      "username": "LoveCoates",
      "userUrl": "https://www.imdb.com/user/ur0478150",
      "reviewLink": "https://www.imdb.com/review/rw0072069",
      "warningSpoilers": false,
      "date": "31 July 2001",
      "rate": "10",
      "helpful": "401 out of 497 found this helpful.",
      "title": "Two Words: Hitchcock's Best (...and you know that's no small feat!)",
      "content": "Yes, everything you've heard is true. The score is a part of pop culture. The domestic conflict is well-known. But nothing shocks like the experience itself.If you have not seen this movie, do yourself a favor. Stop reading thse comments, get up, take a shower, then GO GET THIS MOVIE. Buy it, don't rent. You will not regret it.\"Psycho\" is easily the best horror-thriller of all time. Nothing even comes close...maybe \"Les Diaboliques\" (1955) but not really.\"Psycho\" has one of the best scripts you'll ever find in a movie. The movie's only shortcoming is that one of the characters seems to have little motivation in the first act of the movie but as the story progresses, you realize that Hitchcock (GENIUS! GENIUS! GENIUS!) in a stroke of genius has done this on purpose, because there is another character whose motivations are even more important. Vitally important. So important that you totally forget about anything else. I was lucky enough to have spent my life wisely avoiding any conversation regarding the plot of this movie until I was able to see it in full. Thank God I did! The movie has arguably the best mid-plot point and climactic twist in thriller history, and certainly the best-directed ending. The last few shots are chilling and leave a lingering horror in the viewer's mind.Just as good as the writing is Hitchcock's direction, which is so outstanding that it defies explanation. Suffice it to say that this movie is probably the best directorial effort by film history's best director. I was fortunate enough to see this movie at a big oldtime movie house during a Hitchcock revival. Janet Leigh, still radiant, spoke before the film and explained how Hitchcock's genius was in his ability to 1) frighten without gore and 2) leave his indelible mark on the movie without overshadowing his actors (like the great Jean Renoir could never do). \"Psycho\" is clearly its own phenomenon, despite all the big-name talent involved.Hitchcock does not disappoint by leaving out his trademark dark humor. His brilliance is in making a climax that is at once both scary and hilarious. When I saw it in the theatre the audience was both gasping in disbelief while falling-on-the-floor laughing.One more thing...Tony Perkins. Janet Leigh got much-deserved accolades for this film, but it is Perkins who gives what remains the single best performance by an actor in a horror movie. He is so understated that his brillance passes you by. He becomes the character. The sheer brillance of the role is evidenced by the ineptitude of the actors in Gus Van Sant's 1998 (dear God make it stop!) shot-for-shot \"remake.\" Though the movies are nearly identical, Hitchcock's is superior mostly because of the acting and the atmosphere (some of the creepiness is lost with color). This is made obvious by the initial conversation between Leigh's character and Perkins, a pivotal scene. The brilliance of Perkins in the original shines even brighter when compared with the ruination in the remake even though the words and the shots were exactly the same. The crucial chemistry in this scene lacking in the remake gives everything away and mars our understanding of upcoming events. The fact that Perkins could never escape this role - his star stopped rising star as it had done in the 50s - proves that he played the part perhaps too well.I keep using the word brilliant, but I cannot hide my enthusiasm for this movie. It is wholly unlike the overblown, overbudget, overlong fluff spewing all-too-often out of Hollywood today. \"Psycho\" is simple, well-crafted and just the right length.Eleven-and-a-half out of ten stars."
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw2862501",
      "warningSpoilers": false,
      "date": "2 September 2013",
      "rate": "",
      "helpful": "7 out of 8 found this helpful.",
      "title": "A Key Scene in Depth",
      "content": "In sixty years of movie watching there's one extended scene in Psycho that I count as being of unsurpassed brilliance. That's the about 7-minute scene in Norman's parlor where Marion has a bite of dinner shortly after arriving at the motel. To get an idea of its impact and significance, the setting is important. The parlor is dimly lit, casting shadows appropriate to the Gothic plot. Norman sits on one side, a stuffed raptor on the adjacent wall. It's shrewdly placed since the menacing wing-spread can background Norman when Hitch so chooses. Marion sits on the opposite side in a more conventionally lit setting, bespeaking her more conventional nature. Significantly, Hitch cross-cuts between them the entire time, never showing them in the same frame, thus emphasizing Norman's uniqueness and dominating part of the conversation.Now Norman is clearly unsure how to talk to the attractive woman alone with him in this, a private room. So he launches into a safe topic for him, but completely inappropriate to the light meal Marion is eating, namely his hobby, taxidermy. That is, how he likes to stuff birds but not the gore that comes with beasts. This tells us the important point that Norman is inexperienced socially, an aspect that fits in as the various parts of his nature come together over the movie's time-line. Throughout the tete-a-tete, Marion maintains a cautious but polite reserve as Hitch crosscuts between them. Her role here is mainly to draw the boyish stranger out. From taxidermy the dialog takes a more intimate turn. What emerges from the next topic, namely how to fill one's time, is that Norman is uncomfortable with his life with Mom. At the same time, however, he tries to casually laugh it off, one of his main defense mechanisms. Marion suggests that perhaps he should leave, that is, go away. But Norman senses something. He may be confused about a lot of things, but he's intuitive when he interjects that Marion must be running away from something, as indeed she is. At this point the conversation takes on a momentum that is revealing more and more about Norman's inner life. That's apparent when he starts talking ominously about private traps from which no one can escape—how we \"scratch and claw\" (like a bird) but never to any avail. To Marion, this is a challenge to escape the embezzlement trap she's gotten herself into. To Norman, it's a disclosure of how he views his own life, and an excuse for not doing anything about it as though in his madness he could. At this point, Marion senses Norman's problem lies with his mother and suggests that he get away from the motel and from her. Once the topic turns to Mother, Hitch frames Norman in the foreground with the ominous stuffed bird (Mother) looming over him. Now we know Norman is indeed trapped and that Marion is venturing into dangerous territory. She accelerates the danger by suggesting that he should put Mom away, like \"in an institution or something\". This triggers a sudden, hostile response as Norman associates strangers and unfamiliar surroundings with thoughts of death, as indeed it would be for him. But true to his defense mechanisms, he does an abrupt 180 and laughs off the suggestion with the supreme irony that whatever her problems, at least Mom's \"harmless\". Then in another note of supreme irony, he trivializes her problem by saying that anyway we all go \"a little mad sometimes\". This of course would include Marion by inference, who now has a sense of her own embezzlement predicament and breaks off the conversation by resolving to return to Phoenix and face the music. At the same time, Norman reverts to his usual affable façade. And the scene ends. But unbeknownst to Marion, she may have resolved one trap, but has now entered a far more deadly one.This is the central scene of the film. It's not the most dramatic, but it is the one where we gain important insight into Norman's mental processes. Now as good as the writing and direction are, it's really Tony Perkins's exquisite performance that makes the seven minutes absolutely spellbinding. Watch how quickly and persuasively he changes expression and mood. Because of his expertise, we know that something's seriously wrong with Norman, but can't be sure exactly what, while it takes the rest of the movie to find out. One moment, he's all boyish charm, the next he's glaring darkly with inner fire. Of course, Janet Leigh's superb performance as Marion should not be overlooked. In this key scene, her task is to politely draw out Norman's feelings, an essentially secondary role, but demanding in its own way. Note how delicately she balances her bites of food with proper emotional composure as this strange man reveals more of himself to her. Without doubt, this was an actress with more than just a pretty face.To me, Perkins' eccentric performance is clearly Oscar worthy, ditto the picture itself, along with Hitch's masterful direction. But industry prejudices against horror movies was just too strong then and perhaps now. Of course, it didn't help for Oscar purposes that the production was also low-budget b&w. But I doubt the audience impact would have been nearly as great had that unforgettable package been upscaled in any fashion. At the same time, a big part of the classic flick, in my book, at least, rests with that 7-minutes of emerging horror, so brilliantly understated."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw1571618",
      "warningSpoilers": true,
      "date": "13 January 2007",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "\"My hobby is stuffing things...\"",
      "content": "Chances are that if you go into this movie cold without knowing anything about it (I know, that's almost impossible), you'll be about a half hour into the picture and wondering what the title might be all about. Sure Marion Crane (Janet Leigh) seems highly erratic when questioned by the patrolman, but hardly psychotic. It's not until director Hitchcock suddenly pulls the rug out from under the forty thousand dollar robbery setup, and Marion falls victim to the frenzy of a slashing knife accompanied by the now historic soundtrack that's been indelibly identified with \"Psycho\", that we get the idea that this is not your standard mystery.This is a classic and historic movie, the first on many levels to create a new kind of horror film. Hitchcock was a master of thrills and suspense without ever relying on violence. Here he allows a slight departure from that formula, but without overemphasizing the gore. When the naked Marion Crane is attacked in a shower, completely helpless, it was the birth of a new genre, which unfortunately has degraded into the sensationalist slasher schlock of present day. In \"Psycho\", you never see it coming, except for that shadowed figure behind the shower curtain, but by then it's too late to gasp, you're caught up in the on screen event, and it leaves you breathless.Some viewers call it a perfect film. I don't know if I would go that far, as I've thought about things I might have changed in telling the story. When Marion leaves the used car lot under scrutiny of the highway patrolman, it makes you wonder why he didn't follow up his instinct that there was something fishy going on. Then at the end of the film, the way the psychologist explained in detail the nature of Norman Bates' psychosis, made it seem like it wasn't enough to let the viewer arrive at a conclusion for oneself. But those nitpicks aside, one has to give credit to the principals for pulling off a great psychological and horror thriller. Anthony Perkins couldn't have been smoother, and it's not until at least a second viewing that you realize how wonderful a set up you have to the film's dire outcome. Sitting there talking to Marion among his menagerie of stuffed birds, Norman Bates gives a subtle hint as to the horror about to unfold - \"You know what I think..., I think that..., we're all in our private traps, clamped in them, and none of us can ever get out...\"Watch this one alone..., at night..., in the dark."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1500745",
      "warningSpoilers": false,
      "date": "18 October 2006",
      "rate": "9",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Cleaning Up After Mom",
      "content": "During the Mid Eighties I attended a science fiction convention in Manhattan and the feature attraction there was Anthony Perkins. There was Mr. Perkins, the celebrated Norman Bates of Alfred Hitchcock's Psycho among all the Trekkies and Doctor Who fans, etc. I think he looked on it as an opportunity to promote the succeeding Psycho films.Tony Perkins was clearly ill at ease among the Sci-Fi crowd. People like the Star Trek cast members know what to expect at these gatherings and act accordingly. Perkins did not really know how to handle the banter, he was in my estimation a serious guy who must have thought he was in a freak show. I asked him about appearing in Friendly Persuasion with Gary Cooper and I told him that that was my favorite role he did. He looked grateful that someone knew he did something besides Norman Bates.But for better or worse, Norman Bates became his career role and it's what we remember Anthony Perkins for. He does create an indelible impression on the screen with Alfred Hitchcock's direction as the shy mother fixated man running a flea bag motel in an area where a new super highway has taken all the potential business.Psycho has a simple plot. Janet Leigh on an impulse embezzles $40,000 in cash from her employer and goes on the run. She winds up in the Bates motel run by Norman and his mother. Later on private detective Martin Balsam goes after her as well. And finally John Gavin as Leigh's boy friend and Vera Miles as her sister go looking for the both of them. Simple enough, but Alfred Hitchcock creates a mood of terror and suspense that lingers long after you've seen the film. My favorite shot of the film is not Leigh's legendary shower stabbing, but of Martin Balsam being knocked down and falling down that flight of stairs and then being stabbed to death. The camera work showing Balsam falling backwards is the most terrifying part of Psycho.Though Anthony Perkins did so many other good things, the average cinema fan will tell you 99 out of 100 times that Norman Bates is the role he remembers Perkins for. So Perkins went with the flow.It was repetitious for him, but a treat for fans."
    }
  ],
  "errorMessage": ""
}