{
  "imDbId": "tt0046912",
  "title": "Dial M for Murder",
  "fullTitle": "Dial M for Murder (1954)",
  "type": "Movie",
  "year": "1954",
  "items": [
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/1954/05/29/archives/dial-m-for-murder-is-shown-at-paramount.html",
      "rate": "90",
      "content": "The thrills come in following a succession of dawnings in people's minds.But Mr. Hitchcock has presented this mental material on the screen with remarkable visual definition of developing intrigue and mood."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "If the things here are homelier and less loved than, say, Marnie's neon yellow purse or Cary Grant's glowing glass of milk, and the film itself no one's idea of major Hitch, it remains a fascinating investigation of a stillborn process from one of cinema's most dedicated inquisitors of structure."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2013/jul/25/dial-m-for-murder-3d-review1",
      "rate": "80",
      "content": "The result is a rather stagey film whose back projections look quaint, with 3D apparently used to foreground items of furniture, such as table-lamps, giving rise to some eccentric camera-angles. But the set-up is ingenious and the \"kill\" scene genuinely thrilling. [2013 3D Release]"
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://content.time.com/time/subscriber/article/0,33009,823452,00.html",
      "rate": "80",
      "content": "Dial M is starred with fine scenes and good performances. Though played as contemporary melodrama, it somehow manages to reflect the gaslight magic of turn-of-the-century London."
    },
    {
      "publisher": "Time Out",
      "author": "Guy Lodge",
      "link": "",
      "rate": "80",
      "content": "Its trick is to generate considerable suspense while withholding nothing from the audience. Its pleasures are not profound ones, but there’s enough dimensionality up on the screen to compensate. [2013 3D Release]"
    },
    {
      "publisher": "Slant Magazine",
      "author": "Rob Humanick",
      "link": "",
      "rate": "75",
      "content": "What tends to make even lesser Hitchcock films shine is his innate gift for directing performers, and this accounts for many of the pleasures of this ditty."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Lower case Hitch, but diverting and sleek, with the climax early on. [review of original release]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "70",
      "content": "The screenplay tends to constrain rather than liberate Hitchcock's thematic thrust, but there is much of technical value in his geometric survey of the scene and the elaborate strategies employed to transfer audience sympathy among the four main characters."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/dial-m-murder-review/",
      "rate": "60",
      "content": "Despite Hitchcock's own reservations this is definitely worth a look. Interesting to his aficionados and darkly funny and depressing in turns."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1953/film/reviews/dial-m-for-murder-1200417702/",
      "rate": "60",
      "content": "There are a number of basic weaknesses in the setup that keep the picture from being a good suspense show for any but the most gullible. Via the performances and several suspense tricks expected of Hitchcock, the weaknesses are glossed over but not enough to rate the film a cinch winner."
    }
  ],
  "errorMessage": ""
}