{
  "imDbId": "tt0046912",
  "title": "Dial M for Murder",
  "fullTitle": "Dial M for Murder (1954)",
  "type": "Movie",
  "year": "1954",
  "language": "en",
  "titleInLanguage": "Dial M for Murder",
  "url": "https://en.wikipedia.org/wiki/Dial_M_for_Murder",
  "plotShort": {
    "plainText": "Dial M for Murder is a 1954 American crime thriller film directed by Alfred Hitchcock, starring Ray Milland, Grace Kelly, Robert Cummings, Anthony Dawson, and John Williams. Both the screenplay and the successful stage play on which it was based were written by English playwright Frederick Knott. The play premiered in 1952 on BBC Television, before being performed on stage in the same year in London's West End in June, and then New York's Broadway in October.\r\nOriginally intended to be shown in dual-strip polarized 3-D, the film played in most theatres in ordinary 2-D due to the loss of interest in the 3-D process (the projection of which was difficult and error-prone) by the time of its release. The film earned an estimated $2.7 million in North American box office sales in 1954.",
    "html": "<p>Dial M for Murder is a 1954 American crime thriller film directed by Alfred Hitchcock, starring Ray Milland, Grace Kelly, Robert Cummings, Anthony Dawson, and John Williams. Both the screenplay and the successful stage play on which it was based were written by English playwright Frederick Knott. The play premiered in 1952 on BBC Television, before being performed on stage in the same year in London's West End in June, and then New York's Broadway in October.</p><p>Originally intended to be shown in dual-strip polarized 3-D, the film played in most theatres in ordinary 2-D due to the loss of interest in the 3-D process (the projection of which was difficult and error-prone) by the time of its release. The film earned an estimated $2.7 million in North American box office sales in 1954.</p>"
  },
  "plotFull": {
    "plainText": "Dial M for Murder is a 1954 American crime thriller film directed by Alfred Hitchcock, starring Ray Milland, Grace Kelly, Robert Cummings, Anthony Dawson, and John Williams. Both the screenplay and the successful stage play on which it was based were written by English playwright Frederick Knott. The play premiered in 1952 on BBC Television, before being performed on stage in the same year in London's West End in June, and then New York's Broadway in October.\r\nOriginally intended to be shown in dual-strip polarized 3-D, the film played in most theatres in ordinary 2-D due to the loss of interest in the 3-D process (the projection of which was difficult and error-prone) by the time of its release. The film earned an estimated $2.7 million in North American box office sales in 1954.\r\nPlot\r\nTony Wendice, a retired English tennis player, is married to wealthy socialite Margot, who has been having an affair with American crime-fiction writer Mark Halliday. Unbeknownst to them, Tony has discovered their affair and is planning to have Margot killed so he can inherit her fortune.\r\nTony is aware that Charles Swann, an old acquaintance from Cambridge University, has become a small-time con man with a criminal record. Tony invites Swann to his Maida Vale flat on a pretext, and tells him of Margot's affair. Tony also confides that six months previously, he stole Margot's handbag, which contained a love letter from Mark, and anonymously blackmailed her. After tricking Swann into leaving his fingerprints on the letter, Tony entraps him, threatening to turn him in as Margot's blackmailer unless he kills Margot. With the added inducement of £1,000 in cash, Swann agrees to the murder and Tony explains his plan. Tony and Mark will attend a party while Margot stays home alone. At a specific time when Margot is certain to be in bed, Swann will enter the flat using Margot's latchkey, which Tony will stash under the foyer carpet, and hide. Minutes later, Tony will telephone the flat from the party and Swann will kill Margot when she answers the call. Swann will then whistle over the phone to signal the job is done, leave signs of a burglary gone wrong, and replace the key under the foyer carpet when he departs.\r\nThe following night, Swann enters the flat and Tony calls as planned. When Margot comes to the phone, Swann tries to strangle her with his scarf, but she fatally stabs him with scissors. Upon hearing Margot plead for help instead of Swann's whistle, Tony advises her not to speak to anyone. He returns home, calls the police, sends Margot to bed, and transfers what he thinks is Margot's key from Swann's pocket into her handbag. He also attempts to frame Margot by planting Mark's letter on Swann and destroying Swann's scarf.\r\nThe next day Tony persuades Margot to hide the fact that he told her not to call the police. Chief Inspector Hubbard arrives and questions the Wendices and Margot makes several conflicting statements. When Hubbard says the evidence indicates that Swann entered through the front door, Tony claims that Swann must have been responsible for stealing Margot's handbag, and made a copy of her key. As Tony intends, Hubbard does not believe the story and arrests Margot after concluding that she killed Swann for blackmailing her. Margot is found guilty of murder and sentenced to death.\r\nMonths later, on the day before Margot's scheduled execution, Mark visits Tony, saying he has devised a story for him to tell the police to save Margot. Mark's \"story\" is very close to what actually happened: that Tony paid Swann to kill Margot. Hubbard arrives unexpectedly, and Mark hides in the bedroom. Hubbard asks Tony about large sums of cash he has been spending around town, tricks Tony into revealing that his latchkey is in his raincoat, and inquires about Tony's attaché case. Tony claims to have misplaced the case, but Mark, overhearing the conversation, finds it on the bed, full of banknotes. Deducing that the money was Tony's intended payoff to Swann, Mark confronts Tony and explains his theory to Hubbard. Tony \"confesses\" that the cash was Margot's blackmail payment to Swann, which he had concealed to protect her. Hubbard appears to accept Tony's explanation, and Mark leaves angrily. Hubbard discreetly swaps his own raincoat with Tony's. As soon as Tony leaves, Hubbard uses Tony's key to re-enter the flat, followed by Mark. Hubbard had already discovered that the key in Margot's handbag was Swann's own latchkey and deduced that Swann had put the Wendices' key back in its hiding-place after unlocking the door. Now, correctly suspecting Tony of having conspired with Swann, Hubbard had developed an elaborate ruse to trap him.\r\nPlainclothes police officers bring Margot from prison to the flat. She tries unsuccessfully to unlock the door with the key in her handbag, then enters through the garden, proving to Hubbard that she is unaware of the hidden key and is therefore innocent. Hubbard has Margot's handbag returned to the police station, where Tony retrieves it after discovering that he has no key. The key from Margot's bag does not work, so he uses the hidden key to open the door, demonstrating his guilt and exonerating Margot. With his escape routes blocked by Hubbard and another policeman, Tony calmly makes himself a drink and congratulates Hubbard.\r\nCast\r\nRay Milland as Tony Wendice\r\nGrace Kelly as Margot Mary Wendice\r\nRobert Cummings as Mark Halliday\r\nJohn Williams as Chief Inspector Hubbard\r\nAnthony Dawson as Charles Alexander Swann/Captain Lesgate\r\nLeo Britt as storyteller at the party\r\nPatrick Allen as Detective Pearson\r\nRobin Hughes as Police Sergeant\r\nMartin Milner as policeman outside Wendice flat (uncredited)\r\nGeorge Leigh as Detective Williams\r\nGeorge Alderson as First Detective\r\nProduction\r\nAfter I Confess (1953), Hitchcock planned to film The Bramble Bush, based on the 1948 novel by David Duncan, as a Transatlantic Pictures production, with partner Sidney Bernstein. However, there were problems with the script and budget, and Hitchcock and Bernstein decided to dissolve their partnership. Warner Bros. allowed Hitchcock to scrap the film, and begin production on Dial M for Murder.\r\nMark's name was changed for the film; in the original play, he was Max Halliday. Actors Dawson and Williams reprise their Broadway roles as Swann/Captain Lesgate and Inspector Hubbard, respectively.\r\nAlfred Hitchcock's cameo is a signature occurrence in most of his films. In Dial M for Murder, he can be seen thirteen minutes into the film, in a black-and-white reunion photograph, sitting at a banquet table among former students and faculty.\r\nRelease\r\nDial M for Murder was shot using Warner Bros.' own proprietary 3-D camera rig, the so-called All-Media Camera. After one preview performance on May 18 and four showings on the May 19, a Philadelphia theater manager frantically contacted the studio and said that people were staying away in droves. He asked for permission to drop the 3-D and show the film flat.\r\nThe Philadelphia Inquirer reported on May 23 that the \"first audiences proved to be a jury that could not only make up its mind, but could make it up in a hurry. In exhibitors' own terms, \"DIAL M\" literally died. And after just four performances on Wednesday, some long-distance telephoning to report complaints, the increasing skimpiness of customers—a good many of them making no bones of their dissatisfaction—permission was given to throw away the glasses and hastily switch to the 2-D version. Whereupon business at the Randolph took a turn for the better.\"\r\nDial M for Murder marked the end of the brief flirtation with 3-D films of the early 1950s. Hitchcock said of 3-D: \"It's a nine-day wonder, and I came in on the ninth day.\"\r\nThe dual-strip system was used for the February 1980 revival of the film in 3D at the York Theater in San Francisco, California. This revival performed so well that Warner Bros. did a limited national re-release of the film in February 1982 using Chris Condon's single-strip StereoVision 3-D system. The re-release included a sold-out engagement at the Detroit Institute of Arts.\r\nThe film was shown in 3D in some UK cinemas during the summer of 2013 and in Italy at the beginning of fall of the same year.\r\nWarner Bros. released Dial M for Murder as a 3D Blu-ray on October 9, 2012.\r\nReception\r\n\"This is a technical triumph that Hitchcock has achieved,\" wrote Bosley Crowther of The New York Times in a favourable review. \"It is one for which he needed good actors. He has them—and the best of the lot is John Williams, late of the stage play, who is the detective who solves the sinister ruse.\" Variety wrote: \"There are a number of basic weaknesses in the set-up that keep the picture from being a good suspense show for any but the most gullible. Via the performances and several suspense tricks expected of Hitchcock, the weaknesses are glossed over to some extent but not enough to rate the film a cinch winner.\" Harrison's Reports wrote that the film \"shapes up as no more than a mild entertainment, despite the expert direction of Hitchcock and the competent acting of the players. The chief weakness is that the action is slow, caused by the fact that the story unfolds almost entirely by dialogue.\"\r\nRichard L. Coe of The Washington Post called the film \"completely choice,\" with Williams and Dawson \"smooth as silk in reprising their stage roles,\" adding, \"Hitch has a field day with his camera angles, darting our eyes now here, now there, doing tingling tricks with shadows and long longshots in quick contrast to fuzzed close-ups. It's the work of a master enjoying his script.\" John McCarten of The New Yorker wrote a generally positive review, writing that he wished the script would give Hitchcock \"a chance to cut loose with one of those spectacular chases he used to specialise in,\" but finding that after a talky opening 30 minutes, \"things speed up once the murder wheels are set in motion, and eventually the piece becomes grimly diverting.\" The Monthly Film Bulletin wrote that the film \"offers the prolific Hitchcock little more than an opportunity to carpenter a neat piece of filmed theatre—an opportunity which perhaps satisfied the master a little more than it does us ... The characters are fitted to their situations, and hardly exist in themselves (nor are they enlivened by the rather drab performances of Ray Milland, Grace Kelly and Robert Cummings); only John Williams' dry, sardonic police inspector has a touch of individuality.\"\r\nOn the review aggregation website Rotten Tomatoes, the film holds a \"Certified Fresh\" rating of 89% based on 47 reviews, with an average rating of 7.30/10. The site's critical consensus reads: \"Dial M for Murder may be slightly off-peak Hitchcock, but by any other standard, it's a sophisticated, chillingly sinister thriller -- and one that boasts an unforgettable performance from Grace Kelly to boot\". In 2012, The Guardian called the film \"a taut, acidly funny thriller.\"\r\nThe film was listed by American Film Institute in 2001 in AFI's 100 Years...100 Thrills (#48), and in 2008 in AFI's 10 Top 10 (#9 in Mysteries).\r\nSimilar films and remakes\r\nAs it is considered one of the classic examples of a stage thriller, it has been revived a number of times since, including a US TV film in 1981 with Angie Dickinson and Christopher Plummer. In 1958 the National Broadcasting Company (NBC) aired a television film in which Maurice Evans (as Tony), Williams and Dawson all repeated their roles from the original Broadway play. The American Broadcasting Company (ABC) produced a two-hour color version in 1968 featuring Laurence Harvey as Tony, Diane Cilento as Margot and Hugh O'Brian as Max.\r\nA Perfect Murder is a 1998 remake directed by Andrew Davis in which the characters of Halliday and Swann are combined, with the husband (Michael Douglas) both hiring and coercing his wife's lover (played by Viggo Mortensen) into a scheme to kill her (Gwyneth Paltrow). However, the lover hatches a revenge plot against the husband. Things go disastrously wrong for both of them, bringing in the cold, smoothly dogged police inspector (David Suchet), whose role is much reduced, as it is Gwyneth Paltrow's character, the wife, who unravels much of the mystery.\r\nThe television series Alfred Hitchcock Presents premiered in the United States the year after Dial M for Murder was released. The main character in an episode from the series's first season, \"Portrait of Jocelyn\", is named Mark Halliday. In the episode, Halliday's wife, Jocelyn, has disappeared several years earlier, and at the conclusion, it is revealed that he murdered her.\r\nThe original play was also adapted in the Soviet Union in 1981 under the title Tony Wendice's Mistake (Ошибка Тони Вендиса).\r\nThe film partially inspired a Hindi-language version in 1985, released as Aitbaar, starring Raj Babbar, Dimple Kapadia and Suresh Oberoi. A Tamil-language adaptation, titled Saavi, with Sathyaraj, Saritha, Jaishankar and Nizhalgal Ravi, was released in the same year. The film also inspired a Malayalam-language adaptation as New Year starring Jayaram, Urvashi and Suresh Gopi in 1989. Another Bollywood film, Humraaz (2002), starring Bobby Deol, Akshaye Khanna, and Amisha Patel, was inspired by A Perfect Murder.\r\nThe episode \"The Fifth Stair\" of the TV series 77 Sunset Strip recreated Dial M for Murder, with Richard Long portraying Tony Wendice.\r\nThe third episode of the sixth season of Frasier is titled \"Dial M for Martin\". The plot centres on the title character's father believing that his younger son is subconsciously trying to kill him when he is beset by a series of mishaps seemingly caused by Frasier's younger brother, Niles.\r\nThe season 1 finale of the TV series Archer is titled \"Dial M for Mother\" in reference to the film. In the episode, Sterling Archer is given a brain implant which makes him subconsciously want to kill his mother Malory.\r\nThe New Vic Theatre staged a production of the play in its main house (in the round) in 2017. It was directed by Peter Leslie Wild and the cast featured William Ellis as Tony. The play received positive press reviews.",
    "html": "<p>Dial M for Murder is a 1954 American crime thriller film directed by Alfred Hitchcock, starring Ray Milland, Grace Kelly, Robert Cummings, Anthony Dawson, and John Williams. Both the screenplay and the successful stage play on which it was based were written by English playwright Frederick Knott. The play premiered in 1952 on BBC Television, before being performed on stage in the same year in London's West End in June, and then New York's Broadway in October.</p><p>Originally intended to be shown in dual-strip polarized 3-D, the film played in most theatres in ordinary 2-D due to the loss of interest in the 3-D process (the projection of which was difficult and error-prone) by the time of its release. The film earned an estimated $2.7 million in North American box office sales in 1954.</p><br/><h3>Plot</h3><p>Tony Wendice, a retired English tennis player, is married to wealthy socialite Margot, who has been having an affair with American crime-fiction writer Mark Halliday. Unbeknownst to them, Tony has discovered their affair and is planning to have Margot killed so he can inherit her fortune.</p><p>Tony is aware that Charles Swann, an old acquaintance from Cambridge University, has become a small-time con man with a criminal record. Tony invites Swann to his Maida Vale flat on a pretext, and tells him of Margot's affair. Tony also confides that six months previously, he stole Margot's handbag, which contained a love letter from Mark, and anonymously blackmailed her. After tricking Swann into leaving his fingerprints on the letter, Tony entraps him, threatening to turn him in as Margot's blackmailer unless he kills Margot. With the added inducement of £1,000 in cash, Swann agrees to the murder and Tony explains his plan. Tony and Mark will attend a party while Margot stays home alone. At a specific time when Margot is certain to be in bed, Swann will enter the flat using Margot's latchkey, which Tony will stash under the foyer carpet, and hide. Minutes later, Tony will telephone the flat from the party and Swann will kill Margot when she answers the call. Swann will then whistle over the phone to signal the job is done, leave signs of a burglary gone wrong, and replace the key under the foyer carpet when he departs.</p><p>The following night, Swann enters the flat and Tony calls as planned. When Margot comes to the phone, Swann tries to strangle her with his scarf, but she fatally stabs him with scissors. Upon hearing Margot plead for help instead of Swann's whistle, Tony advises her not to speak to anyone. He returns home, calls the police, sends Margot to bed, and transfers what he thinks is Margot's key from Swann's pocket into her handbag. He also attempts to frame Margot by planting Mark's letter on Swann and destroying Swann's scarf.</p><p>The next day Tony persuades Margot to hide the fact that he told her not to call the police. Chief Inspector Hubbard arrives and questions the Wendices and Margot makes several conflicting statements. When Hubbard says the evidence indicates that Swann entered through the front door, Tony claims that Swann must have been responsible for stealing Margot's handbag, and made a copy of her key. As Tony intends, Hubbard does not believe the story and arrests Margot after concluding that she killed Swann for blackmailing her. Margot is found guilty of murder and sentenced to death.</p><p>Months later, on the day before Margot's scheduled execution, Mark visits Tony, saying he has devised a story for him to tell the police to save Margot. Mark's \"story\" is very close to what actually happened: that Tony paid Swann to kill Margot. Hubbard arrives unexpectedly, and Mark hides in the bedroom. Hubbard asks Tony about large sums of cash he has been spending around town, tricks Tony into revealing that his latchkey is in his raincoat, and inquires about Tony's attaché case. Tony claims to have misplaced the case, but Mark, overhearing the conversation, finds it on the bed, full of banknotes. Deducing that the money was Tony's intended payoff to Swann, Mark confronts Tony and explains his theory to Hubbard. Tony \"confesses\" that the cash was Margot's blackmail payment to Swann, which he had concealed to protect her. Hubbard appears to accept Tony's explanation, and Mark leaves angrily. Hubbard discreetly swaps his own raincoat with Tony's. As soon as Tony leaves, Hubbard uses Tony's key to re-enter the flat, followed by Mark. Hubbard had already discovered that the key in Margot's handbag was Swann's own latchkey and deduced that Swann had put the Wendices' key back in its hiding-place after unlocking the door. Now, correctly suspecting Tony of having conspired with Swann, Hubbard had developed an elaborate ruse to trap him.</p><p>Plainclothes police officers bring Margot from prison to the flat. She tries unsuccessfully to unlock the door with the key in her handbag, then enters through the garden, proving to Hubbard that she is unaware of the hidden key and is therefore innocent. Hubbard has Margot's handbag returned to the police station, where Tony retrieves it after discovering that he has no key. The key from Margot's bag does not work, so he uses the hidden key to open the door, demonstrating his guilt and exonerating Margot. With his escape routes blocked by Hubbard and another policeman, Tony calmly makes himself a drink and congratulates Hubbard.</p><br/><h3>Cast</h3><ul><li>Ray Milland as Tony Wendice</li><li>Grace Kelly as Margot Mary Wendice</li><li>Robert Cummings as Mark Halliday</li><li>John Williams as Chief Inspector Hubbard</li><li>Anthony Dawson as Charles Alexander Swann/Captain Lesgate</li><li>Leo Britt as storyteller at the party</li><li>Patrick Allen as Detective Pearson</li><li>Robin Hughes as Police Sergeant</li><li>Martin Milner as policeman outside Wendice flat (uncredited)</li><li>George Leigh as Detective Williams</li><li>George Alderson as First Detective</li></ul><br/><h3>Production</h3><p>After I Confess (1953), Hitchcock planned to film The Bramble Bush, based on the 1948 novel by David Duncan, as a Transatlantic Pictures production, with partner Sidney Bernstein. However, there were problems with the script and budget, and Hitchcock and Bernstein decided to dissolve their partnership. Warner Bros. allowed Hitchcock to scrap the film, and begin production on Dial M for Murder.</p><p>Mark's name was changed for the film; in the original play, he was Max Halliday. Actors Dawson and Williams reprise their Broadway roles as Swann/Captain Lesgate and Inspector Hubbard, respectively.</p><p>Alfred Hitchcock's cameo is a signature occurrence in most of his films. In Dial M for Murder, he can be seen thirteen minutes into the film, in a black-and-white reunion photograph, sitting at a banquet table among former students and faculty.</p><br/><h3>Release</h3><p>Dial M for Murder was shot using Warner Bros.' own proprietary 3-D camera rig, the so-called All-Media Camera. After one preview performance on May 18 and four showings on the May 19, a Philadelphia theater manager frantically contacted the studio and said that people were staying away in droves. He asked for permission to drop the 3-D and show the film flat.</p><p>The Philadelphia Inquirer reported on May 23 that the \"first audiences proved to be a jury that could not only make up its mind, but could make it up in a hurry. In exhibitors' own terms, \"DIAL M\" literally died. And after just four performances on Wednesday, some long-distance telephoning to report complaints, the increasing skimpiness of customers—a good many of them making no bones of their dissatisfaction—permission was given to throw away the glasses and hastily switch to the 2-D version. Whereupon business at the Randolph took a turn for the better.\"</p><p>Dial M for Murder marked the end of the brief flirtation with 3-D films of the early 1950s. Hitchcock said of 3-D: \"It's a nine-day wonder, and I came in on the ninth day.\"</p><p>The dual-strip system was used for the February 1980 revival of the film in 3D at the York Theater in San Francisco, California. This revival performed so well that Warner Bros. did a limited national re-release of the film in February 1982 using Chris Condon's single-strip StereoVision 3-D system. The re-release included a sold-out engagement at the Detroit Institute of Arts.</p><p>The film was shown in 3D in some UK cinemas during the summer of 2013 and in Italy at the beginning of fall of the same year.</p><p>Warner Bros. released Dial M for Murder as a 3D Blu-ray on October 9, 2012.</p><br/><h3>Reception</h3><p>\"This is a technical triumph that Hitchcock has achieved,\" wrote Bosley Crowther of The New York Times in a favourable review. \"It is one for which he needed good actors. He has them—and the best of the lot is John Williams, late of the stage play, who is the detective who solves the sinister ruse.\" Variety wrote: \"There are a number of basic weaknesses in the set-up that keep the picture from being a good suspense show for any but the most gullible. Via the performances and several suspense tricks expected of Hitchcock, the weaknesses are glossed over to some extent but not enough to rate the film a cinch winner.\" Harrison's Reports wrote that the film \"shapes up as no more than a mild entertainment, despite the expert direction of Hitchcock and the competent acting of the players. The chief weakness is that the action is slow, caused by the fact that the story unfolds almost entirely by dialogue.\"</p><p>Richard L. Coe of The Washington Post called the film \"completely choice,\" with Williams and Dawson \"smooth as silk in reprising their stage roles,\" adding, \"Hitch has a field day with his camera angles, darting our eyes now here, now there, doing tingling tricks with shadows and long longshots in quick contrast to fuzzed close-ups. It's the work of a master enjoying his script.\" John McCarten of The New Yorker wrote a generally positive review, writing that he wished the script would give Hitchcock \"a chance to cut loose with one of those spectacular chases he used to specialise in,\" but finding that after a talky opening 30 minutes, \"things speed up once the murder wheels are set in motion, and eventually the piece becomes grimly diverting.\" The Monthly Film Bulletin wrote that the film \"offers the prolific Hitchcock little more than an opportunity to carpenter a neat piece of filmed theatre—an opportunity which perhaps satisfied the master a little more than it does us ... The characters are fitted to their situations, and hardly exist in themselves (nor are they enlivened by the rather drab performances of Ray Milland, Grace Kelly and Robert Cummings); only John Williams' dry, sardonic police inspector has a touch of individuality.\"</p><p>On the review aggregation website Rotten Tomatoes, the film holds a \"Certified Fresh\" rating of 89% based on 47 reviews, with an average rating of 7.30/10. The site's critical consensus reads: \"Dial M for Murder may be slightly off-peak Hitchcock, but by any other standard, it's a sophisticated, chillingly sinister thriller -- and one that boasts an unforgettable performance from Grace Kelly to boot\". In 2012, The Guardian called the film \"a taut, acidly funny thriller.\"</p><p>The film was listed by American Film Institute in 2001 in AFI's 100 Years...100 Thrills (#48), and in 2008 in AFI's 10 Top 10 (#9 in Mysteries).</p><br/><h3>Similar films and remakes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">July 2021</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>As it is considered one of the classic examples of a stage thriller, it has been revived a number of times since, including a US TV film in 1981 with Angie Dickinson and Christopher Plummer. In 1958 the National Broadcasting Company (NBC) aired a television film in which Maurice Evans (as Tony), Williams and Dawson all repeated their roles from the original Broadway play. The American Broadcasting Company (ABC) produced a two-hour color version in 1968 featuring Laurence Harvey as Tony, Diane Cilento as Margot and Hugh O'Brian as Max.</p><p>A Perfect Murder is a 1998 remake directed by Andrew Davis in which the characters of Halliday and Swann are combined, with the husband (Michael Douglas) both hiring and coercing his wife's lover (played by Viggo Mortensen) into a scheme to kill her (Gwyneth Paltrow). However, the lover hatches a revenge plot against the husband. Things go disastrously wrong for both of them, bringing in the cold, smoothly dogged police inspector (David Suchet), whose role is much reduced, as it is Gwyneth Paltrow's character, the wife, who unravels much of the mystery.</p><p>The television series Alfred Hitchcock Presents premiered in the United States the year after Dial M for Murder was released. The main character in an episode from the series's first season, \"Portrait of Jocelyn\", is named Mark Halliday. In the episode, Halliday's wife, Jocelyn, has disappeared several years earlier, and at the conclusion, it is revealed that he murdered her.</p><p>The original play was also adapted in the Soviet Union in 1981 under the title Tony Wendice's Mistake (Ошибка Тони Вендиса).</p><p>The film partially inspired a Hindi-language version in 1985, released as Aitbaar, starring Raj Babbar, Dimple Kapadia and Suresh Oberoi. A Tamil-language adaptation, titled Saavi, with Sathyaraj, Saritha, Jaishankar and Nizhalgal Ravi, was released in the same year. The film also inspired a Malayalam-language adaptation as New Year starring Jayaram, Urvashi and Suresh Gopi in 1989. Another Bollywood film, Humraaz (2002), starring Bobby Deol, Akshaye Khanna, and Amisha Patel, was inspired by A Perfect Murder.</p><p>The episode \"The Fifth Stair\" of the TV series 77 Sunset Strip recreated Dial M for Murder, with Richard Long portraying Tony Wendice.</p><p>The third episode of the sixth season of Frasier is titled \"Dial M for Martin\". The plot centres on the title character's father believing that his younger son is subconsciously trying to kill him when he is beset by a series of mishaps seemingly caused by Frasier's younger brother, Niles.</p><p>The season 1 finale of the TV series Archer is titled \"Dial M for Mother\" in reference to the film. In the episode, Sterling Archer is given a brain implant which makes him subconsciously want to kill his mother Malory.</p><p>The New Vic Theatre staged a production of the play in its main house (in the round) in 2017. It was directed by Peter Leslie Wild and the cast featured William Ellis as Tony. The play received positive press reviews.</p><br/>"
  },
  "errorMessage": ""
}