{
  "imDbId": "tt1950186",
  "title": "Ford v Ferrari",
  "fullTitle": "Ford v Ferrari (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "publisher": "TheWrap",
      "author": "Sasha Stone",
      "link": "https://www.thewrap.com/ford-v-ferrari-film-review-christian-bale-and-matt-damon-feel-the-need-for-speed/",
      "rate": "100",
      "content": "The chemistry between Bale and Damon is what makes the movie move the way it does, along with the script. Bale alone in the race car figuring out how to win and survive is where the film really sings."
    },
    {
      "publisher": "The Playlist",
      "author": "Gregory Ellwood",
      "link": "",
      "rate": "91",
      "content": "Ford v Ferrari is the sort of cinematic entertainment that sucks you in and won’t let you go until you cross the finish line."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/ford-v-ferrari-review-1235888/",
      "rate": "90",
      "content": "The film’s lively dynamics owe much to the bristly nature of nearly every relationship and interaction in the film."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Leah Greenblatt",
      "link": "https://ew.com/movie-reviews/2019/09/04/ford-v-ferrari-review-matt-damon-christian-bale/",
      "rate": "83",
      "content": "It’s a movie so well put together as a hero’s tale that it moves along almost too smoothly; the script by brothers Jez and John Henry Butterworth hits its marks of tragedy and triumph with a kind of shiny, measured inevitability."
    },
    {
      "publisher": "The Film Stage",
      "author": "Christopher Schobert",
      "link": "",
      "rate": "83",
      "content": "Ford v Ferrari is an easy film to scoff at; there is nothing new here, and there is no debating that fact. Instead, we have a compelling story told in simple, intelligent fashion. It deserves a spot on the list of great racing dramas, and the list of the year’s most entertaining dramas."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/criticism/movies/ford-v-ferrari-review-matt-damon-christian-bale-1202170145/",
      "rate": "75",
      "content": "Damon and Bale are such magnetic onscreen figures that it doesn’t take much to inject their various arguments, smarmy asides, and high-stakes bets with plenty of intrigue."
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2019/film/reviews/ford-v-ferrari-review-1203319686/",
      "rate": "70",
      "content": "Watching Bale and Damon channel those two speed freaks in all of their surly, testosterone-spitting glory is a reminder of how much fun it was to watch Bale play a similar character opposite Mark Wahlberg in “The Fighter.”"
    },
    {
      "publisher": "Slant Magazine",
      "author": "Jake Cole",
      "link": "",
      "rate": "63",
      "content": "At a time when the nation continues to weigh the fate of its auto industry, James Mangold’s depiction of the Ford Motor Company facing its first major financial threat transparently plays to nostalgic reveries of the industry’s golden age."
    },
    {
      "publisher": "Total Film",
      "author": "Matt Maytum",
      "link": "https://www.gamesradar.com/le-mans-66-review-ford-v-ferrari/",
      "rate": "60",
      "content": "Two immensely enjoyable central performances and some of the best race sequences yet filmed fuel an otherwise standard sports movie."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2019/sep/10/ford-v-ferrari-review-james-mangold-matt-damon-christian-bale",
      "rate": "40",
      "content": "It is crammed with unearned emotional moments and factory-built male characters whose dedication to their sport we are expected to find adorable and heroic by turns."
    }
  ],
  "errorMessage": ""
}