{
  "imDbId": "tt1950186",
  "title": "Ford v Ferrari",
  "fullTitle": "Ford v Ferrari (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw6041152",
      "warningSpoilers": false,
      "date": "29 August 2020",
      "rate": "",
      "helpful": "59 out of 63 found this helpful.",
      "title": "special",
      "content": "I love Christian Bale. For each of his roles. But , in this case, I adore him. Because he is real great. Because the\"chemistry \" between him and Matt Damon is perfect. But the film gives more . An admirable portrait of Enzo Ferrari by Remo Girone,fine job of Noah Jupe , Tracy Letts proposing a great Henry Ford II and each scene being admirable crafted. A film about race, family and passion. A special one, in high measure, in profound sense."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw5489935",
      "warningSpoilers": false,
      "date": "17 February 2020",
      "rate": "9",
      "helpful": "79 out of 87 found this helpful.",
      "title": "Entertaining In Every Way A Film Can Be",
      "content": "I've never watched a car race in my life. I have absolutely no knowledge of the historic events surrounding the Ford and Ferrari motor companies. None of those two things mattered in my viewing experience of \"Ford v Ferrari\". Not only does it allow the viewer to be a complete clean slate, but it provides the utmost of entertainment on almost every front.For a very basic overview, this movie tells the story of how the Ford Motor Company was struggling in the 1960s and thus turned to racing cars to give their image a boost. The problem? For years, Ferrari has been the gold standard in that theater. But with Carroll Shelby (Matt Damon) overseeing the project and the volatile Ken Miles (Christian Bale) in the driver's seat, they set out to take down Ferrari at the 1966 24 Hours of Le Mans race.One of the main strengths of \"Ford v Ferrari\" is that it tells a bunch of different stories within the basic framework. Not only is it the clash that the title anticipates, but also a story of personal redemption for Shelby, one of personal goal-achievement for Miles, and even a healthy dose of \"big corporation screwing over the little guy\" thrown in. All of those angles are very distinct, with nothing muddled along the way. The 2.5 hour runtime really helps with this, allowing such arcs to play out in their entirety.The acting is also incredible from basically the entire cast. Bale gives a unique, quirky performance as seemingly only he can, Damon is solid (as always), and everyone else does their part admirably. Especially affecting are Miles' wife Mollie (Caitriona Balfe) and son Peter (Noah Jupe), who both provide much of the sentimental emotions present in the film. A specific scene where Ken explains to Peter exactly what he does on each individual racing lap is as good as acting gets.There's also a never-ending sense of forward momentum and just overall fun to \"Ford v Ferrari\". It never takes itself too seriously, yet it isn't a comedy. It's long, but doesn't feel that way due to the expert pacing--a perfect balance of pulse-pounding action scenes and slower, more emotional scenes within the understated 1960s period feel. Director James Mangold probably deserves a good amount of the credit for making this all congeal together as well as it did.Overall, this is a spectacular film precisely because it can hit audiences in so many different ways. Whether through the action, emotion, true story, or underlying themes, most viewers will be able to find something to enjoy here. Even if, like I said before, no previously knowledge of racing is present."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw5507513",
      "warningSpoilers": false,
      "date": "24 February 2020",
      "rate": "8",
      "helpful": "41 out of 46 found this helpful.",
      "title": "old fashion greatness",
      "content": "Racing champ Carroll Shelby (Matt Damon) has to retire due to a medical issue. His racing friend Ken Miles (Christian Bale) is seen as difficult and the IRS has confiscated his garage. Ferrari has been at the top of racing in the 24 Hours of Le Mans. The Ford Motor Company finds its sales going stale and Henry Ford II wants a big idea. Marketing VP Lee Iacocca has the idea to enter the race. They first try to buy Ferrari and Enzo Ferrari insults Henry Ford II. Iacocca recruits Shelby to create a racing car and Shelby recruits Miles to be his driver.This is an old fashion rip roaring good times. Damon and Bale are great. All the actors are great whether it's Tracy Letts being told that he's not Henry Ford or the villainy of Josh Lucas. It's a solid sports underdog story. It's fun like Caitriona Balfe driving crazy. The race is thrilling. It is a perfectly made old fashion movie."
    },
    {
      "username": "Instant_Palmer",
      "userUrl": "https://www.imdb.com/user/ur39322316",
      "reviewLink": "https://www.imdb.com/review/rw7965028",
      "warningSpoilers": false,
      "date": "15 March 2022",
      "rate": "10",
      "helpful": "52 out of 57 found this helpful.",
      "title": "Best Race Car Movie Ever? 💯",
      "content": "Gut level racing movie with no need to manufacture fictional drama - Fact takes over the drama throughout Ford v Ferrari and it is glorious on-the-edge engagement fueled by the Hi-Test performances of the two stars Matt Damon and Christian Bale.Being a former SCCA racer (in my 20's), my bucket list need for speed took me to the track to live out my childhood dream of racing cars, and I did an admirable job at winning races at one of the lowest levels possible in racing - but it was always about being the best that I knew I could be (and could afford as car racing gets very expensive as you move up to the higher performance level cars), which as it turns out was better than anyone else at that level.Hill took that to the top production and competition levels (financed by manufacturers, and those independents with extremely deep pockets), illustrating the universal need of racers to validate their abilities, which is magnified 100-fold at the professional level.This is a great film as filmmaking goes, whether one is a race fan or a movie fan, and deserved its nominations and awards. Best race car movie of all time?? X marks the spot, and that is 'Ford v Ferrari'. No brainer 10/10.👍👍"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw5485619",
      "warningSpoilers": true,
      "date": "15 February 2020",
      "rate": "8",
      "helpful": "20 out of 22 found this helpful.",
      "title": "\"We're gonna build a race car.\"",
      "content": "You don't have to be a race car enthusiast to enjoy this film. I'm certainly not, having neither the desire or the patience to watch daring motor cars race around a track at mind boggling speeds. Though you do have to credit the drivers who enjoy the profession; it takes a certain amount of bravura and stamina to withstand the pace and stress forces that go with the territory. Without knowing the story in advance, I thought it was going to pit Matt Damon against Christian Bale as opposing drivers, but that idea was quickly put to rest. The legendary Carroll Shelby (Damon) is in the spotlight here as the former racer and design engineer recruited by the Ford Motor Company to build a championship vehicle. In no small measure was it Ford's response to a snub by Italian car maker, Enzo Ferrari, who turned down a merger with the American company in a fit of pique. Had he gone along, the end result in the picture may never have occurred.The movie will call to mind the Steve McQueen race car epic \"Le Mans\" from 1971. With a half century separating the two films, both reliably capture the spirit and flavor of the world's longest endurance test. \"Le Mans\" has more of a documentary type feel than the movie under consideration here, with less of a plot and straightforward story line. Building up to the seminal race in 1966 featured in this film, the story takes an introspective look at the machinations of the Ford Motor Company to control all aspects of engineering a vehicle they hope to defeat the Italians with. Not to mention the politics and marketing aspect of selecting a driver who wouldn't embarrass the company by going public with any developmental problems along the way.For fans and non-fans alike, the racing scenes are thrilling and adrenaline inducing. As driver Ken Mills, Christian Bale exudes nerves of steel and a soaring passion to be the best driver out there, achieving mind boggling speeds that would otherwise strike fear in the hearts of most mortal men. That was comically illustrated in the one scene in which Shelby himself took Henry Ford II (Tracy Letts) for a 'spin' in a car under development. If there's any sense of a let down with the picture, it would have to be the screw job Mills suffered when he agreed to bring in all three of Ford's race cars to the finish line together at Le Mans. Realizing it, Mills bore the slight with dignity, knowing in his heart that he was the best driver out there that day, and nothing could take that away from him."
    },
    {
      "username": "kjproulx",
      "userUrl": "https://www.imdb.com/user/ur23240045",
      "reviewLink": "https://www.imdb.com/review/rw5112531",
      "warningSpoilers": false,
      "date": "10 September 2019",
      "rate": "9",
      "helpful": "211 out of 264 found this helpful.",
      "title": "Filled with Energy",
      "content": "Biopics can be a hard sell at times. Whether you're diving into the troubled life of an addict or exploring someone's sexuality, there are many touchy subjects these days. With that said, I feel there are also those that will stand the test of time, in terms of being able to please a wide audience. Ford v Ferrari is one of the latest true stories out of Hollywood that will be hitting the big screen soon, and here's why I believe it absolutely deserves attention.Following multiple characters throughout, Ford v Ferrari focussed on the fact that Henry Ford II was given an idea to create the fastest race car in the world. His mission is to take down the likes of the company Ferrari, who have held the title for years. Carol Shelby (Matt Damon) is approached by a member of the Ford team and is recruited, only to be the one finding himself recruiting the driver in Ken Miles (Christian Bale). That's the core premise and there's a lot to dive into from there.If you're a fan of racing or cars in general, this movie will be for you. This is a very well-directed film by James Mangold, and the racing sequences are quite long, taking up a good chunk of the nearly 150-minute run time. Luckily, they are very intense, practically shot, with a fantastic score to back it up, and sound effects to get your heart pumping. Everything about the exciting aspects of this film was top notch.Christian Bale and Matt Damon give stellar performances here as the two leading men in the film and I totally bought their rigid friendship that slowly developed. Sadly, without giving anything away, there is an incident that I feel was not explored enough, which slightly took away when a certain moment is meant to impact the movie. Other than that, this is a fantastic movie from beginning to end.In the end, Ford v Ferrari is engaging, emotional, and downright thrilling when it wants to be. I was invested in these characters and on the edge of my seat during the climactic races. I thoroughly enjoyed my experience with this movie. There is a missed opportunity in terms of emotion during a certain scene, but I was able to forgive that, seeing as the rest of the movie was so impressive. Ford v Ferrari is one of the best movies I've seen so far this year and it will be one to see when it officially releases."
    },
    {
      "username": "g_cotterell",
      "userUrl": "https://www.imdb.com/user/ur25123058",
      "reviewLink": "https://www.imdb.com/review/rw5261491",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "1,090 out of 1,177 found this helpful.",
      "title": "Puts my faith in the movie business again",
      "content": "This is what cinema is supposed to be! Amazing chemistry and acting by both leads, seamless CGI and practical effects to enhance the film, a firecracker script, a true story, pulse pounding soundtrack, booming sound mix, and edited so well that 2.5 hours flies by! Completely and utterly engaging . So good in fact I saw it twice within 24 hours . Once in Imax and once in Dolby cinema ."
    },
    {
      "username": "ymyuseda",
      "userUrl": "https://www.imdb.com/user/ur92139946",
      "reviewLink": "https://www.imdb.com/review/rw5269618",
      "warningSpoilers": true,
      "date": "20 November 2019",
      "rate": "10",
      "helpful": "299 out of 365 found this helpful.",
      "title": "Oscar Winning Performance",
      "content": "Rating 10/10 Inspired movie of the year. It is wonderfully made. A good story well told. Tightly written, well acted and directed. I hope Matt Damon and Christian Bale can winning an oscar awards because he already deliver the character very well. Thank you to all of you because make it this movie so amazing . A masterpiece !!"
    },
    {
      "username": "Keemshave",
      "userUrl": "https://www.imdb.com/user/ur88267634",
      "reviewLink": "https://www.imdb.com/review/rw5271883",
      "warningSpoilers": false,
      "date": "21 November 2019",
      "rate": "9",
      "helpful": "158 out of 200 found this helpful.",
      "title": "An exhilarating and emotional ride",
      "content": "A lot of notes were hit by Ford v Ferrari. The characters are fleshed out very well and give you the emotional attachment you're looking for in a movie. Bale and Damon's performances are great; they pull you into the story and completely disappear into their roles. James Mangold proves, once again, to be a master behind the camera. The action scenes are shot to perfection and will have you biting your nails.The film's technical aspects were top-notch as well. Wait for this film to be nominated for sound design and editing. These technical aspects, during the climax of the film, will blow your hair back and give you goosebumps.All in all, this film provides a pleasing experience for the crowd that not many films can even come close to delivering. I loved about every second of it, despite its long runtime."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw5827343",
      "warningSpoilers": false,
      "date": "15 June 2020",
      "rate": "8",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Engaging Action Film",
      "content": "\"Ford v Ferrari\" is an engaging action film based on a true story, when the American manufacturer Ford decided to build the racing car Ford GT40 to defeat the Italian Ferrari at the \"24 Hours of Le Mans\" in 1966. The plot is dramatic, funny, highly entertaining and not historically accurate (in accordance with those that are fans of car racing), with Matt Damon and the magnificent Christian Bale in the lead roles. But the film never disappoints the fans of a great action film.Christian Bale was nominated in the Golden Globe in the category Best Performance by an Actor in a Motion Picture - Drama and \"Ford v Ferrari\" was Oscar Winner in the Best Achievement in Film Editing and Sound Editing and nominated to the Best Motion Picture of the Year and Best Achievement in Sound Mixing. These awards and nominations would suffice to indicate how good this film is and the viewer does not need to be a car racing fan to like and enjoy it. My vote is eight.Title (Brazil): \"Ford vs Ferrari\" (\"Ford v Ferrari\")"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw5333468",
      "warningSpoilers": false,
      "date": "19 December 2019",
      "rate": "9",
      "helpful": "27 out of 34 found this helpful.",
      "title": "Rushing to the finish",
      "content": "After being very behind with film watching and reviewing, a lot of my reviews this year being dedicated to individual episodes of shows, completest quests and some cartoons, finally made the decision to watch more films released this year and to finally review the films seen earlier this year but hadn't gotten round to seeing. 'Le Mans 66' was a very eagerly anticipated film, due to liking the lead actors and loving 'Rush' that this has been compared to by some, and one of the year's (quite hit and miss) more acclaimed films, so there was not any doubt about seeing it.'Le Mans 66' (often advertised though under the easier to remember title of 'Ford v Ferrari') doesn't disappoint a vast majority of the time, almost everything is right with it. Found it an exceptionally well made, acted, written and enthralling film and one of the year's must sees, also one of the few films this year where the advertising actually did it justice which is such a rarity in film (having lost count of the number of great films that were criminally mismarketed or misleadingly so). Seeing as 2019 has been another hit and miss year, with a fair share of good to brilliant films, a fair share of mediocre films or less (including clunkers) and films sitting in between, that is saying a fair bit actually and am not trying to sound like a snob here.It isn't without its flaws, though they are hardly any. Did find the character of Peter and his scenes rather too twee for my liking, like when the film cutaways to him where he pointlessly explains the action. 'Le Mans 66' already had a lot of emotional impact of all kinds, the character and his presence just didn't seem necessary.Maybe it is a little too long too, it could easily have done with being perhaps 15 minutes shorter and lessening or excising Peter's role would have made things better.However, 'Le Mans 66' looks great. Especially the editing, which is actually quite astonishing in the action-oriented scenes and can see some kind of nod for Best Editing at any of the big awards. Likewise with the sound editing, which is quite striking in its authenticity, 'Le Mans 66' capturing the spirit of the sport and the personal lives behind it beautifully. James Mangold's direction is stylish throughout, the action-oriented scenes have plenty of thrills and mostly the personal lives scenes are emotionally investable.Script is tightly structured and is nicely balanced. The story is always well balanced and some twee moments aside is always compelling. The climactic race is absolutely thrilling in every sense of the word. All the performances are spot on, with Matt Damon giving one of his better and most good-natured performances and Tracy Letts excels in his role, especially in his post-drive breakdown and his frankness during the Ford executive presentation. Best of all is Christian Bale in the film's most demanding role, he captures the uncomprimising attitude needed brilliantly.All in all, excellent and one of 2019's highlights when it comes to film. 9/10"
    },
    {
      "username": "mohdshafiulhaque",
      "userUrl": "https://www.imdb.com/user/ur26936905",
      "reviewLink": "https://www.imdb.com/review/rw5275656",
      "warningSpoilers": false,
      "date": "23 November 2019",
      "rate": "9",
      "helpful": "208 out of 250 found this helpful.",
      "title": "Movie keeps you at 7000 rpm",
      "content": "Ford V Ferrari is one of the best movies I've seen this year, and for someone who has little interest in cars besides minivans and SUVs, that's saying a lot. Just like the race cars produced by its namesakes, Ford v. Ferrari is sleek and fast; a powerful and expensive machine. A supremely well-balanced combination of corporate rivalry, on-track competitiveness and human drama."
    },
    {
      "username": "nogodnomasters",
      "userUrl": "https://www.imdb.com/user/ur77881167",
      "reviewLink": "https://www.imdb.com/review/rw5306913",
      "warningSpoilers": true,
      "date": "8 December 2019",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Shut Down the Assembly Line",
      "content": "The film opens introducing three characters. Carroll Shelby (Matt Damon) only America to win Le Mans is forced from racing because of his heart. He is selling cars. Ken Miles (Christian Bale ) is a savvy independent race car driver with an attitude and no sponsors. The IRS just took his garage. Lee Iococca (Jon Bernthal) is attempting to convince Henry Ford II that if Ford can win Le Mans, it will sell cars. The three of them come together to try to make it happen.A well acted film with the right blend of drama, comedy, and action."
    },
    {
      "username": "HBSmith_Reviewer",
      "userUrl": "https://www.imdb.com/user/ur65399748",
      "reviewLink": "https://www.imdb.com/review/rw5410474",
      "warningSpoilers": false,
      "date": "15 January 2020",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "A old-fashioned and engaging racing biopic.",
      "content": "I'm going to be posting the rest of my reviews for 2019 here now that the Academy Award nominations are upon us.Starting off with surprise best picture contender \"Ford v Ferrari\"; this is a fascinating and entertaining examination of the real life rivalry between both companies, without resorting to simplicity or being too vague for non-automobile enthusiasts.Christian Bale, in all his British glory, knocked it out of the park as the firey Ford racer Ken Miles, and Matt Damon gives one of his finest recent performances as his sidekick Carroll Shelby. The rest of the cast are also great to see.If you haven't already seen it, definitely race out as soon as it's available to you and check it out. Grade- A"
    },
    {
      "username": "garethcrook",
      "userUrl": "https://www.imdb.com/user/ur11040152",
      "reviewLink": "https://www.imdb.com/review/rw5391158",
      "warningSpoilers": false,
      "date": "8 January 2020",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Stunning!",
      "content": "This film is like the cars it portrays. Slick on the surface, but complicated underneath. Yes it's a story born of corporate ambition in horn rimmed glasses and dark suits, driven by pride and stubbornness, but the heart of it is pure racing, to hell with money, marketing, good looks, any of that. I've watched half of this with my foot planted to the floor. The driving scenes are awesome, the roar of untamed engines (turn your sound up as loud as you dare!), shifting gears into blindness inducing speeds. Fast cars alone though can't carry a film, but thankfully the cast here is as great as the cars. Damon is very good as the lynchpin Shelby, as he drags Ford away from mass production and onto the racetrack to challenge Ferrari's dominance. Bale though, Bale is magnificent. His portrayal of somewhat renegade driver Ken Miles is the oil in the engine, the comic undertones with a 'my way or the highway' attitude. He literally drives this. The pacing is spot on, balancing the boardroom with the tarmac perfectly, all done with some Oceans 11 style slick, good ol rock n roll blasting out as men do manly things. It's a show piece with Ferrari painted as the bad guy. I'm fine with that. Yes the cars look sexy, \"If this were a beauty pageant, we just lost\", but gimme the brute force of the Ford GT40 any day. There's a ton of excitement and energy before the cars even get to Le Mans, but seeing that GT tear up the French countryside gets the heart pounding. Doesn't matter that I already knew the outcome, it's still exhilarating with some of the best racing scenes in any film, ever!"
    },
    {
      "username": "jespor",
      "userUrl": "https://www.imdb.com/user/ur48176901",
      "reviewLink": "https://www.imdb.com/review/rw5258975",
      "warningSpoilers": false,
      "date": "15 November 2019",
      "rate": "8",
      "helpful": "327 out of 407 found this helpful.",
      "title": "CHRISTIAN BALE",
      "content": "Jesus Christ - Bale does it again.Great script, great casting, incredible acting from everyone, but especially Bale."
    },
    {
      "username": "MrDHWong",
      "userUrl": "https://www.imdb.com/user/ur18374284",
      "reviewLink": "https://www.imdb.com/review/rw5446247",
      "warningSpoilers": false,
      "date": "30 January 2020",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A well-told story that balances high octane car races with genuine drama",
      "content": "Ford v Ferrari is a biographical drama film directed by James Mangold (Logan, Walk The Line, Girl, Interrupted). Starring Matt Damon and Christian Bale, it is a well-told story that balances high octane car races with genuine drama.In 1963, the Ford Motor Company recruits famous racecar driver Carroll Shelby (Matt Damon) to assist them with designing a car that will help them beat their arch rivals Ferrari at the Le Mons race in France. To aid him with such a task, Carroll decides to enlist the help of British mechanic and fellow racer Ken Miles (Christian Bale) to test for any flaws and eventually race in the finished product itself. At first, the two of them make great progress, however Ken's brash personality and blunt honesty puts him at odds with the higher ups at Ford, causing the company to believe he may not be the right person to be racing their car and representing them abroad.With its fast pacing and heartfelt drama to match, Ford v Ferrari rises above the typical car racing film to become one of the most interesting portraits of an intense rivalry in recent memory. The film isn't so much about the cars themselves as as it is about staying relevant in the public eye and maintaining a respectable image. From the very beginning, we are given the idea of how desperate Ford are to shake off their reputation of being perceived as making outdated cars that only one's grandparents would drive. This is juxtaposed with the cool and hip-looking Ferrari being presented as more appealing to younger potential motorists. The resulting races are used to further the film's plot and aren't merely there for mindless entertainment. While it may be obvious to some viewers what the eventual outcome truly is, it is certainly a lot of fun anticipating what happens along the way.Director James Mangold successfully strikes the correct balance between car racing action and realistic human drama, so much so that virtually all audiences should be able to find something to be entertained by. His choices in editing and cinematography help move the film along at a breathless speed as we watch cars zoom past at high acceleration, sometimes resulting in some intense crash scenes. There are times though, where some of the mechanical jargon may prove confusing to non-racing enthusiasts such as myself as I did end up scratching my head at a few scenes where certain important car parts were being discussed by the characters. In addition to this, I wasn't quite sure about how some of the rules of the race track were showcased in the film, as it felt somewhat glanced over. Fortunately, these moments are infrequent and are often counteracted by the great acting of the film's leads.Christian Bale is such a joy to watch as Ken Miles, the unapologetic perfectionist racer who wants to push the limits of what a car can do. It caught me off-guard at first hearing him use his native British accent while surrounded by other Americans as I am so used to seeing him play only American characters. Matt Damon gave a nice performance as well, but I feel that he was overshadowed by Bale in most scenes. This is due to Damon essentially being the straight man to Bale's outspoken antics which did cause me to focus more on Bale instead.Overall, even if you aren't a huge fan of car racing films like me, this one contains more than enough entertainment to satisfy even the most car illiterate of audiences. The historic value of the depicted event makes for a solid drama and could possibly bring a newfound amount of respect to this genre in the near future.I rate it 8.5/10"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw5575532",
      "warningSpoilers": false,
      "date": "24 March 2020",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Who's better?",
      "content": "I have to admit, I never thought that a movie about cars/racing would get to me, the way this movie did. And it is a testament not just to the actors, but the script and the directing and so many other things that make this quite the experience to watch.Bale is quite the actor - I should have known or rather remembered he's British, but I really had forgotten about it, especially with his ability to blend his American accent so good, you just can't tell. But it is not just about accents, it is about gravitas and even more surprisingly about humor! The movie is way funnier than I expected it to be, with one liners coming at you at the speed of ... well you get it.And yes there are cliches and some things surely are exaggerated for good measure and to heighten certain things, but overall this is quite enchanting and quite a great movie. With not just one battlefield, if you'll excuse the use of that word, but multiple ones our main characters have to endure and maybe even prevail (?) - if you are aware of history, you know what's up, I didn't"
    },
    {
      "username": "agm_tcr",
      "userUrl": "https://www.imdb.com/user/ur45182279",
      "reviewLink": "https://www.imdb.com/review/rw5401645",
      "warningSpoilers": false,
      "date": "12 January 2020",
      "rate": "8",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Racing with a soul",
      "content": "As a Ferrari fan I was pleasantly on the side of a Ford driver, all because of the soul Christian Bale was able to portrayed as Ken Miles, a sports car racing engineer who's hart was beaten in unison with an engine of a race car. Aside of the fact that he lose several kg for the role, but being a method actor it cling a viewer to the screen. Excitement and rage can be feel in every scene. The passion take us to the circuit and made us push the accelerator. What I miss is the surprise of the plot since I knew the story. The cast is brilliant, and finally in one Americans movie I have the pleasure to see casted Italians brilliants actor for the roles of the Ferrari Team, speaking perfect Italian, as oppose as being disappointed when they cannot. This year oscar is going to be a difficult choice."
    },
    {
      "username": "cruise01",
      "userUrl": "https://www.imdb.com/user/ur57691865",
      "reviewLink": "https://www.imdb.com/review/rw5479504",
      "warningSpoilers": false,
      "date": "13 February 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Pedal to the medal and keeps you on the edge.",
      "content": "Ford v Ferrari (5 out of 5 stars).Ford v Ferrari is an awesome sports drama film that delivered on the racing scenes that puts you right in the drivers wheel. And leaves you right on the edge. James Mangold's direction did it great with its exciting racing sequences which is loud, thrilling, and intense. The drama and story building with Carroll Shelby (Matt Damon) and Ken Miles (Christian Bale) are also great and gripping with its story. The script, direction, and performances are outstanding.The plot follows when Henry Ford (Tracy Letts) wants to try to make the fastest car for the 24 hours of Le Mans race in France. He has Carroll Shelby (Matt Damon) try to help and rebuild a Ford GT40 and has a race car driver Ken (Christian Bale) try to test the cars and compete in the 24 hour race. Racing against Lorenzo who is racing for Ferrari.It is a long movie of 2 hours and 30 so minutes. But it goes by fast with its gripping and sharp script. The characters are great. Carroll designs cars and is unable to race from his heart condition. While Ken is a struggling mechanic, trying to support his family. He brings his son around when he is building sports cars. Ken also hates when the executives and bosses from Ford tries to tell him what to do. Which makes their relationship and partnership unstable. The script is sharp with its storytelling.The direction is moving with a building story and thrilling race sequences. The racing scenes are pedal to the metal intense. The cinematography in putting the cameras on the streets of racing cars flying by. Or right in the driver side of the car puts you right into the race.Christian Bale and Matt Damon delivered the performances. They are awesome playing the characters.Overall, Ford v Ferrari is one of the best movies of the year. It is exciting. The direction, script, and actors did great with the movie. The racing sequences is one of the best put together action scenes. That will leave you on the edge of your seat."
    },
    {
      "username": "alvintalavera",
      "userUrl": "https://www.imdb.com/user/ur65730554",
      "reviewLink": "https://www.imdb.com/review/rw5256355",
      "warningSpoilers": false,
      "date": "14 November 2019",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "One of the best.",
      "content": "This is one of this year's best, from the cast's performance, the story, and the cinematography. It has good visuals feeling that you are really in the 60s. Bale and Damon's acting were commendable. I really did not expect to love this one a lot because I'm mainly not a fan of action movies. I expect this to be at least nominated for Oscars."
    },
    {
      "username": "jordanucsd",
      "userUrl": "https://www.imdb.com/user/ur44759627",
      "reviewLink": "https://www.imdb.com/review/rw5483055",
      "warningSpoilers": true,
      "date": "14 February 2020",
      "rate": "8",
      "helpful": "164 out of 188 found this helpful.",
      "title": "\"I had no idea. If only my dad were alive to see this.\"",
      "content": "I've seen a lot of car movies, as a self-professed car nut. As such I judge them harshly, and immediately dismiss entries that don't provide enough reason to care about what is more important than the car: the driver. Think of the Fast and Furious and Transformers franchise. If you care about the driver, and the driver cares about the car, you care about the car. The car is a tool, an extension of the hero's body, and gains provenance with the audience when it helps the hero on their personal journey. Movies that come to mind that do this effectively include Gone in 60 Seconds, Bullitt, Need For Speed, The Italian Job, Batman Begins, and The Bourne Identity. Some of the James Bond movies do it well, like Goldfinger, The Spy Who Loves Me, The Living Daylights, and SkyFall, but many do not because of the lack of character arc in the story. We cannot forget about perhaps the greatest car movie of all time, Back to the Future. The shining example of how to make the car a proper star.And now enters a film by James Mangold and starring talented actors Matt Damon and Christian Bale called Ford v. Ferrari. My arms crossed, and expectations lowered, I was ready to be disappointed. Although I love Mangold as a director, somehow I assumed there would be a Michael Bay approach to the movie, putting more emphasis on car action sequences than the characters. To my surprise, not only was I dead wrong, but the film became one of the best car movies I had ever seen.Thinking back, I should have known better. Unlike many car action oriented movies, this one is based on a true story, and fact-based dramas tend to take themselves more seriously. It is sort of a shared biopic between legendary sports car designer Carroll Shelby and race car driver Ken Miles. The movie focuses on their efforts to beat Ferrari at Le Mans, a story I'm well aware of (like I said, bonafide car nut). And Mangold is an Oscar winning filmmaker collaborating with Oscar winning people such as Damon and Bale.And boy do their talents shine in this movie. The driving engine of the story, if you will, is the loving but at times clashing relationship between Shelby and Miles, portrayed brilliantly by Damon and Bale in a manner that in my opinion is more entertaining and engaging than the dynamic duo of DiCaprio and Pitt in Once Upon A Time ... in Hollywood. Damon and Bale have different styles of acting, but both arrive at the same place: creating a character that faces disappointment in the search for victory.Shelby has to come to terms with the disappointment of having to quit his racing career due to heart problems, and creating a winning team at Le Mans is his way of proving to himself he's still a winner. Miles is desperate not to disappoint himself because unlike Shelby, he's never had a shot at winning at a big race. This is due to his abrasive personality, despite an amazing talent on the race track. On top of this, Miles desperately doesn't want to disappoint his wife and son, who support him fervently in his dream. Both characters have their own obstacles in search of escaping disappointment, with Shelby dealing with the suits at Ford and Miles dealing with problems of the car in the race as they present themselves, and the trial of besting the other race car drivers. Their individual struggles intersect in the mutual desire to win at Le Mans, resulting in a brotherhood and mutual love for each other that feels genuine and earned.Henry Ford II, played by a very effective Tracy Letts, reveals in a quick but moving scene why he wants to win at Le Mans. After Shelby takes Ford on a whirlwind nauseating ride with the new race car they have engineered, Ford breaks into tears. Not so much because of the physically jarring experience of being jostled around at breakneck speed, but because of what the car means to his family name. \"I had no idea. If only my dad were alive to see this,\" he tells Shelby. Damon, in that scene, responds with wet eyes. The character Ford reveals how much he doesn't want to disappoint his family legacy. In fact, the entire endeavor started with an insult from Ferrari, stating, \"You're only Henry Ford the second, you'll never be Henry Ford.\" And in an earlier scene, Ford compares himself to his legendary grandfather in a speech to Ford factory workers concerning his disappointment in current company sales.Cars represent man's desire to chase a dream. Whether it be designing the fastest car, or driving cars the fastest. And despite all the obstacles that may get in man's way, the biggest one is always himself. But with perseverance and the help of others, this obstacle can too be overcome. Ford v. Ferrari manages to get to the heart of this message with deceptive ease and supreme confidence. The film's absolutely gorgeous cinematography and direction capture some of the most amazing car sequences ever put to the big screen. A surprising but believable behind the scenes factoid is that Mangold and the cast are not car nuts at all, and were simply moved to tell the story of the characters. This is why the movie works so well, because they understood the car as supporting the story rather than the other way around.Ford v. Ferrari is an absolute winner, with memorable performances from its cast, and my favorite Mangold picture thus far. For me, it is one of the best of the year, and as far as car movies go, one of the best ever made, and miles away from a disappointment."
    },
    {
      "username": "nickfarf-42699",
      "userUrl": "https://www.imdb.com/user/ur110013568",
      "reviewLink": "https://www.imdb.com/review/rw5259113",
      "warningSpoilers": true,
      "date": "15 November 2019",
      "rate": "10",
      "helpful": "671 out of 750 found this helpful.",
      "title": "As close as possible to the truth but!",
      "content": "I was at the Philadelphia Film center premiere on 11/11/19 to view this terrific movie. At the age of 68 and a tifoso of Ferrari since age 8, ( 1959 ), this movie hit a nerve. Truth vs Fiction. This was a David vs Goliath movie, however Goliath wins. The movie recreates a golden era of auto Racing. It was seriously dangerous with death and injury a guarantee at every race. These drivers were absolute warriors and we're fearless. Now Ferrari winning LeMans six straight years in a row from 1960-1965 is actually the David in this movie. Ferrari for all their dominant winning form was still a tiny company that sold fancy $15,000 sportcars to support his racing team. Winning LeMans was a $16,500 team prize. These Ferrari drivers were salaried. The prototype class at that time was wide open with no upper limit on engine size. There was an under 2 liter class that Porsche and Ferrari dino control, but the over 2 liter was unlimited. I read carefully about the Ford move to acquire Ferrari, as daily news reports would cross the associated press. The movie is spot-on about Ford cars lacking desire back then. Chevrolet had the Corvette, Corvair and sporty looking Impala and Chevelle. Now Ford is the Goliath in this movie. They are the big corporate giant with unlimited resources. Ford paid for the Ford GT. It was really a Lola Gt with a Ford badge put on it. Ford put their name on every innovation provided by all the racing/equipment suppliers that went into that race car. Unlike Ferrari being designed, engineered and built handmade in that Italian factory. Ford spent more money on developing a racecar than the total price to buy Ferrari outright. Hired every Nascar team to provide expert pit crews, engine builders and offered 80,000-100,000 to each driver for one race . Now the movie, it's a movie that non race cars fans can and will enjoy. It shows how Shelby and Miles are really the heroes of the winning team. This was true. Their relationship is spot on in the movie and they know what is needed to win. They battle off the track against Ford executives and against Ferrari on the track. What is not disclosed in the movie is the quitting of the Ferrari ace driver John Surtees. When he left Ferrari, the team was devastated. He along with Ford's Ken Miles were two true warriors. Also not shown but lightly covered in the movie is the three years of disastrous outing for the Ford racing team. Did Shelby steal the Ferrari pits stop watches? Did Shelby actually throw spear lug nuts into the Ferrari pit lane to make the Ferrari pit crew think that the race car was missing a nut on the car out on the track? Did Enzo Ferrari actually tip his hat to honor Ken Miles? Who really knows. Everybody is dead. I remember the lug nut rumour in the 1960s, as that was a southern stock car trick. I never heard about the theft of Ferrari stop watches by Shelby. As far as Ferrari tipping his hat. Ferrari was known for or not attending many races. All that aside, did I as a Ferrari fan enjoy this movie. My answer is a Yes, Yes, Yes. With the exception of James Garner in Grand Prix, this is the best movie to deal with the sport of autoracing. Bonus is that it is also a great human interest story and they create the mood of the sixties as U vividly remember it. I rate this movie a ten and should be nominated for Oscars."
    },
    {
      "username": "Kikisaurus",
      "userUrl": "https://www.imdb.com/user/ur31009944",
      "reviewLink": "https://www.imdb.com/review/rw5477715",
      "warningSpoilers": false,
      "date": "12 February 2020",
      "rate": "8",
      "helpful": "197 out of 237 found this helpful.",
      "title": "I know nothing of cars or racing, nor do I care about either yet....",
      "content": "To start off, I have always hated racing. Yes, hated. It think it's a ridiculous waste of resources, and boring to watch. I have zero interest in cars - and thus I know absolutely nothing of the history. I knew nothing of this film beyond reading the blurb before I started watching it, so I was very interested to see whether I would like it at all. I did. Despite being so uninterested in the subject, the film got me interested in the story, and especially during the final race I was on the edge of seat not knowing what would happen. Fantastic acting job from both Damon and Bale, usual. They never disappoint. Excellent writing, directing, cutting, sound editing.. A very whole package overall.To finish off; I am STILL not interested in cars or racing, but this film stands on its own even so."
    },
    {
      "username": "JimShops-1",
      "userUrl": "https://www.imdb.com/user/ur12321426",
      "reviewLink": "https://www.imdb.com/review/rw5090448",
      "warningSpoilers": false,
      "date": "31 August 2019",
      "rate": "10",
      "helpful": "340 out of 415 found this helpful.",
      "title": "Fantastic",
      "content": "Just saw F v F at the Telluride Film Festival and it is phenomenal. Perfect performances, incredible visuals and editing, immersive sound, and a riveting story. A real winner. Christian Bale lost 70 pounds Defoe the role and is a delight. Damon is spot on. Catriona Balfe is excellent. All the actors playing Ford executives are excellent as well. Masterful direction from James Mangold. A must see."
    }
  ],
  "errorMessage": ""
}