{
  "imDbId": "tt0395169",
  "title": "Hotel Rwanda",
  "fullTitle": "Hotel Rwanda (2004)",
  "type": "Movie",
  "year": "2004",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Michael Rechtshaffen",
      "link": "",
      "rate": "90",
      "content": "Cheadle impressively carries the entire picture, delivering the kind of note-perfect performance that's absolutely deserving of Oscar consideration."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "https://www.newyorker.com/magazine/the-current-cinema",
      "rate": "90",
      "content": "The film turns into a triumph for Don Cheadle, who never steps outside the character for emotional grandstanding or easy moralism."
    },
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "",
      "rate": "90",
      "content": "It is a powerful portrait of a slightly befuddled man who, when inhuman demands were placed on him, found within himself an unexpected response."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "Ernest Hardy",
      "link": "",
      "rate": "80",
      "content": "Hotel Rwanda, based on real lives and events, aims unequivocally to break your heart."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "80",
      "content": "Ultimately, one's reservations are overwhelmed by the story's urgency; it's impossible not to be shattered."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "75",
      "content": "George has been criticized for simplifying a complex story into an African \"Schindler's List.\" But despite flaws in execution, this is a film of rare courage and imperishable heart."
    },
    {
      "publisher": "Variety",
      "author": "Scott Foundas",
      "link": "",
      "rate": "70",
      "content": "The genocide of some one million Rwandan Tutsis by their Hutu neighbors remains a disgraceful and too-little-known episode in recent world history. Alas, Terry George's ineffectual Hotel Rwanda only partly rectifies that problem, taking what ought to have been a complex, powerful inquiry and simplifying it to a story about the resilience of the human spirit."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "70",
      "content": "It's a gut-twisting story handled, largely and predictably, with asbestos mitts."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "70",
      "content": "The story it tells is such a wrenching one it cannot help but move us, especially when the performance of a lifetime by Don Cheadle is added to the mix."
    },
    {
      "publisher": "Film Threat",
      "author": "Phil Hall",
      "link": "",
      "rate": "40",
      "content": "The film presents the Rwandans in the worst possible way: venal, corrupt, vicious, stupid, barbaric and completely incapable of governing themselves. Honestly, I've seen more intelligent and sympathetic depictions of Africans in Tarzan movies."
    }
  ],
  "errorMessage": ""
}