{
  "imDbId": "tt0395169",
  "title": "Hotel Rwanda",
  "fullTitle": "Hotel Rwanda (2004)",
  "type": "Movie",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "Hotel Rwanda",
  "url": "https://en.wikipedia.org/wiki/Hotel_Rwanda",
  "plotShort": {
    "plainText": "Hotel Rwanda is a 2004 drama film directed by Terry George. It was adapted from a screenplay co-written by George and Keir Pearson, and stars Don Cheadle and Sophie Okonedo as hotelier Paul Rusesabagina and his wife Tatiana. Based on the Rwandan genocide, which occurred during the spring of 1994, the film documents Rusesabagina's efforts to save the lives of his family and more than 1,000 other refugees by providing them with shelter in the besieged Hôtel des Mille Collines. Hotel Rwanda explores genocide, political corruption, and the repercussions of violence.\r\nThe film was a co-production between United Artists and Lions Gate Films, and was commercially distributed by United Artists theatrically and by Metro-Goldwyn-Mayer for home media. Hotel Rwanda premiered in theaters in limited release in the United States on 22 December 2004 and in wide release on 4 February 2005, grossing more than $23 million in domestic ticket sales. It earned an additional $10 million in business through international release to top out at a combined total of nearly $34 million in gross revenue.\r\nThe film was nominated for multiple awards, including Academy Award nominations for Best Actor (Cheadle), Best Supporting Actress (Okonedo), and Best Original Screenplay.",
    "html": "<p>Hotel Rwanda is a 2004 drama film directed by Terry George. It was adapted from a screenplay co-written by George and Keir Pearson, and stars Don Cheadle and Sophie Okonedo as hotelier Paul Rusesabagina and his wife Tatiana. Based on the Rwandan genocide, which occurred during the spring of 1994, the film documents Rusesabagina's efforts to save the lives of his family and more than 1,000 other refugees by providing them with shelter in the besieged Hôtel des Mille Collines. Hotel Rwanda explores genocide, political corruption, and the repercussions of violence.</p><p>The film was a co-production between United Artists and Lions Gate Films, and was commercially distributed by United Artists theatrically and by Metro-Goldwyn-Mayer for home media. Hotel Rwanda premiered in theaters in limited release in the United States on 22 December 2004 and in wide release on 4 February 2005, grossing more than $23 million in domestic ticket sales. It earned an additional $10 million in business through international release to top out at a combined total of nearly $34 million in gross revenue.</p><p>The film was nominated for multiple awards, including Academy Award nominations for Best Actor (Cheadle), Best Supporting Actress (Okonedo), and Best Original Screenplay.</p>"
  },
  "plotFull": {
    "plainText": "Hotel Rwanda is a 2004 drama film directed by Terry George. It was adapted from a screenplay co-written by George and Keir Pearson, and stars Don Cheadle and Sophie Okonedo as hotelier Paul Rusesabagina and his wife Tatiana. Based on the Rwandan genocide, which occurred during the spring of 1994, the film documents Rusesabagina's efforts to save the lives of his family and more than 1,000 other refugees by providing them with shelter in the besieged Hôtel des Mille Collines. Hotel Rwanda explores genocide, political corruption, and the repercussions of violence.\r\nThe film was a co-production between United Artists and Lions Gate Films, and was commercially distributed by United Artists theatrically and by Metro-Goldwyn-Mayer for home media. Hotel Rwanda premiered in theaters in limited release in the United States on 22 December 2004 and in wide release on 4 February 2005, grossing more than $23 million in domestic ticket sales. It earned an additional $10 million in business through international release to top out at a combined total of nearly $34 million in gross revenue.\r\nThe film was nominated for multiple awards, including Academy Award nominations for Best Actor (Cheadle), Best Supporting Actress (Okonedo), and Best Original Screenplay.\r\nPlot\r\nIn April 1994, tensions between the Hutu-controlled government and Tutsi rebels led to genocide in Rwanda, where corruption and bribes between politicians were routine. Paul Rusesabagina, manager of the Belgian-owned Hôtel des Mille Collines, is Hutu, but his wife Tatiana is Tutsi. Their marriage is a source of friction with Hutu extremists, including Georges Rutaganda, a goods supplier to the hotel who is also the local leader of Interahamwe, a brutal Hutu militia. Paul curries favor with Rwandan Army general Augustin Bizimungu, who favors the Hutu. Following the assassination of the president, a Hutu, Paul and his family observe neighbors being killed, initiating the early stages of the genocide. When civil war erupts and a Rwandan Army Captain threatens Paul and his neighbors, Paul barely negotiates their safety and brings them to the hotel. Upon returning with them, he finds his insolent receptionist Gregoire occupying the presidential suite and threatening to expose the Tutsi refugees, including Paul's wife, if he is made to work. The UN peacekeeping forces, led by Canadian Colonel Oliver, are forbidden to intervene in the conflict and prevent the genocide. The foreign nationals are evacuated, but the Rwandans are left behind. More evacuees arrive at the hotel from the overburdened United Nations refugee camp, the Red Cross, and various orphanages, totaling 800, both Tutsi and Hutu. Tatiana desperately searches for her brother, sister-in-law, and two nieces. As the situation becomes more violent, Paul must divert the Hutu soldiers, care for the refugees, protect his family, and maintain the appearance of a functioning 4-star hotel. Paul forces Gregoire to work with the help of General Bizimungu.\r\nLow on supplies, Paul and Gregoire drive to collect hotel supplies from Georges Rutaganda and witness the Interahamwe militia raping Tutsi hostages. Georges explains to Paul that the \"rich cockroaches'\" money will become worthless since all of the Tutsis will be killed. Paul expresses disbelief that the Hutu extremists will wipe out all of the Tutsis, but Georges replies: \"Why not? We are halfway there already.\" They return to the hotel through the dark, thick fog, on the riverside road recommended by Georges, only to find it is carpeted with dead bodies.\r\nWhen the UN forces attempt to evacuate a group of refugees, including Paul's family, Gregoire betrays them to the Interahamwe, who use radio broadcasts to accost them. After giving General Bizimungu the remaining valuables and Scotch from his office safe to protect the refugees, Paul then admonishes Bizimungu for genocide apathy and promises to testify on his behalf for his help. Soon afterward, Paul's family and the hotel refugees are finally able to leave the besieged hotel in a UN convoy. They travel through retreating masses of refugees and militia to reach safety behind Tutsi rebel lines and are reunited with their nieces.\r\nThe end title cards explain that Paul saved at least 1,200 Tutsi and Hutu refugees. He and his family, who adopted the two nieces, moved to Belgium, but Tatiana's brother Thomas and his wife were never found. The genocide came to an end in July 1994 when the Tutsi rebels drove the Hutu and the Interahamwe militia across the border into the Congo. At least 491,000 people died in the genocide. Georges and Bizimungu were tried and sentenced for war crimes, with Georges receiving a life sentence.\r\nCast\r\nDon Cheadle as Paul Rusesabagina\r\nSophie Okonedo as Tatiana Rusesabagina\r\nNick Nolte as Colonel Oliver, loosely based on General Roméo Dallaire\r\nJoaquin Phoenix as Jack Daglish, loosely based on peacekeeper Stefan Stec\r\nFana Mokoena as General Augustin Bizimungu\r\nCara Seymour as Pat Archer\r\nDavid O'Hara as Dave Flemming\r\nTony Kgoroge as Gregoire\r\nDesmond Dube as Dube\r\nHakeem Kae-Kazim as Georges Rutaganda\r\nLeleti Khumalo as Fedens\r\nAntonio Lyons as Thomas Mirama\r\nMosa Kaiser as Elys Rusesabagina\r\nMduduzi Mabaso as a Hutu lieutenant\r\nJean Reno as Mr. Tillens (uncredited)\r\nEugene Wanangwa Khumbanyiwa as Hotel Staff (uncredited)\r\nProduction and historical accuracy\r\nSharing his thoughts about the lack of international intervention during the crisis, director George commented, \"It's simple, ... African lives are not seen as valuable as the lives of Europeans or Americans.\" Attempting to share the horrors of the genocide, George sought to tell the story of Rusesabagina, portrayed as a humanitarian during the relentless acts of violence.\r\nHowever, Rusesabagina has since come under criticism from survivors of the Genocide. In 2008, the book Hotel Rwanda, or, the Tutsi Genocide as seen by Hollywood by Alfred Ndahiro, who was a former advisor to Paul Kagame, and journalist Privat Rutazibwa, was published. The authors conducted interviews with 74 people who had stayed in the Hotel during the Genocide. Inside the Hotel Rwanda: The Surprising True Story … And Why it Matters Today, co-written by Hotel des Mille Collines Survivor Edouard Kayihura and American author Kerry Zukus, was published in 2011.\r\nThe books include allegations that during the Genocide, Rusesabagina extorted money from hotel guests for rooms and food. It was also reported that the UN headquarters in Kigali received information that Rusesabagina had provided a Rwandan army commander with a list of hotel guests and their room numbers. UN observers managed to change the room numbers of those most threatened. The character of the Canadian Colonel is based on Senator Roméo Dallaire, now retired Lieutenant-General from the Canadian Armed Forces. Dallaire was not pleased with the film's portrayal of the events that he witnessed, arguing he and his men did far more to help survivors. He recounted his own experiences in his biography, Shake Hands with the Devil. The book was later adapted into two feature films; a documentary, and a 2007 dramatic motion picture.\r\nGeorge stated that it was important to craft the film for a mass-market audience, using the question of whether the film is \"going to play in Peoria? Will it be understood? Is it mainstream enough?\"\r\nFilming\r\nPrincipal filming was shot on location in Kigali, Rwanda, and Johannesburg, South Africa. Paul Rusesabagina was consulted during the writing of the film. Although the character of Colonel Oliver played by Nolte is fictional in nature, the role was inspired by the UN force commander for UNAMIR, Roméo Dallaire. Ugandan president Yoweri Museveni, then-Rwandan president Juvénal Habyarimana, and Rwandan Patriotic Front leader (now president) Paul Kagame appear in archive television footage in the film.\r\nThe producers of the film partnered with the United Nations Foundation to create the International Fund for Rwanda, which supported United Nations Development Programme initiatives assisting Rwandan survivors. \"The goal of the film is not only to engage audiences in this story of genocide but also to inspire them to help redress the terrible devastation,\" said George.\r\nSoundtrack\r\nThe original motion picture soundtrack for Hotel Rwanda was released by the Commotion label on 11 January 2005. It features songs written by Wyclef Jean, Deborah Cox, and others. The music for the film was composed by Rupert Gregson-Williams, Andrea Guerra, and the Afro Celt Sound System, while being edited by Michael Connell.\r\nMarketing\r\nNovel\r\nHotelier Paul Rusesabagina's experience encouraged director George to produce the film. A paperback novel published by Newmarket Press, titled Hotel Rwanda: Bringing the True Story of an African Hero to Film, released on 7 February 2005, dramatizes the events of the Rwandan Genocide in 1994, as depicted in the film, and expands on the ideas of how Rusesabagina sheltered and saved more than 1,200 people in the hotel he managed in Kigali by summarizing three years of research, articles that chronicle the historical events, and the ensuing aftermath. A brief history and timeline, the making of the film, and the complete screenplay written by Keir Pearson and Terry George are covered in thorough detail.\r\nRelease\r\nHome media\r\nFollowing its cinematic release in theaters, the film was released in VHS video format on 12 April 2005, marking the final United Artists film released on the format. The Region 1 Code widescreen edition of the film was also released on DVD in the United States on 12 April 2005. Special features for the DVD include; \"A Message for Peace: Making Hotel Rwanda\" documentary, \"Return to Rwanda\" documentary, Selected scenes commentary by Don Cheadle, Audio commentary by director Terry George and the real-life subject of the film–Paul Rusesabagina, along with select commentary by musician Wyclef Jean. Supplementally, the Blu-ray Disc edition of the film, featuring special documentaries along with selected scenes and audio commentary, was released in the United States on 10 May 2011. The film is available in other media formats such as video on demand as well.\r\nReception\r\nCritical response\r\nAmong mainstream critics in the U.S., the film received largely positive reviews. Rotten Tomatoes reported that 91% of 194 sampled critics gave the film a positive review, with an average score of 7.95/10 and the consensus calling it a \"sobering and heartfelt tale about the massacre that took place in Rwanda while most of the world looked away.\" At Metacritic, which assigns a weighted average out of 100 to critics' reviews, the film received a score of 79 based on 40 reviews.\r\nAs Rusesabagina, Cheadle is simply terrific. Not only does he assume a totally believable African accent and manner, he also convinces us with every move and gesture that he's a resourceful Everyman elevated to genuine heroism by a struggle to do the right thing.\r\n—William Arnold, writing in the Seattle Post-Intelligencer\r\nMichael Rechtshaffen, writing in The Hollywood Reporter, stated actor \"Cheadle impressively carries the entire picture, delivering the kind of note-perfect performance that's absolutely deserving of Oscar consideration.\" Roger Ebert in the Chicago Sun-Times called it a \"riveting drama\", while exclaiming \"The film works not because the screen is filled with meaningless special effects, formless action and vast digital armies, but because Cheadle, Nolte and the filmmakers are interested in how two men choose to function in an impossible situation. Because we sympathize with these men, we are moved by the film.\" In the San Francisco Chronicle, Mick LaSalle wrote that the film was a \"harrowing experience\", and that \"it documents for a mass audience what it was like. It's useful, in that it shows how it can happen. It's even hopeful, in that it shows that it's possible—not guaranteed, but possible—for people to maintain their humanity in the face of unhinged barbarism.\" Claudia Puig of USA Today stated the film was \"one of the year's most moving and powerful films, anchored by a magnificent performance by Don Cheadle.\" She declared, \"Hotel Rwanda emerges as an African version of Schindler's List.\" The film was not without its detractors, however. Dave Sterrit of The Christian Science Monitor felt that, although the subject matter was crucially important, \"the movie dilutes its impact with by-the-numbers filmmaking, and Cheadle's one-note performance displays few of his acting gifts.\" Left equally unimpressed was Lisa Schwarzbaum of Entertainment Weekly. Commenting on the character significance of the U.N. personnel, she stated it was \"a bad day for narrative, if not for diplomacy, when there is only one 3-D character among the entire U.N. lot, clad in their blue helmets, and that role is rasped by Nick Nolte with moral remorse rather than his more usual hint of dissolution.\" In her overall summation, she wrote \"Hotel Rwanda is a strange history lesson that leaves us more overlectured than properly overwhelmed.\" Michael Atkinson of The Village Voice, added to the negativity by stating the film was \"told to us secondhand, or glimpsed in distant scuffles\" and \"Like the majority of movies about the last century of holocausts, Hotel Rwanda is as earnest and tasteful as its creators. To capture the white-hot terror of social calamity, someone a little more lawless and fierce might be called for.\"\r\nWriting for The New York Times, Stephen Holden wrote the film was \"a political thriller based on fact that hammers every button on the emotional console.\" He commended how the film \"offers a devastating picture of media-driven mass murder left unchecked\" while also praising \"Mr. Cheadle's magnificent, understated portrayal\". James Berardinelli, writing for ReelViews, called the film \"powerful\" and noted that it didn't \"pull as many punches as its detractors would have us believe.\" Berardinelli also wrote the film was \"brutal and shocking when it needs to be, but it also has great emotional scope and power. We find ourselves enmeshed in Paul's struggle, sharing his despair at the warfare tearing apart his country, his frustration and anger at the U.N.'s inability to act, and, eventually, his hope for a better tomorrow.\" Describing some pitfalls, Jeff Vice of the Deseret News stated the \"decision by the filmmakers to show things from that limited viewpoint—to show how isolated and fearful the characters were of the chaos going on around them—the film feels a little dishonest and diminished. It's never quite as effective as The Killing Fields or Schindler's List in that the film's overall impact is not as great and it doesn't linger in the memory.\" Vice however was quick to admit \"Hotel Rwanda does have its share of powerful moments; in particular, a scene in which Paul and another hotel employee unknowingly—due to fog—drive into a mass grave.\" He also expressed satisfaction with the acting, stating \"Cheadle brings a needed intensity to the film; his character's fear and compassion are quite vivid. Nolte is also good in his limited screen time, as is Joaquin Phoenix, who plays a news cameraman.\"\r\n flat, cramped staging which, combined with d.p. Robert Fraisse's harsh overlighting, gives the film the feel of a cheap backlot production, even though it was shot on location.\r\n—Scott Foundas, writing for Variety\r\nEleanor R. Gillespie of The Atlanta Journal-Constitution stated that Hotel Rwanda was an \"unforgettable film\" as well as \"a doubly unforgettable performance by Don Cheadle.\" Although mentioning \"The parallels with Steven Spielberg's Schindler's List are obvious\", she praised individual cinematic elements that made the film unique, such as \"the revelation of a dark, bumpy road paved with thousands of corpses. Or in a little girl's heartwrenching plea, 'Please don't let them kill me. I promise I won't be Tutsi anymore'.\" She concluded her review with Cheadle's noteworthy performance, stating he gave \"one of the best performances (if not the best) of last year—an Oscar-worthy portrait of a man who kept his head clear and his humanity intact in the midst of a man-made hell.\" Similarly, David Ansen wrote in Newsweek that \"two performances carry the film. Cheadle, in his richest role since Devil in a Blue Dress, burrows deep inside this complex man, who discovers in himself a strength he never knew he possessed, as he faces the disillusionment of all the \"civilized\" notions he believes in. As his strong, committed wife, Tatiana, Sophie Okonedo, barely resembling the saucy hooker she played in Dirty Pretty Things, is a revelation.\" However, in the Arizona Daily Star, Phil Villarreal was not moved by the lead acting of Cheadle or Nolte. He thought the characters were \"cardboardish\" and stated the \"uplifting moments of rescue seem antiseptic and set up.\" Critic Leonard Maltin wrote that Hotel Rwanda was a \"powerful film\" that he thought avoided being \"overly didactic by focusing on one compelling character, believably brought to life by Cheadle.\" In Reel Power: Hollywood Cinema and American Supremacy, drawing on the work of journalist Keith Harmon Snow and writer Edward S. Herman, author Matthew Alford called the film \"sensitive, humane and powerful\" but noted that it was \"striking how the history of bloodshed has been spun in line with Western interests\".\r\nTop 10 lists\r\nHotel Rwanda was listed on many critics' top ten lists for 2004.\r\n1st – Richard Roeper, Ebert & Roeper\r\n3rd – Claudia Puig, USA Today\r\n3rd – Stephanie Zacharek, Salon.com\r\n6th – Ruthie Stein, San Francisco Chronicle\r\n8th – Lawrence Toppman, Salon.com\r\n8th – Mick LaSalle & Carla Meyer, San Francisco Chronicle\r\n9th – Roger Ebert, Chicago Sun-Times\r\n10th – Desson Thomson, Washington Post\r\n10th – Lawrence Toppman, Charlotte Observer\r\nTop 10 (listed alphabetically) – Carrie Rickey, Philadelphia Inquirer\r\nTop 10 (listed alphabetically) – Carina Chocano, Los Angeles Times\r\nAccolades\r\nThe film was nominated and won several awards in 2004–2006. Various critics included the film on their lists of the top 10 best films of 2004. Roger Ebert of the Chicago Sun-Times named it ninth best, Mick LaSalle of the San Francisco Chronicle named it eighth best, and Desson Thomson of The Washington Post named it tenth best. The film is also listed by the American Film Institute as one of the 100 most inspirational movies of all time.\r\nBox office\r\nThe film premiered in cinemas on 22 December 2004 in limited release throughout the US During its limited opening weekend, the film grossed $100,091 in business showing at seven locations. Its official wide release was screened in theaters on 4 February 2005. Opening in a distant 14th place, the film earned $2,316,416 showing at 823 cinemas. The film Boogeyman beat its competition during that weekend opening in first place with $19,020,655. The film's revenue dropped by 11.8% in its second week of release, earning $2,043,249. For this particular weekend, the romantic comedy Hitch unseated Boogeyman to open in first place with $43,142,214 in revenue, while Hotel Rwanda remained in 14th place not challenging a top 10 position. During its final weekend in release, the film opened in 62nd place grossing $23,176 in business. The film went on to top out domestically at $23,530,892 in total ticket sales through an 18-week theatrical run. Internationally, the film took in an additional $10,351,351 in box office business for a combined worldwide total of $33,882,243. For 2004 as a whole, the film would cumulatively rank at a box-office performance position of 99.",
    "html": "<p>Hotel Rwanda is a 2004 drama film directed by Terry George. It was adapted from a screenplay co-written by George and Keir Pearson, and stars Don Cheadle and Sophie Okonedo as hotelier Paul Rusesabagina and his wife Tatiana. Based on the Rwandan genocide, which occurred during the spring of 1994, the film documents Rusesabagina's efforts to save the lives of his family and more than 1,000 other refugees by providing them with shelter in the besieged Hôtel des Mille Collines. Hotel Rwanda explores genocide, political corruption, and the repercussions of violence.</p><p>The film was a co-production between United Artists and Lions Gate Films, and was commercially distributed by United Artists theatrically and by Metro-Goldwyn-Mayer for home media. Hotel Rwanda premiered in theaters in limited release in the United States on 22 December 2004 and in wide release on 4 February 2005, grossing more than $23 million in domestic ticket sales. It earned an additional $10 million in business through international release to top out at a combined total of nearly $34 million in gross revenue.</p><p>The film was nominated for multiple awards, including Academy Award nominations for Best Actor (Cheadle), Best Supporting Actress (Okonedo), and Best Original Screenplay.</p><br/><h3>Plot</h3><p>In April 1994, tensions between the Hutu-controlled government and Tutsi rebels led to genocide in Rwanda, where corruption and bribes between politicians were routine. Paul Rusesabagina, manager of the Belgian-owned Hôtel des Mille Collines, is Hutu, but his wife Tatiana is Tutsi. Their marriage is a source of friction with Hutu extremists, including Georges Rutaganda, a goods supplier to the hotel who is also the local leader of Interahamwe, a brutal Hutu militia. Paul curries favor with Rwandan Army general Augustin Bizimungu, who favors the Hutu. Following the assassination of the president, a Hutu, Paul and his family observe neighbors being killed, initiating the early stages of the genocide. When civil war erupts and a Rwandan Army Captain threatens Paul and his neighbors, Paul barely negotiates their safety and brings them to the hotel. Upon returning with them, he finds his insolent receptionist Gregoire occupying the presidential suite and threatening to expose the Tutsi refugees, including Paul's wife, if he is made to work. The UN peacekeeping forces, led by Canadian Colonel Oliver, are forbidden to intervene in the conflict and prevent the genocide. The foreign nationals are evacuated, but the Rwandans are left behind. More evacuees arrive at the hotel from the overburdened United Nations refugee camp, the Red Cross, and various orphanages, totaling 800, both Tutsi and Hutu. Tatiana desperately searches for her brother, sister-in-law, and two nieces. As the situation becomes more violent, Paul must divert the Hutu soldiers, care for the refugees, protect his family, and maintain the appearance of a functioning 4-star hotel. Paul forces Gregoire to work with the help of General Bizimungu.</p><p>Low on supplies, Paul and Gregoire drive to collect hotel supplies from Georges Rutaganda and witness the Interahamwe militia raping Tutsi hostages. Georges explains to Paul that the \"rich cockroaches'\" money will become worthless since all of the Tutsis will be killed. Paul expresses disbelief that the Hutu extremists will wipe out all of the Tutsis, but Georges replies: \"Why not? We are halfway there already.\" They return to the hotel through the dark, thick fog, on the riverside road recommended by Georges, only to find it is carpeted with dead bodies.</p><p>When the UN forces attempt to evacuate a group of refugees, including Paul's family, Gregoire betrays them to the Interahamwe, who use radio broadcasts to accost them. After giving General Bizimungu the remaining valuables and Scotch from his office safe to protect the refugees, Paul then admonishes Bizimungu for genocide apathy and promises to testify on his behalf for his help. Soon afterward, Paul's family and the hotel refugees are finally able to leave the besieged hotel in a UN convoy. They travel through retreating masses of refugees and militia to reach safety behind Tutsi rebel lines and are reunited with their nieces.</p><p>The end title cards explain that Paul saved at least 1,200 Tutsi and Hutu refugees. He and his family, who adopted the two nieces, moved to Belgium, but Tatiana's brother Thomas and his wife were never found. The genocide came to an end in July 1994 when the Tutsi rebels drove the Hutu and the Interahamwe militia across the border into the Congo. At least 491,000 people died in the genocide. Georges and Bizimungu were tried and sentenced for war crimes, with Georges receiving a life sentence.</p><br/><h3>Cast</h3><ul><li>Don Cheadle as Paul Rusesabagina</li><li>Sophie Okonedo as Tatiana Rusesabagina</li><li>Nick Nolte as Colonel Oliver, loosely based on General Roméo Dallaire</li><li>Joaquin Phoenix as Jack Daglish, loosely based on peacekeeper Stefan Stec</li><li>Fana Mokoena as General Augustin Bizimungu</li><li>Cara Seymour as Pat Archer</li><li>David O'Hara as Dave Flemming</li><li>Tony Kgoroge as Gregoire</li><li>Desmond Dube as Dube</li><li>Hakeem Kae-Kazim as Georges Rutaganda</li><li>Leleti Khumalo as Fedens</li><li>Antonio Lyons as Thomas Mirama</li><li>Mosa Kaiser as Elys Rusesabagina</li><li>Mduduzi Mabaso as a Hutu lieutenant</li><li>Jean Reno as Mr. Tillens (uncredited)</li><li>Eugene Wanangwa Khumbanyiwa as Hotel Staff (uncredited)</li></ul><br/><h3>Production and historical accuracy</h3><p>Sharing his thoughts about the lack of international intervention during the crisis, director George commented, \"It's simple, ... African lives are not seen as valuable as the lives of Europeans or Americans.\" Attempting to share the horrors of the genocide, George sought to tell the story of Rusesabagina, portrayed as a humanitarian during the relentless acts of violence.</p><p>However, Rusesabagina has since come under criticism from survivors of the Genocide. In 2008, the book Hotel Rwanda, or, the Tutsi Genocide as seen by Hollywood by Alfred Ndahiro, who was a former advisor to Paul Kagame, and journalist Privat Rutazibwa, was published. The authors conducted interviews with 74 people who had stayed in the Hotel during the Genocide. Inside the Hotel Rwanda: The Surprising True Story … And Why it Matters Today, co-written by Hotel des Mille Collines Survivor Edouard Kayihura and American author Kerry Zukus, was published in 2011.</p><p>The books include allegations that during the Genocide, Rusesabagina extorted money from hotel guests for rooms and food. It was also reported that the UN headquarters in Kigali received information that Rusesabagina had provided a Rwandan army commander with a list of hotel guests and their room numbers. UN observers managed to change the room numbers of those most threatened. The character of the Canadian Colonel is based on Senator Roméo Dallaire, now retired Lieutenant-General from the Canadian Armed Forces. Dallaire was not pleased with the film's portrayal of the events that he witnessed, arguing he and his men did far more to help survivors. He recounted his own experiences in his biography, Shake Hands with the Devil. The book was later adapted into two feature films; a documentary, and a 2007 dramatic motion picture.</p><p>George stated that it was important to craft the film for a mass-market audience, using the question of whether the film is \"going to play in Peoria? Will it be understood? Is it mainstream enough?\"</p><h4>Filming</h4><p>Principal filming was shot on location in Kigali, Rwanda, and Johannesburg, South Africa. Paul Rusesabagina was consulted during the writing of the film. Although the character of Colonel Oliver played by Nolte is fictional in nature, the role was inspired by the UN force commander for UNAMIR, Roméo Dallaire. Ugandan president Yoweri Museveni, then-Rwandan president Juvénal Habyarimana, and Rwandan Patriotic Front leader (now president) Paul Kagame appear in archive television footage in the film.</p><p>The producers of the film partnered with the United Nations Foundation to create the International Fund for Rwanda, which supported United Nations Development Programme initiatives assisting Rwandan survivors. \"The goal of the film is not only to engage audiences in this story of genocide but also to inspire them to help redress the terrible devastation,\" said George.</p><h4>Soundtrack</h4><p>The original motion picture soundtrack for Hotel Rwanda was released by the Commotion label on 11 January 2005. It features songs written by Wyclef Jean, Deborah Cox, and others. The music for the film was composed by Rupert Gregson-Williams, Andrea Guerra, and the Afro Celt Sound System, while being edited by Michael Connell.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\"><i>Hotel Rwanda: Music from the Film</i></th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Film score</span> by <div class=\"contributor\" style=\"display:inline\">Afro Celt Sound System and Rupert Gregson-Williams</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1126788409\"><div class=\"plainlist\"><ul><li>1 November 2005</li></ul></div></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">49</span>:<span class=\"s\">25</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Commotion</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Hotel Rwanda: Music from the Film</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Mama Ararira Pt. 1/Mama Ararira We!, Pt. 2\"</td><td class=\"tracklist-length\">3:41</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Mwali We!\"</td><td class=\"tracklist-length\">1:09</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Million Voices\"</td><td class=\"tracklist-length\">4:23</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Interahamwe Attack\"</td><td class=\"tracklist-length\">2:48</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Nobody Cares\"</td><td class=\"tracklist-length\">4:12</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"<span>Umqombothi (African Beer)</span>\"</td><td class=\"tracklist-length\">4:53</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"The Road to Exile\"</td><td class=\"tracklist-length\">4:47</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Whispered Song\"</td><td class=\"tracklist-length\">3:06</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Finale\"</td><td class=\"tracklist-length\">3:02</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Ambush\"</td><td class=\"tracklist-length\">2:49</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Ne Me Laisse Pas Seule Ici\"</td><td class=\"tracklist-length\">3:33</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Mwari Sigaramahoro\"</td><td class=\"tracklist-length\">2:22</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Olugendo Lw'e Bulaya\"</td><td class=\"tracklist-length\">5:54</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Children Found\"</td><td class=\"tracklist-length\">1:57</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Icyibo\"</td><td class=\"tracklist-length\">0:49</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>49:25</td></tr></tbody></table><br/><h3>Marketing</h3><h4>Novel</h4><p>Hotelier Paul Rusesabagina's experience encouraged director George to produce the film. A paperback novel published by Newmarket Press, titled Hotel Rwanda: Bringing the True Story of an African Hero to Film, released on 7 February 2005, dramatizes the events of the Rwandan Genocide in 1994, as depicted in the film, and expands on the ideas of how Rusesabagina sheltered and saved more than 1,200 people in the hotel he managed in Kigali by summarizing three years of research, articles that chronicle the historical events, and the ensuing aftermath. A brief history and timeline, the making of the film, and the complete screenplay written by Keir Pearson and Terry George are covered in thorough detail.</p><br/><h3>Release</h3><h4>Home media</h4><p>Following its cinematic release in theaters, the film was released in VHS video format on 12 April 2005, marking the final United Artists film released on the format. The Region 1 Code widescreen edition of the film was also released on DVD in the United States on 12 April 2005. Special features for the DVD include; \"A Message for Peace: Making Hotel Rwanda\" documentary, \"Return to Rwanda\" documentary, Selected scenes commentary by Don Cheadle, Audio commentary by director Terry George and the real-life subject of the film–Paul Rusesabagina, along with select commentary by musician Wyclef Jean. Supplementally, the Blu-ray Disc edition of the film, featuring special documentaries along with selected scenes and audio commentary, was released in the United States on 10 May 2011. The film is available in other media formats such as video on demand as well.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Among mainstream critics in the U.S., the film received largely positive reviews. Rotten Tomatoes reported that 91% of 194 sampled critics gave the film a positive review, with an average score of 7.95/10 and the consensus calling it a \"sobering and heartfelt tale about the massacre that took place in Rwanda while most of the world looked away.\" At Metacritic, which assigns a weighted average out of 100 to critics' reviews, the film received a score of 79 based on 40 reviews.</p><blockquote>As Rusesabagina, Cheadle is simply terrific. Not only does he assume a totally believable African accent and manner, he also convinces us with every move and gesture that he's a resourceful Everyman elevated to genuine heroism by a struggle to do the right thing.</blockquote><p>—William Arnold, writing in the Seattle Post-Intelligencer</p><p>Michael Rechtshaffen, writing in The Hollywood Reporter, stated actor \"Cheadle impressively carries the entire picture, delivering the kind of note-perfect performance that's absolutely deserving of Oscar consideration.\" Roger Ebert in the Chicago Sun-Times called it a \"riveting drama\", while exclaiming \"The film works not because the screen is filled with meaningless special effects, formless action and vast digital armies, but because Cheadle, Nolte and the filmmakers are interested in how two men choose to function in an impossible situation. Because we sympathize with these men, we are moved by the film.\" In the San Francisco Chronicle, Mick LaSalle wrote that the film was a \"harrowing experience\", and that \"it documents for a mass audience what it was like. It's useful, in that it shows how it can happen. It's even hopeful, in that it shows that it's possible—not guaranteed, but possible—for people to maintain their humanity in the face of unhinged barbarism.\" Claudia Puig of USA Today stated the film was \"one of the year's most moving and powerful films, anchored by a magnificent performance by Don Cheadle.\" She declared, \"Hotel Rwanda emerges as an African version of Schindler's List.\" The film was not without its detractors, however. Dave Sterrit of The Christian Science Monitor felt that, although the subject matter was crucially important, \"the movie dilutes its impact with by-the-numbers filmmaking, and Cheadle's one-note performance displays few of his acting gifts.\" Left equally unimpressed was Lisa Schwarzbaum of Entertainment Weekly. Commenting on the character significance of the U.N. personnel, she stated it was \"a bad day for narrative, if not for diplomacy, when there is only one 3-D character among the entire U.N. lot, clad in their blue helmets, and that role is rasped by Nick Nolte with moral remorse rather than his more usual hint of dissolution.\" In her overall summation, she wrote \"Hotel Rwanda is a strange history lesson that leaves us more overlectured than properly overwhelmed.\" Michael Atkinson of The Village Voice, added to the negativity by stating the film was \"told to us secondhand, or glimpsed in distant scuffles\" and \"Like the majority of movies about the last century of holocausts, Hotel Rwanda is as earnest and tasteful as its creators. To capture the white-hot terror of social calamity, someone a little more lawless and fierce might be called for.\"</p><p>Writing for The New York Times, Stephen Holden wrote the film was \"a political thriller based on fact that hammers every button on the emotional console.\" He commended how the film \"offers a devastating picture of media-driven mass murder left unchecked\" while also praising \"Mr. Cheadle's magnificent, understated portrayal\". James Berardinelli, writing for ReelViews, called the film \"powerful\" and noted that it didn't \"pull as many punches as its detractors would have us believe.\" Berardinelli also wrote the film was \"brutal and shocking when it needs to be, but it also has great emotional scope and power. We find ourselves enmeshed in Paul's struggle, sharing his despair at the warfare tearing apart his country, his frustration and anger at the U.N.'s inability to act, and, eventually, his hope for a better tomorrow.\" Describing some pitfalls, Jeff Vice of the Deseret News stated the \"decision by the filmmakers to show things from that limited viewpoint—to show how isolated and fearful the characters were of the chaos going on around them—the film feels a little dishonest and diminished. It's never quite as effective as The Killing Fields or Schindler's List in that the film's overall impact is not as great and it doesn't linger in the memory.\" Vice however was quick to admit \"Hotel Rwanda does have its share of powerful moments; in particular, a scene in which Paul and another hotel employee unknowingly—due to fog—drive into a mass grave.\" He also expressed satisfaction with the acting, stating \"Cheadle brings a needed intensity to the film; his character's fear and compassion are quite vivid. Nolte is also good in his limited screen time, as is Joaquin Phoenix, who plays a news cameraman.\"</p><blockquote> flat, cramped staging which, combined with d.p. Robert Fraisse's harsh overlighting, gives the film the feel of a cheap backlot production, even though it was shot on location.</blockquote><p>—Scott Foundas, writing for Variety</p><p>Eleanor R. Gillespie of The Atlanta Journal-Constitution stated that Hotel Rwanda was an \"unforgettable film\" as well as \"a doubly unforgettable performance by Don Cheadle.\" Although mentioning \"The parallels with Steven Spielberg's Schindler's List are obvious\", she praised individual cinematic elements that made the film unique, such as \"the revelation of a dark, bumpy road paved with thousands of corpses. Or in a little girl's heartwrenching plea, 'Please don't let them kill me. I promise I won't be Tutsi anymore'.\" She concluded her review with Cheadle's noteworthy performance, stating he gave \"one of the best performances (if not the best) of last year—an Oscar-worthy portrait of a man who kept his head clear and his humanity intact in the midst of a man-made hell.\" Similarly, David Ansen wrote in Newsweek that \"two performances carry the film. Cheadle, in his richest role since Devil in a Blue Dress, burrows deep inside this complex man, who discovers in himself a strength he never knew he possessed, as he faces the disillusionment of all the \"civilized\" notions he believes in. As his strong, committed wife, Tatiana, Sophie Okonedo, barely resembling the saucy hooker she played in Dirty Pretty Things, is a revelation.\" However, in the Arizona Daily Star, Phil Villarreal was not moved by the lead acting of Cheadle or Nolte. He thought the characters were \"cardboardish\" and stated the \"uplifting moments of rescue seem antiseptic and set up.\" Critic Leonard Maltin wrote that Hotel Rwanda was a \"powerful film\" that he thought avoided being \"overly didactic by focusing on one compelling character, believably brought to life by Cheadle.\" In Reel Power: Hollywood Cinema and American Supremacy, drawing on the work of journalist Keith Harmon Snow and writer Edward S. Herman, author Matthew Alford called the film \"sensitive, humane and powerful\" but noted that it was \"striking how the history of bloodshed has been spun in line with Western interests\".</p><h4>Top 10 lists</h4><p>Hotel Rwanda was listed on many critics' top ten lists for 2004.</p><ul><li>1st – Richard Roeper, Ebert & Roeper</li><li>3rd – Claudia Puig, USA Today</li><li>3rd – Stephanie Zacharek, Salon.com</li><li>6th – Ruthie Stein, San Francisco Chronicle</li><li>8th – Lawrence Toppman, Salon.com</li><li>8th – Mick LaSalle & Carla Meyer, San Francisco Chronicle</li><li>9th – Roger Ebert, Chicago Sun-Times</li><li>10th – Desson Thomson, Washington Post</li><li>10th – Lawrence Toppman, Charlotte Observer</li><li>Top 10 (listed alphabetically) – Carrie Rickey, Philadelphia Inquirer</li><li>Top 10 (listed alphabetically) – Carina Chocano, Los Angeles Times</li></ul><h4>Accolades</h4><p>The film was nominated and won several awards in 2004–2006. Various critics included the film on their lists of the top 10 best films of 2004. Roger Ebert of the Chicago Sun-Times named it ninth best, Mick LaSalle of the San Francisco Chronicle named it eighth best, and Desson Thomson of The Washington Post named it tenth best. The film is also listed by the American Film Institute as one of the 100 most inspirational movies of all time.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th></tr><tr><td rowspan=\"3\"><span>77th Academy Awards</span></td><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Supporting Actress</td><td align=\"center\">Sophie Okonedo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Best Original Screenplay</span></td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">American Film Institute Awards 2004</span></td><td align=\"center\">Top Audience Award</td><td align=\"center\">————</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Discover Screenwriting Award 2004</span></td><td align=\"center\">Discover Screenwriting Award</td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2005 <span>Berlin International Film Festival</span></td><td align=\"center\">Out of Competition</td><td align=\"center\">————</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2005 <span class=\"mw-redirect\">Bet Awards</span></td><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Black Reel Awards of 2005</span></td><td align=\"center\">Best Actor in a Drama</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Actress in a Drama</td><td align=\"center\">Sophie Okonedo</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>59th British Academy Film Awards</span></td><td align=\"center\">Best Original Screenplay</td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Broadcast Film Critics Association Awards 2004</span></td><td align=\"center\">Best Picture</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Dallas-Fort Worth Film Critics Association Awards 2005</span></td><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Picture</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2005 <span>David Di Donatello Awards</span></td><td align=\"center\">Best Foreign Film</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2005 18th <span>European Film Awards</span></td><td align=\"center\">Best Composer</td><td align=\"center\">Rupert Gregson-Williams, Andrea Guerra</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>62nd Golden Globe Awards</span></td><td align=\"center\">Best Picture – Drama</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Actor – Drama</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Best Original Song</span></td><td align=\"center\">Jerry Duplessis, Andrea Guerra, Wyclef Jean</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">Golden Satellite Awards 2004</span></td><td align=\"center\"><span class=\"mw-redirect\">Best Actor – Motion Picture Drama</span></td><td align=\"center\">Don Cheadle</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\">Best Motion Picture Drama</td><td align=\"center\">————</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\">Best Original Song</td><td align=\"center\">Jerry Duplessis, Andrea Guerra, Wyclef Jean</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\">Best Original Screenplay</td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">2006 Grammy Awards</span></td><td align=\"center\">Best Song Written For Motion Picture, Television or Other Visual Media</td><td align=\"center\">Jerry Duplessis, Andrea Guerra, Wyclef Jean</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2005 <span>Humanitas Prize</span></td><td align=\"center\">Humanitas Prize</td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\">2005 <span>3rd Irish Film &amp; Television Awards</span></td><td align=\"center\">Best Director</td><td align=\"center\">Terry George</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td align=\"center\">Best Script for Film</td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>31st <span class=\"mw-redirect\">Japan Academy Prize Ceremony</span></td><td align=\"center\">Best Foreign Language Film</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>London Film Critics Circle Awards 2005</span></td><td align=\"center\">Best British Director</td><td align=\"center\">Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best British Supporting Actress</td><td align=\"center\">Sophie Okonedo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2005 <span>Movieguide Awards</span></td><td align=\"center\">Most Inspiring Movie Acting</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\">2005 <span>36th NAACP Image Awards</span></td><td align=\"center\">Outstanding Actor in a Motion Picture</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Outstanding Motion Picture</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Outstanding Supporting Actress in a Motion Picture</td><td align=\"center\">Sophie Okonedo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2006 <span>Nastro d'Argento</span> Silver Ribbon Award</td><td align=\"center\">Best Score</td><td align=\"center\">Andrea Guerra</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2004 <span class=\"mw-redirect\">National Board of Review of Motion Pictures</span> Awards</td><td align=\"center\">Top Ten Films</td><td align=\"center\">————</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Online Film Critics Society Awards 2004</span></td><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\">2004 <span class=\"new\">Political Film Society Awards</span></td><td align=\"center\">Exposé</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Human Rights</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Peace</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Producers Guild of America Awards 2004</span></td><td align=\"center\"><span class=\"mw-redirect\">Stanley Kramer Award</span></td><td align=\"center\">————</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2006 <span class=\"mw-redirect\">Robert Awards</span></td><td align=\"center\">Best Non-American Film</td><td align=\"center\">Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>San Diego Film Critics Society Awards 2004</span></td><td align=\"center\">Body of Work</td><td align=\"center\">Don Cheadle</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>11th Screen Actors Guild Awards</span></td><td align=\"center\">Best Ensemble Acting</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\">Best Supporting Actress</td><td align=\"center\">Sophie Okonedo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Southeastern Film Critics Association Awards 2004</td><td align=\"center\">Best Picture</td><td align=\"center\">————</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>2004 Toronto International Film Festival</span></td><td align=\"center\">People's Choice Award</td><td align=\"center\">Terry George</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Washington D.C. Area Film Critics Association Awards 2004</span></td><td align=\"center\">Best Actor</td><td align=\"center\">Don Cheadle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>World Soundtrack Awards 2005</span></td><td align=\"center\">Best Original Song Written for a Film</td><td align=\"center\">Jerry Duplessis, Andrea Guerra, Wyclef Jean</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Awards 2004</span></td><td align=\"center\">Best Original Screenplay</td><td align=\"center\">Keir Pearson, Terry George</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>Box office</h4><p>The film premiered in cinemas on 22 December 2004 in limited release throughout the US During its limited opening weekend, the film grossed $100,091 in business showing at seven locations. Its official wide release was screened in theaters on 4 February 2005. Opening in a distant 14th place, the film earned $2,316,416 showing at 823 cinemas. The film Boogeyman beat its competition during that weekend opening in first place with $19,020,655. The film's revenue dropped by 11.8% in its second week of release, earning $2,043,249. For this particular weekend, the romantic comedy Hitch unseated Boogeyman to open in first place with $43,142,214 in revenue, while Hotel Rwanda remained in 14th place not challenging a top 10 position. During its final weekend in release, the film opened in 62nd place grossing $23,176 in business. The film went on to top out domestically at $23,530,892 in total ticket sales through an 18-week theatrical run. Internationally, the film took in an additional $10,351,351 in box office business for a combined worldwide total of $33,882,243. For 2004 as a whole, the film would cumulatively rank at a box-office performance position of 99.</p><br/>"
  },
  "errorMessage": ""
}