{
  "imDbId": "tt0120735",
  "title": "Lock, Stock and Two Smoking Barrels",
  "fullTitle": "Lock, Stock and Two Smoking Barrels (1998)",
  "type": "Movie",
  "year": "1998",
  "items": [
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "90",
      "content": "A dynamite bundle from British writer-director Guy Ritchie. Even when the accents are as indecipherable as the plot, Ritchie keeps the action percolating and the humor on high."
    },
    {
      "publisher": "Film Threat",
      "author": "Ron Wells",
      "link": "",
      "rate": "80",
      "content": "Lock is filled with great writing, great acting, colorful characters, and a tight story. I actually like this film more than \"Pulp Fiction\"."
    },
    {
      "publisher": "",
      "author": "New Times (L.A.)",
      "link": "http://www.newtimesla.com/",
      "rate": "80",
      "content": "Ritchie's showmanship--half macho braggadocio, half emotion-tinged bravura--slaps and tickles the viewer into submission. He takes a group of not-so-goodfellas, whose idea of fun is setting farts afire, and, against all odds, makes them lively and engaging."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "Maitland McDonagh",
      "link": "",
      "rate": "80",
      "content": "Ritchie appears to have been paying attention to what made \"Reservoir Dogs\" (a huge hit in the UK) work, rather than coming away convinced that the formula for success begins and ends with pop-culture allusions and scarcely digested \"homages\" to classic crime films."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Bob Graham",
      "link": "",
      "rate": "75",
      "content": "If the dialect is hard to comprehend, that soon becomes part of the joke. It's unlikely that even the British audiences who made Lock, Stock a big hit got it all."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "John Petrakis",
      "link": "",
      "rate": "75",
      "content": "Plenty of fun, less for its many plot twists than for its large and varied assortment of vibrant characters. [12 Mar 1999]"
    },
    {
      "publisher": "Variety",
      "author": "Derek Elley",
      "link": "",
      "rate": "70",
      "content": "Though Ritchies screenplay scores a 10 for sheer complexity and cleverness, it rates much lower down the scale for comprehensibility and audience involvement."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "67",
      "content": "The film's lures, while undeniable, are synthetic, and we never do learn what fuels all the greed besides pints of beer."
    },
    {
      "publisher": "USA Today",
      "author": "Mike Clark",
      "link": "",
      "rate": "63",
      "content": "A half-funny, half-ugly comedy about underworld ineptitude. [5 Mar 1999]"
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Liam Lacey",
      "link": "",
      "rate": "63",
      "content": "The best one can say is that it's a smart cartoon, and a fairly exhausting viewing experience."
    }
  ],
  "errorMessage": ""
}