{
  "imDbId": "tt0119488",
  "title": "L.A. Confidential",
  "fullTitle": "L.A. Confidential (1997)",
  "type": "Movie",
  "year": "1997",
  "items": [
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0422740",
      "warningSpoilers": false,
      "date": "25 June 2000",
      "rate": "",
      "helpful": "221 out of 259 found this helpful.",
      "title": "A \"Chinatown\" for the 1990s",
      "content": "\"L.A. Confidential\" is brilliant. The screenplay and direction are second-to-none. The performances by the ensemble cast are also superb. Kim Basinger stands out the most with her Oscar-winning role. Kevin Spacey, Russell Crowe, Guy Pearce, James Cromwell, David Strathairn, and Danny DeVito all have their moments as well. The film deals with the seamy side of Los Angeles in the post-World War II 1950s. Los Angeles is a place of shady dealings and police corruption. To add to those problems is the creation of the smutty tabloid. Multi-layered and smart, \"L.A. Confidential\" will be the greatest survivor of the films released in 1997. 5 out of 5 stars."
    },
    {
      "username": "hall895",
      "userUrl": "https://www.imdb.com/user/ur0915482",
      "reviewLink": "https://www.imdb.com/review/rw1153863",
      "warningSpoilers": false,
      "date": "19 August 2005",
      "rate": "8",
      "helpful": "129 out of 145 found this helpful.",
      "title": "A fascinating look at life in the big city",
      "content": "Give a collection of great actors a great story to work with and you are likely to end up with something rather special. Such is the case with L.A. Confidential. The boldface names jump off the page...Kevin Spacey, Russell Crowe, Kim Basinger, Danny DeVito, James Cromwell and, in his first big-time role, Guy Pearce. And none of these big names are just mailing it in, here to collect a paycheck. They're all on top of their games, undoubtedly helped to no small extent by the wonderfully nuanced and utterly intriguing story.This story takes place in 1950s Los Angeles but this is a side of L.A. most people don't get to see. Behind all the Hollywood glamour L.A. has a seamy side which will be the focus of this tale. At the heart of the movie are three cops who ostensibly are supposed to be working together but who go about the business of dispensing justice in very different ways. Crowe plays aggressive hothead Bud White. Spacey is Jack Vincennes, who takes more pride in his work as an adviser on a popular television cop drama than he does in his actual police work. And Pearce plays Edmund Exley, a young up-and-comer in the department who plays things by the book. As we will soon see Exley is rather unique in an LAPD which believes in doing whatever is necessary to bring the guilty to justice. Even if it means becoming a little guilty themselves.The movie really begins to move forward with a massacre at a coffee shop. It seems a pretty cut and dried case but initial appearances can be deceiving. Soon White, Vincennes and Exley will find themselves caught up in a maze of lies, deception and mystery. It will be a great test for these very different men as it appears they may well need each other's unique talents to solve this puzzle. And quite the elaborate puzzle it is. One important piece is Lynn Bracken, a high class call girl played by Basinger. Tying together many of this complex story's strands is gossip writer Sid Hudgens who is played with appropriate sleaziness by DeVito. And in the background the whole time is the somewhat mysterious Captain Dudley Smith, played by Cromwell. Here is a man who believes in bringing the guilty to justice by any means necessary. That's all well and good if you know who the guilty are but in L.A. Confidential you're never quite sure who to believe. The viewer is guessing right along with the investigators on the screen. And in the end it all comes together and pays off brilliantly.L.A. Confidential is first and foremost a great story, with many fascinating twists and turns along the way. The film also serves as a showcase for some of this generation's finest acting talents. Each of the main characters is wonderfully unique and each of the actors involved does a terrific job in bringing those characters to life. These are complex characters in a complex tale. It's so involved that the acting had to be stellar if this film was going to work and none of the stars disappoint. Terrific storytelling brought to life by a collection of inspired performances makes L.A. Confidential an absolute winner."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3728384",
      "warningSpoilers": false,
      "date": "11 June 2017",
      "rate": "10",
      "helpful": "57 out of 67 found this helpful.",
      "title": "Superb film-making",
      "content": "As a fan of mysteries and thrillers and who likes a lot of the cast (such a great one on paper), expectations were high for 'LA Confidential'. And 'LA Confidential' didn't disappoint at all, it is an outstanding film on all levels and should have won the Best Picture Oscar of 1997 and won more.Visually, 'LA Confidential' looks great. The photography is both audacious and stylish, suitably the story and genre superlatively. A good music score also helps and there is an appropriately haunting one courtesy of one of the greatest film composers ever. Curtis Hansen directs superbly, it has a lot of style and how it balances everything is so cleverly done, he hasn't made a better film and to me it's the best directing of his entire career.'LA Confidental' richly deserved its Best Screenplay Oscar. No other film that year came close to the film's rich character development, complexity and its refusal to fall into cliché territory. All the characters are compelling in their realism and none of them feel stereotypical or one-sided, actually breaking the mould of good cops and bad villains. The story is gripping in its intensity and thrills, with plenty of unexpected twists and turns, and very rare a dull moment.The acting is exceptionally full-blooded and there isn't a single weak link. How Russell Crowe, Guy Pearce and Kevin Spacey weren't nominated for Oscars is unfathomable. Spacey in particular is brilliant, though Crowe is appropriately hard-nosed and Pearce has rarely been better.James Cromwell and Danny De Vito also shine. Cromwell is chillingly insidious and De Vito has never been slimier. Whether Kim Basinger deserved her Oscar win is up for debate, to me it was a very worthy win where she gives her role hard edge and charm.In conclusion, superb film-making and an outstanding film on all levels. 10/10 Bethany Cox"
    },
    {
      "username": "flipgirl38",
      "userUrl": "https://www.imdb.com/user/ur1593166",
      "reviewLink": "https://www.imdb.com/review/rw0423011",
      "warningSpoilers": false,
      "date": "1 September 2003",
      "rate": "",
      "helpful": "336 out of 385 found this helpful.",
      "title": "Three Phenomenal Actors Give The Performances Of A Life Time",
      "content": "Six years ago, a director by the name of Curtis Hansen came out with a small time film named L.A. Confidential. Though the movie garnered several big nominations at the 1997 Academy Awards, the nation had been swept up by the gigantic and romantic blockbuster, Titanic, thus shrinking the chances of this brilliant movie from garnering any real awards. 1997 completely screwed this phenomenal film, in which three brilliant actors gave the performances of their careers.Russell Crowe plays Detective Bud White, a tough L.A. cop who bends the rules in order to bring justice to the city. He is ruthless, and unforgiving of anyone, which brings him into direct conflict with Detective Lieutenant Ed Exley, played by Guy Pearce. Russell Crowe became with this role a full pledged character actor,: the cop with a steel physique, and a vulnerable heart. He becomes so believable and real to the audience, you can not help but sympathize for his character under the circumstances. From this role, Crowe went on to garner three best actor nominations, winning for his role in Gladiator.Guy Pearce, the little known Australian body builder, became the character known as Ed Exley, a straight, uptight detective trying to live up to the legend his father created before him. Exley has so much to prove to the LAPD, trying to show them that he is just as good, maybe even better, than his father. He plays the politics in a corrupted police department very well, and is able to use these skills in solving the corrupt and mysterious case of the Night Owl murders. This film officially put Guy Pearce in the big leagues of film, making his next appearances in Memento and The Count of Monte Cristo. He is a severely underrated actor who deserves better than what he has been getting.Finally, the ever wonderful Kevin Spacey. Spacey plays Lieutenant Jack Vincenes, a cop who gives a popular LA police show, Badge of Honor, real solved cases in return for money. Jack sees his life as an ever going soap opera, until he comes across a case that somehow has a connection to the Night Owl murders. Kevin Spacey has proved time and again his abilities as an actor, and he continues with this performance. Curtis Hansen does a wonderful job bringing this story to the big screen. His talents, although recognized, have not been awarded as of yet. I can only hope that someday, someone will give this amazing director something worthy of his talents. Highly Recommended. MJR"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0423018",
      "warningSpoilers": false,
      "date": "23 November 2003",
      "rate": "",
      "helpful": "38 out of 47 found this helpful.",
      "title": "Simply a wonderful film that respects it's audience",
      "content": "In the gritty LA of the 1950's, stardom is the boom industry and all is about appearance and visual image. However under the surface drug use is rife, prostitution is rampant and the police officers are violent thugs. In the middle of this are three officers with different aims. Ed Exley is an ambitious young officer who will do anything to climb the ranks, Bud White is a muscle man and gets the job done while Jack Vincennes is only concerned with celebrity busts and getting his face in the paper. When the three come together on a coffee shop killing that brings in elements of cases they are following they solve it together. However each has suspicions that something is not right.I'm sorry to say that I didn't pick up on this at the cinema and it wasn't until the Oscars brought it to my attention that I first saw it. Since then I have seen it several times and have enjoyed it every time. The plot is slightly complex (although maybe not by the genre's standards) and it isn't simplified for the audiences sake  it respects the audience enough to trust us to keep up with it's pace. The film is split into three strands dictated by the characters, they are not quite distinct but are mostly intertwined the whole way through  coming together in the final hour to great effect.The pace of the telling is great; it has moments of drama, of tension and great action. Hanson has done a great job with the direction, he has a great sense of place and time to his 50's Hollywood  whether it be the stars' lives or the black suburbs  but he directs each scene with a sense of tension and urgency that the material deserves. The final twist is OK if not great but it is more the telling of the story that is enjoyable, not just the denouncement.The casting did a great job of getting growth names and established qualities but no one huge star who could dominate the film. It is the Australian stars that stand out here. Pearce is excellent with a subtly changing character but it is Crowe that sticks in the memory with a very strong character and a performance to match. Spacey is as quality as he ever is (or at least, was for a few years either side of this film) and the support cast is as good with De Vito, Basinger, Cromwell, Rifkin, Strathairn and Guilfoyle.There is nothing I really dislike about this film. The longer than average running time is not a problem as it easily fills it without dragging at any point. The film oozes class and has a great tough plot from Ellroy where nothing is as simple as right/wrong and everything comes together at the end. A real classy film with brains and brawn which continues to be one of my favourites of recent years."
    },
    {
      "username": "oneflewovertheapocalypse",
      "userUrl": "https://www.imdb.com/user/ur1651004",
      "reviewLink": "https://www.imdb.com/review/rw0423036",
      "warningSpoilers": false,
      "date": "15 April 2004",
      "rate": "",
      "helpful": "147 out of 179 found this helpful.",
      "title": "Great Detective Movie",
      "content": "L.A. Confidential is the most classy, intriguing, thought provoking and sexiest detective movie ever to be made in the history of detective films. When you look back at it and see that Russell Crowe, Kevin Spacey and Guy Pearce actually appeared in the same film back in 97 then you wouldn't have believed it since they have all gone on to better things but before that we had L.A. Confidential which was Crowe's and Pearce's ticket into Hollywood. Spacey had already made it with his Best Supporting Actor nod for The Usual Suspects but what puzzles me is how everybody apart from Kim Basinger didn't get any acting nominations at the Oscars. James Cromwell is the most chilled out villain you'll ever going to see in a film like this and has been criminally ignored by the Academy. Curtis Hanson was also someone who had made some good films but no masterpieces till this came along. They all must have sold their souls to make this because when you get big cast get together to make a Hollywood film then you become a bit intrigued by it because if the cast is big then is the story any good? In L.A. Confidential's case it had both and a lot more to say the least.I still think that this is Spacey's, Crowe's and Pearce's best film of there career. Russell Crowe as tough guy but sentimental towards women Bud White is flawless and is quite like the real Russell Crowe which is scary. Guy Pearce as the quick witted but dumb looking Ed Exley is someone one you either love or you hate as the annoying rookie. Kevin Spacey is just as cool as anything that Bogart and Mitchium could have pulled off as Jack Vincennes and there is the movie along with a great script by Brain Heagland of Mystic River fame and Curtis Hanson himself who put together a great script from James Elroy's novel. Kim Basinger is as sexy as she is going to get and her acting is very good and well deserving of her Oscar if the boys were robbed. I liked how we had three different stories and one case that all had something to do with another but were all separate anyway till the end. It was like watching a movie with three stories based on a trio of detectives. L.A. Confidential was a treat as far as storytelling goes because it enthrals you into the film straight away as well as it being more exciting than a night out in Vegas.We don't see Detective films like this so we should be grateful that this came along when it did."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw1478348",
      "warningSpoilers": false,
      "date": "18 September 2006",
      "rate": "9",
      "helpful": "20 out of 24 found this helpful.",
      "title": "I Wish This Film Had Been Five Hours Long",
      "content": "What happens when a squad of corrupt cops in the 1950s explore a murder case from multiple angles and find their corruption coming back on them like chickens coming home to roost? Who will solve the crime? Who will survive and what will be left of them? This movie is phenomenal. The only reason I didn't give it 10 out of 10 is because I didn't care for the ending (which I won't reveal). It's a world were Hollywood and law enforcement cross over and even the hookers want to be movie stars. I have not read the Ellroy novels, but I have been told they are even more intricate than this film with a lot more backstory. I would watch a five or six hour version of this film. But even so, that is the strong point of this film: multiple stories that begin to overlap. Sure, others (Tarantino) have tried this, but I think this is the most expertly done conception I've seen yet.Kevin Spacey's part as a Hollywood obsessed cop is beautiful and he fits the part to a tee. His role is supposed to be similar to Dean Martin and I can see that; Spacey again harnessed this kind of character when he made \"Beyond the Sea\". Spacey's role is the connection between the world of law and the world of fame.Russell Crowe plays the \"bad cop\" who crosses the line with sheer thuggery and an attraction to a prostitute (Kim Basinger, who does a fine job being both alluring yet tasteful). His part was supposed to be for Michael Madsen (one of the greatest actors of all time for a cop/crook movie), but I think Crowe may have been the better choice. Who else can be a natural thug?Guy Pearce... I was not sure how to take him. I have not enjoyed him (\"Time Machine\") and yet also loved him (\"Memento\"). In the beginning, I thought it would be another geeky Pearce role and I was a bit concerned. But as the film progresses, so does Pearce's character become more lovable and impressive. You'll agree.Danny DeVito was okay and James Cromwell was insidiously delightful.Brian Helgeland adapted this screenplay. You may know him best as the writer of \"A Knight's Tale\" and \"The Order\". The Order was crappy. But A Knight's Tale is fantastic. This, by far, will go down as his crowning achievement. He may as well call up Michael Bay and go retire in the South Seas where they'll never be found.Simply put, this is the best film I've seen in at least a month (and I watch at least a movie a day). Maybe the best film I've seen all year. Don't set this movie aside, you need to put this on the top of your honeydew list."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0422987",
      "warningSpoilers": false,
      "date": "12 February 2003",
      "rate": "7",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Hollywood Wasn`t Ready For It",
      "content": "Hard to imagine now but in 1997 many of the cast in LA CONFIDENTIAL weren`t well known . Kevin Spacey had an Oscar under his belt but hadn`t appeared in many starring roles , Guy Pearce was known only to NEIGHBOURS fans while Russell Crowe was remembered only for his powerhouse performance in ROMPER STOMPER . In fact it sounds ridiculous in 2003 but the two best known members of the cast when this was released were Danny DeVito and Kim Basinger The real star of LA CONFIDENTIAL is the script . I`ve never read the novel but I`ve often heard it`s unfilmable . Never once did I get the feeling this was true while watching the film adaption because the only thing to strike me about the script was its intelligence , yes you`ve read that right an intelligent Hollywood script complete with violence , wit and a couple of shocking twists and turns . The only criticism about the story is the old cliche of one of the cops being a naive idealist while the other cop is a violent fascist thug . LA CONFIDENTIAL was stuffed at the Oscars by TITANIC but that`s not surprising . How many academy voters are going to love a film about corruption , vice and murder set in Hollywood ?"
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw2256827",
      "warningSpoilers": false,
      "date": "29 May 2010",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "The cast of a lifetime in a 1997 noir set in LA of the '50s",
      "content": "One of the greatest films ever made, L.A. Confidential benefits from a great script (Brian Helgeland), great performances (Kevin Spacey, Russell Crowe, Guy Pearce, Kim Basinger, James Cromwell, Danny DeVito, David Straithairn), and great direction (Curtis Hanson). It's not easy to do a film noir in modern times that is set it in the past. All too often, the performances are too stylized or nonorganic, the direction is stilted -- the whole thing comes off as an attempt, and not a very good one. In this case, though, the result is brilliant.Basically, L.A. Confidential is the story of three very different kinds of police officers who become involved in the same case, the Night Owl Murders. There's Russell Crowe as Bud White, the loose cannon, a strong but vulnerable cop; Guy Pearce as Exley, the political, honest, by the book cop who incurs everyone's wrath; and Kevin Spacey as Jack Vincennes, the celebrity detective who is a consultant on a Dragnet-type TV show, Badge of Honor. He works hand in hand with a writer for Hush magazine (Danny DeVito). But they're not the only ones embroiled in the Night Owl diner slaughter. There's Dudley Smith (James Cromwell), the Chief of Police, Ellis Loew (Ron Rifkin), the bisexual D.A., the wealthy, powerful Pierce Patchett (David Straithairn); and Lynn, the Veronica Lake-lookalike call girl (Kim Basinger). And Rollo Tomassi, of course - an important name in the investigation.It's hard to single out any one performance. The film is perfectly cast. The three officers - Spacey, Crowe, and Pearce - are as brilliant as the characters they play are different. And everyone else in the cast is fantastic as well.Historically, there are some things that are not correct as far as Hollywood - The Bad and the Beautiful and Roman Holiday did not run at the same time; and the duo of Johnny Stompanato and Lana Turner came later. However, two elements of the film are based on reality or at least rumors - there was supposedly a call girl ring where the women looked like famous film stars; and \"Hush\" magazine, the cover anyway, looks like \"Whisper\" magazine from that era.L.A. Confidential is a story of twists, turns, and camaraderie that take place on the mean streets of '50s L.A., a story that winds up changing the lives of everyone involved. Filled with atmosphere and suspense, it's a not to be missed, violent, vivid portrait of a time when things at LAPD were (and still might be today) off the record, on the q.t. -- and very hush-hush."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2661507",
      "warningSpoilers": false,
      "date": "20 August 2012",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "An exemplary piece of filmmaking",
      "content": "What's not to love about L. A. CONFIDENTIAL, the 1997 Oscar-winning detective story about the sleazy side of seemingly glamorous '50s-era Los Angeles? It boasts an outstanding screenplay adapted from the James Ellroy novel, excellent direction from old hand Curtis Hanson, and truly tremendous performances from the entire cast.The film itself is a dense narrative mixing together multiple strands: drugs, prostitution, murder, sleaze, the media, and a massacre. Despite the lengthy running time, this film never sits still and it keeps on grabbing you and propelling you forwards until the credits finally hit. It's an exhausting, exhaustive look at its subject matter and I loved every hard-boiled second of it. The ten-minute segment that takes place around the hour mark, where the plot initially appears to have resolved itself neatly, is a mark of genius.When I think fondly of L. A. CONFIDENTIAL, though, I think mainly of the acting. Guy Pearce, sheer excellence as the by-the-book rookie, leading us through the film with a charming mannered performance. Just why hasn't he made the A-list in Hollywood after his turn here? Then there's Russell Crowe, bringing a simmering vitality to his role that's been missing ever since. Crowe is a scene stealer, and that's a difficult job when you also throw in a career-best Kevin Spacey into the mix. Kim Basinger bagged the Oscar, but Pearce, Crowe and Spacey all deserved one, too.Throw in a fine supporting cast (particularly James Cromwell and Danny DeVito), top-dollar production design, oodles of violence, moments of warmth and humour amid the carnage and you have one of the best mystery films ever made. Yes, L. A. CONFIDENTIAL really is that good!"
    },
    {
      "username": "Mr_PCM",
      "userUrl": "https://www.imdb.com/user/ur3103298",
      "reviewLink": "https://www.imdb.com/review/rw1282061",
      "warningSpoilers": false,
      "date": "3 February 2006",
      "rate": "10",
      "helpful": "35 out of 43 found this helpful.",
      "title": "This is how a proper crime story should be told!",
      "content": "LA Confidential is a sprawling epic tale of crime, corruption and justice in Hollywood and the LAPD, with a cast to match. A truly gripping crime saga exposing the seedy underbelly of the City of Angels, where cops never let the truth get in the way of justice, and everyone knows everyone else's dirty secrets.Criminally overlooked at both the box office and the Academy thanks to the all-conquering and over-achieving Titanic, LA Confidential will far more likely stand the test of time to be thought of as one of the best films of the 90s, and possibly the best cop film ever.After cops give a number of inmates a beating in retaliation for two of their own being put in hospital, the career-minded Ed Exley (Guy Pearce) agrees to testify to what he saw, turning in his fellow officers. When one of the cops forced out turns up dead as a result of a shooting, Exley, hothead detective Bud White (Russell Crowe) and fame-obsessed Sergeant Jack Vincennes (Kevin Spacey) all work to find the answers. However, as they uncover the truth, it leads to more questions, of corruption, blackmail, bribery and conspiracy.The film superbly portrays the dual nature of Hollywood; glamorous parties and beautiful people, and the seemingly ever-present crime and corruption, even in the police. Danny Devito's opening monologue perfectly sums it up - 'There's trouble in paradise'. This is not the city at the end of the rainbow, the city where dreams come true.A series of stellar performances from an all-star cast makes it impossible to pick the star, although Kim Basinger richly deserved her Best Supporting Actress. Kevin Spacey is terrific as ever, while Russell Crowe shows that Gladiator wasn't his first muscles-with-a-heart role. But the real standout is probably Guy Pearce in a career-making performance as the one officer determined to what is right and just, regardless of the potentially disastrous consequences for him. However, LA Confidential is a true ensemble piece, and everybody holds their own among the starry cast. Few will have made many better films, before or since.Curtis Hanson directs in a career-defining role, the sweeping direction echoing the sprawling nature of both the story and the city. The story is a slow-burner, gradually unraveling all the twists, but instead of clearing up the mystery, the waters become muddier as the trio of officers are forced to work together. Hanson masterfully commands the James Ellroy's source material, weaving it into a gripping multi-layered tale. The characters are extremely well developed, all three-dimensional, with no clear-cut heroes and villains. White (Crowe) in particular is the classic film noir anti-hero, the violent cop with a heart-breaking story, thinking with his muscles rather than his brain. LA Confidential is a classic 50s noir film told for the 90s, and keeps you guessing right up to the final scene as to how high the corruption goes. The two-hour running time is never felt.A superb thriller and the perfect antidote to the rash of mindless action-comedies that frequently come out of Hollywood today, LA Confidential harks back to how film-making used to be  all about telling a story. And what a story it is. One of, if not the best film of the 90s."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1183301",
      "warningSpoilers": false,
      "date": "30 September 2005",
      "rate": "10",
      "helpful": "20 out of 27 found this helpful.",
      "title": "a masterpiece in every respect",
      "content": "I can always remember \"L.A. Confidential\" as the first gritty-noirish-seedy movie that I ever saw in the theaters. And it makes me proud that this was the first one that I saw. We all can assume that movies about the inner workings of the police world are going to be gritty-noirish-seedy, but overall, it doesn't do \"L.A. Confidential\" justice to only classify it that way. Curtis Hanson created an INDESCRIBIBLY great movie here.It's 1950s Los Angeles. Tabloid writer Sid Hudgens (Danny DeVito) likes to advertise the City of Angels as paradise on Earth, where you can raise an all-American family, meet a movie star, or even become one. But before too long, we get to see the police department. Officers Bud White (Russell Crowe), Ed Exley (Guy Pearce) and Jack Vincennes (Kevin Spacey) are the main characters. White is the type who loves to help damsels in distress, but even he has his weak points; squeaky-clean Exley is the son of a cop, carrying on his father's work; and Vincennes mainly likes his job because of all the places that he gets to visit.Following a murder one day, it's up to the three officers to investigate. But what they eventually uncover pales in comparison to what anyone would have expected. You see, some things extend farther than most people realize.Kim Basinger won a well deserved Oscar for her role as sultry prostitute Lynn Bracken. A Veronica Lake lookalike, she's the type of woman who can lead you to new evidence...or might be planning something else.I can't try to explain how good this movie is. Like \"Chinatown\", it shows the seedy underside of something usually assumed to be pure, but never gets too full of itself to the point of being silly. Why, oh why, did the Academy give \"Titanic\" Best Picture when \"L.A. Confidential\" was nominated?"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6285428",
      "warningSpoilers": true,
      "date": "19 November 2020",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "L.A Confidential",
      "content": "A wonderful movie and the performance of most of the actors was excellent and the development of Ed Exly's character was excellent and the ending was good. I did not expect the death of jack. The film discussed the issue of corruption among the police officers in an excellent way and the directing was very good and the writing was good, but at the end of the film I felt very bored"
    },
    {
      "username": "sallyshirla",
      "userUrl": "https://www.imdb.com/user/ur93245688",
      "reviewLink": "https://www.imdb.com/review/rw4717396",
      "warningSpoilers": false,
      "date": "11 March 2019",
      "rate": "9",
      "helpful": "29 out of 33 found this helpful.",
      "title": "One of the best",
      "content": "We've not come very far since this classic in terms of high quality cop crime dramas. Acting and direction is perfection."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1882632",
      "warningSpoilers": false,
      "date": "28 May 2008",
      "rate": "10",
      "helpful": "19 out of 26 found this helpful.",
      "title": "Eisenhower Era LA",
      "content": "I think that all LA Confidential needed was possibly the writing touch of someone like Raymond Chandler or Dashiell Hammett. But since those two worthy gentleman are beyond reach, this is as good as it will get for the modern cinema.Anticipating the film Crash by several years, LA Confidential is a period piece set in the Eisenhower era Los Angeles and its police department which has a history of corruption more than most. A whole lot of separate incident are tied together quite intricately as the cast's three police heroes, together and separately piece it all together.Three very different kinds of cops are portrayed here. First is the laid back Kevin Spacey who has a casual attitude towards the corruption he sees. He's also the police adviser to a Dragnet style show and enjoys a whole lot of perks that come with it.Secondly is Guy Peace who's a real boy scout, but is the son of a hero cop and also knows how to work department politics. He doesn't look the other way on corruption, he rises in rank because he turned in fellow officers and he's hated up and down the line.Finally there's Russell Crowe whose character reminds me of the big dumb son in House of Strangers played by Paul Valentine who Edward G. Robinson made a guard in his bank. Even in the days before the Miranda decision, Crowe made a specialty of getting confessions the old fashioned way. Certain higher ups, particularly Captain James Cromwell recognize his unique talents and call him in when needed. Like Valentine though he proves in the end to be quite a bit smarter than everyone gives him credit for.The beating of some Mexican prisoners, the massacre of six people at a Hollywood Diner, a call girl service where the girls are made up to look like movie stars, a bisexual actor killed at a sleazy motel, and a whole lot more are all part of an complex story that won one of two Oscars LA Confidential received, for best screenplay adapted from another source.The second Oscar went to Kim Basinger as one of the call girls who is made up like Veronica Lake. She gets all the men in this cast into maxim hormonal overdrive, especially Pearce and Crowe. Basinger won for Best Supporting Actress that year.Woven into the story are such real characters as mob boss Mickey Cohen whose arrest for tax evasion sets up a lot of the situations here, his number one enforcer Johnny Stompanato and Lana Turner who would shortly be some of the biggest tabloid fodder ever.Look also for some nice performances from Ron Rifkin as the blackmailed District Attorney and Danny DeVito as a sleazy columnist.Had LA Confidential not come along in the same year as Titanic it might have won a few more Oscars including Best Picture which it lost to Titanic. Still the success of Crash, a film with similar structure and themes may redeem LA Confidential.Not that it needs much redemption because you won't be bored for an LA minute."
    },
    {
      "username": "redzon19",
      "userUrl": "https://www.imdb.com/user/ur20750063",
      "reviewLink": "https://www.imdb.com/review/rw2393044",
      "warningSpoilers": true,
      "date": "2 March 2011",
      "rate": "10",
      "helpful": "45 out of 51 found this helpful.",
      "title": "Rollo Tomasi, do you still remember?",
      "content": "\"Rollo Tomasi\" is a name that anyone had seen this movie should remember for the rest of his life or at least be aware of the existence of the name, because this is the key to the spirit of this whole story. Due to the setting of this clue, there is no doubt one great movie had become a classic! As a Taiwanese, I saw a lot of Hong Kong movies about police and gangsters while I was a child, and they were all very impressive. Therefore, the particularly genre has been promoted to such high levels in my mind that I can hardly be pleased. Fortunately, \"L.A. Confidential\" satisfies me not only with its thoughtful scenario, but also with several great actors' performances. More specifically, the story is not just about justice versus evil, there are also many elements such as passion, wisdom, greed, friendship and of course love which all made this movie more than fun to watch. In other words, you might feel angry at this moment, shocked latter, and finally moved by their insistence on doing the right things which made us believe there are still several police worth our trust.Guy Pearce was one big surprise in the movie not because he played the leading role of the movie, but for his courage and wisdom, and most important of all, his slightly pride that caused admiration accompanied by hostility at the same time. Because the complexity he showed, we couldn't help but be deeply attracted, and that's when we built connections with the character inside the frame. Secondly, Kevin Spacey was not the one who would gain our trust at first, but no one ought to disagree with his contribution after the shocked \"Rollo Tomasi\" scene. Likewise, Russell Crowe twisted his role impressions only after his cooperation with Guy Pearce, but he really needed to adjust his tempers for his own sake. Such a crew made this great movie never out-of-date, not even after similar stories keep brainwashing our minds.How lucky I am to see such a classical film. As a matter of fact, I haven't found one movie that reaches the same level as it did, at least not in the genre. Thus, I just have to repeat watching the film again and again, and I believe many people are doing the same thing I do."
    },
    {
      "username": "Bil-3",
      "userUrl": "https://www.imdb.com/user/ur0316001",
      "reviewLink": "https://www.imdb.com/review/rw0422708",
      "warningSpoilers": false,
      "date": "17 February 2000",
      "rate": "10",
      "helpful": "114 out of 160 found this helpful.",
      "title": "***** Best Film of the 90s",
      "content": "Hands-down my favourite American film of the nineties. Curtis Hanson shocked the world by proving to be not only a great director but an auteur with this unbeatable adaptation of James Ellroy's terrifying novel about corruption and crime among members of the LAPD in the 1950s. The hard-boiled detective story angle is brought to life so beautifully, mostly because Jeannine Claudia Oppewall's production design recreates the dark underside of the 50s to such perfection that not even a Coke bottle label is missed. Add to that Dante Spinotti's stunning lighting that rides the fine line between artistic and believable comfortably (as all period camerawork should), Ruth Myers' costume designing and a script by Hanson and The Postman scribe Brian Helgeland (I know, I don't get it either) that pares down Ellroy's mammoth plot about a multiple murder in a local diner involving a policeman with suspicious ties without sacrificing the density of the story or the spiderweb of events involved with it, and you have the best movie of 1997, not to mention the most fascinating detective film ever made since Orson Welles' Touch of Evil. The cast is all brilliant, most notably Kim Basinger as a wordly prostitute who has not only a heart of gold but a mind of steel--Basinger is so strong in her character's every nuance you'll find yourself forgetting she's even acting--and Kevin Spacey as a Dean Martin-esque detective who not only solves an important part of the puzzle, he even discovers he possesses a soul beneath his flashy suits. I just can't get enough of this film."
    },
    {
      "username": "trvpup",
      "userUrl": "https://www.imdb.com/user/ur4382695",
      "reviewLink": "https://www.imdb.com/review/rw1040254",
      "warningSpoilers": true,
      "date": "15 March 2005",
      "rate": "10",
      "helpful": "195 out of 230 found this helpful.",
      "title": "hard-hitting, smart movie",
      "content": "Although this movie 'flopped' at the box office at $53 million, this just may be one the smartest movies you haven't seen. With great performances from an ensemble all-star cast and a clever script, the dramatic tension of this modern film-noir classic is an absolute must-see! Told through a variation on the theme of \"good cop, bad cop\" with an overarching corruption angle, this film cleverly deals with issues of racism, social justice and ethics in a non-discriminatory manner. Character development is well-done and the dramatic tension is superb. If you are a fan of crime-drama and detective stories, you won't be disappointed!"
    },
    {
      "username": "Buzz-17",
      "userUrl": "https://www.imdb.com/user/ur0085230",
      "reviewLink": "https://www.imdb.com/review/rw0422879",
      "warningSpoilers": false,
      "date": "3 August 1998",
      "rate": "10",
      "helpful": "192 out of 233 found this helpful.",
      "title": "Will stand the test of time.........",
      "content": "When a film evokes an era as well as L.A. Confidential does, people take notice. It could be argued that it is easier to replicate the recent past than the distant on film, and in a sense this is true. Costumes, language, and the necessary absence of the modern in \"period pieces\" make them expensive and difficult to film. But couldn't it be argued that it is just as difficult to make a film about more recent periods? I have no knowledge of how a Victorian era table was set, or what a knight really spoke like; we are subject to the directors view of reality. But what if a good deal of your audience lived through the time you are portraying, as in the case of the 1950's? I can even envision my grandfather coming back from WW2 to a booming economy, and living in the world Curtis Hanson created.The real genus of this film is that it creates not only a physical world, but one with all the politics, corruption, racism and inequity of the time. As a result we feel the characters motivations and understand their faults all the better; Bud White, Ed Exley, Lynn Bracken and Lana Turner all live here. This film, like others that make us believe we are there for two hours (and $7.50), will endure. I was thinking a perfect double feature would be with Chinatown, another film that will stand the test of time."
    },
    {
      "username": "Sickfrog",
      "userUrl": "https://www.imdb.com/user/ur0019730",
      "reviewLink": "https://www.imdb.com/review/rw0422901",
      "warningSpoilers": true,
      "date": "14 August 1998",
      "rate": "10",
      "helpful": "67 out of 81 found this helpful.",
      "title": "The Best Film of 1997",
      "content": "Truly, one of the greatest mistake the Academy has made is not awarding this film the Best Picture award. For months, I argued that while \"Titanic\" was a nice spectacle with great special effects, the script, the directing and the acting was all rather mediocre. However, here we have \"L.A. Confidential.\" Perfection in script. Perfection in directing. Perfection in cast. Obviously, because Russell Crowe, Guy Pearce and Kevin Spacey all gave Oscar worthy performances, the voting was split, and therefore, none got enough votes for a nomination. Crowe gave an invigorating performance and Bud White, a man who knows that he is not very smart and has instead relied on pure brawn all his life. But as the film progresses, you watch him yearn to put his strength aside and become self-reliant, instead of being purely muscle for the cause of justice, which has become obscured as he has had to resort to violent and debatably immoral method to preserve peace in Los Angeles. And yet, while he does make us question whether he is going to end up on the side of good or evil by the end of the film uncertain, we do empathize enough with him to hope that he does redeem himself by the end. Pearce delivers Ed Exley as a man who is wholly set on the purest means of justice. While he follows his father into the same profession, his goals are unique; to uphold the law without having to bend or break it. And yet, his good aspiration are certainly out of place in the corrupt organization of the police of that time. He slowly becomes drawn into the graft. He becomes glory-hungry, pulling whatever strings he has to in order to be promoted or be seen in a good light by the press. And yet, he does begin to find himself giving into exactly the cause he fought against. And so, throughout the film, he struggles to overcome the instinctive nature of man to achieve power and glory. He has to be a better man than that. And so, the audience can quickly see the nobility in that. He is not perfect. But at least he tries to be. And probably the best performance in the film comes from Spacey. Here we see what Exley might have become in a few years if he wasn't careful. Jack Vincennes has succumb to the call of money and celebrity status. He does not care in the least about duty or about justice. It's all become simply a matter of vanity. And yet, he begins to see through his own fault. Spacey's performance is undoubtable the best, because he is one of those actors who doesn't have to try to communicate his emotions in order to communicate them (or, at least, he is good enough not to show the strings). I had to watch this film several times to really take in the impact of his role, and fully absorb his character. His key moments within the middle of the film are absolutely unforgettable. When he stares into the mirror of the bar after receiving the hundred dollar bill, that scene is a turning point for the character. And he was able to convey the message of that scene without saying a thing. And also, when asked why he became a cop, the delivery of that next line, just that, was Oscar worthy on its own. Even aside from those three performances, it would have been totally respectable if James Cromwell or Danny DeVito had received a nomination. Truly, this film had one of the greatest ensemble casts ever captured on screen."
    },
    {
      "username": "Giuseppe Giuseppe",
      "userUrl": "https://www.imdb.com/user/ur0568445",
      "reviewLink": "https://www.imdb.com/review/rw0422702",
      "warningSpoilers": false,
      "date": "11 January 2000",
      "rate": "10",
      "helpful": "497 out of 570 found this helpful.",
      "title": "Everything in this film is fantastic.",
      "content": "L.A. Confidential is, without a doubt, the best film of the 1990s, and quite possibly one of the best films ever made.As with any great film, it all starts with the writing. The story is riveting, the dialogue is smart and quite funny, and the characters are written in three dimensions.The acting is phenomenal. Perhaps a bigger tragedy than L.A. Confidential's loss to Titanic in the Best Picture race is that none of the three lead actors even garnered nominations. Russell Crowe, Guy Pearce, and Kevin Spacey are absolutely phenomenal; it is their characters that drive this fascinating story about police corruption in 1950s Los Angeles. We get to know these people, to understand who they are and why they do what they do, and to root for them to overcome their imperfections.The directing is fantastic. Curtis Hanson doesn't shove anything in the audience's face; instead, he allows the audience to discover the film's nuances on their own. (That makes this an excellent film for repeat viewings, you truly catch something new every time). 1950s Los Angeles is reproduced beautifully. The editing is quick and seamless, the music is perfect for the film (Hanson should teach other directors how to do a montage effectively), and the cinematography is great.I can't find a negative thing to say about this film. It's truly a masterpiece."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0422713",
      "warningSpoilers": true,
      "date": "20 December 2003",
      "rate": "",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Three Cops Who Changed Their Minds",
      "content": "SPOILERS...The story of three cops who changed their minds. Guy Pearce begins as a coldly manipulative cop interested mainly in promotions. He winds up sanctioning the use of brute force in order to obtain what passes for justice in this movie. Kevin Spacey is sort of \"affiliated\" with the LAPD but his chief interest is in being technical adviser on a \"Dragnet\" show and getting his picture in the L.A. Times. He discovers that he has a sense of responsibility when a sympathetic young bisexual is murdered on his watch. Russell Crowe is an apparently mindless brutal thug who finds that love has made him vulnerable and that the instrumentality of anger has its limits.Overall, it's an excellent film. The theme is similar to that of \"Chinatown,\" in which Jack Nicholson, a brittle but basically decent representative of objectivity and order, discovers corruption in high places. \"L. A. Confidential\" isn't \"Chinatown\" (what is?) but it brims with the same irony and sense of dis-ease, although our identification with a single isolated human being is dispersed over a trio of flawed cops.What a well-drawn flick. Curtis Hanson handles the direction competently, blessedly without the sort of dazzling special effects a viewer has come to expect from cop movies. There is plenty of action, but no car chases, exploding heads, or slow-motion deaths. In fact, all but two of the deaths take place offscreen. That's directorial bravery for you. Bring another Medal of Valor here.The performances are about as good as they come. Danny DeVito is a tabloid reporter who speaks in headlines, liable at any moment to say something like, \"What he needs is a snoot of coca-cola up the old schnozzola.\" (This is 1953, don't forget.) Kim Basinger is beautiful as a Veronica Lake lookalike but doesn't have too much of a chance to stretch her acting chops. Guy Pearce as the independent loner is the only character who gets my respect from beginning to end. He really BELIEVES in the cause, a hard charger, unfriendly though he may be. He also looks oddly like Arnold Schwarzenegger, especially odd since he was a body builder of sorts. I knew another body builder who was Schwarzenegger's body double in \"Raw Deal\" because he was a ringer. (Do all body builder have to look like Arnold Schwarzenegger? I mean, aside from their glutes?) Speaking of body builders, Russell Crowe gets a lot of screen time in a dark brown suit speckled with what looks like bird droppings, perhaps the ugliest suit ever committed to film, with shoulders as wide as the central span of the George Washington Bridge.Two of the performances are irreproachable. John Cromwell is the corrupt police captain. He plays the role chewing gum and exuding unpretentious Irish charm (\"Call me Dudley.\") while tempering the charm with what sounds like good-natured and sincere common sense advice. Underneath that, he's thoroughly rotten in every respect. And Kevin Spacey is perfect as the vain detective who knows his way around the show-biz part of L.A. and enjoys schmoozing with councilmen, celebrities, and the press. He's involved in the two most amusing scenes in the movie. The first involves an almost miraculous control of facial expression. He's called in for interrogation by his superiors and is asked to testify against some other officers. \"No,\" he says, \"I won't snitch on anyone in the department.\" They offer him no punishment more severe than a slap on the wrist and before he knows it, he'll be back on \"the show,\" which he loves. \"The show?\" he asks. There is a long long moment while his face sort of drifts from surprise, through disbelief, and into resignation. Then he figuratively shrugs his shoulders and says, without any deliberation, \"All right, I'll do it.\" The very model of a complete sellout. The other amusing scene is when he and Pearce accost a beautiful blond in a nightclub and sneer at her because she's a whore plastic-surgerized to look like Lana Turner. And Spacey informs Pearce to lay off, \"She IS Lana Turner.\" When they return to their car, both officers begin laughing.The photography is fine, the early 50s decor is what you'd expect from a professional job like this. There isn't much in the way of original music in the score -- hardly any in fact -- but period music is used, not overused, to good effect. (It's quality varies from Kay Starr to Cole Porter.) Extra Casting and Wardrobe even went to the trouble of making the actors playing Jerry Mulligan and Chet Baker LOOK LIKE Mulligan and Baker, although they cut Baker's recorded solo short on \"The Lady is a Tramp.\"The movie doesn't have a traditionally happy ending really. All values are gray, as they are in real life, rather than black and white. Pearce, the political animal, remains ambitious but now has distance enough from his role to see it for what it is. The same seems to be true for Crowe's character, who has found the love of a good woman. Well, the love of a woman anyway. Crowe still has a long way to go before reaching redemption. He's killed in cold blood a rapist and drug dealer and planted a gun on him and gotten away with it, but we've seen him look disgusted at some violence he's forced to witness later in the film. Vincennes is dead.This one is definitely worth seeing.Catch this, if you can."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2524418",
      "warningSpoilers": true,
      "date": "27 November 2011",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "\"Welcome to Los Angeles, the city of the future.\"",
      "content": "\"L.A. Confidential\" is the kind of gritty crime drama you can really sink your teeth into with compelling characters and a complex story that brings Los Angeles of the 1950's to life in a big way. You have to pay attention though, because there are a host of main players all vying for attention when they're on screen, and their stories intertwine involving hookers, a heroin racket, and corrupt cops all over the place. All of the principals are stand-out, so it's tough to single out any of the main players; all are on top of their game and convey their characters effectively. Guy Pearce looked like he might have been out of his league at the outset among actors like Kevin Spacey, Russell Crowe, James Cromwell and Kim Basinger, but his character grows throughout the story until he leads the final charge to take down the corrupt chief of detectives Dudley Smith (Cromwell). Comparisons to 1974's \"Chinatown\" are inevitable and are all over this board, so I won't dwell on the obvious. Of the two films, I'll take L.A. for it's even MORE intricate plotting and writing. The fictional Rollo Tomasi may have been inspired by the non-existent Keyser Soze, but since we knew that up front, we see it utilized as the hook Exley (Pearce) uses to put two and two together. All in all, this is a masterful film and one of the best that doesn't quite crack my Top Ten List, but it just misses ever so slightly. Maybe if it had been done in black and white."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3691505",
      "warningSpoilers": true,
      "date": "23 April 2017",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Sleaze and corruption in the City of Angels",
      "content": "It is the early 1950s and Los Angeles is a great city to live in; the police keep everybody safe and everybody has a chance of making their dreams come true at least that is the Hollywood version. The reality is less pleasant; cops are more than willing to rough up a suspect or plant evidence to secure a conviction and many who dream of becoming famous end up in vice. This story is centred around three detectives; Bud White, a man who is willing to get rough but won't tolerate those who hurt women; Ed Exley, an honest cop who would rather see a guilty man go free than break the rules; and Jack Vincennes, a celebrity cop who takes payment to make sure any newsworthy people getting arrested make the front page as well as working as an adviser for a popular police show. They end up working for a common purpose after a massacre in a local diner where one of the victims was a recently fired cop, White's ex-partner. Evidence points to a trio of black youths but evidence isn't always what it seems and the detectives soon start to believe they got the wrong people. As they dig deeper they uncover corruption in the LA Police Department, high end prostitutes who look like movie stars and the blackmail of city officials.This is a great thriller with a real noirish feel; it may be twenty years old but it still feels fresh thanks to the great performances from an ensemble cast of quality actors. The story has a grittiness to it as few of the characters are particularly pure and even those who are will have to bend the rules more than a little at times. There is a good central mystery concerning who is behind the killings and when the truth comes out it is neither too obvious nor too much of a surprise. There is a sense that our protagonists are in real danger as those who they should be able to trust are the very people who present the threat. Over the course of the film we learn about the characters backgrounds in a way that makes them more sympathetic; even some who initially come across as brutish or sleazy. I can't say I know that much about '50s LA, apart from what I've seen in movies, but this certainly feels authentic. Overall I'd certainly recommend this to fans of crime drama; it is a great example of the genre."
    },
    {
      "username": "K3nzit",
      "userUrl": "https://www.imdb.com/user/ur17108559",
      "reviewLink": "https://www.imdb.com/review/rw5361208",
      "warningSpoilers": false,
      "date": "28 December 2019",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Modern classic",
      "content": "Not only the best Neo-Noir film ever made, it's also a modern classic and one of my absolute favorite movies. Acting is particularly impressive and many of the actors do their careers best performances."
    }
  ],
  "errorMessage": ""
}