{
  "imDbId": "tt0032551",
  "title": "The Grapes of Wrath",
  "fullTitle": "The Grapes of Wrath (1940)",
  "type": "Movie",
  "year": "1940",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1487672",
      "warningSpoilers": false,
      "date": "1 October 2006",
      "rate": "10",
      "helpful": "101 out of 114 found this helpful.",
      "title": "Economic Dislocation",
      "content": "John Ford's film of John Steinbeck's novel has deservedly a classic film mirroring the views of both men and the times the book was written and filmed. Ford won his second Oscar for Best Director and Jane Darwell was the Best Supporting Actress of 1940.For most of America the Depression started with the stock market crash of 1929. But for the farmers it really began at the end of World War I. Those were good years for agriculture, the war in Europe was a boom for agriculture. But when farm prices dropped after the Armistice, a whole lot of family farms went belly up. Lots of people left the farms for the big city and industry jobs. The Depression years unhappily coincided with some of the worst drought ever seen in America.This is what many families like the Joads were facing in 1939 when the book was written. The banks had foreclosed on land that had withered to dust in any event. Folks like the Joads picked up and moved elsewhere, like California on a rumor of prosperity and jobs. America was still changing from an agricultural to an industrial society back then. That causes a lot of trouble for people unskilled in any industrial job training. As a country we're going through something similar today in many areas. We're moving from an industrial to an information based economy. Industry jobs are being lost to other nations and older and poorer workers are suffering for it. It's progress I guess, but it takes its toll.Some factory worker who has lost his job for any number of reasons can identify to some degree with the Joads, especially if they've lost a home they owned. For the Joads it was worse because they made their living off the land for many generations, identifying with it in a way that industrial workers could not.Henry Fonda got his first Oscar nomination for Tom Joad. To get the part which he knew he was so right for, he signed a studio contract with 20th Century Fox. That caused him many problems later on, but those are stories for another film review. Tom Joad is a midwest country kid, a whole lot like Fonda himself. Part of the story of The Grapes of Wrath is Tom himself trying to figure out why these economic forces are crushing him and his family and the way of life he's known. In the end when he leaves the Joad family and hits the open road, he's not got all the answers, but he's asking the questions. Tom hasn't figured it out, but a lot of people with many letters after their names haven't either. He only knows that he's got to get in the fight for economic justice.Jane Darwell was in films from the earliest silent films to Mary Poppins in 1965. This became her career part and the mother role of all time. She's what holds the Joad family together in good times and bad. That's what moms do and get little recognition for it. Except in this case by the Motion Picture Academy.John Carradine has his career part in this also. Another John Ford favorite, Carradine plays Casy the defrocked preacher who as he tells it disgraced himself with a female parishioner. After that preaching the gospel didn't seem quite right. When Fonda meets Carradine after Fonda's been released from prison, Carradine is asking a lot of questions about what is man's place in the metaphysical scheme of things. He's developing what we would now call situational ethics. Carradine's questions are on a higher plane, but he certainly inspires Fonda to ask for some answers himself.The Grapes of Wrath illustrates that at least government can give first aid in a crisis. After being in privately run agricultural camps where they're treated like less than dirt, the Joads happen upon a camp run by the Department of Agriculture where at least they're treated like humans. As it turns out, the Secretary of Agriculture was one Henry A. Wallace who was running for Vice President that year with Franklin D. Roosevelt. I'll bet any number of people saw The Grapes of Wrath and saw a message of support for FDR and the New Deal.Given some of the problems of the American economy today, The Grapes of Wrath though it appears dated isn't really all that much a relic of our past. It's both a timeless book and a timeless classic film."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0021724",
      "warningSpoilers": false,
      "date": "13 February 2001",
      "rate": "10",
      "helpful": "145 out of 162 found this helpful.",
      "title": "John Ford's stark portrayal of a poor family in the depression remains one of the most moving films in history.",
      "content": "The Grapes of Wrath is the story of the Joad family, who are run off of their land in Oklahoma because of drought and poverty. I think that one of the most striking elements of this movie is the black and white cinematography. Obviously, there wasn't a lot of variation on this particular subject in 1940, but especially today, the lack of color enhances the feelings of poverty and desperation and emptiness due to the family's loss of their home. In this way, because it would not be nearly as noticeable in 1940 as it is today, this time-enhanced effect of the black and white film stock has allowed for the film's impact to actually grow with time. Henry Fonda plays the part of Tom Joad, a young member of the family who is released from prison at the beginning of the film, only to find that his family has been driven from their home and is staying at his uncle's house until they can figure out what to do about their sudden homelessness. It is by pure coincidence that Tom was released early on good behavior, otherwise he may very well never have seen his family again. He finds them in a state of near desperation, as they begin more and more to realize the predicament that they are in. Their trek across half of the country, on their way to California to assume jobs that they've heard about, provides for a substantial portion of the plot and is extremely well-structured. The family encounters every hardship imaginable on this journey, from family members dying to their struggle to feed themselves to their rickety old truck constantly breaking down. They run into disillusioned people who claim that they've been to California and there are really no jobs there, at least not nearly as many as there are people going to look for them. They are periodically and derogatorily referred to as `Okies,' a term which places them in a broad category of poor folks driven from there homes in middle America who are traveling to the coast to get jobs that aren't there. There is so much doubt and hardship presented that it is never really certain whether they really will find jobs. The audience is never able to assume a happy ending, because there is so much contrary foreshadowing throughout the film. The struggles do not abate once the family reaches California and takes up shaky residence in residential areas that would be more accurately referred to as shanty towns, and the rest of the film is dominated by the family's efforts to survive in a new and unfamiliar place, while working for wages that are barely sufficient to prevent starvation. Ma Joad spends the majority of the film stressing the importance of keeping the family together, seeing it as the only thing that they really had left, but this is eventually set aside in favor of each member of the family not only surviving but also flourishing, which provides for one of the many powerful messages that the film delivers. The Grapes of Wrath is not exactly an edge of your seat film, but it is a shockingly realistic portrayal of the suffering that so many people and families experienced during the Great Depression. The performances are flawless, and the experience is not only powerful and moving but also educational. It's no secret that most people do not watch movies to learn, but there comes a point, at least once in a great while, when a person should watch a film that requires a little mental thought processing, and in such cases, The Grapes of Wrath is an excellent choice."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1288247",
      "warningSpoilers": false,
      "date": "10 February 2006",
      "rate": "9",
      "helpful": "73 out of 85 found this helpful.",
      "title": "Not the Book, But Beautiful in Its Own Right",
      "content": "It's difficult on a first viewing of \"The Grapes of Wrath\" not to be somewhat disappointed with it. So much of Steinbeck's beautiful novel is left out of the film, and it's hard to see his story and characters wedged into the \"gee whizz\" style of film-making so prevalent at the time. But once you get beyond a comparison of the movie to the book, you begin to realize that John Ford created a beautiful piece of work of his own, and the film inspires a great deal of admiration, and deserves credit for its gutsiness at tackling a story that wouldn't have gone down smoothly with film executives at the time.Of course the most controversial parts of the book are left out (like its final image, for example), but Ford still managed to work around the constraints forced upon him to fashion a hard-biting film. Henry Fonda is perfect casting for Tom Joad--never have his otherworldly eyes been used to greater effect. And Jane Darwell is pitch-perfect as Ma Joad--she captures the tough-as-nails dignity that the character has in the novel. The whole movie is lit by expert cinematographer Gregg Toland, who uses shadow and reflection to cast a ghostly pall over everything. Indeed, much of what Ford wasn't able to include in the film as words he communicates instead through images, and isn't that what a good book-to-film adaptation should do? One of those films that feels ahead of its time.Grade: A"
    },
    {
      "username": "inkblot11",
      "userUrl": "https://www.imdb.com/user/ur2444068",
      "reviewLink": "https://www.imdb.com/review/rw4131945",
      "warningSpoilers": false,
      "date": "16 April 2018",
      "rate": "10",
      "helpful": "14 out of 14 found this helpful.",
      "title": "Everyone should see Grapes of Wrath and be thankful for what they have!",
      "content": "In rural Oklahoma, Tom Joad (Henry Fonda) is walking and hitchhiking home from prison, after a stay of four years. After taking a knife at a dance, Tom hit the attacker with a pan, killing him. Nevermind that it was self-defense, Tom still gets sent to prison. He hasn't heard from his parents, Ma (Jane Darwell) or Pa because they aren't the \"writing types\". A fierce dust storm makes Tom's final few steps treacherous. Arriving back at their small cabin, where his family are sharecroppers, Tom and his passing friend, Casy (John Carradine) are startled to find no one at home. A shell-shocked neighbor informs the other two that the family has been kicked off their land in foreclosure. They are nearby at Uncle John's house, where his family is about to suffer the same fate. Its the Depression and the Dust Bowl has ruined the land, taking off the top soil; no one can grow crops. When Tom catches up with his Ma and company, they are overjoyed to see him, for their plans are to pack a truck and move to California, where handbills show pickers are needed. Grandpa doesn't want to leave the only home he has ever known, so they drug him with medicine and haul him along. Now on the Mother Road, route 66, the journey is difficult; the truck breaks down frequently, no one wants them to stay long anywhere they rest, and Grandpa dies of a stroke. Will California really be the Golden, Promised Land? NOT ON YOUR LIFE! This heartbreaking adaptation of Steinbeck's classic is a must-see for the whole wide world. This family of hard-working folks has one calamity after another, just trying to earn an honest and living wage. Those who lived in the Dust Bowl part of the country were hit especially hard, as the soil had been overworked and winds took the topsoil off, creating damaging storms to crops, humans, and animals. No better were the \"lies\" of the handbills, advertisements that migrants were needed in California, where over 300,000 poor helpless folks showed up for very few jobs. The cast, with Fonda at the helm, is wonderful as is the scenery, costumes, and careful direction to show the truth of a desperate situation. Wanna get down on your knees and thank the Lord for what you have, Americans? You will when you view this amazing film!"
    },
    {
      "username": "jluis1984",
      "userUrl": "https://www.imdb.com/user/ur4939636",
      "reviewLink": "https://www.imdb.com/review/rw1649217",
      "warningSpoilers": false,
      "date": "4 May 2007",
      "rate": "10",
      "helpful": "32 out of 37 found this helpful.",
      "title": "A masterpiece...",
      "content": "During most of the decade of the 30s, the United States lived under the shroud of the Great Depression, a decade of unemployment and high poverty that would changed the face of the country forever. While the entire country suffered the effects of the Depression, the inhabitants of the prairie lands had to face an extra difficulty: the Dust Bowl. The Dust Bowl was a terrible ecological disaster that destroyed many farms in the area of the Great Plains, and forced people to migrate looking for better working conditions. The difficulties and social problems that those migrants had to endure in this sad chapter of history became the inspiration for John Steinbeck's novel, \"The Grapes of Wrath\", a book that quickly became a classic due to its powerful depiction of the era. Soon after it's release, plans for a film adaptation began to be made, and the man who would bring the novel to the screen would be none other than John Ford.In \"The Grapes of Wrath\", Henry Fonda plays Tom Joad, a young man recently paroled from prison who is traveling to his family home in Oklahoma. When he arrives, he discovers that the farm is deserted and the only person he can find is Jim Casy (John Carradine), the former preacher of his community. Together they decide to go to the house of Tom's uncle John (Frank Darien) looking for the Joads, and it's there where they find them packing their belongings as they get ready to move. The Joads explain Tom that the bank has foreclosed their farm, and that they are moving to California looking for work and a better life. While he is not supposed to leave the state by the conditions of his parole, Tom decides to join his family and convinces Jim to go with them in the long and arduous trip to California. However, things won't be as easy as they thought they would.Adapted to the screen by Nunnally Johnson, \"The Grapes of Wrath\" takes on the spirit of John Steinbeck's novel and delivers a harsh, crude and very realistic portrayal of poverty during the Dust Bowl. Despite not being an exactly faithful adaptation of the novel (changes were done due to censorship), the movie remains true to that powerful and very human essence that the novel had, and it could be said that Johnson distilled the themes of the novel and made an unabashed story free of any political compromises. While this kind of stories often suffer literary embellishments, \"The Grapes of Wrath\" avoids stereotypes and shows humanity as it is, with all their vices and virtues. It is the excellent development of the main characters what gives that very human touch to the story, as it really shows a real understanding not only of Steinbeck's novel, but also of the real social situations that inspired the book.In 1939, John Ford was in one of the best periods of his career, having directed \"Stagecoach\", \"Young Mr. Lincoln\" and \"Drums Along the Mohawk\" in less than 12 months. \"The Grapes of Wrath\" would also be shot the same year, being the culminating work of that extraordinary series of masterpieces. While Ford was better known for his legendary westerns and larger-than-life heroes, \"The Grapes of Wrath\" was in many levels a very personal movie for him, so he basically took Steinbeck's novel and completely made the story his own. Framed by Gregg Toland's wonderful cinematography, Ford brings to life the Joads' story in a way that mixes his own style with a focus so realistic that almost feels like a documentary. Without excessive sentimentalism, Ford tells in this movie a very human tale of survival, so universal that could easily be related to any group of people migrating due to poverty.While Ford and Toland deserve a lot of the credit, the movie wouldn't be the same without the extraordinary performances of the cast. Leading the cast is Henry Fonda as Tom Joad, delivering one of his best works of acting in his portrayal of the young man. Considering his performance in Ford's \"Young Mr. Lincoln\", one could say that Fonda's career reached legendary status under Ford's direction. While Fonda's work is worthy of praise, two actors actually manage to overshadow him in this movie: Jane Darwell and John Carradine. As the idealist preacher Jim Casy, Carradine makes a terrific job in what's probably the story's most interesting character, completely embodying Casy's persona in an atypical role for him. Like Carradine, Jane Darwell makes a wonderful job (probably her finest) as Ma Joad, and without a doubt she truly deserved that Academy award she received for her performance.As written above, the movie has several considerable differences with the novel (specially the second half), so fans expecting a complete translation of the book will be a bit disappointed. However, Johnson and Ford did a wonderful job in the adaptation than while considerably different beasts, both the movie and the novel carry the same spirit and the message that Steinbeck tried to give in his book. Interestingly, producer Darryl F. Zanuck also saw the film as a personal project and certainly his involvement helped the movie to get away from censorship as most as possible. While the film has indeed some flaws (most famously the sudden and unexplained disappearance of a minor character), it's hard to diminish its value due to them, as the beauty of its craft is so big that they can be easily dismissed.With a haunting atmosphere, a beautiful visual composition, and superb performances by his actors, Ford created one of the first masterpieces of the 40s and one of the finest American movies ever made. While already a celebrated director by the time of its release, this movie consolidated Ford as a master of his craft. Despite their differences, John Ford's \"The Grapes of Wrath\" truly carries the spirit of Steinbeck's novel, as well as the ghost of Tom Joad. 10/10"
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw7531941",
      "warningSpoilers": false,
      "date": "9 November 2021",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Every family needs a character like Ma Joad, pragmatic and warm-spirited.",
      "content": "I first saw this in the early 90s. Revisited it recently with my kids.Surprisingly my kids enjoyed this movie tremendously.It is a simple but very powerful movie with top notch characters n mesmerizing performances.The three characters, Tom, Casy n Ma left an astounding effect on me when I was a kid.Till today I like these three characters a lot.The director succeeded in showing the plight of the poor farmers n migrant workers.Human survival is dependent upon the banding together of humans to find strength in group unity and action."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0021751",
      "warningSpoilers": false,
      "date": "8 June 2002",
      "rate": "",
      "helpful": "42 out of 56 found this helpful.",
      "title": "The First Great Film of a Great Decade for the Cinema.",
      "content": "\"The Grapes of Wrath\" was a huge novel so it only made sense to turn it into a feature motion picture. The result is one of the greatest films ever produced. Oscar-nominee Henry Fonda, his mother Jane Darwell (Oscar-winning) and their family have had it in the Dust Bowl. Thus they decide to leave the midwest of our nation's Great Depression and go to California. The film is an intensely dramatic affair that is first-rate in all cinematic departments. John Ford won his second Best Director Oscar with this movie and the landscape of the late-1920s and early-1930s has never been captured more fully. Excellent film-making. 5 stars out of 5."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3375705",
      "warningSpoilers": false,
      "date": "19 December 2015",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "A masterpiece",
      "content": "A masterpiece, based on John Steinbeck's classic Pulitzer Prize- winning novel. Captures the desperation, hopelessness and human suffering caused by the Great Depression better than any other movie. Surely one of the saddest, most depressing, movies ever made.Director John Ford pulls no punches. Other than the direct effects of the depression, the depiction of the lengths people go to to abuse the helplessness of other humans is shocking (and very probably true). Yet, among all the cynicism, there are acts of kindness and selflessness that leave you with hope for mankind.Henry Fonda is great as Tom Joad, and deserved his Best Actor Oscar nomination. Supporting cast are superb, with Jane Darwell (as Ma Joad), to the fore. Her Best Supporting Actress Oscar was well- deserved.A must-see, whether you've read the book or not. Realistic human drama at its best."
    },
    {
      "username": "Richie-67-485852",
      "userUrl": "https://www.imdb.com/user/ur26366719",
      "reviewLink": "https://www.imdb.com/review/rw3441569",
      "warningSpoilers": false,
      "date": "29 March 2016",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Down but not Out",
      "content": "Anytime you are tempted to feel down and out, watch this movie. I personally have seen it many times and are currently reading the book which I highly recommend. I cannot emphasize this enough. This is as down as you can get and still survive. We are taught to be grateful when watching this and to also consider the other guy, whoever he is and at the least, do not add to his burden. Actors are on their game as is the Director. Of course, none of this exists if it wasn't for John Steinbeck and his book. I thought about this movie during the recent Real Estate downturn and what the banks did in real life was indeed captured in this movie way back when. Indifferent, callous, and greedy while practicing their rights leaves one with a bad taste in the mouth and we bailed them out if that isn't the gall of galls. Have something to eat while watching to appreciate that you have food and the people in the movie do not, a tasty drink and a snack which is unheard of back during the depression days will help you connect more to the movie theme. There is humility, gratitude and lessons to be learned while being entertained. Its called a TEN thank you"
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0952431",
      "warningSpoilers": false,
      "date": "26 October 2004",
      "rate": "",
      "helpful": "25 out of 33 found this helpful.",
      "title": "Fine Cast & Production",
      "content": "This classic adaptation of \"The Grapes of Wrath\" features a fine cast as well as a skillful production headed by director John Ford. Henry Fonda and Jane Darwell are well-remembered for their roles, which are among the defining roles in their careers. The only limitations that it has come from the original novel, with its heartfelt but sometimes contrived story.Besides Fonda and Darwell, the supporting cast features plenty of good supporting players, including Charley Grapewin and John Carradine. All of them make their characters come alive believably. They also fit together well and complement one another's performances, which accentuates the themes involved in the struggles of the Joad family.For all that the Steinbeck novel is so revered, and for all that his story is an often compelling depiction of its characters, with whom many in the era could identify, it would have been better if it had not been so heavy-handed. Even given that the times were bad, more balance in the characters outside of the family, and in the Joads' experiences, would have made it an even better story. Certainly, this is barely even noticeable when compared with the stories in many present-day movies and novels, which often dispense with any attempts at plausibility.And that does not stop this adaptation from being a worthwhile and often moving film. Ford clearly appreciated the potential in the material, and he and the cast work together to make each character count, and to give meaning to each scene."
    },
    {
      "username": "jay4stein79-1",
      "userUrl": "https://www.imdb.com/user/ur4127036",
      "reviewLink": "https://www.imdb.com/review/rw1331541",
      "warningSpoilers": true,
      "date": "2 April 2006",
      "rate": "10",
      "helpful": "22 out of 26 found this helpful.",
      "title": "Wherever they're showing the Grapes of Wrath, that's where I'll be",
      "content": "Do I have your attention? Okay: Go out and watch this movie immediately because to not do so is, well, it's un-American. John Ford, with this nifty little film, made the greatest argument for populist/socialist politics in cinematic history. This movie understands the Depression and the Dust Bowl and the poor and the hungry and the starving and all those people that the sign at Ellis Island (or is it at the Statue of Liberty?) says that we'll take on and help. It understands those people better than anyone or anything else I know. Steinbeck's novel helps this movie get to where it needs to be, but, let's be honest, the Grapes of Wrath is all John Ford. The sweeping vistas, the excellent editing and pacing, and the acting are of the highest caliber, as befits a John Ford film. I'm amazed every time I see this movie just how moving it is without straying into trite sentimentality. Tom Joad's speech at the end always makes me cry--his chilly delivery of the word homicide at the beginning continues to give me a prickly spine. Fonda was a great actor, and he is certainly at the top of his game here. Without him, interestingly, the film would have probably floundered. No one else could have possibly played Tom Joad; no one would have that charm and charisma and, most importantly, that voice. The rest of the cast is amazing, don't misunderstand, but Henry Fonda is Henry Fonda--an actor unto himself. There is no one like him and never will there be; he is the single most watchable actor of all time. And this isn't even my favorite John Ford movie! Nevertheless, it's a great film with a great message. Call me a pinko (it's been done before), but what's superb about this movie is its humanism. Yeah, the ideology promotes a type of socialism (ahem, I mean, let's not forget that that is basically what the New Deal was and if you think that system was a bad idea, then fine), but, really, the movie is about caring for people who don't have the resources to care for themselves. Grapes of Wrath is not a scathing indictment of anyone; it's a simple portrait of a family's struggles to overcome the Depression. It's uplifting and shows a real feeling for the downtrodden, and that's more than you can say about most American films that intend to deal with the poor and hungry."
    },
    {
      "username": "gene-mcdaniel",
      "userUrl": "https://www.imdb.com/user/ur7335543",
      "reviewLink": "https://www.imdb.com/review/rw1226555",
      "warningSpoilers": false,
      "date": "28 November 2005",
      "rate": "10",
      "helpful": "356 out of 387 found this helpful.",
      "title": "My experience of living the movie, its so true to life",
      "content": "This movie is so real..at least to this person, who lived these things that happened in the movie. I will tell a short version of my personal life to let you know how it affected me from my own experience of growing up in the ThirtiesI think their must have been more then one car because ours was full of stuff in the back seat, clear up almost to the roof. Frankie, Bill and me (my brothers) all was on top of the stuff in the back seat, had to stay lying down was not enough room to set up. What I remember most about the trip was it was awful hot when we went through Arizona and we had not much water, the water we had was in a canvas bag, hooked to the front bumper to help keep it cool. We did not get much because dad was saving it for the car when the car got to hot. Mom told us to suck on pebbles, and we did. It was a bad time every where. No jobs or anyway to make any money. We were going to California because their was suppose to be some picking work their, after we got to California we saw miles of potatoes all loose piled up high my guess would be about six feet high, they had put lime or something that looked like lime it was a white powder to keep people from taking them to eat.We found a place to pick plums that they used to make prunes and we lived in a Quonset hut made of corrugated metal setting on a concrete slab. The public toilets were near were we stayed, Joe and his wife (Family friends)had their own Hut this was the time that dad & Joe would sell tickets for people to watch them box each other in a ring at the recreation hall on the property. Also they joined a baseball team and played baseball, dad played left field. We got to watch them play for free.Seems like Frankie and I played together a lot don't think Bill did because he was still a baby his self, Doris and Dorothy (my sisters) was still crawling so Bill could not have been very old at that time. Frank & I would go pick up plums off the ground and we would bring them home, Doris and Dorothy would set in the box and eat them. You can guess what they would look like when mom and dad got home, their was no air condition back then so they would take a hose and squirt water on the tin Quonset hut to try and cool it off some, I know when we went west we looked like those grapes of wrath folks in the movie.That area was the first time I ever saw a frog walk, it was to hot for them to hop, when they tried to hop their bellies would touch the ground ( gravel) and would burn them, any way that's what we thought at that time. I saw the movie of Grapes of wrath a long time ago, and I remember it so well, I cried most of the time it was on because it reminded me of the hard time we all had back then, I was born in Oklahoma and it was just a terrible time in the late thirties I would love to see the movie again, its to me a history of my family, I am 71 1/2 years old now and still remember it very clearly.Gene McDaniel"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3384859",
      "warningSpoilers": false,
      "date": "31 December 2015",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "American icon",
      "content": "Tom Joad (Henry Fonda) hitchhikes back to his family's farm in Oklahoma after getting released from prison. He finds his family gone after the landowner kicked out all the small farmers moving in the bulldozers and tractors. He and ex-preacher Jim Casy (John Carradine) go to his uncle John's place. The Joad family decides to travel to California. It's a long arduous journey.This John Ford epic is an American classic. It has some funny moments, tough social injustices and loads of heart-breaking stories. Ford delivers some beautiful destitution. It is more the human story that is so powerful. Henry Fonda does a great everyman which allows the audience to feel for the family right away."
    },
    {
      "username": "RHKLWK",
      "userUrl": "https://www.imdb.com/user/ur1665795",
      "reviewLink": "https://www.imdb.com/review/rw0021721",
      "warningSpoilers": false,
      "date": "18 May 2002",
      "rate": "10",
      "helpful": "74 out of 95 found this helpful.",
      "title": "A Triumph in Record Time",
      "content": "They say that you should wait 20 or 30 years before attempting to capture an historical event on film. That is why it was remarkable that Oliver Stone was able to capture the \"feel\" of Viet Nam (in \"Platoon\") so soon (13 years) after America's withdrawal. Usually, an honest perspective takes more time to develop.But, when you consider that John Steinbeck and John Ford needed less than ten years to bring the 1932 \"dust bowl\" to life, you really have to admire their magnificent achievement. Of course, in 1940, Ford could not film much of the graphic squalor described in the novel. For example, the film cannot show a starving hobo suckling at the breast of a young Rose of Sharon, who has milk to spare following the death of her baby. But, far from degradation, Rose of Sharon's gesture is a reflection of the goodness that resides within her, and that quality is well illustrated in the character development seen on the screen. Tom Joad may be an ex-con, but he is a good man. One of the commentaries (below) uses this film to rant about the exploitation in today's society. That completely misses the point. Ford, who was as conservative as anyone in Hollywood, even more conservative than John Wayne, used this movie to show that Man can triumph, despite the natural and human barriers that are put in his way. This is ultimately a movie about hope and the human spirit."
    },
    {
      "username": "willwoodmill",
      "userUrl": "https://www.imdb.com/user/ur50907007",
      "reviewLink": "https://www.imdb.com/review/rw3422173",
      "warningSpoilers": false,
      "date": "26 February 2016",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "The definitive Great Depression film",
      "content": "Classic Hollywood films that tried to tackle important issues or answer big questions, typically were cheesy and hard to take seriously. They had gratuitous overacting, fake \"Hollywood\" dialogue, and just general over dramatization. Since these films are typically over-dramatized in this way, their attempts at having a deeper or meaning or some sort of a message are ruined. But not all classic Hollywood films fall into this abyss of clichés. And the ones that don't are still remembered and cherished to this very day, films like Mr. Smith Goes To Washington, or Modern Times, or 12 Angry Men, faced serious social issues at the time and succeeded. Films like these are unforgettable and in many ways life changing, and John Ford's Grapes of Wrath is one of these precious films.As I'm sure you all already know Grapes of Wrath is an adaptation of the John Steinbeck Pulitzer Prize winning novel of the same name, that was published only a year before the film was first released. The novel is one of the greatest of the 20th Century, and I highly recommend that you should check it out. The film and the novel are both about Tom Joad, (played by Henry Fonda, who collaborated with John Ford several times.) who returns to his family's home in Oklahoma after spending 4 years in prison, but unfortunately by the time Tom Joad makes it out of prison, the country has fallen into the Great Depression. And the Joad family were unfortunately sharecroppers, so of course the bank repossessed there home and land, and the Joad family are forced to head west to California to look for work. But as they get closer and closer to California things begin to seem hopeless as they learn the truth about what is going on out in the west. If I were to choose one word to describe The Grapes of Wrath it would be haunting, so many scenes and lines of dialogue send shivers down your spine and make tears grow in the back of your eyes. I won't spoil any of these fantastic moments, but dear god the combination of John Steinbeck's masterful writing and the actors's somber performances combine to make these scenes and lines of dialogues absolutely devastating, you will be thinking about them for weeks after you watch the film. The cinematography (done by the legendary Gregg Toland, who also was the cinematographer for Citizen Kane.) is also outstanding. Shots of the deserted houses in Oklahoma, the wide open road on highway 66, and the overcrowded filthy slums of California, all give The Grapes of Wrath a bleak depressing atmosphere. Every single actor in the film gives it his/her all, Jane Darwell won the Oscar for best supporting actress for her role as Ma Joad, and Henry Fonda was nominated for best leading actor. And while these two performances are just perfect, every single roll in the film no matter how small is also perfect. (well, except for some minor child-actor roles.) John Ford is an excellent actor director though, so this should come as no surprise. John Ford also won the Oscar for best director, this was his second Oscar (his first was for The Informer.) and it is well deserved, each scene is meticulously crafted to dig real deep into the audiences emotions and not in a way that feels cheap by exploiting the audience or something. No instead of going for cheap shallow emotions the way an Oscar-bait movie would, Grapes of Wrath instead has characters that don't even feel like characters that are going through actual struggles, there is no cheap manipulation in this film. It is 100% genuine.John Ford was a strange person for 20th century fox to pick to direct The Grapes of Wrath, because he was politically conservative and the book/film supported several liberal political ideas like strikes and unions. But John Ford was definitely the right choice. (see what I did there.) Grapes of Wrath was one of the few American films that was allowed to be released in the Soviet Union,it was only allowed because it supported pro-communist ideas. But it eventually had to be pulled from The Soviet Union when Soviet audiences saw that even dirt-poor begging Americans could still afford cars. In 1989 The Grapes of Wrath was one of the first 25 films to be added to the national film registry, alongside films like Citizen Kane, Vertigo, and Casablanca. And it deserves its spot there, Grapes of Wrath has become the definitive Great Depression film, and should be viewed by everyone.9.5/10"
    },
    {
      "username": "LeonLouisRicci",
      "userUrl": "https://www.imdb.com/user/ur33374263",
      "reviewLink": "https://www.imdb.com/review/rw3822271",
      "warningSpoilers": false,
      "date": "4 October 2017",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "\"...I'll be there.\" (Tom Joad)......\"We'll go on forever, Pa...cos we're the People.\"",
      "content": "Arguably Director John Ford's Greatest Film, although some might say \"The Searchers\" (1956) or \"My Darling Clementine\" (1946).But there is No Doubt that this Film Resonates and Captivates with its Story of the Depression's Devastating Effect on a \"Salt of the Earth\" Sharecropper Family with Multi-Generational Roots Planted in the Now Fallow \"Dust Bowl\".Along with the Personal Hardships the Movie makes much of the Social Separation and Income Inequality of the Time.There are the Compassion-Less Bankers and Their Minions of Law Enforcement and \"Tin Badge\" Thugs. Socialism/Communism was seen as an Alternative to the Punishing Poverty and Vanishing Opportunities by some and a Threat to Capitalism by the Capitalists.This is a Solid Background to the Story but Not the Backbone. The Skeletal Structure of the Movie, from John Steinbeck's Pulitzer Prize Winning Novel, is the Joad Family.Impeccably Acted by Henry Fonda (Tom Joad), Ma (Jane Darwell), and X-Preacher Casey (John Carradine), with Support from Charlie Grapewin (Grandpa), and John Qualen (Muley). The Remainder of the Strong Ensemble of Acting all do Excellent Work and the overall Verisimilitude of the Film is Striking.Gregg Toland's Haunting and Beautiful Cinematography Captures the Mood of Melancholy and the Film as a Whole is Widely Considered one of the Great Films.Some Film-Scholars even Rank it \"The Greatest\". This of course is Obviously Objective, but suffice to say it is always a Contender when the Category of \"Best\" or \"Greatest\" arises. This is a Futile Exercise, but Fun.Powerful, Unforgettable, and Ultimately a Cinematic Experience so Profound with its Realistic Dramatics that the Viewer is Likely to Feel attached to the Story and can Claim to have a \"Little Piece\" of a Big Picture."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw2689839",
      "warningSpoilers": true,
      "date": "17 October 2012",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Tom Joad will be there and so will this movie for you",
      "content": "I'm will be there—to review John Steinbeck and his great American novel, The Grapes of Wrath, about the westward migration of people during the dust bowl in the Depression of the 1930's. It was a huge hit in 1940, and soon it was turn into a movie directed by John Ford. The film stars Henry Fonda as Tom Joads, the incredible Jane Darwell as his mother. The film stands today as one of the finest examples of sensitive American cinema. It is an incredible combination of gut-wrenching scenes threaded through feel-good scenes that make you laugh and then sob. The movie is about The Joads family. They were destitute by faceless, corporative banks that seized their lands just when Tom Joad (Henry Fonda) got out of prison. Forced out of their farm, the Joads are heading from the dust towns of Oklahoma to California for hope of a job. As aggressively coaxing is needed to acquire Grandpa Joad (Charley Grapewin) from leaving his abode, while the family meek existence is depended on the nurturing of Ma Joad (Jane Darwell) who's strong upbringing sturdily holds them together. When the family arrives upon destination, they harbor terrible living conditions and given low wages in the migrant-worker camps. Hot tempered Tom Joad eventually collides with the wrong side of the law, as he is cornered to leave his family behind. A documented-style production in which seasoned pioneer John Ford received an Academy Award for his appraised directing. The Joads suffers much, and struggle in times of adversity. The visuals of the film, was outstanding. The desolation of the land and the desperation of the people were depicted very well. It does have an uplifting message despite its gloom. A black and white cinematography that would inspire Ansel Adams. Tom Joad's speech is very powerful, and makes you appreciate every meal you have. The idea of the interpretation of the film is that despite being in hard times, the Joads gave to others. Letting others stay with them, helping out others, giving away their food. The faults of the film are these it's really heavy, slow tempo, long, and the Okie accent and dialect is hard to understand. Some harsh language in the book that wouldn't have been allowed in mainstream movies of that time is left out from the movie. The production codes did not allow for the shocking scene of a woman breast feeding a starving man that ends the book. In the book more detail is given about Tom Joad's older brother Noah. In the movie he's hardly featured at all, and in fact completely disappears from the latter part of the film with no explanation given as to where he went. The big difference between the movie and the novel is that the movie goes uphill while the novel goes entirely downhill. This makes all the difference. The uphill fashion of the film version fails to provide closure. For example, it lacks the powerful ending of the book, which I will not spoil. Anyways, this film and book should be read and view in EVERY school to show how lucky we are today and don't appreciated it with our many luxuries our money buys today. It doesn't belong 2 a particular era or country. It's the story of the struggles of humanity."
    },
    {
      "username": "bellabanana93",
      "userUrl": "https://www.imdb.com/user/ur51324774",
      "reviewLink": "https://www.imdb.com/review/rw3836510",
      "warningSpoilers": false,
      "date": "20 October 2017",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "One Of The Best Films Ever Made!",
      "content": "The Grapes of Wrath (1940) is a Drama History film in black and white starring Henry Fonda as Tom Joad. The film follows a poor Midwestern family during the depression who are being forced off their land. After being released from jail, Tom returns home to find it abandoned. He learns that the land is no longer producing enough crops to provide for their family and the whole family heads to California to look for work. The best parts of the film are the acting, the plot, and the cinematography. The acting and casting are excellent. The entire cast is full of life and they deliver their lines with perfect execution. When Tom Joad returns home to see his family, they are all lit up and full of smiles. You are able to see the happiness and utter joy that they are feeling to be reunited with a family member and you can sense the fear and anxiety that they are feeling regarding their upcoming move.The plot is riveting. Rarely do you see a historical film that is as much of a work of art as The Grapes of Wrath is. The story will take you into the Great Depression years ago and give you a glimpse at what a poor family during that time might have gone through. The timing of the script is great and will have you hoping for the main characters to be able to keep their home some way or at least find a nicer one. The plot allows for many emotional performances.The cinematography is excellent and professional. It proves that not only the cast and actors were perfect for the jobs, but the crew must have been as well. There are no shaky shots and there are no scenes where something is out of view that should be able to be seen by the camera and there are no scenes that were too zoomed in that you couldn't see anything. The camera pans between characters based on who is talking.I would recommend this film to anybody who enjoys drama movies or anybody who is interested in history. Although this film is long (over 2 hours), there are no boring or dull parts in the film and it is definitely worth taking the time to watch it. Also, this film was made in the early 40s and it is in black and white. Even if you usually don't like or watch black and white films, I would recommend that you watch The Grapes of Wrath. This would also be an excellent film to show in history class when teaching about The Great Depression.The Grapes of Wrath is an excellent classic film that I would recommend to anyone regardless of whether or not they enjoy old films or black and white films. This film is worth the 2 hours that is takes to watch it because the acting, plot, and cinematography are phenomenal. The emotional scenes were executed to perfection and will leave you feeling sorry for the characters. The plot will have you interested in the beginning and the cinematography makes it easy to understand and see what is going on in the film. Overall this is an excellent film and deserves 10/10 stars."
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw5639715",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Joads On The Road",
      "content": "In which John Ford holds up John Steinbeck's black mirror to America at the end of a decade which started with the Stock Market Crash, continued with the Great Depression and ended with the nation contemplating its world position as Europe entered into war. The question posed by Steinbeck, amplified elegantly here by Ford, is what happens to the little people, the working class, indeed the underclass who get squeezed the most when the checks and balances in society break down. It's also about how fickle human nature becomes when the haves indeed have power over the have-nots and how cheaply some people can sell their humanity to maintain that superiority.The story is naturally episodic but the simple journey that the Joad family has to undertake to the much heralded promised land of California after being evicted from their land by the bank gives the movie a natural flow, although with this tale there are many more ebbs for the family to endure.My criticism of other Ford films has sometimes been the sentimentality and forced masculine humour he frequently inserts but there's no room for either of these traits here. The nearest we get to one of his familiar tropes is the weekend dance at the \"clean\" government camp at which the Joads eventually arrive and are for the first time treated humanely by the staff, but even amongst the high spirits there's danger in the wings as the state troopers seek to gatecrash the party to make an arrest.While there are twelve in the extended family which first hits the road, there are only eight of them alive by the time they reach the relative safe haven at the end as the elderly grandfather and grandmother expire on the journey and two others drop out. The main characters though are Henry Fonda's Tom Joad, the family matriarch Ma Joad played by Joan Darwell and the idealistic lapsed preacher Cristy, played by John Carradine. They each come to very different ends but the film does at least conclude on a vaguely optimistic note with stirring speeches of defiance and even hope by Fonda and Darwell, both of which in fact were interpreted by the soon to be all-powerful House Un-American Activities Committee as evidence of a Communist propaganda subtext.Oscar-nominated Fonda is excellent as the combative, already road-hardened Tom, just released from jail for killing a man, who soon becomes the head of the family and so supersedes his father and his father in the hierarchy. Darwell won the Oscar as the Mother Earth character whose indomitable spirit drives the family on while Carradine memorably portrays a man who has lost his faith and who now channels his energies into human rebellion.Ford (and screenwriter Nunnally Johnston), even if he does bend to the box-office by editing and tweaking events in the book to afford at least a smidgeon of optimism at the end, treats the text in a starkly realistic almost quasi-documentary style as befits the seriousness of the subject matter, aided in this by the masterful black and white photography of the acclaimed Greg Toland. The sense of abject poverty is manifest in the way Ford and Toland frame their cast's often gaunt portraits against dark skies and blasted landscapes.This classic movie is a literary adaptation, history lesson and cry for social reform all rolled into one."
    },
    {
      "username": "29055",
      "userUrl": "https://www.imdb.com/user/ur0185254",
      "reviewLink": "https://www.imdb.com/review/rw0021716",
      "warningSpoilers": false,
      "date": "5 January 1999",
      "rate": "10",
      "helpful": "90 out of 106 found this helpful.",
      "title": "A marvellous production of Steinbeck's epic.",
      "content": "Henry Fonda's portrayal of Tom Joad captures perfectly the humanity and compassion of the Steinbeck character, an ex-con who breaks his parole conditions by joining his family in their epic journey across the southern US to a \"better life\" in California.This is not the usual Hollywood fare. Tragedy and betrayal beset the Joad family from the outset. But it is nonetheless an uplifting movie. Spirit, compassion and tenderness mark them out. Fonda's role is particularly understated, and we see, as in Steinbeck's masterly epic, the maternally robust figure of Ma holding the family together.The performances all round are wonderful, and Ford's direction and sense of space under the big sky of the Midwest is breathtaking.This film is now largely a testament to the time in which it was set, but like the war movies that were soon to follow, a story that needed telling lest we forget."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0021720",
      "warningSpoilers": true,
      "date": "16 September 2000",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "People That Live",
      "content": "The movie itself is generally recognized as about as good (or great) as you can get, especially considering that it was shot in 33 days. But it often gets nailed for two scenes, one absent from the film, the other changed drastically. No Rosasharn is not seen in the film nursing the dying old man from her swollen breast. If the scene had been shot in 1939 (or even suggested), the movie would never have been released. The second problem often pointed out is that the ending is too upbeat, what with Ma Joad's carrying on about how men live their lives in jerks while women flow along like Anna Livia Plurabelle, and \"we're the people that live.\" That last scene was written by Zanuck and was almost essential to a successful film in the late 1930s. Of course tragedies had been filmed for years, but ordinarily the tragic hero or heroine had earned his or her fate. Both audiences and authorities would have waxed wroth seeing an honest close-knit family crushed by an American economy that was totally inimical to their welfare. We need to look at art in the context of its time.From the Marxist perspective that Steinbeck used in writing the novel, Tom Joad (Henry Fonda) is the protagonist but the two most important characters are Ma Joad (Jane Darwell) and Casey the Preacher (John Carradine). Ma represents what Marx called \"false consciousness,\" the tendency to attribute our misery to our own flaws, to bad luck, or God's will. Ma Joad's solution is retrograde -- to hold the \"fambly\" together. Casey, on the other hand, discovers \"class consciousness.\" It's not our fault. The flaw is systemic, and the solution lies in correcting the inequities in the system. Our allegiance has to transcend groups like the family and embrace all the exploited workers. The film endorses not Marx's revolution but a milder form of socialism -- the government-run labor camp with its democratic \"sanitary units\", and the emerging union movement with its collective bargaining. Steinbeck's polemic is more acid. The novel has a reference to the extremely wealthy William Randolph Hearst (better known as Charles Foster Kane) who is described as have \"a mean face and a mouth like a a**hole.\" There aren't many references to communism either in the novel or the film, just a few remarks about \"Who is these Reds, anyways?\" Still pretty bold stuff for the 1930s with the public in one of its periodic Bolshevik scares!No need for anxiety, though. By the late 1930s the Great Depression was easing up, and World War II was about to bring it to an end. Bakersfield now looks as if Tom Joad had made a successful escape and decided to open a chain of organic food stores. This is a marvelous film. To single out just one shot, note when the Joads drive through the first starving Hooverville. The camera is mounted on the front of the old truck and travels slowly, without any cuts or dialog, through groups of wary, singularly ratty looking people, men and women, young and old, some resembling photos of criminals from old Police Gazettes, who \"don't look none too prosperous.\" If nothing else, the film is a valuable corrective to the current view that people are poor because they're lazy. How did one third of a nation become so terribly lazy in the years following the 1929 stock market crash?"
    },
    {
      "username": "mmallon4",
      "userUrl": "https://www.imdb.com/user/ur55846361",
      "reviewLink": "https://www.imdb.com/review/rw4383869",
      "warningSpoilers": false,
      "date": "7 October 2018",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "California, Super Cool To The Homeless",
      "content": "The Grapes of Wrath was impressively released less than a year following the release of the novel and yet within this short timeframe director John Ford crafted one of the greatest motion pictures ever made. A number of John Ford's movies have that foreign film feel - a feeling of very raw, lifelike emotion. The Grapes of Warth itself is one of the most emotionally draining films of all time with one scene after another drawing up such feelings of pity; everything is rough, dirty nor is there makeup on any of the actors. Just take the scene in which the depression-ridden Joad family on their way to California attempt to buy bread from a dinner (a scene which really puts the value of money in perspective) - The emotion is one part humility and the other part pathetic.Yokels, rednecks, hillbillies - everyone's favourite punching bag. The Grapes of Wrath doesn't look down America's uneducated, rural white folk nor presents them as a caricature but that still doesn't change the fact that none of the Joad clan are the sharpest tools in the shed nor don't understand how the outside world works. Just as we are introduced to the family the youngest daughter Rosasharn is pregnant and married when still a teen while the family is dirt poor and huge as it is.Henry Fonda's performance as Tom Joad may be the pinnacle of his acting career. His stone face alongside the laid-back manner in which he walked and talked is mesmerising yet Joad is not someone I would fancy being in the vicinity off. Fonda's performance has a sinister edge to it and a sense of barely restrained violence. His proclamation to the truck driver near the beginning of the film when telling him the reason he was in prison, a simple uttering of \"homicide\" could come straight out of a horror movie. Jane Darwell on the other hand as Ma Joad is the other great scene stealer with her hauntingly sombre, tour-de-force performance as a character with one ultimate aim - keeping the fambly together.The amazing landscape shots, use of German expressionism and high contrast lighting give way for such unforgettable images from a car light driving along the horizon to silhouettes walking across a hill, thanks to cinematographer Gregg Toland. Take the scene at the campsite in which the characters discuss their present situation; it's so dreamlike with the odd, unnatural angles, it couldn't be more mesmerising. I also recommend watching the South Park episode Over Logging which parodies this scene (and the movie as a whole), right down to the black & white cinematography.Once the Joads arrive at the Farmworkers' Wheat Patch run by the Department of Agriculture it is a temporary relief to see something good happen to the family, after all, they have been through. When The Grapes of Wrath was released in 1940, the US Secretary of Agriculture was Henry A. Wallace, whom that same year was running for Vice President with Franklin D. Roosevelt; a message of support for FDR and the New Deal no doubt? At the government camp they are greeted by a seemingly genuine, honest man who looks like FDR and tells them they have washtubs with running water; a world away from the corporate run camps the Joads took residence earlier in the film - all sounds too good to be true? The government is the solution to the Joad's problems (temporally at least as they end up leaving at a later point), nor at any point in the film do we see any charitable organisations out to help the poor. It's fairly obvious that The Grapes of Wrath doesn't exactly lean to the right of politics; evil bankers running people off their land, corrupt police, capitalists treating people like dogs, total collapse of the free market, socialist camp run by the government is only decent place to be in which cops are not allowed to lines of dialogue such as \"people are going to win rich, people are going to die\". - A world of oppressor and the oppressed if there ever existed one. Regardless of one's politics, I still contend The Grapes of Wrath to be one of the most emotionally draining films in all of cinema."
    },
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw0021763",
      "warningSpoilers": false,
      "date": "6 October 2003",
      "rate": "8",
      "helpful": "17 out of 27 found this helpful.",
      "title": "The most important word you'll ever hear : Family !!!",
      "content": "Wow...this movie is just WOW !! I've been wanting to see it for such a long time but I never got the chance. Now, I finally did and it even goes beyond my highest expectations... I was prepared to see some class-A drama but everything what this family goes through is even worse than I thought. This famous movie milestone goes about the Joad family. They have to leave everything they own in Oklahoma behind. Them and several other poor families are attracted by California because there is supposed to be work and a place to live. The long trip is filled with misery and when they finally get in California, it seems that they've been deceived once more. There's almost no food and 8 hungry mouths to fill. It's impossible not to get touched by the Joad family. All the characters are so sad but at the same time so brave. They don't give up and keep fighting...you just have to encourage them while watching this film. The Grapes of Wrath really makes you feel happy you live in this era and in this part of the world. You know stories like this really happened in the old days and they still do in some parts of the world. This kind of film is excellent to make you realize you have nothing to complain about.The dramatic highlights in this motion picture are countless : The flashbacks about how families are driven away from their homes, the grandfather's \"funeral\" , the mother and son conversation near the end... All these scenes and several other ones are indicators of great drama and brilliant cinema. The Grapes of Wrath received several prices and nominations and it deserved every single one of them. Every element in it is flawless. Henry Fonda's portrayal of Tom Joad is one of the most intriguing characters ever shown of the screen. He's absolutely brilliant. The highest possible recommendation isn't yet high enough to describe The Grapes of Wrath...If you ever have the chance: SEE IT !"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw5485302",
      "warningSpoilers": false,
      "date": "15 February 2020",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Timeless classic movie about unfortunate farmer's migration from the Dustbowl to the California eden",
      "content": "Atmospheric though downbeat story of a migratory family , the impoverished Jaid , their stuggle to reach California after leaving their Oklahoma dustbowls home and the distresses as well as misfortunes that befall them when they arrive at their destination.Along the way the family struggles to maintain at least a little of their valour , pride and dignity .The Oakies were unwelcome in California , due to they threatened the jobs of the locals . As the brutal police harassed and hassled the emigrants that formed Unions in self-defence and struck for decent fruit- picking wages.This inevitably multiplied the official violence against the newcomers .A sentimental but enjoyable and dignified epic about a peculiar family that emigrates and suffers famine, despair , starvation and nasty harassment . Dealing with consequences of Great Depression , concerning an impoverished family and giving noteworthy portrayals of some intersting characters. Full of memorable moments, the picture gets excellent acting from Henry Fonda , Jane Darwell, among others . The great Henry Fonda is supported by a great secondary cast as Russell Simpson , John Qualen , Charles Grapewin , Eddie Quillan , Frank Sully , Dorris Bowdon, Grant Michell, War Bond and several others .Special mention for Jane Darwell as the mother of the family, she won deservedly an Academy Award.It contains a sensitive and emotive musical score by Alfred Newman . And evocative cinematography in black and white by Gregg Toland that captures the stark plainness of the outdoors . This uncharacteristic Hollywood picture was competently directed by John Ford . Classy filmmaker Ford also took an Academy Award for his moving handling of the vintage Steinbeck novel , including a sensitive and stirring ending . Ford directed a lot of masterpieces as Stagecoach, How green was my valley, My darling Clementine, The Quiet Man, Rio Grande, Fort Apache, Wagon master, The man who shot Liberty Valance, Searchers and many others. Rating 7.5/10 .This movie has haunted moviegoers down the years ."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1656542",
      "warningSpoilers": false,
      "date": "15 May 2007",
      "rate": "8",
      "helpful": "15 out of 28 found this helpful.",
      "title": "While a tad too sentimental and not always accurate historically, it's a very impressive and heart-rending film",
      "content": "This is an extremely sentimental and worthwhile film that fans of Hollywood's Golden Age should see at least once. While I don't think it's director John Ford's best film (I preferred HOW GREEN WAS MY VALLEY, THE QUIET MAN and FORT APACHE), it is superb and well-crafted. Some of the acting (in particular Jane Darwell as \"Ma\") was terrific and very realistic, while occasionally it was a bit over the top (John Carradine as \"the Preacher\"). And the story itself was excellent and well-constructed--making an emotional and heart-felt appeal for justice and a more Socialist nation in response to the poverty of the Great Depression. You can't help but be sucked into the pitiful yet somehow hopeful lives of the Joad family. While some of the facts were definitely exaggerated in order to make this point (making it a one-dimensional fight between good and evil), the overall message of upheaval and loss was important and potent.I am a history teacher and so naturally I gravitate to films like THE GRAPES OF WRATH. It is an amazingly powerful film that is extremely touching and lovingly made--though historically, some of the film is pretty much fiction. While most web sites I checked praised the book, one presents a thoughtful and documented analysis of the actual Okie experience and compares it to the book and movie--coming up with many ways in which THE GRAPES OF WRATH isn't a totally accurate portrait of the times. Some examples cited were the general success the \"Okies\" had when they arrived in California, that the exodus to California from most of America PRE-DATED the Dust Bowl years and the Dust Bowl itself had very little actual impact on Oklahoma (though it DID affect Kansas and some other states considerably). This isn't to say that the film is completely fiction or it was a bad book or that Steinbeck was a Communist, but that Steinbeck wasn't always careful in his research and seemed to stretch facts to make his social and political statement. See for yourself--it makes interesting reading at: http://www.newcriterion.com/archive/20/jun02/steinbeck.htm"
    }
  ],
  "errorMessage": ""
}