{
  "imDbId": "tt0032551",
  "title": "The Grapes of Wrath",
  "fullTitle": "The Grapes of Wrath (1940)",
  "type": "Movie",
  "year": "1940",
  "language": "en",
  "titleInLanguage": "The Grapes of Wrath (film)",
  "url": "https://en.wikipedia.org/wiki/The_Grapes_of_Wrath_(film)",
  "plotShort": {
    "plainText": "The Grapes of Wrath is a 1940 American drama film directed by John Ford. It was based on John Steinbeck's 1939 Pulitzer Prize-winning novel of the same name. The screenplay was written by Nunnally Johnson and the executive producer was Darryl F. Zanuck.\r\nThe film tells the story of the Joads, an Oklahoma family of sharecroppers, who, after losing their farm to increased mechanization during the Great Depression in the 1930s, become migrant workers, and end up in California. The motion picture details their arduous journey across the United States as they travel to California in search of work and opportunities for the family members, and features cinematography by Gregg Toland.\r\nThe film is widely considered to be one of the greatest films of all time. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>The Grapes of Wrath is a 1940 American drama film directed by John Ford. It was based on John Steinbeck's 1939 Pulitzer Prize-winning novel of the same name. The screenplay was written by Nunnally Johnson and the executive producer was Darryl F. Zanuck.</p><p>The film tells the story of the Joads, an Oklahoma family of sharecroppers, who, after losing their farm to increased mechanization during the Great Depression in the 1930s, become migrant workers, and end up in California. The motion picture details their arduous journey across the United States as they travel to California in search of work and opportunities for the family members, and features cinematography by Gregg Toland.</p><p>The film is widely considered to be one of the greatest films of all time. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "The Grapes of Wrath is a 1940 American drama film directed by John Ford. It was based on John Steinbeck's 1939 Pulitzer Prize-winning novel of the same name. The screenplay was written by Nunnally Johnson and the executive producer was Darryl F. Zanuck.\r\nThe film tells the story of the Joads, an Oklahoma family of sharecroppers, who, after losing their farm to increased mechanization during the Great Depression in the 1930s, become migrant workers, and end up in California. The motion picture details their arduous journey across the United States as they travel to California in search of work and opportunities for the family members, and features cinematography by Gregg Toland.\r\nThe film is widely considered to be one of the greatest films of all time. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nAfter being released from prison, Tom Joad hitchhikes his way to his share-cropper parents' farm in Oklahoma. He comes upon Jim Casy, an itinerant man sitting under a tree by the roadside. Tom remembers Casy as the preacher who baptized him, but Casy has \"lost the spirit\" and his faith. Casy goes with Tom to the Joad property. It is deserted but they find neighbor Muley Graves, who is hiding out there. In a flashback, he describes how the local farmers were forced from their farms by the land deedholders, who knocked down their houses with tractors. Tom soon reunites with the family at his uncle's house. The Joads are migrating with other evicted families to the promised land of California. They pack everything into a dilapidated car adapted to serve as a truck to make the long journey. Casy decides to accompany them.\r\nThe trip along Highway 66 is arduous, and it soon takes a toll on the Joad family. The elderly Grandpa dies along the way. Tom writes the circumstances surrounding the death on a page from the family Bible and places it on the body before they bury it, so his death will not be mistaken as a homicide if discovered. They park in a camp and meet a migrant man returning from California. He scoffs at Pa's optimism about opportunities in California and speaks bitterly about his experiences in the West. Grandma dies when they reach California. Eldest son, Noah, leaves the family, while son-in-law, Connie, deserts his pregnant wife, Rose-of-Sharon.\r\nThe family arrives at the first transient migrant campground for workers. The camp is crowded with other starving, jobless, and desperate travelers. As their truck slowly makes its way through a row of shanty houses and around the camp's hungry-faced inhabitants, Tom notes it, \"Sure don't look none too prosperous.\"\r\nAfter seeing trouble between the sheriff and an agitator, the Joads hurriedly leave the camp. The family goes to another migrant camp, the Keene Ranch. After working in the fields, they discover the high food prices in the company store, the only one in the area. When a group of migrant workers is striking, Tom wants to learn more about it. He attends a secret meeting in the dark woods. When the gathering is discovered, Casy is killed by a camp guard. Tom inadvertently kills the guard while defending himself.\r\nTom suffers a serious cheek wound, making him easily recognizable. That evening, the family hides Tom when guards arrive searching for who killed the guard. Tom avoids being spotted, and the family leaves the Keene Ranch without further incident. After driving awhile, the truck breaks down at the crest of a hill. They have little gas and decide to coast down the hill to where there are some lights. They arrive at the Farmworkers' Weedpatch Camp (\"Wheat Patch\"), a clean facility run by the Department of Agriculture, complete with indoor toilets and showers, which the Joad children have never seen before.\r\nTom is moved to work for change by what he has witnessed in the various camps. When police officers arrive looking for the murderer of the man Tom killed, he decides to leave, telling his mother that he plans to carry on Casy's mission by fighting for workers' rights:\r\n\"I'll be all around in the dark. I'll be everywhere. Wherever you can look, wherever there's a fight, so hungry people can eat, I'll be there. Wherever there's a cop beatin' up a guy, I'll be there. I'll be in the way guys yell when they're mad. I'll be in the way kids laugh when they're hungry and they know supper's ready, and when the people are eatin' the stuff they raise and livin' in the houses they build, I'll be there, too.\"\r\nAs the family moves on again, they discuss the fear and difficulties they have had. Ma Joad concludes by saying:\r\n\"I ain't never gonna be scared no more. I was, though. For a while it looked as though we was beat. Good and beat. Looked like we didn't have nobody in the whole wide world but enemies. Like nobody was friendly no more. Made me feel kinda bad and scared too, like we was lost and nobody cared.... Rich fellas come up and they die, and their kids ain't no good and they die out, but we keep a-coming. We're the people that live. They can't wipe us out, they can't lick us. We'll go on forever, Pa, cos we're the people.\"\r\nCast\r\nHenry Fonda as Tom Joad\r\nJane Darwell as \"Ma\" Joad\r\nJohn Carradine as Jim Casy\r\nCharley Grapewin as William James \"Grandpa\" Joad\r\nDorris Bowdon as Rose of Sharon \"Rosasharn\" Joad\r\nRussell Simpson as \"Pa\" Joad\r\nO. Z. Whitehead as Al Joad\r\nJohn Qualen as Muley Graves\r\nEddie Quillan as Connie Rivers\r\nZeffie Tilbury as Grandma Joad\r\nFrank Sully as Noah Joad\r\nFrank Darien as Uncle John\r\nDarryl Hickman as Winfield Joad\r\nShirley Mills as Ruth \"Ruthie\" Joad\r\nRoger Imhof as Mr. Thomas\r\nGrant Mitchell as Caretaker\r\nCharles D. Brown as Wilkie\r\nJohn Arledge as Davis\r\nWard Bond as Policeman\r\nHarry Tyler as Bert\r\nWilliam Pawley as Bill\r\nCharles Tannen as Joe\r\nSelmer Jackson as Inspection Officer\r\nCharles Middleton as Leader\r\nEddie Waller as Proprietor\r\nPaul Guilfoyle as Floyd\r\nDavid Hughes as Frank\r\nCliff Clark as City Man\r\nJoseph Sawyer as Keene Ranch Foreman\r\nFrank Faylen as Tim\r\nAdrian Morris as Agent\r\nHollis Jewell as Muley's Son\r\nRobert Homans as Spencer\r\nIrving Bacon as Driver\r\nKitty McHugh as Mae\r\nTom Tyler as Deputy (uncredited)\r\nJoe Bordeaux as Migrant (uncredited)\r\nJack Perrin as Migrant (uncredited)\r\nFrank O'Connor as Deputy #1 (uncredited)\r\nGeorge O'Hara as Clerk (uncredited)\r\nFrancis Ford as Migrant (uncredited)\r\nNovel\r\nAccording to The New York Times, The Grapes of Wrath was America's best-selling book of 1939 and 430,000 copies had been printed by February 1940. In that month, it won the National Book Award, favorite fiction book of 1939, voted by members of the American Booksellers Association. Soon, it won the Pulitzer Prize for Fiction.\r\nIn 1962, the Nobel Prize committee said The Grapes of Wrath was \"great work\" and one of the committee's main reasons for granting Steinbeck the Nobel Prize for Literature. Time magazine included the novel in its \"100 Best English-language Novels from 1923 to 2005\" list. In 2009, The Daily Telegraph also included the novel in its list of \"100 novels everyone should read\". In 1998, the Modern Library ranked The Grapes of Wrath tenth on its list of the 100 best English-language novels of the 20th century.\r\nDifferences from the novel\r\nThe first part of the film follows the book fairly closely. However, the second half and the ending in particular are significantly different from the book. While the book ends with the downfall and break-up of the Joad family, the film switches the order of sequences so that the family ends up in a \"good\" camp provided by the government, and things turn out relatively well for them.\r\nIn the novel, Rose-of-Sharon (\"Rosasharn\") Rivers (played in the film by Dorris Bowdon) gives birth to a stillborn baby. Later, she offers her milk-filled breasts to a starving man, dying in a barn. These scenes were not included in the film.\r\nWhile the film is somewhat stark, it has a more optimistic and hopeful view than the novel, especially when the Joads land at the Department of Agriculture camp – the clean camp. Also, the producers decided to tone down Steinbeck's political references, such as eliminating a monologue using a land owner's description of \"reds\" as anybody \"that wants thirty cents an hour when we're payin' twenty-five,\" to show that under the prevalent conditions that definition applies to every migrant worker looking for better wages.\r\nThe film emphasizes Ma Joad's pragmatic, forward-looking way of dealing with their situation despite Tom's departure, as it concludes with her spiritual \"We're the people\" speech.\r\nIvy and Sairy Wilson, who attend to Grandpa's death and travel with the Joads until they reach California, are left out of the movie entirely. Noah's departure from the family is passed over in the movie. Instead, he simply disappears without explanation. In the book, Floyd tells Tom about how the workers were being exploited, but in the movie he does not appear until after the deputy arrives in Hooverville. Sandry, the religious fanatic who scares Rose-of-Sharon, is left out of the movie.\r\nVivian Sobchack argued that the film uses visual imagery to focus on the Joads as a family unit, whereas the novel focuses on their journey as a part of the \"family of man\". She points out that their farm is never shown in detail, and that the family members are never shown working in agriculture; not a single peach is shown in the entire film. This subtly serves to focus the film on the specific family, as opposed to the novel's focus on man and land together.\r\nIn the film, most of the Joad family members are either reduced to background characters – in the case of Al, Noah, and Uncle John – or to being the focus of only one or two relatively minor scenes – like Rose-of-Sharon and Connie. Instead, the film is largely concerned with Tom, Ma, and (to a lesser extent) Jim Casy. Thus, despite the film's focus on the Joads as a specific family rather than a part of the \"family of man\", the movie explores very little of the members of the family itself.\r\nSoundtrack\r\nHenry Fonda – \"Red River Valley\" (Traditional)\r\nEddie Quillan – \"Going Down the Road Feeling Bad\" (Traditional)\r\n\"A-Tisket, A-Tasket\" (Words and music by Ella Fitzgerald and Van Alexander)\r\nProduction\r\nExecutive producer Darryl F. Zanuck was nervous about the left-wing political views of the novel, especially the ending. Due to the red-baiting common to the era, Darryl Zanuck sent private investigators to Oklahoma to help him legitimize the film.\r\nWhen Zanuck's investigators found that the \"Okies'\" predicament was indeed terrible, Zanuck was confident he could defend political attacks that the film was somehow pro-Communist. Critic Roger Ebert believed that World War II also helped sell the film's message, as Communism received a brief respite from American demonizing during that period.\r\nProduction on the film began on October 4, 1939, and was completed on November 16, 1939. Some of the filming locations include: McAlester and Sayre, both in Oklahoma; Gallup, Laguna Pueblo, and Santa Rosa, all in New Mexico; Thousand Oaks, Lamont, Needles, and the San Fernando Valley, all in California; Topock and the Petrified Forest National Park, both in Arizona.\r\nThe film score by Alfred Newman is based on the song \"Red River Valley\". Additionally, the song \"Goin' Down the Road Feelin' Bad\" is sung in a nighttime scene at a roadside New Mexico camp.\r\nThe film premiered in New York City on January 24, 1940, and Los Angeles on January 27, 1940. The wide release date in the United States was March 15, 1940.\r\nReception\r\nCritical response\r\nFrank Nugent of The New York Times wrote:\r\nIn the vast library where the celluloid literature of the screen is stored there is one small, uncrowded shelf devoted to the cinema's masterworks, to those films which by dignity of theme and excellence of treatment seem to be of enduring artistry, seem destined to be recalled not merely at the end of their particular year but whenever great motion pictures are mentioned. To that shelf of screen classics Twentieth Century-Fox yesterday added its version of John Steinbeck's The Grapes of Wrath, adapted by Nunnally Johnson, directed by John Ford and performed at the Rivoli by a cast of such uniform excellence and suitability that we should be doing its other members an injustice by saying it was \"headed\" by Henry Fonda, Jane Darwell, John Carradine and Russell Simpson.\r\nWhen critic Bosley Crowther retired in 1967, he named The Grapes of Wrath one of the best fifty films ever made.\r\nIn a film review written for Time magazine by its editor Whittaker Chambers, he separated his views of Steinbeck's novel from Ford's film, which he liked.\r\nChambers wrote:\r\nBut people who go to pictures for the sake of seeing pictures will see a great one. For The Grapes of Wrath is possibly the best picture ever made from a so-so book...Camera craft purged the picture of the editorial rash that blotched the Steinbeck book. Cleared of excrescences, the residue is a great human story which made thousands of people, who damned the novel's phony conclusions, read it. It is the saga of an authentic U.S. farming family who lose their land. They wander, they suffer, but they endure. They are never quite defeated, and their survival is itself a triumph.\r\nA review in Variety reported, \"Here is outstanding entertainment, projected against a heart-rending sector of the American scene,\" concluding, \"It possesses an adult viewpoint and its success may lead other producers to explore the rich field of contemporary life which films long have neglected and ignored.\" John Mosher wrote in The New Yorker, \"With a majesty never before so constantly sustained on any screen, the film never for an instant falters. Its beauty is of the sort found in the art of Burchfield, Benton and Curry, as the landscape and people involved belong to the world of these painters.\"\r\nThe Film Daily year-end poll of 546 critics nationwide ranked The Grapes of Wrath as the second-best film of 1940, behind only Rebecca.\r\nAwards and nominations\r\nAmerican Film Institute recognition\r\nAFI's 100 Years... 100 Movies – #21\r\nAFI's 100 Years... 100 Heroes and Villains: Tom Joad – #12 Hero\r\nTom Joad – #12 Hero\r\nAFI's 100 Years... 100 Movie Quotes: \"Wherever there's a fight so hungry people can eat, I'll be there.\" – Nominated\r\n\"Wherever there's a fight so hungry people can eat, I'll be there.\" – Nominated\r\n100 Years...100 Cheers – #7\r\n100 Years...100 Movies (10th Anniversary) – #23\r\nHome media\r\nThe film was released on VHS in 1988 by Key Video. It was later released in video format on March 3, 1998, by 20th Century Fox on its Studio Classic series.\r\nA DVD was released on April 6, 2004, by 20th Century Fox Entertainment. The DVD contains a special commentary track by scholars Joseph McBride and Susan Shillinglaw. It also includes various supplements: an A&E Network biography of Daryl F. Zanuck, outtakes, a gallery, Franklin D. Roosevelt lauds motion pictures at Academy featurette, Movietone news: three drought reports from 1934, etc.\r\nThe film was released on Blu-ray on April 3, 2012, and features all supplemental material from the DVD release.",
    "html": "<p>The Grapes of Wrath is a 1940 American drama film directed by John Ford. It was based on John Steinbeck's 1939 Pulitzer Prize-winning novel of the same name. The screenplay was written by Nunnally Johnson and the executive producer was Darryl F. Zanuck.</p><p>The film tells the story of the Joads, an Oklahoma family of sharecroppers, who, after losing their farm to increased mechanization during the Great Depression in the 1930s, become migrant workers, and end up in California. The motion picture details their arduous journey across the United States as they travel to California in search of work and opportunities for the family members, and features cinematography by Gregg Toland.</p><p>The film is widely considered to be one of the greatest films of all time. In 1989, it was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>After being released from prison, Tom Joad hitchhikes his way to his share-cropper parents' farm in Oklahoma. He comes upon Jim Casy, an itinerant man sitting under a tree by the roadside. Tom remembers Casy as the preacher who baptized him, but Casy has \"lost the spirit\" and his faith. Casy goes with Tom to the Joad property. It is deserted but they find neighbor Muley Graves, who is hiding out there. In a flashback, he describes how the local farmers were forced from their farms by the land deedholders, who knocked down their houses with tractors. Tom soon reunites with the family at his uncle's house. The Joads are migrating with other evicted families to the promised land of California. They pack everything into a dilapidated car adapted to serve as a truck to make the long journey. Casy decides to accompany them.</p><p>The trip along Highway 66 is arduous, and it soon takes a toll on the Joad family. The elderly Grandpa dies along the way. Tom writes the circumstances surrounding the death on a page from the family Bible and places it on the body before they bury it, so his death will not be mistaken as a homicide if discovered. They park in a camp and meet a migrant man returning from California. He scoffs at Pa's optimism about opportunities in California and speaks bitterly about his experiences in the West. Grandma dies when they reach California. Eldest son, Noah, leaves the family, while son-in-law, Connie, deserts his pregnant wife, Rose-of-Sharon.</p><p>The family arrives at the first transient migrant campground for workers. The camp is crowded with other starving, jobless, and desperate travelers. As their truck slowly makes its way through a row of shanty houses and around the camp's hungry-faced inhabitants, Tom notes it, \"Sure don't look none too prosperous.\"</p><p>After seeing trouble between the sheriff and an agitator, the Joads hurriedly leave the camp. The family goes to another migrant camp, the Keene Ranch. After working in the fields, they discover the high food prices in the company store, the only one in the area. When a group of migrant workers is striking, Tom wants to learn more about it. He attends a secret meeting in the dark woods. When the gathering is discovered, Casy is killed by a camp guard. Tom inadvertently kills the guard while defending himself.</p><p>Tom suffers a serious cheek wound, making him easily recognizable. That evening, the family hides Tom when guards arrive searching for who killed the guard. Tom avoids being spotted, and the family leaves the Keene Ranch without further incident. After driving awhile, the truck breaks down at the crest of a hill. They have little gas and decide to coast down the hill to where there are some lights. They arrive at the Farmworkers' Weedpatch Camp (\"Wheat Patch\"), a clean facility run by the Department of Agriculture, complete with indoor toilets and showers, which the Joad children have never seen before.</p><p>Tom is moved to work for change by what he has witnessed in the various camps. When police officers arrive looking for the murderer of the man Tom killed, he decides to leave, telling his mother that he plans to carry on Casy's mission by fighting for workers' rights:</p><blockquote>\"I'll be all around in the dark. I'll be everywhere. Wherever you can look, wherever there's a fight, so hungry people can eat, I'll be there. Wherever there's a cop beatin' up a guy, I'll be there. I'll be in the way guys yell when they're mad. I'll be in the way kids laugh when they're hungry and they know supper's ready, and when the people are eatin' the stuff they raise and livin' in the houses they build, I'll be there, too.\"</blockquote><p>As the family moves on again, they discuss the fear and difficulties they have had. Ma Joad concludes by saying:</p><blockquote>\"I ain't never gonna be scared no more. I was, though. For a while it looked as though we was beat. Good and beat. Looked like we didn't have nobody in the whole wide world but enemies. Like nobody was friendly no more. Made me feel kinda bad and scared too, like we was lost and nobody cared.... Rich fellas come up and they die, and their kids ain't no good and they die out, but we keep a-coming. We're the people that live. They can't wipe us out, they can't lick us. We'll go on forever, Pa, cos we're the people.\"</blockquote><br/><h3>Cast</h3><ul><li>Henry Fonda as Tom Joad</li><li>Jane Darwell as \"Ma\" Joad</li><li>John Carradine as Jim Casy</li><li>Charley Grapewin as William James \"Grandpa\" Joad</li><li>Dorris Bowdon as Rose of Sharon \"Rosasharn\" Joad</li><li>Russell Simpson as \"Pa\" Joad</li><li>O. Z. Whitehead as Al Joad</li><li>John Qualen as Muley Graves</li><li>Eddie Quillan as Connie Rivers</li><li>Zeffie Tilbury as Grandma Joad</li><li>Frank Sully as Noah Joad</li><li>Frank Darien as Uncle John</li><li>Darryl Hickman as Winfield Joad</li><li>Shirley Mills as Ruth \"Ruthie\" Joad</li><li>Roger Imhof as Mr. Thomas</li><li>Grant Mitchell as Caretaker</li><li>Charles D. Brown as Wilkie</li><li>John Arledge as Davis</li><li>Ward Bond as Policeman</li><li>Harry Tyler as Bert</li><li>William Pawley as Bill</li><li>Charles Tannen as Joe</li><li>Selmer Jackson as Inspection Officer</li><li>Charles Middleton as Leader</li><li>Eddie Waller as Proprietor</li><li>Paul Guilfoyle as Floyd</li><li>David Hughes as Frank</li><li>Cliff Clark as City Man</li><li>Joseph Sawyer as Keene Ranch Foreman</li><li>Frank Faylen as Tim</li><li>Adrian Morris as Agent</li><li>Hollis Jewell as Muley's Son</li><li>Robert Homans as Spencer</li><li>Irving Bacon as Driver</li><li>Kitty McHugh as Mae</li><li>Tom Tyler as Deputy (uncredited)</li><li>Joe Bordeaux as Migrant (uncredited)</li><li>Jack Perrin as Migrant (uncredited)</li><li>Frank O'Connor as Deputy #1 (uncredited)</li><li>George O'Hara as Clerk (uncredited)</li><li>Francis Ford as Migrant (uncredited)</li></ul><br/><h3>Novel</h3><p>According to The New York Times, The Grapes of Wrath was America's best-selling book of 1939 and 430,000 copies had been printed by February 1940. In that month, it won the National Book Award, favorite fiction book of 1939, voted by members of the American Booksellers Association. Soon, it won the Pulitzer Prize for Fiction.</p><p>In 1962, the Nobel Prize committee said The Grapes of Wrath was \"great work\" and one of the committee's main reasons for granting Steinbeck the Nobel Prize for Literature. Time magazine included the novel in its \"100 Best English-language Novels from 1923 to 2005\" list. In 2009, The Daily Telegraph also included the novel in its list of \"100 novels everyone should read\". In 1998, the Modern Library ranked The Grapes of Wrath tenth on its list of the 100 best English-language novels of the 20th century.</p><br/><h3>Differences from the novel</h3><p>The first part of the film follows the book fairly closely. However, the second half and the ending in particular are significantly different from the book. While the book ends with the downfall and break-up of the Joad family, the film switches the order of sequences so that the family ends up in a \"good\" camp provided by the government, and things turn out relatively well for them.</p><p>In the novel, Rose-of-Sharon (\"Rosasharn\") Rivers (played in the film by Dorris Bowdon) gives birth to a stillborn baby. Later, she offers her milk-filled breasts to a starving man, dying in a barn. These scenes were not included in the film.</p><p>While the film is somewhat stark, it has a more optimistic and hopeful view than the novel, especially when the Joads land at the Department of Agriculture camp – the clean camp. Also, the producers decided to tone down Steinbeck's political references, such as eliminating a monologue using a land owner's description of \"reds\" as anybody \"that wants thirty cents an hour when we're payin' twenty-five,\" to show that under the prevalent conditions that definition applies to every migrant worker looking for better wages.</p><p>The film emphasizes Ma Joad's pragmatic, forward-looking way of dealing with their situation despite Tom's departure, as it concludes with her spiritual \"We're the people\" speech.</p><p>Ivy and Sairy Wilson, who attend to Grandpa's death and travel with the Joads until they reach California, are left out of the movie entirely. Noah's departure from the family is passed over in the movie. Instead, he simply disappears without explanation. In the book, Floyd tells Tom about how the workers were being exploited, but in the movie he does not appear until after the deputy arrives in Hooverville. Sandry, the religious fanatic who scares Rose-of-Sharon, is left out of the movie.</p><p>Vivian Sobchack argued that the film uses visual imagery to focus on the Joads as a family unit, whereas the novel focuses on their journey as a part of the \"family of man\". She points out that their farm is never shown in detail, and that the family members are never shown working in agriculture; not a single peach is shown in the entire film. This subtly serves to focus the film on the specific family, as opposed to the novel's focus on man and land together.</p><p>In the film, most of the Joad family members are either reduced to background characters – in the case of Al, Noah, and Uncle John – or to being the focus of only one or two relatively minor scenes – like Rose-of-Sharon and Connie. Instead, the film is largely concerned with Tom, Ma, and (to a lesser extent) Jim Casy. Thus, despite the film's focus on the Joads as a specific family rather than a part of the \"family of man\", the movie explores very little of the members of the family itself.</p><br/><h3>Soundtrack</h3><ul><li>Henry Fonda – \"Red River Valley\" (Traditional)</li><li>Eddie Quillan – \"Going Down the Road Feeling Bad\" (Traditional)</li><li>\"A-Tisket, A-Tasket\" (Words and music by Ella Fitzgerald and Van Alexander)</li></ul><br/><h3>Production</h3><p>Executive producer Darryl F. Zanuck was nervous about the left-wing political views of the novel, especially the ending. Due to the red-baiting common to the era, Darryl Zanuck sent private investigators to Oklahoma to help him legitimize the film.</p><p>When Zanuck's investigators found that the \"Okies'\" predicament was indeed terrible, Zanuck was confident he could defend political attacks that the film was somehow pro-Communist. Critic Roger Ebert believed that World War II also helped sell the film's message, as Communism received a brief respite from American demonizing during that period.</p><p>Production on the film began on October 4, 1939, and was completed on November 16, 1939. Some of the filming locations include: McAlester and Sayre, both in Oklahoma; Gallup, Laguna Pueblo, and Santa Rosa, all in New Mexico; Thousand Oaks, Lamont, Needles, and the San Fernando Valley, all in California; Topock and the Petrified Forest National Park, both in Arizona.</p><p>The film score by Alfred Newman is based on the song \"Red River Valley\". Additionally, the song \"Goin' Down the Road Feelin' Bad\" is sung in a nighttime scene at a roadside New Mexico camp.</p><p>The film premiered in New York City on January 24, 1940, and Los Angeles on January 27, 1940. The wide release date in the United States was March 15, 1940.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Frank Nugent of The New York Times wrote:</p><blockquote>In the vast library where the celluloid literature of the screen is stored there is one small, uncrowded shelf devoted to the cinema's masterworks, to those films which by dignity of theme and excellence of treatment seem to be of enduring artistry, seem destined to be recalled not merely at the end of their particular year but whenever great motion pictures are mentioned. To that shelf of screen classics Twentieth Century-Fox yesterday added its version of John Steinbeck's The Grapes of Wrath, adapted by Nunnally Johnson, directed by John Ford and performed at the Rivoli by a cast of such uniform excellence and suitability that we should be doing its other members an injustice by saying it was \"headed\" by Henry Fonda, Jane Darwell, John Carradine and Russell Simpson.</blockquote><p>When critic Bosley Crowther retired in 1967, he named The Grapes of Wrath one of the best fifty films ever made.</p><p>In a film review written for Time magazine by its editor Whittaker Chambers, he separated his views of Steinbeck's novel from Ford's film, which he liked.</p><p>Chambers wrote:</p><blockquote>But people who go to pictures for the sake of seeing pictures will see a great one. For The Grapes of Wrath is possibly the best picture ever made from a so-so book...Camera craft purged the picture of the editorial rash that blotched the Steinbeck book. Cleared of excrescences, the residue is a great human story which made thousands of people, who damned the novel's phony conclusions, read it. It is the saga of an authentic U.S. farming family who lose their land. They wander, they suffer, but they endure. They are never quite defeated, and their survival is itself a triumph.</blockquote><p>A review in Variety reported, \"Here is outstanding entertainment, projected against a heart-rending sector of the American scene,\" concluding, \"It possesses an adult viewpoint and its success may lead other producers to explore the rich field of contemporary life which films long have neglected and ignored.\" John Mosher wrote in The New Yorker, \"With a majesty never before so constantly sustained on any screen, the film never for an instant falters. Its beauty is of the sort found in the art of Burchfield, Benton and Curry, as the landscape and people involved belong to the world of these painters.\"</p><p>The Film Daily year-end poll of 546 critics nationwide ranked The Grapes of Wrath as the second-best film of 1940, behind only Rebecca.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"7\"><span>Academy Awards</span></td><td><span>Outstanding Production</span></td><td><span>Darryl F. Zanuck</span> and <span>Nunnally Johnson</span> (for <span class=\"mw-redirect\">20th Century Fox</span>)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td><span>John Ford</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Henry Fonda</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Jane Darwell</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Nunnally Johnson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span class=\"mw-redirect\">Robert L. Simpson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound Recording</span></td><td><span>Edmund H. Hansen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Blue Ribbon Awards</span></td><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td>John Ford</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Acting</td><td>Jane Darwell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Acting</td><td>Henry Fonda</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"2\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>John Ford <span style=\"font-size:85%;\">(also for <i><span>The Long Voyage Home</span></i>)</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>American Film Institute recognition</p><ul><li>AFI's 100 Years... 100 Movies – #21</li><li>AFI's 100 Years... 100 Heroes and Villains: Tom Joad – #12 Hero</li><li>Tom Joad – #12 Hero</li><li>AFI's 100 Years... 100 Movie Quotes: \"Wherever there's a fight so hungry people can eat, I'll be there.\" – Nominated</li><li>\"Wherever there's a fight so hungry people can eat, I'll be there.\" – Nominated</li><li>100 Years...100 Cheers – #7</li><li>100 Years...100 Movies (10th Anniversary) – #23</li></ul><br/><h3>Home media</h3><p>The film was released on VHS in 1988 by Key Video. It was later released in video format on March 3, 1998, by 20th Century Fox on its Studio Classic series.</p><p>A DVD was released on April 6, 2004, by 20th Century Fox Entertainment. The DVD contains a special commentary track by scholars Joseph McBride and Susan Shillinglaw. It also includes various supplements: an A&E Network biography of Daryl F. Zanuck, outtakes, a gallery, Franklin D. Roosevelt lauds motion pictures at Academy featurette, Movietone news: three drought reports from 1934, etc.</p><p>The film was released on Blu-ray on April 3, 2012, and features all supplemental material from the DVD release.</p><br/>"
  },
  "errorMessage": ""
}