{
  "imDbId": "tt0118799",
  "title": "Life Is Beautiful",
  "fullTitle": "Life Is Beautiful (1997)",
  "type": "Movie",
  "year": "1997",
  "items": [
    {
      "publisher": "Film.com",
      "author": "Elizabeth Weitzman",
      "link": "",
      "rate": "100",
      "content": "Benigni, with great help from young Cantarini, has crafted a work of such complexity that you may find both your brain and your heart simply overloaded. Which, of course, is the rarely achieved goal of all art."
    },
    {
      "publisher": "TNT RoughCut",
      "author": "Christopher Brandon",
      "link": "",
      "rate": "90",
      "content": "Its unique message about laughing in the face of evil clearly reveals that life is beautiful."
    },
    {
      "publisher": "The New York Times",
      "author": "Elvis Mitchell",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/archivemain-l.html",
      "rate": "80",
      "content": "Benigni effectively creates a situation in which comedy is courage. And he draws from this an unpretentious, enormously likable film that plays with history both seriously and mischievously. Piety has no place here, nor do tears until the final reel. Life is Beautiful plays by its own rules"
    },
    {
      "publisher": "",
      "author": "The A.V. Club",
      "link": "http://survey-smiles.com/",
      "rate": "80",
      "content": "The concept is not so much nihilistic as it is realistic, and the fact that Benigni has made such fine distinctions so powerfully clear is amazing and moving."
    },
    {
      "publisher": "Film.com",
      "author": "Peter Brunette",
      "link": "",
      "rate": "70",
      "content": "While most reviewers will accuse it of sentimentality (a charge that is justified), audiences, who don't feel the need to appear rigorous and tough-minded all the time, will flock to it in droves."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "67",
      "content": "Starts out as sentimental whimsy and ends as sentimental kitsch."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "50",
      "content": "Benigni sets out to do the impossible."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "50",
      "content": "Has good intentions, but its exaggerated celebration of quick-witted improvisation ultimately trivializes the human and historical horrors evoked by the story."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "20",
      "content": "The indifference of the proceedings and the hero's slapstick behavior to the everyday realities of the camps borders on the nauseating."
    },
    {
      "publisher": "Slate",
      "author": "David Edelstein",
      "link": "",
      "rate": "0",
      "content": "Benigni's movie made me want to throw up."
    }
  ],
  "errorMessage": ""
}