{
  "imDbId": "tt0118799",
  "title": "Life Is Beautiful",
  "fullTitle": "Life Is Beautiful (1997)",
  "type": "Movie",
  "year": "1997",
  "language": "en",
  "titleInLanguage": "Life Is Beautiful",
  "url": "https://en.wikipedia.org/wiki/Life_Is_Beautiful",
  "plotShort": {
    "plainText": "Life Is Beautiful (Italian: La vita è bella, Italian pronunciation:) is a 1997 Italian comedy drama film directed by and starring Roberto Benigni, who co-wrote the film with Vincenzo Cerami. Benigni plays Guido Orefice, a Jewish Italian bookshop owner, who employs his imagination to shield his son from the horrors of internment in a Nazi concentration camp. The film was partially inspired by the book In the End, I Beat Hitler by Rubino Romeo Salmonì and by Benigni's father, who spent two years in the Bergen-Belsen concentration camp during World War II.\r\nThe film was an overwhelming critical and commercial success. It received widespread acclaim, with critics praising its story, performances, direction and the union of drama and comedy, despite some criticisms of using the subject matter for comedic purposes. The movie grossed over $230 million worldwide, including $57.6 million in the United States, is the second highest-grossing foreign language film in the U.S. (after Crouching Tiger, Hidden Dragon) and one of the highest-grossing non-English language movies of all time. The National Board of Review included it in the top five best foreign films of 1998.\r\nThe movie won the Grand Prix at the 1998 Cannes Film Festival, nine David di Donatello Awards (including Best Film), five Nastro d'Argento Awards in Italy, two European Film Awards, and three Academy Awards, including Best Foreign Language Film and Best Actor for Benigni, the first for a male non-English performance.",
    "html": "<p>Life Is Beautiful (Italian: La vita è bella, Italian pronunciation:) is a 1997 Italian comedy drama film directed by and starring Roberto Benigni, who co-wrote the film with Vincenzo Cerami. Benigni plays Guido Orefice, a Jewish Italian bookshop owner, who employs his imagination to shield his son from the horrors of internment in a Nazi concentration camp. The film was partially inspired by the book In the End, I Beat Hitler by Rubino Romeo Salmonì and by Benigni's father, who spent two years in the Bergen-Belsen concentration camp during World War II.</p><p>The film was an overwhelming critical and commercial success. It received widespread acclaim, with critics praising its story, performances, direction and the union of drama and comedy, despite some criticisms of using the subject matter for comedic purposes. The movie grossed over $230 million worldwide, including $57.6 million in the United States, is the second highest-grossing foreign language film in the U.S. (after Crouching Tiger, Hidden Dragon) and one of the highest-grossing non-English language movies of all time. The National Board of Review included it in the top five best foreign films of 1998.</p><p>The movie won the Grand Prix at the 1998 Cannes Film Festival, nine David di Donatello Awards (including Best Film), five Nastro d'Argento Awards in Italy, two European Film Awards, and three Academy Awards, including Best Foreign Language Film and Best Actor for Benigni, the first for a male non-English performance.</p>"
  },
  "plotFull": {
    "plainText": "Life Is Beautiful (Italian: La vita è bella, Italian pronunciation:) is a 1997 Italian comedy drama film directed by and starring Roberto Benigni, who co-wrote the film with Vincenzo Cerami. Benigni plays Guido Orefice, a Jewish Italian bookshop owner, who employs his imagination to shield his son from the horrors of internment in a Nazi concentration camp. The film was partially inspired by the book In the End, I Beat Hitler by Rubino Romeo Salmonì and by Benigni's father, who spent two years in the Bergen-Belsen concentration camp during World War II.\r\nThe film was an overwhelming critical and commercial success. It received widespread acclaim, with critics praising its story, performances, direction and the union of drama and comedy, despite some criticisms of using the subject matter for comedic purposes. The movie grossed over $230 million worldwide, including $57.6 million in the United States, is the second highest-grossing foreign language film in the U.S. (after Crouching Tiger, Hidden Dragon) and one of the highest-grossing non-English language movies of all time. The National Board of Review included it in the top five best foreign films of 1998.\r\nThe movie won the Grand Prix at the 1998 Cannes Film Festival, nine David di Donatello Awards (including Best Film), five Nastro d'Argento Awards in Italy, two European Film Awards, and three Academy Awards, including Best Foreign Language Film and Best Actor for Benigni, the first for a male non-English performance.\r\nPlot\r\nIn 1939, in Fascist Italy, Guido Orefice is a young Italian Jewish man who arrives to work in the city of Arezzo, in Tuscany, where his uncle Eliseo works in the restaurant of a hotel. Guido is comical and sharp and falls in love with a Gentile girl named Dora. Later, he sees her again in the city where she is a teacher and set to be engaged to Rodolfo, a rich but arrogant local government official with whom Guido has regular run-ins. Guido sets up many \"coincidental\" incidents to show his interest in Dora.\r\nFinally, Dora sees Guido's affection and promise and gives in, against her better judgment. He steals the lady from her engagement party, on a horse, humiliating her fiancé and mother. They are later married, have a son Giosuè, and run a bookstore.\r\nDuring World War II, in 1944 when Northern Italy is occupied by Nazi Germany, Guido, his uncle Eliseo, and Giosuè are seized on Giosuè's birthday. They and many other Jews are forced onto a train bound for a concentration camp. After confronting a guard about her husband and son and being told there is no mistake, Dora volunteers to get on the train in order to be close to her family.\r\nHowever, as men and women are separated in the camp, Dora and Guido do not see each other during the internment. Guido pulls off various stunts, such as using the camp's loudspeaker to send messages—symbolic or literal—to Dora to assure her that he and their son are safe. Eliseo is murdered in a gas chamber shortly after their arrival. Giosuè narrowly avoids being gassed himself as he hates to take baths and showers, and did not follow the other children when they had been ordered to enter the gas chambers and were told they were showers.\r\nIn the camp, Guido hides the true situation from his son. Guido tells Giosuè that the camp is a complicated game in which he must perform the tasks Guido gives him. Each of the tasks will earn them points and whoever gets to one thousand points first will win a tank. He tells him that if he cries, complains that he wants his mother, or says that he is hungry, he will lose points, while quiet boys who hide from the camp guards earn extra points. Giosuè is at times reluctant to go along with the game, but Guido convinces him each time to continue.\r\nAt one point Guido takes advantage of the appearance of visiting German officers and their families to show Giosuè that other children are hiding as part of the game, and he also takes advantage of a German nanny thinking Giosuè is one of her charges in order to feed him as Guido serves the German officers. Guido and Giosuè are almost found out to be prisoners by another server until Guido is found teaching all of the German children how to say \"Thank you\" in Italian, effectively providing a ruse.\r\nGuido maintains this story right until the end when, in the chaos of shutting down the camp as the Allied forces approach, he tells his son to stay in a box until everybody has left, this being the final task in the competition before the promised tank is his. Guido goes to find Dora, but he is caught by a German soldier. An officer orders Guido to be executed and Guido is led off by the soldier. While he is walking to his death, Guido passes by Giosuè one last time and winks, still in character and playing the game. Guido is then shot and left for dead in an alleyway.\r\nThe next morning, Giosuè emerges from the sweat-box, just as a U.S. Army unit led by a Sherman tank arrives and the camp is liberated. Giosuè is overjoyed about winning the game (unaware that his father is dead), thinking that he won the tank, and an American soldier allows Giosuè to ride on the tank.\r\nWhile traveling to safety, Giosuè soon spots Dora in the procession leaving the camp and reunites with his mother. While the young Giosuè excitedly tells his mother about how he had won a tank, just as his father had promised, the adult Giosuè, in an overheard monologue, reminisces on the sacrifices his father made for him and his story.\r\nCast\r\nRoberto Benigni as Guido Orefice, an Italian-Jewish waiter and Giosuè's father\r\nNicoletta Braschi as Dora Orefice, a Gentile woman, Guido's wife, and Giosuè's mother\r\nGiorgio Cantarini as Giosuè Orefice, the son of Guido and Dora\r\nGiustino Durano as Uncle Eliseo, Giosuè's granduncle and Guido's uncle\r\nHorst Buchholz as Doctor Lessing, a doctor at the concentration camps who was a regular customer at Eliseo's restaurant. He often tries to solve riddles when with Guido\r\nMarisa Paredes as Dora's mother, a rich socialite\r\nSergio Bustric as Ferruccio, Guido's bumbling partner\r\nAmerigo Fontani as Rodolfo, Dora's former husband to be and a government official\r\nLydia Alfonsi as Guicciardini\r\nGiuliana Lojodice as the Headmistress\r\nPietro Desilva as Bartolomeo\r\nFrancesco Guzzo as Vittorino\r\nRaffaella Lebboroni as Elena\r\nClaudio Alfonsi as Rodolfo's friend\r\nRichard Sammel as Waffen-SS Officer\r\nOmero Antonutti as the voice of the narrator (uncredited)\r\nProduction\r\nDirector Roberto Benigni, who wrote the screenplay with Vincenzo Cerami, was inspired by the story of Rubino Romeo Salmonì and his book In the End, I Beat Hitler, which incorporates elements of irony and black comedy. Salmoni was an Italian Jew who was deported to Auschwitz, survived and was reunited with his parents, but found his brothers were murdered. Benigni stated he wished to commemorate Salmoni as a man who wished to live in the right way. He also based the story on that of his father Luigi Benigni, who was a member of the Italian Army after Italy became a co-belligerent of the Allies in 1943. Luigi Benigni spent two years in a Nazi labour camp, and to avoid scaring his children, told about his experiences humorously, finding this helped him cope. Roberto Benigni explained his philosophy, \"to laugh and to cry comes from the same point of the soul, no? I'm a storyteller: the crux of the matter is to reach beauty, poetry, it doesn't matter if that is comedy or tragedy. They're the same if you reach the beauty.\"\r\nHis friends advised against making the film, as he is a comedian and not Jewish, and the Holocaust was not of interest to his established audience. Because he is Gentile, Benigni consulted with the Center for Documentation of Contemporary Judaism, based in Milan, throughout production. Benigni incorporated historical inaccuracies in order to distinguish his story from the true Holocaust, about which he said only documentaries interviewing survivors could provide \"the truth\".\r\nThe film was shot in the centro storico (historic centre) of Arezzo, Tuscany. The scene where Benigni falls off a bicycle and lands on Nicoletta Braschi was shot in front of Badia delle Sante Flora e Lucilla in Arezzo.\r\nRelease\r\nIn Italy, the film was released in 1997 by Cecchi Gori Distribuzione. The film was screened in the Cannes Film Festival in May 1998, where it was a late addition to the selection of films. In the U.S., it was released on 23 October 1998, by Miramax Films. In Germany, it was released on 12 November 1998. In Austria, it was released on 13 November 1998. In the UK, it was released on 12 February 1999. After the Italian, English subtitled version became a hit in English speaking territories, Miramax reissued Life is Beautiful in an English dubbed version, but it was less successful than the subtitled Italian version.\r\nThe film was aired on the Italian television station RAI on 22 October 2001 and was viewed by 16 million people. This made it the most watched Italian film on Italian TV.\r\nReception\r\nBox office\r\nLife is Beautiful was commercially successful, making $48.7 million in Italy. It was the highest-grossing Italian film in its native country until 2011, when surpassed by Checco Zalone's What a Beautiful Day.\r\nThe film was also successful in the rest of the world, grossing $57.6 million in the United States and Canada and $123.8 million in other territories, for a worldwide gross of $230.1 million. It surpassed fellow Italian film Il Postino: The Postman as the highest-grossing foreign language film in the United States until Crouching Tiger, Hidden Dragon (2000).\r\nCritical response\r\nThe film was praised by the Italian press, with Benigni treated as a \"national hero.\" Pope John Paul II, who received a private screening with Benigni, placed it in his top five favourite films. It holds a \"Fresh\" 80% approval rating on review aggregation website Rotten Tomatoes, based on 92 reviews with an average rating of 7.50/10. The site's consensus reads: \"Benigni's earnest charm, when not overstepping its bounds into the unnecessarily treacly, offers the possibility of hope in the face of unflinching horror\".\r\nRoger Ebert gave the film 3.5/4 stars, stating: \"At Cannes, it offended some left-wing critics with its use of humor in connection with the Holocaust. What may be most offensive to both wings is its sidestepping of politics in favor of simple human ingenuity. The film finds the right notes to negotiate its delicate subject matter ... The movie actually softens the Holocaust slightly, to make the humor possible at all. In the real death camps there would be no role for Guido. But Life Is Beautiful is not about Nazis and Fascists, but about the human spirit. It is about rescuing whatever is good and hopeful from the wreckage of dreams. About hope for the future. About the necessary human conviction, or delusion, that things will be better for our children than they are right now.\" Michael Wilmington of the Chicago Tribune gave the movie a score of 100/100, calling it: \"A deeply moving blend of cold terror and rapturous hilarity. Lovingly crafted by Italy's top comedian and most popular filmmaker, it's that rare comedy that takes on a daring and ambitious subject and proves worthy of it.\"\r\nRichard Schickel, writing for Time, argued, \"There are references to mass extermination, but that brutal reality is never vividly presented\". He concluded that \"even a hint of the truth about the Holocaust would crush's comedy.\" Owen Gleiberman of Entertainment Weekly gave it a B−, calling it \"undeniably some sort of feat—the first feel-good Holocaust weepie. It's been a long time coming.\" However, Glieberman stated: \"There's only one problem. As shot, it looks like a game\".\r\nMichael O'Sullivan, writing for The Washington Post, called it \"sad, funny and haunting.\"\r\nNell Minow of Common Sense Media gave it 5/5 stars, saying: \"This magnificent film gives us a glimpse of the Holocaust, but it is really about love, and the indomitability of humanity even in the midst of inhumanity.\" Janet Maslin wrote in The New York Times that the film took \"a colossal amount of gall\" but \"because Mr. Benigni can be heart-rending without a trace of the maudlin, it works.\"The Los Angeles Times's Kenneth Turan noted the film had \"some furious opposition\" at Cannes, but said \"what is surprising about this unlikely film is that it succeeds as well as it does. Its sentiment is inescapable, but genuine poignancy and pathos are also present, and an overarching sincerity is visible too.\"\r\nDavid Rooney of Variety said the film had \"mixed results,\" with \"surprising depth and poignancy\" in Benigni's performance but \"visually rather flat\" camera work by Tonino Delli Colli. In 2002, BBC critic Tom Dawson wrote \"the film is presumably intended as a tribute to the powers of imagination, innocence, and love in the most harrowing of circumstances,\" but \"Benigni's sentimental fantasy diminishes the suffering of Holocaust victims.\"\r\nIn 2006, Jewish American comedic filmmaker Mel Brooks spoke negatively of the film in Der Spiegel, saying it trivialized the suffering in concentration camps.\r\nBy contrast, Nobel Laureate Imre Kertész argues that those who take the film to be a comedy, rather than a tragedy, have missed the point of the film. He draws attention to what he terms 'Holocaust conformism' in cinema to rebuff detractors of Life Is Beautiful.\r\nIsraeli screenwriter, author and art critic Kobi Niv published the book Life is Beautiful, But Not for Jews (in 2000 in Hebrew and an English translation in 2003) in which he analyzed the movie from a highly critical perspective, suggesting that the film's underlining narrative is harmful for Jews.\r\nAnother academic analysis of the movie was undertaken by Ilona Klein, who analyzes the film's success and refers to the \"ambiguous themes hidden within.\" Klein suggests that one of the reasons the movie was so successful was its appeal of \"sentimental optimism\". At the same time, she points out that \"Miramax's hype billed this film as a fable about 'love, family, and the power of imagination,' yet most Jewish victims of the Nazis' 'Final Solution' were loving, concerned, devoted parents. No amount of love, family, and power of imagination helped their children survive the gas chambers.\"\r\nDavid Sterritt of The Christian Science Monitor highlighted that \"Enthusiasm for the movie has not been as unanimous as its ad campaign suggests, however, and audiences would do well to ponder its implicit attitudes.\" He pointed out that the movie implicitly suggests quick-witted confidence was a match for the terrors of fascist death camps, then added that \" fable ultimately obscures the human and historical events it sets out to illuminate.\"\r\nAccolades\r\nLife is Beautiful was shown at the 1998 Cannes Film Festival, and went on to win the Grand Prix. Upon receiving the award, Benigni kissed the feet of jury president Martin Scorsese.\r\nAt the 71st Academy Awards, Benigni won Best Actor for his role, with the film winning two more awards for Best Music, Original Dramatic Score and Best Foreign Language Film. Benigni jumped on top of the seats as he made his way to the stage to accept his first award, and upon accepting his second, said, \"This is a terrible mistake because I used up all my English!\"\r\nSoundtrack\r\nThe original score to the film was composed by Nicola Piovani, with the exception of a classical piece which figures prominently: the \"Barcarolle\" by Jacques Offenbach and A Musical Joke by Mozart. The soundtrack album won the Academy Award for Best Original Dramatic Score and was nominated for a Grammy Award: \"Best Instrumental Composition Written for a Motion Picture, Television or Other Visual Media\", but lost to the score of A Bug's Life.",
    "html": "<p>Life Is Beautiful (Italian: La vita è bella, Italian pronunciation:) is a 1997 Italian comedy drama film directed by and starring Roberto Benigni, who co-wrote the film with Vincenzo Cerami. Benigni plays Guido Orefice, a Jewish Italian bookshop owner, who employs his imagination to shield his son from the horrors of internment in a Nazi concentration camp. The film was partially inspired by the book In the End, I Beat Hitler by Rubino Romeo Salmonì and by Benigni's father, who spent two years in the Bergen-Belsen concentration camp during World War II.</p><p>The film was an overwhelming critical and commercial success. It received widespread acclaim, with critics praising its story, performances, direction and the union of drama and comedy, despite some criticisms of using the subject matter for comedic purposes. The movie grossed over $230 million worldwide, including $57.6 million in the United States, is the second highest-grossing foreign language film in the U.S. (after Crouching Tiger, Hidden Dragon) and one of the highest-grossing non-English language movies of all time. The National Board of Review included it in the top five best foreign films of 1998.</p><p>The movie won the Grand Prix at the 1998 Cannes Film Festival, nine David di Donatello Awards (including Best Film), five Nastro d'Argento Awards in Italy, two European Film Awards, and three Academy Awards, including Best Foreign Language Film and Best Actor for Benigni, the first for a male non-English performance.</p><br/><h3>Plot</h3><p>In 1939, in Fascist Italy, Guido Orefice is a young Italian Jewish man who arrives to work in the city of Arezzo, in Tuscany, where his uncle Eliseo works in the restaurant of a hotel. Guido is comical and sharp and falls in love with a Gentile girl named Dora. Later, he sees her again in the city where she is a teacher and set to be engaged to Rodolfo, a rich but arrogant local government official with whom Guido has regular run-ins. Guido sets up many \"coincidental\" incidents to show his interest in Dora.</p><p>Finally, Dora sees Guido's affection and promise and gives in, against her better judgment. He steals the lady from her engagement party, on a horse, humiliating her fiancé and mother. They are later married, have a son Giosuè, and run a bookstore.</p><p>During World War II, in 1944 when Northern Italy is occupied by Nazi Germany, Guido, his uncle Eliseo, and Giosuè are seized on Giosuè's birthday. They and many other Jews are forced onto a train bound for a concentration camp. After confronting a guard about her husband and son and being told there is no mistake, Dora volunteers to get on the train in order to be close to her family.</p><p>However, as men and women are separated in the camp, Dora and Guido do not see each other during the internment. Guido pulls off various stunts, such as using the camp's loudspeaker to send messages—symbolic or literal—to Dora to assure her that he and their son are safe. Eliseo is murdered in a gas chamber shortly after their arrival. Giosuè narrowly avoids being gassed himself as he hates to take baths and showers, and did not follow the other children when they had been ordered to enter the gas chambers and were told they were showers.</p><p>In the camp, Guido hides the true situation from his son. Guido tells Giosuè that the camp is a complicated game in which he must perform the tasks Guido gives him. Each of the tasks will earn them points and whoever gets to one thousand points first will win a tank. He tells him that if he cries, complains that he wants his mother, or says that he is hungry, he will lose points, while quiet boys who hide from the camp guards earn extra points. Giosuè is at times reluctant to go along with the game, but Guido convinces him each time to continue.</p><p>At one point Guido takes advantage of the appearance of visiting German officers and their families to show Giosuè that other children are hiding as part of the game, and he also takes advantage of a German nanny thinking Giosuè is one of her charges in order to feed him as Guido serves the German officers. Guido and Giosuè are almost found out to be prisoners by another server until Guido is found teaching all of the German children how to say \"Thank you\" in Italian, effectively providing a ruse.</p><p>Guido maintains this story right until the end when, in the chaos of shutting down the camp as the Allied forces approach, he tells his son to stay in a box until everybody has left, this being the final task in the competition before the promised tank is his. Guido goes to find Dora, but he is caught by a German soldier. An officer orders Guido to be executed and Guido is led off by the soldier. While he is walking to his death, Guido passes by Giosuè one last time and winks, still in character and playing the game. Guido is then shot and left for dead in an alleyway.</p><p>The next morning, Giosuè emerges from the sweat-box, just as a U.S. Army unit led by a Sherman tank arrives and the camp is liberated. Giosuè is overjoyed about winning the game (unaware that his father is dead), thinking that he won the tank, and an American soldier allows Giosuè to ride on the tank.</p><p>While traveling to safety, Giosuè soon spots Dora in the procession leaving the camp and reunites with his mother. While the young Giosuè excitedly tells his mother about how he had won a tank, just as his father had promised, the adult Giosuè, in an overheard monologue, reminisces on the sacrifices his father made for him and his story.</p><br/><h3>Cast</h3><ul><li>Roberto Benigni as Guido Orefice, an Italian-Jewish waiter and Giosuè's father</li><li>Nicoletta Braschi as Dora Orefice, a Gentile woman, Guido's wife, and Giosuè's mother</li><li>Giorgio Cantarini as Giosuè Orefice, the son of Guido and Dora</li><li>Giustino Durano as Uncle Eliseo, Giosuè's granduncle and Guido's uncle</li><li>Horst Buchholz as Doctor Lessing, a doctor at the concentration camps who was a regular customer at Eliseo's restaurant. He often tries to solve riddles when with Guido</li><li>Marisa Paredes as Dora's mother, a rich socialite</li><li>Sergio Bustric as Ferruccio, Guido's bumbling partner</li><li>Amerigo Fontani as Rodolfo, Dora's former husband to be and a government official</li><li>Lydia Alfonsi as Guicciardini</li><li>Giuliana Lojodice as the Headmistress</li><li>Pietro Desilva as Bartolomeo</li><li>Francesco Guzzo as Vittorino</li><li>Raffaella Lebboroni as Elena</li><li>Claudio Alfonsi as Rodolfo's friend</li><li>Richard Sammel as Waffen-SS Officer</li><li>Omero Antonutti as the voice of the narrator (uncredited)</li></ul><br/><h3>Production</h3><p>Director Roberto Benigni, who wrote the screenplay with Vincenzo Cerami, was inspired by the story of Rubino Romeo Salmonì and his book In the End, I Beat Hitler, which incorporates elements of irony and black comedy. Salmoni was an Italian Jew who was deported to Auschwitz, survived and was reunited with his parents, but found his brothers were murdered. Benigni stated he wished to commemorate Salmoni as a man who wished to live in the right way. He also based the story on that of his father Luigi Benigni, who was a member of the Italian Army after Italy became a co-belligerent of the Allies in 1943. Luigi Benigni spent two years in a Nazi labour camp, and to avoid scaring his children, told about his experiences humorously, finding this helped him cope. Roberto Benigni explained his philosophy, \"to laugh and to cry comes from the same point of the soul, no? I'm a storyteller: the crux of the matter is to reach beauty, poetry, it doesn't matter if that is comedy or tragedy. They're the same if you reach the beauty.\"</p><p>His friends advised against making the film, as he is a comedian and not Jewish, and the Holocaust was not of interest to his established audience. Because he is Gentile, Benigni consulted with the Center for Documentation of Contemporary Judaism, based in Milan, throughout production. Benigni incorporated historical inaccuracies in order to distinguish his story from the true Holocaust, about which he said only documentaries interviewing survivors could provide \"the truth\".</p><p>The film was shot in the centro storico (historic centre) of Arezzo, Tuscany. The scene where Benigni falls off a bicycle and lands on Nicoletta Braschi was shot in front of Badia delle Sante Flora e Lucilla in Arezzo.</p><br/><h3>Release</h3><p>In Italy, the film was released in 1997 by Cecchi Gori Distribuzione. The film was screened in the Cannes Film Festival in May 1998, where it was a late addition to the selection of films. In the U.S., it was released on 23 October 1998, by Miramax Films. In Germany, it was released on 12 November 1998. In Austria, it was released on 13 November 1998. In the UK, it was released on 12 February 1999. After the Italian, English subtitled version became a hit in English speaking territories, Miramax reissued Life is Beautiful in an English dubbed version, but it was less successful than the subtitled Italian version.</p><p>The film was aired on the Italian television station RAI on 22 October 2001 and was viewed by 16 million people. This made it the most watched Italian film on Italian TV.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Life is Beautiful was commercially successful, making $48.7 million in Italy. It was the highest-grossing Italian film in its native country until 2011, when surpassed by Checco Zalone's What a Beautiful Day.</p><p>The film was also successful in the rest of the world, grossing $57.6 million in the United States and Canada and $123.8 million in other territories, for a worldwide gross of $230.1 million. It surpassed fellow Italian film Il Postino: The Postman as the highest-grossing foreign language film in the United States until Crouching Tiger, Hidden Dragon (2000).</p><h4>Critical response</h4><p>The film was praised by the Italian press, with Benigni treated as a \"national hero.\" Pope John Paul II, who received a private screening with Benigni, placed it in his top five favourite films. It holds a \"Fresh\" 80% approval rating on review aggregation website Rotten Tomatoes, based on 92 reviews with an average rating of 7.50/10. The site's consensus reads: \"Benigni's earnest charm, when not overstepping its bounds into the unnecessarily treacly, offers the possibility of hope in the face of unflinching horror\".</p><p>Roger Ebert gave the film 3.5/4 stars, stating: \"At Cannes, it offended some left-wing critics with its use of humor in connection with the Holocaust. What may be most offensive to both wings is its sidestepping of politics in favor of simple human ingenuity. The film finds the right notes to negotiate its delicate subject matter ... The movie actually softens the Holocaust slightly, to make the humor possible at all. In the real death camps there would be no role for Guido. But Life Is Beautiful is not about Nazis and Fascists, but about the human spirit. It is about rescuing whatever is good and hopeful from the wreckage of dreams. About hope for the future. About the necessary human conviction, or delusion, that things will be better for our children than they are right now.\" Michael Wilmington of the Chicago Tribune gave the movie a score of 100/100, calling it: \"A deeply moving blend of cold terror and rapturous hilarity. Lovingly crafted by Italy's top comedian and most popular filmmaker, it's that rare comedy that takes on a daring and ambitious subject and proves worthy of it.\"</p><p>Richard Schickel, writing for Time, argued, \"There are references to mass extermination, but that brutal reality is never vividly presented\". He concluded that \"even a hint of the truth about the Holocaust would crush's comedy.\" Owen Gleiberman of Entertainment Weekly gave it a B−, calling it \"undeniably some sort of feat—the first feel-good Holocaust weepie. It's been a long time coming.\" However, Glieberman stated: \"There's only one problem. As shot, it looks like a game\".</p><p>Michael O'Sullivan, writing for The Washington Post, called it \"sad, funny and haunting.\"</p><p>Nell Minow of Common Sense Media gave it 5/5 stars, saying: \"This magnificent film gives us a glimpse of the Holocaust, but it is really about love, and the indomitability of humanity even in the midst of inhumanity.\" Janet Maslin wrote in The New York Times that the film took \"a colossal amount of gall\" but \"because Mr. Benigni can be heart-rending without a trace of the maudlin, it works.\"The Los Angeles Times's Kenneth Turan noted the film had \"some furious opposition\" at Cannes, but said \"what is surprising about this unlikely film is that it succeeds as well as it does. Its sentiment is inescapable, but genuine poignancy and pathos are also present, and an overarching sincerity is visible too.\"</p><p>David Rooney of Variety said the film had \"mixed results,\" with \"surprising depth and poignancy\" in Benigni's performance but \"visually rather flat\" camera work by Tonino Delli Colli. In 2002, BBC critic Tom Dawson wrote \"the film is presumably intended as a tribute to the powers of imagination, innocence, and love in the most harrowing of circumstances,\" but \"Benigni's sentimental fantasy diminishes the suffering of Holocaust victims.\"</p><p>In 2006, Jewish American comedic filmmaker Mel Brooks spoke negatively of the film in Der Spiegel, saying it trivialized the suffering in concentration camps.</p><p>By contrast, Nobel Laureate Imre Kertész argues that those who take the film to be a comedy, rather than a tragedy, have missed the point of the film. He draws attention to what he terms 'Holocaust conformism' in cinema to rebuff detractors of Life Is Beautiful.</p><p>Israeli screenwriter, author and art critic Kobi Niv published the book Life is Beautiful, But Not for Jews (in 2000 in Hebrew and an English translation in 2003) in which he analyzed the movie from a highly critical perspective, suggesting that the film's underlining narrative is harmful for Jews.</p><p>Another academic analysis of the movie was undertaken by Ilona Klein, who analyzes the film's success and refers to the \"ambiguous themes hidden within.\" Klein suggests that one of the reasons the movie was so successful was its appeal of \"sentimental optimism\". At the same time, she points out that \"Miramax's hype billed this film as a fable about 'love, family, and the power of imagination,' yet most Jewish victims of the Nazis' 'Final Solution' were loving, concerned, devoted parents. No amount of love, family, and power of imagination helped their children survive the gas chambers.\"</p><p>David Sterritt of The Christian Science Monitor highlighted that \"Enthusiasm for the movie has not been as unanimous as its ad campaign suggests, however, and audiences would do well to ponder its implicit attitudes.\" He pointed out that the movie implicitly suggests quick-witted confidence was a match for the terrors of fascist death camps, then added that \" fable ultimately obscures the human and historical events it sets out to illuminate.\"</p><h4>Accolades</h4><p>Life is Beautiful was shown at the 1998 Cannes Film Festival, and went on to win the Grand Prix. Upon receiving the award, Benigni kissed the feet of jury president Martin Scorsese.</p><p>At the 71st Academy Awards, Benigni won Best Actor for his role, with the film winning two more awards for Best Music, Original Dramatic Score and Best Foreign Language Film. Benigni jumped on top of the seats as he made his way to the stage to accept his first award, and upon accepting his second, said, \"This is a terrible mistake because I used up all my English!\"</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Date of ceremony</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref(s)</abbr></th></tr><tr><th scope=\"row\" rowspan=\"7\"><span>Academy Awards</span></th><td rowspan=\"7\"><span>21 March 1999</span></td><td><span>Best Picture</span></td><td><span>Elda Ferri</span> and <span>Gianluigi Braschi</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"7\"></td></tr><tr><td><span>Best Director</span></td><td rowspan=\"2\"><span>Roberto Benigni</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Roberto Benigni and <span>Vincenzo Cerami</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td><span>Italy</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Simona Paggi</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Music, Original Dramatic Score</span></td><td><span>Nicola Piovani</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Australian Film Institute Awards</span></th><td>1999</td><td><span>Best Foreign Film</span></td><td>Roberto Benigni, Elda Ferri and Gianluigi Braschi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\" rowspan=\"3\"><span>BAFTA Awards</span></th><td rowspan=\"3\"><span>11 April 1999</span></td><td><span>Best Film Not in the English Language</span></td><td>Roberto Benigni, Elda Ferri and Gianluigi Braschi</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Film Original Screenplay Writing</span></td><td>Roberto Benigni and Vincenzo Cerami</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Actor in a Leading Role</span></td><td rowspan=\"3\">Roberto Benigni</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Cannes Film Festival</span></th><td rowspan=\"1\"><span>13–24 May 1998</span></td><td><span>Grand Prize</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\"><span>César Awards</span></th><td rowspan=\"1\"><span>6 March 1999</span></td><td><span>Best Foreign Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\" rowspan=\"2\"><span class=\"mw-redirect\">Critics' Choice Awards</span></th><td rowspan=\"2\"><span>19 January 1999</span></td><td><span>Best Movie</span></td><th></th><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Movie in a Foreign Language</span></td><td rowspan=\"3\">Roberto Benigni</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\" rowspan=\"13\"><span>David di Donatello Awards</span></th><td rowspan=\"13\">1998</td><td><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"13\"></td></tr><tr><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Producer</span></td><td>Elda Ferri and Gianluigi Braschi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Script</span></td><td>Roberto Benigni and Vincenzo Cerami</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Leading Role</span></td><td>Roberto Benigni</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td>Sergio Bustric</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Tonino Delli Colli</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Editing</span></td><td><span>Simona Paggi</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td>Tullio Morganti</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Score</span></td><td>Nicola Piovani</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Production Design</span></td><td rowspan=\"2\"><span>Danilo Donati</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costumes</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Scholars Jury David</span></td><td>Roberto Benigni</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\" rowspan=\"2\"><span>European Film Awards</span></th><td rowspan=\"2\"><span>7 December 1998</span></td><td><span>Best Film</span></td><td>Elda Ferri and Gianluigi Braschi</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Leading Actor</span></td><td>Roberto Benigni</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Jerusalem Film Festival</span></th><td>1998</td><td>Best Jewish Experience</td><th></th><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr><tr><th scope=\"row\" rowspan=\"2\"><span>Screen Actors Guild Awards</span></th><td rowspan=\"2\"><span>7 March 1999</span></td><td><span>Outstanding Performance by an Ensemble in a Motion Picture</span></td><td><span class=\"mw-selflink-fragment\">Cast</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Outstanding Performance by a Male Actor in a Leading Role in a Motion Picture</span></td><td rowspan=\"2\">Roberto Benigni</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Toronto International Film Festival</span></th><td rowspan=\"1\"><span>10–19 September 1998</span></td><td><span>People's Choice Award</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\"></td></tr></tbody></table><br/><h3>Soundtrack</h3><p>The original score to the film was composed by Nicola Piovani, with the exception of a classical piece which figures prominently: the \"Barcarolle\" by Jacques Offenbach and A Musical Joke by Mozart. The soundtrack album won the Academy Award for Best Original Dramatic Score and was nominated for a Grammy Award: \"Best Instrumental Composition Written for a Motion Picture, Television or Other Visual Media\", but lost to the score of A Bug's Life.</p><br/>"
  },
  "errorMessage": ""
}