{
  "imDbId": "tt1853728",
  "title": "Django Unchained",
  "fullTitle": "Django Unchained (2012)",
  "type": "Movie",
  "year": "2012",
  "language": "en",
  "titleInLanguage": "Django Unchained",
  "url": "https://en.wikipedia.org/wiki/Django_Unchained",
  "plotShort": {
    "plainText": "Django Unchained (/ˈdʒæŋɡoʊ/) is a 2012 American revisionist Western film written and directed by Quentin Tarantino, starring Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles. Set in the Old West and Antebellum South, it is a highly stylized, heavily revisionist tribute to Spaghetti Westerns, in particular the 1966 Italian film Django by Sergio Corbucci (the star of which, Franco Nero, has a cameo appearance). The story follows a black slave who trains under a German bounty hunter with the ultimate goal of reuniting with his long-lost wife.\r\nDevelopment of Django Unchained began in 2007 when Tarantino was writing a book on Corbucci. By April 2011, Tarantino sent his final draft of the script to The Weinstein Company. Casting began in the summer of 2011, with Michael K. Williams and Will Smith being considered for the role of the title character before Foxx was cast. Principal photography took place from November 2011 to March 2012 in California, Wyoming, and Louisiana.\r\nThe premiere of Django Unchained took place at the Ziegfeld Theatre in New York City on December 11, 2012, and was theatrically released on December 25, 2012, in the United States, grossing over $426 million worldwide against its $100 million budget, becoming Tarantino's highest grossing movie to date. The film received acclaim from critics, mainly for Waltz's performance and Tarantino's direction and screenplay, though the film's usage of the word \"nigger\" and the film's graphic violence drew controversy. The film received numerous awards and nominations, winning two out of five nominations at the 85th Academy Awards. Waltz won several awards for his performance, among them Best Supporting Actor at the Academy Awards, Golden Globes and BAFTAs. For his screenplay, Tarantino won an Academy Award, a Golden Globe, and a BAFTA.",
    "html": "<p>Django Unchained (/ˈdʒæŋɡoʊ/) is a 2012 American revisionist Western film written and directed by Quentin Tarantino, starring Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles. Set in the Old West and Antebellum South, it is a highly stylized, heavily revisionist tribute to Spaghetti Westerns, in particular the 1966 Italian film Django by Sergio Corbucci (the star of which, Franco Nero, has a cameo appearance). The story follows a black slave who trains under a German bounty hunter with the ultimate goal of reuniting with his long-lost wife.</p><p>Development of Django Unchained began in 2007 when Tarantino was writing a book on Corbucci. By April 2011, Tarantino sent his final draft of the script to The Weinstein Company. Casting began in the summer of 2011, with Michael K. Williams and Will Smith being considered for the role of the title character before Foxx was cast. Principal photography took place from November 2011 to March 2012 in California, Wyoming, and Louisiana.</p><p>The premiere of Django Unchained took place at the Ziegfeld Theatre in New York City on December 11, 2012, and was theatrically released on December 25, 2012, in the United States, grossing over $426 million worldwide against its $100 million budget, becoming Tarantino's highest grossing movie to date. The film received acclaim from critics, mainly for Waltz's performance and Tarantino's direction and screenplay, though the film's usage of the word \"nigger\" and the film's graphic violence drew controversy. The film received numerous awards and nominations, winning two out of five nominations at the 85th Academy Awards. Waltz won several awards for his performance, among them Best Supporting Actor at the Academy Awards, Golden Globes and BAFTAs. For his screenplay, Tarantino won an Academy Award, a Golden Globe, and a BAFTA.</p>"
  },
  "plotFull": {
    "plainText": "Django Unchained (/ˈdʒæŋɡoʊ/) is a 2012 American revisionist Western film written and directed by Quentin Tarantino, starring Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles. Set in the Old West and Antebellum South, it is a highly stylized, heavily revisionist tribute to Spaghetti Westerns, in particular the 1966 Italian film Django by Sergio Corbucci (the star of which, Franco Nero, has a cameo appearance). The story follows a black slave who trains under a German bounty hunter with the ultimate goal of reuniting with his long-lost wife.\r\nDevelopment of Django Unchained began in 2007 when Tarantino was writing a book on Corbucci. By April 2011, Tarantino sent his final draft of the script to The Weinstein Company. Casting began in the summer of 2011, with Michael K. Williams and Will Smith being considered for the role of the title character before Foxx was cast. Principal photography took place from November 2011 to March 2012 in California, Wyoming, and Louisiana.\r\nThe premiere of Django Unchained took place at the Ziegfeld Theatre in New York City on December 11, 2012, and was theatrically released on December 25, 2012, in the United States, grossing over $426 million worldwide against its $100 million budget, becoming Tarantino's highest grossing movie to date. The film received acclaim from critics, mainly for Waltz's performance and Tarantino's direction and screenplay, though the film's usage of the word \"nigger\" and the film's graphic violence drew controversy. The film received numerous awards and nominations, winning two out of five nominations at the 85th Academy Awards. Waltz won several awards for his performance, among them Best Supporting Actor at the Academy Awards, Golden Globes and BAFTAs. For his screenplay, Tarantino won an Academy Award, a Golden Globe, and a BAFTA.\r\nPlot\r\nIn 1858 Texas, brothers Ace and Dicky Speck drive a group of shackled black slaves on foot. Among them is Django, sold off and separated from his wife Broomhilda von Shaft, a house slave who speaks German and English. They are stopped by Dr. King Schultz, a German dentist-turned-bounty hunter seeking to buy Django for his knowledge of the three outlaw Brittle brothers, overseers at the plantation of Django's previous owner and for whom Schultz has a warrant. When Ace refuses to sell Django to Schultz and cocks his gun, Schultz kills him and shoots Dicky's horse in order to pin him to the ground; he advises the freed slaves to take the opportunity for revenge. Schultz offers Django his freedom and $75 in exchange for help tracking down the Brittles.\r\nDjango and Schultz kill the Brittle brothers at Spencer \"Big Daddy\" Bennett's Tennessee plantation. In turn, Bennett pursues them with an armed posse. Schultz ambushes the posse with explosives and Django kills Bennett. Feeling responsible for Django, Schultz agrees to help him find and rescue Broomhilda. They return to Texas where Django collects his first bounty, keeping the handbill as a memento and for good luck. He and Schultz rack up several bounties before spring when they travel to Mississippi and learn that Broomhilda's new owner is a member of the American gentry Calvin J. Candie, the charming but cruel owner of the \"Candyland\" plantation, where male slaves are forced to wrestle to the death in brutal \"Mandingo\" fights.\r\nSchultz and Django hatch a plan: deciding that Candie will refuse to sell Broomhilda if they try to buy her upfront, they will instead offer $12,000 (equivalent to $406,000 in 2022) for one of his best fighters as a pretext to acquiring Broomhilda for a nominal sum. They meet Candie at his gentlemen's club and make the offer. Intrigued, Candie invites them to Candyland. En route, the group encounters Candie's slave trackers who have cornered D'Artagnan, an escapee Mandingo fighter. Django is forced to intervene when Schultz foolishly attempts to buy D'Artagnan on the spot to save him. Candie has the trackers' guard dogs maul D'Artagnan to death, visibly upsetting Schultz.\r\nHaving told Broomhilda of their plan, Schultz offers to buy her as his escort while negotiating the initial Mandingo deal during dinner. Candie's staunchly loyal and suspicious head house slave Stephen realizes that Broomhilda knows Django, deduces their plan, and alerts Candie. Enraged, Candie alters the deal at gunpoint to sell Broomhilda for $12,000 instead of the fighter; Schultz reluctantly agrees. During the sale's finalization, Candie threatens to kill Broomhilda if Schultz does not shake his hand to seal the deal. Having had enough of Candie's arrogance, Schultz shoots and kills Candie. Butch Pooch, Candie's bodyguard, kills Schultz, and Django kills Pooch, Candie's lawyer Leonide Moguy, and several of Candie's henchmen, but is forced to surrender when Broomhilda is taken hostage.\r\nThe next morning, the chained Django is tortured and about to be castrated by overseer Billy Crash when Stephen arrives, informing him that Candie's sister Lara, who has taken charge of the plantation, has ordered him to be sold to a mining company and worked to death. En route there, Django devises an escape plan and uses his first handbill to prove to his escorts that he is a bounty hunter. He falsely says the men on the handbill, from his first bounty, are at Candyland and promises the escorts a share of the reward money. Once released, Django kills his escorts, gets his clothes and weapons back, and returns to Candyland with dynamite.\r\nRecovering Broomhilda's freedom papers from Schultz's corpse, Django bids his deceased mentor goodbye and avenges him and D'Artagnan by killing the trackers. He then frees Broomhilda just as Candie's mourners return from his burial. At the mansion, Django kills Lara, Crash, and the remaining henchmen, releases the two remaining house slaves, and kneecaps Stephen before igniting the dynamite he had planted throughout the mansion. Django and Broomhilda watch from a distance as the mansion explodes before riding off together.\r\nCast\r\nJamie Foxx as Django Freeman\r\nChristoph Waltz as Dr. King Schultz\r\nLeonardo DiCaprio as \"Monsieur\" Calvin J. Candie\r\nKerry Washington as Broomhilda \"Hildi\" von Shaft\r\nSamuel L. Jackson as Stephen Warren\r\nWalton Goggins as Billy Crash\r\nDennis Christopher as Leonide \"Leo\" Moguy\r\nJames Remar as Butch Pooch / Ace Speck\r\nDavid Steen as Mr. Stonecipher\r\nDana Gourrier as Cora\r\nNichole Galicia as Sheba\r\nLaura Cayouette as Lara Lee Candie-Fitzwilly\r\nAto Essandoh as D'Artagnan\r\nSammi Rotibi as Rodney\r\nClay Donahue Fontenot as Luigi\r\nEscalante Lundy as Big Fred\r\nMiriam F. Glover as Betina\r\nDon Johnson as Spencer \"Big Daddy\" Bennett\r\nFranco Nero as Amerigo Vessepi\r\nOther roles include James Russo as Dicky Speck, brother of Ace Speck and erstwhile owner of Django. Tom Wopat, Omar J. Dorsey, and Don Stroud play U.S. Marshal Gill Tatum, Chicken Charlie, and as Sheriff Bill Sharp respectively. Bruce Dern appears as Old Man Carrucan, the owner of the Carrucan Plantation. M. C. Gainey, Cooper Huckabee, and Doc Duhame portray brothers Big John Brittle, Roger \"Lil Raj\" Brittle, and Ellis Brittle respectively, overseers of both Carrucan and Big Daddy's plantations.\r\nJonah Hill plays Bag Head #2, a member of Bennett's masked white supremacist group. Additional roles include Lee Horsley as Sheriff Gus, Rex Linn as Tennessee Harry, Misty Upham as Minnie, and Danièle Watts as Coco. Russ Tamblyn and his daughter Amber appear as townspeople in Daugherty, Texas; their roles are respectively credited as \"Son of a Gunfighter\" and \"Daughter of Son of a Gunfighter\". Zoë Bell, Michael Bowen, Robert Carradine, Jake Garber, Ted Neeley, James Parks, and Tom Savini play Candyland trackers. Jacky Ido, who played Marcel in Tarantino's Inglourious Basterds, makes an uncredited appearance as a slave. Michael Parks as Roy and John Jarratt as Floyd, alongside Tarantino himself in a cameo appearance as Frankie, play the LeQuint Dickey Mining Company employees. Tarantino also appears in the film as a masked Bag Head named Robert.\r\nProduction\r\nDevelopment\r\nIn 2007, Tarantino discussed an idea for a type of Spaghetti Western set in the United States' pre-Civil War Deep South. He called this type of film \"a Southern\", stating that he wanted\r\nto do movies that deal with America's horrible past with slavery and stuff but do them like Spaghetti Westerns, not like big issue movies. I want to do them like they're genre films, but they deal with everything that America has never dealt with because it's ashamed of it, and other countries don't really deal with because they don't feel they have the right to.\r\nTarantino later explained the genesis of the idea:\r\nI was writing a book about Sergio Corbucci when I came up with a way to tell the story. ... I was writing about how his movies have this evil Wild West, a horrible Wild West. It was surreal, it dealt a lot with fascism. So I'm writing this whole piece on this, and I'm thinking: 'I don't really know if Sergio was thinking while he was doing this. But I know I'm thinking about it now. And I can do it!'\r\nTarantino finished the script on April 26, 2011, and handed in the final draft to The Weinstein Company. In October 2012, frequent Tarantino collaborator RZA said that he and Tarantino had intended to cross over Django Unchained with RZA's Tarantino-presented martial-arts film The Man with the Iron Fists. The crossover would have seen a younger version of the blacksmith character from RZA's film appear as a slave in an auction. However, scheduling conflicts prevented RZA's participation.\r\nOne inspiration for the film is Corbucci's 1966 Spaghetti Western Django, whose star Franco Nero has a cameo appearance in Django Unchained. Another inspiration is the 1975 film Mandingo, about a slave trained to fight other slaves. Tarantino included scenes in the snow as a homage to The Great Silence. \"Silenzio takes place in the snow. I liked the action in the snow so much, Django Unchained has a big snow section in the middle,\" Tarantino said in an interview. Tarantino credits the character and attitude of the German dentist turned bounty hunter King Schultz to the German Karl May Wild West films of the 1960s, namely their hero Old Shatterhand.\r\nThe title Django Unchained alludes to the titles of the 1966 Corbucci film Django; Hercules Unchained, the American title for the 1959 Italian epic fantasy film Ercole e la regina di Lidia, about the mythical hero's escape from enslavement to a wicked master; and to Angel Unchained, the 1970 American biker film about a biker exacting revenge on a large group of rednecks.\r\nCasting\r\nAmong those considered for the title role of Django, Michael K. Williams and Will Smith were mentioned as possibilities, but in the end Jamie Foxx was cast in the role. Smith later said he turned down the role because it \"wasn't the lead\". Tyrese Gibson sent in an audition tape as the character. Franco Nero, the original Django from the 1966 Italian film, was rumored for the role of Calvin Candie, but instead was given a cameo appearance as a minor character. Nero suggested that he play a mysterious horseman who haunts Django in visions and is revealed in an ending flashback to be Django's father; Tarantino opted not to use the idea. Kevin Costner was in negotiations to join as Ace Woody, a Mandingo trainer and Candie's right-hand man, but Costner dropped out due to scheduling conflicts. Kurt Russell was cast instead but also later left the role. When Kurt Russell dropped out, the role of Ace Woody was not recast; instead, the character was merged with Walton Goggins's character, Billy Crash.\r\nJonah Hill was offered the role of Scotty Harmony, a gambler who loses Broomhilda to Candie in a poker game, but turned it down due to scheduling conflicts with The Watch. Sacha Baron Cohen was also offered the role, but declined in order to appear in Les Misérables. Neither Scotty nor the poker game appear in the final cut of the film. Hill later appeared in the film in a different role. Joseph Gordon-Levitt said that he \"would have loved, loved to have\" been in the film but would be unable to appear because of a prior commitment to direct his first film, Don Jon.\r\nCostume design\r\nIn a January 2013 interview with Vanity Fair, costume designer Sharen Davis said much of the film's wardrobe was inspired by spaghetti westerns and other works of art. For Django's wardrobe, Davis and Tarantino watched the television series Bonanza and referred to it frequently. The pair even hired the hatmaker who designed the hat worn by the Bonanza character Little Joe, played by Michael Landon. Davis described Django's look as a \"rock-n-roll take on the character\". Django's sunglasses were inspired by Charles Bronson's character in The White Buffalo (1977). Davis used Thomas Gainsborough's 1770 oil painting The Blue Boy as a reference for Django's valet outfit.\r\nIn the final scene, Broomhilda wears a dress similar to that of Ida Galli's character in Blood for a Silver Dollar (1965). Davis said the idea of Calvin Candie's costume came partly from Rhett Butler, and that Don Johnson's signature Miami Vice look inspired Big Daddy's cream-colored linen suit in the film. King Schultz's faux chinchilla coat was inspired by Telly Savalas in Kojak. Davis also revealed that many of her costume ideas did not make the final cut of the film, leaving some unexplained characters such as Zoë Bell's tracker, who was intended to drop her bandana to reveal an absent jaw.\r\nFilming\r\nPrincipal photography for Django Unchained started in California in November 2011 continuing in Wyoming in February 2012 and at the National Historic Landmark Evergreen Plantation in Wallace, Louisiana, outside of New Orleans, in March 2012. The film was shot in the anamorphic format on 35 mm film. Although originally scripted, a sub-plot centering on Zoë Bell's masked tracker was cut, and remained unfilmed, due to time constraints. After 130 shooting days, the film wrapped up principal photography in July 2012.\r\nDjango Unchained was the first Tarantino film not edited by Sally Menke, who died in 2010. Editing duties were instead handled by Fred Raskin, who had worked as an assistant editor on Tarantino's Kill Bill. Raskin was nominated for a BAFTA Award for Best Editing but lost to William Goldenberg for his work on Argo.\r\nKerry Washington sought to bring authenticity to her performance in several ways. The actor playing her overseer used a fake whip, but Washington insisted the lashings really hit her back. And to dramatize her punishment inside an underground, coffin-size metal container, she and Tarantino agreed she would spend time barely clothed in the \"hot box\" before the filming began so the feeling of confinement would be as realistic as possible.\r\nBroken glass incident\r\nDuring the scene when DiCaprio's character explains phrenology, DiCaprio cut his left hand upon striking the table and smashing a small glass. Despite his hand profusely bleeding, DiCaprio barely reacted and remained in character under the astonished eyes of his fellow actors. He is seen taking out pieces of broken glass from his hand during the scene. After Tarantino's cut, there was a standing ovation by the other actors to praise DiCaprio's performance despite the incident; Tarantino, therefore, decided to keep this sequence in the final cut. DiCaprio is seen with his left hand bandaged in the scene after when he is signing Broomhilda's papers. Contrary to popular belief, DiCaprio wiped fake blood on Washington's face in a separate take.\r\nMusic\r\nThe film features both original and existing music tracks. Tracks composed specifically for the film include \"100 Black Coffins\" by Rick Ross and produced by and featuring Jamie Foxx, \"Who Did That To You?\" by John Legend, \"Ancora Qui\" by Ennio Morricone and Elisa, and \"Freedom\" by Anthony Hamilton and Elayna Boynton. The theme, \"Django\", was also the theme song of the 1966 film. Musician Frank Ocean wrote an original song for the film's soundtrack, but it was rejected by Tarantino, who explained that \"Ocean wrote a fantastic ballad that was truly lovely and poetic in every way, but there just wasn't a scene for it.\" Ocean later published the song, entitled \"Wiseman\", on his Tumblr blog. The film also features a few famous pieces of western classical music, including Beethoven's \"Für Elise\" and \"Dies Irae\" from Verdi's Requiem. Tarantino has stated that he avoids using full scores of original music: \"I just don't like the idea of giving that much power to anybody on one of my movies.\" The film's soundtrack album was released on December 18, 2012. Morricone made statements criticizing Tarantino's use of his music in Django Unchained and stated that he would \"never work\" with the director after this film, but later agreed to compose an original film score for Tarantino's The Hateful Eight in 2015. In a scholarly essay on the film's music, Hollis Robbins notes that the vast majority of film music borrowings come from films made between 1966 and 1974 and argues that the political and musical resonances of these allusions situate Django Unchained squarely in the Vietnam and Watergate era, during the rise and decline of Black Power cinema. Jim Croce's hit \"I Got a Name\" was featured in the soundtrack.\r\nRelease\r\nMarketing\r\nThe first teaser poster was inspired by a fan-art poster by Italian artist Federico Mancosu. His artwork was published in May 2011, a few days after the synopsis and the official title were released to the public. In August 2011, at Tarantino's request, the production companies bought the concept artwork from Mancosu to use for promotional purposes as well as on the crew passes and clothing for staff during filming.\r\nTheatrical run\r\nDjango Unchained was released on December 25, 2012, in the United States by The Weinstein Company and released on January 18, 2013, by Sony Pictures Releasing in the United Kingdom. The film was screened for the first time at the Directors Guild of America on December 1, 2012, with additional screening events having been held for critics leading up to the film's wide release. The premiere of Django Unchained was delayed by one week following the shooting at an elementary school in Newtown, Connecticut, on December 14, 2012.\r\nThe film was released on March 22, 2013, by Sony Pictures in India. In March 2013, Django Unchained was announced to be the first Tarantino film approved for official distribution in China's strictly controlled film market. Lily Kuo, writing for Quartz, wrote that \"the film depicts one of America's darker periods, when slavery was legal, which Chinese officials like to use to push back against criticism from the United States\". The film was released in China on May 12, 2013.\r\nHome media\r\nThe film was released on DVD, Blu-ray, and Digital Download on April 16, 2013. In the United States, the film has grossed $31,939,733 from DVD sales and $30,286,838 from Blu-ray sales, making a total of $62,226,571.\r\nReception\r\nBox office\r\nDjango Unchained grossed $162.8 million in the United States and Canada and $263.2 million in other territories, for a worldwide total of $426 million, against a production budget of $100 million. As of 2013, Django Unchained is Tarantino's highest-grossing film, surpassing his 2009 film Inglourious Basterds, which grossed $321.4 million worldwide.\r\nIn North America, the film made $15 million on Christmas Day, finishing second behind fellow opener Les Misérables. It was the third-biggest opening day figure for a film on Christmas, following Sherlock Holmes ($24.6 million) and Les Misérables ($18.1 million). It went on to make $30.1 million in its opening weekend (a six-day total of $63.4 million), finishing second behind holdover The Hobbit: An Unexpected Journey.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 87% based on 291 reviews, and an average rating of 8/10. The website's critical consensus reads, \"Bold, bloody, and stylistically daring, Django Unchained is another incendiary masterpiece from Quentin Tarantino.\" Metacritic, which assigns a rating to reviews, gives the film a weighted average score of 81 out of 100, based on 42 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.\r\nRoger Ebert of the Chicago Sun-Times gave the film four stars out of four and said: \"The film offers one sensational sequence after another, all set around these two intriguing characters who seem opposites but share pragmatic, financial and personal issues.\" Ebert also added, \"had I not been prevented from seeing it sooner because of an injury, this would have been on my year's best films list.\" Peter Bradshaw, film critic for The Guardian, awarded the film five stars, writing: \"I can only say Django delivers, wholesale, that particular narcotic and delirious pleasure that Tarantino still knows how to confect in the cinema, something to do with the manipulation of surfaces. It's as unwholesome, deplorable and delicious as a forbidden cigarette.\" Writing in The New York Times, critic A. O. Scott compared Django to Tarantino's earlier Inglourious Basterds: \"Like Inglourious Basterds, Django Unchained is crazily entertaining, brazenly irresponsible and also ethically serious in a way that is entirely consistent with its playfulness.\" Designating the film a Times \"critics\" pick, Scott said Django is \"a troubling and important movie about slavery and racism.\" Filmmaker Michael Moore praised Django, tweeting that the movie \"is one of the best film satires ever.\"\r\nTo the contrary, Owen Gleiberman, film critic for the Entertainment Weekly, wrote: \"Django isn't nearly the film that Inglourious was. It's less clever, and it doesn't have enough major characters – or enough of Tarantino's trademark structural ingenuity – to earn its two-hour-and-45-minute running time.\" In his review for the Indy Week, David Fellerath wrote: \"Django Unchained shows signs that Tarantino did little research beyond repeated viewings of Sergio Corbucci's 1966 spaghetti Western Django and a blaxploitation from 1975 called Boss Nigger, written by and starring Fred Williamson.\" New Yorker's Anthony Lane was \"disturbed by their yelps of triumphant laughter, at the screening I attended, as a white woman was blown away by Django's guns.\"\r\nAn entire issue of the academic journal Safundi was devoted to Django Unchained in \"Django Unchained and the Global Western,\" featuring scholars who contextualize Tarantino's film as a classic \"western\". Dana Phillips writes: \"Tarantino's film is immensely entertaining, not despite but because it is so very audacious—even, at times, downright lurid, thanks to its treatment of slavery, race relations, and that staple of the Western, violence. No doubt these are matters that another director would have handled more delicately, and with less stylistic excess, than Tarantino, who has never been bashful. Another director also would have been less willing to proclaim his film the first in a new genre, the 'Southern'.\"\r\nTop ten lists\r\nDjango Unchained was listed on many critics' top ten lists of 2012.\r\nTop 10 (ranked alphabetically) – Claudia Puig, USA Today\r\nTop 10 (ranked alphabetically) – Joe Williams, St. Louis Post-Dispatch\r\nTop 10 (ranked alphabetically) – Stephanie Zacharek, Film.com\r\n1st – Amy Nicholson, Movieline\r\n2nd – Mick LaSalle, San Francisco Chronicle\r\n2nd – Drew McWeeny, Hitfix\r\n2nd – Michelle Orange, The Village Voice\r\n2nd – Nathan Rabin, The A.V. Club\r\n2nd – Betsy Sharkey, Los Angeles Times (tied with Lincoln)\r\n3rd – Richard Jameson, MSN Movies\r\n3rd – Alan Scherstuhl, The Village Voice\r\n4th – Mark Mohan, The Oregonian\r\n4th – Joe Neumaier, New York Daily News\r\n4th – James Rocchi, MSN Movies\r\n4th – Kristopher Tapley, HitFix\r\n4th – Drew Taylor & Caryn James, Indiewire\r\n5th - The Huffington Post\r\n5th – David Ehrlich, Movies.com\r\n5th – Scott Foundas, The Village Voice\r\n5th – Wesley Morris, The Boston Globe\r\n6th – James Berardinelli, Reelviews\r\n6th – Lisa Kennedy, Denver Post\r\n6th – Kat Murphy, MSN Movies\r\n6th – Richard Roeper, Chicago Sun-Times\r\n6th – Mike Scott, The Times-Picayune\r\n7th – Drew Hunt, Chicago Reader\r\n7th – A.O. Scott, The New York Times\r\n8th – Ty Burr, The Boston Globe\r\n9th – Todd McCarthy, The Hollywood Reporter\r\n10th – Karina Longworth, The Village Voice\r\n10th – Joshua Rothkopf, Time Out New York\r\n10th – Marlow Stern, The Daily Beast\r\n10th – Peter Travers, Rolling Stone\r\nAccolades\r\nDjango Unchained garnered several awards and nominations. The American Film Institute named it one of their Top Ten Movies of the Year in December 2012. The film received five Golden Globe Award nominations, including Best Picture, and Best Director and Best Screenplay for Tarantino. Tarantino won an Academy Award for Best Original Screenplay. Christoph Waltz received the Academy Award for Best Supporting Actor, the Golden Globe Award for Best Supporting Actor, and the BAFTA Award for Best Supporting Actor, his second time receiving all three awards, having previously won for his role in Tarantino's Inglourious Basterds. The NAACP Image Awards gave the film four nominations, while the National Board of Review named DiCaprio their Best Supporting Actor. Django Unchained earned a nomination for Best Theatrical Motion Picture from the Producers Guild of America.\r\nControversy\r\nRacist language, portrayal of African American slavery\r\nSome commentators thought that the film's heavy usage of the word \"nigger\" is inappropriate, affecting them to an even greater extent than the depicted violence against the slaves. Other reviewers have defended the usage of the language in the historical context of race and slavery in the United States.\r\nAfrican-American filmmaker Spike Lee, in an interview with Vibe, said he would not see the film, explaining \"All I'm going to say is that it's disrespectful to my ancestors. That's just me ... I'm not speaking on behalf of anybody else.\" Lee later wrote, \"American slavery was not a Sergio Leone Spaghetti Western. It was a Holocaust. My ancestors are slaves stolen from Africa. I will honor them.\"\r\nActor and activist Jesse Williams has contrasted accuracy of the racist language used in the film with what he sees as the film's lack of accuracy about the general lives of slaves, too often portrayed as \"well-dressed Negresses in flowing gowns, frolicking on swings and enjoying leisurely strolls through the grounds, as if the setting is Versailles, mixed in with occasional acts of barbarism against slaves ... That authenticity card that Tarantino uses to buy all those 'niggers' has an awfully selective memory.\" He also criticizes the lack of solidarity between slave characters, and their general lack of a will to escape from slavery, with Django as the notable exception.\r\nWesley Morris of The Boston Globe compared Samuel L. Jackson's Stephen character to black Republicans like Clarence Thomas or Herman Cain. Jackson said that he believed his character to have \"the same moral compass as Clarence Thomas does\". Jackson defended heavy use of the word \"nigger\": \"Saying Tarantino said 'nigger' too many times is like complaining they said 'kyke' too many times in a movie about Nazis.\" The review by Jesse Williams notes, however, that these antisemitic terms were not used nearly as frequently in Tarantino's film about Nazis, Inglourious Basterds, suggesting the Jewish community would not have accepted it.\r\nMarc Lamont Hill, a professor at Temple University, compared the fugitive ex–Los Angeles police officer Christopher Dorner to a real-life Django, saying \"It's almost like watching 'Django Unchained' in real life. It's kind of exciting.\" Writing in the Los Angeles Times, journalist Erin Aubry Kaplan noted the difference between Tarantino's Jackie Brown and Django Unchained: \"It is an institution whose horrors need no exaggerating, yet Django does exactly that, either to enlighten or entertain. A white director slinging around the n-word in a homage to '70s blaxploitation à la Jackie Brown is one thing, but the same director turning the savageness of slavery into pulp fiction is quite another.\"\r\nWhile hosting NBC's Saturday Night Live, Jamie Foxx joked about being excited \"to kill all the white people in the movie\". Conservative columnist Jeff Kuhner wrote a reaction to the SNL skit for The Washington Times, saying: \"Anti-white bigotry has become embedded in our postmodern culture. Take Django Unchained. The movie boils down to one central theme: the white man as devil—a moral scourge who must be eradicated like a lethal virus.\"\r\nSamuel L. Jackson told Vogue Man that \"Django Unchained was a harder and more detailed exploration of what the slavery experience was than 12 Years a Slave, but director Steve McQueen is an artist and since he's respected for making supposedly art films, it's held in higher esteem than Django, because that was basically a blaxploitation movie.\"\r\nUse of violence\r\nThe film became infamous for its brutality, with some reviews criticizing it for being much too violent. The originally planned premiere of Django was postponed following the Sandy Hook school shooting on December 14, 2012. Thomas Frank criticized the film's use of violence as follows:\r\nNot surprisingly, Quentin Tarantino has lately become the focus for this sort of criticism (about the relationship between the movies and acts of violence). The fact that Django Unchained arrived in theaters right around the time of the Sandy Hook massacre didn't help. Yet he has refused to give an inch in discussing the link between movie violence and real life. Obviously I don't think one has to do with the other. Movies are about make-believe. It's about imagination. Part of the thing is trying to create a realistic experience, but we are faking it. Is it possible that anyone in our cynical world credits a self-serving sophistry like this? Of course an industry under fire will claim that its hands are clean, just as the NRA has done – and of course a favorite son, be it Tarantino or LaPierre, can be counted on to make the claim louder than anyone else. But do they really believe that imaginative expression is without consequence?\r\nThe Independent said the movie was part of \"the new sadism in cinema\" and added, \"There is something disconcerting about sitting in a crowded cinema as an audience guffaws at the latest garroting or falls about in hysterics as someone is beheaded or has a limb lopped off\".\r\nAdam Serwer from Mother Jones said, \"Django, like many Tarantino films, also has been criticized as cartoonishly violent, but it is only so when Django is killing slave owners and overseers. The violence against slaves is always appropriately terrifying. This, if nothing else, puts Django in the running for Tarantino's best film, the first one in which he discovers violence as horror rather than just spectacle. When Schultz turns his head away from a slave being torn apart by dogs, Django explains to Calvin Candie—the plantation owner played by Leo DiCaprio—that Schultz just isn't used to Americans.\"\r\nHistorical inaccuracies\r\nAlthough Tarantino has said about Mandingo fighting, \"I was always aware those things existed\", there is no definitive historical evidence that slave owners ever staged gladiator-like fights to the death between male slaves like the fight depicted in the movie. Historian Edna Greene Medford notes that there are only undocumented rumors that such fights took place. David Blight, the director of Yale's center for the study of slavery, said it was not a matter of moral or ethical reservations that prevented slave owners from pitting slaves against each other in combat, but rather economic self-interest: slave owners would not have wanted to put their substantial financial investments at risk in gladiatorial battles.\r\nThe non-historical term \"Mandingo\" for a fine fighting or breeding slave comes not from Tarantino, but the 1975 film Mandingo which was itself based on a 1957 novel with the same title.\r\nWriting in The New Yorker, William Jelani Cobb observed that Tarantino's occasional historical elasticity sometimes worked to the film's advantage. \"There are moments,\" Cobb wrote, \"where this convex history works brilliantly, like when Tarantino depicts the Ku Klux Klan a decade prior to its actual formation in order to thoroughly ridicule its members' veiled racism.\" However, Tarantino holds that the masked marauders depicted in the film were not the KKK, but a group known as \"The Regulators\". They were depicted as spiritual forebears of the later post-civil war KKK and not as the actual KKK.\r\nOn the matter of historical accuracy, Christopher Caldwell wrote in the Financial Times: \"Of course, we must not mistake a feature film for a public television documentary\", pointing out that the film should be treated as entertainment, not as a historical account of the period it is set in. \"Django uses slavery the way a pornographic film might use a nurses' convention: as a pretext for what is really meant to entertain us. What is really meant to entertain us in Django is violence.\" Richard Brody, however, wrote in The New Yorker that Tarantino's \"vision of slavery's monstrosity is historically accurate.... Tarantino rightly depicts slavery as no mere administrative ownership but a grievous and monstrous infliction of cruelty.\"\r\nAlleged copyright infringement\r\nIn December 2015, a $100 million lawsuit was filed against Tarantino by filmmakers Oscar Colvin Jr. and Torrance J. Colvin, who claimed that the script for Django Unchained bears extensive similarities to their film, titled Freedom. The lawsuit was filed in a federal court in Washington, DC. On January 24, 2017, the lawsuit was dismissed.\r\nComic book adaptations\r\nA comic book adaptation of Django Unchained was released by DC Comics in 2013. In 2015, a sequel crossover comic entitled Django/Zorro was released by Dynamite Entertainment, co-written by Tarantino and Matt Wagner, the latter being the first comic book sequel to a Quentin Tarantino film.\r\nFuture\r\nProposed miniseries\r\nTarantino has said in an interview that he has 90 minutes of unused material and considered re-editing Django Unchained into a four-hour, four-night cable miniseries. Tarantino said that breaking the story into four parts would be more satisfying to audiences than a four-hour movie: \"... it wouldn't be an endurance test. It would be a miniseries. And people love those.\"\r\nPotential crossover sequel\r\nTarantino's first attempt at a Django Unchained sequel was with the unpublished paperback novel titled Django in White Hell. However, after Tarantino decided that the tone of the developing story did not fit with the character's morals, he began re-writing it as an original screenplay which later became the director's follow-up film, The Hateful Eight.\r\nIn June 2019, Tarantino had picked Jerrod Carmichael to co-write a film adaptation based on the Django/Zorro crossover comic book series. Tarantino and Jamie Foxx have both expressed interest in having Antonio Banderas reprise his role as Zorro from The Mask of Zorro and The Legend of Zorro in the film in addition to Foxx himself reprising his role as Django.",
    "html": "<p>Django Unchained (/ˈdʒæŋɡoʊ/) is a 2012 American revisionist Western film written and directed by Quentin Tarantino, starring Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles. Set in the Old West and Antebellum South, it is a highly stylized, heavily revisionist tribute to Spaghetti Westerns, in particular the 1966 Italian film Django by Sergio Corbucci (the star of which, Franco Nero, has a cameo appearance). The story follows a black slave who trains under a German bounty hunter with the ultimate goal of reuniting with his long-lost wife.</p><p>Development of Django Unchained began in 2007 when Tarantino was writing a book on Corbucci. By April 2011, Tarantino sent his final draft of the script to The Weinstein Company. Casting began in the summer of 2011, with Michael K. Williams and Will Smith being considered for the role of the title character before Foxx was cast. Principal photography took place from November 2011 to March 2012 in California, Wyoming, and Louisiana.</p><p>The premiere of Django Unchained took place at the Ziegfeld Theatre in New York City on December 11, 2012, and was theatrically released on December 25, 2012, in the United States, grossing over $426 million worldwide against its $100 million budget, becoming Tarantino's highest grossing movie to date. The film received acclaim from critics, mainly for Waltz's performance and Tarantino's direction and screenplay, though the film's usage of the word \"nigger\" and the film's graphic violence drew controversy. The film received numerous awards and nominations, winning two out of five nominations at the 85th Academy Awards. Waltz won several awards for his performance, among them Best Supporting Actor at the Academy Awards, Golden Globes and BAFTAs. For his screenplay, Tarantino won an Academy Award, a Golden Globe, and a BAFTA.</p><br/><h3>Plot</h3><p>In 1858 Texas, brothers Ace and Dicky Speck drive a group of shackled black slaves on foot. Among them is Django, sold off and separated from his wife Broomhilda von Shaft, a house slave who speaks German and English. They are stopped by Dr. King Schultz, a German dentist-turned-bounty hunter seeking to buy Django for his knowledge of the three outlaw Brittle brothers, overseers at the plantation of Django's previous owner and for whom Schultz has a warrant. When Ace refuses to sell Django to Schultz and cocks his gun, Schultz kills him and shoots Dicky's horse in order to pin him to the ground; he advises the freed slaves to take the opportunity for revenge. Schultz offers Django his freedom and $75 in exchange for help tracking down the Brittles.</p><p>Django and Schultz kill the Brittle brothers at Spencer \"Big Daddy\" Bennett's Tennessee plantation. In turn, Bennett pursues them with an armed posse. Schultz ambushes the posse with explosives and Django kills Bennett. Feeling responsible for Django, Schultz agrees to help him find and rescue Broomhilda. They return to Texas where Django collects his first bounty, keeping the handbill as a memento and for good luck. He and Schultz rack up several bounties before spring when they travel to Mississippi and learn that Broomhilda's new owner is a member of the American gentry Calvin J. Candie, the charming but cruel owner of the \"Candyland\" plantation, where male slaves are forced to wrestle to the death in brutal \"Mandingo\" fights.</p><p>Schultz and Django hatch a plan: deciding that Candie will refuse to sell Broomhilda if they try to buy her upfront, they will instead offer $12,000 (equivalent to $406,000 in 2022) for one of his best fighters as a pretext to acquiring Broomhilda for a nominal sum. They meet Candie at his gentlemen's club and make the offer. Intrigued, Candie invites them to Candyland. En route, the group encounters Candie's slave trackers who have cornered D'Artagnan, an escapee Mandingo fighter. Django is forced to intervene when Schultz foolishly attempts to buy D'Artagnan on the spot to save him. Candie has the trackers' guard dogs maul D'Artagnan to death, visibly upsetting Schultz.</p><p>Having told Broomhilda of their plan, Schultz offers to buy her as his escort while negotiating the initial Mandingo deal during dinner. Candie's staunchly loyal and suspicious head house slave Stephen realizes that Broomhilda knows Django, deduces their plan, and alerts Candie. Enraged, Candie alters the deal at gunpoint to sell Broomhilda for $12,000 instead of the fighter; Schultz reluctantly agrees. During the sale's finalization, Candie threatens to kill Broomhilda if Schultz does not shake his hand to seal the deal. Having had enough of Candie's arrogance, Schultz shoots and kills Candie. Butch Pooch, Candie's bodyguard, kills Schultz, and Django kills Pooch, Candie's lawyer Leonide Moguy, and several of Candie's henchmen, but is forced to surrender when Broomhilda is taken hostage.</p><p>The next morning, the chained Django is tortured and about to be castrated by overseer Billy Crash when Stephen arrives, informing him that Candie's sister Lara, who has taken charge of the plantation, has ordered him to be sold to a mining company and worked to death. En route there, Django devises an escape plan and uses his first handbill to prove to his escorts that he is a bounty hunter. He falsely says the men on the handbill, from his first bounty, are at Candyland and promises the escorts a share of the reward money. Once released, Django kills his escorts, gets his clothes and weapons back, and returns to Candyland with dynamite.</p><p>Recovering Broomhilda's freedom papers from Schultz's corpse, Django bids his deceased mentor goodbye and avenges him and D'Artagnan by killing the trackers. He then frees Broomhilda just as Candie's mourners return from his burial. At the mansion, Django kills Lara, Crash, and the remaining henchmen, releases the two remaining house slaves, and kneecaps Stephen before igniting the dynamite he had planted throughout the mansion. Django and Broomhilda watch from a distance as the mansion explodes before riding off together.</p><br/><h3>Cast</h3><ul><li>Jamie Foxx as Django Freeman</li><li>Christoph Waltz as Dr. King Schultz</li><li>Leonardo DiCaprio as \"Monsieur\" Calvin J. Candie</li><li>Kerry Washington as Broomhilda \"Hildi\" von Shaft</li><li>Samuel L. Jackson as Stephen Warren</li><li>Walton Goggins as Billy Crash</li><li>Dennis Christopher as Leonide \"Leo\" Moguy</li><li>James Remar as Butch Pooch / Ace Speck</li><li>David Steen as Mr. Stonecipher</li><li>Dana Gourrier as Cora</li><li>Nichole Galicia as Sheba</li><li>Laura Cayouette as Lara Lee Candie-Fitzwilly</li><li>Ato Essandoh as D'Artagnan</li><li>Sammi Rotibi as Rodney</li><li>Clay Donahue Fontenot as Luigi</li><li>Escalante Lundy as Big Fred</li><li>Miriam F. Glover as Betina</li><li>Don Johnson as Spencer \"Big Daddy\" Bennett</li><li>Franco Nero as Amerigo Vessepi</li></ul><p>Other roles include James Russo as Dicky Speck, brother of Ace Speck and erstwhile owner of Django. Tom Wopat, Omar J. Dorsey, and Don Stroud play U.S. Marshal Gill Tatum, Chicken Charlie, and as Sheriff Bill Sharp respectively. Bruce Dern appears as Old Man Carrucan, the owner of the Carrucan Plantation. M. C. Gainey, Cooper Huckabee, and Doc Duhame portray brothers Big John Brittle, Roger \"Lil Raj\" Brittle, and Ellis Brittle respectively, overseers of both Carrucan and Big Daddy's plantations.</p><p>Jonah Hill plays Bag Head #2, a member of Bennett's masked white supremacist group. Additional roles include Lee Horsley as Sheriff Gus, Rex Linn as Tennessee Harry, Misty Upham as Minnie, and Danièle Watts as Coco. Russ Tamblyn and his daughter Amber appear as townspeople in Daugherty, Texas; their roles are respectively credited as \"Son of a Gunfighter\" and \"Daughter of Son of a Gunfighter\". Zoë Bell, Michael Bowen, Robert Carradine, Jake Garber, Ted Neeley, James Parks, and Tom Savini play Candyland trackers. Jacky Ido, who played Marcel in Tarantino's Inglourious Basterds, makes an uncredited appearance as a slave. Michael Parks as Roy and John Jarratt as Floyd, alongside Tarantino himself in a cameo appearance as Frankie, play the LeQuint Dickey Mining Company employees. Tarantino also appears in the film as a masked Bag Head named Robert.</p><br/><h3>Production</h3><h4>Development</h4><p>In 2007, Tarantino discussed an idea for a type of Spaghetti Western set in the United States' pre-Civil War Deep South. He called this type of film \"a Southern\", stating that he wanted</p><blockquote>to do movies that deal with America's horrible past with slavery and stuff but do them like Spaghetti Westerns, not like big issue movies. I want to do them like they're genre films, but they deal with everything that America has never dealt with because it's ashamed of it, and other countries don't really deal with because they don't feel they have the right to.</blockquote><p>Tarantino later explained the genesis of the idea:</p><blockquote>I was writing a book about Sergio Corbucci when I came up with a way to tell the story. ... I was writing about how his movies have this evil Wild West, a horrible Wild West. It was surreal, it dealt a lot with fascism. So I'm writing this whole piece on this, and I'm thinking: 'I don't really know if Sergio was thinking while he was doing this. But I know I'm thinking about it now. And I can do it!'</blockquote><p>Tarantino finished the script on April 26, 2011, and handed in the final draft to The Weinstein Company. In October 2012, frequent Tarantino collaborator RZA said that he and Tarantino had intended to cross over Django Unchained with RZA's Tarantino-presented martial-arts film The Man with the Iron Fists. The crossover would have seen a younger version of the blacksmith character from RZA's film appear as a slave in an auction. However, scheduling conflicts prevented RZA's participation.</p><p>One inspiration for the film is Corbucci's 1966 Spaghetti Western Django, whose star Franco Nero has a cameo appearance in Django Unchained. Another inspiration is the 1975 film Mandingo, about a slave trained to fight other slaves. Tarantino included scenes in the snow as a homage to The Great Silence. \"Silenzio takes place in the snow. I liked the action in the snow so much, Django Unchained has a big snow section in the middle,\" Tarantino said in an interview. Tarantino credits the character and attitude of the German dentist turned bounty hunter King Schultz to the German Karl May Wild West films of the 1960s, namely their hero Old Shatterhand.</p><p>The title Django Unchained alludes to the titles of the 1966 Corbucci film Django; Hercules Unchained, the American title for the 1959 Italian epic fantasy film Ercole e la regina di Lidia, about the mythical hero's escape from enslavement to a wicked master; and to Angel Unchained, the 1970 American biker film about a biker exacting revenge on a large group of rednecks.</p><h4>Casting</h4><p>Among those considered for the title role of Django, Michael K. Williams and Will Smith were mentioned as possibilities, but in the end Jamie Foxx was cast in the role. Smith later said he turned down the role because it \"wasn't the lead\". Tyrese Gibson sent in an audition tape as the character. Franco Nero, the original Django from the 1966 Italian film, was rumored for the role of Calvin Candie, but instead was given a cameo appearance as a minor character. Nero suggested that he play a mysterious horseman who haunts Django in visions and is revealed in an ending flashback to be Django's father; Tarantino opted not to use the idea. Kevin Costner was in negotiations to join as Ace Woody, a Mandingo trainer and Candie's right-hand man, but Costner dropped out due to scheduling conflicts. Kurt Russell was cast instead but also later left the role. When Kurt Russell dropped out, the role of Ace Woody was not recast; instead, the character was merged with Walton Goggins's character, Billy Crash.</p><p>Jonah Hill was offered the role of Scotty Harmony, a gambler who loses Broomhilda to Candie in a poker game, but turned it down due to scheduling conflicts with The Watch. Sacha Baron Cohen was also offered the role, but declined in order to appear in Les Misérables. Neither Scotty nor the poker game appear in the final cut of the film. Hill later appeared in the film in a different role. Joseph Gordon-Levitt said that he \"would have loved, loved to have\" been in the film but would be unable to appear because of a prior commitment to direct his first film, Don Jon.</p><h4>Costume design</h4><p>In a January 2013 interview with Vanity Fair, costume designer Sharen Davis said much of the film's wardrobe was inspired by spaghetti westerns and other works of art. For Django's wardrobe, Davis and Tarantino watched the television series Bonanza and referred to it frequently. The pair even hired the hatmaker who designed the hat worn by the Bonanza character Little Joe, played by Michael Landon. Davis described Django's look as a \"rock-n-roll take on the character\". Django's sunglasses were inspired by Charles Bronson's character in The White Buffalo (1977). Davis used Thomas Gainsborough's 1770 oil painting The Blue Boy as a reference for Django's valet outfit.</p><p>In the final scene, Broomhilda wears a dress similar to that of Ida Galli's character in Blood for a Silver Dollar (1965). Davis said the idea of Calvin Candie's costume came partly from Rhett Butler, and that Don Johnson's signature Miami Vice look inspired Big Daddy's cream-colored linen suit in the film. King Schultz's faux chinchilla coat was inspired by Telly Savalas in Kojak. Davis also revealed that many of her costume ideas did not make the final cut of the film, leaving some unexplained characters such as Zoë Bell's tracker, who was intended to drop her bandana to reveal an absent jaw.</p><h4>Filming</h4><p>Principal photography for Django Unchained started in California in November 2011 continuing in Wyoming in February 2012 and at the National Historic Landmark Evergreen Plantation in Wallace, Louisiana, outside of New Orleans, in March 2012. The film was shot in the anamorphic format on 35 mm film. Although originally scripted, a sub-plot centering on Zoë Bell's masked tracker was cut, and remained unfilmed, due to time constraints. After 130 shooting days, the film wrapped up principal photography in July 2012.</p><p>Django Unchained was the first Tarantino film not edited by Sally Menke, who died in 2010. Editing duties were instead handled by Fred Raskin, who had worked as an assistant editor on Tarantino's Kill Bill. Raskin was nominated for a BAFTA Award for Best Editing but lost to William Goldenberg for his work on Argo.</p><p>Kerry Washington sought to bring authenticity to her performance in several ways. The actor playing her overseer used a fake whip, but Washington insisted the lashings really hit her back. And to dramatize her punishment inside an underground, coffin-size metal container, she and Tarantino agreed she would spend time barely clothed in the \"hot box\" before the filming began so the feeling of confinement would be as realistic as possible.</p><h4>Broken glass incident</h4><p>During the scene when DiCaprio's character explains phrenology, DiCaprio cut his left hand upon striking the table and smashing a small glass. Despite his hand profusely bleeding, DiCaprio barely reacted and remained in character under the astonished eyes of his fellow actors. He is seen taking out pieces of broken glass from his hand during the scene. After Tarantino's cut, there was a standing ovation by the other actors to praise DiCaprio's performance despite the incident; Tarantino, therefore, decided to keep this sequence in the final cut. DiCaprio is seen with his left hand bandaged in the scene after when he is signing Broomhilda's papers. Contrary to popular belief, DiCaprio wiped fake blood on Washington's face in a separate take.</p><h4>Music</h4><p>The film features both original and existing music tracks. Tracks composed specifically for the film include \"100 Black Coffins\" by Rick Ross and produced by and featuring Jamie Foxx, \"Who Did That To You?\" by John Legend, \"Ancora Qui\" by Ennio Morricone and Elisa, and \"Freedom\" by Anthony Hamilton and Elayna Boynton. The theme, \"Django\", was also the theme song of the 1966 film. Musician Frank Ocean wrote an original song for the film's soundtrack, but it was rejected by Tarantino, who explained that \"Ocean wrote a fantastic ballad that was truly lovely and poetic in every way, but there just wasn't a scene for it.\" Ocean later published the song, entitled \"Wiseman\", on his Tumblr blog. The film also features a few famous pieces of western classical music, including Beethoven's \"Für Elise\" and \"Dies Irae\" from Verdi's Requiem. Tarantino has stated that he avoids using full scores of original music: \"I just don't like the idea of giving that much power to anybody on one of my movies.\" The film's soundtrack album was released on December 18, 2012. Morricone made statements criticizing Tarantino's use of his music in Django Unchained and stated that he would \"never work\" with the director after this film, but later agreed to compose an original film score for Tarantino's The Hateful Eight in 2015. In a scholarly essay on the film's music, Hollis Robbins notes that the vast majority of film music borrowings come from films made between 1966 and 1974 and argues that the political and musical resonances of these allusions situate Django Unchained squarely in the Vietnam and Watergate era, during the rise and decline of Black Power cinema. Jim Croce's hit \"I Got a Name\" was featured in the soundtrack.</p><br/><h3>Release</h3><h4>Marketing</h4><p>The first teaser poster was inspired by a fan-art poster by Italian artist Federico Mancosu. His artwork was published in May 2011, a few days after the synopsis and the official title were released to the public. In August 2011, at Tarantino's request, the production companies bought the concept artwork from Mancosu to use for promotional purposes as well as on the crew passes and clothing for staff during filming.</p><h4>Theatrical run</h4><p>Django Unchained was released on December 25, 2012, in the United States by The Weinstein Company and released on January 18, 2013, by Sony Pictures Releasing in the United Kingdom. The film was screened for the first time at the Directors Guild of America on December 1, 2012, with additional screening events having been held for critics leading up to the film's wide release. The premiere of Django Unchained was delayed by one week following the shooting at an elementary school in Newtown, Connecticut, on December 14, 2012.</p><p>The film was released on March 22, 2013, by Sony Pictures in India. In March 2013, Django Unchained was announced to be the first Tarantino film approved for official distribution in China's strictly controlled film market. Lily Kuo, writing for Quartz, wrote that \"the film depicts one of America's darker periods, when slavery was legal, which Chinese officials like to use to push back against criticism from the United States\". The film was released in China on May 12, 2013.</p><h4>Home media</h4><p>The film was released on DVD, Blu-ray, and Digital Download on April 16, 2013. In the United States, the film has grossed $31,939,733 from DVD sales and $30,286,838 from Blu-ray sales, making a total of $62,226,571.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Django Unchained grossed $162.8 million in the United States and Canada and $263.2 million in other territories, for a worldwide total of $426 million, against a production budget of $100 million. As of 2013, Django Unchained is Tarantino's highest-grossing film, surpassing his 2009 film Inglourious Basterds, which grossed $321.4 million worldwide.</p><p>In North America, the film made $15 million on Christmas Day, finishing second behind fellow opener Les Misérables. It was the third-biggest opening day figure for a film on Christmas, following Sherlock Holmes ($24.6 million) and Les Misérables ($18.1 million). It went on to make $30.1 million in its opening weekend (a six-day total of $63.4 million), finishing second behind holdover The Hobbit: An Unexpected Journey.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 87% based on 291 reviews, and an average rating of 8/10. The website's critical consensus reads, \"Bold, bloody, and stylistically daring, Django Unchained is another incendiary masterpiece from Quentin Tarantino.\" Metacritic, which assigns a rating to reviews, gives the film a weighted average score of 81 out of 100, based on 42 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.</p><p>Roger Ebert of the Chicago Sun-Times gave the film four stars out of four and said: \"The film offers one sensational sequence after another, all set around these two intriguing characters who seem opposites but share pragmatic, financial and personal issues.\" Ebert also added, \"had I not been prevented from seeing it sooner because of an injury, this would have been on my year's best films list.\" Peter Bradshaw, film critic for The Guardian, awarded the film five stars, writing: \"I can only say Django delivers, wholesale, that particular narcotic and delirious pleasure that Tarantino still knows how to confect in the cinema, something to do with the manipulation of surfaces. It's as unwholesome, deplorable and delicious as a forbidden cigarette.\" Writing in The New York Times, critic A. O. Scott compared Django to Tarantino's earlier Inglourious Basterds: \"Like Inglourious Basterds, Django Unchained is crazily entertaining, brazenly irresponsible and also ethically serious in a way that is entirely consistent with its playfulness.\" Designating the film a Times \"critics\" pick, Scott said Django is \"a troubling and important movie about slavery and racism.\" Filmmaker Michael Moore praised Django, tweeting that the movie \"is one of the best film satires ever.\"</p><p>To the contrary, Owen Gleiberman, film critic for the Entertainment Weekly, wrote: \"Django isn't nearly the film that Inglourious was. It's less clever, and it doesn't have enough major characters – or enough of Tarantino's trademark structural ingenuity – to earn its two-hour-and-45-minute running time.\" In his review for the Indy Week, David Fellerath wrote: \"Django Unchained shows signs that Tarantino did little research beyond repeated viewings of Sergio Corbucci's 1966 spaghetti Western Django and a blaxploitation from 1975 called Boss Nigger, written by and starring Fred Williamson.\" New Yorker's Anthony Lane was \"disturbed by their yelps of triumphant laughter, at the screening I attended, as a white woman was blown away by Django's guns.\"</p><p>An entire issue of the academic journal Safundi was devoted to Django Unchained in \"Django Unchained and the Global Western,\" featuring scholars who contextualize Tarantino's film as a classic \"western\". Dana Phillips writes: \"Tarantino's film is immensely entertaining, not despite but because it is so very audacious—even, at times, downright lurid, thanks to its treatment of slavery, race relations, and that staple of the Western, violence. No doubt these are matters that another director would have handled more delicately, and with less stylistic excess, than Tarantino, who has never been bashful. Another director also would have been less willing to proclaim his film the first in a new genre, the 'Southern'.\"</p><h4>Top ten lists</h4><p>Django Unchained was listed on many critics' top ten lists of 2012.</p><ul><li>Top 10 (ranked alphabetically) – Claudia Puig, USA Today</li><li>Top 10 (ranked alphabetically) – Joe Williams, St. Louis Post-Dispatch</li><li>Top 10 (ranked alphabetically) – Stephanie Zacharek, Film.com</li><li>1st – Amy Nicholson, Movieline</li><li>2nd – Mick LaSalle, San Francisco Chronicle</li><li>2nd – Drew McWeeny, Hitfix</li><li>2nd – Michelle Orange, The Village Voice</li><li>2nd – Nathan Rabin, The A.V. Club</li><li>2nd – Betsy Sharkey, Los Angeles Times (tied with Lincoln)</li><li>3rd – Richard Jameson, MSN Movies</li><li>3rd – Alan Scherstuhl, The Village Voice</li><li>4th – Mark Mohan, The Oregonian</li><li>4th – Joe Neumaier, New York Daily News</li><li>4th – James Rocchi, MSN Movies</li><li>4th – Kristopher Tapley, HitFix</li><li>4th – Drew Taylor & Caryn James, Indiewire</li><li>5th - The Huffington Post</li><li>5th – David Ehrlich, Movies.com</li><li>5th – Scott Foundas, The Village Voice</li><li>5th – Wesley Morris, The Boston Globe</li><li>6th – James Berardinelli, Reelviews</li><li>6th – Lisa Kennedy, Denver Post</li><li>6th – Kat Murphy, MSN Movies</li><li>6th – Richard Roeper, Chicago Sun-Times</li><li>6th – Mike Scott, The Times-Picayune</li><li>7th – Drew Hunt, Chicago Reader</li><li>7th – A.O. Scott, The New York Times</li><li>8th – Ty Burr, The Boston Globe</li><li>9th – Todd McCarthy, The Hollywood Reporter</li><li>10th – Karina Longworth, The Village Voice</li><li>10th – Joshua Rothkopf, Time Out New York</li><li>10th – Marlow Stern, The Daily Beast</li><li>10th – Peter Travers, Rolling Stone</li></ul><h4>Accolades</h4><p>Django Unchained garnered several awards and nominations. The American Film Institute named it one of their Top Ten Movies of the Year in December 2012. The film received five Golden Globe Award nominations, including Best Picture, and Best Director and Best Screenplay for Tarantino. Tarantino won an Academy Award for Best Original Screenplay. Christoph Waltz received the Academy Award for Best Supporting Actor, the Golden Globe Award for Best Supporting Actor, and the BAFTA Award for Best Supporting Actor, his second time receiving all three awards, having previously won for his role in Tarantino's Inglourious Basterds. The NAACP Image Awards gave the film four nominations, while the National Board of Review named DiCaprio their Best Supporting Actor. Django Unchained earned a nomination for Best Theatrical Motion Picture from the Producers Guild of America.</p><br/><h3>Controversy</h3><h4>Racist language, portrayal of African American slavery</h4><p>Some commentators thought that the film's heavy usage of the word \"nigger\" is inappropriate, affecting them to an even greater extent than the depicted violence against the slaves. Other reviewers have defended the usage of the language in the historical context of race and slavery in the United States.</p><p>African-American filmmaker Spike Lee, in an interview with Vibe, said he would not see the film, explaining \"All I'm going to say is that it's disrespectful to my ancestors. That's just me ... I'm not speaking on behalf of anybody else.\" Lee later wrote, \"American slavery was not a Sergio Leone Spaghetti Western. It was a Holocaust. My ancestors are slaves stolen from Africa. I will honor them.\"</p><p>Actor and activist Jesse Williams has contrasted accuracy of the racist language used in the film with what he sees as the film's lack of accuracy about the general lives of slaves, too often portrayed as \"well-dressed Negresses in flowing gowns, frolicking on swings and enjoying leisurely strolls through the grounds, as if the setting is Versailles, mixed in with occasional acts of barbarism against slaves ... That authenticity card that Tarantino uses to buy all those 'niggers' has an awfully selective memory.\" He also criticizes the lack of solidarity between slave characters, and their general lack of a will to escape from slavery, with Django as the notable exception.</p><p>Wesley Morris of The Boston Globe compared Samuel L. Jackson's Stephen character to black Republicans like Clarence Thomas or Herman Cain. Jackson said that he believed his character to have \"the same moral compass as Clarence Thomas does\". Jackson defended heavy use of the word \"nigger\": \"Saying Tarantino said 'nigger' too many times is like complaining they said 'kyke' too many times in a movie about Nazis.\" The review by Jesse Williams notes, however, that these antisemitic terms were not used nearly as frequently in Tarantino's film about Nazis, Inglourious Basterds, suggesting the Jewish community would not have accepted it.</p><p>Marc Lamont Hill, a professor at Temple University, compared the fugitive ex–Los Angeles police officer Christopher Dorner to a real-life Django, saying \"It's almost like watching 'Django Unchained' in real life. It's kind of exciting.\" Writing in the Los Angeles Times, journalist Erin Aubry Kaplan noted the difference between Tarantino's Jackie Brown and Django Unchained: \"It is an institution whose horrors need no exaggerating, yet Django does exactly that, either to enlighten or entertain. A white director slinging around the n-word in a homage to '70s blaxploitation à la Jackie Brown is one thing, but the same director turning the savageness of slavery into pulp fiction is quite another.\"</p><p>While hosting NBC's Saturday Night Live, Jamie Foxx joked about being excited \"to kill all the white people in the movie\". Conservative columnist Jeff Kuhner wrote a reaction to the SNL skit for The Washington Times, saying: \"Anti-white bigotry has become embedded in our postmodern culture. Take Django Unchained. The movie boils down to one central theme: the white man as devil—a moral scourge who must be eradicated like a lethal virus.\"</p><p>Samuel L. Jackson told Vogue Man that \"Django Unchained was a harder and more detailed exploration of what the slavery experience was than 12 Years a Slave, but director Steve McQueen is an artist and since he's respected for making supposedly art films, it's held in higher esteem than Django, because that was basically a blaxploitation movie.\"</p><h4>Use of violence</h4><p>The film became infamous for its brutality, with some reviews criticizing it for being much too violent. The originally planned premiere of Django was postponed following the Sandy Hook school shooting on December 14, 2012. Thomas Frank criticized the film's use of violence as follows:</p><blockquote>Not surprisingly, Quentin Tarantino has lately become the focus for this sort of criticism (about the relationship between the movies and acts of violence). The fact that Django Unchained arrived in theaters right around the time of the Sandy Hook massacre didn't help. Yet he has refused to give an inch in discussing the link between movie violence and real life. Obviously I don't think one has to do with the other. Movies are about make-believe. It's about imagination. Part of the thing is trying to create a realistic experience, but we are faking it. Is it possible that anyone in our cynical world credits a self-serving sophistry like this? Of course an industry under fire will claim that its hands are clean, just as the NRA has done – and of course a favorite son, be it Tarantino or LaPierre, can be counted on to make the claim louder than anyone else. But do they really believe that imaginative expression is without consequence?</blockquote><p>The Independent said the movie was part of \"the new sadism in cinema\" and added, \"There is something disconcerting about sitting in a crowded cinema as an audience guffaws at the latest garroting or falls about in hysterics as someone is beheaded or has a limb lopped off\".</p><p>Adam Serwer from Mother Jones said, \"Django, like many Tarantino films, also has been criticized as cartoonishly violent, but it is only so when Django is killing slave owners and overseers. The violence against slaves is always appropriately terrifying. This, if nothing else, puts Django in the running for Tarantino's best film, the first one in which he discovers violence as horror rather than just spectacle. When Schultz turns his head away from a slave being torn apart by dogs, Django explains to Calvin Candie—the plantation owner played by Leo DiCaprio—that Schultz just isn't used to Americans.\"</p><h4>Historical inaccuracies</h4><p>Although Tarantino has said about Mandingo fighting, \"I was always aware those things existed\", there is no definitive historical evidence that slave owners ever staged gladiator-like fights to the death between male slaves like the fight depicted in the movie. Historian Edna Greene Medford notes that there are only undocumented rumors that such fights took place. David Blight, the director of Yale's center for the study of slavery, said it was not a matter of moral or ethical reservations that prevented slave owners from pitting slaves against each other in combat, but rather economic self-interest: slave owners would not have wanted to put their substantial financial investments at risk in gladiatorial battles.</p><p>The non-historical term \"Mandingo\" for a fine fighting or breeding slave comes not from Tarantino, but the 1975 film Mandingo which was itself based on a 1957 novel with the same title.</p><p>Writing in The New Yorker, William Jelani Cobb observed that Tarantino's occasional historical elasticity sometimes worked to the film's advantage. \"There are moments,\" Cobb wrote, \"where this convex history works brilliantly, like when Tarantino depicts the Ku Klux Klan a decade prior to its actual formation in order to thoroughly ridicule its members' veiled racism.\" However, Tarantino holds that the masked marauders depicted in the film were not the KKK, but a group known as \"The Regulators\". They were depicted as spiritual forebears of the later post-civil war KKK and not as the actual KKK.</p><p>On the matter of historical accuracy, Christopher Caldwell wrote in the Financial Times: \"Of course, we must not mistake a feature film for a public television documentary\", pointing out that the film should be treated as entertainment, not as a historical account of the period it is set in. \"Django uses slavery the way a pornographic film might use a nurses' convention: as a pretext for what is really meant to entertain us. What is really meant to entertain us in Django is violence.\" Richard Brody, however, wrote in The New Yorker that Tarantino's \"vision of slavery's monstrosity is historically accurate.... Tarantino rightly depicts slavery as no mere administrative ownership but a grievous and monstrous infliction of cruelty.\"</p><h4>Alleged copyright infringement</h4><p>In December 2015, a $100 million lawsuit was filed against Tarantino by filmmakers Oscar Colvin Jr. and Torrance J. Colvin, who claimed that the script for Django Unchained bears extensive similarities to their film, titled Freedom. The lawsuit was filed in a federal court in Washington, DC. On January 24, 2017, the lawsuit was dismissed.</p><br/><h3>Comic book adaptations</h3><p>A comic book adaptation of Django Unchained was released by DC Comics in 2013. In 2015, a sequel crossover comic entitled Django/Zorro was released by Dynamite Entertainment, co-written by Tarantino and Matt Wagner, the latter being the first comic book sequel to a Quentin Tarantino film.</p><br/><h3>Future</h3><h4>Proposed miniseries</h4><p>Tarantino has said in an interview that he has 90 minutes of unused material and considered re-editing Django Unchained into a four-hour, four-night cable miniseries. Tarantino said that breaking the story into four parts would be more satisfying to audiences than a four-hour movie: \"... it wouldn't be an endurance test. It would be a miniseries. And people love those.\"</p><h4>Potential crossover sequel</h4><p>Tarantino's first attempt at a Django Unchained sequel was with the unpublished paperback novel titled Django in White Hell. However, after Tarantino decided that the tone of the developing story did not fit with the character's morals, he began re-writing it as an original screenplay which later became the director's follow-up film, The Hateful Eight.</p><p>In June 2019, Tarantino had picked Jerrod Carmichael to co-write a film adaptation based on the Django/Zorro crossover comic book series. Tarantino and Jamie Foxx have both expressed interest in having Antonio Banderas reprise his role as Zorro from The Mask of Zorro and The Legend of Zorro in the film in addition to Foxx himself reprising his role as Django.</p><br/>"
  },
  "errorMessage": ""
}