{
  "imDbId": "tt0070735",
  "title": "The Sting",
  "fullTitle": "The Sting (1973)",
  "type": "Movie",
  "year": "1973",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/the-sting-1973",
      "rate": "100",
      "content": "The style here is so seductive and witty it's hard to pin down. It's like nothing else I've seen by Hill, and at times, it almost reminds me of Jacques Tati crossed with Robert Altman. It's good to get a crime movie more concerned with humor and character than with blood and gore; here's one, as we say, for the whole family."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/11320168/The-Sting-review-irresistible.html",
      "rate": "100",
      "content": "In an age when films such as Guy Ritchie's Lock, Stock and Two Smoking Barrels and Steven Soderbergh's Ocean's Eleven are revered for their trickery, The Sting remains the definitive con artist comedy: as irresistible and ingenious as the scheme that hooks in Doyle."
    },
    {
      "publisher": "The Guardian",
      "author": "Andrew Pulver",
      "link": "https://www.theguardian.com/film/2017/feb/22/the-sting-best-picture-oscar-1974",
      "rate": "100",
      "content": "The Sting is the most purely enjoyable film in Oscar history – and that, I think, puts it in the most valuable American film-making tradition of all."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1973/film/reviews/the-sting-1200423095/",
      "rate": "90",
      "content": "The Sting has all the signs of a blockbuster. Paul Newman and Robert Redford are superbly reteamed, this time as a pair of con artists in Chicago of the ’30s, out to fleece a bigtime racketeer brilliantly cast with and played by Robert Shaw. George Roy Hill’s outstanding direction of David S. Ward’s finely-crafted story of multiple deception and surprise ending will delight both mass and class audiences. Extremely handsome production values and a great supporting cast round out the virtues."
    },
    {
      "publisher": "Chicago Reader",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "The Chicago locations are well used by veteran director George Roy Hill, and the wonderful 30s movie style (lots of horizontal and vertical wipes, flipping screens, irises in and out) enhances the sense of good, harmless, nostalgic fun."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/sting-the",
      "rate": "88",
      "content": "The Sting represents one of the most popular, widely-loved films to win Best Picture in the last half-century and an example of grand entertainment."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://www.nytimes.com/reviews/movies?res=9F03E4D71731E63BBC4E51DFB4678388669EDE",
      "rate": "80",
      "content": "A lot of the other period details aren't too firmly anchored in time, but the film is so good-natured, so obviously aware of everything it's up to, even its own picturesque frauds, that I opt to go along with it. One forgives its unrelenting efforts to charm, if only because The Sting itself is a kind of con game, devoid of the poetic aspirations that weighed down \"Butch Cassidy and the Sundance Kid.\""
    },
    {
      "publisher": "",
      "author": "New York Daily News",
      "link": "https://www.nydailynews.com/entertainment/movies/archives-top-cast-romps-great-article-1.2033456",
      "rate": "70",
      "content": "But the look of a movie is not as important as how it feels. The Sting feels like a cold shower. One dashes into it primarily because of its superior cast."
    },
    {
      "publisher": "Village Voice",
      "author": "Andrew Sarris",
      "link": "https://news.google.com/newspapers?id=9uJLAAAAIBAJ&amp;sjid=MowDAAAAIBAJ&amp;pg=6201%2C6721977",
      "rate": "60",
      "content": "The plot has many twists, few surprises, and one gaping hole, which becomes apparent only after you walk out of the theater and have a chance to think. But pure popcorn like this is hardly worthy of serious analysis...Fortunately, the stars have not lost their charm and authority."
    },
    {
      "publisher": "Time",
      "author": "",
      "link": "",
      "rate": "40",
      "content": "The Sting was not made to be taken seriously, but many people may find it difficult even to enjoy casually. It lacks the elements that could have given it true drive. [31 Dec 1973, p.50]"
    }
  ],
  "errorMessage": ""
}