{
  "imDbId": "tt0070735",
  "title": "The Sting",
  "fullTitle": "The Sting (1973)",
  "type": "Movie",
  "year": "1973",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1611723",
      "warningSpoilers": false,
      "date": "5 March 2007",
      "rate": "10",
      "helpful": "75 out of 89 found this helpful.",
      "title": "Working The Big Con",
      "content": "The Sting, evoking a bygone era of gangsters and con men, was the deserved Best Picture of 1973. The Sting won that Oscar plus a whole flock of technical awards. One award it didn't win was for Robert Redford as Best Actor.That must have been tough for the Academy voters because to single out Redford as opposed to Paul Newman must have felt a bit unjust. For though Newman was nominated many times over his career and finally did win for The Color of Money, did not get a nomination for The Sting.Robert Redford is a small time grifter who while working a bait and switch street con takes off a numbers runner carrying the weekly take. The orders come down from the head man himself, Irish-American gangster Robert Shaw to kill those who did this as an example.Redford's mentor, Robert Earl Jones, is in fact killed, mainly because Redford starts spending a lot of that newly acquired loot that tips them off. Redford wants revenge so he looks up big time con man Paul Newman who himself is dodging law enforcement as is Redford also.They work the big con on Shaw and it's a beauty. The scheme they have is something to behold. They also have to do a couple of improvisations on the fly that lend a few twists to the scheme.The costumes and sets really do evoke Chicago of the Thirties and director George Roy Hill assembles a great cast to support Newman and Redford. My favorite in the whole group is Charles Durning, who plays the brutally corrupt, but essentially dumb cop from Joliet who nearly gums up the works and has to be dealt with.Special mention should also go to Robert Shaw. He's got a difficult part, maybe the most difficult in the film. He's not stupid, he would not have gotten to the top of the rackets if he was. But he also has to show that hint of human weakness that Newman, Redford, and the whole mob they assemble that makes him vulnerable to the con.During the sixties and seventies Robert Shaw was really coming into his own as a player, getting more and more acclaim for his work. His early death was a real tragedy, there was so much more he could have been doing.Can't also forget another co-star in this film, the ragtime music of Scott Joplin that was used to score The Sting. It probably is what most people remember about The Sting. Music from the Theodore Roosevelt era, scoring a film set in the Franklin Roosevelt era made while Nixon was president. Strange, but it actually works.The Sting still works wonders today."
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw0988676",
      "warningSpoilers": false,
      "date": "29 December 2004",
      "rate": "9",
      "helpful": "129 out of 156 found this helpful.",
      "title": "Everything's Jake In Second Trip To Well",
      "content": "The fix is in, the odds are set, and the boys are ready to play for the big time, both on the screen and behind the camera in this breezy, endlessly entertaining movie classic.Robert Redford is small-time hustler Johnny Hooker, happy to play the marks in Joliet until the murder of his mentor pushes him to go up against the nastiest mug in Chicago, Doyle Lonnegan (Robert Shaw.) Hooker'd rather ice Lonnegan outright, but will settle for a big con with the help of a slightly wobbly but game scammer named Henry Gondorff, played as only Paul Newman can.Newman and Redford, along with director George Roy Hill, had a lot riding on this pony, given it was a follow-up to their earlier \"Butch Cassidy And The Sundance Kid.\" To measure up, they had to produce nothing short of another classic. And so they did. \"The Sting\" won the Best Picture Oscar in 1973, and remains the sentimental favorite among many in choosing between the two films.Comparing \"The Sting\" to \"Butch Cassidy\" is kind of overdone sport, and tempers, as Lonnegan would say, run hot. But you can see why \"The Sting\" worked as well as it did by looking at how the director and the stars played it differently within the same basic framework as \"Butch Cassidy.\" Newman and Redford are again outlaws and underdogs. Period detail abounds here as it did with \"Butch Cassidy,\" and there's another memorable score amid the proceedings, Scott Joplin rags modernized by Marvin Hamlisch. The score even produced another hit, \"The Entertainer,\" to compare with \"Raindrops Keep Falling On My Head.\"What's different about \"The Sting,\" and what makes it such a classic in its own right, is the way the stars service the plot. In \"Butch Cassidy,\" Newman and Redford's comradeship was the story. Here, the chemistry between the two actors is minimized in favor of spinning a yarn with enough red herrings to feed the Swedish navy. The tale here is better than \"Butch Cassidy,\" which is a more elegiac film with grander cinematography and funnier set pieces. \"The Sting\" is an edge-of-your-seat caper flick from beginning to end.You can't really call \"The Sting\" a comedy. Though there are many laughs, especially when Newman hooks Shaw during a poker game, Hill won't let the audience relax enough for that. What this is is a con game, played on the audience, designed not to cheat but entertain by means of clever hoodwinking and constant misdirection plays.You'll get no spoilers from me. This is one worth sitting through with no expectations. Five gets you ten you'll enjoy Newman and Redford, and a terrific supporting cast (one advantage over \"Butch Cassidy\") that includes Charles Durning, Eileen Brennan, Dana Elcar, Harold Gould, and Mr. Hand himself, Ray Walston. There's another familiar face from \"Butch Cassidy,\" Charles Dierkop, Flat Nose Curry in \"Butch Cassidy\" and Lonnegan's right hand here. The best performance may be Robert Shaw's; he exudes menace aplenty but some humanity, too, when he takes Hooker under his wing after learning he came from the same hard streets of Five Points Lonnegan sprang from.Terrific period detail, too. The dialogue is great and feels real in its Runyonesque way, while the cons are elaborate and logically played out. Watching this a second time is especially fun because once you know how the plot goes down, you find yourself catching clues you missed the first time, and enjoying the film even more for them.Why didn't Newman and Redford team up again? Certainly there was another good movie for them to partner up in, but as Gondorff would have put it, only chumps don't quit when they're ahead."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw1080115",
      "warningSpoilers": true,
      "date": "14 May 2005",
      "rate": "9",
      "helpful": "58 out of 74 found this helpful.",
      "title": "The clever plot makes multiple viewings mandatory for full enjoyment...",
      "content": "THE STING is so full of twists and turns at every unexpected moment that it never stops drawing you into all of its traps. All of it is performed at a fast clip and the performances have all the nuances needed to keep you entertained and in suspense.Sparked by perfect period detail, a Scott Joplin piano score courtesy of Marvin Hamlisch and grand performances, it is gritty and at all times entertaining--it deserves to be seen more than once to relish all the tricks you missed the first time.For full enjoyment, a plot description is better left for the first time viewer to discover so I won't give any plot details here.The three central performances are perfection--Robert Redford, so comfortable in a role he was obviously born to play, Paul Newman, the epitome of a confidence trickster and Robert Shaw as the man who falls hard for The Sting. Newman and Redford are even more at home here than they were as Butch Cassidy and the Sundance Kid.No wonder it won so many '73 Oscars--including Best Picture. A film to relish again and again, with scenes that never lose their punch. The story is full of clever touches that will hook you into the 1930s atmosphere and have you waiting for the knockout ending.Watch for the scene of Redford and the waitress he seeks out at 2:00 a.m. It's the kind of acting that can melt your heart."
    },
    {
      "username": "JamesHitchcock",
      "userUrl": "https://www.imdb.com/user/ur2955724",
      "reviewLink": "https://www.imdb.com/review/rw0131971",
      "warningSpoilers": true,
      "date": "15 March 2004",
      "rate": "9",
      "helpful": "87 out of 113 found this helpful.",
      "title": "The Moral Order Restored",
      "content": "Johnny Hooker and Luther Coleman are 'grifters' or confidence tricksters in 1930s Chicago. Unknown to them, however, one of their victims works for a vicious local gangster named Doyle Lonnegan, and when Lonnegan finds out what has happened he has Luther murdered. Hooker is not a violent man by nature and admits that he does not know much about killing, but nevertheless wishes to take revenge for his partner's death. He decides that the best way is to hurt Lonnegan's pride by relieving him of some of his wealth. He joins forces with another con man named Henry Gondorff, and together they come up with an elaborate plan, not only to cheat Lonnegan, but also to do it in such a way that he never realises that he has been cheated. The plot unfolds with great ingenuity; until the final denouement the audience are never quite sure which developments are for real and which are part of the elaborate scheme.Crime thrillers set during this period are normally associated with the classic 'film noir' style, with its dark, brooding, cynical atmosphere. In 'The Sting', however, George Roy Hill deliberately sets out to create a very different mood. The style is almost the exact opposite of film noir. The acting is heavily stylised (as is the scenery), and the division of the film into sections with titles such as 'The Hook' or 'The Line' is reminiscent of the formal division of a stage play into acts and scenes. The film is not in black-and-white but in bright colour, and the mood, far from being heavy and brooding, is light and cheerful. Scott Joplin's music, although written slightly earlier than the period in which the film is set, fits this mood perfectly. The major actors all play their parts perfectly- Robert Shaw as the glowering, menacing Lonnegan, Robert Redford as the young, idealistic Hooker (insofar as a con-man can be said to be an idealist), and Paul Newman as the older, more experienced and laid-back Gondorff. There are also good contributions from Charles Durning as the corrupt policement Lieutenant Snyder and Robert Earl Jones as Luther.Despite the cheerful mood, the film has serious undertones in keeping with its themes of revenge and murder. I am not usually a great admirer of what are known as 'heist' or 'caper' movies, as I feel that too often they glamourise crime and dishonesty. 'The Sting', however, is different. Hooker and Gondorff live in a world where the moral order has broken down. The police are hopelessly corrupt- Snyder, the one representative we see of the forces of law and order, is on Lonnegan's payroll. There is no chance of Hooker getting justice for his friend's murder through the normal channels; the only way in which this can be achieved is to go outside the law. Where the police are crooked, only the criminals can execute justice. The emotional satisfaction we feel at the end of the film is because a sort of moral order has finally been restored and, moreover, because this has been done without anyone getting injured except Lonnegan's wallet. An excellent film, which well deserved its Academy Award. 9/10."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0131950",
      "warningSpoilers": false,
      "date": "23 March 2003",
      "rate": "",
      "helpful": "51 out of 69 found this helpful.",
      "title": "Classy bit of story telling",
      "content": "Small time conmen Johnny Hooker and Luther Coleman unwittingly scam a runner for Chicago main man Doyle Lonnegan. When Luther is murdered, Hooker goes on the run and seeks out Luther's old friend Henry Gondorff to help him put together a major sting to take revenge on Lonnegan. However with so much heat on Hooker and the stakes so high can they pull it off and get away clean?Almost a follow up to Butch and Sundance, this film partners the stars of the day Newman and Redford to good effect. The story is a little less fun but still very enjoyable to watch as it builds to a great finale. The use of chapters ran the risk of fragmenting the film into bits but instead it really helps set it out and makes it more manageable. Although it is not as light hearted and jovial as the theme music suggests it still manages to flow nicely with the slightly darker drama not spoiling anything but only serving to make it feel more grown up.The cast are all very good and make the film easy to watch. Redford comes off the best in terms of characters and his role really suits both his carefree attitude (the start of the film) but also his more serious side (the rest of the film). Newman has a lesser role that perhaps doesn't suit him quite as well, but he does have several really good scenes (the hustles) where he does very good work. Shaw's accent is a little heavy at first but I got used to it and it worked for me and he was a really good foil for Redford/Newman. The support cast including Durning, Walston, Gould, Jones and others all do good work.The direction and use of music is really good and the sense of period is well crafted and doesn't just feel like it was painted on. I'm not sure if it deserved Best Picture or not because I don't know what the rest of the field was for that year but it is a really enjoyable film that is quite fun to watch several times even 30 years later  and isn't that the main thing?"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3010436",
      "warningSpoilers": false,
      "date": "5 May 2014",
      "rate": "10",
      "helpful": "19 out of 24 found this helpful.",
      "title": "Quite good--especially the first time you see it.",
      "content": "It's been decades since I've seen \"The Sting\" and I decided to try watching it again. As a result of having seen it a couple times, I have some impressions I might not have had the first time. First, the film is awfully pretty--with some of the nicest titles and intertitle cards I've seen. It also is well-constructed--with several plots being interwoven quite well--a tribute to the director, George Roy Hill. The acting is quite nice and it's interesting that the film won seven Oscars--and none of them for acting! And, just like the first time, the Scott Joplin tunes are terrific. The only real negative is that because I'd seen it before, there were no surprises--and surprises are what makes this such an enjoyable film. Without the surprise, the film lacks something the second time--something that isn't true for all films. \"O Brother, Where Art Thou?\", for example, seems to get better each time you see it--but \"The Sting\" does because the movie is so dependent of surprise plot twists.The bottom line is that for first-time viewers, the film is very hard to beat and it's easy to see how this $5.5 million dollar film brought in over $159,000,000 domestically--making this is mega-mega blockbuster. It's an exceptional film in every way."
    },
    {
      "username": "AaronCapenBanner",
      "userUrl": "https://www.imdb.com/user/ur23589178",
      "reviewLink": "https://www.imdb.com/review/rw2869521",
      "warningSpoilers": false,
      "date": "14 September 2013",
      "rate": "7",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Fun Caper Comedy.",
      "content": "Paul Newman & Robert Redford reunite for this Academy Award winning film directed by George Roy Hill about two con men who team up to avenge the death of a mutual friend by \"stinging\" a mob boss(played by Robert Shaw). Film details their intricate plan to do so, which involves an excellent cast including Charles Durning, Ray Walston, & Eileen Brennan, among others. The story climaxes in an elaborate swindle that may well fool the audience. Fine use of vintage 1930's jazz music appropriate for the period.Wouldn't go so far as giving it the best picture award, however, since it is just a good film, not in any way a great one, though it was a big hit at the time."
    },
    {
      "username": "petangi",
      "userUrl": "https://www.imdb.com/user/ur4600469",
      "reviewLink": "https://www.imdb.com/review/rw1245966",
      "warningSpoilers": false,
      "date": "23 December 2005",
      "rate": "",
      "helpful": "141 out of 168 found this helpful.",
      "title": "You wanna make a film - here's how...",
      "content": "A delicious wheeze from start to finish. Certainly a film that leaves you thinking that you'd like to have been in Henry's gang and played a part in separating Lonnegan from his dough. The editing is pin sharp and beautifully cast with a superb musical track to keep you company. The framing, the photography, the pace all dovetail exquisitely and if you feel left outside of the game plan in your first viewing, never fear, the second time of watching, you'll enjoy it just as much but it will mean more. Certainly it's a film you'll want to see a second time. At least. Oscars rightly by the handful and nominations are full deserved to combine for a winning performance by all concerned. Definitely in my top fifty of all time."
    },
    {
      "username": "gelman@attglobal.net",
      "userUrl": "https://www.imdb.com/user/ur1522352",
      "reviewLink": "https://www.imdb.com/review/rw1025839",
      "warningSpoilers": false,
      "date": "21 February 2005",
      "rate": "10",
      "helpful": "30 out of 40 found this helpful.",
      "title": "And Don't Forget Scott Joplin!",
      "content": "I agree 100 percent that this is a wonderful movie. I first saw it over 30 years ago, and it remains vivid in my mind while I can't remember zip about movies I saw last week which others have praised and I found wanting. I can't think of another film about double and triple crosses that deserves to be mentioned in the same sentence with \"The Sting\" (which doesn't mean that some of the others haven't been good). In addition to all the things that others have praised, one of the most memorable features of this film is the use of a Scott Joplin rag, which both lends a distinctive period touch and adds a sense of fast-paced motion to the action. I'm not much for ranking films -- top five, top ten, top 250 -- but this is one of the best. If you haven't already seen it, drop everything and find the DVD. As pure entertainment, it can't be beat."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1118842",
      "warningSpoilers": true,
      "date": "4 July 2005",
      "rate": "9",
      "helpful": "31 out of 44 found this helpful.",
      "title": "Undoubtedly a captivating tour de force...,",
      "content": "Newman was again teamed with director George Roy Hill and Robert Redford, and the two stars again played outlaws who are basically easy-going and human, and whose criminal exploits are comically engaging Here the setting is Chicago in 1936 Henry Gondorff (Newman), a well-known, slight1y aging con artist, is hiding from the law, but he comes out of retirement to teach small-time hustler Johnny Hooker (Redford) the \"Big Con.\" With the assistance of a large group of amiable crooks, the two work out an elaborate scheme to cheat an important racketeer, Doyle Lonnegan (Robert Shaw), out of $500,000.Unlike \"Butch Cassidy and the Sundance Kid,\" the film is inordinately complicated, and has many twists, turns and surprises It is actually one con game after another, with the audience tricked as well as the characters The steps in the swindle fall neatly into place in the manner of television's 'Mission: Impossible,' although once we think about the plot, it makes little sense But we're not meant to think; \"The Sting\" is designed, and works extremely well, as clever entertainment Perhaps it was the Newman-Redford team that made \"The Sting\" popular, and Newman alone may have difficulty drawing audiences, but one thing is certain: In fifty one years of film acting, Newman has become one of the screen's most magnetic stars Even today the very mention of his name evokes an aura of moody rebelliousness, rugged individualism, cool detachment and, above all, overpowering sex appeal And he has created more memorable characters than have most actors in much longer periods of time At least four\"The Hustler,\" \"Hud,\" \"Cool Hand Luke\" and \"Butch Cassidy\"are so well-known, so indelibly impressed on the public consciousness, that they stand among the immortals of the screen \"The Sting\" received ten Academy Award nominationsmore than any other Newman film"
    },
    {
      "username": "Coxer99",
      "userUrl": "https://www.imdb.com/user/ur0257957",
      "reviewLink": "https://www.imdb.com/review/rw0131885",
      "warningSpoilers": false,
      "date": "14 April 1999",
      "rate": "10",
      "helpful": "37 out of 55 found this helpful.",
      "title": "The Sting",
      "content": "Great comedy-crime caper with giants Newman and Redford rekindling their \"Butch & Sundance\" flame to take down crime lord Robert Shaw (his finest role). Marvin Hamlisch beautifully recreates Scott Joplin's great music, while director George Roy Hill and screenwriter David S. Ward keep the film moving with snappy dialogue, wonderful art direction and editing and an excellent supporting cast. Followed by a sequel ten years later with Jackie Gleason."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2906999",
      "warningSpoilers": false,
      "date": "17 November 2013",
      "rate": "7",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Reunion isn't quite as fun",
      "content": "Johnny Hooker (Robert Redford) cons a passerby of his cash. The problem is that the passerby was delivering money for a mob boss Doyle Lonnegan (Robert Shaw). Doyle vows to hunt down the petty crocks and kills Hooker's partner. Hooker goes on the run and gets the help of Henry Gondorff (Paul Newman) seeking a long con revenge.The long con can confuse the audience. It takes some effort to follow. Director George Roy Hill doesn't really draw us an easy to follow map. Some of it is great like the card game. As individual scenes, some of them are quite memorable and interesting.If there is one thing missing, it's a bit of comedy to break up the serious tone. Redford-Newman-Hill reunite but is missing that charming fun of 'Butch Cassidy and the Sundance Kid'. At least it moves along quite well which is not always the case for movies of that era."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw1307436",
      "warningSpoilers": false,
      "date": "5 March 2006",
      "rate": "7",
      "helpful": "11 out of 17 found this helpful.",
      "title": "Newman and Redford: The One-Two Punch",
      "content": "As I type this, this movie sits at #83 on the all-time greatest movies list. Almost makes me guilty for only giving it a 7 and possibly dropping it to 84, but to be honest it wasn't the greatest movie I've ever seen. But it also wasn't the worst.Paul Newman and Robert Redford are two confidence men (\"con men\" or \"grifters\") in the 1930s who cheat at cards. They cheat at cards against a wealthy New York City man and then sucker him in for what is called a \"long con\" or \"big con\". (If you like the character \"Sawyer\" from \"Lost\", this is probably your movie.) The whole second half of the movie is this long con: and will they pull it off? You won't know until the end, because the mafia and the FBI are both trying to kill them. And sometimes happy endings happen when the cops win and the cheaters lose. So don't bet on any horses until you know the score.Anyway, it's a good film. Some parts are hard to follow in my opinion, but in a twisted sense this makes sense -- if they are conning the other cons, surely we the audience should be getting conned, too. It would be shoddy con work to let in ANYBODY, even the audience. And the acting is of course perfect because it's Newman and Redford. But also the guy from My Favorite Martian (Walston) and James Earl Jones' father. So, that's good.They claim the music really makes the film. I disagree. The music is appropriate, but not because it matches the 1940s. Because it matches the cards used to separate the different scenes (which, by the way, I think was a great idea). To cut a review short that isn't going anywhere, this film is recommended. Not highly recommended. Not \"top 100 films of all time\" recommended. But you might want to see it anyway."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3614480",
      "warningSpoilers": true,
      "date": "7 January 2017",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Lovable roguish classic",
      "content": "THE STING is a fine 1930s-set comedy adventure film re-teaming Paul Newman and Robert Redford after the runaway success of BUTCH CASSIDY AND THE SUNDANCE KID. I found it more enjoyable than their previous outing thanks to the intense storyline, which is set in the world of gangsters and gambling and features oodles of suspense and tension as the two men attempt to pull off one of the biggest scams in history.The thing that becomes quickly apparent when watching THE STING is just how well written it is. The script is very clever without being obnoxiously so and the involving opening set-piece is a fine example of this. Newman plays in support here and has less screen time than I expected, but the film belongs to Redford anyway and he's a delight, the best I've seen him. The third player in the thing is Robert Shaw, who brings level of quiet intensity to the picture that makes his character even more imposing than the famous henchman role he essayed in FROM Russia WITH LOVE.Although THE STING has a long running time, not a moment of it feels slow or boring. Instead it keeps moving through interesting set-pieces, mainly focused on gambling (which is a fascinating cinematic subject matter in the right hands) but also including a number of decent foot chases too. Everything builds to a classic climax that rounds off an excellent film overall."
    },
    {
      "username": "stryker-5",
      "userUrl": "https://www.imdb.com/user/ur0150331",
      "reviewLink": "https://www.imdb.com/review/rw0131897",
      "warningSpoilers": false,
      "date": "8 January 2000",
      "rate": "",
      "helpful": "9 out of 11 found this helpful.",
      "title": "\"You Follow?\"",
      "content": "In Joliet, Illinois in 1936 the murder of a 'grifter' causes repercussions throughout the underworld. Grifters are the small-time con artists who work the streets. They know and respect one another, and the death of Luther brings all the con men from far and wide together in a plan of revenge. Doyle Lonnegan is the New York Irish gangster who ordered Luther's execution, so the grifters target him for the \"big con\". \"The Sting\" was devised as a follow-up to \"Butch Cassidy\", reuniting Newman and Redford as lovable, wisecracking rogues. The motivation behind the project may have been cynical box-office manipulation, but the resulting film is a beauty. The two stars make a great team, and multi-faceted confidence tricks adorn the plot in Byzantine complexity. Lonnegan (Robert Shaw) has two prominent personality traits - greed and cruelty. A con is put together which will use these characteristics against their owner. The best way to hurt Lonnegan is to dupe him out of his money, because the sharks of the criminal fraternity will turn on him once they see that he's been 'had'. It is essential that Lonnegan must never know that this was a scam, because if he did, he would pursue a vendetta against our heroes. He must believe that he lost his money through his own stupidity, and that the men who took it are now dead. The opening scenes emphasise the harshness of a world in which powerful crooks fleece ordinary joes, but also stress the warmth of the social bond which unites the small-time thieves. Mottola is a runner for Lonnegan's operation, a heartless dandy who steals a desperate man's dough (or so he thinks). The gambling dens ruthlessly swindle Hooker out of his money, but Hooker makes no trouble for the croupier, a guy just like himself who is merely trying to survive. Redford plays Hooker to perfection. He is the handsome, charming 'man of the people'. There is no malice in him, and yet he spends his life ducking, diving and dodging lead. Luther was his father figure, and we see Hooker transfer his filial allegiance to Gondorff. The film is crammed with technical cleverness. Whoever went out and scouted for locations did a great job, because the gritty 1930's look is wonderful. If the streets around the bookie's shop were 'faked' on a back lot, then this alone would make \"The Sting\" outstanding. Watch the urban period detail as Lonnegan goes across to place his first bet, and again at the start of \"The Wire\". Hooker suddenly realises that Luther is dead, and we see 'the penny drop' by means of a very simple but very effective device - the camera zooms back. No redundant dialogue, no over-acting. The panoramic view from above the rail tracks is achieved by 'masking in' a photograph of old Joliet, to create a convincing skyline. During the poker game on the train, the focus is thrown from Lonnegan's cards to Gondorff's eyes. We know that Gondorff knows that Lonnegan is cheating. The music cannot go unmentioned. Apart from being exquisite, it contributes a major part of the film's overall feel. \"The Sting\" introduced the piano rags of Scott Joplin to a mass audience, and their popularity has not diminished over the ensuing decades. Composed perhaps forty years before the events they illustrate, and therefore 'wrong' from a period point of view, the pieces are none the less perfect, and the film is unimaginable without them. As a fun accompaniment to the music, the film contains various silent-era 'wipes'. Watch for the changes of scene for the iris-ins and iris-outs, and vertical and horizontal wipes. David Ward's script is intelligent and intricate. The 'big con' has safety features built into it, such as the well-worked 'shut-out'. In order for the audience to take the swindlers to their hearts, it is necessary to depict the cops as venal, immoral and downright sleazy. Local dick Snyder is all of this, and more, his character being a masterpiece of dimwitted malevolence. Eileen Brennan (Captain Lewis in \"Private Benjamin\") plays Billie, Gondorff's partner. She turns in a performance of cool assurance, one of the film's subtler treats. Charles Dierkop is simply marvellous as Floyd. This veteran of \"Butch Cassidy\" has hardly any dialogue, but he makes Floyd central to the film's comic purpose - and does it all with nuances of gesture. The FBI agents are great. Wearing straw boaters more than a decade after straw boaters ceased to be cool, and persisting with them even in torrential rain, the G-men are the archetype of Hooverian 'squareness'. It may be fanciful, but are there passing references to Hitchcock's \"Strangers On A Train\"? The carrousel may be stretching a point, but what of Mottola's feet at the start, wearing Robert Walker's shoes? \"The Sting\" is a splendid film. The plot may perform bewildering gyrations, Robert Shaw's Irish accent may be somewhat shaky, and Solino may be an assassin too far - but the whole of this complicated contraption works, and works well. I can recall, back in 1974, an excited cinema audience actually cheering and shouting at the screen. \"Seems worthwhile, doesn't it?\""
    },
    {
      "username": "moman818",
      "userUrl": "https://www.imdb.com/user/ur2447091",
      "reviewLink": "https://www.imdb.com/review/rw0131954",
      "warningSpoilers": false,
      "date": "2 June 2003",
      "rate": "10",
      "helpful": "73 out of 96 found this helpful.",
      "title": "The caper movie uber alles",
      "content": "A magical plot, dead on art direction, brilliant supporting roles (most notably Robert Shaw, ya falla?), and the guiding hand of Redford/Newman chemistry make this one of the Hollywood's great films. \"The Sting\" is a hallmark of the \"Golden Age\" of American film, and has molded not only countless films, but numerous genres, few of which have met the challenge of its master."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1833490",
      "warningSpoilers": false,
      "date": "4 March 2008",
      "rate": "10",
      "helpful": "10 out of 16 found this helpful.",
      "title": "Not only does it sting, it floats like a butterfly as well.",
      "content": "Academy Award Winner Best Picture, Academy Award Winner Best Director-George Roy Hill, Academy Award Winner Best Screenplay-David S. Ward, Academy Award Winner Best Editing-William Reynolds, Academy Award Winner Best Song Score-Marvin Hamlisch, Academy Award Winner Best Art Direction/Set Decoration-Bumstead & Payne, Academy Award Winner Best Costume Design-Edith Head, Nominated for Best Actor (Redford), Best Cinematography, Best Sound.Few films can draw me in and indulge me on repeat viewings like The Sting does, it was barely 36 hours ago when I sat there talking to the screen offering advice like I was in the flipping film. I have seen it written that the film's success was only garnered because of the star appeal of the leads! Well for starters that is an insult to Robert Shaw who may be accused of overdoing it at times, but his portrayal of Lonnegan is a complete joy, witness the fury on his face during an on train poker game as the irrepressible Newman does comedy gold. Visually the film is a delight, and the story fuses together to culminate in an ending that not only stings with impact; but also floats like a cinematic butterfly. 10/10"
    },
    {
      "username": "Amyth47",
      "userUrl": "https://www.imdb.com/user/ur45390749",
      "reviewLink": "https://www.imdb.com/review/rw4510649",
      "warningSpoilers": false,
      "date": "14 December 2018",
      "rate": "7",
      "helpful": "5 out of 6 found this helpful.",
      "title": "A stylish heist-comedy caper from '73.",
      "content": "My Rating : 7/10'The Sting' is gorgeous to look at, the cinematography is exceptional and it's endlessly entertaining.Recommended for fans of heist films and those who love a good comedy with guns and witty dialogues."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2658021",
      "warningSpoilers": false,
      "date": "13 August 2012",
      "rate": "7",
      "helpful": "9 out of 15 found this helpful.",
      "title": "Sensational picture with the greatest stars and winning deservedly several Oscars",
      "content": "In 1930s Chicago, a young con man (Robert Redford's character , Johnny Hooker, is supposedly named after blues legend John Lee Hooker) seeking vendetta for his murdered partner teams up with a master of the big con (Paul Newman) to win a fortune from a criminal mobster (Robert Shaw).Enjoyable picture with magnificent performances, splendid period piece , thrills , humor , plot twists , emotion and amusement . The movie is based on the real-life exploits of grifter brothers Charley and Fred Gondorf, whose experiences culminated in a scam similar to the one shown in the film, known in 1914 as \"the wire\" or \"the big store\". Unlike the movie, however, the actual \"mark\" was more than happy to testify against Charley Gondorf, the front man of the scam, and he spent time in Sing Sing, as did his younger brother a year later for running another scam , both served a few years and were released . Producer David S. Ward got the idea for this movie when he was working on the script for Steelyard Blues, which includes a pickpocketing scene , researching this, Ward found himself reading about con artists ; Ward had shown the other screenplay to Tony Bill, so he now gave him an outline of this story. Likable acting from Robert Redford , Jack Nicholson and Warren Beatty turned down the role of Johnny Hooker before Robert Redford changed his mind and decided to play it . Exceptional Paul Newman as an expert swindler. Robert Shaw was injured his knee and incorporated the resulting limp into his performance , as he steals the show as a nasty mobster , though Richard Boone was the first choice for the role of Lonnegan , Oliver Reed was offered the role but refused to test for it , he would later play Lonnegan in the sequel . Support cast is frankly excellent such as Charles Durning as Lt. Wm. Snyder , Ray Walston as J.J. Singleton , Eileen Brennan as Billie , Harold Gould as Kid Twist , Charles Dierkop as Floyd and Dana Elcar as FBI agent . Evocative set decoration by Henry Bumstead who usually worked with Alfred Hitchcock . Colorful and glimmer cinematography by Robert Surtees , usual cameraman expert on super-productions . Director George Roy Hill wanted to film the picture on location, but Henry Bumstead was adamant that it would be much too hard to get the period appearance right; for example, things like lane markings on the streets ; in the end, the only location shooting was a few days' worth in Chicago and Los Angeles; most of the exteriors were filmed on Universal's back lot . Wonderful score consists of Scott Joplin ragtime compositions well played by recently deceased Marvin Hamlisch , which were composed between 1900 and 1910 , although The Sting helped bring Joplin's ragtime back into American popular culture, they actually predate the period of the story by 25 years. Marvelous gowns by Edith Head who won her 8th and final Best Costume Design Academy Award for this film .Followed by an inferior sequel , ¨The sting 2¨ (1983) by Jeremy Kagan , also produced by David S Ward with Jackie Gleason , Karl Malden , Mac Davis, Teri Garr and Oliver Reed was offered the original role but refused to test for it he would later play Lonnegan in this following. Rating : sublime film , two thumbs up , essential and indispensable seeing ."
    },
    {
      "username": "SilverDSam",
      "userUrl": "https://www.imdb.com/user/ur4148486",
      "reviewLink": "https://www.imdb.com/review/rw0952367",
      "warningSpoilers": false,
      "date": "26 October 2004",
      "rate": "",
      "helpful": "31 out of 41 found this helpful.",
      "title": "Comment on accuracy of the poker scene",
      "content": "The Sting.The Sting (1973) is one of everybody's favorite films. Director George Roy Hill took a page from his successful western, Butch Cassidy and the Sundance Kid, and teamed Paul Newman and Robert Redford once again, this time for an Academy Award four star movie about con men.The intricate saga of The Sting is set in 1936 Chicago. It tells the story of grifters, Henry Gondorff and Johnny Hooker, played by Paul Newman and Robert Redford, respectively. They con the bad guy, Doyle Lonnegan, played by Robert Shaw. And at every turn, they con the audience as well.The poker game is five card draw ('straight poker' in the film) and is set on a train traveling from New York to Chicago. Newman and Redford are on the train along with Shaw. The game has been set up by Shaw with the cooperation of the conductor. We don't know how Newman and Redford know exactly what day and what train Shaw is taking from New York to Chicago, but that is beside the purpose of our discussion. Shaw is a known card cheater, but Newman will prove to be a better one. Once again the holy game of poker will be sullied by the movies. This time, we'll love every minute of it.Newman arranges to get himself invited to the poker game, through the conductor. He arrives sober, but apparently inebriated. It is the perfect act, consummately played in a boozy, needling performance by Paul Newman. Shaw's character is a known cold decker (a 'cold deck' is a deck introduced surreptitiously into the game with hands pre-arranged to break one of the players)' and Newman will have to play over the top of the cold deck when it is placed into the game.One of the subtleties of the event is missed by most viewers. Newman must ready himself to overcome the cold deck. During the play of hands, we see Newman hold the cards close to his vest and, at least once, his cards disappear briefly below table level, out of sight, and back again. Newman knows Shaw cold decks middle cards against low cards, and so Newman is gathering and holding out jacks.Newman immediately insults Shaw upon arrival and continues to heckle him throughout the play of the game, thus making sure Shaw will cold deck the game to teach the upstart drunk a lesson. When Shaw goes to the men's room to arrange to fix the cold deck, Newman knows the time has come. (In real life, cold decks were nearly always arranged in men's rooms. They should have had a dedicated stall marked 'coolers made here'.)The game is three handed at this point. Shaw will bring the cold deck in when he cuts the cards for the dealer to his left. In filming the cold decking, the camera shows a pair of hands over the deck, then there's a cut in the continuity. Then the camera goes immediately back to the deck and we see the hands with the warm deck going to a handkerchief in Shaw's lap, leaving the cold deck on the table. I guess it would have been hard to do in one long shot.The detail is interesting during the dealing of the cold deck. Newman is fussing with his cigar and poking behind his vest, implying something is happening. But we never see Newman with hand positions that could be holding out cards.Newman is dealt trip threes and Shaw is dealt a pair of nines. The third player is the dealer and he is out of the hand. Newman draws two cards and gets his four threes with the six of hearts. Shaw draws three cards and gets his four nines with the ten of spades.The planning of the arranged cold deck is well done and probable. After the cards are dealt, the cards on top of the deck are, in order, a three, the six of hearts, two nines and the ten of spades. It doesn't matter whether Newman draws one or two cards, he'll make his four threes and, in either case, Shaw, in drawing three cards, will make his four nines.Now, here's the unlikely trick. Newman must change the hand with four threes for a hand with four jacks. It would be easiest to hold out an entire hand of four jacks and a fifth card and switch five card hands. But Newman switches only the four threes for the four jacks he's held out and he keeps the six of hearts. That is much harder to do and less likely would be the method chosen. Newman also takes the chance that Shaw won't have one of the legitimate jacks in his hand with the four nines, but in having to play over the top of the cold deck, that gamble is unavoidable.Shaw's problem is that he can't call Newman for card manipulation because Shaw has an audience, the other players and the conductor. After Newman leaves the cabin, Shaw says to his lackey, 'What was I supposed to do? Call him for cheating better than me, in front of the others?'Shaw was able to get $10,000 more in chips during a hand in a table stakes game. But that was okay with Newman.The film shows Shaw wiping his face with a handkerchief during the play of the hand, implying he has disposed of the warm deck. However, we never see Newman clean up. So, when he leaves the poker cabin, one deck is short four jacks, the other deck has four extra jacks, and Newman still has four threes behind his vest somewhere. Whoever the conductor gives the decks to next, will have a few surprises.Despite its faults, the poker scene from The Sting is the most fun filled, greatest directed, best acted, and most involved offering in cheating poker film history. And it was made over thirty years ago.Silver Dollar Sam NothingWild.com"
    },
    {
      "username": "matthewssilverhammer",
      "userUrl": "https://www.imdb.com/user/ur19752191",
      "reviewLink": "https://www.imdb.com/review/rw4151269",
      "warningSpoilers": false,
      "date": "2 May 2018",
      "rate": "7",
      "helpful": "6 out of 9 found this helpful.",
      "title": "light, bouncy, and fun, if a bit shallow.",
      "content": "I feel like I'm not quite as high on the Newman / Redford movies as I am on the two actors themselves; there's an undeniably natural charisma between them, and that's what really pushes this film forward. Not that this movie is bad. It's not at all. It's quintessential \"bad-guys-who-are-actually-good-guys\" that's a whole mess of effective cons, a couple of which are being played on the audience."
    },
    {
      "username": "pmtelefon",
      "userUrl": "https://www.imdb.com/user/ur6587670",
      "reviewLink": "https://www.imdb.com/review/rw5668576",
      "warningSpoilers": false,
      "date": "23 April 2020",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "A true classic",
      "content": "\"The Sting\" is one of the most enjoyable movies ever made. It's a wildly entertaining experience. I saw this movie when it first came out (Floral Park, NY) and many times times since. It never gets old. The look, acting, story and, of course, the music are all top notch. Director George Roy Hill and company created an almost perfect movie. \"The Sting\" always hits the spot."
    },
    {
      "username": "marmar-69780",
      "userUrl": "https://www.imdb.com/user/ur94289145",
      "reviewLink": "https://www.imdb.com/review/rw5867327",
      "warningSpoilers": false,
      "date": "29 June 2020",
      "rate": "8",
      "helpful": "2 out of 2 found this helpful.",
      "title": "the sting",
      "content": "The sting is one great con movie with some very smart turns and plot twist that were unpredictable and surprising in a good way,some scenes are also very memorable expecely train sequance when they played card game and dialogue in that scene mixed with great actors were brilliantly put together ,newman was good here and i finally found his film that i actually liked,redford was even better and i was able to relate to him and to found him to be scene stealer and a highlight of entire movie,robert shaw was great as a villain and his stare alone was intimidating enough for me to feel threatend by his presance,the sting may be ultimate con movie with good dialogue and actors"
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2436598",
      "warningSpoilers": false,
      "date": "31 May 2011",
      "rate": "10",
      "helpful": "4 out of 6 found this helpful.",
      "title": "A Cinematic Delight ...",
      "content": "The Reviewer : ElMaruecan82 ~~~~~~~~~The Entrance : ~~~~~~~~~The piano bar starts playing the first iconic notes like so many musical breezes whispering a cool and mysterious detachment ... and progressively, inviting itself in my pleasure, the melody draws a big smile in my face I quietly smile, letting myself absorbed by this nostalgic music rocking me comfortably as if I could let this cinematic jewel sleep in my memory for a few seconds ... that would feel like an eternity ... Then suddenly, the rhythm gets faster and more joyful well, it couldn't have had a more fitting name, it's 'The Entertainer', the unforgettable Scott Joplin's piano theme, embodying the 30's as a period I never lived, but strongly feel as if I did a music resurrected by the magic of a film to become immortal. One of the greatest cinematic scores for a classic among the classics: George Roy Hill's \"The Sting\".The Point : ~~~~~~~ You all know what it's about, two con men who set up one of the most elaborated schemes in order to avenge a mutual friend. The man to be conned is a ruthless gangster boss whose position can't allow him to be made to look ridiculous. And the con is the kind that you either make it or break it, at the key : half-million of dollars, with no second chance. You expect something clever, ingenuous, big and spectacular and believe me, you'll get it. The plot is so intricate, so brilliantly complicated that you don't necessarily get it the first time, but one thing for sure, you're eager to watch it again. The enjoyment of the film works on a peripheral level thanks to the music, the characters, the dialogs and of course the ending, so many encouraging elements for multiple viewings ... to let the film grow on you this is the fate of great classics.The Touch : ~~~~~~~And \"The Sting\" is one of these classics that plunge you in a universe that only belongs to them, the period setting, the characterization, the witty dialogs, the jazz, the style, the movie exudes a delightful uniqueness that has stood the test of time after almost 40 years. My comparison will surprise some fellow movie fans, but I think there's something oddly resembling between \"The Sting\" and another praised masterpiece: \"City Lights\". The two movies were deliberately dated in the style they opted for, but the audacious artistic touch revealed itself to work as an antidote against aging, the movie doesn't look 'thirties', nor 'seventies', it's just classic and modern in a splendid dosage. And this is what movies are about, creating endearing sensations that live forever \"The Sting\" has this 'Universal' appeal (no pun intended) thanks to a little something that makes it very charming on the surface, probably the fact that it's constructed as a stage The Fun : ~~~~~~We do have the feeling that the actors are playing, I don't mean acting, but playing in the real sense of the word, the one that tickles our inner child. They are adult men who play, lie, have fun, take risk and even \"The Sting\" is played for real, everything is staged, even the opening credits are original as they present the actors as the protagonists of a vast farce which will take us, viewers, as accomplices. We follow a wonderful gallery of colorful characters such as Johnny Hooker, Henry Gondorf, Twist Kid, the Erie Kid and many others, into a fantastic exploration of the world of grifters. Robert Redford and Paul Newman who paired in \"Butch Cassidy and the Sundance Kid\" form a wonderful duo, with a priceless interaction between the apprentice and the mentor. Indeed, the kind of con they're going to pull is a whole artistic accomplishment with a quite pedagogic value, illustrated by all the chapters that structure the film like so many necessary steps to make the perfect sting. In fact, we're like children who admire men with a unique ability to fool their neighbor, and it looks so natural we almost envy this talent. And I think I know why The Text : ~~~~~~~The reason is, in my opinion, the script, it's complex and intelligent. It's intelligent in the literal meaning of the world as we really understand what it's about, and intelligent, as it honors men of intelligence. This is the appeal of \"The Sting\". Beyond the setting, the characters, the music, there's the pleasure of admiring how fooling someone can be an art that requires a perfect timing, many psychological talents, and I'm saying art and not science, because of the human factor. Of course, the movie's general mood is positive and cheerful as we forget these guys are 'criminal', but like the other movie that won the Best Picture Oscar one year before, it's 'good criminals vs. bad criminals'. It works despite Robert Shaw's sweet ability to portray Doyle Lonnegan and inspire us empathy, except in the beginning where he sentenced two men to death, without even knowing them. Apart from that, he's a poor man being fooled. Or maybe the empathetic process just works because we're also fooled by the story at one point? The Review: ~~~~~~~These questions don't really matter when the essential is elsewhere \"The Sting\" is a masterpiece in the brilliance of its script driven by an unforgettable supporting cast, with a honorable mention to Charles Durning as the poor Snyder, and the whole thing is disguised under a deliberate coolness and detachment because up there, the staging and these pieces of the puzzles were still hanging in a confident string hold by a film-maker who knows his business."
    },
    {
      "username": "Don-102",
      "userUrl": "https://www.imdb.com/user/ur0187170",
      "reviewLink": "https://www.imdb.com/review/rw0131898",
      "warningSpoilers": false,
      "date": "24 January 2000",
      "rate": "8",
      "helpful": "42 out of 80 found this helpful.",
      "title": "A Lightweight, Clever Throwback to the Big Cons of the 1930's.",
      "content": "At first sight, THE STING appears to be nothing more than a television movie. It is entirely plot-driven with no real stand out characters or personalities. What makes the film work is excellent production design and a delightfully clever plot filled with many surprises. The movie is feather-weight emotionally, but the depth of the \"con\" and the way it is fashioned by screenwriter David Ward leaves you with a pleasant experience.This is more Redford's film than Newman's, who reunite with George Roy Hill, director of BUTCH CASSIDY AND THE SUNDANCE KID. The legendary actors were more flesh and blood in that film, but here, they are merely players who carry the story along. With lesser actors, THE STING may have been a forgettable piece of work. Redford does all of the dirty work after Newman's initial \"hook\", but the omniscient presence of Newman, as big-time grifter \"Henry Gondorff\" exists throughout. A mysterious gloved character, a crooked cop, the FBI, and a seemingly bigger con-man \"Doyle Lonnegan\" (played by the late, great Robert Shaw) are some of the players who are involved in some events that seem to be manipulated by an unseen force. Is Newman as good as he claims in trying to clean out Shaw? We'll see.The film is shot simply by Hill. No tricky angles or contrived camera movements are used. The action takes place simply in front of us. The production design by Henry Bumstead and James Payne recreates old-time Chicago through the use of built sets, matte paintings of a smaller sky-line, and some location shots. It gives the film an almost artificial look which is fitting considering it is a direct homage to the 1930's and the gangster pictures that so dominated that decade. The story is even furthered by title pages describing \"the set-up, the hook, and the sting\". They are turned like pages in a book, adding a drop of elegance to a crooked world. An iris is even employed in some scenes.THE STING is definitely lightweight entertainment. It does not provoke much thought or insight into what is happening on screen. Fun is the word for this amusing little film that depicts a masterful plan for a big steal which would be impossible to pull off today. Look out for Ray Walston in a hilarious role announcing horse races and their results as they are \"happening\" just after receiving word of the \"real\" race results from a back room in the betting house. These are good con-men.RATING: ***"
    }
  ],
  "errorMessage": ""
}