{
  "imDbId": "tt0070735",
  "title": "The Sting",
  "fullTitle": "The Sting (1973)",
  "type": "Movie",
  "year": "1973",
  "language": "en",
  "titleInLanguage": "The Sting",
  "url": "https://en.wikipedia.org/wiki/The_Sting",
  "plotShort": {
    "plainText": "The Sting is a 1973 American caper film set in September 1936, involving a complicated plot by two professional grifters (Paul Newman and Robert Redford) to con a mob boss (Robert Shaw). The film was directed by George Roy Hill, who had directed Newman and Redford in the western Butch Cassidy and the Sundance Kid. Created by screenwriter David S. Ward, the story was inspired by real-life cons perpetrated by brothers Fred and Charley Gondorff and documented by David Maurer in his 1940 book The Big Con: The Story of the Confidence Man.\r\nThe \"sting\" is the moment when a con artist finishes the \"play\" and takes the mark's money. If a con is successful, the mark does not realize he has been cheated until the con men are long gone, if at all. The film plays out in distinct sections with old-fashioned title cards drawn by artist Jaroslav \"Jerry\" Gebr, the lettering and illustrations in a style reminiscent of the Saturday Evening Post. The film is noted for its use of ragtime, particularly the melody \"The Entertainer\" by Scott Joplin, which was adapted (along with others by Joplin) for the film by Marvin Hamlisch (and a top-ten chart single for Hamlisch when released as a single from the film's soundtrack). The film's success created a resurgence of interest in Joplin's work.\r\nReleased on Christmas Day, 1973, The Sting was a massive critical and commercial success and hugely successful at the 46th Academy Awards, nominated for ten Oscars and winning seven, including Best Picture, Best Director, Best Film Editing and Best Writing (Original Screenplay); Redford was also nominated for Best Actor. The film also rekindled Newman's career after a series of big screen flops. Regarded as having one of the best screenplays ever written, The Sting was selected in 2005 for preservation in the U.S. National Film Registry of the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>The Sting is a 1973 American caper film set in September 1936, involving a complicated plot by two professional grifters (Paul Newman and Robert Redford) to con a mob boss (Robert Shaw). The film was directed by George Roy Hill, who had directed Newman and Redford in the western Butch Cassidy and the Sundance Kid. Created by screenwriter David S. Ward, the story was inspired by real-life cons perpetrated by brothers Fred and Charley Gondorff and documented by David Maurer in his 1940 book The Big Con: The Story of the Confidence Man.</p><p>The \"sting\" is the moment when a con artist finishes the \"play\" and takes the mark's money. If a con is successful, the mark does not realize he has been cheated until the con men are long gone, if at all. The film plays out in distinct sections with old-fashioned title cards drawn by artist Jaroslav \"Jerry\" Gebr, the lettering and illustrations in a style reminiscent of the Saturday Evening Post. The film is noted for its use of ragtime, particularly the melody \"The Entertainer\" by Scott Joplin, which was adapted (along with others by Joplin) for the film by Marvin Hamlisch (and a top-ten chart single for Hamlisch when released as a single from the film's soundtrack). The film's success created a resurgence of interest in Joplin's work.</p><p>Released on Christmas Day, 1973, The Sting was a massive critical and commercial success and hugely successful at the 46th Academy Awards, nominated for ten Oscars and winning seven, including Best Picture, Best Director, Best Film Editing and Best Writing (Original Screenplay); Redford was also nominated for Best Actor. The film also rekindled Newman's career after a series of big screen flops. Regarded as having one of the best screenplays ever written, The Sting was selected in 2005 for preservation in the U.S. National Film Registry of the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "The Sting is a 1973 American caper film set in September 1936, involving a complicated plot by two professional grifters (Paul Newman and Robert Redford) to con a mob boss (Robert Shaw). The film was directed by George Roy Hill, who had directed Newman and Redford in the western Butch Cassidy and the Sundance Kid. Created by screenwriter David S. Ward, the story was inspired by real-life cons perpetrated by brothers Fred and Charley Gondorff and documented by David Maurer in his 1940 book The Big Con: The Story of the Confidence Man.\r\nThe \"sting\" is the moment when a con artist finishes the \"play\" and takes the mark's money. If a con is successful, the mark does not realize he has been cheated until the con men are long gone, if at all. The film plays out in distinct sections with old-fashioned title cards drawn by artist Jaroslav \"Jerry\" Gebr, the lettering and illustrations in a style reminiscent of the Saturday Evening Post. The film is noted for its use of ragtime, particularly the melody \"The Entertainer\" by Scott Joplin, which was adapted (along with others by Joplin) for the film by Marvin Hamlisch (and a top-ten chart single for Hamlisch when released as a single from the film's soundtrack). The film's success created a resurgence of interest in Joplin's work.\r\nReleased on Christmas Day, 1973, The Sting was a massive critical and commercial success and hugely successful at the 46th Academy Awards, nominated for ten Oscars and winning seven, including Best Picture, Best Director, Best Film Editing and Best Writing (Original Screenplay); Redford was also nominated for Best Actor. The film also rekindled Newman's career after a series of big screen flops. Regarded as having one of the best screenplays ever written, The Sting was selected in 2005 for preservation in the U.S. National Film Registry of the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nIn 1936, during the Great Depression, Johnny Hooker, a grifter in Joliet, Illinois, cons $11,000 in cash from an unsuspecting victim with the aid of his partners Luther Coleman and Joe Erie. Buoyed by the windfall, Luther announces his retirement and advises Hooker to seek out an old friend, Henry Gondorff, in Chicago to learn \"the big con\". Unfortunately, their victim was a numbers racket courier for vicious crime boss Doyle Lonnegan. Corrupt Joliet police lieutenant William Snyder confronts Hooker, revealing Lonnegan's involvement and demanding part of Hooker's cut. Having already blown his share on a single roulette spin, Hooker pays Snyder in counterfeit bills. Lonnegan's men murder both the courier and Luther, and Hooker flees for his life to Chicago.\r\nHooker finds Gondorff, a once-great con man now hiding from the FBI, and asks for his help in taking on Lonnegan. Gondorff is initially reluctant, but relents and recruits a team of experienced con men to dupe Lonnegan. They decide to resurrect an elaborate, obsolete scam known as \"the wire\", using a larger crew of con artists to create a phony off-track betting parlor. Aboard the opulent 20th Century Limited, Gondorff, posing as a boorish Chicago bookie named Shaw, buys into Lonnegan's private, high-stakes poker game. He infuriates Lonnegan with obnoxious behavior, then cheats him out of $15,000. Hooker, posing as Shaw's disgruntled employee Kelly, is sent to collect the winnings and instead convinces Lonnegan that he wants to take over Shaw's operation. Kelly reveals that he has a partner named Les Harmon (actually con man Kid Twist) in the Chicago Western Union office, who will help them topple Shaw by winning bets he books on horse races through past-posting.\r\nMeanwhile, Snyder has tracked Hooker to Chicago, but his pursuit is thwarted when he is summoned by undercover FBI agents led by Agent Polk, who orders him to help snare Gondorff. At the same time, Lonnegan has grown frustrated with his men's inability to find and kill Hooker for the Joliet con. Unaware that Kelly is Hooker, he demands that Salino, his best assassin, be given the job. A mysterious figure with black leather gloves is seen following and observing Hooker.\r\nKelly's connection appears effective, as Harmon provides Lonnegan with the winner of one horse race and the trifecta of another. Lonnegan agrees to finance a $500,000 bet at Shaw's parlor to break Shaw and gain revenge. Shortly thereafter, Snyder captures Hooker and brings him before Polk, who forces Hooker to betray Gondorff by threatening to jail Luther Coleman's widow.\r\nThe night before the sting, Hooker sleeps with a waitress named Loretta. The next morning, as she walks toward him in an alley, the black-gloved man appears and shoots her dead. The man reveals that he was hired by Gondorff to protect Hooker from Loretta—Lonnegan's hired killer, Loretta Salino—and explains that she had not yet killed Hooker because they had been seen together.\r\nArmed with a new tip from Harmon, Lonnegan bets $500,000 at Shaw's parlor on Lucky Dan to win. As the race begins, Harmon arrives and expresses shock at Lonnegan's bet: when he said \"place it\" he meant that Lucky Dan would \"place\" (i.e., finish second). In a panic, Lonnegan rushes to the teller window and demands his money back. A moment later Polk, Snyder, and a half dozen FBI agents storm the parlor. Polk confronts Gondorff, then tells Hooker he is free to go. Reacting to the betrayal, Gondorff shoots Hooker in the back. Polk then shoots Gondorff and orders Snyder to get the ostensibly respectable Lonnegan away from the crime scene. With Lonnegan and Snyder safely away, Hooker and Gondorff rise amid cheers and laughter. The gunshots were faked; Polk is actually Hickey, running a con within the con to divert Snyder and ensure that Lonnegan abandons his money. As the con men strip the room of its contents, Hooker refuses his share of the money and walks away with Gondorff.\r\nCast\r\nPaul Newman as Henry Gondorff/\"Shaw\"\r\nRobert Redford as Johnny Hooker/\"Kelly\"\r\nRobert Shaw as Doyle Lonnegan\r\nRobert Earl Jones as Luther Coleman\r\nCharles Durning as Lt. William Snyder, Joliet P.D.\r\nRay Walston as J.J. Singleton\r\nEileen Brennan as Billie\r\nHarold Gould as Kid Twist\r\nJohn Heffernan as Eddie Niles\r\nDana Elcar as Hickey/\"FBI Agent Polk\"\r\nJack Kehoe as Erie Kid\r\nDimitra Arliss as Loretta Salino\r\nJames J. Sloyan as Mottola\r\nCharles Dierkop as Floyd (Lonnegan's bodyguard)\r\nLee Paul as Lonnegan's bodyguard\r\nSally Kirkland as Crystal\r\nAvon Long as Benny Garfield\r\nArch Johnson as Combs\r\nEd Bakey as Granger\r\nBrad Sullivan as Cole\r\nJohn Quade as Riley\r\nLarry D. Mann as Clemens (the train conductor)\r\nLeonard Barr as Burlesque House Comedian\r\nPaulene Myers as Alva Coleman\r\nJoe Tornatore as Black Gloved Gunman\r\nJack Collins as Duke Boudreau\r\nTom Spratley as Curly Jackson\r\nKenneth O'Brien as Greer\r\nKen Sansom as Western Union Executive\r\nTa-Tanisha as Louise Coleman\r\nWilliam \"Billy\" Benedict as Jimmy\r\nProduction\r\nWriting\r\nScreenwriter David S. Ward has said in an interviews that he was inspired to write The Sting while researching pickpockets: \"Since I had never seen a film about a confidence man before, I said I gotta do this.\" Daniel Eagan said: \"One key to plots about con men is that film goers want to feel they are in on the trick. They don't have to know how a scheme works, and they don't mind a twist or two, but it's important for the story to feature clearly recognizable 'good' and 'bad' characters.\" It took a year for Ward to correctly adjust this aspect of the script and to figure out how much information he could keep from the audience while still making the leads sympathetic. He also imagined an underground brotherhood of thieves who assemble for a big operation and then melt away afterward.\r\nYears later, director Rob Cohen recounted how he found the script in the slush pile when working as a reader for Mike Medavoy, a future studio head, but then an agent. He wrote in his coverage that it was \"the great American screenplay and … will make an award-winning, major-cast, major-director film.\" Medavoy said that he would try to sell it on that recommendation, promising to fire Cohen if he could not. Universal bought it that afternoon, and Cohen keeps the coverage framed on the wall of his office.\r\nAcademic David Maurer sued for plagiarism, claiming the screenplay was based too heavily on his 1940 book The Big Con, about real-life tricksters Fred and Charley Gondorff. Universal settled out of court for $600,000, irking Ward, who resented the presumption of guilt implied by an out-of-court settlement done for business expediency.\r\nWriter/producer Roy Huggins maintained in his Archive of American Television interview that the first half of The Sting plagiarized the 1958 Maverick television series episode \"Shady Deal at Sunny Acres\", starring James Garner and Jack Kelly.\r\nCasting\r\nJack Nicholson was offered the lead role but turned it down.\r\nNewman signed on the film after the producers agreed to give him top billing, $500,000 and a percentage of the profits. His previous five films had been box-office disappointments.\r\nIn her 1991 autobiography You'll Never Eat Lunch in This Town Again, producer Julia Phillips writes that Hill wanted Richard Boone to play Lonnegan. Much to her relief, Newman had sent the script to Robert Shaw while shooting The Mackintosh Man in Ireland to ensure his participation in the film. Phillips's book asserts that Shaw was not nominated for a Best Supporting Actor Academy Award because he demanded that his name follow those of Newman and Redford before the film's opening title.\r\nShaw's character's limp in the film was authentic. Shaw had injured his leg while playing handball shortly before filming began. Director Hill encouraged him to incorporate the limp into his character rather than withdraw from the project.\r\nPrincipal photography\r\nHill wanted the film to be reminiscent of movies from the 1930s and watched films from that decade for inspiration. He noticed that most '30s gangster films had no extras. \"For instance\", Andrew Horton's book The Films of George Roy Hill quotes Hill as saying, \"no extras would be used in street scenes in those films: Jimmy Cagney would be shot down and die in an empty street. So I deliberately avoided using extras.\"\r\nAlong with art director Henry Bumstead and cinematographer Robert L. Surtees, Hill devised a color scheme of muted browns and maroons for the film and a lighting design that combined old-fashioned 1930s-style lighting with some modern tricks of the trade to get the visual look he wanted. Edith Head designed a wardrobe of snappy period costumes for the cast, and artist Jaroslav Gebr created inter-title cards to be used to introduce each section of the film that were reminiscent of the golden glow of old Saturday Evening Post illustrations, a popular publication of the 1930s.\r\nThe movie was filmed on the Universal Studios backlot, with a few small scenes shot in Wheeling, West Virginia, some scenes filmed at the Santa Monica pier's carousel, in Southern California, and in Chicago at Union Station and the former LaSalle Street Station. An antique car buff, co-producer Tony Bill helped round up several period cars to use in The Sting. One of them was his own 1935 Pierce-Arrow limousine, which served as Lonnegan's private car.\r\nReception\r\nBox office\r\nThe film was a box-office smash in 1973 and early 1974, taking in over $160 million. As of August 2018, it is the 20th highest-grossing film in the United States adjusted for ticket price inflation.\r\nCritical response\r\nRoger Ebert gave the film four out of four stars and called it \"one of the most stylish movies of the year\". Gene Siskel awarded three-and-a-half stars out of four, calling it \"a movie movie that has obviously been made with loving care each and every step of the way.\" Vincent Canby of The New York Times wrote that the film was \"so good-natured, so obviously aware of everything it's up to, even its own picturesque frauds, that I opt to go along with it. One forgives its unrelenting efforts to charm, if only because The Sting itself is a kind of con game, devoid of the poetic aspirations that weighed down Butch Cassidy and the Sundance Kid.\" Variety wrote, \"George Roy Hill's outstanding direction of David S. Ward's finely-crafted story of multiple deception and surprise ending will delight both mass and class audiences. Extremely handsome production values and a great supporting cast round out the virtues.\" Kevin Thomas of the Los Angeles Times called it \"an unalloyed delight, the kind of pure entertainment film that's all the more welcome for having become such a rarity.\" John Simon wrote that The Sting as a comedy-thriller \"works endearingly without a hitch\".\r\nPauline Kael of The New Yorker was less enthusiastic, writing that the film \"is meant to be roguishly charming entertainment, and that's how most of the audience takes it, but I found it visually claustrophobic, and totally mechanical. It creeps cranking on, section after section, and it doesn't have a good spirit.\" She also wrote, \"the absence of women really is felt as a lack in this movie.\"\r\nIn 2005, the film was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\". The Writers Guild of America ranked the screenplay #39 on its list of 101 Greatest Screenplays ever written. On Rotten Tomatoes, The Sting holds a rating of 92% from 101 reviews, with an average rating of 8.3/10. The site's critical consensus reads: \"Paul Newman, Robert Redford, and director George Roy Hill prove that charm, humor, and a few slick twists can add up to a great film.\" On Metacritic, the film has a weighted average score of 83 out of 100, based on 17 critics, indicating \"universal acclaim\".\r\nAwards and nominations\r\nSoundtrack\r\nThe soundtrack album, executive produced by Gil Rodin, includes several of Scott Joplin's ragtime compositions, adapted by Marvin Hamlisch.\r\nAccording to Joplin scholar Edward A. Berlin, ragtime experienced a revival in the 1970s due to several events: a best-selling recording of Joplin rags on the classical Nonesuch Records label, along with a collection of his music issued by the New York Public Library; the first full staging of Joplin's opera Treemonisha; and a performance of period orchestrations of Joplin's music by a student ensemble of the New England Conservatory of Music, led by Gunther Schuller. \"Inspired by Schuller's recording, had Marvin Hamlisch score Joplin's music for the film, thereby bringing Joplin to a mass, popular public.\"\r\nCharts\r\nCertifications and sales\r\nAdaptations\r\nStage\r\nMark Hollmann and Greg Kotis (music and lyrics), writer Bob Martin, and director John Rando created a stage musical version of the movie. The musical premiered at the Paper Mill Playhouse in Millburn, New Jersey on March 29, 2018. Henry Gondorff was played by Harry Connick Jr., with choreography by Warren Carlyle. The stage musical incorporates Joplin's music, including \"The Entertainer\".\r\nNovelization\r\nRobert Weverka adapted the film into a full-length novel, The Sting (1974), based on the screenplay by David S. Ward.\r\nHome media\r\nThe movie was issued on DVD by Columbia TriStar Home Entertainment in 2000. \"If Paul Newman really does retire, he can spend his rocking chair years feeling smug about this,\" enthused OK! \"The story's not the important thing: what makes it are the quirky soundtrack, the card-sharp dialogue and two superduperstars at their superduperstarriest.\"\r\nA deluxe DVD – The Sting: Special Edition (part of the Universal Legacy Series) – was released in September 2005. Its \"making of\" featurette, The Art of the Sting, included interviews with cast and crew.\r\nThe film was released on Blu-ray in 2012 as part of Universal's 100th anniversary releases.\r\nThe Sting was released on Ultra HD Blu-ray on May 18, 2021.",
    "html": "<p>The Sting is a 1973 American caper film set in September 1936, involving a complicated plot by two professional grifters (Paul Newman and Robert Redford) to con a mob boss (Robert Shaw). The film was directed by George Roy Hill, who had directed Newman and Redford in the western Butch Cassidy and the Sundance Kid. Created by screenwriter David S. Ward, the story was inspired by real-life cons perpetrated by brothers Fred and Charley Gondorff and documented by David Maurer in his 1940 book The Big Con: The Story of the Confidence Man.</p><p>The \"sting\" is the moment when a con artist finishes the \"play\" and takes the mark's money. If a con is successful, the mark does not realize he has been cheated until the con men are long gone, if at all. The film plays out in distinct sections with old-fashioned title cards drawn by artist Jaroslav \"Jerry\" Gebr, the lettering and illustrations in a style reminiscent of the Saturday Evening Post. The film is noted for its use of ragtime, particularly the melody \"The Entertainer\" by Scott Joplin, which was adapted (along with others by Joplin) for the film by Marvin Hamlisch (and a top-ten chart single for Hamlisch when released as a single from the film's soundtrack). The film's success created a resurgence of interest in Joplin's work.</p><p>Released on Christmas Day, 1973, The Sting was a massive critical and commercial success and hugely successful at the 46th Academy Awards, nominated for ten Oscars and winning seven, including Best Picture, Best Director, Best Film Editing and Best Writing (Original Screenplay); Redford was also nominated for Best Actor. The film also rekindled Newman's career after a series of big screen flops. Regarded as having one of the best screenplays ever written, The Sting was selected in 2005 for preservation in the U.S. National Film Registry of the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>In 1936, during the Great Depression, Johnny Hooker, a grifter in Joliet, Illinois, cons $11,000 in cash from an unsuspecting victim with the aid of his partners Luther Coleman and Joe Erie. Buoyed by the windfall, Luther announces his retirement and advises Hooker to seek out an old friend, Henry Gondorff, in Chicago to learn \"the big con\". Unfortunately, their victim was a numbers racket courier for vicious crime boss Doyle Lonnegan. Corrupt Joliet police lieutenant William Snyder confronts Hooker, revealing Lonnegan's involvement and demanding part of Hooker's cut. Having already blown his share on a single roulette spin, Hooker pays Snyder in counterfeit bills. Lonnegan's men murder both the courier and Luther, and Hooker flees for his life to Chicago.</p><p>Hooker finds Gondorff, a once-great con man now hiding from the FBI, and asks for his help in taking on Lonnegan. Gondorff is initially reluctant, but relents and recruits a team of experienced con men to dupe Lonnegan. They decide to resurrect an elaborate, obsolete scam known as \"the wire\", using a larger crew of con artists to create a phony off-track betting parlor. Aboard the opulent 20th Century Limited, Gondorff, posing as a boorish Chicago bookie named Shaw, buys into Lonnegan's private, high-stakes poker game. He infuriates Lonnegan with obnoxious behavior, then cheats him out of $15,000. Hooker, posing as Shaw's disgruntled employee Kelly, is sent to collect the winnings and instead convinces Lonnegan that he wants to take over Shaw's operation. Kelly reveals that he has a partner named Les Harmon (actually con man Kid Twist) in the Chicago Western Union office, who will help them topple Shaw by winning bets he books on horse races through past-posting.</p><p>Meanwhile, Snyder has tracked Hooker to Chicago, but his pursuit is thwarted when he is summoned by undercover FBI agents led by Agent Polk, who orders him to help snare Gondorff. At the same time, Lonnegan has grown frustrated with his men's inability to find and kill Hooker for the Joliet con. Unaware that Kelly is Hooker, he demands that Salino, his best assassin, be given the job. A mysterious figure with black leather gloves is seen following and observing Hooker.</p><p>Kelly's connection appears effective, as Harmon provides Lonnegan with the winner of one horse race and the trifecta of another. Lonnegan agrees to finance a $500,000 bet at Shaw's parlor to break Shaw and gain revenge. Shortly thereafter, Snyder captures Hooker and brings him before Polk, who forces Hooker to betray Gondorff by threatening to jail Luther Coleman's widow.</p><p>The night before the sting, Hooker sleeps with a waitress named Loretta. The next morning, as she walks toward him in an alley, the black-gloved man appears and shoots her dead. The man reveals that he was hired by Gondorff to protect Hooker from Loretta—Lonnegan's hired killer, Loretta Salino—and explains that she had not yet killed Hooker because they had been seen together.</p><p>Armed with a new tip from Harmon, Lonnegan bets $500,000 at Shaw's parlor on Lucky Dan to win. As the race begins, Harmon arrives and expresses shock at Lonnegan's bet: when he said \"place it\" he meant that Lucky Dan would \"place\" (i.e., finish second). In a panic, Lonnegan rushes to the teller window and demands his money back. A moment later Polk, Snyder, and a half dozen FBI agents storm the parlor. Polk confronts Gondorff, then tells Hooker he is free to go. Reacting to the betrayal, Gondorff shoots Hooker in the back. Polk then shoots Gondorff and orders Snyder to get the ostensibly respectable Lonnegan away from the crime scene. With Lonnegan and Snyder safely away, Hooker and Gondorff rise amid cheers and laughter. The gunshots were faked; Polk is actually Hickey, running a con within the con to divert Snyder and ensure that Lonnegan abandons his money. As the con men strip the room of its contents, Hooker refuses his share of the money and walks away with Gondorff.</p><br/><h3>Cast</h3><ul><li>Paul Newman as Henry Gondorff/\"Shaw\"</li><li>Robert Redford as Johnny Hooker/\"Kelly\"</li><li>Robert Shaw as Doyle Lonnegan</li><li>Robert Earl Jones as Luther Coleman</li><li>Charles Durning as Lt. William Snyder, Joliet P.D.</li><li>Ray Walston as J.J. Singleton</li><li>Eileen Brennan as Billie</li><li>Harold Gould as Kid Twist</li><li>John Heffernan as Eddie Niles</li><li>Dana Elcar as Hickey/\"FBI Agent Polk\"</li><li>Jack Kehoe as Erie Kid</li><li>Dimitra Arliss as Loretta Salino</li><li>James J. Sloyan as Mottola</li><li>Charles Dierkop as Floyd (Lonnegan's bodyguard)</li><li>Lee Paul as Lonnegan's bodyguard</li><li>Sally Kirkland as Crystal</li><li>Avon Long as Benny Garfield</li><li>Arch Johnson as Combs</li><li>Ed Bakey as Granger</li><li>Brad Sullivan as Cole</li><li>John Quade as Riley</li><li>Larry D. Mann as Clemens (the train conductor)</li><li>Leonard Barr as Burlesque House Comedian</li><li>Paulene Myers as Alva Coleman</li><li>Joe Tornatore as Black Gloved Gunman</li><li>Jack Collins as Duke Boudreau</li><li>Tom Spratley as Curly Jackson</li><li>Kenneth O'Brien as Greer</li><li>Ken Sansom as Western Union Executive</li><li>Ta-Tanisha as Louise Coleman</li><li>William \"Billy\" Benedict as Jimmy</li></ul><br/><h3>Production</h3><h4>Writing</h4><p>Screenwriter David S. Ward has said in an interviews that he was inspired to write The Sting while researching pickpockets: \"Since I had never seen a film about a confidence man before, I said I gotta do this.\" Daniel Eagan said: \"One key to plots about con men is that film goers want to feel they are in on the trick. They don't have to know how a scheme works, and they don't mind a twist or two, but it's important for the story to feature clearly recognizable 'good' and 'bad' characters.\" It took a year for Ward to correctly adjust this aspect of the script and to figure out how much information he could keep from the audience while still making the leads sympathetic. He also imagined an underground brotherhood of thieves who assemble for a big operation and then melt away afterward.</p><p>Years later, director Rob Cohen recounted how he found the script in the slush pile when working as a reader for Mike Medavoy, a future studio head, but then an agent. He wrote in his coverage that it was \"the great American screenplay and … will make an award-winning, major-cast, major-director film.\" Medavoy said that he would try to sell it on that recommendation, promising to fire Cohen if he could not. Universal bought it that afternoon, and Cohen keeps the coverage framed on the wall of his office.</p><p>Academic David Maurer sued for plagiarism, claiming the screenplay was based too heavily on his 1940 book The Big Con, about real-life tricksters Fred and Charley Gondorff. Universal settled out of court for $600,000, irking Ward, who resented the presumption of guilt implied by an out-of-court settlement done for business expediency.</p><p>Writer/producer Roy Huggins maintained in his Archive of American Television interview that the first half of The Sting plagiarized the 1958 Maverick television series episode \"Shady Deal at Sunny Acres\", starring James Garner and Jack Kelly.</p><h4>Casting</h4><p>Jack Nicholson was offered the lead role but turned it down.</p><p>Newman signed on the film after the producers agreed to give him top billing, $500,000 and a percentage of the profits. His previous five films had been box-office disappointments.</p><p>In her 1991 autobiography You'll Never Eat Lunch in This Town Again, producer Julia Phillips writes that Hill wanted Richard Boone to play Lonnegan. Much to her relief, Newman had sent the script to Robert Shaw while shooting The Mackintosh Man in Ireland to ensure his participation in the film. Phillips's book asserts that Shaw was not nominated for a Best Supporting Actor Academy Award because he demanded that his name follow those of Newman and Redford before the film's opening title.</p><p>Shaw's character's limp in the film was authentic. Shaw had injured his leg while playing handball shortly before filming began. Director Hill encouraged him to incorporate the limp into his character rather than withdraw from the project.</p><h4>Principal photography</h4><p>Hill wanted the film to be reminiscent of movies from the 1930s and watched films from that decade for inspiration. He noticed that most '30s gangster films had no extras. \"For instance\", Andrew Horton's book The Films of George Roy Hill quotes Hill as saying, \"no extras would be used in street scenes in those films: Jimmy Cagney would be shot down and die in an empty street. So I deliberately avoided using extras.\"</p><p>Along with art director Henry Bumstead and cinematographer Robert L. Surtees, Hill devised a color scheme of muted browns and maroons for the film and a lighting design that combined old-fashioned 1930s-style lighting with some modern tricks of the trade to get the visual look he wanted. Edith Head designed a wardrobe of snappy period costumes for the cast, and artist Jaroslav Gebr created inter-title cards to be used to introduce each section of the film that were reminiscent of the golden glow of old Saturday Evening Post illustrations, a popular publication of the 1930s.</p><p>The movie was filmed on the Universal Studios backlot, with a few small scenes shot in Wheeling, West Virginia, some scenes filmed at the Santa Monica pier's carousel, in Southern California, and in Chicago at Union Station and the former LaSalle Street Station. An antique car buff, co-producer Tony Bill helped round up several period cars to use in The Sting. One of them was his own 1935 Pierce-Arrow limousine, which served as Lonnegan's private car.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The film was a box-office smash in 1973 and early 1974, taking in over $160 million. As of August 2018, it is the 20th highest-grossing film in the United States adjusted for ticket price inflation.</p><h4>Critical response</h4><p>Roger Ebert gave the film four out of four stars and called it \"one of the most stylish movies of the year\". Gene Siskel awarded three-and-a-half stars out of four, calling it \"a movie movie that has obviously been made with loving care each and every step of the way.\" Vincent Canby of The New York Times wrote that the film was \"so good-natured, so obviously aware of everything it's up to, even its own picturesque frauds, that I opt to go along with it. One forgives its unrelenting efforts to charm, if only because The Sting itself is a kind of con game, devoid of the poetic aspirations that weighed down Butch Cassidy and the Sundance Kid.\" Variety wrote, \"George Roy Hill's outstanding direction of David S. Ward's finely-crafted story of multiple deception and surprise ending will delight both mass and class audiences. Extremely handsome production values and a great supporting cast round out the virtues.\" Kevin Thomas of the Los Angeles Times called it \"an unalloyed delight, the kind of pure entertainment film that's all the more welcome for having become such a rarity.\" John Simon wrote that The Sting as a comedy-thriller \"works endearingly without a hitch\".</p><p>Pauline Kael of The New Yorker was less enthusiastic, writing that the film \"is meant to be roguishly charming entertainment, and that's how most of the audience takes it, but I found it visually claustrophobic, and totally mechanical. It creeps cranking on, section after section, and it doesn't have a good spirit.\" She also wrote, \"the absence of women really is felt as a lack in this movie.\"</p><p>In 2005, the film was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\". The Writers Guild of America ranked the screenplay #39 on its list of 101 Greatest Screenplays ever written. On Rotten Tomatoes, The Sting holds a rating of 92% from 101 reviews, with an average rating of 8.3/10. The site's critical consensus reads: \"Paul Newman, Robert Redford, and director George Roy Hill prove that charm, humor, and a few slick twists can add up to a great film.\" On Metacritic, the film has a weighted average score of 83 out of 100, based on 17 critics, indicating \"universal acclaim\".</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominees</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Tony Bill</span>, <span>Julia Phillips</span>, and <span>Michael Phillips</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"10\"> <br> </td></tr><tr><td><span>Best Director</span></td><td><span>George Roy Hill</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Robert Redford</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td><span>David S. Ward</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td><span>Henry Bumstead</span> and <span>James W. Payne</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Robert Surtees</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Edith Head</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>William Reynolds</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Scoring: Original Song Score and Adaptation or Scoring: Adaptation</span></td><td><span>Marvin Hamlisch</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound</span></td><td><span>Ronald Pierce</span> and <span>Robert R. Bertrand</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>William Reynolds</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>David di Donatello Awards</span></td><td><span>Best Foreign Actor</span></td><td>Robert Redford</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>George Roy Hill</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Edgar Allan Poe Awards</span></td><td><span>Best Motion Picture</span></td><td rowspan=\"2\">David S. Ward</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Golden Globe Awards</span></td><td><span>Best Screenplay – Motion Picture</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td colspan=\"3\"><span>Golden Screen Awards</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Kinema Junpo Awards</span></td><td>Best Foreign Language Film Director</td><td>George Roy Hill</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Honored</td><td align=\"center\"></td></tr><tr><td><span>People's Choice Awards</span></td><td colspan=\"2\">Favorite Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Producers Guild of America Awards</span></td><td>Hall of Fame – Motion Pictures</td><td>Tony Bill, Julia Phillips, and Michael Phillips</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Drama – Written Directly for the Screen</span></td><td>David S. Ward</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr></tbody></table><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.<br><small><span class=\"plainlinks\"><i>Find sources:</i> <span rel=\"nofollow\" class=\"external text\">\"The Sting\"</span> – <span rel=\"nofollow\" class=\"external text\">news</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">newspapers</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">books</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">scholar</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">JSTOR</span></span></small></span>  <span class=\"date-container\"><i>(<span class=\"date\">October 2020</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">The Sting (Original Motion Picture Soundtrack)</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Marvin Hamlisch</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">1973</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li><span>Jazz</span></li><li><span>ragtime</span></li></ul></div></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">36</span>:<span class=\"s\">59</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>MCA Records</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li><span>Marvin Hamlisch</span></li><li><span>Gil Rodin</span></li></ul></div></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Marvin Hamlisch</span> chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"><i><span>The Way We Were: Original Soundtrack Recording</span></i><br>(1974)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>The Sting (Original Motion Picture Soundtrack)</b></i><br>(1973)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"><i><span>The Spy Who Loved Me</span></i><br>(1977)</td></tr></tbody></table></td></tr></tbody></table><p>The soundtrack album, executive produced by Gil Rodin, includes several of Scott Joplin's ragtime compositions, adapted by Marvin Hamlisch.</p><p>According to Joplin scholar Edward A. Berlin, ragtime experienced a revival in the 1970s due to several events: a best-selling recording of Joplin rags on the classical Nonesuch Records label, along with a collection of his music issued by the New York Public Library; the first full staging of Joplin's opera Treemonisha; and a performance of period orchestrations of Joplin's music by a student ensemble of the New England Conservatory of Music, led by Gunther Schuller. \"Inspired by Schuller's recording, had Marvin Hamlisch score Joplin's music for the film, thereby bringing Joplin to a mass, popular public.\"</p><h4>Charts</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"width: 50%;text-align: left; vertical-align: top;\"><h4><span class=\"mw-headline\" id=\"Weekly_charts\">Weekly charts</span><span class=\"mw-editsection\"><span data-section=\"13\" class=\"mw-ui-icon mw-ui-icon-element mw-ui-icon-wikimedia-edit-base20 edit-page mw-ui-icon-flush-right mw-ui-button mw-ui-quiet\">Edit</span></span></h4><table class=\"wikitable sortable plainrowheaders\" style=\"text-align:center;\"><caption>Weekly chart performance for <i>The Sting (Original Motion Picture Soundtrack)</i></caption><tbody><tr><th scope=\"col\">Chart (1974)</th><th scope=\"col\">Peak<br>position</th></tr><tr><th scope=\"row\">Australian Albums (<span>Kent Music Report</span>)</th><td>1</td></tr><tr><th scope=\"row\">Canada Top Albums/CDs (<i><span>RPM</span></i>)</th><td align=\"center\">1</td></tr><tr><th scope=\"row\">Dutch Albums (<span>Album Top 100</span>)</th><td align=\"center\">11</td></tr><tr><th scope=\"row\">German Albums (<span>Offizielle Top 100</span>)</th><td align=\"center\">39</td></tr><tr><th scope=\"row\">Norwegian Albums (<span>VG-lista</span>)</th><td align=\"center\">3</td></tr><tr><th scope=\"row\"><span>UK Albums</span> (<span>OCC</span>)</th><td align=\"center\">7</td></tr><tr><th scope=\"row\">US <span><i>Billboard</i> 200</span></th><td align=\"center\">1</td></tr><tr><th scope=\"row\">US <i><span>Cashbox</span></i> Top 100</th><td>1</td></tr></tbody></table></td><td style=\"width: 50%;text-align: left; vertical-align: top;\"><h4><span class=\"mw-headline\" id=\"Year-end_charts\">Year-end charts</span><span class=\"mw-editsection\"><span data-section=\"14\" class=\"mw-ui-icon mw-ui-icon-element mw-ui-icon-wikimedia-edit-base20 edit-page mw-ui-icon-flush-right mw-ui-button mw-ui-quiet\">Edit</span></span></h4><table class=\"wikitable sortable plainrowheaders\" style=\"text-align:center;\"><caption>1974 year-end chart performance for <i>The Sting (Original Motion Picture Soundtrack)</i></caption><tbody><tr><th scope=\"col\">Chart (1974)</th><th scope=\"col\">Position</th></tr><tr><th scope=\"row\">Canada Top Albums/CDs (<i>RPM</i>)</th><td>2</td></tr><tr><th scope=\"row\">UK Albums (OCC)</th><td>23</td></tr><tr><th scope=\"row\">US <i>Billboard</i> 200</th><td>9</td></tr><tr><th scope=\"row\">US <i>Cashbox</i> Top 100</th><td>7</td></tr></tbody></table><p> </p></td></tr></tbody></table><h4>Certifications and sales</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th scope=\"col\">Region</th><th scope=\"col\">Certification</th><th scope=\"col\" data-sort-type=\"number\"><span>Certified units</span>/sales</th></tr><tr><th scope=\"row\">United Kingdom (<span>BPI</span>)</th><td>Gold</td><td>100,000<sup>^</sup></td></tr><tr><th scope=\"row\">United States (<span>RIAA</span>)</th><td>Gold</td><td>500,000<sup>^</sup></td></tr><tr class=\"sortbottom\" style=\"text-align: center;\"><td colspan=\"3\"><p><small><sup>^</sup> Shipments figures based on certification alone.</small></p></td></tr></tbody></table><br/><h3>Adaptations</h3><h4>Stage</h4><p>Mark Hollmann and Greg Kotis (music and lyrics), writer Bob Martin, and director John Rando created a stage musical version of the movie. The musical premiered at the Paper Mill Playhouse in Millburn, New Jersey on March 29, 2018. Henry Gondorff was played by Harry Connick Jr., with choreography by Warren Carlyle. The stage musical incorporates Joplin's music, including \"The Entertainer\".</p><h4>Novelization</h4><p>Robert Weverka adapted the film into a full-length novel, The Sting (1974), based on the screenplay by David S. Ward.</p><br/><h3>Home media</h3><p>The movie was issued on DVD by Columbia TriStar Home Entertainment in 2000. \"If Paul Newman really does retire, he can spend his rocking chair years feeling smug about this,\" enthused OK! \"The story's not the important thing: what makes it are the quirky soundtrack, the card-sharp dialogue and two superduperstars at their superduperstarriest.\"</p><p>A deluxe DVD – The Sting: Special Edition (part of the Universal Legacy Series) – was released in September 2005. Its \"making of\" featurette, The Art of the Sting, included interviews with cast and crew.</p><p>The film was released on Blu-ray in 2012 as part of Universal's 100th anniversary releases.</p><p>The Sting was released on Ultra HD Blu-ray on May 18, 2021.</p><br/>"
  },
  "errorMessage": ""
}