{
  "imDbId": "tt0468569",
  "title": "The Dark Knight",
  "fullTitle": "The Dark Knight (2008)",
  "type": "Movie",
  "year": "2008",
  "items": [
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "",
      "rate": "100",
      "content": "Enthralling...An ambitious, full-bodied crime epic of gratifying scope and moral complexity, this is seriously brainy pop entertainment that satisfies every expectation raised by its hit predecessor and then some."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "100",
      "content": "Bale again brilliantly personifies all the deep traumas and misgivings of Batman's alter ego, Bruce Wayne. A bit of Hamlet is in this Batman."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "100",
      "content": "Beyond dark. It's as black -- and teeming and toxic -- as the mind of the Joker. \"Batman Begins,\" the 2005 film that launched Nolan's series, was a mere five-finger exercise. This is the full symphony."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/dark-knight-the",
      "rate": "100",
      "content": "Christopher Nolan has provided movie-goers with the best superhero movie to-date, outclassing previous titles both mediocre and excellent, and giving this franchise its \"The Empire Strikes Back.\""
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "https://ew.com/article/2012/06/16/dark-knight-2/",
      "rate": "91",
      "content": "At two hours and 32 minutes, this is almost too much movie, but it has a malicious, careening zest all its own. It's a ride for the gut AND the brain."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "88",
      "content": "No fair giving away the mysteries of The Dark Knight. It's enough to marvel at the way Nolan -- a world-class filmmaker, be it \"Memento,\" \"Insomnia\" or \"The Prestige\" -- brings pop escapism whisper-close to enduring art."
    },
    {
      "publisher": "Miami Herald",
      "author": "Rene Rodriguez",
      "link": "",
      "rate": "88",
      "content": "The Dark Knight is dark, all right: It's a luxurious nightmare disguised in a superhero costume, and it's proof that popcorn entertainments don't have to talk down to their audiences in order to satisfy them. The bar for comic-book film adaptations has been permanently raised."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "https://www.newsweek.com/ansen-dark-knight-grim-impressive-epic-92669",
      "rate": "70",
      "content": "You may emerge more exhausted than elated. Nolan wants to prove that a superhero movie needn't be disposable, effects-ridden junk food, and you have to admire his ambition. But this is Batman, not \"Hamlet.\" Call me shallow, but I wish it were a little more fun."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/48514/",
      "rate": "50",
      "content": "The novelty wears off and the lack of imagination, visual and otherwise, turns into a drag. The Dark Knight is noisy, jumbled, and sadistic."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "https://www.newyorker.com/magazine/2008/07/21/past-shock",
      "rate": "50",
      "content": "The Dark Knight is hardly routine--it has a kicky sadism in scene after scene, which keeps you on edge and sends you out onto the street with post-movie stress disorder."
    }
  ],
  "errorMessage": ""
}