{
  "imDbId": "tt0119217",
  "title": "Good Will Hunting",
  "fullTitle": "Good Will Hunting (1997)",
  "type": "Movie",
  "year": "1997",
  "items": [
    {
      "username": "Stephen-12",
      "userUrl": "https://www.imdb.com/user/ur0060242",
      "reviewLink": "https://www.imdb.com/review/rw0418096",
      "warningSpoilers": false,
      "date": "17 March 1999",
      "rate": "10",
      "helpful": "695 out of 755 found this helpful.",
      "title": "A slow burner, a fine achievement",
      "content": "Sure, this film's plot is fairly predictable. Sure, if you boiled it down to its essential components it wouldn't amount to much. Sure, Will Hunting's genius is profoundly unrealistic.Yet I'm giving this one 10 out of 10.I don't know whether Matt and Ben have ever been in therapy, but they certainly understand a lot about the human psyche, how it ducks responsibility, and pushes blame onto others, how it dismisses the real gifts it has and concentrates on running itself down. How many of us suffer from the same problems as Will? Only those who deny their own vulnerability will remain unaffected by this film.Not only is the script powerful, but the dynamics between the characters - all of them selfish, even Skylar - is vividly and plausibly executed. The film just about manages to avoid easy answers, preferring to acknowledge (indeed, highlight) the complexity and pain of personal growth and self-realisation.You could read a lot of self-help books, but they won't bring across to you as powerfully as this film what it's like to be scared, what it's like to experience loss, how difficult it is to shake off your old ways of thinking, how important honesty to yourself is. If this is the kind of revelation Matt and Ben are going to come up with, I look forward to their future efforts.The first time I saw it, I felt moved as the credits rolled. On my way home from the cinema, I felt sombre. When I got home, I finally burst into tears. This film burns slowly, inside you.As cinema, it's fair to middling. The performances are all first class. The script is a jewel. As wisdom, it's second to none. A fine achievement."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2502360",
      "warningSpoilers": false,
      "date": "13 October 2011",
      "rate": "10",
      "helpful": "57 out of 66 found this helpful.",
      "title": "Incredible",
      "content": "I don't think I have been this moved by a movie in a while. Good Will Hunting is an incredible movie and if I had to say what I think is Gus Van Sant's best film, this would be it. It is a slow-burner, but I think this was purposefully done and it added to the film's poignancy and psychological aspect.Good Will Hunting is a beautifully filmed movie with striking scenery, and it is directed wonderfully by Van Sant. The music is never obtrusive but never too low-key either, while the story is interesting and compelling and the script intelligently written.The acting is one of the film's best assets, as well as its compellingly real characters. Robin Williams is superb in one of his best \"drama\" roles, while Ben Affleck has never been better and Matt Damon gives another fine performance to match his performance in The Talented Mr Ripley. Minnie Driver is also quite touching and believable.All in all, an incredible movie. 10/10 Bethany Cox"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1940628",
      "warningSpoilers": false,
      "date": "3 September 2008",
      "rate": "10",
      "helpful": "116 out of 150 found this helpful.",
      "title": "The Genius In Our Midst",
      "content": "So many personal projects of our best players never come out quite right. The vision they have somehow doesn't translate to the screen, or it's not box office subject matter, or maybe the actors aren't gifted with writing or directing talent. That's certainly not the case with Good Will Hunting which was not only the breakthrough film for Matt Damon and Ben Affleck, but it will probably remain their most personal endeavor. Not too much imagination was required though because these guys set this film in their native Boston the city they grew up in, the city they seem to know every nook and cranny of. They didn't even have to lose the New England accents they would have to in most of their other films.When Matt and Ben wrote Good Will Hunting the fact they were able to interest a top director like Gus Van Sant in the project should have said something before one views a frame of film. Van Sant got an Oscar nominated performance for Matt Damon and a Supporting Actor Oscar for Robin Williams as the psychologist who counsels Damon.Will Hunting is this average lower middle class kid from South Boston who was in the foster care system and suffered a lot of abuse while growing up. He has some low level jobs, he's constantly getting in trouble with the law for minor scrapes, and he's a functioning genius who for kicks solves a highly complex mathematical equation between buffing floors at MIT.Which perks the interest of Stellan Skarsgaard highly touted mathematics professor there. He feels and I agree with him that one of the worst sins in the world is wasting the talent the Deity blesses you with, whatever it is. After a succession of therapists who are unable to cope with Damon's genius, Robin Williams gets his turn at bat.Robin Williams one of the wildest, wackiest, most innovative comics that ever walked the earth, drops all of that to deliver a highly sensitive performance as the psychologist who finally reaches Damon on some level. What Damon does with it is for you to see Good Will Hunting for.Some of that breakthrough is achieved with the help of Minnie Driver, a British student at Harvard who falls hard for the blue collar Will Hunting. Most of it is achieved though in the film's key scene as Ben Affleck tells him that no matter what your IQ is, if you don't use it and move up and on, you're the stupidest guy here. It's one of Affleck's best scenes in his whole career on film.I've known a few Will Huntings in my day, blessed with talent I would like to have had and who threw it away for a combination of reasons. One in particular I knew back in the Eighties was a kid who originally grew up in Virginia in the Blue Ridge Mountain country to some really uneducated hicks. They discovered he was gay and immediately had him committed. Back in the day, they did all kinds of things to him like electroshock therapy and guess what, it all didn't work. But it left him a twisted and bitter person who gravitated to the new gay rights movement because it was something that finally validated him as a human being.He also was blessed with an incredible baritone singing voice, he could have sang opera had that been trained instead of his parents trying to change his orientation. But when I last saw him in the middle Eighties no one had or could reach him. He made a living running a cleaning service for apartments. If he couldn't sing militant songs of protest he wasn't interested, even if he could have reached millions more with his issues had he studied, learned, and developed.Unlike Will Hunting, Jimmy Flowers wasn't reached as far as I know. But Matt Damon and Ben Affleck in writing their Oscar winning original screenplay could have known him. So I'm sure they won't mind if I dedicated this review to Jimmy whether he's alive or no longer with us. I'm sure there are Jimmy Flowers and Will Huntings that we've all known and hopefully we have the wit to recognize the talent whatever it is and the encouraging nature to make people develop that talent."
    },
    {
      "username": "rondine",
      "userUrl": "https://www.imdb.com/user/ur0181684",
      "reviewLink": "https://www.imdb.com/review/rw0418221",
      "warningSpoilers": false,
      "date": "21 January 2001",
      "rate": "10",
      "helpful": "284 out of 335 found this helpful.",
      "title": "This movie has a brilliant script...",
      "content": "It appears the jury is hung... many people either loved or hated this movie. I can tell you why I loved it. First of all the script. I think it had a real slice of life, and brilliance in it. Sorry, but some people do use 4 letter words to express themselves. And no, it doesn't mean that's because they lack intelligence to use anything else. I can rise to the occasion any time I need w/out profanity. But it is how I think & speak in my day to day life. The language shouldn't even be an issue. If that's all you heard, you weren't listening! The brilliance in it is everywhere. For example, William's character putting Damon's character in place by noting that he sneers at things that he has no real life experience with. I know people like that. Then moments when he (William's character) says gems like, \"I'll save you the suspense sport- she isn't perfect & neither are you- the question is whether you are perfect for each other.\" I'm paraphrasing of course. The question of relationships, and life career decisions- the courage to risk and overcoming whatever your background is, are all a part of real life. This isn't supposed to be about genius or some \"white trash\" as someone else said (some people might say the kids in this movie aren't trash, just normal hard working, middle class guys) - it's about love, life and courage- courage to ante up & try again, no matter how many times life knocks us around. The acting, direction and script are wonderful. They definitely deserved the Oscar for this. It has soul. It has meaning & I am sad for the people that didn't get it. As the movie \"American Beauty\" said... LOOK CLOSER."
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw4076051",
      "warningSpoilers": false,
      "date": "27 February 2018",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Its central performances are phenomenal and its inevitable emotional release is truly powerful.",
      "content": "The genius of 'Good Will Hunting (1997)' isn't in its plotting or its resolution or even its character arcs per say (which are all a little formulaic or clichéd to an extent), but rather in the nuanced and realistic journey that that these almost fully-formed people take to reach the conclusions you know they eventually will. The two central performances are nothing short of phenomenal. Williams' subtly wise and humorous demeanour exudes fatherly knowledge as a man of experience and Damon's frustratingly yet understandably closed-off defensiveness makes his inevitable emotional release truly powerful. The writing rounds them off in ways which make them feel honest, imperfect and, most importantly, real. 8/10"
    },
    {
      "username": "RedRoadster",
      "userUrl": "https://www.imdb.com/user/ur20047343",
      "reviewLink": "https://www.imdb.com/review/rw1967566",
      "warningSpoilers": true,
      "date": "29 October 2008",
      "rate": "9",
      "helpful": "90 out of 105 found this helpful.",
      "title": "\"I had to go see about a girl\"",
      "content": "This is one of those films that you cant help walking away from without being touched in some way. All of the central themes to adult life are explored and exposed by a very good cast. Friendship, love, pain, the past holding back who we could be in the present, acceptance (or not) of our place in society.\"Good Will Hunting\" is the story of Will Hunting played by Matt Damon. He is a young man who is a mathematical genius but has no formal education and who is so traumatised by his past that he will not allow himself to be the man he could with his talents. Will works as a Janitor, but chose the Massachusetts institute of technology (the finest mathematical institution in America as we are told) as the place to work in order to be close to an outlet for his brilliance. Early on in the story, the resident Maths guru Professor Gerry Lambeau sets a problem for his students to solve which should take the whole semester for the average mind. When this problem is solved and written on the faculty blackboard the very next morning, he sets another that took him personally two years to solve. The following day he is conversing with a colleague when he witnesses Will writing down the perfect solution on the blackboard again. The Professor realises he has a genius hiding in his midst.When Will is later involved in a fight, he is eventually given the choice between a short prison term or working with the Professor on a daily basis and also attending psychiatric therapy sessions. Will chooses the latter but uses the therapy sessions as a chance to mock the Psychiatrists assigned to him and show off his knowledge. When no one else will work with him, Professor Lambeau turns to his old room mate at college, Sean MacGuire (played by Robin Williams on Oscar winning form.) who manages to reach the boy emotionally and start to repair the damage that has been done to him.It is widely known that Matt Damon and Ben Affleck co wrote the screen play as a reaction to their slow progress in establishing Hollywood careers. It is a testament to their talent as writers that they came up with so many touching scenes and passages of dialogue. In particular, Williams monologue to Damon when sat on the park bench is sublime. Wills relationship with \"Skylar\" (played by Minnie Driver) is perfectly believable and as the story unfolds the viewer can see the change in Wills character from the cocky kid, pushing everyone away, to the young man who understands who he could be with the right encouragement.There are very few flaws to be found in this film, largely because the story is so well told and Robin Williams performance is worth the entry price alone. It is a genuinely touching experience which relates to so many people and is easy to empathise with in real life. The characters are richly written and they are all interdependent in the telling of the proceedings. You really care what happens to these people.I could \"nick pick\" and draw attention to the psychiatrist scenes in Robert Redfords \"Ordinary People\" (1980) which bear close resemblance to the ones in \"Good Will Hunting\" but I think Damon and Affleck just took the bar up another notch with their interpretation of the Doctor / Patient working relationship.All in all an uplifting and worthwhile movie going experience which will stay with you long after you leave the cinema."
    },
    {
      "username": "Bored_Dragon",
      "userUrl": "https://www.imdb.com/user/ur56005872",
      "reviewLink": "https://www.imdb.com/review/rw3736527",
      "warningSpoilers": false,
      "date": "22 June 2017",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Beautiful",
      "content": "I return to this movie from time to time for the last two decades. I do not like Damon and Affleck, but this is their lifetime achievement and the most deserved Oscar they will ever win. Beautiful drama about finding yourself, finding a balance between the essence of life and its everyday appearance, about love and friendship. Realistic, unpretentiously philosophical and warm movie about life. Two main trumps of this movie are its perfect script and brilliant Robin Williams, the actor that adds warmth and love in everything he does. I can not say it's a masterpiece of cinematography, but it surely is beautiful, intelligent and it never gets old.9/10"
    },
    {
      "username": "Eight Two",
      "userUrl": "https://www.imdb.com/user/ur0565303",
      "reviewLink": "https://www.imdb.com/review/rw0418195",
      "warningSpoilers": false,
      "date": "18 June 2000",
      "rate": "",
      "helpful": "161 out of 200 found this helpful.",
      "title": "The Real Best Picture of 1997",
      "content": "While everyone took sides with L.A. Confidential (for it's Old Hollywood flair and tight-as-a-girdle plot arc) or Titanic (for it's generally inescapable, juggernaut-like aura) as the Best Picture of 1997, it seems that too many people overlook Good Will Hunting for what it was: a timeless little opus that managed to make South Boston look romantic and happened to make Ben Affleck and Matt Damon some of the most deserving superstars in recent memory.Because before they were anybody, they were just the writers of this tale of a reluctant human being named Will Hunting, a mathematical genius who wore the guise of a hoodlum, and all of the sudden obstacles he had to take on to truly step in to manhood. Among these obstacles were a straight-forward shrink who outright dared Will to bulls*** him (played by Robin Williams, who got his overdue Oscar for it), a brilliant M.I.T. professor who felt it his own personal redemption to put Will's mind to great use somehow (Stellan Skarsgård, who never fails to steal nearly every scene he's in), and a girl who doesn't understand why the boy she loves so much cannot love her.It was these obstacles that made Will Hunting such a complex character: while he was a genius at the definite (math), he was a bit of a moron at the indefinite (human relationships). His rough-edged exterior was simply a cry for help, and the process of which the obstacles in his life realized that and attempted *to* help him was nothing short of extraordinarily touching."
    },
    {
      "username": "harry-76",
      "userUrl": "https://www.imdb.com/user/ur0239428",
      "reviewLink": "https://www.imdb.com/review/rw0418198",
      "warningSpoilers": false,
      "date": "25 June 2000",
      "rate": "8",
      "helpful": "136 out of 198 found this helpful.",
      "title": "Two Pals Make Good in Hollywood",
      "content": "Matt Damon and Ben Affleck scored quite a success with their interesting and entertaining script. The introduction and exposition sections are enormously engrossing, after which script peaks and rather coasts along the rest of the way. Yet, the casting is so well done, and the acting at such good level, that interest is nicely maintained.What \"Hunting\" essentially consists of is some two dozen conversational scenes, bridged together with short transitions of physical activity. What is rather remarkable is that one isn't aware of the dramatic limitations comprising the structure. This is a real tribute to the cast, director, and of course, the script. While the basic situation is really quite far-fetched, it is made to seem plausible--again, the mark of good, convincing writing. The story behind getting the script sold and produced on the terms of the writers' preferences is fascinating. Still, one can't really call it luck, for both Damon and Affleck \"paid their dues\" -- and success did not just fall into their laps. These are two talented young men, with perseverance; and how wonderful for them to have achieved such success while still youthful and full of vitality. \"Good Will Hunting\" is a good production, with solid craftsmanship in all departments -- thanks to the creativity of Damon and Affleck."
    },
    {
      "username": "MrPupkin",
      "userUrl": "https://www.imdb.com/user/ur102605581",
      "reviewLink": "https://www.imdb.com/review/rw5205631",
      "warningSpoilers": false,
      "date": "22 October 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A life lesson !",
      "content": "Robin Williams gives the best performance of his career alongside memorable performances from Matt Damon and Ben Affleck. This masterpiece will have you laughing and crying and by the end feeling reborn."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3608218",
      "warningSpoilers": false,
      "date": "28 December 2016",
      "rate": "10",
      "helpful": "17 out of 23 found this helpful.",
      "title": "A Sensitive, Remarkable Look at Genius",
      "content": "Matt Damon's Will Hunting couldn't be more complex. He is an utter genius. Unfortunately, he has enough baggage to send him around the world. Will is a brilliant mathematician, smarter than many of the professors at MIT. However, he is depressed and self destructive. He gives up the minute things get hard. He can't relate to others, especially women. After many failures to help him, he hooks up with a man who respects him (but who also fears his insights) played by Robin Williams in one of his finer dramatic roles. He pushes Will and Will pushes back. The interaction between two imperfect, but brilliant, human beings is the core of this movie. Created by Damon and Ben Affleck, this was probably the best movie of the year. Will Hunting is searching for happiness, as are we all, but others have decided what that happiness looks like. He is indeed \"hunting\" for joy in his life. Excellent performances all around."
    },
    {
      "username": "bradykitchen-33648",
      "userUrl": "https://www.imdb.com/user/ur125900670",
      "reviewLink": "https://www.imdb.com/review/rw8176514",
      "warningSpoilers": false,
      "date": "26 May 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Good Will Hunting Review",
      "content": "Will Hunting a janitor at M. I. T has a gift for learning, but his genius is going to waste because he can't seem to find his purpose in life.Back in 2019 I had went to Boston to see the Celtics and the Bruins, and the hotel I was staying at had a pillow with \"wicked smaht\" stitched on to it. I remember my dad seeing it and immediately saying the iconic line \"my boys wicked smaht\", and I asked him what that was from. He told me it was from a classic movie called Good Will Hunting that takes place in Boston. So, with my curiosity peaked I returned home and watched it for the first time. Since then I have seen this film 5 times and it has become one of my all time favourite films.From top to bottom this film is perfection. Matt Damon and Robin Williams give what I considered the best performances of their careers, along with two very strong performances from Ben Affleck and Stellan Skarsgard. The writing is incredible and the dialogue in particular is phenomenal. The cinematography and direction by Gus Can Sant is perfect throughout the entire film, and the music to accompany it is beautiful.What makes this film for me is that it is something we can all relate to. This film is about finding yourself and finding a purpose for your life, everyone on the planet at one point or another needed to seriously consider the question \"who am I\". That for me is an extremely powerful message and why this film is so great.10/10 A+"
    },
    {
      "username": "minister_of_silly_walks",
      "userUrl": "https://www.imdb.com/user/ur64212521",
      "reviewLink": "https://www.imdb.com/review/rw4597708",
      "warningSpoilers": false,
      "date": "21 January 2019",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Thought provoking classic",
      "content": "One of the movies which turned Robin Williams into a legend! He proved in this movie that he is as good in his dramatic roles as in his comedic routines. Pair that with a great performance from Matt Damon as the tittle character and an inspiring story built upon the everyday struggle of the characters and you got yourself a 90's cinematic classic."
    },
    {
      "username": "jrarichards",
      "userUrl": "https://www.imdb.com/user/ur20250079",
      "reviewLink": "https://www.imdb.com/review/rw5149973",
      "warningSpoilers": true,
      "date": "29 September 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Inspired genius ABSOLUTELY worth revisiting in 2019 - COMPULSORY for first-timers",
      "content": "This is a stunningly good bit of Damon-Affleck co-writing from an astonishing 22 years ago), directed by Gus Van Sant and offering outstanding roles, not only to the aforementioned pair (who absolutely shine together), but also to Minnie Driver, plus Stellan Sktarsgard and Robin Williams (another amazing pairing).What good did we do to deserve this feast of talent? For the ears in particular, as FANTASTIC, deep, meaningful, powerful dialogue pours out of the mouths of the stars.Ironically, when I first watched this - not too long after it was made - I felt annoyed and exasperated with Damon's character Will Hunting (hence the clever nature of the title). I just got fed up with someone that gave so little back to (or actively abused and rejected) 4+ great (if of course quite flawed) human beings who were prepared to devote so much time and unrewarding effort.This time round I'm more charitable. Will is a genius that leaves supervising Prof. Lambeau (Skarsgard) in awe, jealous, admiring, and above all immensely frustrated. For Will comes from absolutely the wrong side of the tracks, and yet is a mathematical genius the likes of which Harvard/MIT have never seen, yet is listless and aimless and drifting over to the bad instead of the good, because of fearful psychological experiences from childhood that psychiatrist Dr Maguire (Williams) seeks to help him with, mostly to no avail.So Lambeau has his academic and other reasons for going the extra mile, the latter's old schoolmate Maguire has his occupational commitment (though both are strained to and beyond the limit by their pupil-patient), but the Minnie Driver part (Skylar) just has her love for Will - and his throwing that back in his face hurts us even more than the other rejections. Seemingly most complacent and non-judgmental is Will's co-worker on the construction site and drinking and free-time buddy Chuckie (Affleck), who ultimately stops being easy-going when he shakes Will by saying that his non-gifted, worker pals EXPECT Will to make what he can of talents they would give anything to have.All the interactions here are exquisitely, searingly well-observed and magnificently well-written, but the genuineness of the Affleck-Damon dialogues are the ones that hit home most of all, reminding us of the remarkable kindness and insight and true understanding that can at times exist in real life among ostensibly non-intellectual, tough-exteriored working-class men.For most of the movie, it seems that none of these helpful and well-meaning interventions is going to cut any ice; and indeed the happy ending may look a bit too cute. However, we would have found the whole thing very tough-going without it.In any case, the film is indeed an almost excruciatingly erudite work of intense meaningfulness and genius, and a no-possible-shirking must-see for those who haven't."
    },
    {
      "username": "bombersflyup",
      "userUrl": "https://www.imdb.com/user/ur25775215",
      "reviewLink": "https://www.imdb.com/review/rw7245391",
      "warningSpoilers": true,
      "date": "19 August 2021",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Exceptional film.",
      "content": "Good Will Hunting is an engrossing and well written drama, with a wonderful cast.Written by Damon and Affleck themselves. The most important scene between the two, where Chuck altruistically tells Will how it is at his own expense, that he doesn't want to see him around. Minnie Driver's likable as the romantic interest, but it's Robin Williams who elevates this piece to greater heights, along with Damon's stellar performance. The film contains heart and humour, with memorable and endearing qualities."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3858640",
      "warningSpoilers": true,
      "date": "15 November 2017",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "\"So what do you really wanna do?\"",
      "content": "For a couple of guys in their Twenties, Matt Damon and Ben Affleck brought a lot of insight into their screenplay treatment for \"Good Will Hunting\". Especially good is the dialog that occurs between Will (Damon) and therapist Sean (Robin Williams) in their various exchanges that span the confrontational to the healing. You have to wonder where those nuggets of wisdom came from for the characters to deal with each other in such a credible fashion.I think a lot of viewers, particularly male, can relate to Will's seeming lack of direction; personally, my own period of existential angst occurred right about the same time Will was dealing with his. My only trouble was that I wasn't as brilliant as the character portrayed by Damon, his was a one in a million intellect that could see solutions to mathematical problems that someone like myself would fail to comprehend. Perhaps the overarching problem one faces is unless you have a passion about a certain thing, then how do you know what kind of career to pursue or who the right person is to establish a lifetime commitment with. I'm sure a lot of people never figure it out.I've seen this movie a couple of times in the past, but my viewing the other day was kind of significant in an odd way concerning guys like Ben Affleck and brother Casey. It has to be embarrassing for Affleck to see himself now in a film where he's such an insensitive jerk when it comes to women. As casualties of the Harvey Weinstein meltdown in Hollywood of recent weeks, film roles like Affleck's Chuckie only confer additional credibility to an off screen questionable persona. It's too bad because I never considered him a Hollywood bad boy, but then again, how would one ever know?"
    },
    {
      "username": "atlasmb",
      "userUrl": "https://www.imdb.com/user/ur34845698",
      "reviewLink": "https://www.imdb.com/review/rw8122015",
      "warningSpoilers": false,
      "date": "7 May 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A Great Script And Fine Acting",
      "content": "This is the film that put Matt Damon and Ben Affleck on the map, winning them an Oscar for their screenplay. It's a wonderful script about a young man with extraordinary talents whose rough upbringing undermines his opportunities.Matt Damon plays Will Hunting, a polymath with an eidetic memory who works as a custodian at MIT. He lives by both his wits and his fists. Minnie Driver plays Skylar, the university student who falls for the brash young man. And Robin Williams, in an Oscar-winning performance, plays Sean, the community college instructor who dares to confront Will's demons. All three are tremendous.Damon and Affleck know Boston and they imbue the story with blue-collar authenticity. The film understands the anti-intellectualism of some of its characters (compare \"Breaking Away\") but also celebrates the upper limits of scholarship and prodigious abilities. Will is actually an anti-intellectual intellectual.This is one of the best films of its decade. There, I said it. How do you like them apples?"
    },
    {
      "username": "RonellSowes",
      "userUrl": "https://www.imdb.com/user/ur120431365",
      "reviewLink": "https://www.imdb.com/review/rw6758841",
      "warningSpoilers": false,
      "date": "30 March 2021",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Thoughtful Warm Film",
      "content": "For the longest period of time I never understood the title of this film. Was it about someone on some Diogenes style quest? Or was was it about someone who scowers thrift stores? Well, it has nothing to do with good will or Goodwill, it's about a young man called Will Hunting. He's a(somewhat unrealistic)genius who can solve math problems that baffle the world's greatest minds and knows twice as much on any subject covered in a Harvard class...yet he works as a janitor. A professor at MIT stumbles across and sets him up with a therapist, who tries to counsel Will while drilling to the core of his problems.The film might be centered around Matt Damon, who gives a deep performance, but Robin Williams claims every scene he's in and is the most memorable thing from this film. As you probably know, the picture also features Ben Affleck in a limited role, through which he still makes his talent evident. But while Damon, Affleck and William's may have been good choices Minnie Driver certainly wasn't. Who thought of her for the role or what they saw I'll never know.The backstory behind the script is so well known that I won't bother going over it; all I will add is that Affleck and Damon didn't do to bad a job for a first time and recieved a merited Oscar for it.Good Will Hunting is a thought provoking film and that's why so many enjoy it. It's a film that actually tried to be more than cheap entertainment and it succeeded."
    },
    {
      "username": "obrofta",
      "userUrl": "https://www.imdb.com/user/ur4597649",
      "reviewLink": "https://www.imdb.com/review/rw1586317",
      "warningSpoilers": true,
      "date": "29 January 2007",
      "rate": "10",
      "helpful": "68 out of 95 found this helpful.",
      "title": "Worth Seeing",
      "content": "This is a screenplay, whose script was written by Ben Affleck and Matt Damon and sold for $ 600,000. (They split the proceeds)I love this movie. I have seen it several times, and I still want more at the end (Isn't that what good movies do to you?) The subplots make for mini-movies of their own, especially the interplay between Robin Williams' character and Stellan Skarsgard's character.Damon's real life buddy Affleck plays that same buddy role in GWH, and provides the definition for true friendship.Minnie Driver is compelling, and I just love a couple of scenes when she and Damon are in a novelty store, and another where she is telling a joke in a bar with Damon, Affleck and friends. The love story which develops with Driver is very convincing, and it's \"under the surface\" portrayal plus input from one of our favorite characters makes for one of the best definitions of intimacy I have ever seen on film.When I see some of the movies in IDB's top 250, I am sad that this movie isn't in there, but that is my opinion. Torn between GWH and Rounders as Damon's best movie, though I think GWD plays to a wider audience."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw6020899",
      "warningSpoilers": false,
      "date": "23 August 2020",
      "rate": "",
      "helpful": "17 out of 25 found this helpful.",
      "title": "exceptional",
      "content": "A film growing up in yourself. It is so simple to say about it be great, admirable, profound touching or remarkable. But ,in obvious manner, it is more than a film. The reasons are many and few from them are only emotions. A beautiful script as the impressive job of two young actors, A magnificent Robin Williams and a seductive end. At the first sigh, a film in which you recognize yourself. But it is more, nuanced, precise and inspired portrait of potential, help, life meaning , love and the most profound truth defining yourself and your world."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3152630",
      "warningSpoilers": true,
      "date": "31 December 2014",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "terrific characters",
      "content": "Will Hunting (Matt Damon) and Chuckie Sullivan (Ben Affleck) are best friends and ruffians from south Boston. MIT Prof. Gerald Lambeau (Stellan Skarsgård) always puts a challenging problem outside his class for his students. Will is on parole, given a janitorial job and solves the problem. Lambeau is surprised that nobody claims the solution and puts another problem up. He catches the janitor doing the solution and helps him in his trial for hitting a cop. Will is a mess. He's an orphan who suffered as a foster child. He meets Skylar (Minnie Driver) but can't quite open up to her until he starts seeing Dr. Sean Maguire (Robin Williams). Maguire is Lambeau's last resort. They were college roommates and he is suffering from the lost of his wife.These are great characters. The first meeting between Will and Dr. Maguire is electric. It is a couple of powerful performances. Will gets a twinkle in his eye when he finds Maguire's weak spot. Gus Van Sant does a good job mostly getting the great performances. Will has four relationships in this movie. Each one is fascinating and each one is given great material."
    },
    {
      "username": "heisenberg12",
      "userUrl": "https://www.imdb.com/user/ur57699719",
      "reviewLink": "https://www.imdb.com/review/rw4977848",
      "warningSpoilers": false,
      "date": "5 July 2019",
      "rate": "8",
      "helpful": "55 out of 84 found this helpful.",
      "title": "Good but overrated and overhyped",
      "content": "It's a good movie; the premise is its best point, as well as the human connection between friends and relationships, but so many reviews on here calling this a masterpiece or one of the best movies ever made are way unwarranted and over the top. It's a good low budget movie with some depth and a famous role for Robin WIlliams, who won the best supporting actor Oscar. The script is good, but not great, the directing is slightly above average, it drags at times, and some little aspects of it are unrealistic. It's definitely good and worth a watch, but it's not one of the greats of all time.8/10"
    },
    {
      "username": "clacura",
      "userUrl": "https://www.imdb.com/user/ur62442180",
      "reviewLink": "https://www.imdb.com/review/rw3839526",
      "warningSpoilers": false,
      "date": "23 October 2017",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A Movie About Men: The Internal Fight Club",
      "content": "Why another review? Well, for the few that might read this, I find this movie very accurate about the state of seeing a counselor. It is also very accurate about a man who carries deep toxic shame within keeping him from intimacy with others and living with massive defense mechanisms. Because of this, I understand why some do not like this movie, it taps a part of themselves they are still running from, and that is why this movie is so powerful.It is very hard to believe two 25yos wrote this script with such realistic relational depth. There are some very powerful emotional dynamics in this movie--the scene with Will & Skyler in her apartment when Will unpacks. The monumental scene with Will and Sean \"It's not your fault\"--when a movie is a template for real life, this is an epic work of art! This movie allowed people to talk and relate when emotions were road blocks, to point to a scene in Good Will Hunting to establish a base for communication.Here's a point in real time. I was writing this review and a friend called. He ended up hanging up the phone on me because I questioned him about a project. He did a \"Will\" in Skyler's room on me because I tapped a dark shadow in his life. His sensitivity to being questioned is such a part of his identity he is unconscious about, but something that causes him great conflict in his marriage which is now a divorce, his inability to stay employed, and history with addiction.This movie lays a template for men's issues!"
    },
    {
      "username": "mikayakatnt",
      "userUrl": "https://www.imdb.com/user/ur108874341",
      "reviewLink": "https://www.imdb.com/review/rw5562204",
      "warningSpoilers": false,
      "date": "19 March 2020",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "One of the best feel-good movies out there",
      "content": "One of my favorite Robin Williams movies. Hits that certain feel-good spot that we all need every once in a while.The subject matter is a bit tougher in this movie, but it's one that almost every teenager can relate to.4.5/5. Instant classic. Must watch."
    }
  ],
  "errorMessage": ""
}