{
  "imDbId": "tt0099348",
  "title": "Dances with Wolves",
  "fullTitle": "Dances with Wolves (1990)",
  "type": "Movie",
  "year": "1990",
  "items": [
    {
      "publisher": "Washington Post",
      "author": "Hal Hinson",
      "link": "",
      "rate": "100",
      "content": "A gigantic achievement, an endowment of riches."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "This movie moves so confidently and looks so good it seems incredible that it's a directorial debut."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "Costner's directing style is fresh and assured. A sense of surprise and humor accompany Dunbar's adventures at every turn, twisting the narrative gently this way and that and making the journey a real pleasure."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "90",
      "content": "Costner (with Michael Blake's screenplay) creates a vision so childlike, so willfully romantic, it's hard to put up a fight."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "88",
      "content": "A three-hour delight\u0085 The movie generates much of its power by being so life-affirming at a time when people feel nervous about the future. [9 Nov 1990, Friday, p.C]"
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/gyrobase/Guides/Film/?Film=oid%25253A139669",
      "rate": "78",
      "content": "The film's politically correct repudiation of the familiar black-and-white characterizations of the white and red man is ultimately undermined, however, when the pendulum swings too far in the other direction."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "75",
      "content": "The picture moves slowly but never sluggishly, and it never grinds down. The measured pace shows real assurance on the part of Costner. [9 Nov 1990, Daily Datebook, p.E1]"
    },
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "",
      "rate": "70",
      "content": "It would be nice, for instance, to meet some white man, other than Dunbar [Costner], who is not a brutish lout. And it would not harm the film if there were one or two bad-natured Sioux visible in it. [12 Nov 1990, p.102]"
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "63",
      "content": "Smoothly directed by Kevin Costner, who also gives a sensitive performance in the leading role. The screenplay is often trite, however, and there's no reason for the picture's three-hour length. [9 Nov 1990, Arts, p.12]"
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "50",
      "content": "The movie is so busy turning the Sioux characters into photogenic saints that it never quite allows them the complications of human beings."
    }
  ],
  "errorMessage": ""
}