{
  "imDbId": "tt0099348",
  "title": "Dances with Wolves",
  "fullTitle": "Dances with Wolves (1990)",
  "type": "Movie",
  "year": "1990",
  "items": [
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw6808367",
      "warningSpoilers": false,
      "date": "12 April 2021",
      "rate": "9",
      "helpful": "63 out of 66 found this helpful.",
      "title": "Fantastic",
      "content": "It's hard to think of blockbuster films that portray Native Americans as well as this one does. They are human beings here, with different personalities, intelligence, dignity, culture, and humor. The fact that a major Hollywood film had a good portion of its dialogue spoken in Lakota, subtitled in English, is fantastic. The portrayal of white cruelty, such as in the scene with rotting buffalo carcasses littering the prairie, invert the classic narrative, both in the genre of Westerns and in how history is often taught. The film identifies who the real savages were, and Kevin Costner should get a lot of credit for that.The film is of epic length, and by no means perfect. I would have preferred it without the love story, and for more centering on the native characters. The soundtrack is also intrusive, and there were many instances where I found myself thinking that the scene would have played more effectively had it been set to minimal audio. As for the criticism that it uses the 'white savior' trope, I didn't see it that way - if anything, Costner's character is the one saved, both spiritually and then physically as he's about to be hanged for treason. It's much more about the beauty of coexistence and of respecting other cultures, and how tragic the historical genocide was.The film is clearly a labor of love, and Costner took a lot of risks with it. The casting of Native actors quite honestly felt decades ahead of its time, and Graham Greene (Kicking Bird), Rodney A. Grant (Wind In His Hair), and Floyd Red Crow Westerman (Chief Ten Bears) are all wonderful. The cinematography on location mostly in South Dakota is simply stunning. However, what I love most about it is its heart, and how it shows simple appreciation for the Sioux people. \"They were a people so eager to laugh, so devoted to family, so dedicated to each other. The only word that comes to mind is harmony,\" the main character says. Would love to see more films like this, and from a native perspective. 31 years later, it's long overdue, but give Costner credit for what he accomplished in 1990."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2322324",
      "warningSpoilers": false,
      "date": "10 October 2010",
      "rate": "10",
      "helpful": "70 out of 80 found this helpful.",
      "title": "It is the trail of a true human being. I think you are on this trail and it is good to see.",
      "content": "Dances With Wolves Is directed by Kevin Costner who also stars. It's adapted by Michael Blake from his own novel of the same name. Starring along side Costner are Graham Greene, Mary McDonnell & Rodney A. Grant. Dean Semler provides the cinematography & John Barry the musical score. Set during the American Civil War, the story tells how Lieutenant John Dunbar (Costner) goes to a military outpost on the American frontier, where confronted with alienation he befriends nature, the Lakota Indians and finds himself in the process.\"I had never known a people so eager to laugh, so devoted to family, so dedicated to each other. And the only word that came to mind was harmony\"The critics were rubbing their hands with glee, getting ready to tear Costner apart for what undoubtedly would be a failure. An epic Western movie made in 1990, had he not learnt from Heaven's Gate? It was long in production, and with only a $15/$22 million budget afforded it, word came that Costner had to put in $3 million of his own cash to aid production. It was beset with production delays as the problems mounted up with the weather, animal training and with action scenes taking up to three weeks to shoot, all contributing to the belief that it was doomed to failure. \"Kevin's Gate\" they cried, what's that? It's partially sub-titled too? Never work.Dances With Wolves went on to make $424 million in Worldwide theatre tickets alone. Heaven knows what the total would be if we added the VHS & DVD returns as well! Come Academy Award time the film won 7 Oscars, including Best Picture (making it the first Western to win the prestigious award since Cimarron in 1931) & Best Director. It was also nominated in five other categories with Costner up for Best Actor, Graham Greene for Best Supporting Actor & Mary McDonnell for Best Supporting Actress. It was, all told, a personal, artistic and commercial triumph for Costner. One can see him post Oscar night sitting there on his porch sipping sour mash and flipping the finger at all those critics who willed him to fail.Costner's movie is a simple tale, of that there is no arguing. But Dances With Wolves (the name given to Dunbar by the Sioux) is magnificently told, as enchanting a Western that has ever been made. It boasts everything needed to make a first class Oater. The story may be simple but it's rich on detail, the characters have real depth and it never sags, not even in its magnificent elongated directors cut that runs 236 minutes. The credit has to go to Costner, who in his debut as director lest we forget, has managed to blend everything together in the style of one of the old masters from the classic Western period. Every tonal avenue ventured down pays off handsome rewards, it all goes somewhere, awash with wistfulness, romanticism and elegiac poetry. The action sequences are expertly crafted, with a buffalo hunt particularly breath taking; no CGI here, the odd animatronic for a close encounter, but mainly the real deal, as are the wolves and the Lakota Sioux, too, who are played by Native Americans. Its humorous too, with its fun being intentional and aiding the flow of the friendships forming.As most Western fans will tell you, a lyrical horse opera needs great location work and a score to match. Thankfully Dances With Wolves has both, as both Semler & Barry produce work that picked up the Golden Baldy on Oscar night. Lensed predominantly in South Dakota around the Black Hills & Badlands regions, Semler infuses the film with natural landscapes that send the frontier bursting thru the screen, his framing explains things better than words can in this environment. While Barry's score, lifting nicely from A View To A Kill at times, is suitably grand, deft in touch for the main theme and blood pumping for the buffalo hunt and the Pawnee attacks. Acting wise the award nominations received for Costner, Greene & McDonnell were richly deserved. The boys are quiet and undemonstrative, at one with the essence of the story and infusing it with a sincerity so lacking in many epics. Playing Stands With A Fist, a white woman raised by the Sioux after her family were slaughtered when she was a child, McDonnell has to reach different character levels as the story unfolds, and she delivers emotional depth on every level. No nomination for Grant, but his work is top dollar also, his latter scenes with Costner really nail the shift in tone.There's some historical missteps that will no doubt annoy the purists, like I don't believe the Pawnee were the aggressors they are painted as here. While the central romance between Costner & McDonnell is delicate but not fully formed; tho it does improve in the directors cut. But it's hard to criticise little itches when such vision and ambition comes together as well as it does here. Structured with precision and showing respect for tradition, this is a movie about loving people for people lovers. And one can quite easily believe that some genre legends up in the sky were looking down and nodding approvingly. 10/10"
    },
    {
      "username": "bheadher",
      "userUrl": "https://www.imdb.com/user/ur20597848",
      "reviewLink": "https://www.imdb.com/review/rw4656461",
      "warningSpoilers": true,
      "date": "14 February 2019",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "A legacy for all time...",
      "content": "I rember seeing this shortly after it came out; the movie speaks to the conflict called the Civil War, but only briefly. The rest of Dances With Wolves speaks directly to the heart and soul of The Native Americans. It is a time that doesn't exist any more certainly, but everyone can learn something about our modern society and how really chaotic it is...Advanced does not mean civilized all the time..."
    },
    {
      "username": "Wuchakk",
      "userUrl": "https://www.imdb.com/user/ur4409266",
      "reviewLink": "https://www.imdb.com/review/rw2476226",
      "warningSpoilers": false,
      "date": "19 August 2011",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Rediscover \"Dances With Wolves\"",
      "content": "I haven't seen \"Dances With Wolves\" for years but recently rediscovered its brilliance. Released in 1990, the story involves Lt. Dunbar (Kevin Costner), a Civil War hero, singlehandedly manning a desolate prairie post in South Dakota. He becomes intrigued by his Native American neighbors, a small tribe of Lakota Sioux, and slowly develops good relations with them. He ultimately adopts a Sioux name - Dances With Wolves - and assimilates with the tribe. When the U.S. Army discovers his actions he is treated as a treasonous deserter. Mary McDonnell and Graham Greene have key roles. This is, simply put, filmmaking of the highest order. Everything magically works in this absolutely engaging 3-hour epic Western. The extended director's cut is an hour longer and most of the added material is worthwhile and fleshes out the characters more than the theatrical cut. I recommend watching the 3-hour version and, if you want more, check out the expanded version.Over the years I've heard some grumbling about the film's PC-influenced negative portrayal of whites in general and also its supposed romanticized portrayal of Indians as super-virtuous. Hence, before viewing the film again I was braced for the worst. After seeing it, I must say that most of these grumblings are hogwash. No kidding. Really, only a rigid white redneck \"patriot\" would take offense to this story (and, don't get me wrong, I'm patriotic but not mindlessly so). The film rings of authenticity and the characters are anything but one-dimensional. Want proof? (No major spoilers).The Pawnee are the first Indians the viewer encounters in the film and they are portrayed as completely hostile to whites and other NA tribes - so hostile that they'll kill a white person on sight without mercy. I'd say this is a negative, stereotypical portrayal of Indians, wouldn't you agree? Also, Wind In His Hair (Rodney A. Grant) clearly states that the Sioux should kill Dunbar at the council meeting; I'm sure there were others who agreed with him but it was ultimately decided that killing Dunbar would likely cause more problems than solve.Not all white people are shown in a negative light; in fact, Dunbar himself - the film's protagonist - is white. What about the \"foul\" guy, Timmons, who escorts Dunbar to the abandoned fort? I've met people just like him. He's not portrayed as evil, but merely uncouth in dress and manners. Anyway, when Timmons gets savagely murdered by a band of Pawnee he begs over and over that the Indians not hurt his mules; his dying words are words of love (for his animals!). Also, when he says goodbye to Dunbar at the fort he says, \"Good luck, Lieutenant\" and you know he means it; the words show love and respect. Obviously this was a disgusting guy with a heart of gold. Again I know people just like him; it rings of authenticity.The story takes place during the Indian Wars where there's very little love & compassion of whites towards Indians and vice versa. The U.S. Army is there to do a job and, as usual, go by the book. Is this a negative portrayal or simply the way it was? The answer is obvious. Hence, most of the officers are not shown in a negative light but merely as military leaders carrying out their duty. Although some of the main enlisted soldiers come off as clueless sheetheads, again, the characters ring of true life. I met people just like 'em in the military.Besides, I repeat, not all Natives are depicted as virtuous. The Pawnee are obviously ruthless villains and quite a few Indians are shown helping the U.S. Army and are, therefore, traitors to their people.Is the small tribe of Lakota Sioux really super-virtuous? Is their lifestyle really a paradise? No, they're merely portrayed as real people living, pursuing happiness, uncertain about the amassing whites, fighting and persevering through hardships (like the winter camp).Is the massive annihilation of Bison (leaving their skinless carcasses to rot in the sun) a negative depiction of whites or just the way it was? Such people would likely shoot a wolf for the \"fun\" of it. Again, it smacks of reality.This is just a taste. Clearly, the people in the film are not as one-dimensional as some maintain. Neither is the movie as pro-Indian/anti-white as some insist. It's more complicated than that.As to the accuracy of the story itself, the fact is that many whites have \"gone injun\" and many Natives have assimilated with whites. The story explores the possibility of what would happen if a white man dropped all prejudices and tried to get along with some Sioux neighbors; and what if this small band of Natives was open and curious enough to accept him? Is it unlikely that this band would have an available good-looking white woman amongst them that Dunbar could fall in love with? Is there a bit of romanticization? Yes, but it IS a Hollywood movie, after all. Regardless, it's presented in a believable, compelling and captivating way.\"Dances\" is almost 20 years old but remains timeless like most great films; it is the definition of why films are made.The film was shot mostly in Western South Dakota with additional shooting in Jackson, Wyoming, as well as Nebraska and Kansas. GRADE: A+"
    },
    {
      "username": "mattrochman",
      "userUrl": "https://www.imdb.com/user/ur5347756",
      "reviewLink": "https://www.imdb.com/review/rw1379441",
      "warningSpoilers": false,
      "date": "28 May 2006",
      "rate": "10",
      "helpful": "176 out of 210 found this helpful.",
      "title": "The best film of all time",
      "content": "Many people regard a lot of films as \"top class\" but I always keep a little shelf in my mind for the films that I regard as the best films of all time - films that are simply timeless masterpieces. Welcome to the top of that shelf! There are certain criteria by which films are judged and greatness is only obtained when all the criteria are satisfied in full. Dances with Wolves is the greatest timeless masterpiece of cinema to date because it satisfies all these criteria: 1) Cinematography: the sweeping landscape photography of the Frontier combined with the subtle night-time photography earns top marks. Aside from Oscars for Cinematography and editing, it also won the ASC award for Outstanding achievement in Cinematography - as well as a host of other industry recognition awards. In short - the cinematography is breathtaking.2) Sound/Score: the score is one of the best ever written. Again, awards rained from the sky for magical and moving score that combined seamlessly with the film/story.3) Screenplay: The dialogue and plot is magnificent. The film does not fall into the common plot formulas found in other films that attempt to pass themselves off as epics. The story combines as both of celebration of life and a somber rumination of the history of mankind.There are comical moments, dramatic moments and tear-jerking moments - that all make their entry (and exit) into the story with flawless timing.4) The Acting: for all that has been said about Kevin Costner, this was the peak of his career and he played the role of John Dunbar to perfection. A relatively unknown band of actors gave magnificent, heart-felt and down-to-earth performances in support. It was actually refreshing to see an \"EPIC\" where the producers didn't feel the need to throw famous actors in with cameo roles to improve it marketability. As far as I was concerned, there were no weak links in the chain on the acting side of things. Kevin Costner certainly proved his worthiness as a director by getting the best out of the cast.5) The ONLY film in history to.... Have an extended (director's cut) version that was better than the original. Due to concerns about the length of the film, Dances with Wolves was stripped back to three hours. Some complained that it was still too long, but I thought that the film was patient - it included good relevant detail but managed to keep the story moving at a good pace. The director's cut added an hour to the cinematic release and was, without a doubt, better than the original. It somehow added more intrigue to the story and included many sobering insights into the destruction of the American Indian race.Over all, I regard it as the greatest most masterful epic of all time."
    },
    {
      "username": "PhilipJames1980",
      "userUrl": "https://www.imdb.com/user/ur1413169",
      "reviewLink": "https://www.imdb.com/review/rw0959913",
      "warningSpoilers": true,
      "date": "9 November 2004",
      "rate": "10",
      "helpful": "361 out of 410 found this helpful.",
      "title": "I love this movie!",
      "content": "It's hard for me to believe that fourteen years have passed since I first saw this movie. I was only ten at the time, and this was the first movie I ever saw that was both an eye-filling and a mind-filling spectacle. It was also one of only two theater-going experiences that I ever had with my late grandmother, and I always think of her when I watch this movie. It always takes me back to an earlier time in my life no matter how many times I see it.This is one movie that could only have been made in the post-Vietnam era, when Americans began to question the moral integrity of their country. How else to explain, in the opening sequence depicting the Civil War, the utter cynicism of the soldier who speaks with Costner's Dunbar character? Or Dunbar's later observation that \"there was no dark political objective\" to the Sioux battling the Pawnee? The scene in which Dunbar receives his orders from the mentally ill major also seems to speak of Vietnam, the point being I think that while an entire generation of young men was being cut down in the Civil War the West was being managed by those who were not fit for duty in the larger conflict. Maury Chaykin, in that one scene, gives one of the most memorable and haunting performances I've seen in any film.This movie's depiction of Native Americans is not nearly as politically correct as it may seem to those who watch it only once or only at a superficial level. In the very first scene depicting Indians, in fact, a Pawnee brave shoots one of the white characters full of arrows and then scalps him. The unrepentant villainy of Wes Studi's character, in particular, recalls the moral simplicity of countless earlier Westerns.Even the most sympathetic Indian character in the movie, Kicking Bird, is not kind to Dunbar merely to be friendly but because he believes he can get useful information out of the white soldier about the other whites who are encroaching on Sioux territory. The interaction between Dunbar and the Sioux is powerfully effective precisely because the Sioux remain true to themselves. They are not cartoonishly hostile like the Indians depicted in old Westerns, but they are not soft or naïve either. While this movie draws its inspiration from American epics as diverse as The Birth of a Nation (1915) and The Searchers (1956), its originality lies not only in its respect for Native Americans but also in its intensely personal treatment of the main character. Few other three-hour epics (Lawrence of Arabia and Braveheart come to mind ) have developed their protagonists as fully and dynamically as this movie develops Costner's Dunbar character.Even after fourteen years, the Dunbar character's arc, going from a suicidal soldier in the opening sequence to an adopted Sioux who in the final scenes puts the needs of his people ahead of his own, is still one of the most remarkable I've seen in any movie. Costner's performance won no awards that I know of, but it provides the movie's indispensably tight focus. He's completely convincing every step of the way, if a bit too clumsy and self-effacing at times, hitting his head in the dark and fainting after a confrontation in a heavy-handed attempt to demystify the West.Another quality this movie shares with The Searchers is that it associates the physical challenges of the frontier with the testing of the soul. The Dunbar character cleans out the watering hole at the fort because he refuses to lose his humanity like the men before him who abandoned the fort. Later he cannot decide whether he feel more or less at home in the presence of the Sioux, because he is struggling to remain true to himself even as he remains unsure of who he is.This movie probably disappoints viewers who are looking for sheer entertainment. It's a quiet, thoughtful story, and although there is action in it the focus is on how the action transforms the characters (particularly Dunbar) rather than on the action itself. You won't see any computer-generated comic-book characters in this movie, but you will see real people having real conversations, and you'll see Costner and costar Mary McDonnell engaging in such intimate and convincing love scenes that you'll forget they're acting!If I could rate the musical score for this movie by itself I'd give it a perfect 10, because it's one of the best I've ever heard, able to stand on its own but fitting the movie like a glove. It is sentimental without being schmaltzy, noble without being pretentious. Best of all, it captures the hesitant emotions of the story, the sense of curiosity overcoming fear and becoming trust.Only this movie's extreme length works against its total success, particularly in the special edition that runs nearly four hours. The three-hour theatrical version is still long, but it's difficult to say what should have been left out of it.Some people still resent the fact that Costner won the Best Director Oscar over Scorcese's Goodfellas. There's no question that Scorcese is the better director, but I believe the direction of Dances With Wolves is better than that of Goodfellas. If you disagree with me try this test: imagine that Scorcese did this movie, and Costner directed Goodfellas. It's a question of which directing job is better, not which director is better.Unlike most epics, this movie ends exactly as it should. The final images, such as the journal floating down the river, the white man and the Native American speaking English to each other, and the brave shouting his farewell from the top of a cliff, are so beautiful and dreamlike that they manage to be both joyful and sad. This is a movie that looks into the very fabric of this country's past, and asks us to do the same.Rating: 10 (Good job, everybody.)"
    },
    {
      "username": "reporterman2000",
      "userUrl": "https://www.imdb.com/user/ur1965958",
      "reviewLink": "https://www.imdb.com/review/rw0280157",
      "warningSpoilers": false,
      "date": "27 August 2003",
      "rate": "10",
      "helpful": "430 out of 505 found this helpful.",
      "title": "One of the great ones",
      "content": "People who say this movie is long and boring have obviously never sat through, oh, \"Lawrence of Arabia,\" \"Patton,\" \"Doctor Zhivago,\" \"The Godfather,\" \"Ran,\" \"Seven Samurai,\" or probably even \"Braveheart.\" Thank God that not every filmmaker believes that a car must explode every 10 seconds in order for his movie to be a success. Kevin Costner is one of those directors who prefers the long format. David Lean, Francis Coppola and Mel Gibson, to name a very few, also worked in that format, and produced lasting works of art that also packed theaters. There are plenty of options for people who don't like movies that take the time to build character, drama and suspense, movies like \"Charlie's Angels: Full Throttle,\" \"Freddy Vs. Jason,\" and \"Weekend at Bernie's.\" I don't think any of those movies has ever been called \"boring,\" but they sure are crap cinema.Onward. \"Dances With Wolves\" thrilled audiences way back in 1990 and made so darn much money precisely because people had forgotten the pleasures of the long narrative, the Western genre, and movies that weren't special effects schlock-fests. It remains an inspiring and moving experience, especially on DVD, which preserves the movie's theatrical sound and picture quality.Costner's direction is first-rate. He's able to blend intimate drama with big, sprawling action that covers a huge canvas. I'm amazed at how smoothly the film segues from movement to movement -- action, alienation, suspense, social commentary, romance. Heck, Spielberg could take a lesson or two from this movie.He also gets great performances out of his cast. I don't think of these people as actors, but as the characters they play. That's a compliment not just to the actors themselves, but their director. And, yes, Costner is terrific as John Dunbar.Sure, it's easy to call \"Dances\" politically correct w/ reference to the Indians. But it also treats them as people and, better yet, as fictional characters whose lives are made part of a fascinating narrative. I just consider all the complaints about the politics of this movie as total hogwash.Finally, the movie is beautifully shot, has an unforgettable score, and is very well-written. I've never thought of \"Dances\" as a Western, but a modern action picture/character study that avoids all the boring cliches of the Western genre. Here is a movie that stands for something, means something, and deserves at least as much respect as some of the overrated dreck we've gotten saddled with lately."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1356600",
      "warningSpoilers": true,
      "date": "1 May 2006",
      "rate": "9",
      "helpful": "43 out of 55 found this helpful.",
      "title": "A magnificent tribute for a culture lost over time",
      "content": "\"Dances With Wolves\" is another great period piece that I can watch at least once a year, never tiring of the western frontier against mesmerizing setting and John Barry's Oscar-winning stirring music The motion picture is told through the words and experiences of a civil war soldier, Lieutenant John Dunbar, and Costner makes it an intensely spiritual journey which challenges the individual in so many ways After his suicidal and successful ride on the battlefield, Lt. Dunbar accidentally leads Union troops to victory against the Confederates He is allowed to select his own reassignment John opts to retreat into the wilderness, to the furthest frontier, where both the Sioux and Pawnee Indians still rule The film perfectly captures the finest kind of American audacity when Costner rides out alone in the Lakota plains, wearing full dress uniform and holding the large American flag to formally introduce himself to his Sioux neighbors and the worst of America, the cruelty exercised by the army when it's found he's a Yankee soldier turned Indian and arrested as a traitor But it's the gentle humor and intimate moments of the movie which give Costner's ambitious epic Western its special flavor: scenes with Dunbar and his wild wolf Two Socks not daring, at first, to eat from his hand; his funny first encounter with a peaceful man Kicking Bird (Graham Greene); his love story with a stolen white woman living with the tribe called Stands With a Fist (Mary McDonnell); his relationship with a fierce impulsive warrior Wind in His Hair (Rodney A. Grant); and many others as Black Shawl (Tantoo Cardinal) advising her husband on affairs of the heart With its share of bow-and-arrow fights, joyous buffalo hunts, and unprecedented tender feelings for the American Indians, \"Dances With Wolves\" remains an amazing accomplishment and a magnificent tribute for a culture lost over time"
    },
    {
      "username": "The_Stuff_of_Dreams",
      "userUrl": "https://www.imdb.com/user/ur21390326",
      "reviewLink": "https://www.imdb.com/review/rw2096999",
      "warningSpoilers": false,
      "date": "16 July 2009",
      "rate": "10",
      "helpful": "35 out of 38 found this helpful.",
      "title": "Magnificent",
      "content": "Dances With Wolves is three hours long, but that is not long enough, it is so wonderful. It is set in the Civil War-era prairie, and it captures the encounter between a white man and a Sioux tribe. However, it is timeless. It is romantic, adventurous, active, comical, tragic, and educational. It demonstrates the color of one race and the cruelty of another. It forces us to view our own culture with a different eye. It features redemption, nay, salvation. The camera captures the prairie beautifully, the bluest of blue skies and the whitest and puffiest of white clouds, the most colorful of colorful ground, the roundest of rolling hills, and the largest of buffalo herds. This movie was a risky project. The story and the symbolism is simple, but it was filmed and performed masterfully. It deserved the seven Academy Awards it received and then some. A must-see masterpiece. Ten out of ten does no justice. See for yourself."
    },
    {
      "username": "TheUnknown837-1",
      "userUrl": "https://www.imdb.com/user/ur6321000",
      "reviewLink": "https://www.imdb.com/review/rw1341867",
      "warningSpoilers": false,
      "date": "15 April 2006",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Incredibly powerful...and just think, this was Kevin Costner's first ever job as a director",
      "content": "And he deserved those two Oscars he won for what he did on this movie. \"Dances With Wolves\" is definitely a classic epic motion picture, one that should not ever be remade or redone in any way. Because nothing and nobody will ever be able to do what Kevin Costner and his team did on this movie. It won seven Academy Awards and countless other ones, and it deserved every single one of those and much more.One of the main reasons why I loved \"Dances With Wolves\" is not just because it's a great movie, but because it's a very realistic movie. For the first time in a long time--or probably ever--we are shown what Native Americans were really like. Throughout history, Native Americans have been shown as barbaric savages with no intents but to murder and kill. But this movie shows that they were nothing at all like that, and it is correct. Native Americans were people, just like us. They only killed when they deemed it necessary: self-defense, protection of their land, beliefs, and so on. And it shows that just like us, they can hate, love, laugh, and cry. This movie also shows that Native American societies had both good and bad in them, no different than us.\"Dances With Wolves\" is over three hours long, especially in the extended addition, but like many other classics, if you have a good sense of what a good movie is, you won't even bother with the time. Because this movie is so epic and powerful and realistic, it's incredile. And it's remarkable what Kevin Costner did, seeing as how he had NEVER done a director's job until he made this movie. And he also played a very convincing lead role.Overall, this epic Western is a classic movie. And it should never be remade, because it was made in the right times and by the right man, so every aspect of it is perfect."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2252863",
      "warningSpoilers": true,
      "date": "21 May 2010",
      "rate": "",
      "helpful": "19 out of 25 found this helpful.",
      "title": "\"Avatar\": making \"Dances With Wolves\" look good since 2009",
      "content": "\"Avatar\" vs \"Dances With Wolves\". Round One. Fight! 1. Sam Worthington and Kevin Costner both play soldiers. Worthington comes across as a brain dead jar-head, whilst Costner's character is a bit more complex, at once naive, disillusioned, smart and funny. One point to Costner.2. Both films utilise extensive voice over narration. Costner's is better written. One more point to Costner.3. Cameron was an experienced director when he made \"Avatar\" and should have known better. Costner, in contrast, was young, inexperienced and on debut. One point to Costner for being a directorial virgin.4. \"Avatar\" was a zillion dollar enterprise. Costner partially financed this movie himself and based it on a script by a broke guy who slept in his house. One point to Costner's film for having a low carbon footprint.5. Both films have heroes who abandon a technologically superior race and \"go native\" by joining an alien tribe. In \"Wolves\", the tribe is slow to embrace the white hero. In \"Avatar\", Cameron cheats by making his hero \"prophecised by the planet\"; they have to embrace him. One point to Costner for not trying to rip off George Lucas' \"Force\".6. \"Avatar\" looks like a video game. One point to \"Wolves\" for not looking like \"Avatar\"7. \"Wolves\", though stupid, is filled with nuance, subtle details and quiet moments. \"Avatar\" bashes our heads with everything. One point to Costner for not damaging our heads.8. \"Avatar\" has horses with six legs whilst \"Wolves\" has horses with 4 legs. One point to Costner for not making stupid crap up.9. Costner's film emphasises the communication barriers between the natives and the hero, albeit clunkily. In \"Avatar\", communication issues are quickly brushed aside. One point to \"Wolves\".10. Cameron's film doesn't show much of the customs or daily activities of the natives. One point to Costner.11. Costner is embraced by the tribe after taming a wolf, rescuing a woman and hunting buffalo. Worthington is embraced by the tribe after riding a dragon. Dragon's are stupid. One more point to Costner.12. Colonialists are portrayed as one-dimensional villains in both films. In Costner's film, however, these villains only appear during a brief climax. One point to Costner for serving less crap.13. Both films portray the natives in a romantic, \"noble savage\" fashion. In \"Wolves\", however, the tribe is shown at war with rival tribes and massacres a white homestead. This does not quite counteract the sentimental portrayal of the natives throughout the rest of Costner's picture, but on the flip side, \"Wolves\" has the arduous task of revising 80 years of racist cinematic portrayals of Native Americans. \"Avatar\", in comparison is...well it's just stupid. One more point to Costner.14. The natives in \"Wolves\" belong to the Sioux tribe. The natives in \"Avatar\" are at once Native Indians, Rastafarians, Africans, hippies, Smurfs, cats, aliens, Disney creatures and Egyptians. One point to Costner for offending less races.15. The characters in Costner's film have cool symbolic names like \"Stands with Fist\". In \"Avatar\", we have symbolic names like Navi (naive), Selfridge (selfish), Grace Augustine (possesses grace like St Augustine?), Pandora (trouble when opened) and Sully (he's tainted). One point to Costner for not being Cameron.16. Cameron's film has unimaginative action scenes. \"Wolves\" has no real action scenes. It's more of a tone poem, and aesthetically thwarts genre expectations. One more point to Costner.17. The first five decades of cinema portrayed native American Indians in an incredibly racist fashion. \"Broken Arrow\" was the first film to rectify this, before revisionist westerns began to appear in the 1970s, with masterpieces like Altman's \"Buffalo Bill\", \"Ulzana's Raid\", \"Hombre\" and marginally interesting films like \"A Man Called Horse\", \"Soldier Blue\" and \"Cheyenne Autumn\". When \"Wolves\" was released, films about Native Americans became increasingly melancholic, mourning the loss of a race which history had now accepted as being \"ethnically cleansed\". Is Costner's film more melancholic than \"Avatar\"? Yes. One point to Costner.18. Both films have been praised for their cinematography. Costner's compositions are simple and lack any significant depth, purpose or weight, but he should be commended for the poetic and ethereal style of the film. It's Malick-lite, but it's brave. \"Avatar\" looks like fluorescent vomit. One point to Costner.19. Bizarrely, both films have the white hero having sex with a native girl, as though this transfer of bodily fluids unifies races and symbolically brings rival cultures together. Insultingly, the native is deemed inhuman unless accepted as a white man's object of desire. Half a point to Costner.20. When \"Wolves\" was released it was fresh and relatively original. \"Avatar\" is one cliché after the next. One point to Costner for not being an unimaginative plagiarist.21. \"Avatar\" was bashed for the \"white saviour\" cliché. This cliché, or fantasy, involves white heroes \"saving\" a \"victimized tribe\" by becoming a top dog within the tribe, the white man always retaining his dominant position. In \"Wolves\", Costner remains inept throughout, is rescued by the natives and ABANDONS the natives when the white man attacks. In the \"director's cut\" we even become aware that he never understands Sioux traditions and will never be able to assimilate. One point to \"Wolves\" for being intellectually defensible.22. \"Avatar\" ends with the white man attacking the natives. \"Wolves\" has no crowd pleasing action scenes and instead hints at the slaughter of the natives with a simple shot of a Spanish helmet. One point to Costner for poetry.8/10 – \"Wolves\" wins. The 4 hour cut in particular is a great film which avoids the sentimental pro-Sioux feel of the 3 hour cut. See too \"Ulzana's Raid\", \"Hombre\" and Altman's \"Sitting Bull\"."
    },
    {
      "username": "philip_vanderveken",
      "userUrl": "https://www.imdb.com/user/ur3922673",
      "reviewLink": "https://www.imdb.com/review/rw1012349",
      "warningSpoilers": true,
      "date": "2 February 2005",
      "rate": "8",
      "helpful": "27 out of 36 found this helpful.",
      "title": "A not-so-average Western that still does the trick after so many years",
      "content": "\"Dances with Wolves\" is hated by quite a lot of people. Is it perhaps because the Indians aren't depicted as the bad guys for once or is it because this isn't the usual Western in which you'll not find a justification for the slaughtering of the Indians? Is it because it is very long or is it because Kevin Costner is in it? I don't know, but I do know it is very cool to dislike everything he has done, but I'm not following the masses. I can still think for myself and I must say that, even though the man has done some bad projects (for instance \"Waterworld\"), this movie is absolutely one of his best.The movie starts with showing us a wounded Lieutenant John Dunbarr (Kevin Costner) who is about to have his leg amputated. Because he wants to keep it, he decides to flee and go back to his troops. Than he does something stupid. He takes a horse and starts running in front of the rebel front line, but doesn't get hit once. His troops, overwhelmed by so much 'bravery' all jump up and start fighting again and eventually win the battle. Because a general has seen what happened, Dunbarr gets the honor of having his wounds being treated by the general's surgeon, who saves his leg. Now that he feels better again, he asks to be send to a remote outpost in the West. Arriving there, he finds himself in the middle of the wilderness, all alone and surrounded by hostile Sioux. His only companion is his horse and an old wolf that he calls Two-socks. Gradually he gets accepted by the tribe, where he is known as \"Dances with Wolves\" and falls in love with \"Stands With a Fist\", a white woman who had been adopted as a young girl and was raised by the tribe. But while he is living with the Indians, the West is very fast being conquered and one day he finds new troops in his camp and even though he is an American soldier, he is seen as a traitor.I've always had a weak spot for the not-so-average Western, so when this movie first came out I was already a fan. Now, so many years after it was first shown, this is still one of the best Westerns ever. I like the fact that it shows the Indians not as savages, but as normal, loving people who only defended what was rightfully theirs. I like the fact that the movie isn't sugar sweet, but shows every detail very realistically. I even like the fact that the soldiers are seen as the bad guys for once. Add to this some very good acting and directing and an interesting story and you know you've got something special. This is a very good movie that should be seen by everybody. I give it an 8/10."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1858568",
      "warningSpoilers": false,
      "date": "16 April 2008",
      "rate": "9",
      "helpful": "18 out of 25 found this helpful.",
      "title": "Exceptionally gorgeous and touching",
      "content": "This is an amazing film--particularly from an artistic point of view as well as the film's ability to convey emotion. When I saw this film in the theater, I felt totally drained and very sad, so it's obvious that Kevin Costner did a great job in directing this film. It was just wonderful.Now this isn't to say that the film is perfect. While great, in many ways the film makes the same mistake old-time Westerns used to make--they present characters in simple and black/white terms. In the old days, Indians were seen as savage, stupid and brutal--and for the most part, that's exactly how the Whites are portrayed in the film. Plus, the Sioux are practically perfect in every way. It's nice to see the deficiencies of older films are being counter-balanced--but it isn't very accurate either. In fact, twenty years earlier, I think LITTLE BIG MAN did a better job in showing the natives in a more realistic manner. The characters weren't quite as one-dimensional in this earlier film.Now despite this handicap, DANCES WITH WOLVES is still a marvelous film and deserved Oscar recognition--and not for reasons of political correctness. A combination of great evocative music, breathtaking cinematography and excellent acting made this one of the great films of the 1990s. However, from a purely historical point of view, it isn't the best history lesson--though it is a darn bit closer to the truth than you'd see in most other films of the genre."
    },
    {
      "username": "nebukanezer",
      "userUrl": "https://www.imdb.com/user/ur22933763",
      "reviewLink": "https://www.imdb.com/review/rw2368127",
      "warningSpoilers": false,
      "date": "12 January 2011",
      "rate": "10",
      "helpful": "88 out of 107 found this helpful.",
      "title": "Way better than Avatar",
      "content": "I just can't for the life of me understand why this movie is rated below Avatar...After having seen this movie again for the first time in years, and after having seen Avatar, it is my opinion that Dances with Wolves is in an entirely different league in terms of story telling. The main ingredients of the story between these two movies is fairly similar - however, the pace and finesse with which Dances with Wolves portrays the development of the relationship between John and the Indians is masterfully done. While Avatar has huge flaws in its story-telling including some scenes with very weak dialogue - it might have gotten away with it as the audience is perhaps distracted by the bombardment of impressive CGI effects!If you thought Avatar was good and haven't seen Dances with Wolves in a while - I highly recommend it. An excellent move that I think deserves a much better review score - and also should definitely be on IMDBs top 250 list."
    },
    {
      "username": "FreedByFiction",
      "userUrl": "https://www.imdb.com/user/ur2369479",
      "reviewLink": "https://www.imdb.com/review/rw0280039",
      "warningSpoilers": false,
      "date": "15 June 2003",
      "rate": "10",
      "helpful": "47 out of 56 found this helpful.",
      "title": "The most beautiful movie ever made. And it is from Kevin Costner...........",
      "content": "I can honestly say I have seen the face of beauty on screen, and it is in the form of the European version of \"Dances with Wolves\", an ethereal work of art that entrances, touches, inspires, and holds you in its grasp of angelic magnificence. If there is an afterlife for films, this would go straight to the pearly gates. Kevin Costner and his creative team are saints of modern film-making. Against all odds, they created a challenging, beautiful movie about a dark period in American history. And the movie, with its statements apparent, never shifts left or right, for which we are all truly thankful. It is a story, plain and simple. They would never make a movie this slow today. They'd never make a movie with this kind of character and story development today, either. The only thing that comes any where near close is the \"Lord of the Rings\" films. This is the best period movie, history movie, and Western all rolled into one. Make no mistake about it, the best film of the nineties is not just a flick, it will restore your faith in films for a long time. Unfortunately, after seeing \"Waterworld\", it won't restore your faith in Kevin Costner. It would take another \"Dances With Wolves\" to do that, and since \"Dances With Wolves\" is a perfect film, that would be impossible. 10/10"
    },
    {
      "username": "Craig-95",
      "userUrl": "https://www.imdb.com/user/ur0455602",
      "reviewLink": "https://www.imdb.com/review/rw0280122",
      "warningSpoilers": false,
      "date": "8 August 2002",
      "rate": "",
      "helpful": "289 out of 338 found this helpful.",
      "title": "A story of a lost way of life.",
      "content": "`Dances With Wolves'When I first saw the movie Dances With Wolves several years ago the story affected me in a heavy way, so much so that I decided that it would be a long time before I watched it again. The story is not entertainment. It is a lesson. Last week I watched the movie again with a new understanding. Many of the published reviews seem to dislike the movie for various reasons. They are the ones that missed the point of the story.The story is, of course, fiction based on a novel by Michael Blake. Fortunately, Michael Blake also wrote the screenplay for the movie insuring fidelity with his vision. To the credit of Kevin Costner, who was one of the producers and the director, he allowed the story to be what Michael Blake had originally created. Costner showed great sensitivity in not only capturing the personalities of all the major characters, but making the land itself (in this case South Dakota) one of the major players. The land was not just a backdrop or playing field. It was the main character and very much alive. The cinematography was some of the best I've ever seen and in the tradition of the great movie director, John Ford. Ford had an ability to present the land in all its beauty, which also just happened to have a story occurring on it.In Dances With Wolves, the land of South Dakota might initially appear to be a bleak place, but as Lieutenant Dunbar (Costner) spends more time at his isolated fort, he somehow slowly merges his soul with the surrounding territory. The life on the land eventually stumbles onto his location, including a wolf and a tribe of Sioux. The Sioux and Dunbar mistrust each other initially but through curiosity learn how to communicate with each other, however painfully slow. The wolf too was curious about the soldier, but kept his distance for a while. Finally, the wolf trusts Dunbar enough to play with him on the prairie. The Sioux see them playing. Here was a white man not killing the animals. He had earned a new name: Dances-With-Wolves.The main difference between this movie and a John Ford movie was the way Costner humanized the Sioux characters. In a John Ford movie, most Indians were the enemy. The only 'good' Indians were the cavalry scouts, but we never really met these scouts as people. John Ford hired Navaho people to play the parts of Indians in his cavalry trilogy, Fort Apache, She Wore a Yellow Ribbon and Rio Grande, which were filmed in Monument Valley on the Navaho Reservation. Years later, Ford attempted to humanize the Native Americans in a movie called Cheyenne Autumn, but by then Ford was an old man and had lost most of his creative genius. It is a hard movie for me to watch.Costner's movie takes great pains to allow us to know the Sioux characters. The story is about them as seen through the eyes of a perceptive white man, who had been given a new life by the gods when his attempt at suicide ended with his recognition as a war hero.What I see when I watch the movie: I see ten thousand years of evolution and experience of a human tribe on the North American continent with the most recent characters at the leading edge of the current (1860) time. The character's lives are so well presented that I sense the history of their past In other words, I understand why they do what they do. What depresses me about the movie is that I know the ending but the characters don't. I know that their natural way of life is coming to an end. The characters don't know. To me, the movie is a story of the 4 billion, six hundred million years of natural evolution which is about to meet technology. Technology will be as devastating to this tribe and the land as if an asteroid had hit the earth.The beauty of the Sioux life is so precisely shown in this movie. Their everyday routine of just living off the land is seen the same way as a buffalo eating the grass. The Sioux adapted to the land the way it was. You see the grass move in waves like the ocean does when the invisible winds touch the surfaces. You see the effects of the same winds that blow across the face and hair of Stands-With-a-Fist. You hear the same winds. The same winds take the smoke from the lodges away from the village. The land and air and life merge in a poetic movement.The horses seem more natural and free in their herd next to the village. They are part of the tribe. You can see the magnificence of the Sioux riders as they become one with the horse as they hunt the buffalo. I suppose, in a way, the horse was a step in technology for the Sioux since they didn't have the horse until the Spanish Conquistadors brought them. But when they adapted their life to the horse, they became a great people. I look at it as a step in evolution, not a step in technology.We find that the holy man, Kicking-Bird, played by Graham Green, was a hen-pecked husband, something we can all identify with no matter what race or ethnic group. His wife saw more than he did, especially the budding love between Lieutenant Dunbar and Stands-With-a-Fist, who was played by the heavy-duty stage actress Mary McDonnell. She is important to our story because we understand the Sioux from her translations. As an actress, she was so convincing in her struggle to remember long forgotten English words from her childhood, from the time before she came to live with the Sioux. Kicking-Bird on the other hand represented the soul of the Sioux People. He was patient and was the type of person you would want as a friend.We have Rodney Grant playing the part of Wind-in-His-Hair, the warrior who was quick to anger but was smart enough to listen to his elders and not kill the white soldier. Rodney Grant represented the beauty and pride of the Sioux People. He speaks the last relevant words in the story by proclaiming that he is the friend of Dances-With-Wolves. Before Dunbar became Dances-With-Wolves, Wind-in-His-Hair would have been happy to kill him.`Red Crow' Westerman played the part of the chief, Ten-Bears. We've seen him play the part of a shaman in other movies. He represented the wisdom and of the Sioux People and was also their prophet.What movie about Native Americans could be told without Wes Studi? In this movie he plays the enemy Pawnee so convincingly that you really hate him. Not only is he the enemy to the white man but the Sioux also. Wes Studi can be very intense in his savagery, but in the eyes of the Pawnee, he was only protecting his tribal interests.So we see the Sioux and, to a lessor degree, the Pawnee in their soon-to-end natural states. We immediately feel at home with the Sioux. The Pawnee aren't quite as lovable, especially when we see Wes Studi scalping the muleskinner. The first disturbing scene is when the Pawnee attack the Sioux village and we see that to save themselves, the Sioux need the technology (the rifles) of the white soldier. The Pawnee were so fierce looking (again convincingly by Wes Studi) that we fear for the Sioux tribe but see that the rifles are out of place in this natural world. It is another technological step in the same magnitude as the horse. But for all their beauty and greatness, we know they cannot win the final battles with the white civilization because they are so grossly outnumbered. There is the core of the problem. The over-population of the modern civilization overruns their own land so they come to the land of the Sioux and destroy without asking. You could see it in the face of every tribal member as they walked past dead and skinned buffalo which were left to rot in the sun after the buffalo hunters had skinned them for their hides. They were absolutely stunned and sick at the sight. Whoever did this had no soul. I extend the message of this movie to today and see population running amuck, stripping the land of resources and changing the atmosphere. It is too painful to contemplate.To emphasize the loss and waste of the beautiful prairie life, near the end of the movie we see the soldiers shooting at the wolf for fun. The wolf is confused and doesn't understand that bullets are hitting near him. Eventually a bullet strikes the wolf and we hear him cry out. For me that was the most painful scene of all because I know that's what people do. I see people kill a beast for the trophy. They take it home and hang it on the wall. The soul of that animal has been cast aside by a human, which has no soul.The beauty is not in the trophy. The beauty is in the life. The ending for the wolf represents the ending for the Sioux and all the other tribes that lost the natural way of life. Therefore I am just as disturbed for the Sioux as I am about the wolf. I am disturbed for the future of the Earth."
    },
    {
      "username": "Chewbaccy",
      "userUrl": "https://www.imdb.com/user/ur1377045",
      "reviewLink": "https://www.imdb.com/review/rw0280156",
      "warningSpoilers": false,
      "date": "26 August 2003",
      "rate": "10",
      "helpful": "135 out of 174 found this helpful.",
      "title": "magnificent",
      "content": "I like to watch lots of films, pretty much any film in fact, therefore I can tell you i have seen a fair few duds. I have also seen some spectacularly brilliant films. Dances With Wolves is one of them. For me to have the patience to watch a film more than a couple of times then the film needs to make me want to watch it over and over. Let me tell you I have seen this film more than a few times. I think you know when a film is special to you when you watch it and you keep thinking to yourself \"oh this scene coming up is great\", if you can say that continually whilst watching a film then you know you are watching a great film.As for the film itself, cinematography has never been bettered, Costners acting is OK but it his presence rather than his acting that has brought gravitas to his movies, you certainly cant argue with his directing, which along with Orson Wells, Tarantino and a few select others must rank alongside as one of the best directorial debuts. The supporting cast is excellent especially Graeme Greene who is the wonderful Kicking Bird and of course Rodney A Grant.I shamefully dont know too much about the history of the Indian population in America, so I dont know whether the events or portrayals in the film are accurate, however artistic license is surely allowed when making what is first and foremost a piece of entertainment. Being British I have seen many an American film with British stereotypes, not once have I been offended or appalled, as I see them as interpretations, God knows British filmmakers are just as guilty of such generalisations when it comes to \"foreign\" characters.Marvel at the wonderful film-making in this film not political inaccuracies after all this is a story, and a damn fine one at that, remember King Kong didnt really climb up the Empire State Building and you dont here gorillas complaining about being misrepresented. This is a point of view expressed in a great film.Personally films dont get much better than this."
    },
    {
      "username": "Metacognizant",
      "userUrl": "https://www.imdb.com/user/ur39306660",
      "reviewLink": "https://www.imdb.com/review/rw2756517",
      "warningSpoilers": false,
      "date": "19 February 2013",
      "rate": "10",
      "helpful": "27 out of 32 found this helpful.",
      "title": "It may drive home the meaning of being human more than any other film I've ever seen",
      "content": "The best Western I've ever seen. One of its greatest strengths is its even handed portrayal of both sides of what was a gruesome bigotry ridden fight for land, opportunity, and way of life, between two very different cultures in the late 1800's. The Civil Wars' leftovers were a maliciously violent and frighteningly ignorant bunch, pit them against a culture of genuinely primitive & savage people (scalping & yelping pridefully about it – wow) and you have a perfect breeding ground for intolerance, impetuous violence, and never ending retaliatory fighting. \"Dances with Wolves\" provides a context for understanding both sides' humanity (for better and for worse) concerning this scar on our nation's history. Said understanding is permitted through an engaging story told on a stunning backdrop of our disappearing plains and enriched with beautifully moving music. In 2007, \"Dances with Wolves\" was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" It may drive home the meaning of being human more than any other film I've ever seen. It won 7 Academy Awards, including Best Picture 1990; I'm not at all surprised and support the Library of Congress' decision."
    },
    {
      "username": "walsh-22",
      "userUrl": "https://www.imdb.com/user/ur14062232",
      "reviewLink": "https://www.imdb.com/review/rw1683082",
      "warningSpoilers": true,
      "date": "29 June 2007",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Beautiful",
      "content": "I have always been fascinated about Native Americans especially their customs and believes. I didn't like some of the films that portrayed them all as savages because like any society, there are good and bad people in them.Finally with Dances with Wolves, we have a balanced story where we are shown that the Indians are not savages, they are just trying to live on their land, the white men are the invaders but that was never shown before. This film shows what the Indians were like before the white men flooded their land, ordering them off it and moving them where they could keep an eye on them. The Indians see Lt. Dunbar (Kevin Costner)and wonder what this means, as he is the first white man they have seen in a while and know that his arrival will have consequences for their people and we know that it did for them and the film comments on this, at the end. I have to say, watching this movie and thinking what happened in real life, I felt anger on their behalf. What right did these white people have for invading their land, arrogantly deciding they knew what was best for these proud people and dictating to them about the beliefs they should have, the clothes they should wear and how they should behave. It was a terrible injustice and it was about time someone showed the other side to the Indians.The film is just so beautiful. The locations are stunning, the music fits with the action, the characters you couldn't help warming to, accept those nasty army men who I was glad was killed as if anyone deserved to die, it was them and makes a change because in the 50's and onwards, the audience would be cheering them on and not the Indians but the positions are reversed in this film and we are cheering the Indians on. The film is funny in parts but still manages to convey a serious message about the mistreatment of the Native Americans in the past. There are some amazing scenes. One at the start of the movie where Dunbar overhears doctors saying they will have to cut his foot off and he escapes and later decides he doesn't want to live without his foot so rides into enemy fire to be killed and at one stage let's go off the reins and raises his hands as if to say he is ready to die. Another incredible scene was when the Indians were hunting buffalo, the sequence was so huge, the action seemed to take over the scene on what seemed a never ending canvas.People have moaned about the length of the film but I think it is just right. Every scene Costner has added to the film is justified and the movie is never boring, it keeps the audience focused on the screen.I loved the romance between Dunbar and Stands with a fist (Mary McDonnell). The chemistry between them sizzles and yet there is such tenderness.I also like Dunbar's relationships with Kicking Bird (Graham Greene), Wind in his hair (Rodney A. Grant) and Ten Bears (Floyd 'Red Crow' Westerman.' This is a very emotional film that had me in tears at times especially when Cisco the horse and Two Socks the wolf are killed. I got so caught up in the film that I was screaming at the screen and that is the power of the film where it sucks you so completely into the story. Cisco and Two Socks are just as much characters as the humans in the film and you have watched them throughout the film and are devastated when they are killed in the way they are. I laughed my head off when Cisko kept escaping the Indians and going back to Dunbar. And Two Socks who learns to trust Dunbar by the end and even takes food from his hand.I think what is also so unique about the movie is that the characters speak Lakota and it is so interesting listening to a different language other then English all the time.Well done, Kevin and the rest of the cast and crew for making such a moving film."
    },
    {
      "username": "mrbluto",
      "userUrl": "https://www.imdb.com/user/ur0671675",
      "reviewLink": "https://www.imdb.com/review/rw0280151",
      "warningSpoilers": false,
      "date": "2 July 2003",
      "rate": "9",
      "helpful": "144 out of 222 found this helpful.",
      "title": "One of the 15 best Movies of all Time",
      "content": "Dances with Wolves is a great movie, make no mistake about that, Kevin Costner had lighting in a bottle. Costner has not come close to movie success since wolves. The cast is excellent, Kicking Bird, Stands with Fist, Wind in his Hair and my quiet favorite smiles a lot, smiles a Lot had trouble with growing up and becoming a brave, until it is forced on him, his mood after he has killed the first time is priceless. Some people say Dances with Wolves was an anti white movie, that is total bull, it tells the true story the way few movies have of the cruelty of the white people. People don't want to admit this movie is a true telling of the way white people treat other races and nature. It is a hard movie to digest.It is a hard movie to admit the truth. The other thought is a lot of movie fans want car chases and explosions. If a movie is thoughtful, it is labeled boring. Dances is one of the top 15 movies of all time. 9 out of 10 stars. Dances with wolves I am wind in his hair Do you see that I am your friend? Can you see that you will always be my friend?"
    },
    {
      "username": "wordsmith100",
      "userUrl": "https://www.imdb.com/user/ur11028498",
      "reviewLink": "https://www.imdb.com/review/rw1393839",
      "warningSpoilers": false,
      "date": "14 June 2006",
      "rate": "10",
      "helpful": "41 out of 46 found this helpful.",
      "title": "A Moving and Superbly Made Movie",
      "content": "Like most of the commentators here, I found \"Dances With Wolves\" to be a moving and superbly made movie. Others have eloquently talked about the wonderful music and score, the very real script, and excellent acting, so there is no need for me to elaborate. But another element of the movie that I found even more notable is its depiction of Native Americans as individuals with feelings, honorable if at the same time frequently peculiar customs, and as human beings with human urges and impulses. What a refreshing contrast to all of the pablum and nonsense that has been the staple of Hollywood and its treatment of \"injuns\" over the years.So it comes as no surprise that some of the criticisms here come from people who believe the movie is anti-white or anti-army or glorifies Native Americans. But I believe these comments completely miss the mark. First off, Costner in the movie himself portrays an army figure--the movie is trying to show that not all people in the army are beasts. This is again brought out by the young leader of the troops attempting to arrest Costner and bring him back to trial; this soldier is depicted as a fair and honest young man put in a difficult spot.Perhaps one of the reasons for the shortsightedness of some of the movie critics is their lack of understanding of the terrible plight faced by native Americans and the awful, holocaust-like consequences of the policy that was known as \"Indian Removal.\" And yes, I am a professor who knows something about the subject and who uses this film in class (and I am not afraid to admit it). Please have a look at \"As Long as Grass Grows or Water Runs\" a chapter in Howard Zinn's famous book, \"A People's History of the United States.\" It uses many primary sources to describe exactly what happened; the phrase, by the way, was a promise made by Andrew Jackson (later President Jackson) to Cherokee Indians if they would relocate (a promise later broken, of course). Jackson, by the way, refused to enforce a court order from the Supreme Court in the case of Worcester v. Georgia involving an individual sentenced to prison for questioning the legitimacy of laws repressing the Cherokees. Jackson also fought the Creeks killing hundreds of them and later boasted, \"the truth is, the (Creeks) did not respect the power of the United States...We bleed our enemies in such cases to give them their senses.\" From 1814 to 1824, Jackson was instrumental in fashioning a series of treaties that deprived Indians of over 3/4 of Alabama and Florida, one-third of Tennessee, one-fifth of Georgia and Mississippi, and parts of Kentucky and North Carolina. These treaties were little more than land grabs and Jackson is widely known to have practiced extensive bribery and other dirty tricks in securing them. At the same time, Jackson and his friends and relatives received many patronage appointments as land agents, traders etc (I guess he would have gotten along well with Dick Chenney and Bush) and of course, he and his friends bought up much of this land that became suddenly available.Another good source for what happened to the Indians is the eyewitness account of a soldier who served in the mounted infantry. John G. Burnett in 1890 published his reminiscences, \"The Cherokee Removal through the Eyes of a Private Soldier\". \"I was sent as interpreter into the Smoky Mountain Country in May, 1838, and witnessed the execution of the most brutal order in the History of American Warfare. I saw the helpless Cherokees arrested and dragged from their homes, and driven at the bayonet point into the stockades. And in the chill of a drizzling rain on an October morning, I saw them loaded like cattle or sheep into 645 wagons and started toward the West.\" This evokes images not unlike those showing S.S. officers putting Jews in railroad cars. \"At this time, 1890,\" continues Burnett, \"we are too near the removal of the Cherokees for our young people to fully understand the enormity of the crime that was committed against a helpless race. Truth is, the facts are being concealed from the young people of today.\" Burnett later describes the \"streams of blood that flowed in the Indian country in the summer of 1838\" and the \"4000 silent graves that mark the trail of the Cherokees to their exile\", again very much like a World War II death march. So what I find shocking about \"Dances With Wolves\" is that it shows, to a great extent, the brutality of the conflict between \"settlers\" from one civilization, and the people who already lived on the land. This stands as a testament to Costner and his willingness to take this brave position. It is precisely because this subject has become taboo and because most Americans haven't a clue as to their own history, because their image of America is similar to Pleasantville (before colorization), that many people find this movie revolting and unacceptable. Hence, they prefer to shoot the messenger of the \"bad\" news-- Costner.Finally, as others have pointed out, the movie does not glorify all Native Americans. It shows that there is a spectrum of behavior amongst them, and also shows that many of their customs (eating fresh meat from just-killed animals, for example) are shocking and barbaric to us today."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2388188",
      "warningSpoilers": false,
      "date": "20 February 2011",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "A marvel from beginning to end",
      "content": "Along with Edward Scissorhands and Goodfellas, Dances with Wolves is one of my favourites of 1990. It is a wonderful film, and a marvel from beginning to end. I am not a Kevin Costner basher, he has done some work I don't care for, but this and a few others(Field of Dreams for instance) actually does show he has talent. He does do a heartfelt job directing, and his acting isn't too shabby either, in fact he gives a certain decency to Dunbar which I had difficulty not empathising with. He is very well supported by Graheme Greene and Mary McDonell who is especially brilliant. The cinematography and scenery are just magnificent, while John Barry's score is nothing short of amazing. The moving climax gives further emotional weight to an already poignant story, while the script is wholly credible and the characters feel real. In conclusion, a fine film and I had no problem with its Best Picture win. 10/10 Bethany Cox"
    },
    {
      "username": "sampsonart",
      "userUrl": "https://www.imdb.com/user/ur98437184",
      "reviewLink": "https://www.imdb.com/review/rw4798465",
      "warningSpoilers": false,
      "date": "23 April 2019",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Incredible! Jaw dropping",
      "content": "One of the best ever made movies do exist. I can't say anything other than \"WOW\""
    },
    {
      "username": "Andu007",
      "userUrl": "https://www.imdb.com/user/ur116282836",
      "reviewLink": "https://www.imdb.com/review/rw7134953",
      "warningSpoilers": false,
      "date": "17 July 2021",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "A beautiful film",
      "content": "I've watched this film a few times now over the 30 odd years since its release, mostly when it's been on tv & think I'll just watch a bit, then just a bit more then before you know it I'm totally engrossed & I've escaped for 3hrs totally immersed in the brilliant cinematography, big soundtrack, direction, character building & story telling.This is a beautiful film, don't be put off by the duration, some films are not meant to be rushed & believe me you won't look at the time because you won't want it to finish.A great story, about mankind & the way it has evolved on this spinning planet of ours."
    }
  ],
  "errorMessage": ""
}