{
  "imDbId": "tt0099348",
  "title": "Dances with Wolves",
  "fullTitle": "Dances with Wolves (1990)",
  "type": "Movie",
  "year": "1990",
  "language": "en",
  "titleInLanguage": "Dances with Wolves",
  "url": "https://en.wikipedia.org/wiki/Dances_with_Wolves",
  "plotShort": {
    "plainText": "Dances with Wolves is a 1990 American epic western film starring, directed, and produced by Kevin Costner in his feature directorial debut. It is a film adaptation of the 1988 novel Dances with Wolves by Michael Blake that tells the story of Union Army Lieutenant John J. Dunbar (Costner), who travels to the American frontier to find a military post, and who meets a group of Lakota.\r\nCostner developed the film with an initial budget of $15 million. Much of the dialogue is spoken in Lakota with English subtitles. It was shot from July to November 1989 in South Dakota and Wyoming, and translated by Doris Leader Charge, of the Lakota Studies department at Sinte Gleska University.\r\nThe film earned favorable reviews from critics and audiences, who praised Costner's directing, the performances, screenplay, score, cinematography, and production values. It was a box office hit, grossing $424.2 million worldwide, making it the fourth-highest-grossing film of 1990, and is the highest-grossing film for Orion Pictures. The film was nominated for 12 Academy Awards at the 63rd Academy Awards and won seven, including Best Picture, Best Director for Costner, Best Adapted Screenplay, Best Film Editing, Best Cinematography, Best Original Score, and Best Sound Mixing. The film also won the Golden Globe Award for Best Motion Picture – Drama. It is one of only three Westerns to win the Oscar for Best Picture, the other two being Cimarron (1931) and Unforgiven (1992).\r\nIt is credited as a leading influence for the revitalization of the Western genre of filmmaking in Hollywood. In 2007, Dances with Wolves was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>Dances with Wolves is a 1990 American epic western film starring, directed, and produced by Kevin Costner in his feature directorial debut. It is a film adaptation of the 1988 novel Dances with Wolves by Michael Blake that tells the story of Union Army Lieutenant John J. Dunbar (Costner), who travels to the American frontier to find a military post, and who meets a group of Lakota.</p><p>Costner developed the film with an initial budget of $15 million. Much of the dialogue is spoken in Lakota with English subtitles. It was shot from July to November 1989 in South Dakota and Wyoming, and translated by Doris Leader Charge, of the Lakota Studies department at Sinte Gleska University.</p><p>The film earned favorable reviews from critics and audiences, who praised Costner's directing, the performances, screenplay, score, cinematography, and production values. It was a box office hit, grossing $424.2 million worldwide, making it the fourth-highest-grossing film of 1990, and is the highest-grossing film for Orion Pictures. The film was nominated for 12 Academy Awards at the 63rd Academy Awards and won seven, including Best Picture, Best Director for Costner, Best Adapted Screenplay, Best Film Editing, Best Cinematography, Best Original Score, and Best Sound Mixing. The film also won the Golden Globe Award for Best Motion Picture – Drama. It is one of only three Westerns to win the Oscar for Best Picture, the other two being Cimarron (1931) and Unforgiven (1992).</p><p>It is credited as a leading influence for the revitalization of the Western genre of filmmaking in Hollywood. In 2007, Dances with Wolves was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "Dances with Wolves is a 1990 American epic western film starring, directed, and produced by Kevin Costner in his feature directorial debut. It is a film adaptation of the 1988 novel Dances with Wolves by Michael Blake that tells the story of Union Army Lieutenant John J. Dunbar (Costner), who travels to the American frontier to find a military post, and who meets a group of Lakota.\r\nCostner developed the film with an initial budget of $15 million. Much of the dialogue is spoken in Lakota with English subtitles. It was shot from July to November 1989 in South Dakota and Wyoming, and translated by Doris Leader Charge, of the Lakota Studies department at Sinte Gleska University.\r\nThe film earned favorable reviews from critics and audiences, who praised Costner's directing, the performances, screenplay, score, cinematography, and production values. It was a box office hit, grossing $424.2 million worldwide, making it the fourth-highest-grossing film of 1990, and is the highest-grossing film for Orion Pictures. The film was nominated for 12 Academy Awards at the 63rd Academy Awards and won seven, including Best Picture, Best Director for Costner, Best Adapted Screenplay, Best Film Editing, Best Cinematography, Best Original Score, and Best Sound Mixing. The film also won the Golden Globe Award for Best Motion Picture – Drama. It is one of only three Westerns to win the Oscar for Best Picture, the other two being Cimarron (1931) and Unforgiven (1992).\r\nIt is credited as a leading influence for the revitalization of the Western genre of filmmaking in Hollywood. In 2007, Dances with Wolves was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nIn 1863, 1st Lieutenant John J. Dunbar is wounded in battle at St. David's Field in Tennessee. The surgeon intends to amputate Dunbar's leg; choosing death in battle instead, he takes a horse and rides up to and along the Confederate lines. Confederate forces fire repeatedly at him and miss, and the Union Army takes advantage of the distraction to mount a successful attack. Dunbar receives both a citation for bravery and medical care that allows him to keep his leg. He is subsequently awarded Cisco, the horse that carried him during his suicide attempt, and his choice of posting. Dunbar requests a transfer to the western frontier, so he can see it before it disappears.\r\nDunbar is transferred to Fort Hays, a large fort commanded by Major Fambrough, who despises Dunbar's enthusiasm. He agrees to post Dunbar to the furthest outpost under his jurisdiction, Fort Sedgwick, and raises a glass to Dunbar's exit. Unbeknownst to Dunbar, Fambrough, who is severely mentally ill and has been issuing arbitrary orders with no records kept, kills himself almost immediately after Dunbar's departure. Dunbar travels with Timmons, a mule-wagon provisioner. They arrive to find the fort deserted. Despite the threat of nearby native tribes, Dunbar elects to stay and man the post himself.\r\nHe begins rebuilding and restocking the fort, preferring the solitude, recording many of his observations in his diary. Timmons is killed by Pawnee on the journey back to Fort Hays. The deaths of both Timmons and Fambrough leave the army unaware of Dunbar's assignment, and no other soldiers arrive to reinforce the post.\r\nDunbar encounters his Sioux neighbors when they attempt to steal his horse and intimidate him. Deciding that being a target is a poor prospect, he seeks out the Sioux camp and attempts dialogue. On his way, he comes across Stands with a Fist. Captured from her white family, she was adopted and assimilated as the daughter of the tribe's medicine man, Kicking Bird. She is ritually mutilating herself in mourning for her late Sioux husband. Dunbar brings her back to the Sioux to recover. Though the tribe is initially hostile, some of the members soon begin to respect him.\r\nDunbar gradually establishes a rapport with Kicking Bird, the warrior Wind in His Hair, and the youth Smiles a Lot, initially visiting each other's camps. The language barrier frustrates them, and Stands with a Fist acts as an interpreter, although with difficulty. She only remembers a little English from her early childhood before the rest of her family was killed during a Pawnee raid.\r\nDunbar discovers that the stories he had heard about the tribe were untrue, and he develops a growing respect and appreciation for their lifestyle and culture. Learning their language, he is accepted as an honored guest by the Sioux after he tells them of a migrating herd of buffalo and participates in the hunt. When at Fort Sedgwick, Dunbar befriends a wolf he dubs \"Two Socks\" for its white forepaws. Observing Dunbar and Two Socks chasing each other, the Sioux give him the name \"Dances with Wolves\". During this time, Dunbar also forges a romantic relationship with Stands with a Fist and supplies the tribe with firearms to help defend the village from an attack by the rival Pawnee tribe. Dunbar eventually wins Kicking Bird's approval to marry Stands with a Fist and abandons Fort Sedgwick.\r\nBecause of the growing threat from the Pawnee and the U.S., Chief Ten Bears decides to move the tribe to its winter camp. Dunbar decides to accompany them, but must first retrieve his diary from Fort Sedgwick, as he realizes that it would provide the army with the means to find the tribe. When he arrives, he finds the fort reoccupied by the U.S. Army. Because of his Sioux clothing, the soldiers open fire, killing Cisco and capturing Dunbar, arresting him as a traitor.\r\nTwo officers interrogate him, but Dunbar cannot prove his story, as a corporal has found his diary and kept it to use as toilet paper. Having refused to serve as an interpreter to the tribes, Dunbar is charged with desertion and transported back east as a prisoner. Soldiers of the escort shoot Two Socks when the wolf attempts to follow Dunbar, despite Dunbar's attempts to intervene.\r\nEventually, the Sioux track the convoy, killing the soldiers and freeing Dunbar. They assert that they do not see him as a white man, but as a Sioux warrior called Dances with Wolves. At the winter camp, Dunbar decides to leave with Stands with a Fist because his continuing presence would endanger the tribe. As they leave, Smiles a Lot returns the diary, which he recovered during Dunbar's liberation, and Wind in His Hair shouts to Dunbar, reminding him that he is Dunbar's friend, a contrast to their original meeting where he shouted at Dunbar in hostility.\r\nU.S. troops are seen searching the mountains, but cannot locate Dunbar or the tribe, while a lone wolf howls in the distance.\r\nAn epilogue states: \"Thirteen years later—their homes destroyed, their buffalo gone—the last band of free Sioux submitted to white authority at Fort Robinson, Nebraska. The great horse culture of the plains was gone, and the American frontier was soon to pass into history.\"\r\nCast\r\nKevin Costner as Lt. John J. Dunbar/Dances with Wolves (Lakota: Šuŋgmánitu Tȟáŋka Ób Wačhí)\r\nMary McDonnell as Stands with a Fist (Napépȟeča Nážiŋ Wiŋ)/Christine Gunther\r\nGraham Greene as Kicking Bird (Ziŋtká Nagwáka)\r\nRodney A. Grant as Wind in His Hair (Pȟehíŋ Otȟáte)\r\nFloyd Red Crow Westerman as Chief Ten Bears (Matȟó Wikčémna)\r\nTantoo Cardinal as Black Shawl (Šiná Sápa Wiŋ)\r\nJimmy Herman as Stone Calf (Íŋyaŋ Ptehíŋčala)\r\nNathan Lee Chasing His Horse as Smiles a Lot (Iȟá S'a)\r\nMichael Spears as Otter (Ptáŋ)\r\nJason R. Lone Hill as Worm (Waglúla)\r\nCharles Rocket as Lt. Elgin\r\nRobert Pastorelli as Timmons\r\nTony Pierce as Spivey\r\nLarry Joshua as Bauer\r\nKirk Baltz as Edwards\r\nTom Everett as Sergeant Pepper\r\nMaury Chaykin as Major Fambrough\r\nWes Studi as Toughest Pawnee\r\nWayne Grace as the Major\r\nMichael Horton as Captain Cargill (extended version)\r\nDoris Leader Charge as Pretty Shield, Chief Ten Bears' wife (also credited as Lakota translator and dialogue coach)\r\nDonald Hotton as General Tide\r\nFrank P. Costanza as Tucker\r\nAnnie Costner (Kevin's real-life daughter) as young Christine Gunther\r\nOtakuye Conroy as Kicking Bird's daughter\r\nJim Wilson as Doctor (uncredited)\r\nProduction\r\nOriginally written as a speculative script by Michael Blake, it went unsold in the mid-1980s. However, Kevin Costner had starred in Blake's only previous film, Stacy's Knights (1983) and encouraged Blake in early 1986 to turn the Western screenplay into a novel to improve its chances of being produced. The novel was rejected by numerous publishers, but finally was published in paperback in 1988. The rights were purchased by Costner, with an eye on directing it.\r\nCostner and his producing partner, Jim Wilson, had difficulty in raising money for the film. The project was turned down by several studios due to the Western genre no longer being popular, following the disastrous box office of Heaven's Gate (1980), as well as the length of the script. After the project languished at both Nelson Entertainment and Island Pictures due to budget reasons, Costner and Wilson enlisted producer Jake Eberts to manage foreign rights in several countries for Costner to retain final cut rights. The two then made a deal with Orion Pictures, in which the studio would distribute the film in North America.\r\nActual production lasted from July 17 or 18 to November 21 or 23, 1989. Most of the movie was filmed on location in South Dakota, mainly on private ranches near Pierre and Rapid City, with a few scenes filmed in Wyoming. Specific locations included the Badlands National Park, the Black Hills, the Sage Creek Wilderness Area, and the Belle Fourche River area. The bison hunt scenes were filmed at the Triple U Buffalo Ranch outside Fort Pierre, South Dakota, as were the Fort Sedgewick scenes on a custom set.\r\nReception\r\nDances with Wolves proved instantly popular, earning $184 million in U.S. box office and $424 million in total worldwide. As of 7 November 2022, the film holds an approval rating of 87% on Rotten Tomatoes, based on 129 reviews, with an average rating of 8/10. The website's critical consensus reads: \"Dances with Wolves suffers from a simplistic view of the culture it attempts to honor, but the end result remains a stirring western whose noble intentions are often matched by its epic grandeur.\" Metacritic gave the film a score of 72 out of 100 based on 20 critical reviews, indicating \"generally favorable reviews\". CinemaScore reported that audiences gave the film a rare \"A+\" grade.\r\nDances with Wolves was named one of the top ten films of 1990 by over 115 critics and was named the best film of the year by 19 critics.\r\nBecause of the film's popularity and lasting impact on the image of Native Americans, members of the Lakota Sioux Nation held a ceremony in Washington, D.C., \"to honor Kevin and Mary and Jim on behalf of the Indian Lakota nation\", explained Floyd Red Crow Westerman (who plays Chief Ten Bears in the movie). Albert Whitehat, a Lakota elder who served as a cultural adviser on the film, adopted Costner into his family, and two other families adopted McDonnell and Wilson. Westerman continued, that this is so \"They will all become part of one family.\" At the 63rd Academy Awards ceremony in 1991, Dances with Wolves earned 12 Academy Award nominations and won seven, including Best Writing, Adapted Screenplay (Michael Blake), Best Director (Costner), and Best Picture. In 2007, the Library of Congress selected Dances with Wolves for preservation in the United States National Film Registry.\r\nSome of the criticism of the film centered on the lack of authenticity of the Lakota language used in the film, as only one of the actors was a native speaker of the language. Oglala Lakota activist and actor Russell Means was critical of the film's lack of accuracy. In 2009, he said, \"Remember Lawrence of Arabia? That was Lawrence of the Plains. The odd thing about making that movie is that they had a woman teaching the actors the Lakota language, but Lakota has a male-gendered language and a female-gendered language. Some of the Natives and Kevin Costner were speaking in the feminine way. When I went to see it with a bunch of Lakota guys, we were laughing.\"\r\nMichael Smith (Sioux), the director of San Francisco's long-running annual American Indian Film Festival, said that despite criticisms, \"There's a lot of good feeling about the film in the Native community, especially among the tribes. I think it's going to be very hard to top this one.\" However, Blackfeet filmmaker George Budreau countered, \"I want to say, 'how nice',... But no matter how sensitive and wonderful this movie is, you have to ask who's telling the story. It's certainly not an Indian.\"\r\nThough promoted as a breakthrough in its use of an Indigenous language, earlier English-language films, such as Eskimo (1933), Wagon Master (1950), and The White Dawn (1974) also have Native dialogue.\r\nDavid Sirota of Salon referred to Dances with Wolves as a \"white savior\" film, as Dunbar \"fully embeds himself in the Sioux tribe and quickly becomes its primary protector\". He argued that its use of the \"noble savage\" character type \"preemptively blunts criticism of the underlying White Savior story. The idea is that a film like Dances with Wolves cannot be bigoted or overly white-centric if it at least shows Kicking Bird and Chief Ten Bears as special and exceptional. This, even though the whole story is about a white guy who saves the day.\"\r\nAccolades\r\nIn addition to becoming the first Western film to win an Academy Award for Best Picture since 1931's Cimarron, Dances with Wolves won a number of additional awards, making it one of the most honored films of 1990.\r\nHome media\r\nThe film was released on home video in the United States in September 1991 by Orion Home Video and beat the rental record set by Ghost, at 649,000 units. The extended Special Edition was released on DVD on May 20, 2003, in a two-disc set. Dances With Wolves was then released on Blu-ray and DVD on January 11, 2011, and was re-released on Blu-ray on January 13, 2015, and again on November 13, 2018.\r\nSequel\r\nThe Holy Road, a sequel novel by Michael Blake, the author of both the original novel and the movie screenplay, was published in 2001. It picks up 11 years after the events of Dances with Wolves. John Dunbar is still married to Stands with a Fist, and they have three children. Stands with a Fist and one of the children are kidnapped by a party of white rangers, and Dances with Wolves must mount a rescue mission.\r\nSalvador Carrasco was attached to direct the sequel, but the film was not realized. As of 2007, Blake was writing a film adaptation. However, Costner stated in a 2008 interview that he would \"never make a sequel\". A third book titled The Great Mystery was planned, but Blake died in 2015.\r\nHistorical references\r\nJudith A. Boughter wrote: \"The problem with Costner's approach is that all of the Sioux are heroic, while the Pawnees are portrayed as stereotypical villains. Most accounts of Sioux–Pawnee relations see the Pawnees, numbering only 4,000 at that time, as victims of the more powerful Sioux.\"\r\nThe history and context of Fort Hays is radically different from that portrayed in the movie. Historic Fort Hays was founded in 1867, with the iconic stone blockhouse being built immediately. Its predecessor, Fort Fletcher (1865–1868), was abandoned for only a few months and then relocated only a short distance in 1866. Fort Hays was founded in Cheyenne territory rather than Sioux. Rather than a desolate site, the fort was host to thousands of soldiers, railroad workers, and settlers from the start. The Kansas Pacific Railway and the settlements of Rome and Hays City were built next to the fort in 1867; each was a perceived violation of Cheyenne and Arapaho territory, resulting in immediate warfare with the Dog Soldiers. The fort was Sheridan's headquarters at the center of the 1867–68 conflict. A historic seasonal Pawnee tipi village had been located only 9 miles (14 km) from Fort Hays, but the Pawnee had been excluded from it by other dominant tribes for some time by the 1860s.\r\nThe real John Dunbar worked as a Christian missionary among the Pawnee in the 1830s–40s, and sided with the Native Americans in a dispute with government farmers and a local Indian agent. It is unclear whether the name \"John Dunbar\" was chosen as a corollary to the historical figure.\r\nThe fictional Lieutenant John Dunbar of 1863 is correctly shown in the film wearing a gold bar on his officer shoulder straps, indicating his rank as a first lieutenant. From 1836 to 1872, the rank of first lieutenant was indicated by a gold bar; after 1872, the rank was indicated by a silver bar. Similarly, Captain Cargill is correctly depicted wearing a pair of gold bars, indicating the rank of captain at that time.\r\nAuthor and screenwriter Michael Blake said that Stands with a Fist was actually based upon Cynthia Ann Parker, the white girl captured by Comanches and mother of Quanah Parker.\r\nExtended version\r\nOne year after the original theatrical release of Dances with Wolves, a four-hour version of the film opened at select theaters in London. This longer cut was titled Dances with Wolves: The Special Edition, and it restored nearly an hour's worth of scenes that had been removed to keep the original film's running time under three hours. In a letter to British film reviewers, Kevin Costner and producer Jim Wilson addressed their reasons for presenting a longer version of the film:\r\nWhy add another hour to a film that by most standards pushes the time limit of conventional movie making? The 52 additional minutes that represent this \"new\" version were difficult to cut in the first place, and ... the opportunity to introduce them to audiences is compelling. We have received countless letters from people worldwide asking when or if a sequel would be made, so it seemed like a logical step to enhance our film with existing footage ... making an extended version is by no means to imply that the original Dances with Wolves was unfinished or incomplete; rather, it creates an opportunity for those who fell in love with the characters and the spectacle of the film to experience more of both.\r\nThe genesis of the four-hour version of the film was further explained in an article for Entertainment Weekly that appeared ten months after the premiere of the original film. \"While the small screen has come to serve as a second chance for filmmakers who can't seem to let their babies go, Kevin Costner and his producing partner, Jim Wilson, hope that their newly completed version will hit theater screens first.\"\r\n\"I spent seven months working on it\", Wilson says of the expanded Wolves. He's quick to defend the Oscar-winning version as \"the best picture we had in us at the time\", yet Wilson also says he's \"ecstatic\" over the recut. \"It's a brand-new picture\", he insists. \"There's now more of a relationship between Kevin and Stands with a Fist, more with the wolf, more with the Indians—stuff that's integral all through the story.\" Of course, exhibitors may not want a longer version of an already widely seen movie, but Wilson remains optimistic. \"I don't think the time is now\", he acknowledges, \"but ideally, there is a point at which it would come out with an intermission, booked into the very best venues in America.\"\r\nCostner later stated that he did not work on the creation of the Special Edition at all.\r\nSoundtrack\r\nJohn Barry composed the Oscar-winning score. It was issued in 1990 initially and again in 1995 with bonus tracks and in 2004 with the score \"in its entirety\".\r\nPeter Buffett scored the \"Fire Dance\" scene.",
    "html": "<p>Dances with Wolves is a 1990 American epic western film starring, directed, and produced by Kevin Costner in his feature directorial debut. It is a film adaptation of the 1988 novel Dances with Wolves by Michael Blake that tells the story of Union Army Lieutenant John J. Dunbar (Costner), who travels to the American frontier to find a military post, and who meets a group of Lakota.</p><p>Costner developed the film with an initial budget of $15 million. Much of the dialogue is spoken in Lakota with English subtitles. It was shot from July to November 1989 in South Dakota and Wyoming, and translated by Doris Leader Charge, of the Lakota Studies department at Sinte Gleska University.</p><p>The film earned favorable reviews from critics and audiences, who praised Costner's directing, the performances, screenplay, score, cinematography, and production values. It was a box office hit, grossing $424.2 million worldwide, making it the fourth-highest-grossing film of 1990, and is the highest-grossing film for Orion Pictures. The film was nominated for 12 Academy Awards at the 63rd Academy Awards and won seven, including Best Picture, Best Director for Costner, Best Adapted Screenplay, Best Film Editing, Best Cinematography, Best Original Score, and Best Sound Mixing. The film also won the Golden Globe Award for Best Motion Picture – Drama. It is one of only three Westerns to win the Oscar for Best Picture, the other two being Cimarron (1931) and Unforgiven (1992).</p><p>It is credited as a leading influence for the revitalization of the Western genre of filmmaking in Hollywood. In 2007, Dances with Wolves was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>In 1863, 1st Lieutenant John J. Dunbar is wounded in battle at St. David's Field in Tennessee. The surgeon intends to amputate Dunbar's leg; choosing death in battle instead, he takes a horse and rides up to and along the Confederate lines. Confederate forces fire repeatedly at him and miss, and the Union Army takes advantage of the distraction to mount a successful attack. Dunbar receives both a citation for bravery and medical care that allows him to keep his leg. He is subsequently awarded Cisco, the horse that carried him during his suicide attempt, and his choice of posting. Dunbar requests a transfer to the western frontier, so he can see it before it disappears.</p><p>Dunbar is transferred to Fort Hays, a large fort commanded by Major Fambrough, who despises Dunbar's enthusiasm. He agrees to post Dunbar to the furthest outpost under his jurisdiction, Fort Sedgwick, and raises a glass to Dunbar's exit. Unbeknownst to Dunbar, Fambrough, who is severely mentally ill and has been issuing arbitrary orders with no records kept, kills himself almost immediately after Dunbar's departure. Dunbar travels with Timmons, a mule-wagon provisioner. They arrive to find the fort deserted. Despite the threat of nearby native tribes, Dunbar elects to stay and man the post himself.</p><p>He begins rebuilding and restocking the fort, preferring the solitude, recording many of his observations in his diary. Timmons is killed by Pawnee on the journey back to Fort Hays. The deaths of both Timmons and Fambrough leave the army unaware of Dunbar's assignment, and no other soldiers arrive to reinforce the post.</p><p>Dunbar encounters his Sioux neighbors when they attempt to steal his horse and intimidate him. Deciding that being a target is a poor prospect, he seeks out the Sioux camp and attempts dialogue. On his way, he comes across Stands with a Fist. Captured from her white family, she was adopted and assimilated as the daughter of the tribe's medicine man, Kicking Bird. She is ritually mutilating herself in mourning for her late Sioux husband. Dunbar brings her back to the Sioux to recover. Though the tribe is initially hostile, some of the members soon begin to respect him.</p><p>Dunbar gradually establishes a rapport with Kicking Bird, the warrior Wind in His Hair, and the youth Smiles a Lot, initially visiting each other's camps. The language barrier frustrates them, and Stands with a Fist acts as an interpreter, although with difficulty. She only remembers a little English from her early childhood before the rest of her family was killed during a Pawnee raid.</p><p>Dunbar discovers that the stories he had heard about the tribe were untrue, and he develops a growing respect and appreciation for their lifestyle and culture. Learning their language, he is accepted as an honored guest by the Sioux after he tells them of a migrating herd of buffalo and participates in the hunt. When at Fort Sedgwick, Dunbar befriends a wolf he dubs \"Two Socks\" for its white forepaws. Observing Dunbar and Two Socks chasing each other, the Sioux give him the name \"Dances with Wolves\". During this time, Dunbar also forges a romantic relationship with Stands with a Fist and supplies the tribe with firearms to help defend the village from an attack by the rival Pawnee tribe. Dunbar eventually wins Kicking Bird's approval to marry Stands with a Fist and abandons Fort Sedgwick.</p><p>Because of the growing threat from the Pawnee and the U.S., Chief Ten Bears decides to move the tribe to its winter camp. Dunbar decides to accompany them, but must first retrieve his diary from Fort Sedgwick, as he realizes that it would provide the army with the means to find the tribe. When he arrives, he finds the fort reoccupied by the U.S. Army. Because of his Sioux clothing, the soldiers open fire, killing Cisco and capturing Dunbar, arresting him as a traitor.</p><p>Two officers interrogate him, but Dunbar cannot prove his story, as a corporal has found his diary and kept it to use as toilet paper. Having refused to serve as an interpreter to the tribes, Dunbar is charged with desertion and transported back east as a prisoner. Soldiers of the escort shoot Two Socks when the wolf attempts to follow Dunbar, despite Dunbar's attempts to intervene.</p><p>Eventually, the Sioux track the convoy, killing the soldiers and freeing Dunbar. They assert that they do not see him as a white man, but as a Sioux warrior called Dances with Wolves. At the winter camp, Dunbar decides to leave with Stands with a Fist because his continuing presence would endanger the tribe. As they leave, Smiles a Lot returns the diary, which he recovered during Dunbar's liberation, and Wind in His Hair shouts to Dunbar, reminding him that he is Dunbar's friend, a contrast to their original meeting where he shouted at Dunbar in hostility.</p><p>U.S. troops are seen searching the mountains, but cannot locate Dunbar or the tribe, while a lone wolf howls in the distance.</p><p>An epilogue states: \"Thirteen years later—their homes destroyed, their buffalo gone—the last band of free Sioux submitted to white authority at Fort Robinson, Nebraska. The great horse culture of the plains was gone, and the American frontier was soon to pass into history.\"</p><br/><h3>Cast</h3><ul><li>Kevin Costner as Lt. John J. Dunbar/Dances with Wolves (Lakota: Šuŋgmánitu Tȟáŋka Ób Wačhí)</li><li>Mary McDonnell as Stands with a Fist (Napépȟeča Nážiŋ Wiŋ)/Christine Gunther</li><li>Graham Greene as Kicking Bird (Ziŋtká Nagwáka)</li><li>Rodney A. Grant as Wind in His Hair (Pȟehíŋ Otȟáte)</li><li>Floyd Red Crow Westerman as Chief Ten Bears (Matȟó Wikčémna)</li><li>Tantoo Cardinal as Black Shawl (Šiná Sápa Wiŋ)</li><li>Jimmy Herman as Stone Calf (Íŋyaŋ Ptehíŋčala)</li><li>Nathan Lee Chasing His Horse as Smiles a Lot (Iȟá S'a)</li><li>Michael Spears as Otter (Ptáŋ)</li><li>Jason R. Lone Hill as Worm (Waglúla)</li><li>Charles Rocket as Lt. Elgin</li><li>Robert Pastorelli as Timmons</li><li>Tony Pierce as Spivey</li><li>Larry Joshua as Bauer</li><li>Kirk Baltz as Edwards</li><li>Tom Everett as Sergeant Pepper</li><li>Maury Chaykin as Major Fambrough</li><li>Wes Studi as Toughest Pawnee</li><li>Wayne Grace as the Major</li><li>Michael Horton as Captain Cargill (extended version)</li><li>Doris Leader Charge as Pretty Shield, Chief Ten Bears' wife (also credited as Lakota translator and dialogue coach)</li><li>Donald Hotton as General Tide</li><li>Frank P. Costanza as Tucker</li><li>Annie Costner (Kevin's real-life daughter) as young Christine Gunther</li><li>Otakuye Conroy as Kicking Bird's daughter</li><li>Jim Wilson as Doctor (uncredited)</li></ul><br/><h3>Production</h3><p>Originally written as a speculative script by Michael Blake, it went unsold in the mid-1980s. However, Kevin Costner had starred in Blake's only previous film, Stacy's Knights (1983) and encouraged Blake in early 1986 to turn the Western screenplay into a novel to improve its chances of being produced. The novel was rejected by numerous publishers, but finally was published in paperback in 1988. The rights were purchased by Costner, with an eye on directing it.</p><p>Costner and his producing partner, Jim Wilson, had difficulty in raising money for the film. The project was turned down by several studios due to the Western genre no longer being popular, following the disastrous box office of Heaven's Gate (1980), as well as the length of the script. After the project languished at both Nelson Entertainment and Island Pictures due to budget reasons, Costner and Wilson enlisted producer Jake Eberts to manage foreign rights in several countries for Costner to retain final cut rights. The two then made a deal with Orion Pictures, in which the studio would distribute the film in North America.</p><p>Actual production lasted from July 17 or 18 to November 21 or 23, 1989. Most of the movie was filmed on location in South Dakota, mainly on private ranches near Pierre and Rapid City, with a few scenes filmed in Wyoming. Specific locations included the Badlands National Park, the Black Hills, the Sage Creek Wilderness Area, and the Belle Fourche River area. The bison hunt scenes were filmed at the Triple U Buffalo Ranch outside Fort Pierre, South Dakota, as were the Fort Sedgewick scenes on a custom set.</p><br/><h3>Reception</h3><p>Dances with Wolves proved instantly popular, earning $184 million in U.S. box office and $424 million in total worldwide. As of 7 November 2022, the film holds an approval rating of 87% on Rotten Tomatoes, based on 129 reviews, with an average rating of 8/10. The website's critical consensus reads: \"Dances with Wolves suffers from a simplistic view of the culture it attempts to honor, but the end result remains a stirring western whose noble intentions are often matched by its epic grandeur.\" Metacritic gave the film a score of 72 out of 100 based on 20 critical reviews, indicating \"generally favorable reviews\". CinemaScore reported that audiences gave the film a rare \"A+\" grade.</p><p>Dances with Wolves was named one of the top ten films of 1990 by over 115 critics and was named the best film of the year by 19 critics.</p><p>Because of the film's popularity and lasting impact on the image of Native Americans, members of the Lakota Sioux Nation held a ceremony in Washington, D.C., \"to honor Kevin and Mary and Jim on behalf of the Indian Lakota nation\", explained Floyd Red Crow Westerman (who plays Chief Ten Bears in the movie). Albert Whitehat, a Lakota elder who served as a cultural adviser on the film, adopted Costner into his family, and two other families adopted McDonnell and Wilson. Westerman continued, that this is so \"They will all become part of one family.\" At the 63rd Academy Awards ceremony in 1991, Dances with Wolves earned 12 Academy Award nominations and won seven, including Best Writing, Adapted Screenplay (Michael Blake), Best Director (Costner), and Best Picture. In 2007, the Library of Congress selected Dances with Wolves for preservation in the United States National Film Registry.</p><p>Some of the criticism of the film centered on the lack of authenticity of the Lakota language used in the film, as only one of the actors was a native speaker of the language. Oglala Lakota activist and actor Russell Means was critical of the film's lack of accuracy. In 2009, he said, \"Remember Lawrence of Arabia? That was Lawrence of the Plains. The odd thing about making that movie is that they had a woman teaching the actors the Lakota language, but Lakota has a male-gendered language and a female-gendered language. Some of the Natives and Kevin Costner were speaking in the feminine way. When I went to see it with a bunch of Lakota guys, we were laughing.\"</p><p>Michael Smith (Sioux), the director of San Francisco's long-running annual American Indian Film Festival, said that despite criticisms, \"There's a lot of good feeling about the film in the Native community, especially among the tribes. I think it's going to be very hard to top this one.\" However, Blackfeet filmmaker George Budreau countered, \"I want to say, 'how nice',... But no matter how sensitive and wonderful this movie is, you have to ask who's telling the story. It's certainly not an Indian.\"</p><p>Though promoted as a breakthrough in its use of an Indigenous language, earlier English-language films, such as Eskimo (1933), Wagon Master (1950), and The White Dawn (1974) also have Native dialogue.</p><p>David Sirota of Salon referred to Dances with Wolves as a \"white savior\" film, as Dunbar \"fully embeds himself in the Sioux tribe and quickly becomes its primary protector\". He argued that its use of the \"noble savage\" character type \"preemptively blunts criticism of the underlying White Savior story. The idea is that a film like Dances with Wolves cannot be bigoted or overly white-centric if it at least shows Kicking Bird and Chief Ten Bears as special and exceptional. This, even though the whole story is about a white guy who saves the day.\"</p><h4>Accolades</h4><p>In addition to becoming the first Western film to win an Academy Award for Best Picture since 1931's Cimarron, Dances with Wolves won a number of additional awards, making it one of the most honored films of 1990.</p><h4>Home media</h4><p>The film was released on home video in the United States in September 1991 by Orion Home Video and beat the rental record set by Ghost, at 649,000 units. The extended Special Edition was released on DVD on May 20, 2003, in a two-disc set. Dances With Wolves was then released on Blu-ray and DVD on January 11, 2011, and was re-released on Blu-ray on January 13, 2015, and again on November 13, 2018.</p><br/><h3>Sequel</h3><p>The Holy Road, a sequel novel by Michael Blake, the author of both the original novel and the movie screenplay, was published in 2001. It picks up 11 years after the events of Dances with Wolves. John Dunbar is still married to Stands with a Fist, and they have three children. Stands with a Fist and one of the children are kidnapped by a party of white rangers, and Dances with Wolves must mount a rescue mission.</p><p>Salvador Carrasco was attached to direct the sequel, but the film was not realized. As of 2007, Blake was writing a film adaptation. However, Costner stated in a 2008 interview that he would \"never make a sequel\". A third book titled The Great Mystery was planned, but Blake died in 2015.</p><br/><h3>Historical references</h3><p>Judith A. Boughter wrote: \"The problem with Costner's approach is that all of the Sioux are heroic, while the Pawnees are portrayed as stereotypical villains. Most accounts of Sioux–Pawnee relations see the Pawnees, numbering only 4,000 at that time, as victims of the more powerful Sioux.\"</p><p>The history and context of Fort Hays is radically different from that portrayed in the movie. Historic Fort Hays was founded in 1867, with the iconic stone blockhouse being built immediately. Its predecessor, Fort Fletcher (1865–1868), was abandoned for only a few months and then relocated only a short distance in 1866. Fort Hays was founded in Cheyenne territory rather than Sioux. Rather than a desolate site, the fort was host to thousands of soldiers, railroad workers, and settlers from the start. The Kansas Pacific Railway and the settlements of Rome and Hays City were built next to the fort in 1867; each was a perceived violation of Cheyenne and Arapaho territory, resulting in immediate warfare with the Dog Soldiers. The fort was Sheridan's headquarters at the center of the 1867–68 conflict. A historic seasonal Pawnee tipi village had been located only 9 miles (14 km) from Fort Hays, but the Pawnee had been excluded from it by other dominant tribes for some time by the 1860s.</p><p>The real John Dunbar worked as a Christian missionary among the Pawnee in the 1830s–40s, and sided with the Native Americans in a dispute with government farmers and a local Indian agent. It is unclear whether the name \"John Dunbar\" was chosen as a corollary to the historical figure.</p><p>The fictional Lieutenant John Dunbar of 1863 is correctly shown in the film wearing a gold bar on his officer shoulder straps, indicating his rank as a first lieutenant. From 1836 to 1872, the rank of first lieutenant was indicated by a gold bar; after 1872, the rank was indicated by a silver bar. Similarly, Captain Cargill is correctly depicted wearing a pair of gold bars, indicating the rank of captain at that time.</p><p>Author and screenwriter Michael Blake said that Stands with a Fist was actually based upon Cynthia Ann Parker, the white girl captured by Comanches and mother of Quanah Parker.</p><br/><h3>Extended version</h3><p>One year after the original theatrical release of Dances with Wolves, a four-hour version of the film opened at select theaters in London. This longer cut was titled Dances with Wolves: The Special Edition, and it restored nearly an hour's worth of scenes that had been removed to keep the original film's running time under three hours. In a letter to British film reviewers, Kevin Costner and producer Jim Wilson addressed their reasons for presenting a longer version of the film:</p><blockquote>Why add another hour to a film that by most standards pushes the time limit of conventional movie making? The 52 additional minutes that represent this \"new\" version were difficult to cut in the first place, and ... the opportunity to introduce them to audiences is compelling. We have received countless letters from people worldwide asking when or if a sequel would be made, so it seemed like a logical step to enhance our film with existing footage ... making an extended version is by no means to imply that the original Dances with Wolves was unfinished or incomplete; rather, it creates an opportunity for those who fell in love with the characters and the spectacle of the film to experience more of both.</blockquote><p>The genesis of the four-hour version of the film was further explained in an article for Entertainment Weekly that appeared ten months after the premiere of the original film. \"While the small screen has come to serve as a second chance for filmmakers who can't seem to let their babies go, Kevin Costner and his producing partner, Jim Wilson, hope that their newly completed version will hit theater screens first.\"</p><blockquote>\"I spent seven months working on it\", Wilson says of the expanded Wolves. He's quick to defend the Oscar-winning version as \"the best picture we had in us at the time\", yet Wilson also says he's \"ecstatic\" over the recut. \"It's a brand-new picture\", he insists. \"There's now more of a relationship between Kevin and Stands with a Fist, more with the wolf, more with the Indians—stuff that's integral all through the story.\" Of course, exhibitors may not want a longer version of an already widely seen movie, but Wilson remains optimistic. \"I don't think the time is now\", he acknowledges, \"but ideally, there is a point at which it would come out with an intermission, booked into the very best venues in America.\"</blockquote><p>Costner later stated that he did not work on the creation of the Special Edition at all.</p><br/><h3>Soundtrack</h3><ul><li>John Barry composed the Oscar-winning score. It was issued in 1990 initially and again in 1995 with bonus tracks and in 2004 with the score \"in its entirety\".</li><li>Peter Buffett scored the \"Fire Dance\" scene.</li></ul><br/>"
  },
  "errorMessage": ""
}