{
  "imDbId": "tt0022100",
  "title": "M",
  "fullTitle": "M (1931)",
  "type": "Movie",
  "year": "1931",
  "items": [
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2192552",
      "warningSpoilers": false,
      "date": "16 January 2010",
      "rate": "9",
      "helpful": "63 out of 68 found this helpful.",
      "title": "Ahead of its time",
      "content": "This is a very interesting film on so many levels. It's interesting to see just how far ahead German cinema was of its American counterpart at this point in time. Although there is not that much talking in this early German talking picture - Fritz Lang resisted going to sound in the first place - what conversation that does take place is well done and natural sounding. Compare it with any American film from 1931 and you can't help but see the difference.The murderer, artfully played by Peter Lorre, has been killing children that have no link to him personally for months. The police, despite all of their efforts, are unable to catch him, mainly because there is no rhyme or reason in his choice of victims. At first there is a focus on the victims and the hole left in their families by their killing. Then, the film shifts to two normally opposed groups - the police and the underworld. After several months of no results by the authorities, the police are unhappy because it reflects badly upon them, and the underworld is unhappy because their activities are being disrupted because of the police doing constant raids in their efforts to capture the killer.In a particularly well-done part of the film the scene shifts back and forth between a conference of police and one of the underworld. They discuss how they are going to catch the killer. The police settle upon the idea of looking for people with a history of past mental problems that were pronounced cured and released. The underworld decides to enlist an invisible group - the beggars - to follow every child at all times and therefore catch the killer. Both groups focus on the right suspect, the question is - who gets there first? M is a fascinating film that raises many topics - the death penalty, a group of criminals that are criminals by choice causing less stress on society than a lone criminal that acts out of an uncontrollable compulsion, and the motivations of the authorities often being their own bureaucratic survival rather than the larger issue of ending a series of horrible acts against humanity."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1137933",
      "warningSpoilers": false,
      "date": "29 July 2005",
      "rate": "10",
      "helpful": "161 out of 189 found this helpful.",
      "title": "Fritz Lang's (sound) masterpiece- a taut and quintessentially suspenseful story, and Lorre",
      "content": "The first time I saw M, by Fritz Lang, I almost didn't know what to make of it. I was overwhelmed by the power of the performances, the staging of the scenes, the locations, and the power that the simple story had with such complex circumstances. Then I saw it again, and a third time, and I know that this is one of the best films ever to come out of Germany- it's a powerful statement about protecting our children (if you're looking at it as a \"message\" movie), but in reality it is just a piece of cinema heaven. Thrillers today only wish they could draw a viewer into the mystery elements, and have such unconventionality of the times. Boiling down to this, M is about a child Killer - the legendary character actor Peter Lorre in his first major role - who snatches children when their parents don't watch, and continues on until an investigation goes underway. But as the police investigate overly thoroughly into the real criminal underworld, they know something is up, that this is someone far more gone than they could ever be, so they join in the hunt. This all leads to one of the supreme dramatic climaxes in any thriller.On the first viewing I just went straight for the story, which is able to suck one in enough to make you feel dizzy. But on the multiple viewings it becomes even more interesting as one can study the intricacy, and indeed full-on artistry, of Lang's camera. He puts it in unusual places at times, and adds for good measure shades of dark and gray in many of the night scene (this is, by the way, a precursor to 'film-noir', which Lang later became an important director in the 40's and 50's). On top of this, there is a very modern sense of style in the editing- I remember a couple of scenes that surprised me editing wise. One is where the cops (I think it was the cops) have an argument about the investigation- two of them get into a shouting match, and we get medium close-ups of them going back and forth. This is done quickly, with a kind of intensity that isn't even captured in today's thrillers. There is also the hunt for Lorre in the digging of the house, where Lang cuts around constantly, heightening the tension between the predators (the criminals) and the prey (Lorre), until it's almost too much to take.The disturbing aspects of the story, of child abduction and murder, have become benchmarks of a number of today's thrillers, where the cop is usually the subject and the killer left more in the shadows, in cat & mouse style. This doesn't happen here, and because of it by the time we get to the final scene, with Lorre being interrogated and giving his \"I can't help it\" speech, it becomes something poetic, tragic, frightening. Lang doesn't leave his \"message\" so simplistically, he makes sure we know Lorre's side too, however twisted it has become, and the antagonist is shown as human as opposed to these present-day thriller where the killers are barely given one dimension let alone two. There were reports that during filming Lang put Lorre through torture, ultimately causing the two to never work together again. But nevertheless, out of this comes a towering performance of a small, wild-eyed criminal in the midst of an extremely well-told and unpredictable mystery story. In short, if you don't know what you're in for when you hear that whistle, those several infamous notes, you may not at all."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0008111",
      "warningSpoilers": false,
      "date": "31 January 2002",
      "rate": "8",
      "helpful": "173 out of 204 found this helpful.",
      "title": "Moments of menace..",
      "content": "The economy, austerity and directness of the films of Fritz Lang made him one of the most profound, and precise filmmakers... Lang, a master of the German expressionist film, shot his first talkie, a crime drama considered a landmark in the story of suspense movies... It was a shocking idea for its time, based on the real-life killer Peter Kurten, headlined as the Vampire of Düsseldorf...'M' is about a terrorized city, and a plump little man with wide eyes (often chewing candy) who is a pathological child-killer, unable to control his urge for killing... The film embodies several Lang themes: the duality between justice and revenge, mob hysteria, the menacing anticipation of watching a helplessly trapped individual trying fruitlessly to escape as greater forces move inexorably in, and, for probably the first time in the cinema, it adds a new dimension to suspense: pity... For the killer is clearly mentally sick... He cannot overcome the overwhelming compulsion of his murderous disease, and yet, we see him hunted down and almost lynched as a criminal, rather than treated as a sick man... Early in the film, the killer is heard whistling the Grieg theme from 'In the Hall of the Mountain King'. This theme inexorably becomes imbued with menace... And when we see no more than a girl looking in a shop window, the melody on the sound-track told us chillingly that the murderer is there, just out of sight...The Murderer is played by Peter Lorre in a virtuoso performance that has barely been matched in all the thrillers he has made since 'Casablanca,' 'The Maltese Falcon,' and 'The Mask of Dimitrios.' When the photographs of his victims, all little girls, are shown to him, he jumps back and twitches with horror...With powerful visuals, Lang's motion picture is Lorre's first film... His performance as the corpulent, hunted psychopath is a masterpiece of mime and suggestion... Lorre is the archetypal outsider-outside the law and society because of his compulsive crimes, outside the balancing society of the underworld because he is not a professional criminal... He had only twelve lines of dialog...In the most famous of all about a pathological killer - Alfred Hitchcock's 'Psycho' - Anthony Perkins lacked not only the threat of the tortured Peter Lorre, but also the dimension of invoking our incredulous sympathy... 'Psycho' reeked with blood and horror, whereas the suspense of 'M' is subtle... A child's balloon without an owner, a rolling ball, are enough to tell us that another murder had been committed... The audience, trapped in its seats, torn by ambivalent feelings towards the killer, watched him trapped as the net is pulled tight..."
    },
    {
      "username": "Movie-12",
      "userUrl": "https://www.imdb.com/user/ur0111563",
      "reviewLink": "https://www.imdb.com/review/rw0008074",
      "warningSpoilers": false,
      "date": "1 June 2000",
      "rate": "10",
      "helpful": "243 out of 284 found this helpful.",
      "title": "A masterpiece of visual drama; brilliantly acted by Peter Lorre. **** out of ****.",
      "content": "M / (1931) **** \"M\" is a cinematic masterpiece of visual drama. The stunning performances define the careers of exceptional actors such as Peter Lorre and Gustaf Grundgens. Director Fritz Lang gives depth and dimension to his production by distinctly capturing the ecstasy of the film's many characters and focusing accurately on individual situations. This is an intriguing journey into the mind of a psychotic child murderer, blending terror, complexity, and malignity in one amazing motion picture. Screenwriters Paul Falkenburg and Adlof Jansen construct the characters of \"M\" with distinctive personalities and three dimensional emotions. Many lesser filmmakers give their characters no creativity outside the confines of the script. In this movie each individual character has a mind of their own; they are free to roam the landscape of a inviting atmosphere. Fabricating such an impressive atmosphere is some of the best cinematography and lighting effects that I can remember watching. This resplendent component creates the film's terrific moody ambiance. Suspense is one thing \"M\" contains in full context. The movie's third act is sheer peak-high tension. Shot in black and white, \"M\" stars Peter Lorre as Peter-Hans Beckert, an extremely disturbed child murderer in the process of wreaking havoc on a neighborhood. Parents everywhere are living in fear of their children being kidnapped and abruptly annihilated. This picture contains a brilliantly crafted setup. The visual setting creates a strongly developed opening. Every scene works to either complicate the initial problem or propels the story through a firm narrative through line. The film captures the chaos of the town in terror perfectly. \"M\" is more about the results of a serial killer than an actual serial killer. Never do we directly witness a murder; the violent encounters are implied. This method of film making perhaps makes the movie's impact even greater. With an creative perspective through a third person point of view, the filmmakers repeatedly give us examples of a solid structure through characters and occurrences. \"M\" offers a unforgettable, challenging performance by Peter Lorre. This extraordinary actor is tormenting and disturbing without embracing in extreme violent conduct. He perspires with momentum and rapture. This productions closing scenes are so deeply penetrating they entirely captivate the viewer. Isn't this what movies are supposed to do?"
    },
    {
      "username": "EThompsonUMD",
      "userUrl": "https://www.imdb.com/user/ur0182733",
      "reviewLink": "https://www.imdb.com/review/rw1329724",
      "warningSpoilers": false,
      "date": "31 March 2006",
      "rate": "10",
      "helpful": "174 out of 188 found this helpful.",
      "title": "Influential and unforgettable masterpiece.",
      "content": "Fritz Lang's highly influential career as a film director began in post World War I Germany, where he was a leading figure in the German Expressionist film movement, and ended in the United States in 1953 with the production of The Big Heat, a film noir classic. Perhaps his greatest film, M (Germany, 1931) forms an historical bridge between expressionism and film noir. Like the former it uses strange and disturbing compositions of light and dark in order to symbolize the inner workings of the human mind; like the latter it more realistically sets its story in a modern urban setting and blends in sociological issues along with the psychological and moral ones. Even though M was Lang's (and Germany's) first sound film, many historians cite it as the initial masterpiece of cinema to appear following the introduction of sound into films in the late 1920's. While most early \"talkies\" return films to their static, visually monotonous, stage- imitative beginnings and thus limit rather than expand the artistic possibilities of the medium, M avoids the failing by skillfully balancing asynchronous, off-screen sounds with the more limiting use of synchronous dialogue. The film's editing, particularly its elaborate use of parallel cutting, also contributes kinetic energy and fluidity to the storytelling. Of course, many of the film's sound effects are also imaginative and memorable, none more so than the compulsive whistling of the film's central character, the stalker and serial killer of little girls Hans Beckert (magnificently played by Peter Lorre). Sound is also an important contributor to M's rich and influential use of off screen space. One famous example is the scene that introduces Beckert as a shadow against his own Wanted poster, creepily intoning to his next victim, Elsie Beckmann, \"You have a very pretty ball.\" Not only is Beckert's shadow a bow toward Lang's expressionist artistic roots, but it ironically places the murderer in the implied space in front of the image - that is, among us, the human community of viewers of which he is an innocuous-appearing, albeit monstrous, member. Another example of Lang's use of off-screen space is the montage of shots whose common denominator is Elsie's absence from them: an empty chair at the Beckmann dinner table, the vertiginous stairwell down which Elsie's mother searches compulsively and futilely for signs of her daughter's arrival, the attic play area that awaits Elsie's return from school. Most memorable of all - and most often alluded to visually in other films - is the series of shots that indirectly record Beckert's assault and murder of the innocent child, representing these off screen events metonymically via the entry of Elsie's ball from bushes along on the right edge of the frame and the release of her balloon from telephone wires and off the left edge of the frame. Never in the history of cinema has something so terrible been communicated through such powerfully understated images.Beyond its technical brilliance, the keys to M's lasting impact are its psychologically convincing portrait of Hans Beckert's twisted compulsion and the still relevant ambivalence of his capture and \"trial.\" Unlike contemporary cinematic examples of the serial killer, Beckert is not presented simply as a grotesque psychopath. Nor is the issue of how society should deal with him at all clear-cut. To be sure, the gut-reaction of most film audiences is to root on the underworld mobsters and petty thieves who, beating the established authorities to their mutual quarry, capture Beckert and bring him to a mock- formal trial whose conclusion is foregone. Like many in America today, Beckert's accusers are disinclined to listen to insanity pleas and would just as soon be rid of the \"monster\" in the surest way possible: a summary death penalty with as little fretting about legal rights as possible. Considering the heinousness of Beckert's crimes and the imperfections of a legal/medical system that could well turn him loose to kill again, this emotional response is hard to resist. Yet M is by no means an endorsement of vigilantism - quite the contrary. Through the unlikely rhetorical persuasions of Beckert's unkempt \"court appointed\" defense attorney and Beckert's own impassioned monologue, Lang strongly implies that impatience with democratic judicial procedure and a paranoid eagerness to scapegoat others (guilty or not) in the name of order are symptomatic of the social hysteria breeding Nazism in 1930s Germany. That the ruthless killer who heads the underworld looks, dresses, and gestures like a Gestapo officer is no accident. Moreover, the letter \"M\" chalked on Beckert's back by one of his pursuers not only stands for \"murderer\" but also alludes to God's marking of Cain. While the popular misconception holds that the mark of Cain symbolizes his evil, it in fact represents God's warning to Cain's flawed fellow creatures not to mete out wrathful vengeance, but to leave justice in God's hands. Translated into secular terms (and literally entering the shot from the top of the frame), God's hands in M belong to the legitimate authorities that intervene at the last moment to arrest and try Hans Beckert \"in the name of the Law.\""
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw2089025",
      "warningSpoilers": false,
      "date": "30 June 2009",
      "rate": "10",
      "helpful": "130 out of 149 found this helpful.",
      "title": "Far Ahead Of Its Time And May Always Will Be",
      "content": "M is a monumental film and seriously should be watched by all. For a film like this to be made in 1931 is just shocking. Even if the film was released today it would still be nothing like we have seen before. In our modern age of film making there has been a considerable rise in the production of films about serial killers, their complexities and particularly about pathological ones. Yet, M is the first movie that comes to my mind when I think of the themes that have been in Psycho, Silence of the Lambs, Seven and not to mention countless more.The film is lead by Peter Lorre in a transcending performance who plays the serial killer and rapist in which the film is centered around. In this performance Lorre is successful in something that at the very least is rare to see in any kind of film, compassion for a child killer and rapist. Lorre makes the viewer see, that he is not a criminal by choice but by a sickness of compulsion. Too often then not is our perception of a psychotic killer having that look that puts fear into his or hers victims' eyes. Lorre doesn't do that but rather displays a frightened man, a scared man. One in which his desperation leads to his hazardous behavior. His portrayal of a killer is not of a fearless one but of one consumed by fear. Something that even today we as a people cannot understand, let alone in 1931.The direction and writing of Fritz Lang is beyond comprehensible as he taps into the mind of a serial killer and his complexities. He does so in such that we get an empathetic and compassionate illustration of all sides of the story. This in which by then end of the film all points of view are more then well delivered to the audience. Fritz Lang here, has simply created here a timeless masterpiece. One that excels in its technical aspects and enlightens the audience on a topic that other films still have not yet to match M in.I highly recommend this film for many obvious reasons and conclusions. This film was created by one of the all time great directors in Fritz Lang, Lang's command for the screen is mesmerizing and a joy to witness and so on and so forth. Yet much of this is mostly superficial and a waste of time to continuously state. M, as I mentioned before takes a strong and original stance on an issue that we as a society yet have not fully resolved. This film may not give you THE answer on this issue but it may sway that moral compass of yours that lies inside of all of us."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0008132",
      "warningSpoilers": false,
      "date": "2 May 2003",
      "rate": "8",
      "helpful": "102 out of 128 found this helpful.",
      "title": "German Expressionism at its cinematic best",
      "content": "Being a huge fan of German Expressionist art, I'm naturally drawn to the films of Fritz Lang. I recently was able to see the restored version of \"Metropolis\" on the big screen, and was delighted to see \"M\" on the Sundance channel - especially since it was the uncut version. M follows the trail of a child killer (Peter Lorre), sought both by the police and the members of the underworld whose businesses are being effected by the investigation. This film is ground-breaking for many reasons: It is Fritz Lang's first talking picture, it is one of the first in the serial killer genre and it was overtly anti-Nazi. This film was banned in Germany shortly after it premiered, and Fritz Lang and Peter Lorre, both Jews, soon fled the country. It has superb acting (most notably, Peter Lorre's trial scene in the catacombs) and very stark yet at times gritty cinematography. The story is indeed suspenseful and at times, very creepy (what whistling child killer isn't?). The entire movie, however is extremely thought-provoking and challenging, much like the German Expressionist movement itself. This is not a movie for everyone; some may find it boring, some may find it too abstract. It also has one of the most bizarre shots I've ever seen in film - essentially it's a 30 second shot of the police inspector talking on the phone, but you're under his desk and looking up his pants leg. It actually kind of baffled me and made me chuckle for a second, but it was avant garde if anything.To those who appreciate early cinema that truly makes you think, both about the film and the subtext with which it was written and filmed, it is a must-see. --Shelly"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6076036",
      "warningSpoilers": false,
      "date": "8 September 2020",
      "rate": "9",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Mörder...",
      "content": "Casting its shadow through motion picture history and continuing to do so to this day, suggesting that societies throughout the world have struggled to resolve the most despicable actions of their citizens (inc. those in the police and armed forces) and the penalties they should pay - as seen by the gamut of forfeits that can be incurred for the same crimes across the planet, as well as those that are crimes in some territories and not in others.Ultimately this film asks the question: what makes us who we are, how responsible are we for our actions and what should be done about it and by whom? To this day, as subjective a set of questions as you could wish to ask - but ones we will forever continue to try and answer and cinema will continue to catch in its shadows."
    },
    {
      "username": "jamesrupert2014",
      "userUrl": "https://www.imdb.com/user/ur58781741",
      "reviewLink": "https://www.imdb.com/review/rw4332553",
      "warningSpoilers": false,
      "date": "11 September 2018",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Excellent film from the early days of European cinema",
      "content": "Outstanding German expressionist film from Fritz Lang that follows first the police, then the underworld, as they search for a child killer in Berlin. The cinematography is moody and dramatic as the story moves through the poorer sections of the great city and the acting, while of a more melodramatic style than is currently popular, is very good*. Peter Lorre is outstanding as the killer who taunts the police as the noose slowly tightens around him. To some extent the film is an early 'procedural drama' as the police use (then) modern forensic techniques such as finger printing and graphology to try and find the killer. Tired of the increased police surveillance, the city's criminal element begins their own search, mobilising the numerous beggars to be 'eyes on the street'. The film touches on a number of issues that are as relevant now as in the 1930s including mob mentality (men are accused of being the killer simply for talking to a child), rights of the accused, the 'end justifies the means' use of torture, and the ever thorny issue of mental health and culpability. One of the great pre-WWII German films. *I watched a subtitled version on TCM."
    },
    {
      "username": "WriterDave",
      "userUrl": "https://www.imdb.com/user/ur1069062",
      "reviewLink": "https://www.imdb.com/review/rw1861437",
      "warningSpoilers": true,
      "date": "21 April 2008",
      "rate": "10",
      "helpful": "32 out of 39 found this helpful.",
      "title": "\"L\" Before \"M\"",
      "content": "In an eerie propagandist fashion, the phrase \"in the name of the Law\" is repeated over the last two scenes of Fritz Lang's \"M\" as a child killer is brought to justice. If \"L\" represents the State and the Law, then \"M\" is meant to represent the Individual (who in this case is a Murderer). Lang boldly asked us way back in 1931, whose rights come first: the State or the Individual? A master of his craft, Lang leaves the question open-ended and let's the audience decide.\"M\" is shockingly contemporary in its psychological complexities. It explores the psychology of individualism vs. group think while showcasing how a state of fear can be inflicted upon a populace when a government fails to protect society from a single individual terrorizing the people. The story is fairly straightforward: An elusive citizen begins killing innocent children in a large nameless German city. The media fuels a paranoid frenzy that incites the public. The clueless police begin to raid \"the underworld\" after the populace is turned into a raving mob because of the failure to capture the killer. \"The underworld\" comes to a screeching halt as their business is ruined by the police and starts their own manhunt for the killer.Unlike a modern period piece that attempts to evoke a certain place and time, \"M\" WAS a certain place and time. Lang, in an almost prophetic sense, captured the state of mind of the German people in 1931 as the Weimar Republic was on the brink of collapse and the Nazi Regime was preparing to take over. When individuals live in a state of fear, as they do in \"M\", society collapses and the Individual is crushed. Only the State, it seems, can bring order.\"M\" is a also a masterpiece for its technical aspects. The way in which Lang uses his camera to move through windows, capture shadows, reflections, empty spaces, and shift points-of-view is staggering even by today's standards. He also played with the new technology of recorded sound with extensive voice-over narration and dialogue used to overlap and transition between scenes. Didn't critics recently praise \"Michael Clayton\" for utilizing just such a technique as if it was something revolutionary? One can also see a protean style the would eventually birth the Film Noir movement with the creation of tension and suspense in the use of shadows and camera angles.Yet \"M\" is not perfect. It has some major flaws. There are no real \"characters\" in the film to speak of in the modern sense. The film is virtually all built around mood and plot. The only time Lang invites us to emotionally connect is in the opening and closing scenes with a mother of one of the victims, and in the classic scene of Peter Lorre giving his writhing and primal \"I can't help it!\" speech in front of the kangaroo court of criminals. The mother's grief and Lorre's madness are presented so sparsely and in such a raw form that it becomes too painful to want to connect with them. Another flaw that is often overstated about films from this time period is the slow pace of the early police procedural scenes. These inherent flaws combined with the inherent brilliance of Lang's vision make \"M\" one of the most challenging films a modern viewer could ever sit through.What impressed me most about \"M\" was the subtlety of the symbolism Lang created with his haunting images. As harrowing as the story is, none of the gruesomeness is shown on screen. It's all transmitted to the viewer through the power of suggestion. Is it any wonder Hitler wanted Fritz Lang for his propaganda machine, which thankfully led to Lang fleeing to America? I'll never forget the wide shots of the kangaroo court (and the looks on those people's faces as the killer is brought down the steps for trial) or the vast expanse of that empty warehouse. The scene of the ball rolling in the grass with no one to catch it, the balloon caught in the telephone wires, and the empty domestic spaces the mother has to inhabit after her child has been murdered are the types of scenes that tape into Jungian archetypes and shared fears. The look on Lorre's face as he confesses, the hand of the Law coming down to save Lorre from being lynched, and the ghastly plea from the mother in the final scene will stick with me for the rest of my life. \"M\" is a communal nightmare; one that from which we have yet to awake."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw2201008",
      "warningSpoilers": false,
      "date": "2 February 2010",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "The Ultimate Crime Drama, Years Before The Genre Took Off",
      "content": "A serial killer who favors children (Peter Lorre) is on the loose in Berlin. He is wanted by the police. But, even worse for him, he is wanted by the Berlin underworld, who have been targeted falsely by the police for being involved. Watch out, child killer! There is nothing bad I can say about this film. The acting, the directing, the sound... all perfect. Many have praised Lang for his use of sound at a time when the practice was just coming into play. And rightfully so. Whereas other films have sound matching what is on the screen, Lang realized he could use the effect to signify what he was not showing, including the murderer (who has a distinctive whistle). Brilliant. Not to mention that one key role is a blind beggar... a man who cannot appreciate visuals, but only sounds... he is appropriately the man who can identify the killer! Basing the story loosely off of child-murderers of the day (Grossman, Haarman and Peter Kürten) this is one of the darkest tales set to film up to this point. There is no blood, and no children are actually seen killed. And the killer is relatively reserved compared to his real-life counterparts, who were also rapists and cannibals. He presents an interesting defense: his crimes are less wrong than the crimes of others because he cannot psychologically control himself. Or, in modern terms, not guilty by reason of mental defect. Is a child killer less evil than a pickpocket? Is he in some way also a victim?I enjoyed the idea of a unionized underworld. I do not know the reality of this, as it seemed sort of comic and anticipated such villainous team-ups as we might see in comic books. But crime was certainly not unheard of, and even \"black market meat\" existed... and I am not sure if I really want to know what that means.Many, including reviewer Stanley Kauffmann, have noticed the similarity between \"M\" and Bertolt Brecht's \"Threepenny Opera\". Sadly, I have not seen Brecht's work and cannot comment on the comparison. German philosopher Theodor Lessing, best known for his work on Jewish self-hatred, may even have been an inspiration, due to his work on Haarmann. But regardless of inspiration, Lang is the master here... his work stands the test of time and today, almost a century later, is widely recognized as one of the greatest achievements on film. At the least, many consider it the all-time greatest German film. And rightfully so.There are so many great shots, including the so-called \"inventory\" shot of the criminal underworld's wares. Lang also excelled with the camera angles, using knives as frames and getting more than one great mirror shot. (I should also give credit to cinematographer Fritz Arno Wagner, who previously worked on \"Nosferatu\" and many others -- his reputation should be second only to Karl Freund.)There is nothing that beats the Criterion release with commentary, short films and more. I watched the film this way on DVD. Perhaps a Blu-ray release has even more, but I would not even know what could be added. This disc is packed and a must-own for any film historian or Lang fan."
    },
    {
      "username": "davidcarniglia",
      "userUrl": "https://www.imdb.com/user/ur79835376",
      "reviewLink": "https://www.imdb.com/review/rw4507374",
      "warningSpoilers": true,
      "date": "12 December 2018",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Thoroughly Creepy, Thoughtfully Done",
      "content": "Like many great movies, M has a simple plot. It's the cinematography, acting, and screenplay that make such an intense drama. There's multiple levels to explore as well. Clearly, a psychological theme is drawn. Then, there's a political aspect; the waning of the Weimar Republic must have been a palpable experience of doom for plenty of Germans. Also, there's the theme of alienation; and, relatedly, the role of criminal underworld.It's fascinating that the search for the child-murder operates in a parallel fashion: obviously, by the legitimate authorities and, for reasons of self-interest, the criminal organizations as well. Sometimes it's hard to tell which side someone's on. When the underworld guys infiltrate M's hideout, one is in police uniform; a sensible ruse. But most of the 'criminals' are actually just deputized street people, some are actually the victims' families. The police haven't been asleep, though, as they're able, by good deductive methods, to find out who M is, and where he lives.The police procedure is very logical and comprehensive. I had no idea that fingerprint analysis was so sophisticated in the early '30s. Another detail: when the watchman breaks loose to ring the alarm, the police not only know what address to go to, but which exact spot in the building. But M captures much more than these flashes of urban technology. So many scenes just vibrate with atmosphere: not just the noir-ish use of light and shadow, but the juxtaposition of objects, both in disarray (the attic store room where M. Hides) and in arrangements (the toy store windows, the display of confiscated weapons).There's even whimsical stuff--the toys again, and the balloons of animal-figures. In fact, there's an undercurrent of humor. The safe-at-home watchman having a feast as the Inspector accuses the suspect of being an accomplice in the watchman's 'murder'; and, shortly thereafter, the Inspector dropping his cigar as the suspect lets on the real reason for breaking into the office building. Many of the seamy characters aren't so much creepy as obnoxious, nervy, and just plain eccentric. All of this flipping between seriousness and silliness remarkably doesn't create a tone problem.Because of the overall strangeness of reality shown here, it's fitting that there's so many odd details; which, nonetheless, don't obscure the big picture. For example, we don't have to see M committing his disgusting crimes to feel their impact. Not only does this spare us what could only be lurid scenes, but it also saves space for more exposition. Having said that, the movie does drag at times. The time spent hunting for M in the office building is a bit much; likewise the kangaroo court scene. I did like the inquisitorial, thoroughly menacing feel of the 'court' proceedings. I don't think that Lang was implying that M deserved leniency by giving him his eloquent 'defense' speech.It's the primacy of the rule of law that seems to be the message. In fact, although the police intervention came just barely in time, M does end up in the hands of legitimate authority. Watching the audience brood over M's actions in the basement, we can see some hints of recognition when M speaks of his sense of alienation. That these same folks still want to lynch him doesn't obviate the fact that most of them live outside of society's rules as well. M's fate kind of reminds me of the arguments in many early sci-fi movies between those few who want to 'understand' the alien/monster, and the majority, who just want to kill it. Usually, the sensitive guys wind up as the next victims.Definitely M is a monster. It's worth discussing what his fate should be; but the main problem is resolved here--he's out of the way. Maybe the point is that, even in an unsteady world, there's still normal civilization bobbing up out of the chaos. 9/10."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw4271519",
      "warningSpoilers": false,
      "date": "6 August 2018",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "M or the Mark of a Disillusioned Genius...",
      "content": "M like Manichean? What can you say of a plot driven by criminals and where good people are rather inefficient for the most part and where the most despicable character earns our own sympathy. This is a movie using such stark black-and-white contrasts, noir in its soul and gray in its core.M like Mob Mentality? Fritz Lang personal \"J'accuse\" against a system where accusers aren't all innocent.M like Maturity? The film also consecrates German Expressionism as a peak of creativity and social relevance, a sequence in history where Berlin became, literally, the best area and arena of expression to an art that had reached its maturity.Or M like Mörder, murderer in German, Maudit in French (doomed) and Masterpiece in the universal language of cinema.M like Menace (and Music).Children are singing an elimination game of ominous undertones, later we see little Elsie playing with the balloon, a shadowy silhouette appears, the face remains unrevealed while we hear the whistling of \"In the Hall of Mountain King\". Before the 'shark' theme in \"Jaws\" to the \"Psycho\" shrieking violins, the \"Peer Gynt\" tune became the first notable leitmotif meant to suggest an evil presence, the perfect device to put us in the victims' standpoint for the first act, as powerlessly as the poor mother calling Elsie while her balloon (the bait used by Hans Beckert) is drifting along the telephone wires.The effects are then shown through the growing fame of the new 'Jack the Ripper' figure, the ensuing paranoia with any adult basically talking to a child is assaulted. The killer is a menace to an already crisis-stricken society, forcing the police department to triple the efforts: psychiatric cases are explored, handwriting analyzed and daily and nightly raids operated to make further pressure on the criminal world.M for Methodic. For its second act, \"M\" is the seminal police procedural.While covering that angle with a documentary-like precision, Lang still seems dubious about the police's efficiency and provides an interesting twist by paralleling the work of the law with the outlaws'. In a long sequence where both sides brainstorm about the methods to use to find him, we swing back and forth from one world to another and the only indicator of the side of the law we're put in is the presence of uniform, last time I saw criminals acting like politicians in a masterpiece, it was in \"The Godfather\". One even points out insightfully that the killer must be a bourgeois, because it's the very standard of life that provides the level of idleness driving any easily corruptible mind to the most extreme corners.M like the sign on the shoulder.So in a famous sequence, criminals, helped by the street beggars find Hans Beckert quicker than the police force, he was betrayed by his trademark whistling and (irony) a little girl who noticed the infamous letter marked on his shoulder. The following chase takes maybe too much time for the film's own good. Not saying the film could do without the struggle to catch him but the court is such a high point of cinema's history that the previous part seems more forgettable.And Peter Lorre with his round face, innocent eyes when he's cornered like a rat and utters his memorable speech, gives the performance of a lifetime, as a living symptom, a man incarnating the sickness of a society where bad people toy with justice and the worst of all acts as childishly as his victims, claiming innocence with such rabid eloquence he's almost convincing.Beckert says he can't control his impulses, a little voice urges him to commit the irreparable acts and his body language is simply gut-wrenching when he simply can't put \"words\". His 'lawyer' makes a good point about the past of some accusers, whose Becket call hypocrites because they could choose to be honest, but the accusers retort that whether he's responsible or not, he's still a menace. Sure, whether their reasons are selfish or ethical is debatable but can we empathize with Beckert?M like Modernity.Looking at Twitter or Youtube or Facebook comments today, you can tell there's something ferocious and still on-going about mob mentality and a film like \"M\" could be deemed as feeble and liberal in the way it provides a tribune to a child molester, the worst possible crime.M like Multilayered.Yet there are some powerful truths hiding underneath the thriller, the truth about a society sick of its own contradictions, determined to impose standards of morality (white) and condemning true crimes (black) but indulgent toward activities that have no worse repercussion. That the film ends with black-clad mothers admitting their own responsibility is perhaps the most optimistic thing about \"M\", the sentence doesn't matter, what matters is the lesson behind... but did German learn the lesson?Ironically, one could have seen the rise of the Nazi empire as the antidote, like Thea Von Sarbou who wrote the film and worked for the Nazi regime, other could also see it as its worst possible consecration like director Fritz Lang. That he didn't side with the criminals at the end emphasizes an intuitive comprehension of his world and allowed this film to be hailed as a true, intelligent, nightmarish and alas, premonitory masterpiece.. with M as the mark of a disillusioned genius.M like Meditative? Mysterious? Mantic?Interestingly, the French title is \"M le Maudit\", meaning the doomed one, as if Beckert was the living incarnation of a doomed society, as if there was indeed something rotten in the Weimar Republic and It wouldn't get any better after but could Fritz Lang anticipate it? Looking up his second masterpiece \"M\", I was wondering whether Lang reflected his own rejection of German society or cared enough to warn the audience against the impending doom of decadence.Surely, the director behind \"Metropolis\" could only pinpoint with the accuracy of a soothsayer the limits of a civilization that might take its heritage for granted."
    },
    {
      "username": "CinemaClown",
      "userUrl": "https://www.imdb.com/user/ur20018357",
      "reviewLink": "https://www.imdb.com/review/rw2847626",
      "warningSpoilers": false,
      "date": "9 August 2013",
      "rate": "",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Fritz Lang's Finest Film",
      "content": "An expertly written & masterfully executed example of genre-filmmaking that was far ahead of its time back when it was released and which even today is counted amongst the greatest & most influential works of world cinema, Fritz Lang's M is an intriguing character study that paints an interesting portrait of a serial killer & is a biting criticism of a negligent society as well.The story of M concerns a serial killer who preys on children & presents an underworld society whose usual business is disrupted due to the everyday raids carried out by the police to apprehend the killer-on-loose. Driven by police's continued failure & increasing losses in their business, the criminal bosses ultimately decide to take matters in their own hands & try to capture the killer all by themselves.Directed by Fritz Lang, this is the film that the esteemed director called his finest & it's not really difficult to see why. The screenplay & direction brims with creativity, the suspense is wonderfully created & utilized, black-n-white photography is crisp & inventive, editing never lets the story settle down, score & sound effects work in seamless harmony, and Peter Lorre steals the show with a highly compelling performance.On an overall scale, M is a cinematic treasure that has innovation written all over it. Whether it's the narrative style, leitmotifs, camera angles, sound mixing, symbolism or expressions, the contribution this German classic has made in the world of filmmaking is groundbreaking. A thought-provoking & well-researched study into the mind of a disturbed character, M is a strong meditation on the morals of right & wrong, that has a lot to say about our very own society.Thoroughly recommended."
    },
    {
      "username": "TheNabOwnzz",
      "userUrl": "https://www.imdb.com/user/ur49216376",
      "reviewLink": "https://www.imdb.com/review/rw4144413",
      "warningSpoilers": false,
      "date": "27 April 2018",
      "rate": "8",
      "helpful": "17 out of 19 found this helpful.",
      "title": "A masterful take on compulsive immorality",
      "content": "M has to be one of the most influential movies ever made, both technically and psychologically. With an outstanding Peter Lorre, suspense that outsuspenses Hitchcock, excellent cinematography and a deep sociological layer added to it, M is one of the masterpieces of the psychological thriller genre.It is a film devoid of typical humanitarian propaganda, yet it is not the case that we immediately feel the need to relate to the child murderer Hans Beckert ( Peter Lorre ) since Fritz Lang also shows us the effects his gruesome crimes have in the form of the police constantly raiding establishments, the grieving parents & random people accusing eachother of the murders. It is not a movie that forces its opinion on you, but causes you to think about what is truly right and wrong. Hans later claims he cannot help himself because he has an irresistible compulsive urge to kill which cannot be stopped, much to the dismay of other career crooks who claim they only commit crimes to survive and take no pleasure or feel no compulsion towards it. It is a psychological kind of movie that is still as relevant as ever today as it was in 1931.Peter Lorre is ofcourse the perfect fit for the psychopathic child murderer, he has the perfect innocent wide eyed look for a psychopath, who seems to even be likeable when he is not murdering children. His signature whistle by Edvard Grieg - In the Hall of the Mountain King is a nice creepy addition to his character which he uses to lure kids to their doom. Ofcourse the incredible shot at the start which focuses on Hans's shadow on the poster that lists his crimes and reward for capture while talking to a little girl before killing her is a great ironic symbolism to announce his character.It was Lang's first sound picture, yet only two third of the movie was shot with actual sound while everything else was shot silent. This was primarily to keep the costs down since sound equipment was very expensive at the time. It creates a weird mix in constant transitioning from silent to sound. Yet as Lang has stated it adds another layer to the eeriness the movie has, so it only enhances the experience instead of unimmersing you out of the film. The cinematography is revolutionary in its use of low key lightning, which is a technique that was used many times after in the classic Film Noir era in Hollywood. The result is many Film Noirs share a visual resemblance with M due to their dark tone. Not only visually, but psychologically many themes of M have been repeated throughout the years in cinema. It was one of the first instances of a semi-sympathetic look on a pure psychopathic murderer, which has been repeated countless times in later years.Some might feel sorry for Beckert for having this affliction of which he cannot be helped while others would prefer to see him hang, the movie doesn't shove the right answer down our throats, and it's possible to look at it from either way without having a right answer. It is a sociological thinking man's picture that is as relevant now as it ever was."
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw2072477",
      "warningSpoilers": false,
      "date": "27 May 2009",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "\"This won't bring back our children\"",
      "content": "While many of the problems of early sound pictures lampooned in Singin' in the Rain were more or less myths, the early talkies did present a big challenge for filmmakers everywhere. Europe however was at an advantage over Hollywood because even though it took them a few years to gain the same access to sound technology, films from the US would be screened abroad only six months or so after their first domestic release. Thus directors like Fritz Lang were able to witness Hollywood's first faltering steps with sound before giving it a go themselves.It's funny how sceptics dismissed sound as a gimmick, because the best early uses of sound were those that treated it as exactly that – a gimmick. Lang demonstrates in M that a talkie need not be an entirely new kind of motion picture; sound is merely another layer of technique. Rather than getting bogged down in lengthy dialogue scenes, Lang keeps his storytelling primarily visual, and when he needs lots of expository dialogue he intercuts multiple scenes to keep the pace going. This is not to say Lang is trying to ignore sound – in fact he uses it to enhance the picture, sometimes having dialogue or other noises take place off-screen to focus us on reactions or cause-and-effect. Other times he ironically uses completely silence (something of course you never get with \"silent\" pictures due to the continuous musical score) giving a dreadful sense of eeriness.And thankfully, the best elements of Lang's method have survived the talkie revolution. His visual style is particularly effective here in provoking a chilling, disturbing atmosphere. Shot compositions with large blank areas give a sense of surreal starkness. Characters often stare intensely straight at the camera, aggressively drawing the audience into the film's world. Several times we are even dumped straight into the point-of-view of the killer himself. The fragmented narrative with its lack of lead characters and impersonal, point-by-point plotting could easily be boring, but Lang holds our interest by keeping a dynamic sense of rhythm and telling the bulk of the tale through pure wordless imagery. Lang's German pictures, in common with typical German cinema of the time, feature highly melodramatic acting and exaggerated, almost comical characters. These figures generally suited the fantasies and comic-book stories of Lang's silent days, but I'm not sure they sit so well with the close-to-home setting of M. Still, these characters are somewhat more effective now that they have voices, probably because most German screen actors of the day were from a stage background. Peter Lorre was a shameless ham, but that's what you need to play a psychopath, and in any case he's a lot better here than in many of his Hollywood roles. Otto Wernicke is also incredibly entertaining in the role of Inspector Karl \"Fatty\" Lohmann; again a stagy exaggeration but with some absolutely wonderful gestures and comic timing.There isn't a lot else I can say about M – it is one of those pictures that has been analysed to death – although I doubt any comment other than mine mentions Singin' in the Rain in the opening line :). While not quite Lang's best picture, I can think of few directors who made such a smooth transition from silents to talkies, and sadly this was his penultimate German picture before the Nazis took over. There's no denying that Lang was wasted in Hollywood. He did his best to understand it, but by and large it never understood him. I say by and large; the renowned Irving Thalberg was reportedly bowled over by M, and screened it to many of his writers and directors as inspirational material. Had that prestigious and influential producer not died in 1936, the same year Lang began working in Hollywood, would things have turned out differently, I wonder?"
    },
    {
      "username": "charchuk",
      "userUrl": "https://www.imdb.com/user/ur1745168",
      "reviewLink": "https://www.imdb.com/review/rw1750567",
      "warningSpoilers": false,
      "date": "21 October 2007",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The first sound masterpiece",
      "content": "Probably the first sound masterpiece. Though it's one of the first to use the new technology, it doesn't feel like it, as the camera is fluid and expressive and the sound effects are utilized perfectly and are even essential to the story. Lang's direction is superb, amping up the suspense and terror by using the cinematography, lighting, and sound together to create a very tense and distinctive atmosphere. Peter Lorre is fantastic in what is really the lead role of the film, making us feel sympathy and pity for a horrific child-murderer. The combination of German expressionism, film-noir tendencies, and social commentary that Lang injects into the film makes for a brilliant and gripping work. Simply a terrific film all-around."
    },
    {
      "username": "elvircorhodzic",
      "userUrl": "https://www.imdb.com/user/ur65733095",
      "reviewLink": "https://www.imdb.com/review/rw3438115",
      "warningSpoilers": false,
      "date": "25 March 2016",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "The birth of a psychological thriller!",
      "content": "M\" is primarily a bold and controversial piece of work. Lang's first sound film. Directed us to the beginning of the game offers shade and excellent cinematography. The atmosphere is gloomy and tense. The case of child killer is thematically processed. The focus of the story is not a serial killer but on how his murder affect people.All that is unacceptable and incomprehensible leads to division among the people. The essence of terrible things, such as the murder of children, people understand in different ways. Given the panic that is certainly present in this film, chaos reigned. The killer must locate and catch. In the story dominate two segments. On the one hand we see a strong power law in its infinite analysis of the psychological profile of the killer, organizing raids and executing them, clinging to straws, all under public pressure and an uneasy feeling of general panic. On the other hand, the underground has its problems. Because of frequent raids and increased the number of police officers on the street, suffering job. Then the key decisions are made: the criminals themselves will catch the killer. The way the underworld decided to end the hunt was my genius. How to find and trace the man, and without this it noticed? How can I be invisible in the street? Everybody?\"M\" is quite realistic movie and in many situations it can be replicated in our everyday lives shaken the social and economic crisis. Understandably, panic, fear and general mood affect each individual, but it is fascinating how the individual devices judge, jury and executioner. A mass hysteria not to speak.Peter Lorre is M\" His performance deserves praise and admiration. Lorre before mobs straw, pray, but not for mercy, but to understand. Understanding? The expression on his face leaves the deepest impression.Acting follows the dark tone of the film. The atmosphere is excellent and followed by darkness, dirt, whores, bums and ugly people ... a lot of bad people.People are in uncontrolled situations corrupted. Most of us are trying to see the best in people. It is true that a large number of people conceals an eerie hatred that people often degrades in large social activities. Lang is a true master. He made a great movie. I will not have to engage in in-depth analysis.Below is a simplified message: Think only for themselves, but never head of the mob and keep an eye on children.\" Paradoxically. I know. \"M\" is an excellent thriller and police essay."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0008126",
      "warningSpoilers": false,
      "date": "25 March 2003",
      "rate": "",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Grade A.",
      "content": "A vastly interesting and somewhat disturbing German production from 1931 that stars a very young Peter Lorre as a psychopath who goes around the city trying to find children to murder. Naturally the entire community gets in a raged uproar as no one has any clues as to who is committing these grisly crimes. The police, fearful of more murders, hire more officers and the streets become patrolled at all times. Now the crime syndicates have their hands tied as their shady dealings cannot go down due to the watchful eyes of the cops. Disenchanted with the authorities, many citizens begin to take matters into their own hands in the hopes of finding the culprit themselves. A dark underworld of dangerous criminals and hysterical civilians then join forces in the hopes of ending the murderer's life forever. \"M\" is one of those productions that is engrossing from the very start due to its realism and its frightening tone. Director Fritz Lang makes the film work by creating a landscape that shows all people that are directly and indirectly affected by Lorre's sick actions. Lorre though does come off at times as a strangely sympathetic character as it is made quite clear that he has an addiction to killing that he cannot deny. He is actually a mental case, but everyone else does not seem to care. Germany was about to foresee many changes shortly after 1931 and it seems very apparent in \"M\". The crazed control that cops and underworld syndicates have on typical citizens is an intriguing premise explored here. Of course Hitler's Nazis would use similar strong-armed tactics and strange forms of propaganda to gain support within their own country by the mid-1930s. Thus \"M\" feels like a frightening foreshadower of things to come. The film has aged pretty well, but I did feel like most of the characters were not as deep as they could have been. I also had a problem with a solemn ending that just did not really go well with the rest of the film. With all that said, I still think \"M\" is a genuinely super achievement. 4.5 out of 5 stars."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2423023",
      "warningSpoilers": false,
      "date": "2 May 2011",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Unforgettable masterpiece",
      "content": "Fritz Lang was a fine director with an artistic vision that is just genius. This is seen perfectly in pretty much all of his resume, especially in Metropolis and this unforgettable masterpiece, M. The film has a great story that unfolds without feeling too fast or too slow in development with a theme that is still relevant today, and to this day I never thought I would see a film that would make me think that the music of Grieg(Peer Gynt being the murderer's motif in a form of a truly chilling whistle) was scary.When it comes to sound and visuals, M is a triumph. The images expressionistic in their look and tone are incredibly atmospheric including in the brilliantly crafted opening sequence, and the sound is very inspired, yes even in the small details like Lorre clicking open his knife. The script is accomplished and intelligent, Lang's direction is superb and the characters intrigue not just Lorre's very chilling murderer but also Inspector Lohman. While there is a fair bit of suspense and chills, the final shot actually quite touched me in a way.The acting is excellent. While the support playing of the likes of Otto Klemike hits the nail on the head, it is the performance of Peter Lorre that lives long into the memory. Here he parodies the sinister snivelling that often makes him so compelling to watch and while he is very menacing there are times as you delve deeper into his character where you feel pity for him. All in all, an unforgettable masterpiece. 10/10 Bethany Cox"
    },
    {
      "username": "Eumenides_0",
      "userUrl": "https://www.imdb.com/user/ur4061961",
      "reviewLink": "https://www.imdb.com/review/rw2212861",
      "warningSpoilers": true,
      "date": "25 February 2010",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "A Lesson in Film History",
      "content": "Watching Fritz Lang's M is watching the history of cinema unfold before one's eyes. Made in the transition period between the silent and sound film, this 1931 masterpiece remains fascinating for several reasons.First of all, the use of sound is impeccable. Suffice to say the killer in the movie is caught is through identifying his trademark whistling. But the use of voice-over narration was also new at the time and is used here very well: first when a mother calls, in panic, for her missing child, and her name echoes across several empty walls. Next in a scene in which two detectives elaborate on what they've done to apprehend the killer and everything they say is matched by an image.Secondly, few times has a serial killer been treated with such complexity, compassion and straightforwardness in cinema. Peter Lorre plays a child murder, a man who acts by impulse, possibly a schizophrenic. He simultaneously evokes horror and pity, and he's too distant from the super-cool and erudite serial killers of today. Lorre plays one Hans Beckert, a lonely man with a history of mental illness, an ordinary man without any qualities or amazing traits.Thirdly, it's a powerful meditation on vigilantism and crime. The police is unable to capture the killer, so Berlin's underground decides to capture the criminal. The police raids are putting them out of business and they resent the fact that a child killer is being sought amidst their ranks. The absurdity of bank robbers and card cheaters with a sense of morals is not lost on the filmmakers. In a mock-trial at the end, these same criminals think they have the authority to sentence the child murder to death. But as he tells them, if they wanted, if they got jobs and worked honestly, they could leave their lives of crime; a man who's ordered by voices to kill can't just turn off him impulses.But above all, M is a fascinating, exciting thriller. It's an intelligent crime story, that shows police and criminals working on different sides and with different means to achieve the same purpose. If one can laugh at the idea of a criminal union (realism should never be a criterion for judging art), one can't laugh at the policemen in this movie. Inspector Lohmann, played by Otto Wernicke, is one of most intelligent detectives ever to grace cinema. He's fat, he's cranky, he's an unlikely hero, but he's shrewd, he can read a person's personality at a glance, he's patient. Lang must have liked him too because he used the character (and actor) in his following crime epic, The Testament of Dr. Mabuse, in which Lohmann shows even greater skills.I knew (or at least highly expected) that M would be an amazing movie. But I didn't imagine a 80-year-old movie would hold up so well in terms of cinematography, sound, pacing, acting, structure. Few movies achieve such a synthesis of qualities. There is no doubt on my mind that M deserves the recognition it continues to receive from film historians."
    },
    {
      "username": "Quicksand",
      "userUrl": "https://www.imdb.com/user/ur0265837",
      "reviewLink": "https://www.imdb.com/review/rw0008102",
      "warningSpoilers": false,
      "date": "3 November 2001",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Timeless.",
      "content": "As riveting as it is intellectually demanding. And that's just by 2001 standards-- Fritz Lang directed this film, his first with sound-- in 1931, when hardly anyone knew how to integrate dialogue into a previously silent art form, and in the midst of the Nazi uprising at the same time.The plot is taught and tense, waiting to find out what's going to happen next, or which side is going to make the next move. Moreso when you realize that Lang was the first ever to do this-- previous IMDB comments such as \"we've seen this all before\" show ignorance, because in 1931, NO ONE had seen this before. No one had DONE this before.The Nazi regime wanted to ban this film because they suspected-- correctly-- that the film was talking about them. Seventy years later, its questions of good vs. evil are still equally as relevant, or else you weren't paying attention.Grieg's \"In the Hall of the Mountain King\" has never been more powerful."
    },
    {
      "username": "Caliban-6",
      "userUrl": "https://www.imdb.com/user/ur0146060",
      "reviewLink": "https://www.imdb.com/review/rw0008108",
      "warningSpoilers": false,
      "date": "4 January 1999",
      "rate": "10",
      "helpful": "184 out of 226 found this helpful.",
      "title": "60 years old, and still uber-suspenseful",
      "content": "The opening scene of this movie is the first clue to its near perfection  A mother preparing dinner for her child, waiting anxiously for her to return from school. Her hope, and then distress as she hears people pass outside her door. While down in the streets of Berlin, her daughter is receiving a balloon from a strange man in a long black coat. We know what's going to happen, but it's still horrific to watch.Fritz Lang, you cinematic god! A simple story of the underworld, the police, and a single man holding an entire city hostage, and done with such precision and pre-noir darkness that is oozes creepy suspense from beginning to end.But this movie is not so simple as the police inspectors trying to catch a devious murderer  it's about the mob, employing its network of beggars and petty thieves also trying to bring the killer to their own brand of justice. Apparently, the police crackdown caused by the murders is bad for business  so the mob begins to track him down as well.It's not only a great crime story, and perhaps the first physiological thriller (the murderer is schizophrenic) but there's comments to be made here about the nature of justice, and who should best dispense it.In all, not only a trail-blazing classic, but THE trail-blazing classic."
    },
    {
      "username": "meathookcinema",
      "userUrl": "https://www.imdb.com/user/ur81729148",
      "reviewLink": "https://www.imdb.com/review/rw3847098",
      "warningSpoilers": false,
      "date": "1 November 2017",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "As relevant today as when it was made",
      "content": "This film works on many different levels.Firstly, its a cracking horror film/thriller about a child murderer on the loose in the Berlin of 1931. Lang's use of framing and lighting is a revelation and would prove highly influential in the wider medium of film. The film is also an amazing snapshot of Germany at the time, post World War I. A broken down society that is in need of repair with its people looking to different authority figures for a solution.Finally, the film has many things to say about crime and punishment. But it also has a lot to say about justice. The killers crimes are abhorrent but there are no crimes that don't warrant a fair trial. When the baying crowd with murder on its mind needs to satify its bloodlust, will it just be those who are guilty that are next in their sights? This film was made when the Nazi Party were starting to rise in popularity. Which makes this film even braver and brilliant.An audacious, daring piece of art."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3637572",
      "warningSpoilers": false,
      "date": "10 February 2017",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "M for Masterpiece",
      "content": "Someone is murdering children in a German town. The police are doing all they can to solve the case but, after several months, several murders and exhausting work, still have no clues. Their methods of trying to find the murderer start to adversely affect the local criminal community. Due to this, the local organised crime syndicate takes it upon themselves to find the murderer and mete out punishment...Powerful, provocative, thought-provoking masterpiece from famed director Fritz Lang. For the most part this is a clever, gritty, tense, film noir-like (as it predates film noir, strictly speaking) crime/mystery drama. Shows how the police go about their work and how often nothing positive happens for months, and then the smallest thing breaks the case wide open. The criminals' methods in finding the murderer are also very interesting, and realistic.Lang maintains the suspense and mystery well, only revealing the murderer in the last few scenes and even then you're not sure they have the right guy.The last few scenes add a level of profundity and debate to the proceedings. We are forced to think about justice, especially vigilante justice, and the concept of of an eye for an eye. This can be quite jarring, as you may feel that Lang is steering you down one way of thinking and even wants you to feel sympathy for the murderer. However, ultimately, while justice was served, he does leave the verdict open to a degree, leaving you to fill in your own outcome. Moreover, the ultimate feeling was a balanced, objective discussion was had.Superb performance by Peter Lorre as the murderer. He only has a few scenes but is fantastic in them. Good work too by Otto Wernicke as the police inspector."
    }
  ],
  "errorMessage": ""
}