{
  "imDbId": "tt0993846",
  "title": "The Wolf of Wall Street",
  "fullTitle": "The Wolf of Wall Street (2013)",
  "type": "Movie",
  "year": "2013",
  "items": [
    {
      "publisher": "Total Film",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "A touch too long, yet never slack, at three hours, TWOWS benefits from independent funding, Scorsese’s brass balls and an A-grade cast’s turbulent improvisations to emerge as an epic, boldly broad screwball comedy about the state of America, then and now."
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "",
      "rate": "100",
      "content": "As hot and wet as freshly butchered meat: every second, every frame of its three-hour running time is virile with a lifetime’s accumulated genius."
    },
    {
      "publisher": "The Playlist",
      "author": "Rodrigo Perez",
      "link": "",
      "rate": "83",
      "content": "As an sensory experience, 'WOWS' is mostly a terrifically visceral one, a full throttle fast and furious bacchanalia of drug-fueled madness. But as a scathing indictment of American rapacity, it isn't particularly deep or resonant beyond the exterior."
    },
    {
      "publisher": "Variety",
      "author": "Scott Foundas",
      "link": "https://variety.com/2013/film/reviews/film-review-the-wolf-of-wall-street-1200940974/",
      "rate": "80",
      "content": "A big, unruly bacchanal of a movie that huffs and puffs and nearly blows its own house down, but holds together by sheer virtue of its furious filmmaking energy and a Leonardo DiCaprio star turn so electric it could wake the dead."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/wolf-wall-street-film-review-665394/",
      "rate": "80",
      "content": "Nearly as extravagant as the characters it depicts, Martin Scorsese's comic, operatically-scaled film is, on a moment-by-moment basis, often madly entertaining due to its live-wire energy, exuberant performances and the irresistible appeal of watching naughty boys doing very naughty things."
    },
    {
      "publisher": "The Guardian",
      "author": "Xan Brooks",
      "link": "https://www.theguardian.com/film/2013/dec/17/the-wolf-of-wall-street-first-look-review",
      "rate": "80",
      "content": "The Wolf of Wall Street, for all its abundant appeal, is no Greek tragedy. It lacks the wildness of Taxi Driver, the jeopardy of GoodFellas and the anguish of Raging Bull. Far better to view this as a stylistic homage, a remastered greatest hits compilation, an amiable bit of self-infringement."
    },
    {
      "publisher": "Time Out London",
      "author": "Tom Huddleston",
      "link": "",
      "rate": "80",
      "content": "Scorsese never digs too deeply under the skin of these reprehensible playboy douchebags, and there are times where the swooping photography, smash-and-grab editing and toe-tapping soundtrack conspire to almost – almost – make us like them. But when the film’s cylinders are firing, it’s impossible not to be dragged along."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/2013/12/review-with-sex-and-drugs-galore-the-wolf-of-wall-street-is-martin-scorseses-craziest-movie-32079/",
      "rate": "75",
      "content": "There's no question about the efficacy of Scorsese's filmmaking prowess, only that he never knows -- or doesn't care -- to slow down and deepen the material."
    },
    {
      "publisher": "Slant Magazine",
      "author": "",
      "link": "",
      "rate": "50",
      "content": "Martin Scorsese's keyed-up, irreverent tone frequently fails to distinguish itself from the grunting arias sung by the oily paragons of commerce his film evidently intended to deflate."
    },
    {
      "publisher": "New York Post",
      "author": "Lou Lumenick",
      "link": "https://nypost.com/2013/12/17/wolf-of-wall-street-a-dubious-investment-of-your-time/",
      "rate": "38",
      "content": "If you’re going to invest three hours watching a movie about a convicted stock swindler, it needs to be a whole lot more compelling than Martin Scorsese’s handsome, sporadically amusing and admittedly never boring — but also bloated, redundant, vulgar, shapeless and pointless — Wolf of Wall Street."
    }
  ],
  "errorMessage": ""
}