{
  "imDbId": "tt0993846",
  "title": "The Wolf of Wall Street",
  "fullTitle": "The Wolf of Wall Street (2013)",
  "type": "Movie",
  "year": "2013",
  "items": [
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw2943582",
      "warningSpoilers": false,
      "date": "17 January 2014",
      "rate": "",
      "helpful": "233 out of 324 found this helpful.",
      "title": "High energy and wonderfully excessive as it delivers an engaging true story, but the lack of morality anywhere was a limiting factor",
      "content": "This film arrived in the UK with awards and Oscar nominations all around it, adding an expectation which it really didn't need adding since even without any of that it is ultimately a Scorsese film with a big name cast. It also arrives with some other stuff because the film has been criticized for near glamorization of the excesses that Belfort was able to experience with his ill-gotten funds and, to be honest, it is an impression that isn't helped when you consider that this film was put forward to the Golden Globes in the Musical/Comedy section. Now I am sure that was a political move by the studio, but it does say something about the film because indeed for most of it we have stuff so unbelievable and so excessive that it is hard not to laugh at it. It is hard not to enjoy it.And this is a problem, because the first 2 hours and a bit of this film is really engaging and enchanting in how much of a rush it gives you, how enticing it is and just how much vibrant energy it all has. The viewer is swept along and I guess to a point this is the film doing its job well because not only are we being told a story but we are first hand seeing how easy it is to get caught up in the grab for success, for money, for status. In this regard the film works really well because throughout the film I really was glad to be part of it and wanted it for myself; I don't think the film goes out of its way to glamorize this excess and this life, but for sure it doesn't do much to balance it – and this really is my problem with the film.The structure, subjects and delivery of this film is so inherently similar to Goodfellas that it is hard not to mention it. If you remember the opening of Goodfellas you'll remember that it opens with a memorably violent scene where an near-dead man in the back of a car is stabbed by Hill and his colleagues in a scene that is oppressive and violent but yet ends with the narration telling us \"as far back as I can remember I wanted to be a gangster\" and snaps to credits under a big track from Tony Bennett. This scene is important because it works as a microcosm of the whole film – the appeal but also the cost, all in one place. Wolf of Wall Street never has any of that and it hurts it. I suspect the message of the film is that our financial systems are screwed and that ultimately the rich will never be in the same world as the average person, because this is what I took from the rather sobering final scenes. However if this is the point it is trying to make then it really hurts itself with the rest of the film seeming to say \"so why not get on board\". I know this is not the case but the lack of a \"point\" or an agenda it the film means that it naturally fills it with its own, which is a weird feeling.But then again – I guess it is a comedy. So the infamous Quaalude scene is not horrific but rather hilarious, the scenes of excess and of criminality are not equally appealing and repulsive – they are almost totally appealing, we hardly get the other side or get to see a victim here, and a few seconds on the subway with the FBI agent really does nothing but yet again make the suggestion that \"it's all broken so why not at least get rich yourself\". Getting away from this, it is a well made film. Scorsese makes this award season's second film to owe a massive debt to Goodfellas (American Hustle being the other) and he directs the film with energy; music is used well as one would expect and the editing makes the film pop. DiCaprio is great in the lead – OK he doesn't find the heart of the character, but the film doesn't ask him to. Instead he is charismatic and energetic, drawing the viewer in and giving the film its energy. The supporting cast is deep with names and familiar faces and it is a statement about how well the film holds the viewer, because it isn't distracting no matter how many famous faces or supporting character from TV appear (although I did notice that this and American Hustle had lots of faces from HBO's Boardwalk Empire). Jonah Hill is over the top in a way that works, although I am surprised to see him getting an Oscar nomination for it in such a crowded year.Wolf of Wall Street has had a lot of praise and this will continue as the Oscars approach and are awarded. Personally I enjoyed the film as a funny true story delivered with energy and excess but in many ways it is not Goodfellas and the most important of these is that the film lacks a moral core to itself, to its characters and to its message. I don't mind the \"it's all screwed so who cares\" message that it ultimately seems to give, but I didn't feel comfortable with how wide a smile it had on its face while it was delivering it."
    },
    {
      "username": "nogodnomasters",
      "userUrl": "https://www.imdb.com/user/ur77881167",
      "reviewLink": "https://www.imdb.com/review/rw4376832",
      "warningSpoilers": true,
      "date": "4 October 2018",
      "rate": "9",
      "helpful": "48 out of 62 found this helpful.",
      "title": "SELL ME THIS PEN",
      "content": "Golden Globe winner Leonardo DiCaprio stars in the title role of Jordan Belfort. Belfort works his way up the ladder making money in penny stocks, i.e. \"selling garbage to garbage men.\" His scheme is to sell these garbage stocks to rich investors due to the high commissions. Along the way he does some illegal transactions as he runs his corporation like a frat party in \"Animal House.\" Having not known money, he and his crew are ill equipped to handle it.I thought that Jonah Hill gave one of his best performances. The production is awfully long, not wanting to miss out on any details. The film goes into detail to explain to the audience things like IPO and the history and effects of quaaludes. If you note the ludes he took early in the film were crumbly. Those were non-prescription ludes made from a pill press in uncle Vinnie's garage and not too potent. Later they score some real ludes. Having taken the fake ones for so long, they didn't know how to handle them causing them to crash, like the money it was too much too fast.The main criticism of the film is that it featured over 500 F-bombs. It really didn't seem like that many due to the length of the production. Besides you get numb to it after the first few hundred or so."
    },
    {
      "username": "karolin-99263",
      "userUrl": "https://www.imdb.com/user/ur96528098",
      "reviewLink": "https://www.imdb.com/review/rw6419250",
      "warningSpoilers": false,
      "date": "29 December 2020",
      "rate": "10",
      "helpful": "179 out of 206 found this helpful.",
      "title": "Oscar worthy",
      "content": "The movie Leonardo DiCaprio should have gotten an Oscar for. His portrayal of the character is perfect. The movie is well-written, leaving no details out of the original story. Martin Scorsese never fails to impress. One of the only example where the movie is better than the book. The movie never gets boring, I could watch this anytime."
    },
    {
      "username": "peach007",
      "userUrl": "https://www.imdb.com/user/ur4029842",
      "reviewLink": "https://www.imdb.com/review/rw7445449",
      "warningSpoilers": true,
      "date": "15 October 2021",
      "rate": "9",
      "helpful": "15 out of 15 found this helpful.",
      "title": "My favorite movie of the 2010's",
      "content": "What can I say. This is such a great movie. I remember seeing this for the first time, not really knowing what it was about. Straight from the first scene, it immediately put a smile on my face, which lasted about for the rest of the entire movie. Great entertainment, I love over the top movies like this. I haven't seen something this good since Fear and Loathing in Las Vegas. I have seen it about 4 times again since it came out and I just keep loving it. The only downside was maybe the scene with the ludes and the Lamborghini. Even though it was great, maybe it was a bit too much over the top :)"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5504661",
      "warningSpoilers": true,
      "date": "23 February 2020",
      "rate": "",
      "helpful": "158 out of 215 found this helpful.",
      "title": "Awesome movie, watched it multiple times",
      "content": "This film is every definition of the word \"impeccable.\" Scorcese's fantastic storytelling ability mixed with phenomenal acting from DiCaprio, Hill and the rest of the cast makes for an awesome combination. The film is never boring and gives you a glimpse into the life of a man who had everything in the world only to have it taken away."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3035717",
      "warningSpoilers": false,
      "date": "18 June 2014",
      "rate": "9",
      "helpful": "40 out of 53 found this helpful.",
      "title": "It really is a comedy",
      "content": "There is a reason this is called Wolf of Wall Street and not Lion of Wall Street. This is not supposed to be a story about some good guy or misunderstood guy doing things that are a little off. And therefor it was important to make this a comedy. When I watched it, I didn't think it would qualify as comedy. Thought of it more of a drama with some comedic moments thrown in.The way it starts should indicate if this is something you want to watch. Never forget, as someone else also stated, this is supposed to be entertainment and does not take itself seriously. If you are not on that level with the movie, you will call it names. And that is OK, because obviously the movie is out there and it will not be everyones taste. That's why you have to decide early on, if you actually want to watch it or not.If you don't feel like it, don't watch it. Save yourself some time and watch something else that interests you instead. If it hits a nerve with you though, you will revel in it. Especially in the performance Leonardo Di Caprio is giving. There is a scene involving him driving \"carefully\", that has to be seen to be believed ..."
    },
    {
      "username": "BrentHankins",
      "userUrl": "https://www.imdb.com/user/ur14299499",
      "reviewLink": "https://www.imdb.com/review/rw2927775",
      "warningSpoilers": true,
      "date": "24 December 2013",
      "rate": "9",
      "helpful": "559 out of 766 found this helpful.",
      "title": "DiCaprio gives the best performance of his career.",
      "content": "In the mid-1990s, Jordan Belfort (Leonardo DiCaprio) and the rest of his associates from brokerage firm Stratton Oakmont became the very definition of excess and debauchery, their offices a boiler room fueled by cocaine and greed. High pressure sales tactic and less-than-legal behind-the-scenes manipulation bred plenty of twenty-something millionaires, and Belfort built himself an empire at the top of the heap. His rise and fall is chronicled in The Wolf of Wall Street, based on the memoir of the same name.Under most circumstances, the actions of Belfort and his cronies (including Jonah Hill in a howlingly funny turn as Belfort's business partner) would be viewed as disgustingly abhorrent, but Martin Scorsese frames this tale of greed with a comedic lens that allows us to laugh at things we probably shouldn't find humorous. Whether it's a clumsy attempt at fisticuffs between two characters overdosing on Quaaludes, or the categorization of prostitutes using stock market terminology (\"blue chip\" hookers make you wear a condom and typically accept credit cards), the film is outrageous from start to finish, and rarely falters in its quest to entertain the audience for three hours.Belfort manages to delude himself and his pals into thinking they can live like this forever, but the audience knows better, and Belfort's eventual comeuppance is hardly surprising. But the path is paved with hilarity, especially in a scene aboard the mogul's luxury yacht, where he surreptitiously offers a pair of FBI agents everything from booze to girls to cold hard cash in exchange for their silence. And let's not forget his punishment for drunkenly piloting a helicopter into the backyard of his estate at 3am, raising the ire of his trophy wife (Margot Robbie).Scorsese has always managed to elicit astounding performances from his actors, and his fifth collaboration with Leonardo DiCaprio results in one of the most charismatic, despicable, offensive and captivating characters to ever appear on screen. As financial bad boy Belfort, DiCaprio swaggers from scene to scene ingesting eye-popping amounts of narcotics, groping and fondling nearly every female within reach, and spouting more profanity in three hours than an entire season of The Sopranos. Belfort is the kind of person that any sane person would detest in real life, but thanks to Scorses and DiCaprio, we can't take our eyes off him.-- Brent Hankins, www.nerdrep.com"
    },
    {
      "username": "notoriousCASK",
      "userUrl": "https://www.imdb.com/user/ur31221670",
      "reviewLink": "https://www.imdb.com/review/rw4416454",
      "warningSpoilers": false,
      "date": "24 October 2018",
      "rate": "9",
      "helpful": "117 out of 145 found this helpful.",
      "title": "\"Money is the oxygen of capitalism and I wanna breathe more than any other human being alive.\"",
      "content": "It's no surprise that Scorsese is associated with the gangster genre with films such as The Departed, Goodfellas and Casino, of which the last two are possibly the best pure examples of the genre. In Goodfellas the gangsters are dangerous but they operate on a more underground level, in Casino they practically run a major city and can do whatever they like. The gangsters were and will always be a part in America's system. Now, the gangsters are not just accepted by the system, but are considered to be an integral part of it. In the first two films, the gangster is threatening and dangerous, but avoidable. In The Wolf of Wall Street, he's calling to hustle you at home and you don't even know it. Some people view The Wolf of Wall Street as a glorification of Jordan Belfort's lifestyle and want to be like him, as Scorsese portrays this life by its nature, enticing. That's the way it works, and it's impossible to portray it accurately without showing how a charismatic man like Belfort can suck an unsuspecting person into a world of money and fame. The film though, shows us just how empty and destructive that life can be.There is an undeniable similarity between the instantaneous joy, energy and euphoria that we have while watching The Wolf of Wall Street and how Jordan Belfort lives his life, this is a movie where the director skillfully mixes form and content to create an experience which is as hyper and as instantly ecstatic as the life of its flashy and opportunistic characters.The direction by Martin Scorsese which still has infectious energy and power is impeccable, there is no other director who has mastered pacing like he has. This is a three-hour movie that moves lightning fast and always manages to keep the audience invested in the story throughout the whole duration. Each scene is packed with so much visual information, and it is fast paced and quickly edited, which complements the general tone of the film. The cinematography by Rodrigo Prieto is gorgeous as well and displays an optimal color palette throughout the whole film. Each shot also looks precise, even during some of the more chaotic scenes.The script is fantastic, filled with many great and memorable lines of dialogue. Every character has a well-defined arc and motives, and the story is given proper breathing room to blossom. The performances are also exquisite, especially Leonardo DiCaprio who gives one of the best performances of his career and portrays the opportunistic nature of Jordan Belfort's character with great commitment as you can see a lustful, hedonistic and impulsive sex & drug-addict man who only wants to have more fun. Supporting him with equal passion is Jonah Hill as Donnie Azoff, Belfort's sidekick, and even he manages to make a mark of his own. Margot Robbie plays Naomi, Belfort's second wife and she does an alluring job in her given role. Matthew McConaughey is in for a very short duration as Mark Hanna, Belfort's mentor, but even in that little time, he is the show-stealer and he dominates the screen unlike anyone else.Martin Scorsese and Terence Winter set out to create a film about the Wall Street excess, and by definition, it contains an excessive amount of everything, such as cursing, sex, nudity, drugs, alcohol and partying. But the film is not really about those things. The story of The Wolf of Wall Street boils down to money, that \"most-addictive drug\" Belfort speaks of, and not just what it can buy, but what it can do to people. Not just how it changes one's lifestyle but the effects it has on one's morals, beliefs, and values, and how it can effectively change not just how a person thinks and feels but how they operate at their core.With a collection of truly incredible films, The Wolf of Wall Street stands out as one of Scorsese's best films, my personal favorite and by far his most humorous film to date. He truly went all out and it paid off in a hilarious satire on the reverence of money, drugs, women, and the admiration of a criminal money-maker. The Wolf of Wall Street is maddening cinema that's already high on coke but still continues to snort more white powder every 5 minutes for 3 hours. This is a fascinating vignette of excess, greed, abuse and decay and it's one of the best movies of the decade and surely one of the most entertaining movies ever made."
    },
    {
      "username": "diegocoda",
      "userUrl": "https://www.imdb.com/user/ur128912882",
      "reviewLink": "https://www.imdb.com/review/rw7369742",
      "warningSpoilers": false,
      "date": "22 September 2021",
      "rate": "10",
      "helpful": "31 out of 39 found this helpful.",
      "title": "The best movie of 2013",
      "content": "The movie is just the best, the acting is great and even I say that it was Oscar-worthy and the plot is simply one of the best ones; the message that it brings to you that money brings power and it is not always for the best because in this movie we see the downfall of a man that will learn that actually in life the money can be a drug and will simply make you cause damage to yourself."
    },
    {
      "username": "ClaytonDavis",
      "userUrl": "https://www.imdb.com/user/ur2898980",
      "reviewLink": "https://www.imdb.com/review/rw2924803",
      "warningSpoilers": false,
      "date": "17 December 2013",
      "rate": "9",
      "helpful": "522 out of 861 found this helpful.",
      "title": "The Wolf of Wall Street is Leonardo DiCaprio's Crowning Work",
      "content": "Martin Scorsese has done it again. His newest and most refreshing effort he's contributed to the world of cinema in years, The Wolf of Wall Street is a roaring thrill ride that is both absolutely hilarious and meticulously constructed. It also presents Academy Award nominee Leonardo DiCaprio in possibly his finest acting performance of his career. At one-minute shy of three hours, I was both engaged and hypnotized nearly the entire duration. A comedic epic that studies the behavior and cultures of a time in America, feels like the uncovering of a time capsule that was buried and dug up to give insight into our current financial crisis. Much more than just laughs, it turns on the dramatic elements early enough in the film to warrant considerable reactions about the choices of our key characters. Expertly paced with intelligent moral questions presented, The Wolf of Wall Street is one of the best films of the year.Telling the story of Jordan Belfort, a young Wall Street broker that gets involved in drugs, money, and even more drugs during the 80's and 90's. In his tenure trading (and stealing), Jordan marries, divorces, does drugs, marries again, does even more drugs, makes solid friendships, and believe it or not, does a lot more drugs. Watching the destruction of Jordan acted as a documentarian's insight that felt like I was watching \"Intervention\" without the family that cares. The Wolf of Wall Street is a black comedy, giving hints of drama. Natural comparisons will fly to Oliver Stone's Wall Street which is accurate but you can see subtle hints of films like Trading Places, Glengarry Glen Ross, and even American Psycho. That's a testament to Scorsese's outstanding direction and Terence Winter's masterful screenplay. Scorsese keeps Wolf life-size, sprinkled with characters that are both geniuses and morons, but functioning morons. They're like the frat pack group that sat in a corner on my college campus, being loud and obnoxious, and made terrible life choices that they still aren't aware of until this day. Scorsese puts together an all-star cast to inhabit these beings that includes DiCaprio, Jonah Hill, Margot Robbie, Matthew McConaughey, Jon Bernathal, and Kyle Chandler. All of which seem to be having the time of their lives.A lot of the credit of the film's overall success has to be awarded to Leonardo DiCaprio. I've never seen him truly \"go for it\" in a way that he exhibits as Jordan Belfort. In his breaking of the fourth wall, to his long but completely engaging monologues about life, money, and greed, it's the most assured and compelling work by the actor to date. When DiCaprio unleashed his talents in the mid-90's in What's Eating Gilbert Grape? and later stole the hearts of tween girls everywhere in Titanic, who knew this is the role he'd been gearing up to play. This is the role of his career and something that the Academy Awards should look to for his long overdue recognition. It's a charming and adventurous turn that presents a conundrum to the audience as we find ourselves both enamored and loathing the pure essence of Jordan. A sequence of DiCaprio crawling on the floor will probably be the scene of the year. This is DiCaprio's crowning achievement.As the magnetic and cheesy-minded right-hand man, Jonah Hill's performance as Donnie Azoff is another great turn for the 30-year-old actor. He's allowed to explore some of his comedic ticks and beats that he may not have ever had the opportunity to explore in films like Superbad or 21 Jump Street. In Wolf, he relies on his own instincts, and his chemistry with DiCaprio, which has helped him before for his Oscar-nominated work in Moneyball opposite Brad Pitt. Matthew McConaughey, is one scene shy of winning the Oscar for Best Supporting Actor. While his work in Dallas Buyers Club will bring him the acclaim and recognition that he deserves, The Wolf of Wall Street is a prime example of what he should be doing when he's not working or seeking out the strong, independent features that are geared for awards recognition. Stealing every frame and focus from DiCaprio in his ten minute screen time, McConaughey utilizes all his charm and spunk as Mark Hanna, the mentor to young Jordan as he started out.Like any great Scorsese film, the women are in full-force and given the opportunity to shine like the others. Cristin Millotti, a toned down and tragic version of Marisa Tomei in My Cousin Vinny, is sensational in her brief appearances on screen. Beautiful and sympathetic, she offers much needed serious and dramatic elements to Jordan's outrageous antics. In the end, a star is born in the gorgeous and vivacious Margot Robbie as Naomi Lapaglia, Jordan's second wife. Whoever was going to be cast as Naomi, had to be an actress of considerable talent and had the ability to really be the sexy kitten but still warrant an emotional reaction from the audience when called upon. Margot Robbie was the perfect choice and she'll need to owe Scorsese royalties for years to come with the roles she'll be offered following this. Robbie is pure magic and is everything she's required to be. She's the more elusive, compelling, and more thought out version of Scarlett Johansson's character in Don Jon.I loved every second of The Wolf of Wall Street. Terence Winter's script is a natural and well-oiled machine that produces the words of a demigod. You couldn't make these things up. Thelma Schoonmaker is the utmost professional and continues to shine film after film. You won't find another dedicated and glossed editing work this year. The other supporting actors do sensational work especially Kyle Chandler, who has a very well-constructed exchange on a boat with DiCaprio, has us asking more and more, why is this guy not helming his own films on a consistent basis yet?"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2996319",
      "warningSpoilers": false,
      "date": "11 April 2014",
      "rate": "8",
      "helpful": "129 out of 226 found this helpful.",
      "title": "Reserved for the male of the species",
      "content": "The Wolf Of Wall Street details the rise and fall in real life of one Jordan Belfort who for a while was living high and wide off of other people's money. It was good while it lasted until some relentless FBI agents took him down partly because of his own hubris.Leonardo DiCaprio as he did with such other real life figures like Howard Hughes and J. Edgar Hoover, each of who lived large in his own way with power, DiCaprio lives large with money. At first it's the realization of the American dream, DiCaprio the middle class kid wants to go on Wall Street. He goes, but then is one of thousands cast adrift by the stock market crash of the late Reagan years. DiCaprio is not about to give up his dream.He organizes his own brokerage house, similar to what is seen in the more modestly financed film The Boiler Room. But DiCaprio takes it far from a penny stock outfit. With a collection of his own ill assorted bunch of friends chief among them is Jonah Hill, these guys and I do mean it is reserved for the male of the species DiCaprio makes obscene amounts of money and spends it obscenely. That is sure to attract all kinds of law enforcement attention.I have seen very few films that have depicted the alpha male world so well. Women just do not compete in DiCaprio's world. All they serve as are sex objects. Women work on Wall Street in the more traditional brokerage houses, but not with him where being one of the boys is the first requirement. The world consists of 50% orgies and 50% piling up paper profits and later on hiding them from authorities. True of DiCaprio and true to a lesser extent of all his associates.Martin Scorsese directed this film and handled the film like he did one of his gangster epics like Goodfellas. The narration of the film is by DiCaprio and it takes you from his rise to where law enforcement has him between a rock and a hard place. Like Ray Liotta in Goodfellas a combination of drugs and hubris makes him think he's invulnerable. But in Goodfellas would not have had a scene where the wise guys just out and out dared to challenge the FBI as DiCaprio does with agent Kyle Chandler. It so reminded me of that famous incident from 1984 where presidential candidate Gary Hart dares reporters to follow him around to catch him doing anything outside his marriage. And of course they did.Five Oscar nominations went to The Wolf Of Wall Street, nominations for Best Picture, Best Director, Best Adapted Screenplay and nominations for DiCaprio and Jonah Hill as Best Actor and Best Supporting Actor. Hill was something of a revelation. The kind of nondescript character that you wouldn't look at twice, Hill gets taken to a world that he could only imagine in dreams wet or dry by DiCaprio. In his own Hill is almost as fascinating a story as DiCaprio.The guy who beat Leo out for Best Actor has a brief but telling role as a mentor of sorts. Matthew McConaughey plays a stockbroker who takes him under his wing and they have a great scene at a club where he's getting his first three martini lunch. McConaughey only forgets to teach DiCaprio one thing, discretion.I can understand why women would truly hate this film as they are nothing more than pawns in a male power game, but The Wolf Of Wall Street gives us a fascinating look at a man who tried to play with the big boys of the Stock Exchange and for a while, did."
    },
    {
      "username": "Al_The_Strange",
      "userUrl": "https://www.imdb.com/user/ur24364152",
      "reviewLink": "https://www.imdb.com/review/rw2930908",
      "warningSpoilers": false,
      "date": "29 December 2013",
      "rate": "9",
      "helpful": "205 out of 338 found this helpful.",
      "title": "Wolf of Wall Street review",
      "content": "If you've seen The Goodfellas or Casino, then you'll know the story of The Wolf of Wall Street. This is another tale of a criminal whose ambitions sweep him away into a debauched world of dirty money, out-of-control substance abuse, endless lies, a troubled family life, and a downward spiral of corruption that inevitably leads to his own undoing. Only thing is, this is less about the gangsters and mafia, and more about white-collar crime. The guys wear suits, work in proper offices, and everything they do is just business; funnily enough, this whole movie still plays out like a kind of gangster film.Based on the memoirs of Jordan Belfort - the real-life stock broker who made millions by selling shoddy stocks to average joes - the film showcases one seriously messed-up slimeball of a man. If his scheme sounds familiar, it's because it's been the inspiration behind the 2000 film Boiler Room, and this film covers much of the same concepts, albeit with better structure. The film maintains a close and intimate focus on the man as he rises to power, suckers thousands into his schemes, and then lives a life of extreme excess. And it is extreme: the whole film becomes laden with drugs, sex, superficial luxuries, material things, and characters who want nothing more than to take and consume everything. The sheer corruption becomes palpable on-screen, and I couldn't help but to shake my head at numerous scenes when I saw just how far these wolfish characters have gone in their unrestrained partying and debauchery. I have no clue as to how closely this film adapts the real-life events, but at times it's almost hard to believe that things could have gone this far. And yet, the excesses serve to underscore key themes and criticisms on the American dream; the pursuit of money and success, through any means, remains the main drive of the characters and the movie, and it leads to a fairly hard-hitting downfall.This film features good-looking photography and editing. Acting is great: Leonardo DiCaprio is practically perfect as the titular character, and the rest of the cast pulls their weight really well (including Jonah Hill, who seems to fit into his character's archetype very comfortably). Writing is really sharp and good; the film is full of great lines and great speeches. There are some great-looking sets, props, and costumes on display in this film. Music has a varied mix of songs, and they're all used really well for their intended effect.The Wolf of Wall Street is every bit as good as Martin Scorsese's previous work with The Goodfellas and Casino. All these films work with similar plots and themes, but TWOWS is like a gangster film masked by the thin veil of upper-class corporate swindling. It is a film that candidly shows the crimes and excesses in full, before proving that, even for the super-rich, crime still doesn't pay.Recommended! 4.5/5 (Entertainment: Good | Story: Very Good | Film: Perfect)"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2941870",
      "warningSpoilers": false,
      "date": "14 January 2014",
      "rate": "",
      "helpful": "89 out of 153 found this helpful.",
      "title": "Scorsese and DiCaprio Make Another Masterpiece",
      "content": "The Wolf of Wall Street (2013)**** (out of 4) Two word review: A Masterpice.Martin Scorsese's latest film is yet another brilliant one with Leonard DiCaprio turning in the greatest performance of his career as stockbroker Jordan Belfort who takes some rather bland people and turn them into one of the biggest scams that the FBI ever saw. THE WOLF OF WALL STREET is going to make many people unhappy and there are many more who are probably going to be offended by it but the perfection that is Scorsese was right when he decided to turn this into a comedy instead of a drama. Yeah, it's GOODFELLAS on speed and ramped up sex but it's just so brilliantly and wickedly funny that you can't help but laugh at all the craziness going on. Yes, there are some moral police out there who are going to object to a movie being made about a man who ripped off poor people but I'm sorry, I like the fact that this film doesn't really care about those people and instead just gives us an in-your-face look at these wild people, their wild drugs and their wild sex lives. This film is certainly over-the-top in regards to the excess but so were the characters so I thought they just went hand and hand with each other. Scorsese was the perfect person for this project because of his ramped up speed but here is goes all out and really delivers an incredibly wicked little ride that will have you smiling and laughing at some very questionable things.I've been a fan of DiCaprio long before he became famous and this here is without question the greatest performance he's given so far. I was curious to see how he would do playing someone crazy and wild like this but he does so perfectly and I'd say it was a flawless performance. No matter what was going on in this crazy life you believe that you're watching a real character and as his character says throughout the film, sell him something. Well, DiCaprio sells this performance and role like no one else could. The supporting players are just as wonderful with Jonah Hill, Margot Robbie, Rob Reiner, Jon Favreau, Matthew McConaughey and Jean Dujardin all delivering terrific performances. The cinematography, the music selections and everything else are just flawless here. THE WOLF OF WALL STREET could have been a complete disaster in so many ways but the strong screenplay and Scorsese's wicked direction makes it an incredibly entertaining film that works so well. It's hard to fully put into words what Scorsese and DiCaprio have pulled off but it's certainly one of the best and most memorable comedies in ages."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw2954198",
      "warningSpoilers": false,
      "date": "3 February 2014",
      "rate": "8",
      "helpful": "63 out of 107 found this helpful.",
      "title": "A Three-Hour Bacchanalia Caught on Film",
      "content": "Based on the true story of Jordan Belfort (Leonardo DiCaprio), from his rise to a wealthy stockbroker living the high life to his fall involving crime, corruption and the federal government.As of now (February 2014), this film sits at an impressive #57 on IMDb's list of greatest films of all time. Using that as a jumping off point for this review, we will have to scale it back a bit. Whether the film should be on the list is debatable, but certainly not within the top 100 -- it is neither that good nor among director Martin Scorsese's best work.Along the same lines, the Oscar nomination for Best Picture is a bit much. While there is no denying it was probably among the ten best films of 2013, with some incredible acting and more than adequate cinematography and editing, the very fact it has no chance of winning makes one question why even nominate the film at all. (Of course, without nine nominees, we would be back to having the reasonable number of five...) Scorsese received a best director nomination, and this strikes me as more understandable. He managed to assemble an impressive cast and tell a story that is both compelling and entertaining, without trying to put some moral tag on it. Whether or not the viewer thinks this is a glorification or denouncement of the acts depicted is up to them, as the film itself is blank (in the best way).While on the subject, could the drug use and sexuality have been toned down? Absolutely. And there is a good argument that they should have been (especially the non-stop sex, which comes across as gratuitous and only adds more minutes to this lengthy financial epic). Another argument says the events are extremely unlikely and exaggerated at times. And this is probably also true; but the film is accurate to the memoir, not reality, and this is Belfort telling his story with all the embellishments that come with it. If you want just the facts, read the court transcripts.Leonardo DiCaprio is nominated for best actor, and this is a choice that is understandable and yet hard to rally behind. He truly becomes Belfort, and probably makes the man out to be even more wild than he was. That deserves a nomination. But this is not DiCaprio's best role (he has also done a fine job portraying Howard Hughes and J. Edgar Hoover) and not one he deserves the win for.Jonah Hill, on the other hand, was amazing and deserves to win his supporting actor category. Being up again Jared Leto, he probably has no chance, but Hill has come a long way in a few short years from a lovable doofus in \"Superbad\" to a formidable actor in his own right. At first, \"Moneyball\" seemed to be an anomaly in Hil's career, but he showed the world he could do even better when he became Donny Azoff in this picture. Incredible.Whether Terence Winter deserves Best Adapted Screenplay for this film is unclear without having read the book. Such a nomination seems fair, though the win is hard to say without more familiarity. I am surprised no nominations came for cinematography or editing, which are strong in their subtlety. But oh well.Of the film's five nominations, it may walk away with one win (Winter) or two at most (DiCaprio). More likely it will walk away empty-handed. The film is not flawless (we could go on about how awkward the soundtrack was) and may or may not go on to be memorable for much more than its nudity and pervasive cursing."
    },
    {
      "username": "abdulazizalsaad-73053",
      "userUrl": "https://www.imdb.com/user/ur105306067",
      "reviewLink": "https://www.imdb.com/review/rw6806266",
      "warningSpoilers": false,
      "date": "12 April 2021",
      "rate": "10",
      "helpful": "36 out of 45 found this helpful.",
      "title": "Leo's best performance of all time!!",
      "content": "Di caprio was robbed in the oscars whether you like it or not, the only reason why people give this movie a low rating is because of the over nudity, and it's the same reason why leo didn't get the oscar in my opinion, which is what I don't understand!!!, it's an r rated movie, so obviously there will be nudity, it's not a kid's movie!!!! , it's easily leo's best performance and scorcese's second best movie after goodfellas."
    },
    {
      "username": "alexscott-35299",
      "userUrl": "https://www.imdb.com/user/ur133003750",
      "reviewLink": "https://www.imdb.com/review/rw7550607",
      "warningSpoilers": false,
      "date": "15 November 2021",
      "rate": "10",
      "helpful": "17 out of 22 found this helpful.",
      "title": "This is easily Leo's best performance ever!",
      "content": "This movie is absolutely amazing and it deserved way more Oscar wins. Leonardo DiCaprio is unbelievable and this movie is his best performance and he isn't the only one putting in an amazing performance, this film is littered with them, Jonah Hill is amazing, Margot Robbie is so good to say this was her first major role. I love the story that this movie is telling and the direction on how they tell it is amazing aswell. This is easily one of the best movies of all time and it will go down in history as one of Leo's best ever movies. I love it so much!"
    },
    {
      "username": "Serge_Zehnder",
      "userUrl": "https://www.imdb.com/user/ur0121776",
      "reviewLink": "https://www.imdb.com/review/rw2924816",
      "warningSpoilers": false,
      "date": "17 December 2013",
      "rate": "",
      "helpful": "198 out of 309 found this helpful.",
      "title": "Where Human Flaws Make a Rotten Core",
      "content": "Brilliantly acted, superbly written and as one would expect from a picture by Martin Scorsese, it is a masterclass of directorial craft.Showy when it needs to be, but also quiet and contemplative. \"The Wolf of Wall Street\" is the equivalent of something like \"Good Fellas\" or even more so \"Casino\" but set in the world of finance. The suits might be more expensive but the people who wear them are just as sick and violent as their street-mob counterparts. Sardonic in humor and unflinching in showing the depravity of its characters, it marks somewhat of a different approach to the world of stock-trading than Oliver Stone's \"Wall Street\".Where Stone seems more in line with Bertold Brecht who considered theater (or in this case film) a moral institution, does Scorsese take the position of the omnipresent observer of the dark side of the American and in many cases the human dream.Leonard DiCaprio gives another stellar performance of great intensity and even greater tragedy while this tale of corruption, greed and self-righteousness unfolds.It's a vast panorama that shows how during the last twenty-five to thirty years gullibility as well as our innate greed make all of us accomplices in this never-ending pyramid scheme far away from any reality.One could almost hear Scorsese's clerical background come to the fore again, according to which nobody is without sin, and therefore we are all susceptible to corruption.It is our decision on which side we choose to live that makes the difference. For every individual but also society as a whole."
    },
    {
      "username": "john2121fl",
      "userUrl": "https://www.imdb.com/user/ur33792085",
      "reviewLink": "https://www.imdb.com/review/rw7314743",
      "warningSpoilers": true,
      "date": "6 September 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Awesome movie must watch!",
      "content": "This is a movie that you can watch over and over very rich in details never gets old, cast was awesome and of course. Martin Scorsese delivers again awesome director, there is no bad guys just a lot of dysfunctional characters is like high school for adults.Funny intriguing, sexy and best of all based on a real life event makes it even better and of course as a man I love the naked women but that is not why I gave it a 10 it was well written and executed.This movie is like the boiler room/wall street films on steroids, makes those other films look like kitty movies.It is impossible but I wish they make a sequel or a tv show about it."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw8810048",
      "warningSpoilers": false,
      "date": "19 January 2023",
      "rate": "4",
      "helpful": "8 out of 10 found this helpful.",
      "title": "What Is This Film Supposed To Convey To Its Viewers?",
      "content": "From what I understand, \"The Wolf of Wall Street\" is loosely based on a real-life individual. However, director Martin Scorsese delivers such an over-the-top caricature that either Jordan Belfort was truly the wildest individual to ever roam this planet or this is the most bonkers \"based on a true story\" liberty-taking of all time.For a very basic overview, this film tells the story of Belfort (Leonard DiCaprio), a Wall Street banker who experiences a market crash on his first day in NYC. As such, he starts his own firm--Stratton Oakmont--duping clients into buying massive amounts of penny stocks. But Belfort is an excellent con man, and soon he's challenging Wall Street institutions in terms of profit. Along the way, he lives the most profane, drug-addled, sexually promiscuous, over-the-top lifestyle one could possibly imagine. All this puts him on the radar of the FBI, of course, in particular Agent Denham (Kyle Chandler) who is out for the bust of his life.At heart, I think \"Wolf of Wall Street\" is a parody of Wall Street culture--the kind of shyster existence that generates as much depravity as it does wealth. I'm sure there are some genuine lessons to be learned from all that.The problem here is that Scorsese leans so hard into the debauchery of the whole scene that by the end I didn't find anything or anyone likable. I don't consider myself a prude by any means (especially when it comes to movies), but the amount of profanity, drug use, and sexual antics in \"Wolf\" did reach--and surpass--my limits. There is not a nuanced moment in the entire picture--everything is a slap to the face, so to speak.All of that being said, there are just enough things happening in \"Wolf\" to make it somewhat memorable: DiCaprio is on fire from beginning to end, Margot Robbie is utterly entrancing, Jonah Hill is reliable solid, and it has certainly produced some gif-able moments or speeches.But other than those aesthetic pop culture snippets, I found the whole of \"The Wolf of Wall Street\" to be quite a mess. Mainly for a lack of nuance in trying to convey any sort of message about Wall Street and its ilk. By the end, I felt bludgeoned to death as opposed to thoughtful or engaged."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw2938365",
      "warningSpoilers": false,
      "date": "9 January 2014",
      "rate": "5",
      "helpful": "48 out of 82 found this helpful.",
      "title": "Excess Is Boring, Especially When It's Three Hours Long",
      "content": "Martin Scorsese at his undisciplined worst.\"The Wolf of Wall Street\" is 90 minutes of glib satire stretched over an interminable 180 minute film. I get it, I get it -- the excess of the film itself matches the excess of the Wall Street world depicted in it. But excess, both as a subject matter and as a style, is boring after a while. The first hour or so of the film blows the roof off the joint, and I was sure I was experiencing a film that would go down as one of Scorsese's best. But as it went on and on, and Leonardo DiCaprio's performance became more and more histrionic, and the film made the same point over and over, I had that depressing feeling that comes when a movie you're really enjoying makes a wrong turn and becomes one you really dislike.\"The Wolf of Wall Street\" is of course critic proof. Anyone who doesn't like it is instantly categorized by its fan boys as stodgy and unable to handle the subject matter, as if it's an impossibility that someone could dislike the film simply because they don't think it's any good. Whatever. It's an overblown mess, stupid when it's trying to be funny (the Quaalude scene, for example) and in desperate need of someone who had the balls to tell one of America's greatest directors that he was letting his material run away with itself.Grade: C"
    },
    {
      "username": "mm-39",
      "userUrl": "https://www.imdb.com/user/ur0453228",
      "reviewLink": "https://www.imdb.com/review/rw2932887",
      "warningSpoilers": true,
      "date": "1 January 2014",
      "rate": "5",
      "helpful": "115 out of 211 found this helpful.",
      "title": "over hyped movie!",
      "content": "Martin Scorsese is losing his gift as a director. The Wolf of Wall Street is another rendition of Scorsese's other movies. The narration, actions, and flow of Wolf of Wall Street is similar to Goodfellas, Casino and Mean Streets. Di Capiro's lead character is just another version of the Henry Hill character from the movie Goodfellas. Through the streetwise narration of Di Capiro one learns how the system is scammed, and experiences dysfunctional behaviour of drugs, and prostitutes. The characters lack of morals creates the usual drama stew of low lives. Scorsese tries to spice up the old recycled formula with nudity, massive drug use, over the top sex, which can not compensate for the lack of story depth. 3 hours was way too long for a half hour story. Five stars out of ten."
    },
    {
      "username": "lopezpatricia-06139",
      "userUrl": "https://www.imdb.com/user/ur79796304",
      "reviewLink": "https://www.imdb.com/review/rw7059067",
      "warningSpoilers": false,
      "date": "24 June 2021",
      "rate": "1",
      "helpful": "20 out of 29 found this helpful.",
      "title": "Totally disgusting and annoying",
      "content": "To illustrate I'm no prude I confess I've prob done more drugs that the lot of em. But this film was disgusting. Doing hookers in front of everyone the absurd frat boy raucous testosterone fuelled crap. This film annoyed me from the first five mins to the bitter end. You don't need to be of a sensitive disposition for this film to offend you as it's so extreme it put my debauched life into a shadow. Ugh just ugh."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3121482",
      "warningSpoilers": false,
      "date": "10 November 2014",
      "rate": "7",
      "helpful": "16 out of 24 found this helpful.",
      "title": "sometimes hilarious",
      "content": "Jordan Belfort (Leonardo DiCaprio) is a regular guy from Long Island working at the ground level in a Wall Street firm where Mark Hanna (Matthew McConaughey) is the star broker. On the first day of him becoming a licensed stockbroker, the market crashes in Black Monday. His firm goes bankrupt and he's thrown into the streets. With the support of his wife Teresa (Cristin Milioti), he ends up working in a Long Island boiler room dealing in penny stocks. He starts his own firm gathering a group of questionable salesman like Donnie Azoff (Jonah Hill). He quickly rises gaining the attention of FBI Agent Patrick Denham (Kyle Chandler). It is a drug-filled, stripper-strutting, midget-throwing wild-partying office. Jordan has an affair with Naomi Lapaglia (Margot Robbie) and eventually even marrying her. However the high life doesn't last even with their own Swiss banker.This has some funny moments and sometimes even gut busting hilarity. I do have a small problem trying to enjoy this movie at the start. Jordan becomes essentially a con man. The joke is that they're having all this fun but I can never forget that the fun is done on everybody else's dime. The characters laugh while I cringe. About halfway through, I do get acclimatized and feel more at ease with the movie. There are some great scenes. The scene of Jordan rallying the troops for the Steve Madden IPO is amazing. Leo gives a full-out performance."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw2946606",
      "warningSpoilers": false,
      "date": "21 January 2014",
      "rate": "8",
      "helpful": "140 out of 264 found this helpful.",
      "title": "Goodfellas Meets Wall Street Meets Biting Black Comedy",
      "content": "\" The business of America is business \" screams an old cliché but like so many clichés it's based on reality . Is there much difference between a gangster and a stockbroker ? It's the sign of a very poor mobster who can't make a profit for his firm and it's the same with the stock market . Thankfully capitalism is legal and every other socio-economic alternative has been a disaster for humanity but one can't help equating the stock exchange with being the same as gangsterism , supply and demand without any moral or humanitarian mores and one wonders how American auteur Martin Scorsese might bring a story of Wall Street to screen ? If there's a problem with Scorsese he sometimes remakes the same type of film as in THE KING OF COMEDY and BRINGING OUT THE DEAD are remakes of TAXI DRIVER . likewise GOODFELLAS was remade as CASINO .One can't help thinking the temptation to make a story featuring an amoral capitalist could quite easily end up becoming a gangster film set in the world of high finance . \" All my life I wanted to be a white collar criminal \" In effect this is how the film works to a large degree but Scorsese is on top of his game so having such a large similarity on a narrative and visual level with GOODFELLAS and CASINO doesn't matter because for a movie lasting three hours it just flies by . Once again Scorsese uses the directorial technique of intensified continuity which is film critic speak for in your face direction . All the Scorsese hallmarks are here , breaking down the figurative fourth wall , garish and glossy cinematography , constant camera movement , pumping intrusive music etc etc . It's all here and you've seen it all before but it's so well done that none of this matters and remains totally compelling as once again the master director brings us Shakespearean tragedy in its most American and cinematic form To be fair to Jordan Belfort he didn't torture or kill anybody and his methods of gaining economic profit only differs from the rest of the finance sector in that they're illegal . Actually in amongst the excess of drugs , sex and foul language the storytelling doesn't make a very good job in telling the audience the difference between legal and illegal stockbroking but we're asked to take on board that Belfort isn't that bad because he's played by DiCaprio . Fair enough and he does a good job as a shallow and greedy boy who seduces stupid greedy people in handing over their cash . The rest of the cast also go along with the loud colourful style of the movie but was I puzzled by the one scene cameo by Mathew McConaughey in a pivotal role and kept expecting his character to make a reappearance at some point in the film which doesn't happen . . it'll be very ironic if as I expect McConaughey beats DiCaprio to the Oscar this year . A British audience might also find the casting of Joanna Lumley distracting in much the same way as Ray Winstone in THE DEPARTED , but the cinema audience I watched this with spent much of the running time laughing at the grotesque blackly comical scenes as they played out on screen . Mission accomplished Marty , although one can't help thinking an inclusion of a scene where Belfort passes a card warning a colleague about something is trying a little bit too hard to paint Belfort in a better light than he deserves . I mean it's not like anyone would be queuing up to listen to his lecture seminars after seeing this film is it now ? This is one of the better films from the long , prolific resume of Martin Scorsese , possibly his best since GOODFELLAS but one that will probably be very under rewarded at the prestigious award ceremonies due to one of the strongest film line ups seen in many years . It also won't convert anyone in to being a new found Scorsese fan but for those of us who's enjoyed his familiar language of cinema to tell a story about the American dream turning in to a nightmare it's proof once again that he's Hollywood's greatest living director."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3035783",
      "warningSpoilers": true,
      "date": "18 June 2014",
      "rate": "7",
      "helpful": "11 out of 15 found this helpful.",
      "title": "The Wolf of Wall Street was a pretty crazy movie. Not, only did it sell the pen. The dark comedy concept sold the movie.",
      "content": "If this movie wasn't so outrageous mess up funny. It would be so unlikable to watch. In my opinion, should had been call, 'The Wolves of Wall Street'. Nobody has any morals balls in this movie as every character in this film is pretty greedy liars. They all felt like one-dimensional greed caricatures than human beings. Most of the character really need more well-rounded depth to them. Based on 2007's memoirs, true story of Jordan Belfort. The movie focus on Jordan (Leonardo DiCaprio) rise to a wealthy stockbroker through the use of corruption scams; while under the watchful eyes of the federal government in the 1990s. The black comedy directed by Martin Scorsese, is pretty well-made. Still, it really felt too much of a glamorization of the lifestyle, than a moral tale, in my opinion. It felt like lets show as much f*ck up things as we can for 2 hours, and then in the last few minutes, show the negative results of what happen. It was bit one-sided argument. It made the film seem a bit unrealistic, with how many crude things, these people could get away with. This movie will likely inspiring others to do the same mistakes, rather than teach them, not to do what Belfort did. After all, the real Belfort got paid for this movie, a million dollar and a cameo. Since 2013, the opening of this movie, Belfort hasn't pay enough money back to the victims of his crimes. The U.S. government is not holding Belfort in default of his payments, but it is unclear when the full amount of the mandated restitution will ever be paid by him. He's pretty much, got Scot free in his case, and that really sucks to hear, if he stole money from you. The acting is really alright. Leonardo DiCaprio can really put out the charm. He can also do the yelling, that he been known for. He wasn't afraid of going over the top with this. Still, this role wasn't anything new for him. After all, he played similar characters in both 2013's Great Gatsby and 2002's Catch Me if you can. Instead of playing it straight, he just went 100% crazy with this role with all the sex scenes and drug use. Honestly, with all the drug use, Jordan portray in the film doing, how is this guy even alive? The one person that deeply surprise me was Jonah Hill as his partner in crime, Donny Azoff. You really didn't see this type of acting coming from him. The supporting cast was pretty good for the most part. I have to say, while his premise on film is short, Matthew McConaughey as Mark Hanna, Jordan's mentor, was pretty memorable. The women characters were pretty typecast as trophy wives, money hungry girlfriends, or eye candy hookers, who mostly go around, full frontal nudity, or having sex. If they're not, doing that, they portray as bitchy gold-diggers with no sense of morals. Margot Robbie is a pretty face, but gees, she couldn't act. At the beginning of her presence, she had an Australian accent that made more sense since her aunt is British. Then,out of the blue, you hear this awful screeching New Yorker/New Jersey Guido accent that sounds like something out of Jersey Shore. She couldn't show depth in her character, if Martin Scorsese wanted to. It's really uncomfortable and offended how women were portray in the film. The only female character was somebody to root for, was Aunt Emma (Joanna Lumley), but she ain't no angel. I have to say, for men, at less, we got a counter-protagonist fighting against the antagonist Jordan in Agent Patrick Denham (Kyle Chandler) who did wonderful in his role. He wasn't one-dimensional pencil pusher, Boy Scout. He was willing to go one on one with Jordan. The movie even have a somewhat moral character in Jordan's father, Max (Rob Reiner) who tries hard to get Jordan to live life, the right way, but always his son to make the mistakes, needed to grow. I love the idea, how Martin Scorsese film it, with the use of wide ends, slow motion and others to show the effects of the drugs or heavy party scenes. The movie really felt like it could had work in a 3D settling. I love how he aged the film for the infomercial sequence to make it look like something that came out in the 1990s. I love all the commercials footage used from Benihana to Steve Madden. The CGI in the film is a bit choppy. You can see, how bad, it was in the storm scenes, but there is rare mistakes made this film. Great use of establish music to set the mood of the film. The humor is a hit or miss. Some of them were really just crude like the homophobic, sexism and racism comments. While, others were pretty clever and funny. I love all the fourth wall jokes with Jordan gives lengthy explanations of Stockbroker terminology; only to drop it midway through. I love pop culture references like Moby Dick, Gordon Gekko, Freaks, James Bond, Willy Wonka and others. The movie had a cluster F-Bomb with 544 uses of the word. Some of them seem natural; while other seem oddly place. This film has the record for the most uses of the word in a fiction film. The movie is 3 hours long with its pacing. You can't really tell, with the pacing, due to not a lot of slow scenes. Still, there were few gags did go on way too much. You can cut the movie to 1hr and 30 minutes, and get the same results. I was deeply surprised, that this movie wasn't NC-17 with its strong sexual content, graphic nudity, drug use and language throughout, and for some violence. It's one of the movies that should be. Overall: Well-made movie that was kinda offended, but still watchable."
    }
  ],
  "errorMessage": ""
}