{
  "imDbId": "tt0993846",
  "title": "The Wolf of Wall Street",
  "fullTitle": "The Wolf of Wall Street (2013)",
  "type": "Movie",
  "year": "2013",
  "language": "en",
  "titleInLanguage": "The Wolf of Wall Street (2013 film)",
  "url": "https://en.wikipedia.org/wiki/The_Wolf_of_Wall_Street_(2013_film)",
  "plotShort": {
    "plainText": "The Wolf of Wall Street is a 2013 American epic biographical black comedy crime film directed by Martin Scorsese and written by Terence Winter, based on Jordan Belfort's 2007 memoir of the same name. It recounts Belfort's career as a stockbroker in New York City and how his firm, Stratton Oakmont, engaged in rampant corruption and fraud on Wall Street, leading to his downfall. Leonardo DiCaprio, who was also a producer of the film, stars as Belfort in his fifth collaboration with Scorsese following Gangs of New York (2002), The Aviator (2004), The Departed (2006) and Shutter Island (2010). The film also stars Jonah Hill as his business partner and friend Donnie Azoff, Margot Robbie as his second wife, Naomi Lapaglia, and Kyle Chandler as FBI agent Patrick Denham.\r\nDiCaprio and Warner Bros. secured the rights to Belfort's memoir in 2007, with Scorsese set to direct, but content restrictions stalled production. The project was later greenlit by the independent production house Red Granite Pictures. Filming took place in late 2012 in New York City and was shot mostly on film stock.\r\nThe film premiered in New York City on December 17, 2013, and was released in the United States on December 25, 2013, by Paramount Pictures. It was the first major American film to be released exclusively through digital distribution. It was a major commercial success, grossing $406.9 million worldwide during its theatrical run, becoming Scorsese's highest-grossing film. The film was controversial for its moral ambiguity and lack of sympathy for victims, as well as explicit sexual content, extreme profanity, depiction of hard drug use, and use of animals during production. It set a Guinness World Record for the most instances of swearing in a film. The film's financing became implicated in the 1Malaysia Development Berhad corruption scandal; the U.S. Department of Justice and the Malaysian Anti-Corruption Commission investigated Red Granite Pictures, and producer Riza Aziz was arrested in 2019.\r\nThe film received positive reviews (and some moral censure) from critics and appeared on several \"best of the year\" lists. It was nominated for several awards, including five at the 86th Academy Awards ceremony: Best Picture, Best Director, Best Adapted Screenplay, Best Actor (for DiCaprio) and Best Supporting Actor (for Hill). DiCaprio won Best Actor – Musical or Comedy at the 71st Golden Globe Awards, where the film was also nominated for Best Picture – Musical or Comedy.",
    "html": "<p>The Wolf of Wall Street is a 2013 American epic biographical black comedy crime film directed by Martin Scorsese and written by Terence Winter, based on Jordan Belfort's 2007 memoir of the same name. It recounts Belfort's career as a stockbroker in New York City and how his firm, Stratton Oakmont, engaged in rampant corruption and fraud on Wall Street, leading to his downfall. Leonardo DiCaprio, who was also a producer of the film, stars as Belfort in his fifth collaboration with Scorsese following Gangs of New York (2002), The Aviator (2004), The Departed (2006) and Shutter Island (2010). The film also stars Jonah Hill as his business partner and friend Donnie Azoff, Margot Robbie as his second wife, Naomi Lapaglia, and Kyle Chandler as FBI agent Patrick Denham.</p><p>DiCaprio and Warner Bros. secured the rights to Belfort's memoir in 2007, with Scorsese set to direct, but content restrictions stalled production. The project was later greenlit by the independent production house Red Granite Pictures. Filming took place in late 2012 in New York City and was shot mostly on film stock.</p><p>The film premiered in New York City on December 17, 2013, and was released in the United States on December 25, 2013, by Paramount Pictures. It was the first major American film to be released exclusively through digital distribution. It was a major commercial success, grossing $406.9 million worldwide during its theatrical run, becoming Scorsese's highest-grossing film. The film was controversial for its moral ambiguity and lack of sympathy for victims, as well as explicit sexual content, extreme profanity, depiction of hard drug use, and use of animals during production. It set a Guinness World Record for the most instances of swearing in a film. The film's financing became implicated in the 1Malaysia Development Berhad corruption scandal; the U.S. Department of Justice and the Malaysian Anti-Corruption Commission investigated Red Granite Pictures, and producer Riza Aziz was arrested in 2019.</p><p>The film received positive reviews (and some moral censure) from critics and appeared on several \"best of the year\" lists. It was nominated for several awards, including five at the 86th Academy Awards ceremony: Best Picture, Best Director, Best Adapted Screenplay, Best Actor (for DiCaprio) and Best Supporting Actor (for Hill). DiCaprio won Best Actor – Musical or Comedy at the 71st Golden Globe Awards, where the film was also nominated for Best Picture – Musical or Comedy.</p>"
  },
  "plotFull": {
    "plainText": "The Wolf of Wall Street is a 2013 American epic biographical black comedy crime film directed by Martin Scorsese and written by Terence Winter, based on Jordan Belfort's 2007 memoir of the same name. It recounts Belfort's career as a stockbroker in New York City and how his firm, Stratton Oakmont, engaged in rampant corruption and fraud on Wall Street, leading to his downfall. Leonardo DiCaprio, who was also a producer of the film, stars as Belfort in his fifth collaboration with Scorsese following Gangs of New York (2002), The Aviator (2004), The Departed (2006) and Shutter Island (2010). The film also stars Jonah Hill as his business partner and friend Donnie Azoff, Margot Robbie as his second wife, Naomi Lapaglia, and Kyle Chandler as FBI agent Patrick Denham.\r\nDiCaprio and Warner Bros. secured the rights to Belfort's memoir in 2007, with Scorsese set to direct, but content restrictions stalled production. The project was later greenlit by the independent production house Red Granite Pictures. Filming took place in late 2012 in New York City and was shot mostly on film stock.\r\nThe film premiered in New York City on December 17, 2013, and was released in the United States on December 25, 2013, by Paramount Pictures. It was the first major American film to be released exclusively through digital distribution. It was a major commercial success, grossing $406.9 million worldwide during its theatrical run, becoming Scorsese's highest-grossing film. The film was controversial for its moral ambiguity and lack of sympathy for victims, as well as explicit sexual content, extreme profanity, depiction of hard drug use, and use of animals during production. It set a Guinness World Record for the most instances of swearing in a film. The film's financing became implicated in the 1Malaysia Development Berhad corruption scandal; the U.S. Department of Justice and the Malaysian Anti-Corruption Commission investigated Red Granite Pictures, and producer Riza Aziz was arrested in 2019.\r\nThe film received positive reviews (and some moral censure) from critics and appeared on several \"best of the year\" lists. It was nominated for several awards, including five at the 86th Academy Awards ceremony: Best Picture, Best Director, Best Adapted Screenplay, Best Actor (for DiCaprio) and Best Supporting Actor (for Hill). DiCaprio won Best Actor – Musical or Comedy at the 71st Golden Globe Awards, where the film was also nominated for Best Picture – Musical or Comedy.\r\nPlot\r\nIn 1987, Jordan Belfort lands a job as a Wall Street stockbroker for L.F. Rothschild, employed under Mark Hanna. He is quickly enticed by the drug-fueled stockbroker culture and Hanna's belief that a broker's only goal is to make money for himself. Jordan loses his job following Black Monday, the largest one-day stock market drop in history, and takes a job at a boiler room brokerage firm on Long Island that specializes in penny stocks. He makes a small fortune thanks to his aggressive pitching style and the high commissions.\r\nJordan befriends his neighbor Donnie Azoff, and the two founded their own company. They recruit several of Jordan's friends, whom Jordan trains in the art of the \"hard sell\". Jordan's tactics and salesmanship largely contribute to the success of his pump and dump scheme, in which misleading, positive statements inflate a stock's price so it can be sold at an artificially high price. When the scheme's perpetrators sell their overvalued securities, the price plummets, and those who were conned into buying at the inflated price are left with stock that is suddenly worth much less than they paid for it. To cloak this, Jordan gives the firm the respectable-sounding name Stratton Oakmont in 1989.\r\nAfter an exposé in Forbes, hundreds of ambitious young financiers flock to his company. Jordan becomes immensely successful and slides into a decadent lifestyle of prostitutes and drugs. He has an affair with a woman named Naomi Lapaglia; when his wife finds out, Jordan divorces her and marries Naomi in 1991. Meanwhile, the SEC and the FBI begin investigating Stratton Oakmont.\r\nIn 1993, Jordan illegally makes $22 million in three hours after securing the IPO of Steve Madden. This brings him and his firm further FBI attention. To hide his money, Jordan opens a Swiss bank account with corrupt banker Jean-Jacques Saurel in the name of Naomi's aunt Emma, who is a British subject and thus outside the immediate reach of American authorities. He uses the wife and in-laws of his friend Brad Bodnick, who have European passports, to smuggle the cash into Switzerland.\r\nDonnie and Brad get into a heated argument in public during a money exchange, resulting in Brad's arrest, but Donnie escapes. Jordan learns from his private investigator that the FBI is wiretapping his phones. Fearing for his son, Jordan's father advises him to leave Stratton Oakmont and lie low while Jordan's lawyer negotiates a deal to keep him out of prison, but Jordan cannot bear to quit and talks himself into staying in the middle of his farewell speech.\r\nIn 1996, Jordan, Donnie, and their wives are on a yacht trip to Italy when they learn that Emma has died. Jordan proceeds to Switzerland to forge her name and save the account. To bypass border controls, he orders his yacht captain to sail to Monaco, but the ship capsizes in a storm. After their rescue, the plane sent to take them to Geneva is destroyed when a seagull flies into the engine; Jordan takes this as a sign from God to address his worsening drug addiction and attempts to sober up.\r\nIn 1998, the FBI arrests Jordan because Saurel, detained for an unrelated offense, has informed the FBI about Jordan. Since the evidence against him is overwhelming, Jordan agrees to gather evidence on his colleagues in exchange for leniency. Naomi tells Jordan she is divorcing him and wants full custody of their daughter and infant son. In a cocaine-fueled rage, Jordan hits Naomi and tries to drive away with his daughter but crashes his car in the driveway.\r\nLater, Jordan wears a wire to work but slips a note to Donnie, warning him. The FBI discovers this, arrests Jordan, and raids and shuts down Stratton Oakmont. Despite breaching his deal, Jordan receives a reduced sentence of 36 months in a minimum security prison for his testimony and is released in 2000 after serving 22 months. After his release, Jordan makes a living hosting seminars on sales techniques.\r\nCast\r\nLeonardo DiCaprio as Jordan Belfort\r\nJonah Hill as Donnie Azoff\r\nMargot Robbie as Naomi Lapaglia\r\nKyle Chandler as FBI Agent Patrick Denham\r\nRob Reiner as Max Belfort\r\nJon Bernthal as Brad Bodnick\r\nMatthew McConaughey as Mark Hanna\r\nJon Favreau as Manny Riskin\r\nJean Dujardin as Jean-Jacques Saurel\r\nJoanna Lumley as Aunt Emma\r\nCristin Milioti as Teresa Petrillo\r\nChristine Ebersole as Leah Belfort\r\nShea Whigham as Captain Ted Beecham\r\nKatarina Čas as Chantalle Bodnick\r\nStephanie Kurtzuba as Kimmie Belzer\r\nP. J. Byrne as Nicky Koskoff\r\nKenneth Choi as Chester Ming\r\nBrian Sacca as Robbie Feinberg\r\nHenry Zebrowski as Alden Kupferberg\r\nEthan Suplee as Toby Welch\r\nJake Hoffman as Steve Madden\r\nMackenzie Meehan as Hildy Azoff\r\nBo Dietl as himself\r\nJon Spinogatti as Nicholas\r\nAya Cash as Janet\r\nJordan Belfort as Auckland Straight Line Host\r\nCatherine Curtin as FBI Agent\r\nStephen Kunken as Jerry Fogel\r\nBarry Rothbart as Peter DeBlasio\r\nWelker White as Waiter\r\nDanny Flaherty as Zip (Lude Buying Teenager #1)\r\nTed Griffin as Agent Hughes\r\nSteven Boyer and Danny A. Abeckaser as Investor Center Brokers\r\nJ. C. MacKenzie as Lucas Solomon\r\nAshlie Atkinson as Rochelle Applebaum\r\nGiselle Eisenberg as Skylar Belfort, Jordan and Naomi's daughter\r\nThomas Middleditch as Stratton Broker in a Bowtie\r\nFran Lebowitz as the Honorable Samantha Stogel\r\nSpike Jonze as Dwayne (uncredited)\r\nProduction\r\nDevelopment\r\nIn 2007, DiCaprio and Warner Bros. won a bidding war for the rights to Belfort's memoir The Wolf of Wall Street, with Belfort making $1 million off the deal. Having worked on the film's script, Scorsese was considered to direct the film but abandoned the project to work on Shutter Island (2010). He has said he \"wasted five months of life\" without getting a green light on production dates from Warner Bros. In 2010, Warner Bros. offered the directorial role to Ridley Scott, with DiCaprio playing Belfort, but the studio eventually abandoned the project.\r\nIn 2012, the independent company Red Granite Pictures greenlit the project without content restrictions. Scorsese came back on board. Red Granite Pictures also asked Paramount Pictures to distribute the film; Paramount agreed to do so in North America and Japan, but passed on the rest of the international market. Universal Pictures acquired the international distribution rights.\r\nAccording to Belfort, Random House asked him to tone down or excise the depictions of debauchery in his memoir before publication, especially those relating to his bachelor party, which featured zoophilia, and rampant use of drugs like nitrous oxide; neither the published memoir nor the film contains references to this.\r\nIn the film, most of the real-life characters' names have been changed from Belfort's original memoir. Donnie Azoff is based on Danny Porush. The name was changed after Porush threatened to sue the filmmakers. Porush maintains that much of the film is fictional and that Azoff is not an accurate depiction of him. Former Donna Karan Jeanswear CEO Elliot Lavigne does not appear in the film, but an incident recounted in the book, in which Belfort gives Lavigne mouth-to-mouth resuscitation to save him from choking to death, is similar to a scene in the film involving Donnie. The FBI agent Patrick Denham is the stand-in for real-life Gregory Coleman, and lawyer Manny Riskin is based on Ira Sorkin. Belfort's first wife, Denise Lombardo, is renamed Teresa Petrillo, and his second wife, Nadine Caridi, is Naomi Lapaglia on-screen. In contrast, Mark Hanna's name remains the same as the LF Rothschild stockbroker who, like Belfort, was convicted of fraud and served time in prison. Belfort's parents Max and Leah Belfort's names remained the same for the film. The role of Aunt Emma was initially offered to Julie Andrews, who refused it as she was recovering from an ankle injury, and was replaced by Joanna Lumley. In January 2014, Jonah Hill revealed in an interview with Howard Stern that he had made only $60,000 on the film (the lowest possible SAG-AFTRA rate for his amount of work), while DiCaprio (who also produced) received $10 million.\r\nFilming\r\nFilming began on August 8, 2012, in New York City. Hill announced on Twitter that his first day of shooting was September 4, 2012. Filming also took place in Closter, New Jersey, and Harrison, New York. Vitamin D powder was used as the fake substance for cocaine in the film; Hill was hospitalized with bronchitis due to snorting large quantities during filming.\r\nScorsese's longtime editor Thelma Schoonmaker, who has received seven Academy Award nominations for Best Film Editing, said the film would be shot digitally instead of on film. Scorsese had been a proponent of shooting on film, but decided to shoot Hugo digitally because it was being photographed in 3D. Despite being filmed in 2D, The Wolf of Wall Street was originally planned to be shot digitally. Schoonmaker expressed her disappointment with the decision: \"It would appear that we've lost the battle. I think Marty just feels it's unfortunately over, and there's been no bigger champion of film than him.\" After extensive comparison tests during pre-production, eventually the majority of the film was shot on film stock, while scenes that used green screen effects or low light were shot with the digital Arri Alexa camera system. The film contains 400–450 VFX shots.\r\nProfanity\r\nThe film set a Guinness World Record for the most instances of swearing in a motion picture. It uses the word \"fuck\" 506 times, \"cunt\" thrice, \"twat\" twice, \"fuckface\" once, and \"prick\" four times, averaging 2.81 profanities per minute. The previous record holders were Scorsese's 1995 gangster film Casino, which had 422 uses of the word, and the 1997 British film Nil by Mouth, which had 428. The record has since been broken by Swearnet: The Movie, which uses the word 935 times, but it still holds the record for a major theatrical release.\r\nThe film's distributor in the United Arab Emirates cut 45 minutes of scenes of swearing, religious profanity, drug use, and sex, and \"muted\" dialogue containing expletives. The National reported that filmgoers in the UAE believed the film should not have been shown rather than being edited so heavily.\r\nRelease\r\nTheatrical\r\nThe Wolf of Wall Street premiered at the Ziegfeld Theatre in New York City on December 17, 2013, followed by a wide release on December 25. Its original release date of November 15 was pushed back after cuts were made to reduce the runtime. On October 22, it was reported that the film was set for release that Christmas. On October 29, Paramount officially confirmed that the film would release on Christmas Day, with a runtime of 165 minutes. This was changed to 180 minutes on November 25. It was officially rated R by the Motion Picture Association for \"sequences of strong sexual content, graphic nudity, drug use and language throughout, and for some violence\". In the UK, the film received an 18 certificate from the British Board of Film Classification for \"very strong language, strong sex hard drug use\".\r\nThe film is banned in Kenya, Malaysia, Nepal, and Zimbabwe because of its scenes depicting sex and drugs and excessive profanity, and additional scenes have been cut in the versions playing in India. In Singapore, after cuts were made to an orgy scene as well as some religiously profane or denigrating language, the film was passed R21.\r\nThe release of The Wolf of Wall Street marked a shift in cinema history when Paramount became the first major studio to distribute movies to theaters exclusively in a digital format, eliminating 35mm film entirely. Anchorman 2: The Legend Continues was the last Paramount production to include a 35mm film version.\r\nHome media\r\nThe Wolf of Wall Street was released on DVD and Blu-ray on March 25, 2014. On January 27, 2014, it was announced that a four-hour director's cut would be attached to the home release. Paramount Pictures and Red Granite Pictures later announced that the home release would feature only the theatrical release. A 4K Ultra HD Blu-ray was released on December 14, 2021.\r\nReception\r\nBox office\r\nThe Wolf of Wall Street grossed $116.9 million in North America and $289 million internationally, for a total of $406.9 million, making it Scorsese's highest-grossing film worldwide. In North America, the film opened at number five in its first weekend, with $19.4 million in 3,387 theaters, behind The Hobbit: The Desolation of Smaug, Frozen, Anchorman 2: The Legend Continues, and American Hustle. In Australia, it is the highest grossing R-rated film, earning $12.96 million.\r\nCritical response\r\nOn Rotten Tomatoes, The Wolf of Wall Street holds an approval rating of 80% based on 289 reviews and an average rating of 7.80/10. The site's critical consensus reads, \"Funny, self-referential, and irreverent to a fault, The Wolf of Wall Street finds Martin Scorsese and Leonardo DiCaprio at their most infectiously dynamic.\" On Metacritic, the film has a weighted average score of 75 out of 100 based on 47 reviews, indicating \"generally favorable reviews\".\r\nPeter Travers of Rolling Stone magazine named The Wolf of Wall Street the third-best film of 2013, behind 12 Years a Slave and Gravity. Mick LaSalle of the San Francisco Chronicle wrote, \"it is the best and most enjoyable American film to be released this year.\" Richard Brody of The New Yorker called the film \"Olympian\", saying that if it was Scorsese's last film it \"would rank among the most harshly awe-inspiring farewells of the cinema.\" The Chicago Sun-Times's Richard Roeper gave the film a B+, calling it \"good, not great Scorsese\".\r\nDana Stevens of Slate was more critical, calling the film \"epic in size, claustrophobically narrow in scope.\" Marshall Fine of The Huffington Post argued that the story \"wants us to be interested in characters who are dull people to start with, made duller by their delusions of being interesting because they are high\". Some critics viewed the film as an irresponsible glorification of Belfort and his associates rather than a satirical takedown. DiCaprio defended the film, arguing that it does not glorify the excessive lifestyle it depicts.\r\nIn 2016, the film was ranked #78 on the BBC's 100 Greatest Films of the 21st Century list. In 2017, Richard Brody named The Wolf of Wall Street the second-best film of the 21st century so far, behind Jean-Luc Godard's In Praise of Love. In 2019, Brody named The Wolf of Wall Street the best film of the 2010s.\r\nAudience response\r\nThe film received an average grade of C on an A+ to F scale from audiences surveyed by CinemaScore, the lowest rating of any film opening that week. The Los Angeles Times argues that the film attracted conservative viewers because its marketing had a more moralistic tone than the film.\r\nChristina McDowell, daughter of Tom Prousalis, who worked closely with Belfort at Stratton Oakmont, wrote an open letter to Scorsese, DiCaprio, and Belfort, criticizing the film for insufficiently portraying the victims of Stratton Oakmont's financial crimes, disregarding the damage done to her family as a result, and giving celebrity status to people (Belfort and his partners, including her father) who do not deserve it.\r\nSteven Perlberg of Business Insider saw an advance screening of the film at a Regal Cinemas near the Goldman Sachs building with an audience of finance workers. Perlberg reported cheers from the audience at what he considered all the wrong moments, writing, \"When Belfort—a drug addict attempting to remain sober—rips up a couch cushion to get to his secret coke stash, there were cheers.\"\r\nFormer Assistant United States Attorney Joel M. Cohen, who prosecuted Belfort, criticized both the film and the book on which it is based. He said that he believes some of Belfort's claims were \"invented\": for instance, Belfort \"aggrandized his importance and reverence for him by others at his firm.\" He strongly criticized the film for not depicting the \"thousands of victims who lost hundreds of millions of dollars\", not accepting the filmmakers' argument that it would have diverted attention from the wrongdoers. He deplored the ending—\"beyond an insult\" to Belfort's victims—in which the real Belfort appears, while showing \"a large sign advertising the name of Mr. Belfort's real motivational speaking company\", and a positive depiction of Belfort uttering \"variants of the same falsehoods he trained others to use against his victims\".\r\nTop ten lists\r\nThe Wolf of Wall Street was listed on many critics' top ten lists for films released in 2013, and was chosen as one of the top ten films of the year by the American Film Institute. Metacritic analysis found the film was the ninth-most mentioned film on \"best of the year\" film rankings and the 22nd-most mentioned on \"best of the decade\" film rankings.\r\n1st – Sasha Stone, Awards Daily\r\n1st – Stephen Schaefer, Boston Herald\r\n1st – Richard Brody, The New Yorker (tied with To the Wonder)\r\n2nd – Wesley Morris, Grantland\r\n2nd – Mick LaSalle, San Francisco Chronicle\r\n2nd – Ben Kenigsberg, The A.V. Club\r\n3rd – James Berardinelli, Reelviews\r\n3rd – MTV\r\n3rd – Glenn Kenny, RogerEbert.com\r\n3rd – Peter Travers, Rolling Stone\r\n4th – Scott Feinberg, The Hollywood Reporter\r\n4th – Drew McWeeny, HitFix\r\n4th – Yahoo! Movies\r\n4th – Christopher Orr, The Atlantic\r\n4th – Barbara Vancheri, Pittsburgh Post-Gazette\r\n5th – Caryn James, Indiewire\r\n5th – Stephen Holden, The New York Times\r\n5th – Rex Reed, The New York Observer\r\n5th – Katey Rich, Vanity Fair\r\n5th – David Chen, /Film\r\n6th – TV Guide\r\n7th – Matt Zoller Seitz, RogerEbert.com\r\n7th – Film School Rejects\r\n7th – Todd McCarthy, The Hollywood Reporter\r\n7th – Scott Tobias, The Dissolve\r\n7th – Scott Mantz, Access Hollywood\r\n7th – Mark Mohan, The Oregonian\r\n7th – Sam Adams, The A.V. Club\r\n8th – Nathan Rabin, The Dissolve\r\n8th – Bill Goodykoontz, Arizona Republic\r\n8th – Randy Myers, San Jose Mercury News\r\n9th – Joe Neumaier, New York Daily News\r\n10th – Andrew O'Hehir, Salon.com\r\n10th – Jessica Kiang and Katie Walsh, Indiewire\r\n10th – A.O. Scott, The New York Times\r\n10th – Rene Rodriguez, Miami Herald\r\n10th – Marjorie Baumgarten, Austin Chronicle\r\n10th – Keith Uhlich, Time Out New York\r\nTop 10 – (unranked top 10 lists)\r\nTop 10 – James Verniere, Boston Herald\r\nTop 10 – Stephen Whitty, The Star-Ledger\r\nTop 10 – Joe Williams, St. Louis Post-Dispatch\r\nControversies\r\nUse of animals\r\nThe Wolf of Wall Street uses animals, including a chimpanzee, a lion, a snake, a fish, and dogs. The chimpanzee and the lion were provided by the Big Cat Habitat wildlife sanctuary in Sarasota County, Florida. The four-year-old chimpanzee Chance spent time with DiCaprio and learned to roller skate in three weeks. The sanctuary also provided a lion named Handsome because the trading company depicted in the film used a lion as its symbol. Danny Porush denied that there were any animals in the office, although he admitted to eating an employee's goldfish.\r\nIn December 2013, before the film premiered, the organization Friends of Animals criticized the use of the chimpanzee and organized a boycott of the film. Variety reported, \"Friends of Animals thinks the chimp ... suffered irreversible psychological damage after being forced to act.\" The Guardian commented on the increasing criticism of Hollywood's use of animals, writing, \"The Wolf of Wall Street's use of a chimpanzee arrives as Hollywood comes under ever-increasing scrutiny for its employment of animals on screen\". PETA also launched a campaign to highlight mistreatment of ape \"actors\" and to petition for DiCaprio not to work with great apes.\r\n1MDB scandal\r\nIn 2015, Red Granite Pictures and the film's financing became implicated in the 1Malaysia Development Berhad scandal, a major international corruption scandal that began in Malaysia. The Malaysian Anti-Corruption Commission (MACC) alleged the film was financed by money producer Riza Aziz stole from the Malaysian 1Malaysia Development Berhad (1MDB) sovereign wealth fund. Aziz is the stepson of then-Malaysian Prime Minister Najib Razak. Aziz was arrested in connection with the scandal and pleaded not guilty to money laundering charges in July 2019. According to court filings, a company owned by fugitive businessman Jho Low gave the film's producers a $9 million advance. Low was given a \"special thanks\" in the film's credits.\r\nThe film is part of a broader investigation into these illicit monetary movements, and in 2016 was named in a series of civil complaints the United States Department of Justice filed \"for having provided a trust account through which hundreds of millions of dollars belonging to the 1MDB fund were illicitly siphoned\". To settle the civil lawsuit, Red Granite Pictures agreed to pay the U.S. government $60 million with no \"admission of wrongdoing or liability on the part of Red Granite\". This settlement was part of a more expansive U.S. effort to seize approximately $1.7 billion in assets allegedly purchased with funds embezzled from 1MDB. In January 2020, Belfort sued Red Granite for $300 million, also wishing to void his rights deal; he said that he would never have sold the rights to Red Granite if he had known how the film was being financed.\r\nThematic controversy and debate\r\nVarious people have criticized the film as materialistic, encouraging greedy behavior, extreme wealth, and advocating for the infamous individuals portrayed in the film. Christina McDowell, whose father, Tom Prousalis, worked in association with Belfort, accused the filmmakers of \"exacerbating our national obsession with wealth and status and glorifying greed and psychopathic behavior\". She emphasized the gravity and significance of Belfort's crimes, saying that Wolf of Wall Street is a \"reckless attempt at continuing to pretend that these sorts of schemes are entertaining, even as the country is reeling from yet another round of Wall Street scandals\".\r\nAfter DiCaprio defended himself from criticism, Variety journalist Whitney Friedlander called the film \"three hours of cash, drugs, hookers, repeat\" and argued that the film is a \"celebration of this lifestyle\" and implies that short-lived extreme wealth and extraordinary experiences are superior to normal behavior.\r\nNikole TenBrink, vice president of marketing and membership at Risk and Insurance Management Society, has said the film is a \"cautionary tale of what can happen when fraud is left unchecked\". She describes Belfort's business acumen, his talent in communicating and selling his ideas, and his ability to motivate others as offering \"valuable lessons for risk professionals as they seek to avoid similar pitfalls\".\r\nBelfort's reaction\r\nBelfort said of the film's depiction of himself and Stratton Oakmont that it did an excellent job at describing the \"overall feeling\" of those years, adding, \"the camaraderie, the insanity, that was accurate\". Of his drug use, Belfort said that his actual habits were \"much worse\" than is depicted in the film and that he was \"on 22 different drugs at the end\".\r\nBelfort also analyzed the inaccuracies in the film's oversimplification of Stratton Oakmont's gradual transition from advocating for \"speculative stocks\" in order to \"help build America\" to committing crimes. He said he \"didn't like hearing\" overly simplified and blunt depictions of his crimes because \"it made me look like I was just trying to rip people off\". But Belfort did acknowledge the cinematic benefits of these oversimplifications as \"a very easy way in three hours\" to \"move the audience emotionally\".\r\nNadine Maculoso's reaction\r\nOn September 28, 2022, Nadine Maculoso, Belfort's ex-wife on whom the character Naomi was based, said that the depiction of Belfort and their relationship was accurate and that she hopes to educate people on signs of domestic abuse and toxic relationships.\r\nAccolades\r\nThe film was nominated for five Academy Awards: Best Picture, Best Director for Scorsese, Best Adapted Screenplay for Winter, Best Actor for DiCaprio, and Best Supporting Actor for Hill. It was also nominated for four BAFTAs, including Best Director, Best Actor and Best Adapted Screenplay, and two Golden Globe Awards, including Best Motion Picture – Musical or Comedy. DiCaprio won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy.\r\nSoundtrack\r\nThe film's soundtrack features both original and preexisting music tracks. It was released on December 17, 2013, for digital download. More than 60 songs are used in the film, but only 16 are on the official soundtrack. Among the notable exceptions are original compositions by Theodore Shapiro.",
    "html": "<p>The Wolf of Wall Street is a 2013 American epic biographical black comedy crime film directed by Martin Scorsese and written by Terence Winter, based on Jordan Belfort's 2007 memoir of the same name. It recounts Belfort's career as a stockbroker in New York City and how his firm, Stratton Oakmont, engaged in rampant corruption and fraud on Wall Street, leading to his downfall. Leonardo DiCaprio, who was also a producer of the film, stars as Belfort in his fifth collaboration with Scorsese following Gangs of New York (2002), The Aviator (2004), The Departed (2006) and Shutter Island (2010). The film also stars Jonah Hill as his business partner and friend Donnie Azoff, Margot Robbie as his second wife, Naomi Lapaglia, and Kyle Chandler as FBI agent Patrick Denham.</p><p>DiCaprio and Warner Bros. secured the rights to Belfort's memoir in 2007, with Scorsese set to direct, but content restrictions stalled production. The project was later greenlit by the independent production house Red Granite Pictures. Filming took place in late 2012 in New York City and was shot mostly on film stock.</p><p>The film premiered in New York City on December 17, 2013, and was released in the United States on December 25, 2013, by Paramount Pictures. It was the first major American film to be released exclusively through digital distribution. It was a major commercial success, grossing $406.9 million worldwide during its theatrical run, becoming Scorsese's highest-grossing film. The film was controversial for its moral ambiguity and lack of sympathy for victims, as well as explicit sexual content, extreme profanity, depiction of hard drug use, and use of animals during production. It set a Guinness World Record for the most instances of swearing in a film. The film's financing became implicated in the 1Malaysia Development Berhad corruption scandal; the U.S. Department of Justice and the Malaysian Anti-Corruption Commission investigated Red Granite Pictures, and producer Riza Aziz was arrested in 2019.</p><p>The film received positive reviews (and some moral censure) from critics and appeared on several \"best of the year\" lists. It was nominated for several awards, including five at the 86th Academy Awards ceremony: Best Picture, Best Director, Best Adapted Screenplay, Best Actor (for DiCaprio) and Best Supporting Actor (for Hill). DiCaprio won Best Actor – Musical or Comedy at the 71st Golden Globe Awards, where the film was also nominated for Best Picture – Musical or Comedy.</p><br/><h3>Plot</h3><p>In 1987, Jordan Belfort lands a job as a Wall Street stockbroker for L.F. Rothschild, employed under Mark Hanna. He is quickly enticed by the drug-fueled stockbroker culture and Hanna's belief that a broker's only goal is to make money for himself. Jordan loses his job following Black Monday, the largest one-day stock market drop in history, and takes a job at a boiler room brokerage firm on Long Island that specializes in penny stocks. He makes a small fortune thanks to his aggressive pitching style and the high commissions.</p><p>Jordan befriends his neighbor Donnie Azoff, and the two founded their own company. They recruit several of Jordan's friends, whom Jordan trains in the art of the \"hard sell\". Jordan's tactics and salesmanship largely contribute to the success of his pump and dump scheme, in which misleading, positive statements inflate a stock's price so it can be sold at an artificially high price. When the scheme's perpetrators sell their overvalued securities, the price plummets, and those who were conned into buying at the inflated price are left with stock that is suddenly worth much less than they paid for it. To cloak this, Jordan gives the firm the respectable-sounding name Stratton Oakmont in 1989.</p><p>After an exposé in Forbes, hundreds of ambitious young financiers flock to his company. Jordan becomes immensely successful and slides into a decadent lifestyle of prostitutes and drugs. He has an affair with a woman named Naomi Lapaglia; when his wife finds out, Jordan divorces her and marries Naomi in 1991. Meanwhile, the SEC and the FBI begin investigating Stratton Oakmont.</p><p>In 1993, Jordan illegally makes $22 million in three hours after securing the IPO of Steve Madden. This brings him and his firm further FBI attention. To hide his money, Jordan opens a Swiss bank account with corrupt banker Jean-Jacques Saurel in the name of Naomi's aunt Emma, who is a British subject and thus outside the immediate reach of American authorities. He uses the wife and in-laws of his friend Brad Bodnick, who have European passports, to smuggle the cash into Switzerland.</p><p>Donnie and Brad get into a heated argument in public during a money exchange, resulting in Brad's arrest, but Donnie escapes. Jordan learns from his private investigator that the FBI is wiretapping his phones. Fearing for his son, Jordan's father advises him to leave Stratton Oakmont and lie low while Jordan's lawyer negotiates a deal to keep him out of prison, but Jordan cannot bear to quit and talks himself into staying in the middle of his farewell speech.</p><p>In 1996, Jordan, Donnie, and their wives are on a yacht trip to Italy when they learn that Emma has died. Jordan proceeds to Switzerland to forge her name and save the account. To bypass border controls, he orders his yacht captain to sail to Monaco, but the ship capsizes in a storm. After their rescue, the plane sent to take them to Geneva is destroyed when a seagull flies into the engine; Jordan takes this as a sign from God to address his worsening drug addiction and attempts to sober up.</p><p>In 1998, the FBI arrests Jordan because Saurel, detained for an unrelated offense, has informed the FBI about Jordan. Since the evidence against him is overwhelming, Jordan agrees to gather evidence on his colleagues in exchange for leniency. Naomi tells Jordan she is divorcing him and wants full custody of their daughter and infant son. In a cocaine-fueled rage, Jordan hits Naomi and tries to drive away with his daughter but crashes his car in the driveway.</p><p>Later, Jordan wears a wire to work but slips a note to Donnie, warning him. The FBI discovers this, arrests Jordan, and raids and shuts down Stratton Oakmont. Despite breaching his deal, Jordan receives a reduced sentence of 36 months in a minimum security prison for his testimony and is released in 2000 after serving 22 months. After his release, Jordan makes a living hosting seminars on sales techniques.</p><br/><h3>Cast</h3><ul><li>Leonardo DiCaprio as Jordan Belfort</li><li>Jonah Hill as Donnie Azoff</li><li>Margot Robbie as Naomi Lapaglia</li><li>Kyle Chandler as FBI Agent Patrick Denham</li><li>Rob Reiner as Max Belfort</li><li>Jon Bernthal as Brad Bodnick</li><li>Matthew McConaughey as Mark Hanna</li><li>Jon Favreau as Manny Riskin</li><li>Jean Dujardin as Jean-Jacques Saurel</li><li>Joanna Lumley as Aunt Emma</li><li>Cristin Milioti as Teresa Petrillo</li><li>Christine Ebersole as Leah Belfort</li><li>Shea Whigham as Captain Ted Beecham</li><li>Katarina Čas as Chantalle Bodnick</li><li>Stephanie Kurtzuba as Kimmie Belzer</li><li>P. J. Byrne as Nicky Koskoff</li><li>Kenneth Choi as Chester Ming</li><li>Brian Sacca as Robbie Feinberg</li><li>Henry Zebrowski as Alden Kupferberg</li><li>Ethan Suplee as Toby Welch</li><li>Jake Hoffman as Steve Madden</li><li>Mackenzie Meehan as Hildy Azoff</li><li>Bo Dietl as himself</li><li>Jon Spinogatti as Nicholas</li><li>Aya Cash as Janet</li><li>Jordan Belfort as Auckland Straight Line Host</li><li>Catherine Curtin as FBI Agent</li><li>Stephen Kunken as Jerry Fogel</li><li>Barry Rothbart as Peter DeBlasio</li><li>Welker White as Waiter</li><li>Danny Flaherty as Zip (Lude Buying Teenager #1)</li><li>Ted Griffin as Agent Hughes</li><li>Steven Boyer and Danny A. Abeckaser as Investor Center Brokers</li><li>J. C. MacKenzie as Lucas Solomon</li><li>Ashlie Atkinson as Rochelle Applebaum</li><li>Giselle Eisenberg as Skylar Belfort, Jordan and Naomi's daughter</li><li>Thomas Middleditch as Stratton Broker in a Bowtie</li><li>Fran Lebowitz as the Honorable Samantha Stogel</li><li>Spike Jonze as Dwayne (uncredited)</li></ul><br/><h3>Production</h3><h4>Development</h4><p>In 2007, DiCaprio and Warner Bros. won a bidding war for the rights to Belfort's memoir The Wolf of Wall Street, with Belfort making $1 million off the deal. Having worked on the film's script, Scorsese was considered to direct the film but abandoned the project to work on Shutter Island (2010). He has said he \"wasted five months of life\" without getting a green light on production dates from Warner Bros. In 2010, Warner Bros. offered the directorial role to Ridley Scott, with DiCaprio playing Belfort, but the studio eventually abandoned the project.</p><p>In 2012, the independent company Red Granite Pictures greenlit the project without content restrictions. Scorsese came back on board. Red Granite Pictures also asked Paramount Pictures to distribute the film; Paramount agreed to do so in North America and Japan, but passed on the rest of the international market. Universal Pictures acquired the international distribution rights.</p><p>According to Belfort, Random House asked him to tone down or excise the depictions of debauchery in his memoir before publication, especially those relating to his bachelor party, which featured zoophilia, and rampant use of drugs like nitrous oxide; neither the published memoir nor the film contains references to this.</p><p>In the film, most of the real-life characters' names have been changed from Belfort's original memoir. Donnie Azoff is based on Danny Porush. The name was changed after Porush threatened to sue the filmmakers. Porush maintains that much of the film is fictional and that Azoff is not an accurate depiction of him. Former Donna Karan Jeanswear CEO Elliot Lavigne does not appear in the film, but an incident recounted in the book, in which Belfort gives Lavigne mouth-to-mouth resuscitation to save him from choking to death, is similar to a scene in the film involving Donnie. The FBI agent Patrick Denham is the stand-in for real-life Gregory Coleman, and lawyer Manny Riskin is based on Ira Sorkin. Belfort's first wife, Denise Lombardo, is renamed Teresa Petrillo, and his second wife, Nadine Caridi, is Naomi Lapaglia on-screen. In contrast, Mark Hanna's name remains the same as the LF Rothschild stockbroker who, like Belfort, was convicted of fraud and served time in prison. Belfort's parents Max and Leah Belfort's names remained the same for the film. The role of Aunt Emma was initially offered to Julie Andrews, who refused it as she was recovering from an ankle injury, and was replaced by Joanna Lumley. In January 2014, Jonah Hill revealed in an interview with Howard Stern that he had made only $60,000 on the film (the lowest possible SAG-AFTRA rate for his amount of work), while DiCaprio (who also produced) received $10 million.</p><h4>Filming</h4><p>Filming began on August 8, 2012, in New York City. Hill announced on Twitter that his first day of shooting was September 4, 2012. Filming also took place in Closter, New Jersey, and Harrison, New York. Vitamin D powder was used as the fake substance for cocaine in the film; Hill was hospitalized with bronchitis due to snorting large quantities during filming.</p><p>Scorsese's longtime editor Thelma Schoonmaker, who has received seven Academy Award nominations for Best Film Editing, said the film would be shot digitally instead of on film. Scorsese had been a proponent of shooting on film, but decided to shoot Hugo digitally because it was being photographed in 3D. Despite being filmed in 2D, The Wolf of Wall Street was originally planned to be shot digitally. Schoonmaker expressed her disappointment with the decision: \"It would appear that we've lost the battle. I think Marty just feels it's unfortunately over, and there's been no bigger champion of film than him.\" After extensive comparison tests during pre-production, eventually the majority of the film was shot on film stock, while scenes that used green screen effects or low light were shot with the digital Arri Alexa camera system. The film contains 400–450 VFX shots.</p><h4>Profanity</h4><p>The film set a Guinness World Record for the most instances of swearing in a motion picture. It uses the word \"fuck\" 506 times, \"cunt\" thrice, \"twat\" twice, \"fuckface\" once, and \"prick\" four times, averaging 2.81 profanities per minute. The previous record holders were Scorsese's 1995 gangster film Casino, which had 422 uses of the word, and the 1997 British film Nil by Mouth, which had 428. The record has since been broken by Swearnet: The Movie, which uses the word 935 times, but it still holds the record for a major theatrical release.</p><p>The film's distributor in the United Arab Emirates cut 45 minutes of scenes of swearing, religious profanity, drug use, and sex, and \"muted\" dialogue containing expletives. The National reported that filmgoers in the UAE believed the film should not have been shown rather than being edited so heavily.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>The Wolf of Wall Street premiered at the Ziegfeld Theatre in New York City on December 17, 2013, followed by a wide release on December 25. Its original release date of November 15 was pushed back after cuts were made to reduce the runtime. On October 22, it was reported that the film was set for release that Christmas. On October 29, Paramount officially confirmed that the film would release on Christmas Day, with a runtime of 165 minutes. This was changed to 180 minutes on November 25. It was officially rated R by the Motion Picture Association for \"sequences of strong sexual content, graphic nudity, drug use and language throughout, and for some violence\". In the UK, the film received an 18 certificate from the British Board of Film Classification for \"very strong language, strong sex hard drug use\".</p><p>The film is banned in Kenya, Malaysia, Nepal, and Zimbabwe because of its scenes depicting sex and drugs and excessive profanity, and additional scenes have been cut in the versions playing in India. In Singapore, after cuts were made to an orgy scene as well as some religiously profane or denigrating language, the film was passed R21.</p><p>The release of The Wolf of Wall Street marked a shift in cinema history when Paramount became the first major studio to distribute movies to theaters exclusively in a digital format, eliminating 35mm film entirely. Anchorman 2: The Legend Continues was the last Paramount production to include a 35mm film version.</p><h4>Home media</h4><p>The Wolf of Wall Street was released on DVD and Blu-ray on March 25, 2014. On January 27, 2014, it was announced that a four-hour director's cut would be attached to the home release. Paramount Pictures and Red Granite Pictures later announced that the home release would feature only the theatrical release. A 4K Ultra HD Blu-ray was released on December 14, 2021.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The Wolf of Wall Street grossed $116.9 million in North America and $289 million internationally, for a total of $406.9 million, making it Scorsese's highest-grossing film worldwide. In North America, the film opened at number five in its first weekend, with $19.4 million in 3,387 theaters, behind The Hobbit: The Desolation of Smaug, Frozen, Anchorman 2: The Legend Continues, and American Hustle. In Australia, it is the highest grossing R-rated film, earning $12.96 million.</p><h4>Critical response</h4><p>On Rotten Tomatoes, The Wolf of Wall Street holds an approval rating of 80% based on 289 reviews and an average rating of 7.80/10. The site's critical consensus reads, \"Funny, self-referential, and irreverent to a fault, The Wolf of Wall Street finds Martin Scorsese and Leonardo DiCaprio at their most infectiously dynamic.\" On Metacritic, the film has a weighted average score of 75 out of 100 based on 47 reviews, indicating \"generally favorable reviews\".</p><p>Peter Travers of Rolling Stone magazine named The Wolf of Wall Street the third-best film of 2013, behind 12 Years a Slave and Gravity. Mick LaSalle of the San Francisco Chronicle wrote, \"it is the best and most enjoyable American film to be released this year.\" Richard Brody of The New Yorker called the film \"Olympian\", saying that if it was Scorsese's last film it \"would rank among the most harshly awe-inspiring farewells of the cinema.\" The Chicago Sun-Times's Richard Roeper gave the film a B+, calling it \"good, not great Scorsese\".</p><p>Dana Stevens of Slate was more critical, calling the film \"epic in size, claustrophobically narrow in scope.\" Marshall Fine of The Huffington Post argued that the story \"wants us to be interested in characters who are dull people to start with, made duller by their delusions of being interesting because they are high\". Some critics viewed the film as an irresponsible glorification of Belfort and his associates rather than a satirical takedown. DiCaprio defended the film, arguing that it does not glorify the excessive lifestyle it depicts.</p><p>In 2016, the film was ranked #78 on the BBC's 100 Greatest Films of the 21st Century list. In 2017, Richard Brody named The Wolf of Wall Street the second-best film of the 21st century so far, behind Jean-Luc Godard's In Praise of Love. In 2019, Brody named The Wolf of Wall Street the best film of the 2010s.</p><h4>Audience response</h4><p>The film received an average grade of C on an A+ to F scale from audiences surveyed by CinemaScore, the lowest rating of any film opening that week. The Los Angeles Times argues that the film attracted conservative viewers because its marketing had a more moralistic tone than the film.</p><p>Christina McDowell, daughter of Tom Prousalis, who worked closely with Belfort at Stratton Oakmont, wrote an open letter to Scorsese, DiCaprio, and Belfort, criticizing the film for insufficiently portraying the victims of Stratton Oakmont's financial crimes, disregarding the damage done to her family as a result, and giving celebrity status to people (Belfort and his partners, including her father) who do not deserve it.</p><p>Steven Perlberg of Business Insider saw an advance screening of the film at a Regal Cinemas near the Goldman Sachs building with an audience of finance workers. Perlberg reported cheers from the audience at what he considered all the wrong moments, writing, \"When Belfort—a drug addict attempting to remain sober—rips up a couch cushion to get to his secret coke stash, there were cheers.\"</p><p>Former Assistant United States Attorney Joel M. Cohen, who prosecuted Belfort, criticized both the film and the book on which it is based. He said that he believes some of Belfort's claims were \"invented\": for instance, Belfort \"aggrandized his importance and reverence for him by others at his firm.\" He strongly criticized the film for not depicting the \"thousands of victims who lost hundreds of millions of dollars\", not accepting the filmmakers' argument that it would have diverted attention from the wrongdoers. He deplored the ending—\"beyond an insult\" to Belfort's victims—in which the real Belfort appears, while showing \"a large sign advertising the name of Mr. Belfort's real motivational speaking company\", and a positive depiction of Belfort uttering \"variants of the same falsehoods he trained others to use against his victims\".</p><h4>Top ten lists</h4><p>The Wolf of Wall Street was listed on many critics' top ten lists for films released in 2013, and was chosen as one of the top ten films of the year by the American Film Institute. Metacritic analysis found the film was the ninth-most mentioned film on \"best of the year\" film rankings and the 22nd-most mentioned on \"best of the decade\" film rankings.</p><ul><li>1st – Sasha Stone, Awards Daily</li><li>1st – Stephen Schaefer, Boston Herald</li><li>1st – Richard Brody, The New Yorker (tied with To the Wonder)</li></ul><ul><li>2nd – Wesley Morris, Grantland</li><li>2nd – Mick LaSalle, San Francisco Chronicle</li><li>2nd – Ben Kenigsberg, The A.V. Club</li></ul><ul><li>3rd – James Berardinelli, Reelviews</li><li>3rd – MTV</li><li>3rd – Glenn Kenny, RogerEbert.com</li><li>3rd – Peter Travers, Rolling Stone</li></ul><ul><li>4th – Scott Feinberg, The Hollywood Reporter</li><li>4th – Drew McWeeny, HitFix</li><li>4th – Yahoo! Movies</li><li>4th – Christopher Orr, The Atlantic</li><li>4th – Barbara Vancheri, Pittsburgh Post-Gazette</li></ul><ul><li>5th – Caryn James, Indiewire</li><li>5th – Stephen Holden, The New York Times</li><li>5th – Rex Reed, The New York Observer</li><li>5th – Katey Rich, Vanity Fair</li><li>5th – David Chen, /Film</li></ul><ul><li>6th – TV Guide</li></ul><ul><li>7th – Matt Zoller Seitz, RogerEbert.com</li><li>7th – Film School Rejects</li><li>7th – Todd McCarthy, The Hollywood Reporter</li><li>7th – Scott Tobias, The Dissolve</li><li>7th – Scott Mantz, Access Hollywood</li><li>7th – Mark Mohan, The Oregonian</li><li>7th – Sam Adams, The A.V. Club</li></ul><ul><li>8th – Nathan Rabin, The Dissolve</li><li>8th – Bill Goodykoontz, Arizona Republic</li><li>8th – Randy Myers, San Jose Mercury News</li></ul><ul><li>9th – Joe Neumaier, New York Daily News</li></ul><ul><li>10th – Andrew O'Hehir, Salon.com</li><li>10th – Jessica Kiang and Katie Walsh, Indiewire</li><li>10th – A.O. Scott, The New York Times</li><li>10th – Rene Rodriguez, Miami Herald</li><li>10th – Marjorie Baumgarten, Austin Chronicle</li><li>10th – Keith Uhlich, Time Out New York</li></ul><ul><li>Top 10 – (unranked top 10 lists)</li><li>Top 10 – James Verniere, Boston Herald</li><li>Top 10 – Stephen Whitty, The Star-Ledger</li><li>Top 10 – Joe Williams, St. Louis Post-Dispatch</li></ul><h4>Controversies</h4><h4>Use of animals</h4><p>The Wolf of Wall Street uses animals, including a chimpanzee, a lion, a snake, a fish, and dogs. The chimpanzee and the lion were provided by the Big Cat Habitat wildlife sanctuary in Sarasota County, Florida. The four-year-old chimpanzee Chance spent time with DiCaprio and learned to roller skate in three weeks. The sanctuary also provided a lion named Handsome because the trading company depicted in the film used a lion as its symbol. Danny Porush denied that there were any animals in the office, although he admitted to eating an employee's goldfish.</p><p>In December 2013, before the film premiered, the organization Friends of Animals criticized the use of the chimpanzee and organized a boycott of the film. Variety reported, \"Friends of Animals thinks the chimp ... suffered irreversible psychological damage after being forced to act.\" The Guardian commented on the increasing criticism of Hollywood's use of animals, writing, \"The Wolf of Wall Street's use of a chimpanzee arrives as Hollywood comes under ever-increasing scrutiny for its employment of animals on screen\". PETA also launched a campaign to highlight mistreatment of ape \"actors\" and to petition for DiCaprio not to work with great apes.</p><h4>1MDB scandal</h4><p>In 2015, Red Granite Pictures and the film's financing became implicated in the 1Malaysia Development Berhad scandal, a major international corruption scandal that began in Malaysia. The Malaysian Anti-Corruption Commission (MACC) alleged the film was financed by money producer Riza Aziz stole from the Malaysian 1Malaysia Development Berhad (1MDB) sovereign wealth fund. Aziz is the stepson of then-Malaysian Prime Minister Najib Razak. Aziz was arrested in connection with the scandal and pleaded not guilty to money laundering charges in July 2019. According to court filings, a company owned by fugitive businessman Jho Low gave the film's producers a $9 million advance. Low was given a \"special thanks\" in the film's credits.</p><p>The film is part of a broader investigation into these illicit monetary movements, and in 2016 was named in a series of civil complaints the United States Department of Justice filed \"for having provided a trust account through which hundreds of millions of dollars belonging to the 1MDB fund were illicitly siphoned\". To settle the civil lawsuit, Red Granite Pictures agreed to pay the U.S. government $60 million with no \"admission of wrongdoing or liability on the part of Red Granite\". This settlement was part of a more expansive U.S. effort to seize approximately $1.7 billion in assets allegedly purchased with funds embezzled from 1MDB. In January 2020, Belfort sued Red Granite for $300 million, also wishing to void his rights deal; he said that he would never have sold the rights to Red Granite if he had known how the film was being financed.</p><h4>Thematic controversy and debate</h4><p>Various people have criticized the film as materialistic, encouraging greedy behavior, extreme wealth, and advocating for the infamous individuals portrayed in the film. Christina McDowell, whose father, Tom Prousalis, worked in association with Belfort, accused the filmmakers of \"exacerbating our national obsession with wealth and status and glorifying greed and psychopathic behavior\". She emphasized the gravity and significance of Belfort's crimes, saying that Wolf of Wall Street is a \"reckless attempt at continuing to pretend that these sorts of schemes are entertaining, even as the country is reeling from yet another round of Wall Street scandals\".</p><p>After DiCaprio defended himself from criticism, Variety journalist Whitney Friedlander called the film \"three hours of cash, drugs, hookers, repeat\" and argued that the film is a \"celebration of this lifestyle\" and implies that short-lived extreme wealth and extraordinary experiences are superior to normal behavior.</p><p>Nikole TenBrink, vice president of marketing and membership at Risk and Insurance Management Society, has said the film is a \"cautionary tale of what can happen when fraud is left unchecked\". She describes Belfort's business acumen, his talent in communicating and selling his ideas, and his ability to motivate others as offering \"valuable lessons for risk professionals as they seek to avoid similar pitfalls\".</p><h4>Belfort's reaction</h4><p>Belfort said of the film's depiction of himself and Stratton Oakmont that it did an excellent job at describing the \"overall feeling\" of those years, adding, \"the camaraderie, the insanity, that was accurate\". Of his drug use, Belfort said that his actual habits were \"much worse\" than is depicted in the film and that he was \"on 22 different drugs at the end\".</p><p>Belfort also analyzed the inaccuracies in the film's oversimplification of Stratton Oakmont's gradual transition from advocating for \"speculative stocks\" in order to \"help build America\" to committing crimes. He said he \"didn't like hearing\" overly simplified and blunt depictions of his crimes because \"it made me look like I was just trying to rip people off\". But Belfort did acknowledge the cinematic benefits of these oversimplifications as \"a very easy way in three hours\" to \"move the audience emotionally\".</p><h4>Nadine Maculoso's reaction</h4><p>On September 28, 2022, Nadine Maculoso, Belfort's ex-wife on whom the character Naomi was based, said that the depiction of Belfort and their relationship was accurate and that she hopes to educate people on signs of domestic abuse and toxic relationships.</p><h4>Accolades</h4><p>The film was nominated for five Academy Awards: Best Picture, Best Director for Scorsese, Best Adapted Screenplay for Winter, Best Actor for DiCaprio, and Best Supporting Actor for Hill. It was also nominated for four BAFTAs, including Best Director, Best Actor and Best Adapted Screenplay, and two Golden Globe Awards, including Best Motion Picture – Musical or Comedy. DiCaprio won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy.</p><br/><h3>Soundtrack</h3><p>The film's soundtrack features both original and preexisting music tracks. It was released on December 17, 2013, for digital download. More than 60 songs are used in the film, but only 16 are on the official soundtrack. Among the notable exceptions are original compositions by Theodore Shapiro.</p><br/>"
  },
  "errorMessage": ""
}