{
  "imDbId": "tt0041959",
  "title": "The Third Man",
  "fullTitle": "The Third Man (1949)",
  "type": "Movie",
  "year": "1949",
  "items": [
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw3409638",
      "warningSpoilers": false,
      "date": "6 February 2016",
      "rate": "10",
      "helpful": "62 out of 75 found this helpful.",
      "title": "fantastic film that takes place in postwar Vienna",
      "content": "Even today in Vienna, one can take the \"Third Man Tour\" (Der Dritte Man) except, of course, that Orson Welles wouldn't go into the Viennese sewers and those scenes were done in England. There were actual sewer scenes with a double. Never mind, it is still a magnificent black and white film 99% filmed in Vienna. Directed by Carol Reed, it stars Joseph Cotten, Orson Welles, and Alida Valli.Western novelist Holly Martins (Cotten) comes to Vienna at the behest of his old friend Harry Lime, but when he arrives, he learns that Lime is dead after being hit by a car. He investigates and finds the circumstances very strange indeed, especially when learning there was a third man that helped carry Harry's body to the sidewalk, a man who has since disappeared.He then meets Harry's girlfriend (Alida Valli). And he also meets a police officer in the British section of Vienna, Inspector Calloway (Trevor Howard), who tells him that Harry was a murderer and a racketeer, and it's better that he's dead. Holly is shocked and demands proof.One of the most atmospheric films ever made, with its zither music, cinematography, and Vienna at nighttime. Then there's some brilliant dialogue, particularly the \"cuckoo clock\" speech made by Orson Welles.The cinematography is particularly striking: odd angles, back lighting, and shadows on empty streets. And who can forget the man hidden in the doorway, when the light from an apartment goes on and shows his face - certainly one of the great appearances of a star in a film.One feels Lime's presence throughout the film, though he only has five minutes of screen time.Though none of these actors were the first choice to play their roles, they are all excellent.There was a Third Man TV series in 1959 that ran for six years and starred Michael Rennie as Lime. In the series, Lime is a hero. He's no hero in the movie, but it is a powerful story and film, never forgotten once seen."
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw3352090",
      "warningSpoilers": false,
      "date": "9 November 2015",
      "rate": "",
      "helpful": "15 out of 16 found this helpful.",
      "title": "A Few Personal Notes",
      "content": "No need to recap the oft-repeated plot. So why bother commenting after 500+ reviews. I guess it's because I'm a movie lover and want to enter my little note of appreciation. What sticks in my mind from the movie's first release are the visuals. They're among the most memorable if not the most memorable in film annals. In sum, they're a nightmare world of emptiness-the streets, the walkways, the dead hulking edifices. It's a communal world emptied of community, leaving only ruins and shells. The metaphor for a post-war Europe is unmistakable, while only the morally destitute like Harry Lime have thrived. I can't imagine that filming in color was actually entertained (IMDB). Had that happened, the film would have passed into semi-obscurity unlike its now celebrated status. Note too, that no one ends up happy, in contrast to narrative norms of the day. I think what brought many folks to showings at the time was the unfamiliar zither music. As I recall, a commercial cut was heard regularly on the radio. Still, I expect a lot of folks left the theater put-off by the bleakly unhappy world they had just seen. Anyway, the movie remains a brilliant slice of cinematic imagination and should not be missed."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3370020",
      "warningSpoilers": true,
      "date": "11 December 2015",
      "rate": "10",
      "helpful": "99 out of 119 found this helpful.",
      "title": "Simply Beautiful",
      "content": "I don't know why this movie always hooks me the way it does; it's obviously a masterpiece and a revered piece of British/American cinema - but that alone is not the reason (there are other such masterpieces which fail to have that effect on me). Maybe it's the setting: the beautiful city of Vienna right after World War II, the scars of the most devastating conflict in human history still visible at every corner. Or it's the contrast between the eerily happy music tune - which plays throughout the entire film - and the dark, tragic story of murder and betrayal which I find so strangely captivating. Whatever it is, I just love this movie.'The Third Man' now has more than 60 years on its back, but its age hardly shows. Despite the story's dark themes, the general mood of the narrative is rather light, sometimes darkly funny, and the slightly cynical tone and morally ambiguous characters give the movie a very modern feel. What also stands out and makes the film memorable - in addition to the fantastic soundtrack - is the outstanding, Accademy Award winning cinematography. Black and white has rarely looked better. The way DOP Robert Krasker plays with unusual angles and virtually \"paints\" this city of Vienna with light and shadow, he adds an almost expressionistic quality to the film. I always felt that the city plays an essential part in the story, - a key character if you will - with its damaged buildings reflecting the damaged human characters. The recent war is a looming presence throughout the film, and to me this is as much a story about the desensitizing effect of war on people as it is a murder mystery. And there is yet another quality to the film which needs to be mentioned: it's very entertaining. 'The Third Man' has fantastic pacing and there is simply not a dull moment in it. To sum up my overall impressions, this is one of those rare occasions where everything just falls right into place and helps create a unique film experience: Carol Reed's masterful direction and the wonderful performances by the fantastic actors (Joseph Cotten, Trevor Howard, Alida Valli and Orson Welles); the beautiful soundtrack by Anton Karas; the gorgeous cinematography by Robert Krasker, and, perhaps most importantly, the story and screenplay by Graham Greene with its unexpected twists and turns (although the unusual, iconic ending wasn't Greene's idea). A true work of art and highly enjoyable entertainment: 10 stars out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/"
    },
    {
      "username": "frankwiener",
      "userUrl": "https://www.imdb.com/user/ur50944569",
      "reviewLink": "https://www.imdb.com/review/rw3569505",
      "warningSpoilers": false,
      "date": "26 October 2016",
      "rate": "9",
      "helpful": "46 out of 54 found this helpful.",
      "title": "Vienna Without a Waltz",
      "content": "Although I am as old as this movie, produced in 1949, I have not aged nearly as well. This film, directed brilliantly by Carol Reed (\"Odd Man Out\", \"The Fallen Idol\") and written by Graham Greene, who created a long list of memorable cinematic scripts, ingeniously captures the prevailing atmosphere of disruption and chaos that Vienna, a once highly civilized city, experienced during the years that followed World War II. The upheaval is physical, social, economic, political, moral, spiritual. You name it. Vanquished Vienna, conquered by the Allies, was crippled by turmoil in every imaginable way, and we viewers are given the opportunity to experience it up close, right here.I spent a number of months in Europe after I graduated from college in 1971. Although the war had been over for more than 25 years by then, I was struck by a very pronounced attitude of cynicism on the part of many Europeans regarding uniquely American ideals and principles, which were widely considered to be naive. To me, this film accurately captures this cultural and moral conflict, which lasted for decades and may even survive to this day. \"You and your American principles,\" they would often scoff at me with mocking derision. In many ways, the character of Holly Martins (Joseph Cotten), an American who crashes into post-World War II Europe, is a victim of a serious cultural divide. Unlike the Europeans, Martins always has the option of fleeing from the chaos and returning to the United States. For that alone, he may be resented by the local Viennese.What does Anna (Alida Valli) know about the illegal activities of her lover, Harry Lime (Orson Welles), which includes the sale of diluted penicillin to Vienna's hospitals? For children with meningitis, watered down penicillin was not only useless, but it created an immunity from full strength penicillin so that these afflicted children could never receive effective treatment. Corrupted penicillin is a glaring symbol of a totally corrupted Vienna. Harry surely understands the consequences of his business, but what about Anna? Even after the truth about Harry's conduct is clearly revealed to her, she still sticks by him to the bitter end. Love conquers all? Stand by your man, regardless of the misery that he is causing to his innocent victims? While I don't blame her for rejecting the romantic overtures of Martins, who is somewhat of a schnook, what's with her anyway? She reminds me of the Europeans who never once caught a whiff of the burning flesh from the overworked crematoria of the concentration camps that blackened the air all around them. She is deeply in love with Harry, so just shut up about children with meningitis. OK, Anna, whatever you say, sweetheart. Perhaps those silly 18th century costume comedies in which you appear will provide the escape from reality that you so desperately seek. At least you manage to crack a weak, forced smile on stage, which is the only smile that we will ever see from you.From beginning to end, the unusual camera angles, the dark, somber, haunting sidewalks of Vienna, and the conquered city's eerie, drenched cobblestone streets contribute to the overall foreboding atmosphere of the film, which was remarkably photographed by Australian Robert Krasker (\"Odd Man Out\", \"Brief Encounter\"). From every direction and without advance notice, unforgettable images and characters appear before us, emphasizing an overall mood of mayhem and unpredictability. We witness, for example, Anna's landlady, draped in a bedspread for warmth in a state of deep distress by the sudden invasion of her house by \"officials\" representing not one foreign nation but four of them. Then we observe a ludicrous, bureaucratic \"cultural re-education conference\" offered to the Viennese by the allied victors, presumably to rehabilitate them after seven years of Nazi domination. And from where on earth did the balloon seller come as he pathetically peddles his merry merchandise on the dark, abandoned streets of Vienna, which are not only completely void of children at the time but of all people?And what of the inquisitive, confused character of Holly Martins, played with the usual, smooth agility of Joseph Cotten? As the writer of mass marketed western novels that even a young British sergeant happens to read, why is he broke, and what kind of job would Lime have offered him in an unfamiliar, German-speaking Vienna that is gripped by post-war disorder, unemployment, and foreign occupation? Construction work, perhaps?While some reviewers disliked the zither music of Anton Karas, I think that the unique, high pitched sound contributes to the general atmosphere of nervous tension and uneasiness that prevails. Would you prefer Strauss waltzes instead? They wouldn't be nearly as effective in conveying the overwhelming atmosphere of chaos, even insanity, that plagues Vienna on so many levels at the time.Finally, we are brought to the hidden network of grand Vienna's underground sewers. What could be a more fitting symbol of the underlying foulness that lurks beneath the thin, shallow surface of what we call \"civilization\"? This subterranean labyrinth provides the perfect setting for the ending of an extraordinary film that very effectively portrays a world that has succumbed to a state of disorder, misery, and even madness. Ultimately, it is all destined for the sewer. Bal-loon?"
    },
    {
      "username": "Teyss",
      "userUrl": "https://www.imdb.com/user/ur63950427",
      "reviewLink": "https://www.imdb.com/review/rw3442708",
      "warningSpoilers": true,
      "date": "31 March 2016",
      "rate": "10",
      "helpful": "65 out of 75 found this helpful.",
      "title": "Confused ethics in a devastated world",
      "content": "\"The Third Man\" is widely considered as the best British film ever (e.g. British Film Institute 1999 poll, Sight & Sound polls). It is a landmark in worldwide cinema notably for its unique mix of genres: historical, thriller, tragedy, comedy. And it is a brilliant reflection about ethics.The movie is not adapted from a pre-existing book: when Graham Greene was tasked to write the screenplay, he wrote a novel to have a fully consistent plot that he immediately adapted for the screen. As Greene modestly admitted in the foreword he wrote afterwards: \"The film, in fact, is better than the story because it is in this case the finished state of the story.\" The book and the movie plots are similar, although there are a few significant variances: for instance, the novel is narrated by Calloway and ends differently (on the latter, see below).HISTORY & TRAGEDYThe movie starts as a historical account of post-war Vienna: the opening speech portrays chaos in Europe; we see footage of the destroyed city, divided into four zones. The plot revolves around black market, some relatively harmless (clothes, watches, cigarettes, etc.), some deadly like penicillin, which is historically accurate. Depiction is first realistic; we are lost like Holly is: many dialogues are in German without subtitles. Some scenes are tragic, notably the one in the children's hospital. Also, Anna's grief about Harry's death is touching.THRILLER & COMEDYRapidly, the movie evolves into a thriller with most ingredients of Noir genre: murders (the porter, Harbin), chases (Holly and Anna, Holly, Harry), numerous night scenes, plot twists, mysteries. Was Harry victim of an accident or a murder? Who was the third man? (This mystery remains unsolved, although it probably was Harry himself.) Where is Harry now?Nonetheless, comical elements are continuously present, except at the end. Holly is a small-time writer of cheap novellas, getting drunk, attracting trouble and failing with women. Many dialogues are funny. Some figures are farcical: Kurtz, customers at the club, Anna's landlady, the balloon-seller, etc. The excellent score adds a sarcastic tone to the whole story (although it is sometimes too present, which partly spoils scenes that would have been better off silent and conversely reduces the impact of music when appropriate).The combination of these styles is easy but efficient. A few examples: The police come twice to Anna's apartment for serious matters (search, arrest)... and each time they are lengthily slammed by the grumpy landlady.The annoying child pointlessly accuses Holly... which triggers a chase against Holly and Anna.Holly is brutally driven by a taxi to an unknown destination and thinks he will be killed. But he is actually dropped at a conference... that is a comical disaster. However two killers show up so he has to run... and gets bitten by a parrot!The police are waiting to arrest Harry. He seems to be coming around the corner... but it is a balloon-seller! The Sergeant has to buy a balloon to drive him away.ETHICSAbove all these elements, the motif of good versus evil is dominant. We see a shattered world that has lost its moral compass: material distress breeds ethical crisis. References are blurred. The porter points up to designate hell and down for paradise.Anna tells the Major \"You have everything upside down.\"She twice calls Holly \"Harry\".She symbolically casts dice in Harry's apartment: fate is random.A key scene occurs in the Ferris wheel where the world seems to turn around.The sewer with its foul smell ends up in the romantic blue Danube, as the Sergeant highlights.In this chaotic environment, some cynically take advantage, some stick to their values: Harry and Holly, once friends, are antagonists. But is it so simple? Characters are ambiguous. Holly is on the good side, yet changes his mind three times about helping the police (no/yes/no/yes). And because of his blunders the porter and the Sergeant get killed.The Major who enforces the law blackmails Anna: information or deportation by the Soviets.Anna who is decent loves the criminal Harry regardless. She even says: \"He is still a part of me.\" She wears his pyjamas. This double-sidedness is shown by the fact she is an actress playing a different person on stage, with a blonde wig.The main villain is seducing. He first is mysterious: he briefly appears after 1h05 and disappears. He fully shows 10 minutes later and turns out to be extremely intelligent. His speech in the wheel is at the same time ignominious and rhetorically impressive. It is not easy to answer the question: why do we stay virtuous? Revealingly, the \"honest\" Holly remains silent at that moment. Orson Welles' performance is so outstanding that we think he appears on screen for longer than an actual cumulated five minutes. On top of being a great director, he was a great actor.Visually, the historical and moral instability is expressed by frequent darkness, disproportionate shadows and tilted shots, where we constantly feel buildings and characters are going to fall (these shots being too recurrent, by the way). Side note: for night scenes, the cobblestone streets were systematically watered to enhance contrasts.DAZZLING DOUBLE ENDINGEventually, the movie rightfully ends in the sewer. Aesthetically stunning, this sequence is metaphorical in different ways: The underground is where criminals escape the law by crossing borders: it represents the vile underlying part of this confused society. Evil is not East or West; it is not related to countries; it is everywhere. When everybody but Anna goes down there, they want to extirpate evil from its roots.Harry in black and policemen in white sometimes are only a few meters away, illustrating the above-mentioned ambiguity about good and evil.When Harry is looking for a way out, voices emerge from dark tunnels that look like funerary steles: it is as if he guiltily heard the people he murdered talking to him.The sewer feels anthropomorphic: complex, dark, liquid, with different levels and small tubes. Hence figuratively characters dive inside their subconscious to be confronted to their evil part: Holly faces his alter ego Harry for the last time. Their gazes are similarly intense. Harry nods to Holly, a sign of agreement. In the final image, Holly's silhouette in the tunnel resembles Harry's previously.This famous climatic sequence is followed by one of the greatest closing shots in cinema history: after the funeral, Holly waits for Anna. The image is deep, in the axis of the road; music plays softly; leaves are falling; Anna is a small figure that progressively grows bigger. Slowly, she just walks past Holly without looking at him and moves out of the frame. He is left alone. (It constitutes an important difference with the novel, which ends happily: Holly and Anna eventually walk together arm in arm. But Carol Reed thankfully imposed his ending. Greene ultimately admitted it was better.)It is a dazzling shot, sharply contrasting with the previous sequence: bright, slow, silent, empty, melancholic, whilst the sewer sequence was dark, hectic, noisy, suffocating, cruel. It perfectly crowns this masterpiece: Anna despises Holly for his law-abiding betrayal. That's one of the banes of life: we sometimes prefer charismatic devils to honest fools, and love is blind."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw2084009",
      "warningSpoilers": false,
      "date": "20 June 2009",
      "rate": "9",
      "helpful": "60 out of 84 found this helpful.",
      "title": "That Terrific B&W Cinematography",
      "content": "In a bombed-out Vienna just after WWII, novelist Holly Martins (Joseph Cotten) arrives from America to renew a friendship with his childhood buddy, Harry Lime (Orson Welles). Much to the dismay of Holly, a freak auto accident has recently killed his friend, according to those who knew Harry.But in searching for details of Lime's death, Holly gets contradictory stories that don't add up. One of the persons who knew Lime is an attractive woman named Anna Schmidt (Alida Valli) whose continued presence in the story invites suspicion. The film's plot has Holly searching for the truth about his friend, while trying to stave off a city detective, Major Calloway (Trevor Howard) who tries to persuade Holly to leave Vienna.The film's story is okay. But what makes \"The Third Man\" really interesting is the B&W cinematography, by Robert Krasker. Unlike most films, camera movement here is restricted, so as to draw attention to each frame's geometry. Typically in this film, a frame is tilted at an angle so that both vertical and horizontal points of reference are off-kilter. Frame images thus become a series of diagonal straight lines and curves. Further, very high-contrast lighting, especially in outdoor scenes at night, creates a bizarre, almost nightmarish look and feel, and are suggestive of German Expressionism.All of which results in a visual disorientation for viewers that parallels Holly's disorientation both in the streets of Vienna and in his understanding of the circumstances surrounding Lime's absence. In most outdoor scenes there's a conspicuous lack of crowds, a lack of hubbub one would expect in a bustling city. Instead, only a few secondary characters appear in night scenes. This sparseness in characters on the streets conveys the impression that hidden eyes are watching Holly, ready to pounce at any moment from out of dark shadows.\"Everybody ought to (be) careful in a city like this\", says one character to Holly, as an implied threat. Soon, a man who wants to give Holly some valuable information is murdered.The script's dialogue is quite impressive, with some interesting lines and points of view. Some of the dialogue is in German, which enhances authenticity.The film's acting and editing are very, very good. Adding a slightly romantic, and at times melancholy, tone to this dark film is the music of the \"zither\", an instrument similar to a guitar, but sounding quite different.My one complaint about this film is that it's hard to keep tabs on some of the background characters. Trying to connect names with faces can be difficult, resulting in some confusion.\"The Third Man\" tells an interestingly bleak story, set in a bleak, desolate urban environment, rendered truly mesmerizing by the creatively surreal B&W cinematography."
    },
    {
      "username": "uds3",
      "userUrl": "https://www.imdb.com/user/ur1318549",
      "reviewLink": "https://www.imdb.com/review/rw0041187",
      "warningSpoilers": false,
      "date": "29 March 2002",
      "rate": "",
      "helpful": "169 out of 260 found this helpful.",
      "title": "The real mccoy when you want to talk serious screen legends!",
      "content": "What IS it makes THE THIRD MAN the classic most everyone agrees it is? (And lets face it, voted no 35 in the top all-time films gives it MORE than just some passing credibility!) Is it Orson Welles' menace? The whiff of corruption in occupied post-war Vienna? the cuckoo-clock speech atop the big wheel? even Anton Karras' zither? Perhaps ALL these things? If however, you had to nominate just a single influence within the whole production that elevates it to greatness I suggest that would be Robert Krasker's cinematography. The finished product innovatively, was years ahead of its birthright. Time and time again the viewer is bailed up by stunning camera angles and back-lighting. The eerie shadows around the deserted streets and of course the unforgettable first glimpse of Harry Lime (Welles) himself as he skulks like the rat he is, in the corner of the building, lit in close-up suddenly from the light in an adjacent apartment. Offhand I cannot think of a character's more dramatic entrance to a film.Welles in fact has minimal screen time, though his dark presence and influence infiltrate proceedings like an insidious disease. Yet somehow his ultimate demise in the sewers brings into play an incredible sadness and compassion that has absolutely no right being there. It remains for me one of my top five film favorites. I have always given it a \"10\" personally but hey, to be voted an \"8.6\" universally is a pretty fair vindication of my words here."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0041277",
      "warningSpoilers": false,
      "date": "23 July 2001",
      "rate": "",
      "helpful": "146 out of 237 found this helpful.",
      "title": "A Flawless Classic",
      "content": "This is a rare film that is flawless in every respect. It combines great acting and memorable characters with a fascinating story, taking place in an interesting setting and adding a creative musical score. \"The Third Man\" is remembered for many things - for Orson Welles' wonderful performance in his appearances as Harry Lime, for its wonderfully appropriate musical score, and for its nicely conceived plot surprises. Adding to these is Joseph Cotten's fine portrayal of Holly Martins, which holds the rest of it together - it is his character who initiates most of the action, and also through whom we view everything and everyone else.The story starts, after a nicely done prologue, with Martins arriving in Vienna, and finding out that his friend Harry is not only dead but is accused of running a particularly destructive black market racket. Martins sets out at once to prove his friend's innocence, getting into an immediate scuffle with the police, and it seems at first to set up a conventional plot about clearing the name of a friend - but the actual story that follows is much deeper and much better. It is just right that Martins is an innocent who writes cheap novels for a living, and he gets a pretty memorable lesson in fiction vs. reality. There are some great scenes (the Ferris-wheel confrontation being as good a scene as there is in classic cinema) leading up to a memorable climactic sequence, and a good supporting cast, with Alida Valli as Anna being very good in complementing Lime and Martins. The setting in crumbling post-war Vienna and the distinctive zither score go very nicely with the story.This is a fine, flawless classic, and while obviously belonging to an earlier era, it deserves a look from anyone who appreciates good movies."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3396938",
      "warningSpoilers": false,
      "date": "17 January 2016",
      "rate": "7",
      "helpful": "17 out of 24 found this helpful.",
      "title": "cinematic art work",
      "content": "Pulp western writer Holly Martins (Joseph Cotten) arrives in post-war Vienna to work for old friend Harry Lime (Orson Welles) but is told that Harry is dead. The city is divided under the control of the Allies. British Major Calloway (Trevor Howard) tells him that Harry was a criminal. He decides to investigate Harry's death. Anna Schmidt (Alida Valli) is Harry's girlfriend. Harry's friends Baron Kurtz and Popescu describe the accident but Holly is told by another that there was a third man.The best part of this movie is director Carol Reed. His camera work is amazing. The best scene for me is the balloon man. When he walks around the corner, it is the funniest and most shocking moment in the movie. Orson Welles is so tied into this movie but I don't find him threatening enough. He's more of a trickster. I would like Harry Lime to be scarier. Also Anna is an infuriating character. Overall, the story is fine. Joseph Cotten is great. The movie is a cinematic art work."
    },
    {
      "username": "mmt02",
      "userUrl": "https://www.imdb.com/user/ur0275161",
      "reviewLink": "https://www.imdb.com/review/rw0041212",
      "warningSpoilers": false,
      "date": "26 June 1999",
      "rate": "10",
      "helpful": "351 out of 449 found this helpful.",
      "title": "A movie ahead of its time",
      "content": "The Third Man is a movie that looks and feels not like a movie of the 40s, but like a neo-noir of the late 60s/early 70s. This wonderful example of classic noir is one of the all time greatest films. It combines amazing visuals, sounds, dialogue, and acting to tell a thrilling story and comment about the atmosphere after WWII.Of all the movies durring the studio era (pre-1960ish), there are three movies with cinematography that always stick out in my mind: Gregg Toland's work in Citizen Kane, Russel Mety's work in Touch of Evil, and Robert Krasker's work in The Third Man (all starring Orson Welles funny enough). I just recently saw a restored 35mm version of The Third Man. The crisp black and white visuals of a bombed out Vienna are so breath-taking. Shadows are everywhere. The unique way Krasker tilts the camera in some shots adding to the disorientation of the plot. And who can forget the first close-up of Welles with the light from an apartment room above splashing onto his face; one of the great entrances in movie history (Lime gives his old friend a smile that only Welles could give).The cinematography is backed by strong performances by Welles, Cotten, and italian actress Vali. The writing of Greene is wonderful; you can see the plot twisting around Cotten tightly. But what makes The Third Man so great is its historical commentary (well not really historical since it was commenting on its own time, but to us it is historical). On one level The Third Man is a story of betrayal and corruption in a post-war, occupied Vienna. On the other hand, its giving the audience a glimpse of the mood of Europe after the great war. The uncertainty that the Cold War was bringing is evident through out the film; Cotten is constantly trying to figure out who to trust. Vienna is on the frontier of the new communist bloc (we even see the communists infiltrating Vienna trying to bring Vali back to her native Czechoslavakia). The zither music score combined with the stark images of bombed out Vienna are reminiscent of the frontier towns of American Westerns. So The Third Man is not only a wonderful film noir, but a unique look at the brief time between WWII and the height of the Cold War."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw0041342",
      "warningSpoilers": false,
      "date": "18 June 2004",
      "rate": "9",
      "helpful": "62 out of 96 found this helpful.",
      "title": "Time for Lime",
      "content": "Who was Harry Lime (Orson Welles)? An evil man, devil in the flesh who was responsible for the unspeakable crimes, yet brilliant, cheerful and charismatic. His most famous words, a short speech written by Welles himself, say a lot about his character and motivations:\"In Italy for 30 years under the Borgies they had warfare, terror, murder, and bloodshed, but they produced Michelangelo, Leonardo da Vinci, and the Renaissance. In Switzerland they had brotherly love - they had 500 years of democracy and peace, and what did that produce? The cuckoo clock.\"No wonder, we like him, even though we know what he'd done It has been said thousands of times about the greatest movie entrance ever  but what about his 'exit'  the fingers on the street? I think it is one of the greatest, too A beautiful mysterious girl with tragic past was in love with him and the unforgettable ending, so antiHollywood, so true to the film - was about her love that goes beyond the grave. I read that both Selznick (the producer) and author Graham Greene had initially argued for something more upbeat (Holly and Anna walking off arm-in-arm), but Reed disagreed. I am so happy that Reed won (I am sure millions of fans are, too). That was the way to finish the movie and make it much more than just typical noir. Makes the viewer think about love, friendship, betrayal, loyalty, the price one pays for them.Amazing film - perfectly shot; almost flawless. It looks and feels like Welles himself could've made it. The influence of Citizen Kane is undeniable. The only problem I had  the music. I like it but it was very strange to hear it in the film like The Third Man. Maybe that was a purpose  instead of somber, moody, and ominous music that would be expected for the noir film, something completely different and out of place  cheerful but melancholy in the same time Criterion DVD is wonderful  the restored version of the film shines. There are two openings of the film available  British and American, and a lot of extras."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0041177",
      "warningSpoilers": true,
      "date": "18 January 2002",
      "rate": "",
      "helpful": "105 out of 191 found this helpful.",
      "title": "Atmospheric British thriller",
      "content": "American author Holly Martins arrives in Vienna to meet old friend Harry Lime. On arrival he finds Harry was just killed in an accident and attends his funeral. The police are happy that his death was an accident and are also closing crimes by attributing them to him. Martins begins to investigate the accident and finds out things that lead him to a shocking discovery that will eventually challenge his values and friendship.This is a classic bit of British cinema that owes a lot to the source material (Graham Green) and the slanted, moody cinematography throughout. The story is quite straight forward and can be perceived more complicated than it is. The best bits of the story come early, with Martins investigating the accident against a backdrop of secrecy and cover-ups, and later when he confronts Lime briefly on a Ferris wheel. The story is mainly a story of friendship and morals packed into a mystery setting. The final shot of the film is really good and gives a realistic (if not happy) end to the story.Joseph Cotton was always good around this period and seemed to be on a roll when he teamed up with Wells. Here he is good as Martin, even if his character is not as interesting as Harry Lime is. Orson Wells is excellent, casting a huge shadow (literally!) over the film despite having a very short time onscreen compare to Cotton. The director and the writer fought the producer to cast Wells in order to make the film more sellable to the American audience (the producer wanted Noël Coward) and the film is much better for their choice. His character hugely lacks morals and, despite being a small hustler, is almost a demonic figure - most notably in his speech on the Ferris wheel where he defends his actions to Martin.The film is given a great mood of shadows throughout. The city itself is shown as both beautiful and in ruins and is constantly slanted and shadowy. The final confrontation in the sewers of Vienna is excellent. The score is also good - at first it doesn't seem to fit, as it seems out of step with the mood, but it does work well with the culture that exists in the city at the time - I can't really explain it better than that but it does work.Overall this is a classic. The story may not be enough to support repeat viewings but the moody, the cinematography and a towering performance by Wells all make this essentially viewing for film fans."
    },
    {
      "username": "cricketbat",
      "userUrl": "https://www.imdb.com/user/ur6201371",
      "reviewLink": "https://www.imdb.com/review/rw4288600",
      "warningSpoilers": false,
      "date": "16 August 2018",
      "rate": "6",
      "helpful": "21 out of 31 found this helpful.",
      "title": "I could not get past the soundtrack",
      "content": "I respect the \"classic\" status of The Third Man, but I could not get past the soundtrack. The zither music was distracting to me and it ruined what could have been some intense moments. The story was slow, but interesting and the characters were awkward, but relatable. I still think Orson Welles is a bit overrated, but he was excellent in this film."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8754351",
      "warningSpoilers": false,
      "date": "24 December 2022",
      "rate": "8",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Oblique Noir...",
      "content": "Holly Martins has just arrived in Vienna, but he's found himself with a small dilemma, his mate Harry has just died, with a car he did collide, although the circumstance is causing him some bother. As he peels back several lids of several cans, it transpires Harry was a wanted man, had his fingers in some pies, to do with medical supplies, the authorities were not his biggest fan.Dark and deceptive goings on, above and below the streets of Vienna post WWII, with some outstanding and perpetually incredible performances against a background of shadows, shifting perspectives and immoral behaviour."
    },
    {
      "username": "The_Movie_Cat",
      "userUrl": "https://www.imdb.com/user/ur0234740",
      "reviewLink": "https://www.imdb.com/review/rw1895483",
      "warningSpoilers": true,
      "date": "19 June 2008",
      "rate": "6",
      "helpful": "91 out of 157 found this helpful.",
      "title": "I'll be honest... I didn't get it.",
      "content": "Currently ensconced in the top fifty movies of all time on the IMDb, I just don't see it. Sure, The Third Man looks absolutely gorgeous and the ending is superb, but the rest is just passable. Beautiful to look at, but lacking any real drive or urgency.The stuff in the sewers is good and there's some nice discussions of morality, but the film drags terribly for the first hour, where the casting (and, in a modern age, VHS covers) clearly signpost that Welles is to be expected.Coming from the director of the superlative \"Odd Man Out\" and the writer of the equally superb \"Brighton Rock\" then I was expecting more. I don't consider myself a philistine, but, for me at least, the narrative and subtext of this one wasn't enough to sustain its attempts at brilliance."
    },
    {
      "username": "AAdaSC",
      "userUrl": "https://www.imdb.com/user/ur21232893",
      "reviewLink": "https://www.imdb.com/review/rw2865538",
      "warningSpoilers": false,
      "date": "8 September 2013",
      "rate": "4",
      "helpful": "59 out of 104 found this helpful.",
      "title": "You may need a cuckoo clock to wake you up",
      "content": "Author Joseph Cotten (Holly) is invited to Vienna by his friend Orson Welles (Harry Lime). There is a major problem with this set-up from the outset as it is revealed that Welles has just been killed. Cotton attends the burial but sticks around in Vienna as there seems to be a great deal of suspicion surrounding the death of his buddy.The film has an interesting setting and idea for a story but I'm afraid that it just drags - it's drawn-out and never gets moving. Cotten is dreary in the lead role but Welles is the best thing in the film and delivers his amusing famous quote comparing Italy with Switzerland. The scene on the Ferris wheel is a standout scene as the audience experiences the only real moment of tension as the carriage door is opened at the top of the ride. Uh-oh – is anybody going over the edge?A mention must be made of the music – it's all zithery throughout. To further clarify, it sounds like a mixture between Greek music and French café accordion music. And it provides moments of over-exaggerated melodrama that just ends up comical. It is also just basically out-of-place belonging more in an art film or 1960s camp comedy horror.The story is not bad and the film could have been so much more interesting – we are given about 30 minutes of plot stretched out to nearly 2 hours. Definitely not the classic that everyone blindly labels it as – it is vastly over-rated right up to the final chase scene in the sewers – a plot device that was done a year before in the better film \"He Walked By Night\" (1948) which provided far more tension and a better sewer chase."
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw0946245",
      "warningSpoilers": false,
      "date": "13 October 2004",
      "rate": "10",
      "helpful": "83 out of 164 found this helpful.",
      "title": "Four men on a bridge",
      "content": "A great deal has been said about \"The Third Man\" by contributors to this forum. Having seen the restored copy that was shown at the Film Forum, recently, I could not resist watching this masterpiece once more when it was shown by TCM, the other night.This movie owes a debt of gratitude to Graham Greene, a writer who had the most developed sense of intrigue among his contemporaries and one of the best writers of the last century. It also helped that a great director, Carol Reed, brought it to the screen. Mr. Reed was a director who had an eye for detail, as he demonstrates here, as well as in the rest of the body of work he left for us to enjoy. The screen play is faithful to the original novel. If to all of the other elements we add the fabulous cinematography of Robert Krasker, the result has to be the masterpiece we see today. Never before has a city taken center stage in the development of the story that is presented here. Mr. Krasker's wonderful night vision of this city enhances the story as we are taken along for a fantastic trip of the post war Vienna of 1949.The casting of this film is amazing. Never had so many excellent actors been thrown together in a film, as it is the case as with this picture. Joseph Cotten, Alida Valli, Trevor Howard, Orson Welles, Bernard Lee, Ernst Deutsch, Paul Horbiger, Erich Ponto and Wilfred Hyde White are splendid in their roles. It is hard to imagine these characters played by other actors.Orson Welles has perhaps the best part, even though his time before the camera is short. This must have been one of the best roles in which Welles appeared. Of course, there are so many others, but his Harry Lime is an original and could have fitted perfectly in one of his own films.The music by Anton Karas is still haunting, with the exception of a few times at the beginning of a couple of scenes, when it startles the viewer and actually doesn't add anything to what we are about to see.This film will live forever."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1955010",
      "warningSpoilers": false,
      "date": "3 October 2008",
      "rate": "8",
      "helpful": "12 out of 19 found this helpful.",
      "title": "Classic and immortal thriller-mystery set in Vienna during the Cold war",
      "content": "The motion picture concerns an American writer of pulp Western named Holy Martin (Joseph Cotten), he arrives in a post-war devastating Vienna to see his old friend Harry Lime (Orson Welles), but Holy discovers he has been killed. In the funeral meets a gorgeous scene actress (haunting Alida Valli). Manipulative Harry is a known delinquent and drug-dealer, smuggling adulterated penicilin in black-market as well as a master-criminal at large in a Vienna of nightmare divided in four zones, the city is plenty of ruins, trash, devastation , rubbish and debris. Lime is allegedly dead , but is finally pursued throughout the sewers by military authorities (Trevor Howard, Bernard Lee, Geoffrey Keen).Based on Grahame Greene novel, this classic noir thriller is an excellent story lavishly produced by the great American producer David O'Selznick and Hungarian producer Alexander Korda. This is a deeply satisfying and intelligent picture to not be missed, using a considerable talent in acting, as main cast as secondary actors formed mostly by foreigner players of various countries and utilizing the cream of the cream of British experts in writing and technical departments. With a plethora of anthological images and dialogs, such as the scenes about conversation in the marry-go-round between Harry Lime and Martin, and the underground-sewers pursuits. Magnificent Orson Welles and Joseph Cotten, great friends in real life ; Welles reportedly intervened in direction mainly on his scenes, though at an interview he explained that Carol Reed directed totally this outstanding movie. Extraordinary Anton Karas' musical score , though insistent and sometimes irritant zither which hooked itself into the people all around the world. Robert Krasker's gorgeous cinematography , reflecting splendidly the shapes , lights, shadows in sophisticated, elegant use of camera angles and deservedly winning an Oscar and nomination for film-making and edition. The film was perfectly directed by Carol Reed in the second adaptation about Grahame Greene novel, the first was 'The fallen idol (1948)' and later 'Our man in Havana (1959)'."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0041299",
      "warningSpoilers": true,
      "date": "22 February 2003",
      "rate": "10",
      "helpful": "39 out of 74 found this helpful.",
      "title": "A glorious thriller",
      "content": "Carol Reed's The Third Man is set in post-war Vienna- a hypnotic city, which is in consideration of the mountains of rubble and general sorrow of the are- and stars Joseph Cotten as Holly, a writer of hokey B-Western novels who's come to visit an old chum named Harry Lime. He finds out Lime is dead, but that there is more to his old friend than he knew since before the war, along with Lime's girl Anna (a sympathetic character?). Then when the revelation is shown of Lime's face on a darkened street, the film reaches an elegance rarely seen today in pictures. Orson Welles, who plays Harry Lime, has in fact a role much like a cameo, having a speech with Cotten on a Ferris Wheel. Even before his \"cuckoo clock\" finale, we get the sense this is one of these classic scenes of all time, leading up to an unforgettable chase in a sewer. Along with precise, Oscar Winning cinematography, and an ever-entrancing musical score, The Third Man is one of the essentials for movie buffs. A++"
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw1235867",
      "warningSpoilers": false,
      "date": "11 December 2005",
      "rate": "7",
      "helpful": "24 out of 42 found this helpful.",
      "title": "To zither or not to zither, that is the question...",
      "content": "THE THIRD MAN is an effective piece of late '40s film noir, but in my opinion is a rather overrated one, accompanied as it is by a distracting zither score that some believe is the film's crowning achievement, aside from Robert Krasker's B&W photography. Joseph Cotten gives his usual low-key performance as the pulp writer who wants to track down what really happened to his friend, Harry Limes (Orson Welles) whom he suspects has met with foul play and Valli is similarly low-key in her role as Limes' lonely sweetheart. Trevor Howard is excellent as Major Calloway who tries to help both Cotten and Valli, warning both of the dangers they face.The B&W Oscar-winning photography of post-war Vienna is crisply detailed and shadowy in its display of virtually empty cobblestoned streets at night and the background score is unusual and sometimes even striking. But therein lies the trouble. Not all of the famous Anton Karas zither score seems appropriate for the on screen action, although whether this is intentional or not, I don't pretend to know. For me, much of the score works against the story instead of creating the proper amount of tension in the script, as atmospheric as the Austrian music is.If ever a story of post-war Vienna troubled by corrupt officials and black market thieves and murderers needed an orchestrated score by a Bernard Herrmann type of composer, this is it. Others have praised the zither score to the skies, but I'm of the firm opinion that \"The Third Man Theme\" itself is the high point of this particular score, effectively used every time the mysterious Orson Welles appears.His theme became enormously popular as \"The Third Man Theme\" and deserved its success as a single--but as others have observed, the rest of the zither score becomes a bit monotonous after awhile and plays against what is happening on screen instead of deepening the emotional impact of the story. In fact, there are times when it becomes distracting and even irritating.It's an interesting, almost semi-documentary kind of film from Carol Reed that has Welles appearing only toward the halfway point and then only briefly. He gives one of his better performances, more controlled, less florid than usual, although the film is carried chiefly by Cotten, Howard and Valli and some superb photography. The story is told in such a cold documentary manner that there is almost an air of detachment about connecting to any of the characters we are supposed to care about. In this respect, it is Trevor Howard's Major Calloway that comes across as the most likable and fully developed character in the story.Trivia note: The kitten seen in Valli's apartment and devoted to Harry Limes is not the same creature that rubs against him in the doorway scene, an obviously older cat. How did they think a sharp-eyed movie fan would not notice??"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1235049",
      "warningSpoilers": true,
      "date": "10 December 2005",
      "rate": "10",
      "helpful": "46 out of 92 found this helpful.",
      "title": "Zither Thou Goest",
      "content": "The Third Man refers to another witness to a crime that no one seems to know anything about. The crime of course is the hit and run murder of Harry Lime played by Orson Welles. But is Welles dead.One of the things I like about The Third Man is that it makes a nominal hero out of one of the biggest bunglers ever put on screen. Let's just say that if Holly Martins played by Joseph Cotten were bumping into furniture on top of everything else, he'd be Inspector Clouseau.Holly arrives in occupied Vienna in the late Forties at the invitation of an old college classmate Harry Lime. Literally upon arriving in Vienna, Martins learns that his friend Lime was the victim of a hit and run accident and the funeral is going on at that moment. He goes to the funeral and is smitten by Lime's girlfriend, Alida Valli.Martins is a writer of western stories and it's bad when a writer starts believing he's one of his own heroes. Maybe Jessica Fletcher is capable of it, but not Holly Martins. Martins decides to start his own investigation into Lime's death much to the consternation of the British occupying force which doing its own inquiry. Trevor Howard plays Major Callaway of the British Army in charge of the investigation.Martins turns out to be right that there is something more afoot than a simple traffic accident. But he's so terribly wrong about everything and everyone else it is frightening. I really can't say more at this point.Someone reading the plot description I've given might think The Third Man is some kind of comedy, but it is not. It is in fact one of the most finely crafted dramas ever put on the screen. The location photography in Vienna is fabulous and contributes so much to the authenticity of the story and its characters. Joseph Cotten gives one of his best performances as the bull-in-the-china-shop amateur detective.As for Orson Welles, it's a virtual tie in my opinion with Compulsion for the distinction of his finest performer as an actor without working for director Orson Welles. Harry Lime turns out to be the harbinger of a cynical age we were entering.And if nothing else grabs you about The Third Man, that theme on the zither will stay with you forever. Definitely one of the ten best known movie scores ever."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0041310",
      "warningSpoilers": true,
      "date": "27 September 2003",
      "rate": "10",
      "helpful": "50 out of 96 found this helpful.",
      "title": "Haunting and Poetic; A True Masterpiece...",
      "content": "Carol Reed's \"The Third Man\" strikes all the right cords, establishing itself on so many different levels that it almost becomes untouchable. It has an underlying tone of darkness that not only thrills but chills. It grabs the viewer from the start and never lets go. It opens with Anton Karas' startling zither music and quickly propels the viewer into a world of evil and lies. The tale is familiar to any film lovers: A pulp Western writer named Holly Martin (Joseph Cotten) is invited to post-war Vienna by an old friend of his, Harry Lime (Orson Welles). The city has been divided into American, British, French and Russian zones. The city exists as a shattered remnant of the past - haunting and horrifying, dark and mysterious. Upon his arrival, Holly discovers to his horror that his old college pal is dead - hit by a car in the middle of a street. But for Holly, the circumstances don't add up - everyone involved in the accident was related in some way or another to Harry. So Holly searches for clues, much to the chagrin of the British officer Calloway (Trevor Howard), whose name is misused as Callohan by Holly many times throughout the film. (\"It's 'Calloway,' Mr. Martin, I'm not Irish.\") Holly Martin does begin to stumble upon some vital clues as to the real story behind Lime's death - and finds out more than he bargained for. Lime's old girlfriend is a stage actress. (\"Always comedy.\") She accompanies Holly throughout the film, and we expect an underlying romance to blossom, but yet in the end it does not - one of the many surprises of the film. I suppose it would be a sin for me to give away how Harry Lime reappears, or even give away the fact that he does, for that matter (though by now I am sure you realize Orson Welles is in this movie and therefore turns out to be alive). But for those who have seen the film, we all remember that terrific scene where the cat meows, and suddenly he appears, an evil smirk on his face like a child who has gotten away with the cookie from the jar. And then the ferris wheel scene, and the chase through the sewers that no doubt helped win the film an Oscar for cinematography. These are all some of the most memorable of film scenes. The director of \"The Third Man,\" Carol Reed, stumbled upon the film's musician, Anton Karas, one night in a trashy bar in Vienna. It is no wonder that out of all his candidates he chose Karas - the film's tune is literally the most perfect example of matching harmony between a film and its music I have ever seen (although \"JAWS\" is up there with it). To go into the music is pointless - it must simply be heard in synchronism with the film for you to understand where I am coming from. When I think of film noir, \"D.O.A.\" (1949) and \"The Third Man\" (1949) are the first two films that come to mind. Both accomplish what they set out to do, but \"The Third Man\" exceeds even farther than the former - it is haunting and almost poetically vibrant in the way it displays its story and the outcome of its characters. It is a film that will be around for years and years. \"Citizen Kane\" is often thought of as the greatest American motion picture of all time. But if I had to choose between the two, I would most likely choose \"The Third Man.\" It's just my opinion, of course, and many may not agree, but as far as I see, \"The Third Man\" beats \"Citizen Kane\" - for me - on more levels than one. Welles' \"Citizen Kane\" (1941) was an artistic film that rarely used close-ups. It would almost stand back from the scenes and let the viewer focus on what he or she wanted to focus on. \"The Third Man\" has many close-ups. I do not take this as a director trying to give the audience what he wants them to see, but rather a director in touch with his feelings and ideas. Director Carol Reed knows just how to evoke characters' feelings from scenes and close-up shots. The camera tilts at awkward angles more often than not. The more and more paranoid and afraid our hero becomes the more and more intense the close-ups and angles. There is some haunting material in \"The Third Man,\" some material the most novice of filmgoers might not expect. And the music and direction only makes it all the more terrifying and haunting. This is a film that you must witness to believe. 5/5."
    },
    {
      "username": "Ron Oliver",
      "userUrl": "https://www.imdb.com/user/ur0306861",
      "reviewLink": "https://www.imdb.com/review/rw0041236",
      "warningSpoilers": true,
      "date": "25 January 2000",
      "rate": "10",
      "helpful": "67 out of 132 found this helpful.",
      "title": "Murder, Mystery & Harry Lime",
      "content": "Post-war Vienna. A dangerous city, full of intrigue, crime & sudden death. Notorious American racketeer Harry Lime starts to cross a street. There is an accident and he is killed instantly. Or is he? His body is carried to the sidewalk by two friends. Or does another man assist them? If so, who is THE THIRD MAN and what does he know about Lime's suspicious death?Such is the puzzle at the beginning of what many consider to be the greatest film ever made. Its glories are so obvious that it is almost futile to pick out any for observation: the marvelous sewer chase, the balloon man, the little boy with the ball, the giant wheel, the cuckoo clock speech & the long closing walk across the cemetery. All of these linger in the mind, becoming permanent residents of our cinematic subconscious.The entire cast is excellent: Joseph Cotton as Lime's American friend trying to piece together what has happened; Trevor Howard as the stalwart British Major of Police; gorgeous Valli as Harry's faithful lover; Bernard Lee as the tragic Police Sergeant; Wilfrid Hyde-White as a dithering English cultural attaché. And then there's Orson Welles...The character of Harry Lime, alive or dead, on-screen or not, is one of cinema's most fascinating villains. Charming & deadly as any cobra, he attracts & repels at the same moment. It is interesting to note that BBC Radio resurrected the character for the series 'The Lives of Harry Lime' very shortly after the film's release. Harry was not allowed to stay in his grave for long...Three more items of note: (1) The cinematography is first-rate, making Vienna by night look almost lunar. (2) Orson Welles' first appearance on screen is a real dandy. (3) Above & around & through everything is the famous zither music of Anton Karas, which becomes like a Greek Chorus, commenting on the action. Its complete silence during the sewer chase only underscores the starkness of the sequence."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1243183",
      "warningSpoilers": false,
      "date": "20 December 2005",
      "rate": "9",
      "helpful": "37 out of 75 found this helpful.",
      "title": "Astounding Visuals Make It A Treasure",
      "content": "Story - pretty good.Cinematographry - amazing! If you want to enjoy the camera-work, please see this on the Criterion DVD. That's not a plug for the company. It's just that no one else has ever offered a cleaner version of this film. After suffering for years with lousy VHS transfers of this gem, it was nice to see it given justice.To me, the visuals here make this DVD worth owning because the story is okay, but nothing super. To an average first-time viewer, the first hour of this film can drag. I found that to be the case on my first viewing, but the more I watch this, the better the story seems to have gotten for some reason. Despite his billing, Orson Welles has a small role in here. He doesn't even appear until after 65 of the film's 104 minutes have elapsed. Meanwhile, Joseph Cotten dominates the story, along with Alida Valli, sort of a poor man's Ingrid Bergman. Those two are okay but the story picks up dramatically after Wells finally appears. In addition to the fabulous cinematography, an unique feature of this movie is the music, which is very strange for a film noir. It's lighthearted music from a zither, almost circus-like in its sound and melody....but I liked it. It helps make this movie different.The visuals involve a lot of nighttime photography, lots of shadows and cobblestone streets. The tilted camera angles and the closeups - all traits of Wells the director, are here to enjoy"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2316468",
      "warningSpoilers": false,
      "date": "27 September 2010",
      "rate": "10",
      "helpful": "14 out of 27 found this helpful.",
      "title": "Brilliant",
      "content": "The Third Man is really quite a brilliant film, and one of the best British films ever made in my opinion. There are several reasons why I think this. The cinematography is just outstanding, and helps fashion a city full of menace and the score is jaunty and flawlessly echoes the film's wit and drama. Then there is a dark yet playful script(two other words to describe the film itself too), impeccable direction from master of place, angle and shade Carol Reed and a gem of a story that grips you right up till the ending. The Third Man is also blessed with performances more perfect than you can ask for from Joseph Cotten and especially Orson Welles. Overall, it is a brilliant film, very well made and has a great story. 10/10 Bethany Cox"
    }
  ],
  "errorMessage": ""
}