{
  "imDbId": "tt0041959",
  "title": "The Third Man",
  "fullTitle": "The Third Man (1949)",
  "type": "Movie",
  "year": "1949",
  "language": "en",
  "titleInLanguage": "The Third Man",
  "url": "https://en.wikipedia.org/wiki/The_Third_Man",
  "plotShort": {
    "plainText": "The Third Man is a 1949 British film noir directed by Carol Reed, written by Graham Greene and starring Joseph Cotten, Alida Valli, Orson Welles, and Trevor Howard. Set in postwar Vienna, the film centres on American Holly Martins (Cotten), who arrives in the city to accept a job with his friend Harry Lime (Welles), only to learn that Lime has died. Viewing his death as suspicious, Martins elects to stay in Vienna and investigate the matter.\r\nThe atmospheric use of black-and-white expressionist cinematography by Robert Krasker, with harsh lighting and largely subtle \"Dutch angle\" camera technique, is a major feature of The Third Man. Combined with the iconic theme music by zither player Anton Karas, seedy locations and acclaimed performances from the cast, the style evokes the atmosphere of an exhausted, cynical post-war Vienna at the start of the Cold War.\r\nGreene wrote the novella of the same name as preparation for the screenplay. Karas's title composition \"The Third Man Theme\" topped the international music charts in 1950, bringing the previously unknown performer international fame; the theme would also inspire Nino Rota's principal melody in La Dolce Vita (1960). The Third Man is considered one of the greatest films of all time, celebrated for its acting, musical score and atmospheric cinematography.\r\nIn 1999, the British Film Institute voted The Third Man the greatest British film of all time. In 2011, a poll of 150 actors, directors, writers, producers and critics for Time Out ranked it the second best British film ever.",
    "html": "<p>The Third Man is a 1949 British film noir directed by Carol Reed, written by Graham Greene and starring Joseph Cotten, Alida Valli, Orson Welles, and Trevor Howard. Set in postwar Vienna, the film centres on American Holly Martins (Cotten), who arrives in the city to accept a job with his friend Harry Lime (Welles), only to learn that Lime has died. Viewing his death as suspicious, Martins elects to stay in Vienna and investigate the matter.</p><p>The atmospheric use of black-and-white expressionist cinematography by Robert Krasker, with harsh lighting and largely subtle \"Dutch angle\" camera technique, is a major feature of The Third Man. Combined with the iconic theme music by zither player Anton Karas, seedy locations and acclaimed performances from the cast, the style evokes the atmosphere of an exhausted, cynical post-war Vienna at the start of the Cold War.</p><p>Greene wrote the novella of the same name as preparation for the screenplay. Karas's title composition \"The Third Man Theme\" topped the international music charts in 1950, bringing the previously unknown performer international fame; the theme would also inspire Nino Rota's principal melody in La Dolce Vita (1960). The Third Man is considered one of the greatest films of all time, celebrated for its acting, musical score and atmospheric cinematography.</p><p>In 1999, the British Film Institute voted The Third Man the greatest British film of all time. In 2011, a poll of 150 actors, directors, writers, producers and critics for Time Out ranked it the second best British film ever.</p>"
  },
  "plotFull": {
    "plainText": "The Third Man is a 1949 British film noir directed by Carol Reed, written by Graham Greene and starring Joseph Cotten, Alida Valli, Orson Welles, and Trevor Howard. Set in postwar Vienna, the film centres on American Holly Martins (Cotten), who arrives in the city to accept a job with his friend Harry Lime (Welles), only to learn that Lime has died. Viewing his death as suspicious, Martins elects to stay in Vienna and investigate the matter.\r\nThe atmospheric use of black-and-white expressionist cinematography by Robert Krasker, with harsh lighting and largely subtle \"Dutch angle\" camera technique, is a major feature of The Third Man. Combined with the iconic theme music by zither player Anton Karas, seedy locations and acclaimed performances from the cast, the style evokes the atmosphere of an exhausted, cynical post-war Vienna at the start of the Cold War.\r\nGreene wrote the novella of the same name as preparation for the screenplay. Karas's title composition \"The Third Man Theme\" topped the international music charts in 1950, bringing the previously unknown performer international fame; the theme would also inspire Nino Rota's principal melody in La Dolce Vita (1960). The Third Man is considered one of the greatest films of all time, celebrated for its acting, musical score and atmospheric cinematography.\r\nIn 1999, the British Film Institute voted The Third Man the greatest British film of all time. In 2011, a poll of 150 actors, directors, writers, producers and critics for Time Out ranked it the second best British film ever.\r\nPlot\r\nHolly Martins, an American author of western fiction, arrives in post–World War II Vienna seeking his childhood friend, Harry Lime, who has offered him a job. Martins is told that Lime was killed by a car while crossing the street. At Lime's funeral, Martins meets two British Royal Military Police: Sergeant Paine, a fan of Martins's books, and Major Calloway. Afterward, Martins is asked by Mr. Crabbin to lecture at a book club a few days later. He then meets a friend of Lime's, \"Baron\" Kurtz, who tells Martins that he and another friend, a Romanian called Popescu, carried Lime to the side of the street after the accident. Before he died, Lime asked them to take care of Martins as well as Lime's girlfriend, actress Anna Schmidt.\r\nAs Martins and Anna query Lime's death, they realise that accounts differ as to whether two or three men carried away the body. The porter at Lime's apartment tells them that he saw a third man help carry away the body. Later, the porter offers to give Martins more information, but he is murdered before Martins can talk to him. Martins confronts Major Calloway and demands that Lime's death be investigated. Calloway reveals that Lime was stealing penicillin from military hospitals, diluting it, then selling it on the black market, injuring or killing countless infants. Martins, convinced by hard evidence, agrees to leave.\r\nMartins visits Anna that evening. After leaving he walks the streets, until he notices Harry's cat and realises someone is watching from a darkened doorway. It is Harry. Martins calls out but Lime flees and vanishes. Martins summons Calloway, who realizes that Lime has escaped through the city's extensive sewers. The British police exhume Lime's coffin and discover that the body is the missing orderly who stole the penicillin for Lime. Anna is to be sent to the Soviet sector, and is questioned again by Calloway.\r\nMartins meets Lime and they ride the Wiener Riesenrad. Lime obliquely threatens Martins before leaving quickly. Calloway then asks Martins to help arrest Lime. Martins agrees to help on one condition, demanding Anna's safe conduct out of Vienna. Anna is about to leave on the train when she spots Martins, who has come to observe her departure. She forces the plan out of him but wants no part of it. Exasperated, Martins decides to leave Vienna, but on the way to the airport, Calloway stops at a hospital to show Martins children crippled or dying of meningitis who were treated with Lime's diluted penicillin. Martins agrees to help the police again.\r\nLime arrives at a small café to meet Martins, but Anna is able to warn Lime that the police are closing in. He tries again to escape using the sewer tunnels, but the police are there. Lime shoots and kills Paine, but Calloway shoots and badly wounds Lime. Injured Lime drags himself up a cast-iron stairway to a street grating; however, cannot lift it. Martins finds Lime at the grating and hears Calloway shouting to shoot him on sight. Lime and Martins exchange a look, and then Martins shoots and kills him, using Paine's pistol. Martins attends Lime's second funeral, at the risk of missing his flight out of Vienna. He waits on the street to speak with Anna, but she totally ignores him and walks right past him without even glancing in his direction.\r\nCast\r\nJoseph Cotten as Holly Martins\r\nOrson Welles as Harry Lime\r\nAlida Valli (credited as Valli) as Anna Schmidt\r\nTrevor Howard as Major Calloway\r\nPaul Hörbiger as Karl, Lime's porter (credited as Paul Hoerbiger)\r\nErnst Deutsch as \"Baron\" Kurtz\r\nErich Ponto as Dr. Winkel\r\nSiegfried Breuer as Popescu\r\nHedwig Bleibtreu as Anna's old landlady\r\nBernard Lee as Sergeant Paine\r\nWilfrid Hyde-White as Crabbin\r\nUncredited\r\nAnnie Rosar as the porter's wife\r\nAlexis Chesnakov as Brodsky, Russian official\r\nHerbert Halbik as Little Hansel - Boy with Ball\r\nRobert Brown as British Military Policeman in the sewer chase scene\r\nPaul Hardtmuth as the hall porter at Hotel Sacher\r\nGeoffrey Keen as British Military Policeman\r\nEric Pohlmann as waiter at Smolka's\r\nReed De Rouen as American Military Policeman at Railroad Station\r\nBrother Theodore as Man on Street\r\nNelly Arno as Kurtz's mother\r\nKarel Štěpánek as actor at Josefstadt Theatre\r\nJoseph Cotten as the narrator (pre-1999 US version)\r\nCarol Reed as the narrator (pre-1999 UK, and all post-'99 versions)\r\nProduction\r\nDevelopment\r\nBefore writing the screenplay, Graham Greene worked out the atmosphere, characterisation, and mood of the story by writing a novella as a source text for the screenplay. He never intended it to be read by the general public, although it was later published under the same name as the film. In 1948, he met Elizabeth Montagu in Vienna. She gave him tours of the city, its sewers, and some of its less reputable night-clubs. She also introduced Greene to Peter Smolka, the central European correspondent for The Times. Smolka gave Greene the stories about the black market in Vienna.\r\nThe narrator in the novella is Major Calloway, which gives the book a slightly different emphasis from that of the screenplay. A small portion of his narration appears in a modified form at the film's beginning in Reed's voice-over: \"I never knew the old Vienna\". Other differences include both Martins's and Lime's nationalities; they are English in the book. Martins's given name is Rollo rather than Holly. Popescu's character is an American called Cooler. Crabbin was a single character in the novella; the screenplay's original draft replaced him with two characters, played by Basil Radford and Naunton Wayne, but ultimately in the film, as in the novella, Crabbin remains a single character.\r\nThere is also a difference of ending. The novella's implies that Anna and Martins are about to begin a new life together, in stark contrast to the unmistakable snub by Anna that closes the film. In the book, Anna does walk away from Lime's grave, but the text continues:\r\nI watched him striding off on his overgrown legs after the girl. He caught her up and they walked side by side. I don't think he said a word to her: it was like the end of a story except that before they turned out of my sight her hand was through his arm—which is how a story usually begins. He was a very bad shot and a very bad judge of character, but he had a way with Westerns (a trick of tension) and with girls (I wouldn't know what).\r\nDuring the shooting of the film, the final scene was the subject of a dispute between Greene and David O. Selznick, who wanted the happy ending of the novella; and Reed, who stubbornly refused to end the film on what he felt was an artificially happy note. Greene later wrote: \"One of the very few major disputes between Carol Reed and myself concerned the ending, and he has been proved triumphantly right.\"\r\nDavid O. Selznick's contribution, according to himself, was mainly to have provided his actors Cotten and Welles and to have produced the shortened US version.\r\nThrough the years there was occasional speculation that Welles, rather than Reed, was the de facto director of The Third Man. In Jonathan Rosenbaum's 2007 book Discovering Orson Welles, Rosenbaum calls it a \"popular misconception\", although Rosenbaum did note that the film \"began to echo the Wellesian theme of betrayed male friendship and certain related ideas from Citizen Kane.\" In the final analysis, Rosenbaum writes, \" didn't direct anything in the picture; the basics of his shooting and editing style, its music and meaning, are plainly absent. Yet old myths die hard, and some viewers persist in believing otherwise.\" Welles himself fuelled this theory in a 1958 interview, in which he said that he had had an important role in making The Third Man, but that it was a \"delicate matter, because wasn't the producer\". However, in a 1967 interview with Peter Bogdanovich, Welles said that his involvement was minimal: \"It was Carol's picture\". However, Welles did contribute some of the film's best-known dialogue. Bogdanovich also stated in the introduction to the DVD:\r\nHowever, I think it's important to note that the look of The Third Man—and, in fact, the whole film—would be unthinkable without Citizen Kane, The Stranger, and The Lady from Shanghai, all of which Orson made in the '40s, and all of which preceded The Third Man. Carol Reed, I think, was definitely influenced by Orson Welles, the director, from the films he had made.\r\nPrincipal photography\r\nSix weeks of principal photography was shot on location in Vienna, ending on 11 December 1948. Some use was made of the Sievering Studios facilities in the city. Production then moved to the Worton Hall Studios in Isleworth and Shepperton Studios near London and was completed in March 1949. Thomas Riegler emphasises the opportunities for Cold War espionage that the Vienna set made available, and notes that \"the audio engineer Jack Davies noticed at least one mysterious person on the set.\"\r\nThe scenes of Harry Lime in the sewer were shot on location or on sets built at Shepperton; most of the location shots used doubles for Welles. However, Reed claimed that, despite initial reluctance, Welles quickly became enthusiastic, and stayed in Vienna to finish the film.\r\nAccording to the recollection of assistant director Guy Hamilton, interviewed in 2015, Greene and Reed worked very well together, but Orson Welles \"generally annoyed everyone on the set\". His temporary absence forced Hamilton to step in as body double for him. Apparently, the filming of the sewer scenes was moved to studios in the UK as a result of Welles' complaints about shooting in the actual sewers.\r\nReed had four different camera units shooting around Vienna for the duration of the production. He worked around the clock, using Benzedrine to stay awake.\r\n\"Swiss cuckoo clock\" speech\r\nIn a famous scene, Lime meets Martins on the Wiener Riesenrad in the Prater amusement park. Looking down on the people below from his vantage point, Lime compares them to dots, and says that it would be insignificant if one of them or a few of them \"stopped moving, forever\". Back on the ground, he notes:\r\nYou know what the fellow said – in Italy, for 30 years under the Borgias, they had warfare, terror, murder, and blood-shed; but they produced Michelangelo, Leonardo da Vinci, and the Renaissance. In Switzerland, they had brotherly love; they had 500 years of democracy and peace – and what did that produce? The cuckoo clock!\r\nWelles added this remark – in the published script, it is in a footnote. Greene wrote in a letter, \"What happened was that during the shooting of The Third Man it was found necessary for the timing to insert another sentence.\" Welles apparently said the lines came from \"an old Hungarian play\"—in any event the idea is not original to Welles, acknowledged by the phrase \"what the fellow said\".\r\nThe likeliest source is the painter James Abbott McNeill Whistler. In a lecture on art from 1885 (published in Mr Whistler's \"Ten O'Clock\"), he said \"The Swiss in their mountains ... What more worthy people! ... yet, the perverse and scornful will have none of it, and the sons of patriots are left with the clock that turns the mill, and the sudden cuckoo, with difficulty restrained in its box! For this was Tell a hero! For this did Gessler die!\" In a 1916 reminiscence, American painter Theodore Wores said that he \"tried to get an acknowledgment from Whistler that San Francisco would some day become a great art center on account of our climatic, scenic and other advantages. 'But environment does not lead to a production of art,' Whistler retorted. 'Consider Switzerland. There the people have everything in the form of natural advantages – mountains, valleys and blue sky. And what have they produced? The cuckoo clock!\"\r\nOr it may be that Welles was influenced by Geoffrey Household, who wrote in his novel Rogue Male: \"...Swiss. A people, my dear fellow, of quite extraordinary stupidity and immorality. A combination which only a long experience of democratic government could have produced.\"\r\nThis Is Orson Welles (1993) quotes Welles: \"When the picture came out, the Swiss very nicely pointed out to me that they've never made any cuckoo clocks,\" as the clocks are native to the German Black Forest. Writer John McPhee pointed out that when the Borgias flourished in Italy, Switzerland had \"the most powerful and feared military force in Europe\" and was not the peacefully neutral country it later became.\r\nMusic\r\nWhat sort of music it is, whether jaunty or sad, fierce or provoking, it would be hard to reckon; but under its enthrallment, the camera comes into play ... The unseen zither-player ... is made to employ his instrument much as the Homeric bard did his lyre.\r\nWilliam Whitebait, New Statesman and Nation (1949)\r\nAnton Karas composed the musical score and performed it on the zither. Before the production came to Vienna, Karas was an unknown performer in local Heurigers. According to Time:\r\nThe picture demanded music appropriate to post-World War II Vienna, but director Reed had made up his mind to avoid schmaltzy, heavily orchestrated waltzes. In Vienna one night Reed listened to a wine-garden zitherist named Anton Karas, was fascinated by the jangling melancholy of his music.\r\nAccording to Guy Hamilton, Reed met Karas by coincidence at a party in Vienna, where he was playing the zither. Reed brought Karas to London, where the musician worked with Reed on the score for six weeks. Karas stayed at Reed's house during that time. Film reviewer Roger Ebert wrote \"Has there ever been a film where the music more perfectly suited the action than in Carol Reed's The Third Man?\"\r\nAdditional music for the film was written by the Australian-born composer Hubert Clifford under the pseudonym of Michael Sarsfield. From 1944 until 1950 Clifford was working as Musical Director for Korda at London Film Productions, where he chose the composers and conducted the scores for films, as well as composing many original scores of his own. An extract from his Third Man music, The Casanova Melody, was orchestrated by Rodney Newton in 2000.\r\nDifferences between releases\r\nAs the original British release begins, the voice of director Carol Reed (uncredited) describes post-war Vienna from a racketeer's point of view. The version shown in American cinemas cut 11 minutes of footage and replaced Reed's voice-over with narration by Joseph Cotten as Holly Martins. David O. Selznick instituted the replacement because he did not think American audiences would relate to the seedy tone of the original. Today, Reed's original version appears on American DVDs, in showings on Turner Classic Movies, and in U.S. cinema releases, with the 11 minutes of footage restored, including a shot of a near topless dancer in a bar that would have violated the U.S. Code in 1948. Both the Criterion Collection and Studio Canal DVD releases include a comparison of the two opening monologues.\r\nA restored version of the film was released in the United Kingdom on 26 June 2015.\r\nReception\r\nThe Grand Gala World Premiere was held at the Ritz Cinema in Hastings, East Sussex on 1 September 1949.\r\nBox office\r\nIn the United Kingdom, The Third Man was the most popular film at the British box office for 1949.\r\nAccording to Kinematograph Weekly the 'biggest winner' at the box office in 1949 Britain was The Third Man with \"runners up\" being Johnny Belinda, The Secret Life of Walter Mitty, The Paleface, Scott of the Antarctic, The Blue Lagoon, Maytime in Mayfair, Easter Parade, Red River, and You Can't Sleep Here.\r\nCritical\r\nIn Austria, \"local critics were underwhelmed\", and the film ran for only a few weeks. Still, the Viennese Arbeiter-Zeitung, although critical of a \"not-too-logical plot\", praised the film's \"masterful\" depiction of a \"time out of joint\" and the city's atmosphere of \"insecurity, poverty and post-war immorality\". William Cook, after his 2006 visit to an eight-room museum in Vienna dedicated to the film, wrote \"In Britain it's a thriller about friendship and betrayal. In Vienna it's a tragedy about Austria's troubled relationship with its past.\"\r\nSome critics at the time criticised the film's unusual camera angles. C. A. Lejeune in The Observer described Reed's \"habit of printing his scenes askew, with floors sloping at a diagonal and close-ups deliriously tilted\" as \"most distracting\". American director William Wyler, Reed's close friend, sent him a spirit level, with a note stating \"Carol, next time you make a picture, just put it on top of the camera, will you?\"\r\nUpon its release in Britain and America, the film received overwhelmingly positive reviews. Time wrote that the film was \"crammed with cinematic plums that would do the early Hitchcock proud—ingenious twists and turns of plot, subtle detail, full-bodied bit characters, atmospheric backgrounds that become an intrinsic part of the story, a deft commingling of the sinister with the ludicrous, the casual with the bizarre.\" The New York Times movie critic Bosley Crowther, after a prefatory qualification that the film was \"designed to excite and entertain\", wrote that Reed \"brilliantly packaged the whole bag of his cinematic tricks, his whole range of inventive genius for making the camera expound. His eminent gifts for compressing a wealth of suggestion in single shots, for building up agonized tension and popping surprises are fully exercised. His devilishly mischievous humor also runs lightly through the film, touching the darker depressions with little glints of the gay or macabre.\" One very rare exception was the British communist paper Daily Worker (later the Morning Star), which complained that \"no effort is spared to make the Soviet authorities as sinister and unsympathetic as possible.\"\r\nIn Walker Percy's The Moviegoer, the narrator recalls:\r\nOther people, so I have read, treasure memorable moments from their lives; the time they climbed the Parthenon at sunrise, the summer night one met a lonely girl in Central Park and achieved with her a sweet and natural relationship, as they say in books. I too once met a girl in Central Park, but it is not much to remember. What I remember is the time John Wayne killed three men with a carbine he was falling to dusty street in Stagecoach, and the time the kitten found Orson Welles in the doorway in The Third Man.— Walker Percy, The Moviegoer\r\nRoger Ebert wrote that \"I remember the kitten in the doorway too. It was a rain day in Paris in 1962, and I was visiting Europe for the first time. A little cinema on the Left Bank was showing The Third Man, and I went, into the humid cave of Galuise (sic?) smoke and perspiration, and saw the movie for the first time. When Welles made his entrance, I was lost to the movies.\" He added the film to his \"Great Movies\" list and wrote, \"Of all the movies that I have seen, this one most completely embodies the romance of going to the movies.\" In a special episode of Siskel & Ebert in 1994 discussing film villains, Ebert named Lime as his favourite film villain. Gene Siskel remarked that it was an \"exemplary piece of moviemaking, highlighting the ruins of World War II and juxtaposing it with the characters' own damaged histories\".\r\nThe film has a 99% rating on Rotten Tomatoes based on 80 reviews, with an average rating of 9.3/10 and the following consensus: \"This atmospheric thriller is one of the undisputed masterpieces of cinema, and boasts iconic performances from Joseph Cotten and Orson Welles.\"\r\nThe Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.\r\nSoundtrack release\r\n\"The Third Man Theme\" was released as a single in 1949/50 (Decca in the UK, London Records in the US). It became a best-seller; by November 1949, 300,000 records had been sold in Britain, with the teen-aged Princess Margaret a reported fan. Following its release in the US in 1950, \"The Third Man Theme\" spent 11 weeks at number one on Billboard's US Best Sellers in Stores chart, from 29 April to 8 July. The exposure made Anton Karas an international star, and the trailer for the film stated that \"the famous musical score by Anton Karas\" would have the audience \"in a dither with his zither\".\r\nAwards and honours\r\nBesides its top ranking in the BFI Top 100 British films list, in 2004 the magazine Total Film ranked it the fourth greatest British film of all time. In 2005, viewers of BBC Television's Newsnight Review voted the film their fourth favourite of all time, the only film in the top five made before 1970.\r\nThe film also placed 57th on the American Film Institute's list of top American films in 1998, though the film's only American connections were its executive co-producer David O. Selznick and its actors Orson Welles and Joseph Cotten. The other two executive co-producers, Sir Alexander Korda and Carol Reed, were Hungarian and British, respectively. In June 2008, the American Film Institute (AFI) revealed its 10 Top 10—the best 10 films in 10 \"classic\" American film genres—after polling over 1,500 people from the creative community. The Third Man was acknowledged as the fifth best film in the mystery genre. The film also placed 75th on AFI's list of 100 Years...100 Thrills and Harry Lime was listed as 37th villain in 100 Heroes and Villains.\r\nCopyright status\r\nIn the United Kingdom, films of this vintage are copyright protected as dramatic works until 70 years after the end of the year in which that last \"principal author\" died. The principal authors are generally the writer/s, director/s or composer/s of original work, and since in the case of The Third Man Graham Greene died in 1991, the film is protected until the end of 2061.\r\nThis film lapsed into public domain in the United States when the copyright was not renewed after David Selznick's death. In 1996, the Uruguay Round Agreements Act restored the film's U.S. copyright protection to StudioCanal Image UK Ltd. The Criterion Collection released a digitally restored DVD of the original British print of the film. In 2008, Criterion released a Blu-ray edition, and in September 2010, Lions Gate reissued the film on Blu-ray.\r\nOn 18 January 2012, the Supreme Court of the United States ruled in Golan v. Holder that the copyright clause of the United States Constitution does not prevent the U.S. from meeting its treaty obligations towards copyright protection for foreign works. Following the ruling, notable films such as The Third Man and The 39 Steps were taken back out of the public domain and became fully copyrighted in the United States. Under current U.S. copyright law, The Third Man will remain copyrighted until 1 January 2045.\r\nAdaptations\r\nCotten reprised his role as Holly Martins in the one-hour Theatre Guild on the Air radio adaptation on 7 January 1951. It was also adapted as a one-hour radio play on two broadcasts of Lux Radio Theatre: on 9 April 1951 with Joseph Cotten reprising his role and on 8 February 1954 with Ray Milland as Martins.\r\nThe British radio series The Adventures of Harry Lime (broadcast in the US as The Lives of Harry Lime) created as a prequel to the film, centres on Lime's adventures before his \"death in Vienna\", and Welles reprises his role as a somewhat less nefarious adventurer anti-hero than the sociopathic opportunist depicted in the film's incarnation. Fifty-two episodes aired in 1951 and 1952, several of which Welles wrote, including \"Ticket to Tangiers\", which is included on the Criterion Collection and Studio Canal releases of The Third Man. Recordings of the 1952 episodes \"Man of Mystery\", \"Murder on the Riviera\", and \"Blackmail Is a Nasty Word\" are included on the Criterion Collection DVD The Complete Mr. Arkadin.\r\nHarry Lime appeared in two stories in the fourth issue of Super Detective Library.\r\nA television spin-off starring Michael Rennie as Harry Lime ran for five seasons from 1959 to 1965. Seventy-seven episodes were filmed; directors included Paul Henreid (10 episodes) and Arthur Hiller (six episodes). Jonathan Harris played sidekick Bradford Webster for 72 episodes, and Roger Moore guest-starred in the installment \"The Angry Young Man\", which Hiller directed.",
    "html": "<p>The Third Man is a 1949 British film noir directed by Carol Reed, written by Graham Greene and starring Joseph Cotten, Alida Valli, Orson Welles, and Trevor Howard. Set in postwar Vienna, the film centres on American Holly Martins (Cotten), who arrives in the city to accept a job with his friend Harry Lime (Welles), only to learn that Lime has died. Viewing his death as suspicious, Martins elects to stay in Vienna and investigate the matter.</p><p>The atmospheric use of black-and-white expressionist cinematography by Robert Krasker, with harsh lighting and largely subtle \"Dutch angle\" camera technique, is a major feature of The Third Man. Combined with the iconic theme music by zither player Anton Karas, seedy locations and acclaimed performances from the cast, the style evokes the atmosphere of an exhausted, cynical post-war Vienna at the start of the Cold War.</p><p>Greene wrote the novella of the same name as preparation for the screenplay. Karas's title composition \"The Third Man Theme\" topped the international music charts in 1950, bringing the previously unknown performer international fame; the theme would also inspire Nino Rota's principal melody in La Dolce Vita (1960). The Third Man is considered one of the greatest films of all time, celebrated for its acting, musical score and atmospheric cinematography.</p><p>In 1999, the British Film Institute voted The Third Man the greatest British film of all time. In 2011, a poll of 150 actors, directors, writers, producers and critics for Time Out ranked it the second best British film ever.</p><br/><h3>Plot</h3><p>Holly Martins, an American author of western fiction, arrives in post–World War II Vienna seeking his childhood friend, Harry Lime, who has offered him a job. Martins is told that Lime was killed by a car while crossing the street. At Lime's funeral, Martins meets two British Royal Military Police: Sergeant Paine, a fan of Martins's books, and Major Calloway. Afterward, Martins is asked by Mr. Crabbin to lecture at a book club a few days later. He then meets a friend of Lime's, \"Baron\" Kurtz, who tells Martins that he and another friend, a Romanian called Popescu, carried Lime to the side of the street after the accident. Before he died, Lime asked them to take care of Martins as well as Lime's girlfriend, actress Anna Schmidt.</p><p>As Martins and Anna query Lime's death, they realise that accounts differ as to whether two or three men carried away the body. The porter at Lime's apartment tells them that he saw a third man help carry away the body. Later, the porter offers to give Martins more information, but he is murdered before Martins can talk to him. Martins confronts Major Calloway and demands that Lime's death be investigated. Calloway reveals that Lime was stealing penicillin from military hospitals, diluting it, then selling it on the black market, injuring or killing countless infants. Martins, convinced by hard evidence, agrees to leave.</p><p>Martins visits Anna that evening. After leaving he walks the streets, until he notices Harry's cat and realises someone is watching from a darkened doorway. It is Harry. Martins calls out but Lime flees and vanishes. Martins summons Calloway, who realizes that Lime has escaped through the city's extensive sewers. The British police exhume Lime's coffin and discover that the body is the missing orderly who stole the penicillin for Lime. Anna is to be sent to the Soviet sector, and is questioned again by Calloway.</p><p>Martins meets Lime and they ride the Wiener Riesenrad. Lime obliquely threatens Martins before leaving quickly. Calloway then asks Martins to help arrest Lime. Martins agrees to help on one condition, demanding Anna's safe conduct out of Vienna. Anna is about to leave on the train when she spots Martins, who has come to observe her departure. She forces the plan out of him but wants no part of it. Exasperated, Martins decides to leave Vienna, but on the way to the airport, Calloway stops at a hospital to show Martins children crippled or dying of meningitis who were treated with Lime's diluted penicillin. Martins agrees to help the police again.</p><p>Lime arrives at a small café to meet Martins, but Anna is able to warn Lime that the police are closing in. He tries again to escape using the sewer tunnels, but the police are there. Lime shoots and kills Paine, but Calloway shoots and badly wounds Lime. Injured Lime drags himself up a cast-iron stairway to a street grating; however, cannot lift it. Martins finds Lime at the grating and hears Calloway shouting to shoot him on sight. Lime and Martins exchange a look, and then Martins shoots and kills him, using Paine's pistol. Martins attends Lime's second funeral, at the risk of missing his flight out of Vienna. He waits on the street to speak with Anna, but she totally ignores him and walks right past him without even glancing in his direction.</p><br/><h3>Cast</h3><ul><li>Joseph Cotten as Holly Martins</li><li>Orson Welles as Harry Lime</li><li>Alida Valli (credited as Valli) as Anna Schmidt</li><li>Trevor Howard as Major Calloway</li><li>Paul Hörbiger as Karl, Lime's porter (credited as Paul Hoerbiger)</li><li>Ernst Deutsch as \"Baron\" Kurtz</li><li>Erich Ponto as Dr. Winkel</li><li>Siegfried Breuer as Popescu</li><li>Hedwig Bleibtreu as Anna's old landlady</li><li>Bernard Lee as Sergeant Paine</li><li>Wilfrid Hyde-White as Crabbin</li></ul><p>Uncredited</p><ul><li>Annie Rosar as the porter's wife</li><li>Alexis Chesnakov as Brodsky, Russian official</li><li>Herbert Halbik as Little Hansel - Boy with Ball</li><li>Robert Brown as British Military Policeman in the sewer chase scene</li><li>Paul Hardtmuth as the hall porter at Hotel Sacher</li><li>Geoffrey Keen as British Military Policeman</li><li>Eric Pohlmann as waiter at Smolka's</li><li>Reed De Rouen as American Military Policeman at Railroad Station</li><li>Brother Theodore as Man on Street</li><li>Nelly Arno as Kurtz's mother</li><li>Karel Štěpánek as actor at Josefstadt Theatre</li><li>Joseph Cotten as the narrator (pre-1999 US version)</li><li>Carol Reed as the narrator (pre-1999 UK, and all post-'99 versions)</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Before writing the screenplay, Graham Greene worked out the atmosphere, characterisation, and mood of the story by writing a novella as a source text for the screenplay. He never intended it to be read by the general public, although it was later published under the same name as the film. In 1948, he met Elizabeth Montagu in Vienna. She gave him tours of the city, its sewers, and some of its less reputable night-clubs. She also introduced Greene to Peter Smolka, the central European correspondent for The Times. Smolka gave Greene the stories about the black market in Vienna.</p><p>The narrator in the novella is Major Calloway, which gives the book a slightly different emphasis from that of the screenplay. A small portion of his narration appears in a modified form at the film's beginning in Reed's voice-over: \"I never knew the old Vienna\". Other differences include both Martins's and Lime's nationalities; they are English in the book. Martins's given name is Rollo rather than Holly. Popescu's character is an American called Cooler. Crabbin was a single character in the novella; the screenplay's original draft replaced him with two characters, played by Basil Radford and Naunton Wayne, but ultimately in the film, as in the novella, Crabbin remains a single character.</p><p>There is also a difference of ending. The novella's implies that Anna and Martins are about to begin a new life together, in stark contrast to the unmistakable snub by Anna that closes the film. In the book, Anna does walk away from Lime's grave, but the text continues:</p><blockquote>I watched him striding off on his overgrown legs after the girl. He caught her up and they walked side by side. I don't think he said a word to her: it was like the end of a story except that before they turned out of my sight her hand was through his arm—which is how a story usually begins. He was a very bad shot and a very bad judge of character, but he had a way with Westerns (a trick of tension) and with girls (I wouldn't know what).</blockquote><p>During the shooting of the film, the final scene was the subject of a dispute between Greene and David O. Selznick, who wanted the happy ending of the novella; and Reed, who stubbornly refused to end the film on what he felt was an artificially happy note. Greene later wrote: \"One of the very few major disputes between Carol Reed and myself concerned the ending, and he has been proved triumphantly right.\"</p><p>David O. Selznick's contribution, according to himself, was mainly to have provided his actors Cotten and Welles and to have produced the shortened US version.</p><p>Through the years there was occasional speculation that Welles, rather than Reed, was the de facto director of The Third Man. In Jonathan Rosenbaum's 2007 book Discovering Orson Welles, Rosenbaum calls it a \"popular misconception\", although Rosenbaum did note that the film \"began to echo the Wellesian theme of betrayed male friendship and certain related ideas from Citizen Kane.\" In the final analysis, Rosenbaum writes, \" didn't direct anything in the picture; the basics of his shooting and editing style, its music and meaning, are plainly absent. Yet old myths die hard, and some viewers persist in believing otherwise.\" Welles himself fuelled this theory in a 1958 interview, in which he said that he had had an important role in making The Third Man, but that it was a \"delicate matter, because wasn't the producer\". However, in a 1967 interview with Peter Bogdanovich, Welles said that his involvement was minimal: \"It was Carol's picture\". However, Welles did contribute some of the film's best-known dialogue. Bogdanovich also stated in the introduction to the DVD:</p><blockquote>However, I think it's important to note that the look of The Third Man—and, in fact, the whole film—would be unthinkable without Citizen Kane, The Stranger, and The Lady from Shanghai, all of which Orson made in the '40s, and all of which preceded The Third Man. Carol Reed, I think, was definitely influenced by Orson Welles, the director, from the films he had made.</blockquote><h4>Principal photography</h4><p>Six weeks of principal photography was shot on location in Vienna, ending on 11 December 1948. Some use was made of the Sievering Studios facilities in the city. Production then moved to the Worton Hall Studios in Isleworth and Shepperton Studios near London and was completed in March 1949. Thomas Riegler emphasises the opportunities for Cold War espionage that the Vienna set made available, and notes that \"the audio engineer Jack Davies noticed at least one mysterious person on the set.\"</p><p>The scenes of Harry Lime in the sewer were shot on location or on sets built at Shepperton; most of the location shots used doubles for Welles. However, Reed claimed that, despite initial reluctance, Welles quickly became enthusiastic, and stayed in Vienna to finish the film.</p><p>According to the recollection of assistant director Guy Hamilton, interviewed in 2015, Greene and Reed worked very well together, but Orson Welles \"generally annoyed everyone on the set\". His temporary absence forced Hamilton to step in as body double for him. Apparently, the filming of the sewer scenes was moved to studios in the UK as a result of Welles' complaints about shooting in the actual sewers.</p><p>Reed had four different camera units shooting around Vienna for the duration of the production. He worked around the clock, using Benzedrine to stay awake.</p><h4>\"Swiss cuckoo clock\" speech</h4><p>In a famous scene, Lime meets Martins on the Wiener Riesenrad in the Prater amusement park. Looking down on the people below from his vantage point, Lime compares them to dots, and says that it would be insignificant if one of them or a few of them \"stopped moving, forever\". Back on the ground, he notes:</p><blockquote>You know what the fellow said – in Italy, for 30 years under the Borgias, they had warfare, terror, murder, and blood-shed; but they produced Michelangelo, Leonardo da Vinci, and the Renaissance. In Switzerland, they had brotherly love; they had 500 years of democracy and peace – and what did that produce? The cuckoo clock!</blockquote><p>Welles added this remark – in the published script, it is in a footnote. Greene wrote in a letter, \"What happened was that during the shooting of The Third Man it was found necessary for the timing to insert another sentence.\" Welles apparently said the lines came from \"an old Hungarian play\"—in any event the idea is not original to Welles, acknowledged by the phrase \"what the fellow said\".</p><p>The likeliest source is the painter James Abbott McNeill Whistler. In a lecture on art from 1885 (published in Mr Whistler's \"Ten O'Clock\"), he said \"The Swiss in their mountains ... What more worthy people! ... yet, the perverse and scornful will have none of it, and the sons of patriots are left with the clock that turns the mill, and the sudden cuckoo, with difficulty restrained in its box! For this was Tell a hero! For this did Gessler die!\" In a 1916 reminiscence, American painter Theodore Wores said that he \"tried to get an acknowledgment from Whistler that San Francisco would some day become a great art center on account of our climatic, scenic and other advantages. 'But environment does not lead to a production of art,' Whistler retorted. 'Consider Switzerland. There the people have everything in the form of natural advantages – mountains, valleys and blue sky. And what have they produced? The cuckoo clock!\"</p><p>Or it may be that Welles was influenced by Geoffrey Household, who wrote in his novel Rogue Male: \"...Swiss. A people, my dear fellow, of quite extraordinary stupidity and immorality. A combination which only a long experience of democratic government could have produced.\"</p><p>This Is Orson Welles (1993) quotes Welles: \"When the picture came out, the Swiss very nicely pointed out to me that they've never made any cuckoo clocks,\" as the clocks are native to the German Black Forest. Writer John McPhee pointed out that when the Borgias flourished in Italy, Switzerland had \"the most powerful and feared military force in Europe\" and was not the peacefully neutral country it later became.</p><h4>Music</h4><blockquote>What sort of music it is, whether jaunty or sad, fierce or provoking, it would be hard to reckon; but under its enthrallment, the camera comes into play ... The unseen zither-player ... is made to employ his instrument much as the Homeric bard did his lyre.</blockquote><p>William Whitebait, New Statesman and Nation (1949)</p><p>Anton Karas composed the musical score and performed it on the zither. Before the production came to Vienna, Karas was an unknown performer in local Heurigers. According to Time:</p><blockquote>The picture demanded music appropriate to post-World War II Vienna, but director Reed had made up his mind to avoid schmaltzy, heavily orchestrated waltzes. In Vienna one night Reed listened to a wine-garden zitherist named Anton Karas, was fascinated by the jangling melancholy of his music.</blockquote><p>According to Guy Hamilton, Reed met Karas by coincidence at a party in Vienna, where he was playing the zither. Reed brought Karas to London, where the musician worked with Reed on the score for six weeks. Karas stayed at Reed's house during that time. Film reviewer Roger Ebert wrote \"Has there ever been a film where the music more perfectly suited the action than in Carol Reed's The Third Man?\"</p><p>Additional music for the film was written by the Australian-born composer Hubert Clifford under the pseudonym of Michael Sarsfield. From 1944 until 1950 Clifford was working as Musical Director for Korda at London Film Productions, where he chose the composers and conducted the scores for films, as well as composing many original scores of his own. An extract from his Third Man music, The Casanova Melody, was orchestrated by Rodney Newton in 2000.</p><h4>Differences between releases</h4><p>As the original British release begins, the voice of director Carol Reed (uncredited) describes post-war Vienna from a racketeer's point of view. The version shown in American cinemas cut 11 minutes of footage and replaced Reed's voice-over with narration by Joseph Cotten as Holly Martins. David O. Selznick instituted the replacement because he did not think American audiences would relate to the seedy tone of the original. Today, Reed's original version appears on American DVDs, in showings on Turner Classic Movies, and in U.S. cinema releases, with the 11 minutes of footage restored, including a shot of a near topless dancer in a bar that would have violated the U.S. Code in 1948. Both the Criterion Collection and Studio Canal DVD releases include a comparison of the two opening monologues.</p><p>A restored version of the film was released in the United Kingdom on 26 June 2015.</p><br/><h3>Reception</h3><p>The Grand Gala World Premiere was held at the Ritz Cinema in Hastings, East Sussex on 1 September 1949.</p><h4>Box office</h4><p>In the United Kingdom, The Third Man was the most popular film at the British box office for 1949.</p><p>According to Kinematograph Weekly the 'biggest winner' at the box office in 1949 Britain was The Third Man with \"runners up\" being Johnny Belinda, The Secret Life of Walter Mitty, The Paleface, Scott of the Antarctic, The Blue Lagoon, Maytime in Mayfair, Easter Parade, Red River, and You Can't Sleep Here.</p><h4>Critical</h4><p>In Austria, \"local critics were underwhelmed\", and the film ran for only a few weeks. Still, the Viennese Arbeiter-Zeitung, although critical of a \"not-too-logical plot\", praised the film's \"masterful\" depiction of a \"time out of joint\" and the city's atmosphere of \"insecurity, poverty and post-war immorality\". William Cook, after his 2006 visit to an eight-room museum in Vienna dedicated to the film, wrote \"In Britain it's a thriller about friendship and betrayal. In Vienna it's a tragedy about Austria's troubled relationship with its past.\"</p><p>Some critics at the time criticised the film's unusual camera angles. C. A. Lejeune in The Observer described Reed's \"habit of printing his scenes askew, with floors sloping at a diagonal and close-ups deliriously tilted\" as \"most distracting\". American director William Wyler, Reed's close friend, sent him a spirit level, with a note stating \"Carol, next time you make a picture, just put it on top of the camera, will you?\"</p><p>Upon its release in Britain and America, the film received overwhelmingly positive reviews. Time wrote that the film was \"crammed with cinematic plums that would do the early Hitchcock proud—ingenious twists and turns of plot, subtle detail, full-bodied bit characters, atmospheric backgrounds that become an intrinsic part of the story, a deft commingling of the sinister with the ludicrous, the casual with the bizarre.\" The New York Times movie critic Bosley Crowther, after a prefatory qualification that the film was \"designed to excite and entertain\", wrote that Reed \"brilliantly packaged the whole bag of his cinematic tricks, his whole range of inventive genius for making the camera expound. His eminent gifts for compressing a wealth of suggestion in single shots, for building up agonized tension and popping surprises are fully exercised. His devilishly mischievous humor also runs lightly through the film, touching the darker depressions with little glints of the gay or macabre.\" One very rare exception was the British communist paper Daily Worker (later the Morning Star), which complained that \"no effort is spared to make the Soviet authorities as sinister and unsympathetic as possible.\"</p><p>In Walker Percy's The Moviegoer, the narrator recalls:</p><blockquote>Other people, so I have read, treasure memorable moments from their lives; the time they climbed the Parthenon at sunrise, the summer night one met a lonely girl in Central Park and achieved with her a sweet and natural relationship, as they say in books. I too once met a girl in Central Park, but it is not much to remember. What I remember is the time John Wayne killed three men with a carbine he was falling to dusty street in Stagecoach, and the time the kitten found Orson Welles in the doorway in The Third Man.— Walker Percy, The Moviegoer</blockquote><p>Roger Ebert wrote that \"I remember the kitten in the doorway too. It was a rain day in Paris in 1962, and I was visiting Europe for the first time. A little cinema on the Left Bank was showing The Third Man, and I went, into the humid cave of Galuise (sic?) smoke and perspiration, and saw the movie for the first time. When Welles made his entrance, I was lost to the movies.\" He added the film to his \"Great Movies\" list and wrote, \"Of all the movies that I have seen, this one most completely embodies the romance of going to the movies.\" In a special episode of Siskel & Ebert in 1994 discussing film villains, Ebert named Lime as his favourite film villain. Gene Siskel remarked that it was an \"exemplary piece of moviemaking, highlighting the ruins of World War II and juxtaposing it with the characters' own damaged histories\".</p><p>The film has a 99% rating on Rotten Tomatoes based on 80 reviews, with an average rating of 9.3/10 and the following consensus: \"This atmospheric thriller is one of the undisputed masterpieces of cinema, and boasts iconic performances from Joseph Cotten and Orson Welles.\"</p><p>The Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.</p><br/><h3>Soundtrack release</h3><p>\"The Third Man Theme\" was released as a single in 1949/50 (Decca in the UK, London Records in the US). It became a best-seller; by November 1949, 300,000 records had been sold in Britain, with the teen-aged Princess Margaret a reported fan. Following its release in the US in 1950, \"The Third Man Theme\" spent 11 weeks at number one on Billboard's US Best Sellers in Stores chart, from 29 April to 8 July. The exposure made Anton Karas an international star, and the trailer for the film stated that \"the famous musical score by Anton Karas\" would have the audience \"in a dither with his zither\".</p><br/><h3>Awards and honours</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"3\"><span>Academy Awards</span></td><td><span>Best Director</span></td><td><span>Carol Reed</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography - Black and White</span></td><td><span>Robert Krasker</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Oswald Hafenrichter</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td rowspan=\"4\">Carol Reed</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best British Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Cannes Film Festival</span></td><td><span>Palme d'Or</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>National Board of Review Awards</span></td><td colspan=\"2\"><span class=\"mw-redirect\">Top Ten Foreign Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr></tbody></table><p>Besides its top ranking in the BFI Top 100 British films list, in 2004 the magazine Total Film ranked it the fourth greatest British film of all time. In 2005, viewers of BBC Television's Newsnight Review voted the film their fourth favourite of all time, the only film in the top five made before 1970.</p><p>The film also placed 57th on the American Film Institute's list of top American films in 1998, though the film's only American connections were its executive co-producer David O. Selznick and its actors Orson Welles and Joseph Cotten. The other two executive co-producers, Sir Alexander Korda and Carol Reed, were Hungarian and British, respectively. In June 2008, the American Film Institute (AFI) revealed its 10 Top 10—the best 10 films in 10 \"classic\" American film genres—after polling over 1,500 people from the creative community. The Third Man was acknowledged as the fifth best film in the mystery genre. The film also placed 75th on AFI's list of 100 Years...100 Thrills and Harry Lime was listed as 37th villain in 100 Heroes and Villains.</p><br/><h3>Copyright status</h3><p>In the United Kingdom, films of this vintage are copyright protected as dramatic works until 70 years after the end of the year in which that last \"principal author\" died. The principal authors are generally the writer/s, director/s or composer/s of original work, and since in the case of The Third Man Graham Greene died in 1991, the film is protected until the end of 2061.</p><p>This film lapsed into public domain in the United States when the copyright was not renewed after David Selznick's death. In 1996, the Uruguay Round Agreements Act restored the film's U.S. copyright protection to StudioCanal Image UK Ltd. The Criterion Collection released a digitally restored DVD of the original British print of the film. In 2008, Criterion released a Blu-ray edition, and in September 2010, Lions Gate reissued the film on Blu-ray.</p><p>On 18 January 2012, the Supreme Court of the United States ruled in Golan v. Holder that the copyright clause of the United States Constitution does not prevent the U.S. from meeting its treaty obligations towards copyright protection for foreign works. Following the ruling, notable films such as The Third Man and The 39 Steps were taken back out of the public domain and became fully copyrighted in the United States. Under current U.S. copyright law, The Third Man will remain copyrighted until 1 January 2045.</p><br/><h3>Adaptations</h3><p>Cotten reprised his role as Holly Martins in the one-hour Theatre Guild on the Air radio adaptation on 7 January 1951. It was also adapted as a one-hour radio play on two broadcasts of Lux Radio Theatre: on 9 April 1951 with Joseph Cotten reprising his role and on 8 February 1954 with Ray Milland as Martins.</p><p>The British radio series The Adventures of Harry Lime (broadcast in the US as The Lives of Harry Lime) created as a prequel to the film, centres on Lime's adventures before his \"death in Vienna\", and Welles reprises his role as a somewhat less nefarious adventurer anti-hero than the sociopathic opportunist depicted in the film's incarnation. Fifty-two episodes aired in 1951 and 1952, several of which Welles wrote, including \"Ticket to Tangiers\", which is included on the Criterion Collection and Studio Canal releases of The Third Man. Recordings of the 1952 episodes \"Man of Mystery\", \"Murder on the Riviera\", and \"Blackmail Is a Nasty Word\" are included on the Criterion Collection DVD The Complete Mr. Arkadin.</p><p>Harry Lime appeared in two stories in the fourth issue of Super Detective Library.</p><p>A television spin-off starring Michael Rennie as Harry Lime ran for five seasons from 1959 to 1965. Seventy-seven episodes were filmed; directors included Paul Henreid (10 episodes) and Arthur Hiller (six episodes). Jonathan Harris played sidekick Bradford Webster for 72 episodes, and Roger Moore guest-starred in the installment \"The Angry Young Man\", which Hiller directed.</p><br/>"
  },
  "errorMessage": ""
}