{
  "imDbId": "tt6751668",
  "title": "Parasite",
  "fullTitle": "Parasite (2019)",
  "type": "Movie",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "Parasite (2019 film)",
  "url": "https://en.wikipedia.org/wiki/Parasite_(2019_film)",
  "plotShort": {
    "plainText": "Parasite (Korean: 기생충; Hanja: 寄生蟲; RR: Gisaengchung) is a 2019 South Korean black comedy thriller film directed by Bong Joon-ho, who co-wrote the screenplay with Han Jin-won and co-produced. The film, starring Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Choi Woo-shik, Park So-dam, Jang Hye-jin, Park Myung-hoon and Lee Jung-eun, follows a poor family who scheme to become employed by a wealthy family, infiltrating their household by posing as unrelated, highly qualified individuals.\r\nThe script is based on Bong's source material from a play written in 2013. He later adapted it into a 15-page film draft, and it was split into three different drafts by Han. Bong stated that he was inspired by the 1960 Korean film The Housemaid, and by the Christine and Léa Papin incident in the 1930s. Filming began in May 2018 and finished that September. The project included cinematographer Hong Kyung-pyo, film editor Yang Jin-mo, and composer Jung Jae-il. Darcy Paquet, an American film critic and author, provided English translations for the film's international release.\r\nParasite premiered at the 2019 Cannes Film Festival on 21 May 2019, where it became the first Korean film to win its top prize, the Palme d'Or. It was released in South Korea by CJ Entertainment on 30 May, and was praised for Bong's direction and screenplay, and also for its editing and production design. It grossed over $263 million worldwide on a $15.5 million budget.\r\nAmong its numerous accolades, Parasite won the leading four awards at the 92nd Academy Awards: Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film, becoming the first non English-language film to win the Academy Award for Best Picture. It is the first South Korean film to receive any Academy Award recognition, and one of only three films overall to win both the Palme d'Or and the Academy Award for Best Picture, the first such achievement in over 60 years. It won the Golden Globe Award for Best Foreign Language Film and the BAFTA Award for Best Film Not in the English Language, and became the first non English-language film to win the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. A television series based on it is in early development.",
    "html": "<p>Parasite (Korean: 기생충; Hanja: 寄生蟲; RR: Gisaengchung) is a 2019 South Korean black comedy thriller film directed by Bong Joon-ho, who co-wrote the screenplay with Han Jin-won and co-produced. The film, starring Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Choi Woo-shik, Park So-dam, Jang Hye-jin, Park Myung-hoon and Lee Jung-eun, follows a poor family who scheme to become employed by a wealthy family, infiltrating their household by posing as unrelated, highly qualified individuals.</p><p>The script is based on Bong's source material from a play written in 2013. He later adapted it into a 15-page film draft, and it was split into three different drafts by Han. Bong stated that he was inspired by the 1960 Korean film The Housemaid, and by the Christine and Léa Papin incident in the 1930s. Filming began in May 2018 and finished that September. The project included cinematographer Hong Kyung-pyo, film editor Yang Jin-mo, and composer Jung Jae-il. Darcy Paquet, an American film critic and author, provided English translations for the film's international release.</p><p>Parasite premiered at the 2019 Cannes Film Festival on 21 May 2019, where it became the first Korean film to win its top prize, the Palme d'Or. It was released in South Korea by CJ Entertainment on 30 May, and was praised for Bong's direction and screenplay, and also for its editing and production design. It grossed over $263 million worldwide on a $15.5 million budget.</p><p>Among its numerous accolades, Parasite won the leading four awards at the 92nd Academy Awards: Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film, becoming the first non English-language film to win the Academy Award for Best Picture. It is the first South Korean film to receive any Academy Award recognition, and one of only three films overall to win both the Palme d'Or and the Academy Award for Best Picture, the first such achievement in over 60 years. It won the Golden Globe Award for Best Foreign Language Film and the BAFTA Award for Best Film Not in the English Language, and became the first non English-language film to win the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. A television series based on it is in early development.</p>"
  },
  "plotFull": {
    "plainText": "Parasite (Korean: 기생충; Hanja: 寄生蟲; RR: Gisaengchung) is a 2019 South Korean black comedy thriller film directed by Bong Joon-ho, who co-wrote the screenplay with Han Jin-won and co-produced. The film, starring Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Choi Woo-shik, Park So-dam, Jang Hye-jin, Park Myung-hoon and Lee Jung-eun, follows a poor family who scheme to become employed by a wealthy family, infiltrating their household by posing as unrelated, highly qualified individuals.\r\nThe script is based on Bong's source material from a play written in 2013. He later adapted it into a 15-page film draft, and it was split into three different drafts by Han. Bong stated that he was inspired by the 1960 Korean film The Housemaid, and by the Christine and Léa Papin incident in the 1930s. Filming began in May 2018 and finished that September. The project included cinematographer Hong Kyung-pyo, film editor Yang Jin-mo, and composer Jung Jae-il. Darcy Paquet, an American film critic and author, provided English translations for the film's international release.\r\nParasite premiered at the 2019 Cannes Film Festival on 21 May 2019, where it became the first Korean film to win its top prize, the Palme d'Or. It was released in South Korea by CJ Entertainment on 30 May, and was praised for Bong's direction and screenplay, and also for its editing and production design. It grossed over $263 million worldwide on a $15.5 million budget.\r\nAmong its numerous accolades, Parasite won the leading four awards at the 92nd Academy Awards: Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film, becoming the first non English-language film to win the Academy Award for Best Picture. It is the first South Korean film to receive any Academy Award recognition, and one of only three films overall to win both the Palme d'Or and the Academy Award for Best Picture, the first such achievement in over 60 years. It won the Golden Globe Award for Best Foreign Language Film and the BAFTA Award for Best Film Not in the English Language, and became the first non English-language film to win the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. A television series based on it is in early development.\r\nPlot\r\nThe Kim family live in a semi-basement flat (banjiha) in Seoul, have low-income jobs, and struggle for money. Min-hyuk, a university student, gives the family a scholar's rock meant to promise wealth. Leaving to study abroad, he suggests that the Kims' son, Ki-woo, pose as a university student to take over his job as an English language tutor for Da-hye, the daughter of the rich Park family. After his sister Ki-jung helps create a false certificate for him in Photoshop, Ki-woo, posing as a Yonsei University student, is subsequently hired by the Park family.\r\nThe Kim family schemes to get each member a job with the Park family. The Kim daughter, Ki-jung, poses as \"Jessica\" and, using Ki-woo as a reference, becomes an art therapist to the Parks' young son, Da-song. Ki-jung frames Yoon, Mr Park's driver, by making it appear he had a sexual encounter in the car, then recommends her father, Ki-taek, to replace him. The Kims exploit the peach allergy of the Parks' long-time housekeeper, Moon-gwang, to convince Mrs Park that she has tuberculosis, and the Kim mother, Chung-sook, is hired to replace her. Ki-woo begins a secret romantic relationship with Da-hye.\r\nWhen the Parks leave on a camping trip, the Kims revel in the luxuries of the house. Moon-gwang appears at the door, telling Chung-sook she left something in the basement. She goes through a hidden entrance to an underground bunker created by the architect and previous homeowner. There, Moon-gwang's husband, Geun-sae, has been secretly living for over four years, hiding from loan sharks. Chung-sook refuses Moon-gwang's pleas to help Geun-sae remain in the bunker, but the eavesdropping Kims accidentally reveal themselves. Moon-gwang videotapes them on her phone and threatens to expose their ruse to the Park family.\r\nThe Parks call to say that they'll return early due to a severe rainstorm. The Kims scramble to clean up the house and subdue Moon-gwang and Geun-sae, trapping them in the bunker. Ki-jung, Ki-taek and Ki-woo hide under a table, and overhear Mr Park's comments about Ki-taek's odour. The Kims escape and find their flat flooded with sewer water, and take shelter in a gymnasium with other displaced people.\r\nThe next day, Mrs Park hosts a house party for Da-song's birthday with the Kim family's assistance. Ki-woo enters the bunker to find Geun-sae. Finding Moon-gwang has died from a concussion she received during the brawl, he is attacked by a deranged Geun-sae who escapes, leaving Ki-woo lying in a pool of blood. Seeking to avenge Moon-gwang, Geun-sae stabs Ki-jung with a kitchen knife in front of the horrified guests. Da-song suffers another traumatic seizure upon seeing Geun-sae, whom Da-song once saw as a \"ghost\" emerging from the basement on the night of a previous birthday. A struggle breaks out until Chung-sook fatally impales Geun-sae with a barbecue skewer. While Ki-taek tends to Ki-jung, Mr Park orders Ki-taek to drive Da-song to the hospital. In the chaos, Ki-taek, upon seeing Mr Park's disgusted reaction to Geun-sae's odour, angrily kills him with the knife. Ki-taek flees, leaving the rest of the Kim family behind.\r\nWeeks later, Ki-woo is recovering from a brain operation. He and Chung-sook are convicted of fraud and put on probation. Ki-jung has died from her injuries, and Ki-taek, wanted by the authorities, cannot be found. Geun-sae is assumed to have been an insane homeless man, and neither his nor Ki-taek's motive for the murders are known. Ki-woo spies on the Parks’ home, now occupied by a Swiss family (although Ki-taek thinks they are Germans) unaware of the house's history, and sees a message in Morse code from a flickering light. Ki-taek, who escaped into the bunker, has buried Moon-gwang in the garden and sends the message every day, hoping Ki-woo will see it. Still living in their basement flat with his mother, Ki-woo writes a letter to Ki-taek, vowing to earn enough money to buy the house and reunite with his father.\r\nCast\r\nSong Kang-ho as Kim Ki-taek (Mr Kim; 김기택; Gim Gitaek), the Kim family father who is hired as Park Dong-ik's chauffeur\r\nLee Sun-kyun as Park Dong-ik (Nathan; 박동익; Bak Dongik), the Park family father\r\nCho Yeo-jeong as Choi Yeon-gyo (Madame; 최연교; Choe Yeongyo), the Park mother\r\nChoi Woo-shik as Kim Ki-woo (Kevin; 김기우; Gim Giu), the Kims' son who is hired as Da-hye's English tutor (Choi stated that the character is \"intelligent but does not have the vigour needed to succeed in examinations\")\r\nPark So-dam as Kim Ki-jung (Jessica; 김기정; Gim Gijeong), the Kims' daughter who is hired as Da-song's art therapist\r\nJang Hye-jin as Chung-sook (박충숙; Bak Chungsuk), the Kim family mother who is hired as the Parks' housekeeper\r\nLee Jung-eun as Gook Moon-gwang (국문광; Guk Mungwang), the Parks' housekeeper, who also worked for the house's architect and previous owner of the house (Bong Joon-ho said her relationship with the architect and parts of her story \"that happen in between the sequences in the film\" will be explored in the spin-off TV series)\r\nPark Myung-hoon as Oh Geun-sae (오근세; O Geunse), Moon-gwang's husband\r\nJung Ji-so as Park Da-hye (박다혜; Bak Dahye), the Parks' daughter\r\nJung Hyeon-jun as Park Da-song (박다송; Bak Dasong), the Parks' son\r\nPark Keun-rok as Yoon (윤; Yun), Park Dong-ik's chauffeur\r\nPark Seo-joon as Min-hyuk (민혁; Minhyeok), Ki-woo's friend\r\nJung Yi-seo as a pizza parlour owner\r\nProduction\r\nDevelopment\r\nThe idea for Parasite originated in 2013. While working on Snowpiercer, Bong was encouraged by a theatre actor friend to write a play. He had been a tutor for the son of a wealthy family in Seoul in his early 20s and considered turning his experience into a stage production. The film's title, Parasite, was selected by Bong as it served a double meaning, which he had to convince the film's marketing group to use. Bong said \"Because the story is about the poor family infiltrating and creeping into the rich house, it seems very obvious that Parasite refers to the poor family, and I think that's why the marketing team was a little hesitant. But if you look at it the other way, you can say that rich family, they're also parasites in terms of labor. They can't even wash dishes, they can't drive themselves, so they leech off the poor family's labor. So both are parasites.\"\r\nWriting\r\nAfter completing Snowpiercer, Bong wrote a 15-page film treatment for the first half of Parasite, which his production assistant on Snowpiercer, Han Jin-won, turned into three different drafts of the screenplay. After finishing Okja, Bong returned to the project and finished the script. Han Jin-won received credit as a co-writer.\r\nBong said the film was influenced by the 1960 Korean \"domestic Gothic\" film The Housemaid in which a middle-class family's stability is threatened by the arrival of a disruptive interloper in the form of household help. The incident of Christine and Léa Papin—two live-in maids who murdered their employers in 1930s France—also inspired him. Bong also considered his own past, where he had tutored for a rich family. Bong said \"I got this feeling that I was infiltrating the private lives of complete strangers. Every week I would go into their house, and I thought how fun it would be if I could get all my friends to infiltrate the house one by one.\" Additionally, Moon-gwang's allergy to peaches was inspired by one of Bong's university friends having this allergy.\r\nDarcy Paquet, an American residing in South Korea, translated the English subtitles, writing directly with Bong. Paquet rendered Jjapaguri or Chapaguri, a dish cooked by a character in the film, as ram-don, meaning ramen-udon. It is a mix of Chapagetti and Neoguri produced by Nongshim. The English version of the film shows packages labelled in English \"ramyeon\" and \"udon\" to highlight to English speakers how the name was created. Paquet believed the word ram-don did not previously exist as he found no results on Google. On one occasion, Paquet used Oxford University as a reference instead of Seoul National University, and in another, used WhatsApp as the messaging application instead of KakaoTalk. Paquet chose Oxford over Harvard because of Bong's affinity for the United Kingdom, and because Paquet believed using Harvard would be \"too obvious a choice\". Paquet wrote, \"In order for humor to work, people need to understand it immediately. With an unfamiliar word, the humor is lost.\"\r\nFilming\r\nPrincipal photography for Parasite began on 18 May 2018, and ended on 19 September 2018. Filming took place around Seoul and in Jeonju. The director of photography was Hong Kyung-pyo, a well-known South Korean cinematographer who had worked with other well-known directors.\r\nThe Parks' house\r\nThe Parks' house was a specially constructed set. The ground floor and the garden were constructed on an empty outdoor lot, while the basement and first floor were constructed on set. \"We built the main floor of the house in a backlot and for the second floor it was all green screen outside\", explained editor Yang Jin-mo. \"When we shot toward the outside from inside, everything beyond the garden was all VFX.\"\r\nBong, as part of the scripting, also designed the home's basic layout. \"It's like its own universe inside this film. Each character and each team has spaces that they take over, that they can infiltrate, and also secret spaces that they don't know.\" A fictional architect, Namgoong Hyeonja, was created as the home's designer and previous owner before the Parks, and production designer Lee Ha-jun considered the house's form and function based on how Namgoong would design it. It was designed and constructed to be not only beautiful, but \"a stage that served the precise needs of his camera, compositions, and characters, while embodying his film's rich themes\".\r\nLee said, \"Since Mr Park's house is built by an architect in the story, it wasn't easy finding the right approach to designing the house...I'm not an architect, and I think there's a difference in how an architect envisions a space and how a production designer does. We prioritize blocking and camera angles while architects build spaces for people to actually live in and thus design around people. So I think the approach is very different.\" For example, Ha-jun established that Namgoong would have used the first floor's living room to appreciate the garden, so it was built with a single wide window and only spartan seating options for this function. Some of the interior artwork in the house sets were by South Korea artist Seung-mo Park, including existing artwork of hers and some explicitly created for the film. The team designed the home and interiors to make the set amenable for filming at the 2.35:1 aspect ratio, favouring wide and deeper rooms rather than height.\r\nLee said the sun was an important factor when building the outdoor set. \"The sun's direction was a crucial point of consideration while we were searching for outdoor lots\", explained Lee. \"We had to remember the sun's position during our desired time frame and determine the positions and sizes of the windows accordingly. In terms of practical lighting, the DP had specific requests regarding the colour. He wanted sophisticated indirect lighting and the warmth from tungsten light sources. Before building the set, the DP and I visited the lot several times to check the sun's movement each time, and we decided on the set's location together\".\r\nThe Kims' flat\r\nThe Kims' semi-basement flat and its street were also built on set, partially out of necessity for filming the flooding scenes. Lee Ha-jun visited and photographed several abandoned villages and towns in South Korea scheduled to be torn down to help inform the set design. He also created stories for the Kims' neighbours and added details of those residents along the street to improve the authenticity of the street's appearance.\r\nEditing\r\nAccording to editor Yang Jin-mo, Bong Joon-ho chose to shoot the film without traditional coverage. To give them more editing options with limited shots, they sometimes stitched together different takes of the same shot. Yang edited the film using Final Cut Pro 7, a program not updated since 2011.\r\nThe film was produced for release in colour. A black and white version was produced prior to the world premiere in Cannes and debuted on 26 January 2020 at the International Film Festival Rotterdam, and was re-screened from 29 to 31 January. It also received a limited release in some countries.\r\nMusic\r\nThe score, by South Korean composer Jung Jae-il, consisted of \"minimalist piano pieces, punctuated with light percussion\", setting the film's \"tense atmosphere\". It also had a baroque texture with excerpts from Handel's opera Rodelinda and the 1964 Italian song \"In ginocchio da te\" by Gianni Morandi. It was recorded mostly through computer sounds.\r\nThe soundtrack was published and released in Korea, in digital and physical formats, by Genie Music and Stone Music Entertainment on 30 May 2019. Internationally, it was released on 11 October 2019 by Milan Records. It was released in English titles, however, the names and nouns are different from the English subtitles as translated by Darcy Paquet. On 14 February 2020, it was released in double-vinyl by Sacred Bones Records (a division of American film production company Neon) and Waxwork Records, in multicolour variants.\r\nAn original song, \"Soju han jan\" (Korean: 소주 한 잔, lit. 'A glass of soju'), written by Joon-ho and performed by Choi Woo-shik, who also played the main character Ki-woo, is heard during the film's end credits. For marketing the soundtrack's international digital releases, the song was displayed in English as \"Soju One Glass\"; it was later changed to a grammatically correct title to be shortlisted for the Best Original Song category at the 92nd Academy Awards.\r\nThemes and interpretations\r\nThe main themes of Parasite are class conflict, social inequality and wealth disparity. Film critics and Bong Joon-ho himself have considered the film as a reflection of late-stage capitalism, and some have associated it with the term \"Hell Joseon\" (Korean: 헬조선), a satirical phrase which posits that living in hell would be akin to living in modern South Korea. This term came about due to high rates of youth unemployment, the intense demands of pursuing higher education, the crisis of home affordability, and the increasing socio-economic gap between the wealthy and poor. In Coronavirus Capitalism Goes to the Cinema, Nulman writes that the etymology of the word 'parasite' originally refers to \"person who eats at the table of another\", which is presented in one of the scenes of the film. Nulman also notes the connection between parasites and the Karl Marx quote:\r\nThe capitalist… is only capital personified. His soul is the soul of capital. But capital has one sole driving force, the drive to valorize itself, to create surplus-value, to make its constant part, the means of production, absorb the greatest possible amount of surplus labor. Capital is dead labor which, vampire-like, lives only by sucking living labor, and lives the more, the more labor it sucks.\r\nThe film also analyses the use of connections and qualifications to get ahead, for rich and poor families alike. Some argue that the film's discussion of class relates to Pierre Bourdieu's concept of habitus.\r\nBong has referred to Parasite as an upstairs/downstairs or \"stairway movie\", in which staircases are used as a motif to represent the positions of the families in the homes of the Kims and the Parks, as well as the basement bunker. The semi-basement apartment that the Kims live in is common for poorer Seoul residents due to its lower rent, despite having issues such as mould and increased risk of disease. Monsoon floods such as the one depicted in the film commonly damage these types of residences the most. The film presents class in spatial terms that speak to hierarchy, according to Nulman.\r\nAccording to Bong, the ending implies that Ki-woo will not be able to earn the funds needed to buy the house, as the final shot shows Ki-woo still in the basement flat and recalls the first scene; he described this shot as a \"surefire kill\" (확인사살), referring to a coup de grace to ensure death. The ending song refers to Ki-woo working to make money to get the house. Choi Woo-shik estimated that it would take approximately 564 years for Ki-woo to earn enough money to purchase the house. Nevertheless, he was optimistic: \"I'm pretty sure Ki-woo is one of those bright kids. He'll come up with some idea, and he would just go into the German family's house, and I think he will rescue his father\". However, according to many interpretations, this dream subscribes to a bootstrapping mentality and is unlikely to be achieved; furthermore, \"it does not address the fundamental problem at hand. Even in this fantasy scenario, Ki-taek would still be contained in the house by a legal system that would seek his prosecution and imprisonment. The forces that created and upheld the Kim family's separation would not be undone, merely adapted to\".\r\nCritics have also considered the themes of colonialism and imperialism. According to Ju-Hyun Park, the film plays out within \"the capitalist economic order inaugurated and upheld in Korea by colonial occupation\", and the use of English language in the film denotes prestige within that economic system. The Park family's son, Da-song, is obsessed with \"Indians\" and owns Native American-themed toys and inauthentic replicas. Eugene Nulman makes the link between the 'native' Park family and the invaders - the Kims who bring with them deadly parasites for which the natives have no immunity. Nulman points to the miasma theory of scent carrying disease where it was thought that the natives could catch disease just by smelling the noxious air carried by colonising Spaniards. This connects to the film's theme around the class distinction of smell. Bong has noted that: \"I wouldn’t go so far as to say it’s a commentary on what happened in the United States, but it’s related in the sense that this family starts infiltrating the house and they already find a family living there. So you could say it’s a joke in that context. But at the same time, the Native Americans have a very complicated and long, deep history. But in this family, that story is reduced to a young boy's hobby and decoration. The boy’s mother mentions the tent as a U.S. imported good, and I think it’s like the Che Guevara T-shirts that people wear. They don’t know the life of the revolutionary figure, they just think it’s a cool T-shirt. That's what happens in our current time: The context and meaning behind these actual things only exists as a surface-level thing\".\r\nSome critics note the importance of working class solidarity as presented in the film. The problems the Kims find themselves in were a result of a lack of class solidarity with the other poor family, Geun-sae and Moon-gwang. At the climax of the film, Mr Kim becomes aware of his class identity when Mr Park is disgusted with Geun-sae's smell. Others said Parasite revealed the misfortunes of poor, powerless victims of an indifferent world who are transformed into liberation through the comical effect of mass slaughter.\r\nRelease\r\nTheatrical\r\nNeon acquired the US and Canadian rights to the film at the 2018 American Film Market. The film's rights were also pre-sold to German-speaking territories (Koch Films), French-speaking territories (The Jokers) and Japan (Bitters End). The film had its world premiere at the 2019 Cannes Film Festival on 21 May. It was released in South Korea on 30 May 2019.\r\nIt was released in Australia and New Zealand by Madman Films on 27 June 2019 (becoming both the highest-ever-grossing Korean film in the region and the distributor's highest-ever-grossing non-English-language film in Australia),. It was screened at the Toronto International Film Festival in Toronto, Canada in September 2019 and released generally in the United States and Canada on 11 October 2019. The film was originally scheduled to be screened as a closing film at FIRST International Film Festival Xining in China on 28 July 2019, but on 27 July, the film festival organisers announced that the screening was cancelled for \"technical reasons\".\r\nIt was licensed for the United Kingdom and Ireland by Curzon Artificial Eye at Cannes, and had preview screenings in cinemas nationwide with an interview with Bong Joon-ho shared live by satellite on 3 February 2020, followed by the film's general release on 7 February.\r\nNeon expanded the number of North American theatres showing the film from 1,060 to 2,001 starting the weekend of 14 February 2020, following the film's recognition at the Academy Awards, despite the film having already been released on home video in the region. A special IMAX remaster was shown at limited North American theatres during the week of 21 February 2020.\r\nHome media\r\nBy December 2019, the film had earned a net revenue of $90 million from home entertainment, television and foreign sales.\r\nOn 28 January 2020, Parasite was released on Blu-ray and DVD by Neon, with distribution by Universal Pictures Home Entertainment, and on 2 June it was released on Ultra HD Blu-ray. On 13 February 2020, it was announced that the film will be released on home media by The Criterion Collection. On 15 July 2020, The Criterion Collection announced the release date of 27 October 2020, featuring the long-awaited black and white version.\r\nOn 24 February 2020, the subscription-based streaming service Hulu announced that it had secured exclusive rights to stream the film in the United States, starting on 8 April 2020. Additionally, Amazon Prime Video began streaming the film outside of the United States on 28 March 2020.\r\nIn the United Kingdom, it was 2020's best-selling foreign language film on physical home video formats.\r\nBlack and white edition\r\nA special monochrome version of the film, Parasite: Black-and-White Edition, had its world premiere at the International Film Festival Rotterdam in January 2020 and was released in cinemas in some cities in the United States in the same month.\r\nIt was released on 24 July 2020 in the United Kingdom and Ireland by Curzon Artificial Eye in cinemas and on-demand simultaneously, and was released on 27 October 2020, in the United States and Canada by The Criterion Collection on DVD and Blu-ray Disc, as part of their special edition rerelease. The black and white transfer of the film was overseen by director Bong Joon-ho and cinematographer Hong Kyung-pyo.\r\nReception\r\nBox office\r\nParasite grossed $71.4 million in South Korea, $53.4 million in the United States and Canada, and $133.9 million in other countries, for a worldwide total of $258.7 million. It set a new record for Bong, becoming the first of his films to gross over $100 million worldwide. Deadline Hollywood calculated the film's net profit as $46.2 million.\r\nIn its native South Korea, Parasite grossed US$20.7 million on its opening weekend. It would close its box office run with US$72.2 million and more than 10 million admissions, roughly one-fifth of the country's population and ranking first among the year's top five films.\r\nIn the film's United States opening weekend, it grossed $376,264 from three theatres. Its per-venue average of $125,421 was the best since La La Land's in 2016, and the best ever for an international film. It expanded to 33 theatres in its second weekend, making $1.24 million, and then made $1.8 million from 129 theatres in its third. The film made $2.5 million in its fourth weekend and $2.6 million in its fifth. The film's initial theatre count peaked in its sixth weekend at 620, when it made $1.9 million. It continued to hold well over the following weekends, making $1.3 million and $1 million.\r\nIn its tenth week of release the film crossed the $20 million mark (rare for an international film), making $632,500 from 306 theatres. During the weekend of the Oscars, the film made $1.5 million from 1,060 theatres for a running total of $35.5 million. After Neon's doubling of theatre showings in the week following the Academy Awards, the film made $5.5 million in revenue from the US & Canada, making it one of the biggest Best Picture bumps since Slumdog Millionaire in 2009 and the biggest in ten years.\r\nOn 5 February, Parasite became the first Korean film in nearly 15 years that surpassed one million moviegoers in Japan. In the UK, it broke the record for the opening weekend of a non-English-language film, making £1.4 million ($1.8 million) including previews over its debut weekend, from 135 screens, and in Australia it took in over $1.9 million. In the weekend following its Oscars wins, the film made $12.8 million from 43 countries, bringing its international total to $161 million, and its global running gross over the $200 million mark.\r\nFollowing its Academy Awards success, Parasite received significant rescreening, generating significant further revenue. The Associated Press reported the biggest \"Oscar effect\" since 2001 after Gladiator won the Oscar for Best Picture. Parasite's box office revenue increased by more than 230% compared to the prior week, grossing $2.15 million in a single day. It also ranked No. 1 in Japan, the first Korean film to do so in 15 years. The Motion Picture Distributors Association of Australia announced that $749K worth of cinema tickets were sold in a single weekend, with the film re-entering the top 10 at the local box office more than six months after it debuted in Australian cinemas. Parasite also surged back to fourth place in South Korea's box office by attracting more than 80,000 viewers.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, Parasite has an approval rating of 99% based on 474 reviews, with an average rating of 9.4/10. The website's critics consensus reads: \"An urgent, brilliantly layered look at timely social themes, Parasite finds writer-director Bong Joon Ho in near-total command of his craft.\" On Metacritic, 52 compiled reviews from critics were identified as positive, giving the film a weighted average score of 96 out of 100, indicating \"universal acclaim\". On the same site, Parasite was rated as the best film of 2019 and was ranked 7th among the films with the highest scores of the decade. As of 20 November 2021, it is the 48th highest-rated film of all time on the website.\r\nWriting for The New York Times, A. O. Scott described the film as \"wildly entertaining, the kind of smart, generous, aesthetically energized movie that obliterates the tired distinctions between art films and popcorn movies\". Bilge Ebiri of Vulture magazine wrote that Parasite is \"a work that is itself in a state of constant, agitated transformation—a nerve-racking masterpiece whose spell lingers long after its haunting final image\". In his five-star review, Dave Calhoun of Time Out praised the social commentary in the film, calling the overall work \"surprising and fully gripping from beginning to end, full of big bangs and small wonders\". Variety's Jessica Kiang described the film as \"a wild, wild ride\", writing that \"Bong is back and on brilliant form, but he is unmistakably, roaringly furious, and it registers because the target is so deserving, so enormous, so 2019: Parasite is a tick fat with the bitter blood of class rage\". Joshua Rivera from GQ gave a glowing review and declared Parasite to possibly be one of the best films from 2019.\r\nMichael Wood writing for the London Review of Books found its following a theme of class consciousness to be consistent with the director's previous Snowpiercer stating, \"The theme of social ascent, or social difference as a landscape, could hardly be more obvious, but we are beginning to get the movie's idea: not to avoid stereotypes but to keep crashing into them\". UK film website TheShiznit awarded an A, noting \"it makes you wonder what the inflection point for such behaviour is in a culture where manners and servitude are drilled into those who can't afford not to have them\". The A.V. Club's A. A. Dowd awarded the film an A− grade, praising the fun and surprising twists.\r\nParasite ranked first in a survey by IndieWire of over 300 critics, in the Best Film, Best Director, Best Screenplay and Best Foreign Film categories. It also appeared on over 240 critics' year-end top-ten lists, including 77 who ranked it first.\r\nAccolades\r\nParasite won the Palme d'Or at the 2019 Cannes Film Festival. It became the first South Korean film to do so, as well as the first film to win with a unanimous vote since Blue Is the Warmest Colour at the 2013 Cannes Film Festival. At the 77th Golden Globe Awards, the film was nominated for three awards, including Best Director and Best Screenplay, and won Best Foreign Language Film, becoming the first ever South Korean film to achieve that feat.\r\nIt became the second international film to ever be nominated for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture since Life Is Beautiful (1997), and ultimately won the category, making it the first international film to win the prize. Parasite was also nominated for four awards at the 73rd British Academy Film Awards—Best Film, Best Director, Best Original Screenplay, and Best Film Not in the English Language, being the first South Korean film to receive nominations other than for Best Film Not in the English Language, and went on to win Best Original Screenplay and Best Film Not in the English Language.\r\nParasite was submitted as the South Korean entry for Best International Feature Film for the 92nd Academy Awards, making the December shortlist. It went on to win four awards—Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film. Parasite became the first non-English language film in Academy Awards history to win Best Picture. Parasite also became the first South Korean film to be nominated for Best Picture at the Academy Awards and the second East Asian film to receive a nomination for Best Picture since Crouching Tiger, Hidden Dragon (2000), and Bong Joon-ho became the fourth Asian person to receive an Academy Award nomination for Best Director, becoming the second to win following Ang Lee. It also received nominations for Best Film Editing and Best Production Design. The film is also the second film to win both the Academy Award for Best Picture and the Palme d'Or at Cannes under the latter's name in sixty-five years since Marty, being the third film to win both grand prizes after the former and The Lost Weekend.\r\nAt the 56th Grand Bell Awards, Parasite earned a leading 11 nominations with 5 awards (the most for the show) to its name. It won for Best Film, Best Director (for Bong Joon-ho), Best Supporting Actress (for Lee Jung-eun), Best Screenplay (for Bong Joon Ho and Han Jin-Won), and Best Music (for Jung Jae-il).\r\n\"When I was young and studying cinema, there was a saying that I carved deep into my heart, which is that, ‘The most personal is the most creative.\"\r\n– Bong Joon-ho in an acceptance speech for winning Best Director at the 92nd Academy Awards, as he attributed to Martin Scorsese.\r\nDuring Bong Joon-ho's acceptance speech at the Oscars, he paused to thank Martin Scorsese, a co-nominated director, whom Bong recognised as having historical importance to the history of filmmaking which resulted in spontaneous applause from the audience in recognition of Scorsese during his speech. The following day Scorsese sent the director a personal congratulatory letter which Bong reported while on a speaking engagement at the Film at Lincoln Center where Bong stated that he could not share the full letter from Scorsese due to its personal nature. He did, however, share the conclusion of the letter by stating that Scorsese told him that \"You've done well. Now rest. But don't rest for too long.\" Bong then added that Scorsese ended his letter by stating \"how he and other directors were waiting for my (Bong's) next movie\".\r\nThe Associated Press commented that although the Academy of Motion Picture Arts and Sciences (AMPAS) had previously failed to adequately recognise women filmmakers in the Academy Award nominations, this time it acknowledged diversity. The Wall Street Journal also stated that the film seemed to promise a \"more inclusive Oscars\" demanded by those who have previously criticised AMPAS. The AP noted that the film's victory, because of its being an Oscar-winning foreign film in a regular Academy category, opens the door for Hollywood to undergo a radical change and a different kind of advancement, as a sceptic worried that if \"Parasite won the Oscar for best international film, it probably wouldn't win any other major awards\". \"The academy gave best picture to the actual best picture\", wrote Justin Chang of the Los Angeles Times, who continued that the film awards body was \"startled ... into recognizing that no country's cinema has a monopoly on greatness\". In 2021, the Writers Guild of America ranked Parasite's screenplay the fourth greatest of the 21st century so far.\r\nOn 28 March 2022, Cannes Film Festival president Thierry Frémaux revealed that after Everything Everywhere All at Once, a 2022 science fiction comedy-drama also featuring a predominantly Asian cast, won the Best Picture Oscar at the 95th Academy Awards, he began to question whether the Best Picture win for Parasite was worthy enough, saying \"How can a non-American film win the Oscar for best film since it’s a ceremony in honor of American cinema? Parasite won, it’s great, but it’s a Korean film.\"\r\nLegacy\r\nSpin-off television series\r\nA six-hour HBO limited series based on the film, with Bong and Adam McKay as executive producers, was announced to be in early development in January 2020. Bong has stated that this will also be entitled Parasite, and will explore stories \"that happen in between the sequences in the film\". In February 2020, Mark Ruffalo was rumoured to star whilst Tilda Swinton was confirmed as being cast in a lead role. However, in October 2022, Tilda Swinton announced she was no longer involved with the series.\r\nPlans for tourist set\r\nA South Korean local government (Goyang City) plans to restore the Goyang Aqua Special Shooting Studio set, where the film Parasite was produced, and use it as a Parasite movie experience tourism facility. In addition, Goyang City has announced that it will invest $150 million in the development of the Goyang Film Culture Complex by 2026 to accommodate film experience tourism facilities, additional indoor studios, outdoor set production facilities, inter-Korean video content centres, image research and development companies. However, criticisms have been made about the commercialisation of areas known for poverty in South Korea as tourist destinations without concrete steps being taken to address the issues at hand.\r\nCity tourism and food\r\nThe Seoul Tourism Organization (STO) has been criticised by South Korea's opposition party and residents of Seoul for introducing a tour route featuring filming locations and stories from the film. The Justice Party claims that it became famous due to the universal recognition of global inequality. However, it sees the development of a tourist attraction based on the film in Seoul as amounting to the further exploitation of poverty. Residents living in Parasite's filming locations have reportedly complained of a sense of embarrassment and discomfort due to an increase in tourists visiting their neighbourhoods and taking photos of their surroundings, making them feel like \"monkeys in a zoo\". In response, the local government of Seoul has announced that government funding will prioritise the estimated 1,500 low-income families living in the semi-basement type accommodations featured in the film.\r\nPeople began posting videos on how to make jjapaguri (called \"ram-don\" in the film's English subtitles) on YouTube after the film was distributed. Nongshim, the manufacturer of Chapagetti and Neoguri, also began distributing a singular \"Chapaguri\" product due to the combination's popularity from the film.",
    "html": "<p>Parasite (Korean: 기생충; Hanja: 寄生蟲; RR: Gisaengchung) is a 2019 South Korean black comedy thriller film directed by Bong Joon-ho, who co-wrote the screenplay with Han Jin-won and co-produced. The film, starring Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Choi Woo-shik, Park So-dam, Jang Hye-jin, Park Myung-hoon and Lee Jung-eun, follows a poor family who scheme to become employed by a wealthy family, infiltrating their household by posing as unrelated, highly qualified individuals.</p><p>The script is based on Bong's source material from a play written in 2013. He later adapted it into a 15-page film draft, and it was split into three different drafts by Han. Bong stated that he was inspired by the 1960 Korean film The Housemaid, and by the Christine and Léa Papin incident in the 1930s. Filming began in May 2018 and finished that September. The project included cinematographer Hong Kyung-pyo, film editor Yang Jin-mo, and composer Jung Jae-il. Darcy Paquet, an American film critic and author, provided English translations for the film's international release.</p><p>Parasite premiered at the 2019 Cannes Film Festival on 21 May 2019, where it became the first Korean film to win its top prize, the Palme d'Or. It was released in South Korea by CJ Entertainment on 30 May, and was praised for Bong's direction and screenplay, and also for its editing and production design. It grossed over $263 million worldwide on a $15.5 million budget.</p><p>Among its numerous accolades, Parasite won the leading four awards at the 92nd Academy Awards: Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film, becoming the first non English-language film to win the Academy Award for Best Picture. It is the first South Korean film to receive any Academy Award recognition, and one of only three films overall to win both the Palme d'Or and the Academy Award for Best Picture, the first such achievement in over 60 years. It won the Golden Globe Award for Best Foreign Language Film and the BAFTA Award for Best Film Not in the English Language, and became the first non English-language film to win the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. A television series based on it is in early development.</p><br/><h3>Plot</h3><p>The Kim family live in a semi-basement flat (banjiha) in Seoul, have low-income jobs, and struggle for money. Min-hyuk, a university student, gives the family a scholar's rock meant to promise wealth. Leaving to study abroad, he suggests that the Kims' son, Ki-woo, pose as a university student to take over his job as an English language tutor for Da-hye, the daughter of the rich Park family. After his sister Ki-jung helps create a false certificate for him in Photoshop, Ki-woo, posing as a Yonsei University student, is subsequently hired by the Park family.</p><p>The Kim family schemes to get each member a job with the Park family. The Kim daughter, Ki-jung, poses as \"Jessica\" and, using Ki-woo as a reference, becomes an art therapist to the Parks' young son, Da-song. Ki-jung frames Yoon, Mr Park's driver, by making it appear he had a sexual encounter in the car, then recommends her father, Ki-taek, to replace him. The Kims exploit the peach allergy of the Parks' long-time housekeeper, Moon-gwang, to convince Mrs Park that she has tuberculosis, and the Kim mother, Chung-sook, is hired to replace her. Ki-woo begins a secret romantic relationship with Da-hye.</p><p>When the Parks leave on a camping trip, the Kims revel in the luxuries of the house. Moon-gwang appears at the door, telling Chung-sook she left something in the basement. She goes through a hidden entrance to an underground bunker created by the architect and previous homeowner. There, Moon-gwang's husband, Geun-sae, has been secretly living for over four years, hiding from loan sharks. Chung-sook refuses Moon-gwang's pleas to help Geun-sae remain in the bunker, but the eavesdropping Kims accidentally reveal themselves. Moon-gwang videotapes them on her phone and threatens to expose their ruse to the Park family.</p><p>The Parks call to say that they'll return early due to a severe rainstorm. The Kims scramble to clean up the house and subdue Moon-gwang and Geun-sae, trapping them in the bunker. Ki-jung, Ki-taek and Ki-woo hide under a table, and overhear Mr Park's comments about Ki-taek's odour. The Kims escape and find their flat flooded with sewer water, and take shelter in a gymnasium with other displaced people.</p><p>The next day, Mrs Park hosts a house party for Da-song's birthday with the Kim family's assistance. Ki-woo enters the bunker to find Geun-sae. Finding Moon-gwang has died from a concussion she received during the brawl, he is attacked by a deranged Geun-sae who escapes, leaving Ki-woo lying in a pool of blood. Seeking to avenge Moon-gwang, Geun-sae stabs Ki-jung with a kitchen knife in front of the horrified guests. Da-song suffers another traumatic seizure upon seeing Geun-sae, whom Da-song once saw as a \"ghost\" emerging from the basement on the night of a previous birthday. A struggle breaks out until Chung-sook fatally impales Geun-sae with a barbecue skewer. While Ki-taek tends to Ki-jung, Mr Park orders Ki-taek to drive Da-song to the hospital. In the chaos, Ki-taek, upon seeing Mr Park's disgusted reaction to Geun-sae's odour, angrily kills him with the knife. Ki-taek flees, leaving the rest of the Kim family behind.</p><p>Weeks later, Ki-woo is recovering from a brain operation. He and Chung-sook are convicted of fraud and put on probation. Ki-jung has died from her injuries, and Ki-taek, wanted by the authorities, cannot be found. Geun-sae is assumed to have been an insane homeless man, and neither his nor Ki-taek's motive for the murders are known. Ki-woo spies on the Parks’ home, now occupied by a Swiss family (although Ki-taek thinks they are Germans) unaware of the house's history, and sees a message in Morse code from a flickering light. Ki-taek, who escaped into the bunker, has buried Moon-gwang in the garden and sends the message every day, hoping Ki-woo will see it. Still living in their basement flat with his mother, Ki-woo writes a letter to Ki-taek, vowing to earn enough money to buy the house and reunite with his father.</p><br/><h3>Cast</h3><ul><li>Song Kang-ho as Kim Ki-taek (Mr Kim; 김기택; Gim Gitaek), the Kim family father who is hired as Park Dong-ik's chauffeur</li><li>Lee Sun-kyun as Park Dong-ik (Nathan; 박동익; Bak Dongik), the Park family father</li><li>Cho Yeo-jeong as Choi Yeon-gyo (Madame; 최연교; Choe Yeongyo), the Park mother</li><li>Choi Woo-shik as Kim Ki-woo (Kevin; 김기우; Gim Giu), the Kims' son who is hired as Da-hye's English tutor (Choi stated that the character is \"intelligent but does not have the vigour needed to succeed in examinations\")</li><li>Park So-dam as Kim Ki-jung (Jessica; 김기정; Gim Gijeong), the Kims' daughter who is hired as Da-song's art therapist</li><li>Jang Hye-jin as Chung-sook (박충숙; Bak Chungsuk), the Kim family mother who is hired as the Parks' housekeeper</li><li>Lee Jung-eun as Gook Moon-gwang (국문광; Guk Mungwang), the Parks' housekeeper, who also worked for the house's architect and previous owner of the house (Bong Joon-ho said her relationship with the architect and parts of her story \"that happen in between the sequences in the film\" will be explored in the spin-off TV series)</li><li>Park Myung-hoon as Oh Geun-sae (오근세; O Geunse), Moon-gwang's husband</li><li>Jung Ji-so as Park Da-hye (박다혜; Bak Dahye), the Parks' daughter</li><li>Jung Hyeon-jun as Park Da-song (박다송; Bak Dasong), the Parks' son</li><li>Park Keun-rok as Yoon (윤; Yun), Park Dong-ik's chauffeur</li><li>Park Seo-joon as Min-hyuk (민혁; Minhyeok), Ki-woo's friend</li><li>Jung Yi-seo as a pizza parlour owner</li></ul><br/><h3>Production</h3><h4>Development</h4><p>The idea for Parasite originated in 2013. While working on Snowpiercer, Bong was encouraged by a theatre actor friend to write a play. He had been a tutor for the son of a wealthy family in Seoul in his early 20s and considered turning his experience into a stage production. The film's title, Parasite, was selected by Bong as it served a double meaning, which he had to convince the film's marketing group to use. Bong said \"Because the story is about the poor family infiltrating and creeping into the rich house, it seems very obvious that Parasite refers to the poor family, and I think that's why the marketing team was a little hesitant. But if you look at it the other way, you can say that rich family, they're also parasites in terms of labor. They can't even wash dishes, they can't drive themselves, so they leech off the poor family's labor. So both are parasites.\"</p><h4>Writing</h4><p>After completing Snowpiercer, Bong wrote a 15-page film treatment for the first half of Parasite, which his production assistant on Snowpiercer, Han Jin-won, turned into three different drafts of the screenplay. After finishing Okja, Bong returned to the project and finished the script. Han Jin-won received credit as a co-writer.</p><p>Bong said the film was influenced by the 1960 Korean \"domestic Gothic\" film The Housemaid in which a middle-class family's stability is threatened by the arrival of a disruptive interloper in the form of household help. The incident of Christine and Léa Papin—two live-in maids who murdered their employers in 1930s France—also inspired him. Bong also considered his own past, where he had tutored for a rich family. Bong said \"I got this feeling that I was infiltrating the private lives of complete strangers. Every week I would go into their house, and I thought how fun it would be if I could get all my friends to infiltrate the house one by one.\" Additionally, Moon-gwang's allergy to peaches was inspired by one of Bong's university friends having this allergy.</p><p>Darcy Paquet, an American residing in South Korea, translated the English subtitles, writing directly with Bong. Paquet rendered Jjapaguri or Chapaguri, a dish cooked by a character in the film, as ram-don, meaning ramen-udon. It is a mix of Chapagetti and Neoguri produced by Nongshim. The English version of the film shows packages labelled in English \"ramyeon\" and \"udon\" to highlight to English speakers how the name was created. Paquet believed the word ram-don did not previously exist as he found no results on Google. On one occasion, Paquet used Oxford University as a reference instead of Seoul National University, and in another, used WhatsApp as the messaging application instead of KakaoTalk. Paquet chose Oxford over Harvard because of Bong's affinity for the United Kingdom, and because Paquet believed using Harvard would be \"too obvious a choice\". Paquet wrote, \"In order for humor to work, people need to understand it immediately. With an unfamiliar word, the humor is lost.\"</p><h4>Filming</h4><p>Principal photography for Parasite began on 18 May 2018, and ended on 19 September 2018. Filming took place around Seoul and in Jeonju. The director of photography was Hong Kyung-pyo, a well-known South Korean cinematographer who had worked with other well-known directors.</p><h4>The Parks' house</h4><p>The Parks' house was a specially constructed set. The ground floor and the garden were constructed on an empty outdoor lot, while the basement and first floor were constructed on set. \"We built the main floor of the house in a backlot and for the second floor it was all green screen outside\", explained editor Yang Jin-mo. \"When we shot toward the outside from inside, everything beyond the garden was all VFX.\"</p><p>Bong, as part of the scripting, also designed the home's basic layout. \"It's like its own universe inside this film. Each character and each team has spaces that they take over, that they can infiltrate, and also secret spaces that they don't know.\" A fictional architect, Namgoong Hyeonja, was created as the home's designer and previous owner before the Parks, and production designer Lee Ha-jun considered the house's form and function based on how Namgoong would design it. It was designed and constructed to be not only beautiful, but \"a stage that served the precise needs of his camera, compositions, and characters, while embodying his film's rich themes\".</p><p>Lee said, \"Since Mr Park's house is built by an architect in the story, it wasn't easy finding the right approach to designing the house...I'm not an architect, and I think there's a difference in how an architect envisions a space and how a production designer does. We prioritize blocking and camera angles while architects build spaces for people to actually live in and thus design around people. So I think the approach is very different.\" For example, Ha-jun established that Namgoong would have used the first floor's living room to appreciate the garden, so it was built with a single wide window and only spartan seating options for this function. Some of the interior artwork in the house sets were by South Korea artist Seung-mo Park, including existing artwork of hers and some explicitly created for the film. The team designed the home and interiors to make the set amenable for filming at the 2.35:1 aspect ratio, favouring wide and deeper rooms rather than height.</p><p>Lee said the sun was an important factor when building the outdoor set. \"The sun's direction was a crucial point of consideration while we were searching for outdoor lots\", explained Lee. \"We had to remember the sun's position during our desired time frame and determine the positions and sizes of the windows accordingly. In terms of practical lighting, the DP had specific requests regarding the colour. He wanted sophisticated indirect lighting and the warmth from tungsten light sources. Before building the set, the DP and I visited the lot several times to check the sun's movement each time, and we decided on the set's location together\".</p><h4>The Kims' flat</h4><p>The Kims' semi-basement flat and its street were also built on set, partially out of necessity for filming the flooding scenes. Lee Ha-jun visited and photographed several abandoned villages and towns in South Korea scheduled to be torn down to help inform the set design. He also created stories for the Kims' neighbours and added details of those residents along the street to improve the authenticity of the street's appearance.</p><h4>Editing</h4><p>According to editor Yang Jin-mo, Bong Joon-ho chose to shoot the film without traditional coverage. To give them more editing options with limited shots, they sometimes stitched together different takes of the same shot. Yang edited the film using Final Cut Pro 7, a program not updated since 2011.</p><p>The film was produced for release in colour. A black and white version was produced prior to the world premiere in Cannes and debuted on 26 January 2020 at the International Film Festival Rotterdam, and was re-screened from 29 to 31 January. It also received a limited release in some countries.</p><h4>Music</h4><p>The score, by South Korean composer Jung Jae-il, consisted of \"minimalist piano pieces, punctuated with light percussion\", setting the film's \"tense atmosphere\". It also had a baroque texture with excerpts from Handel's opera Rodelinda and the 1964 Italian song \"In ginocchio da te\" by Gianni Morandi. It was recorded mostly through computer sounds.</p><p>The soundtrack was published and released in Korea, in digital and physical formats, by Genie Music and Stone Music Entertainment on 30 May 2019. Internationally, it was released on 11 October 2019 by Milan Records. It was released in English titles, however, the names and nouns are different from the English subtitles as translated by Darcy Paquet. On 14 February 2020, it was released in double-vinyl by Sacred Bones Records (a division of American film production company Neon) and Waxwork Records, in multicolour variants.</p><p>An original song, \"Soju han jan\" (Korean: 소주 한 잔, lit. 'A glass of soju'), written by Joon-ho and performed by Choi Woo-shik, who also played the main character Ki-woo, is heard during the film's end credits. For marketing the soundtrack's international digital releases, the song was displayed in English as \"Soju One Glass\"; it was later changed to a grammatically correct title to be shortlisted for the Best Original Song category at the 92nd Academy Awards.</p><br/><h3>Themes and interpretations</h3><p>The main themes of Parasite are class conflict, social inequality and wealth disparity. Film critics and Bong Joon-ho himself have considered the film as a reflection of late-stage capitalism, and some have associated it with the term \"Hell Joseon\" (Korean: 헬조선), a satirical phrase which posits that living in hell would be akin to living in modern South Korea. This term came about due to high rates of youth unemployment, the intense demands of pursuing higher education, the crisis of home affordability, and the increasing socio-economic gap between the wealthy and poor. In Coronavirus Capitalism Goes to the Cinema, Nulman writes that the etymology of the word 'parasite' originally refers to \"person who eats at the table of another\", which is presented in one of the scenes of the film. Nulman also notes the connection between parasites and the Karl Marx quote:</p><blockquote>The capitalist… is only capital personified. His soul is the soul of capital. But capital has one sole driving force, the drive to valorize itself, to create surplus-value, to make its constant part, the means of production, absorb the greatest possible amount of surplus labor. Capital is dead labor which, vampire-like, lives only by sucking living labor, and lives the more, the more labor it sucks.</blockquote><p>The film also analyses the use of connections and qualifications to get ahead, for rich and poor families alike. Some argue that the film's discussion of class relates to Pierre Bourdieu's concept of habitus.</p><p>Bong has referred to Parasite as an upstairs/downstairs or \"stairway movie\", in which staircases are used as a motif to represent the positions of the families in the homes of the Kims and the Parks, as well as the basement bunker. The semi-basement apartment that the Kims live in is common for poorer Seoul residents due to its lower rent, despite having issues such as mould and increased risk of disease. Monsoon floods such as the one depicted in the film commonly damage these types of residences the most. The film presents class in spatial terms that speak to hierarchy, according to Nulman.</p><p>According to Bong, the ending implies that Ki-woo will not be able to earn the funds needed to buy the house, as the final shot shows Ki-woo still in the basement flat and recalls the first scene; he described this shot as a \"surefire kill\" (확인사살), referring to a coup de grace to ensure death. The ending song refers to Ki-woo working to make money to get the house. Choi Woo-shik estimated that it would take approximately 564 years for Ki-woo to earn enough money to purchase the house. Nevertheless, he was optimistic: \"I'm pretty sure Ki-woo is one of those bright kids. He'll come up with some idea, and he would just go into the German family's house, and I think he will rescue his father\". However, according to many interpretations, this dream subscribes to a bootstrapping mentality and is unlikely to be achieved; furthermore, \"it does not address the fundamental problem at hand. Even in this fantasy scenario, Ki-taek would still be contained in the house by a legal system that would seek his prosecution and imprisonment. The forces that created and upheld the Kim family's separation would not be undone, merely adapted to\".</p><p>Critics have also considered the themes of colonialism and imperialism. According to Ju-Hyun Park, the film plays out within \"the capitalist economic order inaugurated and upheld in Korea by colonial occupation\", and the use of English language in the film denotes prestige within that economic system. The Park family's son, Da-song, is obsessed with \"Indians\" and owns Native American-themed toys and inauthentic replicas. Eugene Nulman makes the link between the 'native' Park family and the invaders - the Kims who bring with them deadly parasites for which the natives have no immunity. Nulman points to the miasma theory of scent carrying disease where it was thought that the natives could catch disease just by smelling the noxious air carried by colonising Spaniards. This connects to the film's theme around the class distinction of smell. Bong has noted that: \"I wouldn’t go so far as to say it’s a commentary on what happened in the United States, but it’s related in the sense that this family starts infiltrating the house and they already find a family living there. So you could say it’s a joke in that context. But at the same time, the Native Americans have a very complicated and long, deep history. But in this family, that story is reduced to a young boy's hobby and decoration. The boy’s mother mentions the tent as a U.S. imported good, and I think it’s like the Che Guevara T-shirts that people wear. They don’t know the life of the revolutionary figure, they just think it’s a cool T-shirt. That's what happens in our current time: The context and meaning behind these actual things only exists as a surface-level thing\".</p><p>Some critics note the importance of working class solidarity as presented in the film. The problems the Kims find themselves in were a result of a lack of class solidarity with the other poor family, Geun-sae and Moon-gwang. At the climax of the film, Mr Kim becomes aware of his class identity when Mr Park is disgusted with Geun-sae's smell. Others said Parasite revealed the misfortunes of poor, powerless victims of an indifferent world who are transformed into liberation through the comical effect of mass slaughter.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>Neon acquired the US and Canadian rights to the film at the 2018 American Film Market. The film's rights were also pre-sold to German-speaking territories (Koch Films), French-speaking territories (The Jokers) and Japan (Bitters End). The film had its world premiere at the 2019 Cannes Film Festival on 21 May. It was released in South Korea on 30 May 2019.</p><p>It was released in Australia and New Zealand by Madman Films on 27 June 2019 (becoming both the highest-ever-grossing Korean film in the region and the distributor's highest-ever-grossing non-English-language film in Australia),. It was screened at the Toronto International Film Festival in Toronto, Canada in September 2019 and released generally in the United States and Canada on 11 October 2019. The film was originally scheduled to be screened as a closing film at FIRST International Film Festival Xining in China on 28 July 2019, but on 27 July, the film festival organisers announced that the screening was cancelled for \"technical reasons\".</p><p>It was licensed for the United Kingdom and Ireland by Curzon Artificial Eye at Cannes, and had preview screenings in cinemas nationwide with an interview with Bong Joon-ho shared live by satellite on 3 February 2020, followed by the film's general release on 7 February.</p><p>Neon expanded the number of North American theatres showing the film from 1,060 to 2,001 starting the weekend of 14 February 2020, following the film's recognition at the Academy Awards, despite the film having already been released on home video in the region. A special IMAX remaster was shown at limited North American theatres during the week of 21 February 2020.</p><h4>Home media</h4><p>By December 2019, the film had earned a net revenue of $90 million from home entertainment, television and foreign sales.</p><p>On 28 January 2020, Parasite was released on Blu-ray and DVD by Neon, with distribution by Universal Pictures Home Entertainment, and on 2 June it was released on Ultra HD Blu-ray. On 13 February 2020, it was announced that the film will be released on home media by The Criterion Collection. On 15 July 2020, The Criterion Collection announced the release date of 27 October 2020, featuring the long-awaited black and white version.</p><p>On 24 February 2020, the subscription-based streaming service Hulu announced that it had secured exclusive rights to stream the film in the United States, starting on 8 April 2020. Additionally, Amazon Prime Video began streaming the film outside of the United States on 28 March 2020.</p><p>In the United Kingdom, it was 2020's best-selling foreign language film on physical home video formats.</p><h4>Black and white edition</h4><p>A special monochrome version of the film, Parasite: Black-and-White Edition, had its world premiere at the International Film Festival Rotterdam in January 2020 and was released in cinemas in some cities in the United States in the same month.</p><p>It was released on 24 July 2020 in the United Kingdom and Ireland by Curzon Artificial Eye in cinemas and on-demand simultaneously, and was released on 27 October 2020, in the United States and Canada by The Criterion Collection on DVD and Blu-ray Disc, as part of their special edition rerelease. The black and white transfer of the film was overseen by director Bong Joon-ho and cinematographer Hong Kyung-pyo.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Parasite grossed $71.4 million in South Korea, $53.4 million in the United States and Canada, and $133.9 million in other countries, for a worldwide total of $258.7 million. It set a new record for Bong, becoming the first of his films to gross over $100 million worldwide. Deadline Hollywood calculated the film's net profit as $46.2 million.</p><p>In its native South Korea, Parasite grossed US$20.7 million on its opening weekend. It would close its box office run with US$72.2 million and more than 10 million admissions, roughly one-fifth of the country's population and ranking first among the year's top five films.</p><p>In the film's United States opening weekend, it grossed $376,264 from three theatres. Its per-venue average of $125,421 was the best since La La Land's in 2016, and the best ever for an international film. It expanded to 33 theatres in its second weekend, making $1.24 million, and then made $1.8 million from 129 theatres in its third. The film made $2.5 million in its fourth weekend and $2.6 million in its fifth. The film's initial theatre count peaked in its sixth weekend at 620, when it made $1.9 million. It continued to hold well over the following weekends, making $1.3 million and $1 million.</p><p>In its tenth week of release the film crossed the $20 million mark (rare for an international film), making $632,500 from 306 theatres. During the weekend of the Oscars, the film made $1.5 million from 1,060 theatres for a running total of $35.5 million. After Neon's doubling of theatre showings in the week following the Academy Awards, the film made $5.5 million in revenue from the US & Canada, making it one of the biggest Best Picture bumps since Slumdog Millionaire in 2009 and the biggest in ten years.</p><p>On 5 February, Parasite became the first Korean film in nearly 15 years that surpassed one million moviegoers in Japan. In the UK, it broke the record for the opening weekend of a non-English-language film, making £1.4 million ($1.8 million) including previews over its debut weekend, from 135 screens, and in Australia it took in over $1.9 million. In the weekend following its Oscars wins, the film made $12.8 million from 43 countries, bringing its international total to $161 million, and its global running gross over the $200 million mark.</p><p>Following its Academy Awards success, Parasite received significant rescreening, generating significant further revenue. The Associated Press reported the biggest \"Oscar effect\" since 2001 after Gladiator won the Oscar for Best Picture. Parasite's box office revenue increased by more than 230% compared to the prior week, grossing $2.15 million in a single day. It also ranked No. 1 in Japan, the first Korean film to do so in 15 years. The Motion Picture Distributors Association of Australia announced that $749K worth of cinema tickets were sold in a single weekend, with the film re-entering the top 10 at the local box office more than six months after it debuted in Australian cinemas. Parasite also surged back to fourth place in South Korea's box office by attracting more than 80,000 viewers.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, Parasite has an approval rating of 99% based on 474 reviews, with an average rating of 9.4/10. The website's critics consensus reads: \"An urgent, brilliantly layered look at timely social themes, Parasite finds writer-director Bong Joon Ho in near-total command of his craft.\" On Metacritic, 52 compiled reviews from critics were identified as positive, giving the film a weighted average score of 96 out of 100, indicating \"universal acclaim\". On the same site, Parasite was rated as the best film of 2019 and was ranked 7th among the films with the highest scores of the decade. As of 20 November 2021, it is the 48th highest-rated film of all time on the website.</p><p>Writing for The New York Times, A. O. Scott described the film as \"wildly entertaining, the kind of smart, generous, aesthetically energized movie that obliterates the tired distinctions between art films and popcorn movies\". Bilge Ebiri of Vulture magazine wrote that Parasite is \"a work that is itself in a state of constant, agitated transformation—a nerve-racking masterpiece whose spell lingers long after its haunting final image\". In his five-star review, Dave Calhoun of Time Out praised the social commentary in the film, calling the overall work \"surprising and fully gripping from beginning to end, full of big bangs and small wonders\". Variety's Jessica Kiang described the film as \"a wild, wild ride\", writing that \"Bong is back and on brilliant form, but he is unmistakably, roaringly furious, and it registers because the target is so deserving, so enormous, so 2019: Parasite is a tick fat with the bitter blood of class rage\". Joshua Rivera from GQ gave a glowing review and declared Parasite to possibly be one of the best films from 2019.</p><p>Michael Wood writing for the London Review of Books found its following a theme of class consciousness to be consistent with the director's previous Snowpiercer stating, \"The theme of social ascent, or social difference as a landscape, could hardly be more obvious, but we are beginning to get the movie's idea: not to avoid stereotypes but to keep crashing into them\". UK film website TheShiznit awarded an A, noting \"it makes you wonder what the inflection point for such behaviour is in a culture where manners and servitude are drilled into those who can't afford not to have them\". The A.V. Club's A. A. Dowd awarded the film an A− grade, praising the fun and surprising twists.</p><p>Parasite ranked first in a survey by IndieWire of over 300 critics, in the Best Film, Best Director, Best Screenplay and Best Foreign Film categories. It also appeared on over 240 critics' year-end top-ten lists, including 77 who ranked it first.</p><br/><h3>Accolades</h3><p>Parasite won the Palme d'Or at the 2019 Cannes Film Festival. It became the first South Korean film to do so, as well as the first film to win with a unanimous vote since Blue Is the Warmest Colour at the 2013 Cannes Film Festival. At the 77th Golden Globe Awards, the film was nominated for three awards, including Best Director and Best Screenplay, and won Best Foreign Language Film, becoming the first ever South Korean film to achieve that feat.</p><p>It became the second international film to ever be nominated for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture since Life Is Beautiful (1997), and ultimately won the category, making it the first international film to win the prize. Parasite was also nominated for four awards at the 73rd British Academy Film Awards—Best Film, Best Director, Best Original Screenplay, and Best Film Not in the English Language, being the first South Korean film to receive nominations other than for Best Film Not in the English Language, and went on to win Best Original Screenplay and Best Film Not in the English Language.</p><p>Parasite was submitted as the South Korean entry for Best International Feature Film for the 92nd Academy Awards, making the December shortlist. It went on to win four awards—Best Picture, Best Director, Best Original Screenplay, and Best International Feature Film. Parasite became the first non-English language film in Academy Awards history to win Best Picture. Parasite also became the first South Korean film to be nominated for Best Picture at the Academy Awards and the second East Asian film to receive a nomination for Best Picture since Crouching Tiger, Hidden Dragon (2000), and Bong Joon-ho became the fourth Asian person to receive an Academy Award nomination for Best Director, becoming the second to win following Ang Lee. It also received nominations for Best Film Editing and Best Production Design. The film is also the second film to win both the Academy Award for Best Picture and the Palme d'Or at Cannes under the latter's name in sixty-five years since Marty, being the third film to win both grand prizes after the former and The Lost Weekend.</p><p>At the 56th Grand Bell Awards, Parasite earned a leading 11 nominations with 5 awards (the most for the show) to its name. It won for Best Film, Best Director (for Bong Joon-ho), Best Supporting Actress (for Lee Jung-eun), Best Screenplay (for Bong Joon Ho and Han Jin-Won), and Best Music (for Jung Jae-il).</p><blockquote>\"When I was young and studying cinema, there was a saying that I carved deep into my heart, which is that, ‘The most personal is the most creative.\"</blockquote><p>– Bong Joon-ho in an acceptance speech for winning Best Director at the 92nd Academy Awards, as he attributed to Martin Scorsese.</p><p>During Bong Joon-ho's acceptance speech at the Oscars, he paused to thank Martin Scorsese, a co-nominated director, whom Bong recognised as having historical importance to the history of filmmaking which resulted in spontaneous applause from the audience in recognition of Scorsese during his speech. The following day Scorsese sent the director a personal congratulatory letter which Bong reported while on a speaking engagement at the Film at Lincoln Center where Bong stated that he could not share the full letter from Scorsese due to its personal nature. He did, however, share the conclusion of the letter by stating that Scorsese told him that \"You've done well. Now rest. But don't rest for too long.\" Bong then added that Scorsese ended his letter by stating \"how he and other directors were waiting for my (Bong's) next movie\".</p><p>The Associated Press commented that although the Academy of Motion Picture Arts and Sciences (AMPAS) had previously failed to adequately recognise women filmmakers in the Academy Award nominations, this time it acknowledged diversity. The Wall Street Journal also stated that the film seemed to promise a \"more inclusive Oscars\" demanded by those who have previously criticised AMPAS. The AP noted that the film's victory, because of its being an Oscar-winning foreign film in a regular Academy category, opens the door for Hollywood to undergo a radical change and a different kind of advancement, as a sceptic worried that if \"Parasite won the Oscar for best international film, it probably wouldn't win any other major awards\". \"The academy gave best picture to the actual best picture\", wrote Justin Chang of the Los Angeles Times, who continued that the film awards body was \"startled ... into recognizing that no country's cinema has a monopoly on greatness\". In 2021, the Writers Guild of America ranked Parasite's screenplay the fourth greatest of the 21st century so far.</p><p>On 28 March 2022, Cannes Film Festival president Thierry Frémaux revealed that after Everything Everywhere All at Once, a 2022 science fiction comedy-drama also featuring a predominantly Asian cast, won the Best Picture Oscar at the 95th Academy Awards, he began to question whether the Best Picture win for Parasite was worthy enough, saying \"How can a non-American film win the Oscar for best film since it’s a ceremony in honor of American cinema? Parasite won, it’s great, but it’s a Korean film.\"</p><br/><h3>Legacy</h3><h4>Spin-off television series</h4><p>A six-hour HBO limited series based on the film, with Bong and Adam McKay as executive producers, was announced to be in early development in January 2020. Bong has stated that this will also be entitled Parasite, and will explore stories \"that happen in between the sequences in the film\". In February 2020, Mark Ruffalo was rumoured to star whilst Tilda Swinton was confirmed as being cast in a lead role. However, in October 2022, Tilda Swinton announced she was no longer involved with the series.</p><h4>Plans for tourist set</h4><p>A South Korean local government (Goyang City) plans to restore the Goyang Aqua Special Shooting Studio set, where the film Parasite was produced, and use it as a Parasite movie experience tourism facility. In addition, Goyang City has announced that it will invest $150 million in the development of the Goyang Film Culture Complex by 2026 to accommodate film experience tourism facilities, additional indoor studios, outdoor set production facilities, inter-Korean video content centres, image research and development companies. However, criticisms have been made about the commercialisation of areas known for poverty in South Korea as tourist destinations without concrete steps being taken to address the issues at hand.</p><h4>City tourism and food</h4><p>The Seoul Tourism Organization (STO) has been criticised by South Korea's opposition party and residents of Seoul for introducing a tour route featuring filming locations and stories from the film. The Justice Party claims that it became famous due to the universal recognition of global inequality. However, it sees the development of a tourist attraction based on the film in Seoul as amounting to the further exploitation of poverty. Residents living in Parasite's filming locations have reportedly complained of a sense of embarrassment and discomfort due to an increase in tourists visiting their neighbourhoods and taking photos of their surroundings, making them feel like \"monkeys in a zoo\". In response, the local government of Seoul has announced that government funding will prioritise the estimated 1,500 low-income families living in the semi-basement type accommodations featured in the film.</p><p>People began posting videos on how to make jjapaguri (called \"ram-don\" in the film's English subtitles) on YouTube after the film was distributed. Nongshim, the manufacturer of Chapagetti and Neoguri, also began distributing a singular \"Chapaguri\" product due to the combination's popularity from the film.</p><br/>"
  },
  "errorMessage": ""
}