{
  "imDbId": "tt0047296",
  "title": "On the Waterfront",
  "fullTitle": "On the Waterfront (1954)",
  "type": "Movie",
  "year": "1954",
  "language": "en",
  "titleInLanguage": "On the Waterfront",
  "url": "https://en.wikipedia.org/wiki/On_the_Waterfront",
  "plotShort": {
    "plainText": "On the Waterfront is a 1954 American crime drama film, directed by Elia Kazan and written by Budd Schulberg. It stars Marlon Brando and features Karl Malden, Lee J. Cobb, Rod Steiger, Pat Henning, and Eva Marie Saint in her film debut. The musical score was composed by Leonard Bernstein. The black-and-white film was inspired by \"Crime on the Waterfront\" by Malcolm Johnson, a series of articles published in November–December 1948 in the New York Sun which won the 1949 Pulitzer Prize for Local Reporting, but the screenplay by Budd Schulberg is directly based on his own original story. The film focuses on union violence and corruption amongst longshoremen, while detailing widespread corruption, extortion, and racketeering on the waterfronts of Hoboken, New Jersey.\r\nOn the Waterfront was a critical and commercial success and is considered one of the greatest films ever made. It received twelve Academy Award nominations and won eight, including Best Picture, Best Actor for Brando, Best Supporting Actress for Saint, and Best Director for Kazan. In 1997, it was ranked by the American Film Institute as the eighth-greatest American movie of all time; in AFI's 2007 list, it was ranked 19th. It is Bernstein's only original film score not adapted from a stage production with songs.\r\nIn 1989, On the Waterfront was one of the first 25 films to be deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.",
    "html": "<p>On the Waterfront is a 1954 American crime drama film, directed by Elia Kazan and written by Budd Schulberg. It stars Marlon Brando and features Karl Malden, Lee J. Cobb, Rod Steiger, Pat Henning, and Eva Marie Saint in her film debut. The musical score was composed by Leonard Bernstein. The black-and-white film was inspired by \"Crime on the Waterfront\" by Malcolm Johnson, a series of articles published in November–December 1948 in the New York Sun which won the 1949 Pulitzer Prize for Local Reporting, but the screenplay by Budd Schulberg is directly based on his own original story. The film focuses on union violence and corruption amongst longshoremen, while detailing widespread corruption, extortion, and racketeering on the waterfronts of Hoboken, New Jersey.</p><p>On the Waterfront was a critical and commercial success and is considered one of the greatest films ever made. It received twelve Academy Award nominations and won eight, including Best Picture, Best Actor for Brando, Best Supporting Actress for Saint, and Best Director for Kazan. In 1997, it was ranked by the American Film Institute as the eighth-greatest American movie of all time; in AFI's 2007 list, it was ranked 19th. It is Bernstein's only original film score not adapted from a stage production with songs.</p><p>In 1989, On the Waterfront was one of the first 25 films to be deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.</p>"
  },
  "plotFull": {
    "plainText": "On the Waterfront is a 1954 American crime drama film, directed by Elia Kazan and written by Budd Schulberg. It stars Marlon Brando and features Karl Malden, Lee J. Cobb, Rod Steiger, Pat Henning, and Eva Marie Saint in her film debut. The musical score was composed by Leonard Bernstein. The black-and-white film was inspired by \"Crime on the Waterfront\" by Malcolm Johnson, a series of articles published in November–December 1948 in the New York Sun which won the 1949 Pulitzer Prize for Local Reporting, but the screenplay by Budd Schulberg is directly based on his own original story. The film focuses on union violence and corruption amongst longshoremen, while detailing widespread corruption, extortion, and racketeering on the waterfronts of Hoboken, New Jersey.\r\nOn the Waterfront was a critical and commercial success and is considered one of the greatest films ever made. It received twelve Academy Award nominations and won eight, including Best Picture, Best Actor for Brando, Best Supporting Actress for Saint, and Best Director for Kazan. In 1997, it was ranked by the American Film Institute as the eighth-greatest American movie of all time; in AFI's 2007 list, it was ranked 19th. It is Bernstein's only original film score not adapted from a stage production with songs.\r\nIn 1989, On the Waterfront was one of the first 25 films to be deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.\r\nPlot\r\nTerry Malloy is a former prize fighter coerced by corrupt union boss Johnny Friendly into luring fellow dockworker Joey Doyle onto a rooftop. Joey is pushed off the roof, and Terry is visibly upset because he believed that the union thugs were merely going to talk with Joey about his rumored plan to testify against Friendly to the Waterfront Crime Commission. The other dockworkers remain silent, in fear for their lives. Terry reconnects with Joey's sister Edie, who shames the local priest Father Barry into calling the dockworkers to a meeting. Barry tries to persuade them to stand together, but Friendly has sent Terry to report on what is said. Terry is mocked by the other dockworkers before the meeting is broken up by Friendly's men. Terry helps Edie escape while Timothy \"Kayo\" Dugan is persuaded by Father Barry to testify. Friendly reveals to Terry that Dugan testified behind closed doors, and the next day Dugan is killed by a load of whiskey barrels set loose by Friendly's men.\r\nFather Barry makes an impassioned speech reminding the longshoremen that Christ walks among them, saying that every murder is a crucifixion. Terry is still unwilling to testify, even after he is subpoenaed, while the other dockworkers also refuse to testify. Terry's guilt and regret grow along with his feelings for Edie as he sees her relentless pursuit of justice. He confesses his role in Joey's death to Father Barry who persuades him to confess to Edie. Horrified, Edie runs away. A crime commission investigator reminds Terry of his last great fight, which he threw for a bet after Johnny Friendly \"bought a piece\" of him. Friendly's men witness Terry's conversation with the investigator and Friendly tells Charley, Terry's brother, to persuade Terry to keep quiet by offering him a cushy job. Terry resists and Charley pulls a gun, which Terry gently waves away. Terry expresses regret about throwing his best fight, and blames Charley for having set up the fix, ruining his career. Charley gives Terry the gun and tells him to run. Terry goes to Edie's apartment, where she refuses to let him in. He breaks in and insists she loves him and they kiss, before Terry's name is called through the open window. The men down on the street shout that his brother is waiting and Terry runs out to help him, with Edie following.\r\nAfter nearly being run down by a truck, Edie and Terry find Charley's body hung on a hook in the alley. Terry goes to a bar to shoot Friendly but Father Barry distracts him while he is waiting and the other union men run out to warn Friendly. Barry persuades Terry to fight Friendly by testifying in court. Terry gives damning testimony to the commission, and Friendly is cut off from his powerful friends while facing indictment. Friendly bars Terry from any union jobs. Refusing to leave the city with Edie, Terry appears at the dock for the daily ritual where workers are chosen from the assembled longshoremen. Everyone is called to work except Terry, who taunts Friendly outside the nearby shack, shouting that he is proud of testifying. Friendly goads Terry into attacking and is getting beaten until he calls for help from his thugs, who stop just shy of killing Terry. The longshoremen refuse to work unless Terry is allowed to work as well, and Joey's father pushes Friendly into the river when he tries to bully the men. Father Barry tells a badly injured Terry that he lost the battle but has a chance to win the war if he can walk into the warehouse. Father Barry and Edie get him on his feet and Terry stumbles up the gangway to stand before the warehouse, where the boss nods to Terry and tells them to get to work. The men follow Terry inside, ignoring Friendly as he lashes out with empty threats and his fists. The door closes behind them, leaving Friendly out in the cold.\r\nCast\r\nMarlon Brando as Terry Malloy\r\nKarl Malden as Father Pete Barry\r\nLee J. Cobb as Michael J. Skelly aka \"Johnny Friendly\"\r\nRod Steiger as Charley \"the Gent\" Malloy\r\nEva Marie Saint as Edie Doyle\r\nPat Henning as Timothy J. \"Kayo\" Dugan\r\nJohn F. Hamilton as \"Pop\" Doyle\r\nBen Wagner as Joey Doyle\r\nJames Westerfield as Big Mac\r\nFred Gwynne as Mladen \"Slim\" Sekulovich (uncredited)\r\nTami Mauriello as Tillio\r\nTony Galento as Truck\r\nLeif Erickson as Lead Investigator for Crime Commission\r\nRudy Bond as Moose\r\nMartin Balsam as Gillette, Secondary Investigator for Crime Commission (uncredited)\r\nKatherine MacGregor as a Longshoreman's Mother (uncredited)\r\nPat Hingle as Jocko (uncredited)\r\nNehemiah Persoff as Cab Driver (uncredited)\r\nAbe Simon as Barney\r\nThomas Handley as Tommy\r\nProduction\r\nScreenplay and political context\r\nThe film is widely considered to be Elia Kazan's answer to those who criticized him for identifying eight Communists in the film industry before the House Committee on Un-American Activities (HUAC) in 1952. One of Kazan's critics was his friend and collaborator, the noted playwright Arthur Miller, who had earlier written the first version of the script, originally titled The Hook. Kazan had agreed to direct it, and in 1951 they met with Harry Cohn at Columbia Pictures about making the picture. Cohn agreed in principle to make The Hook, but there were concerns about the portrayal of corrupt union officials. When Cohn asked the antagonists be changed to Communists, Miller refused. Cohn sent a letter telling Miller it was interesting he had resisted Columbia's desire to make the movie \"pro-American\". Kazan asked Miller to rewrite the script; Miller declined due to his disenchantment with Kazan's friendly testimony before the HUAC. Kazan then replaced Miller with Budd Schulberg.\r\nCobb's character of Johnny Friendly was partly modeled on Johnny Dio, a real-life mobster known for involvement in labor racketeering.\r\nCasting\r\nAccording to Richard Schickel in his biography of Kazan, Marlon Brando initially refused the role of Terry Malloy, and Frank Sinatra (a native of Hoboken, where the film was being made) then had \"a handshake deal\" – but no formally signed contract – to play the part, even attending an initial costume fitting. But Kazan still favored Brando for the role, partly because casting Brando would assure a larger budget for the picture. While Brando's agent, Jay Kanter, attempted to persuade Brando to change his mind, Kazan enlisted actor Karl Malden, whom Kazan considered more suited to a career as a director than as an actor, to direct and film a screen test of a \"more Brando-like\" actor as Terry Malloy, in an effort to persuade producer Sam Spiegel that \"an actor like Marlon Brando\" could perform the role more forcefully than Sinatra. To that end, Malden filmed a screen test of Actors Studio members Paul Newman and Joanne Woodward performing the love scene between Terry and Edie. Persuaded by the Newman/Woodward screen test, Spiegel agreed to reconsider Brando for the role, and shortly afterward, Kanter convinced Brando to reconsider his refusal. Within a week, Brando signed a contract to perform in the film. At that point, a furious Sinatra demanded to be cast in the role of Father Barry, the waterfront priest. It was left to Spiegel to break the news to Sinatra that Malden had been signed for this role.\r\nFilming locations\r\nOn the Waterfront was filmed over 36 days on location in various places in Hoboken, New Jersey, including the docks, workers' slum dwellings, bars, littered alleys, and rooftops. The church used for exterior scenes in the film was the historic Our Lady of Grace, built in 1874, while the interiors were shot at the Church of St. Peter and St. Paul at 400 Hudson Street.\r\nReception\r\nUpon its release, the film received positive reviews from critics, and was a commercial success, earning an estimated $4.2 million at the North American box office in 1954. In his July 29, 1954, review, New York Times critic A. H. Weiler called the film \"an uncommonly powerful, exciting, and imaginative use of the screen by gifted professionals\".\r\nOn Rotten Tomatoes, the film has a critical score of 99% from 99 reviews with an average rating of 9.2/10 and a critical consensus of \"With his electrifying performance in Elia Kazan's thought-provoking, expertly constructed melodrama, Marlon Brando redefined the possibilities of acting for film and helped permanently alter the cinematic landscape\". Gaining the Academy Award for Best Actor and being named the greatest and second-greatest film performance of all time by Aaron West of Criterion and by Premiere respectively, Brando's performance is regarded as one of the watershed moments in the history of movies.\r\nThrough his portrayal of Terry Malloy, Brando popularized method acting and conclusively exemplified the power of Stanislavski-based approach in cinema. Praising Brando in 2004, director Martin Scorsese noted that \"hen you watch his work in On the Waterfront ... you’re watching the purest poetry imaginable, in dynamic motion\". Kazan, the director of the film, would later write in his book, \"If there is a better performance by a man in the history of film in America, I don't know what it is.\"\r\nAl Pacino, recounting his own memories on first seeing On the Waterfront, told Playboy in a 1979 interview that he concentrated more on the lead actor than the film itself, \"I couldn't move. I couldn't leave the theatre. I’d never seen the like of it.\" Anthony Hopkins said, \"When you see Brando in the famous cab scene in On the Waterfront, it's still breathtaking.\" In a eulogy for Brando, Jack Nicholson described his display \"probably the height of any age\", and added that, \"You just couldn’t take your eyes off the guy. He was spellbinding.\"\r\nAwards and nominations\r\nIn 1989, the film was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress, and selected for preservation in the United States National Film Registry.\r\nIn 1995, it made it on the Vatican's list of 45 greatest films.\r\nAmerican Film Institute recognition\r\nAFI's 100 Years... 100 Movies – #8\r\nAFI's 100 Years... 100 Heroes and Villains: Terry Malloy – #23 Hero Johnny Friendly – Nominated Villain\r\nTerry Malloy – #23 Hero\r\nJohnny Friendly – Nominated Villain\r\nAFI's 100 Years... 100 Movie Quotes: \"You don't understand! I coulda had class. I coulda been a contender. I coulda been somebody instead of a bum, which is what I am.\" – #3\r\n\"You don't understand! I coulda had class. I coulda been a contender. I coulda been somebody instead of a bum, which is what I am.\" – #3\r\nAFI's 100 Years of Film Scores – #22\r\nAFI's 100 Years... 100 Cheers – #36\r\nAFI's 100 Years... 100 Movies (10th Anniversary Edition) – #19\r\nAFI's 10 Top 10 – Nominated Gangster film\r\nHome media\r\nThe first home video release of the film was by Columbia Pictures Home Entertainment in 1982, on VHS and Beta. RCA/Columbia Pictures Home Video later re-released it in 1984, 1986, and 1990, respectively, the latter being a part of the Columbia Classics line-up. Columbia TriStar later reissued the film on VHS in 1995 as part of the line-up's \"Studio Heritage Collection\", and the first DVD version was released in 2001. Among the special features is the featurette \"Contender: Mastering the Method\", a video photo gallery, an interview with Elia Kazan, an audio commentary, filmographies, production notes, and theatrical trailers. The film has been added to the Criterion Collection.\r\nThe 2013 Criterion Collection release presents the film in three aspect ratios: 1.66:1, 1.85:1, and 1.33:1. The accompanying booklet explains the reasoning behind this choice: \"In 1953, Columbia Pictures was transitioning to the new widescreen format and declared that all its upcoming films, including On The Waterfront, would be suitable for projection in any aspect ratio from the full frame of 1.33:1 to the then widest standard of 1.85:1. The customary frame of European cinematographer Boris Kaufman (Twelve Angry Men, Baby Doll) split the difference at 1.66:1, so that all that was required was for him to leave extra room at the top and bottom of the frame and make sure that nothing essential would be lost in the widescreen presentation. At its premiere in 1954, On The Waterfront was projected at 1.85:1. Over subsequent decades, millions of television viewers became accustomed to seeing the film with the open-matte 1.33:1 framing, a presentation that has carried over into the home video era. Here, for the first time, Criterion is presenting the film in all three aspect ratios so that viewers can compare and choose the version they prefer.\"\r\nAdaptations\r\nThe film script was adapted to stage by Schulberg. It opened on Broadway in November 1984. It included technical innovations for the time, including lasers, filmlike scenic dissolves and sounds that enveloped the audience. The story is a little different, with the motivations of Father Barry made more explicit, and the ending is less happy and more realistic. It was revised in 1995 and lasted for only 8 performances, losing $2.6 million, a record on Broadway for a non-musical at the time.\r\nThe Indian film Ghulam (1998) is inspired by On the Waterfront.",
    "html": "<p>On the Waterfront is a 1954 American crime drama film, directed by Elia Kazan and written by Budd Schulberg. It stars Marlon Brando and features Karl Malden, Lee J. Cobb, Rod Steiger, Pat Henning, and Eva Marie Saint in her film debut. The musical score was composed by Leonard Bernstein. The black-and-white film was inspired by \"Crime on the Waterfront\" by Malcolm Johnson, a series of articles published in November–December 1948 in the New York Sun which won the 1949 Pulitzer Prize for Local Reporting, but the screenplay by Budd Schulberg is directly based on his own original story. The film focuses on union violence and corruption amongst longshoremen, while detailing widespread corruption, extortion, and racketeering on the waterfronts of Hoboken, New Jersey.</p><p>On the Waterfront was a critical and commercial success and is considered one of the greatest films ever made. It received twelve Academy Award nominations and won eight, including Best Picture, Best Actor for Brando, Best Supporting Actress for Saint, and Best Director for Kazan. In 1997, it was ranked by the American Film Institute as the eighth-greatest American movie of all time; in AFI's 2007 list, it was ranked 19th. It is Bernstein's only original film score not adapted from a stage production with songs.</p><p>In 1989, On the Waterfront was one of the first 25 films to be deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.</p><br/><h3>Plot</h3><p>Terry Malloy is a former prize fighter coerced by corrupt union boss Johnny Friendly into luring fellow dockworker Joey Doyle onto a rooftop. Joey is pushed off the roof, and Terry is visibly upset because he believed that the union thugs were merely going to talk with Joey about his rumored plan to testify against Friendly to the Waterfront Crime Commission. The other dockworkers remain silent, in fear for their lives. Terry reconnects with Joey's sister Edie, who shames the local priest Father Barry into calling the dockworkers to a meeting. Barry tries to persuade them to stand together, but Friendly has sent Terry to report on what is said. Terry is mocked by the other dockworkers before the meeting is broken up by Friendly's men. Terry helps Edie escape while Timothy \"Kayo\" Dugan is persuaded by Father Barry to testify. Friendly reveals to Terry that Dugan testified behind closed doors, and the next day Dugan is killed by a load of whiskey barrels set loose by Friendly's men.</p><p>Father Barry makes an impassioned speech reminding the longshoremen that Christ walks among them, saying that every murder is a crucifixion. Terry is still unwilling to testify, even after he is subpoenaed, while the other dockworkers also refuse to testify. Terry's guilt and regret grow along with his feelings for Edie as he sees her relentless pursuit of justice. He confesses his role in Joey's death to Father Barry who persuades him to confess to Edie. Horrified, Edie runs away. A crime commission investigator reminds Terry of his last great fight, which he threw for a bet after Johnny Friendly \"bought a piece\" of him. Friendly's men witness Terry's conversation with the investigator and Friendly tells Charley, Terry's brother, to persuade Terry to keep quiet by offering him a cushy job. Terry resists and Charley pulls a gun, which Terry gently waves away. Terry expresses regret about throwing his best fight, and blames Charley for having set up the fix, ruining his career. Charley gives Terry the gun and tells him to run. Terry goes to Edie's apartment, where she refuses to let him in. He breaks in and insists she loves him and they kiss, before Terry's name is called through the open window. The men down on the street shout that his brother is waiting and Terry runs out to help him, with Edie following.</p><p>After nearly being run down by a truck, Edie and Terry find Charley's body hung on a hook in the alley. Terry goes to a bar to shoot Friendly but Father Barry distracts him while he is waiting and the other union men run out to warn Friendly. Barry persuades Terry to fight Friendly by testifying in court. Terry gives damning testimony to the commission, and Friendly is cut off from his powerful friends while facing indictment. Friendly bars Terry from any union jobs. Refusing to leave the city with Edie, Terry appears at the dock for the daily ritual where workers are chosen from the assembled longshoremen. Everyone is called to work except Terry, who taunts Friendly outside the nearby shack, shouting that he is proud of testifying. Friendly goads Terry into attacking and is getting beaten until he calls for help from his thugs, who stop just shy of killing Terry. The longshoremen refuse to work unless Terry is allowed to work as well, and Joey's father pushes Friendly into the river when he tries to bully the men. Father Barry tells a badly injured Terry that he lost the battle but has a chance to win the war if he can walk into the warehouse. Father Barry and Edie get him on his feet and Terry stumbles up the gangway to stand before the warehouse, where the boss nods to Terry and tells them to get to work. The men follow Terry inside, ignoring Friendly as he lashes out with empty threats and his fists. The door closes behind them, leaving Friendly out in the cold.</p><br/><h3>Cast</h3><ul><li>Marlon Brando as Terry Malloy</li><li>Karl Malden as Father Pete Barry</li><li>Lee J. Cobb as Michael J. Skelly aka \"Johnny Friendly\"</li><li>Rod Steiger as Charley \"the Gent\" Malloy</li><li>Eva Marie Saint as Edie Doyle</li><li>Pat Henning as Timothy J. \"Kayo\" Dugan</li><li>John F. Hamilton as \"Pop\" Doyle</li><li>Ben Wagner as Joey Doyle</li><li>James Westerfield as Big Mac</li><li>Fred Gwynne as Mladen \"Slim\" Sekulovich (uncredited)</li><li>Tami Mauriello as Tillio</li><li>Tony Galento as Truck</li><li>Leif Erickson as Lead Investigator for Crime Commission</li><li>Rudy Bond as Moose</li><li>Martin Balsam as Gillette, Secondary Investigator for Crime Commission (uncredited)</li><li>Katherine MacGregor as a Longshoreman's Mother (uncredited)</li><li>Pat Hingle as Jocko (uncredited)</li><li>Nehemiah Persoff as Cab Driver (uncredited)</li><li>Abe Simon as Barney</li><li>Thomas Handley as Tommy</li></ul><br/><h3>Production</h3><h4>Screenplay and political context</h4><p>The film is widely considered to be Elia Kazan's answer to those who criticized him for identifying eight Communists in the film industry before the House Committee on Un-American Activities (HUAC) in 1952. One of Kazan's critics was his friend and collaborator, the noted playwright Arthur Miller, who had earlier written the first version of the script, originally titled The Hook. Kazan had agreed to direct it, and in 1951 they met with Harry Cohn at Columbia Pictures about making the picture. Cohn agreed in principle to make The Hook, but there were concerns about the portrayal of corrupt union officials. When Cohn asked the antagonists be changed to Communists, Miller refused. Cohn sent a letter telling Miller it was interesting he had resisted Columbia's desire to make the movie \"pro-American\". Kazan asked Miller to rewrite the script; Miller declined due to his disenchantment with Kazan's friendly testimony before the HUAC. Kazan then replaced Miller with Budd Schulberg.</p><p>Cobb's character of Johnny Friendly was partly modeled on Johnny Dio, a real-life mobster known for involvement in labor racketeering.</p><h4>Casting</h4><p>According to Richard Schickel in his biography of Kazan, Marlon Brando initially refused the role of Terry Malloy, and Frank Sinatra (a native of Hoboken, where the film was being made) then had \"a handshake deal\" – but no formally signed contract – to play the part, even attending an initial costume fitting. But Kazan still favored Brando for the role, partly because casting Brando would assure a larger budget for the picture. While Brando's agent, Jay Kanter, attempted to persuade Brando to change his mind, Kazan enlisted actor Karl Malden, whom Kazan considered more suited to a career as a director than as an actor, to direct and film a screen test of a \"more Brando-like\" actor as Terry Malloy, in an effort to persuade producer Sam Spiegel that \"an actor like Marlon Brando\" could perform the role more forcefully than Sinatra. To that end, Malden filmed a screen test of Actors Studio members Paul Newman and Joanne Woodward performing the love scene between Terry and Edie. Persuaded by the Newman/Woodward screen test, Spiegel agreed to reconsider Brando for the role, and shortly afterward, Kanter convinced Brando to reconsider his refusal. Within a week, Brando signed a contract to perform in the film. At that point, a furious Sinatra demanded to be cast in the role of Father Barry, the waterfront priest. It was left to Spiegel to break the news to Sinatra that Malden had been signed for this role.</p><h4>Filming locations</h4><p>On the Waterfront was filmed over 36 days on location in various places in Hoboken, New Jersey, including the docks, workers' slum dwellings, bars, littered alleys, and rooftops. The church used for exterior scenes in the film was the historic Our Lady of Grace, built in 1874, while the interiors were shot at the Church of St. Peter and St. Paul at 400 Hudson Street.</p><br/><h3>Reception</h3><p>Upon its release, the film received positive reviews from critics, and was a commercial success, earning an estimated $4.2 million at the North American box office in 1954. In his July 29, 1954, review, New York Times critic A. H. Weiler called the film \"an uncommonly powerful, exciting, and imaginative use of the screen by gifted professionals\".</p><p>On Rotten Tomatoes, the film has a critical score of 99% from 99 reviews with an average rating of 9.2/10 and a critical consensus of \"With his electrifying performance in Elia Kazan's thought-provoking, expertly constructed melodrama, Marlon Brando redefined the possibilities of acting for film and helped permanently alter the cinematic landscape\". Gaining the Academy Award for Best Actor and being named the greatest and second-greatest film performance of all time by Aaron West of Criterion and by Premiere respectively, Brando's performance is regarded as one of the watershed moments in the history of movies.</p><p>Through his portrayal of Terry Malloy, Brando popularized method acting and conclusively exemplified the power of Stanislavski-based approach in cinema. Praising Brando in 2004, director Martin Scorsese noted that \"hen you watch his work in On the Waterfront ... you’re watching the purest poetry imaginable, in dynamic motion\". Kazan, the director of the film, would later write in his book, \"If there is a better performance by a man in the history of film in America, I don't know what it is.\"</p><p>Al Pacino, recounting his own memories on first seeing On the Waterfront, told Playboy in a 1979 interview that he concentrated more on the lead actor than the film itself, \"I couldn't move. I couldn't leave the theatre. I’d never seen the like of it.\" Anthony Hopkins said, \"When you see Brando in the famous cab scene in On the Waterfront, it's still breathtaking.\" In a eulogy for Brando, Jack Nicholson described his display \"probably the height of any age\", and added that, \"You just couldn’t take your eyes off the guy. He was spellbinding.\"</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"12\"><span>Academy Awards</span></td><td><span>Best Motion Picture</span></td><td><span>Sam Spiegel</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"12\"> <br> </td></tr><tr><td><span>Best Director</span></td><td><span>Elia Kazan</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Marlon Brando</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Best Supporting Actor</span></td><td><span>Lee J. Cobb</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Karl Malden</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Rod Steiger</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Eva Marie Saint</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Story and Screenplay</span></td><td><span>Budd Schulberg</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction – Black-and-White</span></td><td><span>Richard Day</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography – Black-and-White</span></td><td><span>Boris Kaufman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Gene Milford</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Music Score of a Dramatic or Comedy Picture</span></td><td><span>Leonard Bernstein</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Bambi Awards</span></td><td colspan=\"2\">Best Film – International</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Best Actor – International</td><td>Marlon Brando</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Bodil Awards</span></td><td colspan=\"2\"><span>Best American Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\"><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film from any Source</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td><span>Best Foreign Actor</span></td><td>Marlon Brando</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Most Promising Newcomer to Film</span></td><td>Eva Marie Saint</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Elia Kazan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Marlon Brando</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Elia Kazan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Cinematography – Black and White</td><td>Boris Kaufman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>International Film Music Critics Association Awards</span></td><td><span>Best Archival Release of an Existing Score – <br> Re-Release or Re-Recording</span></td><td>Leonard Bernstein, Douglass Fake, <br> Frank K. DeWald, and Joe Sikoryak</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Nastro d'Argento</span></td><td>Best Foreign Film</td><td>Elia Kazan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Best Director</span></td><td>Elia Kazan</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Marlon Brando</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td>Eva Marie Saint</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\"><span>Venice International Film Festival</span></td><td><span>Golden Lion</span></td><td rowspan=\"4\">Elia Kazan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"4\"></td></tr><tr><td><span>Silver Lion</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>OCIC Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Pasinetti Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Written American Drama</span></td><td>Budd Schulberg</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr></tbody></table><p>In 1989, the film was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress, and selected for preservation in the United States National Film Registry.</p><p>In 1995, it made it on the Vatican's list of 45 greatest films.</p><p>American Film Institute recognition</p><ul><li>AFI's 100 Years... 100 Movies – #8</li><li>AFI's 100 Years... 100 Heroes and Villains: Terry Malloy – #23 Hero Johnny Friendly – Nominated Villain</li><li>Terry Malloy – #23 Hero</li><li>Johnny Friendly – Nominated Villain</li><li>AFI's 100 Years... 100 Movie Quotes: \"You don't understand! I coulda had class. I coulda been a contender. I coulda been somebody instead of a bum, which is what I am.\" – #3</li><li>\"You don't understand! I coulda had class. I coulda been a contender. I coulda been somebody instead of a bum, which is what I am.\" – #3</li><li>AFI's 100 Years of Film Scores – #22</li><li>AFI's 100 Years... 100 Cheers – #36</li><li>AFI's 100 Years... 100 Movies (10th Anniversary Edition) – #19</li><li>AFI's 10 Top 10 – Nominated Gangster film</li></ul><br/><h3>Home media</h3><p>The first home video release of the film was by Columbia Pictures Home Entertainment in 1982, on VHS and Beta. RCA/Columbia Pictures Home Video later re-released it in 1984, 1986, and 1990, respectively, the latter being a part of the Columbia Classics line-up. Columbia TriStar later reissued the film on VHS in 1995 as part of the line-up's \"Studio Heritage Collection\", and the first DVD version was released in 2001. Among the special features is the featurette \"Contender: Mastering the Method\", a video photo gallery, an interview with Elia Kazan, an audio commentary, filmographies, production notes, and theatrical trailers. The film has been added to the Criterion Collection.</p><p>The 2013 Criterion Collection release presents the film in three aspect ratios: 1.66:1, 1.85:1, and 1.33:1. The accompanying booklet explains the reasoning behind this choice: \"In 1953, Columbia Pictures was transitioning to the new widescreen format and declared that all its upcoming films, including On The Waterfront, would be suitable for projection in any aspect ratio from the full frame of 1.33:1 to the then widest standard of 1.85:1. The customary frame of European cinematographer Boris Kaufman (Twelve Angry Men, Baby Doll) split the difference at 1.66:1, so that all that was required was for him to leave extra room at the top and bottom of the frame and make sure that nothing essential would be lost in the widescreen presentation. At its premiere in 1954, On The Waterfront was projected at 1.85:1. Over subsequent decades, millions of television viewers became accustomed to seeing the film with the open-matte 1.33:1 framing, a presentation that has carried over into the home video era. Here, for the first time, Criterion is presenting the film in all three aspect ratios so that viewers can compare and choose the version they prefer.\"</p><br/><h3>Adaptations</h3><p>The film script was adapted to stage by Schulberg. It opened on Broadway in November 1984. It included technical innovations for the time, including lasers, filmlike scenic dissolves and sounds that enveloped the audience. The story is a little different, with the motivations of Father Barry made more explicit, and the ending is less happy and more realistic. It was revised in 1995 and lasted for only 8 performances, losing $2.6 million, a record on Broadway for a non-musical at the time.</p><p>The Indian film Ghulam (1998) is inspired by On the Waterfront.</p><br/>"
  },
  "errorMessage": ""
}