{
  "imDbId": "tt2267998",
  "title": "Gone Girl",
  "fullTitle": "Gone Girl (2014)",
  "type": "Movie",
  "year": "2014",
  "items": [
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "https://variety.com/2014/film/reviews/film-review-gone-girl-1201308847/",
      "rate": "100",
      "content": "Surgically precise, grimly funny and entirely mesmerizing over the course of its swift 149-minute running time, this taut yet expansive psychological thriller represents an exceptional pairing of filmmaker and material."
    },
    {
      "publisher": "Time Out",
      "author": "Joshua Rothkopf",
      "link": "",
      "rate": "100",
      "content": "It's a hypnotically perverse film, one that redeems your faith in studio smarts (but not, alas, in local law enforcement, tabloid crime reporting or, indeed, marriage)."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Chris Nashawaty",
      "link": "https://ew.com/article/2014/10/08/gone-girl-3/",
      "rate": "100",
      "content": "Anyone who loved Gone Girl the book will walk out of Gone Girl the movie with a sick grin on their face. You can stop being nervous."
    },
    {
      "publisher": "TheWrap",
      "author": "James Rocchi",
      "link": "https://www.thewrap.com/gone-girl-review-david-fincher-ben-affleck-gillian-flynn/",
      "rate": "90",
      "content": "Not only brutal but also brutally funny, Gone Girl mixes top-notch suspenseful storytelling with the kind of razor-edged wit that slashes so quick and clean you're still watching the blade go past before you notice you're bleeding."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://www.vulture.com/2014/09/movie-review-gone-girl.html",
      "rate": "90",
      "content": "The movie is phenomenally gripping—although it does leave you queasy, uncertain what to take away on the subject of men, women, marriage, and the possibility of intimacy from the example of such prodigiously messed-up people."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/gone-girl-film-review-734451/",
      "rate": "80",
      "content": "A sharply made, perfectly cast and unfailingly absorbing melodrama. But, like the director's adaptation of another publishing phenomenon, The Girl With the Dragon Tattoo, three years ago, it leaves you with a quietly lingering feeling of: “Is that all there is?”"
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/11109996/Gone-Girl-review-David-Fincher-in-fun-mode.html",
      "rate": "80",
      "content": "For all its simmering malice and buried secrets, it’s worth remembering that this is David Fincher in fun mode: unnerving, shocking and provoking for better and for worse, in sickness and in health, but mostly sickness."
    },
    {
      "publisher": "The Guardian",
      "author": "Xan Brooks",
      "link": "https://www.theguardian.com/film/2014/sep/22/gone-girl-review-film-ben-affleck-rosamund-pike-david-fincher",
      "rate": "80",
      "content": "Gone Girl, finally, may be no more than a storm in a teacup. But what an elegant, bone-china teacup this is. And what a fearsome force-10 gale we have brewing inside."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Stylish, twisted and daring, Gone Girl is a David Fincher date movie: dark, smart and dangerous. If it doesn’t deliver in its finale, its twist, turns and commitment to moral repugnance will leave you reeling."
    },
    {
      "publisher": "",
      "author": "IndieWire",
      "link": "https://www.indiewire.com/2014/09/review-gone-girl-is-a-curious-choice-for-david-fincher-69819/",
      "rate": "58",
      "content": "Fincher likely prides himself on turning coal into diamonds at this point, but Flynn's script can feel so retrograde at times that one wonders whether it might have been better served by a De Palma, Bigelow, or even a Verhoeven — which is to say, a filmmaker less concerned with making the lascivious seem prestigious."
    }
  ],
  "errorMessage": ""
}