{
  "imDbId": "tt2267998",
  "title": "Gone Girl",
  "fullTitle": "Gone Girl (2014)",
  "type": "Movie",
  "year": "2014",
  "items": [
    {
      "username": "cricketbat",
      "userUrl": "https://www.imdb.com/user/ur6201371",
      "reviewLink": "https://www.imdb.com/review/rw4391617",
      "warningSpoilers": false,
      "date": "11 October 2018",
      "rate": "8",
      "helpful": "209 out of 233 found this helpful.",
      "title": "What a crime thriller should be",
      "content": "I like it when a movie can keep me guessing until the end, and Gone Girl just did that. Most of the time I didn't know where this film was going, and each new twist and turn was a surprise. You can't help but get pulled into the story. The actors all gave excellent performances, as well. I don't think I'll ever be able to look at some of them the same way again. This movie is what a crime thriller should be."
    },
    {
      "username": "cmalpelli",
      "userUrl": "https://www.imdb.com/user/ur83707563",
      "reviewLink": "https://www.imdb.com/review/rw5747393",
      "warningSpoilers": false,
      "date": "18 May 2020",
      "rate": "9",
      "helpful": "442 out of 508 found this helpful.",
      "title": "Mixed feelings, hear me out.",
      "content": "There's no denying that this is a great film and from what I've heard a great book as well, you can see that I gave it a 9/10 rating, but there's a catch especially for me personally with this movie. The shorts version I can tell you and with my hand to God no lie this movie single handedly put the nail in the coffin for my marriage without me even being the wiser. So for as much as I do appreciate the detailed and intriguing story, watching it years later after my divorce it sends chills through my body knowing that my ex wife and I enjoyed this movie together, and obviously me not knowing just how much she loved it but how it inspired her to go about divorcing me in the way that she did, be weary because there are sick people (men and women) in this world that will vindictively assassinate someone else's character and well being just to avenge whatever perversion that they're transfixed on in their own mind. I'm not looking for sympathy or anything, I'm just stating a fact that happened to me, I don't advise watching this for the first time with a love partner, it could unhinge the mind beyond a point of no return, I'm absolutely 100% serious about this, this is not a joke."
    },
    {
      "username": "manisimmati",
      "userUrl": "https://www.imdb.com/user/ur25164572",
      "reviewLink": "https://www.imdb.com/review/rw3769384",
      "warningSpoilers": false,
      "date": "1 August 2017",
      "rate": "10",
      "helpful": "136 out of 157 found this helpful.",
      "title": "A Cynical, Masterful Caricature of Modern Relationships",
      "content": "Amy and Nick Dunne are young, stylish and charming. The immaculate dream couple? It seems so, at least on the face of it. But infidelity and financial troubles let the glamorous façade crumble. One morning, Amy disappears without a trace, and Nick becomes suspect. Did he kill his wife? The media depict him as an uncaring husband, and he's trying desperately to correct that image. But what if he really is the murderer everyone believes him to be?\"Gone Girl\", based on the Gillian Flynn novel of the same name, is a masterful thriller, a sharp-sighted media satire and a cynical analysis of modern marriage. Flynn herself wrote the screenplay for the movie adaptation, and David Fincher turns the already disturbing story into something even darker. \"Gone Girl\" is a perfect fit for Fincher, as it is concerned with two of his favorite themes: gender issues and modern media. The main topic here is how the media are shaping our own identities. Nick Dunne has to adapt to the expectations of the public in order to survive. As his lawyer Tanner Bolt puts it: \"This case is about what people think of you.\"Amy and Nick both just play a character. They pretend to be a perfect couple. The movie suggests that pretending and being are not as far apart as we tend to think. When everyone plays along, the shallow masks are going to work. The much-maligned ending underlines this insight perfidiously. It's the point where \"Gone Girl\" becomes a pitch-black social satire. The last act isn't a thriller anymore, it's a grotesque caricature of modern relationships. I've never seen anything like it, and I can't praise Fincher enough for the risk he took with the last half an hour of this movie. Ben Affleck is great as the insipid husband Nick. You love to hate him. Rosamund Pike is simply mind-blowing. You'll also see Neil Patrick Harris and Tyler Perry in unusual roles. My personal favorite is Carrie Coon as Nick's caring yet foul-mouthed sister Margo. She's the heart of this movie, because unlike everyone else, she genuinely speaks her mind. Kim Dickens as the clever detective Rhonda Boney is pretty approachable, too.\"Gone Girl\" might be Fincher's most splendid masterpiece yet. This movie is so unsettling and cynical, it feels like it was directed by the love child of Alfred Hitchcock and Lars von Trier. If that's not awesome, I don't know what is."
    },
    {
      "username": "bgar-80932",
      "userUrl": "https://www.imdb.com/user/ur77092838",
      "reviewLink": "https://www.imdb.com/review/rw4272387",
      "warningSpoilers": false,
      "date": "7 August 2018",
      "rate": "8",
      "helpful": "49 out of 61 found this helpful.",
      "title": "Interesting end",
      "content": "This is a 2.5 hour movie and sometimes these days it's difficult for me to stick with the longer movies but this never felt long. You were always curious what was going on. Let's just say it didn't quite go the way I expected but I was intrigued the whole time. The acting was great. This could for sure be considered a slow burn and I'm actually currently watching the TV show Sharp Objects by the same author and this is paced much better than that. There's a couple things I didn't particularly thing got solved or like how they went at the end but overall a great movie."
    },
    {
      "username": "bowmanblue",
      "userUrl": "https://www.imdb.com/user/ur1406466",
      "reviewLink": "https://www.imdb.com/review/rw3224775",
      "warningSpoilers": false,
      "date": "22 April 2015",
      "rate": "8",
      "helpful": "99 out of 135 found this helpful.",
      "title": "Gone, but definitely not forgotten",
      "content": "Wow, actually a thriller that's pretty good. Yes, it's fair to say that 'Gone Girl' is a really engrossing film. As with almost every film, it's based on a book. And, as with most films based on a book, I haven't read the book, so I haven't got a clue how well the film relates to the source material. But then I don't care. I just enjoyed the ride.'Gone Girl' is one of those films where you don't want to say too much about for fear of giving things away and spoiling it for people who haven't seen it. Ben Affleck plays a (reasonably) decent husband whose well-to-do wife disappears. The media circus that follows then starts to reveal that the truth is far more complicated that it first seems (not to mention the obligatory police investigation). It's fair to say that what follows is a film that twists and turns, so you only really get one chance to watch it and not know what's coming.Many people don't really like Affleck when it comes to acting (even less now he's due to don the Batsuit!), but I think most people will relate to him as he gets pursued and hounded (unfairly? You'll have to wait and see!) by the media. Rosamund Pike plays his (gone!) wife with a flawless American accent. Again, you'll have to see whether she's found alive or dead. The story bounces around back and forth in time, making sure you're just confused enough never to put too much together before the film's ready to reveal what's happening.If I had one complaint it's that the film is a little too long. Perhaps ten to fifteen minutes could have been edited out at around the three quarters mark, just to speed it up. But that's a minor gripe. Basically, if you like your thrillers twisty and turny (and have a couple of hours to spare on a film that you really have to concentrate on) give this one a go."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw3153555",
      "warningSpoilers": true,
      "date": "1 January 2015",
      "rate": "6",
      "helpful": "114 out of 174 found this helpful.",
      "title": "Great Hype for a Too Long Movie with Plot Holes and a Deceptive Conclusion",
      "content": "In Missouri, the unemployed writer Nick Dunne (Ben Affleck) goes to the bar The Bar that he owns with his twin sister Margo Dunne (Carrie Coon) on the day of his fifth wedding anniversary and they talk and play a board game. Then he goes home and finds that his wife Amy Dunne (Rosamund Pike) is missing. He calls the police and Detective Rhonda Boney (Kim Dickens) is in charge of the investigation with Officer James Gilpin (Patrick Fugit). As long as the investigation proceeds, the evidences show Nick as the prime suspect of murder while the media fiercely attacks him. But is Amy really dead?Spoilers ahead: \"Gone Girl\" is a movie with great hype, but actually it is a too long movie with plot holes and a deceptive conclusion. In addition, the lead characters are non-charismatic. The good thing is the criticism to the hypocrite behavior of the media. Amy leaves her house but no neighbor sees her. The diary in the stove is partially burned and the detective does not suspect that something is wrong. Amy travels but she does not change her face, lodges in a low-budget hotel and nobody recognizes her. Internet shopping is delivered by courier; wouldn't the postman keep a record of who received the expensive delivery? The house by the lake of Neil Harris has surveillance cameras everywhere. The police and the FBI do not check the footages along the almost thirty days she claimed to be kidnapped. The police officers do not investigate how she could have a stiletto to kill Neil. She leaves the hospital covered in blood. Last but not the least, who would live with a psychopath and assume someone else's baby? My vote is six.Title (Brazil): \"Garota Exemplar\" (\"Exemplar Girl\")"
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw3651256",
      "warningSpoilers": false,
      "date": "1 March 2017",
      "rate": "7",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Captures Most Of The Book's Bizarre Mystery",
      "content": "Its a little tough for me to watch/review \"Gone Girl\" seeing as how I had already read the book. For a plot that relies heavily on surprise and misdirection, I already knew what was going to happen, and that obviously makes it a different viewing experience. I was very impressed, however, by how the film was able to capture the basic essence of the Gillian Flynn novel (maybe it helped that Flynn wrote the screenplay herself!).For a basic plot summary, \"Gone Girl\" tells the story of Nick Dunne (Ben Affleck) and his wife Amy (Rosamund Pike). One day, Nick comes home and finds his home a crime scene and his wife gone. Lead investigator Rhonda Boney (Kim Dickens) immediately suspects Nick, whose Ivy League nature and shadowy past make him seem like a viable candidate for the crime. Despite initial support from sister Margo (Carrie Coon) and Amy's parents (played by David Clennon & Lisa Banes), the case against Nick seems to keep getting worse and worse. Could he really have killed his wife?This movie excels in a number of different areas. Flynn is able to seamlessly move the plot from book to screen (no easy task) while still retaining its creepy nature and haunting themes. The casting is also spot-on. Affleck is playing practically the role he was born for (good-looking suave guy who may just be a complete slimeball) and Pike is similarly perfect in her own way. I can see why this one was nominated for a number of Academy Awards.Of course, probably the hallmark of \"Gone Girl\" is that besides spinning a great mystery, it also provides some subtle (or not-so-subtle) commentary on the institution of marriage. I wish I could say more, but to do so would be the ruin the surprises for those who haven't seen it yet. For lovers or young newlyweds watching this movie, I can easily see it producing either deep conversation or very awkward moments.Why not a five-star rating? Well, my exact ranking would be 4.5 stars. I have to go the other direction, however, primarily because I HAVE read the book previously. If there is one thing that doesn't transfer over it is a little bit of the deep commentary on relationships in general. \"Gone Girl\" is a psychological thriller, so some of that is probably better examined in the slower pace of the novel. While reading the book, I was completely sucked in and entranced. Most of that carried over into this film, but not necessarily ALL of it.Of course, I can easily see someone who doesn't know the plot ranking this a five-star effort all the way. It manages to tell an individual mystery filled with over-arching themes about relationships and marriage. A truly haunting tale."
    },
    {
      "username": "LiamCullen6",
      "userUrl": "https://www.imdb.com/user/ur39229604",
      "reviewLink": "https://www.imdb.com/review/rw3169979",
      "warningSpoilers": true,
      "date": "25 January 2015",
      "rate": "10",
      "helpful": "368 out of 530 found this helpful.",
      "title": "Shock and Awe",
      "content": "How on earth is this film attracting so much criticism?! This is one of the best films of 2014 and people are labelling it \"utter tripe\", \"an enormous heap of illogic and nonsense\", \"wish I had missed it\". Are these people serious? Can we no longer appreciate - or even identify - a great film?!Gone Girl is a peerless plot-driven story about a wife who goes missing. Seems pretty ordinary, right? Well it's not. And it doesn't take very long at all for any sane viewer to recognise this. You start watching and - as you do with any mystery - you start collecting the clues and piecing together an explanation for the events which have taken place. But no sooner than you have formed the perfect explanation in your mind is it immediately swept away in the most overwhelming twist of the year. And it only gets better from there.Gone Girl is a roller-coaster; only you're riding it in the dark. You don't know where the next turn is, you can't see where you're headed, and you have no idea how many more ups and downs you're going to experience before it's all over. It's a film that keeps you guessing and just as you're beginning to (once again) think you've got it all figured out, the game changes and it's all up in the air once more. The diary-exposition format is also very clever and was executed perfectly. Many films fall victim to losing the viewer when jumping back and forth between past and present, yet Gone Girl - you guessed it - does it just right.This film ranks high in the mystery/thriller genre. It is just as compelling and perplexing as Shutter Island - if not then moreso. And let's not forget: the acting. Ben Affleck and Rosamund Pike do a phenomenal job in their roles as husband and wife. Not a line feels out of place and both seem as though they were born to play Nick and Amy Dunne. By the end of the film I felt so immersed in their story that I found it hard to believe it was just a film. All in all, I for one am thoroughly pleased with Gone Girl. I knew from watching the trailer it would be something I would like, I just never imagined it could thrill me this much.A very underrated and overwhelming story that should be enjoyed by all."
    },
    {
      "username": "avik-basu1889",
      "userUrl": "https://www.imdb.com/user/ur54999105",
      "reviewLink": "https://www.imdb.com/review/rw3144276",
      "warningSpoilers": false,
      "date": "19 December 2014",
      "rate": "9",
      "helpful": "173 out of 263 found this helpful.",
      "title": "All the world's a stage, and all the men and women merely players !!!!!!",
      "content": "I have always been a huge admirer of David Fincher. He is undoubtedly one of the most consistent and masterful storytellers in modern cinema. I also think when it comes to dark, disturbing thrillers, there is very few who can match the directorial skills of Fincher. Like many of his previous films, Gone Girl is a very long film, but in a true Fincher-esque fashion, it is as engaging as possible without any scope for the viewer to feel bored. The pacing is perfect. The scenes have a dreamy style to it, which brings the dilemma of \"whether this is a true account of things or has this been made up by the narrator.\" The theme of the film is the fact that humans at the basic level are all actors and pretenders. Very seldom do we decide to be our real selves. Generally all of us put on a mask to make ourselves look good in front of the general public and also to pretend to be the person that our nearest and dearest want us to be. Gillian Flynn's screenplay based on her own novel is brilliant and it is also a damning indictment of how media can shape and mould mass perception and it is also a cynical account of the institution of marriage.Ben Affleck is good, Tyler Perry is good, but this movie from an acting perspective belongs to Rosamund Pike. She owns every scene that she is in and delivers an Oscar-worthy performance.Fincher has once again has made a fantastic film. The last 30 minutes might not be completely logical, but it is still symbolic. If you are about to get married,stay away from Gone Girl."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3098363",
      "warningSpoilers": false,
      "date": "4 October 2014",
      "rate": "9",
      "helpful": "42 out of 64 found this helpful.",
      "title": "Another David Fincher winner and one of the year's best",
      "content": "David Fincher to me is one of the most talented directors around today, and while Se7en from personal opinion is his best film Gone Girl is up there with his best. Fincher directs with his usual superb class, giving the film great style and keeping the story alive(Gone Girl is easily one of the year's best directed films), and the whole film looks absolutely great with brooding lighting that evokes the creepy atmosphere brilliantly and Gone Girl is also a film that makes good use of digital, after seeing many directors over-using or cheapening it it was refreshing to see the technique done with taste. Trent Rezner and Atticus Ross's music score gives the film a haunting vibe and adds much to the unsettling intensity that a lot of the film(at least two-thirds worth), managing to not do it in an in-your-face manner. The use of sound mixing was interesting and came off cleverly, almost like a distant thought process. Gone Girl also has a brilliantly written and adapted script that does a great job balancing dark humour- that's not overused and is often hilarious- and suspense mystery (The Cool Girl monologue in particular is a masterpiece of script-writing, one of my favourite film monologues ever), while the story(apart from taking a bit of time to get starting) is absorbing from start to finish, rich in detail and characterisation and is filled with shocks and unpredictable twists that will be guaranteed to leave you reeling. That it is adapted from superb source material(one of the best books I've read in recent memory actually) helps it, and that it is faithful to it is commendable, a case of being faithful to the source material actually coming off wonders rather than being bogged down by being too faithful. The not-what-they-seem characters are incredibly interesting and richly developed, especially Amy who is one of the most chilling female characters of the year. And the acting is one of the high points of the film, as good as Fincher's direction and the score are it's Rosamund Pike's knockout turn as Amy in restrained- she only has to raise an eyebrow or something like that and it says a lot- but quite terrifying mode(especially in the third act) that makes the film. It will be a great surprise if she isn't at least nominated because it is easily her best performance. Ben Affleck has the other not-what-they-seem role and plays it with oozing charm and brooding intensity, while Neil Patrick Harris surprisingly excels in a very against-type role(who knew he could be sinister?) and Tyler Perry oozes charisma and is very funny. Carrie Coon is the standout in support, it's a tricky role and the moral compass of the film but Coon is touchingly likable in it. The ending does for my liking end too suddenly and the storytelling got implausible and lazy at this point, but apart from that Gone Girl was a winner and one of the best of the year. 9/10 Bethany Cox"
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw3181551",
      "warningSpoilers": true,
      "date": "11 February 2015",
      "rate": "5",
      "helpful": "26 out of 37 found this helpful.",
      "title": "This is what the fuss was about?",
      "content": "The more time passes since finishing \"Gone Girl\", the more the aftertaste worsens. It did its job in keeping me guessing until the final credits, but with that bloated running time and those levels of hype, that can't be all it set out to do, right? Affleck and Pike are playing such bland characters that I didn't care what happened to either of the Dunne party. I cared far more for Carrie Coon and Kim Dickens, who were unquestionably side players. Neil Patrick Harris was just a plot device to get -SPOILER- Amy to return home and reveal that she was alive.Sure, Amy Dunne is a sociopath for the ages, but she's a terribly draw character. This is all very hollow, like some big-budget Lifetime movie.No, thank you.5/10"
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw3160179",
      "warningSpoilers": false,
      "date": "11 January 2015",
      "rate": "3",
      "helpful": "42 out of 63 found this helpful.",
      "title": "Real gone",
      "content": "Hate to burst the bubble (IMDb top 250, average mark over 8), but I just didn't get this David Fincher thriller at all. With its combination of unsavoury lead characters, jaundiced view of television reporting and fantastical plotting, I found it unengaging, unbelievable and I'm sure many more \"un's\" I could think of if I put my mind to it.I'm guessing the main theme here could be the unravelling of a modern marriage in the face of the recession but no, on consideration it just seems like another study by director Fincher of a psychopath. Just what the movies need today. Nothing is credible here, the relationship between brother and sister, the husband's casual attitude towards his wife's unexplained disappearance, his revealed-out-of-nowhere fling with one of his class students, the wife's misadventure with trailer-park trash, her jilted high-school lover-become-Howard Hughes who gets a poor reward for his admittedly somewhat possessive assistance to her at time of need (seems to me she should have gone after the two who rolled her at the caravan park rather than her ill-fated worshipper). If you're wondering how these random sounding events link together, then, even after watching the movie, so am I. It takes forever to reach a conclusive act of bloody violence which even then isn't worth the wait.As for the acting, it was no big deal. Ben Affleck looks and acts like a slobbish Hugh Grant and to be honest does so with about as much depth as the Englishman. Rosamund Pike wants us to think she's a latter-day Hitchcock mystery-blonde but she can keep wanting. Almost the only things I liked about the film were Trent Raznor's atmospheric soundscapes in the background and the fluid camera-work throughout.Otherwise, for me this was a major disappointment and demonstrated no real progress in the genre by this \"name\" director going back to \"Se7en\". The emperor's new clothes methinks."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw4030149",
      "warningSpoilers": false,
      "date": "11 January 2018",
      "rate": "7",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Gone but not forgotten",
      "content": "Gone Girl features an astonishing performance from British actress Rosamund Pike as a former New York socialite Amy Dunne who one day suddenly disappears on the day of her fifth wedding anniversary.Her husband Nick Dunne (Ben Affleck) becomes a suspect, the media circus descends and demonise him, neighbours turn on him and skeletons pop out from his cupboard but not his wife's body. As Missouri has the death penalty and Amy's diaries reveal an unhappy marriage, Nick needs the aid of an ace criminal attorney.The film has a tangled plot because it has an unreliable narrator. What starts as a missing person's case becomes more complex, as Nick fights for his liberty we find out what really happened to Amy.Director David Fincher directs a muscular taut thriller with dark comedy elements. It does have flaws especially with the supposed abduction part involving Neil Patrick Harris's character which does not come across as plausible."
    },
    {
      "username": "CalRhys",
      "userUrl": "https://www.imdb.com/user/ur24740649",
      "reviewLink": "https://www.imdb.com/review/rw3101049",
      "warningSpoilers": false,
      "date": "8 October 2014",
      "rate": "",
      "helpful": "477 out of 748 found this helpful.",
      "title": "Dark And Twisted, Full Of Great Visual Storytelling",
      "content": "Dark and twisted, David Fincher's stylish new mystery thriller was derived from Gillian Flynn's intriguingly slick tale from her complex and suspenseful novel. By far one of the best acting performances to have come from Ben Affleck, 'Gone Girl' boasts some strong yet disturbing portrayals from Rosamund Pike, Neil Patrick Harris, Tyler Perry and Affleck. Fincher has garnered fame and recognition as a mainstream director, that is not only able to engulf the audience within the picture, but actually make them part of the scenario. Fincher exercises upon his trademarks with the swift and stunning cinematography, the chilling score and tight editing, all of which makes 'Gone Girl' a movie full of great visual storytelling."
    },
    {
      "username": "moonspinner55",
      "userUrl": "https://www.imdb.com/user/ur0989035",
      "reviewLink": "https://www.imdb.com/review/rw3210646",
      "warningSpoilers": false,
      "date": "29 March 2015",
      "rate": "4",
      "helpful": "32 out of 50 found this helpful.",
      "title": "Cyphers and story holes...",
      "content": "\"Gone Girl\" is so smoothly-filmed and staged and acted, a less-seasoned moviegoer is apt to come away from the picture with nothing but admiration and praise. An upscale married couple in New York City hits a financial bump and ends up living with the husband's family in Missouri (in an equally beautiful home, by the way). After a few years, with the relatives now deceased, the couple's marriage unravels and, before long, the wife turns up missing (their glass table is shattered and police find a mopped-up bloodbath in the kitchen). Adapting her own novel, screenwriter Gillian Flynn sets up an intriguing first-half, with the benumbed (and unfaithful) husband at first courted and then reviled by the ever-present media. But the second and third acts of the film are where it runs into trouble, ignoring story holes and stumbling over plot-points. The final scenes, which are dragged out interminably by director David Fincher, are so static and unconvincing as to be ridiculous, mitigating his fine work in presenting this lurid tale (the picture ends up being all about presentation and little else). The central couple (Ben Affleck and Rosamund Pike) are thoroughly unlikable, detestable people, while most of the supporting characters (with the exception of a likably dry police detective played by Kim Dickens) are equally appalling. There is really nothing in \"Gone Girl\" to engage our interest except for Fincher's jagged, nasty way in telling a juicy story--but here, the juice leaks out early. ** from ****"
    },
    {
      "username": "dierregi",
      "userUrl": "https://www.imdb.com/user/ur1090944",
      "reviewLink": "https://www.imdb.com/review/rw3184999",
      "warningSpoilers": true,
      "date": "16 February 2015",
      "rate": "1",
      "helpful": "62 out of 101 found this helpful.",
      "title": "If you are blonde and beautiful the police will believe everything you say",
      "content": "Gone Girl is based on convoluted premise: a psychotic plot to frame somebody for your murder. This deranged idea is not popular for movie plots and could have been worth exploring. It was developed much better in the great film noir \"Leave her to heaven\", where the framing was done in a subtler way. But we do not live in subtle times, so here we get plenty of gore and graphic violence.For the few who still do not know the plot, the story is about unhappy couple Amy and Nick. Ben Affleck, woody and expressionless as usual, is creepy Nick the unfaithful husband. During the first half hour he is - quite convincingly - the main suspect for the disappearance of Amy.Beautiful Rosamund Pike is psycho crazy wife Amy, a woman with a demented agenda and several loose screws. She manipulates every man she meets. At the end of the movie, even FBI detectives are more than happy not to open an investigation on her crimes, just because she is a beautiful blonde and they believe everything she said.Amy's plotting is given away much too soon in the movie, so we spend two very long hours just following around the demented blonde while Nick gets in big trouble, only for Amy to resurface and deciding to spend the rest of her life with the husband she wanted to see executed.Does it make much sense? Apparently yes, since critics (and lots of IMDb users) loved it."
    },
    {
      "username": "johaschrei",
      "userUrl": "https://www.imdb.com/user/ur54587081",
      "reviewLink": "https://www.imdb.com/review/rw3233337",
      "warningSpoilers": true,
      "date": "6 May 2015",
      "rate": "7",
      "helpful": "196 out of 231 found this helpful.",
      "title": "Good movie, reflecting witch hunt mentality in social media/TV",
      "content": "I never wrote a review before in my life so please excuse my poor attempt, but after reading some of the reviews I just felt I had to give it a try.I really thought this movie was very good. It's starts as the typical \"missing wife, husband main suspect, no body yet found\" tale we all have seen once in our lives. But after the first act it really gets extremely unsettling and special. I felt sick in between because of the horrible, frightening character of Amy. I can't describe it any further and think you should simply give it a try.SPOILERS!!!!I now would like to address certain plot holes many people have been pointing out. First of all, every movie has plot holes. I'm usually the first to notice, and even though there were some things that bothered me I got over them quite quickly since the movie had a tight grip on me.Many are mentioning to different cameras in Desis house. First of all I know that many surveillance cameras overwrite their data after some time, so it is very likely that only the last few days (where she never left or entered the house) would be available to the police. Second of all, as far as I could see, the cameras only showed the outside of the house not what was happening IN the house. That's why she went near the window, which was within the perimeter of one of the cameras, to do her screaming attack. If you pay attention, you never see Amy appearing on any of the cameras when she checks them, only when she actually wants to be seen.I could address many other so called \"plot holes\". I don't think they actually were plot holes per se, but made intentionally in order for us watchers to go...\"But wait, how does she get away with this??\". Think of the police officer who is in doubt of Amy's statements or even the lawyer.What Fincher in my opinion wanted to demonstrate is the exemplary control Amy had over the public, were no questions were asked, nobody ever doubted her. It is kind of symbolic for witch hunts we ourselves have witnessed on TV or social media, were no second opinion is sought, nobody looks at the story from a second angle. Amy is the personification of the American Sweetheart, and is treated as such. It just shows us how blind and angry the crowd gets when you push certain buttons, Amy herself actually talks about that in the car scene. The pregnant intelligent wife, who was cheated by her husband. Or the poor girl next door who was always nice to the strange kid. Or the rich guy who thought he could have everything. That is basically the story and that's why this film is so intriguing in my opinion. It's a mirror of how our society in the age of internet, social media, TV etc. functions. How we can be tricked into anger or sadness, and how little people actually question certain statements."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw4039367",
      "warningSpoilers": true,
      "date": "21 January 2018",
      "rate": "6",
      "helpful": "21 out of 33 found this helpful.",
      "title": "Fincher makes this worthwhile",
      "content": "GONE GIRL is another epic-length feature from director David Fincher, in which he gets into the nitty gritty of the material like few other directors can. This one's based on a bestselling novel about a wife's disappearance in which the finger of suspicion falls on her own husband. It's a good whodunit-style mystery which twists and turns throughout and keeps you surprised with some unpredictable moments, but I did find it rather long-winded and suffering from a lack of likeable characters. In Fincher's hands it's an enjoyable film, and it's certain that both Ben Affleck and Rosamund Pike rise to the occasion to deliver lots of intense character moments. But at the same time I didn't really feel anything about what I was watching, and some of the moments feel very artificial and contrived, as if they could only come from a writer's mind rather than happen in real life."
    },
    {
      "username": "trublu215",
      "userUrl": "https://www.imdb.com/user/ur28528605",
      "reviewLink": "https://www.imdb.com/review/rw3096677",
      "warningSpoilers": false,
      "date": "1 October 2014",
      "rate": "10",
      "helpful": "431 out of 764 found this helpful.",
      "title": "If Fincher was looking to out do himself...he has succeeded.",
      "content": "Gone Girl marks Fincher's tenth feature film and his most mature work since Fight Club. Centering on Nick Dunne, a husband desperately trying to find his wife all while having police and media accuse him of murder. The story sounds straight out of the Scott Peterson case and the film looks unlike any film I've seen in recent years. Lead by an all star cast featuring Ben Affleck, Rosamund Pike, Tyler Perry and Neil Patrick Harris, Gone Girl rises above the pack with smart storytelling, phenomenal pacing and perfect performances. What Gone Girl does so brilliantly is taps into the audience's psyche regarding marriage and the ideology behind a sanctioned union that is corrupt. It is really heavy stuff when the story really gets to the meat and bones of it all. With plenty of twists and turns, Gone Girl keeps you, not only second guessing the whole idea of marriage, but the intentions of every character in the film. It is truly one of the most twisted films adapted from an even sicker and twisted book that's out there right now. Gillian Flynn does wonders with her adaption from her own novel. The dialog is crisp, the characters are multi-layered, it truly is a pitch perfect script that doesn't have one false moment in it. Ben Affleck and Rosamund Pike are EXCELLENT in this film. This is a different Affleck, a very human and realized Affleck. Nick Dunne is a wonderful role for him and captivates just how good he can be with a terrific director. Harris and Perry give well rounded performances as well but are nothing compared to Affleck and Pike. David Fincher and his long time collaborator and cinematographer, Jeff Cronenweth create a dreary, horrific tone for Gone Girl that makes every twist and turn that much more gut wrenching. Every shot is meticulously planned, showing each shot as if it were a still frame that spoke a thousand words. It is truly gorgeous filmmaking. And now for the score...Trent Reznor and Atticus Finch deliver a perfect score, besting their Social Network and Girl with the Dragon Tattoo score. If Reznor won for Social Network, I fully expect not only a nomination but a win for this film. Overall, this is a mesmerizing film that demands multiple viewings to truly get the full experience. It is impeccably made, beautifully acted and an all around near perfect film."
    },
    {
      "username": "mellotr",
      "userUrl": "https://www.imdb.com/user/ur109718748",
      "reviewLink": "https://www.imdb.com/review/rw5242871",
      "warningSpoilers": true,
      "date": "8 November 2019",
      "rate": "6",
      "helpful": "71 out of 99 found this helpful.",
      "title": "It's all over the place!",
      "content": "I love a good Thriller, and when theirs a really good one, it's a smart movie for the people who analyze the movie and didn't see the end coming, and continues to make you think. This movie falls way behind in that category. Really? Ben couldn't have just walked out? Court order for DNA of the \"Baby\"? Their are so many holes on how she tried to frame him, I could rate this as Swiss cheese. It was interesting at times, and you did want to see what happens next. However that lead to a anticlimactic ending. It's to bad it had a lot of potential."
    },
    {
      "username": "Danusha_Goska",
      "userUrl": "https://www.imdb.com/user/ur2366009",
      "reviewLink": "https://www.imdb.com/review/rw3099813",
      "warningSpoilers": true,
      "date": "6 October 2014",
      "rate": "2",
      "helpful": "138 out of 250 found this helpful.",
      "title": "Cheap, Contrived, Exploitative",
      "content": "\"Gone Girl\" is a contrived, exploitative, pretentious film that aims for the middlebrow audience and hits its mark. The filmmakers insert – no pun intended – a sex scene every ten minutes or so, and alternate those with buckets-of-blood scenes of violence, and utterly predictable flashlight searches for clues of a Nancy Drew level of sophistication. If you want to see someone stabbed to death while climaxing during sex and bleed out like an upside down pig, this is the film for you. The dialogue is pseudo-clever. Example: a man compliments a woman seated at a table full of strangers by informing her that she has a \"world-class vagina.\" She smiles girlishly. The film is capped up with a plot twist so implausible it blasted me right out of the movie onto the moons of Jupiter by the author's straining, sweating, thuddingly manipulative hand. And then the movie piles on the single most unbelievable ending I have ever seen. There are movie surprises that rearrange the furniture inside your head and make you shout, \"Oh! Of course! How could I not have seen that? Now everything makes so much more sense!\" The best such surprise is in the film \"Sixth Sense.\" \"Gone Girl\" surprises you by showing how desperate a writer can get.Warning: The rest of this review will reveal the ending of \"Gone Girl.\" If you don't want to know the ending of \"Gone Girl,\" stop reading now. Nick (Ben Affleck) is married to Amy (Rosamund Pike). They live in Missouri, the show me state. Amy disappears and Nick is under suspicion. Did he kill her? So, now, you are thinking that \"Gone Girl\" will explore the interesting question we all ask when beautiful young women disappear and their husbands are suspected of murder. Those questions are: How could a loving marriage go so wrong? How could a marriage look perfect on the outside and be rotten on the inside? How could a loving husband murder his own wife? Does our 24/7 media coverage encourage us to form lynch mobs? Forget it. \"Gone Girl\" explores none of this. Nick had cheated on Amy with one of his students. Hurt, Amy faked her own disappearance. Amy is incredibly beautiful, the star of a series of children's books, a sexual Tantric master, a psychopath, and a criminal mastermind. Heck, the filmmakers may as well just added invisibility, flight, and the ability to conjugate Polish verbs at will to Amy's list of superpowers. She is that unbelievable. Amy just wants to hurt Nick, because he hurt her. So she flawlessly fakes her own murder. Amy seeks shelter from Desi, an old boyfriend, Neal Patrick Harris, whom she had accused of stalking her. Desi makes Amy his virtual prisoner in his lake house. He, too, is a criminal mastermind, psychopath, and Tantric sex master, and his lake house is carefully designed to prevent Amy from escaping from their hot sex, good food, and discussions of opera and philosophy. You had no idea Missouri was this interesting, did you? You'll never call it \"flyover country\" again, will you? Amy stabs Desi when he is climaxing during their hot sex. Buckets of blood gush out of him. The director wants you to see all this – this is what you bought your ticket for, is it not? Certainly not for intelligence or heart. Amy returns to Nick. No one bothers to indict Amy for Desi's murder, because she is incredibly beautiful, famous, and a criminal mastermind. And because the plot of this movie holds together like a wet Kleenex. Nick knows that Amy is a murderer and that she attempted to frame him for her murder and only returned after that went wrong. Nick hates and fears Amy. And Nick stays with Amy, as her husband. The End. I think the author of \"Gone Girl\" was trying to use flamboyantly exaggerated premises to comment on a few themes: none of us can fully understand what keeps marriages together, women are terribly hurt by infidelity, beautiful women can use manipulation and sex to get what they want in life. All of these themes are genuinely interesting, and good art inspired by them is compelling. I kept thinking of \"The Country Girl,\" a brilliant treatment of a complex marriage that outsiders don't understand. TV coverage of the Laci Peterson murder was ten times more watchable, interesting, and educational than the idiotic \"Gone Girl\" could ever hope to be. \"Body Heat\" was a hundred times better as a depiction of a hot blond wrapping a big, dumb, handsome guy around her finger. And \"Body Heat\"'s plot twist leaves \"Gone Girl\" in the dust. Ben Affleck's broad shoulders and chest look really good here. His acting is vapid, absent, and clueless, appropriate to the part of a man manipulated by a woman. Rosamund Pike's performance as a human who could never actually exist is good. Basically, she's playing a Star Trek space alien, and she does it well. The excellent Tyler Perry is wasted."
    },
    {
      "username": "BoxOfficeKid",
      "userUrl": "https://www.imdb.com/user/ur11174645",
      "reviewLink": "https://www.imdb.com/review/rw3145404",
      "warningSpoilers": true,
      "date": "21 December 2014",
      "rate": "10",
      "helpful": "265 out of 394 found this helpful.",
      "title": "Slow burner with a twist for the ages. Fincher does it again.",
      "content": "The first act of the movie is the run-of-the-mill wife gone missing, the husband accused of killing her plot. This is clearly established in the theatrical trailer and may have thrown off some potential viewers. To the people who are familiar with David Fincher's work, this is not the case with Gone Girl.Yes, the first act is very ordinary, but the second act uproots whatever ever considered dull about the movie as it takes a rapid turn into thriller stardom, resembling something taken out of a Hitchcock movie. Only a handful directors can completely enhance the movie's narrative through editing, and Fincher is one of them. I know there is a lot of praise around Rosamund Pike's performance, which makes it easy to overlook Ben Affleck. He plays the tired, oblivious and boyish really well. This may be the very reason why he is completely overlooked.And in a time of sequels, prequels, remakes and biopics, finally a contemporary piece of work! Stellar!"
    },
    {
      "username": "Serge_Zehnder",
      "userUrl": "https://www.imdb.com/user/ur0121776",
      "reviewLink": "https://www.imdb.com/review/rw3092875",
      "warningSpoilers": true,
      "date": "24 September 2014",
      "rate": "8",
      "helpful": "285 out of 489 found this helpful.",
      "title": "The Horrors of Domesticity",
      "content": "The basic premise is as old as the movies.An abduction leads to a media-circus.Nick Dunne (Ben Affleck) comes home one day to find his wife Amy (Rosamund Pike) missing. The ensuing search and all the subsequent events, which shall not be revealed here, draw the viewer closer and closer into a complex world of everyday suburban reality and everyday suburban horror.As if it needed to be pointed out, this balance of reality and horror, or horrendous reality, is the domain of Mr. Fincher. In his clear-cut no-nonsense style he has fashioned a powerful mystery-thriller that lands somewhere between Hitchcock, Lynch, Bergman and Chabrol. Although vastly different directors, they have shared an interest in dissecting reality and human nature.Profiting from two exceptional lead actors (doubts about Mr. Affleck's acting abilities will hopefully be dispelled), it is Ms. Pike, who reveals herself as an immensely versatile and unpredictable force in this movie. Over more than ten years Ms. Pike has played big parts in small movies, or small parts in big movies (such as Pride & Prejudice\", Wrath of the Titans\" or Jack Reacher\"). Under the guise of Mr. Fincher she excels in every aspect and if any contenders for awards are to be named so early in the season, hers would be one of the first names (next to the outstanding cast of Richard Linklaters Boyhood\") to be written down.Visually stunning as one would expect from Fincher, with an immersive soundtrack by Trent Reznor & Atticus Ross and an editing rhythm that cuts like a knife through the tissue of the story and its characters, Gone Girl\" leaves no doubt about its craft and the deceptive nature of its source novel by Gillian Flynn. The author adapted her book into a tightly wound screenplay, that adds fuel to an already burning analysis of modern marriage and human frailty.The themes are familiar to Fincher, but he assembles them in an expertly fashion. And we are left wondering, amidst the suspense, about many of the so called estimable American values of the 20th century, that have now come crashing down under the weight of an economic, political and spiritual crisis."
    },
    {
      "username": "eddie_baggins",
      "userUrl": "https://www.imdb.com/user/ur8462477",
      "reviewLink": "https://www.imdb.com/review/rw3097383",
      "warningSpoilers": true,
      "date": "2 October 2014",
      "rate": "10",
      "helpful": "85 out of 165 found this helpful.",
      "title": "Fincher has done it again! A brilliant thriller with outstounding acting turns",
      "content": "As if it wasn't safe to say already, but after Gone Girl there is little doubt or argument to be made against the fact that David Fincher is one of the most consistently great directors working in the industry today, for Fincher's latest efforts behind the camera with this meticulously made, perfectly paced and often thrilling story is movie-making of the highest order. Gone Girl (exactly like it's source text) is a mystery/thriller that steadily morphs into what can equally be described as a darkest of dark comedy, a searing account of married life and an edge of your seat police procedural, all elements that combine to create one of the year's best films. Fincher from day one has shown an uncanny ability for visual atheistic, haunting and atmospheric surrounds and with the help of his composers (this time once more teaming up perfectly with Trent Reznor and Atticus Ross) finely moulded musical accompaniments and Gone Girl shows off all these skills once more. The suburban surrounds of the world of Gone Girl shun the safety in numbers feel that they provide these residents; it's not dissimilar to a world akin to Blue Velvet where beneath the grassy exteriors lies deep seeded secrets that threaten to tear at the seams of idealistic marriages and those double lives we people lead. Fincher relishes every element of Gone Girl from the mysteries through to the reveals and like only a handful of movies each year this project feels like the perfect meeting of subject and maker who meet in synch to create such a finally tuned product. Fincher really has become the master of the thriller genre, much like Scorsese with his mob pictures and after Seven, Fight Club, Zodiac, Girl With the Dragon Tattoo and now Gone Girl, there is a legacy to his directional work that will forever be hard to match much like Fincher's continued fine work with his actors. Much noise was made initially by rabid fans of Gillian Flynn's source novel about the casting of leads Ben Affleck and Rosamund Pike as Nick and Amy Dunne but after witnessing first hand one of the year's best double acts by the two on form actors there will be little doubt that the casting choices were staggeringly spot on. Affleck is at his polarising best at Nick Dunne a man we as an audience are unsure of, do we like this man or do we loathe him? It's refreshing to see Affleck put in such an assured turn, from inappropriate smiling through to outright rage, Affleck's turn is an award worthy one that in a less standout year for the male acting category would be a turn featuring strongly come February. While Affleck once more showcases a talent we all know he has, the breakout turn from Rosamund Pike is the films largest revelation. Finally given a chance to chew through not only a high profile but layered role, Pike excels as the \"amazing\" Amy at the centre of this twisted and depraved tale. Pike truly creates one of not only the years but modern day cinemas most memorable and unique leading ladies, a creation who at any given time can be compelling, outrageous, disgusting and calculated, it really is a stunning turn to witness and it would be unwise to suggest that Pike isn't now head and tails ahead in the female acting awards circuit. Surrounded by quite amazing supports from Kim Dickin's dogged detective Rhonda Boney, Carrie Coon as Nick's twin sister Margo, Tyler Perry (proving there's more to the man than Magdea's fat suit) as high profile lawyer Tanner Bolt and Barney Stinson himself Neil Patrick Harris in a box cutter sharp turn as creepy rich man Desi Collings, Pike and her on screen hubby Affleck are encompassed around by one of the years strongest ensembles. Without spoiling any of Gone Girl's many varied and unexpected twists and turns (this is the type of movie best seen with as little knowledge as possible), this is a movie thriller of the highest order that shouldn't be watched by those expecting an everyday murder/kidnapping mystery, for what transpires throughout this tale is anything but your run of the mill narrative. One of the most involving movies of recent memories, Gone Girl is bitingly funny, white knuckle tense, starkly violent and as we've come to expect from Fincher, quite brilliant. Gone Girl is without question one of the year's best films, one of the year's most unique films and one of the films of this year that you can't dare to miss. 5 Gummy Bears out of 5"
    },
    {
      "username": "Stephan_fr",
      "userUrl": "https://www.imdb.com/user/ur96504282",
      "reviewLink": "https://www.imdb.com/review/rw6175426",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "5",
      "helpful": "21 out of 32 found this helpful.",
      "title": "Gone girl is actually good???",
      "content": "That's pretty much what 99% of movie buffs will wonder when they see the meta score on imdb for this thriller. It's actually decent, maybe even good?Well, it really depends on where you're coming from - if you're a finsher fan, and you were expecting something on par with the amazing, genre-busting fight club, I have bad news: this is a well constructed thriller but nothing special. A particularly long VO exposition sequence mid-movie seriously ruins this film chances at greatness.On the plus side, if you need something to keep yourself distracted on a rainy saturday, this isn't bad at all.The problem really is that the characters are paper thin, especially the wife, and I'm told that this is a major shift away from the complexity and subtlety of the book it's adapted from. Everything that happens in the movie is telegraphed 15 minutes ahead. Everything.Some have said the movie is a critique of feminism - nonsense. The movie is a critique of media circuses and mob mentality. But while it maintains a nice balance in the form of Afflek's character flaws, it doesn't offer the same when it comes to his wife.Performances are fairly subpar by the way - at some point one character jokes they feel like in a 'law and order' episode and well, not sure if it was intended to be so meta , but it hits the nail right on the head."
    }
  ],
  "errorMessage": ""
}