{
  "imDbId": "tt2267998",
  "title": "Gone Girl",
  "fullTitle": "Gone Girl (2014)",
  "type": "Movie",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Gone Girl (film)",
  "url": "https://en.wikipedia.org/wiki/Gone_Girl_(film)",
  "plotShort": {
    "plainText": "Gone Girl is a 2014 American psychological thriller film directed by David Fincher and written by Gillian Flynn, based on her 2012 novel of the same name. It stars Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, and Carrie Coon. In the film, Nick Dunne (Affleck) becomes the prime suspect in the sudden disappearance of his wife, Amy (Pike) in Missouri.\r\nGone Girl premiered as the opening film at the 52nd New York Film Festival on September 26, 2014, and was theatrically released in the United States on October 3, 2014 by 20th Century Fox. It was a critical and commercial success, grossing $369 million worldwide against a $61 million budget, to become Fincher's highest-grossing film. It is considered a postmodern mystery.\r\nPike's performance was widely acclaimed by critics, and she received nominations for an Academy Award, BAFTA Award, Golden Globe Award, and Screen Actors Guild Award for Best Actress. Additional nominations included a Golden Globe Award for Best Director for Fincher and Golden Globe Award, BAFTA, and Critics' Choice Award nominations for Flynn's adapted screenplay, which won at Critics' Choice.",
    "html": "<p>Gone Girl is a 2014 American psychological thriller film directed by David Fincher and written by Gillian Flynn, based on her 2012 novel of the same name. It stars Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, and Carrie Coon. In the film, Nick Dunne (Affleck) becomes the prime suspect in the sudden disappearance of his wife, Amy (Pike) in Missouri.</p><p>Gone Girl premiered as the opening film at the 52nd New York Film Festival on September 26, 2014, and was theatrically released in the United States on October 3, 2014 by 20th Century Fox. It was a critical and commercial success, grossing $369 million worldwide against a $61 million budget, to become Fincher's highest-grossing film. It is considered a postmodern mystery.</p><p>Pike's performance was widely acclaimed by critics, and she received nominations for an Academy Award, BAFTA Award, Golden Globe Award, and Screen Actors Guild Award for Best Actress. Additional nominations included a Golden Globe Award for Best Director for Fincher and Golden Globe Award, BAFTA, and Critics' Choice Award nominations for Flynn's adapted screenplay, which won at Critics' Choice.</p>"
  },
  "plotFull": {
    "plainText": "Gone Girl is a 2014 American psychological thriller film directed by David Fincher and written by Gillian Flynn, based on her 2012 novel of the same name. It stars Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, and Carrie Coon. In the film, Nick Dunne (Affleck) becomes the prime suspect in the sudden disappearance of his wife, Amy (Pike) in Missouri.\r\nGone Girl premiered as the opening film at the 52nd New York Film Festival on September 26, 2014, and was theatrically released in the United States on October 3, 2014 by 20th Century Fox. It was a critical and commercial success, grossing $369 million worldwide against a $61 million budget, to become Fincher's highest-grossing film. It is considered a postmodern mystery.\r\nPike's performance was widely acclaimed by critics, and she received nominations for an Academy Award, BAFTA Award, Golden Globe Award, and Screen Actors Guild Award for Best Actress. Additional nominations included a Golden Globe Award for Best Director for Fincher and Golden Globe Award, BAFTA, and Critics' Choice Award nominations for Flynn's adapted screenplay, which won at Critics' Choice.\r\nPlot\r\nOn their fifth wedding anniversary, writing teacher Nick Dunne returns home to find his wife Amy missing. Amy's fame as the inspiration for her parents' Amazing Amy children's books ensures widespread press coverage. The media find Nick's apathy towards the disappearance suspicious.\r\nFlashbacks in the form of diary entries show a complex reality and a deterioriating marriage. Amazing Amy was an idealized completion of the real Amy's failures. Both lost their jobs in the recession and moved from New York to Nick's hometown of North Carthage, Missouri, to support his dying mother. Nick grew distant from Amy and began an affair with Andie, one of his students, while Amy became resentful towards Nick for uprooting her.\r\nDetective Rhonda Boney and the forensic team find poorly concealed evidence of struggle and profuse blood loss in the house. Boney learns of financial issues, spousal disputes, and Amy's recent attempt to buy a gun. Medical reports indicate Amy was pregnant, which Nick denies knowledge of.\r\nOn every wedding anniversary, Amy had set up elaborate treasure hunts for Nick. This year's clues appear in places where Nick had sex with Andie, thus revealing Amy's knowledge of his affair. Nick discovers thousands of dollars of items purchased with his credit card hidden in his twin sister Margo's woodshed. Amy's clues lead authorities to a half-burnt diary documenting her growing dread of Nick and ending with a genuine fear that he will kill her.\r\nThe audience then learns that Amy is alive and hiding in a campground in the Ozarks. After discovering Nick's affair, Amy conceived an elaborate plan to frame him for her murder. She had him ramp up her life insurance and secretly used his credit card to buy the woodshed items. She befriended a pregnant neighbor, told her stories about Nick's temper, and stole her urine to fake a pregnancy thus eliciting media sympathy after her disappearance. She wrote a diary with increasingly fabricated entries, and placed incriminating evidence in the treasure hunt spots for the police to find. On the morning of her disappearance, Amy drained and splattered her own blood across the kitchen, and cleaned it haphazardly. Her original plan was to drown herself after Nick's arrest, in order to ensure his death sentence.\r\nNick deduces Amy's scheme, convinces Margo of his innocence and hires lawyer Tanner Bolt, known for representing uxoricide suspects. Nick meets two of Amy's ex-boyfriends: Tommy O'Hara claims he was framed for rape by her after he ended their relationship; wealthy Desi Collings, against whom Amy had filed a restraining order for stalking, turns Nick away.\r\nWhen Amy's campground neighbors rob her, she calls Desi for help, convincing him that she fled Nick's abuse. Desi agrees to hide her in his lakehouse. Bolt convinces Nick to reveal his affair on a popular talk show, thus seizing the narrative initiative from the media. Andie reveals the affair at a press conference shortly before the show, but Nick insists on conducting the interview. He affirms his innocence and feigns regret for his shortcomings as a spouse, knowing that Amy will be watching.\r\nThe interview is a success, garnering widespread sympathy for Nick. However, Boney has already gathered enough murder evidence and arrests Nick and Margo. Bolt bails them out, and they brace for the impending trial. After watching Nick's interview, Amy rekindles her attraction to him and spends weeks crafting her escape story. Using lakehouse surveillance cameras and self-inflicted wrist and vaginal injuries, she makes it appear that Desi kidnapped and raped her. She then seduces Desi, slits his throat during sex and returns home covered in his blood, thus clearing Nick of suspicion.\r\nMedical examiners lend credence to Amy's story. During questioning, Boney probes her inconsistencies but Amy spins the focus onto her by calling her incompetent. The FBI believes Amy and closes the case, but nonverbal communication between both women renders Amy's guilt obvious to Boney. Upon returning home, Amy tells Nick the truth, admitting to Desi's murder. She states that the Nick pleading for her return on TV is the one she wants, and the one who inspired her forgiveness. Nick shares this with Boney, Bolt, and Margo, but they have no evidence and Bolt leaves.\r\nA televised interview takes place in their home seven weeks later. Anticipating Nick's intention to leave her and publicly expose her story, Amy reveals her pregnancy minutes before the interview, having inseminated herself with Nick's sperm from a fertility clinic. Nick reacts violently at first, but feels responsible for the child and ultimately decides to stay with Amy, despite Margo's despair. The \"happy\" couple announces on television that they are expecting a child.\r\nCast\r\nBen Affleck as Nicholas “Nick” Dunne, a professor\r\nRosamund Pike as Amy Elliott Dunne, Nick's missing wife\r\nNeil Patrick Harris as Desi Collings, Amy's wealthy ex-boyfriend\r\nTyler Perry as Tanner Bolt, Nick's attorney\r\nCarrie Coon as Margo \"Go\" Dunne, Nick's twin sister\r\nKim Dickens as Detective Rhonda Boney, the lead investigator on Amy's disappearance\r\nPatrick Fugit as Officer James Gilpin, Boney's partner\r\nMissi Pyle as Ellen Abbott, a cable TV host based on Nancy Grace\r\nEmily Ratajkowski as Andrea “Andie” Fitzgerald, Nick's mistress and student\r\nCasey Wilson as Noëlle Hawthorne, Nick and Amy's pregnant neighbor\r\nLola Kirke as Greta, a young woman Amy meets at the Ozarks campground\r\nBoyd Holbrook as Jeffrey “Jeff”, a flirtatious man Amy meets at the Ozarks campground\r\nLisa Banes as Mary Elizabeth “Marybeth” Elliott, Amy's mother\r\nSela Ward as Sharon Schieber, a network TV host\r\nScoot McNairy as Thomas “Tommy” O'Hara, another former boyfriend of Amy's\r\nScott Takeda as TV Producer\r\nDavid Clennon as Randall “Randy” Elliott, Amy's father\r\nKathleen Rose Perkins as Shawna Kelly\r\nProduction\r\nDevelopment\r\nGone Girl is a film adaptation of Flynn's 2012 novel of the same name. One of the film's executive producers, Leslie Dixon, read the manuscript of the novel in 2011 and brought it to the attention of Reese Witherspoon (who was originally slated to play Amy) in December of that year. Witherspoon and Dixon then collaborated with Bruna Papandrea to further develop the manuscript—with Flynn's film agent, Shari Smiley, they met with film studios in early 2012.\r\nFollowing the release of the novel in June 2012, the 20th Century Fox studio optioned the book in a deal with Flynn, in which the author negotiated that she would be responsible for the first draft of the screenplay. By around October 2012, Flynn was engaged in the production of the first draft while she was also involved in the promotional tour for her novel. Then a first-time screenwriter, Flynn later admitted: \"I certainly felt at sea a lot of times, kind of finding my way through.\"\r\nFlynn submitted her first draft screenplay to the Fox studio in December 2012, before Fincher was selected as the director for the project. Fincher had already expressed interest in the project, and after he finished reading Flynn's first draft, a meeting was scheduled between the director and author within days. Typically, authors are removed from film adaptations following the first draft and an experienced screenwriter takes over; but, on this occasion, Fincher agreed to work with Flynn for the entire project. Flynn later explained: \"... he responded to the first draft and we have kind of similar sensibilities. We liked the same things about the book, and we wanted the same thing out of the movie.\"\r\nAs further preparation, Flynn studied screenplay books and also met with Steve Kloves, who wrote the scripts for the Harry Potter series. Fincher also provided guidance and advised the author: \"We don't have the ability to gift the audience with the characters' thoughts, so tell me how they're behaving.\" During the production of the final screenplay, Fincher and Flynn engaged in an intensive back-and-forth working relationship: Flynn sent Fincher \"big swaths\" of writing, which he then reviewed, and Fincher would then discuss the swaths with Flynn by telephone. Eventually, some scenes were rewritten \"a dozen times\", while other scenes were unaltered.\r\nFollowing the release of the film, Flynn spoke of an overwhelming adaptation process, in which she tackled a 500-page book with an intricate plot; she explained that her experience working for a magazine meant that she \"wasn't ever precious about cutting.\" As a consequence of the distillation process, most of the parental storylines were lost, so the mother of the character of Desi Collings does not appear in the film, and it was not possible to include flashbacks of Nick Dunne's dead mother.\r\nIn terms of the film's ending, Flynn revealed that she experimented with a \"lot of iterations\". One of the aspects that she was certain of was the presence of the media, which she described as the \"third player\", alongside Nick and Amy. In Flynn's words: \"Once we got to the ending, I wanted it to wrap up quickly. I didn't want 8 million more loop-de-loops ... I had no problem tossing stuff out and trying to figure out the best way to get there.\"\r\nFlynn enjoyed the experience of making the film, and she expressed appreciation for Fincher's involvement, as he \"really liked the book and didn't want to turn it into something other than what it already was\", and he also reassured her, even when she second-guessed herself. Fincher described Flynn's screenwriting work as \"very smart\", \"crafty\", and \"extremely articulate\".\r\nFilming\r\nOn September 11, 2013, the Gone Girl film crew began filming establishing shots. Principal photography began on September 15 in Cape Girardeau, Missouri, and was scheduled to last about five weeks. Some interior scenes were filmed in Los Angeles, with a door that could not be replicated being shipped there from Cape Girardeau.\r\nAccording to producer Ceán Chaffin, Fincher took, on average, as many as 50 takes for each scene, while Flynn has said that, although Fincher is a visual director, he is meticulous about veracity—Fincher changed a scene in which Amy collects her own blood, as he thought it was unbelievable.\r\nFincher later called Affleck \"extremely bright\" in regard to the manner in which he drew on his own experience with the media for the character of Nick Dunne. Fincher explained that Affleck \"has a great sense of humor and great wit about what this situation is and how frustrating it is\". Fincher described the behavior of the media in the film as \"tragedy vampirism\", but clarified that \"The New York Times and NPR are not in the flowerbeds of the Dunne house\".\r\nFashion\r\nThe lead costume designer in Gone Girl is Trish Summerville. Summerville has worked with director David Fincher as the costume designer for The Girl with the Dragon Tattoo. Summerville told InStyle magazine, that she wanted Nick and Amy's clothing to look contemporary due to the film's present day setting, yet understated and simple as to illustrate the idea that Nick and Amy are a regular and unassuming couple. Summerville goes on to explain that she wanted the clothes to look like everyday life as if they ordered them online or bought them at the mall, she tells that figuring out what Nick and Amy's 'everyday life' is like was one of her biggest challenges. As a result of Amy's self proclaimed 'cool girl' status, her costumes directly reflect the traditionally chic yet girl-next-door attitude. Amy's pieces can be seen as more timeless over high fashion and trendy as Summerville explains that Amy is just \"kind of not that girl.\" This is also exemplified through Amy's jewelry; she wears a Rose Gold Cartier Love bracelet as well as a necklace containing a floating 'A' to show how Amy holds onto keepsakes from the past.\r\nNick Dunne's character is also more simple in the way he presents himself. Summerville wanted to dress him in simple yet well-fitting suits and found that designer suits fit best due to actor Ben Affleck's larger build. Nick Dunne can be seen wearing suits from Dolce & Gabbana, as well as Prada shirts. The shirt that Nick puts on when he comes home to find his wife missing is an important piece in the film because he does not take this shirt off for the days following. The infamous blue shirt Nick wears is a blue button-up designed by Steven Alan, paired with J brand jeans.\r\nWhen Amy and Nick move to Missouri, Summerville made minor changes to Amy's wardrobe in order to signify change. She wears more muted colors, more jeans, and less high-heels.\r\nMusic\r\nOn January 21, 2014, Trent Reznor announced that he and Atticus Ross would provide the score, marking their third collaboration with Fincher, following The Social Network and The Girl with the Dragon Tattoo. Fincher was inspired by music he heard while at an appointment with a chiropractor and tasked Reznor with creating the musical equivalent of an insincere façade. Reznor explained Fincher's request in an interview:\r\nDavid was at the chiropractor and heard this music that was inauthentically trying to make him feel OK, and that became a perfect metaphor for this film ... The challenge was, simply, what is the musical equivalent of the same sort of facade of comfort and a feeling of insincerity that that music represented? to instill doubt remind you that things aren't always what they seem to be.\r\nThe overall score is a combination of soothing sounds with staccato electronic noises, resulting in an unnerving, anxiety-provoking quality. NPR writer Andy Beta concludes: \"Reznor and Ross relish being at their most beauteous, knowing that it'll make the brutal moments of Gone Girl all the more harrowing.\" Richard Butler of The Psychedelic Furs sang a cover version of the song \"She\", which was used in the film's teaser trailer. The soundtrack album was released on the Columbia label on September 30, 2014.\r\nRelease\r\nGone Girl opened the 52nd New York Film Festival, receiving high-profile press coverage and early positive reviews. It saw a nationwide release in North America in 3,014 theatres on October 3, 2014. Coinciding with the North America release, Gone Girl released at 5,270 screens in 39 international markets like the United Kingdom and Germany, on its opening weekend.\r\nHome media\r\nGone Girl was released on DVD and Blu-ray on January 13, 2015. The Blu-ray release comes with a 36-page Amazing Amy book called Tattle Tale. An audio commentary with Fincher is the sole special feature included on the DVD/Blu-ray.\r\nReception\r\nBox office\r\nGone Girl grossed $167.8 million in the U.S. and Canada and $201.6 million in other territories for a worldwide total of $369.3 million, against a production budget of $61 million. Calculating in all expenses, Deadline Hollywood estimated that the film made a profit of $129.99 million, making it one of the most profitable films of 2014.\r\nThe film was released on October 3, 2014, in North America in 3,014 theaters and earned $13.1 million on its opening day (including the $1.3 million it earned from Thursday late-night showings). It finished in first place at the North American box office earning $37.5 million after a neck-and-neck competition with Warner Bros./New Line Cinema's horror film Annabelle which earned $37.1 million. The film is the biggest debut of Fincher's career (breaking Panic Room's opening). It was also the third biggest opening weekend for Affleck—behind Pearl Harbor ($59.1 million), and Daredevil ($40.3 million)—and Rosamund Pike's second biggest opening—behind Die Another Day ($47 million). The film is the tenth biggest October debut overall. The film played 60% female and 75% over-25 years old. The film topped the box office for two consecutive weekends despite facing competition with Dracula Untold in its second weekend before being overtaken by Fury in its third weekend.\r\nOutside North America, it earned $24.6 million from 5,270 screens in 39 international markets on its opening weekend, higher than expected. High openings were witnessed in the United Kingdom ($6.7 million), Australia ($4.6 million), France ($3.65 million) Russia ($3.4 million), and Germany ($2.6 million).\r\nCritical response\r\nGone Girl received largely positive reviews from critics, with Pike's performance in particular earning widespread acclaim. Rotten Tomatoes gives the film an approval rating of 88%, based on 368 reviews, with an average rating of 8/10. The website's critical consensus reads: \"Dark, intelligent, and stylish to a fault, Gone Girl plays to director David Fincher's sick strengths while bringing the best out of stars Ben Affleck and Rosamund Pike.\" Metacritic gave the film a weighted average score of 79 out of 100, based on 49 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a B grade.\r\nThe Vulture's critics praised the direction, screenplay, editing, score, visual style, and acting, particularly from Pike, Affleck, Tyler Perry, Carrie Coon, and Missi Pyle. Kenneth Turan of the Los Angeles Times wrote: \"Superbly cast from the two at the top to the smallest speaking parts, impeccably directed by Fincher and crafted by his regular team to within an inch of its life, Gone Girl shows the remarkable things that can happen when filmmaker and material are this well matched.\" The Economist called the film a \"brilliantly glacial adaptation ... This may not be the perfect film—but it is a perfect adaptation\".\r\nJoshua Rothman wrote in The New Yorker that he enjoyed the film \"in all its abstract, intellectual, postmodern glory\" and that, similar to other postmodern narratives, the film adaptation is \"decisively unreal ... heroes and villains in Fincher's Gone Girl aren't people but stories\". Rothman, who draws parallels between Gone Girl and Fincher's 1999 adaptation Fight Club, decides that the film is ultimately a farce and has resonated with filmgoers because it expresses \"a creepy, confused, and troubling part of us\".\r\nAnthony Lane of The New Yorker wrote: \"At first blush, Gone Girl is natural Fincherland ... so why doesn't the movie claw us as The Social Network did? Who could have predicted that a film about murder, betrayal, and deception would be less exciting than a film about a website?\" Slant Magazine's Ed Gonzalez awarded the film two out of four stars, concluding: \"Fincher and Flynn should have gone further and truly grappled with the real horror that, by giving his relationship with Amy another chance, Nick is indulging in one of the great myths of feminism: that it emasculates men. Rather than undermine that noxiousness, Fincher enshrouds it in funereal brushstrokes that cast his Gone Girl as a fashionable tumbling into an abyss of willful denial.\"\r\nIn response to some of the criticisms of the film, Flynn said, \"The whole point is that these are two people pretending to be other people, better people, versions of the dream guy and dream girl, but each one couldn't keep it up, so they destroy each other\".\r\nAccolades\r\nGone Girl garnered awards and nominations in a variety of categories with praise for its direction, Pike's performance, Flynn's screenplay, and its soundtrack. At the 87th Academy Awards, Pike received a nomination for Best Actress. The film received four nominations at the 72nd Golden Globe Awards: Best Director for Fincher, Best Actress in a Drama for Pike, Best Screenplay for Flynn, and Best Original Score. Pike received a nomination for Best Actress at the 68th British Academy Film Awards (BAFTAs). The National Board of Review included the film in their list of top ten films of the year, and the soundtrack was nominated for the 2015 Grammy Award for Best Score Soundtrack for Visual Media.\r\nTop ten lists\r\nGone Girl was listed on many critics' top ten lists.\r\n3rd – Matthew Jacobs & Christopher Rosen, The Huffington Post\r\n3rd – Genevieve Koski, The Dissolve\r\n3rd – People\r\n3rd – Mara Reinstein, Us Weekly\r\n3rd – James Rocchi, TheWrap\r\n4th – Ben Kenigsberg & Nick Schager, The A.V. Club\r\n4th – William Gross, Austin Chronicle\r\n4th – Joshua Rothkopf, Time Out New York\r\n4th – Brian Tallerico, RogerEbert.com\r\n4th – Adam Chitwood, Collider\r\n4th – Rene Rodriguez, Miami Herald\r\n4th – Gregory Ellwood, HitFix\r\n5th – Peter Travers, Rolling Stone\r\n5th – David Ehrlich, Little White Lies\r\n7th – Tasha Robinson, The Dissolve\r\n7th – Chris Nashawaty, Entertainment Weekly\r\n7th – Christopher Orr, The Atlantic\r\n7th – Justin Chang & Scott Foundas, Variety\r\n8th – Jeff Baker, The Oregonian\r\n8th – Christy Lemire RogerEbert.com\r\n8th – Steve Persall, Tampa Bay Times\r\n8th – James Berardinelli, Reelviews\r\n9th – Rene Rodriguez, Miami Herald\r\n9th – Joe Neumaier, New York Daily News\r\n9th – A.A. Dowd and Ignatiy Vishnevetsky, The A.V. Club\r\nTop 10 (ranked alphabetically) – Dana Stevens, Slate\r\nTop 10 (ranked alphabetically) – Calvin Wilson, St. Louis Post-Dispatch\r\nTop 10 (ranked alphabetically) – Claudia Puig, USA Today\r\nThemes\r\nGender\r\nIn a 2013 interview with Time Out magazine writer Novid Parsi, who described the ending of the novel as \"polarizing\", Flynn explained that she wanted the novel to counter the notion that \"women are naturally good\" and to show that women are \"just as violently minded as men are\". In a November 2014 interview, Flynn admitted that the critical gender-related response did affect her: \"I had about 24 hours where I hovered under my covers and was like: 'I killed feminism. Why did I do that? Rats. I did not mean to do that.' And then I very quickly kind of felt comfortable with what I had written.\"\r\nIn an October 3, 2014, blog post for Ms. Magazine, Natalie Wilson argues that by not addressing Amy's social privilege which affords her the \"necessary funds, skills, know-how and spare time\" to stage a disappearance—Gone Girl is the \"crystallization of a thousand misogynist myths and fears about female behavior.\" Alyssa Rosenberg wrote in The Washington Post on October 3, 2014, that, although she was initially \"unconvinced\" by the book, her fascination with the novel and film was partly due to her conclusion that \"Amy Elliot Dunne is the only fictional character I can think of who might be accurately described as simultaneously misogynist and misandrist.\"\r\nIn an October 6, 2014, article titled \"Gone Girl's Biggest Villain Is Marriage Itself\", Jezebel's Jessica Coen wrote: \"Movie Amy pales in comparison to the vivid character we meet in the book. Strip away Book Amy's complexities and you're left with little more than 'crazy fucking bitch.' That makes her no less captivating, but it does make the film feel a lot more misogynistic than the novel.\" Coen concedes that this did not negate her enjoyment of the film, \"as we ladies are well accustomed to these injustices.\" Time's Eliana Dockterman wrote on the same date that Gone Girl is both \"a sexist portrayal of a crazy woman\" and a \"feminist manifesto\", and that this duality makes the film interesting. Zoë Heller of The New York Review of Books wrote: \"The problem with Amy is not that she acts in vicious and reprehensible ways, or even that her behavior lends credence to certain misogynist fantasies. The problem is that she isn't really a character, but rather an animation of a not very interesting idea about the female capacity for nastiness\", concluding that \"The film is a piece of silliness, not powerful enough in the end to engender proper 'disapproval': only wonder at its coarseness and perhaps mild dismay at its critical success.\"\r\nWriting in The Guardian on October 6, 2014, Joan Smith criticized what she saw as the film's \"recycling of rape myths\", citing research released in 2013 which stated that false allegations of rape in the UK were extremely rare. She wrote: \"The characters live in a parallel universe where the immediate reaction to a woman who says she's been assaulted is one of chivalrous concern. Tell that to all the victims, here and in the US, who have had their claims dismissed by sceptical police officers.\" Writing for The Guardian on the following day, Emine Saner wrote that Smith's argument \"wouldn't carry as much weight were this film set against a vastly wider range of women's stories, and characters in mainstream culture\", but concluded with Dockterman's plea for the portrayal of \"all sorts of women in our novels\".\r\nTim Kroenert, of the Australian website Eureka Street wrote on October 8, 2014, that the film's predominant focus upon Nick's perspective \"serves to obfuscate Amy's motives (though it is possible that she is simply a sociopath), and to amplify her personification of ... anti-women myths\"; however, Kroenert concludes that Gone Girl is \"a compelling rumination on the impossibility of knowing the mind of another, even within that ostensibly most intimate of relationships, marriage.\"\r\nPotential sequel\r\nIn an interview in October 2014, Rosamund Pike stated she would return for a sequel if Gillian Flynn wrote the script. In January 2015, Flynn said she was open to the idea of a sequel, but said it would be \"a few years down the road\" when the original cast and crew would be available again.",
    "html": "<p>Gone Girl is a 2014 American psychological thriller film directed by David Fincher and written by Gillian Flynn, based on her 2012 novel of the same name. It stars Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, and Carrie Coon. In the film, Nick Dunne (Affleck) becomes the prime suspect in the sudden disappearance of his wife, Amy (Pike) in Missouri.</p><p>Gone Girl premiered as the opening film at the 52nd New York Film Festival on September 26, 2014, and was theatrically released in the United States on October 3, 2014 by 20th Century Fox. It was a critical and commercial success, grossing $369 million worldwide against a $61 million budget, to become Fincher's highest-grossing film. It is considered a postmodern mystery.</p><p>Pike's performance was widely acclaimed by critics, and she received nominations for an Academy Award, BAFTA Award, Golden Globe Award, and Screen Actors Guild Award for Best Actress. Additional nominations included a Golden Globe Award for Best Director for Fincher and Golden Globe Award, BAFTA, and Critics' Choice Award nominations for Flynn's adapted screenplay, which won at Critics' Choice.</p><br/><h3>Plot</h3><p>On their fifth wedding anniversary, writing teacher Nick Dunne returns home to find his wife Amy missing. Amy's fame as the inspiration for her parents' Amazing Amy children's books ensures widespread press coverage. The media find Nick's apathy towards the disappearance suspicious.</p><p>Flashbacks in the form of diary entries show a complex reality and a deterioriating marriage. Amazing Amy was an idealized completion of the real Amy's failures. Both lost their jobs in the recession and moved from New York to Nick's hometown of North Carthage, Missouri, to support his dying mother. Nick grew distant from Amy and began an affair with Andie, one of his students, while Amy became resentful towards Nick for uprooting her.</p><p>Detective Rhonda Boney and the forensic team find poorly concealed evidence of struggle and profuse blood loss in the house. Boney learns of financial issues, spousal disputes, and Amy's recent attempt to buy a gun. Medical reports indicate Amy was pregnant, which Nick denies knowledge of.</p><p>On every wedding anniversary, Amy had set up elaborate treasure hunts for Nick. This year's clues appear in places where Nick had sex with Andie, thus revealing Amy's knowledge of his affair. Nick discovers thousands of dollars of items purchased with his credit card hidden in his twin sister Margo's woodshed. Amy's clues lead authorities to a half-burnt diary documenting her growing dread of Nick and ending with a genuine fear that he will kill her.</p><p>The audience then learns that Amy is alive and hiding in a campground in the Ozarks. After discovering Nick's affair, Amy conceived an elaborate plan to frame him for her murder. She had him ramp up her life insurance and secretly used his credit card to buy the woodshed items. She befriended a pregnant neighbor, told her stories about Nick's temper, and stole her urine to fake a pregnancy thus eliciting media sympathy after her disappearance. She wrote a diary with increasingly fabricated entries, and placed incriminating evidence in the treasure hunt spots for the police to find. On the morning of her disappearance, Amy drained and splattered her own blood across the kitchen, and cleaned it haphazardly. Her original plan was to drown herself after Nick's arrest, in order to ensure his death sentence.</p><p>Nick deduces Amy's scheme, convinces Margo of his innocence and hires lawyer Tanner Bolt, known for representing uxoricide suspects. Nick meets two of Amy's ex-boyfriends: Tommy O'Hara claims he was framed for rape by her after he ended their relationship; wealthy Desi Collings, against whom Amy had filed a restraining order for stalking, turns Nick away.</p><p>When Amy's campground neighbors rob her, she calls Desi for help, convincing him that she fled Nick's abuse. Desi agrees to hide her in his lakehouse. Bolt convinces Nick to reveal his affair on a popular talk show, thus seizing the narrative initiative from the media. Andie reveals the affair at a press conference shortly before the show, but Nick insists on conducting the interview. He affirms his innocence and feigns regret for his shortcomings as a spouse, knowing that Amy will be watching.</p><p>The interview is a success, garnering widespread sympathy for Nick. However, Boney has already gathered enough murder evidence and arrests Nick and Margo. Bolt bails them out, and they brace for the impending trial. After watching Nick's interview, Amy rekindles her attraction to him and spends weeks crafting her escape story. Using lakehouse surveillance cameras and self-inflicted wrist and vaginal injuries, she makes it appear that Desi kidnapped and raped her. She then seduces Desi, slits his throat during sex and returns home covered in his blood, thus clearing Nick of suspicion.</p><p>Medical examiners lend credence to Amy's story. During questioning, Boney probes her inconsistencies but Amy spins the focus onto her by calling her incompetent. The FBI believes Amy and closes the case, but nonverbal communication between both women renders Amy's guilt obvious to Boney. Upon returning home, Amy tells Nick the truth, admitting to Desi's murder. She states that the Nick pleading for her return on TV is the one she wants, and the one who inspired her forgiveness. Nick shares this with Boney, Bolt, and Margo, but they have no evidence and Bolt leaves.</p><p>A televised interview takes place in their home seven weeks later. Anticipating Nick's intention to leave her and publicly expose her story, Amy reveals her pregnancy minutes before the interview, having inseminated herself with Nick's sperm from a fertility clinic. Nick reacts violently at first, but feels responsible for the child and ultimately decides to stay with Amy, despite Margo's despair. The \"happy\" couple announces on television that they are expecting a child.</p><br/><h3>Cast</h3><ul><li>Ben Affleck as Nicholas “Nick” Dunne, a professor</li><li>Rosamund Pike as Amy Elliott Dunne, Nick's missing wife</li><li>Neil Patrick Harris as Desi Collings, Amy's wealthy ex-boyfriend</li><li>Tyler Perry as Tanner Bolt, Nick's attorney</li><li>Carrie Coon as Margo \"Go\" Dunne, Nick's twin sister</li><li>Kim Dickens as Detective Rhonda Boney, the lead investigator on Amy's disappearance</li><li>Patrick Fugit as Officer James Gilpin, Boney's partner</li><li>Missi Pyle as Ellen Abbott, a cable TV host based on Nancy Grace</li><li>Emily Ratajkowski as Andrea “Andie” Fitzgerald, Nick's mistress and student</li><li>Casey Wilson as Noëlle Hawthorne, Nick and Amy's pregnant neighbor</li><li>Lola Kirke as Greta, a young woman Amy meets at the Ozarks campground</li><li>Boyd Holbrook as Jeffrey “Jeff”, a flirtatious man Amy meets at the Ozarks campground</li><li>Lisa Banes as Mary Elizabeth “Marybeth” Elliott, Amy's mother</li><li>Sela Ward as Sharon Schieber, a network TV host</li><li>Scoot McNairy as Thomas “Tommy” O'Hara, another former boyfriend of Amy's</li><li>Scott Takeda as TV Producer</li><li>David Clennon as Randall “Randy” Elliott, Amy's father</li><li>Kathleen Rose Perkins as Shawna Kelly</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Gone Girl is a film adaptation of Flynn's 2012 novel of the same name. One of the film's executive producers, Leslie Dixon, read the manuscript of the novel in 2011 and brought it to the attention of Reese Witherspoon (who was originally slated to play Amy) in December of that year. Witherspoon and Dixon then collaborated with Bruna Papandrea to further develop the manuscript—with Flynn's film agent, Shari Smiley, they met with film studios in early 2012.</p><p>Following the release of the novel in June 2012, the 20th Century Fox studio optioned the book in a deal with Flynn, in which the author negotiated that she would be responsible for the first draft of the screenplay. By around October 2012, Flynn was engaged in the production of the first draft while she was also involved in the promotional tour for her novel. Then a first-time screenwriter, Flynn later admitted: \"I certainly felt at sea a lot of times, kind of finding my way through.\"</p><p>Flynn submitted her first draft screenplay to the Fox studio in December 2012, before Fincher was selected as the director for the project. Fincher had already expressed interest in the project, and after he finished reading Flynn's first draft, a meeting was scheduled between the director and author within days. Typically, authors are removed from film adaptations following the first draft and an experienced screenwriter takes over; but, on this occasion, Fincher agreed to work with Flynn for the entire project. Flynn later explained: \"... he responded to the first draft and we have kind of similar sensibilities. We liked the same things about the book, and we wanted the same thing out of the movie.\"</p><p>As further preparation, Flynn studied screenplay books and also met with Steve Kloves, who wrote the scripts for the Harry Potter series. Fincher also provided guidance and advised the author: \"We don't have the ability to gift the audience with the characters' thoughts, so tell me how they're behaving.\" During the production of the final screenplay, Fincher and Flynn engaged in an intensive back-and-forth working relationship: Flynn sent Fincher \"big swaths\" of writing, which he then reviewed, and Fincher would then discuss the swaths with Flynn by telephone. Eventually, some scenes were rewritten \"a dozen times\", while other scenes were unaltered.</p><p>Following the release of the film, Flynn spoke of an overwhelming adaptation process, in which she tackled a 500-page book with an intricate plot; she explained that her experience working for a magazine meant that she \"wasn't ever precious about cutting.\" As a consequence of the distillation process, most of the parental storylines were lost, so the mother of the character of Desi Collings does not appear in the film, and it was not possible to include flashbacks of Nick Dunne's dead mother.</p><p>In terms of the film's ending, Flynn revealed that she experimented with a \"lot of iterations\". One of the aspects that she was certain of was the presence of the media, which she described as the \"third player\", alongside Nick and Amy. In Flynn's words: \"Once we got to the ending, I wanted it to wrap up quickly. I didn't want 8 million more loop-de-loops ... I had no problem tossing stuff out and trying to figure out the best way to get there.\"</p><p>Flynn enjoyed the experience of making the film, and she expressed appreciation for Fincher's involvement, as he \"really liked the book and didn't want to turn it into something other than what it already was\", and he also reassured her, even when she second-guessed herself. Fincher described Flynn's screenwriting work as \"very smart\", \"crafty\", and \"extremely articulate\".</p><h4>Filming</h4><p>On September 11, 2013, the Gone Girl film crew began filming establishing shots. Principal photography began on September 15 in Cape Girardeau, Missouri, and was scheduled to last about five weeks. Some interior scenes were filmed in Los Angeles, with a door that could not be replicated being shipped there from Cape Girardeau.</p><p>According to producer Ceán Chaffin, Fincher took, on average, as many as 50 takes for each scene, while Flynn has said that, although Fincher is a visual director, he is meticulous about veracity—Fincher changed a scene in which Amy collects her own blood, as he thought it was unbelievable.</p><p>Fincher later called Affleck \"extremely bright\" in regard to the manner in which he drew on his own experience with the media for the character of Nick Dunne. Fincher explained that Affleck \"has a great sense of humor and great wit about what this situation is and how frustrating it is\". Fincher described the behavior of the media in the film as \"tragedy vampirism\", but clarified that \"The New York Times and NPR are not in the flowerbeds of the Dunne house\".</p><h4>Fashion</h4><p>The lead costume designer in Gone Girl is Trish Summerville. Summerville has worked with director David Fincher as the costume designer for The Girl with the Dragon Tattoo. Summerville told InStyle magazine, that she wanted Nick and Amy's clothing to look contemporary due to the film's present day setting, yet understated and simple as to illustrate the idea that Nick and Amy are a regular and unassuming couple. Summerville goes on to explain that she wanted the clothes to look like everyday life as if they ordered them online or bought them at the mall, she tells that figuring out what Nick and Amy's 'everyday life' is like was one of her biggest challenges. As a result of Amy's self proclaimed 'cool girl' status, her costumes directly reflect the traditionally chic yet girl-next-door attitude. Amy's pieces can be seen as more timeless over high fashion and trendy as Summerville explains that Amy is just \"kind of not that girl.\" This is also exemplified through Amy's jewelry; she wears a Rose Gold Cartier Love bracelet as well as a necklace containing a floating 'A' to show how Amy holds onto keepsakes from the past.</p><p>Nick Dunne's character is also more simple in the way he presents himself. Summerville wanted to dress him in simple yet well-fitting suits and found that designer suits fit best due to actor Ben Affleck's larger build. Nick Dunne can be seen wearing suits from Dolce & Gabbana, as well as Prada shirts. The shirt that Nick puts on when he comes home to find his wife missing is an important piece in the film because he does not take this shirt off for the days following. The infamous blue shirt Nick wears is a blue button-up designed by Steven Alan, paired with J brand jeans.</p><p>When Amy and Nick move to Missouri, Summerville made minor changes to Amy's wardrobe in order to signify change. She wears more muted colors, more jeans, and less high-heels.</p><br/><h3>Music</h3><p>On January 21, 2014, Trent Reznor announced that he and Atticus Ross would provide the score, marking their third collaboration with Fincher, following The Social Network and The Girl with the Dragon Tattoo. Fincher was inspired by music he heard while at an appointment with a chiropractor and tasked Reznor with creating the musical equivalent of an insincere façade. Reznor explained Fincher's request in an interview:</p><blockquote>David was at the chiropractor and heard this music that was inauthentically trying to make him feel OK, and that became a perfect metaphor for this film ... The challenge was, simply, what is the musical equivalent of the same sort of facade of comfort and a feeling of insincerity that that music represented? to instill doubt remind you that things aren't always what they seem to be.</blockquote><p>The overall score is a combination of soothing sounds with staccato electronic noises, resulting in an unnerving, anxiety-provoking quality. NPR writer Andy Beta concludes: \"Reznor and Ross relish being at their most beauteous, knowing that it'll make the brutal moments of Gone Girl all the more harrowing.\" Richard Butler of The Psychedelic Furs sang a cover version of the song \"She\", which was used in the film's teaser trailer. The soundtrack album was released on the Columbia label on September 30, 2014.</p><br/><h3>Release</h3><p>Gone Girl opened the 52nd New York Film Festival, receiving high-profile press coverage and early positive reviews. It saw a nationwide release in North America in 3,014 theatres on October 3, 2014. Coinciding with the North America release, Gone Girl released at 5,270 screens in 39 international markets like the United Kingdom and Germany, on its opening weekend.</p><h4>Home media</h4><p>Gone Girl was released on DVD and Blu-ray on January 13, 2015. The Blu-ray release comes with a 36-page Amazing Amy book called Tattle Tale. An audio commentary with Fincher is the sole special feature included on the DVD/Blu-ray.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Gone Girl grossed $167.8 million in the U.S. and Canada and $201.6 million in other territories for a worldwide total of $369.3 million, against a production budget of $61 million. Calculating in all expenses, Deadline Hollywood estimated that the film made a profit of $129.99 million, making it one of the most profitable films of 2014.</p><p>The film was released on October 3, 2014, in North America in 3,014 theaters and earned $13.1 million on its opening day (including the $1.3 million it earned from Thursday late-night showings). It finished in first place at the North American box office earning $37.5 million after a neck-and-neck competition with Warner Bros./New Line Cinema's horror film Annabelle which earned $37.1 million. The film is the biggest debut of Fincher's career (breaking Panic Room's opening). It was also the third biggest opening weekend for Affleck—behind Pearl Harbor ($59.1 million), and Daredevil ($40.3 million)—and Rosamund Pike's second biggest opening—behind Die Another Day ($47 million). The film is the tenth biggest October debut overall. The film played 60% female and 75% over-25 years old. The film topped the box office for two consecutive weekends despite facing competition with Dracula Untold in its second weekend before being overtaken by Fury in its third weekend.</p><p>Outside North America, it earned $24.6 million from 5,270 screens in 39 international markets on its opening weekend, higher than expected. High openings were witnessed in the United Kingdom ($6.7 million), Australia ($4.6 million), France ($3.65 million) Russia ($3.4 million), and Germany ($2.6 million).</p><h4>Critical response</h4><p>Gone Girl received largely positive reviews from critics, with Pike's performance in particular earning widespread acclaim. Rotten Tomatoes gives the film an approval rating of 88%, based on 368 reviews, with an average rating of 8/10. The website's critical consensus reads: \"Dark, intelligent, and stylish to a fault, Gone Girl plays to director David Fincher's sick strengths while bringing the best out of stars Ben Affleck and Rosamund Pike.\" Metacritic gave the film a weighted average score of 79 out of 100, based on 49 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film a B grade.</p><p>The Vulture's critics praised the direction, screenplay, editing, score, visual style, and acting, particularly from Pike, Affleck, Tyler Perry, Carrie Coon, and Missi Pyle. Kenneth Turan of the Los Angeles Times wrote: \"Superbly cast from the two at the top to the smallest speaking parts, impeccably directed by Fincher and crafted by his regular team to within an inch of its life, Gone Girl shows the remarkable things that can happen when filmmaker and material are this well matched.\" The Economist called the film a \"brilliantly glacial adaptation ... This may not be the perfect film—but it is a perfect adaptation\".</p><p>Joshua Rothman wrote in The New Yorker that he enjoyed the film \"in all its abstract, intellectual, postmodern glory\" and that, similar to other postmodern narratives, the film adaptation is \"decisively unreal ... heroes and villains in Fincher's Gone Girl aren't people but stories\". Rothman, who draws parallels between Gone Girl and Fincher's 1999 adaptation Fight Club, decides that the film is ultimately a farce and has resonated with filmgoers because it expresses \"a creepy, confused, and troubling part of us\".</p><p>Anthony Lane of The New Yorker wrote: \"At first blush, Gone Girl is natural Fincherland ... so why doesn't the movie claw us as The Social Network did? Who could have predicted that a film about murder, betrayal, and deception would be less exciting than a film about a website?\" Slant Magazine's Ed Gonzalez awarded the film two out of four stars, concluding: \"Fincher and Flynn should have gone further and truly grappled with the real horror that, by giving his relationship with Amy another chance, Nick is indulging in one of the great myths of feminism: that it emasculates men. Rather than undermine that noxiousness, Fincher enshrouds it in funereal brushstrokes that cast his Gone Girl as a fashionable tumbling into an abyss of willful denial.\"</p><p>In response to some of the criticisms of the film, Flynn said, \"The whole point is that these are two people pretending to be other people, better people, versions of the dream guy and dream girl, but each one couldn't keep it up, so they destroy each other\".</p><h4>Accolades</h4><p>Gone Girl garnered awards and nominations in a variety of categories with praise for its direction, Pike's performance, Flynn's screenplay, and its soundtrack. At the 87th Academy Awards, Pike received a nomination for Best Actress. The film received four nominations at the 72nd Golden Globe Awards: Best Director for Fincher, Best Actress in a Drama for Pike, Best Screenplay for Flynn, and Best Original Score. Pike received a nomination for Best Actress at the 68th British Academy Film Awards (BAFTAs). The National Board of Review included the film in their list of top ten films of the year, and the soundtrack was nominated for the 2015 Grammy Award for Best Score Soundtrack for Visual Media.</p><h4>Top ten lists</h4><p>Gone Girl was listed on many critics' top ten lists.</p><ul><li>3rd – Matthew Jacobs & Christopher Rosen, The Huffington Post</li><li>3rd – Genevieve Koski, The Dissolve</li><li>3rd – People</li><li>3rd – Mara Reinstein, Us Weekly</li><li>3rd – James Rocchi, TheWrap</li><li>4th – Ben Kenigsberg & Nick Schager, The A.V. Club</li><li>4th – William Gross, Austin Chronicle</li><li>4th – Joshua Rothkopf, Time Out New York</li><li>4th – Brian Tallerico, RogerEbert.com</li><li>4th – Adam Chitwood, Collider</li><li>4th – Rene Rodriguez, Miami Herald</li><li>4th – Gregory Ellwood, HitFix</li><li>5th – Peter Travers, Rolling Stone</li><li>5th – David Ehrlich, Little White Lies</li><li>7th – Tasha Robinson, The Dissolve</li><li>7th – Chris Nashawaty, Entertainment Weekly</li><li>7th – Christopher Orr, The Atlantic</li><li>7th – Justin Chang & Scott Foundas, Variety</li><li>8th – Jeff Baker, The Oregonian</li><li>8th – Christy Lemire RogerEbert.com</li><li>8th – Steve Persall, Tampa Bay Times</li><li>8th – James Berardinelli, Reelviews</li><li>9th – Rene Rodriguez, Miami Herald</li><li>9th – Joe Neumaier, New York Daily News</li><li>9th – A.A. Dowd and Ignatiy Vishnevetsky, The A.V. Club</li><li>Top 10 (ranked alphabetically) – Dana Stevens, Slate</li><li>Top 10 (ranked alphabetically) – Calvin Wilson, St. Louis Post-Dispatch</li><li>Top 10 (ranked alphabetically) – Claudia Puig, USA Today</li></ul><br/><h3>Themes</h3><h4>Gender</h4><p>In a 2013 interview with Time Out magazine writer Novid Parsi, who described the ending of the novel as \"polarizing\", Flynn explained that she wanted the novel to counter the notion that \"women are naturally good\" and to show that women are \"just as violently minded as men are\". In a November 2014 interview, Flynn admitted that the critical gender-related response did affect her: \"I had about 24 hours where I hovered under my covers and was like: 'I killed feminism. Why did I do that? Rats. I did not mean to do that.' And then I very quickly kind of felt comfortable with what I had written.\"</p><p>In an October 3, 2014, blog post for Ms. Magazine, Natalie Wilson argues that by not addressing Amy's social privilege which affords her the \"necessary funds, skills, know-how and spare time\" to stage a disappearance—Gone Girl is the \"crystallization of a thousand misogynist myths and fears about female behavior.\" Alyssa Rosenberg wrote in The Washington Post on October 3, 2014, that, although she was initially \"unconvinced\" by the book, her fascination with the novel and film was partly due to her conclusion that \"Amy Elliot Dunne is the only fictional character I can think of who might be accurately described as simultaneously misogynist and misandrist.\"</p><p>In an October 6, 2014, article titled \"Gone Girl's Biggest Villain Is Marriage Itself\", Jezebel's Jessica Coen wrote: \"Movie Amy pales in comparison to the vivid character we meet in the book. Strip away Book Amy's complexities and you're left with little more than 'crazy fucking bitch.' That makes her no less captivating, but it does make the film feel a lot more misogynistic than the novel.\" Coen concedes that this did not negate her enjoyment of the film, \"as we ladies are well accustomed to these injustices.\" Time's Eliana Dockterman wrote on the same date that Gone Girl is both \"a sexist portrayal of a crazy woman\" and a \"feminist manifesto\", and that this duality makes the film interesting. Zoë Heller of The New York Review of Books wrote: \"The problem with Amy is not that she acts in vicious and reprehensible ways, or even that her behavior lends credence to certain misogynist fantasies. The problem is that she isn't really a character, but rather an animation of a not very interesting idea about the female capacity for nastiness\", concluding that \"The film is a piece of silliness, not powerful enough in the end to engender proper 'disapproval': only wonder at its coarseness and perhaps mild dismay at its critical success.\"</p><p>Writing in The Guardian on October 6, 2014, Joan Smith criticized what she saw as the film's \"recycling of rape myths\", citing research released in 2013 which stated that false allegations of rape in the UK were extremely rare. She wrote: \"The characters live in a parallel universe where the immediate reaction to a woman who says she's been assaulted is one of chivalrous concern. Tell that to all the victims, here and in the US, who have had their claims dismissed by sceptical police officers.\" Writing for The Guardian on the following day, Emine Saner wrote that Smith's argument \"wouldn't carry as much weight were this film set against a vastly wider range of women's stories, and characters in mainstream culture\", but concluded with Dockterman's plea for the portrayal of \"all sorts of women in our novels\".</p><p>Tim Kroenert, of the Australian website Eureka Street wrote on October 8, 2014, that the film's predominant focus upon Nick's perspective \"serves to obfuscate Amy's motives (though it is possible that she is simply a sociopath), and to amplify her personification of ... anti-women myths\"; however, Kroenert concludes that Gone Girl is \"a compelling rumination on the impossibility of knowing the mind of another, even within that ostensibly most intimate of relationships, marriage.\"</p><br/><h3>Potential sequel</h3><p>In an interview in October 2014, Rosamund Pike stated she would return for a sequel if Gillian Flynn wrote the script. In January 2015, Flynn said she was open to the idea of a sequel, but said it would be \"a few years down the road\" when the original cast and crew would be available again.</p><br/>"
  },
  "errorMessage": ""
}