{
  "imDbId": "tt0061512",
  "title": "Cool Hand Luke",
  "fullTitle": "Cool Hand Luke (1967)",
  "type": "Movie",
  "year": "1967",
  "language": "en",
  "titleInLanguage": "Cool Hand Luke",
  "url": "https://en.wikipedia.org/wiki/Cool_Hand_Luke",
  "plotShort": {
    "plainText": "Cool Hand Luke is a 1967 American prison drama film directed by Stuart Rosenberg, starring Paul Newman and featuring George Kennedy in an Oscar-winning performance. Newman stars in the title role as Luke, a prisoner in a Florida prison camp who refuses to submit to the system. Set in the early 1950s, it is based on Donn Pearce's 1965 novel Cool Hand Luke.\r\nRoger Ebert called Cool Hand Luke an anti-establishment film shot during emerging popular opposition to the Vietnam War. Filming took place within California's San Joaquin River Delta region; the set, imitating a prison farm in the Deep South, was based on photographs and measurements made by a crew the filmmakers sent to a Road Prison in Gainesville, Florida. The film uses Christian imagery.\r\nUpon its release, Cool Hand Luke received favorable reviews and was a box-office success. It cemented Newman's status as one of the era's top actors, and was called the \"touchstone of an era\". Newman was nominated for the Academy Award for Best Actor, Kennedy won the Academy Award for Best Supporting Actor, Pearce and Pierson were nominated for the Academy Award for Best Adapted Screenplay, and Lalo Schifrin was nominated for the Academy Award for Best Original Score. In 2005, the United States Library of Congress selected the film for preservation in the National Film Registry, considering it \"culturally, historically, or aesthetically significant\". The film has a 100% rating on the review aggregator website Rotten Tomatoes, and the prison warden's (Strother Martin) line in the film beginning with \"What we've got here is failure to communicate\" was listed at number 11 on the American Film Institute's 100 Years... 100 Movie Quotes list.",
    "html": "<p>Cool Hand Luke is a 1967 American prison drama film directed by Stuart Rosenberg, starring Paul Newman and featuring George Kennedy in an Oscar-winning performance. Newman stars in the title role as Luke, a prisoner in a Florida prison camp who refuses to submit to the system. Set in the early 1950s, it is based on Donn Pearce's 1965 novel Cool Hand Luke.</p><p>Roger Ebert called Cool Hand Luke an anti-establishment film shot during emerging popular opposition to the Vietnam War. Filming took place within California's San Joaquin River Delta region; the set, imitating a prison farm in the Deep South, was based on photographs and measurements made by a crew the filmmakers sent to a Road Prison in Gainesville, Florida. The film uses Christian imagery.</p><p>Upon its release, Cool Hand Luke received favorable reviews and was a box-office success. It cemented Newman's status as one of the era's top actors, and was called the \"touchstone of an era\". Newman was nominated for the Academy Award for Best Actor, Kennedy won the Academy Award for Best Supporting Actor, Pearce and Pierson were nominated for the Academy Award for Best Adapted Screenplay, and Lalo Schifrin was nominated for the Academy Award for Best Original Score. In 2005, the United States Library of Congress selected the film for preservation in the National Film Registry, considering it \"culturally, historically, or aesthetically significant\". The film has a 100% rating on the review aggregator website Rotten Tomatoes, and the prison warden's (Strother Martin) line in the film beginning with \"What we've got here is failure to communicate\" was listed at number 11 on the American Film Institute's 100 Years... 100 Movie Quotes list.</p>"
  },
  "plotFull": {
    "plainText": "Cool Hand Luke is a 1967 American prison drama film directed by Stuart Rosenberg, starring Paul Newman and featuring George Kennedy in an Oscar-winning performance. Newman stars in the title role as Luke, a prisoner in a Florida prison camp who refuses to submit to the system. Set in the early 1950s, it is based on Donn Pearce's 1965 novel Cool Hand Luke.\r\nRoger Ebert called Cool Hand Luke an anti-establishment film shot during emerging popular opposition to the Vietnam War. Filming took place within California's San Joaquin River Delta region; the set, imitating a prison farm in the Deep South, was based on photographs and measurements made by a crew the filmmakers sent to a Road Prison in Gainesville, Florida. The film uses Christian imagery.\r\nUpon its release, Cool Hand Luke received favorable reviews and was a box-office success. It cemented Newman's status as one of the era's top actors, and was called the \"touchstone of an era\". Newman was nominated for the Academy Award for Best Actor, Kennedy won the Academy Award for Best Supporting Actor, Pearce and Pierson were nominated for the Academy Award for Best Adapted Screenplay, and Lalo Schifrin was nominated for the Academy Award for Best Original Score. In 2005, the United States Library of Congress selected the film for preservation in the National Film Registry, considering it \"culturally, historically, or aesthetically significant\". The film has a 100% rating on the review aggregator website Rotten Tomatoes, and the prison warden's (Strother Martin) line in the film beginning with \"What we've got here is failure to communicate\" was listed at number 11 on the American Film Institute's 100 Years... 100 Movie Quotes list.\r\nPlot\r\nIn early 1950s Florida, decorated World War II veteran Lucas \"Luke\" Jackson drunkenly beheads several parking meters. He is sentenced to two years on a chain gang in a prison camp run by the Captain, a stern warden, and Walking Boss Godfrey, a quiet rifleman nicknamed \"the man with no eyes\" because he always wears mirrored sunglasses. There, even minor violations are punished by \"a night in the box\", a small wooden booth in the prison yard with limited air and space.\r\nLuke refuses to observe the established order among the prisoners and quickly runs afoul of their leader, Dragline. When the two have a boxing match, Luke is severely outmatched but refuses to acquiesce. Eventually, Dragline stops the fight, but Luke's tenacity earns the prisoners' respect and draws the guards' attention. He later wins a poker game by bluffing with a hand worth nothing, and Dragline christens him \"Cool Hand Luke\".\r\nAfter a visit from his sick mother, Arletta, Luke becomes more optimistic about his situation. He continually confronts the Captain and the guards, and his sense of humor and independence prove inspiring to the other prisoners. Luke's struggle for supremacy peaks when he leads a work crew in a seemingly impossible but successful effort to complete a road-paving job in less than a day. The prisoners start to idolize him after he wins a bet that he can eat 50 hard-boiled eggs in an hour.\r\nOne evening, Luke receives notice that his mother has died. Anticipating that Luke might attempt to escape to attend the funeral, the Captain has him locked in the box. After being released, Luke becomes determined to escape. Under cover of a Fourth of July celebration, he makes his initial escape attempt. He is recaptured by local police and returned to the chain gang. The Captain has Luke fitted with leg irons and delivers a warning speech to the inmates. Shortly afterward, Luke escapes a second time. While free, Luke mails the prison a magazine that includes a photograph of himself with two beautiful women. He is soon recaptured, beaten, returned to the prison camp, and fitted with two sets of leg irons. The Captain warns Luke that he will be killed if he ever attempts to escape again. Luke becomes annoyed by the other prisoners fawning over the magazine photo and says he faked it. At first, the other prisoners are angry, but when Luke returns after a long stay in the box and is punished by being forced to eat a massive serving of rice, the others help him finish it.\r\nFor his escape, the guards brutalize Luke to the point of exhaustion, particularly when he is forced to repeatedly dig and refill a grave-sized hole in the prison yard. He eventually breaks down and begs for mercy, losing the respect of his fellow inmates. Luke seems to succumb to cowardice and become an errand boy for the guards, but when an opportunity presents itself, he flees again by stealing a truck, with Dragline joining him. After abandoning the truck, the pair agree to separate. Luke enters a church and talks to God, whom he blames for sabotaging him so he cannot win in life. Police cars appear moments later, and Dragline arrives to tell him that he will not be hurt if he surrenders peacefully. Instead, Luke mockingly repeats the Captain's warning speech at the police. Godfrey shoots him in the neck. Dragline carries Luke outside and surrenders, but charges at Godfrey and strangles him until he is subdued by the guards. While Luke is loaded into the Captain's car, Dragline tearfully implores him to live. Against the local police's protests, the Captain decides to take Luke to the distant prison infirmary instead of the local hospital, ensuring Luke will not survive the trip. As the car drives away, a semi-conscious Luke weakly smiles while the tires crush Godfrey's sunglasses. After Luke's implied death, Dragline and the other prisoners fondly reminisce about him.\r\nSome time later, the prison crew works near a rural intersection close to where Luke was shot, with Dragline now wearing leg irons and a new Walking Boss supervising.\r\nCast\r\nPaul Newman as Lucas \"Luke\" Jackson\r\nGeorge Kennedy as Clarence \"Dragline\" Slidell\r\nStrother Martin as The Captain\r\nJo Van Fleet as Arletta Jackson\r\nJoy Harmon as “Lucille”\r\nMorgan Woodward as Walking Boss / Godfrey\r\nLuke Askew as Boss Paul\r\nRobert Donner as Boss \"Shorty\"\r\nClifton James as Carr, The Floor Walker\r\nJohn McLiam as Boss Kean\r\nAndre Trottier as Boss Popler\r\nCharles Tyner as Boss Higgins\r\nJ. D. Cannon as \"Society Red\"\r\nLou Antonio as \"Koko\"\r\nRobert Drivas as Steve \"Loudmouth Steve\"\r\nMarc Cavell as \"Rabbitt\"\r\nRichard Davalos as Dick \"Blind Dick\"\r\nWarren Finnerty as \"Tattoo\"\r\nDennis Hopper as Babalugats\r\nWayne Rogers as \"Gambler\"\r\nHarry Dean Stanton as \"Tramp\"\r\nRalph Waite as \"Alibi\"\r\nAnthony Zerbe as \"Dog Boy\"\r\nBuck Kartalian as \"Dynamite\"\r\nJoe Don Baker as \"Fixer\" (uncredited)\r\nJames Gammon as \"Sleepy\" (uncredited)\r\nProduction\r\nFlorida prison\r\nPearce, a merchant seaman who later became a counterfeiter and safe cracker, wrote the novel Cool Hand Luke about his experiences working on a chain gang while serving in a Florida prison. He sold the story to Warner Bros. for $80,000 and received another $15,000 to write the screenplay. After working in television for over a decade, Rosenberg chose it to make it his directorial debut in cinema. He took the idea to Jalem Productions, owned by Jack Lemmon. Since Pearce had no experience writing screenplays, his draft was reworked by Frank Pierson. Conrad Hall was hired as the cinematographer, while Paul Newman's brother, Arthur, was hired as the unit production manager. Newman's biographer Marie Edelman Borden wrote that the \"tough, honest\" script drew together threads from earlier movies, especially Hombre, Newman's earlier film of 1967. Rosenberg altered the script's original ending, adding \"an upbeat ending that would reprise Luke's (and Newman's) trademark smile.\"\r\nCasting\r\nPaul Newman's character, Luke, is a decorated war veteran who is sentenced to serve two years in a Florida rural prison. He constantly defies the prison authorities, becoming a leader among the prisoners, as well as escaping multiple times. While the script was being developed, the leading role was initially considered for Jack Lemmon or Telly Savalas. Newman asked to play the leading role after hearing about the project. To develop his character, he traveled to West Virginia, where he recorded local accents and surveyed people's behavior. George Kennedy turned in an Academy Award-winning performance as Dragline, who fights Luke and comes to respect him. During the nomination process, worried about the box-office success of Camelot and Bonnie and Clyde, Kennedy spent $5,000 on trade advertising to promote himself. He later said that thanks to the award, his salary was \"multiplied by ten the minute won\", adding, \"the happiest part was that I didn't have to play only villains anymore\".\r\nStrother Martin, known for his appearances in westerns, was cast as the Captain, a prison warden depicted as a cruel and insensitive leader, severely punishing Luke for his escapes. The role of Luke's dying mother, Arletta, who visits him in prison, was passed to Jo Van Fleet after it was rejected by Bette Davis. Morgan Woodward was cast as Boss Godfrey, a laconic, cruel and remorseless prison officer Woodward described as a \"walking Mephistopheles.\" He was dubbed \"the man with no eyes\" by the inmates for his mirrored sunglasses. The blonde Joy Harmon was cast for the scene where she teases the prisoners by washing her car after her manager, Leon Lance, contacted the producers. She auditioned in front of Rosenberg and Newman wearing a bikini, without speaking.\r\nFilming\r\nFilming began on October 3, 1966, on the San Joaquin River Delta. The set, imitating a southern prison farm, was built in Stockton, California. The filmmakers sent a crew to Tavares Road Prison in Tavares, Florida, where Pearce had served his time, to take photographs and measurements. The structures built in Stockton included barracks, a mess hall, the warden's quarters, a guard shack and dog kennels. The trees on the set were decorated with spanish moss that the producers took to the area. The construction soon attracted the attention of a county building inspector who confused it with migrant worker housing and ordered it \"condemned for code violations\". The opening scene where Newman cuts the parking meters was filmed in Lodi, California. The scene in which Luke is chased by bloodhounds and other exteriors were shot in Jacksonville, Florida, at Callahan Road Prison. Luke was played by a stunt actor, using dogs from the Florida Department of Corrections.\r\nRosenberg wanted the cast to internalize life on a chain gang and banned the presence of wives on set. After Harmon arrived on location, she remained for two days in her hotel room, and wasn't seen by the rest of the cast until shooting commenced. Despite Rosenberg's intentions, the scene was ultimately filmed separately. Rosenberg instructed an unaware Harmon of the different movements and expressions he wanted. Originally planned to be shot in half a day, Harmon's scene took three. For the part of the scene featuring the chain gang, Rosenberg substituted a teenage cheerleader, who wore an overcoat.\r\nSoundtrack\r\nThe Academy Award-nominated original score was by Lalo Schifrin, who wrote tunes with a background in popular music and jazz. Some tracks include guitars, banjos and harmonicas; others include trumpets, violins, flutes and piano.\r\nAn edited version of the musical cue from the Tar Sequence (where the inmates are energetically paving the road) has been used for years as the theme music for local television stations' news programs around the world, mostly those owned and operated by ABC in the United States. Although the music was written for the film, it became more familiar for its association with TV news, in part because its staccato melody resembles the sound of a telegraph.\r\nThemes\r\nChristian imagery\r\nPierson included in his draft explicit religious symbolism. The film contains several elements based on Christian themes, including the concept of Luke as a saint who wins over the crowds and is ultimately sacrificed. Luke is portrayed as a \"Jesus-like redeemer figure\". After winning the egg-eating bet, he lies exhausted on the table in the position of Jesus as depicted in his crucifixion, hands outstretched, feet folded over each other. After learning of his mother's death, Luke sings \"Plastic Jesus\". Greg Garrett also compares Luke to Jesus, in that like Jesus, he was not physically threatening to society because of his actions, and like Jesus' crucifixion, his punishment was \"out of all proportion\".\r\nLuke challenges God during the rainstorm on the road, telling him to do anything to him. Later, while he is digging and filling trenches and confronted by the guards, Tramp (Harry Dean Stanton) performs the spiritual \"No Grave Gonna Keep my Body Down\". Toward the end of the film, Luke speaks to God, evoking the conversation between God and Jesus at the Garden of Gethsemane, depicted in the Gospel of Luke. After Luke's talk, Dragline functions as a Judas, who delivers Luke to the authorities, trying to convince him to surrender. In the final scene, Dragline eulogizes Luke. He explains that despite Luke's death, his actions succeeded in defeating the system. The closing shot shows inmates working on crossroads from far above, such that the intersection is in the shape of the cross. Superimposed on this is the repaired photo Luke sent during his second escape, the creases of which also form a cross.\r\nUse of traffic signs and signals\r\nDifferent traffic signs are used throughout the film, complementing the characters' actions. At the beginning, while Luke cuts the heads off the parking meters, the word \"Violation\" appears. Stop signs are also seen. Instances include the road-paving scene and the last scene, where the road meets at a cross section. Traffic lights turn from green to red in the background at the time Luke is arrested, while at the end, when he is fatally wounded, a green light in the background turns red.\r\n\"Failure to communicate\"\r\nAfter writing the line, Pierson worried that the phrase was too complex for the warden. To explain its origin, he created a backstory that was included in the stage directions. Pierson explained that in order to advance in the Florida prison system, officers had to take criminology and penology courses at the state university, showing how the warden might know such words. Strother Martin later clarified that he felt the line was the kind that his character would very likely have heard or read from some \"pointy-headed intellectuals\" who had begun to infiltrate his character's world under the general rubric of a new, enlightened approach to incarceration. Some authors believe that the quotation was a metaphor for the ongoing Vietnam War, which was taking place during the filming; others have applied it to corporations and even teenagers. The quotation was listed at number 11 on the American Film Institute's list of the 100 most memorable movie lines.\r\nA sample of the line is included in the Guns N' Roses songs \"Civil War\" and \"Madagascar\". Zero Mostel paraphrases the line in The Great Bank Robbery (1969). When Strother Martin hosted Saturday Night Live on April 19, 1980, he played the strict owner of a language camp for children, parodying his Cool Hand Luke role. He paraphrased his line from the movie as, \"What we have here is failure to communicate BILINGUALLY!\"\r\nRelease and reception\r\nCool Hand Luke opened on October 31, 1967, at Loew's State Theatre in New York City. The proceeds of the premiere went to charities. The film was a box-office success, grossing $16,217,773 in domestic screenings.\r\nVariety called Newman's performance \"excellent\" and the supporting cast \"versatile and competent.\" The New York Times praised the film, remarking Pearce and Pierson's \"sharp script\", Rosenberg's \"ruthlessly realistic and plausible\" staging and direction and Newman's \"splendid\" performance with an \"unfaultable\" cast that \"elevates\" it among other prison films. Kennedy's portrayal was considered \"powerfully obsessive\" and the actors's playing the prison staff, \"blood-chilling\". The New York Daily News gave Cool Hand Luke three-and-a-half stars. Reviewer Ann Guarino noted that the film was based on Pearce's experience working with a chain gang and added, \"if the cruelties depicted are true, the film should encourage reforms\". Guarino called Newman's acting \"excellent\" and \"charming and likeable\", and wrote that \"humor is supplied\" by Kennedy. She wrote that Arletta was \"played outstandingly\" by van Fleet, that Martin was \"effective\" as the warden and that the rest of the cast \"do well in their roles\". For The Boston Globe, Marjory Adams noted that Cool Hand Luke \"hits hard, spares no punches, deals with rough, sadistic and unhappy men\". The review deemed Newman \"tremendously effective\", and his portrayal \"played with perceptiveness, honesty and compassion\". Adams pointed out that \"Kennedy stands out as unofficial leader of the convicts\", she called van Fleet's role \"short but poignant\" and Harmon's appearance \"a masterpiece of woman's inhumanity to men\". According to Adams, the direction by Rosenberg was \"sharp, discerning and realistic\".\r\nFor the Chicago Tribune, Clifford Terry wrote that the film \"works beautifully\", adding that it is \"sharp, absorbing, extremely entertaining\". Terry remarked on Newman's \"usual competent performance\" and the \"strong support of the cast\", and praised Kennedy, Martin, Askew and Woodward. Van Fleet's acting was deemed \"masterfully played\". Rosenberg's direction was called \"diverse\" in its \"exploration of moods\". Terry opined that the \"believable, tuned-in dialog\" by Pierson and Person and Conrad Hall's \"sun-centered photography\" created a \"great feeling of the southern discomfort\". He felt that \"the final 10 minutes\" that featured Luke's monologue \"almost destroy the preceding 110\", with the \"unlikely\" monologue and the \"artsy camera shot\" of the breaking of the \"hating overseer's sunglasses\" contributing to the scene's \"awkward artificiality\". But \"everything else works\", Terry wrote.\r\nFor the Los Angeles Times, reviewer Charles Champlin called the film \"remarkably interesting and impressive\". He wrote that Cool Hand Luke \"has its flaws\" that \"mar an otherwise special achievement\", but that \"it still remains an achievement\". He felt that the film was a \"triumph\" for Newman. Champlin deemed the scene featuring van Fleet a \"stunning piece of writing and acting\". He called the roles of the prison staff \"triumphantly hateable\" and Kennedy \"superb\". He called the sequence with Harmon \"a scene of cruel sexuality\" and Schifrin's music \"lonely and hunting\". Champlin felt that Newman's end monologue was \"stagey, sentimental and redundant\". He added that Cool Hand Luke \"played at the level of observable reality\" and that \"the intrusion of cinematic artifice seems wholly wrong\". He wrote that the filmmakers \"had not reckoned their own strength at making their symbolic points\" but that the result was \"a picture with riveting impact\".\r\nTime Inc. wrote that \"the beauty comes from the careful building of the individuals' characters\". Its review said that Rosenberg \"tells the story simply and directly\", while lamenting the \"anti-climatic\", \"unfortunate montages\" at the end of the film. The St. Louis Dispatch praised Kennedy's acting as \"raw realism in a fine performance\" and Rosenberg's work as \"above the cut of the ordinary chain-gang motion picture\". The review praised the \"fluid camera, working in for telling expressions\" that made the prisoners \"merge as varied and interesting individuals\". The Austin American-Statesman called the film \"absorbing, well-thought-out\". The script was deemed \"taut and deftly honed, flavored by humor and perceptive accents\" and Rosenberg's direction \"smoothly flowing as it is brutally realistic and occasionally raw\". Newman's performance was hailed as \"sureness as style that is totally convincing\"; the review concluded that the film \"can be appreciated on any level\".\r\nLater reviews\r\nThe review aggregator site Rotten Tomatoes gives the film a score of 100% based on reviews by 53 critics, and an average of 8.8/10. Its critical consensus states, \"Though hampered by Stuart Rosenberg's direction, Cool Hand Luke is held aloft by a stellar script and one of Paul Newman's most indelible performances.\" Empire rated it five stars out of five, declaring the movie one of Newman's best performances. Slant rated the film three stars out of four. It described Newman's role as \"iconic\", also praising its cinematography and sound score. Allmovie praised Newman's performance as \"one of the most indelible anti-authoritarian heroes in movie history\". Roger Ebert included the film in his review collection The Great Movies, rating it four stars out of four. He called it a \"great\" film and also an anti-establishment one during the Vietnam War. He believed the film was a product of its time and that no major film company would be interested in producing a film of such \"physical punishment, psychological cruelty, hopelessness and equal parts of sadism and masochism\" today. He praised the cinematography, capturing the \"punishing heat\" of the location, and stated that \"the physical presence of Paul Newman is the reason this movie works: The smile, the innocent blue eyes, the lack of strutting\", which no other actor could have produced as effectively.\r\nNewman's biographer Lawrence J. Quirk considered it one of Newman's weaker performances, writing, \"For once, even Newman's famed charisma fails him, for in Cool Hand Luke he completely lacks the charm that, say, Al Pacino in Scarecrow effortlessly exhibits when he plays a screw-up who also winds up (briefly) incarcerated.\" Quirk added that Newman's performance was stronger in the second half: \"to be fair to Newman, he was trying his damnedest to play an impossible part, since Luke is a convict's rationalization fantasy and never a real character\". Some authors have criticized the film's depiction of prison life at the time. In a review called \"Sheer Beauty in the Wrong Place\", Life, while praising the film's photography, criticized the influence of the visual styles in the depictions of the prison camp. The magazine declared that the landscapes turned it into \"a rest camp the men are getting plenty of sleep, food and healthy outdoor exercise\", and that despite the presence of the guards, it showed that there were \"worse ways to pay one's debt with society\". Ron Clooney also remarked that prisons \"were not hotels and certainly not the stuff of Cool Hand Luke movies\".\r\nAwards and nominations\r\nLegacy\r\nIn 2003, AFI's 100 Years...100 Heroes & Villains rated Luke the 30th-greatest hero in American cinema, and three years later, AFI's 100 Years...100 Cheers: America's Most Inspiring Movies rated Cool Hand Luke number 71. In 2006, Luke was ranked 53rd in Empire magazine's \"The 100 Greatest Movie Characters.\" The movie solidified Newman's status as a box-office star, while the film is considered a touchstone of the era. The film was an inductee of the 2005 National Film Registry list.\r\nThe book was adapted into a West End play by Emma Reeves. It opened at London's Aldwych Theatre starring Marc Warren, but closed after less than two months, after poor reviews. The show was chosen by The Times both as \"Critic's Choice\" and \"What the Critics Would Pay To See\".\r\nAn episode of the television show The Dukes of Hazzard titled \"Cool Hands Luke and Bo\" was shown with Morgan Woodward playing \"Colonel Cassius Claiborne\" the boss of a neighboring county and warden of its prison farm. He wears the trademark shades of Boss Godfrey throughout the episode.\r\nNashville-based Christian alternative rock band Cool Hand Luke is named after the film.",
    "html": "<p>Cool Hand Luke is a 1967 American prison drama film directed by Stuart Rosenberg, starring Paul Newman and featuring George Kennedy in an Oscar-winning performance. Newman stars in the title role as Luke, a prisoner in a Florida prison camp who refuses to submit to the system. Set in the early 1950s, it is based on Donn Pearce's 1965 novel Cool Hand Luke.</p><p>Roger Ebert called Cool Hand Luke an anti-establishment film shot during emerging popular opposition to the Vietnam War. Filming took place within California's San Joaquin River Delta region; the set, imitating a prison farm in the Deep South, was based on photographs and measurements made by a crew the filmmakers sent to a Road Prison in Gainesville, Florida. The film uses Christian imagery.</p><p>Upon its release, Cool Hand Luke received favorable reviews and was a box-office success. It cemented Newman's status as one of the era's top actors, and was called the \"touchstone of an era\". Newman was nominated for the Academy Award for Best Actor, Kennedy won the Academy Award for Best Supporting Actor, Pearce and Pierson were nominated for the Academy Award for Best Adapted Screenplay, and Lalo Schifrin was nominated for the Academy Award for Best Original Score. In 2005, the United States Library of Congress selected the film for preservation in the National Film Registry, considering it \"culturally, historically, or aesthetically significant\". The film has a 100% rating on the review aggregator website Rotten Tomatoes, and the prison warden's (Strother Martin) line in the film beginning with \"What we've got here is failure to communicate\" was listed at number 11 on the American Film Institute's 100 Years... 100 Movie Quotes list.</p><br/><h3>Plot</h3><p>In early 1950s Florida, decorated World War II veteran Lucas \"Luke\" Jackson drunkenly beheads several parking meters. He is sentenced to two years on a chain gang in a prison camp run by the Captain, a stern warden, and Walking Boss Godfrey, a quiet rifleman nicknamed \"the man with no eyes\" because he always wears mirrored sunglasses. There, even minor violations are punished by \"a night in the box\", a small wooden booth in the prison yard with limited air and space.</p><p>Luke refuses to observe the established order among the prisoners and quickly runs afoul of their leader, Dragline. When the two have a boxing match, Luke is severely outmatched but refuses to acquiesce. Eventually, Dragline stops the fight, but Luke's tenacity earns the prisoners' respect and draws the guards' attention. He later wins a poker game by bluffing with a hand worth nothing, and Dragline christens him \"Cool Hand Luke\".</p><p>After a visit from his sick mother, Arletta, Luke becomes more optimistic about his situation. He continually confronts the Captain and the guards, and his sense of humor and independence prove inspiring to the other prisoners. Luke's struggle for supremacy peaks when he leads a work crew in a seemingly impossible but successful effort to complete a road-paving job in less than a day. The prisoners start to idolize him after he wins a bet that he can eat 50 hard-boiled eggs in an hour.</p><p>One evening, Luke receives notice that his mother has died. Anticipating that Luke might attempt to escape to attend the funeral, the Captain has him locked in the box. After being released, Luke becomes determined to escape. Under cover of a Fourth of July celebration, he makes his initial escape attempt. He is recaptured by local police and returned to the chain gang. The Captain has Luke fitted with leg irons and delivers a warning speech to the inmates. Shortly afterward, Luke escapes a second time. While free, Luke mails the prison a magazine that includes a photograph of himself with two beautiful women. He is soon recaptured, beaten, returned to the prison camp, and fitted with two sets of leg irons. The Captain warns Luke that he will be killed if he ever attempts to escape again. Luke becomes annoyed by the other prisoners fawning over the magazine photo and says he faked it. At first, the other prisoners are angry, but when Luke returns after a long stay in the box and is punished by being forced to eat a massive serving of rice, the others help him finish it.</p><p>For his escape, the guards brutalize Luke to the point of exhaustion, particularly when he is forced to repeatedly dig and refill a grave-sized hole in the prison yard. He eventually breaks down and begs for mercy, losing the respect of his fellow inmates. Luke seems to succumb to cowardice and become an errand boy for the guards, but when an opportunity presents itself, he flees again by stealing a truck, with Dragline joining him. After abandoning the truck, the pair agree to separate. Luke enters a church and talks to God, whom he blames for sabotaging him so he cannot win in life. Police cars appear moments later, and Dragline arrives to tell him that he will not be hurt if he surrenders peacefully. Instead, Luke mockingly repeats the Captain's warning speech at the police. Godfrey shoots him in the neck. Dragline carries Luke outside and surrenders, but charges at Godfrey and strangles him until he is subdued by the guards. While Luke is loaded into the Captain's car, Dragline tearfully implores him to live. Against the local police's protests, the Captain decides to take Luke to the distant prison infirmary instead of the local hospital, ensuring Luke will not survive the trip. As the car drives away, a semi-conscious Luke weakly smiles while the tires crush Godfrey's sunglasses. After Luke's implied death, Dragline and the other prisoners fondly reminisce about him.</p><p>Some time later, the prison crew works near a rural intersection close to where Luke was shot, with Dragline now wearing leg irons and a new Walking Boss supervising.</p><br/><h3>Cast</h3><ul><li>Paul Newman as Lucas \"Luke\" Jackson</li><li>George Kennedy as Clarence \"Dragline\" Slidell</li><li>Strother Martin as The Captain</li><li>Jo Van Fleet as Arletta Jackson</li><li>Joy Harmon as “Lucille”</li><li>Morgan Woodward as Walking Boss / Godfrey</li><li>Luke Askew as Boss Paul</li><li>Robert Donner as Boss \"Shorty\"</li><li>Clifton James as Carr, The Floor Walker</li><li>John McLiam as Boss Kean</li><li>Andre Trottier as Boss Popler</li><li>Charles Tyner as Boss Higgins</li><li>J. D. Cannon as \"Society Red\"</li><li>Lou Antonio as \"Koko\"</li><li>Robert Drivas as Steve \"Loudmouth Steve\"</li><li>Marc Cavell as \"Rabbitt\"</li><li>Richard Davalos as Dick \"Blind Dick\"</li><li>Warren Finnerty as \"Tattoo\"</li><li>Dennis Hopper as Babalugats</li><li>Wayne Rogers as \"Gambler\"</li><li>Harry Dean Stanton as \"Tramp\"</li><li>Ralph Waite as \"Alibi\"</li><li>Anthony Zerbe as \"Dog Boy\"</li><li>Buck Kartalian as \"Dynamite\"</li><li>Joe Don Baker as \"Fixer\" (uncredited)</li><li>James Gammon as \"Sleepy\" (uncredited)</li></ul><br/><h3>Production</h3><h4>Florida prison</h4><p>Pearce, a merchant seaman who later became a counterfeiter and safe cracker, wrote the novel Cool Hand Luke about his experiences working on a chain gang while serving in a Florida prison. He sold the story to Warner Bros. for $80,000 and received another $15,000 to write the screenplay. After working in television for over a decade, Rosenberg chose it to make it his directorial debut in cinema. He took the idea to Jalem Productions, owned by Jack Lemmon. Since Pearce had no experience writing screenplays, his draft was reworked by Frank Pierson. Conrad Hall was hired as the cinematographer, while Paul Newman's brother, Arthur, was hired as the unit production manager. Newman's biographer Marie Edelman Borden wrote that the \"tough, honest\" script drew together threads from earlier movies, especially Hombre, Newman's earlier film of 1967. Rosenberg altered the script's original ending, adding \"an upbeat ending that would reprise Luke's (and Newman's) trademark smile.\"</p><h4>Casting</h4><p>Paul Newman's character, Luke, is a decorated war veteran who is sentenced to serve two years in a Florida rural prison. He constantly defies the prison authorities, becoming a leader among the prisoners, as well as escaping multiple times. While the script was being developed, the leading role was initially considered for Jack Lemmon or Telly Savalas. Newman asked to play the leading role after hearing about the project. To develop his character, he traveled to West Virginia, where he recorded local accents and surveyed people's behavior. George Kennedy turned in an Academy Award-winning performance as Dragline, who fights Luke and comes to respect him. During the nomination process, worried about the box-office success of Camelot and Bonnie and Clyde, Kennedy spent $5,000 on trade advertising to promote himself. He later said that thanks to the award, his salary was \"multiplied by ten the minute won\", adding, \"the happiest part was that I didn't have to play only villains anymore\".</p><p>Strother Martin, known for his appearances in westerns, was cast as the Captain, a prison warden depicted as a cruel and insensitive leader, severely punishing Luke for his escapes. The role of Luke's dying mother, Arletta, who visits him in prison, was passed to Jo Van Fleet after it was rejected by Bette Davis. Morgan Woodward was cast as Boss Godfrey, a laconic, cruel and remorseless prison officer Woodward described as a \"walking Mephistopheles.\" He was dubbed \"the man with no eyes\" by the inmates for his mirrored sunglasses. The blonde Joy Harmon was cast for the scene where she teases the prisoners by washing her car after her manager, Leon Lance, contacted the producers. She auditioned in front of Rosenberg and Newman wearing a bikini, without speaking.</p><h4>Filming</h4><p>Filming began on October 3, 1966, on the San Joaquin River Delta. The set, imitating a southern prison farm, was built in Stockton, California. The filmmakers sent a crew to Tavares Road Prison in Tavares, Florida, where Pearce had served his time, to take photographs and measurements. The structures built in Stockton included barracks, a mess hall, the warden's quarters, a guard shack and dog kennels. The trees on the set were decorated with spanish moss that the producers took to the area. The construction soon attracted the attention of a county building inspector who confused it with migrant worker housing and ordered it \"condemned for code violations\". The opening scene where Newman cuts the parking meters was filmed in Lodi, California. The scene in which Luke is chased by bloodhounds and other exteriors were shot in Jacksonville, Florida, at Callahan Road Prison. Luke was played by a stunt actor, using dogs from the Florida Department of Corrections.</p><p>Rosenberg wanted the cast to internalize life on a chain gang and banned the presence of wives on set. After Harmon arrived on location, she remained for two days in her hotel room, and wasn't seen by the rest of the cast until shooting commenced. Despite Rosenberg's intentions, the scene was ultimately filmed separately. Rosenberg instructed an unaware Harmon of the different movements and expressions he wanted. Originally planned to be shot in half a day, Harmon's scene took three. For the part of the scene featuring the chain gang, Rosenberg substituted a teenage cheerleader, who wore an overcoat.</p><h4>Soundtrack</h4><p>The Academy Award-nominated original score was by Lalo Schifrin, who wrote tunes with a background in popular music and jazz. Some tracks include guitars, banjos and harmonicas; others include trumpets, violins, flutes and piano.</p><p>An edited version of the musical cue from the Tar Sequence (where the inmates are energetically paving the road) has been used for years as the theme music for local television stations' news programs around the world, mostly those owned and operated by ABC in the United States. Although the music was written for the film, it became more familiar for its association with TV news, in part because its staccato melody resembles the sound of a telegraph.</p><br/><h3>Themes</h3><h4>Christian imagery</h4><p>Pierson included in his draft explicit religious symbolism. The film contains several elements based on Christian themes, including the concept of Luke as a saint who wins over the crowds and is ultimately sacrificed. Luke is portrayed as a \"Jesus-like redeemer figure\". After winning the egg-eating bet, he lies exhausted on the table in the position of Jesus as depicted in his crucifixion, hands outstretched, feet folded over each other. After learning of his mother's death, Luke sings \"Plastic Jesus\". Greg Garrett also compares Luke to Jesus, in that like Jesus, he was not physically threatening to society because of his actions, and like Jesus' crucifixion, his punishment was \"out of all proportion\".</p><p>Luke challenges God during the rainstorm on the road, telling him to do anything to him. Later, while he is digging and filling trenches and confronted by the guards, Tramp (Harry Dean Stanton) performs the spiritual \"No Grave Gonna Keep my Body Down\". Toward the end of the film, Luke speaks to God, evoking the conversation between God and Jesus at the Garden of Gethsemane, depicted in the Gospel of Luke. After Luke's talk, Dragline functions as a Judas, who delivers Luke to the authorities, trying to convince him to surrender. In the final scene, Dragline eulogizes Luke. He explains that despite Luke's death, his actions succeeded in defeating the system. The closing shot shows inmates working on crossroads from far above, such that the intersection is in the shape of the cross. Superimposed on this is the repaired photo Luke sent during his second escape, the creases of which also form a cross.</p><h4>Use of traffic signs and signals</h4><p>Different traffic signs are used throughout the film, complementing the characters' actions. At the beginning, while Luke cuts the heads off the parking meters, the word \"Violation\" appears. Stop signs are also seen. Instances include the road-paving scene and the last scene, where the road meets at a cross section. Traffic lights turn from green to red in the background at the time Luke is arrested, while at the end, when he is fatally wounded, a green light in the background turns red.</p><h4>\"Failure to communicate\"</h4><p>After writing the line, Pierson worried that the phrase was too complex for the warden. To explain its origin, he created a backstory that was included in the stage directions. Pierson explained that in order to advance in the Florida prison system, officers had to take criminology and penology courses at the state university, showing how the warden might know such words. Strother Martin later clarified that he felt the line was the kind that his character would very likely have heard or read from some \"pointy-headed intellectuals\" who had begun to infiltrate his character's world under the general rubric of a new, enlightened approach to incarceration. Some authors believe that the quotation was a metaphor for the ongoing Vietnam War, which was taking place during the filming; others have applied it to corporations and even teenagers. The quotation was listed at number 11 on the American Film Institute's list of the 100 most memorable movie lines.</p><p>A sample of the line is included in the Guns N' Roses songs \"Civil War\" and \"Madagascar\". Zero Mostel paraphrases the line in The Great Bank Robbery (1969). When Strother Martin hosted Saturday Night Live on April 19, 1980, he played the strict owner of a language camp for children, parodying his Cool Hand Luke role. He paraphrased his line from the movie as, \"What we have here is failure to communicate BILINGUALLY!\"</p><br/><h3>Release and reception</h3><p>Cool Hand Luke opened on October 31, 1967, at Loew's State Theatre in New York City. The proceeds of the premiere went to charities. The film was a box-office success, grossing $16,217,773 in domestic screenings.</p><p>Variety called Newman's performance \"excellent\" and the supporting cast \"versatile and competent.\" The New York Times praised the film, remarking Pearce and Pierson's \"sharp script\", Rosenberg's \"ruthlessly realistic and plausible\" staging and direction and Newman's \"splendid\" performance with an \"unfaultable\" cast that \"elevates\" it among other prison films. Kennedy's portrayal was considered \"powerfully obsessive\" and the actors's playing the prison staff, \"blood-chilling\". The New York Daily News gave Cool Hand Luke three-and-a-half stars. Reviewer Ann Guarino noted that the film was based on Pearce's experience working with a chain gang and added, \"if the cruelties depicted are true, the film should encourage reforms\". Guarino called Newman's acting \"excellent\" and \"charming and likeable\", and wrote that \"humor is supplied\" by Kennedy. She wrote that Arletta was \"played outstandingly\" by van Fleet, that Martin was \"effective\" as the warden and that the rest of the cast \"do well in their roles\". For The Boston Globe, Marjory Adams noted that Cool Hand Luke \"hits hard, spares no punches, deals with rough, sadistic and unhappy men\". The review deemed Newman \"tremendously effective\", and his portrayal \"played with perceptiveness, honesty and compassion\". Adams pointed out that \"Kennedy stands out as unofficial leader of the convicts\", she called van Fleet's role \"short but poignant\" and Harmon's appearance \"a masterpiece of woman's inhumanity to men\". According to Adams, the direction by Rosenberg was \"sharp, discerning and realistic\".</p><p>For the Chicago Tribune, Clifford Terry wrote that the film \"works beautifully\", adding that it is \"sharp, absorbing, extremely entertaining\". Terry remarked on Newman's \"usual competent performance\" and the \"strong support of the cast\", and praised Kennedy, Martin, Askew and Woodward. Van Fleet's acting was deemed \"masterfully played\". Rosenberg's direction was called \"diverse\" in its \"exploration of moods\". Terry opined that the \"believable, tuned-in dialog\" by Pierson and Person and Conrad Hall's \"sun-centered photography\" created a \"great feeling of the southern discomfort\". He felt that \"the final 10 minutes\" that featured Luke's monologue \"almost destroy the preceding 110\", with the \"unlikely\" monologue and the \"artsy camera shot\" of the breaking of the \"hating overseer's sunglasses\" contributing to the scene's \"awkward artificiality\". But \"everything else works\", Terry wrote.</p><p>For the Los Angeles Times, reviewer Charles Champlin called the film \"remarkably interesting and impressive\". He wrote that Cool Hand Luke \"has its flaws\" that \"mar an otherwise special achievement\", but that \"it still remains an achievement\". He felt that the film was a \"triumph\" for Newman. Champlin deemed the scene featuring van Fleet a \"stunning piece of writing and acting\". He called the roles of the prison staff \"triumphantly hateable\" and Kennedy \"superb\". He called the sequence with Harmon \"a scene of cruel sexuality\" and Schifrin's music \"lonely and hunting\". Champlin felt that Newman's end monologue was \"stagey, sentimental and redundant\". He added that Cool Hand Luke \"played at the level of observable reality\" and that \"the intrusion of cinematic artifice seems wholly wrong\". He wrote that the filmmakers \"had not reckoned their own strength at making their symbolic points\" but that the result was \"a picture with riveting impact\".</p><p>Time Inc. wrote that \"the beauty comes from the careful building of the individuals' characters\". Its review said that Rosenberg \"tells the story simply and directly\", while lamenting the \"anti-climatic\", \"unfortunate montages\" at the end of the film. The St. Louis Dispatch praised Kennedy's acting as \"raw realism in a fine performance\" and Rosenberg's work as \"above the cut of the ordinary chain-gang motion picture\". The review praised the \"fluid camera, working in for telling expressions\" that made the prisoners \"merge as varied and interesting individuals\". The Austin American-Statesman called the film \"absorbing, well-thought-out\". The script was deemed \"taut and deftly honed, flavored by humor and perceptive accents\" and Rosenberg's direction \"smoothly flowing as it is brutally realistic and occasionally raw\". Newman's performance was hailed as \"sureness as style that is totally convincing\"; the review concluded that the film \"can be appreciated on any level\".</p><h4>Later reviews</h4><p>The review aggregator site Rotten Tomatoes gives the film a score of 100% based on reviews by 53 critics, and an average of 8.8/10. Its critical consensus states, \"Though hampered by Stuart Rosenberg's direction, Cool Hand Luke is held aloft by a stellar script and one of Paul Newman's most indelible performances.\" Empire rated it five stars out of five, declaring the movie one of Newman's best performances. Slant rated the film three stars out of four. It described Newman's role as \"iconic\", also praising its cinematography and sound score. Allmovie praised Newman's performance as \"one of the most indelible anti-authoritarian heroes in movie history\". Roger Ebert included the film in his review collection The Great Movies, rating it four stars out of four. He called it a \"great\" film and also an anti-establishment one during the Vietnam War. He believed the film was a product of its time and that no major film company would be interested in producing a film of such \"physical punishment, psychological cruelty, hopelessness and equal parts of sadism and masochism\" today. He praised the cinematography, capturing the \"punishing heat\" of the location, and stated that \"the physical presence of Paul Newman is the reason this movie works: The smile, the innocent blue eyes, the lack of strutting\", which no other actor could have produced as effectively.</p><p>Newman's biographer Lawrence J. Quirk considered it one of Newman's weaker performances, writing, \"For once, even Newman's famed charisma fails him, for in Cool Hand Luke he completely lacks the charm that, say, Al Pacino in Scarecrow effortlessly exhibits when he plays a screw-up who also winds up (briefly) incarcerated.\" Quirk added that Newman's performance was stronger in the second half: \"to be fair to Newman, he was trying his damnedest to play an impossible part, since Luke is a convict's rationalization fantasy and never a real character\". Some authors have criticized the film's depiction of prison life at the time. In a review called \"Sheer Beauty in the Wrong Place\", Life, while praising the film's photography, criticized the influence of the visual styles in the depictions of the prison camp. The magazine declared that the landscapes turned it into \"a rest camp the men are getting plenty of sleep, food and healthy outdoor exercise\", and that despite the presence of the guards, it showed that there were \"worse ways to pay one's debt with society\". Ron Clooney also remarked that prisons \"were not hotels and certainly not the stuff of Cool Hand Luke movies\".</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"4\"><span>Academy Awards</span></td><td><span>Best Actor</span></td><td><span>Paul Newman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>George Kennedy</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td><span>Donn Pearce</span> and <span>Frank Pierson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Music Score</span></td><td><span>Lalo Schifrin</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td rowspan=\"2\"><span>Stuart Rosenberg</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Faro Island Film Festival</td><td>Best Film</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Golden Globe Awards</span></td><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Paul Newman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td>George Kennedy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Laurel Awards</span></td><td colspan=\"2\">Top Drama</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Top Male Dramatic Performance</td><td>Paul Newman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Top Male Supporting Performance</td><td>George Kennedy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td><span>National Society of Film Critics Awards</span></td><td><span>Best Cinematography</span></td><td><span>Conrad L. Hall</span> <small>(also for <i><span>In Cold Blood</span></i>)</small></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><h4>Legacy</h4><p>In 2003, AFI's 100 Years...100 Heroes & Villains rated Luke the 30th-greatest hero in American cinema, and three years later, AFI's 100 Years...100 Cheers: America's Most Inspiring Movies rated Cool Hand Luke number 71. In 2006, Luke was ranked 53rd in Empire magazine's \"The 100 Greatest Movie Characters.\" The movie solidified Newman's status as a box-office star, while the film is considered a touchstone of the era. The film was an inductee of the 2005 National Film Registry list.</p><p>The book was adapted into a West End play by Emma Reeves. It opened at London's Aldwych Theatre starring Marc Warren, but closed after less than two months, after poor reviews. The show was chosen by The Times both as \"Critic's Choice\" and \"What the Critics Would Pay To See\".</p><p>An episode of the television show The Dukes of Hazzard titled \"Cool Hands Luke and Bo\" was shown with Morgan Woodward playing \"Colonel Cassius Claiborne\" the boss of a neighboring county and warden of its prison farm. He wears the trademark shades of Boss Godfrey throughout the episode.</p><p>Nashville-based Christian alternative rock band Cool Hand Luke is named after the film.</p><br/>"
  },
  "errorMessage": ""
}