{
  "imDbId": "tt0086250",
  "title": "Scarface",
  "fullTitle": "Scarface (1983)",
  "type": "Movie",
  "year": "1983",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "Scarface is one of those special movies, like \"The Godfather,\" that is willing to take a flawed, evil man and allow him to be human."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Perfomances are excellent, and despite its moralistic conclusion, the film has since become de rigueur viewing for crack barons, who know a good shoot-em-up when they see one."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/scarface/review/2000093855/",
      "rate": "100",
      "content": "A beautiful, at times poetic exercise in excess from Brian De Palma."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "90",
      "content": "Scarface is the most stylish and provocative - and maybe the most vicious - serious film about the American underworld since Francis Ford Coppola's \"Godfather.\""
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "80",
      "content": "It is a serious, often hilarious peek under the rock where nightmares strut in $800 suits and Armageddon lies around the next twist of treason."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Scarface is a grandiose modern morality play, excessive, broad and operatic at times."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Jay Scott",
      "link": "",
      "rate": "63",
      "content": "Scarface is a B- movie with singularly silly psychological pretensions: its neo-primitivism is to the complex moral cosmos of Francis Coppola's \"Godfather\" saga as Disney is to Dickens. [09 Dec 1983]"
    },
    {
      "publisher": "Boston Globe",
      "author": "Jay Carr",
      "link": "",
      "rate": "25",
      "content": "It plays like a crude \"Godfather\" parody, the sort that might amuse as a 10-minute sketch on \"Saturday Night Live,\" but curdles and collapses as a 143-minute film. [09 Dec 1983]"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "20",
      "content": "Brian De Palma dedicates this 1983 feature to Howard Hawks and Ben Hecht, authors of the 1932 original, though I doubt they would find much honor in his gory inflation of their crisp, 90-minute comic nightmare into a klumbering, self-important, arrhythmic downer of nearly three hours."
    }
  ],
  "errorMessage": ""
}