{
  "imDbId": "tt0086250",
  "title": "Scarface",
  "fullTitle": "Scarface (1983)",
  "type": "Movie",
  "year": "1983",
  "items": [
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3596039",
      "warningSpoilers": true,
      "date": "10 December 2016",
      "rate": "10",
      "helpful": "63 out of 73 found this helpful.",
      "title": "A stone cold, 100% gangster classic",
      "content": "Words alone cannot express how much I love this movie. The first time I saw it, it blew me away. When I watched it again recently it hadn't lost any of its impact. SCARFACE is, quite simply, one of the best films in the \"gangster\" genre that there is, if not the best. The simple tale tells of Tony Montana's journey from being a lowly refugee, to working in a cheap mobile café, to working for a drug lord's assistant, to working for a drug lord, to becoming a drug lord and then losing everything due to his own mistakes.De Palma here crafts an epic tale in what I consider to be his finest film. Although it runs for over two and a half hours, this is never less than engrossing, something that is partially due to the excellent acting we have on display from the ensemble cast. Al Pacino has never been better as the volatile Tony Montana, making the role his own and his performance is a totally convincing one right down to his appearance and accent. Steven Bauer is also very good in an understated role as his partner, his role always takes the backseat when compared to Pacino's but it is still a pivotal one. Michelle Pfeiffer and Mary Elizabeth Mastrantonio are the addicted wife and loving sister respectively, and as both of their loves are ruined, we feel their pain with them. The supporting cast includes great turns from Robert Loggia (drug lord), F. Murray Abraham (quietly sinister), Harris Yulin (a corrupt cop) and Paul Shenar (a drug baron).The film does start slowly but the build-up is worthwhile. De Palma's trademark excessiveness turns up in the form of a number of brutal shootings and, especially, a gruelling chainsaw murder. However, all the best is saved for the wildly excessive finale which, in my mind at least, even surpasses that of THE FURY. Pacino has dug his own grave and has destroyed his business and either killed or alienated all of his friends and family. He sits alone in his huge mansion, snorting from a pile of cocaine on his desk. It is at this point a small army invade the mansion and execute all of his staff; he must then battle them alone in a bloody massacre in which the outcome is foretold. I love this ending, with all the violence it holds, and I love the way that Pacino's body is so pumped full of drugs that he doesn't even notice it when he gets repeatedly shot. Who can forget the classic line \"Say hello to my little friend!\" as he machine-guns a dozen men on his staircase. A classic, re-watchable movie with the director and stars all at the peak of their game."
    },
    {
      "username": "Aditya_Gokhale",
      "userUrl": "https://www.imdb.com/user/ur3774967",
      "reviewLink": "https://www.imdb.com/review/rw1242450",
      "warningSpoilers": false,
      "date": "19 December 2005",
      "rate": "10",
      "helpful": "462 out of 551 found this helpful.",
      "title": "\"You wanna play rough?? OKAY!\"",
      "content": "\"Scarface\" has a major cult following even now, 22 years after its release.It has also been widely criticized as being very tacky, unrefined, over-the-top and all bloated up! These are people who compare Scarface to The Godfather movies. It is true that on the technical front, (cinematography, screenplay, direction, etc.) Scarface is way behind 'The Godfather'.But it is also true, that what Scarface has and some other gangster movies lack, is the rawness, the sheer crude approach of the gangsters. The Latino gangsters in this movie look much more menacing and real than any of the polished Italian or Irish gangsters from other gangster classics like 'The Godfather' or 'Goodfellas'. This is one of the major winning points of Scarface and I strongly believe that this fact has been written off as \"tackiness\" by most critics! I have seen the original 1932 Scarface, and I must say that both these movies are way too different from each other and should be seen as two different movies instead of praising the original over the \"remake\"! Al Pacino has been criticized to be over-the-top and loud in this movie. But how about considering that that is precisely the way the film-makers wanted Tony Montana's character to be! He is this angry young man who takes hasty decisions and throws fits of tantrum every other minute! He is not the calm Michael Corleone here. He is Tony Montana, a very tacky, uneducated individual who doesn't really think much and gets angry all the time!There is definitely a very 80s feel to this movie. The soundtrack is all 80s! I love some of the songs, including 'Gina and Elvira's theme', 'Push it to the limit' and the title track instrumental.There are some memorable and beautifully shot sequences, including the famous chainsaw scene, the Rebenga hit, the first meeting with Sosa and Tony's visit to his mother's.About the performances: Al Pacino is brilliant as the angry Cuban refugee. He has reportedly mentioned that he enjoyed playing Tony Montana the most in his entire career. And it really does seem like he has enjoyed himself thoroughly in all his scenes! One wonders what \"Scarface\" would be like without Pacino. I just couldn't imagine anyone else portraying Tony Montana and in all probabilities, the film wouldn't be as effective without him!Steven Bauer shines as Tony's friend Manny.Robert Loggia is wonderful as Tony's boss, Lopez. So is F. Murray Abraham (as Omar) in a small role.Then there is some eye-candy in the form of Elvira played by Michelle Pfeiffer. She looks beautiful and is adequate in her role.The director does go a bit overboard during a particular part in the climax. Without revealing anything, I would only say that that was the only little part that suffers due to improper handling.\"Scarface\" is definitely one of the most entertaining and one of the best gangster movies to ever come out. Enjoy it for what it is: a raw portrayal of the Drug Lords and their gangland!"
    },
    {
      "username": "akpiggott",
      "userUrl": "https://www.imdb.com/user/ur1252120",
      "reviewLink": "https://www.imdb.com/review/rw0205030",
      "warningSpoilers": false,
      "date": "12 September 2004",
      "rate": "9",
      "helpful": "436 out of 513 found this helpful.",
      "title": "Exceed to Excess",
      "content": "Every great gangster movie has under-currents of human drama. Don't expect an emotional story of guilt, retribution and despair from \"Scarface\". This is a tale of ferocious greed, corruption, and power. The darker side of the fabled \"American Dream\".Anybody complaining about the \"cheesiness\" of this film is missing the point. The superficial characters, cheesy music, and dated fashions further fuel the criticism of this life of diabolical excess. Nothing in the lives of these characters really matter, not on any human level at least. In fact the film practically borderlines satire, ironic considering all the gangsta rappers that were positively inspired by the lifestyle of Tony Montana.This isn't Brian DePalma's strongest directorial effort, it is occasionally excellent and well-handled (particularly the memorable finale), but frequently sinks to sloppy and misled. Thankfully, it is supported by a very strong script by Oliver Stone (probably good therapy for him, considering the coke habit he was tackling at the time). The themes are consistent, with the focus primarily on the life of Tony Montana, and the evolution of his character as he is consumed by greed and power. The dialogue is also excellent, see-sawing comfortably between humour and drama. There are many stand-out lines, which have since wormed their way into popular culture in one form or another.The cast help make it what it is as well, but this is really Pacino's film. One of his earlier less subtle performances (something much more common from him nowadays), this is a world entirely separate from Michael Corleone and Frank Serpico. Yet he is as watchable here as ever, in very entertaining (and intentionally over-the-top) form. It is hard to imagine another Tony Montana after seeing this film, in possibly one of the most mimicked performances ever. Pfeiffer stood out as dull and uncomfortable on first viewing, but I've come to realize how she plays out the part of the bored little wife. Not an exceptional effort, but unfairly misjudged. The supporting players are very good too, particularly Paul Shenar as the suave Alejandro Sosa.Powerful, occasionally humorous, sometimes shocking, and continually controversial. \"Scarface\" is one of the films of the eighties (whatever that might mean to you). An essential and accessible gangster flick, and a pop-culture landmark. 9/10"
    },
    {
      "username": "TruPretender",
      "userUrl": "https://www.imdb.com/user/ur3131494",
      "reviewLink": "https://www.imdb.com/review/rw1584852",
      "warningSpoilers": false,
      "date": "28 January 2007",
      "rate": "10",
      "helpful": "373 out of 490 found this helpful.",
      "title": "The Real Scarface.",
      "content": "\"A Classic is something that everybody wants to have read but nobody wants to read. A classic is also something that everyone praises but no one has read.\" -Mark Twain'Classic' seems to be the word used to describe \"Scarface\", Brian DePalma's 1983 film about opulence, self surrender, greed, and danger among Florida's drug ring. People and critics (and rappers for that matter) deem this film 'an epic gangster classic' or 'eptiome of gangster films.' When it is anything but. It is praised for all the wrong reasons. Scarface is a terrific film that deserves praise from all over, but not all the praise it gets from audiences today, and therefor the fine points it so poignantly makes are missed by the general public.First off, the film is about a Cuban refugee, with a past of wanting to escape communism grasp and find happiness. Simple? Yes. But the layers of De Palma's directing genius, and the great story written by Oliver Stone (yes I know, he actually wrote a real good one here) play into all of it. The characters are all looking for an escape, as escape is a natural element dealt with in the film by all. Each character has something to offer, that makes them likable by everyone who could appreciate this film. They are entwined in a world of mystique and money, but all that has a price, as they all learn. Each character thinks they are getting better chances in life, when in true dramatic irony, they are actually getting worse. 'Tragedy' would be a better word to describe this movie. All those who praise the film for it's drug usage, it's violence, it's dialog, totally missed the point. There is nothing really positive about the film besides the characters positive expectations of themselves. And that is why the film works so well. The devastation through out the film serves to deliver the message of the film, not to look cool or attract viewers. Brian De Palma doesn't make movies for cult gangsters, or brainless action fans.Next on, the film is an adult drama. It is not a 'gangster film'. It has it's share of action, but the action is plotted very carefully, so it has a point. It's not like \"Aliens\"- an example of a big dumb action film, and most audiences perceive this film as a big dumb action gangster film about doing drugs and shooting people. Ridiculous. Hogwash. If this film is about that, then it is about how bad it is. Not a promotion of it. This being said, the film is indeed a great film. It has great cinematography that pulls you into the story. It has a very dramatic score (in true Giorgio Moroder style), which simply could give you chills, or bring you to tears. The film is rather lengthy, but it is a story, and each moment counts. The acting is terrific. Al Pacino - enough said. He can do any role that he puts his mind to, and this was no exception. Pretty boy Steven Bauer, as Manny. I didn't think much of him in other films he did, but he actually makes you like him when he goes under maestro De Palma's direction. Michelle Pfeiffer is a true gem as Elvira. Popping' fresh off the heels of a sort of embarrassment in \"Grease 2\" she got her ticket to ride performing a no holds barred performance of a beauty that is more than meets the eye. But the three true diamonds in this rough are Mary Elizabeth Mastrontonio as Tony's sister Gina, who when she smiles, or cries, we see her soul and her fresh way of living, and watch it deteriorate; Paul Shenar as Alejandro Sosa, a drug lord, who runs deeper than a river, and Shenar portrays him as so; and Miriam Colom as Tony and Gina's torn mother. These three dig the film as deep as it can go. This reviewer learned one main thing when watching \"Scarface\" for the first time. Always go into a film unsuspecting. All the hype and talk of this film cannot possibly prepare you for what you really see. Only knowing De Palma (like I do) can give you even a glimpse of what this film holds. So ignore the rap crap, ignore the mindless violence supporters, and fix yourself a glass of Bailey's on the rocks, and indulge yourself in an emotional viewing of a great film, the real \"Scarface.\""
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5505369",
      "warningSpoilers": false,
      "date": "24 February 2020",
      "rate": "",
      "helpful": "79 out of 110 found this helpful.",
      "title": "One Word: PERFECT!!!!!!!",
      "content": "Scarface has a great storyline, brutal violence as well as having Al Pacino at one of his finest roles. Scarface is one of the best gangster dramas!"
    },
    {
      "username": "mermatt",
      "userUrl": "https://www.imdb.com/user/ur0088076",
      "reviewLink": "https://www.imdb.com/review/rw0204689",
      "warningSpoilers": false,
      "date": "26 August 2001",
      "rate": "",
      "helpful": "140 out of 201 found this helpful.",
      "title": "Pure Pacino",
      "content": "Pacino gives an amazing performance that is both comic and tragic in this remake of the 1932 classic about corruption in America.Brian De Palma updated the original Prohibition story to the era of the Mariel boat-lift and the heavy traffic in drugs that still infest the United States. The film is an uncompromising revelation of humanity's dark side as Pacino's character learns never to underestimate the other guy's greed. He neglects to learn the other important lesson -- never get caught in the vice you are pushing on others.Pacino's character wants the world and everything in it. That's what he gets. We are reminded to beware of what we wish for.The film is violent but never makes drug dealing seem glamorous."
    },
    {
      "username": "ankitbbd",
      "userUrl": "https://www.imdb.com/user/ur65195412",
      "reviewLink": "https://www.imdb.com/review/rw3419080",
      "warningSpoilers": false,
      "date": "21 February 2016",
      "rate": "9",
      "helpful": "48 out of 58 found this helpful.",
      "title": "Al Pacino made it unforgettable",
      "content": "Scarface is surely one of the best crime movie ever made.Al Pacino's performance as a sharp minded,angry,dangerous and powerful criminal is phenomenal.Al Pacino is playing a character which is brutal,angry,fearless and at the same time has love for his sister. Although movie is 2 hours and 50 mins long,but you will not find any dull moment in the movie.Alhough Al Pacino is playing a drug dealer but you will still like him as a person.Dialogues were excellent and there were couple of good songs in movie too.I also liked the way in which Al Pacino's character used to flirt with Michelle Pfeiffer's character.It was funny sometimes and was gentle too.I have seen many criminal movies but there is something special in Scarface.It is realistic and touching.This is Al Pacino's one of the finest performance.There was violence in some scenes but this is a crime movie and we expect some fighting scenes with violence.I heard a lot of positive things about this movie and when I finally watched it, I became its fan too. I am surprised that this movie even did not received any Oscar nominations.This movie surely deserves to be in top 250 list.Movie is a treat for Al Pacino's fans.This movie is recommended for all adults. Overall I give Scarface 9/10."
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw0204878",
      "warningSpoilers": false,
      "date": "22 June 2003",
      "rate": "10",
      "helpful": "195 out of 294 found this helpful.",
      "title": "The 80's and how not to live them...",
      "content": "Ya know when one looks at this Brian DePalma film today, I'm sure there has been a lot of criticism about how dated it is. Also, about the violence. When I looked at this film on VHS when I was 20, I thought it was ulta-violent and gritty as well. But I didn't get 'it'.A few decades go by and man, how I know how much I didn't get in this film!! This is a remake of an excellent film which was done back in the 30's/40's. How can you improve upon a classic? Ya don't. But you tell a tale that is brought up to date through the eyes of the \"new immigrants\" during the most greed ridden decade, the over indulgent 80's. DePalma, Stone and the gang present an ambitious, disturbing and darn right good film.Yes....Disco was dying and New Wave/Punk were taking over but these immigrants from Cuba who had to make a new home in Florida couldn't tell the difference. It was exciting, it was what they wanted but how to get it???? To these immigrants, there was only one way to get it in Florida where they were..by having lots of money and to get the money, you had to take over running a drug empire.Al Pacino was fantastic to me as Tony Montana, the \"little train that could\". What an amazing way to have your lead character look at America: to fight, kill, steal. lie, cheat all to get -- \"the money, the women and the power.\"That's what Tony saw as the American dream.He wanted it, he wanted to live it and in his circle saw nothing wrong with how he went to get it. Tony Montana's command of the English language was heavily saturated with the \"f\" word but what did you expect, Emily Post's finishing school for him and his co-horts? Look at how they CAME to America, what they knew, what they were exposed to. This is the way Tony and his crew chose to \"be all they can be in America.\" It was all about the power. Tony Montana would and did ANYTHING to achieve it..it all its violent, lying, stealing, crooked, thieving glory.The part of the film that personified the 1980's to me, is the money laundering. Tony's crew bringing sacks of drug money to the bank. Did those around Tony and his crew care? At the clubs where he spent and drank? Nope. Money was money and with money, you get the power. Tony was living high off the hog. He and his pretty blond American trophy he married played well by Michelle Pfieffer.After Tony Montana's rise to power, he finds out its really crappy up there. He's riddled with doubt, he's drug addicted, he's paranoid, he's surrounded by those who want to take him on in a bloody take-over, his trophy 80's American blonde drug addicted wife he finds out is a bore, he needs to keep atop of his empire because...he's going down. And down he goes in a horrific violent fashion, but again I ask, what do you expect?This is the quintessential 1980's film telling you a warped tale of how some misunderstand the American Dream...to obsession. It's violent, bloody, overly so..but it drives the point disturbingly home. Not all Cubans thrown out of Cuba who landed in Florida in the 80's were anything like Tony Montana. Give me a break. But the showing of how miserable the 1980's were with its emphasis on greed and money as the only measures in the USA to \"be somebody\" and have power took its tool on these poor characters and their lives in America.Makes you wonder -- has anything from then -- been learned today?"
    },
    {
      "username": "jhclues",
      "userUrl": "https://www.imdb.com/user/ur0785249",
      "reviewLink": "https://www.imdb.com/review/rw0204677",
      "warningSpoilers": false,
      "date": "30 June 2001",
      "rate": "8",
      "helpful": "108 out of 166 found this helpful.",
      "title": "Dynamic Performance by Pacino",
      "content": "In 1983, Director Brian De Palma set out to make a film about the rise and fall of an American gangster, and that he did-- with the help of a terrific screenplay by Oliver Stone and some impeccable work by an outstanding cast. The result was `Scarface,' starring Al Pacino in one of his most memorable roles. The story begins in May of 1980, when Castro opened the harbor at Mariel, Cuba, to allow Cuban nationals to join their families in the United States. 125,000 left Cuba at that time, for the greener pastures of freedom in America, and most were honest, hard-working people, thankful for the opportunity they had been granted. But not all. Among the `Marielitos' who streamed into Florida, approximately 25,000 had criminal records and were nothing less than the dregs of Cuba's jails-- criminals considered beyond redemption, who Castro had merely wanted to be rid of. And they, too, saw America as a land of opportunity, even as Al Capone had considered Chicago some fifty years earlier. And among the most ambitious was a man named Tony Montana (Pacino), known to his associates as `Caracortada.' Scarface.Now that he was free of the yoke of Communism under which he had grown up, Montana wanted what he felt was coming to him, and he wanted it now; and from the moment he stepped off the boat in Florida, he was determined to have it all. Wealth and power-- that was Montana's dream, and he would get it by doing what he did best, beginning with a favor for a man living in Miami by the name of Frank Lopez (Robert Loggia). Lopez, it seems, had a brother in Cuba who had met an untimely end at the hands of one of Castro's goons, a man who, having outlived his usefulness to Castro, had been summarily discarded and was currently being held in `Little Havana,' along with Montana and all of the Cubans just off the boats, where they awaited their papers from the government that would effect their transition into their new lives. And in short order, Montana sees to it that Lopez's brother has been avenged, and it sets the stage for his own entrance into the underworld of America.Lopez, a wealthy businessman with the right connections, in return for the favor gets Montana and his friend, Manny (Steven Bauer), released from the holding camp, and puts them to work. In his day, Capone may have had bootlegging as a means through which to line his coffers with illicit gain, but Lopez has the modern day equivalent, and it's even more lucrative: Cocaine. Lopez takes Montana under his wing and indoctrinates him into the life, but once he has a taste of it, Montana isn't satisfied with whatever crumbs Lopez sees fit to throw his way, and he sets a course that will take him to where he wants to be: At the `top.' With a cold-blooded, iron will, Montana decides he'll do whatever it takes to get there, no matter what the cost. but before it's over, he will realize the price for his dream, and he'll pay it; but for a brief moment, perhaps he will know what it's like to be The Man. And he will also know whether or not it was worth it.In step with De Palma's vision, Pacino plays Montana larger-than-life, and he does it beautifully. From the accent he affects (which he researched thoroughly to make sure he got it right-- and he did), to the body language and the attitude, he's got it all, and it makes Montana convincing and very real. What he brings to the role is nuance and style, in a way that few actors (De Niro would be one) can. This is definitely not a character that is sympathetic in any way, nor is there anything about Montana that you can readily relate to on a personal level; but Pacino's screen presence is so strong that it makes him a thoroughly engrossing character, even though it's hard to become emotionally involved with him. It's quite simply a dynamic, memorable performance.Michelle Pfeiffer gives a solid performance, as well, in the role that put her on the path to stardom. As Elvira, the woman who becomes an integral part of Montana's dream, Pfeiffer is subtle and understated, giving that sense of something going on underneath, while affecting a rather cold and distant exterior countenance. She, like Pacino, definitely makes her presence felt as she fairly glides across the screen with a stoic, enigmatic and sultry demeanor.The supporting cast includes Mary Elizabeth Mastrantonio (Gina), Miriam Colon (Mama Montana), F. Murray Abraham (Omar), Paul Shenar (Sosa) and Harris Yulin (Bernstein). An excellent precursor to the more recent and highly acclaimed `Traffic,' and `Blow,' and well as having a climactic scene reminiscent of Peckinpah's `The Wild Bunch,' De Palma's `Scarface,' originally panned by critics, has since been cited by many as being the definitive American gangster saga. Much of the violence is implied rather than graphic, but this film still has an edge of realism to it that many may find somewhat disturbing. But if you stay with it, there is a lesson to be learned in the end. And like many lessons in life, the most valuable are often the hardest to take at the time. But the reward is always worth it, and that's the way it is with this film. I rate this one 8/10."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2381134",
      "warningSpoilers": true,
      "date": "6 February 2011",
      "rate": "9",
      "helpful": "41 out of 56 found this helpful.",
      "title": "A Potpourri of Vestiges Review: Pacino gives a heart-wrenching performance as the modern-day Macbeth",
      "content": "Brian De Palma's Scarface depicts cinema at its most macabre, and not for a second does Stone's cut-throat screenplay go awry in its unforgiving attempt to limn the naked reality associated with drug mafia and the kingpins who govern it. Brian De Palma's unquenchable thirst to mimic the gore reality on the celluloid didn't go well with the MPAA, which rated even the highly censored third cut of the movie as 'X'. Brian De Palma and the producer Martin Bergman arranged a hearing with the MPAA and roped in a panel of experts including some narcotics officers, who testified the movie's verisimilitude to the conditions prevalent in the drug underworld. Their testimonies greatly convinced the members of the rating board, who eventually condescended to give an 'R' rating to the aforesaid third cut of the movie. Brian De Palma used the pervasive kerfuffle as a subterfuge to release the unedited original version of the movie instead of the curtailed one and kept this fact surreptitious for months until the movie was released on videocassettes. A remake of a 1932 classic of the same name, Scarface portrays the life of a young, tempestuous Cuban émigré named Tony Montana, highlighting his sanguinary journey from being a thug to becoming a kingpin of drug mafia. Montana's story is one of rise and fall, trust and deceit, love and hatred, greed and lust, but most importantly: life and death. He is a hapless victim of the vicissitudes of his time; a product of his tainted conscience and naked ambition. As the modern-day Macbeth, Montana is the quintessential anti-hero of American cinema: he adores his friends and folks, and is unforgiving to his foes. Brian De Palma took yet another calculated risk by choosing Al Pacino, who was then going through a lean patch in his career, to play Montana's part. Pacino took few months off to prepare himself for the role and to perfect his Cuban accent. Chagrin driven, Pacino uses all his talent and guile to give Montana an ineffable charm and an element of frenzy, which not only brings Montana to life, but also makes the portrayal, singularly remarkable. Pacino's breathtaking performance, which is arguably his best, manages to hold the viewer in a transfixion right from the inception to the finale. In fact, it's clear from the very first scene itself (the first scene in which Pacino is interrogated by the police for being a Cuban emigrant) that Pacino is on an inexorable mission to outperform not only his contemporaries, but also himself. He punctiliously takes care of the nuances and the subtleties in mannerisms needed for an exorbitant portrayal such as Montana's. As Tony Montana, Pacino not only substantiates his acting prowess and answers his critics once and for all, but also establishes Montana as a cult figure in American cinema. The entire cast has given a thorough performance with a special mention of Michelle Pfeiffer and Steven Bauer. Pfeiffer is absolutely ravishing in her intense portrayal of the quintessential, uber-sexy mobster's moll. The chemistry between Pfeiffer and Pacino is scintillating and at times, awe-inspiring.The movie is a highlight reel of some of the most graphic and grotesque sequences ever caricatured in cinema. The scene in which Tony Montana asseverates his innocence and loyalty to the drug kingpin Frank Lopez elevates cinema to a new zenith, while the Macbeth like climax gives the movie an operatic feel that is seldom associated with cinema.Scarface marked the upsurge of a new force in cinema: the triumvirate of De Palma, Stone and Pacino. Almost three decades have passed since Scarface, but Al Pacino, Brian De Palma and Oliver Stone still enjoy a global iconic status as they continue to enthrall the audiences worldwide with their idiosyncratic cinematic styles.PS. Scarface has become a prototype in modern cinema and is one heck of a cinematic experience, but is not meant for the faint-hearted, or the sycophantic adherents of conservative cinema. 9/10http://www.apotpourriofvestiges.com/"
    },
    {
      "username": "Arcturus1980",
      "userUrl": "https://www.imdb.com/user/ur3860711",
      "reviewLink": "https://www.imdb.com/review/rw2489780",
      "warningSpoilers": true,
      "date": "17 September 2011",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "My favorite crime film",
      "content": "They improved on greatness for this remake of Howard Hawks' 1932 film of the same name. To my mind, this is more than a crime doesn't pay morality tale, just as Al Pacino's Tony Montana is an anti-villain rather than an anti-hero. This is deep filmmaking not to be dismissed in so superficial and parochial a manner.Plot spoilers hereunder: Tony Montana suffered under the boot of Castro in communist Cuba until joining the exodus to America thanks to President Carter's gracious, yet naive open-arms policy. When his friend Manny (Bauer) asks what's coming to him, he says: \"The world, chico, and everything in it.\" Ambitious to the hilt, he refuses to eke out an honest existence amidst such wealth and opportunity. Meaning well, he endeavors to relieve his sister (Gina, Mastrantonio) and mother (Colon) of such meagerness to their corruption and indignation, respectively. Hotheaded and highly prone to excess, he wants to take care of mama and sis on the side, while braving his way to the top of Miami's cocaine empire.Other characters include Omar Suarez (Abraham), a lowlife thorn in Tony's side that is not long for the film; Frank (Loggia), a contentedly low-key operator seen as \"soft\" by Tony; Mel Bernstein (Yulin), a rat bastard cop who Frank pins on Tony after their falling out; Elvira (Pfeiffer), Frank's girlfriend turned wife of Tony; and Sosa (Shenar), a Bolivian kingpin who starts up serious business with Tony after making it clear that betrayal is not something he finds humorous. Apart from Pacino's of course, I would single out Paul Shenar's performance. Exceptional work all around, but replace Shenar and we have a problem.Tony ends up facing a few years for tax evasion, which gives Sosa leverage over him. To avoid prison on account of Sosa's government connections, he has to help take out a respectable Bolivian journalist. Not a walk in the park, but better than prison, he figures. By this time, Elvira, notwithstanding her own problems, summoned the strength to leave their toxic relationship and look for greener pastures.Paranoid and addled by a cocaine addiction, Tony remains principled, and opts to shoot dead the black-hearted sack of human garbage (Alberto, played very well by Mark Margolis) holding the detonator instead of going ahead with an assassination unexpectedly involving a wife and kids. The journalist makes a damning speech to the United Nations, and Sosa is livid with rage at the betrayal.Tony, not at all in a serene frame of mind, finds Manny living with Gina, and gut-shoots him to death like a mongrel, recalling to mind the wonderfully powerful counterpart scene in Hawks' original. Having warned womanizing Manny against such conduct, Tony was outraged by a sense of betrayal, and did not realize that their relationship (marriage) was not necessarily indecent after all. Consequently, Gina lost her mind before being machine-gunned down by one of Sosa's guys as scores of them commenced their assault. Fuelled by coke and rage, Tony returned fire with a characteristic gusto appropriate under the circumstances. He dies a bullet-riddled dramatic death in front of \"The World is Yours\" statue.Torn between a principled, yet conditional respect for life and avaricious criminality, Tony tried to compartmentalize life in a manageable way without success, least of all as it pertained to Sosa, who is not so hung up on moral quandaries. Gina and his mother would have been better off had he remained a dishwasher, but I doubt very much that he would think so of himself.We have Sidney Lumet to credit for the Cuban angle including the Mariel Boatlift. Oliver Stone obviously has a thing or two figured out to have written this masterpiece. Brian De Palma directs brilliantly. We see his Hitchcockian influence in the New York City car scene. I absolutely love synth master Giorgio Moroder's very '80s original score. All the music hits the mark. John A. Alonzo's cinematography and Bruce Weintraub's set decoration are tops. Spanish is used less than would be realistic, but this artistic license works cinematically. There is Spanish in the film, so it is not as though it went out the window.It's in my top 10."
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw1910286",
      "warningSpoilers": false,
      "date": "14 July 2008",
      "rate": "10",
      "helpful": "40 out of 55 found this helpful.",
      "title": "Loved, But For The Wrong Reasons",
      "content": "Many people like this movie and many more love it, but it seems that it is all for the wrong reasons. Scarface should be liked and loved but not in the way it has been or is.Many people say the acting was over-the-top, but who better to do an over-the-top character than Al Pacino. To say that Pacino went over-the-top in here would be an understatement. Yet he does it so well, he just brings the inner devil out of you so well. His character Tony Montana was not such a great guy to begin with but his thirst for power just bring his sickness of greed to another level; an inhumane level. Sure at times Pacino seems to be a bit cartoonish and surreal but that does not at all to me seem to be a liability at all. The supporting cast served its job very well. Michelle Pfeiffer was not really at her best but she certainly fit the role she played. On the other hand Steven Bauer was at his best, still he is Steven Bauer. Mary Elizabeth Mastrantonio was good and like Michelle Pfeiffer fit her role very well. Robert Loggia I have always enjoyed watching in just seeing him yell. Other than Pacino they were not really any standout or memorable performances. Everybody just seemed to fit their roles by being there. They did not fit in perfectly but were convincing enough.Brian De Palma did a very good job directing this movie. Whenever an actor is able to become larger than life with his performance some credit should be given to the director and I will certainly give De Palma that. Brian De Palma, though not given the respect, is a very versatile director by my count. He knows how to direct movies according to their genres, but that at times has not turned out well. In here it does, this is by all counts a gangster movie but few are much better than this one because of De Palma.The writing was great it was just pure Oliver Stone. When I saw the credits at the end of this movie and saw that Oliver Stone had written this I was not the least bit surprised. That is a testament to him though. I have always though of him as a great writer and to me he proves this once again with Scarface. Nobody knows how to write a surreal reality for a movie than Oliver Stone.The music was good but not that great. It is certainly not my favorite from Giorgio Moroder. The music was a little bit too 80s-ish for me but it didn't annoy me. The cinematography was good, not amazing but really who cares with a movie like this.This has probably been one of the most influential movies in the past 25 years but as mentioned before it is for the wrong reasons. People should realize that the character of Tony Montana is no hero, he is a monster. He is not inspiring in anyway. He is greedy, bloodthirsty, uneducated and self consumed. Yet he is a role model to many people because he is in some way or another a rebel but probably most of all because he is a deluded gangster. A vigilante would be like Mother Tereasa next to Scarface.The good thing about this movie though is that it shows that the Tony Montanas' are not the real problem. If we or the people of authority would want to shut people like him down we could do it but we don't. In a freaky twisted way he is a necessity of our society. He is somebody you could blame everything on and fell better about yourself doing it. The Tony Montanas' of this world are the scapegoats of our society. This in no way excuses people like him. Instead it is more of a reminder that we shouldn't excuse or allow ourselves to do bad things just because we measure up or think we measure up compared better to a gangster or drug dealer. I love this movie because it is more than a corruption movie, it is a movie that in a strange way makes you self reflect."
    },
    {
      "username": "imdb-5032",
      "userUrl": "https://www.imdb.com/user/ur4312544",
      "reviewLink": "https://www.imdb.com/review/rw0981805",
      "warningSpoilers": false,
      "date": "18 December 2004",
      "rate": "10",
      "helpful": "343 out of 493 found this helpful.",
      "title": "Grandiose, bloodyminded and implacable",
      "content": "This is one of my all time favorites.If the movie has a flaw, it's that it comes at you like a raging bull. It doesn't so much engage the viewer as assault him. ''Scarface'' is as voracious and unyielding a production as Tony Montana himself. Nothing is left to the viewer's imagination.Moroder's languorous synthpop fits the action to a tee. Like the chorus in a Greek tragedy, it wails and gnashes, broods and tugs, a constant reminder of Tony's inexorable fate.Not so much a tale of caution as a disaster in progress, ''Scarface'' rips across the screen with the unstoppable force of a runaway train."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6229898",
      "warningSpoilers": false,
      "date": "2 November 2020",
      "rate": "8",
      "helpful": "19 out of 26 found this helpful.",
      "title": "Scarface",
      "content": "Amazing movie and amazing performance by Al Pacino as Tony Montana"
    },
    {
      "username": "Coxer99",
      "userUrl": "https://www.imdb.com/user/ur0257957",
      "reviewLink": "https://www.imdb.com/review/rw0204715",
      "warningSpoilers": false,
      "date": "24 March 1999",
      "rate": "",
      "helpful": "102 out of 173 found this helpful.",
      "title": "Scarface",
      "content": "I find myself enjoying this film when I watch it. Well, perhaps enjoying is a bit of an odd verb when you think of the storyline, its characters, the amount of violence and of course, the f-bomb being dropped about 15,000 times. I like Pacino in this film. He shows us the violent anger we didn't see in Michael Corleone. We're Michael would say, \"Never hate your enemies, it clouds your judgement,\" Tony Montana's out killing everybody. Now granted, there are moments in his performance...or in the script where you have to laugh. The questioning scene in the beginning of the film is a fine example of this. When asked where he got that scar on his cheek...well, I can't write what he says in the regular version, but I will tell you that on edited version on TNT, it from was \"eating pine apple.\" There is a great performance from Robert Loggia. He's the only character I truly believed in the film. Frank was a businessman, not a killer. All he wanted was the money. Greed killed him, as it has killed so many people. I enjoyed the direction Loggia went with Frank. It has carried over his recent work and has made Loggia one of Hollywood's must durable supporting actors. Brian DePalma adds his usual blend of violence, but it seemed that for once, he was trying to make his own film. Not borrowed. No guessing games on who he stole from this time. Although he's blasted for the film's content, it is a new beginning to his career which took off, but it was really \"The Untouchables\" that made me consider him a serious director."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0204819",
      "warningSpoilers": true,
      "date": "17 April 2001",
      "rate": "",
      "helpful": "23 out of 35 found this helpful.",
      "title": "Three Men of Excess",
      "content": "Spoilers herein.This may be Stone's best screenplay because it allows him to color big and be vulgar. And this is just exactly what Pacino does best: come down on a part like a sledgehammer -- not acting so much as pounding. I find both of these guys boorish. But watch what dePalma does with them. Pacino's excess maps directly to Montana's excess -- both acting out the same role. dePalma keeps his distance from Pacino, holding the camera outside his space, never sharing his perspective. This is the first time that his camera's swoops and pans start to emote, to add substance to the narrative, to actually paint. This is where he gets his legs, leading up to what I think is a high point in cinematic painting: `Snake Eyes.' No one can do better without stealing from him.Excess -- so it matters that the substance of the film are the three American excesses: the Latin manner of self-satisfaction, the gangster ethic of gimme, and the church of drugs, all of which underlie the peculiar religion of the US. Stone does a good job with the tension among these three. Latin sex versus unsexing coke; American opportunity versus the destruction of success; violence versus humor well before Tarantino. dePalma uses each excess in his style: sometimes with great effect. The sets are so theatrical they approach fantasy; the moves of the camera are greater when the architecture has grand features. The moves are duller when Montana is. The cutting jumps when he does, as in the first interrogation, and when he argues with his mother over the sister.The best sequence cinematically (to my mind) is the attack in the Babylon, with the pans and mirrors, but there are other fine visual treats here. Credit the director. Most films are about other films -- this one is largely original sofar as the visuals and is the root of many that followed, including some of dePalma's own.Pfeiffer should be great, but she's merely pretty. Her thinness of presence is just right for the trophy girl who wasn't there, and she only gets by because the character is perpetually stoned. Wonder if she ever suspected she was being used that way? Mastrantonio has much more fire -- central to making the final sequence nearly work. But I guess it is hard to build a career on that. She pretty much faded after Scorsese's `Color of Money,' used that fire the best."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw5767106",
      "warningSpoilers": false,
      "date": "24 May 2020",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Say hello to my little friend",
      "content": "One of the most recognized quote from a movie ever. Even to those who haven't seen the movie. It's sort of Pacinos equivalent to De Niro \"You talkin to me?\" scene from Taxi Driver. Not comparing those movies of course. If you want to compare movies, you could compare this to the 30s original with Paul Muni. A movie that Pacino watched in a cinema and made him want this movie. Made him want to be as mesmerizing and have a powerful role. Add Oliver Stone and others to make this happen and you have an amazing movie.Now at the time it was released people were disgusted by this. Thinking of Tony Montana as role model or maybe fearing he could be just that. And he has become a cultural influence and to some an idol. The movie did not intend it or the character to be viewed as such. You can't blame the movie for how people reflect and adapt to what they see.You can blame the critics for not giving it enough credit. While the original set a standard and was used as a rough blueprint (some scenes are reminiscent of the original), this did many original things that we had not seen before, like a chainsaw scene. So not for the squeamish or the ones who are easily offended. All that taken into account it is a travesty Pacino did not win an Oscar for his performance. It's an even bigger travesty he wasn't even nominated! Actually the movie had even a Razzie nomination ... which is almost funny while simultanously sad too.The movie may be long but it needs time to unfold. It is bigger than life, has many tips of the hat to the original (the world is yours) and might be one of the few cases where the remake is at least as good as the original. Highly recommended to anyone who loves action movies and dramas combined"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2739453",
      "warningSpoilers": false,
      "date": "19 January 2013",
      "rate": "8",
      "helpful": "16 out of 24 found this helpful.",
      "title": "Violent chronicle about the rise and fall of a dangerous gangster and easily ranks as one of the very best in the mobster genre",
      "content": "Remake from classical movie titled Scarface (1934) , in fact , De Palma's Scarface is dedicated to Ben Hecht and Howard Hawks. When Fidel Castro opens the harbor at Mariel, Cuba, he sends 125,000 Cuban refugees to reunite with their relatives in the United States. Among all the refugees, there is one who wants it all, his name is Tony Montana (Al Pacino reportedly stated that Tony was one of his favorites of all the characters he's played) but the world will remember him by another name , Scarface , being a fictional character . In 1980 Miami, a determined Cuban immigrant takes over a drug cartel while succumbing to greed . As Tony and his faithful friend Manny (John Travolta was considered for the role of Manny Ribera but was to Steven Bauer who is the only actual Cuban in the main cast and subsequently married Melanie Griffith) arrive in the U.S. and beginning working small time jobs importing and exporting cocaine. Soon, they are hired by Omar Suarez (during filming F. Murray Abraham was notified that he had won the part of Antonio Salieri in Amadeus) to do business to a group of Colombians. When the issue goes awry , Tony and Manny leave with the money and flee rapidly . Soon after , Tony meets with drug ringleader Frank Lopez (Robert Loggia , outstanding as a rival gangster) and falls for his boss's girl , Elvira (Michelle Pffeifer , Kay Lenz, Glenn Close , Kelly McGillis and Kristy McNichol both reportedly wanted the role , but De Palma turned them down). Later on , Tony reunites with his mother and sister (Mary Elizabeth Mastrantonio).This exciting film packs thrills , chills , noisy action violence and results to be pretty entertaining , in spite of its long runtime , as it runs nearly three hours . It's one of the most violent , gruesome , thrilling intriguing gangster move ever made . Al Pacino , in the title role , is firs-rate as the Cuban gangster and receives magnificent support from Steven Bauer , Robert Loggia, Mark Margolis , Harris Yulin and early deceased Paul Shenar gives a bravura performance as a Colombian kingpin . Interesting screenplay by Oliver Stone who wrote this film while fighting a cocaine addiction . The original idea was to make this film a remake of Scarface, which took place in Chicago, but this proved to be impossible due to budget constraints. There was a huge controversy in the city of Miami during the making of the film over whether the producers should be allowed to shoot in the city. The Miami Tourist Board decided not to allow filming, as they were afraid the movie would discourage tourism to Miami, particularly as it showed Miami's latest Cuban immigrants as gangsters and drug dealers. A majority of the film was shot in Los Angeles, California standing in for Miami, Florida. This was done because production would have been endangered by protest from angry Cuban-Americans over the film's reported subject matter. Streets and buildings used for shooting were redressed by the art directors to have the 'feel' of Miami. The movie displays a colorful cinematography by excellent and veteran cameraman John A Alonzo . Furthermore , it has a commercial musical score composed by synthesizer by usual of the 8os , Giorgo Moroder. The motion picture was very well directed by Brian De Palma who liked the script so much that he dropped out of directing Flashdance to direct this film. Ranked #10 on the American Film Institute's list of the 10 greatest films in the genre \"Gangster\". Scarface, the version starring Paul Muni, was ranked #6 in June 2008"
    },
    {
      "username": "melwinbauer",
      "userUrl": "https://www.imdb.com/user/ur131499933",
      "reviewLink": "https://www.imdb.com/review/rw7482658",
      "warningSpoilers": false,
      "date": "26 October 2021",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Gangster Classic",
      "content": "Scarface - Crime, Drama - 1983 - 2h 50mTony Montana is a cuban immigrant who moves to the United States in 1980's. What follows is a brutal and violent path from the bottom to the top and we learn what it means to have the world at your feet.PositivesReally good storyThe endingAl Pacino is coolI like 1980s Miami as a setting, its coolNegativesI found it kind of slow in some parts but to be honest I don't know if it is enough for me to put it down as a negative but I'm going to do it anywayI don't know how to describe it but the way the story \"flowed\", if that makes sense, wasn't really my taste. I'll elaborate in the review down below8/10I'm not really sure what to rate this one. To me it's between an 8 and a 9. I think the movie can be split into three parts. The first 55% are really good and so are the last 10% but I think the movie lost some of its momentum and flow during the 35% in the middle. Among the negatives I've written that the \"flow\" of the story during some parts wasn't to my liking and this is what I was referencing to. I tend to like a story that has a goal, where the story has a direction is heading somewhere and I think it loses that in the middle which takes the movie down a rating in my opinion. Other that i really like this movie. It is an epic, intense and exciting gangster classic that I found fun and interesting to watch and I'm sure you can dig deep into it and analyze a lot of the messages behind the movie. The setting of the movie is really cool, I like 80s Miami and it fits the story just like Al Pacino does who I think does really well in this role and really makes it his own. Another highlight is the ending that really enhances the movie as a whole. I won't spoil anything but it's epic and absolutely iconic. To sum up this movie is really good and I would highly recommend it."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2087564",
      "warningSpoilers": true,
      "date": "28 June 2009",
      "rate": "",
      "helpful": "15 out of 23 found this helpful.",
      "title": "Fly Away Little Pelican",
      "content": "\"Capitalism too has to keep moving, keep expanding, or it dies. And because logarithmic growth is in its DNA, it can only grow on the basis of ever-increasing levels of consumption.\" - John Sanbonmatsu For French philosopher Jean Baudrillard, our era of post-modernity eradicates the traditional logic of model and copy, sign and referent. Signs now refer only to other signs, images to other images, and the world itself becomes a kind of hyper-real orgy, an inextricable landscape of simulations and simulacra.Brian De Palma's \"Scarface\" is a 1983 remake of Howard Hawks' 1932 gangster classic. Unlike Hawks' film, however, De Palma's aesthetic is resolutely postmodern. It is also a film which is explicitly about a postmodern culture, specifically one which is ruled by desire, production and which thrives on the constant and insatiable circulation of money, drugs, images and objects. Unlike other gangster films, the look of \"Scarface\" is thus aggressively pop, more akin to \"A Clockwork Orange\" (itself a future world in which all art, actions and objects are rendered impotent) than the more provincial world of \"The Godfather\".De Palma's aesthetic therefore contributes to a general \"derealization\" of the world, in which there seems no clear distinction between reality and artifice. Consider the way the various sunsets in the film - outdoors, on indoor murals, on our hero, Tony Montana's shirts (Al Pacino), on giant billboards etc - seem equally unreal. Miami and the \"billboard\" Miami, are all part of a single simulacrum. Throw in countless references to the original \"Scarface\", and early gangster flicks like \"Little Ceasar\" and \"The Public Enemy\", and you have a film that is obsessed with its own artifice. Where then, do these characters exist?Midway in the film, during a montage sequence, De Palma traces Tony's rise to the top of his own criminal empire whilst the song \"Push it to the limit\" plays over images of whirring money-counting machines. It's a cheesy scene, but the film's point is clear. There is no anchor to Tony's inflationary economy, no limit, no equivalence between labour and profit. In a reversal of his \"Get To Know Your Rabbit\", De Palma has cocaine highs echo the fantasy of capitalism; a perpetual money machine, without limits, ends or consequences, that spits out cash faster than eyes can count.But capitalism also functions like cocaine, in that it is an all consuming \"substance\" that engenders narcissism, egomania, delusional paranoia, pleasure and, of course, inescapable addictions which induce a need for more and more. Cocaine, in short, is capital, a point that is reinforced when Tony's cocaine addiction becomes inseparable from his limitless desire for \"the world and everything in it\".More than any other gangster movie, \"Scarface\" thus captures a totally madcap world; an almost Baudrillardian simulation obsessed with desire and production. Everywhere capital, power and desire form boundless circuits which dissolve previous social codes and reterritorialize them in simulations of traditional codes, observing no law but that of limitless excess. The \"look\" of the film is thus not only the look of the cocaine experience, but the \"look\" of late capitalism itself.Because it is mired in this tacky shamelessness, people have labelled \"Scarface\" a sort of inferior \"junk food\" sibling to supposedly more \"authentic\" and \"real\" films like \"Goodfellas\". But it is the very falsity of \"Scarface\" that makes it real. A huge generational shift took place during the 1980s (the \"shame free\" enjoyment of pornography, of Bling, of video game mega violence etc) and one of the reasons \"Scarface\" was so critically unpopular at the time was that it went against the Reaganite grain. Here is your American Dream, it said, and feel how tawdry, how plastic, how criminal it is at its base. \"The World is Yours\", but what a hollow world it is.\"Scarface\" is thus the first Bling Film, grotesque in its glitzy 80s materialism. But it is Bling as purgatory. You can buy the stuff, snort the cocaine, get the woman, live in the mansion, but nothing will fill that existential lack. When Tony growls, \"Is this it? fking sucking, snorting?\", it is not just the American Dream rendered cynical, it approaches Sartre in its existential ennui: \"Is this it? Breathing, eating, defecating?\"With its Tarantino-styled chainsaw scene, pre-\"Miami Vice\" art design and shameless vulgarity, \"Scarface\" also marks the point at which the old gangster paradigm was superseded. \"Scarface\" intuits a future landscape of video game hyper-reality and violence as always excessive. It posits crime as incessant, paranoid and vengeful (revenge against destiny, competitors, class beginnings, genetic identity etc) and is one of the few gangster films to equate violence with castration, pleasure with self-abuse and action with male-impotency.Note too that \"Scarface\" opens, not in garish overdrive, but with newsreel footage of Cubans being expelled for disobeying the \"spirit of communism\". Birthed in the jails of Castro's Cuba, Tony's path to psycho-pathology is the result of ideological rejection; his excesses are the mirror image of the communist ethos. With Tony sitting in his lair like a paranoid President (\"Is this it? Snorting? Vote rigging? Executing?\"), fretfully protecting his expanding empire, surrounded by banks and banks of security cameras and a weapon's cache that would formally only have been in possession by a military, the film's bloodbath finale now reads like a pessimistic take on modern America, quaintly convinced that it can take on everyone at its own ultra violent video game.8.9/10 - An awful future, slowly dreaming itself awake."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6115149",
      "warningSpoilers": false,
      "date": "22 September 2020",
      "rate": "6",
      "helpful": "31 out of 53 found this helpful.",
      "title": "Scars & Torture, Visible & Unseen...",
      "content": "It's a story about a misogynistic psychopath with sister issues who develops drug and alcohol dependency and carries an exceptionally large chip on his shoulder: Al Pacino captures that character to perfection. Without him the film would probably have been forgotten some time ago, the rest of the cast are quite forgettable in comparison but so is the story which adds little or no value, unless you have aspirations along the lines of the scarred man or recognise some of his attributes in yourself or someone you know."
    },
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw1000423",
      "warningSpoilers": true,
      "date": "16 January 2005",
      "rate": "4",
      "helpful": "89 out of 174 found this helpful.",
      "title": "Tony The Blow-Man",
      "content": "\"Scarface\" is a useful movie to have around. If you walk into someone's house for the first time, and he quotes \"Scarface\" twice in the first 15 minutes, you know it's time to leave.After escaping his native Cuba during 1980's Mariel boatlift, former jailbird Tony Montana (Al Pacino) gets a second life in the land of opportunity, which he takes full advantage of as one of Miami's leading cocaine cowboys. Tony wants it all, including his boss's wife, his sister's devotion, and a mountain of blow to call his own, but once he gets it, he starts on a downhill trajectory with fatal consequences.The fact so many people like \"Scarface\" is testament to the intensity of Pacino's performance more than the intelligence behind it. In the DVD documentary, Pacino readily admits to the character being two-dimensional. For some, that's great. He's not too complicated that way. But for me, Tony Montana is worth maybe 20 minutes in a movie about someone else. He blows too hot.Pacino isn't great here. He has some good scenes like at the beginning when he's being questioned by some cops, but mostly he just yells a lot. The supporting performances are uniformly weak, including F. Murray Abraham, who gave one of the great screen performances in the following year's \"Amadeus.\" Michelle Pfeiffer does the best work for 10 minutes, but then the script seems to lose interest in her character and she ends up throwing out some random histrionics before exiting stage left.The storyline is simplistic and uninvolving. The score is one of the lamest, especially during the opening sequence showing news footage from the Mariel boatlift. The motivations of everyone from Tony's early benefactor Frank Lopez to Hector the Colombian are at best opaque and at worst cry plot convenience. There's a silly bit of business involving Tony's sister and mother which is dragged out too long. And with Pacino's central character so unlikable, this is all too much to deal with.Is it director Brian De Palma? De Palma makes interesting movies, just not always good ones. He made some very good movies around the early '80s, and \"Scarface\" would seem like a prime candidate to be another. But it's like when he has a great actor to work with, like Pacino or Sean Penn in \"Casualties Of War,\" he loses the ability to rein them in and just lets them bolt through the fences. At the same time, De Palma often gets great performances from less-heralded actors, like John Travolta in \"Blow Out,\" Craig Wasson in \"Body Double,\" and Michael J. Fox in \"Casualties Of War.\" He's not untalented, just maddening inconsistent.The film does have passion, and some momentum and excitement that carries into the final crescendo. There's a terrific sequence involving Montana and an assassination target that generates some real concern with the audience because you are actually meant to care a little about the people involved, and Tony for once is not acting according to type.But mostly \"Scarface\" is an '80s TV movie with marathon swearing and bloodletting, and a performance from Pacino that hopefully got it out of his system for a while. It's cathartic, maybe, but so's running someone off the road after they cut you off. Not exactly reasonable therapy."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1167089",
      "warningSpoilers": true,
      "date": "6 September 2005",
      "rate": "7",
      "helpful": "44 out of 81 found this helpful.",
      "title": "The Oliver Stone-scripted 'Scarface' is a change in genre...",
      "content": "The story turns around Antonio 'Scarface' Montana, an ultra-violent Cuban refugee who comes to the United States with less than nothing, and makes a place for himself at the top of the cocaine trade...As a calculating man with a conscience, and extreme ambitions, Tony strongly begins to desire the things he sees a criminal high-roller enjoying, including his luscious lover... Heights his way out of a refugee camp by enjoying the chance to stab a former taker of Freedom, takes out rival dealers, gains the confidence of an important drug lord by eclipsing a local gang boss in Miami, and eventually makes it to the highest levels of the drug organization...Pacino shows the results of greed and lust for power on the human psyche... He guns his way through the sunny streets of Miami where he got 'the world and everything in it.' With his ruthlessness, obscene dialog, and his negotiation skills, he begins to imagine himself invulnerable and above all others... He quickly moves deep to the world of gangs, and becomes more ruthless than anyone else can possibly imagine...Michelle Pfeiffer looks dazzling as the addicted wife with no inner life... She succeeds in portraying the trophy 'object' navigating uncertain waters with her anti-hero... Mary Elizabeth Mastrantonio happens to be the best in Tony's life, the only thing that is good and pure... Her revulsion at the end of the movie is so fiery that her whole head could have blown off... Robert Loggia exhibits a weak and fearful disposition, especially when faced with Pacino as a challenger... He proves to be a less-ambitious boss in a position of power... Steven Bauer shines as the man of charm, loyal ally and faithful friend...The Oliver Stone-scripted 'Scarface' is a change in genre, lifting scene after scene of Hawks' classic while updating the rise-and-fall gangster saga to modern, drug-infested Miami... But, as always, the focus is on decadence, profanity and violencememorably a sickening chainsaw murder, rather than on the psychological and social reasons for the hoodlum's psychopathic behavior..."
    },
    {
      "username": "ed56",
      "userUrl": "https://www.imdb.com/user/ur4453277",
      "reviewLink": "https://www.imdb.com/review/rw0992338",
      "warningSpoilers": true,
      "date": "5 January 2005",
      "rate": "10",
      "helpful": "79 out of 125 found this helpful.",
      "title": "A Brutal, Uncompromising Masterpiece",
      "content": "Arguebly Al Pacino's best role. He plays Tony Montana, A small time hood from Cuba turned into a rich and powerful crime lord in Miami, and he does it with the only two things he's got in this world, his balls and his word, and he doesn't break'em for nobody. Starts as doing jobs for a big time Cuban dealer, Frank Lopez (Robert Loggia) and quickly goes up the ladder of the organization along with his long time friend Manny (Steven Bauer). Soon he has an eye for the boss's sexy wife Elvira (Michelle Pfeiffer). After Frank sees a threat from Tony to his position, he attempts to assassin Tony but with no luck. Tony is upset and nothing can stop him now. the film has a great supporting cast among them is F. Murray Abraham as a jumpy gangster, another familiar face is Harris Yulin as a crooked cop trying to shake down Tony, Marry Elizabeth Mastrantonio as Tony's young sister. Credits to the Ecxellent screenplay by Oliver Stone. This film is one of Brian DePalma's Brightest points in his long ups and downs career, you can see this guy is very talented. The movie has a magnificent look to it. Also pay attention for two memorable scenes: The one at the fancy restaurant (\"Say goodnight to the bad guy\"). the other is the final shootout where Tony shows that he still knows how to kick ass and kills about 20 assassins that invaded to his house. this is certainly one of the most impressive endings to a movie I have ever seen. For fans of Al Pacino and crime movies it's a must-see. For the rest of you it's highly recommended. 10/10"
    },
    {
      "username": "PredragReviews",
      "userUrl": "https://www.imdb.com/user/ur65737204",
      "reviewLink": "https://www.imdb.com/review/rw3487747",
      "warningSpoilers": false,
      "date": "14 June 2016",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "\"The World Is Yours\"",
      "content": "\"Scarface\" is one of the greatest of all mob movies. It's an epic crime drama done with style and care. Brian De Palma presents a film that ignites the screen with a great screenplay by Oliver Stone and an amazing performance by Al Pacino. For those unfamiliar with the story, Scarface follows the path of Tony Montana, a charismatic Cuban refugee, who arrives in Miami looking for the American dream. Tony's up-front and tough personality makes him go right to the top of the cocaine underworld. However, no one, as they say, stays at the top forever. There are consequences to his success, and as Tony learns, money and power can't give you everything. A special mention should go to Michelle Pfeiffer, who superbly plays Tony's love, in what was her first major film role. This film is not for the faint at heart as directer Brian De Palma 3 times had the film rejected because it had and X-Rated certificate. He literally had to take the people who give the certificates out to court. Although grotesquely brutal this movie could teach kids good lessons that crime does not pay as when he gets to the top of the underworld his life corrupts through cocaine and he ends up killing the ones he loves and watching ones he loves die in crossfire.The film is famous for it's scenes of violence, including a victim chained to a shower and killed with a chainsaw. Director Brian DePalma, not really known for excess gloriously lavishes in it here and films his movie with style and gusto, \"Scarface\" is unique because it feels like it was made with real respect for the material. Consider that you have one of Hollywood's future greatest directors writing the script and one of American film's most stylish talents directing and on top of that, an iconic actor in the lead role. Even the moody main theme is composed by none other than Giorgio Moroder. The ending is especially deliciously bloody, as if a normal shoot-out is for sissies. \"Scarface\" remains a potent movie because it has themes we can all relate to, we all want wealth, power and at least one beautiful woman, \"Scarface\" asks the question of what extremes would one go to to achieve wealth, and is it worth anything when it is dirty money? Overall rating: 10 out of 10."
    }
  ],
  "errorMessage": ""
}