{
  "imDbId": "tt0086250",
  "title": "Scarface",
  "fullTitle": "Scarface (1983)",
  "type": "Movie",
  "year": "1983",
  "language": "en",
  "titleInLanguage": "Scarface (1983 film)",
  "url": "https://en.wikipedia.org/wiki/Scarface_(1983_film)",
  "plotShort": {
    "plainText": "Scarface is a 1983 American crime drama film directed by Brian De Palma and written by Oliver Stone. Loosely based on the 1929 novel of the same name and serving as a loose remake of the 1932 film, it tells the story of Cuban refugee Tony Montana (Al Pacino), who arrives penniless in Miami during the Mariel boatlift and becomes a powerful and extremely homicidal drug lord. The film co-stars Steven Bauer, Michelle Pfeiffer, Mary Elizabeth Mastrantonio and Robert Loggia. De Palma dedicated this version of Scarface to the memories of Howard Hawks and Ben Hecht, the writers of the original film.\r\nPacino became interested in a remake of the 1932 version after seeing it, and he and producer Martin Bregman began to develop it. Sidney Lumet was initially hired to direct the film but was replaced by De Palma, who hired Stone to write the script. Filming took place from November 1982 to May 1983, in Los Angeles and Miami. The film's soundtrack was composed by Giorgio Moroder.\r\nScarface premiered in New York City on December 1, 1983, and was released on December 9 by Universal Pictures. The film grossed $45 million at the domestic box office and $66 million worldwide. Initial critical reception was negative due to its excessive violence, profanity, and graphic drug usage. Some Cuban expatriates in Miami objected to the film's portrayal of Cubans as criminals and drug traffickers. In the years that followed, critics have reappraised it, and it is now considered one of the greatest gangster films ever made. Screenwriters and directors such as Martin Scorsese have praised the film, and it has been referenced extensively in pop culture, especially in hip hop music, as well as comic books, television programs, and video games. The film has come to be regarded as a cult classic.",
    "html": "<p>Scarface is a 1983 American crime drama film directed by Brian De Palma and written by Oliver Stone. Loosely based on the 1929 novel of the same name and serving as a loose remake of the 1932 film, it tells the story of Cuban refugee Tony Montana (Al Pacino), who arrives penniless in Miami during the Mariel boatlift and becomes a powerful and extremely homicidal drug lord. The film co-stars Steven Bauer, Michelle Pfeiffer, Mary Elizabeth Mastrantonio and Robert Loggia. De Palma dedicated this version of Scarface to the memories of Howard Hawks and Ben Hecht, the writers of the original film.</p><p>Pacino became interested in a remake of the 1932 version after seeing it, and he and producer Martin Bregman began to develop it. Sidney Lumet was initially hired to direct the film but was replaced by De Palma, who hired Stone to write the script. Filming took place from November 1982 to May 1983, in Los Angeles and Miami. The film's soundtrack was composed by Giorgio Moroder.</p><p>Scarface premiered in New York City on December 1, 1983, and was released on December 9 by Universal Pictures. The film grossed $45 million at the domestic box office and $66 million worldwide. Initial critical reception was negative due to its excessive violence, profanity, and graphic drug usage. Some Cuban expatriates in Miami objected to the film's portrayal of Cubans as criminals and drug traffickers. In the years that followed, critics have reappraised it, and it is now considered one of the greatest gangster films ever made. Screenwriters and directors such as Martin Scorsese have praised the film, and it has been referenced extensively in pop culture, especially in hip hop music, as well as comic books, television programs, and video games. The film has come to be regarded as a cult classic.</p>"
  },
  "plotFull": {
    "plainText": "Scarface is a 1983 American crime drama film directed by Brian De Palma and written by Oliver Stone. Loosely based on the 1929 novel of the same name and serving as a loose remake of the 1932 film, it tells the story of Cuban refugee Tony Montana (Al Pacino), who arrives penniless in Miami during the Mariel boatlift and becomes a powerful and extremely homicidal drug lord. The film co-stars Steven Bauer, Michelle Pfeiffer, Mary Elizabeth Mastrantonio and Robert Loggia. De Palma dedicated this version of Scarface to the memories of Howard Hawks and Ben Hecht, the writers of the original film.\r\nPacino became interested in a remake of the 1932 version after seeing it, and he and producer Martin Bregman began to develop it. Sidney Lumet was initially hired to direct the film but was replaced by De Palma, who hired Stone to write the script. Filming took place from November 1982 to May 1983, in Los Angeles and Miami. The film's soundtrack was composed by Giorgio Moroder.\r\nScarface premiered in New York City on December 1, 1983, and was released on December 9 by Universal Pictures. The film grossed $45 million at the domestic box office and $66 million worldwide. Initial critical reception was negative due to its excessive violence, profanity, and graphic drug usage. Some Cuban expatriates in Miami objected to the film's portrayal of Cubans as criminals and drug traffickers. In the years that followed, critics have reappraised it, and it is now considered one of the greatest gangster films ever made. Screenwriters and directors such as Martin Scorsese have praised the film, and it has been referenced extensively in pop culture, especially in hip hop music, as well as comic books, television programs, and video games. The film has come to be regarded as a cult classic.\r\nPlot\r\nIn 1980, Cuban refugee and ex-convict Tony Montana arrives in Miami, as part of the Mariel boatlift, where he is sent to a refugee camp with his best friend Manny Ray and their companions Angel and Chi-Chi. The four are released and given green cards in exchange for murdering a former Cuban general at the request of Miami drug lord Frank Lopez. They find work as dishwashers at a restaurant, but are dissatisfied. Tony proclaims that he is meant for bigger things.\r\nFrank's right-hand man, Omar Suarez, sends the four to purchase cocaine from Colombian dealers. Tony and Angel are captured at gunpoint, and Tony is forced to watch Angel being dismembered with a chainsaw before Manny and Chi-Chi rescue him. The three kill the Colombians and personally deliver the recovered drugs and money to Frank, suspecting that Omar set them up.\r\nDuring their meeting, Tony becomes attracted to Frank's trophy wife, Elvira. Tony and Manny begin working for Frank. Later, Tony visits his mother and younger sister Gina, the latter of whom he is overprotective. Disgusted by his life of crime, his mother throws him out. Manny is attracted to Gina, but Tony tells him to stay away from her.\r\nFrank sends Tony and Omar to Cochabamba, Bolivia, to meet with cocaine kingpin Alejandro Sosa. During the meeting, Omar is unhappy when Tony negotiates a large deal without Frank's approval. Sosa later has his men hang Omar from a helicopter, telling Tony that he was a police informant and that Frank has poor judgment for having trusted him. Tony vouches for Frank's organization; Sosa takes a liking to Tony and agrees to the deal, but warns Tony to never betray him.\r\nSeeing that Frank is infuriated by Omar's death and the size of the deal with Sosa, Tony sets up an independent cocaine operation. Mel Bernstein, a corrupt police detective on Frank's payroll, accosts Tony at a nightclub and attempts to extort money from him in return for police protection. Tony spots Gina fraternizing with a man and beats them both when he sees him grope her. Hitmen then attempt to kill Tony, who escapes with a bullet wound. He confronts Frank and Bernstein, certain that they orchestrated the attack; Frank confesses his involvement at gunpoint and begs for his life, but Tony has Manny shoot him dead before proceeding to kill Bernstein. Tony marries Elvira and becomes the distributor of Sosa's product, using his profits to build a multi-million-dollar business empire and construct a large, heavily-guarded estate.\r\nIn 1983, a money laundering sting operation by federal agents resulted in Tony being charged with tax evasion and facing a prison sentence. Sosa offers to use his government connections to keep Tony out of prison, but only if Tony helps kill an activist intending to expose Sosa's drug operations. During dinner at an upscale restaurant, Tony accuses Manny of causing his arrest and Elvira of being an infertile junkie, prompting Elvira to leave him.\r\nTony and Sosa's henchman, \"Shadow,\" travel to New York City to carry out the assassination. Shadow plants a radio-controlled bomb under the man's car, but Tony tries to call off the hit upon seeing him accompanied by his wife and children. When Shadow refuses to back down, Tony kills him before he can detonate the bomb. Tony returns to Miami, where an enraged Sosa calls him to promise retribution for allowing the activist to deliver the exposé. At his mother's behest, Tony, who is stoned on cocaine, tracks down Gina and finds her with Manny; in a fit of rage, Tony shoots Manny dead only to learn that Gina had just married him. A distraught Tony returns to his estate with Gina and begins a massive cocaine binge in his office.\r\nSosa's men begin to invade the grounds and kill Tony's guards as Gina enters the office with a Smith & Wesson Model 36, accusing him of wanting her for himself. She shoots and wounds him, but is killed by one of Sosa's men whom Tony kills in return. Tony deploys an M16 rifle with an under-mounted M203 grenade launcher against the invaders, killing many of them but suffering multiple gunshot wounds. He taunts his attackers until an assassin climbs up to the office and shoots him in the back with a double-barreled shotgun. Tony's body falls off the balcony into a pool, where it floats near the base of a globe bearing the ironic motto \"The World Is Yours\".\r\nCast\r\nAl Pacino as Tony Montana: a Cuban refugee who becomes a wealthy drug lord in Miami\r\nSteven Bauer as Manny Ray: Tony's friend and right-hand man\r\nMichelle Pfeiffer as Elvira: Frank Lopez's wife, who later marries Tony Montana\r\nMary Elizabeth Mastrantonio as Gina: Tony's sister, of whom he is overprotective\r\nRobert Loggia as Frank Lopez: a Miami drug lord who mentors Tony and Manny\r\nMíriam Colón as Mama Montana: Tony's disapproving mother\r\nF. Murray Abraham as Omar: Frank's righthand man who is sceptical of Tony\r\nPaul Shenar as Alejandro Sosa: a Bolivian drug lord and supplier for Tony\r\nHarris Yulin as Bernstein: a crooked police officer on Lopez's payroll who attempts to extort Tony\r\nÁngel Salazar as Chi-Chi: a friend of Tony\r\nArnaldo Santana as Ernie: a bodyguard of Frank's, who later works for Tony\r\nPepe Serna as Angel: a friend of Tony\r\nMichael P. Moran as Nick the Pig: an underling of Tony\r\nAl Israel as Hector the Toad: a Colombian drug trafficker\r\nDennis Holahan as Banker: a banker used by Tony to launder his money\r\nMark Margolis as Shadow: a Sosa henchman\r\nMichael Alldredge as Sheffield: Tony's lawyer\r\nTed Beniades as Seidelbaum: an undercover police officer\r\nAlbert Carrier as Pedro Quinn: chairman of the Andes Sugar Corporation\r\nCaesar Cordova as Taco Stand Cook: a cook from the Cuban Diner\r\nAdditionally, Geno Silva portrays the assassin who kills Tony Montana, credited as The Skull. Richard Belzer portrays the Babylon Club M.C. Lana Clarkson appears as Manny's dance partner at the Babylon Club. De Palma regulars Charles Durning and Dennis Franz provided uncredited voiceover dubbing of the Immigration and Naturalization Service officers who interrogate Montana in the opening scene. Garnett Smith, Tony Perez and John Brandon portrayed the Immigration and Naturalization Service officers. Teen model Tammy Lynn Leppert appears as a prostitute during the chainsaw scene. Five months later, Leppert disappeared and has been a missing person since.\r\nProduction\r\nDevelopment\r\nScarface began development after Al Pacino saw the 1932 film of the same name at the Tiffany Theater while in Los Angeles. He later called his manager, producer Martin Bregman, and informed him of his belief in the potential for a remake of that film. Pacino originally wanted to retain the period piece aspect, but realized that because of its melodramatic nature it would be difficult to accomplish. Sidney Lumet became attached as the director, developing the idea for Montana to be a Cuban arriving in the United States during the Mariel boatlift.\r\nBregman and Lumet's creative differences saw Lumet drop out of the project. Lumet had wanted to make a more political story that focused on blaming the current Presidential administration for the influx of cocaine into the United States, yet Bregman disagreed. Bregman replaced him with Brian De Palma, and hired writer Oliver Stone; Stone had seen the original 1932 Scarface and had not enjoyed it, so he initially rejected the offer. Only after he talked to Lumet was he convinced to accept the offer since they agreed on transforming the film from a period piece to a contemporary film, saying, \"Sidney had a great idea to take the 1930s American prohibition gangster movie and make it into a modern immigrant gangster movie dealing with the same problems that we had then, that we're prohibiting drugs instead of alcohol. There's a prohibition against drugs that's created the same criminal class as (prohibition of alcohol) created the Mafia\". In the book The Oliver Stone Experience, Stone wrote: \"I didn't want to do an Italian Mafia movie ... We'd had dozens of these things. But then Bregman came back to me and said, Sidney has a great idea — he wants to do it as a Marielito picture in Miami. I said, That's interesting! Sidney's idea was a good one\".\r\nStone researched the script while battling his own cocaine addiction. He and Bregman performed their own research, traveling to Miami, Florida, where they were given access to records from the U.S. Attorney's Office and the Organized Crime Bureau. Stone moved to Paris to write the script, believing he could not break his addiction while in the United States, stating in a 2003 interview that he was completely off drugs at the time \"because I don't think cocaine helps writing. It's very destructive to the brain cells\".\r\nCasting\r\nPacino insisted on taking the lead role as Tony Montana, although Robert De Niro had been offered it and had turned it down. Pacino worked with experts in knife combat, trainers, and boxer Roberto Durán to attain the body type that he wanted for the role. Durán also helped inspire the character, who had \"a certain lion in him\", according to Pacino. Meryl Streep's immigrant character in Sophie's Choice (1982) also influenced Pacino's portrayal of Tony Montana. Bauer and a dialect coach helped him learn aspects of the Cuban Spanish language and pronunciation.\r\nPfeiffer was an unknown actress at the time, known primarily for her role in Grease 2; both Pacino and De Palma had argued against her casting, but Bregman fought for her inclusion. Glenn Close was the original choice for the role, while others were also considered, including Geena Davis, Carrie Fisher, Kelly McGillis, Rosanna Arquette, Melanie Griffith, Kim Basinger, Brooke Shields, Sharon Stone, and Sigourney Weaver.\r\nBauer got his role without even auditioning. During the audition process, casting director Alixe Gordin saw Bauer and instantly noted that he was right for the role of Manny, a judgment with which both De Palma and Bregman agreed. He was the only actual Cuban in the principal cast. John Travolta was considered for the role.\r\nFilming\r\nDespite the film being set in Miami, much of the film was shot in Los Angeles due to the Miami Tourist Board declining requests to film there as it feared the film would deter tourism to the city with its themes of drugs and gangsters. Tony's opulent mansion was El Fureidis, a Roman-styled mansion near Santa Barbara, California. The picture was shot over 24 weeks from November 22, 1982 to May 6, 1983. In April 1983, however, a scene was shot at Miami's Fontainebleau Miami Beach. The special effects were performed by Ken Pepiot and Stan Parks.\r\nThe production was halted twice for severe weather events in California. During production in March, Pacino burned his left hand on the muzzle of the gun that had just been fired when he tripped during a fight scene. Production was shut down for more than a week while Pacino recovered. A premature bomb explosion also injured two stuntmen during a scene shot in his absence. The gunfight scene at the end of the film also includes a single camera shot directed by Steven Spielberg, who was visiting the set at the time. Powdered baby laxative was used as the fake substance for cocaine in the film; Pacino's nasal passage was slightly damaged due to snorting large quantities over the course of filming.\r\nRating\r\nLess than two months before the film's release, on October 28, 1983, Scarface was given an X rating by the MPAA for \"excessive and cumulative violence and for language\". De Palma had already re-cut the film three times by that point; De Palma stated: \"I said I've had it with these people, I'm not taking any more out\". Bregman told The New York Times that \"we have been designated as a pornographic film ... We'll accept the X rating and appeal\". Universal would not release the film with an X rating due to the porn perception and the reduction of ticket sales being from ticket buyers, most newspapers, TV, and radio stations, who would not run ads for an X-rated film. On November 8, an appeal board composed of 20 theater owners, studio executives and independent distributors overturned the decision 17 to 3 in favor of an R rating—more than the two-thirds required. De Palma believed that the changes were minor enough to be unnoticeable and requested to release the original cut of the film with the rating. When the MPAA refused, De Palma released the film uncut anyway, only admitting to it months after the film's release.\r\nMusic\r\nInstead of using popular music from the period in which the film is set, the music in Scarface was produced by Academy Award-winning Italian record producer Giorgio Moroder. Reflecting Moroder's style, the soundtrack consists mostly of synthesized new wave and electronic music. De Palma said that he repeatedly denied Universal's requests to release the film with a \"pop\" score because he felt Moroder's score was adequate. In June 2022, the complete score and soundtrack was released by La-La Land Records.\r\nRelease\r\nTheatrical\r\nScarface premiered on December 1, 1983, in New York City, where it was initially greeted with mixed reaction. The film's two stars, Al Pacino and Steven Bauer, were joined in attendance by Burt and Diane Lane, Melanie Griffith, Raquel Welch, Joan Collins, her boyfriend Peter Holm, and Eddie Murphy, among others. It was then given a wide release on December 9.\r\nHome media\r\nScarface was initially released by MCA Home Video on VHS, CED Videodisc, Laserdisc, and Beta in the summer of 1984 – a two-tape set in 1.33:1 pan and scan ratio – and quickly became a bestseller, becoming the first to sell 100,000 copies at a retail price of $79.95. A 2.39:1 Widescreen VHS followed years later in 1998 to coincide with the special edition DVD release. The last VHS release was in 2003 to counterpart the 20th anniversary edition DVD. The 2003 DVD was remastered and re-released through Universal Records.\r\nThe television version of Scarface premiered on ABC on January 7, 1989. 32 minutes of violence, profanity and sex were edited out, and much of the dialogue, including the constant use of the word \"fuck\", which was muted after the beginning of \"f-\" or replaced with less offensive alternatives.\r\nThe film received a North American DVD release on the film's fifteenth anniversary in 1998, featuring a non-anamorphic widescreen transfer, a \"Making of\" documentary, outtakes, production notes, and cast and crew biographies. This release was not successful, and many fans and reviewers complained about its unwatchable video transfer and muddled sound, describing it as \"one of the worst big studio releases out there\". The 20th Anniversary edition was released on DVD and VHS in 2003, with the DVD selling more than 2 million units in its first week and becoming the best-selling R-rated DVD title.\r\nIn 2003, Music Inspired by Scarface, a Def Jam Recordings compilation album, featured songs by various hip-hop artists which either draw direct inspiration from the film, or contain subject matter that can relate to the film.\r\nScarface was released on Blu-ray on September 6, 2011, in a two-disc, limited edition, steelbox package: the set was criticized for its poor picture quality due to usage of an old master created from the DVD release. Disc two is a DVD of the 1932 Scarface, featuring a TMC-produced introduction by Robert Osborne and an alternate ending. Bonus features include The Making of Scarface documentary, and a new retrospective documentary: The Scarface Phenomenon.\r\nA special gift set, limited to 1,000 copies, features the Blu-ray set housed in a cigar humidor, designed by humidor craftsman Daniel Marshall. The humidor box set retailed at $999.99.\r\nA standard 4K Ultra HD Blu-ray and limited edition set were released on October 15, 2019. The limited edition set contains a specially made statue, a newly remastered transfer and, for the first time on Blu-ray, the 1932 original. There is also a standard set which contains the same 4K transfer and a remastered 1080p disk but does not include the 1932 version. A month later on November 19, the 1932 original was given its own individual release. The 4K release ports over all of the old special features and adds one new one, which is a reunion special in tribute to the 35th anniversary of the movie's release.\r\nIn the United States, the film sold 3.7 million DVD units for $78.2 million in 2003, and 285,916 Blu-ray units for $6,103,545 as of 2020, totaling 3,985,916 DVD and Blu-ray units sold for $84,303,545 as of 2020.\r\nReception\r\nBox office\r\nScarface was released theatrically in North America on December 9, 1983. The film earned $4.5 million from 996 theaters during its opening weekend, an average of $4,616 per theater, and ranking as the second-highest-grossing film of the weekend behind Sudden Impact ($9.6 million), which debuted the same weekend. It went on to earn $44.6 million in North America and $20.4 million from other markets, for a total of $65.1 million. This figure made Scarface the 16th highest-grossing film of 1983, and seventh highest grossing R-rated film in North America for 1983. It has since been given three re-releases in 2003, which featured a remastered film for the film's 20th anniversary, 2012, and 2014, bringing the total earned to $45.4 million domestically, for a total of $66 million worldwide.\r\nIn terms of box office admissions, the film sold 14,197,700 tickets in the United States and Spain, 1,067,544 tickets in France and Italy, 250,746 tickets in South Korea, and 195,872 tickets in Germany, for a total of 15,711,862 tickets sold in these territories.\r\nCritical response\r\nCritics were generally negative about Scarface when it was originally released. and was criticized for its violence and profanity. The New York Magazine defined it as an empty, bullying, and overblown B movie. Writers Kurt Vonnegut and John Irving were among those who walked out in disgust after the notorious chainsaw scene. At the middle of the film, Martin Scorsese turned to Bauer and told him: \"You guys are great – but be prepared, because they're going to hate it in Hollywood ... because it's about them\".\r\nRoger Ebert rated it four stars out of four in his 1983 review, and he later added it to his \"Great Movies\" list. Ebert wrote, \"DePalma and his writer, Oliver Stone, have created a gallery of specific individuals, and one of the fascinations of the movie is that we aren't watching crime-movie clichés, we're watching people who are criminals\". Vincent Canby praised the film in The New York Times: \"The dominant mood of the film is... bleak and futile: what goes up must always come down. When it comes down in Scarface, the crash is as terrifying as it is vivid and arresting\".\r\nLeonard Maltin was among those critics who held a negative opinion of Scarface. He gave the film 1½ stars out of four, stating that Scarface \"wallows in excess and unpleasantness for nearly three hours, and offers no new insights except that crime doesn't pay. At least the 1932 movie moved\". Maltin included an addendum to his review in later editions of his annual movie guide, stating his surprise with the film's newfound popularity as a cult-classic.\r\nIn his review for Newsweek, David Ansen wrote: \"If Scarface makes you shudder, it's from what you think you see and from the accumulated tension of this feral landscape. It's a grand, shallow, decadent entertainment, which like all good Hollywood gangster movies delivers the punch and counterpunch of glamour and disgust\". Jay Scott wrote in his review for The Globe and Mail: \"For a while, Al Pacino is hypnotic as Montana. But the effort expended on the flawless Cuban accent and the attempts to flesh out a character cut from inch-thick cardboard are hopeless\". In his review for The Washington Post, Gary Arnold wrote: \"A movie that appeared intent on revealing an alarmingly contemporary criminal subculture gradually reverts to underworld cliche, covering its derivative tracks with outrageous decor and an apocalyptic, production number finale, ingeniously choreographed to leave the antihero floating face down in a literal bloodbath\".\r\nOn review aggregator Rotten Tomatoes, the film holds an 81% approval rating based on 69 reviews, with an average rating of 7.50/10. The website's critics consensus reads: \"Director Brian De Palma and star Al Pacino take it to the limit in this stylized, ultra-violent and eminently quotable gangster epic that walks a thin white line between moral drama and celebratory excess\". Metacritic, which uses a weighted average, assigned the film a score of 65 out of 100 based on reviews from 9 critics, indicating \"generally favorable reviews\".\r\nDepiction of stereotypes\r\nDuring filming, some Cubans objected to the film's Cuban characters being portrayed as criminals by mostly non-Cuban actors. The film featured a disclaimer following its credits stating in red, all-cap lettering \"Scarface is a fictional account of the activities of a small group of ruthless criminals. The characters do not represent the Cuban/American community and it would be erroneous and unfair to suggest that they do. The vast majority of Cuban/Americans have demonstrated a dedication, vitality and enterprise that has enriched the American scene\".\r\nIn 2008, Damarys Ocaña of The Guardian wrote that the film reinforces stereotypes of Marielito Cubans, as it exaggerated the number of criminals in the Mariel boatlift. She also called Pacino's portrayal of a Cuban-American as having a \"ridiculous accent and overacting\". According to a 1985 Sun Sentinel magazine article, it was rumored that, of the approximate 125,000 refugees that entered the United States on the boatlift, around 16,000 to 20,000 were estimated to be criminals and around 350 to 400 Mariel Cubans were reported to inhabit Dade County jails on a typical day. However, in a New York Daily News editorial following the film’s release, Miguel Perez charged, “the movie fails to say that even among those Marielitos who had criminal records, there were thousands whose offenses were so minor that they would not be considered criminals here, and thousands of others whose ‘criminal record’ was based on their opposition to the Communist regime.”\r\nDemetrio Perez, the city commissioner of Miami, led the charge against the film. Estimates assert that the Cuban refugees only included some 2,700 hardened criminals. In The Oliver Stone Experience, Stone commented: \"Well, Tony Montana was a gangster ... His mother and his sister represent the clean-cut Cuban community. His mother scolds him: You're a scumbag, get out of my house! You're ruining your sister! So there is a strong morality in the movie. I knew about the criticisms even in advance, that Cubans were not like that. But I'm sorry: A lot of Cubans did become Marielitos. If I'd done it about Colombians, they would've said the same thing: 'You're anti-Colombian'\".\r\nAccolades\r\nThe film is recognized by American Film Institute in these lists:\r\n2003: AFI's 100 Years...100 Heroes & Villains: Tony Montana – Nominated Villain\r\nTony Montana – Nominated Villain\r\n2005: AFI's 100 Years...100 Movie Quotes: Tony Montana: \"Say \"hello\" to my little friend!\" – #61\r\nTony Montana: \"Say \"hello\" to my little friend!\" – #61\r\n2008: AFI's 10 Top 10: No. 10 Gangster Film\r\nNo. 10 Gangster Film\r\nNotably, Scarface is the only remake to appear in the same AFI 10 Top 10 list as the original film. It is No. 10 while the 1932 original is No. 6.\r\nLegacy\r\nFilm industry\r\nPacino was already an established successful actor, but Scarface helped launch Pfeiffer's and Mastrantonio's careers, both of whom were relatively unknown beforehand and went on to individual successes. Entertainment Weekly ranked the film #8 on their list of \"The Top 50 Cult Films\", and Empire Magazine placed it among the top 500 films of all time, at #284. In 2009, Total Film listed it at number 9 on their list of the 30 Greatest Gangster movies. Scarface was among the earliest films in which the expletive \"fuck\" is used persistently, 226 times in total. The company set up by former Iraqi president Saddam Hussein to launder money was named Montana Management after Tony Montana's money laundering operation in the film.\r\nInfluence in hip hop\r\nThe release of Scarface coincided with the rise of hip hop, and the film has had a lasting influence on hip hop music artists. American rapper Nas compared himself to Tony Montana and compared rapper Jay-Z to Manolo, both characters from Scarface, on Nas's track \"Last Real Nigga Alive\" from his album God's Son, during the time of the high-profile feud between the two. Rapper AZ, Nas's close associate has referred himself as SOSA over the years. Rapper Chief Keef uses the nickname “Sosa” after Alejandro Sosa. South-Korean rapper and member of group BTS, Agust D also compared himself to Tony Montana and made multiple references to the movie in his track \"Tony Montana\" from his debut album, Agust D. In The Lonely Island parody hip hop 2011 song \"Jack Sparrow\", a rap song intended to be about clubbing is ruined by Michael Bolton singing about various films, including Scarface.\r\nCultural references\r\nIn 2010, artist James Georgopoulos included the screen-used guns from Scarface in his popular Guns of Cinema series. Dark Horse Comics' imprint DH Press released a novel called Scarface: The Beginning by L. A. Banks. IDW publishing released a limited series called Scarface: Scarred For Life. It starts with corrupt police officers finding that Tony has survived the final mansion showdown. Tony works at rebuilding his criminal empire, similar to the game The World Is Yours.\r\nScarface is among the films that served as inspiration for the 2002 video game Grand Theft Auto: Vice City, which took place in a representation of 1980s' Miami and featured a recreation of Montana's mansion. The video for Motley Crue's song \"Dr. Feelgood\" echoes several elements of the film (the end of the video features a bloodless version of the climatic shootout where Tony Montana is killed) and the song itself describes a young man who rises to great power in the drug trade and then loses it all.\r\nThe video game series Yakuza takes many influences from the film. Among these include Kiryu Kazuma's various outfits which bear similarities to those worn by Tony Montana.\r\nScarface got its own direct tie-in with the 2006 video games Scarface: The World Is Yours and Scarface: Money. Power. Respect.\r\nThe quote \"Say hello to my little friend!\" from the film's climactic scene has become a pop culture staple, and ranked 61 in AFI's 100 Years...100 Movie Quotes list.\r\nIn 1992, professional wrestler Scott Hall joined the World Wrestling Federation (WWF, now WWE) as Razor Ramon, a shady and stylish Cuban American bully from Miami. The character was modeled after the characters Tony Montana and Manny Ribera from Scarface. Ramon's nickname (The Bad Guy) and catchphrase (\"Say hello to The Bad Guy\") derive from Montana's quotes: \"Say hello to my little friend\" and \"Say goodnight to the bad guy\". Later in his career, Hall claimed he pitched the idea of a Scarface-like character during a meeting with Vince McMahon and Pat Patterson, as a joke.\r\nBob Dylan's 2020 song \"My Own Version of You\" references it with the line, \"I'll take the Scarface Pacino and the Godfather Brando / Mix 'em up in a tank and get a robot commando\".\r\nMetric's 2009 song \"Gold Guns Girls\" from the album Fantasies was inspired by the film.\r\nFuture\r\nCancelled sequel\r\nIn 2001, plans were made for hip hop artist Cuban Link to write and star in a sequel to Scarface titled Son of Tony. The plans drew both praise and criticism and, after several years, Cuban Link indicated that he may no longer be involved with the project as the result of film rights issues and creative control.\r\nRemake\r\nIn 2011, Universal began developing a new version of Scarface. The studio stated that the new film is neither a sequel nor a remake, but will take elements from both this version and its 1932 predecessor, including the basic premise: a man who becomes a kingpin in his quest for the American Dream. Martin Bregman, who produced the 1983 remake produced this version also, with a screenplay by David Ayer, and David Yates in talks to direct the film.\r\nIn March 2014, TheWrap reported that Pablo Larraín was in negotiations to direct the film, along with Paul Attanasio to write the script. The film's update will be an original story set in modern-day Los Angeles that follows a Mexican immigrant's rise in the criminal underworld as he strives for the American Dream. Jonathan Herman was set in March 2015 to rewrite both drafts of the script.\r\nAntoine Fuqua was hired to direct the film in August 2016, with Terence Winter to penn the script for the film. In January 2017, Fuqua left the project and Diego Luna was cast in the lead role.\r\nThe film was initially scheduled to be released in theaters on August 10, 2018, with the film's script being written by the Coen brothers. Fuqua was brought back to direct the new film, with Gareth Dunnet-Alcocer writing the screenplay. However, the film had not been released in theaters as originally planned and filming had been announced to start in October.\r\nFuqua left again directing in May 2020. Instead, Luca Guadagnino has signed on to direct the film, with the script still being written by the Coen brothers as previously confirmed.\r\nIn 2022, the film was reportedly shelved.",
    "html": "<p>Scarface is a 1983 American crime drama film directed by Brian De Palma and written by Oliver Stone. Loosely based on the 1929 novel of the same name and serving as a loose remake of the 1932 film, it tells the story of Cuban refugee Tony Montana (Al Pacino), who arrives penniless in Miami during the Mariel boatlift and becomes a powerful and extremely homicidal drug lord. The film co-stars Steven Bauer, Michelle Pfeiffer, Mary Elizabeth Mastrantonio and Robert Loggia. De Palma dedicated this version of Scarface to the memories of Howard Hawks and Ben Hecht, the writers of the original film.</p><p>Pacino became interested in a remake of the 1932 version after seeing it, and he and producer Martin Bregman began to develop it. Sidney Lumet was initially hired to direct the film but was replaced by De Palma, who hired Stone to write the script. Filming took place from November 1982 to May 1983, in Los Angeles and Miami. The film's soundtrack was composed by Giorgio Moroder.</p><p>Scarface premiered in New York City on December 1, 1983, and was released on December 9 by Universal Pictures. The film grossed $45 million at the domestic box office and $66 million worldwide. Initial critical reception was negative due to its excessive violence, profanity, and graphic drug usage. Some Cuban expatriates in Miami objected to the film's portrayal of Cubans as criminals and drug traffickers. In the years that followed, critics have reappraised it, and it is now considered one of the greatest gangster films ever made. Screenwriters and directors such as Martin Scorsese have praised the film, and it has been referenced extensively in pop culture, especially in hip hop music, as well as comic books, television programs, and video games. The film has come to be regarded as a cult classic.</p><br/><h3>Plot</h3><p>In 1980, Cuban refugee and ex-convict Tony Montana arrives in Miami, as part of the Mariel boatlift, where he is sent to a refugee camp with his best friend Manny Ray and their companions Angel and Chi-Chi. The four are released and given green cards in exchange for murdering a former Cuban general at the request of Miami drug lord Frank Lopez. They find work as dishwashers at a restaurant, but are dissatisfied. Tony proclaims that he is meant for bigger things.</p><p>Frank's right-hand man, Omar Suarez, sends the four to purchase cocaine from Colombian dealers. Tony and Angel are captured at gunpoint, and Tony is forced to watch Angel being dismembered with a chainsaw before Manny and Chi-Chi rescue him. The three kill the Colombians and personally deliver the recovered drugs and money to Frank, suspecting that Omar set them up.</p><p>During their meeting, Tony becomes attracted to Frank's trophy wife, Elvira. Tony and Manny begin working for Frank. Later, Tony visits his mother and younger sister Gina, the latter of whom he is overprotective. Disgusted by his life of crime, his mother throws him out. Manny is attracted to Gina, but Tony tells him to stay away from her.</p><p>Frank sends Tony and Omar to Cochabamba, Bolivia, to meet with cocaine kingpin Alejandro Sosa. During the meeting, Omar is unhappy when Tony negotiates a large deal without Frank's approval. Sosa later has his men hang Omar from a helicopter, telling Tony that he was a police informant and that Frank has poor judgment for having trusted him. Tony vouches for Frank's organization; Sosa takes a liking to Tony and agrees to the deal, but warns Tony to never betray him.</p><p>Seeing that Frank is infuriated by Omar's death and the size of the deal with Sosa, Tony sets up an independent cocaine operation. Mel Bernstein, a corrupt police detective on Frank's payroll, accosts Tony at a nightclub and attempts to extort money from him in return for police protection. Tony spots Gina fraternizing with a man and beats them both when he sees him grope her. Hitmen then attempt to kill Tony, who escapes with a bullet wound. He confronts Frank and Bernstein, certain that they orchestrated the attack; Frank confesses his involvement at gunpoint and begs for his life, but Tony has Manny shoot him dead before proceeding to kill Bernstein. Tony marries Elvira and becomes the distributor of Sosa's product, using his profits to build a multi-million-dollar business empire and construct a large, heavily-guarded estate.</p><p>In 1983, a money laundering sting operation by federal agents resulted in Tony being charged with tax evasion and facing a prison sentence. Sosa offers to use his government connections to keep Tony out of prison, but only if Tony helps kill an activist intending to expose Sosa's drug operations. During dinner at an upscale restaurant, Tony accuses Manny of causing his arrest and Elvira of being an infertile junkie, prompting Elvira to leave him.</p><p>Tony and Sosa's henchman, \"Shadow,\" travel to New York City to carry out the assassination. Shadow plants a radio-controlled bomb under the man's car, but Tony tries to call off the hit upon seeing him accompanied by his wife and children. When Shadow refuses to back down, Tony kills him before he can detonate the bomb. Tony returns to Miami, where an enraged Sosa calls him to promise retribution for allowing the activist to deliver the exposé. At his mother's behest, Tony, who is stoned on cocaine, tracks down Gina and finds her with Manny; in a fit of rage, Tony shoots Manny dead only to learn that Gina had just married him. A distraught Tony returns to his estate with Gina and begins a massive cocaine binge in his office.</p><p>Sosa's men begin to invade the grounds and kill Tony's guards as Gina enters the office with a Smith & Wesson Model 36, accusing him of wanting her for himself. She shoots and wounds him, but is killed by one of Sosa's men whom Tony kills in return. Tony deploys an M16 rifle with an under-mounted M203 grenade launcher against the invaders, killing many of them but suffering multiple gunshot wounds. He taunts his attackers until an assassin climbs up to the office and shoots him in the back with a double-barreled shotgun. Tony's body falls off the balcony into a pool, where it floats near the base of a globe bearing the ironic motto \"The World Is Yours\".</p><br/><h3>Cast</h3><ul><li>Al Pacino as Tony Montana: a Cuban refugee who becomes a wealthy drug lord in Miami</li><li>Steven Bauer as Manny Ray: Tony's friend and right-hand man</li><li>Michelle Pfeiffer as Elvira: Frank Lopez's wife, who later marries Tony Montana</li><li>Mary Elizabeth Mastrantonio as Gina: Tony's sister, of whom he is overprotective</li><li>Robert Loggia as Frank Lopez: a Miami drug lord who mentors Tony and Manny</li><li>Míriam Colón as Mama Montana: Tony's disapproving mother</li><li>F. Murray Abraham as Omar: Frank's righthand man who is sceptical of Tony</li><li>Paul Shenar as Alejandro Sosa: a Bolivian drug lord and supplier for Tony</li><li>Harris Yulin as Bernstein: a crooked police officer on Lopez's payroll who attempts to extort Tony</li><li>Ángel Salazar as Chi-Chi: a friend of Tony</li><li>Arnaldo Santana as Ernie: a bodyguard of Frank's, who later works for Tony</li><li>Pepe Serna as Angel: a friend of Tony</li><li>Michael P. Moran as Nick the Pig: an underling of Tony</li><li>Al Israel as Hector the Toad: a Colombian drug trafficker</li><li>Dennis Holahan as Banker: a banker used by Tony to launder his money</li><li>Mark Margolis as Shadow: a Sosa henchman</li><li>Michael Alldredge as Sheffield: Tony's lawyer</li><li>Ted Beniades as Seidelbaum: an undercover police officer</li><li>Albert Carrier as Pedro Quinn: chairman of the Andes Sugar Corporation</li><li>Caesar Cordova as Taco Stand Cook: a cook from the Cuban Diner</li></ul><p>Additionally, Geno Silva portrays the assassin who kills Tony Montana, credited as The Skull. Richard Belzer portrays the Babylon Club M.C. Lana Clarkson appears as Manny's dance partner at the Babylon Club. De Palma regulars Charles Durning and Dennis Franz provided uncredited voiceover dubbing of the Immigration and Naturalization Service officers who interrogate Montana in the opening scene. Garnett Smith, Tony Perez and John Brandon portrayed the Immigration and Naturalization Service officers. Teen model Tammy Lynn Leppert appears as a prostitute during the chainsaw scene. Five months later, Leppert disappeared and has been a missing person since.</p><br/><h3>Production</h3><h4>Development</h4><p>Scarface began development after Al Pacino saw the 1932 film of the same name at the Tiffany Theater while in Los Angeles. He later called his manager, producer Martin Bregman, and informed him of his belief in the potential for a remake of that film. Pacino originally wanted to retain the period piece aspect, but realized that because of its melodramatic nature it would be difficult to accomplish. Sidney Lumet became attached as the director, developing the idea for Montana to be a Cuban arriving in the United States during the Mariel boatlift.</p><p>Bregman and Lumet's creative differences saw Lumet drop out of the project. Lumet had wanted to make a more political story that focused on blaming the current Presidential administration for the influx of cocaine into the United States, yet Bregman disagreed. Bregman replaced him with Brian De Palma, and hired writer Oliver Stone; Stone had seen the original 1932 Scarface and had not enjoyed it, so he initially rejected the offer. Only after he talked to Lumet was he convinced to accept the offer since they agreed on transforming the film from a period piece to a contemporary film, saying, \"Sidney had a great idea to take the 1930s American prohibition gangster movie and make it into a modern immigrant gangster movie dealing with the same problems that we had then, that we're prohibiting drugs instead of alcohol. There's a prohibition against drugs that's created the same criminal class as (prohibition of alcohol) created the Mafia\". In the book The Oliver Stone Experience, Stone wrote: \"I didn't want to do an Italian Mafia movie ... We'd had dozens of these things. But then Bregman came back to me and said, Sidney has a great idea — he wants to do it as a Marielito picture in Miami. I said, That's interesting! Sidney's idea was a good one\".</p><p>Stone researched the script while battling his own cocaine addiction. He and Bregman performed their own research, traveling to Miami, Florida, where they were given access to records from the U.S. Attorney's Office and the Organized Crime Bureau. Stone moved to Paris to write the script, believing he could not break his addiction while in the United States, stating in a 2003 interview that he was completely off drugs at the time \"because I don't think cocaine helps writing. It's very destructive to the brain cells\".</p><h4>Casting</h4><p>Pacino insisted on taking the lead role as Tony Montana, although Robert De Niro had been offered it and had turned it down. Pacino worked with experts in knife combat, trainers, and boxer Roberto Durán to attain the body type that he wanted for the role. Durán also helped inspire the character, who had \"a certain lion in him\", according to Pacino. Meryl Streep's immigrant character in Sophie's Choice (1982) also influenced Pacino's portrayal of Tony Montana. Bauer and a dialect coach helped him learn aspects of the Cuban Spanish language and pronunciation.</p><p>Pfeiffer was an unknown actress at the time, known primarily for her role in Grease 2; both Pacino and De Palma had argued against her casting, but Bregman fought for her inclusion. Glenn Close was the original choice for the role, while others were also considered, including Geena Davis, Carrie Fisher, Kelly McGillis, Rosanna Arquette, Melanie Griffith, Kim Basinger, Brooke Shields, Sharon Stone, and Sigourney Weaver.</p><p>Bauer got his role without even auditioning. During the audition process, casting director Alixe Gordin saw Bauer and instantly noted that he was right for the role of Manny, a judgment with which both De Palma and Bregman agreed. He was the only actual Cuban in the principal cast. John Travolta was considered for the role.</p><h4>Filming</h4><p>Despite the film being set in Miami, much of the film was shot in Los Angeles due to the Miami Tourist Board declining requests to film there as it feared the film would deter tourism to the city with its themes of drugs and gangsters. Tony's opulent mansion was El Fureidis, a Roman-styled mansion near Santa Barbara, California. The picture was shot over 24 weeks from November 22, 1982 to May 6, 1983. In April 1983, however, a scene was shot at Miami's Fontainebleau Miami Beach. The special effects were performed by Ken Pepiot and Stan Parks.</p><p>The production was halted twice for severe weather events in California. During production in March, Pacino burned his left hand on the muzzle of the gun that had just been fired when he tripped during a fight scene. Production was shut down for more than a week while Pacino recovered. A premature bomb explosion also injured two stuntmen during a scene shot in his absence. The gunfight scene at the end of the film also includes a single camera shot directed by Steven Spielberg, who was visiting the set at the time. Powdered baby laxative was used as the fake substance for cocaine in the film; Pacino's nasal passage was slightly damaged due to snorting large quantities over the course of filming.</p><h4>Rating</h4><p>Less than two months before the film's release, on October 28, 1983, Scarface was given an X rating by the MPAA for \"excessive and cumulative violence and for language\". De Palma had already re-cut the film three times by that point; De Palma stated: \"I said I've had it with these people, I'm not taking any more out\". Bregman told The New York Times that \"we have been designated as a pornographic film ... We'll accept the X rating and appeal\". Universal would not release the film with an X rating due to the porn perception and the reduction of ticket sales being from ticket buyers, most newspapers, TV, and radio stations, who would not run ads for an X-rated film. On November 8, an appeal board composed of 20 theater owners, studio executives and independent distributors overturned the decision 17 to 3 in favor of an R rating—more than the two-thirds required. De Palma believed that the changes were minor enough to be unnoticeable and requested to release the original cut of the film with the rating. When the MPAA refused, De Palma released the film uncut anyway, only admitting to it months after the film's release.</p><h4>Music</h4><p>Instead of using popular music from the period in which the film is set, the music in Scarface was produced by Academy Award-winning Italian record producer Giorgio Moroder. Reflecting Moroder's style, the soundtrack consists mostly of synthesized new wave and electronic music. De Palma said that he repeatedly denied Universal's requests to release the film with a \"pop\" score because he felt Moroder's score was adequate. In June 2022, the complete score and soundtrack was released by La-La Land Records.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>Scarface premiered on December 1, 1983, in New York City, where it was initially greeted with mixed reaction. The film's two stars, Al Pacino and Steven Bauer, were joined in attendance by Burt and Diane Lane, Melanie Griffith, Raquel Welch, Joan Collins, her boyfriend Peter Holm, and Eddie Murphy, among others. It was then given a wide release on December 9.</p><h4>Home media</h4><p>Scarface was initially released by MCA Home Video on VHS, CED Videodisc, Laserdisc, and Beta in the summer of 1984 – a two-tape set in 1.33:1 pan and scan ratio – and quickly became a bestseller, becoming the first to sell 100,000 copies at a retail price of $79.95. A 2.39:1 Widescreen VHS followed years later in 1998 to coincide with the special edition DVD release. The last VHS release was in 2003 to counterpart the 20th anniversary edition DVD. The 2003 DVD was remastered and re-released through Universal Records.</p><p>The television version of Scarface premiered on ABC on January 7, 1989. 32 minutes of violence, profanity and sex were edited out, and much of the dialogue, including the constant use of the word \"fuck\", which was muted after the beginning of \"f-\" or replaced with less offensive alternatives.</p><p>The film received a North American DVD release on the film's fifteenth anniversary in 1998, featuring a non-anamorphic widescreen transfer, a \"Making of\" documentary, outtakes, production notes, and cast and crew biographies. This release was not successful, and many fans and reviewers complained about its unwatchable video transfer and muddled sound, describing it as \"one of the worst big studio releases out there\". The 20th Anniversary edition was released on DVD and VHS in 2003, with the DVD selling more than 2 million units in its first week and becoming the best-selling R-rated DVD title.</p><p>In 2003, Music Inspired by Scarface, a Def Jam Recordings compilation album, featured songs by various hip-hop artists which either draw direct inspiration from the film, or contain subject matter that can relate to the film.</p><p>Scarface was released on Blu-ray on September 6, 2011, in a two-disc, limited edition, steelbox package: the set was criticized for its poor picture quality due to usage of an old master created from the DVD release. Disc two is a DVD of the 1932 Scarface, featuring a TMC-produced introduction by Robert Osborne and an alternate ending. Bonus features include The Making of Scarface documentary, and a new retrospective documentary: The Scarface Phenomenon.</p><p>A special gift set, limited to 1,000 copies, features the Blu-ray set housed in a cigar humidor, designed by humidor craftsman Daniel Marshall. The humidor box set retailed at $999.99.</p><p>A standard 4K Ultra HD Blu-ray and limited edition set were released on October 15, 2019. The limited edition set contains a specially made statue, a newly remastered transfer and, for the first time on Blu-ray, the 1932 original. There is also a standard set which contains the same 4K transfer and a remastered 1080p disk but does not include the 1932 version. A month later on November 19, the 1932 original was given its own individual release. The 4K release ports over all of the old special features and adds one new one, which is a reunion special in tribute to the 35th anniversary of the movie's release.</p><p>In the United States, the film sold 3.7 million DVD units for $78.2 million in 2003, and 285,916 Blu-ray units for $6,103,545 as of 2020, totaling 3,985,916 DVD and Blu-ray units sold for $84,303,545 as of 2020.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Scarface was released theatrically in North America on December 9, 1983. The film earned $4.5 million from 996 theaters during its opening weekend, an average of $4,616 per theater, and ranking as the second-highest-grossing film of the weekend behind Sudden Impact ($9.6 million), which debuted the same weekend. It went on to earn $44.6 million in North America and $20.4 million from other markets, for a total of $65.1 million. This figure made Scarface the 16th highest-grossing film of 1983, and seventh highest grossing R-rated film in North America for 1983. It has since been given three re-releases in 2003, which featured a remastered film for the film's 20th anniversary, 2012, and 2014, bringing the total earned to $45.4 million domestically, for a total of $66 million worldwide.</p><p>In terms of box office admissions, the film sold 14,197,700 tickets in the United States and Spain, 1,067,544 tickets in France and Italy, 250,746 tickets in South Korea, and 195,872 tickets in Germany, for a total of 15,711,862 tickets sold in these territories.</p><h4>Critical response</h4><p>Critics were generally negative about Scarface when it was originally released. and was criticized for its violence and profanity. The New York Magazine defined it as an empty, bullying, and overblown B movie. Writers Kurt Vonnegut and John Irving were among those who walked out in disgust after the notorious chainsaw scene. At the middle of the film, Martin Scorsese turned to Bauer and told him: \"You guys are great – but be prepared, because they're going to hate it in Hollywood ... because it's about them\".</p><p>Roger Ebert rated it four stars out of four in his 1983 review, and he later added it to his \"Great Movies\" list. Ebert wrote, \"DePalma and his writer, Oliver Stone, have created a gallery of specific individuals, and one of the fascinations of the movie is that we aren't watching crime-movie clichés, we're watching people who are criminals\". Vincent Canby praised the film in The New York Times: \"The dominant mood of the film is... bleak and futile: what goes up must always come down. When it comes down in Scarface, the crash is as terrifying as it is vivid and arresting\".</p><p>Leonard Maltin was among those critics who held a negative opinion of Scarface. He gave the film 1½ stars out of four, stating that Scarface \"wallows in excess and unpleasantness for nearly three hours, and offers no new insights except that crime doesn't pay. At least the 1932 movie moved\". Maltin included an addendum to his review in later editions of his annual movie guide, stating his surprise with the film's newfound popularity as a cult-classic.</p><p>In his review for Newsweek, David Ansen wrote: \"If Scarface makes you shudder, it's from what you think you see and from the accumulated tension of this feral landscape. It's a grand, shallow, decadent entertainment, which like all good Hollywood gangster movies delivers the punch and counterpunch of glamour and disgust\". Jay Scott wrote in his review for The Globe and Mail: \"For a while, Al Pacino is hypnotic as Montana. But the effort expended on the flawless Cuban accent and the attempts to flesh out a character cut from inch-thick cardboard are hopeless\". In his review for The Washington Post, Gary Arnold wrote: \"A movie that appeared intent on revealing an alarmingly contemporary criminal subculture gradually reverts to underworld cliche, covering its derivative tracks with outrageous decor and an apocalyptic, production number finale, ingeniously choreographed to leave the antihero floating face down in a literal bloodbath\".</p><p>On review aggregator Rotten Tomatoes, the film holds an 81% approval rating based on 69 reviews, with an average rating of 7.50/10. The website's critics consensus reads: \"Director Brian De Palma and star Al Pacino take it to the limit in this stylized, ultra-violent and eminently quotable gangster epic that walks a thin white line between moral drama and celebratory excess\". Metacritic, which uses a weighted average, assigned the film a score of 65 out of 100 based on reviews from 9 critics, indicating \"generally favorable reviews\".</p><h4>Depiction of stereotypes</h4><p>During filming, some Cubans objected to the film's Cuban characters being portrayed as criminals by mostly non-Cuban actors. The film featured a disclaimer following its credits stating in red, all-cap lettering \"Scarface is a fictional account of the activities of a small group of ruthless criminals. The characters do not represent the Cuban/American community and it would be erroneous and unfair to suggest that they do. The vast majority of Cuban/Americans have demonstrated a dedication, vitality and enterprise that has enriched the American scene\".</p><p>In 2008, Damarys Ocaña of The Guardian wrote that the film reinforces stereotypes of Marielito Cubans, as it exaggerated the number of criminals in the Mariel boatlift. She also called Pacino's portrayal of a Cuban-American as having a \"ridiculous accent and overacting\". According to a 1985 Sun Sentinel magazine article, it was rumored that, of the approximate 125,000 refugees that entered the United States on the boatlift, around 16,000 to 20,000 were estimated to be criminals and around 350 to 400 Mariel Cubans were reported to inhabit Dade County jails on a typical day. However, in a New York Daily News editorial following the film’s release, Miguel Perez charged, “the movie fails to say that even among those Marielitos who had criminal records, there were thousands whose offenses were so minor that they would not be considered criminals here, and thousands of others whose ‘criminal record’ was based on their opposition to the Communist regime.”</p><p>Demetrio Perez, the city commissioner of Miami, led the charge against the film. Estimates assert that the Cuban refugees only included some 2,700 hardened criminals. In The Oliver Stone Experience, Stone commented: \"Well, Tony Montana was a gangster ... His mother and his sister represent the clean-cut Cuban community. His mother scolds him: You're a scumbag, get out of my house! You're ruining your sister! So there is a strong morality in the movie. I knew about the criticisms even in advance, that Cubans were not like that. But I'm sorry: A lot of Cubans did become Marielitos. If I'd done it about Colombians, they would've said the same thing: 'You're anti-Colombian'\".</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Subject</th><th>Result</th><th><abbr title=\"References\">Ref</abbr></th></tr><tr><td rowspan=\"3\"><span>41st Golden Globe Awards</span></td><td><span>Best Actor – Motion Picture Drama</span></td><td><span>Al Pacino</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td><span>Steven Bauer</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score</span></td><td><span>Giorgio Moroder</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>31st <span>Motion Picture Sound Editors</span> awards</td><td><span>Golden Reel Award for Best Sound Editing – Sound Effects</span></td><td>Maurice Schell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>4th Golden Raspberry Awards</span></td><td><span>Worst Director</span></td><td><span>Brian De Palma</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>8th Golden Satellite Awards</span></td><td colspan=\"2\">Best Classic DVD Release</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr></tbody></table><p>The film is recognized by American Film Institute in these lists:</p><ul><li>2003: AFI's 100 Years...100 Heroes & Villains: Tony Montana – Nominated Villain</li><li>Tony Montana – Nominated Villain</li><li>2005: AFI's 100 Years...100 Movie Quotes: Tony Montana: \"Say \"hello\" to my little friend!\" – #61</li><li>Tony Montana: \"Say \"hello\" to my little friend!\" – #61</li><li>2008: AFI's 10 Top 10: No. 10 Gangster Film</li><li>No. 10 Gangster Film</li></ul><p>Notably, Scarface is the only remake to appear in the same AFI 10 Top 10 list as the original film. It is No. 10 while the 1932 original is No. 6.</p><br/><h3>Legacy</h3><h4>Film industry</h4><p>Pacino was already an established successful actor, but Scarface helped launch Pfeiffer's and Mastrantonio's careers, both of whom were relatively unknown beforehand and went on to individual successes. Entertainment Weekly ranked the film #8 on their list of \"The Top 50 Cult Films\", and Empire Magazine placed it among the top 500 films of all time, at #284. In 2009, Total Film listed it at number 9 on their list of the 30 Greatest Gangster movies. Scarface was among the earliest films in which the expletive \"fuck\" is used persistently, 226 times in total. The company set up by former Iraqi president Saddam Hussein to launder money was named Montana Management after Tony Montana's money laundering operation in the film.</p><h4>Influence in hip hop</h4><p>The release of Scarface coincided with the rise of hip hop, and the film has had a lasting influence on hip hop music artists. American rapper Nas compared himself to Tony Montana and compared rapper Jay-Z to Manolo, both characters from Scarface, on Nas's track \"Last Real Nigga Alive\" from his album God's Son, during the time of the high-profile feud between the two. Rapper AZ, Nas's close associate has referred himself as SOSA over the years. Rapper Chief Keef uses the nickname “Sosa” after Alejandro Sosa. South-Korean rapper and member of group BTS, Agust D also compared himself to Tony Montana and made multiple references to the movie in his track \"Tony Montana\" from his debut album, Agust D. In The Lonely Island parody hip hop 2011 song \"Jack Sparrow\", a rap song intended to be about clubbing is ruined by Michael Bolton singing about various films, including Scarface.</p><h4>Cultural references</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>appears to contain <span>trivial, minor, or unrelated</span> references to <span>popular culture</span></b>.<span class=\"hide-when-compact\"> Please reorganize this content to explain the subject's impact on popular culture, <span>providing citations</span> to <span>reliable, secondary sources</span>, rather than simply listing appearances. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">December 2022</span>)</i></span></div></td></tr></tbody></table><p>In 2010, artist James Georgopoulos included the screen-used guns from Scarface in his popular Guns of Cinema series. Dark Horse Comics' imprint DH Press released a novel called Scarface: The Beginning by L. A. Banks. IDW publishing released a limited series called Scarface: Scarred For Life. It starts with corrupt police officers finding that Tony has survived the final mansion showdown. Tony works at rebuilding his criminal empire, similar to the game The World Is Yours.</p><p>Scarface is among the films that served as inspiration for the 2002 video game Grand Theft Auto: Vice City, which took place in a representation of 1980s' Miami and featured a recreation of Montana's mansion. The video for Motley Crue's song \"Dr. Feelgood\" echoes several elements of the film (the end of the video features a bloodless version of the climatic shootout where Tony Montana is killed) and the song itself describes a young man who rises to great power in the drug trade and then loses it all.</p><p>The video game series Yakuza takes many influences from the film. Among these include Kiryu Kazuma's various outfits which bear similarities to those worn by Tony Montana.</p><p>Scarface got its own direct tie-in with the 2006 video games Scarface: The World Is Yours and Scarface: Money. Power. Respect.</p><p>The quote \"Say hello to my little friend!\" from the film's climactic scene has become a pop culture staple, and ranked 61 in AFI's 100 Years...100 Movie Quotes list.</p><p>In 1992, professional wrestler Scott Hall joined the World Wrestling Federation (WWF, now WWE) as Razor Ramon, a shady and stylish Cuban American bully from Miami. The character was modeled after the characters Tony Montana and Manny Ribera from Scarface. Ramon's nickname (The Bad Guy) and catchphrase (\"Say hello to The Bad Guy\") derive from Montana's quotes: \"Say hello to my little friend\" and \"Say goodnight to the bad guy\". Later in his career, Hall claimed he pitched the idea of a Scarface-like character during a meeting with Vince McMahon and Pat Patterson, as a joke.</p><p>Bob Dylan's 2020 song \"My Own Version of You\" references it with the line, \"I'll take the Scarface Pacino and the Godfather Brando / Mix 'em up in a tank and get a robot commando\".</p><p>Metric's 2009 song \"Gold Guns Girls\" from the album Fantasies was inspired by the film.</p><br/><h3>Future</h3><h4>Cancelled sequel</h4><p>In 2001, plans were made for hip hop artist Cuban Link to write and star in a sequel to Scarface titled Son of Tony. The plans drew both praise and criticism and, after several years, Cuban Link indicated that he may no longer be involved with the project as the result of film rights issues and creative control.</p><h4>Remake</h4><p>In 2011, Universal began developing a new version of Scarface. The studio stated that the new film is neither a sequel nor a remake, but will take elements from both this version and its 1932 predecessor, including the basic premise: a man who becomes a kingpin in his quest for the American Dream. Martin Bregman, who produced the 1983 remake produced this version also, with a screenplay by David Ayer, and David Yates in talks to direct the film.</p><p>In March 2014, TheWrap reported that Pablo Larraín was in negotiations to direct the film, along with Paul Attanasio to write the script. The film's update will be an original story set in modern-day Los Angeles that follows a Mexican immigrant's rise in the criminal underworld as he strives for the American Dream. Jonathan Herman was set in March 2015 to rewrite both drafts of the script.</p><p>Antoine Fuqua was hired to direct the film in August 2016, with Terence Winter to penn the script for the film. In January 2017, Fuqua left the project and Diego Luna was cast in the lead role.</p><p>The film was initially scheduled to be released in theaters on August 10, 2018, with the film's script being written by the Coen brothers. Fuqua was brought back to direct the new film, with Gareth Dunnet-Alcocer writing the screenplay. However, the film had not been released in theaters as originally planned and filming had been announced to start in October.</p><p>Fuqua left again directing in May 2020. Instead, Luca Guadagnino has signed on to direct the film, with the script still being written by the Coen brothers as previously confirmed.</p><p>In 2022, the film was reportedly shelved.</p><br/>"
  },
  "errorMessage": ""
}