{
  "imDbId": "tt0055630",
  "title": "Yojimbo",
  "fullTitle": "Yojimbo (1961)",
  "type": "Movie",
  "year": "1961",
  "items": [
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0076063",
      "warningSpoilers": true,
      "date": "24 December 2003",
      "rate": "10",
      "helpful": "62 out of 72 found this helpful.",
      "title": "\"You don't mind if I kill all of you?\" \"What? Kill me if you can!\" \"It'll hurt.\"",
      "content": "Akira Kurosawa's Yojimbo is a not too long, not too short action film that uses its action with just the right touches of voracity and excitement, and in the backdrop is also a sense of humor to the process. If I had to recommend a Kurosawa film to someone who's never seen one before (and might be impatient to sit through the three and a half hour Seven Samurai, or might not get the non-linear structure of Rashomon), I'd put this one in their hands to try out.Kurosawa regular Toshiro Mifune is terrific as Sanjuro Kuwabatake, a drifter of a samurai who stumbles upon a town with an assorted cast of characters, with a split between two gangs. One of the gangsters, Unosuke (Nakadai), is the only one in town; it seems, with a gun. At first Sanjuro plays each side, but when he gets beaten roughly by whom he was \"protecting\", he realizes the fun's over, and it's time to fight back.Much has been made about how Sergio Leone took Kurosawa's story and characters (most in particular being a rogue from out of town) and made them into his breakthrough Fistful of Dollars- Kurosawa even sued Leone over the story rights. But to those who wonder whether Yojimbo is 'better' than Fistful or vice versa need to remember one of two things- Kurosawa took the story from Dashiell Hammett's gangster novel Red Harvest, so neither filmmaker is making something really original; and that since each film is made in a different continent, and with the slightest different sensibilities about its characters. For one thing in Yojimbo guns are scarcer than in Fistful, and there's a treatment Kurosawa has with his actors that sets it apart from the small town western scope of Leone's weapons and actors. So each film (noticeably) carries its own kind of visual style while working in a similar plot structure. In other words, it's kind of like comparing apples and oranges picked in the same farm (if that makes at all sense).Overall, Yojimbo on its own is a lean, cool Japanese crime/action film, helmed by a master, and featuring a number of highlights to look forward to on multiple viewings. Some of those include: the scene inside Seibei's brothel (with the women dancing and singing), Masaru Sato's wonderful musical orchestrations, Mifune's curiously low-key and rough performance (which did and didn't serve as inspiration to Clint), and a climax that is up there with one of Kurosawa's finest battles. A+"
    },
    {
      "username": "Peach-2",
      "userUrl": "https://www.imdb.com/user/ur0140921",
      "reviewLink": "https://www.imdb.com/review/rw0076037",
      "warningSpoilers": false,
      "date": "26 September 1999",
      "rate": "10",
      "helpful": "165 out of 181 found this helpful.",
      "title": "Kurosawa.",
      "content": "Only a handful of directors know atmosphere the way Akira Kurosawa does, only a handful. Yojinbo opens with a tracking shot of a ronin samurai walking down a dusty road. The camera wisely stays behind the samurai, played by Toshiro Mifune, so we cannot see his face or expressions. This samurai is desperate. Mifune has no master and no money. Kurosawa doesn't let you see his desperation, instead focusing on the back of his head and his profile to set up one of the most memorable characters in cinema history. The film has been copied many times, its practically the most influential film of the modern action genre. Yojinbo isn't action packed however, Kurosawa takes his time setting up characters and plot. The fact that this masterless samurai has deep compassion for strangers is different than most modern action movies alone. Toshiro Mifune is magical in the lead role. His presence is felt all throughout the film even when he isn't on camera. All film buffs should watch this film, it is a perfect example of a director and actor with confidence in their craft."
    },
    {
      "username": "Ben_Cheshire",
      "userUrl": "https://www.imdb.com/user/ur1148823",
      "reviewLink": "https://www.imdb.com/review/rw0076065",
      "warningSpoilers": false,
      "date": "6 February 2004",
      "rate": "9",
      "helpful": "167 out of 192 found this helpful.",
      "title": "The epitome of cinema cool.",
      "content": "If you ever watched Pulp Fiction and thought: movie cool was born here, or maybe you saw any single Sergio Leone movie and thought: this guy invented movie-cool (if you haven't, i thoroughly recommend it - Kill Bill is nothing to his Good, the Bad and the Ugly or Once Upon a Time in the West), then experience Yojimbo, or The Bodyguard. Kurosawa's camera sits behind Toshiro Mifune's man-with-no-name, inviting us to look up at the back of his head as he walks the earth, inviting us to be in awe of this man. And as he walks, super-cool walking-the-earth music plays. Later on, when he's taunted and asked to prove himself, he slices a guy's arm off and plays the petty, money-grabbing rival factions in the town he wanders into off each other.If you have it in your mind that a guy called Kurosawa couldn't make movies that would impress you, that the cultural gap would be too great - be assured that Kurosawa's movies are rife with Western values. Sure, they are rife with Japanese values (i am told), but Kurosawa had a great appreciation of Western culture. He based many of his movies on Western texts, like Shakespeare, Dostoyevsky, or American gangster fiction and film. Yojimbo is one of the latter - inspired by the Dashiell Hammet novel Red Harvest (Hammett's novel The Maltese Falcon was put onscreen moment for moment by John Huston in the movie of the same name which immortalised Humphrey Bogart).Actually, the history of the story of the lone wolf, the wanderer with a weapon, who rides into town to play off two warring factions against each other - is quite a story itself. Dashiell Hammett, an American, wrote a novel with an American private eye as the stranger. In 1961, Akira Kurosawa transposed this story to medieval Japan, after the fall of a dynasty, where a Samurai finds himself with no place to go (at the beginning, we see him throw a branch up in the air and walk the direction it falls), and no master to serve. A bodyguard with no-one to protect. In 1964, Sergio Leone transposed the screenplay of Yojimbo (nearly word for word) to the spanish desert, and he brought along a young television actor named Clint Eastwood, and together they revolutionised the western with Fistfull of Dollars, and created an entire genre, the Spaghetti Western, which sported among its attributes a gritty, desolate landscape, and a cynical, postmodern lack-of-values ideology (traditional American westerns had quite plush landscapes and were always black and white (good and evil) in their value system. Despite the massive influence of Fistfull of Dollars, it pales in comparison to both its predecessor Yojimbo, and its sequals, For a Few Dollars More and The Good the Bad and the Ugly. But still, both Yojimbo and Fistful are iconic movies, and very cool movies.With cool music, a cool anti-hero, a fun script, and a visually spectacular canvas of an image, painted by the eye of an artist (it is said that Kurosawa storyboarded his movies in full-scale paintings), Yojimbo is one of the coolest movies ever made."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0076070",
      "warningSpoilers": false,
      "date": "15 May 2004",
      "rate": "",
      "helpful": "74 out of 89 found this helpful.",
      "title": "For sheer entertainment value 'Yojimbo' is hard to beat! The Kurosawa movie I enjoy the most.",
      "content": "I'm not going to waste time debating which was the \"greatest\" or \"best\" of Kurosawa's movies, but if you want to know the one I enjoy the most it's 'Yojimbo'. 'Rashomon' and 'Throne Of Blood' are probably deeper and more substantial, but for sheer entertainment value 'Yojimbo' is hard to beat! Being a Kurosawa movie it's no surprise that it stars Toshiro Mifune. The two made many movies together, but this is the performance I like to watch the most. I love looking at Mifune's face! His expressions are awesome. He was without a doubt one of the 20th centuries greatest movie stars. 'Yojimbo' was a massive influence on many spaghetti westerns, specifically 'A Fistful Of Dollars', but before you bay for Sergio Leone's blood, please read Dashiell Hammett's detective classic 'Red Harvest', published in 1929 and you'll see that Kurosawa lifted his plot from it. I see no mention whatsoever of this source material in the credits for 'Yojimbo', so let's just leave the Leone bashing alone okay? Many people have convincingly argued that samurai movies were inspired by classic American westerns anyway. Walter Hill later \"remade\" 'Yojimbo' (or 'Red Harvest' depending on your perspective) as 'Last Man Standing' and David Lynch gave a small nod to it in his 'Wild At Heart'. You can certainly see both the samurai and spaghetti influences in Tarantino's 'Kill Bill' 1 and 2, that's for sure. \"Influences\", \"inspirations\", these are things that go around and around, it's what a writer or film maker does with them that counts. 'Yojimbo' is a classic action movie. Maybe only 'Wages Of Fear' is better. Every film buff needs this movie in their collection!"
    },
    {
      "username": "funkyfry",
      "userUrl": "https://www.imdb.com/user/ur0178741",
      "reviewLink": "https://www.imdb.com/review/rw0076050",
      "warningSpoilers": false,
      "date": "9 November 2002",
      "rate": "10",
      "helpful": "72 out of 92 found this helpful.",
      "title": "First class samurai action tale with philosophy to boot",
      "content": "Classic samurai action pic; often imitated but never equalled. Mifune creates a memorable character (who appeared in a sequel) in the Ronin who decides the course of his life on the toss of a stick, and ends up risking his life to save a village full of peasants he finds revolting. It's possible to see \"Yojimbo's\" actions as either heroic or as the game of a bored warrior in need of amusement -- as often in Kurosawa's films, the fact that the characters' motives remain open to interpretation adds depth to the film.Wonderful images, and skillful direction that keeps the pace of the storytelling tight and tells most of the story through images -- this is the kind of film that is so good it can be watched a silent film without losing too much of its impact or meaning.I think that if Kurosawa had spent more of his time in litigation and less making movies, he might have made a living for the rest of his life off all the movies that have ripped off this movie. Certainly Eastwood's \"Man with No Name\" character owes a lot to Mifune's contribution; not only in Leone's films (the first of which borrows its entire plot from Kurosawa; a court settlement ensued which made sure Kurosawa made most of the profits from \"Fistful of Dollars\" in Asia his own) but also in Eastwood's best film as a director -- \"High Plains Drifter\", which borrows scenes such as Eastwood's rebuke of the villagers from \"Yojimbo\". The really funny thing about all this, and what not too many American critics or audiences have noted, is that \"Yojimbo\" is itself a western. All the ingredients for a western are here, and the film's plot and style obviously owe a debt to Zinnemann's \"High Noon\". \"Yojimbo\" even borrows the device of time, setting up a confrontation at 3:00 a.m. as shouted by the town crier. I like \"Yojimbo\" better than \"High Noon\", so I don't want to go too far into this line of thought...."
    },
    {
      "username": "elvircorhodzic",
      "userUrl": "https://www.imdb.com/user/ur65733095",
      "reviewLink": "https://www.imdb.com/review/rw3684187",
      "warningSpoilers": false,
      "date": "13 April 2017",
      "rate": "9",
      "helpful": "10 out of 10 found this helpful.",
      "title": "\"I'll get paid for killing, and this town is full of people who deserve to die.\"",
      "content": "YOJIMBO is an action drama about a rōnin who finds himself at the center of a conflict between the two crime lords.A hungry and tired rōnin wanders through a desolate Japanese countryside. Soon, he arrives in a small town. A local caterer advises him to leave because, two local clans fight every day on the streets. However, a stranger decides to stay. The situation in a town is very good for one rōnin. This is a good chance that he earns some money. However, he does not need a bloody money. He wants to destroy local crime lords...This tense story is full of lies, doubt, turning, pranks, blackmails and excellent fights. A careless and seemingly insensitive samurai is actually a peaceful and good man. Mr. Kurosawa has, under the influence of a western and noir, made a very exciting and visually impressive film. Of course, he has not neglected the significant situations that are related to the Japanese culture and tradition.Close-ups, almost perfectly, reflect an evil, arrogance, fear, invincibility and contempt on faces of some of the protagonists. There is a large number of villains, which are quite different in character.Toshiro Mifune (Kuwabatake Sanjuro) is a resourceful, interesting and determined as a wandering rōnin and master swordsman. He, apparently, enjoys in his machinations, however, his goal is extremely benevolent. He's kind of a lone hero, regardless of a tactical evil and theatrical swagger in his character.His support are Tatsuya Nakadai as Unosuke a wild and insolent gunslinger and the biggest threat to a samurai. He is interesting because he is a completely different character from Sanjuro. Kyū Sazanka (Ushitora) and Seizaburo Kawazu (Seibei) are fairly inconclusive as crime lords. However their primary relationship \"of a teacher and his student\", could be interesting. Isuzu Yamada as Orin is the the wife of Seibei. She is perhaps an initiator of conflicts. Daisuke Katō as Inokichi is a visually the most memorable character. A character, who is capable to commit a vicious murder, but also make the greatest stupidity.Simply, Mr. Kurosawa has managed to combine several styles in a small masterpiece."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2147888",
      "warningSpoilers": true,
      "date": "27 October 2009",
      "rate": "9",
      "helpful": "42 out of 46 found this helpful.",
      "title": "A Potpourri of Vestiges Review: Akira Kurosawa and Toshiro Mifune - The undisputed masters of their respective arts",
      "content": "Yojimbo is a timeless masterpiece; elegant, enigmatic and taut; one of the best and the most influential of the action movies, and a delectable feast to the lovers of the genre. It is the most sought-after of the Akira Kurosawa's movies, shamelessly imitated on multiple occasions – the most infamous being 'A Fistful of Dollars' by Sergio Leone. Yojimbo is a delightful addition to an unending list of avant-garde movies made by the Oriental master. It is as superior to any of the movies that it has inspired as a master is to his artless apprentice. I have had the privilege of watching five Kurosawa movies before watching Yojimbo viz. Seven Samurai, Ran, Dersu Uzala, Rashomon, and High & Low and each left me mesmerized, but in a completely different manner than the last. In my past reviews I have repeatedly committed an invidious blunder of failing to acknowledge the ginormous contribution that Toshiro Mifune made in Kurosawa's colossal success. I would be remiss again if I fail to testify the fact that Yojimbo is more synonymous with Mifune than it is with Kurosawa and anyone who has had the privilege of watching it wouldn't want me to budge even by a slightest degree. The role of 'Sanjuro', though demanding, can be any performer's dream, but a slight lack of proficiency or commitment on his part can serve as a volte-face, transforming it into his biggest nightmare. I don't think that anyone but Kurosawa is competent enough to judge Toshiro Mifune's talent as a performer and so I would like to quote an excerpt from his biography: \"Mifune had a kind of talent I had never encountered before in the Japanese film world. It was, above all, the speed with which he expressed himself that was astounding. The ordinary Japanese actor might need ten feet of film to get across an impression; Mifune needed only three. He put forth everything directly and boldly with a great sense of timing. And yet with all his quickness, he also had surprisingly fine sensibilities\".In Yojimbo, Toshiro Mifune incredibly outdoes himself with a portrayal that can be excruciatingly hard to be described in words. Mifune is crafty, cunning, capricious and yet seemingly nonchalant as the ingeniously disingenuous ronin, a portrayal overwhelmed with so many contrasting attributes that it revolutionized the very concept of an anti-hero in the world of cinema. Sanjuro is a cross between a wolf and a sheep, a guardian and a usurper, a misanthrope and an altruist, a demon and an angel, a libertine and an ascetic, a fiend and a beloved, a mercenary and a messiah and that's what makes this portrayal singular and incredibly magnificent. Mifune has meticulously taken care of even the slightest gestures and the subtle changes in mannerisms during the portrayal; be it Sanjuro's perpetually grinned countenance or his nonchalant disposition. Each triviality and nuance evinces certain details that are hard to be expressed even through expatiation. Despite Sanjuro's rapidly changing expressions and his frenzied demeanor, Mifune always seems to be in absolute control.Yojimbo is a well etched, taut narrative with a dark comical look that makes it one of a kind. Yojimbo neither appears to be superficial nor superfluous and not a moment of it is extraneous. Human values and emotions are ubiquitously similar irrespective of the cultural and the social divide between the peoples of the world and hence everyone can savour the thought-provoking movies of Kurosawa; even those who are daunted by the handicap of using subtitles can relish a movie like Yojimbo as a silent movie (because of it being so visually descriptive like the Charlie Chaplin movies). The plot of the movie is simple and may even appear to be commonplace owing to the countless imitations that it has inspired, but it is the rapport between Kurosawa and Mifune (undoubtedly the best director-actor pair of all time) that makes it so especial and unique. A penniless ronin (samurai without a master) enters a town rotten with schism (Akira Kurosawa challenged his assistant directors to come up with an image for the film to let Sanjuro know he was entering a bad town. Eventually, Kurosawa himself came up with the idea of the dog carrying the human hand). The two gangs are sporadically involved in sanguinary duels resulting in mass slaughter. The ronin demonstrates his skills by slaying two members of one of the gangs. After asseverating his supremacy, he joins the other group for a substantial sum, but backs out just when a decisive battle was about to begin. He then climbs the nearby bell tower as a vantage for himself and watches with rapturous glee the bravado of the pusillanimous gang members disappearing in thin air as they are overcome by trepidation. They lunge and retreat on multiple occasions without making an actual contact before getting interrupted by the news of an inspector coming for an official inspection. The duel is postponed indefinitely to everyone's delight. In the meantime, Sanjuro lets them know that his services are open to bidding, inducing a tussle to acquire his services while he continues to act as an instigator further intensifying the rabid rivalry between the two groups. But soon the tables are turned and this child's play transforms into a moment of reckoning for the ronin as he finds himself haplessly pitted against the surviving gang. He is captured and brutally assaulted, but he manages to escape from some local help. This culminates in one of the best climatic endings of all time as Sanjuro single-handedly obliterates the whole gang, emancipating the town from anarchy and barbarism. It's a must watch for film students, action movie lovers, and especially those who want to acquaint themselves with the eccentrically brilliant works of the oriental master without exposing themselves to his more recondite works like Shichinin no samurai, Rashomon, Ikiru, Akahige, Ran and countless others. An absolute gem: 10/10http://www.apotpourriofvestiges.com/"
    },
    {
      "username": "Tigereyes",
      "userUrl": "https://www.imdb.com/user/ur1429157",
      "reviewLink": "https://www.imdb.com/review/rw0076028",
      "warningSpoilers": false,
      "date": "11 November 2001",
      "rate": "",
      "helpful": "72 out of 78 found this helpful.",
      "title": "Sensational!",
      "content": "If I had to choose only one movie for film students to learn from, this would be it. Other films may be more profound, or their imagery more groundbreaking, but this one is so tightly constructed that nothing - not a frame, word, or gesture - is extraneous.Toshiro Mifune, one of the world's most charismatic actors, is perfection as a tough loner of a samurai who takes it upon himself to clean up a town corrupted by two gambling clans. Swirling through and around him is a story that is both technically flawless and profoundly moving.Kurosawa meticulously infuses every detail with meaning; there's a purpose behind every shot, and aspiring directors should pay close attention (why is the camera slightly tilted? why are there concubines in the background?). His economy of style was never more amazing; watch as the samurai rides into town, and the director establishes the atmosphere with exactly one jaw-dropping shot. And the story is equally well-crafted, with no plot holes and no inconsistencies.A wonderful tale that rolls beautifully from start to finish. See it, see it, see it!!"
    },
    {
      "username": "InzyWimzy",
      "userUrl": "https://www.imdb.com/user/ur0861465",
      "reviewLink": "https://www.imdb.com/review/rw0076048",
      "warningSpoilers": false,
      "date": "28 October 2002",
      "rate": "10",
      "helpful": "56 out of 70 found this helpful.",
      "title": "Great movie with one cool character",
      "content": "I just figured out why Toshirô Mifune is so mesmerizing to watch. It's just the way he expresses himself. This guy's amazing!I've been exploring the halls of Kurosawa and it's getting hard to leave. Yojimbo is a FUN film to watch. Toshiro as the samurai steals almost every scene he is in and I think the epitome of his character is when he's in Gonji's place lying on the floor. He doesn't brag, but when he goes into action, that's it! As soon as he enters the chaotic town, he doesn't seem fazed at all and actually enjoys it. His demeanor is really amusing and it's great watching his plan unfold; how he manipulates both groups to get his way (it's really funny). Great thing too is he's not really a hero and he's not entirely a villain. He doesn't hesitate to kill, but does so methodically. You also have \"characters\" including Gonji, the thugs from both sides, and Unosuke with an ace up his sleeve (or robe?) which makes things really interesting.Yojimbo's mix of dark humor, action, and a great performance from Mifune make for a Kurosawa classic."
    },
    {
      "username": "faraaj-1",
      "userUrl": "https://www.imdb.com/user/ur8282981",
      "reviewLink": "https://www.imdb.com/review/rw1499743",
      "warningSpoilers": false,
      "date": "17 October 2006",
      "rate": "10",
      "helpful": "50 out of 60 found this helpful.",
      "title": "Kurosawa's most entertaining film",
      "content": "Yojimbo, based on noir writer Dashiel Hammett's Red Harvest is a magnificently entertaining film. Toshiro Mifune stars as the nobody who calls himself Sanjuro (thirty but closer to forty). He enters a town destroyed by warring factions and plays a double-game to pit one faction against the other thus destroying the criminal element.Yojimbo (aka The Bodyguard) is one of the coolest and most stylish films ever made. Starring Toshiro Mifune, Kurosawa's favorite actor, as the scruffy looking Samurai, Yojimbo has all of Kurosawa's qualities and none of the flaws. The music score is an essential element of the plot and strikingly good, but admittedly bettered by the Ennio Morricone version in the Spaghetti Western remake Fistful of Dollars. The visuals are great, from the samurai swordplay, to the desolate streets, the town crier announcing its 3 a.m. to the brutal torture scene.One of the unique things about Yojimbo is the central character. He is an anti-hero. We see him initially as a killer and a man greedy for money. But then, he saves a family by re-uniting mother and child and giving them all the money he was advanced. Mifune has never been cooler than in this film and Eastwood could only aspire to equal such a performance.Of the two remakes, I liked Fistful of Dollars for starting the Spaghetti Western genre, although Yojimbo is a far more superior and stylish film. The gangster version, Last Man Standing, was not very good and Bruce Willis made for a poor substitute to Yojimbo. This film looks fresh and undated even today - watch it!"
    },
    {
      "username": "OttoVonB",
      "userUrl": "https://www.imdb.com/user/ur1559834",
      "reviewLink": "https://www.imdb.com/review/rw0076044",
      "warningSpoilers": false,
      "date": "17 September 2002",
      "rate": "10",
      "helpful": "44 out of 55 found this helpful.",
      "title": "Reinventing the Western",
      "content": "After a string of classic masterpieces, Kurosawa confronted his influences head-on. Throwing John Ford's Western aesthetics into a blender and painting them pitch black. The results are Yojimbo and its legacy.Yojimbo (\"the bodyguard\") is the tale of a flea-ridden wandering swordsman, Sanjuro (Toshiro Mifune, in his finest performance). He arrives at a gang-war ravaged town and starts hiring himself out to both sides, playing them off against another, in order to wipe all the scum out. Sound familiar?Even though Yojimbo the film is a thrilling ride and very funny dark comedy, it is hard to imagine what a bombshell this was for audiences at the time of its release. It is as far removed as can be from the then squeaky-clean aesthetic of samurai films: you can almost smell the sweat and the grime of the sordid town and characters. The action is fast and furious, enhanced by Kurosawa's deft use of telephoto lenses and Masaru Sato's avant-garde score. With all that, Yojimbo was a massive kick in the pants of a fossilized genre.It exploded beyond the confines of its own country and genre, forever influencing the very Westerns that had inspired it, particularly a new wave out of Spain and Italy at the time. One Sergio Leone copy/pasted the whole plot into his own revisionist Western and gave us the Dollars trilogy. The slightest of Spaghetti Western enthusiasts owes Kurosawa a debt of gratitude.As with all truly great work, its greatness exists even devoid of context, and for all the historical precedents it set, all Kurosawa wanted to make was an entertaining film. That he bloody well succeeded is the least you can say about Yojimbo."
    },
    {
      "username": "ilpohirvonen",
      "userUrl": "https://www.imdb.com/user/ur20117949",
      "reviewLink": "https://www.imdb.com/review/rw2462347",
      "warningSpoilers": true,
      "date": "21 July 2011",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Homo Homini Lupus",
      "content": "The famous Latin phrase \"homo homini lupus\" meaning \"man is a wolf to (his fellow) man,\" could easily be the motto of Akira Kurosawa's 21st film Yojimbo (1961). It is purely a genre-film at its best: a film in which the basic realizations and contents of a genre have been internalized perfectly. In this case the genre is samurai-film which is strongly related to the genre of western. Whereas from western the American mythology exhales, from samurai-film Japanese does. Although, the history of samurai-film extends to the 1930-40's it found its dynamic form and was truly born in the early 1950's when Japanese films first came to Europe. The genre still lives on but Yojimbo is, without a doubt, among the five best samurai-films ever made. Both, ironic humor and conception of the eternal weakness of the human nature characterize this exquisite film about a mythical character.Western and samurai-film are often compared to each other, and Kurosawa has said that: \"Everybody likes a good western. Because people are weak, they want to see good people and great heroes. Westerns have been made over and over again and in this process a certain grammar has developed and I have leaned something from it.\". They both take place to important phases of their country's national history and in the focus there are armed heroes. The heroes are often marginal characters in the society who return order to it but are also conscious of the fact that their virtuous action doesn't take them to the new, better, ordered society. And this is exactly what happens in Yojimbo as it does in A Fistful of Dollars for example. Kurosawa had the habit of placing his stories to history, far away, so the producers and managers of film companies wouldn't get upset of his anti-feudalism. On the big screen, he was safely able to tell about his thoughts without them being directly linked to the present day — and that's why it is samurai-film that he most eagerly studied.The story of Yojimbo is, from today's perspective, classical and has been lent dozens of times in A Fistful of Dollars (1964) and Last Man Standing (1996) for instance. The Japanese word 'yôjinbô' means a bodyguard or a hit man and that is exactly what the protagonist of this film is. The film happens in a simple milieu where two selfish robber gangs work. Soon an unknown samurai — played by Toshirô Mifune — arrives to the town and offers his services to one of the gangs. He cheats the other by claiming that he would be working for them. The other gang finds out and tortures him. However, soon our hero escapes and after a few days recovery he overthrows the hostile gang of 20 bandits and leaves the town in peace. There are no good and evil; just two evils from which the protagonist has to choose. We all know this situation. An ethical dilemma that is impossible to solve. We want to end the battle between these two evil but can't because we are too weak. In this the hero of Yojimbo differs from us. He can stand in the middle and quit the fighting. For Kurosawa this kind of social action is serious business and that's why he doesn't make a big deal out of it. He hasn't placed any hidden morality behind the hero's acts.Yojimbo shows that \"man is a wolf to a man,\" how people in reality are animals. The humor comes from the fact that we are quite ridiculous when we think that we are trying to attain morally righteous solutions. The message of Yojimbo and so many films seems to be that the world can't be observed through absolute morality. Both utilitarianism and virtue ethics collapse in the world of Kurosawa. For example, Sanjuro's only virtue is that he doesn't try to be bad, all the time. At times, he might make decisions that ostensibly are good but are actually built on selfish acts. Out of no solidarity or anything that has something to do with morality, he helps one evil to win over another. After he has performed his duty he can walk away and forget all about it. He resembles a god in Greek tragedies: he descends down, does his mission and once again disappears. In one particularly intriguing scene he climbs up and looks down at people, from the roof. He watches the lives of people as a grand comedy — a seedy anti-hero observing.Yojimbo happens in a stripped, closed and simplified landscape in which ruthless and completely selfish and unethical groups of bandits work. Their cruel attitude towards the world is relayed to us most luminously in the scene where one bandit says to his son that: \"To gain respect one has to kill more.\" Irony and humor mean complete destruction of morality. The desolation of Kurosawa's world view is most brilliantly projected on the life of Unosuke, the gunfighter. First his sight is innocent and curious. But soon the cruel corrupted world teaches its lesson and therefore he becomes a mighty gunman who digs up his own grave: \"He died like he lived.\"At times, Yojimbo is close to self-parody but Kurosawa brilliantly reflects the violence culture in the zone of irony and consciousness. Yojimbo is a pure genre-film. But it is also full of subjectivity and personal sights. Death instinct, life at the gates of hell, the harsh reality of heroism, life control and violence culture viewed under the samurai myth but, in addition, Yojimbo talks about war-like glory and sense of morality: the protagonist isn't a moralist. No higher moral purpose hides behind his action than cleaning up the town. He is cynical, melancholy and has a total lack of morality. Yojimbo is, at its heart, about an ethical dilemma, it's about the inevitable dialog between loyalty and glory. It is a grand story of humanity and morality."
    },
    {
      "username": "Witchfinder-General-666",
      "userUrl": "https://www.imdb.com/user/ur7588529",
      "reviewLink": "https://www.imdb.com/review/rw1387388",
      "warningSpoilers": false,
      "date": "6 June 2006",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Kurosawa's Influential Stroke Of Genius",
      "content": "Akira Kurosawa is widely (and rightly) thought of as one of the most important filmmakers in the history of motion pictures. \"Yojimbo\", one of the masterpieces that have earned him this more than deserved reputation, is not only one of the best, but also one of the most influential movies ever made. Only three years after its release another great director, Sergio Leone, who named Yojimbo one of his favorite movies, used it as the model for another masterpiece, \"A Fistful Of Dollars\" and rose the Italian Western to an international level.In 1860, a time when the sword is still the most common weapon in the Japanese province, but gradually gets replaced by the revolver, a lonely Ronin, a Samurai without a master to serve,(Toshiro Mifune) who dashes around the county, comes to a little town terrorized by two bosses and their criminal gangs and decides to end the people's suffering and free the town. He is hired by one of the gangs as a bodyguard, only to switch sides and pit the two, already hostile, gangs against each other.Toshiro Mifune, one of the greatest character actors of all time, is impressive in his role of the Samurai, generally the acting is great in this movie, the supporting cast contains such actors as the great and unforgettable Takashi Shimura. The cinematography is great and the movie's brilliant score, composed by Fumio Hayasaka, is one of its kind. The writing and directing by the inimitable Akira Kurosawa is more than brilliant. One of the greatest movies by one of the greatest directors of all-time, and an absolute must-see for everyone interested in cinema!"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0076043",
      "warningSpoilers": true,
      "date": "20 August 2002",
      "rate": "",
      "helpful": "21 out of 31 found this helpful.",
      "title": "I Know I'm Quite a Spectacle, But Do Your Looking Later",
      "content": "Spoilers herein.We are indebted to Kurosawa for one big thing and a couple small ones. Among the small ones is the deconstruction of the western, which was transformed forever by the chain of events started by (and depicted in?) this film. I recommend Yojimbo if only because of this importance.That chain starts with the spaghetti westerns which introduced irony into most elements of the form more obviously for us, well westerners. And it finishes (probably) with `Star Wars,' which is nothing more than a slightly shifted selfaware goof on the already outed western. That this is based on a Hammett story should be a tipoff as he did the same for the mystery genre. Kurosawa did this knowingly of course. You can see his other projects marching through other notions of film and revolutionizing them.Naturally, there are other values here: perfect framing; multiplanar visual storytelling through mime; and a camera that denotes the eye of fate. But by the time one gets to this after seeing such masterpieces as `Ran' and `Rashomon' and `Seven Samurai,' especially the first, one gets used to expecting skill from Kurosawa equalling the skill of his samurai avatar.If you know what this movie is all about, it puts `Last Man Standing' in a much more intelligent and cinematically important perspective. The title of this comment refers to the fact that it is essentially impossible to see any movie today and not be in part watching a Kurosawa film.Ted's Evaluation: 3 of 4 -- worth watching"
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3186055",
      "warningSpoilers": true,
      "date": "17 February 2015",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Director Akira Kurisowa's Yojimbo is a masterpiece. Yojimbo is still pretty sharp.",
      "content": "Loosely based on Dashiell Hammett's western novel Red Harvest and Glass Key. This jidaigeki (period drama film), tells the story of an unnamed ronin (Toshiro Mifune), who arrives in a small town in 1860 Japan, where competing crime lords, Seibei, the Brothel Owner (Seizaburô Kawazu) and Ushitora, the Arms Dealer (Tatsuya Nakadai) fight each other for supremacy. The two bosses each try to hire the deadly newcomer as a yojimbo AKA bodyguard, but the unnamed ronin has a secret plan to get rid of both of them, by playing both rivals against each other in the hope that they will wipe each other out, faster than ever. Without spoiling too much of it, this movie is a great Samurai film, that is worth the watch only. The movie is beautiful shot. Director Akira Kurosawa's films are notable for being stunning visually, with beautiful backgrounds, sometimes verging on Scenery Porn. This movie might not have much of the Japanese landscape in the background, but it made great use of the set, and the weather. The way, he know how to use actors in a wide screen frame is amazing. He place actors in the foreground. Middle ground in the left or right. Sharp focus. Director John Ford type of a style. He use the shutters and doors, well on the Japanese set to reset shots so dynamically. Without cutting the shutters and door, create a look of comic book panels, frame by frame. Like in most Kurosawa films, rainy weather is present in a few scenes, increasing the effect of the characters' discomfort making emotional seem real. The windy weather all throughout the film represents the chaotic life in the town. The wind blowing while Yojimbo walks inspired many Japanese Animes and films. Kurosawa originated a lot of film techniques that are still being used today. A form of cinematic punctuation very strongly identified with Kurosawa is the wipe as a transitional device. It is used as a substitute for the straight cut or the dissolve. Yojimbo had great pan-focus shots, because they were crucial to the action. Action shot with a few long shots. It's way different than how action is film, today. This is one reason this movie stands the test of time so well. One thing that the movie does so well is editing. Kurosawa was a master in that. He was so good and quick, that Yojimbo had its Japanese premiere on four days after shooting concluded. Still, the movie does have some problems, as its jump back and forth between drama and comedy. It's a bit jarring at times. Most of the humor were hits than miss. I love the look of Sanjuro AKA Yojimbo's face when he sees the dog carrying the sever hand. The violence and gore was pretty intense, at times. It's weird to see, bloody limps being chop off in an early 1960s film, seeing how strict, Japanese censors were, at the time. The cycles of violence in this film is a lot tamer than that of 1954 Seven Samurai. Yojimbo's script is pretty good, but it lacks the intellectual challenge of 1950's Rashomon, the moral resonance of 1952's Ikiru, and the sweeping grandeur of Seven Samurai. He made a couple of great samurai films, but after seeing several of them, they get to be a bit repetitive. Most of the villains are forgettable. They are two-dimensional comically idiots without a shred of redeeming humanity thought. Kurosawa told Tatsuya Nakadai that his character was a snake, so Nakadai moves very snake-like. It didn't help, as his character has little to no personality at all. I just know him, as the man with the creepy smile, snake motion and the gun. The supporting characters, he helps out aren't memorable. I was really hoping more from the old undertaker and his family. Toshiro Mifune as the main lead was great. He's not only one of the greatest Japanese actors of all-time, but is one of the greatest actors of all-time period. Toshiro Mifune is a great actor, capable of great range and subtlety of expression. A complete badass, and everybody comes to realize this very quickly. He was able to perform, the way, the director wanted to. Akira Kurosawa told Toshiro Mifune to act like a stray dog, which is why he twitches his shoulders and scratches himself a lot during the film. The character of Sanjiro can be viewed as an early example of the \"Man with No Name\" because he made the name up at the shot. Kurosawa was often criticized by his countrymen for perceived \"arrogant\" behavior, and you see that in this character. In many ways, the main lead character mirrors Kurosawa at the time. Claims of personal arrogance and harsh treatment of colleagues were often, said about the director. He could even sometimes be hard on seasoned, highly respected film professionals. During the filming of this, he lost his temper with one of Japan's preeminent cinematographer Kazuo Miyagawa. He was often, very tiresome, during filming. This movie would be, one of his last best influencing films. Still, it's been years since this movie first came out, but it's still influencing how films are made today. In 1964, Yojimbo was remade as Sergio Leone's A Fistful of Dollars, a Spaghetti Western starring Clint Eastwood as the Man with No Name. Leone and his production company failed to secure the remake rights to Kurosawa's film, resulting in a lawsuit that delayed the western release for three years. The movie influenced a lot of other movies in the west over time like 1996's Walter Hill gangster film, \"Last Man Standing\" and others. The movie even got a sequel, 1962's Sanjuro. The music from this film by Masaru Satô is very powerful to listen to. It's often use in other films and trailers. The film is easy to find. Try to get the Criterion Collection for the best value, just note that there is no English dubbing. Overall: It's a must-watch. Will Recommended."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2628148",
      "warningSpoilers": false,
      "date": "16 June 2012",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Another Kurasawa masterpiece",
      "content": "Akira Kurasawa is one of my favourite directors as of now. And Yojimbo does nothing to make me change that, if anything like Seven Samurai, Ran, Ikiru, Hidden Fortress, Rashomon and Throne of Blood it is another of his masterpieces. Like Hidden Fortress was a major influence on Star Wars, Yojimbo did the same for Fistful of Dollars. I've seen them compared a lot, but all I will say that for me both are milestones of their respective genres and both are movies to watch if not done so already. Back to Yojimbo, as always for a Kurasawa film, it is superbly made and made absolutely beautifully with epic scenery and great, stylish use of camera techniques. The music adds much to the story, and is remarkably atmospheric, the script is a fine mix of comedy, intrigue and sudden and quite unrelenting violence and the story is compelling and always entertaining, managing to both celebrate and subvert(but in a subtle way) the samurai genre. Toshiro Mifune I have yet to see a bad performance from, and again he is a superb lead, who could be seen as an anti-hero as he sells his skills yet dupes both sides of the feudal community into slaughter. Overall, another fantastic film from perhaps the King of Japanese cinema. 10/10 Bethany Cox"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw4275697",
      "warningSpoilers": false,
      "date": "9 August 2018",
      "rate": "7",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Akira Kurosawa's masterpiece about a laconic masterless samurai who sells his services to two different warlords",
      "content": "Set in Japan , 1860 , at a little town that is a den of wrongs . Sanjuro, a wandering samurai enters a rural town in nineteenth century Japan and he finds himself the location run by two parties commanded by Ushitora and Seibe and their hired thugs . The samurái sells his activities to both parts with devasting resulting for all ; as he then sets out to rid the town of all these ominous people .The noisy town is full of injustices , inequity , violence and killings , due to the hordes of gamblers and murderers that inhabit it. After learning from the innkeeper that the town is divided between two mobsters , he plays one side off against the other . As 2 clans vying for political power bid on the services of a silent masterless Samurai , a quiet Ronin . His efforts are complicated by the arrival of the wily Unosuke who often uses a bloody gun . There is a massacre , but the samurai runs away with the help of the innkeeper ; but while recuperating at a nearby temple, he learns of an abduction carried out by Unosuke, and goes back to the town to take on enemies . This is a magnificent picture by Akira Kurosawa starred by his ordinary actor Toshiro Mifune , being his international breakthrough one . Yokimbo , the picture blends drama , violent fights , emotion , slaughters with high body-count and results to be pretty entertaining as well as thought provoking . It is incredibly detailed vision in its own right , as the impact of the action and combats on this trail-blazing adventure film opened the floodgates for the huge numbers of samurai films and subsequent Spaghetti Westerns that made fortunes for their producers in the sixties and early seventies . Dramatically staged sword-plays occur on and off throughout the plot . The known film Leone¨For a fistful of dollars¨is mainly cribbed from this Japanese samurái action classic ; however , some reviewers tell this Yojinbo bears little resemblance to Sergio Leone film . Very good acting by Toshiro Mifune as a Samurái who attempts to play the two warlords off against each other . This one made an international star out of Toshiro Mifune . At the beginning , Sanjuro seems to be a good Samurai , as being beaten after he reunites an abducted woman with her husband and son, then massacres his father's opponents. As well as Tatsuya Nakadai , still acting , as Unosuke, the son of one of the gangsters, who owns a revolver.This fiercely-charging , uncompromising pictures was compellingly directed by Akira Kurosawa and being exhibited with subtitles or dubbed .After working in a wide range of genres, Kurosawa made this awesome film . The previous years saw the low-key , touching Living (1952) , the epic The seven samurais (1954), the barbaric , fascinating Shakespeare adaptation Throne of blood (1957) , a Macbeth's version , a masterful rendition that transports the story to Medieval Japan , and a fun pair of samurai movies Yojimbo (1961) and Sanjuro (1962) , and Rashomon , often credited as the reason the Academy created the \"Best Foreign Film\" category. When this film was released internationally to rave reviews, many speculated that Akira Kurosawa was influenced by Citizen Kane (1941) in the element of flashbacks that ultimately provide conflicting accounts of events. However, Kurosawa didn't even see Orson Welles's film until several years after . Rashomon won the top prize at the Venice Film Festival, and first revealed the richness of Japanese cinema to the West.Yet , there was a quieter side to Kurosawa's nature , expressed most succinctly on Living , The Lower Depths and especially the medical drama Red Beard . After a lean period in the late 1960s and early 1970s, though, Kurosawa attempted suicide . Other important movies were : The idiot based on Feodor Dostowieski , Drunken Angel , Scandal , A quiet duel , Tiger's tale , High and low . He survived, and made a small, personal, low-budget picture with Dodes'ka-den (1970), a larger-scale Russian co-production Dersu Uzala (1975) an epic tale of adventure in turn-of-the-century Siberia and , with the help of admirers Francis Ford Coppola and George Lucas, the samurai tale Kagemusha (1980), which Kurosawa described as a dry run for Ran (1985), an epic adaptation of Shakespeare's \"King Lear\" . He continued to work into his eighties with the more personal Akira Kurosawa's Dreams (1990), and Madadayo (1993) and Rhapsody in August . Kurosawa's films have always been more popular in the West than in his native Japan, where reviewers have viewed his adaptations of Western genres and authors with suspicion , but he's revered by American and European film-makers, one of his least well-known films but most agreeable pictures is The Bad Sleep Well , a transposition of an Ed McBain detective novel , being remade many his pictures such as The seven samurais (1954), as The magnificent seven (1960),The Hidden Fortress (1958), as Star Wars (1977)as Yojimbo (1961) as For a fistful of dollars by Sergio Leone (1964), in fact Kurosawa's style was the biggest single influence on the Spaghetti Western sub-genre ; as his Samurai 'Western's were copied not only in America but also in Italy ."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw0076068",
      "warningSpoilers": false,
      "date": "12 February 2004",
      "rate": "9",
      "helpful": "13 out of 22 found this helpful.",
      "title": "The Saga of a Samurai Without a Master, in Another Great Movie of Akira Kurosawa",
      "content": "Sanjuro Kuwabatake (Toshirô Mifune) is a samurai without a master, drifting without any specific destination. He arrives in a small village, dominated by two lords: Seibei, who produces silk, and Ushitora, who produces sake. Both of them explore gambling, and uses fugitive gangster for the protection of their business. They are constantly fighting against each other. Sanjuro offers his service of bodyguard for both of them and waits for the best offer. The end of the story recalls those Italian ('spaghetti') western movies, with the death of all 'bad guys'. This movie is very different from other Akira Kurosawa's masterpieces. The plot has adventure, excellent choreography in the sword fights and lots of black humor. In accordance with the information on the cover of the DVD, Sergio Leone used parts of this screenplay in his wonderful 'Fistful of Dollars'. The negative point is the DVD released in Brazil by the Brazilian distributor Continental. The subtitles have many problems in translation, synchronization and concordance in Portuguese. In some parts, it is very difficult to follow the story, since I can not understand Japanese. Further, there is a bug and the DVD freezes at 75:51 min. I tried two DVDs and both presented the same problem. The solution is to go back to the 'Menu', select the next chapter and 'rewind' back to 75:52 min. Although presenting problems on the Brazilian DVD, the movie is excellent and worthwhile. My vote is nine.Title (Brazil): 'Yojimbo'05 January 2005: I have just received the following remark from an IMDb User: \"Yojimbo doesn't \"recall those Italian ('spaghetti') western movies, with the death of all 'bad guys',\" considering that Yojimbo was released in 1961, and the entire GENRE of \"Spaghetti Westerns\" didn't really exist previous to Leone's Fistful of Dollars. You've made the classic mistake of mixing up cause and effect.\""
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw2822686",
      "warningSpoilers": false,
      "date": "30 June 2013",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Classic Kurosawa centred around one great performance",
      "content": "Yojimbo is one of Akira Kurosawa's most celebrated films in his career and was remade by Sergio Leone into A Fistful of Dollars. It is considered an essential film and a classic in the samurai genre. Toshiro Mifune was excellent as the nameless ronin who sets out to protect the town, being a man of few words. Kurosawa is of course excellent at setting up the conflict in the town and how it affects the people whilst also delivering on fine samurai sword fights (a man even has his hand cut off). Kurosawa wonderfully lets his scenes play out with plenty of long shots and small camera movements. Kurosawa and his actors also inject some occasional moments of humours to help lighten the mood when need be. But for the most Yojimbo is a serious drama with some very dark elements. Out of the Kurosawa films I have seen I personally prefer Seven Samurai for its scale and Rashomon for its ambition, but Yojimbo is still a worthy film and true film buffs need to watch it."
    },
    {
      "username": "avik-basu1889",
      "userUrl": "https://www.imdb.com/user/ur54999105",
      "reviewLink": "https://www.imdb.com/review/rw3527215",
      "warningSpoilers": true,
      "date": "17 August 2016",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The Original Man with No Name !!!",
      "content": "'Yojimbo' was Kurosawa's most commercially successful film in his home country of Japan. Now some critics and viewers tend to justify this commercial success by calling the film an entertaining action film without much substance. But after having watched it for the 3rd time in a matter of a year, I will have to disagree with that opinion. Yes, the film is very entertaining, but the screenplay written by Kurosawa and Ryuzo Kikushima is deceptively deep and meaningful.The first and foremost thing that has to be understood about 'Yojimbo' is that the film is a dark comedy. Kurosawa actually wants to generate some humour out of potentially gruesome and depressing moments. Thematically, the film is all about Kurosawa's wish fulfillment. The character of Sanjuro is Kurosawa's surrogate. Sanjuro executes the things that Kurosawa himself wants. This is the reason why this character is not completely realistic. He is supposed to be a mythic figure, a wandering spirit. This mysterious, rugged outsider character that becomes entangled in something that he has little vested interest in, has a very iconic place in cinema history. On one hand, this character of Sanjuro itself was inspired by some of the rugged cowboy characters in American Western films that Kurosawa was an admirer of. On the other hand, this character has further inspired some of the most iconic characters that came later like Clint Eastwood's 'Man with no name' character in Sergio Leone's Spaghetti Westerns and the character of Mad Max in George Miller's films to name a few.Story-wise, Kurosawa is using a period setting to mirror the condition of the Japanese economy at the time the film was made. Sanjuro in the film randomly walks into a town that looks desolate, grim and depressing. The town is run by two rival gangster groups who work in close coalition with two rival business merchants. The merchants require the gangsters for the muscle and the gangsters require the merchants and their money for their existence. This greatly mirrors the social scenario in Japan during the economic boom. The businessmen and politicians brought in an age of unrestricted capitalism with extensive and undeniable help from the Yakuza. Kurosawa is clearly going back to the past to throw some light on the present. He is using Sanjuro to express his philosophies and comment against this unchecked spread of rampant consumerism. In a way Kurosawa is rewriting history. In a factual sense, the samurai class disappeared and the era of the merchants and the gangsters started in Japan. But in his fantasy version of history, Kurosawa has Sanjuro the Samurai come back from the cemetery and defeat the gangsters and thematically clean the town.The cinematography in the film to some extent makes the film for me. The telephoto lens works overtime to give us these gorgeous frames. When it comes to frame composition and expressive blocking of actors, Kurosawa is second to none. The wide angle photography of Kurosawa and cinematographer Kazuo Miyagawa is awe-inspiring. The exterior shots in the street are epic in scope. Kurosawa uses wind machines to crank up the epic nature of the outdoor standoff scenes. Kurosawa's style of shooting the action scenes is actually quite simple. He doesn't use fast editing like one sees in a lot of action films. He generally uses two diagonally placed cameras to capture the shots and relies heavily on choreography. Kurosawa's use of Masaru Sato's music is also brilliant. He choreographs the movements of the characters in certain scenes to the beat of the music which adds a poetic touch to the visuals. Toshirô Mifune pretty much owns the screen in the film. He exudes gravitas and authority. He is charming, witty, suave and when required viciously aggressive. Mifune adds an immensely masculine charisma to the film. It was great watching him manipulate the rival gangs and direct the proceedings. Tatsuya Nakadai is great as the primary nemesis of Mifune. Nakadai's character carries with a long barrel pistol almost like a phallic symbol to represent this power. He too is very charismatic with the twinkle in his eye and threatening demeanour.'Yojimbo' might not have as much complexity as Kurosawa's other masterpieces like 'Rashomon' or 'Red Beard', but it still has something to say and comment upon. Kurosawa's brilliant filmmaking enhances and elevates the screenplay to the next level and makes this a must watch. This is certainly one of his best films. Highly Recommended."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1424833",
      "warningSpoilers": true,
      "date": "19 July 2006",
      "rate": "10",
      "helpful": "8 out of 13 found this helpful.",
      "title": "My favorite Kurosawa film and the inspiration for FISTFUL OF DOLLARS",
      "content": "This is my all-time favorite Akira Kurosawa film and along with its equally impressive followup film, SANJURO, pack a ton of excitement and fun into them. Perennial Kurosawa player, Toshiro Mifune, is the \"Ronin\"--a wandering samurai who is looking for work. He comes to a town and is surprised by the condition of the people. There are two rival warring gangs in the town and the people are literally held captive by the mass of depraved men hired by the two leaders. These bored samurai make life all but impossible for decent people.While Mifune is a samurai with extraordinary powers, he is a lone man and must use both his skills and his brain to free the people of this town. So, he manipulates BOTH sides into thinking he's working for them and gets the bad guys to wipe each other out! This is all done through a very skillfully crafted and funny script.If you enjoy this film, as I'm sure you will, try watching Sergio Leone's version of Yokimbo--FISTFUL OF DOLLARS featuring Clint Eastwood. And, if you like this, a not-quite sequel entitled FOR A FEW DOLLARS MORE is an even better Kurosawa-inspired film."
    },
    {
      "username": "rooprect",
      "userUrl": "https://www.imdb.com/user/ur2904674",
      "reviewLink": "https://www.imdb.com/review/rw6088532",
      "warningSpoilers": false,
      "date": "12 September 2020",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "\"A truly good movie is enjoyable too. There's nothing complicated about it.\"",
      "content": "That's a quote from Kurosawa, if you hadn't already guessed. Here in \"Yojimbo\" (\"The Bodyguard\") he shows us exactly what he meant. This film is a real treat for the artsy crowd as well as people who go to the movies just to have fun. It's a technical marvel and layered in its story, and yet there's nothing complicated about it. If you're new to Kurosawa, or art films in general, definitely start here.The story follows our hero, a masterless samurai, who drifts into a bizarre little turf war between 2 rival gangs. The 2 gangs, backed by the \"silk trader\" and the \"sake brewer\", are mostly incompetent yet extremely violent and willing to hire any scoundrel who will fight. Our sly hero sees an opportunity.That's all I'll say about the plot because the rest is for you to discover. It's definitely a fun and exciting ride from start to finish, so fun that you may not realize that you are watching a fantastic work of art. Scenes are meticulously composed, choreographed, lighted, and filmed with such precision that any frame could be a photo to hang on your wall.Let's just take one example, one of the opening scenes. Our hero enters the town and is greeted by barren streets, shuttered windows, and... what's this from afar? A cute little dog in the distance. The camera, situated behind our hero so that we see him in the frame, keeps a tight focus on the little dog as the dog trots closer, and we start to make out something the dog has in his mouth. Closer, closer, always in perfect focus (which was no easy task with a telephoto lens), the dog comes to the foreground and we see the object so clearly that we can make out every detail: a human hand. What a bizarre and darkly comical start.Like the rest of the movie, that scene demonstrates technical wizardry as well as just plain old fun. There's a lot of humor, a lot of action, a lot of suspense, and a LOT of artistic magnificence. Take your pick and watch this film many times."
    },
    {
      "username": "Platypuschow",
      "userUrl": "https://www.imdb.com/user/ur57590728",
      "reviewLink": "https://www.imdb.com/review/rw4412273",
      "warningSpoilers": false,
      "date": "21 October 2018",
      "rate": "6",
      "helpful": "18 out of 31 found this helpful.",
      "title": "Yôjinbô: Passable Toho effort",
      "content": "At time of writing Yojimbo presently sits as the 115th highest rated movie on IMDB, it's not the only one of Tohos movies in there either. Generally I disagree with IMDB's top 250, and this is no exception.Feeble compared to the considerably superior Seven Samurai (1954) it tells the story of a lone samurai who arrives in a small town tormented by two gangs. In a bid to save the town he plays mind games with them both in an effort to get them to kill one another off.The plot is simple but well handled, the film looks the part and it's character development is great. As if that wasn't enough we have legendary director Akira Kurosawa behind the camera and Toshirô Mifune in front of it. Mifune is great and is on form here, but is it just me or does he always play essentially the same character?I wasn't that keen on the films finale, I also felt that it dragged in places but regardless is a watchable Toho effort and a must watch for fans of the genre.Enjoyable but top 250? Hardly.The Good:Some great comedyLooks very crisp for its ageToshirô Mifune is on formThe Bad:Drags in the middleFinale could have been handled betterThings I Learnt From This Movie:The Great Khali was a Japanese actor in the 1960'sToho movies give me sake cravings"
    },
    {
      "username": "lastliberal-853-253708",
      "userUrl": "https://www.imdb.com/user/ur23944958",
      "reviewLink": "https://www.imdb.com/review/rw2923726",
      "warningSpoilers": false,
      "date": "17 December 2013",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "I'm not dying yet. I have to kill quite a few men first.",
      "content": "The first \"man with no name\" was Toshirô Mifune, who made 16 films with writer/director Akira Kurosawa, starting with Drunken Angel in 1948, and ending with Red beard in 1965. This is one of his greatest performances. Anyone familiar with American or Italian spaghetti westerns will instantly see the story here. The loner walks into town and sees an opportunity to play both sets of bad guys against each other to make money from each. It is funny, and has lots of action as any western does. Forget any idea of foreign films when watching Mifune and Kurosawa. They are as familiar to you as films you grew up with. For great entertainment, they cannot be beat."
    },
    {
      "username": "rdoyle29",
      "userUrl": "https://www.imdb.com/user/ur0001220",
      "reviewLink": "https://www.imdb.com/review/rw2910166",
      "warningSpoilers": false,
      "date": "23 November 2013",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "A masterful blend of genres",
      "content": "It's no surprise that this has been adapted as both a western and a gangster movie since it blends elements of both genres along with the samurai genre. The setting is typically western with the town consisting of businesses lining a central road and much of the plot follows a western blueprint, leading up to a final showdown in the center of town. It's not just the plot that is transferred over to \"A Fistful of Dollars\", but much of the look and visual style of the film is also adopted. The characters seem to come from somewhere else though. The film is a loose adaptation of Dashiell Hammett's \"Red Harvest\", and that novel's gangster characters seem to have been dropped into the western/samurai setting. The cross-genre blending is brilliant, allowing for new heights of cynicism and black comedy in the samurai, and ultimately the western, genre."
    }
  ],
  "errorMessage": ""
}