{
  "imDbId": "tt0055630",
  "title": "Yojimbo",
  "fullTitle": "Yojimbo (1961)",
  "type": "Movie",
  "year": "1961",
  "language": "en",
  "titleInLanguage": "Yojimbo",
  "url": "https://en.wikipedia.org/wiki/Yojimbo",
  "plotShort": {
    "plainText": "Yojimbo (Japanese: 用心棒, Hepburn: Yōjinbō, lit. 'Bodyguard') is a 1961 Japanese samurai film co-written, produced, edited, and directed by Akira Kurosawa. The film stars Toshiro Mifune, Tatsuya Nakadai, Yoko Tsukasa, Isuzu Yamada, Daisuke Katō, Takashi Shimura, Kamatari Fujiwara, and Atsushi Watanabe. In the film, a rōnin arrives in a small town where competing crime lords vie for supremacy. The two bosses each try to hire the newcomer as a bodyguard.\r\nBased on the success of Yojimbo, Kurosawa's next film, Sanjuro (1962), was altered to incorporate the lead character of this film. In both films, the character wears a rather dilapidated dark kimono bearing the same family mon.\r\nThe film was released and produced by Toho on April 25, 1961. Yojimbo received highly positive reviews, and, over the years, became widely regarded as one of the best films by Kurosawa and one of the greatest films ever made. The film grossed an estimated $2.5 million worldwide with a budget of ¥90.87 million. It was unofficially remade by Sergio Leone as the Spaghetti Western film A Fistful of Dollars (1964), leading to a lawsuit by Toho.",
    "html": "<p>Yojimbo (Japanese: 用心棒, Hepburn: Yōjinbō, lit. 'Bodyguard') is a 1961 Japanese samurai film co-written, produced, edited, and directed by Akira Kurosawa. The film stars Toshiro Mifune, Tatsuya Nakadai, Yoko Tsukasa, Isuzu Yamada, Daisuke Katō, Takashi Shimura, Kamatari Fujiwara, and Atsushi Watanabe. In the film, a rōnin arrives in a small town where competing crime lords vie for supremacy. The two bosses each try to hire the newcomer as a bodyguard.</p><p>Based on the success of Yojimbo, Kurosawa's next film, Sanjuro (1962), was altered to incorporate the lead character of this film. In both films, the character wears a rather dilapidated dark kimono bearing the same family mon.</p><p>The film was released and produced by Toho on April 25, 1961. Yojimbo received highly positive reviews, and, over the years, became widely regarded as one of the best films by Kurosawa and one of the greatest films ever made. The film grossed an estimated $2.5 million worldwide with a budget of ¥90.87 million. It was unofficially remade by Sergio Leone as the Spaghetti Western film A Fistful of Dollars (1964), leading to a lawsuit by Toho.</p>"
  },
  "plotFull": {
    "plainText": "Yojimbo (Japanese: 用心棒, Hepburn: Yōjinbō, lit. 'Bodyguard') is a 1961 Japanese samurai film co-written, produced, edited, and directed by Akira Kurosawa. The film stars Toshiro Mifune, Tatsuya Nakadai, Yoko Tsukasa, Isuzu Yamada, Daisuke Katō, Takashi Shimura, Kamatari Fujiwara, and Atsushi Watanabe. In the film, a rōnin arrives in a small town where competing crime lords vie for supremacy. The two bosses each try to hire the newcomer as a bodyguard.\r\nBased on the success of Yojimbo, Kurosawa's next film, Sanjuro (1962), was altered to incorporate the lead character of this film. In both films, the character wears a rather dilapidated dark kimono bearing the same family mon.\r\nThe film was released and produced by Toho on April 25, 1961. Yojimbo received highly positive reviews, and, over the years, became widely regarded as one of the best films by Kurosawa and one of the greatest films ever made. The film grossed an estimated $2.5 million worldwide with a budget of ¥90.87 million. It was unofficially remade by Sergio Leone as the Spaghetti Western film A Fistful of Dollars (1964), leading to a lawsuit by Toho.\r\nPlot\r\nIn 1860, during the final years of the Edo period, a rōnin wanders through a desolate Japanese countryside. While stopping at a farmhouse for water, he overhears an elderly couple lamenting that their only son, not wanting to waste his life as a farmer, has run off to join the \"gamblers\" who have descended on a nearby town overrun with criminals and divided between two rival bosses.\r\nThe stranger heads to the town where he meets Gonji, the owner of a small izakaya who advises him to leave. He tells the rōnin that the two warring bosses, Ushitora and Seibei, are fighting over the lucrative gambling trade run by Seibei; Ushitora had been Seibei's right-hand man but rebelled when Seibei decided that his successor would be his son Yoichiro, a useless youth. The town's mayor, a silk merchant named Tazaemon, had long been in Seibei's pocket, so Ushitora aligned himself with the local sake brewer, Tokuemon, proclaiming him the new mayor.\r\nAfter sizing up the situation and recognizing that no one in town cares about ending the violence, the stranger says he intends to stay, as the town would be better off with both sides dead. He first convinces the weaker Seibei to hire his services by effortlessly killing three of Ushitora's men. When asked his name, he sees a mulberry field and states his name is Kuwabatake Sanjuro (桑畑三十郎), where 桑畑 Kuwabatake = \"mulberry field\" and where 三十郎 Sanjuro (\"thirty-years-old\").\r\nSeibei decides that with the ronin's swordsmanship, the time is right to deal with Ushitora. However, Sanjuro eavesdrops on Seibei's wife, who orders Yoichiro to prove himself by killing the ronin after the upcoming raid, saving them from having to pay him. Sanjuro leads the attack on the other faction, but then \"resigns\" over Seibei's treachery, expecting both sides to massacre each other. His plan is foiled due to the unexpected arrival of a bugyō (a government official), which gives both Seibei and Ushitora the opportunity to make a bloodless retreat and cease their war.\r\nThe bugyō leaves soon after to investigate the murder of a fellow official in another town. Sanjuro soon realizes that Ushitora sent two men to commit the murder when he overhears them discussing it in Gonji's tavern. With this knowledge, Sanjuro captures the killers and sells them to Seibei, but then tells Ushitora that it was Seibei's men who caught them. An alarmed Ushitora rewards him generously for his help and orders the kidnapping of Yoichiro, whom he offers in exchange for the two prisoners. However, Ushitora double-crosses Seibei at the swap when his brother, Unosuke, shoots the assassins with a pistol; anticipating this, Seibei reveals he had ordered the kidnapping of Tokuemon’s mistress. The next morning, she is exchanged for Yoichiro.\r\nSanjuro learns that the woman, Nui, is the wife of a local farmer who lost her to Ushitora over a gambling debt; Ushitora then gave her away as chattel to Tokuemon in order to gain his support. Sanjuro tricks Ushitora into revealing the safe house where Nui is hidden, then kills the guards posted there and reunites the woman with her husband and son, ordering them to leave town immediately. Pretending to be on Ushitora's side, Sanjuro is able to convince Ushitora that Seibei is responsible for killing his men. The gang war escalates, with Ushitora burning down Tazaemon's silk warehouse and Seibei retaliating by trashing Tokuemon's brewery. After some time, Unosuke becomes suspicious of Sanjuro and the circumstances surrounding Nui's escape, eventually uncovering evidence of the ronin's betrayal. Sanjuro is severely beaten and imprisoned by Ushitora's thugs, who torture him to find out Nui's whereabouts.\r\nSanjuro manages to escape when Ushitora decides to eliminate Seibei once and for all. As he is being smuggled out of town in a coffin by Gonji, he witnesses the brutal end of Seibei and his family as their home is set on fire and they are all cut down while trying to surrender. Sanjuro recuperates in a small temple near a cemetery. However, when he learns that Gonji has been captured by Ushitora, he returns to town. Sanjuro confronts Ushitora, Unosuke, and their gang, taking on all of them by himself in a duel and killing them easily. He spares only one terrified young man, who turns out to be the youth he met on the way into town, and sends him back to his parents. As Sanjuro surveys the damage, Tazaemon comes out of his home, in a samurai outfit and beating a prayer drum. Driven mad, he circles around town and then goes after Tokuemon, stabbing him to death. Sanjuro frees Gonji, proclaims that the town will be quiet from then on, and departs.\r\nCast\r\nToshiro Mifune as \"Kuwabatake Sanjuro\" (桑畑 三十郎), a wandering ronin and master swordsman drawn into a gang war.\r\nEijirō Tōno as Gonji (権爺), the izakaya (tavern) owner and the ronin's ally and confidant.\r\nTatsuya Nakadai as Unosuke (卯之助), a gun-toting gangster and younger brother to both Ushitora and Inokichi.\r\nSeizaburo Kawazu as Seibei (清兵衛), the original boss of the town's underworld. He operates out of a brothel.\r\nKyū Sazanka as Ushitora (丑寅), the other gang leader in town. He was originally Seibei's lieutenant but broke ranks to start his own syndicate in a succession dispute.\r\nIsuzu Yamada as Orin (おりん), the wife of Seibei and the brains behind her husband's criminal operations.\r\nDaisuke Katō as Inokichi (亥之吉), younger brother of Ushitora and older brother to Unosuke. He is a strong fighter, but is very dim-witted and easily fooled.\r\nTakashi Shimura as Tokuemon (徳右衛門), a sake brewer who claims to be the new mayor.\r\nHiroshi Tachikawa as Yoichiro (倅与一郎), the timid son of Seibei and Orin who shows little inclination to take over his father's gang.\r\nYosuke Natsuki as Farmer's Son, a young man seen running away from home at the beginning of the film who joins Ushitora's gang.\r\nKamatari Fujiwara as Tazaemon (多左衛門), the town mayor and silk merchant who is going insane from fear.\r\nIkio Sawamura as Hansuke (半助), the town constable who is completely corrupt and concerned only with keeping himself alive.\r\nAtsushi Watanabe as the town's coffin maker, who is profiting heavily from the gang war but ultimately chooses to help Sanjuro and Gonji put an end to it.\r\nSusumu Fujita as Honma (本間), Seibei's \"master swordsman\" who deserts his employer before a battle with Ushitora's men, allowing Sanjuro to take his place.\r\nSachio Sakai as Ashigaru\r\nYoko Tsukasa as Nui (ぬい), the wife of Kohei. She was taken prisoner by Tokuemon because of her beauty after her husband could not pay back his gambling debts.\r\nYoshio Tsuchiya as Kohei (小平), the husband of Nui who lost all of his money gambling and frequently gets beaten for trying to visit his wife.\r\nTsunagoro Rashomon as Kannuki (かんぬき), Ushitora's tall enforcer.\r\nProduction\r\nWriting\r\nKurosawa stated that a major source for the plot was the 1942 film noir classic The Glass Key, an adaptation of Dashiell Hammett's 1931 novel The Glass Key. It has been noted that the overall plot of Yojimbo is closer to that of another Hammett novel, Red Harvest (1929). Kurosawa scholar David Desser, and film critic Manny Farber claim that Red Harvest was the inspiration for the film; however, Donald Richie and other scholars believe the similarities are coincidental.\r\nWhen asked his name, the samurai calls himself \"Kuwabatake Sanjuro\", which he seems to make up while looking at a mulberry field by the town. Thus, the character can be viewed as an early example of the \"Man with No Name\" (other examples of which appear in a number of earlier novels, including Dashiell Hammett's Red Harvest).\r\nCasting\r\nMany of the actors in Yojimbo worked with Kurosawa before and after, especially Toshiro Mifune, Takashi Shimura and Tatsuya Nakadai.\r\nFilming\r\nAfter Kurosawa scolded Mifune for arriving late to the set one morning, Mifune made it a point to be ready on set at 6:00 AM every day in full makeup and costume for the rest of the film's shooting schedule.\r\nThis was the second film where director Akira Kurosawa worked with cinematographer Kazuo Miyagawa. The sword instruction and choreography for the film were done by Yoshio Sugino of the Tenshin Shōden Katori Shintō-ryū and Ryū Kuze.\r\nMusic\r\nThe soundtrack for the film has received positive reviews. Michael Wood writing for the London Review of Books found the film's soundtrack by Masaru Sato as effective in its 'jaunty and jangling' approach stating:\r\nThe film is full of music, for instance, a loud, witty soundtrack by Masaru Sato, who said his main influence was Henry Mancini. It doesn’t sound like Breakfast at Tiffany’s, though, or Days of Wine and Roses. The blaring Latin sound of Touch of Evil comes closer, but actually you wouldn’t think of Mancini if you hadn’t been told. Sato’s effect has lots of drums, mixes traditional Japanese flutes and other instruments with American big band noises, and feels jaunty and jangling throughout, discreetly off, as if half the band was playing in the wrong key. It’s distracting at first, then you realise it’s not decoration, it’s commentary. It’s a companion to Sanjuro, the sound of his mind, discordant and undefeated and unserious, even when he’s grubby and silent and apparently solemn.\r\nRelease\r\nYojimbo was released in Japan on 25 April 1961. The film was released by Seneca International in both a subtitled and dubbed format in the United States in September 1961.\r\nReception\r\nBox office\r\nYojimbo was Japan's fourth highest-grossing film of 1961, earning a distribution rental income of ¥351 million. This was equivalent to estimated box office gross receipts of approximately ¥659 million ($1.83 million).\r\nOverseas, the film had a September 1961 release in North America, but the box office income of this release is currently unknown. At the 2002 Kurosawa & Mifune Festival in the United States, the film grossed $561,692. In South Korea, a 2012 re-release grossed ₩1.566 million ($1,390).\r\nIn Europe, a January 1991 limited French re-release sold 14,178 tickets, equivalent to an estimated gross revenue of approximately €63,801 ($87,934). Other limited European re-releases sold 3,392 tickets between 2000 and 2018, equivalent to an estimated gross revenue of at least €18,995 ($27,938). This adds up to an estimated $678,950 grossed overseas, and an estimated $2,508,950 grossed worldwide.\r\nAdjusted for ticket price inflation, at 2012 Japanese ticket prices, its Japanese gross receipts are equivalent to an estimated ¥9.75 billion ($122 million), or $144 million adjusted for inflation in 2021. The overseas gross revenue of North American and European re-releases since 1991 are equivalent to approximately $1.4 million adjusted for inflation, adding up to an estimated inflation-adjusted total gross of over $137 million worldwide.\r\nCritical response\r\nYojimbo ranked at #95 in Empire magazine's list of the 500 Greatest Films of All Time. A 1968 screening in the planned community of Columbia, Maryland was considered too violent for viewers, causing the hosts to hide in the bathroom to avoid the audience. The film was nominated for the Academy Award for Best Costume Design at the 34th Academy Awards. Toshiro Mifune won the Volpi Cup for Best Actor at the 22nd Venice Film Festival.\r\nMichael Wood writing for the London Review of Books found the film to span several genres and compared it to films such as Seven Samurai, A Fistful of Dollars, High Noon, The Outlaw Josey Wales, and Rashomon, stating, \"(The film contains) comedy, satire, folk tale, action movie, Western, samurai film, and something like a musical without songs. As everyone says, this work is not as deep as Rashomon or as immediately memorable as Seven Samurai. But it is funnier than any Western from either side of the world, and its only competition, in a bleaker mode, would be Clint Eastwood’s The Outlaw Josey Wales (1976).\" In 2009 the film was voted at No. 23 on the list of The Greatest Japanese Films of All Time by Japanese film magazine Kinema Junpo.\r\nSequel\r\nIn 1962, Kurosawa directed Sanjuro, originally intended to be a straight adaption of Shūgorō Yamamoto's short story Hibi Heian (日日平安, lit. \"Peaceful Days\"), but was reworked to include Mifune and his character following the success of Yojimbo.\r\nIn both films, he takes his surname from the plants he happens to be looking at when asked his name: in Yojimbo it is the mulberry trees that feed the town's silkworms, and in Sanjuro it is camellia bushes used to make tea.\r\nLegacy\r\nBoth in Japan and the West, Yojimbo has had an influence on various forms of entertainment.\r\nIn 1964, Yojimbo was remade as A Fistful of Dollars, a Spaghetti Western directed by Sergio Leone and starring Clint Eastwood in his first appearance as the Man with No Name. The film was followed by two prequels. The three films are collectively known as the Dollars Trilogy. Leone and his production company failed to secure the remake rights to Kurosawa's film, resulting in a lawsuit that delayed Fistful's release in North America for three years. It was settled out of court for an undisclosed agreement before the U.S. release. In Yojimbo, the protagonist defeats a man who carries a gun, while he carries only a knife and a sword; in the equivalent scene in A Fistful of Dollars, Eastwood's pistol-wielding character survives being shot by a rifle by hiding an iron plate under his clothes to serve as a shield against bullets.\r\nA second, looser Spaghetti Western adaptation, Django, was directed by Sergio Corbucci in 1966 and featured Franco Nero in the title role. Known for its high level (at the time of its release) of graphic violence, the film's character and title were referenced in two official films (a sequel and prequel) and over thirty unofficial ones.\r\nThe 1970 film Zatoichi Meets Yojimbo features Mifune as a somewhat similar character. It is the twentieth of a series of movies featuring the blind swordsman Zatoichi. Although Mifune is clearly not playing the same \"Yojimbo\" as he did in the two Kurosawa films (his name is Sasa Daisaku 佐々大作, and his personality and background are different in many key respects), the movie's title and some of its content do intend to suggest the image of the two iconic jidaigeki characters confronting each other.\r\nIncident at Blood Pass, also made in 1970, stars Mifune as a ronin who looks and acts even more similarly to Sanjuro and is referred to simply as \"Yojimbo\" throughout the film, but whose name is actually Shinogi Tōzaburō. As was the case with Sanjuro, this character's surname of Shinogi (鎬) is not an actual proper family name, but rather a term that means \"ridges on a blade\".\r\nMifune's character became the model for John Belushi's Samurai Futaba character on Saturday Night Live.\r\nStar Wars Episode IV: A New Hope pays narrative and visual homage to Yojimbo during the cantina scene early in the film. When Luke Skywalker approaches the bar, he is accosted by Ponda Baba and Doctor Evazan, who like the gamblers confronting Sanjuro inform him of serious criminal penalties they have received elsewhere (death sentences in 12 jurisdictions) to intimidate him. Obi-Wan Kenobi intervenes just as they threaten Luke's life, and after he briefly wields his lightsaber the camera likewise shows a severed forearm on the floor to demonstrate the character's prowess with the weapon.\r\nSimilarly, Star Wars: The Last Jedi (2017) was also heavily influenced by Yojimbo. In the film's third act, Luke Skywalker's attire is visually reminiscent to that of Sanjuro's, both characters are also framed in Wide shot and are portrayed as lone heroes with both having to deal with a larger threat by themselves, Sanjuro confronts Ushitora, Unosuke, and their gang while Luke confronts the entire First Order. During his showdown with Kylo Ren, Luke's last line is \"See you around, kid\" which recalls Sanjuro's last line, \"Aba yo\", meaning \"See you around\".\r\nThe Warrior and the Sorceress is another resetting of the story, this one in a fantasy world.\r\nLast Man Standing (1996) is a Prohibition-era action film directed by Walter Hill and starring Bruce Willis. It is an official remake of Yojimbo with both Kikushima and Kurosawa specifically listed in this movie's credits as having provided the original story.\r\nAt the closing of Episode XXIII of the animated series Samurai Jack, a triumphant Jack walks off alone in a scene (and accompanied by music) influenced by the closing scene and music of Yojimbo. In Episode XXVI, Jack confronts a gang who destroyed his sandals, using Clint Eastwood's lines from A Fistful of Dollars, but substituting \"footwear\" for \"mule\". The influence of Yojimbo in particular (and Kurosawa films in general) on the animated series has been noted by Matthew Millheiser at DVDtalk.",
    "html": "<p>Yojimbo (Japanese: 用心棒, Hepburn: Yōjinbō, lit. 'Bodyguard') is a 1961 Japanese samurai film co-written, produced, edited, and directed by Akira Kurosawa. The film stars Toshiro Mifune, Tatsuya Nakadai, Yoko Tsukasa, Isuzu Yamada, Daisuke Katō, Takashi Shimura, Kamatari Fujiwara, and Atsushi Watanabe. In the film, a rōnin arrives in a small town where competing crime lords vie for supremacy. The two bosses each try to hire the newcomer as a bodyguard.</p><p>Based on the success of Yojimbo, Kurosawa's next film, Sanjuro (1962), was altered to incorporate the lead character of this film. In both films, the character wears a rather dilapidated dark kimono bearing the same family mon.</p><p>The film was released and produced by Toho on April 25, 1961. Yojimbo received highly positive reviews, and, over the years, became widely regarded as one of the best films by Kurosawa and one of the greatest films ever made. The film grossed an estimated $2.5 million worldwide with a budget of ¥90.87 million. It was unofficially remade by Sergio Leone as the Spaghetti Western film A Fistful of Dollars (1964), leading to a lawsuit by Toho.</p><br/><h3>Plot</h3><p>In 1860, during the final years of the Edo period, a rōnin wanders through a desolate Japanese countryside. While stopping at a farmhouse for water, he overhears an elderly couple lamenting that their only son, not wanting to waste his life as a farmer, has run off to join the \"gamblers\" who have descended on a nearby town overrun with criminals and divided between two rival bosses.</p><p>The stranger heads to the town where he meets Gonji, the owner of a small izakaya who advises him to leave. He tells the rōnin that the two warring bosses, Ushitora and Seibei, are fighting over the lucrative gambling trade run by Seibei; Ushitora had been Seibei's right-hand man but rebelled when Seibei decided that his successor would be his son Yoichiro, a useless youth. The town's mayor, a silk merchant named Tazaemon, had long been in Seibei's pocket, so Ushitora aligned himself with the local sake brewer, Tokuemon, proclaiming him the new mayor.</p><p>After sizing up the situation and recognizing that no one in town cares about ending the violence, the stranger says he intends to stay, as the town would be better off with both sides dead. He first convinces the weaker Seibei to hire his services by effortlessly killing three of Ushitora's men. When asked his name, he sees a mulberry field and states his name is Kuwabatake Sanjuro (桑畑三十郎), where 桑畑 Kuwabatake = \"mulberry field\" and where 三十郎 Sanjuro (\"thirty-years-old\").</p><p>Seibei decides that with the ronin's swordsmanship, the time is right to deal with Ushitora. However, Sanjuro eavesdrops on Seibei's wife, who orders Yoichiro to prove himself by killing the ronin after the upcoming raid, saving them from having to pay him. Sanjuro leads the attack on the other faction, but then \"resigns\" over Seibei's treachery, expecting both sides to massacre each other. His plan is foiled due to the unexpected arrival of a bugyō (a government official), which gives both Seibei and Ushitora the opportunity to make a bloodless retreat and cease their war.</p><p>The bugyō leaves soon after to investigate the murder of a fellow official in another town. Sanjuro soon realizes that Ushitora sent two men to commit the murder when he overhears them discussing it in Gonji's tavern. With this knowledge, Sanjuro captures the killers and sells them to Seibei, but then tells Ushitora that it was Seibei's men who caught them. An alarmed Ushitora rewards him generously for his help and orders the kidnapping of Yoichiro, whom he offers in exchange for the two prisoners. However, Ushitora double-crosses Seibei at the swap when his brother, Unosuke, shoots the assassins with a pistol; anticipating this, Seibei reveals he had ordered the kidnapping of Tokuemon’s mistress. The next morning, she is exchanged for Yoichiro.</p><p>Sanjuro learns that the woman, Nui, is the wife of a local farmer who lost her to Ushitora over a gambling debt; Ushitora then gave her away as chattel to Tokuemon in order to gain his support. Sanjuro tricks Ushitora into revealing the safe house where Nui is hidden, then kills the guards posted there and reunites the woman with her husband and son, ordering them to leave town immediately. Pretending to be on Ushitora's side, Sanjuro is able to convince Ushitora that Seibei is responsible for killing his men. The gang war escalates, with Ushitora burning down Tazaemon's silk warehouse and Seibei retaliating by trashing Tokuemon's brewery. After some time, Unosuke becomes suspicious of Sanjuro and the circumstances surrounding Nui's escape, eventually uncovering evidence of the ronin's betrayal. Sanjuro is severely beaten and imprisoned by Ushitora's thugs, who torture him to find out Nui's whereabouts.</p><p>Sanjuro manages to escape when Ushitora decides to eliminate Seibei once and for all. As he is being smuggled out of town in a coffin by Gonji, he witnesses the brutal end of Seibei and his family as their home is set on fire and they are all cut down while trying to surrender. Sanjuro recuperates in a small temple near a cemetery. However, when he learns that Gonji has been captured by Ushitora, he returns to town. Sanjuro confronts Ushitora, Unosuke, and their gang, taking on all of them by himself in a duel and killing them easily. He spares only one terrified young man, who turns out to be the youth he met on the way into town, and sends him back to his parents. As Sanjuro surveys the damage, Tazaemon comes out of his home, in a samurai outfit and beating a prayer drum. Driven mad, he circles around town and then goes after Tokuemon, stabbing him to death. Sanjuro frees Gonji, proclaims that the town will be quiet from then on, and departs.</p><br/><h3>Cast</h3><ul><li>Toshiro Mifune as \"Kuwabatake Sanjuro\" (桑畑 三十郎), a wandering ronin and master swordsman drawn into a gang war.</li><li>Eijirō Tōno as Gonji (権爺), the izakaya (tavern) owner and the ronin's ally and confidant.</li><li>Tatsuya Nakadai as Unosuke (卯之助), a gun-toting gangster and younger brother to both Ushitora and Inokichi.</li><li>Seizaburo Kawazu as Seibei (清兵衛), the original boss of the town's underworld. He operates out of a brothel.</li><li>Kyū Sazanka as Ushitora (丑寅), the other gang leader in town. He was originally Seibei's lieutenant but broke ranks to start his own syndicate in a succession dispute.</li><li>Isuzu Yamada as Orin (おりん), the wife of Seibei and the brains behind her husband's criminal operations.</li><li>Daisuke Katō as Inokichi (亥之吉), younger brother of Ushitora and older brother to Unosuke. He is a strong fighter, but is very dim-witted and easily fooled.</li><li>Takashi Shimura as Tokuemon (徳右衛門), a sake brewer who claims to be the new mayor.</li><li>Hiroshi Tachikawa as Yoichiro (倅与一郎), the timid son of Seibei and Orin who shows little inclination to take over his father's gang.</li><li>Yosuke Natsuki as Farmer's Son, a young man seen running away from home at the beginning of the film who joins Ushitora's gang.</li><li>Kamatari Fujiwara as Tazaemon (多左衛門), the town mayor and silk merchant who is going insane from fear.</li><li>Ikio Sawamura as Hansuke (半助), the town constable who is completely corrupt and concerned only with keeping himself alive.</li><li>Atsushi Watanabe as the town's coffin maker, who is profiting heavily from the gang war but ultimately chooses to help Sanjuro and Gonji put an end to it.</li><li>Susumu Fujita as Honma (本間), Seibei's \"master swordsman\" who deserts his employer before a battle with Ushitora's men, allowing Sanjuro to take his place.</li><li>Sachio Sakai as Ashigaru</li><li>Yoko Tsukasa as Nui (ぬい), the wife of Kohei. She was taken prisoner by Tokuemon because of her beauty after her husband could not pay back his gambling debts.</li><li>Yoshio Tsuchiya as Kohei (小平), the husband of Nui who lost all of his money gambling and frequently gets beaten for trying to visit his wife.</li><li>Tsunagoro Rashomon as Kannuki (かんぬき), Ushitora's tall enforcer.</li></ul><br/><h3>Production</h3><h4>Writing</h4><p>Kurosawa stated that a major source for the plot was the 1942 film noir classic The Glass Key, an adaptation of Dashiell Hammett's 1931 novel The Glass Key. It has been noted that the overall plot of Yojimbo is closer to that of another Hammett novel, Red Harvest (1929). Kurosawa scholar David Desser, and film critic Manny Farber claim that Red Harvest was the inspiration for the film; however, Donald Richie and other scholars believe the similarities are coincidental.</p><p>When asked his name, the samurai calls himself \"Kuwabatake Sanjuro\", which he seems to make up while looking at a mulberry field by the town. Thus, the character can be viewed as an early example of the \"Man with No Name\" (other examples of which appear in a number of earlier novels, including Dashiell Hammett's Red Harvest).</p><h4>Casting</h4><p>Many of the actors in Yojimbo worked with Kurosawa before and after, especially Toshiro Mifune, Takashi Shimura and Tatsuya Nakadai.</p><h4>Filming</h4><p>After Kurosawa scolded Mifune for arriving late to the set one morning, Mifune made it a point to be ready on set at 6:00 AM every day in full makeup and costume for the rest of the film's shooting schedule.</p><p>This was the second film where director Akira Kurosawa worked with cinematographer Kazuo Miyagawa. The sword instruction and choreography for the film were done by Yoshio Sugino of the Tenshin Shōden Katori Shintō-ryū and Ryū Kuze.</p><h4>Music</h4><p>The soundtrack for the film has received positive reviews. Michael Wood writing for the London Review of Books found the film's soundtrack by Masaru Sato as effective in its 'jaunty and jangling' approach stating:</p><blockquote>The film is full of music, for instance, a loud, witty soundtrack by Masaru Sato, who said his main influence was Henry Mancini. It doesn’t sound like Breakfast at Tiffany’s, though, or Days of Wine and Roses. The blaring Latin sound of Touch of Evil comes closer, but actually you wouldn’t think of Mancini if you hadn’t been told. Sato’s effect has lots of drums, mixes traditional Japanese flutes and other instruments with American big band noises, and feels jaunty and jangling throughout, discreetly off, as if half the band was playing in the wrong key. It’s distracting at first, then you realise it’s not decoration, it’s commentary. It’s a companion to Sanjuro, the sound of his mind, discordant and undefeated and unserious, even when he’s grubby and silent and apparently solemn.</blockquote><br/><h3>Release</h3><p>Yojimbo was released in Japan on 25 April 1961. The film was released by Seneca International in both a subtitled and dubbed format in the United States in September 1961.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Yojimbo was Japan's fourth highest-grossing film of 1961, earning a distribution rental income of ¥351 million. This was equivalent to estimated box office gross receipts of approximately ¥659 million ($1.83 million).</p><p>Overseas, the film had a September 1961 release in North America, but the box office income of this release is currently unknown. At the 2002 Kurosawa & Mifune Festival in the United States, the film grossed $561,692. In South Korea, a 2012 re-release grossed ₩1.566 million ($1,390).</p><p>In Europe, a January 1991 limited French re-release sold 14,178 tickets, equivalent to an estimated gross revenue of approximately €63,801 ($87,934). Other limited European re-releases sold 3,392 tickets between 2000 and 2018, equivalent to an estimated gross revenue of at least €18,995 ($27,938). This adds up to an estimated $678,950 grossed overseas, and an estimated $2,508,950 grossed worldwide.</p><p>Adjusted for ticket price inflation, at 2012 Japanese ticket prices, its Japanese gross receipts are equivalent to an estimated ¥9.75 billion ($122 million), or $144 million adjusted for inflation in 2021. The overseas gross revenue of North American and European re-releases since 1991 are equivalent to approximately $1.4 million adjusted for inflation, adding up to an estimated inflation-adjusted total gross of over $137 million worldwide.</p><h4>Critical response</h4><p>Yojimbo ranked at #95 in Empire magazine's list of the 500 Greatest Films of All Time. A 1968 screening in the planned community of Columbia, Maryland was considered too violent for viewers, causing the hosts to hide in the bathroom to avoid the audience. The film was nominated for the Academy Award for Best Costume Design at the 34th Academy Awards. Toshiro Mifune won the Volpi Cup for Best Actor at the 22nd Venice Film Festival.</p><p>Michael Wood writing for the London Review of Books found the film to span several genres and compared it to films such as Seven Samurai, A Fistful of Dollars, High Noon, The Outlaw Josey Wales, and Rashomon, stating, \"(The film contains) comedy, satire, folk tale, action movie, Western, samurai film, and something like a musical without songs. As everyone says, this work is not as deep as Rashomon or as immediately memorable as Seven Samurai. But it is funnier than any Western from either side of the world, and its only competition, in a bleaker mode, would be Clint Eastwood’s The Outlaw Josey Wales (1976).\" In 2009 the film was voted at No. 23 on the list of The Greatest Japanese Films of All Time by Japanese film magazine Kinema Junpo.</p><br/><h3>Sequel</h3><p>In 1962, Kurosawa directed Sanjuro, originally intended to be a straight adaption of Shūgorō Yamamoto's short story Hibi Heian (日日平安, lit. \"Peaceful Days\"), but was reworked to include Mifune and his character following the success of Yojimbo.</p><p>In both films, he takes his surname from the plants he happens to be looking at when asked his name: in Yojimbo it is the mulberry trees that feed the town's silkworms, and in Sanjuro it is camellia bushes used to make tea.</p><br/><h3>Legacy</h3><p>Both in Japan and the West, Yojimbo has had an influence on various forms of entertainment.</p><p>In 1964, Yojimbo was remade as A Fistful of Dollars, a Spaghetti Western directed by Sergio Leone and starring Clint Eastwood in his first appearance as the Man with No Name. The film was followed by two prequels. The three films are collectively known as the Dollars Trilogy. Leone and his production company failed to secure the remake rights to Kurosawa's film, resulting in a lawsuit that delayed Fistful's release in North America for three years. It was settled out of court for an undisclosed agreement before the U.S. release. In Yojimbo, the protagonist defeats a man who carries a gun, while he carries only a knife and a sword; in the equivalent scene in A Fistful of Dollars, Eastwood's pistol-wielding character survives being shot by a rifle by hiding an iron plate under his clothes to serve as a shield against bullets.</p><p>A second, looser Spaghetti Western adaptation, Django, was directed by Sergio Corbucci in 1966 and featured Franco Nero in the title role. Known for its high level (at the time of its release) of graphic violence, the film's character and title were referenced in two official films (a sequel and prequel) and over thirty unofficial ones.</p><p>The 1970 film Zatoichi Meets Yojimbo features Mifune as a somewhat similar character. It is the twentieth of a series of movies featuring the blind swordsman Zatoichi. Although Mifune is clearly not playing the same \"Yojimbo\" as he did in the two Kurosawa films (his name is Sasa Daisaku 佐々大作, and his personality and background are different in many key respects), the movie's title and some of its content do intend to suggest the image of the two iconic jidaigeki characters confronting each other.</p><p>Incident at Blood Pass, also made in 1970, stars Mifune as a ronin who looks and acts even more similarly to Sanjuro and is referred to simply as \"Yojimbo\" throughout the film, but whose name is actually Shinogi Tōzaburō. As was the case with Sanjuro, this character's surname of Shinogi (鎬) is not an actual proper family name, but rather a term that means \"ridges on a blade\".</p><p>Mifune's character became the model for John Belushi's Samurai Futaba character on Saturday Night Live.</p><p>Star Wars Episode IV: A New Hope pays narrative and visual homage to Yojimbo during the cantina scene early in the film. When Luke Skywalker approaches the bar, he is accosted by Ponda Baba and Doctor Evazan, who like the gamblers confronting Sanjuro inform him of serious criminal penalties they have received elsewhere (death sentences in 12 jurisdictions) to intimidate him. Obi-Wan Kenobi intervenes just as they threaten Luke's life, and after he briefly wields his lightsaber the camera likewise shows a severed forearm on the floor to demonstrate the character's prowess with the weapon.</p><p>Similarly, Star Wars: The Last Jedi (2017) was also heavily influenced by Yojimbo. In the film's third act, Luke Skywalker's attire is visually reminiscent to that of Sanjuro's, both characters are also framed in Wide shot and are portrayed as lone heroes with both having to deal with a larger threat by themselves, Sanjuro confronts Ushitora, Unosuke, and their gang while Luke confronts the entire First Order. During his showdown with Kylo Ren, Luke's last line is \"See you around, kid\" which recalls Sanjuro's last line, \"Aba yo\", meaning \"See you around\".</p><p>The Warrior and the Sorceress is another resetting of the story, this one in a fantasy world.</p><p>Last Man Standing (1996) is a Prohibition-era action film directed by Walter Hill and starring Bruce Willis. It is an official remake of Yojimbo with both Kikushima and Kurosawa specifically listed in this movie's credits as having provided the original story.</p><p>At the closing of Episode XXIII of the animated series Samurai Jack, a triumphant Jack walks off alone in a scene (and accompanied by music) influenced by the closing scene and music of Yojimbo. In Episode XXVI, Jack confronts a gang who destroyed his sandals, using Clint Eastwood's lines from A Fistful of Dollars, but substituting \"footwear\" for \"mule\". The influence of Yojimbo in particular (and Kurosawa films in general) on the animated series has been noted by Matthew Millheiser at DVDtalk.</p><br/>"
  },
  "errorMessage": ""
}