{
  "id": "nm1115741",
  "name": "Lance Barber",
  "role": "Actor, Soundtrack",
  "image": "https://m.media-amazon.com/images/M/MV5BNTY1NDI4NzE2OV5BMl5BanBnXkFtZTcwOTc2MzU4OA@@._V1_Ratio0.6751_AL_.jpg",
  "summary": "Lance Barber. Actor: Gangster Squad. Lance Barber was born and raised in Battle Creek, Michigan, in 1973. He was born into a military family, with his father was M.P in the Army. Sadly when he was a year old, his dad was killed in line of duty. His mom raised him by herself in Battle Creek. When Lance was 7 years old, he went see the production of Grease and...",
  "birthDate": "1973-06-29",
  "deathDate": null,
  "awards": "",
  "height": "6′ 2″ (1.88 m)",
  "knownFor": [
    {
      "id": "tt1321870",
      "title": "Gangster Squad",
      "fullTitle": "Gangster Squad (2013)",
      "year": "2013",
      "role": "Comanche",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcwMjAyMTUzMl5BMl5BanBnXkFtZTcwODgxNzk1OA@@._V1_Ratio0.6767_AL_.jpg"
    },
    {
      "id": "tt0379865",
      "title": "Leatherheads",
      "fullTitle": "Leatherheads (2008)",
      "year": "2008",
      "role": "Toledo Referee",
      "image": "https://m.media-amazon.com/images/M/MV5BMjU1OTEyMzQxNV5BMl5BanBnXkFtZTcwMDU3NTg1MQ@@._V1_Ratio0.6767_AL_.jpg"
    },
    {
      "id": "tt6226232",
      "title": "Young Sheldon",
      "fullTitle": null,
      "year": null,
      "role": "George Cooper Sr.",
      "image": "https://m.media-amazon.com/images/M/MV5BZDg3MGNhYjItZGU2Yi00MzU4LWE4NGUtYjA2OTVjNGUyMjE4XkEyXkFqcGdeQXVyNjg4NzAyOTA@._V1_Ratio0.6767_AL_.jpg"
    },
    {
      "id": "tt0470765",
      "title": "For Your Consideration",
      "fullTitle": "For Your Consideration (2006)",
      "year": "2006",
      "role": "Dinkie",
      "image": "https://m.media-amazon.com/images/M/MV5BMTIxNzg0NTY4MV5BMl5BanBnXkFtZTcwNDk4NjkzMQ@@._V1_Ratio0.6767_AL_.jpg"
    }
  ],
  "castMovies": [
    {
      "id": "tt6226232",
      "role": "Actor",
      "title": "Young Sheldon",
      "year": "2017-2023",
      "description": "(TV Series) George Cooper Sr. - A Tornado, a 10-Hour Flight and a Darn Fine Ring (2023) ... George Cooper Sr. - A Romantic Getaway and a Germanic Meat-Based Diet (2023) ... George Cooper Sr. - German for Beginners and a Crazy Old Man with a Bat (2023) ... George Cooper Sr. - A New Weather Girl and a Stay-at-Home Coddler (2023) ... George Cooper Sr. - Little Green Men and a Fella's Marriage Proposal (2023) ... George Cooper Sr. - A German Folk Song and an Actual Adult (2023) ... George Cooper Sr. - A Stolen Truck and Going on the Lam (2023) ... George Cooper Sr. - Teen Angst and a Smart-Boy Walk of Shame (2023) ... George Cooper Sr. - A Launch Party and a Whole Human Being (2023) ... George Cooper Sr. - A Frat Party, a Sleepover and the Mother of All Blisters (2023) ... George Cooper Sr. - A Baby Shower and a Testosterone-Rich Banter (2023) ... George Cooper Sr. - Ruthless, Toothless and a Week of Bed Rest (2023) ... George Cooper Sr. - Pancake Sunday and Textbook Flirting (2023) ... George Cooper Sr. - College Dropouts and the Medford Miracle (2023) ... George Cooper Sr. - Legalese and a Whole Hoo-Ha (2022) ... George Cooper Sr. - A Tougher Nut and a Note on File (2022) ... George Cooper Sr. - An Ugly Car, an Affair and Some Kickass Football (2022) ... George Cooper Sr. - A Resident Advisor and the Word 'Sketchy' (2022) ... George Cooper Sr. - Blonde Ambition and the Concept of Zero (2022) ... George Cooper Sr. - Passion's Harvest and a Sheldocracy (2022) ... George Cooper Sr. - Future Worf and the Margarita of the South Pacific (2022) ... George Cooper Sr. - Four Hundred Cartons of Undeclared Cigarettes and a Niblingo (2022) ... George Cooper Sr. - A Clogged Pore, a Little Spanish and the Future (2022) ... George Cooper Sr. - White Trash, Holy Rollers and Punching People (2022) ... George Cooper Sr. - Uncle Sheldon and a Hormonal Firecracker (2022) ... George Cooper Sr. - A God-Fearin' Baptist and a Hot Trophy Husband (2022) ... George Cooper Sr. - Babies, Lies and a Resplendent Cannoli (2022) ... George Cooper Sr. - A Solo Peanut, a Social Butterfly and the Truth (2022) ... George Cooper Sr. - A Suitcase Full of Cash and a Yellow Clown Car (2022) ... George Cooper Sr. - A Lobster, an Armadillo and a Way Bigger Number (2022) ... George Cooper Sr. - A Free Scratcher and Feminine Wiles (2022) ... George Cooper Sr. - A Lot of Band-Aids and the Cooper Surrender (2022) ... George Cooper Sr. - A Pink Cadillac and a Glorious Tribal Dance (2022) ... George Cooper Sr. - A Lock-In, a Weather Girl and a Disgusting Habit (2022) ... George Cooper Sr. - An Expensive Glitch and a Goof-Off Room (2022) ... George Cooper Sr. - The Yips and an Oddly Hypnotic Bohemian (2021) ... George Cooper Sr. - The Grand Chancellor and a Den of Sin (2021) ... George Cooper Sr. - An Introduction to Engineering and a Glob of Hair Gel (2021) ... George Cooper Sr. - Money Laundering and a Cascade of Hormones (2021) ... George Cooper Sr. - Stuffed Animals and a Sweet Southern Syzygy (2021) ... George Cooper Sr. - Pish Posh and a Secret Back Room (2021) ... George Cooper Sr. - Potential Energy and Hooch on a Park Bench (2021) ... George Cooper Sr. - Snoopin' Around and the Wonder Twins of Atheism (2021) ... George Cooper Sr. - One Bad Night and Chaos of Selfish Desires (2021) ... George Cooper Sr. - The Wild and Woolly World of Nonlinear Dynamics (2021) ... George Cooper Sr. - A Black Hole (2021) ... George Cooper Sr. - A Second Prodigy and the Hottest Tips for Pouty Lips (2021) ... George Cooper Sr. - A Virus, Heartbreak and a World of Possibilities (2021) ... George Cooper Sr. - Mitch's Son and the Unconditional Approval of a Government Agency (2021) ... George Cooper Sr. - The Geezer Bus and a New Model for Education (2021) ... George Cooper Sr. - A Box of Treasure and the Meemaw of Science (2021) ... George Cooper Sr. - A Pager, a Club and a Cranky Bag of Wrinkles (2021) ... George Cooper Sr. - Cowboy Aerobics and 473 Grease-Free Bolts (2021) ... George Cooper Sr. - Crappy Frozen Ice Cream and an Organ Grinder's Monkey (2021) ... George Cooper Sr. - An Existential Crisis and a Bear That Makes Bubbles (2021) ... George Cooper Sr. - A Philosophy Class and Worms That Can Chase You (2021) ... George Cooper Sr. - Freshman Orientation and the Inventor of the Zipper (2021) ... George Cooper Sr. - A Musty Crypt and a Stick to Pee On (2020) ... George Cooper Sr. - Bible Camp and a Chariot of Love (2020) ... George Cooper Sr. - Training Wheels and an Unleashed Chicken (2020) ... George Cooper Sr. - A Docent, A Little Lady and a Bouncer Named Dalton (2020) ... George Cooper Sr. - Graduation (2020) ... George Cooper Sr. - A Secret Letter and a Lowly Disc of Processed Meat (2020) ... George Cooper Sr. - A Baby Tooth and the Egyptian God of Knowledge (2020) ... George Cooper Sr. (credit only) - A House for Sale and Serious Woman Stuff (2020) ... George Cooper Sr. - A Couple Bruised Ribs and a Cereal Box Ghost Detector (2020) ... George Cooper Sr. - An Academic Crime and a More Romantic Taco Bell (2020) ... George Cooper Sr. - Pasadena (2020) ... George Cooper Sr. - A Boyfriend's Ex-Wife and a Good Luck Head Rub (2020) ... George Cooper Sr. - A Slump, a Cross and Roadside Gravel (2020) ... George Cooper Sr. - Contracts, Rules and a Little Bit of Pig Brains (2020) ... George Cooper Sr. - Body Glitter and a Mall Safety Kit (2020) ... George Cooper Sr. - A Live Chicken, a Fried Chicken and Holy Matrimony (2020) ... George Cooper Sr. - Teenager Soup and A Little Ball of Fib (2019) ... George Cooper Sr. - A Party Invitation, Football Grapes and an Earth Chicken (2019) ... George Cooper Sr. - The Sin of Greed and a Chimichanga from Chi-Chi's (2019) ... George Cooper Sr. - Pongo Pygmaeus and a Culture that Encourages Spitting (2019) ... George Cooper Sr. - A Parasol and a Hell of an Arm (2019) ... George Cooper Sr. - A Pineapple and the Bosom of Male Friendship (2019) ... George Cooper Sr. - Hobbitses, Physicses and a Ball With Zip (2019) ... George Cooper Sr. - An Entrepreneurialist and a Swat on the Bottom (2019) ... George Cooper Sr. - A Broom Closet and Satan's Monopoly Board (2019) ... George Cooper Sr. - Quirky Eggheads and Texas Snow Globes (2019) ... George Cooper Sr. - A Swedish Science Thing and the Equation for Toast (2019) ... George Cooper Sr. - A Broken Heart and a Crock Monster (2019) ... George Cooper Sr. - A Proposal and a Popsicle Stick Cross (2019) ... George Cooper Sr. - A Political Campaign and a Candy Land Cheater (2019) ... George Cooper Sr. - A Perfect Score and a Bunsen Burner Marshmallow (2019) ... George Cooper Sr. - Albert Einstein and the Story of Another Mary (2019) ... George Cooper Sr. - A Loaf of Bread and a Grand Old Flag (2019) ... George Cooper Sr. - A Math Emergency and Perky Palms (2019) ... George Cooper Sr. - David, Goliath, and a Yoo-Hoo from the Back (2019) ... George Cooper Sr. - A Nuclear Reactor and a Boy Called Lovey (2019) ... George Cooper Sr. - A Tummy Ache and a Whale of a Metaphor (2019) ... George Cooper Sr. - A Race of Superhumans and a Letter to Alf (2019) ... George Cooper Sr. - A Stunted Childhood and a Can of Fancy Mixed Nuts (2018) ... George Cooper Sr. - Family Dynamics and a Red Fiero (2018) ... George Cooper Sr. - An 8-Bit Princess and a Flat Tire Genius (2018) ... George Cooper Sr. - Carbon Dating and a Stuffed Raccoon (2018) ... George Cooper Sr. - Seven Deadly Sins and a Small Carl Sagan (2018) ... George Cooper Sr. - A Research Study and Czechoslovakian Wedding Pastries (2018) ... George Cooper Sr. - A Financial Secret and Fish Sauce (2018) ... George Cooper Sr. - A Crisis of Faith and Octopus Aliens (2018) ... George Cooper Sr. - A Rival Prodigy and Sir Isaac Neutron (2018) ... George Cooper Sr. - A High-Pitched Buzz and Training Wheels (2018) ... George Cooper Sr. - Vanilla Ice Cream, Gentleman Callers, and a Dinette Set (2018) ... George Cooper Sr. - Summer Sausage, a Pocket Poncho, and Tony Danza (2018) ... George Cooper Sr. - A Dog, a Squirrel, and a Fish Named Fish (2018) ... George Cooper Sr. - Gluons, Guacamole, and the Color Purple (2018) ... George Cooper Sr. - A Mother, a Child, and a Blue Man's Backside (2018) ... George Cooper Sr. - Jiu-Jitsu, Bubble Wrap, and Yoo-Hoo (2018) ... George Cooper Sr. - Killer Asteroids, Oklahoma, and a Frizzy Hair Machine (2018) ... George Cooper Sr. - Dolomite, Apple Slices, and a Mystery Woman (2018) ... George Cooper Sr. - Potato Salad, a Broomstick, and Dad's Whiskey (2018) ... George Cooper Sr. - A Sneeze, Detention, and Sissy Spacek (2018) ... George Cooper Sr. - A Computer, a Plastic Pony, and a Case of Beer (2018) ... George Cooper Sr. - Demons, Sunday School, and Prime Numbers (2018) ... George Cooper Sr. - An Eagle Feather, a String Bean, and an Eskimo (2018) ... George Cooper Sr. - Spock, Kirk, and Testicular Hernia (2017) ... George Cooper Sr. - Cape Canaveral, Schrödinger's Cat, and Cyndi Lauper's Hair (2017) ... George Cooper Sr. - A Brisket, Voodoo, and Cannonball Run (2017) ... George Cooper Sr. - A Patch, a Modem, and a Zantac (2017) ... George Cooper Sr. - A Solar Calculator, a Game Ball, and a Cheerleader's Bosom (2017) ... George Cooper Sr. - A Therapist, a Comic Book, and a Breakfast Sausage (2017) ... George Cooper Sr. - Poker, Faith and Eggs (2017) ... George Cooper Sr. - Rockets, Communists, and the Dewey Decimal System (2017) ... George Cooper Sr. - Pilot (2017) ... George Cooper Sr."
    },
    {
      "id": "tt9013340",
      "role": "Actor",
      "title": "Fool's Paradise",
      "year": "2023",
      "description": "Side Kick"
    },
    {
      "id": "tt5227342",
      "role": "Actor",
      "title": "Raunch and Roll",
      "year": "2021",
      "description": "Crash"
    },
    {
      "id": "tt12434130",
      "role": "Actor",
      "title": "Tony the Tutor",
      "year": "2020",
      "description": "(TV Mini Series) Luigi Mortadella"
    },
    {
      "id": "tt0898266",
      "role": "Actor",
      "title": "The Big Bang Theory",
      "year": "2011-2018",
      "description": "(TV Series) George Sr. / Jimmy Speckerman - The VCR Illumination (2018) ... George Sr. - The Speckerman Recurrence (2011) ... Jimmy Speckerman"
    },
    {
      "id": "tt0472954",
      "role": "Actor",
      "title": "It's Always Sunny in Philadelphia",
      "year": "2010-2018",
      "description": "(TV Series) Bill Ponderosa - The Gang Wins the Big Game (2018) ... Bill Ponderosa - Charlie's Home Alone (2018) ... Bill Ponderosa - Making Dennis Reynolds a Murderer (2017) ... Bill Ponderosa - McPoyle vs. Ponderosa: The Trial of the Century (2016) ... Bill Ponderosa - Being Frank (2016) ... Bill Ponderosa - Mac Kills His Dad (2015) ... Bill Ponderosa - The Gang Squashes Their Beefs (2013) ... Bill Ponderosa - The Maureen Ponderosa Wedding Massacre (2012) ... Bill Ponderosa - Dee Gives Birth (2010) ... Bill Ponderosa - Dennis Gets Divorced (2010) ... Bill Ponderosa - Mac Fights Gay Marriage (2010) ... Bill Ponderosa"
    },
    {
      "id": "tt3807022",
      "role": "Actor",
      "title": "All Hail King Julien",
      "year": "2017",
      "description": "(TV Series short) Bruce - One More Cup, Part 2 (2017) ... Bruce (voice)"
    },
    {
      "id": "tt8202572",
      "role": "Actor",
      "title": "Never Seen You Shine So Bright",
      "year": "2017",
      "description": "(Short) Neil"
    },
    {
      "id": "tt3487356",
      "role": "Actor",
      "title": "Black-ish",
      "year": "2016-2017",
      "description": "(TV Series) Dr. Gabler - Good Dre Hunting (2017) ... Dr. Gabler - Nothing But Nepotism (2016) ... Dr. Gabler"
    },
    {
      "id": "tt2467372",
      "role": "Actor",
      "title": "Brooklyn Nine-Nine",
      "year": "2016",
      "description": "(TV Series) Patrick - Captain Latvia (2016) ... Patrick"
    },
    {
      "id": "tt3127020",
      "role": "Actor",
      "title": "Faking It",
      "year": "2014-2016",
      "description": "(TV Series) Lucas / Karma's Dad / Lucas, Karma's dad / ... - Up in Flames (2016) ... Lucas - Third Wheels (2016) ... Lucas - Jagged Little Heart (2016) ... Lucas - Faking It... Again (2015) ... Karma's Dad - Busted (2014) ... Karma's Dad - Zen and the Art of Pageantry (2014) ... Karma's Dad - Know Thy Selfie (2014) ... Lucas, Karma's dad - Homecoming Out (2014) ... Karma's dad"
    },
    {
      "id": "tt3216608",
      "role": "Actor",
      "title": "Dr. Ken",
      "year": "2015",
      "description": "(TV Series) Phil Stockton - The Master Scheduler (2015) ... Phil Stockton"
    },
    {
      "id": "tt0434672",
      "role": "Actor",
      "title": "The Comeback",
      "year": "2005-2014",
      "description": "(TV Series) Paulie G. - Valerie Gets What She Really Wants (2014) ... Paulie G. - Valerie Faces the Critics (2014) ... Paulie G. - Valerie Cooks in the Desert (2014) ... Paulie G. - Valerie Is Taken Seriously (2014) ... Paulie G. - Valerie Saves the Show (2014) ... Paulie G. - Valerie Is Brought to Her Knees (2014) ... Paulie G. - Valerie Tries to Get Yesterday Back (2014) ... Paulie G. - Valerie Makes a Pilot (2014) ... Paulie G. - Valerie Does Another Classic Leno (2005) ... Paulie G. - Valerie Shines Under Stress (2005) ... Paulie G. - Valerie Stands Out on the Red Carpet (2005) ... Paulie G. - Valerie Gets a Magazine Cover (2005) ... Paulie G. - Valerie Hangs with the Cool Kids (2005) ... Paulie G. - Valerie Relaxes in Palm Springs (2005) ... Paulie G. (voice) - Valerie Gets a Very Special Episode (2005) ... Paulie G. - Valerie Saves the Show (2005) ... Paulie G. - Valerie Demands Dignity (2005) ... Paulie G. (credit only) - Valerie Stands up for Aunt Sassy (2005) ... Paulie G. - Valerie Bonds with the Cast (2005) ... Paulie G. - Valerie Triumphs at the Upfronts (2005) ... Paulie G. - Pilot (2005) ... Paulie G."
    },
    {
      "id": "tt2137109",
      "role": "Actor",
      "title": "Masters of Sex",
      "year": "2014",
      "description": "(TV Series) Larry - One for the Money, Two for the Show (2014) ... Larry"
    },
    {
      "id": "tt2276413",
      "role": "Actor",
      "title": "Garfunkel and Oates",
      "year": "2014",
      "description": "(TV Series) Drew - Speechless (2014) ... Drew"
    },
    {
      "id": "tt1583607",
      "role": "Actor",
      "title": "Hot in Cleveland",
      "year": "2014",
      "description": "(TV Series) Tyler - Straight Outta Cleveland (2014) ... Tyler"
    },
    {
      "id": "tt1561755",
      "role": "Actor",
      "title": "Bob's Burgers",
      "year": "2014",
      "description": "(TV Series) Justgrillin' - Uncle Teddy (2014) ... Justgrillin' (voice)"
    },
    {
      "id": "tt3593214",
      "role": "Actor",
      "title": "We Got Next",
      "year": "2014",
      "description": "(TV Movie) Jay"
    },
    {
      "id": "tt3502544",
      "role": "Actor",
      "title": "Timms Valley",
      "year": "2013",
      "description": "(TV Series) 2nd Executive"
    },
    {
      "id": "tt2710104",
      "role": "Actor",
      "title": "The Crazy Ones",
      "year": "2013",
      "description": "(TV Series) Clyde - Models Love Magic (2013) ... Clyde"
    },
    {
      "id": "tt1600199",
      "role": "Actor",
      "title": "Franklin & Bash",
      "year": "2013",
      "description": "(TV Series) Teddy Lazlow - Control (2013) ... Teddy Lazlow"
    },
    {
      "id": "tt1850458",
      "role": "Actor",
      "title": "Whitney",
      "year": "2013",
      "description": "(TV Series) Nate - Sorry! (2013) ... Nate"
    },
    {
      "id": "tt1321870",
      "role": "Actor",
      "title": "Gangster Squad",
      "year": "2013",
      "description": "Comanche"
    },
    {
      "id": "tt2177489",
      "role": "Actor",
      "title": "Baby Daddy",
      "year": "2012",
      "description": "(TV Series) Tommy - The Daddy Whisperer (2012) ... Tommy"
    },
    {
      "id": "tt2400129",
      "role": "Actor",
      "title": "The Soul Man",
      "year": "2012",
      "description": "(TV Series) Mr. Richardson - Pastor Interference (2012) ... Mr. Richardson"
    },
    {
      "id": "tt0460649",
      "role": "Actor",
      "title": "How I Met Your Mother",
      "year": "2012",
      "description": "(TV Series) Guard #1 - The Magician's Code: Part 2 (2012) ... Guard #1"
    },
    {
      "id": "tt1981558",
      "role": "Actor",
      "title": "Key and Peele",
      "year": "2012",
      "description": "(TV Series) Cop - Episode #1.2 (2012) ... Cop"
    },
    {
      "id": "tt1582453",
      "role": "Actor",
      "title": "Harry's Law",
      "year": "2011",
      "description": "(TV Series) David Kerwin - Purple Hearts (2011) ... David Kerwin"
    },
    {
      "id": "tt1914235",
      "role": "Actor",
      "title": "Dead Cat",
      "year": "2010",
      "description": "(Short)"
    },
    {
      "id": "tt1737662",
      "role": "Actor",
      "title": "Penny",
      "year": "2010/I",
      "description": "(Short) Frank"
    },
    {
      "id": "tt1489428",
      "role": "Actor",
      "title": "Justified",
      "year": "2010",
      "description": "(TV Series) Frank - Long in the Tooth (2010) ... Frank"
    },
    {
      "id": "tt1001482",
      "role": "Actor",
      "title": "United States of Tara",
      "year": "2010",
      "description": "(TV Series) Sully - The Truth Hurts (2010) ... Sully - Trouble Junction (2010) ... Sully"
    },
    {
      "id": "tt0413573",
      "role": "Actor",
      "title": "Grey's Anatomy",
      "year": "2010",
      "description": "(TV Series) Phil - Suicide Is Painless (2010) ... Phil"
    },
    {
      "id": "tt1242441",
      "role": "Actor",
      "title": "Men of a Certain Age",
      "year": "2010",
      "description": "(TV Series) Hardware Store Manager - Father's Fraternity (2010) ... Hardware Store Manager"
    },
    {
      "id": "tt1196954",
      "role": "Actor",
      "title": "Single White Millionaire",
      "year": "2009",
      "description": "(TV Movie) Seth Mortin"
    },
    {
      "id": "tt0313043",
      "role": "Actor",
      "title": "CSI: Miami",
      "year": "2009",
      "description": "(TV Series) Al Wayons - Bad Seed (2009) ... Al Wayons"
    },
    {
      "id": "tt0312172",
      "role": "Actor",
      "title": "Monk",
      "year": "2009",
      "description": "(TV Series) Bill the Deliveryman - Mr. Monk Is Someone Else (2009) ... Bill the Deliveryman"
    },
    {
      "id": "tt1196946",
      "role": "Actor",
      "title": "The Mentalist",
      "year": "2008",
      "description": "(TV Series) Daniel Cardeira - Red-Handed (2008) ... Daniel Cardeira"
    },
    {
      "id": "tt0886531",
      "role": "Actor",
      "title": "Shades of Ray",
      "year": "2008",
      "description": "Karaoke Singer"
    },
    {
      "id": "tt1122770",
      "role": "Actor",
      "title": "The Middleman",
      "year": "2008",
      "description": "(TV Series) Johnny John - The Cursed Tuba Contingency (2008) ... Johnny John"
    },
    {
      "id": "tt0379865",
      "role": "Actor",
      "title": "Leatherheads",
      "year": "2008",
      "description": "Toledo Referee"
    },
    {
      "id": "tt0871451",
      "role": "Actor",
      "title": "The Hill",
      "year": "2007",
      "description": "(TV Movie) Eric"
    },
    {
      "id": "tt0904208",
      "role": "Actor",
      "title": "Californication",
      "year": "2007",
      "description": "(TV Series) Nick Lowry - Girls, Interrupted (2007) ... Nick Lowry - Absinthe Makes the Heart Grow Fonder (2007) ... Nick Lowry - LOL (2007) ... Nick Lowry"
    },
    {
      "id": "tt0901196",
      "role": "Actor",
      "title": "Insatiable",
      "year": "2007",
      "description": "(TV Series) Jerry Marinelli - Pilot (2007) ... Jerry Marinelli"
    },
    {
      "id": "tt0460684",
      "role": "Actor",
      "title": "Thick and Thin",
      "year": "2006",
      "description": "(TV Series) Kevin - Mary Moves On ... Kevin"
    },
    {
      "id": "tt0783643",
      "role": "Actor",
      "title": "Untitled Patricia Heaton Project",
      "year": "2006",
      "description": "(TV Movie) Pete"
    },
    {
      "id": "tt0238784",
      "role": "Actor",
      "title": "Gilmore Girls",
      "year": "2001-2006",
      "description": "(TV Series) Hugo Gray / the Man at Inn - Introducing Lorelai Planetarium (2006) ... Hugo Gray - Like Mother, Like Daughter (2001) ... the Man at Inn"
    },
    {
      "id": "tt0470765",
      "role": "Actor",
      "title": "For Your Consideration",
      "year": "2006",
      "description": "Dinkie"
    },
    {
      "id": "tt0829116",
      "role": "Actor",
      "title": "Breakdown",
      "year": "2006/II",
      "description": "(Short) Logan Conner"
    },
    {
      "id": "tt0485927",
      "role": "Actor",
      "title": "The Lather Effect",
      "year": "2006",
      "description": "Paul Helling"
    },
    {
      "id": "tt0375355",
      "role": "Actor",
      "title": "Joey",
      "year": "2005",
      "description": "(TV Series) Steve - Joey and the High School Friend (2005) ... Steve"
    },
    {
      "id": "tt0385727",
      "role": "Actor",
      "title": "The Godfather of Green Bay",
      "year": "2005",
      "description": "Kenny Caruso"
    },
    {
      "id": "tt0997224",
      "role": "Actor",
      "title": "The Poet of Canis",
      "year": "2005",
      "description": "(Short) The Poet"
    },
    {
      "id": "tt0346562",
      "role": "Actor",
      "title": "Bad Meat",
      "year": "2004",
      "description": "Buddy"
    },
    {
      "id": "tt0381741",
      "role": "Actor",
      "title": "Come to Papa",
      "year": "2004",
      "description": "(TV Series) Phillip - The Crush (2004) ... Phillip"
    },
    {
      "id": "tt0247144",
      "role": "Actor",
      "title": "Yes, Dear",
      "year": "2004",
      "description": "(TV Series) Man - Who Done It? (2004) ... Man"
    },
    {
      "id": "tt0358864",
      "role": "Actor",
      "title": "On the Spot",
      "year": "2003",
      "description": "(TV Series) Ensemble Player - One-Star Hotel (2003) ... Ensemble Player - Hooker Convention (2003) ... Ensemble Player - Bachelorette Party (2003) ... Ensemble Player - Little Brenda Dynamite (2003) ... Ensemble Player - Pilot (2003) ... Ensemble Player"
    },
    {
      "id": "tt0373230",
      "role": "Actor",
      "title": "Patching Cabbage",
      "year": "2003",
      "description": "(Short) Ryan"
    },
    {
      "id": "tt0321018",
      "role": "Actor",
      "title": "What I Like About You",
      "year": "2002",
      "description": "(TV Series) Phone Guy - Spa Day (2002) ... Phone Guy"
    },
    {
      "id": "tt0308506",
      "role": "Actor",
      "title": "Like Mike",
      "year": "2002",
      "description": "Director in Commercial (uncredited)"
    },
    {
      "id": "tt0296889",
      "role": "Actor",
      "title": "Tenfold",
      "year": "2002",
      "description": "Dunken Boy"
    },
    {
      "id": "tt0108757",
      "role": "Actor",
      "title": "ER",
      "year": "2001",
      "description": "(TV Series) Howard Norden - Start All Over Again (2001) ... Howard Norden"
    },
    {
      "id": "tt2467372",
      "role": "Soundtrack",
      "title": "Brooklyn Nine-Nine",
      "year": "2016",
      "description": "(TV Series) (performer - 1 episode) - Captain Latvia (2016) ... (performer: \"Silent Night\", \"Joy to the World\", \"Jingle Bells\" - uncredited)"
    },
    {
      "id": "tt0081857",
      "role": "Self",
      "title": "Entertainment Tonight",
      "year": "2022",
      "description": "(TV Series) Self - Iconic TV Dads Week - Day 4 (2022) ... Self"
    },
    {
      "id": "tt0493199",
      "role": "Self",
      "title": "eTalk Daily",
      "year": "2022",
      "description": "(TV Series) Self - Episode dated 30 March 2022 (2022) ... Self"
    },
    {
      "id": "tt14022540",
      "role": "Self",
      "title": "Cooped Up with the Coopers",
      "year": "2020",
      "description": "(Short) Self"
    },
    {
      "id": "tt12020508",
      "role": "Self",
      "title": "Stars in the House",
      "year": "2020",
      "description": "(TV Series) Self - The Comeback (2020) ... Self - Young Sheldon Cast (2020) ... Self"
    },
    {
      "id": "tt10428432",
      "role": "Self",
      "title": "The 61st Annual TV Week Logie Awards",
      "year": "2019",
      "description": "(TV Special) Self"
    },
    {
      "id": "tt8777372",
      "role": "Self",
      "title": "Box Angeles",
      "year": "2019",
      "description": "(TV Series) Self - Guest - BA #272: Lance Barber (2019) ... Self - Guest"
    },
    {
      "id": "tt4033858",
      "role": "Self",
      "title": "The Barn Theatre: Tomorrow's Stars Today",
      "year": "2017",
      "description": "(Documentary) Self"
    },
    {
      "id": "tt1740718",
      "role": "Self",
      "title": "The Talk",
      "year": "2017",
      "description": "(TV Series) Self - The Cast of \"Young Sheldon\"/Lindsay Miller/Eve (2017) ... Self"
    },
    {
      "id": "tt0413566",
      "role": "Self",
      "title": "Faking the Video",
      "year": "2004",
      "description": "(TV Series) Billy the Fake Director - Two PA's Left (2004) ... Billy the Fake Director"
    },
    {
      "id": "tt0305044",
      "role": "Self",
      "title": "The Jamie Kennedy Experiment",
      "year": "2002",
      "description": "(TV Series) Ensemble Player - Episode #1.6 (2002) ... Ensemble Player"
    },
    {
      "id": "tt0306676",
      "role": "Self",
      "title": "The Confetti Brothers",
      "year": "2001",
      "description": "(Short documentary) Michael O'Brien"
    },
    {
      "id": "tt0081857",
      "role": "Archive footage",
      "title": "Entertainment Tonight",
      "year": "2022",
      "description": "(TV Series) Self - Episode #41.240 (2022) ... Self"
    }
  ],
  "errorMessage": ""
}