{
  "imDbId": "tt0978762",
  "title": "Mary and Max",
  "fullTitle": "Mary and Max (2009)",
  "type": "Movie",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Mary and Max",
  "url": "https://en.wikipedia.org/wiki/Mary_and_Max",
  "plotShort": {
    "plainText": "Mary and Max is a 2009 Australian independent stop-motion adult-animated comedy-drama film written and directed by Adam Elliot and was his first animated feature film. The film was produced by Melanie Coombs and Melodrama Pictures with music by Dale Cornelius. The voice cast includes Philip Seymour Hoffman, Toni Collette, Eric Bana and Bethany Whitmore, with narration provided by Barry Humphries.\r\nThe film follows the lives and friendship of two unlikely pen-pals; Mary, a lonely Australian girl, and Max, an overweight American man with Asperger's syndrome. The film is inspired by Elliot's relationship with his pen-friend in New York whom he has been writing to for over twenty years.\r\nThe film premiered on the opening night of the 2009 Sundance Film Festival on 15 January 2009. The film won the Annecy Cristal in June 2009 from the Annecy International Animated Film Festival and Best Animated Feature Film at the Asia Pacific Screen Awards in November 2009. The film was theatrically released on 9 April 2009, by Icon Entertainment International, it received acclaim from critics.",
    "html": "<p>Mary and Max is a 2009 Australian independent stop-motion adult-animated comedy-drama film written and directed by Adam Elliot and was his first animated feature film. The film was produced by Melanie Coombs and Melodrama Pictures with music by Dale Cornelius. The voice cast includes Philip Seymour Hoffman, Toni Collette, Eric Bana and Bethany Whitmore, with narration provided by Barry Humphries.</p><p>The film follows the lives and friendship of two unlikely pen-pals; Mary, a lonely Australian girl, and Max, an overweight American man with Asperger's syndrome. The film is inspired by Elliot's relationship with his pen-friend in New York whom he has been writing to for over twenty years.</p><p>The film premiered on the opening night of the 2009 Sundance Film Festival on 15 January 2009. The film won the Annecy Cristal in June 2009 from the Annecy International Animated Film Festival and Best Animated Feature Film at the Asia Pacific Screen Awards in November 2009. The film was theatrically released on 9 April 2009, by Icon Entertainment International, it received acclaim from critics.</p>"
  },
  "plotFull": {
    "plainText": "Mary and Max is a 2009 Australian independent stop-motion adult-animated comedy-drama film written and directed by Adam Elliot and was his first animated feature film. The film was produced by Melanie Coombs and Melodrama Pictures with music by Dale Cornelius. The voice cast includes Philip Seymour Hoffman, Toni Collette, Eric Bana and Bethany Whitmore, with narration provided by Barry Humphries.\r\nThe film follows the lives and friendship of two unlikely pen-pals; Mary, a lonely Australian girl, and Max, an overweight American man with Asperger's syndrome. The film is inspired by Elliot's relationship with his pen-friend in New York whom he has been writing to for over twenty years.\r\nThe film premiered on the opening night of the 2009 Sundance Film Festival on 15 January 2009. The film won the Annecy Cristal in June 2009 from the Annecy International Animated Film Festival and Best Animated Feature Film at the Asia Pacific Screen Awards in November 2009. The film was theatrically released on 9 April 2009, by Icon Entertainment International, it received acclaim from critics.\r\nPlot\r\nIn 1976, eight-year-old Mary Daisy Dinkle (Bethany Whitmore) lives a lonely life in Mount Waverley, Victoria, Australia. At school, she is teased by her classmates because of an unfortunate birthmark on her forehead. While at home, her distant father, Noel, and alcoholic, kleptomaniac mother, Vera, provide little support. Her only comforts are her pet rooster, Ethel; her favourite food, sweetened condensed milk; and a Smurfs-like cartoon show called The Noblets. One day, while at the post office with her mother, Mary spots a New York City telephone book and, becoming curious about Americans, decides to write to one. She randomly chooses Max Jerry Horowitz's name from the phone book and writes him a letter telling him about herself, sending it off hoping he will become her pen pal.\r\nMax Jerry Horowitz (Philip Seymour Hoffman) is a morbidly obese 44-year-old Jewish atheist who has trouble forming close bonds with other people due to various mental and social problems. Though Mary's letter initially gives him an anxiety attack, he decides to write back to her, and the two quickly become friends (partly due to their shared love of chocolate and The Noblets). Due to Vera's disapproval of Max when she receives his first letter, Mary tells him to send his letters to her agoraphobic neighbour, Len Hislop, whose mail she collects regularly. When Mary later asks Max about love, he suffers a severe anxiety attack and is institutionalised for eight months. After his release, he is hesitant to write to Mary again for some time. On his 48th birthday, he wins the New York Lottery, using his winnings to buy a lifetime supply of chocolate and an entire collection of Noblet figurines. He gives the remainder to his elderly neighbour, Ivy, who uses most of it to pamper herself before dying in an accident with a malfunctioning jet pack. Meanwhile, Mary becomes despondent, thinking Max has abandoned her.\r\nMax finally writes back to Mary on the advice of his therapist and explains he has been diagnosed with Asperger syndrome. Mary is thrilled to hear from him again, and the two continue their correspondence for the next several years. When Noel retires from his job at a teabag factory, he takes up metal detecting but is soon swept away (and presumably killed) by a large tidal bore while on a beach. The now-adult Mary (Toni Collette) goes to the University of Melbourne and has her birthmark surgically removed, and develops a crush on her Greek Australian neighbour, Damien Popodopoulos (Eric Bana). Drunk and guilt-ridden over her husband's death, Vera accidentally kills herself after she drinks embalming fluid (which she mistook for cooking sherry). Mary and Damien grow closer following Vera's death and are later married.\r\nInspired by her friendship with Max, Mary studies psychology at university, writing her doctoral dissertation on Asperger syndrome with Max as her case study. She plans to have her dissertation published as a book, but when Max receives a copy from her, he is infuriated, believing that she has taken advantage of his condition, which he sees as an integral part of his personality and not a disability that needs to be cured. Feeling betrayed and unable to put his emotions into words, he breaks off communication with Mary (by removing the letter \"M\" from his typewriter), who, heartbroken, has the entire run of her book pulped, effectively ending her budding career. She sinks into depression and begins drinking cooking sherry, as her mother had done. While searching through a cabinet, she finds a can of condensed milk and sends it to Max as an apology in an attempt to heal wounds. She checks the post daily for a response and one day finds a note from Damien, informing her that he has left her for his own pen-friend, Desmond, a sheep farmer in New Zealand.\r\nMeanwhile, after an incident in which he nearly chokes a homeless man (Ian \"Molly\" Meldrum) in anger for throwing away a used cigarette, Max realizes Mary is an imperfect human being, like himself, and sends her a package containing his Noblet figurine collection as a sign of forgiveness. Mary, however, has sunken into despair after Damien's departure and fails to find the box on her doorstep for several days. Finding some Valium that had belonged to her mother, and unaware that she is pregnant with Damien's child, Mary decides to commit suicide. As she takes the Valium and is on the verge of hanging herself, Len knocks on her door, having conquered his agoraphobia to alert her of Max's package. Inside, she finds the Noblet figurines and a letter from Max, in which he tells her of his realisation that they are not perfect, and expresses his forgiveness. He also states how much their friendship means to him and hopes their paths will cross one day.\r\nOne year later, Mary travels to New York with her infant child to finally visit Max. Entering his apartment, Mary discovers Max on his couch, gazing upward with a smile on his face, having died earlier that morning. Looking around the apartment, Mary is awestruck to find all the letters she had sent to Max over the years, laminated and taped to the ceiling. Realizing Max had been gazing at the letters when he died, and seeing how much he had valued their friendship, Mary cries tears of joy as she sits beside him on the couch.\r\nCast\r\nBarry Humphries as the Narrator\r\nToni Collette as Mary Daisy Dinkle\r\nBethany Whitmore as Young Mary\r\nPhilip Seymour Hoffman as Max Jerry Horowitz\r\nEric Bana as Damien Popodopoulos\r\nRenée Geyer as Vera Lorraine Dinkle\r\nIan \"Molly\" Meldrum as Homeless Man\r\nMichael Ienna as Lincoln (uncredited)\r\nJulie Forsyth, John Flaus, Christopher Massey, Shaun Patten, Leanne Smith and Carolyn Shakespeare-Allen as additional voices\r\nProduction\r\nDevelopment\r\nAccording to the opening credits, the film is based on a true story. In an interview given in April 2009, writer-director Elliot clarified that the character of Max was inspired by \"a pen-friend in New York who I've been writing to for over twenty years.\" Principal photography lasted over 57 weeks, using 133 separate sets, 212 puppets, and 475 miniature props, \"including a fully functioning Underwood typewriter which apparently took nine weeks to design and build.\"\r\nThemes\r\nThe film deals with themes including childhood neglect, friendship, addiction, alcoholism, recovery, the obscurity of life, teasing, loneliness, mental illness, autism (Asperger syndrome in particular), obesity, suicide, depression, isolation, and anxiety.\r\nMusic\r\nThe music in the film features Simon Jeffes and the Penguin Cafe Orchestra's \"Perpetuum Mobile\" (the opening theme) and \"Prelude and Yodel\", as well as \"Russian Rag\" by Elena Kats-Chernin. The closing-credits music is \"A Swingin' Safari\" by Bert Kaempfert and his Orchestra. Other artists include Nana Mouskouri, Dale Cornelius, Leroy Anderson, Pink Martini, London Pops Orchestra, James Last and his Orchestra, The King's Consort and Choir, the Sydney Alpha Ensemble, and the ABC Radio Orchestra.\r\nThis film also includes the Pink Martini version of Doris Day's most well-known song, \"Que Sera Sera\", which is played over Mary's attempted suicide scene.\r\nReception\r\nCritical response\r\nMary and Max received acclaim from critics. Rotten Tomatoes gives the film an approval rating of 95% based on 65 reviews, with an average rating of 8.10/10. The consensus reads, \"Mary and Max is a lovingly crafted, startlingly inventive piece of animation whose technical craft is equaled by its emotional resonance.\" Matt Ravier, writing for In Film Australia, said the \"story is paper-thin and some stretches of it are simply too long, yet whenever the narrative thread threatens to tear, the sheer authenticity and bold honesty of the characters save the day\". The Los Angeles Times called it a \"remarkable and poignant\" film depicting a \"film noir world of blacks, whites and grays for Max and a sepia suburbia for Mary\". After the film was released on DVD in the United States, Slant said \"Adam Elliot's dry wit is pervasive throughout Mary and Max and it's nice to see that this unique sense of humor extends to the extras. The writer-director gives a funny and informative audio commentary and a set of hilarious making-of episodes reflects the sardonic tone of the production. The big prize here, however, is the addition of Elliot's Oscar-winning short Harvie Krumpet. This Barry Humphires-narrated tale of the titular Tourette syndrome sufferer is a wonderful introduction both to Elliot's sensibilities and to Mary and Max's specific tone.\"\r\nBox office\r\nMary and Max grossed $1,444,617 at the Australian box office. The film received no general theatrical release in the United States, though it was showcased at several American film festivals, and was briefly shown at one of the Laemmle Theatres in the Los Angeles area. The film's U.S. distributor (IFC Films) made the film available on DVD and through video on demand. The film was released in France by Gaumont and in Germany by MFA to significant critical and box office success.\r\nAwards\r\nHome media\r\nMary and Max was released on DVD on 26 January 2010 by Icon Entertainment International.\r\nRelated exhibition\r\nAn exhibit of artefacts and clips from the film was presented in France and Australia. In France the exhibition was hosted by Gaumont as part of the release. In Australia initially at the Australian Centre for the Moving Image for three months starting in March 2010 and then touring around Australia throughout 2010/2011.",
    "html": "<p>Mary and Max is a 2009 Australian independent stop-motion adult-animated comedy-drama film written and directed by Adam Elliot and was his first animated feature film. The film was produced by Melanie Coombs and Melodrama Pictures with music by Dale Cornelius. The voice cast includes Philip Seymour Hoffman, Toni Collette, Eric Bana and Bethany Whitmore, with narration provided by Barry Humphries.</p><p>The film follows the lives and friendship of two unlikely pen-pals; Mary, a lonely Australian girl, and Max, an overweight American man with Asperger's syndrome. The film is inspired by Elliot's relationship with his pen-friend in New York whom he has been writing to for over twenty years.</p><p>The film premiered on the opening night of the 2009 Sundance Film Festival on 15 January 2009. The film won the Annecy Cristal in June 2009 from the Annecy International Animated Film Festival and Best Animated Feature Film at the Asia Pacific Screen Awards in November 2009. The film was theatrically released on 9 April 2009, by Icon Entertainment International, it received acclaim from critics.</p><br/><h3>Plot</h3><p>In 1976, eight-year-old Mary Daisy Dinkle (Bethany Whitmore) lives a lonely life in Mount Waverley, Victoria, Australia. At school, she is teased by her classmates because of an unfortunate birthmark on her forehead. While at home, her distant father, Noel, and alcoholic, kleptomaniac mother, Vera, provide little support. Her only comforts are her pet rooster, Ethel; her favourite food, sweetened condensed milk; and a Smurfs-like cartoon show called The Noblets. One day, while at the post office with her mother, Mary spots a New York City telephone book and, becoming curious about Americans, decides to write to one. She randomly chooses Max Jerry Horowitz's name from the phone book and writes him a letter telling him about herself, sending it off hoping he will become her pen pal.</p><p>Max Jerry Horowitz (Philip Seymour Hoffman) is a morbidly obese 44-year-old Jewish atheist who has trouble forming close bonds with other people due to various mental and social problems. Though Mary's letter initially gives him an anxiety attack, he decides to write back to her, and the two quickly become friends (partly due to their shared love of chocolate and The Noblets). Due to Vera's disapproval of Max when she receives his first letter, Mary tells him to send his letters to her agoraphobic neighbour, Len Hislop, whose mail she collects regularly. When Mary later asks Max about love, he suffers a severe anxiety attack and is institutionalised for eight months. After his release, he is hesitant to write to Mary again for some time. On his 48th birthday, he wins the New York Lottery, using his winnings to buy a lifetime supply of chocolate and an entire collection of Noblet figurines. He gives the remainder to his elderly neighbour, Ivy, who uses most of it to pamper herself before dying in an accident with a malfunctioning jet pack. Meanwhile, Mary becomes despondent, thinking Max has abandoned her.</p><p>Max finally writes back to Mary on the advice of his therapist and explains he has been diagnosed with Asperger syndrome. Mary is thrilled to hear from him again, and the two continue their correspondence for the next several years. When Noel retires from his job at a teabag factory, he takes up metal detecting but is soon swept away (and presumably killed) by a large tidal bore while on a beach. The now-adult Mary (Toni Collette) goes to the University of Melbourne and has her birthmark surgically removed, and develops a crush on her Greek Australian neighbour, Damien Popodopoulos (Eric Bana). Drunk and guilt-ridden over her husband's death, Vera accidentally kills herself after she drinks embalming fluid (which she mistook for cooking sherry). Mary and Damien grow closer following Vera's death and are later married.</p><p>Inspired by her friendship with Max, Mary studies psychology at university, writing her doctoral dissertation on Asperger syndrome with Max as her case study. She plans to have her dissertation published as a book, but when Max receives a copy from her, he is infuriated, believing that she has taken advantage of his condition, which he sees as an integral part of his personality and not a disability that needs to be cured. Feeling betrayed and unable to put his emotions into words, he breaks off communication with Mary (by removing the letter \"M\" from his typewriter), who, heartbroken, has the entire run of her book pulped, effectively ending her budding career. She sinks into depression and begins drinking cooking sherry, as her mother had done. While searching through a cabinet, she finds a can of condensed milk and sends it to Max as an apology in an attempt to heal wounds. She checks the post daily for a response and one day finds a note from Damien, informing her that he has left her for his own pen-friend, Desmond, a sheep farmer in New Zealand.</p><p>Meanwhile, after an incident in which he nearly chokes a homeless man (Ian \"Molly\" Meldrum) in anger for throwing away a used cigarette, Max realizes Mary is an imperfect human being, like himself, and sends her a package containing his Noblet figurine collection as a sign of forgiveness. Mary, however, has sunken into despair after Damien's departure and fails to find the box on her doorstep for several days. Finding some Valium that had belonged to her mother, and unaware that she is pregnant with Damien's child, Mary decides to commit suicide. As she takes the Valium and is on the verge of hanging herself, Len knocks on her door, having conquered his agoraphobia to alert her of Max's package. Inside, she finds the Noblet figurines and a letter from Max, in which he tells her of his realisation that they are not perfect, and expresses his forgiveness. He also states how much their friendship means to him and hopes their paths will cross one day.</p><p>One year later, Mary travels to New York with her infant child to finally visit Max. Entering his apartment, Mary discovers Max on his couch, gazing upward with a smile on his face, having died earlier that morning. Looking around the apartment, Mary is awestruck to find all the letters she had sent to Max over the years, laminated and taped to the ceiling. Realizing Max had been gazing at the letters when he died, and seeing how much he had valued their friendship, Mary cries tears of joy as she sits beside him on the couch.</p><br/><h3>Cast</h3><ul><li>Barry Humphries as the Narrator</li><li>Toni Collette as Mary Daisy Dinkle</li><li>Bethany Whitmore as Young Mary</li><li>Philip Seymour Hoffman as Max Jerry Horowitz</li><li>Eric Bana as Damien Popodopoulos</li><li>Renée Geyer as Vera Lorraine Dinkle</li><li>Ian \"Molly\" Meldrum as Homeless Man</li><li>Michael Ienna as Lincoln (uncredited)</li><li>Julie Forsyth, John Flaus, Christopher Massey, Shaun Patten, Leanne Smith and Carolyn Shakespeare-Allen as additional voices</li></ul><br/><h3>Production</h3><h4>Development</h4><p>According to the opening credits, the film is based on a true story. In an interview given in April 2009, writer-director Elliot clarified that the character of Max was inspired by \"a pen-friend in New York who I've been writing to for over twenty years.\" Principal photography lasted over 57 weeks, using 133 separate sets, 212 puppets, and 475 miniature props, \"including a fully functioning Underwood typewriter which apparently took nine weeks to design and build.\"</p><h4>Themes</h4><p>The film deals with themes including childhood neglect, friendship, addiction, alcoholism, recovery, the obscurity of life, teasing, loneliness, mental illness, autism (Asperger syndrome in particular), obesity, suicide, depression, isolation, and anxiety.</p><br/><h3>Music</h3><p>The music in the film features Simon Jeffes and the Penguin Cafe Orchestra's \"Perpetuum Mobile\" (the opening theme) and \"Prelude and Yodel\", as well as \"Russian Rag\" by Elena Kats-Chernin. The closing-credits music is \"A Swingin' Safari\" by Bert Kaempfert and his Orchestra. Other artists include Nana Mouskouri, Dale Cornelius, Leroy Anderson, Pink Martini, London Pops Orchestra, James Last and his Orchestra, The King's Consort and Choir, the Sydney Alpha Ensemble, and the ABC Radio Orchestra.</p><p>This film also includes the Pink Martini version of Doris Day's most well-known song, \"Que Sera Sera\", which is played over Mary's attempted suicide scene.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Mary and Max received acclaim from critics. Rotten Tomatoes gives the film an approval rating of 95% based on 65 reviews, with an average rating of 8.10/10. The consensus reads, \"Mary and Max is a lovingly crafted, startlingly inventive piece of animation whose technical craft is equaled by its emotional resonance.\" Matt Ravier, writing for In Film Australia, said the \"story is paper-thin and some stretches of it are simply too long, yet whenever the narrative thread threatens to tear, the sheer authenticity and bold honesty of the characters save the day\". The Los Angeles Times called it a \"remarkable and poignant\" film depicting a \"film noir world of blacks, whites and grays for Max and a sepia suburbia for Mary\". After the film was released on DVD in the United States, Slant said \"Adam Elliot's dry wit is pervasive throughout Mary and Max and it's nice to see that this unique sense of humor extends to the extras. The writer-director gives a funny and informative audio commentary and a set of hilarious making-of episodes reflects the sardonic tone of the production. The big prize here, however, is the addition of Elliot's Oscar-winning short Harvie Krumpet. This Barry Humphires-narrated tale of the titular Tourette syndrome sufferer is a wonderful introduction both to Elliot's sensibilities and to Mary and Max's specific tone.\"</p><h4>Box office</h4><p>Mary and Max grossed $1,444,617 at the Australian box office. The film received no general theatrical release in the United States, though it was showcased at several American film festivals, and was briefly shown at one of the Laemmle Theatres in the Los Angeles area. The film's U.S. distributor (IFC Films) made the film available on DVD and through video on demand. The film was released in France by Gaumont and in Germany by MFA to significant critical and box office success.</p><h4>Awards</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th></tr><tr><td><span>Asia Pacific Screen Award</span></td><td>Best Animated Feature Film</td><td>Melanie Coombs</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Australian Directors Guild</td><td>Best Direction in a Feature Film</td><td><span>Adam Elliot</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>AACTA Awards</span><br><small>(<span>2009 AFI Awards</span>)</small></td><td><span>AFI Members' Choice Award</span></td><td rowspan=\"2\">Melanie Coombs</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td rowspan=\"5\">Adam Elliot</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Berlin International Film Festival</span></td><td>Glass Bear</td><td>Honorable mention</td></tr><tr><td><span>BAFICI Award</span></td><td>Best Film</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">FCCA Award</span></td><td>Best Director</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>International Cinephile Society Award</td><td colspan=\"2\">Best Animated Film</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Ottawa International Animation Festival</span></td><td>Grand Prize</td><td>Adam Elliot</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Home media</h3><p>Mary and Max was released on DVD on 26 January 2010 by Icon Entertainment International.</p><br/><h3>Related exhibition</h3><p>An exhibit of artefacts and clips from the film was presented in France and Australia. In France the exhibition was hosted by Gaumont as part of the release. In Australia initially at the Australian Centre for the Moving Image for three months starting in March 2010 and then touring around Australia throughout 2010/2011.</p><br/>"
  },
  "errorMessage": ""
}