{
  "imDbId": "tt0167260",
  "title": "The Lord of the Rings: The Return of the King",
  "fullTitle": "The Lord of the Rings: The Return of the King (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "100",
      "content": "The conclusion of Peter Jackson's masterwork is passionate and literate, detailed and expansive, and it's conceived with a risk-taking flair for old-fashioned movie magic at its most precious."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "An epic success and a history-making production that finishes with a masterfully entertaining final installment."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "https://www.msnbc.com/",
      "rate": "100",
      "content": "The second installment was better than the first, and this one is best of all. It has spectacular action scenes and imaginary creatures, and it’s by far the most moving chapter. The performances have deepened."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "100",
      "content": "The second half of the film elevates all the story elements to Beethovenian crescendo. Here is an epic with literature's depth and opera's splendor -- and one that could be achieved only in movies. What could be more terrific?"
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "100",
      "content": "Represents that filmmaking rarity -- a third part of a trilogy that is decisively the best of the lot. With epic conflict, staggering battles, striking landscapes and effects, and resolved character arcs all leading to a dramatic conclusion to more than nine hours of masterful storytelling."
    },
    {
      "publisher": "Empire",
      "author": "Alan Morrison",
      "link": "",
      "rate": "100",
      "content": "Those who have walked beside these heroes every step of the way on such a long journey deserve the emotional pay-off as well as the action peaks, and they will be genuinely touched as the final credits roll."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Labeling this as a \"movie\" is almost an injustice. This is an experience of epic scope and grandeur, amazing emotional power, and relentless momentum."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "100",
      "content": "Jackson is rare among the makers of epic movies in that he knows how to do the small stuff, too. The Return of the King has “heart”--how else could it pump out all that blood?"
    },
    {
      "publisher": "New York Daily News",
      "author": "Jack Mathews",
      "link": "",
      "rate": "100",
      "content": "The most emotionally satisfying because, in addition to having both more intimate drama and more spectacular battles, it resolves all of the issues raised before."
    },
    {
      "publisher": "New York Post",
      "author": "Lou Lumenick",
      "link": "",
      "rate": "100",
      "content": "A majestic conclusion to a nine-plus-hours epic that stirs the heart, mind and soul as few films ever have."
    }
  ],
  "errorMessage": ""
}