{
  "imDbId": "tt0167260",
  "title": "The Lord of the Rings: The Return of the King",
  "fullTitle": "The Lord of the Rings: The Return of the King (2003)",
  "type": "Movie",
  "year": "2003",
  "language": "en",
  "titleInLanguage": "The Lord of the Rings: The Return of the King",
  "url": "https://en.wikipedia.org/wiki/The_Lord_of_the_Rings:_The_Return_of_the_King",
  "plotShort": {
    "plainText": "The Lord of the Rings: The Return of the King is a 2003 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson. It is based on 1955's The Return of the King, the third volume of the novel The Lord of the Rings by J. R. R. Tolkien. The sequel to 2002's The Lord of the Rings: The Two Towers, the film is the final instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, and Sean Bean. Continuing the plot of the previous film, Frodo, Sam and Gollum are making their final way toward Mount Doom to destroy the One Ring, unaware of Gollum's true intentions, while Merry, Pippin, Gandalf, Aragorn, Legolas, Gimli and the others join forces together against Sauron and his legions in Minas Tirith.\r\nThe Return of the King was financed and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy. It premiered on 1 December 2003 at the Embassy Theatre in Wellington, and was then released on 17 December 2003 in the US and on 18 December 2003 in New Zealand. The film was acclaimed by both critics and audiences, who considered it to be a landmark in filmmaking and the fantasy film genre, and a satisfying conclusion to the trilogy, with praise for the visual effects, performances, action sequences, direction, screenplay, musical score, costume design, emotional depth and scope. It grossed over $1.1 billion worldwide, making it the highest-grossing film of 2003 and the second highest-grossing film of all time at the time of release, as well as the highest-grossing film ever released by New Line Cinema.\r\nLike the previous films in the trilogy, The Return of the King is widely recognised as one of the greatest and most influential films ever made. The film received numerous accolades; at the 76th Academy Awards, it won all eleven awards for which it was nominated, including Best Picture, the first fantasy film to do so and tying with 1959's Ben-Hur and 1997's Titanic as the movie with the most Academy Award wins. It also became the second film series whose entries have all won Best Visual Effects, after the original Star Wars trilogy.",
    "html": "<p>The Lord of the Rings: The Return of the King is a 2003 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson. It is based on 1955's The Return of the King, the third volume of the novel The Lord of the Rings by J. R. R. Tolkien. The sequel to 2002's The Lord of the Rings: The Two Towers, the film is the final instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, and Sean Bean. Continuing the plot of the previous film, Frodo, Sam and Gollum are making their final way toward Mount Doom to destroy the One Ring, unaware of Gollum's true intentions, while Merry, Pippin, Gandalf, Aragorn, Legolas, Gimli and the others join forces together against Sauron and his legions in Minas Tirith.</p><p>The Return of the King was financed and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy. It premiered on 1 December 2003 at the Embassy Theatre in Wellington, and was then released on 17 December 2003 in the US and on 18 December 2003 in New Zealand. The film was acclaimed by both critics and audiences, who considered it to be a landmark in filmmaking and the fantasy film genre, and a satisfying conclusion to the trilogy, with praise for the visual effects, performances, action sequences, direction, screenplay, musical score, costume design, emotional depth and scope. It grossed over $1.1 billion worldwide, making it the highest-grossing film of 2003 and the second highest-grossing film of all time at the time of release, as well as the highest-grossing film ever released by New Line Cinema.</p><p>Like the previous films in the trilogy, The Return of the King is widely recognised as one of the greatest and most influential films ever made. The film received numerous accolades; at the 76th Academy Awards, it won all eleven awards for which it was nominated, including Best Picture, the first fantasy film to do so and tying with 1959's Ben-Hur and 1997's Titanic as the movie with the most Academy Award wins. It also became the second film series whose entries have all won Best Visual Effects, after the original Star Wars trilogy.</p>"
  },
  "plotFull": {
    "plainText": "The Lord of the Rings: The Return of the King is a 2003 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson. It is based on 1955's The Return of the King, the third volume of the novel The Lord of the Rings by J. R. R. Tolkien. The sequel to 2002's The Lord of the Rings: The Two Towers, the film is the final instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, and Sean Bean. Continuing the plot of the previous film, Frodo, Sam and Gollum are making their final way toward Mount Doom to destroy the One Ring, unaware of Gollum's true intentions, while Merry, Pippin, Gandalf, Aragorn, Legolas, Gimli and the others join forces together against Sauron and his legions in Minas Tirith.\r\nThe Return of the King was financed and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy. It premiered on 1 December 2003 at the Embassy Theatre in Wellington, and was then released on 17 December 2003 in the US and on 18 December 2003 in New Zealand. The film was acclaimed by both critics and audiences, who considered it to be a landmark in filmmaking and the fantasy film genre, and a satisfying conclusion to the trilogy, with praise for the visual effects, performances, action sequences, direction, screenplay, musical score, costume design, emotional depth and scope. It grossed over $1.1 billion worldwide, making it the highest-grossing film of 2003 and the second highest-grossing film of all time at the time of release, as well as the highest-grossing film ever released by New Line Cinema.\r\nLike the previous films in the trilogy, The Return of the King is widely recognised as one of the greatest and most influential films ever made. The film received numerous accolades; at the 76th Academy Awards, it won all eleven awards for which it was nominated, including Best Picture, the first fantasy film to do so and tying with 1959's Ben-Hur and 1997's Titanic as the movie with the most Academy Award wins. It also became the second film series whose entries have all won Best Visual Effects, after the original Star Wars trilogy.\r\nPlot\r\nThe hobbit, Sméagol, is fishing with his cousin Déagol, who discovers the One Ring in the river. Sméagol's mind is ensnared by the Ring, and he kills his cousin for it. Increasingly corrupted physically and mentally, he retreats into the Misty Mountains and becomes known as Gollum.\r\nCenturies later, during the War of the Ring, Gandalf leads Aragorn, Legolas, Gimli, and King Théoden of Rohan to Isengard, where they reunite with Merry and Pippin. Gandalf retrieves Saruman's palantír, and the group returns to Edoras to celebrate their victory at Helm's Deep. Pippin looks into the palantír, seeing Sauron and a burning tree. Gandalf deduces that the enemy plans to attack Gondor's capital Minas Tirith; he rides there to warn Gondor's steward Denethor. Pippin, who accompanies him, swears fealty to Denethor, whose now-dead heir Boromir had saved his life; on Gandalf's instruction, Pippin triggers the lighting of the beacons, which call for help from Rohan.\r\nFrodo, who carries the Ring, and Sam continue their journey towards Mordor, unaware that Gollum, now their guide, plans to betray them and take the Ring for himself. The trio witnessed the Witch-king of Angmar, lord of the nine Nazgûl, setting off towards Gondor with his army of Orcs. Gollum conspires to frame Sam for eating food supplies and desiring the Ring; influenced by the growing power of the Ring, Frodo is taken in by the deception, and orders Sam to go home. Gollum then tricks Frodo into venturing into the lair of the giant spider Shelob. Frodo narrowly escapes and confronts Gollum, who falls down a chasm after a scuffle. Shelob discovers, paralyses, and binds Frodo, but is wounded and driven away by a returning Sam, who, mourning Frodo's apparent death, takes the Ring. Sam realises his mistake when a group of Orcs takes Frodo captive but manages to rescue Frodo as the Orcs fight among themselves. Now inside Mordor, the hobbits continue towards Mount Doom, their destination.\r\nAs King Théoden gathers his army, Elrond tells Aragorn that Arwen is dying, having refused to leave Middle-earth. Elrond gives Aragorn Andúril, reforged from the shards of King Elendil's sword Narsil, and urges him to commit to claiming Gondor's throne, to which he is the heir. Joined by Legolas and Gimli, Aragorn travels the Paths of the Dead, and pledges to release the ghosts there from their curse should they come to Gondor's aid. Meanwhile, Faramir, who was earlier overwhelmed and driven back to Minas Tirith by the Witch-king, is gravely wounded in a suicide charge; believing his son to be dead, Denethor falls into madness. Gandalf marshals the defenders, but the huge Orc army breaks into the city. Denethor attempts to burn himself and Faramir on a pyre, but Pippin alerts Gandalf and they rescue Faramir. Denethor, set ablaze and in agony, jumps to his death.\r\nThéoden arrives and leads his army against the Orcs. Despite initial success against Orcs in the ensuing battle, they are decimated by the Oliphaunt-riding Haradrim and the Witch-king mortally wounds Théoden; however, his niece Éowyn slays the Witch-king with Merry's help. Théoden dies in his niece's arms. Aragorn then arrives with his Army of the Dead, who overcome Sauron's forces. Their oath is fulfilled, and the Dead are released from their curse. Aragorn decides to march on Mordor to distract Sauron from Frodo, now extremely weak, and Sam; all of Sauron's remaining forces march to meet Aragorn's diversion, allowing the hobbits to reach Mount Doom. Gollum, who survived his earlier fall, attacks them, but Frodo still manages to enter the mountain. There, he succumbs to the Ring's power, putting it on his finger, but Gollum manages to bite off his finger and reclaim it. They struggle together and both fall off the ledge. Frodo clings to it with one hand as remorse and guilt flood his mind in the wake of his succumbing to the ring when Sam's unwavering faith and belief in his friend convinces him to make one final reach for Sam's hand, saving Frodo's life. Gollum falls and dies; the Ring, which fell with him, disintegrates in the lava, causing Barad-dûr to crumble as The Eye of Sauron explodes, destroying the dark lord once and for all. Aragorn's army emerges victorious as its enemies and the lands of Mordor collapse into the earth, and Mount Doom erupts, with Frodo and Sam narrowly escaping the lava.\r\nGandalf rescues the hobbits with the help of eagles, and the surviving Fellowship is happily reunited in Minas Tirith. Aragorn is crowned King of Gondor and marries Arwen. The Hobbits return home to the Shire, where Sam marries Rosie Cotton. Four years later, Frodo, whose wound inflicted by the Nazgûl refuses to heal and suffering from trauma, departs Middle-earth for the Undying Lands with his uncle Bilbo, Gandalf, and the Elves. He leaves Sam the Red Book of Westmarch, which details their adventures. Sam returns to the Shire, where he embraces Rosie and their children.\r\nCast\r\nLike the preceding films in the trilogy, The Return of the King has an ensemble cast, and some of the cast and their respective characters include:\r\nElijah Wood as Frodo Baggins: A young hobbit who continues his quest to destroy the Ring, which continues to torture him.\r\nIan McKellen as Gandalf the White: An Istari wizard who travels to aid the Men of Gondor, acting as a general at the Siege of Gondor.\r\nViggo Mortensen as Aragorn: A Dúnedain ranger who must finally face his destiny as King of Gondor.\r\nSean Astin as Samwise Gamgee: Better known as Sam, Frodo's loyal hobbit gardener and companion.\r\nAndy Serkis as Sméagol / Gollum: A wretched and treacherous creature who was once one of the river-folk (an extinct race of hobbits) and now guides Frodo and Sam into Mordor. The first scene in the film portrays him in his former life as Sméagol, his murder of his friend Déagol for possession of the Ring, as well as his degeneration into Gollum.\r\nBilly Boyd as Peregrin Took: Better known as Pippin, a hobbit who looks into the palantír and later becomes an esquire of Gondor.\r\nDominic Monaghan as Meriadoc Brandybuck: Better known as Merry, a cousin of Frodo's who becomes an esquire of Rohan.\r\nJohn Rhys-Davies as Gimli: A dwarf warrior and companion to Aragorn along with Legolas. Rhys-Davies also voices Treebeard: the ent leader.\r\nRhys-Davies also voices Treebeard: the ent leader.\r\nOrlando Bloom as Legolas: An elven prince of Mirkwood and skilled archer who aids Aragorn in his quest to reclaim the throne.\r\nBernard Hill as Théoden: The King of Rohan who, after triumphing at Helm's Deep, is preparing his troops for the Battle of the Pelennor Fields.\r\nMiranda Otto as Éowyn: Théoden's niece, who wishes to prove herself in battle and starts to fall in love with Aragorn, who does not return her love. In the extended cut of the film, she finds love with Faramir when they are both residing in the Houses of Healing.\r\nDavid Wenham as Faramir: A son of the Stewards of Gondor and head of the Gondorian Rangers defending Osgiliath, who seeks his father's love in vain.\r\nKarl Urban as Éomer: Éowyn's brother, who serves as Chief Marshal of the Riders of Rohan and heir to his uncle's throne.\r\nHugo Weaving as Elrond: The Lord of Rivendell who must convince Aragorn to take up the throne.\r\nLiv Tyler as Arwen: Elrond's daughter and Aragorn's true love, who gives up her immortal life for Aragorn.\r\nCate Blanchett as Galadriel: The Elven-Queen of Lothlórien who is aware the time of the elves is at an end.\r\nJohn Noble as Denethor: The corrupt Steward of Gondor and father of Boromir and Faramir, whose grief over Boromir's death and despair over Mordor's superior numbers drive him into madness during the Siege of Gondor.\r\nIan Holm as Bilbo Baggins: Frodo's elderly uncle, who has rapidly aged after giving away the Ring.\r\nSean Bean as Boromir: Faramir's older brother and a fallen companion of Aragorn, who appears in a flashback of his death at the end of The Lord of the Rings: The Fellowship of the Ring and in the extended cut when his father has a hallucination.\r\nMarton Csokas as Celeborn the Wise: The Elven-King of Lothlórien.\r\nLawrence Makoare as the Witch-king of Angmar: The lord of the Nazgûl, who leads Mordor's assault on Minas Tirith. Makoare also plays Gothmog: An Orc commander, who is voiced by Craig Parker.\r\nMakoare also plays Gothmog: An Orc commander, who is voiced by Craig Parker.\r\nThomas Robins as Déagol: Sméagol's cousin, who is killed by Sméagol, when the former finds the One Ring in the river they are fishing in.\r\nChristopher Lee as Saruman the White: An Istari wizard, formerly the head of the Istari Order and its White Council, who is now trapped by Treebeard until he is killed by his own servant, Gríma.\r\nBrad Dourif as Gríma Wormtongue: Saruman's sycophantic, treacherous servant, who is shot by Legolas after stabbing his own master.\r\nBruce Spence as the Mouth of Sauron: Sauron's ambassador at the Black Gate.\r\nThere are cameos from Peter Jackson, Richard Taylor, Gino Acevedo, Rick Porras and Andrew Lesnie on the Corsair ship, although all of them but Jackson appear only in the Extended Edition. Jackson also has another unofficial cameo, as Sam's hand stepping into view when he confronts Shelob. Sean Astin's daughter played Sam and Rosie's older daughter Elanor in the last scene of the film; in the same scene, Sarah McLeod's daughter plays their younger son. Jackson's children also cameo as Gondorian extras, while Christian Rivers played a Gondorian soldier guarding the Beacon Pippin lights, and is later seen wounded. Royd Tolkien cameos as a Ranger in Osgiliath, while in the Extended Edition Howard Shore appears as a celebrating soldier at Edoras. Additionally, four of the designers of The Lord of the Rings Strategy Battle Game are featured as Rohirrim at the Pelennor. At the end of the film, during the closing credits, each cast member gets a sketched portrait morphed with the real photograph beside their name, which were sketched by Alan Lee, an idea suggested by Ian McKellen.\r\nComparison to the source material\r\nAs with all of Peter Jackson's movie adaptions of The Lord of the Rings, many events, timelines, and geographic distances are compressed or simplified. Most major events from the books are included, though some are significantly altered. Some events and details seen in the film are not found in the books.\r\nThe film version of The Return of the King contains major scenes from the middle of Tolkien's The Two Towers, such as the attack by Shelob and the palantír subplot, as Jackson realigned events of the film to fit the timeline from the book's Appendices, rather than the interlaced order of the main narrative. However, the plot of the second half of Book III is either completely omitted (chapter \"The Road to Isengard\") or only shown in one scene (chapter \"The Voice of Saruman\"). Saruman's murder by Gríma (seen only in the Extended Edition) is moved into the Isengard visit because of the cutting of the Scouring of the Shire.\r\nThe basis of Elrond and Arwen's subplot arguing about Arwen's fate is derived from the Appendices, but it is largely extended in the film, as is Arwen and Elrond's relevance to the story.\r\nIn the film, overwhelming grief over the death of Boromir has driven Denethor to despair, and he has given up any hope of defeating Sauron before Gandalf arrives in Minas Tirith. Thus, the muster of Gondor is absent from the film. In the book, he has already ordered the lighting of the beacons before Gandalf's arrival, while he refuses to light them in the film, and the sequence where Pippin secretly lights them himself was invented for the movie. The film only hints at Denethor's use of the palantír which drives him mad, information revealed in the Pyre scene, which includes Shadowfax and is more violent than the book. Aware of the very long distance between Rath Dínen and the front of the out-thrust battlement, Jackson has Denethor jump off the Citadel in addition to burning himself on the Pyre, one of the earliest changes.\r\nThe muster of Rohan, and the subplot in which the Rohirrim are aided by the primitive Drúedain during their journey to the besieged Gondor are excised from the film. The Red Arrow brought by a messenger from Gondor to ask for Rohan's aid is absent. Éowyn's presence on the battlefield is unknown to the reader until she takes off her helmet, but in the film the audience is aware, as it would have been difficult to have Miranda Otto playing a man. When hope seems lost, Gandalf comforts Pippin by telling him of the Undying Lands, based on a descriptive passage in the book's final chapter.\r\nThe film altered the circumstances of Théoden's death; his death speech, in which he names Éomer the new king in the book, is trimmed and delivered to Éowyn instead of Merry, with an earlier scene in the Extended Edition even implying that Éowyn is next in line for the throne. Théoden's rallying speech (\"To death!\") before the initial charge in the film is spoken by Éomer in the book when he believes that both Théoden and Éowyn have been killed in combat with the Witch King.\r\nThe Extended Edition presents shortened scenes from the book's chapters in the Houses of Healing: The Warden, the talk of Athelas, the comical conversation with the herb-master, the woman Ioreth and her saying about a King's healing hands and the subsequent realising of Aragorn's true identity are left out altogether. The romance that develops between Éowyn and Faramir during their recoveries in the Houses of Healing is largely cut, presumably to keep the focus on Aragorn and Arwen; the subplot is briefly referenced in the Extended Edition, with a scene where the two hold hands.\r\nGollum's fall into the lava of Mount Doom was rewritten for the film, as the writers felt that simply having Gollum slip and fall was anticlimactic. Originally, an even greater deviation was planned: Frodo would heroically push Gollum over the ledge to destroy him and the Ring, but the production team realised that that would make it look as if Frodo was murdering Gollum. Instead, they had Frodo and Gollum struggle for possession of the Ring.\r\nIn addition to the absent footage from the film are the other major attacks by Sauron on various regions of Middle-earth, referenced only briefly in the main text of The Return of the King, and expanded upon in the Appendices; the invasion of Rohan by the Orcs of Moria, the attacks on Lothlórien and the Woodland Realm of Thranduil by the forces of Dol Guldur, and the attack on Dale and the Lonely Mountain by a force of Easterlings, events hinted at in a comment by Legolas in the book.\r\nThere are several changes in the Battle of the Black Gate: Merry is not present there in the book, Pippin does not kill a troll as he does in the novel (instead, Aragorn fights one), the eagles fight and defeat some of the mounted Nazgûl, and Aragorn kills the Mouth of Sauron in the extended edition of the film but not in the book.\r\nAlthough the film runs for another approximately 20 minutes after the climactic Downfall of Barad-dûr, many following events from the book are omitted or altered in the film. Aragorn's coronation takes place in form of a great ceremony in the Citadel of Minas Tirith, opposed to the book, where Aragorn is crowned in his tent on the Pelennor Fields before entering the city. Omitted entirely are the camp at the Field of Cormallen, Aragorn's business in Minas Tirith, Aragorn and Arwen's wedding, Galadriel and Celeborn being present at the ceremonies and their subsequent travelling along with the company, Théoden's funeral at Edoras, the complete journey back to the Shire with stops at Rivendell and Bree, and the Scouring of the Shire, which was seen by the screenwriters as anticlimactic.\r\nProduction\r\nThe production of The Lord of the Rings series was the first where three separate entries were written and shot simultaneously (excluding pick up shoots). Jackson found The Return of the King the easiest of the films to make, because it contained the climax of the story. The Return of the King was originally the second of two planned films under Miramax from January 1997 to August 1998, and more or less in its finished structure as the first film was to end with the Battle of Helm's Deep in The Two Towers. Filming took place under multiple units across New Zealand, between 11 October 1999 and 22 December 2000, with pick up shoots for six weeks in 2003 before the film's release.\r\nDesign\r\nJackson's Middle-earth was primarily designed by Alan Lee and John Howe, who had earlier illustrated editions of Tolkien's books. It was created by Weta Workshop, who handled all the trilogy's weapons, armour, miniatures, prosthetics, and creatures; the Art Department built the sets. Richard Taylor headed Weta, while Grant Major and Dan Hennah organised the planning and building.\r\nThe city of Minas Tirith, glimpsed briefly in both the previous two films, is seen fully in this film, and with it the Gondorian civilisation. The enormous soundstage was built at Dry Creek Quarry, outside Wellington, from the Helm's Deep set. That set's gate became Minas Tirith's second, while the Hornburg exterior became that of the Extended Edition's scene where Gandalf confronts the Witch-king. New structures included the 8m tall Gate, with broken and unbroken versions, with a working opening and closing mechanism, with its engravings inspired by the Baptistry of San Giovanni. There were also four levels of streets with heraldic motifs for every house, as inspired by Siena.\r\nThe Citadel's exterior was in the Stone Street Studios backlot, using forced perspective. It contained the withered White Tree, built from polystyrene by Brian Massey and the Greens Department with real branches, influenced by ancient and gnarled Lebanese olive trees. The interior was within a three-storey former factory in Wellington, its colours influenced by Charlemagne's Chapel, with a throne for Denethor carved from stone, and polystyrene statues of past kings. The Gondorian armour is designed to represent an evolution from the Númenóreans of the first film's prologue, with a simplified sea bird motif. 16th-century Italian and German armour served as inspiration, while civilians wear silver and blacks as designed by Ngila Dickson, continuing an ancient/medieval Mediterranean Basin look.\r\nMinas Morgul, the Staircase and Tower of Cirith Ungol as well as Shelob's Lair were designed by Howe, with the Morgul road using forced perspective into a bluescreened miniature. Howe's design of Minas Morgul was inspired from the experience of having a wisdom tooth pulled out: in the same way, the Orcs have put their twisted designs on to a former Gondorian city. Cirith Ungol was based on Tolkien's design, but when Richard Taylor felt it as \"boring\", it was redesigned with more tipping angles. The interior set, like Minas Tirith, was built as a few multiple levels that numerous camera takes would suggest a larger structure.\r\nThe third film introduces the enormous spider Shelob. Shelob was designed in 1999, with the body based on a tunnelweb spider and the head with numerous growths selected by Peter Jackson's children from one of many sculpts. Jackson himself took great joy in planning the sequence, being an arachnophobe himself. Shelob's Lair was inspired by sandstone and sculpted from the existing Caverns of Isengard set.\r\nThe Return of the King also brings into focus the Dead Men of Dunharrow and the evil Haradrim from the south of Middle-earth, men who ride the mûmakil. The Dead Men have a Celtic influence, as well as lines and symmetry to reflect their morbid state, while their underground city is influenced by Petra. The Haradrim were highly influenced by African culture, until Philippa Boyens expressed concern over the possibility of offensiveness, so the finished characters instead bear influence from Kiribati, in terms of weaving armour from bamboo, and the Aztecs, in use of jewellery. Also built was a single dead mûmak. Other minor cultures include the Corsairs, with an exotic, swarthy look, and the Grey Havens, Elven structures adapted to stone, with influence from J. M. W. Turner paintings.\r\nPrincipal photography\r\nThe Return of the King was shot during 2000, though Astin's coverage from Gollum's attempt to separate Frodo and Sam was filmed on 24 November 1999, when floods in Queenstown interrupted the focus on The Fellowship of the Ring. Some of the earliest scenes shot for the film were in fact shot last. Hobbiton, home of the Hobbits, was shot in January 2000 with early scenes from The Fellowship of the Ring, with the exterior shot at a Matamata farm, while interior scenes were shot at Stone Street Studios in Wellington, shared with the Grey Havens sequence. Due to the high emotions of filming the scene, the cast were in despair when they were required to shoot it three times, due to a continuity flaw in Sean Astin's costume, and then negatives producing out-of-focus reels. Also shared with the previous films was the Rivendell interior in May.\r\nThe Battle of the Black Gate was filmed in April at the Rangipo Desert, a former minefield. New Zealand soldiers were hired as extras while guides were on the lookout for unexploded mines. Also a cause for concern were Monaghan and Boyd's scale doubles during a charge sequence. In the meantime, Wood, Astin and Serkis filmed at Mount Ruapehu for the Mount Doom exteriors. In particular, they spent two hours shooting Sam lifting Frodo on to his back with cross-camera coverage.\r\nScenes shot in June were the Paths of the Dead across various locations, including Putangirua Pinnacles. In July the crew shot some Shelob scenes, and in August and September time was spent on the scenes in Isengard. Monaghan and Boyd tried numerous takes of their entrance, stressing the word \"weed\" as they smoked pipe-weed. Christopher Lee spent his part of his scene mostly alone, though McKellen and Hill arrived on the first day for a few lines to help.\r\nEdoras exteriors were shot in October. The Ride of the Rohirrim, where Théoden leads the charge into the Orc army, was filmed in Twizel with 150 extras on horseback. The Battle of the Pelennor Fields has more extensive use of computer-generated imagery, in contrast to the more extensive use of live action in the Battle of Helm's Deep in the second film. Also filmed were the attempts by Faramir to recapture Osgiliath, as were scenes in the city itself. At this point production was very hectic, with Jackson moving around ten units per day, and production finally wrapped on the Minas Tirith sets, as well as second units shooting parts of the siege. Just as the Hobbit actors' first scene was hiding from a Ringwraith under a tree, their last scene was the bluescreened reaction shot of the inhabitants of Minas Tirith bowing to them.\r\nPick-ups\r\nThe 2003 pick-ups were filmed in the Wellington studio car park, with many parts of sets and blue-screens used to finish off scenes, which the design team had to work 24 hours to get the right sets ready for a particular day. The shoot continued for two months, and became an emotional time of farewells for the cast and crew. The film has the most extensive list of re-shoots given for the trilogy. Jackson took his time to re-shoot Aragorn's coronation, rushed into a single day under second unit director Geoff Murphy on 21 December 2000. Jackson also re-shot scenes in and around Mount Doom, and Théoden's death, right after Bernard Hill was meant to wrap.\r\nThere was also the new character of Gothmog. This was a major new design addition for the film, as Jackson felt the Mordor Orcs were \"pathetic\" compared to the Uruk-hai of the second film after watching assembly cuts, and thus Weta Workshop created grotesque new \"über Orcs\" as antagonists for the audience to focus on. Christian Rivers also redesigned the Witch-king and all of his scenes were re-shot, because of confusion from non-readers over whether or not Sauron was on the battlefield.\r\nWith the positive response to Bloom, Legolas was given a fight with a mûmak, and Howard Shore also appeared in a cameo during Legolas and Gimli's drinking game at Edoras. The final scenes shot were Aragorn escaping the Skull avalanche, and Frodo finishing his book. The cast also received various props associated with their characters, although John Rhys-Davies burned his final Gimli prosthetic. Viggo Mortensen headbutted the stunt team goodbye. Pick-ups ended on 27 June 2003.\r\nScenes shot afterwards included various live-action shots of Riders for the Battle of the Pelennor Fields and a reaction shot of Serkis as Gollum finally realises Frodo intends to destroy the Ring, shot in Jackson's house. For the Extended DVD, in March 2004 Jackson created a few shots of skulls rolling over for the avalanche scene; this was the final piece of footage ever shot for the trilogy, and Jackson noted that it must be the first time a director had shot scenes for a film after it had already won the Oscar.\r\nEditing\r\nPost-production began in November 2002, with the completion of the 4½ hour assembly cut of the film that Annie Collins had been completing over 2001 and 2002, from 4-hour dailies. For example, Théoden leading the charge went from 150 minutes of takes to a finished 90 seconds. Jackson reunited with longtime collaborator Jamie Selkirk to edit the final film. Like The Two Towers, they would have to deal with multiple storylines, and Jackson paid attention to each storyline at a time before deciding where to intercut. Most importantly they spent three weeks working on the last 45 minutes of the film, for appropriate intercutting and leaving out scenes such as the Mouth of Sauron, and the fates of characters like Legolas, Gimli, Éowyn and Faramir. The film inherited scenes originally planned to go into the second film, including the reforging of Narsil, Gollum's backstory, and Saruman's exit. But the Saruman scene posed a structural problem: killing off the second film's villain when the plot has Sauron as the main villain. Despite pick-ups and dubs, the scene was cut, causing controversy with fans and Saruman actor Christopher Lee, as well as a petition to restore the scene. Lee nonetheless contributed to the DVDs and was at the Copenhagen premiere, although he said he would never understand the reason for the cut and his relationship with Jackson was chilly. They would, however, later reconcile upon Lee's casting in Jackson's Hobbit films. Jackson only had a lock on 5 out of 10 reels, and had to churn out 3 reels in 3 weeks to help finish the film. It was finally completed on 12 November 2003. Jackson never had a chance to view the film in full due to the hectic schedule, and only saw the film from beginning to end on 1 December at the Wellington premiere; according to Elijah Wood, his response was \"yup, it's good, pretty good\".\r\nVisual effects\r\nThe Return of the King contains 1,489 visual effect shots, nearly three times the number from the first film and almost twice that of the second. As with the two previous films, Jim Rygiel served as the visual effects supervisor. Visual effects work began with Alan Lee and Mark Lewis compositing various photographs of New Zealand landscape to create the digital arena of the Pelennor Fields in November 2002. Jackson and Christian Rivers used computers to plan the enormous battle up until February 2003, when the shots were shown to Weta Digital. To their astonishment, 60 planned shots had gone up to 250, and 50,000 characters were now 200,000. Nevertheless, they pressed on, soon delivering 100 shots a week, 20 a day, and as the deadline neared within the last two months, often working until 2 am.\r\nFor the battle, they recorded 450 motions for the MASSIVE digital horses (though deaths were animated), and also had to deal with late additions in the film, such as Trolls bursting through Minas Tirith's gates as well as the creatures that pull Grond to the gate, and redoing a shot of two mûmakil Éomer takes down that had originally taken six months in two days. On a similar note of digital creatures, Shelob's head sculpture was scanned by a Canadian company for 10 times more detail than Weta had previously been able to capture.\r\nLike the previous films, there are also extensive morphs between digital doubles for the actors. This time, there was Sam falling off Shelob, where the morph takes place as Astin hits the ground. Legolas attacking a mûmak required numerous transitions to and fro, and Gollum's shots of him having recovered the One Ring and falling into the Crack of Doom were fully animated. For the latter scene, as well as the scene in which Mount Doom erupts and Frodo and Sam escape from the volcano, the help of the company Next Limit Technologies and their software RealFlow was required to simulate the lava. The King of the Dead is played by an actor in prosthetics, and his head occasionally morphs to a more skull-like digital version, depending on the character's mood. The Mouth of Sauron also had his mouth enlarged 200% for unsettling effect.\r\nThe Return of the King also has practical effects. In the Pyre of Denethor sequence, as the Steward of Gondor throws Pippin out of the Tomb, John Noble threw a size double named Fon onto a prostrate Billy Boyd, who immediately pushed his head into camera to complete the illusion. A few burning torches were also reflected off a plate of glass and into the camera for when Gandalf's horse Shadowfax kicks Denethor onto the pyre. Because of Jackson's requirement for complete representation of his fantasy world, numerous miniatures were built, such as 1:72 scale miniature of Minas Tirith, which rises 7m high and is 6.5m in diameter. 1:14 scale sections of the city were also required, and the Extended Edition scene of the collapsing City of the Dead has 80,000 small skulls, amounting in total to a single cubic meter. The miniatures team concluded in November with the Black Gate, after 1000 days of shooting, and the final digital effects shot done was the Ring's destruction, on 25 November.\r\nSound effects\r\nThe Sound department spent the early part of the year searching for the right sounds. A Tasmanian devil was used to create Shelob's shriek, which in turn gave inspiration for Weta's animators, while the mûmakil is the beginning and end of a lion roar. Human screams and a donkey screech were mixed into Sauron's fall and broken glass was used for the collapsing sounds. For missile trading during Minas Tirith's siege, construction workers dropped actual 2 ton stone blocks previously lifted by a construction crane. Mixing began at a new studio on 15 August, although unfinished building work caused some annoyances. The mixers finished on 15 November, after three months of non-stop work.\r\nScore\r\nThe music was composed by Howard Shore, who previously composed the first two parts of the trilogy. Shore watched the assembly cut of the film, and had to write seven minutes of music per day to keep up with the schedule. The score sees the full introduction of the Gondor theme, originally heard during Boromir's speeches at the Council of Elrond in The Fellowship of the Ring and at Osgiliath in The Two Towers' Extended Edition. Shore also used the Gondor theme with the new ascending coda (which is unique to this film) in his score for the trailer of the film.\r\nThe score features the London Philharmonic Orchestra, London Voices, the London Oratory School Schola and featured vocal soloists. The score is the most expansive of the three: scoring effectively the entire movie length, not including additional music written for the trailer and various alternate versions released to the public. It also uses the biggest forces in the series: sections of the score call for two sets of timpani, eight trumpets (and possibly a similar increase in the size of the horn, trombone and tuba section, as well), 85 singers in the mixed choir with additional players for all-male and all-female sections, over fifty in the boy choir and many instrumentalist \"bands\" playing Celtic and eastern instruments such as tin whistle or pan flute, on stage or off of it. One piece of music required an instrument invented and crafted especially for the film: a fiddle with four pairs of strings instead of single strings.\r\nActors Billy Boyd, Viggo Mortensen and Liv Tyler also contributed to the film's music. Boyd sings on screen as Faramir charges towards Osgiliath, Mortensen sings on screen as he is crowned King, and in the Extended Edition Tyler sings as Aragorn heals Éowyn.\r\nRenée Fleming, Ben Del Maestro, Sissel Kyrkjebø and James Galway also contribute to the soundtrack as featured soloists. Fleming sings as Arwen has a vision of her son and when Gollum recovers the One Ring. Del Maestro sings when Gandalf lights his staff to save fleeing Gondorian soldiers from Osgiliath as the Nazgûl attack and as the eagles arrive at the Black Gates. Galway plays the flute and whistle as Frodo and Sam climb Mount Doom and as they return to the shire. Sissel sings \"Asea Aranion\", which was originally meant to score the Houses of Healing scene. The end title song, \"Into the West\", was composed by Shore with lyrics by Fran Walsh. Annie Lennox (formerly of Eurythmics) performed it and also received songwriting credit. The song was partially inspired by the premature death from cancer of a young New Zealand filmmaker named Cameron Duncan who had befriended Peter Jackson.\r\nRelease\r\nTheatrical\r\nAfter two years of attention and acclaim since the release of The Fellowship of the Ring, audience and critical anticipation for the final entry was extremely high. The world premiere was held in Wellington's Embassy Theatre, on 1 December 2003, and was attended by the director and many of the stars. It was estimated that over 100,000 people lined the streets, more than a quarter of the city's population.\r\nHome media\r\nThe theatrical edition of the film was released on VHS and DVD on 25 May 2004. The DVD was a 2-disc set with extras on the second disc. The theatrical DVD sets for the two previous films were released eight months after the films were released, but Return of the King's set was completed in five because it did not have to market a sequel (the previous films had to wait for footage of their sequels to become available for a ten-minute preview). However, it contained a seven-minute trailer of the entire trilogy.\r\nThe Return of the King followed the precedent set by its predecessors by releasing an Extended Edition (251 minutes) with new editing and added special effects and music, along with four commentaries and six hours of supplementary material, plus 10 minutes of fan-club credits. However, this set took longer to produce than the others because the cast and crew, no longer based in New Zealand for the trilogy, were spread all over the world working on other projects. The set was finally released on 14 December 2004 in the UK and US. The final ten minutes comprises a listing of the charter members of the official fan club who had paid for three-year charter membership.\r\nA collectors' box set was also released, which included the Extended Set plus a sculpture of Minas Tirith and a bonus 50-minute music documentary DVD, Howard Shore: Creating The Lord of the Rings Symphony: A Composer's Journey Through Middle-earth. The DVD has a DTS-ES soundtrack. The DVD also features two humorous Easter Eggs, one where Dominic Monaghan plays a German interviewer with Elijah Wood via satellite and another where Vince Vaughn and Ben Stiller attempt to convince Jackson to make a sequel, originally shown at the 2004 MTV Movie Awards. Both can be accessed via a Ring icon on the last page of both Disc 1 and 2's scene indexes. In August 2006, a Limited Edition of The Return of the King was released. This Limited Edition contains two discs; the first is a two-sided DVD containing both the Theatrical and Extended editions of the film. The second disc is a bonus disc that contains a new behind-the-scenes documentary.\r\nThe theatrical Blu-ray release was released in the United States in April 2010. The individual Blu-ray disc of The Return of the King was released in September 2010 with the same special features as the complete trilogy release, except there was no digital copy. The Extended Edition was released in the United States in June 2011. It has a runtime of 263 minutes.\r\nThe Return of the King was released in Ultra HD Blu-ray on 30 November 2020 in the United Kingdom and on 1 December 2020 in the United States, along with the other films of the trilogy, including both the theatrical and the extended editions of the films.\r\nReception\r\nBox office\r\nThe Return of the King earned $377,027,325 in the United States and Canada and $763,654,686 in other countries for a worldwide total of $1,147,633,833. In the weekend of February 20–22 of 2004, the film crossed the $1 billion mark, making it the second film in history to do so, after Titanic in 1998. Worldwide, it is the 27th highest-grossing film of all time when not adjusted for inflation, the highest-grossing film of 2003, the second highest-grossing film of the 2000s, the highest-grossing entry in The Lord of the Rings trilogy, and the highest-grossing film ever to be released by New Line Cinema. It held the record as Time Warner's highest-grossing film worldwide for eight years until it was surpassed by Harry Potter and the Deathly Hallows – Part 2 in 2011. Box Office Mojo estimates that the film had sold over 61 million tickets in the US in its initial theatrical run.\r\nIn the US and Canada, it is the 27th highest-grossing film, the highest-grossing 2003 film, and the highest-grossing entry in The Lord of the Rings trilogy. The film set an opening Wednesday record with $34,450,834. This record was first surpassed by Spider-Man 2 in 2004 and ranks as the seventh largest Wednesday opening. Additionally, it was ranked as the highest December opening day, holding that record for less than a decade before getting dethroned by The Hobbit: An Unexpected Journey in 2012. The film opened a day earlier for a midnight showing and accounted for about $8 million. This was nearly twice the first-day total of The Fellowship of the Ring — which earned $18.2 million on its opening day in 2001 — as well as a significant increase over The Two Towers — which earned $26.1 million on its debut in 2002. Part of the grosses came from the Trilogy Tuesday event, in which the Extended Editions of the two previous films were played on 16 December before the first midnight screening. For two years, The Return of the King would hold the record for having the highest midnight screenings gross until 2005 when it was given to Star Wars: Episode III – Revenge of the Sith. The film went on to make an opening weekend of $72,629,713, making it the second-highest opening weekend for a New Line Cinema film, behind Austin Powers in Goldmember. In addition, it had the third largest opening weekend of that year, after The Matrix Reloaded and X2. With a total gross of $125.1 million, the film had the biggest five-day Wednesday opening of all time, surpassing the previous record held by Star Wars: Episode I – The Phantom Menace. The next year, this record would be beaten by Shrek 2. Its Friday-Sunday opening weekend was a record-high for December (first surpassed by I Am Legend). The film also set single-day records for Christmas Day and New Year's Day (both first surpassed by Meet the Fockers).\r\nOutside the US and Canada, it is the 17th highest-grossing film, the highest-grossing 2003 film and the highest-grossing film of the series. On its first day (Wednesday, 17 December 2003), the film earned $23.5 million from 19 countries and it set an opening-weekend record outside the US and Canada with $125.9 million during the five-day weekend as a whole. The combined total gross increased to $250.1 million, making it the highest worldwide opening weekend at the time, knocking out The Matrix Revolutions. It set opening-day records in thirteen of them, including the United Kingdom, Germany, Austria, Belgium, the Netherlands, Spain, Greece, Switzerland, Scandinavia (as well as separately in Sweden, Finland, Norway and Denmark), Mexico, Chile and Puerto Rico. It set opening-weekend records in the United Kingdom ($26.5 million in five days), Germany, Spain, Sweden, Denmark and Switzerland. In Singapore, it surpassed Finding Nemo to become the country's top-grossing film. In New Zealand, where filming took place, the film set opening day, opening weekend, single-day, Friday gross, Saturday gross and Sunday gross records with $1.7 million in four days.\r\nThe substantial increase in initial box office totals caused optimistic studio executives to forecast that The Return of the King would surpass The Two Towers in total earnings. If this proved to be true, then this would be the first blockbuster trilogy for each successive film to earn more at the box office than its predecessor, when all three films were blockbuster successes. The Return of the King has helped The Lord of the Rings franchise to become the highest-grossing motion picture trilogy worldwide of all time with over $2.9 billion beating other notable series such as the original Star Wars Trilogy, and became New Line's highest grossing release.\r\nThrough re-releases in 2005, 2011, 2017, 2020 and 2021, the film has grossed an additional $818,580 in the United States and Canada, and $4,530,321 overseas for a combined total of $5,348,901. This brings overall earnings to $377,845,905 domestic and $768,185,005 international for a worldwide total of $1,146,030,912.\r\nThese figures do not include income from DVD sales, TV rights, etc. It has been estimated that the gross income from non-box office sales and merchandise has been at least equal to the box office for all three films. If this is so, the total gross income for the trilogy would be in the region of $6 billion following an investment of $300 million ($426 million including marketing costs).\r\nCritical response\r\nOn the review aggregator website Rotten Tomatoes, The Return of the King holds an approval rating of 93% based on 275 reviews, with an average rating of 8.70/10. The website's critics consensus reads, \"Visually breathtaking and emotionally powerful, The Lord of the Rings - The Return of the King is a moving and satisfying conclusion to a great trilogy.\" Metacritic, which uses a weighted average, gives the film a score of 94 out of 100 based on 41 reviews, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale, the highest grade in the trilogy.\r\nLike its two predecessors, The Return of the King was released to universal critical acclaim. Alan Morrison of Empire gave the film a perfect score of five stars. In his review, he called the film \"the resounding climax to a landmark in cinema history\" and praised how Peter Jackson had \"kept the momentum of the series rolling on and on through the traditionally 'difficult' middle part and 'weak' finale, delivering a climax to the story that's neater and more affecting than what Tolkien managed on the printed page.\" Morrison also mentioned how fans of the films \"who have walked beside these heroes every step of the way on such a long journey deserve the emotional pay-off as well as the action peaks, and they will be genuinely touched as the final credits roll.\" Elvis Mitchell for The New York Times lauded the acting, the craft of the technical crew, and Jackson's direction, describing The Return of the King as \"a meticulous and prodigious vision made by a director who was not hamstrung by heavy use of computer special-effects imagery.\" Roger Ebert of the Chicago Sun-Times gave the film three and a half stars out of four, saying that it is \"such a crowning achievement, such a visionary use of all the tools of special effects, such a pure spectacle, that it can be enjoyed even by those who have not seen the first two films.\" Talking about the whole trilogy, Ebert said that he admired it \"more as a whole than in its parts\", and that The Return of the King certified The Lord of the Rings as \"a work of bold ambition in a time of cinematic timidity\". In his review for The Times, James Christopher praised The Return of the King as \"everything a Ring fan could possibly wish for, and much more\", and described The Lord of the Rings as \"the greatest film trilogy ever mounted, with some of the most amazing action sequences committed to celluloid\". Nev Pierce for the BBC gave the film five stars out of five, judging it to be the best chapter of the trilogy, since it combined \"the 'ooh' factor of Fellowship with the zippy action of Towers\". Pierce described The Return of the King as \"Majestic, moving, and immense\", and \"an astonishing piece of storytelling\". Philip French, reviewing it for The Observer, lauded the narrative force, the battle scenes, the language, and the visual style of the film, which he related to \"the swirling battle paintings of Albrecht Altdorfer\" and \"Claude Lorraine's elegiac paintings of maritime departures inspired by classical poets.\" French wrote about the whole trilogy \"Jackson's Lord of the Rings is indeed a very fine achievement, moving, involving and, to many people, even inspiring. It redeems the debased cinematic notion of the epic.\"\r\nIn her review for Entertainment Weekly, Lisa Schwarzbaum gave the film an A grade, and wrote \"The conclusion of Peter Jackson's masterwork is passionate and literate, detailed and expansive, and it's conceived with a risk-taking flair for old-fashioned movie magic at its most precious ... as he has done throughout, the director paces scenes of action, intimacy, and even panoramic, geographical grandeur ... with the control of a superb choreographer.\". Schwarzbaum also said of the whole series \"I can't think of another film trilogy that ends in such glory, or another monumental work of sustained storytelling that surges ahead with so much inventiveness and ardor.\" Richard Corliss of Time named The Return of the King the best film of the year and described the whole trilogy as \"The film event of the millennium\". Joe Morgenstern, for The Wall Street Journal, wrote \"Never has a filmmaker aimed higher, or achieved more. The third and last installment of the screen epic based on J.R.R. Tolkien's literary classic redefines -- steeply upward -- the very notion of a major motion picture.\" Peter Bradshaw, who had been less enthusiastic about the first two chapters of the trilogy, gave The Return of the King four stars out of five in his review for The Guardian, commenting \"I started the series an atheist and finished an agnostic\". Bradshaw wrote of the film \"Technically it really is superb\", and commented \"Hours after watching the film, I can close my eyes and see those incredible battle scenes pulsing and throbbing in my skull ... Maybe Kurosawa's battles will one day be described as proto-Jacksonian\".\r\nThe most common criticism of The Lord of the Rings: The Return of the King was its running time, particularly the epilogue; even rave reviews for the film commented on its length. Joel Siegel of Good Morning America said in his review for the film (which he gave an 'A'): \"If it didn't take forty-five minutes to end, it'd be my best picture of the year. As it is, it's just one of the great achievements in film history.\"\r\nIn February 2004, a few months following release, the film was voted eighth on Empire's 100 Greatest Movies of All Time, compiled from readers' top ten lists. This forced the magazine to abandon its policy of only allowing films being older than a year to be eligible. In 2007, Total Film named The Return of the King the third best film of the past decade (Total Film's publication time), behind The Matrix and Fight Club.\r\nAccolades\r\nThe film was nominated for eleven Academy Awards: Best Picture, Best Director, Best Adapted Screenplay, Best Original Score, Best Original Song, Best Visual Effects, Best Art Direction, Best Costume Design, Best Make-up, Best Sound Mixing and Best Film Editing. At the 76th Academy Awards in 2004, the film won all the categories for which it was nominated and it holds the record for highest Academy Award totals along with Titanic (which also starred Bernard Hill) and Ben-Hur, and also holding the record for the highest clean sweep at the Oscars, surpassing the nine awards earned by both Gigi and The Last Emperor. It was the first fantasy film to win the Academy Award for Best Picture. It also was the last movie for 14 years to win the Academy Award for Best Picture without being chosen as one of the top ten films of the year by the National Board of Review, until the release of The Shape of Water in 2017.\r\nThe film also won four Golden Globes (including Best Picture for Drama and Best Director), five BAFTAs, two MTV Movie Awards, two Grammy Awards, nine Saturn Awards, the New York Film Critics Circle award for Best Picture, the Nebula Award for Best Script, and the Hugo Award for Best Dramatic Presentation, Long Form.",
    "html": "<p>The Lord of the Rings: The Return of the King is a 2003 epic fantasy adventure film directed by Peter Jackson from a screenplay by Fran Walsh, Philippa Boyens, and Jackson. It is based on 1955's The Return of the King, the third volume of the novel The Lord of the Rings by J. R. R. Tolkien. The sequel to 2002's The Lord of the Rings: The Two Towers, the film is the final instalment in The Lord of the Rings trilogy. It features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Bernard Hill, Billy Boyd, Dominic Monaghan, Orlando Bloom, Hugo Weaving, Miranda Otto, David Wenham, Karl Urban, John Noble, Andy Serkis, Ian Holm, and Sean Bean. Continuing the plot of the previous film, Frodo, Sam and Gollum are making their final way toward Mount Doom to destroy the One Ring, unaware of Gollum's true intentions, while Merry, Pippin, Gandalf, Aragorn, Legolas, Gimli and the others join forces together against Sauron and his legions in Minas Tirith.</p><p>The Return of the King was financed and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy. It premiered on 1 December 2003 at the Embassy Theatre in Wellington, and was then released on 17 December 2003 in the US and on 18 December 2003 in New Zealand. The film was acclaimed by both critics and audiences, who considered it to be a landmark in filmmaking and the fantasy film genre, and a satisfying conclusion to the trilogy, with praise for the visual effects, performances, action sequences, direction, screenplay, musical score, costume design, emotional depth and scope. It grossed over $1.1 billion worldwide, making it the highest-grossing film of 2003 and the second highest-grossing film of all time at the time of release, as well as the highest-grossing film ever released by New Line Cinema.</p><p>Like the previous films in the trilogy, The Return of the King is widely recognised as one of the greatest and most influential films ever made. The film received numerous accolades; at the 76th Academy Awards, it won all eleven awards for which it was nominated, including Best Picture, the first fantasy film to do so and tying with 1959's Ben-Hur and 1997's Titanic as the movie with the most Academy Award wins. It also became the second film series whose entries have all won Best Visual Effects, after the original Star Wars trilogy.</p><br/><h3>Plot</h3><p>The hobbit, Sméagol, is fishing with his cousin Déagol, who discovers the One Ring in the river. Sméagol's mind is ensnared by the Ring, and he kills his cousin for it. Increasingly corrupted physically and mentally, he retreats into the Misty Mountains and becomes known as Gollum.</p><p>Centuries later, during the War of the Ring, Gandalf leads Aragorn, Legolas, Gimli, and King Théoden of Rohan to Isengard, where they reunite with Merry and Pippin. Gandalf retrieves Saruman's palantír, and the group returns to Edoras to celebrate their victory at Helm's Deep. Pippin looks into the palantír, seeing Sauron and a burning tree. Gandalf deduces that the enemy plans to attack Gondor's capital Minas Tirith; he rides there to warn Gondor's steward Denethor. Pippin, who accompanies him, swears fealty to Denethor, whose now-dead heir Boromir had saved his life; on Gandalf's instruction, Pippin triggers the lighting of the beacons, which call for help from Rohan.</p><p>Frodo, who carries the Ring, and Sam continue their journey towards Mordor, unaware that Gollum, now their guide, plans to betray them and take the Ring for himself. The trio witnessed the Witch-king of Angmar, lord of the nine Nazgûl, setting off towards Gondor with his army of Orcs. Gollum conspires to frame Sam for eating food supplies and desiring the Ring; influenced by the growing power of the Ring, Frodo is taken in by the deception, and orders Sam to go home. Gollum then tricks Frodo into venturing into the lair of the giant spider Shelob. Frodo narrowly escapes and confronts Gollum, who falls down a chasm after a scuffle. Shelob discovers, paralyses, and binds Frodo, but is wounded and driven away by a returning Sam, who, mourning Frodo's apparent death, takes the Ring. Sam realises his mistake when a group of Orcs takes Frodo captive but manages to rescue Frodo as the Orcs fight among themselves. Now inside Mordor, the hobbits continue towards Mount Doom, their destination.</p><p>As King Théoden gathers his army, Elrond tells Aragorn that Arwen is dying, having refused to leave Middle-earth. Elrond gives Aragorn Andúril, reforged from the shards of King Elendil's sword Narsil, and urges him to commit to claiming Gondor's throne, to which he is the heir. Joined by Legolas and Gimli, Aragorn travels the Paths of the Dead, and pledges to release the ghosts there from their curse should they come to Gondor's aid. Meanwhile, Faramir, who was earlier overwhelmed and driven back to Minas Tirith by the Witch-king, is gravely wounded in a suicide charge; believing his son to be dead, Denethor falls into madness. Gandalf marshals the defenders, but the huge Orc army breaks into the city. Denethor attempts to burn himself and Faramir on a pyre, but Pippin alerts Gandalf and they rescue Faramir. Denethor, set ablaze and in agony, jumps to his death.</p><p>Théoden arrives and leads his army against the Orcs. Despite initial success against Orcs in the ensuing battle, they are decimated by the Oliphaunt-riding Haradrim and the Witch-king mortally wounds Théoden; however, his niece Éowyn slays the Witch-king with Merry's help. Théoden dies in his niece's arms. Aragorn then arrives with his Army of the Dead, who overcome Sauron's forces. Their oath is fulfilled, and the Dead are released from their curse. Aragorn decides to march on Mordor to distract Sauron from Frodo, now extremely weak, and Sam; all of Sauron's remaining forces march to meet Aragorn's diversion, allowing the hobbits to reach Mount Doom. Gollum, who survived his earlier fall, attacks them, but Frodo still manages to enter the mountain. There, he succumbs to the Ring's power, putting it on his finger, but Gollum manages to bite off his finger and reclaim it. They struggle together and both fall off the ledge. Frodo clings to it with one hand as remorse and guilt flood his mind in the wake of his succumbing to the ring when Sam's unwavering faith and belief in his friend convinces him to make one final reach for Sam's hand, saving Frodo's life. Gollum falls and dies; the Ring, which fell with him, disintegrates in the lava, causing Barad-dûr to crumble as The Eye of Sauron explodes, destroying the dark lord once and for all. Aragorn's army emerges victorious as its enemies and the lands of Mordor collapse into the earth, and Mount Doom erupts, with Frodo and Sam narrowly escaping the lava.</p><p>Gandalf rescues the hobbits with the help of eagles, and the surviving Fellowship is happily reunited in Minas Tirith. Aragorn is crowned King of Gondor and marries Arwen. The Hobbits return home to the Shire, where Sam marries Rosie Cotton. Four years later, Frodo, whose wound inflicted by the Nazgûl refuses to heal and suffering from trauma, departs Middle-earth for the Undying Lands with his uncle Bilbo, Gandalf, and the Elves. He leaves Sam the Red Book of Westmarch, which details their adventures. Sam returns to the Shire, where he embraces Rosie and their children.</p><br/><h3>Cast</h3><p>Like the preceding films in the trilogy, The Return of the King has an ensemble cast, and some of the cast and their respective characters include:</p><ul><li>Elijah Wood as Frodo Baggins: A young hobbit who continues his quest to destroy the Ring, which continues to torture him.</li><li>Ian McKellen as Gandalf the White: An Istari wizard who travels to aid the Men of Gondor, acting as a general at the Siege of Gondor.</li><li>Viggo Mortensen as Aragorn: A Dúnedain ranger who must finally face his destiny as King of Gondor.</li><li>Sean Astin as Samwise Gamgee: Better known as Sam, Frodo's loyal hobbit gardener and companion.</li><li>Andy Serkis as Sméagol / Gollum: A wretched and treacherous creature who was once one of the river-folk (an extinct race of hobbits) and now guides Frodo and Sam into Mordor. The first scene in the film portrays him in his former life as Sméagol, his murder of his friend Déagol for possession of the Ring, as well as his degeneration into Gollum.</li><li>Billy Boyd as Peregrin Took: Better known as Pippin, a hobbit who looks into the palantír and later becomes an esquire of Gondor.</li><li>Dominic Monaghan as Meriadoc Brandybuck: Better known as Merry, a cousin of Frodo's who becomes an esquire of Rohan.</li><li>John Rhys-Davies as Gimli: A dwarf warrior and companion to Aragorn along with Legolas. Rhys-Davies also voices Treebeard: the ent leader.</li><li>Rhys-Davies also voices Treebeard: the ent leader.</li><li>Orlando Bloom as Legolas: An elven prince of Mirkwood and skilled archer who aids Aragorn in his quest to reclaim the throne.</li><li>Bernard Hill as Théoden: The King of Rohan who, after triumphing at Helm's Deep, is preparing his troops for the Battle of the Pelennor Fields.</li><li>Miranda Otto as Éowyn: Théoden's niece, who wishes to prove herself in battle and starts to fall in love with Aragorn, who does not return her love. In the extended cut of the film, she finds love with Faramir when they are both residing in the Houses of Healing.</li><li>David Wenham as Faramir: A son of the Stewards of Gondor and head of the Gondorian Rangers defending Osgiliath, who seeks his father's love in vain.</li><li>Karl Urban as Éomer: Éowyn's brother, who serves as Chief Marshal of the Riders of Rohan and heir to his uncle's throne.</li><li>Hugo Weaving as Elrond: The Lord of Rivendell who must convince Aragorn to take up the throne.</li><li>Liv Tyler as Arwen: Elrond's daughter and Aragorn's true love, who gives up her immortal life for Aragorn.</li><li>Cate Blanchett as Galadriel: The Elven-Queen of Lothlórien who is aware the time of the elves is at an end.</li><li>John Noble as Denethor: The corrupt Steward of Gondor and father of Boromir and Faramir, whose grief over Boromir's death and despair over Mordor's superior numbers drive him into madness during the Siege of Gondor.</li><li>Ian Holm as Bilbo Baggins: Frodo's elderly uncle, who has rapidly aged after giving away the Ring.</li><li>Sean Bean as Boromir: Faramir's older brother and a fallen companion of Aragorn, who appears in a flashback of his death at the end of The Lord of the Rings: The Fellowship of the Ring and in the extended cut when his father has a hallucination.</li><li>Marton Csokas as Celeborn the Wise: The Elven-King of Lothlórien.</li><li>Lawrence Makoare as the Witch-king of Angmar: The lord of the Nazgûl, who leads Mordor's assault on Minas Tirith. Makoare also plays Gothmog: An Orc commander, who is voiced by Craig Parker.</li><li>Makoare also plays Gothmog: An Orc commander, who is voiced by Craig Parker.</li><li>Thomas Robins as Déagol: Sméagol's cousin, who is killed by Sméagol, when the former finds the One Ring in the river they are fishing in.</li></ul><ul><li>Christopher Lee as Saruman the White: An Istari wizard, formerly the head of the Istari Order and its White Council, who is now trapped by Treebeard until he is killed by his own servant, Gríma.</li><li>Brad Dourif as Gríma Wormtongue: Saruman's sycophantic, treacherous servant, who is shot by Legolas after stabbing his own master.</li><li>Bruce Spence as the Mouth of Sauron: Sauron's ambassador at the Black Gate.</li></ul><p>There are cameos from Peter Jackson, Richard Taylor, Gino Acevedo, Rick Porras and Andrew Lesnie on the Corsair ship, although all of them but Jackson appear only in the Extended Edition. Jackson also has another unofficial cameo, as Sam's hand stepping into view when he confronts Shelob. Sean Astin's daughter played Sam and Rosie's older daughter Elanor in the last scene of the film; in the same scene, Sarah McLeod's daughter plays their younger son. Jackson's children also cameo as Gondorian extras, while Christian Rivers played a Gondorian soldier guarding the Beacon Pippin lights, and is later seen wounded. Royd Tolkien cameos as a Ranger in Osgiliath, while in the Extended Edition Howard Shore appears as a celebrating soldier at Edoras. Additionally, four of the designers of The Lord of the Rings Strategy Battle Game are featured as Rohirrim at the Pelennor. At the end of the film, during the closing credits, each cast member gets a sketched portrait morphed with the real photograph beside their name, which were sketched by Alan Lee, an idea suggested by Ian McKellen.</p><br/><h3>Comparison to the source material</h3><p>As with all of Peter Jackson's movie adaptions of The Lord of the Rings, many events, timelines, and geographic distances are compressed or simplified. Most major events from the books are included, though some are significantly altered. Some events and details seen in the film are not found in the books.</p><p>The film version of The Return of the King contains major scenes from the middle of Tolkien's The Two Towers, such as the attack by Shelob and the palantír subplot, as Jackson realigned events of the film to fit the timeline from the book's Appendices, rather than the interlaced order of the main narrative. However, the plot of the second half of Book III is either completely omitted (chapter \"The Road to Isengard\") or only shown in one scene (chapter \"The Voice of Saruman\"). Saruman's murder by Gríma (seen only in the Extended Edition) is moved into the Isengard visit because of the cutting of the Scouring of the Shire.</p><p>The basis of Elrond and Arwen's subplot arguing about Arwen's fate is derived from the Appendices, but it is largely extended in the film, as is Arwen and Elrond's relevance to the story.</p><p>In the film, overwhelming grief over the death of Boromir has driven Denethor to despair, and he has given up any hope of defeating Sauron before Gandalf arrives in Minas Tirith. Thus, the muster of Gondor is absent from the film. In the book, he has already ordered the lighting of the beacons before Gandalf's arrival, while he refuses to light them in the film, and the sequence where Pippin secretly lights them himself was invented for the movie. The film only hints at Denethor's use of the palantír which drives him mad, information revealed in the Pyre scene, which includes Shadowfax and is more violent than the book. Aware of the very long distance between Rath Dínen and the front of the out-thrust battlement, Jackson has Denethor jump off the Citadel in addition to burning himself on the Pyre, one of the earliest changes.</p><p>The muster of Rohan, and the subplot in which the Rohirrim are aided by the primitive Drúedain during their journey to the besieged Gondor are excised from the film. The Red Arrow brought by a messenger from Gondor to ask for Rohan's aid is absent. Éowyn's presence on the battlefield is unknown to the reader until she takes off her helmet, but in the film the audience is aware, as it would have been difficult to have Miranda Otto playing a man. When hope seems lost, Gandalf comforts Pippin by telling him of the Undying Lands, based on a descriptive passage in the book's final chapter.</p><p>The film altered the circumstances of Théoden's death; his death speech, in which he names Éomer the new king in the book, is trimmed and delivered to Éowyn instead of Merry, with an earlier scene in the Extended Edition even implying that Éowyn is next in line for the throne. Théoden's rallying speech (\"To death!\") before the initial charge in the film is spoken by Éomer in the book when he believes that both Théoden and Éowyn have been killed in combat with the Witch King.</p><p>The Extended Edition presents shortened scenes from the book's chapters in the Houses of Healing: The Warden, the talk of Athelas, the comical conversation with the herb-master, the woman Ioreth and her saying about a King's healing hands and the subsequent realising of Aragorn's true identity are left out altogether. The romance that develops between Éowyn and Faramir during their recoveries in the Houses of Healing is largely cut, presumably to keep the focus on Aragorn and Arwen; the subplot is briefly referenced in the Extended Edition, with a scene where the two hold hands.</p><p>Gollum's fall into the lava of Mount Doom was rewritten for the film, as the writers felt that simply having Gollum slip and fall was anticlimactic. Originally, an even greater deviation was planned: Frodo would heroically push Gollum over the ledge to destroy him and the Ring, but the production team realised that that would make it look as if Frodo was murdering Gollum. Instead, they had Frodo and Gollum struggle for possession of the Ring.</p><p>In addition to the absent footage from the film are the other major attacks by Sauron on various regions of Middle-earth, referenced only briefly in the main text of The Return of the King, and expanded upon in the Appendices; the invasion of Rohan by the Orcs of Moria, the attacks on Lothlórien and the Woodland Realm of Thranduil by the forces of Dol Guldur, and the attack on Dale and the Lonely Mountain by a force of Easterlings, events hinted at in a comment by Legolas in the book.</p><p>There are several changes in the Battle of the Black Gate: Merry is not present there in the book, Pippin does not kill a troll as he does in the novel (instead, Aragorn fights one), the eagles fight and defeat some of the mounted Nazgûl, and Aragorn kills the Mouth of Sauron in the extended edition of the film but not in the book.</p><p>Although the film runs for another approximately 20 minutes after the climactic Downfall of Barad-dûr, many following events from the book are omitted or altered in the film. Aragorn's coronation takes place in form of a great ceremony in the Citadel of Minas Tirith, opposed to the book, where Aragorn is crowned in his tent on the Pelennor Fields before entering the city. Omitted entirely are the camp at the Field of Cormallen, Aragorn's business in Minas Tirith, Aragorn and Arwen's wedding, Galadriel and Celeborn being present at the ceremonies and their subsequent travelling along with the company, Théoden's funeral at Edoras, the complete journey back to the Shire with stops at Rivendell and Bree, and the Scouring of the Shire, which was seen by the screenwriters as anticlimactic.</p><br/><h3>Production</h3><p>The production of The Lord of the Rings series was the first where three separate entries were written and shot simultaneously (excluding pick up shoots). Jackson found The Return of the King the easiest of the films to make, because it contained the climax of the story. The Return of the King was originally the second of two planned films under Miramax from January 1997 to August 1998, and more or less in its finished structure as the first film was to end with the Battle of Helm's Deep in The Two Towers. Filming took place under multiple units across New Zealand, between 11 October 1999 and 22 December 2000, with pick up shoots for six weeks in 2003 before the film's release.</p><h4>Design</h4><p>Jackson's Middle-earth was primarily designed by Alan Lee and John Howe, who had earlier illustrated editions of Tolkien's books. It was created by Weta Workshop, who handled all the trilogy's weapons, armour, miniatures, prosthetics, and creatures; the Art Department built the sets. Richard Taylor headed Weta, while Grant Major and Dan Hennah organised the planning and building.</p><p>The city of Minas Tirith, glimpsed briefly in both the previous two films, is seen fully in this film, and with it the Gondorian civilisation. The enormous soundstage was built at Dry Creek Quarry, outside Wellington, from the Helm's Deep set. That set's gate became Minas Tirith's second, while the Hornburg exterior became that of the Extended Edition's scene where Gandalf confronts the Witch-king. New structures included the 8m tall Gate, with broken and unbroken versions, with a working opening and closing mechanism, with its engravings inspired by the Baptistry of San Giovanni. There were also four levels of streets with heraldic motifs for every house, as inspired by Siena.</p><p>The Citadel's exterior was in the Stone Street Studios backlot, using forced perspective. It contained the withered White Tree, built from polystyrene by Brian Massey and the Greens Department with real branches, influenced by ancient and gnarled Lebanese olive trees. The interior was within a three-storey former factory in Wellington, its colours influenced by Charlemagne's Chapel, with a throne for Denethor carved from stone, and polystyrene statues of past kings. The Gondorian armour is designed to represent an evolution from the Númenóreans of the first film's prologue, with a simplified sea bird motif. 16th-century Italian and German armour served as inspiration, while civilians wear silver and blacks as designed by Ngila Dickson, continuing an ancient/medieval Mediterranean Basin look.</p><p>Minas Morgul, the Staircase and Tower of Cirith Ungol as well as Shelob's Lair were designed by Howe, with the Morgul road using forced perspective into a bluescreened miniature. Howe's design of Minas Morgul was inspired from the experience of having a wisdom tooth pulled out: in the same way, the Orcs have put their twisted designs on to a former Gondorian city. Cirith Ungol was based on Tolkien's design, but when Richard Taylor felt it as \"boring\", it was redesigned with more tipping angles. The interior set, like Minas Tirith, was built as a few multiple levels that numerous camera takes would suggest a larger structure.</p><p>The third film introduces the enormous spider Shelob. Shelob was designed in 1999, with the body based on a tunnelweb spider and the head with numerous growths selected by Peter Jackson's children from one of many sculpts. Jackson himself took great joy in planning the sequence, being an arachnophobe himself. Shelob's Lair was inspired by sandstone and sculpted from the existing Caverns of Isengard set.</p><p>The Return of the King also brings into focus the Dead Men of Dunharrow and the evil Haradrim from the south of Middle-earth, men who ride the mûmakil. The Dead Men have a Celtic influence, as well as lines and symmetry to reflect their morbid state, while their underground city is influenced by Petra. The Haradrim were highly influenced by African culture, until Philippa Boyens expressed concern over the possibility of offensiveness, so the finished characters instead bear influence from Kiribati, in terms of weaving armour from bamboo, and the Aztecs, in use of jewellery. Also built was a single dead mûmak. Other minor cultures include the Corsairs, with an exotic, swarthy look, and the Grey Havens, Elven structures adapted to stone, with influence from J. M. W. Turner paintings.</p><h4>Principal photography</h4><p>The Return of the King was shot during 2000, though Astin's coverage from Gollum's attempt to separate Frodo and Sam was filmed on 24 November 1999, when floods in Queenstown interrupted the focus on The Fellowship of the Ring. Some of the earliest scenes shot for the film were in fact shot last. Hobbiton, home of the Hobbits, was shot in January 2000 with early scenes from The Fellowship of the Ring, with the exterior shot at a Matamata farm, while interior scenes were shot at Stone Street Studios in Wellington, shared with the Grey Havens sequence. Due to the high emotions of filming the scene, the cast were in despair when they were required to shoot it three times, due to a continuity flaw in Sean Astin's costume, and then negatives producing out-of-focus reels. Also shared with the previous films was the Rivendell interior in May.</p><p>The Battle of the Black Gate was filmed in April at the Rangipo Desert, a former minefield. New Zealand soldiers were hired as extras while guides were on the lookout for unexploded mines. Also a cause for concern were Monaghan and Boyd's scale doubles during a charge sequence. In the meantime, Wood, Astin and Serkis filmed at Mount Ruapehu for the Mount Doom exteriors. In particular, they spent two hours shooting Sam lifting Frodo on to his back with cross-camera coverage.</p><p>Scenes shot in June were the Paths of the Dead across various locations, including Putangirua Pinnacles. In July the crew shot some Shelob scenes, and in August and September time was spent on the scenes in Isengard. Monaghan and Boyd tried numerous takes of their entrance, stressing the word \"weed\" as they smoked pipe-weed. Christopher Lee spent his part of his scene mostly alone, though McKellen and Hill arrived on the first day for a few lines to help.</p><p>Edoras exteriors were shot in October. The Ride of the Rohirrim, where Théoden leads the charge into the Orc army, was filmed in Twizel with 150 extras on horseback. The Battle of the Pelennor Fields has more extensive use of computer-generated imagery, in contrast to the more extensive use of live action in the Battle of Helm's Deep in the second film. Also filmed were the attempts by Faramir to recapture Osgiliath, as were scenes in the city itself. At this point production was very hectic, with Jackson moving around ten units per day, and production finally wrapped on the Minas Tirith sets, as well as second units shooting parts of the siege. Just as the Hobbit actors' first scene was hiding from a Ringwraith under a tree, their last scene was the bluescreened reaction shot of the inhabitants of Minas Tirith bowing to them.</p><h4>Pick-ups</h4><p>The 2003 pick-ups were filmed in the Wellington studio car park, with many parts of sets and blue-screens used to finish off scenes, which the design team had to work 24 hours to get the right sets ready for a particular day. The shoot continued for two months, and became an emotional time of farewells for the cast and crew. The film has the most extensive list of re-shoots given for the trilogy. Jackson took his time to re-shoot Aragorn's coronation, rushed into a single day under second unit director Geoff Murphy on 21 December 2000. Jackson also re-shot scenes in and around Mount Doom, and Théoden's death, right after Bernard Hill was meant to wrap.</p><p>There was also the new character of Gothmog. This was a major new design addition for the film, as Jackson felt the Mordor Orcs were \"pathetic\" compared to the Uruk-hai of the second film after watching assembly cuts, and thus Weta Workshop created grotesque new \"über Orcs\" as antagonists for the audience to focus on. Christian Rivers also redesigned the Witch-king and all of his scenes were re-shot, because of confusion from non-readers over whether or not Sauron was on the battlefield.</p><p>With the positive response to Bloom, Legolas was given a fight with a mûmak, and Howard Shore also appeared in a cameo during Legolas and Gimli's drinking game at Edoras. The final scenes shot were Aragorn escaping the Skull avalanche, and Frodo finishing his book. The cast also received various props associated with their characters, although John Rhys-Davies burned his final Gimli prosthetic. Viggo Mortensen headbutted the stunt team goodbye. Pick-ups ended on 27 June 2003.</p><p>Scenes shot afterwards included various live-action shots of Riders for the Battle of the Pelennor Fields and a reaction shot of Serkis as Gollum finally realises Frodo intends to destroy the Ring, shot in Jackson's house. For the Extended DVD, in March 2004 Jackson created a few shots of skulls rolling over for the avalanche scene; this was the final piece of footage ever shot for the trilogy, and Jackson noted that it must be the first time a director had shot scenes for a film after it had already won the Oscar.</p><h4>Editing</h4><p>Post-production began in November 2002, with the completion of the 4½ hour assembly cut of the film that Annie Collins had been completing over 2001 and 2002, from 4-hour dailies. For example, Théoden leading the charge went from 150 minutes of takes to a finished 90 seconds. Jackson reunited with longtime collaborator Jamie Selkirk to edit the final film. Like The Two Towers, they would have to deal with multiple storylines, and Jackson paid attention to each storyline at a time before deciding where to intercut. Most importantly they spent three weeks working on the last 45 minutes of the film, for appropriate intercutting and leaving out scenes such as the Mouth of Sauron, and the fates of characters like Legolas, Gimli, Éowyn and Faramir. The film inherited scenes originally planned to go into the second film, including the reforging of Narsil, Gollum's backstory, and Saruman's exit. But the Saruman scene posed a structural problem: killing off the second film's villain when the plot has Sauron as the main villain. Despite pick-ups and dubs, the scene was cut, causing controversy with fans and Saruman actor Christopher Lee, as well as a petition to restore the scene. Lee nonetheless contributed to the DVDs and was at the Copenhagen premiere, although he said he would never understand the reason for the cut and his relationship with Jackson was chilly. They would, however, later reconcile upon Lee's casting in Jackson's Hobbit films. Jackson only had a lock on 5 out of 10 reels, and had to churn out 3 reels in 3 weeks to help finish the film. It was finally completed on 12 November 2003. Jackson never had a chance to view the film in full due to the hectic schedule, and only saw the film from beginning to end on 1 December at the Wellington premiere; according to Elijah Wood, his response was \"yup, it's good, pretty good\".</p><h4>Visual effects</h4><p>The Return of the King contains 1,489 visual effect shots, nearly three times the number from the first film and almost twice that of the second. As with the two previous films, Jim Rygiel served as the visual effects supervisor. Visual effects work began with Alan Lee and Mark Lewis compositing various photographs of New Zealand landscape to create the digital arena of the Pelennor Fields in November 2002. Jackson and Christian Rivers used computers to plan the enormous battle up until February 2003, when the shots were shown to Weta Digital. To their astonishment, 60 planned shots had gone up to 250, and 50,000 characters were now 200,000. Nevertheless, they pressed on, soon delivering 100 shots a week, 20 a day, and as the deadline neared within the last two months, often working until 2 am.</p><p>For the battle, they recorded 450 motions for the MASSIVE digital horses (though deaths were animated), and also had to deal with late additions in the film, such as Trolls bursting through Minas Tirith's gates as well as the creatures that pull Grond to the gate, and redoing a shot of two mûmakil Éomer takes down that had originally taken six months in two days. On a similar note of digital creatures, Shelob's head sculpture was scanned by a Canadian company for 10 times more detail than Weta had previously been able to capture.</p><p>Like the previous films, there are also extensive morphs between digital doubles for the actors. This time, there was Sam falling off Shelob, where the morph takes place as Astin hits the ground. Legolas attacking a mûmak required numerous transitions to and fro, and Gollum's shots of him having recovered the One Ring and falling into the Crack of Doom were fully animated. For the latter scene, as well as the scene in which Mount Doom erupts and Frodo and Sam escape from the volcano, the help of the company Next Limit Technologies and their software RealFlow was required to simulate the lava. The King of the Dead is played by an actor in prosthetics, and his head occasionally morphs to a more skull-like digital version, depending on the character's mood. The Mouth of Sauron also had his mouth enlarged 200% for unsettling effect.</p><p>The Return of the King also has practical effects. In the Pyre of Denethor sequence, as the Steward of Gondor throws Pippin out of the Tomb, John Noble threw a size double named Fon onto a prostrate Billy Boyd, who immediately pushed his head into camera to complete the illusion. A few burning torches were also reflected off a plate of glass and into the camera for when Gandalf's horse Shadowfax kicks Denethor onto the pyre. Because of Jackson's requirement for complete representation of his fantasy world, numerous miniatures were built, such as 1:72 scale miniature of Minas Tirith, which rises 7m high and is 6.5m in diameter. 1:14 scale sections of the city were also required, and the Extended Edition scene of the collapsing City of the Dead has 80,000 small skulls, amounting in total to a single cubic meter. The miniatures team concluded in November with the Black Gate, after 1000 days of shooting, and the final digital effects shot done was the Ring's destruction, on 25 November.</p><h4>Sound effects</h4><p>The Sound department spent the early part of the year searching for the right sounds. A Tasmanian devil was used to create Shelob's shriek, which in turn gave inspiration for Weta's animators, while the mûmakil is the beginning and end of a lion roar. Human screams and a donkey screech were mixed into Sauron's fall and broken glass was used for the collapsing sounds. For missile trading during Minas Tirith's siege, construction workers dropped actual 2 ton stone blocks previously lifted by a construction crane. Mixing began at a new studio on 15 August, although unfinished building work caused some annoyances. The mixers finished on 15 November, after three months of non-stop work.</p><h4>Score</h4><p>The music was composed by Howard Shore, who previously composed the first two parts of the trilogy. Shore watched the assembly cut of the film, and had to write seven minutes of music per day to keep up with the schedule. The score sees the full introduction of the Gondor theme, originally heard during Boromir's speeches at the Council of Elrond in The Fellowship of the Ring and at Osgiliath in The Two Towers' Extended Edition. Shore also used the Gondor theme with the new ascending coda (which is unique to this film) in his score for the trailer of the film.</p><p>The score features the London Philharmonic Orchestra, London Voices, the London Oratory School Schola and featured vocal soloists. The score is the most expansive of the three: scoring effectively the entire movie length, not including additional music written for the trailer and various alternate versions released to the public. It also uses the biggest forces in the series: sections of the score call for two sets of timpani, eight trumpets (and possibly a similar increase in the size of the horn, trombone and tuba section, as well), 85 singers in the mixed choir with additional players for all-male and all-female sections, over fifty in the boy choir and many instrumentalist \"bands\" playing Celtic and eastern instruments such as tin whistle or pan flute, on stage or off of it. One piece of music required an instrument invented and crafted especially for the film: a fiddle with four pairs of strings instead of single strings.</p><p>Actors Billy Boyd, Viggo Mortensen and Liv Tyler also contributed to the film's music. Boyd sings on screen as Faramir charges towards Osgiliath, Mortensen sings on screen as he is crowned King, and in the Extended Edition Tyler sings as Aragorn heals Éowyn.</p><p>Renée Fleming, Ben Del Maestro, Sissel Kyrkjebø and James Galway also contribute to the soundtrack as featured soloists. Fleming sings as Arwen has a vision of her son and when Gollum recovers the One Ring. Del Maestro sings when Gandalf lights his staff to save fleeing Gondorian soldiers from Osgiliath as the Nazgûl attack and as the eagles arrive at the Black Gates. Galway plays the flute and whistle as Frodo and Sam climb Mount Doom and as they return to the shire. Sissel sings \"Asea Aranion\", which was originally meant to score the Houses of Healing scene. The end title song, \"Into the West\", was composed by Shore with lyrics by Fran Walsh. Annie Lennox (formerly of Eurythmics) performed it and also received songwriting credit. The song was partially inspired by the premature death from cancer of a young New Zealand filmmaker named Cameron Duncan who had befriended Peter Jackson.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>After two years of attention and acclaim since the release of The Fellowship of the Ring, audience and critical anticipation for the final entry was extremely high. The world premiere was held in Wellington's Embassy Theatre, on 1 December 2003, and was attended by the director and many of the stars. It was estimated that over 100,000 people lined the streets, more than a quarter of the city's population.</p><h4>Home media</h4><p>The theatrical edition of the film was released on VHS and DVD on 25 May 2004. The DVD was a 2-disc set with extras on the second disc. The theatrical DVD sets for the two previous films were released eight months after the films were released, but Return of the King's set was completed in five because it did not have to market a sequel (the previous films had to wait for footage of their sequels to become available for a ten-minute preview). However, it contained a seven-minute trailer of the entire trilogy.</p><p>The Return of the King followed the precedent set by its predecessors by releasing an Extended Edition (251 minutes) with new editing and added special effects and music, along with four commentaries and six hours of supplementary material, plus 10 minutes of fan-club credits. However, this set took longer to produce than the others because the cast and crew, no longer based in New Zealand for the trilogy, were spread all over the world working on other projects. The set was finally released on 14 December 2004 in the UK and US. The final ten minutes comprises a listing of the charter members of the official fan club who had paid for three-year charter membership.</p><p>A collectors' box set was also released, which included the Extended Set plus a sculpture of Minas Tirith and a bonus 50-minute music documentary DVD, Howard Shore: Creating The Lord of the Rings Symphony: A Composer's Journey Through Middle-earth. The DVD has a DTS-ES soundtrack. The DVD also features two humorous Easter Eggs, one where Dominic Monaghan plays a German interviewer with Elijah Wood via satellite and another where Vince Vaughn and Ben Stiller attempt to convince Jackson to make a sequel, originally shown at the 2004 MTV Movie Awards. Both can be accessed via a Ring icon on the last page of both Disc 1 and 2's scene indexes. In August 2006, a Limited Edition of The Return of the King was released. This Limited Edition contains two discs; the first is a two-sided DVD containing both the Theatrical and Extended editions of the film. The second disc is a bonus disc that contains a new behind-the-scenes documentary.</p><p>The theatrical Blu-ray release was released in the United States in April 2010. The individual Blu-ray disc of The Return of the King was released in September 2010 with the same special features as the complete trilogy release, except there was no digital copy. The Extended Edition was released in the United States in June 2011. It has a runtime of 263 minutes.</p><p>The Return of the King was released in Ultra HD Blu-ray on 30 November 2020 in the United Kingdom and on 1 December 2020 in the United States, along with the other films of the trilogy, including both the theatrical and the extended editions of the films.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The Return of the King earned $377,027,325 in the United States and Canada and $763,654,686 in other countries for a worldwide total of $1,147,633,833. In the weekend of February 20–22 of 2004, the film crossed the $1 billion mark, making it the second film in history to do so, after Titanic in 1998. Worldwide, it is the 27th highest-grossing film of all time when not adjusted for inflation, the highest-grossing film of 2003, the second highest-grossing film of the 2000s, the highest-grossing entry in The Lord of the Rings trilogy, and the highest-grossing film ever to be released by New Line Cinema. It held the record as Time Warner's highest-grossing film worldwide for eight years until it was surpassed by Harry Potter and the Deathly Hallows – Part 2 in 2011. Box Office Mojo estimates that the film had sold over 61 million tickets in the US in its initial theatrical run.</p><p>In the US and Canada, it is the 27th highest-grossing film, the highest-grossing 2003 film, and the highest-grossing entry in The Lord of the Rings trilogy. The film set an opening Wednesday record with $34,450,834. This record was first surpassed by Spider-Man 2 in 2004 and ranks as the seventh largest Wednesday opening. Additionally, it was ranked as the highest December opening day, holding that record for less than a decade before getting dethroned by The Hobbit: An Unexpected Journey in 2012. The film opened a day earlier for a midnight showing and accounted for about $8 million. This was nearly twice the first-day total of The Fellowship of the Ring — which earned $18.2 million on its opening day in 2001 — as well as a significant increase over The Two Towers — which earned $26.1 million on its debut in 2002. Part of the grosses came from the Trilogy Tuesday event, in which the Extended Editions of the two previous films were played on 16 December before the first midnight screening. For two years, The Return of the King would hold the record for having the highest midnight screenings gross until 2005 when it was given to Star Wars: Episode III – Revenge of the Sith. The film went on to make an opening weekend of $72,629,713, making it the second-highest opening weekend for a New Line Cinema film, behind Austin Powers in Goldmember. In addition, it had the third largest opening weekend of that year, after The Matrix Reloaded and X2. With a total gross of $125.1 million, the film had the biggest five-day Wednesday opening of all time, surpassing the previous record held by Star Wars: Episode I – The Phantom Menace. The next year, this record would be beaten by Shrek 2. Its Friday-Sunday opening weekend was a record-high for December (first surpassed by I Am Legend). The film also set single-day records for Christmas Day and New Year's Day (both first surpassed by Meet the Fockers).</p><p>Outside the US and Canada, it is the 17th highest-grossing film, the highest-grossing 2003 film and the highest-grossing film of the series. On its first day (Wednesday, 17 December 2003), the film earned $23.5 million from 19 countries and it set an opening-weekend record outside the US and Canada with $125.9 million during the five-day weekend as a whole. The combined total gross increased to $250.1 million, making it the highest worldwide opening weekend at the time, knocking out The Matrix Revolutions. It set opening-day records in thirteen of them, including the United Kingdom, Germany, Austria, Belgium, the Netherlands, Spain, Greece, Switzerland, Scandinavia (as well as separately in Sweden, Finland, Norway and Denmark), Mexico, Chile and Puerto Rico. It set opening-weekend records in the United Kingdom ($26.5 million in five days), Germany, Spain, Sweden, Denmark and Switzerland. In Singapore, it surpassed Finding Nemo to become the country's top-grossing film. In New Zealand, where filming took place, the film set opening day, opening weekend, single-day, Friday gross, Saturday gross and Sunday gross records with $1.7 million in four days.</p><p>The substantial increase in initial box office totals caused optimistic studio executives to forecast that The Return of the King would surpass The Two Towers in total earnings. If this proved to be true, then this would be the first blockbuster trilogy for each successive film to earn more at the box office than its predecessor, when all three films were blockbuster successes. The Return of the King has helped The Lord of the Rings franchise to become the highest-grossing motion picture trilogy worldwide of all time with over $2.9 billion beating other notable series such as the original Star Wars Trilogy, and became New Line's highest grossing release.</p><p>Through re-releases in 2005, 2011, 2017, 2020 and 2021, the film has grossed an additional $818,580 in the United States and Canada, and $4,530,321 overseas for a combined total of $5,348,901. This brings overall earnings to $377,845,905 domestic and $768,185,005 international for a worldwide total of $1,146,030,912.</p><p>These figures do not include income from DVD sales, TV rights, etc. It has been estimated that the gross income from non-box office sales and merchandise has been at least equal to the box office for all three films. If this is so, the total gross income for the trilogy would be in the region of $6 billion following an investment of $300 million ($426 million including marketing costs).</p><h4>Critical response</h4><p>On the review aggregator website Rotten Tomatoes, The Return of the King holds an approval rating of 93% based on 275 reviews, with an average rating of 8.70/10. The website's critics consensus reads, \"Visually breathtaking and emotionally powerful, The Lord of the Rings - The Return of the King is a moving and satisfying conclusion to a great trilogy.\" Metacritic, which uses a weighted average, gives the film a score of 94 out of 100 based on 41 reviews, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale, the highest grade in the trilogy.</p><p>Like its two predecessors, The Return of the King was released to universal critical acclaim. Alan Morrison of Empire gave the film a perfect score of five stars. In his review, he called the film \"the resounding climax to a landmark in cinema history\" and praised how Peter Jackson had \"kept the momentum of the series rolling on and on through the traditionally 'difficult' middle part and 'weak' finale, delivering a climax to the story that's neater and more affecting than what Tolkien managed on the printed page.\" Morrison also mentioned how fans of the films \"who have walked beside these heroes every step of the way on such a long journey deserve the emotional pay-off as well as the action peaks, and they will be genuinely touched as the final credits roll.\" Elvis Mitchell for The New York Times lauded the acting, the craft of the technical crew, and Jackson's direction, describing The Return of the King as \"a meticulous and prodigious vision made by a director who was not hamstrung by heavy use of computer special-effects imagery.\" Roger Ebert of the Chicago Sun-Times gave the film three and a half stars out of four, saying that it is \"such a crowning achievement, such a visionary use of all the tools of special effects, such a pure spectacle, that it can be enjoyed even by those who have not seen the first two films.\" Talking about the whole trilogy, Ebert said that he admired it \"more as a whole than in its parts\", and that The Return of the King certified The Lord of the Rings as \"a work of bold ambition in a time of cinematic timidity\". In his review for The Times, James Christopher praised The Return of the King as \"everything a Ring fan could possibly wish for, and much more\", and described The Lord of the Rings as \"the greatest film trilogy ever mounted, with some of the most amazing action sequences committed to celluloid\". Nev Pierce for the BBC gave the film five stars out of five, judging it to be the best chapter of the trilogy, since it combined \"the 'ooh' factor of Fellowship with the zippy action of Towers\". Pierce described The Return of the King as \"Majestic, moving, and immense\", and \"an astonishing piece of storytelling\". Philip French, reviewing it for The Observer, lauded the narrative force, the battle scenes, the language, and the visual style of the film, which he related to \"the swirling battle paintings of Albrecht Altdorfer\" and \"Claude Lorraine's elegiac paintings of maritime departures inspired by classical poets.\" French wrote about the whole trilogy \"Jackson's Lord of the Rings is indeed a very fine achievement, moving, involving and, to many people, even inspiring. It redeems the debased cinematic notion of the epic.\"</p><p>In her review for Entertainment Weekly, Lisa Schwarzbaum gave the film an A grade, and wrote \"The conclusion of Peter Jackson's masterwork is passionate and literate, detailed and expansive, and it's conceived with a risk-taking flair for old-fashioned movie magic at its most precious ... as he has done throughout, the director paces scenes of action, intimacy, and even panoramic, geographical grandeur ... with the control of a superb choreographer.\". Schwarzbaum also said of the whole series \"I can't think of another film trilogy that ends in such glory, or another monumental work of sustained storytelling that surges ahead with so much inventiveness and ardor.\" Richard Corliss of Time named The Return of the King the best film of the year and described the whole trilogy as \"The film event of the millennium\". Joe Morgenstern, for The Wall Street Journal, wrote \"Never has a filmmaker aimed higher, or achieved more. The third and last installment of the screen epic based on J.R.R. Tolkien's literary classic redefines -- steeply upward -- the very notion of a major motion picture.\" Peter Bradshaw, who had been less enthusiastic about the first two chapters of the trilogy, gave The Return of the King four stars out of five in his review for The Guardian, commenting \"I started the series an atheist and finished an agnostic\". Bradshaw wrote of the film \"Technically it really is superb\", and commented \"Hours after watching the film, I can close my eyes and see those incredible battle scenes pulsing and throbbing in my skull ... Maybe Kurosawa's battles will one day be described as proto-Jacksonian\".</p><p>The most common criticism of The Lord of the Rings: The Return of the King was its running time, particularly the epilogue; even rave reviews for the film commented on its length. Joel Siegel of Good Morning America said in his review for the film (which he gave an 'A'): \"If it didn't take forty-five minutes to end, it'd be my best picture of the year. As it is, it's just one of the great achievements in film history.\"</p><p>In February 2004, a few months following release, the film was voted eighth on Empire's 100 Greatest Movies of All Time, compiled from readers' top ten lists. This forced the magazine to abandon its policy of only allowing films being older than a year to be eligible. In 2007, Total Film named The Return of the King the third best film of the past decade (Total Film's publication time), behind The Matrix and Fight Club.</p><h4>Accolades</h4><p>The film was nominated for eleven Academy Awards: Best Picture, Best Director, Best Adapted Screenplay, Best Original Score, Best Original Song, Best Visual Effects, Best Art Direction, Best Costume Design, Best Make-up, Best Sound Mixing and Best Film Editing. At the 76th Academy Awards in 2004, the film won all the categories for which it was nominated and it holds the record for highest Academy Award totals along with Titanic (which also starred Bernard Hill) and Ben-Hur, and also holding the record for the highest clean sweep at the Oscars, surpassing the nine awards earned by both Gigi and The Last Emperor. It was the first fantasy film to win the Academy Award for Best Picture. It also was the last movie for 14 years to win the Academy Award for Best Picture without being chosen as one of the top ten films of the year by the National Board of Review, until the release of The Shape of Water in 2017.</p><p>The film also won four Golden Globes (including Best Picture for Drama and Best Director), five BAFTAs, two MTV Movie Awards, two Grammy Awards, nine Saturn Awards, the New York Film Critics Circle award for Best Picture, the Nebula Award for Best Script, and the Hugo Award for Best Dramatic Presentation, Long Form.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient/Nominee</th><th scope=\"col\">Result</th></tr><tr><td rowspan=\"11\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Barrie M. Osborne</span>, <span>Peter Jackson</span> and <span>Fran Walsh</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td><span>Fran Walsh</span>, <span>Philippa Boyens</span> and <span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td><span>Grant Major</span>, <span>Dan Hennah</span> and <span>Alan Lee</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Ngila Dickson</span> and <span>Richard Taylor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Jamie Selkirk</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Makeup</span></td><td><span>Richard Taylor</span> and <span>Peter King</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Score</span></td><td><span>Howard Shore</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Song</span></td><td><span>Fran Walsh</span>, <span>Howard Shore</span> and <span>Annie Lennox</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound Mixing</span></td><td><span>Christopher Boyes</span>, <span>Michael Semanick</span>, <span>Michael Hedges</span> and <span>Hammond Peek</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Visual Effects</span></td><td><span>Jim Rygiel</span>, <span>Joe Letteri</span>, <span>Randall William Cook</span> and <span>Alex Funke</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"12\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td><span>Barrie M. Osborne</span>, <span>Fran Walsh</span> and <span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Direction</span></td><td><span>Peter Jackson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td><span>Ian McKellen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td><span>Fran Walsh</span>, <span>Philippa Boyens</span> and <span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Andrew Lesnie</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Ngila Dickson</span> and <span>Richard Taylor</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td><span>Jamie Selkirk</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Makeup and Hair</span></td><td><span>Richard Taylor</span>, <span>Peter King</span> and <span>Peter Owen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Music</span></td><td><span>Howard Shore</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td><span>Grant Major</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Ethan Van der Ryn</span>, <span>Mike Hopkins</span>, David Farmer, <span>Christopher Boyes</span>, <span>Michael Hedges</span>, <span>Michael Semanick</span> and <span>Hammond Peek</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Special Visual Effects</span></td><td><span>Joe Letteri</span>, <span>Jim Rygiel</span>, <span>Randall William Cook</span> and <span>Alex Funke</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td><span>Best Motion Picture – Drama</span></td><td><i>The Lord of the Rings: The Return of the King</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Score</span></td><td><span>Howard Shore</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Song</span></td><td><span>Annie Lennox</span>, <span>Fran Walsh</span> and <span>Howard Shore</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"13\"><span>Saturn Awards</span></td><td><span>Best Fantasy Film</span></td><td><i>The Lord of the Rings: The Return of the King</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Elijah Wood</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Viggo Mortensen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Andy Serkis</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Ian McKellen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Sean Astin</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Miranda Otto</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Writing</span></td><td><span>Fran Walsh</span>, <span>Philippa Boyens</span> and <span>Peter Jackson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Ngila Dickson</span> and <span>Richard Taylor</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Make-up</span></td><td><span>Richard Taylor</span> and <span>Peter King</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Music</span></td><td><span>Howard Shore</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Special Effects</span></td><td><span>Jim Rygiel</span>, <span>Joe Letteri</span>, <span>Randall William Cook</span> and <span>Alex Funke</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}