{
  "imDbId": "tt0089881",
  "title": "Ran",
  "fullTitle": "Ran (1985)",
  "type": "Movie",
  "year": "1985",
  "items": [
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0225549",
      "warningSpoilers": false,
      "date": "16 August 2004",
      "rate": "10",
      "helpful": "143 out of 170 found this helpful.",
      "title": "My third favorite Kurosawa film- deliberately paced (not painfully so), heavy on tragedy, and glorious in overall artistry",
      "content": "I would agree with Ebert's review on a point, that Akira Kurosawa, legendary director of such samurai classics as Seven Samurai, Yojimbo, Hidden Fortress, and Kagemusha, as well as human dramas like Rashomon, The Lower Depths, and Red Beard, could really best direct this film in his old age. There's something about his version of the doomed King Lear of Shakespeare, his Lord Hidetora Ichimonji that could be truly captured by someone in old age. Not to say that directors can't make great films when they're young, or in middle age, about a man in the dark days of the golden years (About Schmidt, Tokyo Story, Bob Le Flambeur, and Kurosawa's own Ikiru come to mind). But it's clear that Kurosawa must've seen or felt or understood at least an element of Hidetora's character, something that goes beyond tragedy that is stuck with all who are mortal. At one point when Hidetora is in a wandering, dazed state he says \"I am lost\", to which his companion/caretaker Kyoami responds \"Such is the human condition.\" Was Kurosawa lost as an artist and filmmaker as he tried to get his epic (which at the time of it's filming was the most expensive Japan had seen, and got some extra backing from outside European backers) off the page and onto celluloid? Hard to say, but the end result displays that even in his later days he could create a work so wonderful, so sad, so brutal, and so human that it will remain timeless. If Kurosawa deserves praise for look of the film, the pacing, the editing, every single painstakingly storyboarded (painted) shot, and his direction with the two battle sequences as well as with the quieter, more compelling scenes with the actors, the man who plays Hidetora deserves some as well (like any production of King Lear, including Godard's wild treatise with Burgess Meredith in the lead role, the actor is as important as the writer). Tatsuya Nakadai, who had roles in past Kurosawa films as a young man in Yojimbo (the gunslinger) and Sanjuro (the opponent), is awe-inspiring. Early in the film, after a mind-shattering dream, his character decides to split up his kingdom unto his three sons (Jiro, Saburo, and getting the first castle and all control, Taro), he still feels in control, and has the look of a Lord with just the right level of stubbornness and, unfortunately, naivety. Then, as everything he owns crumbles before him, there is one scene that struck me as remarkable, and then for the rest of the film I couldn't take my eyes off of Nakadai whenever he was on screen. It involves the first battle sequence, in which one of his son's comes to take over a castle, and killing all of Hidetora's men. Look at Nakadai in the scene where he's sitting down stone-faced amid the chaos going on outside, and then as he somehow manages to walk out, the fellow soldiers making way for him. He then sees one of his sons, the betrayer, and he doesn't say a word- he's already decided that his son Taro has gone too far with his position, as he rules over his domain and scares the peasants right out of the picture- and he simply walks away, as his family continues to crumble under corruption of the mind and heart.It's a sequence like that though, where the great Lord makes such a radical change, where Kurosawa and Nakadai have some of their greatest time ever on a screen. As the filmmaker treats the battle, up to a point, like a feudal-Japanese version of a Eisenstein battle (no talk, no sound effects, just the eerie, sorrowful score here applied by Toru Takemitsu) with devastation and visceral nature taken to a poetic, thoughtful level, the actor's eyes and body language are, well, indescribable almost. And if Nakadai gives the finest male performance of the film, credit is equally due to the pivotal female character, Lady Kaede (Mieko Harada), who is like a Lady Macbeth taken to the next level. This is a character that's seen Lord Ichimonji destroy his castle when she was young, and now that she has her son(s) right in the palm of her hand, she'll have her revenge in guise of ego-feeding. I may not be able to recommend Ran on one level, despite it being on the painter's equivalent of a splendorous, seething portrait of royalty. Kurosawa takes his time telling the story, and to some it might even feel longer than his epic Seven Samurai. This is a work heavy on emotional nuance, on how the characters (in particular Hidetora) look unto their surroundings, how the presence of destruction and war and slayings are traumatic as opposed to being 'cool' in a stylistic way. If you're looking for a slam-bang action thriller look, elsewhere. But if you're looking for a mature film about life, death, loss, and the bonds that are kept within families, the mind, and how we accept and give forgiveness (a blind character named Lord Tsurumaru is stunning from a certain point of view), this is it. As well for the Shakespeare fan it's an absolute must-see, and it may even turn some onto Shakespeare's classic due to the fact that this film, much like Throne of Blood, contains none of the language style used in the source."
    },
    {
      "username": "Loving_Silence",
      "userUrl": "https://www.imdb.com/user/ur23582121",
      "reviewLink": "https://www.imdb.com/review/rw2298030",
      "warningSpoilers": false,
      "date": "19 August 2010",
      "rate": "10",
      "helpful": "205 out of 235 found this helpful.",
      "title": "The Best Film based on one of Shakespeare Best Works. This Masterpiece is recommended for anyone that loves movies . Truly one of the Greatest Films of all time!",
      "content": "Akira Kurosawa's 1985, Ran, is based one of Shakespeare's greatest works, King's Lear. The Film proudly stands along with his other classic such as Seven Samurai, Yojimbo, Roshomon, Sanjuro and the Hidden Fortress. He is a master in the art of filmmaking, no one can film an epic battle scene quite like Kurosawa. This is recognized as the most expensive film ever made by Akira Kurosawa, it was at that time, Japan's most expensive film ever. Being at the age of 75, he still showed us, he's one of the best in the business.This movie is about an aging lord, head of the Ichimonji family, decides to retire and to pass the power to Taro, the eldest of his three sons. He will however have to banish Saburo, the youngest one, who dared to speak the truth to him. Soon, the former lord is chased away from the castles of his sons and becomes mad when he understands that one of his sons is trying to kill him. The three brothers are fighting for control of the Kingdom, as their lust for power grows every day. Four armies are facing each other on the prairie. Lord Ichimonji's former peaceful kingdom is nothing but a distant memory.Akira Kurosawa redefines what an epic film is, with astonishing story telling, entirely believable characters and real life battle scenes without the use of Special effects/CGI. He retells the story of King Lear in his own way and no one would recognize that it was actually a adaptation beforehand. But just like Shakespeare, there is humor, irony, death and not a happy ending. Everyone who played a part in the production of this film, deserves some kind of recognition. The acting is pretty much excellent and certainly believable.10/10 Kurosawa is a Genius"
    },
    {
      "username": "boris-26",
      "userUrl": "https://www.imdb.com/user/ur0150803",
      "reviewLink": "https://www.imdb.com/review/rw0225489",
      "warningSpoilers": false,
      "date": "20 November 2001",
      "rate": "",
      "helpful": "68 out of 86 found this helpful.",
      "title": "Be prepared to be awe-struck!",
      "content": "With RAN (1985) Akira Kurosawa seems to be setting up a macarbe trap. The first section of the film is slow, following an aging warlord (Tatsuya Nakadai's best acting in a long wonderous career.) dividing his castles amongst his unsavory sons. The action is slow, people talk in low tones, it's almost at snail's pace. But then, a battle scene like nothing you ever seen before explodes on the screen. The film takes a 180 degree turn and becomes more and more sinister, more compelling. You can't look away. Akira Kurosawa (1910-1997) was responsible for elevating Japanese cinema to a front-runner in world cinema. Two of his films, RASHOMON and SEVEN SAMURAI were made in less than ten years after World War II. These films put a spotlight on Japanese culture. Some of his later films, THE HIDDEN FORTRESS, THE BAD SLEEP WELL, YOJIMBO and HIGH AND LOW became the basis for a good percentage of the major American films produced after 1960.If you sit down to see RAN, be prepared for a jaw-dropping experience."
    },
    {
      "username": "smakawhat",
      "userUrl": "https://www.imdb.com/user/ur0464186",
      "reviewLink": "https://www.imdb.com/review/rw0225482",
      "warningSpoilers": false,
      "date": "26 July 2001",
      "rate": "9",
      "helpful": "71 out of 90 found this helpful.",
      "title": "A film requiring patience with huge rewards for the viewer!",
      "content": "The 'Kurosawa' adaptation of King Lear in his film 'Ran' is a tremendous memorable film.It is a very dramatic film with many soliloquies and dialogue, but if you are patient with it, you are treated to some of the most epic scenes of cinematic brilliance that Kurosawa made. After all it is Shakespeare and one must be patient with it if they are not a fan of the old school theatre.Colourfull clashing armies, The lord awaiting his fate in a burning castle, a brilliant execution scene (I consider the BEST I have ever seen film ever), and the blind being left in the hands of Buddha?While Seven Samurai will always be his perfection, Ran is more than an enjoyable movie that should be seen. Just stick with it and you'll never forget it.Rating 9 out of 10."
    },
    {
      "username": "zolaaar",
      "userUrl": "https://www.imdb.com/user/ur2360984",
      "reviewLink": "https://www.imdb.com/review/rw1208074",
      "warningSpoilers": false,
      "date": "3 November 2005",
      "rate": "10",
      "helpful": "89 out of 111 found this helpful.",
      "title": "Jester and Warlord",
      "content": "'Ran' is the Japanese word for chaos, riot, dissension. Akira Kurosawa's masterpiece is indeed a feast of destruction and perdition, charged with symbols and powerful in pictures like it is found very rarely in today's cinema.The dusky story is based on Shakespeare's 'King Lear'. In the film a Japanese warlord celebrates his own downfall. Kurosawa devised this with a radical film language which works with certain imageries of colors, rapid cut sequences and a sophisticated sound design. When the colorful flags of the different armies get intermixed in a battle, when the peacefully quiet wind (which carries the soundtrack) swells to a raving storm or when long wide shots suddenly segue into shots of details that follow hot on each other's heels then you realize Kurosawa's incredible style which deeply influenced the cinema worldwide.The drawings of the characters are equally terrific. Hidetora's jester is for a certain reason always at the side of the warlord. Their relationship alters as the film continues: Jester and warlord change their roles which makes it hard to distinguish both. Just as the sky turns from blue to grey with dark clouds, the violent past of Hidetora is catching up the aging lord. His trail of murder and predation is not forgotten, the brutally conquered land still carries the old scarves of war and exploitation which now burst out again.The viewer can take this monumental work as a warning to the destructive power of war, which is even decades later at present and beset those who seed the violence."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2090344",
      "warningSpoilers": true,
      "date": "3 July 2009",
      "rate": "10",
      "helpful": "63 out of 80 found this helpful.",
      "title": "Greatest rendition of a Shakespearean Epic",
      "content": "Ran is probably cinema's greatest rendition of a Shakespearean Epic, ironically coming from an oriental film-maker. Adapted by Kurosawa from Shakespeare's King Lear, Ran undoubtedly features amongst the best works of the master auteur. It captures with sheer vividness and surreal resplendence, the true essence of human struggle for survival, highlighting the cruelties associated with life. Ran is strictly indicative of the sole consistency of life i.e. Change, an attribute that not only makes the humans vulnerable but also gives them the hope to rise after a fall.The story focuses on a senile warlord, who owing to his senescence is rapidly losing his strength and his ferocious grandeur that he had earned through years of relentless savagery and ruthless slaughter, ergo he renounces to his three sons, hoping them to establish a sort of a triumvirate with the eldest son having a slight edge. His two elder sons accept the proposal with rapturous glee, but his youngest son seems bemused and questions the wits of the patriarch for taking the untimely decision. Though arrantly annoyed by his son's audacious defiance, he tries to console him, only to find him inconsolable. Deeply hurt by his son's impertinence and censure, he reluctantly banishes him and enthrones the two elder sons. The rest is rather worth a watch than a read, for there is nothing that can better the sumptuous elegance of Ran.The brilliantly captured scenes are breathtaking to say the least, especially the war scene that depicts fate casting the final blow to the ruthless reign of the warlord. The brutality and the bloodshed depicted in the very scene can make even a cold-blooded appear jittery. Ran portrays the poetic justice in such a relentless and abominable fashion that one can't help but sympathize with the narcissistic warlord, who spent his life arrogating and annihilating the innocent souls. The plaintive score gives the movie a much desired tone, a mood that not only supports its melancholic backdrop, but also immensely adds to its poignant beauty. The final scene featuring the blind boy, deeply clutched by his haplessness and gross solitude, though doesn't feature an utterance of even a single syllable, the playback of the mystical flute makes the scene haunting as well as mesmerising and worth a thousand words. Ran is a classic example of Kurosawa's brilliance and perhaps a consummation of his apotheosis.A must watch for eclectic viewers and admirers of pristine cinema. Highly recommended: 10/10."
    },
    {
      "username": "rbverhoef",
      "userUrl": "https://www.imdb.com/user/ur0312444",
      "reviewLink": "https://www.imdb.com/review/rw0225521",
      "warningSpoilers": false,
      "date": "13 April 2003",
      "rate": "9",
      "helpful": "44 out of 65 found this helpful.",
      "title": "Very well made",
      "content": "One of the last great films directed by Akira Kurosawa. A father gives his land and his power to his three sons. They turn against each other and against their father.Based on Shakespeare's King Lear 'Ran' is a very good film. It was very expensive and you can see that. Over ten years Kurosawa was busy on this project and in 1985 it was finally there. Very well made, with beautiful costumes, music and cinematography, a great direction and some good performances. Although I think Kurosawa has done better ('Rashomon', 'Ikiru', 'Yojimbo' and of course 'Shichinin no Samurai') 'Ran' definitely belongs to his best."
    },
    {
      "username": "Elendil87",
      "userUrl": "https://www.imdb.com/user/ur2100413",
      "reviewLink": "https://www.imdb.com/review/rw0225544",
      "warningSpoilers": false,
      "date": "31 March 2004",
      "rate": "10",
      "helpful": "138 out of 166 found this helpful.",
      "title": "The Greatest Shakespeare Film",
      "content": "Throughout his career Kurosawa strove to achieve what he called \"real cinema\", proclaiming that \"in all [his] films, there's [only] three or four minutes\" of such quality. Many would argue that he was his greatest critic. For if not in \"Seven Samurai\", then definitely in \"Ikiru\" and if not in \"High and Low\", then definitely in \"Rashomon\" he must have achieved this plateau of greatness. Well, if not in any of his other films, then definitely in \"Ran\" Kurosawa finally came to the apex of cinematic artistry. With the both lyrical and grandiose tone of its craft, its beautifully spare imagery, its haunting score by Toru Takemitsu, and its lead Tatsuya Nakadai's masterful understated performance, \"Ran\" is perhaps the most fully realized epic ever made.The tale, which is an adaptation of Shakespeare's \"King Lear\", begins as Lord Hidetora Ichimonji and his court are out hunting. During a break in the hunt, Hidetora proclaims his adbication from the hight seat of the Great Lord and bestows his lands unto his three sons, dividing them up equally. He declares his oldest to be his successor in power. When his youngest son and one of his faithful nobles, express their concerns on this idea, Hidetora foolishly banishes them both, mistaking their advice as insolence. With this opening scene, the peaces are aligned and soon 'chaos' as the film is aptly named will break out throughout the land. From here, we see the downfall of Hidetora and all those who surround him. The film retains all the themes of the original play, but also thanks to Kurosawa's own input addresses a slew of even more varied ideas. Like Shakespeare, Kurosawa is greatly interested in the responsibility of the leader and the hypocrisies and ironies of an autocratic system. The most obvious though not the central theme in the whole film is war, and Kurosawa explores this theme to its full extent throughout the film. In perhaps the most grandiose battle scene every filmed, he demonstrates the destructive consequences and the paradoxical beauty of conflict.Here, Kurosawa implements the camera with masterful skill not once employing the editing/photography tricks and gimmicks so often seen in films (even the good ones) today. This director has an awareness of the past and the history of film, but also the creative spontaneity of a true genius. In \"Ran\", he focuses on the more methodically simple yet artistically complex montage of Eisenstein, and on the strict compositions of Ozu. He employs the most basic and yet most artistic of techniques. Each shot is planned to precision, and each cut is made for a purpose. The coreagraphy and blocking of each scene is simple and powerful, and Kurosawa allows the actors to play out these scenes without the intrusion of the camera or the editor. Thus, the director prevents the style from eclipsing the already powerful material he has to work with. Simply put, \"Ran\" is a masterpiece that flows and develops like an opera, from its forebodingly peaceful ouverture to its bloody Shakespearean heart until its final, quietly subdued, and sorrowful denouement."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0225483",
      "warningSpoilers": true,
      "date": "7 August 2001",
      "rate": "10",
      "helpful": "27 out of 40 found this helpful.",
      "title": "Sometimes, given sufficient objectives, even the people who are closer to you than anyone else can turn against you.",
      "content": "In another lengthy samurai epic, Akira Kurosawa approaches the boundaries between family members and the damaging affects of one of his rather common themes - reckless ambition. This is very clearly a Kurosawa film, a respectable trait that is most clear in the cinematography, in which Kurosawa uses many extensive shots with little to no camera movement, as well as the common natural setting, characterized by the far-reaching landscapes of sweeping hillsides. Ran has a fascinating plot about an aging King who considers passing on his empire to his three sons. Lord Hidetora is well into his 70s (maybe Kurosawa saw part of himself in this character?), and he addresses the fact that he cannot go on ruling forever, despite the fact that he fought for his empire for over 50 years. His youngest son disagrees with his proposition of passing on leadership yet maintaining much of his control, yet Hidetora nonetheless divides his kingdom into three parts to his sons, hoping that they will remain allies. As an incentive, he demonstrates with arrows that a single one can be broken easily, but three arrows together cannot be broken as easily. The three sons, Taro, Jiro, and Saburo do not agree with Hidetora's philosophy and, as new leaders of their respective portions of Lord Hidetora's kingdom, they soon begin to fight each other for full leadership. Hidetora is attacked by his own sons and cast out of the kingdom, left to wander hopelessly from castle to castle with no one but his goofy jester at his side, who stays with the Lord entirely out of duty to him. One of Hidetora's three sons eventually returns and tries to patch up their damaged relationship, but before they can do that, he gets killed and Hidetora is left alone again, and the empire that he worked for during most of his life is left in ruins. As is also common in Kurosawa's films, there are a lot of interesting and significant characters in the film that play a substantial role in the story. When we first meet Lady Kaede, the woman who was married to Taro but then forced her way into marriage with his younger brother Jiro (the new Lord) upon Taro's death, she is holding a knife to Lord Jiro, threatening him with blackmail if he does not accept her as his wife. The first thing that makes her interesting is that her objective in marrying Jiro is to ensure herself a comfortable life, and so she can avoid fading into obscurity as the widow of a past Lord. Her blackmail threat has a lot of damaging potential for Jiro, and he accepts her as his wife. From the very start of her role in the film, her ultimate goal was to bring about the downfall of the kingdom in order to avenge her family who had been killed when Lord Hidetora was in power. This is not expected or even hinted at previously in the film, and it gives her character much more depth.There is some great irony in Ran that occurs after Lord Hidetora is banished and is left wandering the endless plains. He and his jester come across a run-down wooden shack at the foot of a hillside, and they approach it, asking for help and shelter. The occupant, after explaining that his home is too poor to offer any shelter, turns out to be a man who, as a boy, had had his eyes gouged out under the orders of Lord Hidetora in exchange for sparing his life. Once the jester and Hidetora are inside, the man explains that he will offer hospitality in the only way that Hidetora left him able, he will play them music on his flute. In this scene, Hidetora is confronted with the terrible suffering which he once imposed, and it is horribly ironic that he is forced to take shelter from someone that he once devastatingly mutilated without a second thought. In Ran, as was also the case in Kagemusha, which is a very similar film in time period and content, Kurosawa again employs a subtler style of directing. Again, he focuses more on the story than on cinematic trickery, and with spectacular results. The extensive use of the motionless camera is stunningly effective, but he also uses it in a different way here. Ran opens with a series of stationary shots of a group of horses standing majestically with their riders on the top of a flowing hillside. Virtually the exact same image is shown from a fairly wide variety of different angles and distances, indicating the vastness of the plains and the power that these characters hold (or will soon hold) over them. Again, a musical score is entirely absent throughout the vast majority of the film, and the same lengthy scenes are employed to a large extent to communicate the story of the film. An example of one of these exceedingly long takes can be seen early in the film when Lord Hidetora first announces his what he intends to do with the leadership of his kingdom. The ending of Ran is definitely realistic, for many reasons. There are no myths perpetuated by it; close family members do not always stand together, even the noblest intentions are not always realized, and no one lives happily ever after. Ran is the story of a man in a position of power who makes a trusting decision that backfires devastatingly, and the ensuing madness is not altered to make way for a happy ending. It seems that Kurosawa was trying to capture the militarily charged atmosphere that is present in times of war, and the things mentioned above are some of the many efforts he made to make it all as real as possible, even at the expense of the audience's emotions."
    },
    {
      "username": "Samiam3",
      "userUrl": "https://www.imdb.com/user/ur19511193",
      "reviewLink": "https://www.imdb.com/review/rw2106642",
      "warningSpoilers": false,
      "date": "5 August 2009",
      "rate": "7",
      "helpful": "32 out of 47 found this helpful.",
      "title": "Strong but Sloooooooowwww",
      "content": "I am not certain, but I think Ran was Akira Kurosawa's last big feature. Visually, It might be his most distinctive. Being in color opens a lot of doors to cinematography, and makes it easier to see how much artistic creativity went into the sets and costumes. There is something else distinctive about Ran. It is his slowest picture. You need extreme patience to make it through this very long movie, and you also need to understand the context of the story.Ran is Kurosawa's retelling of Shakespeare's King Lear, which many scholars say is his most difficult tragedy. The premise is identical, revolving around an old monarch who is ruined by the corruption of his sons, after he gives them power and authority. (In King Lear, they were daughters, not sons, of course.) Ran starts and ends strongly, but the problem comes down to a huge, plodding middle section. This part of the film will really test your attention span. Kurosawa deliberately makes sure that nothing happens, because he wants to evoke one single emotion...isolation. He places his principal character (and a couple of others) in the middle of nowhere, with no story progression, music, or major dialog. There are perhaps one (or even two) too many similarly grim scenes.The battles scenes are the biggest in Kurosawa's forty year body of work. Not only do they feature swords and spears but guns, cannons, and a cast of thousands. The interesting thing about those scenes is that Kurosawa, doesn't intend them to be rousing or exciting. Instead, there is a strange emotional feeling generated. The most memorable part of Ran is the very last sequence, which is visually brilliant and really disturbing. He makes a metaphor about the frailty of humanity by showing a blind man in a very particular place.Ran will leave you thinking long and hard. I have not seen a film like it and I don't think I ever will. It is not my favorite Kurosawa, but it is very much worth watching."
    },
    {
      "username": "O_L_D_B_O_Y",
      "userUrl": "https://www.imdb.com/user/ur1711899",
      "reviewLink": "https://www.imdb.com/review/rw0988006",
      "warningSpoilers": false,
      "date": "30 December 2004",
      "rate": "10",
      "helpful": "116 out of 138 found this helpful.",
      "title": "RAN - A Classic Of Its Time And For All Time",
      "content": "Based on Shakespeare's King Lear, this film follows the story of the aging warlord Hidetora who, in an attempt to restore peace, divides his kingdom between his three sons - Taro, Jiro, and Saburo - and retires from his duties. However, one of his sons sees this as unwise and is banished by his father, leaving his two brothers in charge of two of the three castles left in their hands. It isn't long before they are overtaken by greed and eventually betray their father, leaving him in the hands of a philosophical jester and a loyal retainer. This betrayal ultimately leads to war, dividing the family and driving Hidetora insane.The remarkable script, which contains many of my favorite lines from any film, still manages to break its way through the confinement of subtitles and reveals itself to be one of the richest Kurosawa ever wrote. He has obviously worked equally hard on the look and feel of the film - the cinematography being excellent (example: the long, continuous shot of Saburo's men charging on horseback across a river).There's also something rather frightening about it that I can't quite put my finger on. The first battle, which is the film's turning point, is the most horrifying, yet strangely beautiful, battles ever filmed. A good effect used is the loss of sound, with only Toru Takemitsu's haunting score to be heard. The entire battle lasts less than ten minutes and there is no uplifting or bombastic music to be heard, but in my opinion, it's Ran's finest scene, and thus the finest scene ever.What Kurosawa managed to get rather than give though was excellent performances from his actors, none more brilliant than Tatsuya Nakadai's Hidetora, Mieko Harada as Lady Kaede (a woman similar to Lady Macbeth but with a different hidden agenda), and the strangely-named Peter as Kyoami."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw1094031",
      "warningSpoilers": false,
      "date": "3 June 2005",
      "rate": "5",
      "helpful": "52 out of 85 found this helpful.",
      "title": "Not as great as I thought it would be",
      "content": "Realizing that it is practically heresy in the film world to criticize a Kurosawa film, much less downright dislike it, I'd like to precede my review by saying that I have absolutely loved every Kurosawa film I've seen  until now. \"Ran\", Kurosawa's 1985 film based somewhat on Shakespeare's \"King Lear\" is the story of an elderly emperor who hands down his kingdom to the oldest of his three sons. While the oldest and middle son fan over each other, saying that they are not deserving, etc. it is the youngest who speaks his mind about the subject, incurring the wrath of his father and ultimately, banishment from the area. Meanwhile, the two older sons are making a mess of things with the kingdom, leading to wars, fratricide and the dismissal of their father, even attempting his murder. None of their motives are noble or honorable, only avarice and power motivate them, leading to tragedy for all.Going into this, I knew that this was not going to be a light story by any means. For anyone who has read or is familiar with Lear, it is a story that is pretty much slogged through, though it is wonderfully told. \"Ran\" can pretty much be described the same way. While I certainly appreciated the good acting, the unbelievable costumes and the set design as a whole, I found myself unable to become engaged in the story. The pacing was extremely slow, certainly not an easy thing to deal with during a film that lasts about 2 hours and 40 minutes. Unfortunately, for myself at least, it is the pacing, visuals and story that can really make a foreign film a success for me, and I found that \"Ran\" only had one compelling element out of the three, which managed to save it from being an absolute dud, but not enough to make it as awesome as Kurosawa's other films are. (And in using the word awesome, I really mean the word \"awe\") Because of the costumes, at times arresting imagery, and the ultimate fate of Lady Kaede (which bumped up the film by an entire point for me because of its bluntness) I'm not completely panning the film. While I feel the film was a bit disappointing, I'm more disappointed in myself for not being able to like it as much as I would have wanted, since it has had such amazing reviews. But since you can't like them all, \"Ran\" gets a 5/10 from me.--Shelly"
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2123825",
      "warningSpoilers": true,
      "date": "8 September 2009",
      "rate": "",
      "helpful": "15 out of 24 found this helpful.",
      "title": "Masterpiece: arguably Kurosawa's best",
      "content": "\"He who knows others is wise. He who knows himself is enlightened.\" - Tao Te Ching\"Ran\" begins with a gorgeous sequence, director Akira Kurosawa treating us to several shots of soldiers on horseback, perched like gargoyles on a series of grassy hills. We assume these men are guarding the borders of some ancient Japanese kingdom, but it turns out they're running security escort for King Hidetora, an elderly warlord who is out hunting with his three sons.The film then quickly becomes a loose retelling of Shakespeare's \"King Lear\", Hidetora announcing his retirement and then proceeding to divide his kingdom equally between his three sons. In true Shakespearean fashion, Hidetora then stands back and watches with sadness as his spawn squabble and wage war, each interested in acquiring more power and respect than the other.But \"Ran\" is not simply a three-way battle between sons. One of the things that becomes apparent with repeated viewings are the subtle power plays being made behind the family. For example, rival warlords form alliances with the three brothers in an attempt to instigate battles between them, and the wife of one brother, Lady Kaede, moves like a serpent, constantly plotting against the King and his sons.Initially we sympathises with King Hidetora. After all, the poor guy loses his family and is forced to watch helplessly as his empire crumbles! But gradually we learn more and more about Hidetora's past; Kurosawa reveals that Hidetora was himself once a ruthless warlord who destroyed kingdoms and killed thousands. By the film's end we've thus witnessed a grand cycle being reset. Hidetora built his empire through violence and bloodshed and lost it likewise, one ruthless King essentially falling whilst another rises to take his place.So \"Ran\", which means \"chaos\" in Japanese, is less about King Hidetora's personal tragedy than it is about human tragedy on a much larger, more cosmic scale. Observe how Kurosawa uses various distancing techniques (he frequently cuts away to shots of cloud filled skies) in an attempt to convey the feeling that we are watching these characters and their petty squabbles from the heavens. With shades of Jancso (\"The Red and White\") and Kubrick (\"Paths of Glory\", the sublime \"Lyndon\"), Kurosawa's camera grants us the vantage point of enlightened Gods.Interestngly, \"Ran's\" aesthetic style is completely different to much of Kurosawa's early work. Kurosawa's pace is slow, his camera rarely moves, close-up shots are rare, the film's acting is stylized and mannered (drawing from Japanese Noh theatre, though perhaps also Brecht?) and characters are held at a distance. Most find this grating - none of the ingratiating of say, a David Lean epic - but this is a more mature, deeper and less imitable Kurosawa. Whilst his earlier features have been imitated to death, perhaps to the point where they have lost some of their power, \"Ran\" remains sublime.Gone also are the usual Kurosawan moral platitudes. There is little preaching here, and few of the trite moral lessons and dips into sentimentality that mar many of Kurosawa's early films. Indeed, it seems that Kurosawa only matured into a \"serious\" artist in the years leading up to and after his failed suicide attempt. He achieved a sort of gerotranscendence with his later films, shifting to a more transcendent vision of the world. These films thus have a very holistic view of time and space, life and death, moving away from ego-centricism to a more cosmic world-view. Perhaps such an artistic shift was spurred on by Kurosawa's own existential crisis in the early 70s.King Hidetora himself achieves gerotranscendence after a failed suicide. It is then that he stumbles upon a blind man who was once the victim of his past savagery. Forced to directly confront his past, his self image no longer based on illusions of heroism and glory, Hidetora promptly becomes a tormented spirit. Kurosawa has him wear a white face mask from this point onwards, tearing across the landscape like a ghost.\"Ran\" ends with a powerful sequence. An army marches in the foreground whilst, far in the distance, a blind man walks dangerously close to a cliff's edge, tentatively tapping away at the earth with his walking cane. The man's walking cane then hits open air, he stumbles slightly and the film abruptly ends. Kurosawa's point is clear: humanity is blind, perpetually on the verge of tumbling down some dark abyss. But note too how the blind man is elevated, far above the army down below. He may risk falling, but he, unlike most in the film, has begun his long climb back toward virtue. \"Ran\" is packed with similar, cleanly drawn \"metaphors\", though at times Kurosawa's dialogue is ridiculously direct. Entire sequences of the film spell out Kurosawa's themes, character dialogue signposting the director's moral messages at every turn. It's all at times very hokey (subtler in Japanese?).Needless to say, Kurosawa's compositions and use of colour are dazzling. At times the film seems like a series of landscape paintings and the master's soundtrack is also fairly experimental.Note to younger viewers, preconceptions in tow: there are no \"cool\" samurai battles here, only a melancholic battle sequence which Kurosawa shoots without sound. Such sequences are nightmarish rather than gratuitous, Kurosawa balking at the horror that other directors salivate over. \"Ran's\" stylized acting also takes some getting used to, requiring several viewings to fully absorb the film's various character motivations, traits, names, nuances and faces. One character, a copy of the court jester in \"King Lear\", is particularly annoying until we properly tune in to his role. Like Shakespeare's jester, he exists outside the story, designed to comment on man's follies.9.5/10 - Despite some heavy-handed dialogue, this is arguably Kurosawa's best film, and one which rewards (or gets richer with) repeat viewings, something few films genuinely do."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0225475",
      "warningSpoilers": false,
      "date": "21 November 2000",
      "rate": "",
      "helpful": "41 out of 78 found this helpful.",
      "title": "Noh Lear This is Noh Lear This is Noh Lear",
      "content": "What a wonderfully varied medium film can be! Here we have a film that is both truly great and in a different way a clumsy mistake.By now you know that this was made by a master filmmaker at the end of his life -- in preparation for ten years and Asia's most expensive film. He intended it to be his last, his masterpiece.The Good: This work of art is a sequence of masterfully composed images. The camera remains stationary or virtually so, and each scene is richly rewarding in all the visual dimensions, including motion. The costumes are the most cinematic I have seen. There is a use of grasshopper sounds that is the best example I know of amplifying an image by sound. The frame of the picture is the landscape -- little takes place indoors, and that action always refers to some larger, exterior motion. In my experience, this is the best complement of Wells' Othello, the most masterful use of interior space I know.I give it a ten because it is a masterpiece in this area of cinematic communication, one that seems exceptionally underaddressed.The Bad: The Master attempted too much in trying to match his cinematic virtuosity by swallowing Shakespeare's Lear to produce an equally rich story. In this he fails -- so many problems here. First, Shakespeare wrote plays for a barren stage where the images grow from the mind, supported by super-rich language and interwoven visual metaphor. The scene grows from our understanding of the character and what that character says. Kurosawa tries it backwards here by placing characters is a vast scheme that came from his own mind, off-screen as it were, and it doesn't quite work.As it happens, Ran's emphasis is on grand motion. Little time is spent on character development, except with the scheming wife of the first son (a story element that has little Shakespearean counterpart). Lear is a play about demons and leaves the question open as to how many are from opportunistic devilment and which are internally generated. All this is discarded here, as well as the Gloucester counterplot. Among the great losses from the source are the continuous examinations of what sight means and what it can conceive. How fertile that would have been as dramatic scaffolding for Kurosawa's vision.There's a problem with language as well. Not knowing Japanese, I cannot judge how rich or intricate in metaphor is the film's dialogue. But the sound and dramatic utility of the speech is about as far from Shakespeare as you can get. Shakespeare uses his actors' speech to simultaneously move the dramatic action and to serve as a surrogate for the viewer's mind. Both the story and your own ruminations on the story are contained therein. This depends on a continuous, predictable assumed rythmic base which is articulated by a rich consonant based, cheating rubato. Japanese consists of staccato vowels that I suspect are overly dramatized in the short blasts we get from these characters. Could hardly be more unShakespearean. I assume there is a Noh legacy being mined here instead, which is not available to this western viewer.A side note: after seeing these battle scenes you'll never appreciate Speilberg's blatant ripoff in the first part of Sgt Ryan."
    },
    {
      "username": "shron",
      "userUrl": "https://www.imdb.com/user/ur0192646",
      "reviewLink": "https://www.imdb.com/review/rw0225502",
      "warningSpoilers": false,
      "date": "27 December 1998",
      "rate": "",
      "helpful": "72 out of 93 found this helpful.",
      "title": "Pain and beauty are not mutually exclusive",
      "content": "Ran takes viewers to a place they would rather not explore on their own. In a world of cruelty, Kurasowa has shown how the moments within the horror can have beauty. Shakespeare wrote King Lear as a mirror on the human condition. We do not have to be kings and princesses to identify with the father's desire for the well being of his children, even if his own life was one of cruelty and pain. We see this theme throughout great literature and film. What Ran has done is to provide the viewer with many small moments within the pain to realize the beauty. Even the moment of epiphany for Hidetora, when his actions achieve his madness, is one of surpassing beauty. As the storm rages outside the small house of the prince he blinded, whose parents he killed, whose sister he forcibly married off, the simple sounds of the flute provide an intense focus on the here and now. It is at this moment when Hidetora recognizes that he himself sowed the seeds of his own destruction. There is no dialogue, no swashbuckling, just the terrible beauty of the music. As with many of Kurasowa's films, despite their epic scope, it is the small paint strokes that make up the master's canvas."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2625248",
      "warningSpoilers": false,
      "date": "10 June 2012",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Akira Kurasawa's take on King Lear",
      "content": "I loved Kurasawa's Throne of Blood, and heard this was even better. And indeed it was, for me second only to Seven Samurai as his best film and one of the finest movies ever made. As with any Kurasawa film, it is superbly made with the camera work in look and technique masterly and the colour and period detail really sumptuous. The battle sequences are even more epic in scope and emotional impact than Seven Samurai, aided by the spectacle and camera work. The music is rousing and haunting, almost sometimes paying homage to Mahler, the script is literate and thoughtful and the story intensely moving. Add to that Kurasawa's ever immaculate direction and the truly remarkable lead performance Tatsuya Nakadai and you have an even more brilliant film. Rounding off is the truly Machiavellian performance of Mieko Harada as the daughter-in-law figure. The over-two-and-a-half-hour length and slow pacing didn't hinder Ran in the slightest, at least to me anyway, though some not used to Kurasawa's style may be deterred. In conclusion, there wasn't much I really could add to the wonderful reviews already, but I do think Ran is a superb film with much to admire. 10/10 Bethany Cox"
    },
    {
      "username": "kluseba",
      "userUrl": "https://www.imdb.com/user/ur22956348",
      "reviewLink": "https://www.imdb.com/review/rw2644048",
      "warningSpoilers": false,
      "date": "17 July 2012",
      "rate": "4",
      "helpful": "38 out of 79 found this helpful.",
      "title": "Failure at the highest level",
      "content": "This movie came as a big disappointment to me. I really adore Japanese culture and history and I am a big fan of Asian cinema. I was looking forward to see a film that is considered as a masterpiece by many and has risen to world wide fame.I was surprised to see so many flaws in this film that I don't even know where to start. First of all, the movie is far too long and lacks of fluidity. The story is extremely predictable and develops no tension at all. The script is very poor and unoriginal. It steals several ideas from many other theatre plays and movies. One always feels that one has seen the same story elsewhere before and in a much better way. The beginning is overlong and should have been shortened. The middle part with the scenes in the field and the destroyed castle include many lengths. The ending is not well told and finishes too abruptly on the other side.The battle scenes are a complete fail. We see a shot of soldiers shooting in a forest. In the next shot, we see five soldiers yelling and falling from the horses to die on the ground. Repeat the two shots five times and this is what the battle scenes of this movie are like. There is no action, no aesthetic and no emotion in those scenes. It rather looks like a chess game than a true battle.The dialogues are amongst the poorest ones I have ever witnessed in cinema and I have seen thousand of movies. They are extremely wooden and sometimes so ridiculous that I had to laugh out hard. The scenes including the arrogant, philosophical and schizophrenic fool are annoying. When the old lord gets insane and just always says the same couple of sentences throughout the second half of the movie and shares many scenes with the fool, the whole thing looks like a parody in form of an old fashioned theatre play for kids. Some intellectual people will now talk about the irony that the fool always tells the truth and switches roles with his master and that the poor old man saved the fool and that this action started all the intrigues but this is no excuse for so many poor and repetitive dialogues.The characters are not credible. The movie tries to include many hints at traditional Japanese culture but these elements are exaggerated and don't seem authentic at all to me. The role of the fool that insults everybody around him but stays extremely faithful to his old master once he has gone insane is ridiculous. A man that shows this kind of disrespect would have been executed in traditional Japan. A woman like Lady Kaede would have never been so successful with her predictable intrigues. Any credible husband or brother-in-law would have given an order to execute her. The fact that Lady Sue could easily escape from the castle and go to her brother is not credible at all even if she got help. One would have followed and killed her and the traitor that refuses to obey his master and its sister-in-law would have been executed, too. It also seems strange to me that the lord's adviser finally kills Lady Kaede without getting the order by his superior while the lord stands next to him and doesn't react. I'm not an expert of Japanese history but from what I have seen from other movies, read from several books, known from history lessons and heard from Japanese that I could meet, many of these scenes don't seem realistic to me at all if I think about the severe code of honour of this country.After so many negative aspects, let's mention some positive things. Even though the characters aren't credible and the dialogues are wooden, it's not the mistake by the actors but by the writer and director. The acting itself is well executed and should be praised. It's the only thing that kept me watching this flick until the end. To give you an example, the interpretation of Lady Kaede or the annoying fool are well done from an objective point of view.At the time of its creation, this movie was Japan's most expensive production ever. Akira Korusawa was a big name and he got some good connections. You can see this by the inclusion of many supportive actors, excellent settings and especially many valuable costumes that are created with much detail. The film is quite colourful and beautiful to watch. Only the camera cuts are stiff and some potential is wasted there.Concerning the story, even though the whole thing is predictable, some of the intrigues are still well done. After a weak start and before a weaker second half of the movie, we have around forty-five minutes or so that are really entertaining and have some plot development. This is the strongest part of the movie.In the end, there are some positive points to mention but the weaker ones are in majority. It's definitely not the mistake of the costume makers, the actors or the light and sound engineers that do an almost flawless job. It's the fault of the poor writers and the headless director. Shame on you, Mister Akira Korusawa. Even a big name can't save this film that must be considered as a failure at the highest level. It's not the worst thing I have seen but still below average. I definitely don't recommend this movie to anybody apart of fans of gorgeous costumes and old fashioned theatre plays."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3567877",
      "warningSpoilers": true,
      "date": "24 October 2016",
      "rate": "9",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Kurosawa's late historical masterpiece is one of the best Shakespeare adaptations out there",
      "content": "This was my fourth Kurosawa film and my favourite to date. Previously, I'd started off by watching SEVEN SAMURAI (a great film), then trying out KAGEMUSHA (which I thought was okay, but too constrained by budget). Next up was an early classic, RASHOMON, which was a fine human drama, and now comes RAN, Kurosawa's final historical epic and the film that he claimed KAGEMUSHA was a mere warm-up for. I can see that. RAN is an epic film, truly epic and one of the best-shot films I've ever seen. Every frame of the film seems to have been painstakingly composed and the result is a bright, colourful, and vivid production that fully brings to life the castles, costumes, and characters of feudal Japan.Tatsuya Nakadai, returning from KAGEMUSHA, here plays Lord Ichimonji, an immensely powerful ruler who concedes that power to his three sons at the film's beginning. However, his plans quickly go awry and before too long he finds himself ostracised from Japanese society and a literal outcast. This film is a loose reworking of the Shakespeare classic King Lear (another favourite of mine), something I really enjoyed as Kurosawa takes elements of the Shakespeare plot without following it slavishly. One of the best inclusions is the fool, who comments on the on-screen antics the same way as he did in the Shakespeare play.It goes without saying that RAN is a tragedy and, indeed, it must be one of the most tragic films I've ever witnessed. Those looking for a happy ending should go elsewhere as this is all about doom, despair, and overall the failings of human nature. There's a fine cast of stand-out performers but one of the best has to be Mieko Harada, whose Lady Macbeth-style character is vengeful and terrifying. Nakadai, unrecognisable in ghostly, age-old makeup, is outstanding as the lord losing his mind, and Kurosawa is there to capture every little nuance. The most dramatic part of the film is a massacre set in a castle which is full of on screen death and destruction and successfully depicts the ferocity of battle better than 99% of other films do.Like most of the Kurosawa historical epics, this is a lengthy and slow moving film, one that emphasis characterisation over action, plot over incident, but it's well worth sitting through. In the end, I found this one of the most rewarding films I've ever watched and anybody who professes themselves to be a fan of the cinematic medium should have it in their collection."
    },
    {
      "username": "raistlin_lukas",
      "userUrl": "https://www.imdb.com/user/ur6215461",
      "reviewLink": "https://www.imdb.com/review/rw1122364",
      "warningSpoilers": false,
      "date": "9 July 2005",
      "rate": "10",
      "helpful": "88 out of 126 found this helpful.",
      "title": "Single. Greatest. Shakespeare. Adaptation. Ever.",
      "content": "Thankee kindly.Kurosawa, while a great director, isn't somebody whose films I blindly endorse.However, Ran takes the cake. It easily makes my personal top five films any time I think about it.The imagery is absolutely stunning, and the dialogue is quite clever. The battle scenes are suitably horrific, and the humor (and yes, there is humor) is subtle enough not to get in the way.All told, one of the greatest films it's been my privilege to see. I watched it to get the nightmare that was Cold Mountain out of my head, as proof that long movies can actually be epic, as opposed to boring, trite, and predictable."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2127612",
      "warningSpoilers": false,
      "date": "16 September 2009",
      "rate": "10",
      "helpful": "5 out of 9 found this helpful.",
      "title": "A Masterpiece of War and Greed",
      "content": "This is film that everyone needs to see. It brings home the horrors of war, betrayal, and greed. When the kingdom is divided among the sons in this version of King Lear, we just know that the person who bares himself honestly is going to become an outsider. The acting is sensational, with masterful personal encounters. Kurosawa even managed to keep the fool as an integral part of the story. Others have eloquently dissected this movie. What I have to offer is that there is such a poetry to the visual aspects of this film. While the battle scenes are among the goriest and grizzliest that have ever been put on celluloid, there is a dance here, a wave of the most intense coming and going as we watch the soldiers fall. It tells how potentially good men can be influenced by the forces of evil. The wife of the first son is purely vengeful, and horrifying. She is nearly a carbon copy of the woman who played the wife of Mifune's Macbeth character in \"Throne of Blood.\" I have been reviewing the Kurosawa canon and am convinced that this may be his finest work."
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1170896",
      "warningSpoilers": true,
      "date": "12 September 2005",
      "rate": "10",
      "helpful": "14 out of 28 found this helpful.",
      "title": "King Lear adaptation..and Great!:)",
      "content": "Usually, I don't write comments of movies that have too many reviews. But this one is so good, that I decided to break this rule. Ran is an adaptation of King's Lear, a story from William Shakespeare , very tragic and full of treasons.Lord Hidetora Ichimonji, already old, decides to pass his powers and leadership for his older son,Taro,leading the other two as rulers of the other two castles. Saburo is the only son who says that is not happy with that decision,speaking against his father. This one,being fooled by flattery of the two older sons,decides to banish Saburo of his lands.After this, what comes is a series of perfidiousness of his older sons,and even his daughter in law, lady Kaede,who wants to revenge her family,since they were the true owners of the castle, and were killed by Hidetora.Hidetora becomes mad, and totally exiled from his lands. And he discovers that his son Saburo, was the only one who really was loyal to him.There are many messages in this movie;one of the them,clearly is that not all the compliments are honest, and they can have bad intentions behind. Sometimes,someone near you can look insolent,but is only being honest. It's better a horrible true, than a fake lie,although not all the people are prepared to listen to the true. Not to mention that sometimes, you think that the person who is going to help you,really doesn't care about you,(like Hidetora's older sons) and you find all the help you need, in people you expect to not even be concerned with you. (like Saburo,the exiled son, and even Tsurumaru, who has lost everything he had, including his eyes because of Hidetora, and even on this way, he helps the old man with shelter.)Kurosawa also shows a vision about the mankind: We only search for war and sadness, instead of happiness and peace. We, humans, alone,are destroying ourselves."
    },
    {
      "username": "sherbetsaucers",
      "userUrl": "https://www.imdb.com/user/ur14124007",
      "reviewLink": "https://www.imdb.com/review/rw1592618",
      "warningSpoilers": true,
      "date": "6 February 2007",
      "rate": "10",
      "helpful": "13 out of 20 found this helpful.",
      "title": "Awe Inspiring",
      "content": "At the core of this movie there is a long running philosophical question. Certain characters continually question what is happening around them, and through these questions, the themes of the movie are forthcoming. The most obvious theme is that of war. Here, once again, Kurosawa reminds us that modern warfare is not a place of honour or duels, but massed attacks on faceless enemies, shooting each other from a distance. I will discuss the battle scenes later in this review; they help us examine the chaos that is again consistent throughout the film. It seems that no one in this movie has any control over the events that are transpiring; not even the ultimate manipulator Mieko Harada as Lady Kaede has true control. This lack of control seems to mirror the idea put forward by the only character who is continually able to tell the truth without ramification. Shinnosuke Ikehata (credited here as Peter) is the fool who says 'Are there no gods... no Buddha? If you exist, hear me. You are mischievous and cruel! Are you so bored up there you must crush us like ants? Is it such fun to see men weep?' Even if god exists then the only pleasure he enjoys is watching mankind destroy itself in the chaotic mess that is war. The final scenes see chaos erupt, as through the good natured actions of one man, 4 armies are dragged into a bloody battle. Which leads us to the idea of futility and death. The pointlessness of life is summed up once again by the fool. 'Man is born crying. When he has cried enough, he dies.' Death comes to us all, yet it is far bleaker than that. If there is a god then they allow everyone to suffer. Even a noble character, like Saburo, dies an ignoble and futile death. Everyone within this movie is both hunter and hunted. It is a bleak world indeed.Then we have morality. There are very few 'good' characters here, but there are three exceptions to this. Saburo, Lord Hidetora's third and youngest son, who because of his love and loyalty to his father is unable to not speak out at the foolishness he sees around him, which leads to his banishment. Tango, a loyal servant to Lord Hidetora who is banished with Saburo, but through love for his lord disguises himself so as to stay near him. Finally there is Kyoami, the fool. He again is loyal to his Lord, however, he voices ideas of leaving his side numerous times, but again his sense of duty and even affection keep him with his master.The movie itself is near perfect. Stylistically it is almost like watching a play. Both the staging and the style of acting are clearly very influenced by Japanese Noh theatre, with the slow and deliberate style of acting used, and the mask-like appearance of age notable in the make up of Nakadai as the seventy year old Hiderota. Every shot looks like a masterpiece, perfectly framed. Kurosawa trained as an artist, indeed he painted the storyboard for every shot in the film. The framing is perfect and in most senses the camera does not move at all, or if it does, it is simply to keep the perfection of the shot intact. Kurosawa was a master film maker, this is clear throughout. His confidence with film is breathtaking: only a director totally sure in his craft would dare leave the long, motionless pauses at the end of almost every scene, punctuating what has just happened and allowing the audience to grasp the full implication of the actions taking place.Kurosawa is, of course, well known for his ability to direct action, and this movie recreates war in a way few others have ever managed to do. There are two great battles here, one in the middle and one during the end. The final battle is perfectly staged, riveting, and speaks volumes of the futility that the lust and pride of Jiro Masatoras, Hiderotas second son (played by Jinpachi Nezu) has led to. But for me it is the first battle that is the one of the greatest moments in cinema. Due to council given by a traitor, Lord Hidetora has led his household, which includes 30 warriors, to the castle of the outcast Saburo. It is a trap, and Taro Takatora (Akira Terao), his first son and Jiro strike. What follows is horrific. This is the purist language of movie, and a thing of true genius. On the battlefield, even in the world of the Samurai, there is no honour, no real glory, only ugliness and death.It is interesting to note that seeing someone actually kill another person in this movie is rare. Considering the acclaim Kurosawa has garnered for the sword fighting sequences in so many of his movies it is interesting to note that not once do you see a sword kill another person on screen. Indeed, there are only two times we really witness one person attacking and killing another, other than mutual suicide. The first is entirely shown at a massive distance, the figures barely distinguishable, and the second, despite being amazingly gory, does not actually show the death itself on camera.Yet with all of this emphasis on framing, shot, symbolism and colour, Kurosawa manages to bring to the screen some of the greatest performances I think I have ever witnessed. I have to cut short my praise of what is a faultless cast and talk about Mieko Harada giving perhaps the finest performance in the movie. Driven by anger and vengeance she becomes something other than human, she is some kind of succubus, a temptress, a fox-spirit. Harada is at all times compelling, her every movement one of cold perfection and as we hear her silk robes rustling as she glides along the wooden floors we see before us an unforgettable creation of pure evil."
    },
    {
      "username": "oakbymaple",
      "userUrl": "https://www.imdb.com/user/ur64515581",
      "reviewLink": "https://www.imdb.com/review/rw5941415",
      "warningSpoilers": false,
      "date": "26 July 2020",
      "rate": "6",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Maybe a masterpiece, but only to Connoisseurs",
      "content": "The Movie certainly has its qualities: carefully built characters, impressive costumes and scenery and an apparent skill in storytelling, at least in some places: the bigger hollywood productions of these days could probably learn tons here.That being said I don't think it's a great movie. It's hard to follow at some points, especially at the battle scene and in its more experimental sequences. Here, heavy with meaning symbols are extensively presented, which not only makes the plot appear very drawn out but also hard to grasp: they are so abstract at times that picking up on them is rather unlikely, unless you have a profound literary background knowledge and a trained eye of course. The strong influence of classical theatre is also only a plus for the more educated: for instance characters proclaiming their thoughts and feelings is a necissity on stage, but in film this feels kind of out of place. The same goes for the demonstrative use of the names of the scene of events: it's obviously a legitimate means of conveying critical information and also meaning in a script of a play, but film offers so many more and much more effective options than that. Also: Why is \"going insane\" such a must-have plot item in a classical drama?All in all it's a movie that definitely will have its place in the collections of enthusiasts, but to everyone else it might just be too tough to chew. If you're not into Shakespeare or theatre in general, this movie probably isn't too enjoyable for you."
    },
    {
      "username": "ebossert",
      "userUrl": "https://www.imdb.com/user/ur10058980",
      "reviewLink": "https://www.imdb.com/review/rw2027624",
      "warningSpoilers": true,
      "date": "21 February 2009",
      "rate": "4",
      "helpful": "27 out of 60 found this helpful.",
      "title": "Another Display of Directorial Ineptitude from the \"Master\"",
      "content": "Review in one sentence: This movie has zero energy. What follows is my fragmented, chronological lambasting of this \"masterpiece.\" The characters are cardboard cutouts with very little in terms of actual development. The opening scene begins with an argument between Hidetora and his three sons. It's almost like it assumes retroactive character maturity that was never established to begin with. It would have been nice to see some color in terms of personality, with each of these three key players given some screen time before the big fallout. In the seemingly endless line of miscalculations made on the part of our favorite \"masterful\" filmmaker, Akira Kurosawa (\"AK\") decides to provide *his* kind of \"color\"  vague one-liners. The \"pranks\" of the third son are referenced, but we get no actual development of his character (he does have one good moment later on). As for the other two sons, we don't even get AK's fuzzy caricatures. This viewer was left wholly indifferent by all of these sons, and their opaque motivations didn't help matters.Even worse is the portrayal of the vitally important fifth character. In AK's infinite stupidity, he chooses to have the key puppetmaster (Lady Kaede) simply state that her father and brothers were murdered by Hidetora and that her mother committed suicide. There is ample opportunity for a flashback (or a lengthy opening historical segment) that actually fleshes out her character while allowing the viewer to experience her sorrows directly, but AK simply settles for dull monologue by a one-dimensional personality. At one point (early in the film), she's sitting down and simply states that she's happy to be living in her old residence again. It's an utterly robotic, emotionless, tedious series of statements that are boring as hell. Only AK could portray vengeance in a manner this dull.We get the first battle and see a bunch of generic guys killing each other with no reason to care who actually wins. Some women that we don't know kill themselves along the way. There are some decent visuals though. Not bad, but not exactly scintillating.After the battle we get some of the vintage overacting that shows up in most of AK's films. Hidetora goes crazy and frolics in the grasslands. When his two buddies show up to comfort him, he stares into space, opens his mouth as wide as a Pez dispenser, and has a hissy fit while his jester runs around singing. It's a total disaster of dramaticism. But that's not all. Hidetora's buddies carry him to some random shack, only to learn that the resident just so happens to be a dude that got his eyes gauged out by Hidetora years ago. Impractical coincidence alert! So what does this blind dude do to the man who handicapped him for life? Does he curse him? Does he lunge at him with a knife? No. He plays a sad flute song. Hidetora then promptly throws *himself* through a wall. Such a \"masterful\" filmmaker, AK is.We go back to Lady Kaede, who magically goes from stoic carelessness to knife-wielding lunatic in 5 seconds flat, then takes another turn to hysterical crocodile tears only a few minutes later. Hey AK, that flashback would have been REALLY helpful. And do you know what else would have been helpful? A little relationship development between Kaede and the two sons to help the viewer in understanding exactly why these powerful men are wrapped around her little finger. You did have 160 minutes to use here. Why not use them properly for a change? Over 90 minutes in and we finally get a well-written moment when a stone fox-head is returned to Lady Kaede. Then again, even a broken clock is right twice a day. Of course, AK immediately follows this brief success with another laughable attempt at manipulation. The blind dude and his sister (who has become a target for assassination) are escorted to safety. His sister spots an old castle and tells him about it. He asks where it is. Now, any thoughtful sister would give her blind brother some idea of where this castle is. Perhaps she could take his hand and point it in the right direction. Unfortunately, this is one of those \"masterful\" Akira Kurosawa movies, so she simply blurts out \"Over there!\" The blind dude turns to the right, turns to the left, and asks \"Where?\" Some sad music accompanies this hopelessly incompetent scene where AK so blatantly reminds the viewer that  yes  the blind dude is, in fact, BLIND! Good ole AK wanted the viewer to feel sorry for the blind dude, so he constructs this ridiculous scene to pile it on. I laughed. The direction here is so terribly amateurish that only fanboys could possibly deny AK's clumsy incompetence.Hidetora gets amnesia and babbles senselessly. Stuff like, \"Who am I?\" and \"I'm lost.\" \"Such is the human condition\", replies the jester. Give me a break. In a truly hilarious moment, the jester tells Hidetora to simply jump off a cliff if he's so disturbed about everything. Hidetora promptly jumps off a cliff. I laughed. Later on, Hidetora suddenly remembers that he has three sons. I'm serious.We get the final battle, which is pathetic. First of all, the blue samurai army somehow gets their hands on some semi-automatic rifles. What on earth are semi-automatic rifles doing in this period piece? Next, the editing is atrocious. The sequence is so badly cut up that one wonders if a young Paul Greengrass was hired as the action director. Third, the battle strategies suck. The red army rides around in circles while the blue army shoots them down. Not good.AK finishes things off with his patented overdramaticism. Hidetora even goes so far as to say  out loud, no less  \"Things are getting dark.\" Wow. Just wow."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1996097",
      "warningSpoilers": false,
      "date": "26 December 2008",
      "rate": "",
      "helpful": "4 out of 8 found this helpful.",
      "title": "Plays on an epic scale but is driven by the hearts of the characters",
      "content": "Lord Hidetora announces his plans to step down as Lord of his lands and, whilst he does keep title and men, all will pass to his eldest son, with his younger two sons each taking control of the second and third castle. Youngest son Saburo derides his foolishness, claiming that this will split the kingdom and that natural divisions will rise up, but he is dismissed by all and banished by Hidetora for his dissent. So the change begins and internal wrangling occur immediately with Taro's wife Kaede stirring up ill feelings in him against his father.The things about mediocre films is that often they are easiest to watch and so often I pick them over more interesting fare simply because it seems like the easiest thing to do. So-so films offer you little but conspire to take little from you other than time. So I regularly find myself in a position where I have seen lots of films but yet cannot comment on some that are considered classic. Recently I was in Paris for a week break and stumbled upon a showing of paintings and sketches by Akira Kurosawa and, having been watching some of his black and white films of late I paid my money and went in. The paintings were mostly designs for his films and yet again I found myself wondering why I had not seen these films even though I knew of them and had read about them on lots of critic's list. LoveFilm helped me again by supplying Ran off my list a few months later and I'll be honest and say it sat for a few weeks in favour of lesser stuff.Finally seeing it I regret leaving it so long because it is a great film that paints on an epic scale as a clan collapses on itself but still manages to tell the story at a personal level of the corrupted and the corrupters. Unmistakably King Lear in construct, the film is engaging throughout as we have battles and treachery all around but yet the descent into madness of the Lord is still an interesting section to the film, as is the treachery and bitter hate of Lady Kaede. It is a fascinating tale and one that benefits from the richness that Kurosawa is able to give it. His use of open landscapes and convincing period locations adds quality to the film and the whole thing is shot with a great eye for beauty and colour  credit to the cinematographer. The script is functional at times but mostly we have real characters portrayed, which makes the film more engaging as they betray and are in turn betrayed. The cast use this very well but a couple of performances do stand out. Nakadai will appear a bit overdone to Western eyes in his heavy white make-up but this must be accepted in the way it is done, which is a cultural reference. Behind this though his performance is great as he starts powerful and wise but falls through rage into madness. It is a powerful theme of the film that part of his fall is a recognition of what he himself has done in the past and how that is coming for him whether real or imagined. Harada is the second turn that sticks in the mind as she is sly evil personified; not the most subtle of characters perhaps (I preferred the similar character in Throne of Blood) but she dominates her scenes and is quite intimidating as a screen presence due to how well her ruthlessness comes over. The sons are all well played in different ways with Terao, Nezu and Ryu all having different types of material to show what they do. I liked the fool played by Ikehata and how the script used him opposite the Lord and the massive supporting cast of generals and extras are all convincing and stout.Ran does have a hard time going for it in regards modern audiences; not only is it subtitled and over twenty years old but it is also a rough adaptation of Shakespeare  not really anything that a MTV viewer will jump at. However it is worth the jump because it is a great film with consistently interesting themes, strong performances, great direction and a story that runs in the hearts of the characters but is played out on an impressively epic scale. Well worth seeking out and another reason why Kurosawa has the reputation that he does."
    }
  ],
  "errorMessage": ""
}