{
  "imDbId": "tt0209144",
  "title": "Memento",
  "fullTitle": "Memento (2000)",
  "type": "Movie",
  "year": "2000",
  "items": [
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3533358",
      "warningSpoilers": true,
      "date": "28 August 2016",
      "rate": "9",
      "helpful": "58 out of 61 found this helpful.",
      "title": "Genius thriller",
      "content": "This unique and well-crafted tale is a top-notch thriller packed with suspense, excellent characterisation, and a style of story-telling which means the viewer has to use his or her brain for a change. Unsurprisingly it seems to have been ignored by the mainstream crowd, but in any case it's one of the best (if not THE best) films of 2000. Guy Pearce is outstanding in the leading role of Leonard, a man who has developed a short-term memory loss syndrome since a horrific accident which means he cannot remember anything for longer than twenty minute intervals. Thus he is forced to tattoo clues on his body and take Polaroids to remind himself of his quest, which is to hunt for the man who raped and murdered his wife and kill him.The genius thing about this film is that it starts at the end (Leonard begins the film by killing the man responsible) and goes back to the beginning. I was pretty sceptical of how this would work but director Christopher Nolan has done himself proud. The style of story-telling involves one scene ending and the next scene finishing at the beginning of the previous one. Confusing at first, but don't worry as Nolan takes things slowly, giving the viewer time to get used to the method before hitting them with two-faced characters, plot twists, and some tense situations. The film is extremely suspenseful in that you really get inside Leonard's head and can sympathise with his plight and the unusual story makes for lots of interesting situations and ideas. On top of this, there's a breath-taking surprising twist ending (or is that beginning?) which rewards the viewer for watching and is as good as any I've seen beforehand (THE USUAL SUSPECTS or otherwise). The film is technically excellent, the supporting cast brilliant, and I can't fathom why Nolan or Pearce failed to get Oscars for their parts in this. Seek it out now."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw0665539",
      "warningSpoilers": false,
      "date": "7 November 2001",
      "rate": "9",
      "helpful": "21 out of 22 found this helpful.",
      "title": "Mind Blowing",
      "content": "I spent considerable time doing research on the brain for a class I was teaching. One of the most intriguing things I dealt with was the idea of short term memory. There are cases of people who carry around a suitcase with them, containing all the things they need to continually review to stay in the present with any sort of functionality. I had heard about this film and read a very sketchy review. I rented it because I knew my family wouldn't be interested in the violence. So late at night, I sat and took this film in with total concentration. I need to watch it again, but right now it may have cracked my top ten list. The last time I was so enthralled by a film was Coppola's \"The Conversation.\" Both of these films are fairly bleak and occasionally confusing and absolutely captivating. How anyone can be bored by this with all the junk that is being produced these days, I will never understand. I know it's a gimmick film. I know it's manipulative. So what? Don't all films manipulate us, especially those steeped in mystery and suspense. I knew exactly what was going on and I couldn't wait to see how it ended (began). At first there are so many questions--why the self mutilation? Why are these people treating this man this way? Where is he? How did he get there? Who does he work for? Does he actually work for anyone? And yet, how skillfully is is all done. I suppose if you want to begin nit picking, you can come up with a few inconsistencies. This doesn't detract from the way that the principle character floats from even to even, trying to recoup his memory each time he faces the day. The one thing I will grant is the emotional investment required for revenge--but because he is aware of his shortcomings, he feels he must act. If you are bored with most movies these days, rent this and it will affect you for a long time."
    },
    {
      "username": "nateahoey",
      "userUrl": "https://www.imdb.com/user/ur69227231",
      "reviewLink": "https://www.imdb.com/review/rw5989689",
      "warningSpoilers": true,
      "date": "13 August 2020",
      "rate": "10",
      "helpful": "185 out of 189 found this helpful.",
      "title": "I guessed and guessed... I never got close.",
      "content": "I know that it's a little late by now for this review considering this movie is twenty years old by now. However, it's still amazing. The way that Christopher Nolan puts this movie in a jumbled order that you don't quite realize until halfway through is genius. What's very interesting is how you have to think for a while then you get it. Spoilers ahead stop reading if you haven't seen it yet! You have the movie starting with him shooting Teddy, and then how he got there in the next scene, but what's funny is you think it's leading up to (or I guess leading down to) how he's going to reveal that Teddy is the bad guy. He is not! He's a cop, a not crooked one but a cop all the same, that's using a guy with no short-term memory to kill off drug dealers. Then you have Natalie, who seems nice but is ripping him off just the same and is using him to kill drug dealers that are competition and to get the cop off of the streets. You have him being used by everyone around to fit their purpose, turning him from a man on a revenged quest to basically a serial killer. They make him kill who they want as long as they justify it will help him. It's very well told and really makes you mad that the guy you're rotting for is a killer that's been duped. Nobody is a good guy. There is no hero. And why is it good then? It plays with your mind so well, you walk away and contemplate on it forever. Great movie, one of Nolan's best ever."
    },
    {
      "username": "Old Joe",
      "userUrl": "https://www.imdb.com/user/ur0849886",
      "reviewLink": "https://www.imdb.com/review/rw0666028",
      "warningSpoilers": false,
      "date": "6 February 2003",
      "rate": "10",
      "helpful": "188 out of 217 found this helpful.",
      "title": "Some memories are best forgotten. You have to appreciate how original a movie Memento' really is!",
      "content": "Losing your memory would have to go close to one of the worst experience anyone could ever suffer from. In the movie Memento', we get to see how bad it is to suffer from short term memory loss. It also gives us the chance to see how far a patient of such a disease will go to remember what is most important to him. In the vain of Pulp Fiction', Memento is a movie that has to be seen to be believed. It is no wonder that this movie is so popular with the movie going public around the world. Leonard Shelby wears expensive, tailored suits, drives a late model Jaguar sedan, but lives in cheap, anonymous motels, paying his way with thick wads of cash. Although he looks like a successful businessman, his only work is the pursuit of vengeance: tracking and punishing the man who raped and murdered his wife. The difficulty of locating his wife's killer is compounded by the fact that Leonard suffers from a rare, untreatable form of amnesia'. Although he can recall details of life before his accident' Leonard cannot remember what happened fifteen minutes ago, where he is, where he is going, or why.Christopher Nolan has made one great (but confusing) movie. His style in directing and editing Memento' is quite unique, as no movie has ever been made quite like it before. The story being told in a backward kind of motion makes the audience have to think hard about what they are watching. It also makes the audience feel for a guy like Leonard, whose condition only gets worse and worse as the movie goes on. I am almost 100% sure that Nolan and his brother Jonathan, made up this story in the realisation that it was meant to be confusing. What is also cleverly done by Nolan is the use of black and white and then colour shots. In my opinion, the variations in these shots are used so it confuses the audience even more. Guy Pearce's role in Memento' shows me why he is so successful in Hollywood today. Pearce plays Leonard Shelby, a man on the hunt for his wife's killer. The only problem is that Shelby is suffering from anterior-grade amnesia', a disease that cannot be treated. With Lenny', I feel the audience suffers partly the same condition as he does, and partly does not, as we can remember what has happened in the present. Memento's other main stars include corrupt cop Teddy' (Joe Pantoliano). A friend said of Pantoliano's performance in Memento, he was perfect for the role of Teddy', as he comes across as the mysterious bad guy'. I could not agree more. There is also the character of Natalie (Carrie-Anne Moss) who is a lot like Teddy in her own way. What is similar about these characters is the way they use Leonard's condition to advantage their own situations. Other characters include Sammy Jenkis (Stephen Tobolowsky), who is a victim we learn about from an old case when Leonard Shelby was an insurance investigator. There is Leonard's wife, Catherine (C.S.I.'s Jorja Fox) who is another fascinating character. Although we do not hear her say much, she is a vital part of this most confusing story. Add in the funny role of Burt (Mark Boone Jnr.), the motel clerk, who openly admits to Lenny that he is ripping him off, by giving him two rooms, but that he will not remember it happening anyway.Yet in no way do any of the characters in Memento' realise they are in a time reversed movie. I am sure that many of the performers would have had to read their scripts many times to understand what was happening from a cinematic point of view. But from an acting prospective, this would have been an easy experience to be part of. Memento also has some interesting devices to tell the story. The way Leonard tries to remember things in the present and the future, via notes tattoos and photographs, making them an important element within the movie. Without them, our hero would not be able to remember anything. Nonetheless, memory is the most vital element in this movie, because without it, people are confused, isolated and abused, which is what happens to our hero', Leonard. As Lenny mentions early on in the film, \"Memory's unreliable ... Memory's not perfect. It's not even that good. Ask the police; eyewitness testimony is unreliable ... Memory can change the shape of a room or the colour of a car. It's an interpretation, not a record. Memories can be changed or distorted, and they're irrelevant if you have the facts.\" But it has to be ironic that Leonard is the one who narrates Memento', when his recollections and memories of events are inaccurate and jaded. There are also some powerful scenes in Memento'. The one which sticks in my mind the most' has to be where Natalie abuses Leonard, calling his dead wife a whore', snorting smartly that you won't be even able to remember what I have said'. So, if you watch this movie and it confuses you the first or even the second time, I can assure you that is how you are meant to feel, confused. If you hated watching Memento' the way Christopher Nolan intended, then I can only recommend that you get a hold of the DVD and watch it in chronological order, as it will really help you. Memento also shows how bad mental disease' patients can be abused by healthy people and what lengths sick patients will go to try and keep sane'. Also, if a movie makes you think, then in some way it has been successful in doing something that many movies do not do  making you think. Those sorts of cinematic experiences are the ones that we need to cherish for life, as they are few and far between. Memento is one such experience. CMRS gives Memento': 5 (Brilliant Movie)"
    },
    {
      "username": "quixoboy",
      "userUrl": "https://www.imdb.com/user/ur2620979",
      "reviewLink": "https://www.imdb.com/review/rw0666137",
      "warningSpoilers": false,
      "date": "1 September 2003",
      "rate": "",
      "helpful": "455 out of 512 found this helpful.",
      "title": "Addictive and fun to figure out",
      "content": "Christopher Nolan's \"Memento\" is truly a rare and exceptional achievement in modern filmmaking in that it manages to be new, fresh, hip, and exciting without ever tiring its audience out - unless you're walking into this film without the desire to participate and actively analyze the mysterious details.If that's the case, then this is DEFINITELY not a movie you should see. If, on the other hand, you are open-minded, creative, and alert, you'll definitely appreciate and get a kick out of this one. \"Memento\" is an old-fashioned \"film noir\"-type mystery thriller with an intriguing, ingenious twist: outfitting the entire film with a style that mirrors the protagonist's own mental condition while giving the poor viewer(s) his own perspective as well. It is masterfully filmed and edited in such a way that it is chronologically presented backwards (with two initially separate, parallel storylines - the main one, shot in colour, is the chronologically-backwards story with scenes that intercut with those of the other story, which is filmed more like a documentary, shot in black & white, and mostly takes place inside a motel room with the main character narrating, talking about the effects of his condition, etc.) While the average viewer may already be put off by such a complicated, confusing format, it is a very original premise that is well worth the struggle to figure out.Acting is solid across the board, as is the writing, directing, etc., but special kudos must be extended to the very talented editor Dody Dorn, who successfully managed to put all of these fragments together and help them flow in a smooth, healthy manner that is not easy to pull off.One of the most \"memorable\" (sorry, couldn't help slipping in the bad joke) films you're likely to ever see, \"Memento\" is an instant classic due to its groundbreaking narrative style and impressive dramatic undertones. For those jaded moviegoers who seek something to keep them awake, interested, and constantly thinking, there couldn't be a better choice than this film."
    },
    {
      "username": "ruffinelli_ro",
      "userUrl": "https://www.imdb.com/user/ur20682472",
      "reviewLink": "https://www.imdb.com/review/rw2047595",
      "warningSpoilers": false,
      "date": "4 April 2009",
      "rate": "9",
      "helpful": "68 out of 76 found this helpful.",
      "title": "A trip into the mind",
      "content": "If the director of this independent film tried to make us feel really confused, like the main character, he did it wonderfully. There are only a few movies like this one, the kind of movies that makes you pay attention to every minute of it. Obviously that doesn't work all the time, but this case is the exception. Really well directed with a wonderful photography and excellent cast. The main actors' performances are great. We really root for the guy as we hate the ones who try to take advantage of him.Original films like this one always stand out. Perhaps it didn't caught much attention at first but now it is in an important position at the IMDb top 250 and that means that most the people recognize great movies when they see them.As I said before, this movie is a little confusing because it runs backwards while the black and white scenes run in chronological order. But that wasn't a cheap trick to make the movie more \"intelectual\", it was its strength. A rare film that shouldn't be missed."
    },
    {
      "username": "wkbeason",
      "userUrl": "https://www.imdb.com/user/ur1796744",
      "reviewLink": "https://www.imdb.com/review/rw0665846",
      "warningSpoilers": true,
      "date": "9 July 2002",
      "rate": "10",
      "helpful": "178 out of 197 found this helpful.",
      "title": "Innovative narrative structure makes for a powerful viewing experience",
      "content": "FACT ONE: \"Just because there are things I don't remember doesn't make my actions meaningless.\"FACT TWO: \"Your notes could be unreliable.\"FACT THREE: \"Memories can be distorted.\"FACT FOUR: \"But, even if you get your revenge, you won't remember it. You won't even know it's happened.\"FACT FIVE: \"I want time to pass, but it won't. How can I heal if I can't feel time?\"FACT SIX: \"We all need mirrors to remind ourselves who we are.\"When life becomes incomprehensible human beings tend to simplify things, revise memories, select facts that may or may not be representative of \"the truth.\" We strive to make events as intelligible as possible but that act often has unintended consequences. Now, if you can capture this existential human reality on film in such a way as to allow the viewer to experience this struggle for understanding, for the placement of private aspirations into the context of the moment even as the primary character makes this same struggle, then you have connected our hearts and minds seamlessly with the film's lifeworld. That is a rarity indeed.Such is Memento, a brilliantly conceived and executed work of art that has its audience literally at their wits end (just like the film's main character) trying to understand it all. The great debate of whether Teddy's version of the truth at the end is really \"the truth\" is symptomatic of director Christopher Nolan's purposeful craftsmanship. The very fact that we are as uncertain throughout most of the film as to the context of Leonard Shelby's actions as Leonard himself signifies that Nolan has succeeded in not just telling us Leonard's story put allowing us to know what it is like to *be* Leonard. This allows the film to work at a much deeper, almost subconscious, level scarcely achieved on film.Guy Pierce, Carrie-Anne Moss and Joe Pantoliano all deliver terrific performances with some of the most original material I've seen in years. This film grabs your brain and won't let go. It twists and turns and  just when you think you've got things figured out  Nolan whips the rug out from under your feet. You are left totally involved and struggling with creating some sense of closure out of the infinite loop of the film's structure.You can debate endlessly whether Teddy's final summary of events is the truth. You can argue both sides of whether Leonard killed his wife or invented Sammy Jankis out of thin air. In the end these are open questions. In the end there are no definitive answers. In fact, in the end ANY answer is plausible, just choose the one that sits best in your mind. Make that the truth. Because THAT is what this film is all about. It's about a man who can remember who he is but not what he has done and, to that extend, it is the prefect postmodern critique. We are often forced to act without sufficient information. The accelerating rush of our lives sends us headlong into our present without full consideration of where we've been. And on that level Memento provides a bold, compelling narrative that connects Leonard with every person. It is the mirror image of our divided selves.No matter how much his audience might disagree with the film's conclusion, Nolan understands that - in the end - truth doesn't matter. It is what we choose to do with what we think is the truth that's important. And that can mean anything at all."
    },
    {
      "username": "ltlrags",
      "userUrl": "https://www.imdb.com/user/ur0157164",
      "reviewLink": "https://www.imdb.com/review/rw0664715",
      "warningSpoilers": true,
      "date": "18 March 2002",
      "rate": "10",
      "helpful": "630 out of 688 found this helpful.",
      "title": "An unforgettable trip into the mind of a man with no memory",
      "content": "If you're looking for something intense, suspenseful, and different than your usual effects-packed thriller, this is the best movie you will see all year. You will be talking about Memento at work, at the grocery store (to total strangers!), and you will find yourself joining conversations when you hear the word \"Memento.\" That's why this little film that received almost no marketing stayed in theaters for months and was in the top 10 money makers for several weeks.The movie starts with a murder -- a revenge killing, in fact. But was the right person killed?Leonard Shelby (Guy Pearce) is a man with no short-term memory. He hasn't been able to form new memories since the night his wife was murdered. Now he's on a hunt to find the murderer but with no way of remembering names, dates, places, facts and faces. Instead he tattoos himself with mementos of his search. When someone knows his name, he checks Polaroids to see if he knows them. Does he like this person? Does he trust this person? Is this the killer? He doesn't know unless he's scribbled a note.Don't worry about trying to empathize with Leonard because Writer/Director Christopher Nolan puts you right in Leonard's shoes. You live the story in reverse order so that you never know more than Leonard does. In one scene you see Leonard getting information from a person who knows him -- maybe a good person; maybe bad. In the next scene you see a previous meeting between the two which sheds more light on their relationship. Later still you see how they met. But is that all of the story? You've yet to find out... and you won't know everything until the last scene. By living it backwards, you, like Leonard, have no knowledge of what came before.It's brilliant story telling. But you might get frustrated because you don't know what's going on. That's normal. In fact, that's the whole idea. Just sit back, try to relax (though that's difficult in this movie), and find out just how twisted and complex Leonard's world is.This film will leave its own memento on your mind, and you'll have a hard time forgetting how much you enjoyed it."
    },
    {
      "username": "dunmore_ego",
      "userUrl": "https://www.imdb.com/user/ur2446936",
      "reviewLink": "https://www.imdb.com/review/rw1532595",
      "warningSpoilers": true,
      "date": "28 November 2006",
      "rate": "",
      "helpful": "38 out of 45 found this helpful.",
      "title": "The Reverse Genius Principle",
      "content": "9) And that's when we realize we could never be sure of anything to begin with.8) When Leonard eventually thinks he has found his wife's killer, eleventh-hour reveals shock us with the possibility that his whole crisis may be nothing more than delusion.7) Editing this movie must have been like navigating inside Las Vegas hotels with no watch or compass: sex and drug distractions, deprivation of day or night, no signposts or exit signs, and of course, nauseous on cheap shrimp and hairy tequila. Untold credit to editor, Dody Dorn, for shuffling the deck as confusingly as possible, yet weaving the tale as tightly as a sanitarium wicker basket.6) But every few minutes, the movie twists back on itself, each flashback a segment of Leonard's life that happened just before the segment we have just seen  and with each flashback, we realize just how wrong Leonard is about who his friends are, his past life, clues to the killer, his quest *in toto.* By about the fourth paragraph we realize: this piece is running backwards.5) From Jonathan Nolan's short story, *Memento Mori*, we meet Leonard mid-investigation, slumming it in a cockroach motel, having lost his job as insurance consultant, looking disheveled (as Guy Pierce can do so natchelly), and optimistically on the trail of the murderer; hanging with gregarious Teddy (Joe Pantoliano), and involved with hot bod, Natalie (Carrie-Anne Moss), both of whom seem to be aiding Leonard catch his killer.4) Leonard's last \"new memory\" was the murder of his wife. During the scuffle with his wife's killer, a blow to the head caused his memory faculty to shut down. Whether this is truly biologically possible (if you cannot make new memories, how do you even shop for food and water or pay the rent?), for the movie's purposes, it means Leonard must piece together clues to his wife's killer through copious notes, tattoos on his own body and Polaroids. But the truth will forever elude him and the clues that lead to the killer are mere wraiths, the products of his own \"selective\" reasoning.3) The harder you strive for something, the harder it is to grasp. But what you care least about - or that you were never striving for  falls into your lap. Some call this the path of least resistance, but it's actually called The Reverse Genius Principle. And Leonard - all ephemeral ideas and misplaced action  is a Reverse Genius in full throttle.2) Guy Pearce is the memory-challenged Leonard, who is trying so hard to move forward  to find his wife's killer, but unable to create \"new memories\" to retain info - that he ends up moving backward. Thusly, writer-director Christopher Nolan has crafted a film where the clues to a murder fall neatly OUT of place. Backwards.1) *Memento* opens with a killing. We don't know why. We don't know who."
    },
    {
      "username": "adamp-6",
      "userUrl": "https://www.imdb.com/user/ur0950119",
      "reviewLink": "https://www.imdb.com/review/rw0665716",
      "warningSpoilers": false,
      "date": "31 January 2002",
      "rate": "10",
      "helpful": "168 out of 201 found this helpful.",
      "title": "watch it early so you can see something else afterward.",
      "content": "I saw \"Memento\" in the early afternoon, a fact for which I am thankful. Why? Because it then proceeded to dominate the majority of my thoughts for the rest of the day. That night I lay in bed, tossing and turning, my mind trying to wrap itself around the story, and I absolutely could not GO TO SLEEP! I finally just gave up on sleep, got up around midnight, and watched \"Election\" to cleanse my palate. Then I went back to bed and starting contemplating \"Memento\" AGAIN. Finally, out of sheer exhaustion, I went to sleep.This is a movie that gets in your head and will not get out until you figure it all out. And that can only be done with extensive internet research. Reading \"Memento Mori\", the short story upon which the movie is \"based\" helped, too.\"Memento\" is nothing short of a phenomenon. And a brilliant one at that."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3624786",
      "warningSpoilers": false,
      "date": "22 January 2017",
      "rate": "10",
      "helpful": "31 out of 39 found this helpful.",
      "title": "A very strong contender for Christopher Nolan's best film",
      "content": "Christopher Nolan has always struck me as a very talented film-maker, and most of his films are ones that have impressed me a lot. Even weaker efforts, where his ambition can get in the way, have a good deal to admire. His films are all impeccably crafted technically, and often entertaining and thought-provoking, also knowing how to get good performances out of talented casts.'Memento' was not his first film, having directed 1998's 'Following', but has been considered by many the film that rose him to fame and brought the world's attention to him. Cannot disagree with this, and also that not only is 'Memento' his first great success but seventeen years later it gets my vote as his best film. It really makes one think hard about what is happening, crucial in a film where a lot of concentration is needed, without being treated like you are an idiot or dumber than you are. It is also one of the few Nolan films where it was difficult to find anything to fault.As always with Nolan, 'Memento' is a wonderfully made film. The cinematography is slick and the production values in general are suitably gritty and audacious , with some scenes strongly reminiscent of film noir (as a fan of film noir that was great to see). David Julyan's synthesised (something that could have sounded tacky but actually adds a lot to the atmosphere) score makes very clever and dynamic use of distinct sounds, oppression, yearning, loneliness and loss having a haunting but also affecting vibe, the feeling of being lost adrift being perfectly captured.Nolan directs impeccably, not letting his ambition get in the way of the storytelling, while the script is smart, thought-provoking and intricate without trying too hard and treating the audience with respect. The pacing is taut while deliberate, and the length, after seeing some later efforts that have suffered from over-length and over-ambition ('Interstellar'), was ideal.It is the story that makes 'Memento' Nolan's most fascinating film, with a unique non-linear, time-reversed structure with two converged time-lines. That sounds on paper confusing but with Nolan telling the story in an intricate, tense and atmospheric way (meaning that he takes his time telling the story) it makes perfect sense, with beautifully interwoven use of thematic motifs of memory, guilt, perception, self-deception and grief and a stunningly moving ending that one does not expect.Guy Pearce is astonishing and give one of his career's best performances, don't think from personal view that he's been as good as this since. He gets excellent support from particularly Joe Pantoliano and even Carrie-Ann Moss.Overall, a brilliant film and a contender (my personal vote certainly) for Nolan's best film. 10/10 Bethany Cox"
    },
    {
      "username": "ZuhayrRoha",
      "userUrl": "https://www.imdb.com/user/ur80531773",
      "reviewLink": "https://www.imdb.com/review/rw5824515",
      "warningSpoilers": true,
      "date": "14 June 2020",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "My mind blows away whenever I start to think about how Nolan wrote the script",
      "content": "Man the utter originality of this masterpiece. Before I saw this film, I took movies only as a piece of entertainment but after seeing Memento I realised movies are ART. It took me time to release this fact but Memento opened the doors for me to watch more original & indie movies.Thank God I didn't knew first time watching that the movie was backwards, me digesting the film and then the spark of realisation that 'hey I saw that clip from before'. If I could forget this movie and again go through the journey of 'what, it is backwards!! Rewind rewind'This movie is in my Top 10.Rewatching for 2nd time, after every transition I reconnect the dots and set the movie chronologically in my brain. I love this types of movies were they made me interact.Christopher Nolan brilliantly incorporates the audience POV to the amnesia of the protagonist. This is perfectly done and I can't think of any other way to pull this kind of backwards gimmick. Thats why I love Nolan, weird concept with a masterpiece execution.The is also filled with memorable lines like 'Am I chasing him? Nope he is chasing me.' And Nolan also snuggles a twist with the female charcater and my mind is even more blow.At its core the movie the movie is about a guy finding his wife's murderer(we have seen that done hundreds of times) but the layers of other artists merit makes this movie perfect is my eyes."
    },
    {
      "username": "Movie-12",
      "userUrl": "https://www.imdb.com/user/ur0111563",
      "reviewLink": "https://www.imdb.com/review/rw0664938",
      "warningSpoilers": false,
      "date": "2 May 2001",
      "rate": "8",
      "helpful": "226 out of 333 found this helpful.",
      "title": "Not to be missed if you are looking for something clever and original. ***1/2 (out of four)",
      "content": "MEMENTO / (2001) ***1/2 (out of four)By Blake French: How is this for a scenario? A man breaks into your house in the middle of the night. He kills your wife and leaves you with brain injuries. Furious, you pledge your life to track down and kill whoever is responsible. There is just one problem: after the head injury, you are no longer capable of creating new memories; everything before the accident is crystal clear, but now you cannot remember anything past several minutes. Now chew on this: what happens to guilt if you cannot remember what you did? How can a person have emotions if he does not know where they came from? How can we learn from our experiences if we cannot remember them. What is the purpose of revenge if someone cannot recollect or prosper from it? \"Memento\" wins this year's prize for inducing the most audience participation. Not only is the film thought-provoking and unusually absorbing, but it also places us in the main character's shoes. How can we be in the same mental status with the main character when he cannot remember anything? Writer/director Christopher Nolan has that answer: he tells the story backwards. We begin at the end and work our way towards the beginning. However, each individual scene plays running forward, often overlapping, providing us with clear, constructive transitions. The main character, Leonard, is confused in prospects of time and experience, and so are we. Other characters include Natalie (Carrie-Anne Moss, from \"The Matrix\"), who also lost someone close and can help Leonard, and Teddy (Joe Pantoliano, also from \"The Matrix\"), whose identity often shifts mysteriously. Then there is the series of flashbacks of Leonard's experiences while working as an insurance agent. The situation involves an individual named Sammy, who has a memory disorder similar to Leonard's. His diabetic spouse is not sure whether her husband is faking his condition or not. To prove it to herself she arranges a test I dare not reveal. Leonard is more intricately involved in this story than he even believes. \"Memento\" is smart and imaginative. It doesn't pass up little details of the characters. Leonard is constantly jotting himself notes and taking Polaroid pictures so his life can make some sense. He even gets permanent tattoos all over his body so he does not lose or forget some of the most important information. In a movie like this, it would be almost impossible to make without leaving some information out; even some of the film's actors were confused and requested a script told in sequence order. But these filmmakers have constructed a movie with a plot hole big enough to drive a semi through: If Leonard cannot remember anything after the accident, then how can he remember that he has a memory condition? There are no tattoos or notes to remind him, and whenever he meets someone he explains his condition thoroughly. This is necessary information he reveals, but there are better ways to do so. We could be there when his doctor explains the condition to him, or see his friends talking about it. The sky is the limit in a movie like this. It was not essential to leave such a massive, obvious hole in the plot. \"Memento\" is still a unique mystery thriller. It is a tantalizing experience we do not often come across at the movies. For audiences who like to sit back and relax, this film is a waste of time. It requires us to follow along, participate, fit puzzle pieces together-\"Memento\" doesn't provide any easy or obvious answers. All but the most intelligent and thoughtful kids will not be able to follow this film; it is intended for adult audiences. \"Memento\" is one of the year's most challenging movies, not to be missed if you are looking for something clever and original."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw2311478",
      "warningSpoilers": false,
      "date": "16 September 2010",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Have I seen you before?",
      "content": "If you have watched the very first movie done by Mr. Nolan, than yes you have seen this before. Not exactly like this and with quite a few flaws, but if you consider that it was more or less a student film and seeing this, probably nothing more than an exercise on how to do it on a grand scale, than it was more than decent.Nolan is one my new favorite directors and as the rating does show you here, I am not alone. Not that that will convince you he is better than you think he is. Actually you might even not like Memento, for one reason or another. There is people out there who just want to be entertained, when they go watch a movie. And that's not a bad thing. Nor does that mean that if someone likes, say Transformers 2 better than this movie, that he/she has no clue. It's just a matter of taste.I for one, can tell you that this is a movie that merits watching it more than once. And the disc version offers you to watch the movie ... in a different \"order\", which gives you a new unique experience. If you haven't watched it yet, you are in for treat. And don't worry, if you don't understand everything the first time you watch it ..."
    },
    {
      "username": "soloyoda",
      "userUrl": "https://www.imdb.com/user/ur0522142",
      "reviewLink": "https://www.imdb.com/review/rw0664878",
      "warningSpoilers": false,
      "date": "19 April 2001",
      "rate": "",
      "helpful": "1,282 out of 1,393 found this helpful.",
      "title": "Absolutely No Spoilers Here--READ THIS REVIEW INSTEAD!!!!",
      "content": "Thank Goodness I didn't read the reviews posted before I saw the film!! Most reviews (including ones on this site) will tell you waaayyyy too much about the movie, and that's just plain frustrating. But, as an avid cinephile, I promise not to do the same.Memento is one of those pictures that will have you sitting in the theater after the lights come up so you can talk to everyone else about what they thought of the movie. This is a highly intelligent and original brain teaser that will have you guessing from beginning to end, and even afterwards. The story and the direction are the best I've seen so far this year, and it deserves all the kudos it gets.Plainly put, the film tells the story of Leonard Shelby: a man who lost his short term memory in an assault where his wife was raped and murdered; now he's looking for the killer, despite his handicap. Simple as that. You don't need to know anymore.The film is constructed and told in such a way that you are constantly put into the shoes of Leonard Shelby, beautifully played by Guy Pierce. Carrie-Ann Moss gives an equally mysterious and complex performance. This film is well-made all the way around--from the direction, to the editing, and especially the unique story that is rarely found in Hollywood these days. Four Stars!This review may have been a little dry on the details, but go see the movie--you'll be thanking me later.PS: Only go to the official website AFTER you've seen the movie. It too will give too much away. Afterwards, though, go and look at it--it's pretty impressive."
    },
    {
      "username": "EThompsonUMD",
      "userUrl": "https://www.imdb.com/user/ur0182733",
      "reviewLink": "https://www.imdb.com/review/rw0665450",
      "warningSpoilers": true,
      "date": "2 October 2001",
      "rate": "9",
      "helpful": "23 out of 28 found this helpful.",
      "title": "Original and intriguing film noir revision.",
      "content": "Revising such film noir conventions as a story told through the unreliable point of view and voice-over narration of a morally flawed investigator-protagonist, the pervasive infusion of a dark past into the narrative present, and the use of a femme fatale as an embodiment of evil allure, Memento is perhaps the most original and intriguing revision of the genre since Welles' Touch of Evil.As almost every commentator has noted, the most startling (or 'gimmicky') feature of Memento - and one with obvious roots in the film noir tradition - is its inverted/contorted plot structure. The film loops backwards episodically to present a series of revelations about the main character, Lenny (Guy Pearce), about the motives of his antagonists 'Teddy' (Joe Pantolino) and 'Natalie' (Carrie Ann Moss), and about the nature of Lenny's memory-loss condition. His condition 'isn't amnesia' (or so Lenny tells everyone he meets) but rather such severe short term memory loss that he is unable to assimilate and retain experience - in other words, to make new memories. Consequently, Lenny's identity, or more precisely his self-knowledge, is arrested at the moment he received a blow to his head while trying to stop intruders from raping his wife.Everything that has happened thereafter has no subjective reality for Lenny, only whatever 'objective' reality he can forge using instant photos, notes to himself, and - for the really important stuff - tattoos. But matters are even more complex and paradoxical than this setup might lead one to expect. Gradually, the viewer learns that even the clear memories that Lenny claims to have from before the assault are, like dreams, colored by protective distortions and selectivity. Moreover the so-called facts he has assembled in his investigation and that he defensively claims are more reliable than memory turn out to be irretrievably entangled in subjective motives: his own, Teddy's, and Natalie's. Thus the viewer's initial sympathy for Lenny as a justifiable victim/avenger transforms to horror as Lenny's true current identity becomes clear.Importantly, Memento's regressive plot structure is punctuated and counter-pointed by a series of noirish black and white flashbacks in which Lenny relates to an anonymous phone caller the story of Sammy Jankis, another sufferer of short term memory loss who, ironically, was Lenny's big case in his pre-trauma life as an insurance investigator. Unlike the main narrative, the Sammy sequences are told in chronological order, strategically intersecting and organizing the narrative as it wends its way backwards to the moment when Lenny decides to set in motion the data trail that will lead to the murder we see him commit in the film's opening sequence. In addition, Lenny's reconstruction of the Sammy sequences is itself dreamlike and unreliable since he attributes to Sammy characteristics that (if we can believe Teddy, an utterly corrupt cop) are Lenny's own.In addition to providing plot exposition and a recurring visual/narrative reference point, the Sammy sequences also bring into clear thematic focus the existential implications of memory loss. Like Sammy's, Lenny's 'condition' is a reduction to the most minimal and absurd level of the human mental processes for constructing meaning (in life, in film) out of fragmentary phenomena and evanescent recollections. In an age of Alzheimer's, deconstruction, and ego-fictions, most viewers will all-too-easily identify with Lenny's painfully hopeless and terrifyingly arbitrary quest to hold reality steady as is it fizzles and flits away."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1111019",
      "warningSpoilers": false,
      "date": "25 June 2005",
      "rate": "10",
      "helpful": "21 out of 29 found this helpful.",
      "title": "like nothing that you've ever seen before",
      "content": "\"Memento\" is one of those movies that I fear discussing because I don't know how much I can tell without giving the whole thing away. You might have heard that the story gets told in reverse and that Guy Pearce plays Leonard Shelby, who has a memory problem. People are able to abuse him and all sorts of other horrible things. Then, he has to use the little bit of memory that he has left to...no, I can't tell you; it would give the whole movie away. My point is that \"Memento\" is a most incredible movie. You quite literally have to see it to believe it. You might even want to watch it more than once, possibly backwards. Or something similar."
    },
    {
      "username": "Ch4ndler_B1ng",
      "userUrl": "https://www.imdb.com/user/ur89818312",
      "reviewLink": "https://www.imdb.com/review/rw5466455",
      "warningSpoilers": true,
      "date": "7 February 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Just saw- One of my favorite movies of all time",
      "content": "This is based on a novel by Jonathon Nolan (Chris Nolan's brother) and starring Australian actor Guy Pearce. Huge spoilers ahead: This movie works backwards, I feel like the movie wouldn't have made a-lot of sense without me knowing going in that the story would be told backwards, but I just saw this 7/02/2020 and boy oh boy is this a masterpiece. Basically, Leonard Shelby has this incident when his wife is getting raped and murdered by two brutal attackers, Leonard hears her screams from the bathroom rushes in and tries to fight them off, but ends up getting his head smashed into a glass mirror, and then supposedly they leave. The story is that Leonard's wife survives, she is diagnosed with diabetes and he keeps injecting her with a needle but he forgets (due to his amnesia) that he is overdosing her with the drug, and she ends up dying of an overdose. Altogether, the story is original, unique and anything you would hope for in a psychological thriller.Even though the story is quite dark, there is a humour to it. For example, character Teddy is hilarious, making jokes about Leonard's condition. Overall, this is my favorite psychological thriller by far! Grade: A+"
    },
    {
      "username": "Pseudo-geordie boy",
      "userUrl": "https://www.imdb.com/user/ur0851516",
      "reviewLink": "https://www.imdb.com/review/rw0665189",
      "warningSpoilers": false,
      "date": "25 January 2001",
      "rate": "",
      "helpful": "268 out of 360 found this helpful.",
      "title": "Confusion, uncertainty, and paranoia as an art form: possibly.",
      "content": "If I told you the entire plot of this film it really wouldn't matter as it is an exquisite paean to the subjectivity of memory and therefore is in itself ambiguous; the truth' of it is up to you. You come out of the cinema questioning yourself, your memories, your truths. Nothing in this film is as it seems, and yet paradoxically everything is as it seems. We see everything through Guy Pearce's characters' (Lenny) eyes, unfortunately he has no short-term memory so cannot form new memories. He would have already forgotten the first sentence of this review. He lives in snapshots of life; his only form of memory is his Polaroid camera, just like in the excellent German film Wintersleepers; also (partly) about a short-term memory disorder.In this film Lenny takes snapshots to remember who people are, where he now lives, his car, everything. As you can imagine this is perfect for paranoia, suspicion, uncertainty, confusion, and betrayal. And that's exactly what you get in extreme doses. The difference between this film and Wintersleepers however is that Memento is entirely from Lenny's perspective. This therefore creates an imaginative, creatively unsurpassable film. The film begins where it should end, so far so trite, but here's the beauty, we, like Guy Pearce, learn in fragments what's going on. It is therefore perfect for those who love to second guess what's going to happen, who did what, who's doing what and why. The beauty of this film though is that my interpretation could be so different from yours, and neither of us could be sure whose interpretation is the right one; if there is a right one at all. Nothing is certain, nothing is clear. Another beauty of this film is the way it is filmed and edited. Pieces are shown a number of times with no real linear link between them, just like it would be if we ourselves had a memory disorder, and then they are cut up and edited next to things that happen either before or after it. It's just like holding ten different and linearly distinct Polaroids in your hand and having a short-term memory disorder. Excellent.I'm not even sure if watching it again will make things any less ambiguous, but then who cares? The ambiguity is what makes this a great film, if it wasn't so cut up, or from Lenny's perspective it would be both very short and trite; and lacking in tension, suspense and interest. But as it stands it has all three, isn't trite and says so much about humanity. Oh, and the plot? It really doesn't matter, all you need to know is that everything about this film is indicative of the subjectivity of memory, of our experiences and interpretations of all that happens to us. Nothing will seem as black and white as it did beforehand. It will make you question every memory you have, almost as much as possessing a psychology degree, as I do! So, go and see it: be confused, acknowledge the frailty of all you know to be true, and then imagine the freedom of actually being Lenny, and then the horror of having nothing, nothing but the reliance of a pen and a Polaroid camera to know who you are."
    },
    {
      "username": "lasher42",
      "userUrl": "https://www.imdb.com/user/ur0589273",
      "reviewLink": "https://www.imdb.com/review/rw0665061",
      "warningSpoilers": false,
      "date": "24 May 2001",
      "rate": "10",
      "helpful": "388 out of 463 found this helpful.",
      "title": "can't believe how much I'm still thinking the day after",
      "content": "So the \"innovative\" concept of filming out of sequence has been cliche for at least a few years now, but here's a film that makes it work far better than its been shown in a while.Having read the reviews and talked to others who saw it, I thought that I'd go into the movie figuring everything out right away and declaring the concept unworkable. I couldn't be further from the truth. This movie does things to your head that are illegal in some countries. Portrayed (for all intents and purposes) backwards, it forces you to think in the same way that our lead character, Leonard Shelby (Guy Pearce being more brilliant than usual) does. Suffering from a condition that renders him unable to remember anything for more than a few minutes, he is searching for the man who raped and killed his wife. Since each seen lasts no more than 15 minutes before jumping back to the what happened before that, our perceptions are shattered in the same way.Carrie-Anne Moss and Joe Pantoliano (both of The Matrix) put in great performances that leave you guessing; simultaneously endearing and revolting.Overall I left the film trying to figure out what was what, and I'm still not sure. This film noir concept shouldn't work, but it does so wonderfully."
    },
    {
      "username": "inkblot11",
      "userUrl": "https://www.imdb.com/user/ur2444068",
      "reviewLink": "https://www.imdb.com/review/rw7299805",
      "warningSpoilers": false,
      "date": "2 September 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Finally saw this gem of an enigmatic film!",
      "content": "Leonard (Guy Pearce) has a terrible problem. After his wife was murdered and presumably he was beaten, he has no short term memory. His last recollection is the moments before his wife's demise. Now, he is determined to track down the killer the police couldn't find. Yet, everyday he must read his notes and gaze at the many tattooed phrases on his body so that he can continue. Two people appear to be helping him in his quest. One is a man named Teddy, who pops around all the time but seems rather shady. Equally so is a Natalie (Carrie Anne Moss) who is sleeping with Leonard but may have ulterior motives. Meanwhile, Leonard stays at a cheap Los Angeles Hotel where the manager introduces himself every day and, underhandedly, adds to Leonard's bill. As he crisscrosses the city looking for the murderer, the film also flashes back to his time as an insurance investigator to give us more clues. For you see, this film is designed to force the viewer to piece together the plot, bit by bit! Are you game? I finally saw this fantastic Nolan film that everyone raves about incessantly. Its worthy of the highest praise as the plot travels backwards, forwards, and sideways. Pearce is wonderful as the main character, but, one quibble, I'm not fond of him as a blonde. The supporting cast is also superb with few big names except Moss. The setting in Los Angeles has its splendors and its dives. Memento is a huge cut above most other film experiences. While you are guaranteed to be confused at times, the whole experience is very, very rewarding."
    },
    {
      "username": "Heretic Monkey",
      "userUrl": "https://www.imdb.com/user/ur1099939",
      "reviewLink": "https://www.imdb.com/review/rw0664972",
      "warningSpoilers": true,
      "date": "7 May 2001",
      "rate": "",
      "helpful": "312 out of 387 found this helpful.",
      "title": "overused plot + often abused style = best movie of the year",
      "content": "A man with no short term memory tries to solve a murder. The scenes in the movie are played in reverse. Sounds like yet another run of the mill comedy but in reality is one of the best suspense/dramas I've seen in years.While some may claim showing the scenes in reverse is just an annoying trick to make a simple plot confusing and add a plethora of twists, I wholeheartedly disagree. Any good story teller knows it's not what you say, but how you say it.By playing the scenes in reverse you experience the confusion Lenny undergoes throughout the film. Showing some of the scenes in chronological order (BTW, the use of B&W instead of color to make the time distinction was ingenious) creates suspense which builds as the two timelines converge. The somewhat rushed pace (compared to a written format) doesn't give you enough time to adequately analyze the events during the movie. This has two advantages: firstly you're going to talk about it after you leave the theater adding to experience immensely, and secondly you don't have time to think about what has happened (will happen) so you're experience better follows that of Lenny.While many might find the movie rather confusing, it flows wonderfully for anyone familiar with writing styles that constantly jump around a timeline (e.g. Catch 22)."
    },
    {
      "username": "jbparker",
      "userUrl": "https://www.imdb.com/user/ur0625641",
      "reviewLink": "https://www.imdb.com/review/rw0664987",
      "warningSpoilers": false,
      "date": "9 May 2001",
      "rate": "9",
      "helpful": "234 out of 307 found this helpful.",
      "title": "Its not a gimmick, its something new",
      "content": "Yes, it's true. The entire movie is based on a gimmick. However, I honestly feel that this does not cheapen the picture in the slightest bit. I loved every scene; discovering information as our lead character discovered it. It demands a second and third viewing, as there are many subtleties and quick flashes that may not be picked up on the first time around. Its one of the most original films ever made, and for people who scoff at the concept of not having a short-term memory, it actually is a real condition. Watch this movie. And, please pay attention. The performances are wonderful, and its structured magnificently."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3304563",
      "warningSpoilers": false,
      "date": "25 August 2015",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "unique viewing experience",
      "content": "Leonard (Guy Pearce) suffers from short term memory loss. His last permanent memory is an attack by two men. He killed the one who killed his wife. The other one escaped after clubbing him in the head. The police dismisses the idea of a second man. He keeps a record of his experiences using tattoos, Polaroids and hidden notes. He has to figure out whether he can trust Natalie (Carrie-Anne Moss) or Teddy (Joe Pantoliano) as he searches for the second man to avenge his wife.Brothers Christopher and Jonathan Nolan announce their arrival with this unique screenplay. The forward-reverse order makes the movie disjointed and confused in a good way. It's a beautiful struggle to figure out the plot. It puts the audience in Leonard's shoes. It's a jigsaw puzzle that Leonard with his memory loss also struggles with."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2502994",
      "warningSpoilers": true,
      "date": "14 October 2011",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "\"It's amazing what a little brain damage will do for your credibility\".",
      "content": "I just watched this picture three times in five days, and before you get around to asking - no, I'm not a glutton for punishment. It's just that I was totally fascinated with the way the story was presented, as if it was rigged with a perpetual rewind button that brings the viewer back a couple days prior to the last rewind. These kinds of stories have a way of making my head hurt, but there was something about this one that was different. Maybe it's the way the story had you empathizing with Guy Pearce's character Lenny. The man was relentless in his quest to find his wife's murderer, but at the same time, that murder might not have ever really happened. There are literally as many interpretations of this picture as there are people who have seen it, and reading some of the other viewer posts and discussion threads are bound to move even the firmest of opinions to yet another different conclusion. So in that respect, the film invites criticism for being nothing more than a gimmick, even if a thought provoking and mind bending gimmick. I have to say, I usually like my movies wrapped up in forthright fashion, even if I don't like the resolution. But here it's virtually impossible to know anything for sure because it's all based on Lenny's reconstruction of events, relying on facts and not memories, as he explains in one of the sequences to Teddy (Joe Pantoliano). But what happens when the facts can metamorphose as they did here? I just know I can't watch this again for awhile because I've come to enough different conclusions already."
    }
  ],
  "errorMessage": ""
}