{
  "imDbId": "tt0120382",
  "title": "The Truman Show",
  "fullTitle": "The Truman Show (1998)",
  "type": "Movie",
  "year": "1998",
  "items": [
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0954092",
      "warningSpoilers": true,
      "date": "29 October 2004",
      "rate": "",
      "helpful": "410 out of 445 found this helpful.",
      "title": "An unassuming film that is thought provoking on so many levels, well acted and thoroughly enjoyable however you come to it",
      "content": "Truman Burbank is an ordinary guy in an ordinary little seaside town of Seahaven Island where nothing really happens. Everything is clean, everything is perfect, he knows people but never really connects to anyone. The one woman he ever really loved is not his wife and has long since left for the other side of the world where he longs to visit but feels he can never go. Paralysed by his fear of water since seeing his father die on a boating accident, Truman still feels he is missing something. A strange light falling from the sky, a man who reminds him of his dead father, a strange radio broadcast and the feeling that the world really stops when he shuts his eyes all combine to make him feel something is wrong  but what is it that he seeks but feels he cannot find?When I first saw this film it was with my girlfriend (who would then become my wife, then ex-wife!) and I remember how she and our friends felt a little bit cheated by the film that they had expected to be yet another wacky Jim Carrey comedy. In fairness to her and the others, it was easy to do this at the time  who would have thought that Jim Carrey would be able to act  certainly not the marketing department that sold this film on the basis of it being a hilarious film as opposed to the thoughtful and rewarding film it turned out to be. The plot can be viewed on so many levels that it is honestly easier to leave it to each viewer to take what they will from it. On the most obvious level it satirises the media, the emotional façade of television and (the increasingly relevant) look at reality shows. To others it will say as much about God, the empty drone of life and the things that we all desire. Of course to others it will just be a comedy with general comments to make  and there is nothing wrong with that whatsoever; in fact the multi-level approach works to make it appeal to many audiences.Starting as a comedy, I am always taken by how well the film moves to become more and more interesting but yet never loses sight of those audience members who have come for the basic story. Hence it delivers an enjoyable and engaging central narrative that, plainly put, makes for a comic and involving yarn  we grow to care for Truman and this makes the ending an emotional and satisfying one even if some viewers will bemoan the fact that (to them) it appears 'open ended'. That it is also a very thought-provoking affair is only a bonus, with the satire working on many levels. Of course by seeming to tackle so many subjects and issues in such a short running time, the film never really gets its teeth deep into any one of them but this is not a major problem because it leaves us to do that in our heads after the film finishes.The cast is roundly superb even if the majority of them are in minor roles. Of course it is easy now to look back at Carrey and accept that he can act straight but at the time it seemed so unlikely and few felt it was a good casting choice. Of course, seeing the end result it is clear that he can and he delivers such a great performance that he really makes the film work.He is comic but yet serious, sympathetic but not worthy of pity  it is a great delivery and one that basically meant that I now look at his Ace Ventura stuff as the 'other' category and see his acting as his real work (6 years ago that was vice versa). Carrey carries the film, being on screen for almost the entire film but he has good support from Linney, Emmerich, Krause and others who play it well despite being stuck in the necessary stiff and unreal roles. The controller etc roles are all well played and feature a collection of well known faces including a great support role from Harris through to roles for Giamatti, Shearer, Baker Hall and a few others. It may be Carrey's show but the support certainly helps.Overall this is a great film that can be appreciated as much for what it is on the surface (a great little comic story) as it can for the issues that it hints at all the time. There was a time when some viewers may have looked to a Carrey film to be a load of mugging an crude, basic laughs but this was the film that saw that change. Thought provoking, funny, entertaining, short, enjoyable and well acted throughout  well worth seeing and well worth coming back to several times."
    },
    {
      "username": "JamesHitchcock",
      "userUrl": "https://www.imdb.com/user/ur2955724",
      "reviewLink": "https://www.imdb.com/review/rw1162077",
      "warningSpoilers": true,
      "date": "31 August 2005",
      "rate": "10",
      "helpful": "156 out of 170 found this helpful.",
      "title": "Life is Starting to Imitate Satire",
      "content": "Life is starting to imitate satire. \"The Truman Show\" was only made seven years ago, but it predates the current mania for so-called \"reality\" television shows such as \"Big Brother\". The idea behind such shows is that they present the viewer with a slice of actual reality- real people in real situations with real emotions- rather than the simulated reality of drama or the edited reality of documentaries. The flaw in this idea is that nothing is more unreal than a reality show. The presence of the cameras has a distorting effect, inducing artificial behaviour patterns in those who appear in front of it, and the sort of people who star in such programmes are almost invariably eccentric exhibitionists. \"The Truman Show\" takes the central concept of reality TV shows one stage further in order to overcome this flaw: what would happen if we made a reality programme about a person who has absolutely no idea that he is appearing on television? Truman Burbank is an insurance executive, living in a small American seaside town called Seahaven, and happily married to a nurse named Meryl. Or at least he thinks he is. What Truman doesn't know is that he is the central character in a soap opera and that his whole life is a fiction. The company he works for does not exist. Seahaven, the island it stands on and the surrounding ocean are all part of a gigantic set, specially created for the programme and sealed off from the outside world in a gigantic geodesic dome. Everyone in Truman's life- Meryl, his mother, his colleagues at work, his best friend Marlon- are actors playing out their roles in his drama.For thirty years Truman has accepted his world unquestioningly, but at the beginning of the film a series of incidents- a light falling from the sky, the reappearance of his father, who was supposed to have drowned in a boating accident when Truman was a boy, strange messages picked up on his car radio- awaken his doubts. Although members of the cast make strenuous attempts to dissuade him, he decides to try and explore the world outside Seahaven; in particular he wants to travel to Fiji where he has been told that his former girlfriend Sylvia now lives. (Sylvia was written out of the show when the scriptwriters decided that he should marry Meryl instead).The film has certain similarities with another film from the late nineties, \"Pleasantville\", which dealt with an inverted version of the same idea; two teenagers from the real world are magically transported into the world of a fifties television show. In my view, however, \"The Truman Show\" is the better of the two. \"Pleasantville\" deals with its political themes in a heavy-handed way with some very obvious symbolism. \"The Truman Show\", although it deals with some weighty issues, is never ponderous or excessively serious; indeed, it is often very humorous. The main source of humour is the contrast between the naïve, trusting Truman and the behaviour of those around him, all living a lie and desperately trying to prevent Truman from finding out that it is a lie. I had previously thought of Jim Carrey as a rather annoying actor whose appeal was based upon the idea that manic overacting is in itself funny, but here as Truman he is very good indeed, both amusing and touching. I was also impressed by Ed Harris as Christof, the show's enigmatic producer.Another factor in the success of the film is its visual look. Seahaven (like the town in \"Pleasantville\") appears as an eerily perfect, not-quite-real version of the typical American small town, but was actually filmed in a real place, the purpose-built village of Seaside, Florida. There are similarities with the cult British sixties television series \"The Prisoner\", which was also filmed in an eerily perfect seaside village, Portmeirion in North Wales.The film is obviously a satire on the intrusiveness and obsession with celebrity of the modern media; added relevance was given by the fact that it came out shortly after the death of Princess Diana. There is, however, more to it than that. Much has been made of the film as religious allegory; it has been pointed out that Christof whose name is clearly, and quite deliberately, similar to \"Christ\", is a God-figure, whereas Truman (the \"True Man\") is a symbolic Everyman. It has even been claimed that the film is an anti-religious allegory, with Truman's final escape from Seahaven symbolic of man's need to break away from outdated religious dogmas. This is not an interpretation with which I would agree- if one is trying to put across a \"God is dead\" message, it seems odd to provide a God-figure who is very much real, not mythical or illusory. The imagery of the final scenes  the calm after the storm, the ascent up a flight of stairs into the sky and clouds- also struck me as religious rather than secular. Moreover, the film seems too complex to be reduced to any single allegorical meaning, although it certainly deals with the relationship between man and God. It also touches on man's need to explore- both to explore new places and also to explore new ideas and to break away from established ways of life and ways of thought- and on the nature of reality. Truman's world may seem unreal to us, but as Christof says, \"we accept the reality we are presented with\".This is a brilliant, multi-layered film, part comedy, part satire, part philosophical speculation, and in my view one of the two best movies of the late nineties. (The other was \"American Beauty\"). I felt it should have taken the \"Best Picture\" Oscar for 1999- \"Shakespeare in Love\" is a good film, but \"The Truman Show\" is a great one. It confirms my view that Peter Weir is one of the best directors currently working. 10//10"
    },
    {
      "username": "skepticskeptical",
      "userUrl": "https://www.imdb.com/user/ur22563365",
      "reviewLink": "https://www.imdb.com/review/rw5004026",
      "warningSpoilers": false,
      "date": "19 July 2019",
      "rate": "9",
      "helpful": "100 out of 107 found this helpful.",
      "title": "Prophetic",
      "content": "The Truman Show is a film I never got around to watching until now, despite having heard references to it here and there over the past ... twenty years?! Now that I have seen it, I am somewhat glad that I waited, because from this vista, twenty years later, it really seems prophetic. Think about all of the children who were born after the ascendance of the internet. Many of their lives are not unlike Truman´s life: every moment captured for all the world for all of time.What is even more disconcerting is that many people willingly choose to focus on and cultivate their internet presence at the expense of everything else. We have become a selfie culture, and reality t.v. thrives because people not only like to watch other people but also to put themselves and their lives on display. Modern people have become narcissistic exhibitionists--and are proud of it!"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2961644",
      "warningSpoilers": false,
      "date": "16 February 2014",
      "rate": "9",
      "helpful": "66 out of 74 found this helpful.",
      "title": "A good film for those who think they hate Jim Carey.",
      "content": "I have never liked Jim Carey's humor. I have found it to very broad and boorish. However, I was very happy that I saw \"The Truman Show\" and am surprised I did considering my feelings about his earlier 'comedies'. Thankfully, Carey showed he could act and NOT ham it up--a tribute to his native talents as well as the director and writer. With a weak director, Carey might have begun to seek laughs in 1001 crazy ways. Here, however, it's straight and quite endearing. I could talk about the plot, but there are already a bazillion reviews for this one. The bottom line is that don't assume because you don't like \"Dumb and Dumber\" or \"Ace Ventura\" you won't love this film. And, I really loved \"The Truman Show\" and think it's a lovely film with a lot of heart and an awful lot of imagination.By the way, I would say the same things about Will Farrell and Adam Sandler. Despite disliking some of there very broad films, there serious films (such as \"Reign Over Me\" or \"Stranger Than Fiction\") are exceptional. Additionally, I gotta admit that I did enjoy a few of their 'stupid' films such as \"Water Boy\" and \"Talladega Nights\". So don't assume that just because you may not like a few of their films means they all are not your cup of tea."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw3658857",
      "warningSpoilers": true,
      "date": "10 March 2017",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "A Film Ahead Of Its Time",
      "content": "When \"The Truman Show\" hit theaters in the summer of 1998, there was no such thing as reality TV. \"Survivor\", \"Big Brother\", \"Amazing Race\", or \"Keeping Up With the Kardashians\"? All in the future. The fact that this film beat America to the reality-TV punch shows how much of a landmark production it truly was--ahead of its time, to be sure.For a basic plot summary, \"The Truman Show\" tells the story of Truman Burbank (Jim Carrey), a seemingly regular guy who begins to suspect that his life is being controlled by forces outside of his own. As it turns out, his life (from birth) has been viewed by the TV-watching public since birth, with everyone in on the idea except him. That includes his wife (Laura Linney), best friend (Noah Emmerich), and even an old flame (Natascha McElhone) intent on revealing the mystery once Truman starts putting the pieces together and ultimately discovers how manipulated his life truly is. But not if enigmatic director Christof (Ed Harris) has anything to say about it.\"Truman Show\" is a concept movie through-and-through. It really nails the concept of \"reality TV\" & just how pervasive commercialism can become in our society. As previously mentioned, this film was years ahead of its time in portraying such issues. As such, in way the experience actually resonates more today than it ever could have in '98.The acting helps the production rise above just the concept as well. Carrey completely and utterly sheds his more farcical comedic roles and turns in an Oscar-worthy performance as the befuddled Truman, while the auxiliary roles are finely-tuned as well. Director Peter Weir will have you truly caring about the little town of Seahaven Island and its inhabitants by the film's conclusion.I consider \"The Truman Show\" to be one of the finest films of all-time. It has everything a great movie needs...intriguing plot, good pacing, solid acting, investing characters, and even a little humor thrown in here and there. Not only does it work on its surface level, but it also expertly presages a digital, commercialist, voyeuristic culture--all avenues that seemed to be moving closer to a societal reality."
    },
    {
      "username": "MrPupkin",
      "userUrl": "https://www.imdb.com/user/ur102605581",
      "reviewLink": "https://www.imdb.com/review/rw5212262",
      "warningSpoilers": false,
      "date": "25 October 2019",
      "rate": "9",
      "helpful": "43 out of 45 found this helpful.",
      "title": "It's undoubtedly one of my favorite movies, the kind of movie that changes our lives, as well as looking like a long episode of Black Mirror.",
      "content": "As inventive and creative as Weir's staging is, The Truman Show wouldn't work without credible Truman. And Carrey carries off the tricky role with a chipperness that belies a deep-seeded longing for more in life than surface perfection in all this movie is one of my all time favorites."
    },
    {
      "username": "Altaira",
      "userUrl": "https://www.imdb.com/user/ur0300770",
      "reviewLink": "https://www.imdb.com/review/rw0438848",
      "warningSpoilers": false,
      "date": "12 June 1999",
      "rate": "10",
      "helpful": "472 out of 519 found this helpful.",
      "title": "Genius",
      "content": "I asked a friend to describe The Truman Show. He said, \"No, it's not a comedy, well...not exactly.\" I didn't quite understand until I watched it myself. Truman takes on a tone quite different than any parody/comedies I've seen lately. The point (the media and its destructive powers) is subtlely relayed through dark humor, and you don't feel like the director is smashing you over the head with his morals. Peter Weir demonstrated his artistic genius in Dead Poets Society and here as well. The soundtrack is great, Ed Harris is stellar (what were they THINKING at the Academy?) and for once I actually liked Jim Carrey. His performance wasn't ribald for once. The final scene--I will not reveal it--is a majestic, long-awaited finish to an intellectual movie. Some people will insist that it was boring or pointless. Those are the same viewers who prefer slapstick, obvious humor to the subtle layers presented here. This is a thinking person's movie. If you can't see the underlying message here, of course you won't like it!"
    },
    {
      "username": "Mark1988",
      "userUrl": "https://www.imdb.com/user/ur14889910",
      "reviewLink": "https://www.imdb.com/review/rw1633853",
      "warningSpoilers": false,
      "date": "9 April 2007",
      "rate": "10",
      "helpful": "331 out of 341 found this helpful.",
      "title": "One of the Most Original Films Ever Made",
      "content": "'The Truman Show' epitomizes strong and original storytelling on screen. This film is emotionally engaging, didactic, witty, dramatic and very unique. For those unfamiliar with the concept, Truman Burbank has never left his ideal home town of Sea Haven. What he doesn't know is that his entire environment is a materialized set and he is the ignorant star of a reality TV show of epic proportions.Taking this entirely original concept, writer Andrew Niccol and director Peter Wier take the viewer into territory uncharted by anything in film history. Thus, the plot is entirely unpredictable but still flows along expertly. The tightness of the screenplay and the immaculate pacing of Peter Wier contribute largely to this film's brilliance.The acting performances are amongst the best I've ever seen. Jim Carey is superb as Truman, effortlessly conveying his fears, desires and personality. Ed Harris is excellent as the reclusive creator of the production. In addition, the entire support cast appears synthetic enough to let the audience know they are \"acting\" for Truman but in some scenes let their \"genuine\" feelings shine through. The ensemble simply cannot be faulted. Carey was hardly done by not to get an Oscar nomination for his performance.The music and visuals are top notch. The cinematography has a reality TV feel that is clever but never intrusive. The shot selection is of the highest quality, particularly in the movie's final sequence. Muscially, this film is incredible. Phillip Glass is a dream on the piano, perfectly evoking the mood for each section of the narrative. The two combine excellently during the scene in which Truman breaks his routine for the first time. During the sequence, Truman makes subtle changes to the bland routine he follows compliantly every day. The emotion of the music when combined with the apparent simplicity of Truman's actions makes this scene one the most powerful I'v ever experienced.This film is an absolute gem. It effortlessly combines everything a classic film should have. It has comedy, drama, strong character development, atmosphere, originality, superb visuals, a superb score, tight writing, raises interesting moral questions as well as providing insight into the human condition. One cannot watch this spectacular film without wondering how a human would react when put in that kind of situation. It touches on our sense of adventure, desire for conformity and the courage we require to question the life we are presented with. 'The Truman Show' does all this in the most accessible and compelling fashion. One of the greatest films of our time."
    },
    {
      "username": "daveisit",
      "userUrl": "https://www.imdb.com/user/ur0926576",
      "reviewLink": "https://www.imdb.com/review/rw1122771",
      "warningSpoilers": false,
      "date": "10 July 2005",
      "rate": "8",
      "helpful": "130 out of 156 found this helpful.",
      "title": "Lawn Mowing At Its Best",
      "content": "\"The Truman Show\" owes a lot to the direction of Peter Weir. Weir refuses to pump out the movies in a search for extra dollars. Instead he chooses wisely and directs brilliantly. Just by looking at a list of his movies will surprise and even amaze you. So as you would imagine \"The Truman Show\" is another success.Truman Burbank has the perfect life, or so he thought until finally his life long suspicions about his world begin to unravel. Even though the idea for Truman is not totally original, it is thought provoking enough and allows the audience to wonder, what if? If you think this couldn't happen, just look back over the years at the stupidity of the human race and think again.Jim Carrey once again nails his role, as do the entire cast. It is rare he fails to perform at a level that perfectly complements the movie and its genre. This is something he does not receive enough credit for. Acting for a comical role or a more dramatic role requires no less effort for the performance to be spot on."
    },
    {
      "username": "WriterDave",
      "userUrl": "https://www.imdb.com/user/ur1069062",
      "reviewLink": "https://www.imdb.com/review/rw0439187",
      "warningSpoilers": false,
      "date": "20 March 2003",
      "rate": "8",
      "helpful": "122 out of 158 found this helpful.",
      "title": "Ambitious and Entertaining Treatise on the Reality Media Creates for Us",
      "content": "It's not often a Hollywood film arrives with such lofty ambitions as this. On one hand this is a high concept comedy in the vein of \"Groundhog Day\" about an unwitting man whose entire life has been a TV show. This is also a Jim Carrey vehicle designed to display his charms. On the other hand this a very satirical look at the way the media manipulates our reality. The film also wants to take a philosophical look at free will vs. a higher power and reality vs. fantasy. It doesn't always work as the satire often keeps you from thinking too deeply about the underlying themes and the philosophical stuff keeps the satire from biting as well as it could. Credit engaging performances and solid and thoughtful direction from Weir for keeping things afloat and entertaining. There are some great cinematic moments here. I loved the \"stolen kiss on the beach at night\" and \"Cue the sun!\"In the end this film is closer in spirit to psychological dramas and sci-fi movies where a person suddenly realizes they are the pawn in some grand experiment or a prisoner in an alien world than it is to anything in our current \"reality TV\" obsessed culture. Eventually it touches on a very basic conflict all humans must face (most people do so in childhood, some I fear never do). The universe does not revolve around us. In the closing moments we are excited for Truman because he finally realizes there is a whole new world out there to explore, but also slightly saddened because we know all to well that he will never be able to return to that idyllic \"childhood\" existence. How's it going to end? Who knows...but things will never be the same."
    },
    {
      "username": "macpherr",
      "userUrl": "https://www.imdb.com/user/ur0191545",
      "reviewLink": "https://www.imdb.com/review/rw0438744",
      "warningSpoilers": true,
      "date": "1 February 1999",
      "rate": "10",
      "helpful": "205 out of 270 found this helpful.",
      "title": "Finally a movie that makes us think",
      "content": "When I was a young adult on the search for my true self, religion and God; I found myself reading all kinds of books such as: Demian, Sidarta, Brave New World, 1984, the works of Jean Paul Sartre and Simone de Bolvoir. The world of Truman Burbank certainly took me back to those days. I used to look at myself in the mirror and say out loud: \"I wonder if I am me? I wonder if everybody thinks the same shade of red when I say red? Why was I born? Why are my parents my parents? Why did God create the world? Will I get punished by God for thinking all these things?\" This is a deep movie, bound to become an art film. Jim Carey did such a superb job that it earned him a Golden Globe Award. This is definitely an Oscar contender. It made me think! What a suprise! Movies do not make me think very often. They are predictable to me now. Could it be age?When the lady comes on the bike with the basket, then the dog and then the yellow Volkswagen it reminded me of how repetitive life seems at times, when we think that nothing is going to change and we want changes. The Director was like God, the creator, although at times he was a mean guy, I think that all of us have questioned God and have been angry at him. Truman's world seemed so \"perfect\", no messy hair, no trash. Just phony! Our world seems much like that, everything is a matter of perception.The audience that watched the Truman Show in the movie was a hedonistic audience of consumers who wanted to be entertained no matter what the cost to Truman, reminded me of the soaps, of the Paparazzi, of how we like to know about the celebrities, and ultimatly of how the product could be the death of someone such as Princess Diana, or Truman Burbank.Purchase the video and watch it many times and many other symbols will come to mind. Like Jim Carey stated while he received the Golden Globe that he would enjoy it down to the crunchy chewy part."
    },
    {
      "username": "moviemanMA",
      "userUrl": "https://www.imdb.com/user/ur6078355",
      "reviewLink": "https://www.imdb.com/review/rw1117562",
      "warningSpoilers": false,
      "date": "3 July 2005",
      "rate": "10",
      "helpful": "30 out of 38 found this helpful.",
      "title": "Tru(man)ly remarkable!",
      "content": "Have you ever thought you were being watched? Like you life was possibly a Television show? Well, Truman Burbank never did and this movie tells of how he found out his life was a TV show.Quite possibly one of the most imaginative plots ever, Peter Weir's The Truman Show shows how one man's vision (Ed Harris) of having someone's life be on TV (that being Truman played by Jim Carey)...without him knowing it. A totally real show that has no boundaries except the walls of the enormous set. With actors playing the roles of the townspeople in this perfect community, as it seems.Jim Carey is brilliant as the confused insurance salesman who just wants the truth about his life. The death of his \"father\" drowning at sea has given Truman a reason to stay in his town and not venture off. But the urge to see the woman of his dreams is all to much. She was moved to \"Fiji\" because of some problems. Laura Linney plays Truman's wife. She isn't only his wife but is a walking commercial. Whenever there is a product she brings home, it seems like she is telling the world how great it is. Noah Emmerich plays Truman's best friend Marlon. This always uplifting character brings comic relief for Truman when he needs it most. When Truman's world seems to be falling apart, he's there. When Truman just needs a friend, he's there. Marlon is the one part of his life that makes it seem so real when everything else seems so fake.What makes this movie so enjoyable other than the story is how the people act in this \"town\". The way they make sure Truman stays there and doesn't leave. How everybody has a routine and even the weather is controlled. In the opening scene Truman wakes up and heads off to work to have a stage light fall right in the street. Where it came from?...he doesn't know. But doesn't worry about it because life is going great...for now. Ed Harris's character Cristof a.k.a. the Creator is genius and maniacal. With his people working around the clock to make sure all is well, this world he has created is now a world wide phenomenon. He is on top of the world with millions of people watching his creation unfold.This sensational film about a man trying to find his way in the world is incredible. When everything seems like it doesn't add up, it just keeps getting more complicated and giving the viewer one hell of a good movie. The Truman Show is in a league of it's own."
    },
    {
      "username": "hankhanks12345",
      "userUrl": "https://www.imdb.com/user/ur6322351",
      "reviewLink": "https://www.imdb.com/review/rw1642072",
      "warningSpoilers": false,
      "date": "22 April 2007",
      "rate": "10",
      "helpful": "37 out of 44 found this helpful.",
      "title": "Brilliant. One of the most interesting films of the last 10 years",
      "content": "\"The Truman Show\" is a rarity in Hollywood - or movies in general - a film that actually makes the audience think, and is about ideas. How do we know what we see is real? Why do we accept what is around us without questioning it? What would happen if we found out that a fundamental we were making about the world turned out to be completely wrong? You'd think a movie that was about those things would be a chore to get through, but in fact \"The Truman Show\" is great fun. I certainly wouldn't call it a comedy (although there are a few light moments here and there), but it's not too heavy and goes down easy.It might sound like exaggeration, but the scene where Truman first starts to realize what's going on is one of the best scenes I've seen in any movie, because of Carrey's acting, the direction, and also because of the Philip Glass soundtrack (which was critical to making that scene work).If you haven't seen The Truman Show, do yourself a favor and check it out."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw3143992",
      "warningSpoilers": false,
      "date": "18 December 2014",
      "rate": "7",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Very Philosophic",
      "content": "An insurance salesman/adjuster (Jim Carrey) discovers his entire life is actually a T.V. show.This movie has been brought to ethics and philosophy classes and used as a tool for discussion. Unfortunately it was never used in any class I took (despite being a philosophy major), but I guess we cannot all get that experience.So much to ponder: was it right to treat Truman this way? Was the television executive playing God? If the wife (Laura Linney) was only in it as part of a contract and not because she genuinely cared for Truman, what does that make her? And what if this really happened? Would people watch it or rebel?"
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2435030",
      "warningSpoilers": true,
      "date": "28 May 2011",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "\"It's Live! It's Live!\"...",
      "content": "With \"The Truman Show\", released in 1998, Peter Weir delivers a brilliant satire about the excesses of reality shows, with a prophetic relevance disguised under a misleading comedic mask. This underrated gem of the 90's, tells the original, to say the least, story of Truman Burbank, played by Jim Carrey in a breakthrough dramatic performance with this bit of tender wackiness we expect from him. Truman is an ordinary insurance salesman living in the small peaceful town of Seahaven. He's popular and lives in harmony with his wife, his mother, his best friend, his colleagues and neighbors. In appearance only What Truman doesn't know, and here's the visionary originality on which relies his life, is that Seahaven, is in fact a huge studio with 5,000 cameras always keeping an eye on him and that everyone's an actor, including his wife, his mother, his best friend etc. and last but not least, all his life, was filmed since his birth to become the greatest and longest-running reality show in television history: 'The Truman Show'. Truman believed in a reality which is in fact, completely fictional, and all the protagonists of this pseudo reality, are puppets hanging on the string of the show's Creator who designs the perfect screenplay creating emotional cliffhangers for future episodes. The Creator is Kristoff, brilliantly portrayed by Ed Harris like a kind of almighty God, and the human incarnation of media's omnipotence. And Truman eventually realizes that his life is a huge hoax, and decides to leave the perfect utopia of Seahaven, and go discover the \"real\" world. Because that's the point: reality shows don't depict reality, but paint it with fiction, it's real fiction, but fiction nonetheless. The ambivalence is obvious in \"The Truman Show\". Truman's life is fictional, because all the protagonists play a role in order to create a story for the viewers. Viewers who follow the show like a soap opera with a 'realistic' dimension. Indeed, Truman's character is real, as stated by the creator of the show, he is the only \"real\" protagonist of this world, his reactions are spontaneous and sincere. The reality is pushed to (unscrupulous) limits, because unlike other shows, Truman doesn't know he's filmed, he's natural. His life is a fiction, but paradoxically a 'real' one. This is the semantic loophole, unscrupulous TV program managers use to justify the unrealistic aspect of their shows. The script's fascinating brilliance reminds of \"Network\" in the 70's, highlighting many unpleasant aspects of TV Reality, including the viewer's tacit complicity. Indeed, the viewer never minds the scripted aspect of reality as presented in TV programs as long as it improves his personal enjoyment, like for all these people who were assiduously following 'The Truman Show' in all over the world. The second aspect is the subjectivity of reality. Truman, for all his spontaneity and sincerity, was unknowingly following the storyline that producers traced. And all the situations were constructed to make him react according to a script. The process of mediation doesn't prevent from spontaneity, but it undermines its credibility by creating specific situations for premeditated reactions. Like in some programs where two people who don't appreciate each other or whose views totally differ, are both invited just to create a violent verbal confrontation -supposedly unexpected- to please the audience.Finally, the main lesson of the film lies on the climax where Truman, tries to leave the fictional world of Seahaven, materialized by the powerful symbol of a dome painted like a sky. Truman struggles to get outside before he faces the producer of the show. The latter warns him against the dangers of a hostile real world where truth is no worthier than elsewhere, and invites him to join the perfect utopia of Seahaven, where he's a hero. Truman's reaction is very symbolic. He left the cameras' world, like an artist who addresses his fans for the last time, with his famous catchphrase as a farewell, and finally gets out. This last pirouette, sublimated by the thrilling score of the film, earned him the applause of the audience, as if the excitement made them forget that the show was ending. Indeed, when the show was finally interrupted, two viewers quickly recovered from their emotions, and zapped to another program. The end. Truman is a genuine character, who understood the completely artificial status of his stardom. He therefore preferred to leave a charming utopia and face the real world. Television today launches ordinary people at the rank of stars for the simple reason that we, viewers, observed their everyday's moves, the details of their life's banality during weeks or months. But that kind of artificial popularity is inevitably ephemeral: it sinks into oblivion as soon as a new reality show emerges. And that's because camera's point view as depicted in the film, presents the reality in a dangerously subjective way. The 'staging', admitted by the public as it highlights positive values like friendship, fame, success, and empathy is a dangerous emotional depiction of reality. The risk is less for the viewer, who accepts the process, than for the protagonists of these emissions, whose purely artificial and prefabricated fame can lead to deep feelings of frustration later. The emotional excitement is binary, and plays on both positive and negative poles, it may present for the sake of transparency, real people who suffer and live under difficult conditions, whether in the context of stories, talk or reality shows. The danger here is moral, because with this constant clash between reality and fiction, how can we be sure that the depiction of suffering and frustration will inspire the audience positive psychological reactions like compassion and solidarity rather than a voyeuristic sadism mixed with a circumstantial empathy?\"The Truman Show\", denounces the fictionalization of reality, through a remarkable fiction, that makes today's reality look like a less believable fiction"
    },
    {
      "username": "J.Bond",
      "userUrl": "https://www.imdb.com/user/ur0084988",
      "reviewLink": "https://www.imdb.com/review/rw0439122",
      "warningSpoilers": false,
      "date": "8 August 1998",
      "rate": "",
      "helpful": "144 out of 191 found this helpful.",
      "title": "An On-Film Miracle",
      "content": "Although it sometimes seems that Hollywood is catering to the lowest common denominator of everything, The Truman Show is proof that there are great ideas that are able to be turned into great movies. Jim Carrey plays an excellent role as a man with whom you can emphasize as well as be entertained by. The film's surrealistic nature is frightening when the viewer realizes the legal feasibility in today's society, and it offers a great message about who or what we assume God to be and how He (he?) would react to our personal drives for discovery to challenge a world we treat as an aquarium. Some things to note and ponder: The way the real-life viewers ignore the real lives of their compatriots and customers while focusing on a false life on screen; whose life is more real and whose is worth living? Also, note that Christof does not have his name listed among the \"real world\" in the credits, but in \"Christof's World.\" His high-profile media-driven life is no different from Truman's!"
    },
    {
      "username": "aidanratesmovies",
      "userUrl": "https://www.imdb.com/user/ur48282208",
      "reviewLink": "https://www.imdb.com/review/rw6930358",
      "warningSpoilers": false,
      "date": "16 May 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Good Afternoon, Good Evening, and Goodnight",
      "content": "One of the most creative films ever conceived, let alone made and executed- The Truman Show is on all fronts an absolutely perfect film- and will stand the test of time as an absolute classic. On every singular level this film works astoundly- jim Carrey provides a pitch perfect performance as our titular star Truman Burbank- in an incredible casting decision that I am sure turned a lot of heads at the time. Yes we see some of that classic Carrey throughout the film- but the man can act, and never before had it been brought to such attention as it had with this film- and he captures his role perfectly. The other actors do an excellent job as well, namely Ed Harris and Natascha McElhone- as well as Laura Linney and Noah Emmerich. The direction is fantastic, and much needed for the creative vision of the film at hand. The script is not only well done, but incredibly thought provoking, original, and brilliantly put into flm format. The music is fantastic, letting us feel so much emotion from such simple and classic pieces of work. The pacing is excellent, and the film leaves you with a smile and you wanting more- as I think any good film should. In the end, I have absolutely no complaints about The Truman Show. I've seen it more times than I can count, and it's easily one of my favorite films out there. Its a creative masterpiece that is unlike anything we would ever see today, or anything before it. It may be 20 years old, but The Truman Show may just be one of the most brilliant and influential films ever made.My Rating: 10/10."
    },
    {
      "username": "itamarscomix",
      "userUrl": "https://www.imdb.com/user/ur5358902",
      "reviewLink": "https://www.imdb.com/review/rw1329198",
      "warningSpoilers": false,
      "date": "30 March 2006",
      "rate": "10",
      "helpful": "20 out of 26 found this helpful.",
      "title": "Oh, and in case I don't see ya",
      "content": "With its (all intentional of course) cheerfully colorful cinematography, cheesy music and one-dimensional supporting characters, it's easy to miss just how brilliant The Truman Show is; it's in fact one of the most important cinematic creations of the 1990's, at least as important as darker films like American History X and Fight Club, and one that works on several different levels. Because while it works quite clearly as a sarcastic satire and a commentary on the destructive and intrusive nature of the media in the post-modern age, in the light of the reality TV syndrome which was at the time just starting to grow, it's also a philosophical metaphor about the state of mankind.For Truman's story is man's story; and it's difficult not to see the importance in the names given to the lead characters. True Man's life, the film says, is an illusion, a lie. Or perhaps  all our lives are illusions, but the True Man is the one who figures it out and seeks a deeper truth. In its essence the point is very similar to the one The Matrix made; The Truman Show is a fascinating trip through Plato's Cave, and while it takes a rather simplistic look at Plato's philosophy  because any other way would be impossible in a film of less than two hours  it doesn't dumb it down. The Truman Show is a deep and intricate film that deserves repeated viewing and gets better with time, and can be discussed for hours.Writer Andrew Niccol  who made his breakthrough debut one year before with the critically acclaimed cult favorite Gattaca  lost the Oscar that year to the Academy's favorite Shakespeare In Love, and director Peter Weir got most of the credit for the film; but while it's certainly an important achievement for Weir and the best film of his long career, it's Niccol's sarcastic, intelligent, innovative script that made The Truman Show great; that, and the amazing performance by Jim Carrey, who showed his fantastic dramatic skills here for the first time. Carrey is enchanting in the lead role as the ultimate everyman Truman, and we're as fascinated with him as the show's fans in the film. Praise should also go to Ed Harris, who plays Christof, creator and director of The Truman Show (and again, special attention should be given to the character's name)  and also to Laura Linney, Noah Emmerich, Natasha McElhone, Harry Shearer, Peter Krause, Paul Giamatti and the rest of the wonderful supporting cast, both in Truman's world of Seahavan and in Christof's 'real' world. Finally, a word of praise for the excellent musical score, composed by Burkhard von Dallwitz and the great Philip Glass, which compliments the film's atmosphere to perfection.The Truman Show is not an easy movie to absorb; it's a disturbing tale and a disturbing message, which takes some time to seep in, and while it's entirely unconvincing as a reality and even as sci-fi, and feels more like a metaphor than a story of a specific man, it's also entirely involving and demands to be taken at face value. Truman's character is irresistibly charming, and just like the people watching The Truman Show, we believe in him and identify with him completely. The beauty of The Truman Show is that it's lots of fun; it proves that entertainment and art are not necessarily opposing ideals. By being entirely entertaining and gripping, it gets its messages across a whole lot better.The Truman Show is now eight years old: the way I see it, once a decade has passed, a film can begins to be considered a classic. The Truman Show will pass that test. In any possible aspect, The Truman Show is one of the absolute best films of the 90's, and one that will remain relevant long after reality TV has bitten the dust."
    },
    {
      "username": "mermatt",
      "userUrl": "https://www.imdb.com/user/ur0088076",
      "reviewLink": "https://www.imdb.com/review/rw0438704",
      "warningSpoilers": false,
      "date": "30 July 1998",
      "rate": "",
      "helpful": "5 out of 5 found this helpful.",
      "title": "True Man",
      "content": "The film is an amazing combination of existentialism, surrealism, and symbolism. Truman turns into a Christ figure by the end and represents the desire of all people to find the truth of who they are and why they exist. > What is really amazing is that all of this is poured together into one film that is entertaining as well as thought provoking. How often do we get that from Hollywood? Other than CONTACT, I can't think of many other films recently."
    },
    {
      "username": "breakdownthatfilm-blogspot-com",
      "userUrl": "https://www.imdb.com/user/ur29565770",
      "reviewLink": "https://www.imdb.com/review/rw2735251",
      "warningSpoilers": false,
      "date": "11 January 2013",
      "rate": "8",
      "helpful": "20 out of 27 found this helpful.",
      "title": "Very engaging even for non Jim Carrey fans",
      "content": "As many fans know, Jim Carrey is the man when it comes to slapstick comedy. His comical physicality is outrageous and his ability to emulate anything from cartoons to other actors is top notch. But anytime before 1998 I think I can safely say that not many people saw Carrey try and jump out of his shell and try a role that wasn't truly in the comedy genre. I definitely didn't see it coming. And to be honest, I wasn't sure if I would really enjoy it. But in the end, I did, not only because of how well Carrey portrayed his character but with an excellent story to back if up.The plot is about Truman Burbank (Jim Carrey) who is viewed live 24 hours a day, uncensored, as a soap opera to the real world through public broadcasting. The thing is, Truman Burbank is the only one who doesn't know this. Everything else around is all a set-up. And when I mean everything,...everything...is a set-up. Even the sun is fake! Nothing is real. All the people Burbank knows are all actors. People who go through the same routine every day.And that's partially what makes this film so great. Every piece of the \"set\" that Truman Burbank lives in is so believable. Along with this is Christof, acted by Ed Harris. Christof is the creator of Truman's world and he essentially plays God. Everything that Truman Burbank is as a person, was created under the supervision of Christof. The whole story itself, written by Andrew Niccol, brings up the controversial issue of nature vs nurture. Who should have control over whose life. Well I think that answer is obvious.Jim Carrey himself actually does have some comedic moments but it's not because he wants the movie to be a comedy. Carrey does what he does because it is the connection to how a human would react to such a situation that makes it funny. And along with those funny moments comes a real emotional performance. Sure Carrey can deliver laughs but also proves that he can portray human drama. That's a question a lot of people wanted to see if Carrey could pull off and he did it well.Adding to the emotion is composer Philip Glass' score. Yes, it did evoke the right emotions and I don't think it needed a theme either for this particular story. Usually I do, but it didn't seem necessary here. Unfortunately for me, I prefer to see Jim Carrey in his comedic skin. I didn't mind the different role that he took on here but it didn't feel like I was watching the movie I wanted to see. And I'll admit, I put too much thought into believing Jim Carrey would've made the film more comedy than drama, so basically I disappointed myself. So on that note, it could be disappointing to fans of Carrey for his comedic films as well.As the first drama film that comic gut buster Jim Carrey stars in, it is not that bad as some would expect it to be. Carrey can deliver a performance like real human but for the hardcore fans, it may upset."
    },
    {
      "username": "wlay-81852",
      "userUrl": "https://www.imdb.com/user/ur68823481",
      "reviewLink": "https://www.imdb.com/review/rw3543196",
      "warningSpoilers": false,
      "date": "13 September 2016",
      "rate": "9",
      "helpful": "120 out of 125 found this helpful.",
      "title": "Very good!",
      "content": "I've seen The Truman Show a multitude of times, and each time it gets better. First watching it at a young age (Roughly 10 years old), I never picked up on much of the deeper meaning behind the film. The idea of someone's whole life being a television program was simply entertaining. Now, as an older viewer and with more experience in analyzing books and movies, I can really pick up on the satirical meaning behind the plot. Truman plays the star of a 24/7 television program. His entire life is broadcasted for all the world to see. He is raised to believe that there is no real reason to try and leave his perfect \"island\". Throughout the film, we watch as Truman tries time and time again to discover the truth behind his life, and as he attempts to escape. The struggle he experiences while trying to break free from the artificial world can be seen as a satirical message. The world is trying to oppress you, and although difficult, you can escape. This is supported by a statement made by the creator of the Truman show. He said, \"We accept the reality of the world with which we are presented. It's as simple as that\". Several other hidden messages (Ideas) appear throughout the film. All the actors who play roles in Truman's life, are indeed fake. Despite directly lying to a person whose life is immediately affected by that lie, the actors/actresses show no emotion for Truman. This is comparable to the lack of care society has for the majority of its citizens. Overall, The Truman Show is filled with subliminal messages and hidden meanings, all of which can be directly tied back to daily life."
    },
    {
      "username": "kingoham5",
      "userUrl": "https://www.imdb.com/user/ur0539077",
      "reviewLink": "https://www.imdb.com/review/rw0438906",
      "warningSpoilers": false,
      "date": "15 December 1999",
      "rate": "10",
      "helpful": "332 out of 378 found this helpful.",
      "title": "A True American Classic",
      "content": "When I first saw 'The Truman Show' I came out of the theatre amazed. This is your first clue that you are watching something different from your normal Jim Carrey movie. I love the dialogue, camera shot, performances, direction, music, and running time of this movie. There is nothing I would do to change it. I came away from 'The Truman Show' feeling inspired which is the goal of good filmmaking Jim Carrey was outstanding as Truman, underplaying him, not making him too comic or too dramatic, but giving true sincerity when asked. He deserved an Oscar nomination. Ed Harris has always been a good actor, but in this movie he's a great actor. He plays Christof with such arrogance and bullheadedness that you don't know whether he's helping or destroying Truman. He and the director, Peter Weir, deserved their Oscar nods.Weir, who directed the great 'Witness', uses different camera angles to make you feel like you're actually watching 'The Truman Show' and not a movie. He ends it before you get tired of the concept and helped Carrey and Harris give immaculate performances. Andrew Niccol script is a real star in the movie too because of it's inventiveness and ingenuity. Overall, 'The Truman Show' is what I like to call a true American classic."
    },
    {
      "username": "kiradykesky",
      "userUrl": "https://www.imdb.com/user/ur114828712",
      "reviewLink": "https://www.imdb.com/review/rw5593616",
      "warningSpoilers": false,
      "date": "31 March 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Absurd drama contains truth.",
      "content": "The script is very creative, doubting that this is not a movie at all, but a complete realization at the end of life; to the so-called real world, although there are lies and hurt, but cruel truth is always better than false content; The mediocre person never notices."
    },
    {
      "username": "Jeremy-4",
      "userUrl": "https://www.imdb.com/user/ur0011667",
      "reviewLink": "https://www.imdb.com/review/rw0438791",
      "warningSpoilers": true,
      "date": "16 March 1999",
      "rate": "",
      "helpful": "96 out of 129 found this helpful.",
      "title": "The Boy In The Bubble",
      "content": "Having been bandied about the release schedules for the best part of a year, Carrey's first semi-dramatic film finally got a UK release last October. He plays Truman Burbank, a vaguely unhappy insurance salesman in the perfect little seaside town of Seahaven. Following some strange occurrences, Truman starts to think that he is being watched. Little does he know that his entire life is secretly filmed, his town is a gigantic sound-stage, everyone he has ever known was an actor and that his every waking and sleeping second is broadcast around the world as a top-rated docu-soap.Critics have been lavishing enormous praise on this movie since it opened in America last June, and probably rightly so because it is a superbly crafted piece of work. Weir's direction is outstanding, frequently viewing events from the point of view of hidden spy cameras, such as the one in Truman's car radio. One stunning shot has the town's main street full of motionless extras, waiting for Truman to turn the corner. Jim Carrey's performance has been singled out for particular praise, and though his acting is of a much higher standard that his usual comedy antics, it is not exactly Laurence Olivier. This said, an Oscar nomination would have been well deserved. The setting of a chirpy small town from which escape is impossible echoes cult 60's series The Prisoner, but the balance of reality and poetry is much more restrained here than it was then. The opening credits are especially clever, using those of the actual `show' (e.g. Truman Burbank as Himself). There are, however, a few problems. The film is simply too short to adequately explore Truman's situation, and the character of Meryl, his `wife', disappears about half-an-hour from the end. This kind of slightly sloppy scripting was not something I expected from writer Andrew Niccol, whose previous film Gattaca, which he also directed, was such an immediate classic. Gripes aside, this is an extraordinary and highly original film that really is worth seeing several times to fully understand the director's message. It doesn't even matter if you never liked Jim Carrey before. You will now."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3142292",
      "warningSpoilers": false,
      "date": "15 December 2014",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "original, funny, touching, compelling",
      "content": "Truman Burbank (Jim Carrey) lives an ordinary life as an insurance man in an idyllic seaside town Seahaven. He would love to go to Fiji but he is trap on the island by a fear stemming from a childhood trauma. It turns out his whole life is manufactured by TV artist Christof (Ed Harris). The Truman Show is the most popular TV-series in the world. His wife Meryl is played by actress Hannah Gill (Laura Linney). His best friend Marlon (Noah Emmerich) along with everybody in the town as well as the town itself is completely fake. Even his childhood trauma was manufactured. Questionable things keep happening. Sylvia (Natascha McElhone) who played his dreamgirl Lauren tries to help him escape.On one level, this is a profound drama about the TV world and modern life. On another level, this is a great character and Jim Carrey carries it off beautifully. It is both funny and thought-provoking. It's probably looked back on as a signpost for the 90s. This is a movie that is completely original and compelling."
    }
  ],
  "errorMessage": ""
}