{
  "imDbId": "tt0095016",
  "title": "Die Hard",
  "fullTitle": "Die Hard (1988)",
  "type": "Movie",
  "year": "1988",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2250278",
      "warningSpoilers": false,
      "date": "15 May 2010",
      "rate": "10",
      "helpful": "128 out of 153 found this helpful.",
      "title": "Not only the best of the Die Hard franchise but one of the best movies of the action genre",
      "content": "Even if the non-action parts are a tad slow in comparison, that is more than compensated by so many things that makes Die Hard so brilliant.For one thing the action is explosive and consistently exciting, and the cinematography is astounding being very inventive and colourful. John McTiernon(The Hunt for Red October, Last Action Hero) directs briskly and efficiently, and the pacing a vast majority of the time is exhilarating.Then there is a terrific score by Michael Kamen, some intelligent and witty scripting and a plot that doesn't feel forced or convoluted. Not to mention some excellent acting. As good as Bruce Willis is, yes his character is somewhat two-dimensional, but he is also resourceful and world-weary and Willis handles this really well, it is Alan Rickman who steals the acting honours as Hans Gruber. Gruber is cold, calculating, suave and menacing, in my opinion only Rickman could do justice to such a character. Overall, a superb movie, not only the best of the Die Hard franchise but one of the best of the action genre. 10/10 Bethany Cox"
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3493691",
      "warningSpoilers": false,
      "date": "25 June 2016",
      "rate": "10",
      "helpful": "49 out of 58 found this helpful.",
      "title": "It can't be bettered",
      "content": "This original action classic has been hugely influential over the years - and it's no surprise, as it's one of the best action thrillers ever made. New meaning is brought to the word \"action\" as here it is exhilarating, furious and nothing less than exciting. The premise is simple: one location, one good guy and twelve bad guys. Cue lots of explosions, fist fights, blood, violence, and plenty of shooting too. The thrills come from the suspense of Willis using his wits as well as his brawn to fight the bad guys and save the hostages.When watching this film what becomes immediately apparent is how fresh it is. This hasn't been filmed with some cheap cameras for a quick buck, it looks professional and couldn't be less polished. The photography is clear and brings out the best of the surroundings, while the music has obviously been carefully chosen to convey the right mood. And, strangely enough for an action film, the acting is actually very good. Unheard of, as remember this was back in the days where Schwarzenegger and Stallone were the top stars of the action genre. Bruce Willis excels as the wisecracking, sardonic cop, and you can't fail to like him. He's consistently witty and provides a powerful presence when needed - it comes as no surprise as he lived off this image for the next six or seven years.The supporting cast aren't half bad, either. The reliable Bonnie Bedelia takes a break from her usual highbrow, \"moral dilemma\", television movie fare as Willis' tough wife, while Reginald Veljohnson is also great as a sympathetic cop - you just want to hug him. But most memorable of all is Alan Rickman for his excellent turn as the cool, calculating terrorist with a carefully-crafted German accent and a fine line in natty suits. Rickman is THE bad guy of modern cinema, watch any subsequent action film with terrorists and you'll see people trying to be him. He's that good. The rest of the cast of terrorists have all been picked for their imposing looks, and they're not bad either. Keep your eyes peeled for fearsome Bond baddie Robert Davi in a minor role as an FBI man.As well as the tense running around in corridors and stand-offs between Willis and the various creeps, this film really delivers in the action stakes. The guys here really do look like they are trying their hardest to kill each other, and we get people flying down stairs, getting chains wrapped around their necks, getting shot all over the place. Every kill that Willis makes is original and exciting. There are also plenty of ace stunts, like when Willis jumps off an exploding roof with only a fire hose tied around his waist. The gore level is high, graphic in fact, with people being shot apart wherever you look, and it's definitely a film for all cinema fans to enjoy. Consistently entertaining and strong enough to withstand repeated viewings, this is the first and final word on the \"one guy versus lots of bad guys\" sub-genre of the action flick."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw4052895",
      "warningSpoilers": true,
      "date": "4 February 2018",
      "rate": "10",
      "helpful": "168 out of 215 found this helpful.",
      "title": "The greatest bad-ass best action movie hands down my personal favorite number 1 movie of all time",
      "content": "Die Hard (1988) the first action film is by far one of the greatest best action movies of all time from the 80's till this day hands down. It is my number 1 personal favorite action movie of all time, I love this movie to death! I love it so damn much and I have fun watching it so much. I have to talk about this movie: It is one man army fighting against a team of terrorists with automatic weapons and plastic explosives. Bruce Willis performance was excellent in this movie John McClane is his best role ever. It is my number 1 personal favorite action movie of all time, I love this movie to death! It's stay in my heart forever. To me it felt this film realistic and it makes you think that you are alone trapped in a building against bunch of terrorists what will you do? This film has heart and soul. A lot of movies have try to do that premise since, but no movie has nail it like \"Die Hard.\" This is a modern day action film of the action genre. I watch this film as a teenager I even watch it with my mom it was ultimate thrill ride. I love everyone in here all the characters and the lead character. I love that McClane is alone he has no help, all telephones doesn't work he is barefoot with his gun and the only help has is from Sgt. Al Powell down there who didn't even see him at all but were both talking on a radio from cop to cop. I love that bond between those two lead heroes. I always love when McClane talks to himself whenever he was about to do something crazy. It is going to be 30 years anniversary this summer 20th July. I love this film to death I am hugh fan of Die Hard films I love this film so damn much. I would really love to see this movie in a widescreen in a movie theater. It was directed by brilliant John McTiernan it is is based on a novel Roderick Thorp Nothing Lasts Forever. This is a masterpiece action film that started all action genre one man army types battling terrorists while trapped in a confined space. It was arguably the first one in the action genre. This movie has everything . It has intense Action, Drama, Thriller, twists, great dialogue, explosions, fights. Exploding building, great helicopter explosion action scenes. John McClane is one man against a whole team of terrorists. A cracking Action Thriller from beginning to end, Die Hard explodes with heart-stopping suspense! It has great cast, great plot, great explosions, no shaky cam, doesn't deal with CGI, but real actions real practical effects. Great Direction from John McTiernan, great dialogues, great acting from everyone. Everyone does an excellent job. Bruce Willis is a bad ass action star as John McClane. It has a great bad-ass action hero who does impossible buy stopping the terrorists who were actually a real terrorists who try to steal the money in a vault 640.000.000$ in bearer bonds stored in the building's vault. My favorite action sequences and the best part of Die Hard: McClane grabs the fire hose, ties it around his body jumps with the helicopter about to kill him. Then Gruber blows it a second after McLane jumps off the roof! It was an incredible explosion that totally takes out the helicopter. But McLane is falling down the side of the building and needs to get inside quickly this is the best scene in the movie my favorite. McClane climbs in the elevator shaft escapes Karl and his men trying to kill him. McClane shoots on the table with his gun killing Marco. (According to the director, the proximity of the gun to Willis' ear during this scene caused permanent hearing loss for Willis.) McClane shot's Hans and Eddie \"Happy - Trails, Hans...\" Incredibly satisfying action in a brilliant action movie! McClane try to save Ellis when Ellis try to save him self. McClane was afraid of flying and he always carry gun because he was afraid someone would have hijack it. The fight between Karl and John was excellent and well choreographed. McClane drops C4 down the elevator shaft and destroys the entire floor where the terrorists are firing from, giving the cops a chance to retreat. I love The broken glass scene. He shoot's and kills two terrorists with his machine gun to escape Hans and Karl, John McClane is forced to sprint over broken glass while barefoot the best bad-ass scene in the movie my all time favorite. Three terrorists are shooting on McClane on the roof chasing him in which he escapes in the beginning of the movie awesome. Karl shoots in an elevator shaft in which McClane is hiding a real kick-ass scene I love this film to death! I love the characters in this movie: John McClane a real action hero to me that does something that no one can he stops a team of terrorists. Hans Grubar the German mastermind he was ruthless and brilliant and he would do anything to steal the money even killing people and get what he want's. Alan Rickman's performance was excellent I love him to death in this movie. I really miss the actor he was the best villain of the whole world. The LAPD Supervisor (Diana James) I like that girl she was so good when McClane call's her for help, I love it. I love Sgt. Al Powell how he stand's up and defends McClane against his supervisor. Reginald VelJohnson does a brilliant performance as a great supporting hero in this movie. I love Deputy Police Chief Dwayne T. Robinson to death he is my favorite character in here. Paul Gleason was so good I love his performance - \"kick ass.\" I love how he tried everything to safe the hostages including SWAT team who were badly hurt. I like Richard Thornburg in this movie who is annoying reporter but I still like it. Bonnie Bedelia as Holly McClane's wife was great.John McTiernan directed excellent this masterpiece Jeb Stuart and Steven E. de Souza wrote a script that it delivers. The helicopters in here were models in this movie delivered, to me the action scenes felt realistic. This movie has ton's of action and you never get bored with it. Michael Kamen made a music score and you never get bored with it. You'll see lots of heavy automatic and explosive weapons, and you'll see them used well. The film is violent, and bloody rated R with real blood squibs. 10/10 it is my favorite action film in the action genre I love this film to death it is my personal action favorite film. I miss movies like this I miss action movies like this one today I want them back. It is a shame we don't have movies like this today."
    },
    {
      "username": "Robert_duder",
      "userUrl": "https://www.imdb.com/user/ur1697212",
      "reviewLink": "https://www.imdb.com/review/rw1593673",
      "warningSpoilers": true,
      "date": "7 February 2007",
      "rate": "10",
      "helpful": "49 out of 61 found this helpful.",
      "title": "Was there Action Films before Die Hard?? Who cares!! Die Hard is the patriarch of modern action.",
      "content": "Of course the Action Genre existed before Die Hard. After all you had The Terminator, Commando, Top Gun, Roadhouse...but didn't Die Hard absolutely revolutionize the eighties action Genre. It came like a savior and encompassed everything that would blow you right out the back of the theater and made Bruce Willis an absolute idol in the Action world and for good reason. Die Hard had pointless nudity, scores of bad language, bloody death, guns, explosions, a gritty, tough as nails, sweating, dirty hero that takes on everyone with nothing more than a hand gun and his brains. If you watch Willis in Die Hard it's a thing of beauty. His shirt torn off, bare foot, wounds all over him...he looks like he just crawled from a war rather than stalking terrorists through an enormous high rise office building in L.A. The script was so dead on...it was basic, it was to the point, it has great sarcastic humor and one liners that could never be forgotten. And Willis was the man to pull it all together. Add a decent supporting cast, a guy on the ground who is like his partner and a MacGyver style of killing bad guys that will go down in history...THIS IS DIE HARD.Bruce Willis was brought up right in the Prime of his TV Series Moonlighting where his irresistible charm and personality made him a hit. John McLean was David Addison but with a lot more guts and a lot more ammo. That only made the film more exciting to fans of Willis already. Willis has a way of just making everything edge of your seat and everything believable. Who else could make you smile in fear when he's diving out of a 30 story window attached to a fire hose while the roof of the building is exploding. He really doesn't single handedly make the film...the supporting cast is terrific. Bonnie Bedelia is great as McLean's straight laced, professional and estranged wife. They make an odd yet touching couple. They have some electricity and it's ironic and yet sensible that they don't end up together throughout the series. Still Bedelia is a great female lead and her character is strong and not at all misused in the role. Alan Rickman is just one kick ass bad guy. Can you say anything else?? As terrorist Hans Gruber he is terrifying, evil, brilliant, and you just despise him and you can't wait to see him go up against Willis and he does. He doesn't stand a chance but Rickman is still brilliant as the bad guy. Reginald VelJohnson plays a small yet very important role as Willis' guy on the ground on the other end of a walkie talkie. They don't know each other, and barely know each other's name but yet they become as close as partners and they too are odd together and yet fit. William Atherton has to be mentioned even though it's a very small role, it's Die Hard history that he plays slimy, tabloid reporter Richard Thornburg who gets his just end by Holly McLean's fist which becomes a running joke in the series.Die Hard is everything that people would look at in disgust now in the new millennium and yet it was everything the eighties stood for when it came to action and heroes. McLean has a cigarette dangling from his mouth, blood pouring everywhere, and a happy ending despite all the destruction around them. If you haven't seen Die Hard you can't ever proclaim yourself an action fan because Die Hard IS action. It's the film every action film strives to live to and will never meet...whether it was before 1988 or after. We won't ever get something like this again. It's an absolute 100% classic!! for all the wrong reasons!! 10/10"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2744236",
      "warningSpoilers": false,
      "date": "27 January 2013",
      "rate": "",
      "helpful": "22 out of 27 found this helpful.",
      "title": "Wham Bam Action Classic",
      "content": "Die Hard (1988) *** (out of 4)Enjoyable and tense thriller about a group of terrorists (led by Alan Rickman) who overtake a L.A. skyscraper and the only thing keeping them from getting away with their crime is a New York police officer (Bruce Willis) there on vacation. There's a lot of very good things about this movie but I've always thought that the majority of the credit has to go to star Willis. He might not have been a A-list star at the time this was released but it's easy to see why he became one afterwards. I think what's so great about him and the character he plays is that we can believe he's just your typical guy you'd see walking around on the streets with you. That every-day-man quality that Willis has works so well here because of the odds stacked against his character you can't help but just sit back and enjoy this one person taking out a professional organization. The hilarious one-liners, the smart remarks and the way Willis makes himself know to the terrorists is just classic and we get so many great showdowns that you can't help enjoy all of them. It certainly doesn't hurt that you've got a strong supporting cast with Rickman being a villain you just love to hate. The coldness RIckman brings to the part is the perfect contrast to Willis' cop and it works perfectly. Reginald VelJohnson, William Atherton, Bonnie Bedelia and Paul Gleason also add great support for Willis to play off of. The action scenes are certainly some of the best you're going to see and what holds them together so well is the direction by John McTiernan. He perfectly blends the humor, tension and the action but he also gives the film a wonderful pace that keeps it moving at a fast rate. DIE HARD might be far-fetched in what one man is able to do but this really doesn't take away from any of the fun."
    },
    {
      "username": "PredragReviews",
      "userUrl": "https://www.imdb.com/user/ur65737204",
      "reviewLink": "https://www.imdb.com/review/rw3463961",
      "warningSpoilers": false,
      "date": "5 May 2016",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Now I Have a Machine Gun, Ho-Ho-Ho",
      "content": "In stepped John McTiernan and Bruce Willis with Die Hard. Willis, most famous at the time for the comic TV Series 'Moonlighting', made a perfect ordinary-man-in-an-extraordinary-situation action hero. He was believable as John McClane and not immune to being hurt. He bled and felt pain, a first for the genre. And yet his cool confident delivery of a great wisecracking, intelligent script made him all the cooler. But most credit should go to Director John McTiernan, king of the sophisticated action flick. He made action movies slick, smart and full of pace and wit while never letting up on the bullets, cars and bombs front. Special praise must go out to Alan Rickman too whose performance as chief baddie Hans is to this day one of cinemas finest, moving convincingly from cool, calm and collected to desperate and nervous, never once seeming anything less than utterly ruthless and calculating. Even after we discover that Hans isn't there as a political terrorist but simply as a thief, he loses absolutely no villain credibility when he responds to Holly McClane's criticism by saying \"I am an exceptional thief, Mrs. McClane and since I'm moving to kidnapping you should be more polite.\" Although we know Hans is capable of vile acts, he actually sees those as merely means to a greater and somehow justifiable end. His disposition is almost humanitarian and you would imagine him as quite a gentleman outside of the context of the crimes he commits in Die Hard's arc. In the end though, Hans is a pure sociopath that even the audience is conned into sympathizing with. I would actually argue that Die Hard is the greatest pure action film ever made. Yippie-ki-yay *muddy funster*... and happy holidays.Overall rating: 9 out of 10."
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw8646356",
      "warningSpoilers": false,
      "date": "30 October 2022",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "\"Welcome to the party, pal!\"",
      "content": "(In brief) By any measure, \"Die Hard\" was a pretty muscular movie back in '88. It made cultural icons out of its two stars and the explosions were guaranteed crowd pleasers. The script (note-perfect) ran like clockwork with setup-and-payoff and was stocked with memorable characters throughout; the hero reluctant and vulnerable, his stakes ever ratcheting, while the action would just keep mounting until . . . Well, there wasn't any more opulent high-rise. It doesn't matter what time of year you watch this movie, it functions perfectly in July and December (or even today, so close to Halloween) and always his the spot. It's the ultimate \"You can't go wrong with\" movie.(Less brief) After twenty minutes of story setup, BAM! The guns start blazing and the death toll gets going. At a certain point, this just becomes kind of a theme park ride as John McClane scrambles through the bowels of Nakatomi Plaza and everything's raining down around him.McClane is the key to making all of this work after all. He's the ideal rally-behind character, neither hulking nor shredded and always thrust into a fight; and Bruce Willis is working at peak likability. But he's matched by Alan Rickman, the master scene-stealer, as devilish as they come. It's a rivalry commensurate with such a big movie.And McTiernan's the perfect director for this gig. His direction is self-assured, his camera calm and measured. Sure, we're confined to this building the whole time, but the audience had plenty of moments to take a breath and soak it in. Put it this way: can you imagine someone like J. J. Abrams helming this? Stock up on Dramamine first.I can go on and on, but the bottom line is this: \"Die Hard\" is just *fun*. There's joy in the gunfire, personal injury and wanton property destruction. I always feel great after watching this."
    },
    {
      "username": "dee.reid",
      "userUrl": "https://www.imdb.com/user/ur0892646",
      "reviewLink": "https://www.imdb.com/review/rw0991860",
      "warningSpoilers": false,
      "date": "4 January 2005",
      "rate": "10",
      "helpful": "278 out of 400 found this helpful.",
      "title": "You'll \"Die Hard\" with this action-lover's action movie",
      "content": "One could claim that 1988's \"Die Hard\" is one of the most influential action movies ever made because it basically revolutionized one of the most copied (but never matched, at least in terms of quality) formulas: a loner, by some unique twist of fate, battles it out with an \"x\" number of terrorists in an enclosed environment.By the time that \"Die Hard\" was released, the action movies were most often dominated by the likes of Arnold Schwarzenegger, Sylvester Stallone, and Chuck Norris. Star Bruce Willis, whose only notable credits at the time were television's \"Moonlighting\" and 1987's \"Blind Date,\" which was released the year before, was the unlikeliest of them all.Willis was a wild card - an unlikely choice for the role of our hero \"John McClane\" - since he didn't have any action credits on his resume' and let's face it: Bruce Willis just didn't have the bulging biceps required for a role like this. But that's the beauty of his performance in this movie: he's an everyday guy, caught in a not-so-everyday situation.On Christmas, McClane's estranged wife Holly (Bonnie Bedelia) invites him from New York all the way out to Los Angeles to spend the holidays with the family. But it requires him to make a stop at the Nakatomi offices, which is having an after-hours Christmas party. Riding for the first time in a limo, he's introduced to the suave driver, Argyle (De'voreaux White), who gives him some pretty useful advice on trying to win over the wife.At Nakatomi, things of course get off to a rough start for McClane, as he gets into an argument with the wife and is left to wallow in his misery. However, those problems are about to take a backseat to the real \"party\" - twelve terrorists, led by Hans Gruber (all-purpose bad guy Alan Rickman, perfectly cast) - seize control of the building and proceed to rob the Nakatomi building of its assets, most of which include negotiable bonds and other valuables. But they didn't count on the \"fly in the ointment\" (pain in the a**) to make things hell for these so-called party crashers.Certainly one of the best known action movies ever, \"Die Hard\" did receive the scorn of critics upon its 1988 summer release, but the audiences sung a completely different tune.The film was most often praised for the production, with the brand-new Fox Plaza office tower serving as the fictional Nakatomi building. It was also praised for the energetic and skillful direction of John McTiernan, whose most notable credit was the action-sci-fi thriller \"Predator,\" which was released the year before and starred Arnold Schwarzenegger.Bruce Willis was the perfect actor for this performance, since he brings the wit and vulnerability to a role like this one. If Stallone or Schwarzenegger were in this movie, I'm sure the effect would have been a lot different.Personally, I think \"Die Hard\" is one of the greatest action movies ever, up there close to my favorite action movie of all time, \"Raiders of the Lost Ark.\" Like Indiana Jones in that film, \"Die Hard\" had an Everyman cast in the role; McClane, like Indiana Jones, wasn't a larger-than-life musclebound grotesque: he was a real guy that you cared about, who got hurt, and had real feelings.That's why I think both of these movies have sort of stood the test of time as becoming what they are best known for today: action classics, and they're here to stay, ladies and gentlemen.10/10"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3195241",
      "warningSpoilers": true,
      "date": "1 March 2015",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "\"Yipee-ki-yay M.....F.....!\"",
      "content": "Totally outrageous, totally unbelievable and totally over the top - and as Hans Gruber (Alan Rickman) would say - 'But who cares'? It's Bruce Willis in a version of saving humanity along the lines of John Wayne, Rambo and Marshal Dillon. Personally, John McClane had me when he said he was partial to Roy Rogers because that's who my favorite TV and movie cowboy was as a kid growing up. I'd bet that someone might say that of Willis some day.In his own way, John McClane must have had some sort of mystical power because up until the point he started crawling through the transom feeling like a TV dinner, his wife-beater t-shirt was white with some blood spatter. But when he hit the floor again to do battle with the bad guys it suddenly turned brown. So mesmerized was I by this turn of events that I never even noticed when the shirt turned a neat dark forest green later in the picture. I wonder how stuff like that gets by the director? Say, and how about the FBI sending in a double Johnson to take over the attack at Nakatomi Plaza? I'm sure there's a pretty good punch line in there somewhere but I think I'll just let it go for now.It's been stated, and rightly so I think, that this film set a new standard for action/adventure flicks with Bruce Willis portraying a new kind of hero. He's smart, thinks on his feet, takes what help he can get, and engages in wise-ass banter to keep the audience fully engaged. All the noise, explosions and crashing glass is merely window dressing to keep the story moving as our hero saves the day. What more can you ask for in a two hour action flick? You know, if this was a Roy Rogers Western it would probably have a title like \"Under California Stars\". If I had to guess, I'd say Bruce Willis saw that one when he was a kid."
    },
    {
      "username": "Screen_Blitz",
      "userUrl": "https://www.imdb.com/user/ur24623283",
      "reviewLink": "https://www.imdb.com/review/rw3365723",
      "warningSpoilers": false,
      "date": "3 December 2015",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Influential and revolutionary action movie that redefined its genre",
      "content": "In the late 1980s, Director John McTiernan refined the action film genre with this action- packed thriller that not only stars Bruce Willis is the role that defined his career, but also brought impressed audiences everywhere with ecstatic action sequences complete with amazing practical effects, inspiring characters, and one of the most original scripts for an action movie written for its time. This movie stars Bruce Willis as John McClane, a New York cop who heads on vacation to Los Angeles for the holidays, to spend Christmas with his wife Holly Genero (played by Bonnie Bedelia) and kids. Upon arriving at the Nakatomi Plaza building where she works, he and his wife ended having an argument dealing with family matters. Their dispute is eventually interrupted when the building becomes under attack by a dozen German terrorists lead by the ruthless Hans Gruber (played by Alan Rickman) who's intent on robbing the company of its money. Pitted against overwhelming odds and Gruber's diabolical mind, John McClane must take matters into his own hands and fight off the terrorists who have his wife, along with hundreds of innocent civilians held hostage, with no aid from the Los Angeles Police Department who are helpless against the terrorists' overwhelming power.My family and I catch this fi on cable almost every year during the Christmas season and this never gets old. Unlike other action films from the 80s that spit cheesy little one-liners and mindless gun shootouts, this film presents viewers with a very likable protagonist who is self aware with his flaws and has feels very human, a Villain who is near equally likable and incredibly smart, and the dialogue between these two characters (which are spoken via walkie-talkies for the majority of the time) is very witty and clever that keep viewers' attention. The main character John McClane spends most of the time fighting off the terrorists who are lead by Hans Gruber, and the scenes are exciting to watch. Glossing with intense gunfights, explosions, stellar camera-work and fight choreography, the scenes keep viewers strapped to their seats. In the scenes when the action lightens up, there are some interesting conversations between characters like McClane, who at one point, shares a tender moment with a cop by admitting his flaws as a husband and a man as a whole. These moments are make you feel for the character and are presented in a realistic way and not sappy way. Bruce Willis does an excellent job as the main character and his performances him as the action hero he is today, along with his famous line \"Yippie Kay Yay, motherf***er\". The same can be said about Alan Rickman is gives off a performances as the one of the most charismatic antagonists ever put on screen. What really impresses me about this film is the action set pieces. The Nakatomi Plaza that serves as the film's main setting (at least during the beginning) is shot nowhere other than Twentieth Century Fox headquarters. Quite interesting!Die Hard is one of the most influential action films ever made and shines with nearly every aspect an action film needs. It is a good movie for viewers to pop a bag of popcorn, sit on the couch, and watch. Director John McTiernan did a fantastic job with this film as well as the cast. This film is a textbook example of what action films need to be and a movie that every action fan should not miss."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3056864",
      "warningSpoilers": false,
      "date": "27 July 2014",
      "rate": "10",
      "helpful": "161 out of 215 found this helpful.",
      "title": "The ultimate thrill-ride – and still the standard by which I judge an action movie",
      "content": "Seeing 'Die Hard' for the first time as a teenager was a one-of-a-kind experience. This level of raw, \"edge-of-your-seat\" action was unknown to me prior to this film; it made my head spin and the intensity of it was nearly unbearable. When it was over, I could only think of one word: Wow!For a long time - at least in western cinema - the only \"true\" action movies (by that I mean films that were all about the action and you went to see them because of the action) were the 'James Bond' movies. They had the most unreal stunts and crazy, over the top action sequences that you could imagine at the time, and they were (and still are) great fun. However, they usually lacked three vital ingredients:1. A sense of realism (meaning: the hero is only human and can get hurt)2. Grit (messy, unpolished action, dirty people and LOTS of swearing)3. R-rated violence (showing the audience what real weapons do to the human body)Well, it took John McTiernan to bring those three key elements together in 'Die Hard' - and thus the modern action film was born (it had a good run through the late eighties until the end of the nineties – then the studios figured out they could maximise the box-office by taming down the swearing, violence and sex and thus, alas, the contemporary, toothless PG-13 action film was born). Sure, there have been a couple of others before McTiernan's masterpiece ('First Blood', 'Terminator', 'Predator' - which was also by McTiernan - or 'Lethal Weapon' and probably some more), but those films could have fallen into any number of other categories as well ('Adventure-/Survival-/War-', 'Sci- Fi', 'Horror-' or 'Buddy-movie') – and I can't think of another film that was just such a relentless, pure-action-from-the-beginning-to-the-end film as was 'Die Hard'. To me, it's the ultimate thrill ride. The formula has since been repeated so many times, but the original still sets the standard by which I judge an action film. Should be seen every Christmas. 10 stars out of 10.Favorite Films: http://www.imdb.com/list/ls054200841/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "deepfrieddodo",
      "userUrl": "https://www.imdb.com/user/ur123203865",
      "reviewLink": "https://www.imdb.com/review/rw7619597",
      "warningSpoilers": false,
      "date": "5 December 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Iconic Action",
      "content": "The ultimate combination of action, crime and Christmas, Die Hard is timeless in its appeal. Willis is the perfect casting in his most iconic role of McClane, with Rickman the faultless foil, as the equally iconic Gruber.Not only is the action explosive and pulsating, but the wider cast of characters also get some form of arc, fleshing them out. Dialogue is great (even if the German may be a bit off), and the setting never tires despite being restricted within the single building.Big budget, all-out action and perfect one-liners, all in one festive present."
    },
    {
      "username": "MadReviewer",
      "userUrl": "https://www.imdb.com/user/ur1125206",
      "reviewLink": "https://www.imdb.com/review/rw0256240",
      "warningSpoilers": false,
      "date": "31 July 2001",
      "rate": "9",
      "helpful": "398 out of 528 found this helpful.",
      "title": "The Perfect Modern Action Film",
      "content": "\"Die Hard\" is the prototype type for the modern action film. Since it's also one of the best action films ever made, that happens to be a very good thing. \"Die Hard\" is lean, mean, and doesn't contain a single second of wasted screen time. The direction, the action, the story, the acting . . . every aspect of this film comes close to big-budget action movie perfection. Since \"Die Hard\" was first released in 1988, it's difficult to think of a blockbuster action film that doesn't follow the basic structure and format of \"Die Hard\" . . . or, for that matter, is better than \"Die Hard\". \"Die Hard\" is about John McClane (Bruce Willis, in one of his all-time best film performances), a basically good, honest New York cop with a penchant for annoying authority figures. Traveling to Los Angeles in a last ditch attempt to patch things up with his estranged wife Holly (Bonnie Bedelia), John McClane suddenly finds himself involved in a hostage situation. Terrorists, led by the enigmatic Hans Gruber (Alan Rickman), have taken over the office building in which Holly is working, and with Gruber holding the upper hand over the LAPD and FBI forces in Los Angeles, it's up to John McClane to save the day . . . .Kudos should be given to both director John McTiernan and screenwriters Jeb Stuart and Steven DeSouza -- the film is tight, electrifying, and clever, which is something few action films can ever claim. The story isn't completely believable, but it's believable enough, and it manages to move along at a quick enough pace to where the most glaring plotholes can easily be glossed over. There's also enough twists and wrinkles thrown into the story to keep the audience guessing as to what's going to happen next . . . and the surprises don't come out of left field, but are actually clever and well thought-out. (The fact that McClane often relies on his brains instead of his bullets to get out of his predicaments is also a big plus.) Simply put, \"Die Hard\" is one of the smartest and savviest action screenplays ever written. McTiernan holds up his end of the film admirably as well -- he uses the claustrophobic nature of the office building to great effect (particularly in any scene involving an elevator shaft), and he keeps the film rolling at a rollercoaster pace, building up the anticipation of the audience before unleashing the action. A lot of recent action films just fly along at a mindless, breakneck pace, without ever allowing the story to breathe or the suspense to build . . . unlike those films, \"Die Hard\" knows how to maximize the impact of each and every scene, and that's why it stands out so clearly from them all. With \"Die Hard\", John McTiernan puts on a perfect clinic as to how to pace an action movie.As for the acting, it's darn near close to perfect. Bruce Willis is awesome as John McClane. As played by Willis, McClane's a smartass with a distinct disdain for being given orders . . . but McClane's also clever, and knows how to keep cool under pressure. There's more to McClane than the stereotypical tough guy hero. Fortunately, the role was given to Bruce Willis, who infuses McClane with the perfect mix of cocky arrogance and stone-cold heroism. The fact that Willis plays McClane as a man often in disbelief of his own situation, and who struggles in his fight against bad guys instead of just killing bad guys with ease, like most stereotypical action heroes -- well, not only does it make the character much more believable, it's darn brilliant. (The fact that Willis also knows how to deliver a deadpan one-liner better than anybody else in Hollywood makes the character all the better.) There's only a handful of movies where both character and actor are a completely perfect match; Bruce Willis as John McClane is one such perfect match.Also worthy of mention is Alan Rickman's performance as the villain Hans Gruber. The Machiavellian Gruber would've been an easy villain to turn into little more than a scenery-chewing Bond villain . . . fortunately, Rickman doesn't travel the easy route. Gruber, as played by Rickman, is cold and calculating, and actually acts smart, instead of merely claiming to be smart and then being thoroughly outwitted by the hero. He always appears to have an ace hidden up his sleeve, and is so convincing at giving this impression, it's hard to tell throughout the film whether he or McClane truly have the upper hand. Other actors probably could've played Gruber fairly well, but Rickman makes Gruber one of the all-time great villains. As for the rest of the cast, they're all pretty good. Bonnie Bedelia does a nice job as John's soon-to-be-ex-wife Holly -- she plays her with enough smarts and feistiness to break the usual \"damsel in distress\" mold. It's also worth mentioning that Paul Gleason, who plays the obstinate police chief Robinson, pretty much sets up the modern action movie stereotype of the authority figure who refuses to heed the advice of the maverick hero. The character is stupid to a fault, and he's wonderful because of it.\"Die Hard\" is a terrific example of what happens when all the pieces of a film fall together perfectly. There simply are no weak spots or dull moments in the film. Is \"Die Hard\" one of the best overall movies ever made? Probably not. But it's undeniably one of the best action movies ever made, and it just might well be the perfect modern action film. Grade: A"
    },
    {
      "username": "peterp-450-298716",
      "userUrl": "https://www.imdb.com/user/ur35725947",
      "reviewLink": "https://www.imdb.com/review/rw3313662",
      "warningSpoilers": false,
      "date": "9 September 2015",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "THE best action flick ever !",
      "content": "\"Nine million terrorists in the world and I gotta kill one with feet smaller than my sister.\" Well, what else can I say besides that this is \"THE\" (can't stress it more) action movie from the 80's with a young Bruce Willis. Personally, I don't even know how many times I've seen this movie. \"Die Hard\" remains an example for all action movies that followed. At that time you had the Sly and Arnie action movies. But these were more a performance of brutal violence, with big muscles and a sense of invincibility. Bruce showed a clever, shrewd, caustic action hero, who can take a beating, but on the other hand shows that he's not completely invincible.Of course, the action in films nowadays is much bigger, more impressive and mind-blowing, but the strength of this film is the story, the accumulated tension, lightness and the dry humor of Bruce Willis. From the first minute he takes you in his grip, and he won't let loose. You see him slowly evolve from a wrinkle-free clean-shaved top cop into a reasonable damaged hero. This pattern keeps coming back in the next two parts, which are also top movies of the same caliber.You'll notice this is already an old movie because for instance lighting a cigarette in a public place isn't prohibited. But how the action scenes are imaged, is still top-work and should be the aim for many action flicks.I think the sudden confrontation between Gruber and McClane is one of the strongest scenes in this film, along with the well known \"Yippie-kay-yee\" cry. Trademark of Willis. The fact he likes the character of McClane a lot, you see clearly in \"The Last boyscout\". In that movie he plays an impoverished detective with the same coolness and cynical, dry humor as McClane. Too bad that in the last two Die Hard movies, McClane is only a shadow of himself like in the original movie.\"Die Hard\" is one of those rarities in movie land, which you can watch without thinking \"Pfft Again this movie\". It remains, for me, an enjoyment to watch.More reviews here : http://bit.ly/1KIdQMT"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1692203",
      "warningSpoilers": true,
      "date": "12 July 2007",
      "rate": "",
      "helpful": "27 out of 37 found this helpful.",
      "title": "Great action, well directed, tense and slick action thriller with enjoyable performances and intelligent social subtext (spoilers)",
      "content": "I first saw Die Hard in the late 1980's and have owned it on various formats down the years and will watch it now and again. One of the main reasons I enjoy it so is because of the iconic place it holds within the action genre. At the time it came out we were mostly served up pumped-up action heroes who happily take on entire armies and win in battles that are mostly a simple matter of good versus evil, where good is US and evil is them (whoever them happened to be at that time). Die Hard manages to be more than that by starting out with a \"normal\" guy as our hero. Now I won't pretend that McClane is not an action hero who does extraordinary things but he seems accessible. I particularly like the fact that his first reaction is to run, to call for help form others and that he only faces the terrorists when he has to, rather than going all Rambo on us.If this approach provides a grounding, the concept also brings the action into a slightly more real environment. The action is more or less confined to the tower and the bad guys limited rather than being a constantly flowing army of stuntmen. Director McTiernan uses the location really well, injecting tension and a sense of claustrophobia that works really well. The action is enjoyable and offers a lesson that modern CGI-heavy action movies can learn from  if you rely totally on technology then you'll date quickly, if you make the effects serve the action and narrative then you'll be standing for years. As a result the action in Die Hard feels no less slick or exciting for being almost twenty years old.Although this is the most important part of the film to get right, I always appreciated the clever subtexts in the narrative. Filmed in the 1980's, the film is a clever attack on yuppie values in contrast with the blue-collar \"man's man\" type. In this way the narrative can be viewed as those seeking more and more wealth getting in the way of those who just want to be with their families. The most obvious attack on the business culture is the aligning of the terrorists and the corporation. Hans and Takagi share taste in suits, education, knowledge and even share the same opening lines (\"ladies & gentlemen\"); it is not a stretch to see the film suggesting that Takagi may have also shared some of Hans' ruthlessness in his rise to the top. This is also evident from the very start  John does not lose his wife to Hans, he has already lost her to the corporation as she drops his name and had moved away. Indeed such is the films paralleling of these two threats to McClane, that he only rescues Holly from Hans by getting the watch off her wrist  the watch that was specifically mentioned at the start of the film as a gift from the company.Ellis sees the connection being made even more obvious as he himself suggests little difference between himself and Hans, apart from the gun and fountain pen aspect. Of course with both businessmen being connected to the terrorists in this way, they must also share their fate, and do. Although it has lumbered the film series with a rather poor catchphrase, the discussion of westerns again confirms the contrast between \"man's man\" and \"new man\"  a connection further made by having McClane in his vest, an outfit more befitting a blue collar worker who has his values in the USA frontier rather than the cut-throat world of foreign business. This distain for bureaucracy is also seen in the redemption of Al. Stuck outside the action in the building (handicapped by incompetence) but also desk-bound due to shooting a kid. At the end of the movie he is redeemed by killing Karl in a \"quick-draw\" style shoot out, freeing him from his desk and restoring his manhood. Again the split between bureaucracy and real workers and again the use of wild-west symbolism.The cast respond to the strong script and direction by turning in roundly good performances. Willis has not really been better (even in the same character) and his action twist on his Moonlighting character was the making of him. It is Rickman that dominates the film though; like in Robin Hood, he is a delightful sneering bad guy who has great lines and great presence. The support cast is good below them with Bedelia avoiding being just a damsel in distress; VelJohnson a solid \"buddy\"; Godunov is a real physical threat  even if a few of the other terrorists barely make an impression on the memory. Gleason, Atherton, White and Davi all give a good show as well.Rightly an iconic action movie then. The action has stood up really well and is delivered within a story that is tense and well paced. The performances suit the material and, if you want it, there is a clever and engaging subtext running across the whole film. I find it hard to fault and you can see why it has had the influence it has had on the action genre over the last twenty years."
    },
    {
      "username": "george.schmidt",
      "userUrl": "https://www.imdb.com/user/ur0937743",
      "reviewLink": "https://www.imdb.com/review/rw0256438",
      "warningSpoilers": false,
      "date": "6 March 2003",
      "rate": "",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Ladies and gentleman, Mr.Bruce Willis, Movie Star",
      "content": "DIE HARD (1988) **** Bruce Willis, Alan Rickman, Bonnie Bedelia, Alexander Godunov, Reginald Vel Johnson, William Atherton, Paul Gleason, Hart Bochner, Robert Davi. NYC cop John McClane (Willis in his star-making iconic role) is visiting LA at Christmas to reconnect with his estranged wife Bedelia who is at an office party that becomes a nightmare when a group of terrorists take over the building led by Hans Gruber (perfect Rickman) a German nutjob out to filch millions in bonds in the vault of the Japanese company. As the \" fly in the ointment\", Willis does his damnedest to stop him at all costs relying on his street-smarts and out-guessing as time ticks away. Great blend of action suspense and much welcomed humor. Best bit: Willis plunging from a rooftop attack by the FBI (thinking the disheveled cop is one of the bad guys!) attached to a fire hose and shooting his way into an empty office! Hair-raising and exhilirating fun for all. \"Yippiee-Kay-Ay !!!!\" (Dir: John McTiernan)"
    },
    {
      "username": "BrnzReviews",
      "userUrl": "https://www.imdb.com/user/ur102393358",
      "reviewLink": "https://www.imdb.com/review/rw6858718",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Die Hard - WOW",
      "content": "This movie is the ultimate Christmas movie, despite the opinions that it isn't I believe it is to this day, I always watch at Christmas time.Watching this every time always brings back memories of watching it back in the day. Bruce Willis is phenomenal, I love everything this guy makes. Great story that keeps you on the edge wondering what happens next.Highly recommend!"
    },
    {
      "username": "theshadow908",
      "userUrl": "https://www.imdb.com/user/ur1899620",
      "reviewLink": "https://www.imdb.com/review/rw1682978",
      "warningSpoilers": false,
      "date": "28 June 2007",
      "rate": "8",
      "helpful": "21 out of 26 found this helpful.",
      "title": "The ultimate action film.",
      "content": "Die Hard tells the story of a New York City detective named John McClane who is separated from his wife. She invites him to a Christmas party at her office building in Los Angeles, and he decides to go to work things out. Once there, a group of German terrorists come in and take hostages with the intent of stealing millions of dollars in bonds. McClane manages to escape and begins to fight the terrorists one by one to save the people in the building.Die Hard is a classic film because it completely revolutionized action films. The 80s were a time of unrealistic action sequences, predictable characters, and rudimentary plots. Die Hard changed all that. Die Hard takes place in a real world setting, or at least about as real as you can get with an action movie, so the action sequences, while insane, are slightly believable. The plot of the movie is simple, yet it's so brilliant at the same time. And the characters in this movie are engaging and a lot of fun to watch. John McClane is a really likable everyman kind of guy, we can all relate to him. Hans Gruber is an awesome villain, both cold and ruthless, yet very human. The supporting characters on the outside of the building are all great as well. Another great thing about Die Hard is that even though it's a hardcore action movie, it manages to be extremely funny at some parts, almost to a point of being able to call it a comedy. This makes the movie really easy to watch over and over again. There's really nothing wrong with this movie whatsoever in any department.The acting is great. Bruce Willis is hilarious and hardcore as John McClane, and he portrays the adrenaline and the frustration of the situation very well. Alan Rickman is awesome in one of his earlier roles as the main villain Hans Gruber. Reginald VelJohnson is enjoyable as McClane's outside contact Officer Al Powell, and Paul Gleason is funny as a hardheaded and incompetent deputy chief of police.Overall, Die Hard is the ultimate action film because it's fast, funny, and hardcore. It also gave us one of the most famous action movie one liners of all time...You know the one.8/10"
    },
    {
      "username": "lostonthehighway",
      "userUrl": "https://www.imdb.com/user/ur125176601",
      "reviewLink": "https://www.imdb.com/review/rw6351814",
      "warningSpoilers": false,
      "date": "9 December 2020",
      "rate": "8",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Actually a good Christmas movie.",
      "content": "I've got to admit, I only really watched this movie because of the (many, many) references in Brooklyn 99. And I got thinking, is Die Hard really that good? So, I gave it a watch, guided by the many, many Jake Peralta jokes that I had grown accustomed to. And I've got to say, this is the action movie that paved the way for all future action movies.I usually have an aversion to Christmas movies as they all tend to turn into cheesy rom-coms but this was pretty awesome. And I think the reason for that is because that even though it was Christmassy where it mattered, the plot didn't completely revolve around it.I've got to admit, most of it was guns and explosions and there was very little plot to go off of besides a pretty traditional three-act structure, but it was still pretty damn entertaining. And you know it's a good movie when about 90% of it was guns and blood and explosions and the other 10% was Bruce Willis saying badass things and crawling through vents in an ever-disintegrating tank top, and you stilled enjoyed it.There was never a still moment in this movie, but unlike most times, where I just end up getting bored of the CGI-fest explosions, I was actually pretty captivated through the entire runtime. I'm actually really pleasantly surprised. The ending is predictable, but it's nice. Not all movies have to be intellectual masterpieces. Sometimes you just need to switch your brain of a little and watch Bruce Willis kick ass.So, Jake of B99 was right. I mean, it's badass, Bruce Willis has the best one-liners, you have cool explosions. There's not too much more I could say about this movie. Yippie kayak, other buckets.-Sasha."
    },
    {
      "username": "TedStixonAKAMaximumMadness",
      "userUrl": "https://www.imdb.com/user/ur4669024",
      "reviewLink": "https://www.imdb.com/review/rw3614261",
      "warningSpoilers": false,
      "date": "6 January 2017",
      "rate": "10",
      "helpful": "17 out of 22 found this helpful.",
      "title": "\"Die Hard\"- Quite simply the greatest action-adventure film ever made.",
      "content": "It's almost unfathomable that in just one year's time, the original entry in the \"Die Hard\" saga will be thirty years old. And yet, even then, it will still remain in its position as indisputably the greatest action-adventure ever committed to the screen. In every way remarkable, entertaining and breathlessly exhilarating, it is the quintessential gold-standard when it comes to action. A masterpiece of filmmaking, \"Die Hard\" took the world by storm in 1988 and even with inconsistent quality in sequels, it still enthralls and entertains thanks to sharp writing, perfect casting, exquisite performances and top-notch direction. It's hard to imagine that anything will ever top it.Bruce Willis stars as Detective John McClane, a New York cop who flies out to Los Angeles to spend Christmas with his estranged wife Holly (Bonnie Bedelia) and children. Arriving at a massive Christmas Party at Holly's workplace in Nakatomi Plaza, things start to seem like they might be looking up for John... until a group of terrorists, lead by the vile Hans Gruber (Alan Rickman) seize control of the building, hoping to get their hands on over half a billion dollars in bearer bonds that are locked away in the vault. Escaping the threat and discovering that the police will be completely unable to help, John realizes he must work alone, eluding capture and taking out terrorists one by one if he is to save the day...Directed by John McTiernan from a script by Jeb Stuart and Steve E. de Souza, the film as just exquisitely assembled. McTiernan's keen eye for visuals and perfect sense of pacing and composition allow the tension and excitement to build with virtually every second as the story progresses and the stakes rise. But he also knows when to pull back and give the characters breathing room to develop and just talk with one another, without rushing through it or over-relying on broad archetypes as many more modern filmmakers do. Absolutely amazing direction. The screenplay (inspired loosely by the Roderick Thorp novel \"Nothing Lasts Forever\") is exceptionally well put- together. de Souza and Stuart craft an instantly identifiable and highly likable cast of characters- including villains you very much love to hate- that all get their proper moment to shine and all feel well-defined and developed. The structure of the film is also very sound, and they strike a perfect balance between story and action in a way few other films have.We are treated to one of the finest casts to ever populate a tale of adventure in the film. Much has already been said about Bruce Willis and his iconic turn in the role of McClane, but it is still not enough. Bruce Willis just might be the ideal action hero. He's tough, but not unstoppable. Smart, but not a genius. And sharp- witted, but with a certain sense of vulnerability. In many ways, he's the sort-of person anyone and everyone can identify with, and that's what makes McClane such an incredible hero. Alan Rickman- in his first starring role- absolutely steals the show as the villainous Hans, a presence who will charm you, even while you root for him to go down. Rickman is a talent that was taken too soon after his tragic passing last year, and it's roles like this that prove just how great a loss it was. Supporting roles by the likes of Bedelia and William Atherton are exceptional for the material. And Reginald VelJohnson is just magical as Sgt. Al Powell, a cop who offers support to McClane over the radio throughout the film's runtime.Beyond the cast, the direction and the writing is just simply a phenomenal overall production. Cinematographer Jan de Bont, who would later go on to become a director in his own right, paints a beautiful cinematic image, with outstanding work done, particularly in the lighting and color. Composer Michael Kamen's score is just a blast of pure fun. With a sort-of old-fashioned scope yet a modern flair, the music constantly and consistently compliments the images on-screen perfectly, and it's such a relief that his themes were used in each subsequent film. And editors Frank J. Urioste and John F. Link expertly manipulate the footage so that every shot... every emotion... everything is in service to the story and characters. Now THIS is how you film and cut an action film!In the end, \"Die Hard\" may soon be turning thirty years old, but it remains as exciting, engaging and enthralling as ever. Upon initial release, it became the perfect example of an adventure done right, and blew audiences away. And it continues to do that now. I honestly have my doubts that anything will ever be able to beat it in terms of quality in storytelling and execution of action. It simple is the best action movie ever made. And for that, it easily earns a perfect 10 out of 10."
    },
    {
      "username": "mgsmoviesniper",
      "userUrl": "https://www.imdb.com/user/ur4387811",
      "reviewLink": "https://www.imdb.com/review/rw1458037",
      "warningSpoilers": false,
      "date": "25 August 2006",
      "rate": "",
      "helpful": "24 out of 29 found this helpful.",
      "title": "A perfect action film",
      "content": "Bruce Willis is stirring up trouble for the bad guys in \"Die Hard.\" In the first of three awesome films, he stars as Lt. John McClane, a New York police officer, who has been invited to the wrong Christmas party.This is an action film for future actors and directors to watch and use as a model because it is what an action film should be. I have seen many action films in my life, but this ranks at the top as it has all the right components. Action packed sequences, explosions, special effects and most of all superb performances with excellent dialogue.\"Die Hard\" is a movie I will not soon forget because the story is so well crafted. Though there are no twists or curves thrown at the audience, the audience can be assured they will be treated to two hours of non-stop action from beginning to end.\"Die Hard\" did not only produce great action and explosions but future stars as well. I am talking about Clarence Gilyard Jr. who starred in Walker, Texas Ranger and Reginald VelJohnson who starred in the series \"Family Matters.\" These two actors were pivotal to this film in their respective roles.Two other names to keep in mind while thinking of key performers are Bonnie Bedelia and Alan Rickman. I was blown away when I saw the impact they had on this film. It is as if they came in and said 'Okay boys, watch out I'm taking over.\" They certainly did that; however, nobody could have done better than the impact performer himself Bruce Willis.On a scale of 1-10; \"Die Hard\" is given a 100 by yours truly. My only regret would be that the movie ended. I wish there was more to see in this film. I CAN'T WAIT TO SEE \"DIE HARD\" AGAIN."
    },
    {
      "username": "MAYESY-44",
      "userUrl": "https://www.imdb.com/user/ur118961119",
      "reviewLink": "https://www.imdb.com/review/rw5775460",
      "warningSpoilers": false,
      "date": "27 May 2020",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "More than a Christmas movie",
      "content": "What more is there to say than Die hard is brilliant and so is Bruce Willis. Could watch them over and over again."
    },
    {
      "username": "buzznzipp1995",
      "userUrl": "https://www.imdb.com/user/ur7529200",
      "reviewLink": "https://www.imdb.com/review/rw1418457",
      "warningSpoilers": false,
      "date": "12 July 2006",
      "rate": "10",
      "helpful": "32 out of 44 found this helpful.",
      "title": "Went to the theater 'thinking' \"This might be stupid.\"",
      "content": "I was not a Bruce Willis fan per say. As a matter of fact, I thought what is this guy from Moonlighting gonna do? Is he gonna make them laugh to death with stupid comments and jokes? I was not a fan of \"Moonlighting\" then either, that would come later. In addition I was not thinking, 'John McClain' \"Hans Gruber' or 'John McTiernan' that was my first error.As I took in the very first minute of the film, I knew, this was going to be radically different than I had imagined. This movie and John McTiernan's directing (Also 'Preditor'-1987 'The Thomas Crown Affair'-1999) (The Hunt for red October) (Medicine Man)The way I felt from his genius directing style, that gets you fully involved, stomach wrapped in knots, pulse pounding. He brings out the whole story, not just a 'clot' of mindless action and or violence. He actually led up to the stories climax and didn't blow it when he got there. I was shocked at this movie, which gets 'compared to' all the time with other action and drama movies! Still, after two decades. Needless to say, it changed the way I felt about movies and film making. From Willis's flawless performance to master terrorist Hans Gruber, (Rickman) what a truly superb 'Villain' & (James Shigeta, Holly's Boss) the emotion and heart-thumping fear that lead up to the demise of James's character. The scenery of the towering building and the city itself after dark, under the threat of terrorist activity. Don't forget L.A. P.D.-in charge 'DeWayne T. Robinson', (Paul Gleason - God rest his soul -Died May 26, 2006)I truly looked at film with a whole different view point. I got a copy of the original script, well the 18th re-write or something like that and went, line by line, through the story. It was unbelievable how this movie changed my mind on Movies...as well as Bruce Willis. I just can't say enough about Die-hard, but I will come to a soft close...but before I do, here is a 'spanner' of a thought, originally Willis was not first choice, it was Stallone that they wanted and he turned it down, think on that one! This would not be what it is this way, it would be wholly different with 'Sly' at the helm. I will even venture further out, do you know who this was originally written for? -Answer: Burt Reynolds. No kidding.This is on my all-time list of the best of the best films, bar-none."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0256411",
      "warningSpoilers": true,
      "date": "21 October 2002",
      "rate": "",
      "helpful": "20 out of 30 found this helpful.",
      "title": "Unstoppable",
      "content": "Spoilers herein.Here's a conundrum: the vacation action thrillers that star unkillable heros themselves die a quick death. Even a short time later they are limp. Seen \"Speed\" lately? Each is a matter of repetition with the heat turned up a very little, so the next guy always makes it obsolete.But not this one. I've stopped by every few years, and it never seems dated. (Well, maybe the pseudo-terrorist plot.) But its just in a whole different category than any Arnie movie. They fade fast. I think it is a matter of originality, pacing and the stance that Willis invented. The pacing really is a black art, and to judge from McTeirnan's subsequent missteps, was an accident. But I have to give Bruce Willis a lot of credit. We live in an era when we expect nothing to be done straight. Some ironic coloring is expected, some compact between the film and the audience that gives us traction on which to build fun. Sly, Arnie, Chuck and those others take it all so seriously. Bruce, and later Mel (with less intelligence) would first establish their character with the audience as their man, their representative in the action.Then, once in a while, he'd all but look at the camera and say \"ain't this a gas, watch this!\"I don't pretend that Bruce is a fine actor, but he certainly reinvented film. And in his own way as much as Brando. This is his \"streetcar.\"It is important in the history of film, and in how we as a society deal with abstraction. And it is still fun, with the \"cancel Christmas\" guy.Ted's evaluation: 3 of 4 -- worth watching"
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw3118992",
      "warningSpoilers": true,
      "date": "7 November 2014",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Tower Heist",
      "content": "When it comes to action-adventure films of the 1980s. You have Raiders of the Lost Ark standing as a colossus. The ultimate homage to the 1930 'B' serials. Hot on its heels is Die Hard the ultimate action- thriller.Bruce Willis was known for the comedy crime-drama Moonlighting and comedy movies such as Blind Date. He was not someone with bulging muscles like Sylvester Stallone or a former martial arts star or bodybuilder.John McClane the everyman who happens to be a New York cop visiting his estranged wife at her firm's Christmas party, rather partial to Roy Rogers ends up being in the wrong place at the wrong time.Just as the party gets into full swing a bunch of European terrorists take over the office tower block to rob some financial bonds, led by the magnetic and then unknown Alan Rickman (who in those pre Google days, some critics mistook to be some undiscovered German actor readymade to be a Bond villain!)However as the villains hold the rest of the group hostage waiting for their plan to unfurl including getting an assist from the FBI, there is a fly on the ointment. McClane is on the loose and picking off the bad guys one by one.You have a beat cop in contact with McClane, some inept cops, even more inept and gung ho FBI agents, a slimy journalist and a film director on top form giving you one of the best action films of all time.A mixture of thrills, action and humour. Just look at scene when Uli (the far eastern bad guy) glances at the chocolate bar during a tense moment and steals it, or Rickman naming some freedom fighter groups which seem to be made up. He states to his fellow henchmen that he read about them in Time Magazine.Ultimately Willis pitches his character just right. Here is an actor hungry for that breakout role and he sure hit bullseye here even though some of his subsequent actions films have been disappointing. To think Frank Sinatra was initially under contract to play McClane!At the other end is Rickman playing the suave, sophisticated and ruthless villain. He brings charisma by the truck load and this was also his launchpad to stardom."
    }
  ],
  "errorMessage": ""
}