{
  "imDbId": "tt0088763",
  "title": "Back to the Future",
  "fullTitle": "Back to the Future (1985)",
  "type": "Movie",
  "year": "1985",
  "items": [
    {
      "publisher": "Boston Globe",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The best mainstream film since \"E.T.,\" is an uplifting reminder that Hollywood can still produce truly great entertainment...The plot is so exquisitely developed that divulging anything beyond the basic outline might diminish the joyous surprises that await an audience thirsting for originality in a reactionary medium. [03 July 1985, p.57]"
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "100",
      "content": "So what we have in the middle of Back to the Future, this seeming kids' movie full of screeching cars, special effects and lightning storms, is nothing less than an adult reverie. And if families could be persuaded to see this film together, it might touch off a long night of sharing between parents and children. [03 July 1985]"
    },
    {
      "publisher": "Orlando Sentinel",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "This brilliant contraption of a film could become the hit of the summer. It's a cinematic Rube Goldberg machine whose parts connect in audacious, witty ways. [04 July 1985, p.E.1]"
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "91",
      "content": "Back to the Future doesn't exactly leap out of the starting gate, and some scenes are strung out by gimmicky editing. But the story picks up steam as it goes along, and the last third is especially full of speedy surprises. [3 July 1985, p.23]"
    },
    {
      "publisher": "The New York Times",
      "author": "Janet Maslin",
      "link": "https://www.nytimes.com/1985/07/03/movies/in-future-boy-returns-to-the-past.html",
      "rate": "90",
      "content": "Mr. Zemeckis is able both to keep the story moving and to keep it from going too far. He handles Back to the Future with the kind of inventiveness that indicates he will be spinning funny, whimsical tall tales for a long time to come."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1984/film/reviews/back-to-the-future-3-1200426642/",
      "rate": "90",
      "content": "Performances by the earnest Fox, the lunatic Lloyd, the deceptively passionate Lea Thompson, and, particularly, the bumbling-to-confident Glover, who runs away with the picture, merrily keep the ship sailing."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "88",
      "content": "The movie, in fact, resembles Capra's \"It's a Wonderful Life\" more than other, conventional time-travel movies."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "",
      "link": "",
      "rate": "75",
      "content": "I just don't know how all this sweetness and light will go down with a teenaged movie audience presumably gung-ho with Rambo - especially now that he's got the presidential seal of approval. And that's no joke, son! [3 July 1985, p.58]"
    },
    {
      "publisher": "Miami Herald",
      "author": "",
      "link": "",
      "rate": "63",
      "content": "For girls and boys who like games, ideas and toys, Back to the Future probably is worth an afternoon's good giggle. But baby boomers be forewarned: You had a better guffaw at Son of Flubber! [3 July 1985, p.D9]"
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Sheila Benson",
      "link": "",
      "rate": "40",
      "content": "It's big, cartoonish and empty, with an interesting premise that is underdeveloped and overproduced. [3 July 1985, p.Calendar 6]"
    }
  ],
  "errorMessage": ""
}