{
  "imDbId": "tt0050825",
  "title": "Paths of Glory",
  "fullTitle": "Paths of Glory (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1408915",
      "warningSpoilers": true,
      "date": "2 July 2006",
      "rate": "10",
      "helpful": "194 out of 225 found this helpful.",
      "title": "They Couldn't Take An Ant Hill",
      "content": "Almost one hundred years later the concept of that static war of the trenches that was the Western front of World War I is almost unfathomable. After the French army stopped the German offensive at the Battle of the Marne, the French and British armies faced the Germans in a line of trenches that stretched from Belgium to Switzerland. About a quarter of France was occupied for four years in that time. The casualties ran into the millions in that stalemate that gains were only measured in meters.It was always just one more offensive over the top charging into automatic weapon fire that would break the other guy. Just such an offensive was planned one day in 1916 against a German stronghold dubbed the ant hill.General George MacReady, promised a promotion by his superior Adolphe Menjou, orders a beaten and tired battalion to charge the ant hill. The attack flops and MacReady looks for scapegoats. He decides after coming down from shooting 100 men to a selected three drawn by lot. The unlucky three are Joseph Turkel, Ralph Meeker, and Timothy Carey.The commander of the three Kirk Douglas asks to serve as their counsel and he makes a good show of it at the kangaroo court martial they have. But the fix is definitely in.Except for Spartacus, Kirk Douglas rarely plays straight up heroic types in film. Even his good guys have an edge to them, a dark side. But as Colonel Dax, Douglas is at his most heroic. He may be one dimensional here, but he's great. Especially in that last scene with Adolphe Menjou when he tells the man off in no uncertain terms, mainly because Menjou has misread Douglas's motives.Menjou and Macready portray two different military types. The arrogant MacReady as versus the very sly Menjou. Not very admirable either of them. Menjou was not very popular at this time in Hollywood because of the blacklist. He favored it very much, his politics were of the extreme right wing. Nevertheless he was a brilliant actor and never better than in this film, one of his last.The enlisted men are a good bunch also. They're kind of like the posse in The Oxbow Incident, just an ordinary group who become ennobled in martyrdom as they go to the firing squad for the sake of politics.Paths of Glory is one of the best anti-war films ever made. It ranks right up there with All Quiet on the Western Front which showed the war from the German point of view. Both will be classics 200, 300, a thousand years from now."
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw1497639",
      "warningSpoilers": false,
      "date": "15 October 2006",
      "rate": "9",
      "helpful": "125 out of 136 found this helpful.",
      "title": "\"Let the men have a few minutes more\"",
      "content": "Although Kubrick's films are marked by their massive variation of genre and tone, one theme that crops up again and again is a strong anti-war sentiment, and this was never stated more strongly than in Paths of Glory. A relatively early Kubrick picture and, despite coming before what is considered his classic period, it is one of his best.In contrast to his previous picture, The Killing, a definite Kubrick style is beginning to emerge now. One notable example is the scene in which General Mireau tours the trenches, walking towards the audience with the camera retreating away from him. This technique would be repeated years later in Kubrick's other war film, Full Metal Jacket. There is also something about the arrangement of objects in the frame, as well the tracking and dollying which hints towards his more familiar later style. His recurring chess motif appears as well, albeit subtly. At the court martial the floor is chequered, and the soldiers on trial are seated with guards standing behind them as if they are pawns about to be sacrificed.The light and contrast in this picture is put to good effect. The palatial officers' headquarters is light and airy with few shadows. The trenches are gloomy and cramped. Kubrick was becoming a real master at contrasting locations and getting the look of a place just right.The use of music in Paths of Glory is bold and brilliant. The pre-recorded score is almost entirely percussive  all rhythmic sounds with no melody. A weird kettle drum track is used to help build tension in the night patrol scene, while in the climactic scene the funeral march drumming instills a sense of dread, further heightened by having the shots edited in time to the beat. In the emotional final scene we get the complete opposite  a beautiful vocal melody. This has all the more impact after hearing nothing but militaristic drums for the rest of the film.The casting is absolutely flawless. While there are no big names apart from leading man Kirk Douglas and the now elderly Adolphe Menjou, there isn't a single weak performance. The despair and resentment of the condemned soldiers feels so absolutely real. In contrast the smugness and fake sympathy of the upper class officers is brilliantly portrayed.Throughout his career Kubrick never seemed to be particularly keen on blatantly emotional moments. Paths of Glory is the exception. The later scenes are incredibly poignant and moving, and the final moments in the soldier's bar are what makes it a masterpiece more than anything else  the icing on the cake. However it's quite probable that Kubrick regretted this as an overly sentimental approach, as woolly sentimentalism was a major gripe of his when he worked on Spartacus. Whatever the case, he certainly reined in the stirring stuff considerably after this, to the point where his later films became characterised by their understatement of emotions."
    },
    {
      "username": "Hermit C-2",
      "userUrl": "https://www.imdb.com/user/ur0249396",
      "reviewLink": "https://www.imdb.com/review/rw0062202",
      "warningSpoilers": true,
      "date": "7 July 1999",
      "rate": "10",
      "helpful": "235 out of 255 found this helpful.",
      "title": "Kubrick--a fully-formed genius in 1957.",
      "content": "At only 29 years of age and in only his second major studio release, Stanley Kubrick showed the world that he was a force to be reckoned with. By the time he died 42 years later his films were epochal events waited for breathlessly by his large band of devotees who considered him a director without equal. He seldom disappointed them.This movie is set in World War I amidst the incredibly destructive and futile trench warfare between France and Germany. Kirk Douglas plays Frenchman Colonel Dax, who is ordered to make an impossible assault on a heavily-fortified enemy position. The only reason this charge is being made is that his commanding general, played by George Macready, believes that capturing the position will earn him a promotion. When the assault does not go forward under heavy enemy bombardment, the general is infuriated and demands that three men be arbitrarily chosen to stand trial for cowardice, an offense punishable by death. Col. Dax defends these men at their court-martial.The battle and trial scenes are about as good as have ever been filmed and the high level of tension is sustained throughout the movie. After the film's climax has occurred, Col. Dax goes looking for his troops and finds them relaxing at a cafe. What he and the viewer witness there is possibly the most affecting scene I've ever seen on screen.Looking at this film in perspective, it's easy to see Kubrick's trademarks even at this early stage of his career. The attention to the composition of his shots reflects his background as a still photographer and foreshadows his other great films to come. I find myself most impressed today with the way he could handle a dramatic story like this one without any innovative techniques or unusual special effects to hide behind, then turn around and make such totally different films like '2001...' and 'Dr. Strangelove...' Other films like 'The Shining' and 'Barry Lyndon' combined a strong story line with breakthrough film techniques. His versatility astonishes me.Adolphe Menjou also stars as the general who convinces Dax's superior officer to risk the ill-fated charge. Ralph Meeker, Timothy Carey and Joe Turkel give strong performances as the men on trial. Turkel turns up 23 years later in another Kubrick film, 'The Shining,' playing the bartender.You can take your pick: 'Paths of Glory' can rightly be described as one of the greatest war movies of all, or one of the great anti-war films, or as one of Kubrick's best. Or simply one of the best, period."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2171186",
      "warningSpoilers": false,
      "date": "9 December 2009",
      "rate": "10",
      "helpful": "38 out of 44 found this helpful.",
      "title": "Kubrick at the height of his powers- a wonderfully atmospheric film about the First World War",
      "content": "I saw this movie for the first time on television today, after being persuaded by the reviews I read beforehand praising it. Also I like Kirk Douglas. Although I am not directly familiar with Kubrick's work, a shameful admission I know. Out of what I have seen so far I loved Dr Strangelove and despite only seeing it once while flicking through channels liked The Shining too. Anyway back on target, Paths of Glory was brilliant in my opinion! Winston Churchill famously claimed that it was this movie that was closest to evoking the atmosphere of WW1 and the military mind. And you know what, he is right. For one thing, Paths of Glory is gorgeously filmed, with relentlessly beautiful cinematography and nice costumes and scenery. The screenplay is sometimes humorous, sometimes moving and sometimes even haunting, either way it was some fine writing. The efficiency of Kubrick's direction is proof of a great man at work.The performances were superb. As the general who orders the hopeless attack on the German position, Adolphe Menjou's character is perceived as a villain not because of being an officer adhering to the letter, but that he is seen as \"the arrogant aristocrat\" because of his fear of the working classes than his hatred of the enemy. Among the cast, Timothy Carey and Kirk Douglas especially were outstanding. And the music? That is one rousing score I can tell you. Great movie. 10/10 Bethany Cox"
    },
    {
      "username": "WriterDave",
      "userUrl": "https://www.imdb.com/user/ur1069062",
      "reviewLink": "https://www.imdb.com/review/rw1702167",
      "warningSpoilers": false,
      "date": "28 July 2007",
      "rate": "9",
      "helpful": "125 out of 139 found this helpful.",
      "title": "Stands the Test of Time",
      "content": "An arrogant French general (a superb George Macready) orders his men on a suicide mission and then has the gall to try to court marshal and execute three of them for cowardice in the face of the enemy. A former lawyer turned colonel (Kirk Douglas in his prime) is the voice of reason against gross injustice. This excellently staged and wonderfully acted production is as much an acting showcase for Douglas as it is a directorial masterstroke by a young Stanley Kubrick who adapted this to the screen from a novel based on actual accounts.Kubrick displays a great control of sound effects and camera movement in the brief but effective battle scenes that expertly depict the controlled chaos that was trench warfare during WWI. Things get juicier during the ensuing courtroom battle where the deafening disparity between the elite who propagate and profit from war and the common citizens who suffer and die in war is shown with great lucidity.Unlike later Kubrick epics, this runs at a crisp 90 minutes, though suffers briefly from a slow and awkwardly staged opening ten minutes before Douglas comes on screen. Ultimately, this holds up very well to modern scrutiny thanks to the flawlessness of Kurbick's craft, the amazing ensemble acting, and the surprising depth of its philosophical and psychological pondering. \"Paths of Glory\" is more anti-arrogance than anti-war, and is unapologetically sentimental and pro-soldier. As such, much can still be gleaned from its message."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw0062333",
      "warningSpoilers": false,
      "date": "11 May 2004",
      "rate": "10",
      "helpful": "114 out of 144 found this helpful.",
      "title": "An Anti-War Masterpiece",
      "content": "In France, in the First World War, the insane and ambitious general Gen. Paul Mireau (George Macready) orders Colonel Dax (Kirk Douglas) to lead his men in a suicide attack against Germans in the unattainable Ant Hill. After a massacre of the French soldiers, Gen. Mireau orders his artillery to drop bombs between the French front line of attack and the trenches, to avoid the soldier to return to the protection of the trenches. The commander of the French artillery refuses to accomplish the order. Gen. Mireau asks his superior, Gen. George Broulard (Adolphe Menjou), to send three men to Court Martial and execute them for cowardice through shooting, as an example to the other soldiers. Colonel Dax, a former lawyer, defends his men in the unfair trial. Yesterday I watched this outstanding masterpiece for the first time and certainly it is among the best movies of the cinema history. The disgusting story shows the insanity of a war, where men are treated like numbers and not as human beings. The reality of the battles scenes is amazing. The cast has a stunning performance, highlighting the trio George Macready, Adolphe Menjou and Kirk Douglas. The lack of sensibility and respect for the human life and the cynicism in the dialogs of the two generals are fantastic. Two other points that called my attention are the fancy reception for the general staff, while their subalterns are fighting in the front and the misunderstanding of the real intentions of Colonel Dax by Gen. George Broulard. A must-see movie! My vote is ten.Title (Brazil): `Glória Feita de Sangue' (`Glory Made of Blood')"
    },
    {
      "username": "gbheron",
      "userUrl": "https://www.imdb.com/user/ur0079652",
      "reviewLink": "https://www.imdb.com/review/rw0062219",
      "warningSpoilers": false,
      "date": "19 January 2000",
      "rate": "10",
      "helpful": "100 out of 122 found this helpful.",
      "title": "Gripping Anti-War Film",
      "content": "Paths of Glory is one of the best movies ever made, and possibly the best \"war\" movie, period. Paths of Glory does not portray war as conflict between armies or individual soldiers arrayed against one another on the battlefield. Nor does it portray the acts of great leaders and heroes of war. No this film takes a different tact. The setting is the Western Front of 1916 in the trenches with French soldiers faced off against an invisible German force across a barren No Man's Land. The German's are never seen and the dramatic \"combat\" is between vain French officers as they vie for prestige and honors. The victims are the innocent French soldiers under their command who suffer miserably because of their arrogance and ignorance.Brilliant, gripping, and definitely a \"must see\"."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2295758",
      "warningSpoilers": false,
      "date": "15 August 2010",
      "rate": "8",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Awesome movie stands as a broody statement against war and man's inhumanity to man",
      "content": "Sensational antiwar treatise based on facts with a relentless and vivid denounce against the military commanding class represented by two senior Generals (George Macready , Adolphe Menjou ) who order his men a suicidal mission . France 1916 , an upright officer , Colonel Dax (Kirk Douglas), must lead his soldiers against difficult enemy positions called the 'Ants Hill' . Then he's also the Colonel lawyer assigned to defend three (the privates Timothy Carey , Ralph Meeker , Joe Turkel) of them when the attack is lost against charges of cowardice and submitted to eventual firing squad. Never has the screen thrust so deeply into the guts of war! The most explosive motion picture in 25 years ! Bombshell! The roll of the drums... the click of the rifle-bolts... the last cigarette... and then... the shattering impact of this story... perhaps the most explosive motion picture in 25 years! It explodes in the no-man's land no picture ever dared cross before! Now the screen blasts open the bombshell story of a Colonel who led his regiment into hell and back - while their maddened General waited for them - with a firing squad!This is a thought-provoking and intelligent war drama perfectly acted by strong cast and masterfully directed. Interesting screenplay based on a Humphrey's Cobb's novel has been well adapted by Stanley Kubrick and Jim Thompson . It depicts a brooding study about futility and insanity of war , making a shattering accusation against the military ruling staff who cares on promotions more than the soldiers . Kirk Douglas is very good as compassionate French Colonel who commands his troops in some spectacular scenes on the trenches . Stunning support cast beautifully performed by notorious secondaries , such as : Emily Meyer as the priest , Wayne Morris as the lieutenant , Richard Anderson as the Major prosecutor , Ralph Meeker , Timothy Carey , Joe Turkel and Suzanne Christian , Kubrick's wife . Special mention for the two selfish and ruthless Generals exceptionally performed by George Macready and Adolph Menjou . Excellent cinematography in black and white by cameramn George Krause , filmed on location in Schleissheim Palace, Munich, and Bavaria Film studios, Geiselgasteig, Grünwald, Bavaria, Germany (studio). The motion picture was wonderfully realized by the maestro Stanley Kubrick and lavishly produced by James B. Harris , his usual producer at the time . This magnificent film along with ¨ All quiet on the Western front ¨ , ¨Westfront 1918 ¨, ¨ Captain Conan ¨ and ¨King and country¨ result to be the best ones about the powerful antiwar theme . Time hasn't dimmed its power , or its poignancy and remains untouchable the critique to the military hypocrisy in an ultra-lucid exposition . Rating : 8.8/10. Phenomenal and marvellous film , above average . Essential and indispensable watching ."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1521688",
      "warningSpoilers": true,
      "date": "15 November 2006",
      "rate": "10",
      "helpful": "29 out of 37 found this helpful.",
      "title": "A marvelous film about the STUPIDIST war in history with a dynamic performance by Douglas",
      "content": "This is a wonderful film and for those who are looking to see a Stanley Kubrick film that the average person can relate to, this is a great initiation to the director's work. Some of his films are a bit hard to understand or frankly make my head hurt (2001 is a great example), but this one is much more straight-forward and conventional than most of his other films while still being a great film.The movie is based on a real incident in WWI. When a squad of French soldiers were ordered \"over the top\" (i.e., to crawl out of the trenches and charge across the battlefield while being shot down like dogs--the standard way of fighting on the Western Front), the men were so sick of the pointless fighting that they refused. As a result, the officers (who are shown sitting many miles behind the lines sipping sherry and living a life of opulence) order that some soldiers randomly be taken out of the group to be executed as an example to the others! The complete unfairness of the punishment, the futility of the war and the fact that the leaders were a group of soul-less fiends were the focus of this intensely interesting film.The lead was played by Kirk Douglas. His job was to defend these poor men, but it soon becomes obvious that the trial is a show trial--the men are doomed from the outset. In some films, Douglas' style of acting is not very appropriate, but his bigger than life acting style and the way he ultimately explodes at his superiors is a wonderful addition to the film. He single-handedly acts like the conscience of the nation--something that was clearly lacking. A wonderful and intense performance on his part--perhaps only surpassed by his lead in the film LUST FOR LIFE.This is a wonderful film about this war--a wonderful film to be seen along with ALL QUIET ON THE WESTERN FRONT. Any true fan of film should see this movie."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8599313",
      "warningSpoilers": false,
      "date": "9 October 2022",
      "rate": "8",
      "helpful": "12 out of 13 found this helpful.",
      "title": "War, What is it Good For...",
      "content": "You've been posted to the front, to serve your country in the war, now they want you to go over, and face the enemy once more, only problem that you have, is you know it's certain death, there'll be no gains made here today, but there'll be, almighty mess.As powerful a film as ever existed against those who pursue war as a solution, painting a portrait of the incompetence of command and the futility of armed conflict, as French soldiers on the front during WW1 discover the penalty for disobedience, the consequence of insubordination and that everyone is accountable, and that nothing's fair, there is no love in war.Top performances all round, especially from Kirk Douglas, and a director that went on to make his mark quite significantly in the world of film."
    },
    {
      "username": "kamerad",
      "userUrl": "https://www.imdb.com/user/ur0198397",
      "reviewLink": "https://www.imdb.com/review/rw0062283",
      "warningSpoilers": true,
      "date": "7 June 2002",
      "rate": "10",
      "helpful": "94 out of 109 found this helpful.",
      "title": "Kubrik's First Masterwork",
      "content": "\"Paths of Glory\" (1957) (and this is personal opinion of course) is Stanley Kubrick's first real masterpiece in what would be a long line of subsequent masterpieces. I know that Kubrick had a reputation for making cold, unemotional films (which is a false impression, but that's the subject for another essay) but I don't believe there are many people who can deny how powerful this film is. Through the editing, camera movement, incredibly realistic dialogue, and a now more fully realized use of irony, Kubrick creates an unforgettable anti-war parable. I realize that my love for this film is incredibly obvious, but I'll try to focus on an analysis of the film rather than a review, but the movie is just so good! Francois Truffaut once said that there is no such thing as a true anti-war film because the battle scenes make the war look exiting. \"Paths of Glory\"'s scenes of battle are certainly gripping, but gripping in the way that a nightmare is gripping. There is no way a person can see these scenes and wish they were participating (like the action scenes in say, \"The Dirty Dozen\"). I vividly recall the scene where three men try to sneak behind enemy lines in the middle of the night. The battlefield is cloaked in darkness. Someone shoots a flare. Silently, a brief burst of light illuminates the field, revealing several corpses strewn over the ground. Darkness quickly covers them up again. Kubrick uses silence and sparse sound effects in this scene like a musical score. Any actual music would be intrusive and rob from the moment, a flaw found in too many otherwise good films of the nineteen fifties (personal opinion of course). Point of view is used very well in the film to illustrate the inner concerns of the major characters. We see General Mireau's Point of view when he looks through the binoculars at the ant-hill he wants his men to take. When he hands over the binoculars to Colonel Dax, we don't see his view of the ant-hill. Later however, when Dax walks through the trenches before the big battle, we do see his point of view looking at his men. This contrasts with an earlier scene when Mireau walked through the trenches and we did not see his point of view. This clearly illustrates what is important to each man. For Mireau, it is victory at all costs; for Dax, it is the welfare of his soldiers. For me one of the most impressive things about \"Paths of Glory\" was it's realistic, yet still poetic, and sometimes even chilling dialogue. This is in sharp contrast to the clever yet purposefuly stagy dialogue of \"The Killing\". One scene sticks out my mind where a soldier is nervously rambling about what it would be like to get shot: \"Most guys say that if they got shot they'd want to die quick. So what does that tell you? It means there not afraid of getting killed, they're afraid of getting hurt. I think if you're gonna get shot and live, it's best to get shot in the rear than in the head. Why? Because in the rear its just meat, but the head, that's pure bone. Can you imagine what it's like for a bullet to rip through pure bone?\" When I first saw this film in a theater, there was some nervous laughter in the audience during this scene. It's true, the scene's dark humour helps illustrate the insanity of the situation. In my introduction I stated that there was great use of irony in the film. Perhaps the greatest irony is the title. In the end no one finds glory. Dax, although he nobly fights to defend his men wrongly accused of treason, loses the fight. Even though he is later offered a promotion, he turns it down because of his disgust for the army. Mireau is found out to be the cad that he is for ordering his own troops slaughter, and is court marshalled. The film successfully states that in a war even the supposed victors lose something as well."
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw7034102",
      "warningSpoilers": true,
      "date": "16 June 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "\"And you can go to hell before I apologize to you\"",
      "content": "Paths of Glory is a movie that anybody can look at the cast of and instantly tell that it's going to be worthwhile. As if being directed by the legendary Kubrick wasn't enough to persuade you, Kirk Douglas also plays the main character. The movie is set during the first world war, where huge masses of men are killed in just a matter of seconds due to new inventions like machine guns and more advanced artillery. Douglas plays a colonel in the french army named Dax. Dax's superior officer, General Mireau, is eager to kill germans, but is aware the plan to take a fortified position known as the anthill is unlikely to succeed. Mireau's boss, General Broulard, promises to promote him if the attack goes well. Mireau vows to take the position, and doesn't care how many french soldiers die in the process. The attack soon begins, and colonel Dax leads his men over the top of their trench to attack the germans. It's a disaster. None of the men reach the enemy position, and the others refuse to get out of the trench to advance because they know they'll be killed too. General Mireau watches the action unfold from a distance and is infuriated at the colonel's lack of progress. He tells artillery to fire on his own men in order to force them out into the open, but the artillery gunners refuse. Mireau now blames Dax for the attack's failure, saying he wasn't aggressive enough, and wants to court martial a number of his soldiers for being cowards. Colonel Dax decides to defend his men at the court martial, but it is nothing more than a setup. No matter what he says, the men are found guilty anyway, and sentenced to be shot. Despite Dax's pleas, the men are eventually executed, and the person who gives the order to fire is Lieutenant Roget, who served under Dax in the trenches during the attack. At the end of the movie, Dax's men are in a bar listening to a captured German girl sing a folk song. This is one of the movies that best illustrates how many lives are destroyed by the deadly game called war. The movie conveys to the viewer that while older men declare it and make the plans, plans go wrong and young soldiers die. It's happened in every conflict, and world war 1 was recent enough to make the audience understand how horrific it was to fight through. Sadly, this type of pointless assault that involved thousands of men dying one after another would be the hallmark of the first world war, and the carnage would be unmatched for years to come. As expected, Douglas is superb as the sympathetic but ruthless colonel Dax, who tries to do everything in his power to stop his men from being executed, going so far as to call one of his commanding officers a sadist. George Macready plays the sadistic General Mireau amazingly, and he really does resemble a psychopath when he orders the artillery fired at his own frontline. Just another person twisted into a maniac by his thirst for prestige. Definitely an essential ww1 movie."
    },
    {
      "username": "TheAnimalMother",
      "userUrl": "https://www.imdb.com/user/ur18519281",
      "reviewLink": "https://www.imdb.com/review/rw2198911",
      "warningSpoilers": false,
      "date": "28 January 2010",
      "rate": "10",
      "helpful": "52 out of 62 found this helpful.",
      "title": "Glorious Integrity In Every Aspect!!",
      "content": "Paths Of Glory is a masterpiece without doubt. Usually a masterpiece is the pinnacle of a directors career. However when you are talking about Stanley Kubrick, you are talking about genuine genius. This is just one of his many masterpieces, but Paths Of Glory is probably as good a film as any of Kubrick's other best works. I have seen tons of war films in my life, many great ones. Honestly, this is my favorite of them all. When I first saw this film I didn't expect it to blow me away. After all it is an early Kubrick film, however it blew me away constantly, and completely. This is not only one of the greatest war films ever made, not only one of the greatest black & white films ever made, it is simply one of the greatest films ever made bar none. The film screams integrity, in each and every way. This film is a joy to watch, and in my estimation, Paths Of Glory will remain forever as one of cinemas greatest accomplishments.10/10"
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw1879733",
      "warningSpoilers": false,
      "date": "24 May 2008",
      "rate": "",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Casting a Long Shadow",
      "content": "How well I remember the audience of 1958 sitting in stunned silence as the daring iconoclasm of the film washed over us like a bucket of cold water at a snoozer's convention. Post-war generations had seen nothing like its brutal honesty before. Instead, Hollywood had taught us that soldiers don't bawl like babies before being shot, that chaplains aren't part of a murderous war machine, that military justice really is about justice, and that generals however far removed are ultimately good and honorable men, (and that cameras always look away from execution scenes). Sure, the movie was not about our army, but the power of its message could not be missed, and no one from that era, having seen it, could again accept Hollywood's platitudes at face value. Now, fifty years later, the film is still timely, having lost none of its power to illuminate. Thanks be to Kirk Douglas for taking a chance on an unproven Stanley Kubrick and getting Allied Artists to finance what was so clearly a non-commercial project. I suspect too, that it was at AA's insistence that Hollywood veterans be cast, even though the movie was shot to great advantage amidst the majestic settings of old Europe. Given the film's message, I think Kubrick would have preferred no-name principals, but then, who could have surpassed the oily charm of Adolphe Menjou's diabolical general, or the pathetic repulsiveness of Timothy Carey's sacrificial dog-face. (It's ironic that the part of the cowardly lieutenant went to an authentic war-hero, naval air-ace Wayne Morris, then only two years away from an untimely death.) This many decades later, I still have mixed feelings about the celebrated final scene. On one hand, it's so clearly manipulative (someone once called it a \"male weepie\"), that I try to steel myself against its undeniable force; on the other, it's so superbly well done that the humming chorus of universal brotherhood never fails to move me, even after this many viewings. Researchers digging into origins of 60's counter-culture should check out themes and characterizations of the screen-play, particularly Timothy Carey's social outcast and Fred Bell's absolutely stunning thirty seconds of emotional break-down. For this is one of the few films from the conformist Eisenhower era to cast a shadow forward in time and serve as a reference point for future generations. The film's abundant cynicism may no longer be as revealing as it once was, thanks to Vietnam. Yet the emotional honesty remains as fresh and compelling as ever in its search for a gut-level depiction of real human anguish. Above all, Kubrick's anti-war classic points toward a more civilized potential amidst the barbarities and passions of combat, whether French or American, and given present political realities, still has many lessons to offer."
    },
    {
      "username": "bmaclach",
      "userUrl": "https://www.imdb.com/user/ur0607419",
      "reviewLink": "https://www.imdb.com/review/rw0062244",
      "warningSpoilers": false,
      "date": "3 November 2000",
      "rate": "10",
      "helpful": "154 out of 170 found this helpful.",
      "title": "An anti-war movie hitting closer to home.",
      "content": "I consider Paths of Glory as one of the most memorable of Kubrick's entire output. The most remarkable aspect of this pioneer anti-war film is the complete absence of any persons depicting the \"real\" enemy. Therefore, the significance of the film lay not so much in its anti-war message, but in its brilliant expose of the \"monsters within\" the general staff, superbly acted by Adolphe Menjou and George Macready. The message here is that the enemy lurks much closer to home. In most war films, whether they glorify or condemn the carnage, there is rarely any venturing at all into the darker side of the politics. This film is a tour de force in its unabashed depiction of just how misguided is the quest for glory as an end in itself; and in the portrayal of the leaders who would shamelessly sacrifice others for their own self aggrandizement. Truly, one of my all time favourite movies."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw1011269",
      "warningSpoilers": true,
      "date": "31 January 2005",
      "rate": "10",
      "helpful": "18 out of 24 found this helpful.",
      "title": "Scary.",
      "content": "It really is a testament to the power of the story told by this film that it stars the French army and they all speak nothing but English, and yet it is still be incredibly moving and compelling. On the other hand, the movie is not really about war but about the soldiers, kind of like Full Metal Jacket. It is structured almost exactly the opposite, with the first half of the film taking place on the battlefield and the second half off. Kirk Douglas plays Col. Dax, whose platoon is ordered to take a hill called the Anthill against staggering odds, almost surely a suicide mission.As the men rush out of the trenches in an attempt to complete the mission, I was reminded of Gallipoli as they were all mowed down within feet of exiting the trenches. It becomes clear that the mission is, ahem, impossible, and is abandoned. Where the movie is truly great is in its characterizations and the complexity of their relationships with one another. Watch, for example, the roles that certain characters play at the beginning and where they end up near the end of the film, such as the General who ordered soldiers to fire on their own men and the man who abandons two of his men on a watch, resulting in one of their deaths and the subsequent court martial and trial of the other. The situations that they end up in are what make the movie powerful.Clearly, the accepted forms of punishment for failing to accomplish a mission are frightening. I have no idea how accurate they are as to French military practices at the time, but for three soldiers to be taken at random and tried and sentenced to death because their entire platoon failed in an impossible mission is scary indeed. I wonder how they would have handled a few soldiers who refused to go on a mission to deliver contaminated gasoline because the vehicles had almost no armor on them whatsoever.What is truly amazing to me is that Kubrick was able to make a movie about massive military injustice and still make the audience laugh at certain times. The cockroach scene, for example, is wonderful comic relief. You get a good laugh without losing sight of the drama and the importance of the rest of the film.It is not uncommon to read that this is the greatest anti-war film of all time, and while there are other anti-war films that I think rank right up there with Paths of Glory, this certainly is one of the greatest ever made."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw4685414",
      "warningSpoilers": true,
      "date": "25 February 2019",
      "rate": "8",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Hard-hitting anti-war movie",
      "content": "PATHS OF GLORY is a typically powerful anti-war movie from director Stanley Kubrick, starring Kirk Douglas in one of his most mature roles. The setting is WW1 and the film follows the French army as they attempt to defend and retaliate against a massive German bombardment. Conflict comes from the machinations of an over-zealous officer who is determined to see success achieved at all costs, no matter the casualties taken along the way. An ensemble of fine performances, taut direction and an intelligent script all combine to make one of the hardest-hitting war movies out there."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw1907826",
      "warningSpoilers": false,
      "date": "9 July 2008",
      "rate": "",
      "helpful": "8 out of 10 found this helpful.",
      "title": "A Masterpiece",
      "content": "Paths of Glory (1956) **** (out of 4) Stanley Kubrick's masterpiece anti-war drama centers on a Colonel (Kirk Douglas) who led a group of soldiers on a suicide mission but when the troops refuse to leave the trenches, three of them are hand picked to be executed on grounds of cowardice. I think sometimes it's easy to forget the pure genius of Kubrick and to me this was the first of many masterpieces that he'd deliver throughout his career. On a technical level this film is flawless from start to finish and this is certainly one of the greatest movies in its genre. There are so many brilliant scenes here that it's really shocking that such a young and fresh director could come off with something like this. There are many memorable scenes in the film but I suppose to most famous ones are the tracking shots following various men inside the trenches. Kubrick keeps the camera in front of the men and tracks them as they walk and the atmosphere this effect brings to the screen hasn't been matched from any war film that I've seen. This technique really builds a strange and claustrophobic nature that puts you right there in the action and gives you a sense of how tight these quarters are. The actual battle scene is also quite beautiful because it really doesn't center on any one piece of the action going on. Instead the camera just floats as the men try to capture their target and the swooping camera really gives you a bigger feeling of the battle. This scene comes off remarkably well considering the budget Kubrick was working with. The film is incredibly powerful with its messages on war and humans and all of this comes together beautifully in the finale, which is very haunting and touching. I think what made Kubrick a genius of his craft was the fact that he had a lot of guts and it's easy to see this with the ending, which doesn't end in a typical way. The final song was something very tricky to pull off yet Kubrick does so wonderfully well and really hits a home run with the message. Finally, the film contains some of the greatest acting you're going to see in the film with Douglas leading the way as the Col. who then must turn defender to try and keep the three men alive. The restraint nature Douglas shows perfectly fits the character but when his rage finally explodes, there's really no one better at doing this type of acting. George Macredy really steals the film as the General who wants the men executed and really becomes one of the most hated villains in film history."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3211864",
      "warningSpoilers": false,
      "date": "31 March 2015",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "One of the greatest anti-war movies",
      "content": "It's 1916 France. General Georges Broulard convinces General Mireau to send his men on a suicide mission to attack the fortified Anthill. The men are worn out. General Mireau with glory in his eyes downplays the difficulties to Col. Dax (Kirk Douglas). He even threatens to relieve Dax when he gives less than full enthusiastic support. On a 3-person night patrol, drunken lieutenant Roget kills fellow soldier Lejeune and then falsifies the records despite Corporal Paris (Ralph Meeker). Dax leads the attack the next morning. The first wave is wiped out and the men refuse to continue the attack. Mireau court-marshals a man from each company for cowardice. Roget sends Paris as one of those men. Dax defends them in the kangaroo court.Stanley Kubrick creates one of the classic anti-war movies of all times. Its indictment was biting at the time and finds its glory by the opposition it faced. Kirk Douglas is at his heroic best. The vision is sharp. The story is poignant. The movie finds its target and doesn't let go."
    },
    {
      "username": "hptaylor",
      "userUrl": "https://www.imdb.com/user/ur2970214",
      "reviewLink": "https://www.imdb.com/review/rw0062331",
      "warningSpoilers": true,
      "date": "15 February 2004",
      "rate": "10",
      "helpful": "243 out of 284 found this helpful.",
      "title": "The most realistic, most emotionally draining, and most beautifully photographed movie ever made about trench warfare in WW I.",
      "content": "I think that Stanley Kubrick is the greatest of all film directors, and in my opinion \"Paths of Glory\" is Kubrick's best film because:1. It is FAR AND AWAY the most realistic, most emotionally draining, and most beautifully photographed movie ever made about trench warfare in WW I, which has to be considered to be one of the significant episodes in all of human history. The story is fiction, but the events are patterned after some actual mutinies in the French army that took place in 1917.2. I first saw this film 46 years ago, and it not only made me an avid Kubrick fan for the rest of my life, it made me want to watch it over and over again -- more than 250 times over the years, and every time I see it, I cry at the end (when Kubrick's future wife, and the only woman in the film, sings \"The Faithful Hussar\", causing the audience of French soldiers to change from a jeering crowd to a hushed, teary-eyed group of lonely men).3. Everything about the movie is PERFECT!! There are no flaws in the acting, the pace of the movie, the photography, the dialogue, etc. Scene after scene is more powerful and ironic than the preceding one, building to a shattering climax. It is simply a gem.4. Try as I might to think of actors that could have been substituted in their places, I think the casting for each and every part in the movie really could not have been any better. No one could have been better in their respective roles than George Macready, Adolphe Menjou, Kirk Douglas, Ralph Meeker, and all of the others. Many of these actors appear in Kubrick's other films.5. Has there ever been a better scene than the one in which one of the condemned soldiers (Ralph Meeker) stares at this cockroach and cries that tomorrow that bug will still be alive and he will be dead. Whereupon one of the other condemned men (the fatalistic Timothy Carey) squashes the cockroach and says \"Now you got the edge on him\".6. You could probably change a few things in most of Kubrick's other masterpieces to slightly improve them, but I DEFY anyone to single out anything in \"Paths of Glory\" that could be improved upon. I could go on and on raving about the beauty and pathos of this film, but I think I will stop here."
    },
    {
      "username": "danm99",
      "userUrl": "https://www.imdb.com/user/ur2229253",
      "reviewLink": "https://www.imdb.com/review/rw0062303",
      "warningSpoilers": false,
      "date": "26 February 2003",
      "rate": "",
      "helpful": "170 out of 219 found this helpful.",
      "title": "KUBRICK'S GENUINE CLASSIC MASTERPIECE",
      "content": "What to say that hasn't already been said. This astonishing cinematic work of art (no kidding) unquestionably is the GREATEST FILM EVER - bar none. I deeply and passionately LOVE this brilliant early Kubrick production. Congratulations to expert screenwriters (and unique pulp writers of the 5O's) Calder Willingham (who also penned his own excellent adaptation of \"The Strange One\"; highly recommended) and Jim Thompson (\"The Grifters\" \"The Killer Inside Me\"; which strongly influenced Tarantino), who both present a superbly incisive script with powerfully effective dialogue that really rings more than true. If only we had more real writers and scripts like this remarkable achievement, we'd be writing far more favorable reviews. \"Paths of Glory\", alone, would serve as anyone's lifetime achievement award. I don't care how much you HATE B&W films - put this one on your MUST-SEE. Compelling cinema-verite photography creates astounding visuals from a varity of incisive angles; like the famous mobile wide-angle tracking shot of Dax (probably Kirk Douglas's most stirring and important performance) moving through the squalid and horrifying trenches as the battle begins with explosions breaking out all over. The suspense and tension is frightening, but almost beautifully eerie in the most compelling ways as Kubrick takes us through the deadly limbo of no-man's land - the 'paths of glory' which finally leads to the grave. The action, skillfully combined with powerful moral and existential themes are amazingly conveyed through the bleak yet articulately stunning visuals. THIS IS A FILMMAKER'S FILM! The moral outrage of the sadistic injustice of the military courtmartial never fails to make my blood fully boil. The hypocrisy and corruption is degradingly infuriating. If anything will make a cynic out of you, it's this appropriately pessimistic and depressing cinema chronical based on a true stupid incident in WWI. What's even worse is how POG, in many perceptive ways, serves as an allegory for all the B.S. in real life: Pig-headed leadership in the parasitic hands of the superior greed freaks, two-faced deceptive manipulations, double-standards, backstabbings, social bigotry, arm-chair warriors, egotism, corrupt politics, the militaries's abuse of too much power - and it's destructive desire at satisfying it's lust for vainglory (sounds a little like Hollywood) - Did I leave anything out? You name it, POG has it - and I'm not being sarcastic. The entire ensemble cast is superb with special mention to George Macready as the utterly pompous power-mad glory-seeking \"soldier\", General Mireuo (who thinks nothing about ordering his troops to open fire on his own men for not charging out of the trenches and dying for his \"country\"; which smells a bit like ME ME ME). Don't worry, you'll throughly hate his guts. It truly is true method acting. Again, kudos to Macready, a fine actor who was always too good at playing highly unethical villians. (Incidently, this was a favorite film of a young 195O's Marlon Brando and old salty Winston Churchill, who praised Kubrick's incisive authenticity in the exciting battle scene, which does resemble news footage). Timothy Carey (also ultra-offbeat-cool in Kubrick's other exceptional early flick, \"The Killing\") is morbidly humorous and gut-wrenching as one of the poor fools coldly picked to be executed; all in the ruthless 'patriotic' name (and amoral game) of 'glory'. ARE ANY OF OUR LEADERS LISTENING? Too bad that Carey's memorable talents were so underused by Hollywood, but that always seems to be the unfortunate norm. A little like what ironically happens to him in this intriguing but downbeat story. Ralph Meeker (who was also memorable as the brutal and ruthless Mike Hammer in the 5O's cult gem \"Kiss Me Deadly\" - a complete opposite role that shows a true range of his acting abilities) delivers another wretching performance as the true brave soldier unjustly sentenced for \"Cowardice in the Face of the Enemy\". (Maybe he should have turned 'about face', but it would have still been 'damned if he did and damned if he didn't' - another grim moral theme here). His breakdown scene right before he is to be taken out and shot is terribly heartbreaking, for I felt so wanting, but helplessly unable, to come to his help. Take my word for it, everyone else is awesome; a true actor's dramatic show with dark satirical overtones. POG goes beyond the mere preaching anti-war diatribe (though it does convey that almost naturally, like going without having to say). It's a great classic morality play that will really make you stop (many, many times) and truly make you think (many many times). Airheads not allowed. Moreover, this haunting and disturbing masterpiece is top entertainment, something too many art films aren't. > It will really make you question things about our troubled, convoluted world and how things are to often immorally and inhumanly run all in the sick name of greed and destructive power. Not too lovely, for the director pulls no punches. This film really has grown more profound (and currently pertinent) since its initial release. Also the editing is taut and concise; there isn't a single wasted moment. Count the number of films on one hand that has accomplished that miraculous feat; that most critics and user commentators are always rightfully harking on. I'll shut up now. Go see this one-of-a-kind film, then see it again - and again, etc. >"
    },
    {
      "username": "rzajac",
      "userUrl": "https://www.imdb.com/user/ur1517556",
      "reviewLink": "https://www.imdb.com/review/rw0062296",
      "warningSpoilers": true,
      "date": "18 December 2002",
      "rate": "",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Very good. But...great?",
      "content": "I enjoyed Paths of Glory well enough, but am surprised, for instance, that it ranks so high in the IMDB top 250....I see it as a formative film for Kubrick. You can see the beginnings of his special emerging talent and interest; naming the names and delivering the dramatic goods without a bunch of extraneous matter; addressing those of us whose dramatic needs won't be satisfied by an appeal to worn-out and questionable moral assumptions endemic to film up to then (and still afflicting much of film today).However, there were problems. It appeared to me that Kubrick was unable to transcend certain encumbrances of the medium of the time; character acting, \"stage\" dialog and exaggeration, \"pulling of the punches\" in some of the writing and development.Another thing: I think of a line from \"Manon of the Spring\", where Montand's evil, culpable character says: \"That would be just like [another villager]; to confess someone else's sins [to the priest]!\" And rightfully so. And I can't help but feel this particular concern taints \"Paths\". At its heart, it is very much a cinematic confession of the \"sins\" of someone else (the French). The fact that the story holds some promise of universal application doesn't to my thinking sufficiently blunt that core reality.*** Spoilers Ahead ***Another thing I couldn't banish from my mind as I watched was, as reprehensible as the depicted military courtroom procedure appears to our eyes, that it was a heck of a lot more than many Frenchmen received during WWI, when court martial procedures were very often hastily convened in bombed out buildings with the dust still in the air, based on flimsy \"evidence\"; often patently subjective judgement calls on the fighting mettle of the accused; followed by throwing the \"convicted\" up against the nearest crumbling wall and knocking them down with no more ceremony than taking a dump. Heck, that's war, and it's largely unwritten and undocumented. Which reminds me; when Douglas's character says \"I'm incensed that there is no stenographic record of this proceeding!\"...then what did the writers base their script upon? I do realize the above *does* describe much about the process shown in \"Paths\"; the General was taking unfair advantage of the subjectivity taken for granted in determining the inner states of the accused, and to the extent this came from base promotional motives on the part of the general, it's a crime against humanity of unspeakable proportions, and I'm glad the story is being aired. But it's just a drop in the bucket of the insanity of real trench warfare. I couldn't dispense with that distracting thought during the movie.All the scenes in the cell where the condemned were held were fantastic, and show where Kubrick was headed in his career. Great writing, presaging \"Sparticus\". Not all the writing in the movie was up to that standard (though close).I didn't get the point behind the last scene, where the German girl sings and the French soldiers are deeply moved. It was a great scene (great!), but I couldn't for the life of me achieve the integration of that scene with the rest of the movie, and I consider myself perfectly amenable to doing the bit of work to make those kinds of connection on behalf of well-intentioned filmmakers. If there was a spiritual connection, I didn't quite see it. I think it was an end-game botch. When you look at the story, you realize that there was no resolution possible, because you can't bring the executed soldiers back to life. But Kubrick & Co. needed to find a resolution anyway. Perhaps the dawning investigation into Gen. Paul Mireau's shennanigans and Dax's vehement denial of self-aggrandizing motives should have been left ringing in our ears. I don't know. I understand why they had to have *something*...In summary. See this movie; it's good, and an important step in Kubrick's work. Decide for yourself if it all comes together as a moral fable."
    },
    {
      "username": "ch-o-jsch",
      "userUrl": "https://www.imdb.com/user/ur3685142",
      "reviewLink": "https://www.imdb.com/review/rw0062335",
      "warningSpoilers": true,
      "date": "11 July 2004",
      "rate": "",
      "helpful": "85 out of 100 found this helpful.",
      "title": "another point of view",
      "content": "I've read some of the last comments and all I can say is that I think most of you missed the point in this film. No offense to everybody, but I've never regarded this movie as an antiwar movie or something like that. The fact, that my interpretation is not corresponding with most of the others lies in the simple truth that 50% of work is done by the \"author\" and the rest is done by the audience.Kubrick used his films as little pieces of the great image of mankind. In all his movies one can see one or multiple depictions of individuals or groups and their feelings and actions, which are not only typical for the protagonists, and antagonists, but also for the viewer.In the Paths Of Glory this special feeling is perhaps the most ordinary of all: hope. From the beginning there is no hope in this movie. The battle is lost before it even started. Those three poor creatures are sentenced to death before even the trial had started. And still the audience hopes for a happy end, that the general may stop the execution in the last second. But nothing happens. At this point the viewer is as hopeless as the figures in the movie. The following breakfast scene leaves everybody in a state of paralization, nothing changes.And then at the end. this helpless and beautiful girl begins to sing a German folk song, which none of the present soldiers knows what it's all about. But the mood of the mob changes away from hate and anger and they all begin to cry like babies. In this very moment hope is reborn and comes back to the battlefield of feelings as the glorious winner. This is when we regain our hope.Many people wrote, that the last scene didn't fit in the film at all. I would say, that without this scene the movie would have never become the classic it is now. Of course the filming and actor performances are brilliant, but this specialty of the last scene makes this movie unforgettable."
    },
    {
      "username": "water-wiz",
      "userUrl": "https://www.imdb.com/user/ur3149843",
      "reviewLink": "https://www.imdb.com/review/rw0946857",
      "warningSpoilers": true,
      "date": "14 October 2004",
      "rate": "",
      "helpful": "75 out of 93 found this helpful.",
      "title": "An excellent war film!",
      "content": "The end sequence is beautifully symbolic.The soldiers in the bar watch as a frightened German girl is brought before them. As the poor lass struggles to sing her song (it really doesn't matter what song), they begin to realize that this hapless creature is enduring what their three executed comrades had endured themselves. Their three comrades were brought before the military tribunal as a formality before their execution. Now these soldiers are the tribunal for this pitiful girl who now stands before them awaiting their judgment. But unlike the cold inhuman justice that the French military machine has dealt to their compatriots, they watch intently as this German girl strives to sing in spite of all their cat calls and hoots and hollers, realizing that she is trying her best in spite of overwhelming opposition, just as they and their three dead friends had tried in attacking the ant hill. They cry because they see themselves up there on the stage.........a poor frightened soul that finds themselves in a situation they'd rather not face but is compelled to do so. Colonel Dax realizes this and allows this brief respite of humanity to engulf the troops before they are sent back to face the horrors of the war. This film is indeed one of the best war films ever made it simply overpowers the viewer with emotion."
    },
    {
      "username": "psychprofessor",
      "userUrl": "https://www.imdb.com/user/ur2363317",
      "reviewLink": "https://www.imdb.com/review/rw0062323",
      "warningSpoilers": true,
      "date": "15 November 2003",
      "rate": "10",
      "helpful": "36 out of 47 found this helpful.",
      "title": "One of the all-time best antiwar movies",
      "content": "If you can watch this movie all the way through to the final scene in a bar in which a German girl (played by Kubrick's wife!) sings a song and all the grizzled veterans in the room cry--and not cry yourself--then something's wrong with you. This is one heck of a powerful film and makes a better statement against the senselessness of war than many films with vastly bigger budgets. It blew me away the first time I saw it."
    }
  ],
  "errorMessage": ""
}