{
  "imDbId": "tt0050825",
  "title": "Paths of Glory",
  "fullTitle": "Paths of Glory (1957)",
  "type": "Movie",
  "year": "1957",
  "language": "en",
  "titleInLanguage": "Paths of Glory",
  "url": "https://en.wikipedia.org/wiki/Paths_of_Glory",
  "plotShort": {
    "plainText": "Paths of Glory is a 1957 American anti-war film co-written and directed by Stanley Kubrick, based on the novel of the same name by Humphrey Cobb. Set during World War I, the film stars Kirk Douglas as Colonel Dax, the commanding officer of French soldiers who refuse to continue a suicidal attack, after which Dax attempts to defend them against charges of cowardice in a court-martial.\r\nThe film was co-produced through Douglas's film production company, Bryna Productions, and a joint venture between Stanley Kubrick and James B. Harris, Harris-Kubrick Pictures. In 1992, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.",
    "html": "<p>Paths of Glory is a 1957 American anti-war film co-written and directed by Stanley Kubrick, based on the novel of the same name by Humphrey Cobb. Set during World War I, the film stars Kirk Douglas as Colonel Dax, the commanding officer of French soldiers who refuse to continue a suicidal attack, after which Dax attempts to defend them against charges of cowardice in a court-martial.</p><p>The film was co-produced through Douglas's film production company, Bryna Productions, and a joint venture between Stanley Kubrick and James B. Harris, Harris-Kubrick Pictures. In 1992, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.</p>"
  },
  "plotFull": {
    "plainText": "Paths of Glory is a 1957 American anti-war film co-written and directed by Stanley Kubrick, based on the novel of the same name by Humphrey Cobb. Set during World War I, the film stars Kirk Douglas as Colonel Dax, the commanding officer of French soldiers who refuse to continue a suicidal attack, after which Dax attempts to defend them against charges of cowardice in a court-martial.\r\nThe film was co-produced through Douglas's film production company, Bryna Productions, and a joint venture between Stanley Kubrick and James B. Harris, Harris-Kubrick Pictures. In 1992, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.\r\nPlot\r\nIn 1916, during World War I, French General Georges Broulard asks his subordinate, General Paul Mireau, to take the Anthill, a well-defended German position. Mireau initially refuses, citing the impossibility of success. However, when Broulard mentions a potential promotion, Mireau quickly convinces himself the attack will succeed.\r\nAt the trenches, Mireau throws a private out of the regiment for showing signs of shell shock. Mireau leaves the planning of the attack to Colonel Dax, despite Dax's protests that the only result of the attack will be to weaken the French Army with heavy losses for no benefit.\r\nBefore the attack, drunken lieutenant Roget leads a night-time scouting mission, sending one of his two men ahead. Overcome by fear while waiting for the man's return, Roget lobs a grenade, accidentally killing the scout. Corporal Paris, the other soldier on the mission, confronts Roget, who denies any wrongdoing and falsifies his report to Colonel Dax.\r\nThe next morning, the attack on the Anthill is a failure. Dax leads the first wave of soldiers over the top into no man's land under heavy fire. None of the men reach the German trenches, and B Company refuses to leave their own trench after seeing that violent defeat. Mireau, enraged, orders his artillery to open fire on them to force them onto the battlefield. The artillery commander refuses to fire without written confirmation of the order. Meanwhile, Dax returns to the trenches and tries to rally B Company to join the battle, but as he climbs out of the trench, the body of a dead French soldier knocks him down.\r\nAt a meeting with Broulard and Dax, to deflect blame for the attack's failure, Mireau decides to court-martial 100 of the soldiers for cowardice. Enraged, Broulard orders Mireau to reduce the number. Mireau arrives at three, one from each company. Corporal Paris is chosen because his commanding officer Roget wishes to keep him from testifying about what happened in the scouting mission. Private Ferol is picked by his commanding officer because he is a \"social undesirable\". The last man, Private Arnaud, is chosen at random, despite having been cited for bravery twice previously.\r\nDax, who was a criminal defense lawyer in civilian life, volunteers to defend the men at their court-martial. The trial, however, is a farce. There is no formal written indictment, a court stenographer is not present, and the court refuses to admit evidence that would support acquittal. In his closing statement, Dax denounces the proceedings. Nonetheless, the three are sentenced to death.\r\nThe night before the execution, Dax confronts Broulard at a ball, with sworn statements by witnesses attesting to Mireau's order to shell his own trenches, in an attempt to blackmail the General Staff into sparing the three men. Broulard takes the statements but brusquely dismisses Dax.\r\nThe next morning, the three men are taken out to be shot by firing squad. Dax, suspecting Roget for his nomination of Paris, forces Roget to lead the executions. While a sobbing Ferol is blindfolded, Paris refuses Roget's offer of a blindfold and reacts ambiguously to Roget's meek apology. Arnaud, meanwhile, is so badly injured after fighting in prison that he must be carried out in a stretcher and tied to the post. All three men are executed.\r\nFollowing the executions, Broulard breakfasts with the gloating Mireau. Broulard reveals he has invited Dax to attend and tells Mireau that he will be investigated for ordering to fire on his own men. Mireau storms out, protesting that he has been made a scapegoat. Broulard then blithely offers Mireau's command to Dax, assuming that Dax's attempts to stop the executions were a ploy to gain Mireau's job. Discovering that Dax was in fact sincere, Broulard rebukes him for his idealism, while the disgusted Dax calls Broulard a \"degenerate, sadistic old man\".\r\nAfter the execution, some of Dax's soldiers are carousing at an inn. They become more subdued as they listen to a captive German girl sing a sentimental folk song. Dax decides to leave without informing the men that they have been ordered to return to the front.\r\nCast\r\nKirk Douglas as Colonel Dax, commanding officer, 701st Infantry Regiment\r\nRalph Meeker as Corporal Philippe Paris, 701st Infantry Regiment\r\nAdolphe Menjou as Major General Georges Broulard, corps commander\r\nGeorge Macready as Brigadier General Paul Mireau, divisional commander\r\nWayne Morris as Lieutenant Roget, company commander, 701st Infantry Regiment\r\nRichard Anderson as Major Saint-Auban, Mireau's aide de camp\r\nJoe Turkel as Private Pierre Arnaud, 701st Infantry Regiment (credited as Joseph Turkel)\r\nChristiane Kubrick as German singer (credited as Susanne Christian)\r\nJerry Hausner as café proprietor\r\nPeter Capell as president of the court martial (and narrator)\r\nEmile Meyer as Father Duprée\r\nBert Freed as Staff Sergeant Boulanger, 701st Infantry Regiment\r\nKem Dibbs as Private Lejeune, 701st Infantry Regiment\r\nTimothy Carey as Private Maurice Ferol, 701st Infantry Regiment\r\nFred Bell as shell-shocked soldier\r\nJohn Stein as Captain Rousseau, artillery battery commander\r\nHarold Benedict as Captain Nichols, artillery liaison officer\r\nJames B. Harris as soldier in attack (uncredited)\r\nProduction\r\nBackground\r\nThe title of Cobb's novel came from the ninth stanza of Thomas Gray's poem \"Elegy Written in a Country Churchyard\" (1751).\r\nThe boast of heraldry, the pomp of pow'r, And all that beauty, all that wealth e'er gave, Awaits alike th'inevitable hour. The paths of glory lead but to the grave.\r\nThe book was a minor success when published in 1935, retelling the true-life affair of four French soldiers who were executed to set an example to the rest of the troops. The novel was adapted to the stage the same year by Sidney Howard, World War I veteran and scriptwriter of Gone with the Wind . The play was a flop on Broadway, because of its harsh anti-war scenes that alienated the audience. Nonetheless, Howard continued to believe in the relevance of the subject matter and thought it should be made into a film, writing, \"It seems to me that our motion picture industry must feel something of a sacred obligation to make the picture.\" Fulfilling Howard's \"sacred obligation\", Stanley Kubrick decided to adapt it to the screen after he remembered reading the book when he was younger. Kubrick and his partners purchased the film rights from Cobb's widow for $10,000.\r\nGray's stanza reflects Kubrick's feelings about war as well, and that becomes clear in the narrative of the film – a long battle for something with such an unimportant name as the \"Ant Hill\". Some of Kubrick's unrealized projects contained themes of war, as well. Kubrick once told a New York Times journalist:\r\nMan isn't a noble savage, he's an ignoble savage. He is irrational, brutal, weak, silly, unable to be objective about anything where his own interests are involved – that about sums it up. I'm interested in the brutal and violent nature of man because it's a true picture of him. And any attempt to create social institutions on a false view of the nature of man is probably doomed to failure.\r\nKubrick's filmography shares many visual elements but thematically, the most frequent subject – even more than sexuality – is war. Dr. Strangelove (1964) presents war as a farce, its absurdity and pointlessness evoked through comedy. Fear and Desire (1953) demonstrates that the extreme stress and trauma of war can lead to the mental breakdown of soldiers to a point where they are insanely committing war crimes against a civilian population, thereby effectively abandoning the waged purpose of the war in the first place. Full Metal Jacket (1987) enters the mind of a soldier and tells the audience that they may not like what they hear. Spartacus (1960) also shows the horrors of war, much like Barry Lyndon (1975) and A Clockwork Orange (1971) with its many references to World War II and other conflicts.\r\nPaths of Glory is based loosely on the true story of the Souain corporals affair, when four French soldiers were executed in 1915, during World War I under General Géraud Réveilhac, for failure to follow orders. The soldiers were exonerated posthumously, in 1934. The novel is about the French execution of innocent men to strengthen others' resolve to fight. The French Army did carry out military executions for cowardice, as did most of the other major participants, excluding the United States of America and Australia. The United States sentenced 24 soldiers to death for cowardice, but the sentences were never carried out. However, a significant point in the film is the practice of selecting individuals at random and executing them as a punishment for the sins of the whole group. This is similar to the Roman practice of decimation, which was rarely used by the French Army in World War I. Paths of Glory takes place in France, but Kubrick's feelings on the topic stem more from his American upbringing. When General Mireau says “show me a patriot, and I'll show you an honest man”, Colonel Dax remarks that Samuel Johnson once said: “Patriotism is the last refuge of the scoundrel”.\r\nDevelopment\r\nKubrick once said of his decision to make a war film: \"One of the attractions of a war or crime story is that it provides an almost unique opportunity to contrast an individual or our contemporary society with a solid framework of accepted value, which the audience becomes fully aware of, and which can be used as a counterpoint to a human, individual, emotional situation. Further, war acts as a kind of hothouse for forced, quick breeding of attitudes and feelings. Attitudes crystallise and come out into the open. Conflict is natural, when it would in a less critical situation have to be introduced almost as a contrivance, and would thus appear forced or, even worse, false.\"\r\nAlthough Kubrick's previous film The Killing had failed at the box office, it had managed to land on several critical top-ten lists for the year. Dore Schary, then head of production at Metro-Goldwyn-Mayer, liked the film and hired Kubrick and Harris to develop film stories from MGM's slush pile of scripts and purchased novels. Finding nothing they liked, Kubrick remembered reading Cobb's book at the age of 14 and the \"great impact\" it had upon him and suggested it as their next project. Schary strongly doubted the commercial success of the story, which had already been turned down by every other major studio.\r\nAfter Schary was fired by MGM in a major shake-up, Kubrick and Harris managed to interest Kirk Douglas in a script version that Kubrick had done with Calder Willingham. After reading the script, Kirk Douglas was impressed and managed to get an advance for a $1 million budget from United Artists to help produce the film. Of the roughly $1 million budget, more than a third was allocated to Kirk Douglas' salary. Prior to the involvement of Douglas and his Bryna Production Company, no studio had showed interest in the seemingly noncommercial subject matter and filming in black and white. MGM rejected the idea of the film based on fears that the film would be unfavourable to European distributors and audiences. United Artists agreed to back it with Douglas as the star.\r\nWriting\r\nKubrick eventually hired Calder Willingham to work on the script of Paths of Glory (1957), of which Jim Thompson had written earlier drafts. The specific contributions by Kubrick, Thompson, and Willingham to the final script were disputed, and the matter went to arbitration with the Writers' Guild. Willingham claimed that Thompson had minimal involvement in the final script of the film, claiming responsibility for 99 percent of Paths of Glory for himself and that Thompson had not written any of the dialogue. When Thompson's draft screenplay was compared to the final film, it was clear that Thompson had written seven scenes, including the reconnaissance mission and the soldiers the night before their executions by firing squad. In the end, the Writers' Guild attributed the script in the order of Kubrick, Willingham and then Thompson.\r\nParts of the screenplay were taken from Cobb's work verbatim. However, Kubrick made several changes to the narrative of the novel in his adaptation, most notably his shift of focus to Colonel Dax, as opposed to Paris, Ferol and Arnaud as in the novel.\r\nPrimarily, Kubrick and Thompson had added a happy ending to the film to make the film more commercial to the general public, where the men's lives are saved from execution at the last minute by the general. However, these changes were reversed back more closely to the original novel at the demand of Kirk Douglas. On the Criterion Collection Blu-ray, James B. Harris claims to have gotten this ending past distributors by sending the entire script instead of just the reversed ending, in the knowledge that those distributors would not read through the whole script again. After viewing the film, United Artists was happy with the changes and left the ending as it is.\r\nFilming\r\nProduction took place entirely in Bavaria, Germany, especially at the Schleissheim Palace near Munich. Timothy Carey was fired during production. He was reportedly extremely difficult to work with, even to the extent of faking his own kidnapping, holding up the whole production. He was replaced in the scenes remaining to be shot with a double. The film cost slightly less than $1 million and just about broke even.\r\nDue to having three years' military training, around 600 German police officers were used as extras for soldiers. The last scenes filmed were those that take place on the battlefield. For the construction of the battlefield, Kubrick hired 5,000 square yards (0.4 hectares) of land from a local farmer. It took Kubrick a month to set up the filming of the assault, arranging props and tearing up the field to look like a war zone. For the filming of the battle sequence, the battlefield was divided into five regions where explosive charges were specifically placed. This made it easier for Kubrick to film the dying of extras as he split the extras into five groups, one for each of the regions, and each man would die in his own zone by an explosion that was near him.\r\nAn early critical test of Kubrick's obsession with control on the set came during the making of Paths of Glory. As recalled by Kirk Douglas:\r\nHe made the veteran actor Adolphe Menjou do the same scene 17 times. \"That was my best reading.\" Menjou announced. \"I think we can break for lunch now.\" It was well past the usual lunch time but Kubrick said he wanted another take. Menjou went into an absolute fury. In front of Douglas and the entire crew he blasted off on what he claimed was Kubrick's dubious parentage and made several other unprintable references to Kubrick's relative greenness in the art of directing actors. Kubrick merely listened calmly and after Menjou had spluttered to an uncomplimentary conclusion said quietly: \"All right, let's try the scene once more.\" With utter docility, Menjou went back to work. \"Stanley instinctively knew what to do,\" Douglas says.\r\nThe only female character in the film, the woman who sings \"The Faithful Hussar\", is portrayed by German actress Christiane Harlan (credited in the film as Susanne Christian). An affecting scene towards the end of the film shows actress Harlan briefly appearing to sing a German song, timidly evoking emotion in both the audience and the soldiers. She and Kubrick later married; the couple remained together until his death in 1999. It was on set that they originally had met.\r\nKubrick's use of visual imagery and mise-en-scene\r\nPaths of Glory employs both camera-work and audio cues to create a sense of realism, thus making it easier for the audience to sympathise with the plight of the accused soldiers. In the beginning of the film a snare drum plays, and the music is reminiscent of war era newsreels. During the battle sequences, the camera keeps pace with the soldiers but in other ways, the shots look like old trench warfare footage from World War I. The film's choice of black and white further emphasises its similarity to the actual newsreels of the conflict.\r\nKubrick's vision of war was far bleaker than that of some other films of the era, which also influenced the director's choice to shoot the picture in black and white. The visuals also allow the audience to see the difference between \"life in the trenches\" and \"life in the command\". From the opulent mansion of the high-ranking officers, the audience notices wide shots from the exterior and the interior. The viewer misses nothing; every decadent piece of furniture, jewelry or bauble that the senior officers have, in sharp contrast to the trenches where the shots are much tighter. Close ups and point-of-view shots (e.g. from Colonel Dax's perspective) are cramped and tight, suffocating for the audience. Switching to a shot in front of Dax's person, e.g. a walking shot, the audience becomes much like the other soldiers accompanying him in the trenches, feeling stuck and trapped in the confined and dangerous space.\r\nScore and use of sounds\r\nThe musical score by Gerald Fried makes extensive use of percussion instruments, specifically military drums.\r\nKubrick used sound, or the lack thereof, to build tension and suspense in the film, particularly towards the beginning when the three soldiers are given orders to check on the Anthill. This scene is in silence, with no use of diegetic/non-diegetic sound, working well to add depth and rawness. Much of what the viewer can hear throughout the film is explosions in the distance and the sound of a whistle being blown, further adding to the overall documentary style of the film. The lack of a big bold score gives no suggestion of heroism to the plot of the film, and the sounds of people dying are a common trope associated with Stanley Kubrick's films. The song towards the ending happens within the narrative. In the tavern with the French soldiers of Dax's regiment, a young woman sings a traditional German folk song of that era, \"Der treue Husar\". With Kubrick's use of mise-en-scene, the audience is able to see the German woman's performance bring the men to tears through various close-ups and angles. The troopers begin to hum and eventually sing along to the tune in an expression of their basic humanity. Paths of Glory later ends in the same way it began with the familiar snare/drum roll used in the opening, indicative of a lack of change throughout the film. Kubrick's use of sounds and song functions as a kind of narration for the audience, linking each sound to a later or earlier scene in the film.\r\nRelease\r\nThe film had its \"world premiere\" in Munich, Germany on November 1, 1957 A month and a half before that event, on September 18, a special screening of Kubrick's production was also presented in Munich, but then to a very select audience. Frank Gordon, reporting from the Bavarian capital for the widely read New York trade paper Variety, describes the earlier presentation in the paper's September 27 issue:\r\nMunich, Sept. 18.Three hundred specially invited local VIPs, Army brass, Radio Free Europe staffers, German stage and film luminaries mingled with Kirk Douglas, Janet Leigh, Tony Curtis and Ernest Borgnine to see a \"not for review\" showing of Jim Harris' Munich-filmed \"Paths of Glory.\"...Douglas, who stars in \"Paths,\" is presently shooting his own Bryna-produced \"Vikings\" in this city's Geiselgasteig studios. \"Vikings\" co-stars Curtis, Borgnine, and Leigh....A World War I action story, will be released through United Artists. Also a Bryna production, it was directed by Stanley (\"The Killing\") Kubrick.\r\nIn the United States, the picture was not officially released nationwide until January 1958, although it was shown in two major cities prior to that: in Los Angeles, California at the Fine Arts Theatre on December 20, 1957 and then five days later, on Christmas Day, in New York City at the Victoria Theatre. The American trade journal Motion Picture Daily explained at the time that \"Paths\" was being shown in those cities before the end of 1957 to ensure the film would qualify for nominations for the next Academy Award ceremonies, which were to be held on March 26, 1958.\r\nBox office\r\nAssessments vary with regard to the film's ultimate success at the box office, with some sources citing it as a modest financial success and others noting that it only managed to recoup most, if not all, of its production costs. The film did, however, earn Kubrick widespread critical acclaim, while it also generated widespread controversy, especially in Europe.\r\nReception and influence\r\nAlthough the film did not receive a single nomination for the Academy Awards of 1958, it was nominated for and collected several international awards. Those awards and many positive reviews from film critics further enhanced Kubrick's already growing reputation. The film was nominated for a BAFTA Award under the category Best Film but lost to The Bridge on the River Kwai. The production also received in Finland the Jussi Awards' Diploma of Merit, was nominated for a Writers' Guild of America Award in 1959, and won the prestigious Grand Prix of the Belgian Film Critics Association. Kubrick himself received on February 17, 1959 in Rome the Italian critics' Silver Ribbon, an award recognizing him as \"the best foreign director of 1958 for his movie 'Paths of Glory'.\"\r\nControversy\r\nOn its release, the film's anti-military tone was subject to severe public criticism and governmental censorship.\r\nIn France, both active and retired personnel from the French military vehemently criticized the film—and its portrayal of the French Army—after it was released in Belgium. The French government placed enormous pressure on United Artists, (the European distributor) not to release the film in France. The film was eventually shown in France in 1975 when anti-war attitudes were more acceptable.\r\nThe film was withdrawn from the Berlin Film Festival to avoid straining relations with France. It was then not shown in Germany until two years after its theatrical release in the United States.\r\nIn Spain, the fascist government of Francisco Franco objected to the film. It was not shown there until 1986, 11 years after Franco's death.\r\nThe Swiss government banned any presentations of the film until 1970 on the grounds that it was \"incontestably offensive\" to France, its judicial system and its army.\r\nThe film was banned in all United States military establishments, both at home and overseas, due to its content.\r\nReviews in the United States, 1957–1958\r\nDespite the film's harsh reception in Europe by various governments, French war veterans, and media outlets, in the months after the motion picture's initial screenings in the United States, reactions to Kubrick's production featured in American newspapers and trade publications were generally positive. Nevertheless, perceived deficiencies in the film's structure and content were expressed by some of the nation's leading reviewers in 1957 and 1958.\r\nIssues with \"colloquial English\" dialogue\r\nIn his December 26, 1957, review for The New York Times, Bosley Crowther credits Kubrick for creating a visually \"terrific\", highly intense picture. In particular, Crowther draws attention to the story's execution scene, which he describes as \"one of the most craftily directed and emotionally lacerating that we have ever seen.\" He does, though, also identify two \"troubling flaws\" that he saw in the film, one being within the \"realm of technique\", the other within the \"realm of significance\":\r\nWe feel that Mr. Kubrick – and Mr. Douglas – have made a damaging mistake in playing it in colloquial English, with American accents and attitudes, while studiously making it look as much as possible like a document of the French Army in World War I. The illusion of reality is blown completely whenever anyone talks....As for the picture's significance, it comes to an inconclusive point. Its demonstration of injustice is like an exhibit in a bottle in a medical museum. It is grotesque, appalling, nauseating – but so framed and isolated that, when you come away, you are left with the feeling that you have been witness to nothing more than a horribly freakish incident.\r\nThe absence of any spoken French or suitably accented English dialogue in a highly focused portrayal of French soldiers continued to be a point of debate in American critical analysis of Paths of Glory. Philip K. Scheuer, who wrote about films for the Los Angeles Times from the 1920s to 1967, was another reviewer who addressed the issue again in the newspaper's January 16, 1958, edition. In a follow-up discussion about the \"controversial war picture\", in a commentary subtitled \"Question of Foreign Accents Raised by 'Paths of Glory'\", Scheuer cites the style of speech used in the film and the screenplay's \"weak\" ending as two reasons he omitted the production from his \"selection of 1957's best\". Like Bosley Crowther, he found the \"linguistic\" aspects of the dialogue wholly distracting. \"In 'Paths'\", Scheuer writes, \"the actors all...employ ordinary colloquial English – much of it, I felt, delivered badly – although Adolph Menjou, being of French descent, did convey a certain quality of Frenchness,\" adding, \"The others were simply Hollywood types.\"\r\nThe film's \"grim\" plot\r\nThe overriding tone of the motion picture also evoked comments about the picture's marketability, namely its scant appeal to a very large segment of moviegoers. \"Grim\" is the word that frequently appears in contemporary reviews of the film, an adjective understandably applied given the story's brutal subject matter, and a word still commonly used even in complimentary assessments by critics. In its March 18, 1958 edition, the Chicago Daily Tribune summarizes the release as \"a grim, forceful story, presented in blunt, unvarnished fashion, entirely lacking in the customary cliches, deftly directed.\" Whitney Williams, a critic for Variety, previewed the film six weeks before it opened at the Fine Arts Theatre in Los Angeles. In his review, which was published on November 20, 1957, Williams anticipates limited interest as well as limited box-office revenue for the picture:\r\n\"Paths of Glory\" is a starkly realistic recital of French army politics in 1916 during World War I. While the subject is well handled and enacted in a series of outstanding characterizations, it seems dated and makes for grim screen fare. Even with the Kirk Douglas star name to spark its chances, outlook is spotty at best and will need all the hard selling United Artists, which is distributing the Bryna production, can muster.\r\nHarrison's Reports, an independent and advertisement-free film review journal in 1957, agreed with Variety's critic and in November expressed doubts too that the \"World War I melodrama\" would be successful commercially after its general release in January 1958. \"Just how it will fare at the box-office is a matter of conjecture\", Harrison's stated, characterizing its central theme as \"a grim and unpleasant study of man's inhumanity toward man\".\r\nViews on the screenplay's ending\r\nEdwin S. Schallert, a fellow critic of Philip Scheuer at the Los Angeles Times, also attended the film's first screening in Los Angeles on December 20, 1957. The following day the newspaper published Schallert's evaluation, which begins by classifying Paths of Glory as \"A minor contribution but an interesting one to the war effort on the screen\". Next he describes the drama's storyline in some detail before addressing specifically the film's final scene, which he found odd and disconnected in its presentation so soon after \"the grim gray execution\". \"Susanne Christian\", Schallert writes, \"is seen as the German girl forced to sing to a huge body of troops right at the end of the picture – a peculiar sort of payoff for the miscarriage of justice to which the whole gathering of men seems to be oblivious.\" He then concludes, \"'Paths of Glory' is a commendably sincere picture, very well told for the most part, though it does not fulfill itself in the best screen and entertainment terms. It is practically like a documentary.\"\r\nThe review in Harrison's Reports addressed the ending as well, maintaining that it was the \"picture's one weak spot\", was \"difficult to understand\", and \"leaves one with a feeling that it is inconclusive\". The journal then offered its own interpretation of the final scenes. From Harrison's perspective, as Colonel Dax is returning to his quarters after his confrontations with his superior officers, \"he notices his soldiers enjoying themselves in a cafe. It disgusts him to think that they had so quickly forgotten their executed comrades, but he compassionately realizes that life must go on.\" Whitney Williams in Variety also commented about the film's finale, noting that it \"ends so abruptly audience is left with a feeling of incompletion.\"\r\nOther assorted critics in newspapers and trade publications viewed the film's ending and the production's significance cinematically far differently than the cited critics at the Los Angeles Times or the reviewers for Harrison's Reports and Variety. Richard Gertner of the New York-based trade paper Motion Picture Daily was one of them. He, unlike Edwin Schallert, did not see Paths of Glory as a \"minor contribution\" to the genre of wartime portrayals. Nor did he find its closing scenes \"peculiar\"; but instead, \"poignant\". After viewing what he termed \"a brilliant and arresting film\" only a few weeks after its world premiere in Munich, Gertner highly recommended it to his readers, many of whom were theater owners. He then advised those motion picture \"exhibitors\" not to misjudge the film's content in advance:\r\nTechnically, this is a war picture, but any exhibitor who promotes it as just another action film will be making a serious mistake. Its exciting battle scenes and the suspense of a subsequent court martial assure it of appeal in that market. But it also has deeper and stronger elements under the surface that will attract customers who like strong drama....Just as exciting as the physical events are the ideas about war and men that Kubrick trenchantly puts across – about military discipline, the of those who carry it out and the futility of attempting to fight. These are timeless ideas – relevant to any war. Let us hasten to add, however, that this is no \"message\" picture. The theme is implicit to the story and the characters.\r\nFinally, in contrast to Philip Scheuer's omission of the production from his \"selection of 1957's best\", Gertner ends his appraisal emphatically: \"No doubt about it – 'Paths of Glory' is one of the strongest dramas of the year.\"\r\nOpinions regarding Kubrick's direction and editing\r\nIn spite of issues being raised in various reviews about the film's manner of dialogue, its anticipated marketing challenges, and its ending, in the United States in 1957 and 1958 there was near universal admiration expressed for the directorial abilities and technical expertise that the 29-year-old Kubrick exhibited in the production. Jay Carmody – the drama critic for The Evening Star in Washington, D.C. and winner of the Screen Directors Guild's \"Critic of the Year\" award for 1956 – commended Kubrick for directing a \"film with sting\" and doing so with \"chilling incisiveness\". At the New York Herald Tribune, critic William Zinsser judges the film to be \"outstanding\" in his December 26, 1957 review and describes Kubrick's direction and editing as first-rate. \"His scenes\", Zinsser observes, \"are vivid and well composed, and he knows the art of cutting – the scenes make their point, with economy and bite, and move on.\" Even at this relatively early stage in Kubrick's career directing feature films, he had already gained a reputation in the motion picture industry for commanding all aspects of his projects and being, as one colleague described him, \"'meticulous with everything, from scripting to editing'\". What is notably missing, however, from Zinsser's comments or in other contemporary reviews about the quality of the production's \"cutting\" are any allusions to Eva Kroll, the film's credited editor, and to her contributions in helping to construct or at least refine the end product.\r\nLater reactions and references to the film\r\nMore than three decades after the release of Paths of Glory, American director Robert Zemeckis paid homage to the film with the 1991 Tales from the Crypt episode \"Yellow\". The episode was an adaptation of the 1952 Shock SuspenStories story, \"Yellow!\", about a U.S. Army colonel whose son, a lieutenant, exhibits cowardice and is sentenced to face the firing squad. The father makes the son falsely believe that the firing squad will be firing blanks, so that the son will not exhibit cowardice before his execution. Zemeckis cast Kirk Douglas and his son Eric Douglas in the father and son roles.\r\nDavid Simon, creator of the critically acclaimed television series The Wire (2002—2008), has said that Paths of Glory was a key influence on the HBO crime drama. The influence of the film comes in its depiction of the tribulations of \"middle management\", in the form of Dax's unsuccessful attempt to protect his troops against the inhumane ambitions of his superiors, which in turn influenced The Wire 's depiction of various institutions acting against individuals.\r\nChicago Sun-Times critic Roger Ebert added the film to his \"Great Movies\" list on February 25, 2005. Years earlier, on a 1987 episode of the televised film review series At the Movies, critic Gene Siskel of the Chicago Tribune debated with co-host Ebert about the respective merits of several Kubrick productions. Siskel in their discussions declared Paths of Glory to be \"a near perfect film\", one that in his opinion was surpassed in overall quality only by Kubrick's dark comedy Dr. Strangelove.\r\nAn indication of the film's enduring popularity can be found on the American review-aggregation website Rotten Tomatoes. As of 2022, the film holds a 96% rating based on 74 reviews with an average rating of 9/10. The site's critical consensus reads, \"Paths of Glory is a transcendentally humane war movie from Stanley Kubrick, with impressive, protracted battle sequences and a knock-out ending\". On Metacritic, the film has a score of 90 out of 100 based on reviews from 18 critics, indicating \"universal acclaim\".\r\nPreservation and restoration\r\nIn 1992, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry. In October and November 2004 the film was shown at the London Film Festival by the British Film Institute. It was carefully remastered over a period of several years; the original film elements were found to be damaged. However, with the aid of several modern digital studios in Los Angeles the film was completely restored and remastered for modern cinema. In addition, Stanley Kubrick's widow Christiane (who also appears in the closing scene as the German singer) made a guest appearance at the start of the performance.\r\nHome media\r\nMGM released the VHS format on July 21, 1997, followed by the DVD version on June 29, 1999. The Criterion Collection's first release of the film was for a Laserdisc release in 1989. The film was released on DVD and Blu-ray by The Criterion Collection with a high-definition digital transfer on October 26, 2010. Eureka released a UK Region B Blu-Ray in 2016 as part of its Masters of Cinema line.\r\nIn 2022, Kino Lorber have detailed their upcoming 4K Blu-ray release of the film, restored from the original camera negative. This release also features an audio commentary by critic Tim Lucas. This edition was released on August 23, 2022.",
    "html": "<p>Paths of Glory is a 1957 American anti-war film co-written and directed by Stanley Kubrick, based on the novel of the same name by Humphrey Cobb. Set during World War I, the film stars Kirk Douglas as Colonel Dax, the commanding officer of French soldiers who refuse to continue a suicidal attack, after which Dax attempts to defend them against charges of cowardice in a court-martial.</p><p>The film was co-produced through Douglas's film production company, Bryna Productions, and a joint venture between Stanley Kubrick and James B. Harris, Harris-Kubrick Pictures. In 1992, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry.</p><br/><h3>Plot</h3><p>In 1916, during World War I, French General Georges Broulard asks his subordinate, General Paul Mireau, to take the Anthill, a well-defended German position. Mireau initially refuses, citing the impossibility of success. However, when Broulard mentions a potential promotion, Mireau quickly convinces himself the attack will succeed.</p><p>At the trenches, Mireau throws a private out of the regiment for showing signs of shell shock. Mireau leaves the planning of the attack to Colonel Dax, despite Dax's protests that the only result of the attack will be to weaken the French Army with heavy losses for no benefit.</p><p>Before the attack, drunken lieutenant Roget leads a night-time scouting mission, sending one of his two men ahead. Overcome by fear while waiting for the man's return, Roget lobs a grenade, accidentally killing the scout. Corporal Paris, the other soldier on the mission, confronts Roget, who denies any wrongdoing and falsifies his report to Colonel Dax.</p><p>The next morning, the attack on the Anthill is a failure. Dax leads the first wave of soldiers over the top into no man's land under heavy fire. None of the men reach the German trenches, and B Company refuses to leave their own trench after seeing that violent defeat. Mireau, enraged, orders his artillery to open fire on them to force them onto the battlefield. The artillery commander refuses to fire without written confirmation of the order. Meanwhile, Dax returns to the trenches and tries to rally B Company to join the battle, but as he climbs out of the trench, the body of a dead French soldier knocks him down.</p><p>At a meeting with Broulard and Dax, to deflect blame for the attack's failure, Mireau decides to court-martial 100 of the soldiers for cowardice. Enraged, Broulard orders Mireau to reduce the number. Mireau arrives at three, one from each company. Corporal Paris is chosen because his commanding officer Roget wishes to keep him from testifying about what happened in the scouting mission. Private Ferol is picked by his commanding officer because he is a \"social undesirable\". The last man, Private Arnaud, is chosen at random, despite having been cited for bravery twice previously.</p><p>Dax, who was a criminal defense lawyer in civilian life, volunteers to defend the men at their court-martial. The trial, however, is a farce. There is no formal written indictment, a court stenographer is not present, and the court refuses to admit evidence that would support acquittal. In his closing statement, Dax denounces the proceedings. Nonetheless, the three are sentenced to death.</p><p>The night before the execution, Dax confronts Broulard at a ball, with sworn statements by witnesses attesting to Mireau's order to shell his own trenches, in an attempt to blackmail the General Staff into sparing the three men. Broulard takes the statements but brusquely dismisses Dax.</p><p>The next morning, the three men are taken out to be shot by firing squad. Dax, suspecting Roget for his nomination of Paris, forces Roget to lead the executions. While a sobbing Ferol is blindfolded, Paris refuses Roget's offer of a blindfold and reacts ambiguously to Roget's meek apology. Arnaud, meanwhile, is so badly injured after fighting in prison that he must be carried out in a stretcher and tied to the post. All three men are executed.</p><p>Following the executions, Broulard breakfasts with the gloating Mireau. Broulard reveals he has invited Dax to attend and tells Mireau that he will be investigated for ordering to fire on his own men. Mireau storms out, protesting that he has been made a scapegoat. Broulard then blithely offers Mireau's command to Dax, assuming that Dax's attempts to stop the executions were a ploy to gain Mireau's job. Discovering that Dax was in fact sincere, Broulard rebukes him for his idealism, while the disgusted Dax calls Broulard a \"degenerate, sadistic old man\".</p><p>After the execution, some of Dax's soldiers are carousing at an inn. They become more subdued as they listen to a captive German girl sing a sentimental folk song. Dax decides to leave without informing the men that they have been ordered to return to the front.</p><br/><h3>Cast</h3><ul><li>Kirk Douglas as Colonel Dax, commanding officer, 701st Infantry Regiment</li><li>Ralph Meeker as Corporal Philippe Paris, 701st Infantry Regiment</li><li>Adolphe Menjou as Major General Georges Broulard, corps commander</li><li>George Macready as Brigadier General Paul Mireau, divisional commander</li><li>Wayne Morris as Lieutenant Roget, company commander, 701st Infantry Regiment</li><li>Richard Anderson as Major Saint-Auban, Mireau's aide de camp</li><li>Joe Turkel as Private Pierre Arnaud, 701st Infantry Regiment (credited as Joseph Turkel)</li><li>Christiane Kubrick as German singer (credited as Susanne Christian)</li><li>Jerry Hausner as café proprietor</li><li>Peter Capell as president of the court martial (and narrator)</li><li>Emile Meyer as Father Duprée</li><li>Bert Freed as Staff Sergeant Boulanger, 701st Infantry Regiment</li><li>Kem Dibbs as Private Lejeune, 701st Infantry Regiment</li><li>Timothy Carey as Private Maurice Ferol, 701st Infantry Regiment</li><li>Fred Bell as shell-shocked soldier</li><li>John Stein as Captain Rousseau, artillery battery commander</li><li>Harold Benedict as Captain Nichols, artillery liaison officer</li><li>James B. Harris as soldier in attack (uncredited)</li></ul><br/><h3>Production</h3><h4>Background</h4><p>The title of Cobb's novel came from the ninth stanza of Thomas Gray's poem \"Elegy Written in a Country Churchyard\" (1751).</p><blockquote>The boast of heraldry, the pomp of pow'r, And all that beauty, all that wealth e'er gave, Awaits alike th'inevitable hour. The paths of glory lead but to the grave.</blockquote><p>The book was a minor success when published in 1935, retelling the true-life affair of four French soldiers who were executed to set an example to the rest of the troops. The novel was adapted to the stage the same year by Sidney Howard, World War I veteran and scriptwriter of Gone with the Wind . The play was a flop on Broadway, because of its harsh anti-war scenes that alienated the audience. Nonetheless, Howard continued to believe in the relevance of the subject matter and thought it should be made into a film, writing, \"It seems to me that our motion picture industry must feel something of a sacred obligation to make the picture.\" Fulfilling Howard's \"sacred obligation\", Stanley Kubrick decided to adapt it to the screen after he remembered reading the book when he was younger. Kubrick and his partners purchased the film rights from Cobb's widow for $10,000.</p><p>Gray's stanza reflects Kubrick's feelings about war as well, and that becomes clear in the narrative of the film – a long battle for something with such an unimportant name as the \"Ant Hill\". Some of Kubrick's unrealized projects contained themes of war, as well. Kubrick once told a New York Times journalist:</p><blockquote>Man isn't a noble savage, he's an ignoble savage. He is irrational, brutal, weak, silly, unable to be objective about anything where his own interests are involved – that about sums it up. I'm interested in the brutal and violent nature of man because it's a true picture of him. And any attempt to create social institutions on a false view of the nature of man is probably doomed to failure.</blockquote><p>Kubrick's filmography shares many visual elements but thematically, the most frequent subject – even more than sexuality – is war. Dr. Strangelove (1964) presents war as a farce, its absurdity and pointlessness evoked through comedy. Fear and Desire (1953) demonstrates that the extreme stress and trauma of war can lead to the mental breakdown of soldiers to a point where they are insanely committing war crimes against a civilian population, thereby effectively abandoning the waged purpose of the war in the first place. Full Metal Jacket (1987) enters the mind of a soldier and tells the audience that they may not like what they hear. Spartacus (1960) also shows the horrors of war, much like Barry Lyndon (1975) and A Clockwork Orange (1971) with its many references to World War II and other conflicts.</p><p>Paths of Glory is based loosely on the true story of the Souain corporals affair, when four French soldiers were executed in 1915, during World War I under General Géraud Réveilhac, for failure to follow orders. The soldiers were exonerated posthumously, in 1934. The novel is about the French execution of innocent men to strengthen others' resolve to fight. The French Army did carry out military executions for cowardice, as did most of the other major participants, excluding the United States of America and Australia. The United States sentenced 24 soldiers to death for cowardice, but the sentences were never carried out. However, a significant point in the film is the practice of selecting individuals at random and executing them as a punishment for the sins of the whole group. This is similar to the Roman practice of decimation, which was rarely used by the French Army in World War I. Paths of Glory takes place in France, but Kubrick's feelings on the topic stem more from his American upbringing. When General Mireau says “show me a patriot, and I'll show you an honest man”, Colonel Dax remarks that Samuel Johnson once said: “Patriotism is the last refuge of the scoundrel”.</p><h4>Development</h4><p>Kubrick once said of his decision to make a war film: \"One of the attractions of a war or crime story is that it provides an almost unique opportunity to contrast an individual or our contemporary society with a solid framework of accepted value, which the audience becomes fully aware of, and which can be used as a counterpoint to a human, individual, emotional situation. Further, war acts as a kind of hothouse for forced, quick breeding of attitudes and feelings. Attitudes crystallise and come out into the open. Conflict is natural, when it would in a less critical situation have to be introduced almost as a contrivance, and would thus appear forced or, even worse, false.\"</p><p>Although Kubrick's previous film The Killing had failed at the box office, it had managed to land on several critical top-ten lists for the year. Dore Schary, then head of production at Metro-Goldwyn-Mayer, liked the film and hired Kubrick and Harris to develop film stories from MGM's slush pile of scripts and purchased novels. Finding nothing they liked, Kubrick remembered reading Cobb's book at the age of 14 and the \"great impact\" it had upon him and suggested it as their next project. Schary strongly doubted the commercial success of the story, which had already been turned down by every other major studio.</p><p>After Schary was fired by MGM in a major shake-up, Kubrick and Harris managed to interest Kirk Douglas in a script version that Kubrick had done with Calder Willingham. After reading the script, Kirk Douglas was impressed and managed to get an advance for a $1 million budget from United Artists to help produce the film. Of the roughly $1 million budget, more than a third was allocated to Kirk Douglas' salary. Prior to the involvement of Douglas and his Bryna Production Company, no studio had showed interest in the seemingly noncommercial subject matter and filming in black and white. MGM rejected the idea of the film based on fears that the film would be unfavourable to European distributors and audiences. United Artists agreed to back it with Douglas as the star.</p><h4>Writing</h4><p>Kubrick eventually hired Calder Willingham to work on the script of Paths of Glory (1957), of which Jim Thompson had written earlier drafts. The specific contributions by Kubrick, Thompson, and Willingham to the final script were disputed, and the matter went to arbitration with the Writers' Guild. Willingham claimed that Thompson had minimal involvement in the final script of the film, claiming responsibility for 99 percent of Paths of Glory for himself and that Thompson had not written any of the dialogue. When Thompson's draft screenplay was compared to the final film, it was clear that Thompson had written seven scenes, including the reconnaissance mission and the soldiers the night before their executions by firing squad. In the end, the Writers' Guild attributed the script in the order of Kubrick, Willingham and then Thompson.</p><p>Parts of the screenplay were taken from Cobb's work verbatim. However, Kubrick made several changes to the narrative of the novel in his adaptation, most notably his shift of focus to Colonel Dax, as opposed to Paris, Ferol and Arnaud as in the novel.</p><p>Primarily, Kubrick and Thompson had added a happy ending to the film to make the film more commercial to the general public, where the men's lives are saved from execution at the last minute by the general. However, these changes were reversed back more closely to the original novel at the demand of Kirk Douglas. On the Criterion Collection Blu-ray, James B. Harris claims to have gotten this ending past distributors by sending the entire script instead of just the reversed ending, in the knowledge that those distributors would not read through the whole script again. After viewing the film, United Artists was happy with the changes and left the ending as it is.</p><h4>Filming</h4><p>Production took place entirely in Bavaria, Germany, especially at the Schleissheim Palace near Munich. Timothy Carey was fired during production. He was reportedly extremely difficult to work with, even to the extent of faking his own kidnapping, holding up the whole production. He was replaced in the scenes remaining to be shot with a double. The film cost slightly less than $1 million and just about broke even.</p><p>Due to having three years' military training, around 600 German police officers were used as extras for soldiers. The last scenes filmed were those that take place on the battlefield. For the construction of the battlefield, Kubrick hired 5,000 square yards (0.4 hectares) of land from a local farmer. It took Kubrick a month to set up the filming of the assault, arranging props and tearing up the field to look like a war zone. For the filming of the battle sequence, the battlefield was divided into five regions where explosive charges were specifically placed. This made it easier for Kubrick to film the dying of extras as he split the extras into five groups, one for each of the regions, and each man would die in his own zone by an explosion that was near him.</p><p>An early critical test of Kubrick's obsession with control on the set came during the making of Paths of Glory. As recalled by Kirk Douglas:</p><blockquote>He made the veteran actor Adolphe Menjou do the same scene 17 times. \"That was my best reading.\" Menjou announced. \"I think we can break for lunch now.\" It was well past the usual lunch time but Kubrick said he wanted another take. Menjou went into an absolute fury. In front of Douglas and the entire crew he blasted off on what he claimed was Kubrick's dubious parentage and made several other unprintable references to Kubrick's relative greenness in the art of directing actors. Kubrick merely listened calmly and after Menjou had spluttered to an uncomplimentary conclusion said quietly: \"All right, let's try the scene once more.\" With utter docility, Menjou went back to work. \"Stanley instinctively knew what to do,\" Douglas says.</blockquote><p>The only female character in the film, the woman who sings \"The Faithful Hussar\", is portrayed by German actress Christiane Harlan (credited in the film as Susanne Christian). An affecting scene towards the end of the film shows actress Harlan briefly appearing to sing a German song, timidly evoking emotion in both the audience and the soldiers. She and Kubrick later married; the couple remained together until his death in 1999. It was on set that they originally had met.</p><h4>Kubrick's use of visual imagery and mise-en-scene</h4><p>Paths of Glory employs both camera-work and audio cues to create a sense of realism, thus making it easier for the audience to sympathise with the plight of the accused soldiers. In the beginning of the film a snare drum plays, and the music is reminiscent of war era newsreels. During the battle sequences, the camera keeps pace with the soldiers but in other ways, the shots look like old trench warfare footage from World War I. The film's choice of black and white further emphasises its similarity to the actual newsreels of the conflict.</p><p>Kubrick's vision of war was far bleaker than that of some other films of the era, which also influenced the director's choice to shoot the picture in black and white. The visuals also allow the audience to see the difference between \"life in the trenches\" and \"life in the command\". From the opulent mansion of the high-ranking officers, the audience notices wide shots from the exterior and the interior. The viewer misses nothing; every decadent piece of furniture, jewelry or bauble that the senior officers have, in sharp contrast to the trenches where the shots are much tighter. Close ups and point-of-view shots (e.g. from Colonel Dax's perspective) are cramped and tight, suffocating for the audience. Switching to a shot in front of Dax's person, e.g. a walking shot, the audience becomes much like the other soldiers accompanying him in the trenches, feeling stuck and trapped in the confined and dangerous space.</p><h4>Score and use of sounds</h4><p>The musical score by Gerald Fried makes extensive use of percussion instruments, specifically military drums.</p><p>Kubrick used sound, or the lack thereof, to build tension and suspense in the film, particularly towards the beginning when the three soldiers are given orders to check on the Anthill. This scene is in silence, with no use of diegetic/non-diegetic sound, working well to add depth and rawness. Much of what the viewer can hear throughout the film is explosions in the distance and the sound of a whistle being blown, further adding to the overall documentary style of the film. The lack of a big bold score gives no suggestion of heroism to the plot of the film, and the sounds of people dying are a common trope associated with Stanley Kubrick's films. The song towards the ending happens within the narrative. In the tavern with the French soldiers of Dax's regiment, a young woman sings a traditional German folk song of that era, \"Der treue Husar\". With Kubrick's use of mise-en-scene, the audience is able to see the German woman's performance bring the men to tears through various close-ups and angles. The troopers begin to hum and eventually sing along to the tune in an expression of their basic humanity. Paths of Glory later ends in the same way it began with the familiar snare/drum roll used in the opening, indicative of a lack of change throughout the film. Kubrick's use of sounds and song functions as a kind of narration for the audience, linking each sound to a later or earlier scene in the film.</p><br/><h3>Release</h3><p>The film had its \"world premiere\" in Munich, Germany on November 1, 1957 A month and a half before that event, on September 18, a special screening of Kubrick's production was also presented in Munich, but then to a very select audience. Frank Gordon, reporting from the Bavarian capital for the widely read New York trade paper Variety, describes the earlier presentation in the paper's September 27 issue:</p><blockquote>Munich, Sept. 18.Three hundred specially invited local VIPs, Army brass, Radio Free Europe staffers, German stage and film luminaries mingled with Kirk Douglas, Janet Leigh, Tony Curtis and Ernest Borgnine to see a \"not for review\" showing of Jim Harris' Munich-filmed \"Paths of Glory.\"...Douglas, who stars in \"Paths,\" is presently shooting his own Bryna-produced \"Vikings\" in this city's Geiselgasteig studios. \"Vikings\" co-stars Curtis, Borgnine, and Leigh....A World War I action story, will be released through United Artists. Also a Bryna production, it was directed by Stanley (\"The Killing\") Kubrick.</blockquote><p>In the United States, the picture was not officially released nationwide until January 1958, although it was shown in two major cities prior to that: in Los Angeles, California at the Fine Arts Theatre on December 20, 1957 and then five days later, on Christmas Day, in New York City at the Victoria Theatre. The American trade journal Motion Picture Daily explained at the time that \"Paths\" was being shown in those cities before the end of 1957 to ensure the film would qualify for nominations for the next Academy Award ceremonies, which were to be held on March 26, 1958.</p><h4>Box office</h4><p>Assessments vary with regard to the film's ultimate success at the box office, with some sources citing it as a modest financial success and others noting that it only managed to recoup most, if not all, of its production costs. The film did, however, earn Kubrick widespread critical acclaim, while it also generated widespread controversy, especially in Europe.</p><br/><h3>Reception and influence</h3><p>Although the film did not receive a single nomination for the Academy Awards of 1958, it was nominated for and collected several international awards. Those awards and many positive reviews from film critics further enhanced Kubrick's already growing reputation. The film was nominated for a BAFTA Award under the category Best Film but lost to The Bridge on the River Kwai. The production also received in Finland the Jussi Awards' Diploma of Merit, was nominated for a Writers' Guild of America Award in 1959, and won the prestigious Grand Prix of the Belgian Film Critics Association. Kubrick himself received on February 17, 1959 in Rome the Italian critics' Silver Ribbon, an award recognizing him as \"the best foreign director of 1958 for his movie 'Paths of Glory'.\"</p><h4>Controversy</h4><p>On its release, the film's anti-military tone was subject to severe public criticism and governmental censorship.</p><ul><li>In France, both active and retired personnel from the French military vehemently criticized the film—and its portrayal of the French Army—after it was released in Belgium. The French government placed enormous pressure on United Artists, (the European distributor) not to release the film in France. The film was eventually shown in France in 1975 when anti-war attitudes were more acceptable.</li><li>The film was withdrawn from the Berlin Film Festival to avoid straining relations with France. It was then not shown in Germany until two years after its theatrical release in the United States.</li><li>In Spain, the fascist government of Francisco Franco objected to the film. It was not shown there until 1986, 11 years after Franco's death.</li><li>The Swiss government banned any presentations of the film until 1970 on the grounds that it was \"incontestably offensive\" to France, its judicial system and its army.</li><li>The film was banned in all United States military establishments, both at home and overseas, due to its content.</li></ul><h4>Reviews in the United States, 1957–1958</h4><p>Despite the film's harsh reception in Europe by various governments, French war veterans, and media outlets, in the months after the motion picture's initial screenings in the United States, reactions to Kubrick's production featured in American newspapers and trade publications were generally positive. Nevertheless, perceived deficiencies in the film's structure and content were expressed by some of the nation's leading reviewers in 1957 and 1958.</p><h4>Issues with \"colloquial English\" dialogue</h4><p>In his December 26, 1957, review for The New York Times, Bosley Crowther credits Kubrick for creating a visually \"terrific\", highly intense picture. In particular, Crowther draws attention to the story's execution scene, which he describes as \"one of the most craftily directed and emotionally lacerating that we have ever seen.\" He does, though, also identify two \"troubling flaws\" that he saw in the film, one being within the \"realm of technique\", the other within the \"realm of significance\":</p><blockquote>We feel that Mr. Kubrick – and Mr. Douglas – have made a damaging mistake in playing it in colloquial English, with American accents and attitudes, while studiously making it look as much as possible like a document of the French Army in World War I. The illusion of reality is blown completely whenever anyone talks....As for the picture's significance, it comes to an inconclusive point. Its demonstration of injustice is like an exhibit in a bottle in a medical museum. It is grotesque, appalling, nauseating – but so framed and isolated that, when you come away, you are left with the feeling that you have been witness to nothing more than a horribly freakish incident.</blockquote><p>The absence of any spoken French or suitably accented English dialogue in a highly focused portrayal of French soldiers continued to be a point of debate in American critical analysis of Paths of Glory. Philip K. Scheuer, who wrote about films for the Los Angeles Times from the 1920s to 1967, was another reviewer who addressed the issue again in the newspaper's January 16, 1958, edition. In a follow-up discussion about the \"controversial war picture\", in a commentary subtitled \"Question of Foreign Accents Raised by 'Paths of Glory'\", Scheuer cites the style of speech used in the film and the screenplay's \"weak\" ending as two reasons he omitted the production from his \"selection of 1957's best\". Like Bosley Crowther, he found the \"linguistic\" aspects of the dialogue wholly distracting. \"In 'Paths'\", Scheuer writes, \"the actors all...employ ordinary colloquial English – much of it, I felt, delivered badly – although Adolph Menjou, being of French descent, did convey a certain quality of Frenchness,\" adding, \"The others were simply Hollywood types.\"</p><h4>The film's \"grim\" plot</h4><p>The overriding tone of the motion picture also evoked comments about the picture's marketability, namely its scant appeal to a very large segment of moviegoers. \"Grim\" is the word that frequently appears in contemporary reviews of the film, an adjective understandably applied given the story's brutal subject matter, and a word still commonly used even in complimentary assessments by critics. In its March 18, 1958 edition, the Chicago Daily Tribune summarizes the release as \"a grim, forceful story, presented in blunt, unvarnished fashion, entirely lacking in the customary cliches, deftly directed.\" Whitney Williams, a critic for Variety, previewed the film six weeks before it opened at the Fine Arts Theatre in Los Angeles. In his review, which was published on November 20, 1957, Williams anticipates limited interest as well as limited box-office revenue for the picture:</p><blockquote>\"Paths of Glory\" is a starkly realistic recital of French army politics in 1916 during World War I. While the subject is well handled and enacted in a series of outstanding characterizations, it seems dated and makes for grim screen fare. Even with the Kirk Douglas star name to spark its chances, outlook is spotty at best and will need all the hard selling United Artists, which is distributing the Bryna production, can muster.</blockquote><p>Harrison's Reports, an independent and advertisement-free film review journal in 1957, agreed with Variety's critic and in November expressed doubts too that the \"World War I melodrama\" would be successful commercially after its general release in January 1958. \"Just how it will fare at the box-office is a matter of conjecture\", Harrison's stated, characterizing its central theme as \"a grim and unpleasant study of man's inhumanity toward man\".</p><h4>Views on the screenplay's ending</h4><p>Edwin S. Schallert, a fellow critic of Philip Scheuer at the Los Angeles Times, also attended the film's first screening in Los Angeles on December 20, 1957. The following day the newspaper published Schallert's evaluation, which begins by classifying Paths of Glory as \"A minor contribution but an interesting one to the war effort on the screen\". Next he describes the drama's storyline in some detail before addressing specifically the film's final scene, which he found odd and disconnected in its presentation so soon after \"the grim gray execution\". \"Susanne Christian\", Schallert writes, \"is seen as the German girl forced to sing to a huge body of troops right at the end of the picture – a peculiar sort of payoff for the miscarriage of justice to which the whole gathering of men seems to be oblivious.\" He then concludes, \"'Paths of Glory' is a commendably sincere picture, very well told for the most part, though it does not fulfill itself in the best screen and entertainment terms. It is practically like a documentary.\"</p><p>The review in Harrison's Reports addressed the ending as well, maintaining that it was the \"picture's one weak spot\", was \"difficult to understand\", and \"leaves one with a feeling that it is inconclusive\". The journal then offered its own interpretation of the final scenes. From Harrison's perspective, as Colonel Dax is returning to his quarters after his confrontations with his superior officers, \"he notices his soldiers enjoying themselves in a cafe. It disgusts him to think that they had so quickly forgotten their executed comrades, but he compassionately realizes that life must go on.\" Whitney Williams in Variety also commented about the film's finale, noting that it \"ends so abruptly audience is left with a feeling of incompletion.\"</p><p>Other assorted critics in newspapers and trade publications viewed the film's ending and the production's significance cinematically far differently than the cited critics at the Los Angeles Times or the reviewers for Harrison's Reports and Variety. Richard Gertner of the New York-based trade paper Motion Picture Daily was one of them. He, unlike Edwin Schallert, did not see Paths of Glory as a \"minor contribution\" to the genre of wartime portrayals. Nor did he find its closing scenes \"peculiar\"; but instead, \"poignant\". After viewing what he termed \"a brilliant and arresting film\" only a few weeks after its world premiere in Munich, Gertner highly recommended it to his readers, many of whom were theater owners. He then advised those motion picture \"exhibitors\" not to misjudge the film's content in advance:</p><blockquote>Technically, this is a war picture, but any exhibitor who promotes it as just another action film will be making a serious mistake. Its exciting battle scenes and the suspense of a subsequent court martial assure it of appeal in that market. But it also has deeper and stronger elements under the surface that will attract customers who like strong drama....Just as exciting as the physical events are the ideas about war and men that Kubrick trenchantly puts across – about military discipline, the of those who carry it out and the futility of attempting to fight. These are timeless ideas – relevant to any war. Let us hasten to add, however, that this is no \"message\" picture. The theme is implicit to the story and the characters.</blockquote><p>Finally, in contrast to Philip Scheuer's omission of the production from his \"selection of 1957's best\", Gertner ends his appraisal emphatically: \"No doubt about it – 'Paths of Glory' is one of the strongest dramas of the year.\"</p><h4>Opinions regarding Kubrick's direction and editing</h4><p>In spite of issues being raised in various reviews about the film's manner of dialogue, its anticipated marketing challenges, and its ending, in the United States in 1957 and 1958 there was near universal admiration expressed for the directorial abilities and technical expertise that the 29-year-old Kubrick exhibited in the production. Jay Carmody – the drama critic for The Evening Star in Washington, D.C. and winner of the Screen Directors Guild's \"Critic of the Year\" award for 1956 – commended Kubrick for directing a \"film with sting\" and doing so with \"chilling incisiveness\". At the New York Herald Tribune, critic William Zinsser judges the film to be \"outstanding\" in his December 26, 1957 review and describes Kubrick's direction and editing as first-rate. \"His scenes\", Zinsser observes, \"are vivid and well composed, and he knows the art of cutting – the scenes make their point, with economy and bite, and move on.\" Even at this relatively early stage in Kubrick's career directing feature films, he had already gained a reputation in the motion picture industry for commanding all aspects of his projects and being, as one colleague described him, \"'meticulous with everything, from scripting to editing'\". What is notably missing, however, from Zinsser's comments or in other contemporary reviews about the quality of the production's \"cutting\" are any allusions to Eva Kroll, the film's credited editor, and to her contributions in helping to construct or at least refine the end product.</p><h4>Later reactions and references to the film</h4><p>More than three decades after the release of Paths of Glory, American director Robert Zemeckis paid homage to the film with the 1991 Tales from the Crypt episode \"Yellow\". The episode was an adaptation of the 1952 Shock SuspenStories story, \"Yellow!\", about a U.S. Army colonel whose son, a lieutenant, exhibits cowardice and is sentenced to face the firing squad. The father makes the son falsely believe that the firing squad will be firing blanks, so that the son will not exhibit cowardice before his execution. Zemeckis cast Kirk Douglas and his son Eric Douglas in the father and son roles.</p><p>David Simon, creator of the critically acclaimed television series The Wire (2002—2008), has said that Paths of Glory was a key influence on the HBO crime drama. The influence of the film comes in its depiction of the tribulations of \"middle management\", in the form of Dax's unsuccessful attempt to protect his troops against the inhumane ambitions of his superiors, which in turn influenced The Wire 's depiction of various institutions acting against individuals.</p><p>Chicago Sun-Times critic Roger Ebert added the film to his \"Great Movies\" list on February 25, 2005. Years earlier, on a 1987 episode of the televised film review series At the Movies, critic Gene Siskel of the Chicago Tribune debated with co-host Ebert about the respective merits of several Kubrick productions. Siskel in their discussions declared Paths of Glory to be \"a near perfect film\", one that in his opinion was surpassed in overall quality only by Kubrick's dark comedy Dr. Strangelove.</p><p>An indication of the film's enduring popularity can be found on the American review-aggregation website Rotten Tomatoes. As of 2022, the film holds a 96% rating based on 74 reviews with an average rating of 9/10. The site's critical consensus reads, \"Paths of Glory is a transcendentally humane war movie from Stanley Kubrick, with impressive, protracted battle sequences and a knock-out ending\". On Metacritic, the film has a score of 90 out of 100 based on reviews from 18 critics, indicating \"universal acclaim\".</p><br/><h3>Preservation and restoration</h3><p>In 1992, the film was deemed \"culturally, historically or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry. In October and November 2004 the film was shown at the London Film Festival by the British Film Institute. It was carefully remastered over a period of several years; the original film elements were found to be damaged. However, with the aid of several modern digital studios in Los Angeles the film was completely restored and remastered for modern cinema. In addition, Stanley Kubrick's widow Christiane (who also appears in the closing scene as the German singer) made a guest appearance at the start of the performance.</p><br/><h3>Home media</h3><p>MGM released the VHS format on July 21, 1997, followed by the DVD version on June 29, 1999. The Criterion Collection's first release of the film was for a Laserdisc release in 1989. The film was released on DVD and Blu-ray by The Criterion Collection with a high-definition digital transfer on October 26, 2010. Eureka released a UK Region B Blu-Ray in 2016 as part of its Masters of Cinema line.</p><p>In 2022, Kino Lorber have detailed their upcoming 4K Blu-ray release of the film, restored from the original camera negative. This release also features an audio commentary by critic Tim Lucas. This edition was released on August 23, 2022.</p><br/>"
  },
  "errorMessage": ""
}