{
  "imDbId": "tt2119532",
  "title": "Hacksaw Ridge",
  "fullTitle": "Hacksaw Ridge (2016)",
  "type": "Movie",
  "year": "2016",
  "items": [
    {
      "publisher": "The Film Stage",
      "author": "Rory O'Connor",
      "link": "",
      "rate": "83",
      "content": "While derivative and endlessly cheesy, it’s a characteristically visceral return for Gibson, and one that confirms that little has changed in the man’s singular artistic psyche."
    },
    {
      "publisher": "The Guardian",
      "author": "Andrew Pulver",
      "link": "https://www.theguardian.com/film/2016/sep/04/hacksaw-ridge-review-mel-gibson-finds-a-conscience-in-gruesome-war-story",
      "rate": "80",
      "content": "As repellent a figure as many may still find Gibson, I have to report he’s absolutely hit Hacksaw Ridge out of the park."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "David Rooney",
      "link": "https://www.hollywoodreporter.com/news/general-news/mel-gibsons-hacksaw-ridge-venice-925666/",
      "rate": "80",
      "content": "Themes of courage, patriotism, faith and unwavering adherence to personal beliefs have been a constant through Gibson's directing projects, as has a fascination with bloodshed and gore. Those qualities serve this powerful true story of heroism without violence extremely well, overcoming its occasional cliched battle-movie tropes to provide stirring drama."
    },
    {
      "publisher": "Time Out",
      "author": "Dave Calhoun",
      "link": "",
      "rate": "80",
      "content": "Overall, there aren’t many shades of gray in Hacksaw Ridge, but it’s a movie that fulfills its purpose with vigor, confidence and swagger, and those battle scenes are impossible to take your eyes off."
    },
    {
      "publisher": "Screen Daily",
      "author": "Fionnuala Halligan",
      "link": "",
      "rate": "70",
      "content": "Hacksaw Ridge returns to the themes which have professionally and personally motivated 60-year-old Gibson for his entire life; he’s never been subtle, but he’s certainly effective when it comes to delivering his heart-felt message."
    },
    {
      "publisher": "Variety",
      "author": "Owen Gleiberman",
      "link": "https://variety.com/2016/film/reviews/hacksaw-ridge-review-venice-film-review-mel-gibson-1201851851/",
      "rate": "70",
      "content": "Hacksaw Ridge is the work of a director possessed by the reality of violence as an unholy yet unavoidable truth."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/hacksaw-ridge-review/",
      "rate": "65",
      "content": "While Hacksaw Ridge is undeniably made with great care and skill, for all of its good intentions it can never refute that famous Truffaut observation that making an anti-war film is essentially impossible, since to portray something is to ennoble it. In celebrating this legendary pacifist, Gibson and company ennoble the hell out of violence."
    },
    {
      "publisher": "CineVue",
      "author": "John Bleasdale",
      "link": "",
      "rate": "60",
      "content": "There's no getting away from it, Gibson has produced another bombastic, crowd-pleasing and obviously blood-soaked movie which expertly glorifies that which its hero was against."
    },
    {
      "publisher": "The Playlist",
      "author": "Jessica Kiang",
      "link": "",
      "rate": "50",
      "content": "Along with screenwriters Robert Schenkkan and Andrew Knight, Gibson, whose lack of directorial subtlety but skill with action both reach an apex here, is not content to tell the true story of Desmond Doss and his unshakeable, courage-giving faith. He wants to convince us that his faith was, in fact, the truth."
    },
    {
      "publisher": "IndieWire",
      "author": "Ben Croll",
      "link": "https://www.indiewire.com/features/general/mel-gibsons-hacksaw-ridge-venice-film-festival-review-1201723095/",
      "rate": "50",
      "content": "A blood-soaked, bone-crunching hymn to religious devotion and faith, Hacksaw Ridge doesn’t hum Mel Gibson’s favorite themes; it shouts them."
    }
  ],
  "errorMessage": ""
}