{
  "imDbId": "tt0482571",
  "title": "The Prestige",
  "fullTitle": "The Prestige (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "83",
      "content": "The Prestige isn't art, but it reaps a lot of fun out of the question, How did they do that?"
    },
    {
      "publisher": "The New York Times",
      "author": "A.O. Scott",
      "link": "https://www.nytimes.com/2006/10/20/movies/20pres.html?ref=movies",
      "rate": "80",
      "content": "Stuffed with hard-working actors, sleek effects and stagy period details, The Prestige, directed by Christopher Nolan from a script he wrote with his brother Jonathan, is an intricate and elaborate machine designed for the simple purpose of diversion."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "80",
      "content": "The Prestige does more than focus on magicians. It is so in love with the romance, wonder and ability to fool of stage illusion that it becomes something of a magic trick in and of itself"
    },
    {
      "publisher": "Washington Post",
      "author": "Ann Hornaday",
      "link": "",
      "rate": "80",
      "content": "Bale and Jackman inject their reliable charisma into two otherwise very cold fish. Okay, I'll say it: If you see only one magic-at-the-turn-of-the-century movie this year, make it this one."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "Peter Rainer",
      "link": "https://www.csmonitor.com/2006/1020/p14s01-almo.html",
      "rate": "75",
      "content": "Has its moments."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "The result is a lopsided yet absorbing movie in which the director is less drawn to his main characters than to those on the periphery."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Phillips",
      "link": "",
      "rate": "63",
      "content": "Many, I suspect, will fall for The Prestige and its blend of one-upsmanship and science fiction. I prefer \"The Illusionist,\" the movie that got here first."
    },
    {
      "publisher": "Seattle Post-Intelligencer",
      "author": "Paula Nechak",
      "link": "",
      "rate": "58",
      "content": "If you can forgive some woeful casting and a plot that is as creakingly thin as an old staircase, you can enjoy director Christopher Nolan's The Prestige."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "50",
      "content": "Audiences might enjoy this cinematic sleight of hand, but the key characters are such single-minded, calculating individuals that the real magic would be to find any heart in this tale."
    },
    {
      "publisher": "Variety",
      "author": "Dennis Harvey",
      "link": "https://variety.com/2006/film/awards/the-prestige-2-1200512671/",
      "rate": "40",
      "content": "Clearly, director Nolan is aiming for something else. But the delight in sheer gamesmanship that marked his breakout \"Memento\" doesn't survive this project's gimmickry and aspirations toward \"Les Miserables\"-style epic passion."
    }
  ],
  "errorMessage": ""
}