{
  "imDbId": "tt0482571",
  "title": "The Prestige",
  "fullTitle": "The Prestige (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1953427",
      "warningSpoilers": false,
      "date": "29 September 2008",
      "rate": "10",
      "helpful": "179 out of 211 found this helpful.",
      "title": "Just As Intriguing The Second Time, Too!",
      "content": "I've seen this film twice now - about a year ago and then yesterday - and thoroughly enjoyed it both times, even the second time when I remembered some of those fantastic twists in the last half hour. Sometimes it's even more fun to view a film like this when you know a few things, because earlier scenes take on new meaning.It's not an easy film to totally digest, even with two viewings, because that ending has some mind-boggling revelations. Without having to resort to spoilers, let me just say the story is extremely interesting, the acting very good, the period pieces fun to view and it's a pretty clean movie so grandma can also enjoy it, too, without language or sex concerns.Basically, it's a story about obsession between two magicians in the last decade of the 19th century. They continually try to top one another and things get nasty along the way. Hugh Jackman and Christian Bale are both fun to watch in those roles, as are Michael Caine and Scarlett Johansson in supporting roles.This is one movie guaranteed to have you thinking about it when it's over!"
    },
    {
      "username": "NpMoviez",
      "userUrl": "https://www.imdb.com/user/ur69508929",
      "reviewLink": "https://www.imdb.com/review/rw4183972",
      "warningSpoilers": false,
      "date": "30 May 2018",
      "rate": "10",
      "helpful": "289 out of 318 found this helpful.",
      "title": "Fantastic.",
      "content": "I won't say it's an underrated movie, but it has somewhat been buried by the legacy of other \"popular\" Nolan movies. With this movie, Nolan shows his ability to make a metacinematic film, yet again. This is obviously my most favorite Christopher Nolan movie, along with \"Memento\" (2000). Just like you can relate the theme of memories and interpretations shown in the story of \"Memento\" with the actual experience we had while watching the movie, we can relate the three acts of a magic trick narrated within the story with the movie itself. As the movie says, the final reveal in a magic trick is the most thrilling experience. So is that of this movie. In fact, the whole movie can be weirdly related to a magic trick. It is one of those movies which feel quite ordinary until a major twist makes it great. Speaking of the cinematic experience, it is a typical Nolan styled movie. It has broken timelines to enhance the storytelling, but unlike in most of his movies these are done more artistically than just for the thrilling reveal. This is perhaps the movie where Nolan's broken timelines have enhanced the storytelling in the most brilliant way. Like in most of movies, he dwells in a single theme - here it's obsession. The obsession of Robert Angier is what drives the plot of the movie, and is well established and doesn't even feel forced. There is a protagonist, and an antagonist in this movie. The character development is done so smoothly that we see the protagonist become an antagonist, while the antagonist remains somewhat the same. Though we don't get a full \"interchange\" between the antagonist and the protagonist, as the movie progresses, the protagonist feels more \"wrong\" than the antagonist. That's quite a difficult thing that it pulls off. Alfred Bordon is one of the most \"complex\" characters I have ever seen. He feels like some kind of a prick throughout the movie, and there are a lot of scenes to establish it for the viewers. That's until we get to know his character in the third act. It doesn't make him right for his wrong doings, but he gets the respect for his dedication as a magician. The whole Tesla plotline might feel like a convenient plot device, but Tesla is a scientist who is rumoured to travel through time. So, that is quite justifiable. Hugh Jackman has given a solid performance. This must go down as his best performances with those of \"Prisoners\" (2013) and \"Logan\" (2017). He is completely out of his public persona of Wolverine. He is the best possible choice for Wolverine imo, but reminder of Wolverine every time he appears on screen isn't so adorable. He didn't remind me of Wolverine at all, in this movie. But, the major highlight of the movie would be Christian Bale. He has given a terrific performance. You don't even get a hint at the complexity of the character he is portraying. It's after the reveal and in fact, in the second viewing that you start noticing the actual stuffs and the actual interpretations a particular scene is to be given. All in all, it's a fantastic movie. The way obsession play out to be the main theme, the way broken timelines are used for storytelling and the way the final twist is revealed - simply excellent. It gets a special \"10/10\" and an \"A+\"."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2123478",
      "warningSpoilers": true,
      "date": "7 September 2009",
      "rate": "10",
      "helpful": "264 out of 299 found this helpful.",
      "title": "Are you watching closely?",
      "content": "The Prestige, adapted from an award winning novel of the same name by Christopher Priest, is an intricate tale of passion, intrigue, deceit and obsession about two illusionists, whose morbid covetousness for absolute supremacy in their profession engenders a fierce rivalry that turns internecine and ultimately consumes them. Alfred Borden (Christian Bale) and Robert Angier (Hugh Jackman) at the start of their careers are highly ambitious young men assisting an elderly illusionist named Milton. Borden's incessant longing for innovation leads to the accidental death of Angier's wife. Borden marries Sarah and his apparent happiness further aggravates the sense of revulsion in Angier's heart. Angier's vindictive intervention during a bullet catch trick causes Borden to lose his two fingers. Though these events sowed the seeds of implacable hatred, but it is the unremitting yearning of their perpetually insatiable egos to outperform each other that eventually drives them to perdition.Angier starts performing with the sobriquet \"The Great Danton\" with Cutter (Michael Caine) as his illusion engineer, while Borden with the stage name \"The Professor\" with Fellon as his engineer. Angier is an adept showman, but lacks the technical prowess. On the contrary, Borden is highly skillful, but lacks the taste for grandeur and showmanship. Each regards the other as his only obstacle (owing to their bitterly intertwined past) and this starts a series of events in which each tries to stymie the other by any means possible (sabotage, abduction, incrimination and even killings). Awed by the apparent genuineness of Borden's version of \"The Transported Man\" and inveigled by Borden's deliberate misdirection, Angier travels miles and spends a fortune to approach an ingenious scientist named Nikola Tesla (David Bowie) in order to cajole him into building a machine for him (a machine that could help him outperform Borden). Nikola Tesla is an apostle of Alternating Current (and rightly thinks it to be superior to Direct Current), and is under immense pressure imparted by Thomas Edison (ruthless advocator of Direct Current) and his men, who are after Tesla. As Edison's men close in on him, Tesla runs out of time and hence funds for his research and is forced to oblige Angier, who is his very last client. Tesla flees the scene shortly after fulfilling his promise to Angier (not without leaving him a strong note of caution against the use of his invention), whose ever increasing skepticism in Tesla is placated by the efficacy of his masterful invention. Using Tesla's machine, Angier introduces his own version of \"The Transported Man\", which becomes an instant success, but in lieu of a terrible self-sacrifice (that Angier has to make every night while performing). As the story culminates, the viewer is startled with many revelations including the mental and physical torments that Borden's complex character undergoes owing to his total devotion towards his art.The success of an act of illusion solely depends upon the deftness with which its three parts viz. the Pledge, the Turn, and the Prestige are performed. Similarly, for a movie to be a success, its three main aspects i.e. screenplay, direction, and acting are ought to be top-notch. Christopher Nolan incredibly manages to strike all the right cords with The Prestige. His riveting maneuvers coupled with his ingenious auteur skills aggrandize the brilliance of the movie ten-fold. Nolan succeeds in having a dream assemblage of actors with almost everyone giving a memorable performance. Christian Bale and Hugh Jackman are superb in their lead roles. Michael Caine shines in his low-key portrayal of Cutter, an ordinary part made to appear extraordinary through sheer brilliance; vintage Caine. David Bowie as Nikola Tesla and Andy Serkis (Gollum of LOTR) as Alley (Tesla's assistant) are stupendous in their cameos. Scarlet Johansson also manages to give a scintillating portrayal as Borden's paramour, Olivia.The movie is a roller-coaster of a ride with intriguingly intertwined subplots and masterful time switching, which makes it one of a kind and an ultimate masterpiece. The uncanny feat of Nolan to manifest a motion picture, which forays the realms of Mystery, Thrill, Sci-fi and Fantasy, is truly exemplary and makes the movie a contemporary classic. The movie is a tapestry of twists and turns, which evinces its overwhelming potential to bewitch the masses and satiate even the most esoteric viewers. The questions that it incessantly asks of the viewers can only be answered after repetitive viewings, with each viewing seeking utmost attention of the viewer. The only question that I would ask of the viewer is: \"Are you watching closely?\" A must watch for anyone, who has nothing against giving his mind a rigorous exercise and his body an adrenaline rush. 10/10"
    },
    {
      "username": "DICK STEEL",
      "userUrl": "https://www.imdb.com/user/ur0317399",
      "reviewLink": "https://www.imdb.com/review/rw1501763",
      "warningSpoilers": false,
      "date": "20 October 2006",
      "rate": "10",
      "helpful": "604 out of 790 found this helpful.",
      "title": "A Nutshell Review: The Prestige",
      "content": "I've said it before, but I'll say it again. Christopher Nolan can do no wrong. Teaming up again with his Batman Begins cast of Christian Bale and Michael Caine, and joined with the Scoop team consisting of X-Men's Wolverinie Hugh Jackman and Scarlett Johansson, the stellar (eye candy) cast already set tongues wagging as to whether they'll be able to live up to the hype of Nolan's long awaited movie directly challenging the other picture about Victorian magicians, The Illusionist. The Prestige is the third act of any magic trick, with the first and second acts being the Pledge and the Turn. And this movie lives up to its namesake to a T. The way the movie plays out, it's like a huge magic trick, with the audience waiting to see how it unfolds, getting the suspicion on how it's done, but yet sitting through it thorough engaged to discover how everything will be revealed and resolved. It tells the story of how two magicians, fellow apprentices turned unfortunate rivals, plod down the slow path of jealous obsession, revenge, and the deliberate attempts to go at lengths to steal each other's ideas, to go one up against the other, a fight in romance, life and the long held passionate drive to discredit each other. There are perfect explanations of the value of secrets, and how secrets can sometimes be used as tools for deceit. What I thought was valuable in the movie was the reinforcement of the notion of how \"magic\" actually worked. Besides the better understanding of the common body of scientific knowledge, things like having pretty assistants to distract, and having planted staff amongst the audience, somehow made me a sceptic to tricks and illusions, and try harder to spot at which stage had things undergone a sleight of hand. More importantly, it introduced me to the notion and importance of a loyal engineer behind the scenes who designs elaborate contraptions solely for the magician's use, and how having disloyal staff can indeed be detrimental to any leaks of secrets. And Michael Caine took on this engineering role as Cutter, responsible for assisting Rupert Angier (Hugh Jackman) with loyalty and conviction that they could, as a team, beat Christian Bale's Alfred Borden. I thought the cast in general were superb, with Christian Bale leading the charge. Hugh Jackman too showed that he could play a dark character, as the two leads tackled their characters' theme of sacrifice, arrogance, and ultimately redemption, especially for Rupert Angier. I thought he did what he did towards the end was a kind of penance to what happened in the beginning, hoping to kill two birds with a single stone, to exact the sweetest revenge he could possibly muster. What also was intriguing about the two lead characters was that there is no right or wrong, no hero or villain. It's always a shade of grey in what they do, and for Alfred Borden, I felt it's more for survival and the provision for family, which is a strong subplot running through the film. I just have to mention though, that Scarlett Johansson being Esquire's Sexiest Woman Alive, gets to play a flower vase role here as a magician's assistant, though her role as the pawn between the rivals added a little gravitas. The atmosphere was set up great, and so were the costumes and sets. The soundtrack was hauntingly mesmerizing, capturing the look and mood appropriately. Look out too for David Bowie's appearance as a Serbian scientist! I was floored by the deftness of how Nolan weaved and juxtaposed the non linear narrative so flawlessly. While the usual techniques is to use placeholders, or flashback sequences, colours etc, here, time is so fluid, but yet the audience will know precisely which era they're in, without being explicitly told, or working too much of the noodle. You just know, and it's just that feeling of being totally transparent with time. Even though the movie clocked in at slightly more than 2 hours, you don't feel its length at all. At the end of the movie, one quote popped into mind: Misdirection - what the eyes see and the ears hear, the mind believes. Quite apt to describe how things work out during the movie, or to describe in general, Nolan 's films so far. That added richness to lift the movie to a superior plane. Do yourself a favour, if there's one movie you absolutely must watch this week, then Prestige must be your natural choice. It's smart in delivery and slick in presentation. There is none other. P.S. Is it just me, or are notebooks a common feature in Nolan's movies?"
    },
    {
      "username": "iohefy-2",
      "userUrl": "https://www.imdb.com/user/ur0741152",
      "reviewLink": "https://www.imdb.com/review/rw1498769",
      "warningSpoilers": false,
      "date": "16 October 2006",
      "rate": "9",
      "helpful": "591 out of 768 found this helpful.",
      "title": "Outstanding acting performances worth price of admission",
      "content": "I went to see a critics preview of The Prestige this afternoon and to my surprise I found the film to be one of the best I have seen all year so far, and that writers can come up with an excellent script it they would only try a little harder. The acting performances by Hugh Jackman, Christian Bale and Michael Caine were the best I have see in a long while. The only objection I had to the film was that it was a little long, but once you leave the theater you will discuss the film and it many twists and turns. My wife and myself discussed it all the way home from the movie theater. This is a winner and should be up for some academy award statues, and my recommendation is go see this as soon as you can, you will not be disappointed."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw1508562",
      "warningSpoilers": false,
      "date": "28 October 2006",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Give This Film Time to Sink In...",
      "content": "Leaving the theater, I thought the film was just okay. An hour later, I thought it was pretty clever. And now, the next day, I think it was amazing. Why the change? It took that long for most or all of the subtle hints to sink in and the real twists to be discovered. The film doesn't end when you leave, it begins.The story is the tale of two magicians in a bitter rivalry, always trying to do a better trick than the other and trying to sabotage the other's success. At least, that's what you think the story is until you finally see \"the prestige\".I can't discuss much of this film because giving almost anything at all away would ruin some of the fun. But a few notes: Christian Bale, as always is awesome. An incredible actor with a wide range and screen appeal. Christopher Nolan works well with him (see \"Batman Begins\") and I hope they continue this Burton-Depp relationship they have. I foresee only greatness.Hugh Jackman is also spectacular, probably giving the most diverse performance in the film, easily the most demanding. And he does this convincingly.Scarlett Johannson is Scarlett Johannson... if you've liked her before, you should like her here (though her role never really gets the full story it needs). And David Bowie... wow, he is so much better than \"Labrynth\" would have you believe.The visuals are stunning, but the real credit goes to the makeup department, who deserve an Oscar for this picture. Outside of horror films where extensive makeup is often required, this film probably does more to change the actors' appearances than any other film I've ever seen. And I was going along with the ride the whole time.If you see one film from 2006, see \"The Departed\". But if you see two, \"The Prestige\" better be on your list."
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw3245774",
      "warningSpoilers": true,
      "date": "26 May 2015",
      "rate": "8",
      "helpful": "20 out of 23 found this helpful.",
      "title": "So glad this movie did not stay an illusion...",
      "content": "In the filmmakers' minds. Instead, it became one of the finest films of the year 2006. \"The Prestige\" is a perfect example of what a movie should be like if it does not rely on you liking and cheering for the central characters. Neither Angier (Jackman), nor Borden (Bale) are likable characters at all. And yet you are completely under their spell as this film goes on. This may be a bit of a subjective take as I quite like Hugh Jackman and find Bale a joy to watch most of the time as well. And Johansson and Hall are among my favorite actresses as well. But it's not only the cast that makes it so much worth watching. It's also the visual side. Art direction, set decoration, cinematography and costumes are top-notch and even the rare special effects are pretty nice. The film managed two Academy Award nominations for its visual side, both of them very deserved and I actually would not have minded if it had won one of these over \"Pan's Labyrinth\".The film's director is Christopher Nolan and he also wrote the movie together with his brother after the first Batman film. He also cast some of the actors from his superhero trilogy, including Bale and Caine, the only one who didn't do that much for me. Now back to Nolan's script: I think this is probably the heart and soul of the film. Such love to detail, so much suspense, so many surprises and all these great scenes like the doppelgänger parts or the suicide of Hall's character in the room with all the birds, which were actually the way how he met her when he talked to her nephew. Very very smart screenplay. All in all, the best thing about it, however, is how he wrote the two protagonists and their egos constantly clashing with each other, maybe because they weren't so different after all. Of course, Jackman and Bale give great performances too and that is why it worked so well, but still you cannot appreciate Nolan's effort enough. And his brother's. Lets not forget about him. People say, Nolan has problems when it comes to directing and writing realistic female characters, but I disagree. He managed in this film without a doubt and he also managed in others. When the two magicians fight each other or I should probably say get their hands dirty, literally everybody else in this film is constantly affected: their women, their assistants, their set creators...The accidental death of one character's wife sets off a deadly spiral which results in murder in the end. Or does it really? Nothing in this film is what it seems and we do not only get one major plot twist in the end, but two. Apart from that, the progress in terms of inventions and electricity also brings a completely new dimension of progress for the profession of a magician, actually for life in general, for everybody. So, we also get some interesting references on Nikola Tesla and Thomas Edison. I also liked how Nolan revealed some tricks, but not all of them, so the movie itself stays a bit of a mystery still. This was the second time I watched this film and it was as good as the first. I highly recommend watching the almost 10-year-old, 120 minute-long \"The Prestige\". It's possibly my favorite Christopher Nolan movie."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1504670",
      "warningSpoilers": true,
      "date": "23 October 2006",
      "rate": "10",
      "helpful": "32 out of 39 found this helpful.",
      "title": "A Film with Intellect",
      "content": "I thought this was an amazing film. It takes a period before the advent of the illusionist pyrotechnics of modern times and shows us the magic. Not only does it have the magic working for it, it has a great story of revenge, hatred, one-upsmanship, genius, you name it. The story teaches us about illusion which is a much more accurate term for what we see. I will never look at David Copperfield the same way again. There is incredible scenic effluence. The acting is impeccable and the direction and cinematography is unrivaled. For once a film that lives up to its hype. Using David Bowie as Tesla is marvelous. I've always thought that he should have had a much greater career as an actor than he has realized. Michael Caine is the voice of reason, but his voice is seldom listened to. Revenge is one of the oldest motives and it poisons one of the characters. Stay with this one; then see it again. It is a masterpiece."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2922039",
      "warningSpoilers": true,
      "date": "14 December 2013",
      "rate": "9",
      "helpful": "25 out of 30 found this helpful.",
      "title": "Obsession and Revenge",
      "content": "Around the turn of the century, Robert Angier (Hugh Jackman), his wife Julia McCullough (Piper Perabo), and Alfred Borden (Christian Bale) are assistants to the magician Cutter (Michael Caine). Due to hubris, Julia is killed in one of the tricks. It sets off a combative obsessive competition between Angier and Borden that ends in their eventual destruction. Rebecca Hall and Scarlett Johansson play other love interests.This is a dense complicated plot. If you figured it out before the ending, then you're much smarter than me. Christopher Nolan and his brother have woven an intrigue story of obsession and revenge. The twists will leave you stunned. The reveals of the tricks are jaw dropping. It doesn't get more mind bending than this one.In a way, the flashforwards are not that necessary. It throws a complicated story into more confusion. It's too much. The movie may be better to be more straight forward. Personally, I like the challenge."
    },
    {
      "username": "Flagrant-Baronessa",
      "userUrl": "https://www.imdb.com/user/ur5513934",
      "reviewLink": "https://www.imdb.com/review/rw1560476",
      "warningSpoilers": false,
      "date": "27 December 2006",
      "rate": "9",
      "helpful": "231 out of 302 found this helpful.",
      "title": "Webby meshwork of magic and mystery",
      "content": "Director Christopher Nolan has a proclivity for warped narratives (Memento) and in The Prestige he serves up a deliciously twisty tale, puffed full of magic theatricality and inventive cinematic devices. With his remarkably sleight-of-hand direction, he spins the tale of two rivaling magicians in Victorian-era London, creating a cerebrally stimulating 2 hour long mise-en-scene in which the audience is literally left guessing and gasping at its rare uniqueness through magic acts and bitter behind-the-stage intrigue.The final pay-off of any magic act  the prestige  is of the essence, and preluding it is the pledge, followed by the turn. Together these three key components are slotted in unique positions in 'The Prestige's arrestingly clever script but it is the titular act that propels the film. The pledge introduces our main characters: magicians Alfred Borden (Christian Bale) and Robert Angier (Hugh Jackman) in turn-of-the-century London and we see how their friendship abruptly becomes a fully-fledged rivalry and hostility with a magic act gone horribly wrong in front of an audience. There is a death, and it lights the fuse of an onslaught of reel revelations and the one-upmanship that will ensue between the two competitors. 'The turn' comes to offers twists by the bucketload in the form of love-interests, and technologically marvelous magic acts. I gasped, I scratched my head, I watched on in awe. No description will do it justice.The prestige as the end note to the show  in which, for example, the disappearer reappears to the deafening applause of the crowd  is so meticulously composed in the film through foreshadowing and fractured chronology that rigorously intersects, intertwines, intercuts, fast-forwards, rewinds and replays key parts of the story that the whole spectacle floors you. Christopher Nolan and his brother Jonathan have worked out a template script that is more twisty and turny than a mountain road and for that reason I am very reluctant to spoil even the slightest detail of the story of 'The Prestige' of all of its acts, in fact. If you are shaking your head thinking a clever twist ending does not make the movie (and I agree), know that this is not a \"gotcha\"-kind of Shyamalan trick where you want to stop the film, rewind it and watch it meticulous foreshadowing up to the cheap pay-off, but a tightly-written ever-shifting hall of mirrors with so many intrinsic twists that on your way home you will still be scratching you head and searching for clues.Our two magicians are perfectly-cast with Hugh Jackman capturing the showy, slick, ambition-driven nature of his character Angier in contrast to Bale's technique-driven purist who may be well on his way to perfecting the craft, but lacks the 'Abracadabra' entertainment value. I had always crowned the latter the more capable actor of the two, but the fact is that Jackman performs just as well in the film. Having said that, Borden has more layers to his complex, contradictory (keyword) persona than the flashy, greedy Angier which perhaps begs more weight from the actor behind the role, shifting more demand on Christian Bale. The sad fact of it is that neither of these two men are likable characters and elicit nothing more than temporary sympathy. However, the secrecy with which the intricate story approaches them makes it impossible for the viewer to slot them in protagonist vs. antagonist positions, and indeed they are given almost the exact same screen-time and voice-over narration throughout, a subtle and brilliant accolade of Nolan's.To further evaluate the cast of The Prestige, David Bowie and Michael Caine undoubtedly merit a great deal of praise for supporting the two moody, unlikeable leading men. It is a crying shame then that Scarlett Johansson  always an incapable actress except for the rare occasions in which she plays a sultry American vixen (Match Point)  performs so badly in the role of Olivia Wenscombe, a magic assistant pending between Borden and Angier. Here she is actually given a very good and important character who is not necessarily bad like the rest, but botches her interpretation by giving an unspeakably hammy London accent. Nolan picks up on her shortcomings as an actress, and resorts to boob-shots en masse. This he should be fully entitled to do as a director, for a beautiful diversion will always camouflage the process and any of its potential missteps, as Michael Caine's character puts forward.With Scarlett as a pleasurable paint-job, twists by the bucket-load and flashy magic tricks as windowdressing to a solid mystery film, there is little or no need to delve deeper into the psyches of its characters to keep our attention. Yet this is done, and superbly so, by Christopher Nolan. 'Antihero' gets a whole new spin to it in The Prestige with two friends-turned-rivals so bitterly poised on the brink of obsession of outshining the other that succeeding with the ultimate 'prestige' of magic followed by applause is enough to drive them to murder, bankruptcy, deceit and sabotage. Borden simply wants to be better on a technical level, while Angier wants the public's recognition and wide-spread fame. Their ambition is in effect largely the same: create the definitive deceptive illusion and do it through any means necessary.'The Prestige' is a majestic film that nevertheless spans across too long a running time. Condensation would have done wonders and surely bumped it up a notch, as would underpinning some humour at one or two points (it is VERY gloomy), but it truly is a great cinematic achievement and a shoe-in for my top 10 of 1006, and easily the most inventive film I have seen in years. I am eagerly anticipated director Christopher Nolan's next sleight-of-hand direction, and it looks like the closest is The Dark Knight (2008).9 out of 10"
    },
    {
      "username": "Surecure",
      "userUrl": "https://www.imdb.com/user/ur2637155",
      "reviewLink": "https://www.imdb.com/review/rw1502381",
      "warningSpoilers": false,
      "date": "21 October 2006",
      "rate": "8",
      "helpful": "408 out of 516 found this helpful.",
      "title": "Storytelling at its best!",
      "content": "The Prestige is a masterful exercise in storytelling with superb direction and powerful performances by a grand ensemble cast. From set and production design to cinematography, from script to presentation, Christopher Nolan has once again demonstrated why he is one of the film world's brightest up and coming directors. The Prestige only helps solidify his standing as one of the landmark directors of his generation.Told in a narrative that jumps between various points along its time line, playing out like a magic act itself, the story is that of two magicians on the rise in their careers. The first -- played by Christian Bale -- is an expert in understanding the fundamentals of any trick, but lacks showmanship. The second -- played by Hugh Jackman -- is a master showman who is more entertaining than technical. A tragic series of events pits the two performers against each other in a battle of wits that spirals further and further out of control, consuming both of them and everything and everyone they care about.With a story that requires actors with a great deal of emotive range, Nolan has assembled what could be described as a dream cast. Both Bale and Jackman suit their respective roles perfectly, and pitting these two performers against each other was a stroke of casting genius. Michael Caine takes what could have been a forgettable role by any lesser actor and elevates it with his demanding screen presence. Probably the most surprising performance comes from David Bowie whose unforgettable turn as master physicist Nikola Tesla absolutely shines. Add Andy Serkis to the mix, and what is assembled is a group of performers who know how to fully engage the audience.The Prestige is hard to pigeonhole into any specific genre as it walks the fine line between mystery, drama, suspense and fantasy. In that, the story becomes a never-ending stream of wonder for the mind: one can never tell exactly where the story is going to lead next, becoming more and more as time goes on. This gives Christopher Nolan ample opportunity to play. And play he does. With narration by several characters, each adding their own viewpoint to the events, and with a direction that moves between time to mystify and distract, the end result is a climax that itself is a series of puzzles that each unravel beautifully.The only major criticisms that can be leveled at the Prestige are a confusing play with the seasons during Tesla's introduction (winter suddenly becomes spring/summer and back again) and a strange choice of music for the closing credits (a pop song at the end of a film such as this seems tacky). However, neither is significant enough of a problem to warrant any need to avoid the film at all.In the end, the Prestige is a fantastic display of what can be accomplished when you bring together superior talent. It is certainly worth the price of admission and as good as any magic show you are to come across."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6604787",
      "warningSpoilers": false,
      "date": "17 February 2021",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "The Prestige",
      "content": "Great movie and best movie I've seen directed by Christopher Nolan. The story of the movie was great and I did not expect the end. Most of the film's characters were excellent, and Tesla's appearance in the film was excellent. The acting was excellent, especially from Hugh Jackman and Christian Bale who were dazzling in the film, the film embodies the period of the end of the nineteenth century, a great film."
    },
    {
      "username": "wordmonkey",
      "userUrl": "https://www.imdb.com/user/ur1364757",
      "reviewLink": "https://www.imdb.com/review/rw1493095",
      "warningSpoilers": true,
      "date": "5 October 2006",
      "rate": "8",
      "helpful": "758 out of 907 found this helpful.",
      "title": "A Stylish, Uniquely Twisted Period Piece",
      "content": "What \"The Prestige\" does very well is recreate a period of show business history near the turn of the century in which competition between magicians was serious and intense. The workings of the complicated illusions are gorgeously brought to life via smartly detailed apparatus that replicate the actual mechanics of Victorian legerdemain. Much of the film rings very true, such as the all-consuming obsessions of the lead characters to be the best and outdo all others. It's an easy step to accept that such unwavering determination spills over into deadly territory, as rival magicians suave Rupert Angier (a riveting performance by Hugh Jackman) and audacious Alfred Borden (Christian Bale effortlessly playing a brooding lower-class Brit) each seek to wreak continuing revenge upon the other.The story, though adapted from a novel, feels like a perfect fit for director Nolan's sensibilities, as the machinations of the two men become increasingly convoluted during a back-and-forth tug of wits that keeps you guessing in the style of Nolan's \"Memento.\" As the game grows increasingly deadly, and threatens to consume all they love, the film becomes a fascinating study in single-mindedness.The work is epic in sweep, beautifully filmed, and strongly acted. The only odd note in casting is David Bowie as Nikola Tesla (he looks nothing like the actual Tesla, if you care about these sort of things, and his appearance calls attention to itself as superstar casting often does), but Mr. Bowie holds his own. Solid performances are all around, with Michael Caine adding dignity and depth as the old master, Scarlett Johanssen as the as the lovely stage assistant who becomes the third point in a twisted love triangle, and even Andy Serkis (Gollum!) in a memorable supporting role.The introduction of Tesla adds yet another twist, as the film shifts from real-but-possible stage illusion to steam-punkish sci-fi. This transition is a hard note to pull off, since the beginning of the film doesn't quite suggest such a direction, but if you're willing to let Nolan lead you on the journey into increasingly fantastic realms, the narrative rewards you with thought-provoking moral and dramatic exploration of the issues raised.A truly entertaining movie, and an original, unusual, dark ride -- well worth seeing in a theater for its grand scope and vision."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1998115",
      "warningSpoilers": false,
      "date": "29 December 2008",
      "rate": "8",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Batman and Alfred (outside Gotham) meet Wolverine",
      "content": "In between the Batman movies, Christopher Nolan cast Christian Bale and Michael Caine in \"The Prestige\". It tells the story of magicians Alfred Borden (Bale) and Robert Angier (Hugh Jackman). Initially partners, they had a falling out and became rivals. From there the movie becomes a battle of wits, showing how the men have no aim except to destroy the other. Caine plays John Cutter, the state engineer who works for Angier.I notice similarities between this movie and some of Nolan's others. There's the non-linear plot, like \"Memento\"; one-upmanship, like \"Insomnia\"; the question of morality, like in \"The Dark Knight\". But what impressed me more than anything was all the stuff about magic tricks, how the characters use the tricks against each other, and how they both use Olivia Wenscombe (Scarlett Johansson). Angier's and Borden's rivalry mirrors Nikola Tesla's (David Bowie) rivalry with Thomas Edison.All in all, I recommend this movie. It's both a look into the world of magic tricks, and also the dangers of obsession with revenge. Also starring Andy Serkis (Gollum in the LOTR movies) and Ricky Jay (a real-life magician).PS: other 2006 movies dealing with magic tricks are \"The Illusionist\" and \"Scoop\" (also starring Hugh Jackman and Scarlett Johansson)."
    },
    {
      "username": "InigoMontoya1389",
      "userUrl": "https://www.imdb.com/user/ur82906913",
      "reviewLink": "https://www.imdb.com/review/rw4924344",
      "warningSpoilers": true,
      "date": "9 June 2019",
      "rate": "10",
      "helpful": "252 out of 270 found this helpful.",
      "title": "Borden (Tesla) vs Angier (Edison)",
      "content": "Great movie with Great actors writers and twists.Something that i didn't see anybody said about it that rivalry between two magicians is reference to Tesla and Edison's rivalry. In the beginning they worked together, then became opponents. I think Borden is Tesla cause he always was more talented than Angier (Edison) who stole Borden's idea.Surely on of the best movies in this century, be sure to watch it more than one time."
    },
    {
      "username": "UrbanFilmCritic",
      "userUrl": "https://www.imdb.com/user/ur1429740",
      "reviewLink": "https://www.imdb.com/review/rw1501462",
      "warningSpoilers": false,
      "date": "19 October 2006",
      "rate": "",
      "helpful": "610 out of 818 found this helpful.",
      "title": "One of the best movies EVER",
      "content": "What makes this movie so incredible is that while it is indeed a movie about magicians (or illusionists) it is also a complex character study about how self destructive obsessions are with a sideline love story and a sci-fi twist. A unique plot with an amazing cast--any of whom could believably garner an Oscar nomination. Christian Bale was amazing in one of his rare cockney performances. We already know from Kate and Leopold how well Hugh Jackman plays a distinguished English gent. He's absolutely priceless. Is there any point in discussing Sir Michael Caine? He brings polish to the movie. This is the kind of flick that you can discuss for weeks after. The plot is so detailed and complete and open to interpretation. My friend and I have been discussing various nuances of this film for the past 3 weeks. It definitely stays with you."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw1987559",
      "warningSpoilers": false,
      "date": "9 December 2008",
      "rate": "8",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Imaginative and intriguing crash of wits between two famous magicians",
      "content": "This enjoyable and fresh story about intense rivalry among magicians is set in turn-of-the last century, London.Robert Angier(Hugh Jackman) his wife Julie McCullough(Piper Perabo) and Alfred Borden(admirable Christian Bale) are friends and magician's assistants. Then Julie accidentally deceases during a sideshow , Robert accuses Alfred for her killing . A new assistant named Olivia(Scarlett Johansson) helps Robert and he falls in love with her, though later she fell in love with another man. The magicians use their powers to combat among them. Both become prestigious magicians and get mutual envy. Magician Robert sees the Borden's transportation show and he becomes obsessed with his magic trick. They battle each other for their magic tricks and Robert attempts disclose the secret about disappearance from his contender with fateful results.This splendid movie is stunning in many aspects and blends appropriately various genres: the lush romantic period piece during nineteenth century Victorian Era, mystery thriller and fantasy.The picture gets it all : suspense, mystery drama, star crossed lovers,plot twists, murders,tragedy and supernatural illusions . Featuring an excellent casting, as main actors, Jackman, Bale, Johansson as eclectic secondaries, Caine,David Bowie,Andie Serkis and Rebecca Hall.Luxurious attention to period detail in brilliant costumes and spectacular production design . Beautifully and mesmerizing cinematography by Wally Pfister. Intriguing and evocative musical score by David Julyan. The motion picture is perfectly directed by innovator director Christopher Nolan, author of various masterpieces: ¨ Insomnia,Memento,Batman begins, Dark night¨. At the same time was made another film(2006)with similar theme titled 'The illusionist'by Neal Burger with Edward Norton, Paul Giamatti and Jessica Biel which also achieved much success. Rating : Above average, it was throughly amusing and exciting, and no as predictable as you would think. The film results to be a complete pleasure to watch these actors at this work,it's highly recommended and keep you guessing until final."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw4177618",
      "warningSpoilers": false,
      "date": "25 May 2018",
      "rate": "7",
      "helpful": "11 out of 13 found this helpful.",
      "title": "\"The Prestige\" starts well but cheats with its own premise...",
      "content": "There are many kinds of magic: wizardry à la 'Harry Potter', illusions or hallucinations, or entertaining shows: mediums, rabbits in top-hats, women sawed in half, bag-content guessing, magic cards etc. Speaking of cards, Christopher Nolan's \"Prestige\", made between two 'Batman' movies, lays its cards at the first voice-over monologue where we immediately recognize Michael Caine's smooth voice. It's about the third kind of magic and provides the three structural rules of an act: it starts with the Pledge: you show something normal then the Turn, you make it do something extraordinary... but there's an element of expectation and the higher your reputation goes, the more sophisticated the public. In fact, there's got to be something unpredictable, so it all comes down to the Prestige, the trick no one sees coming and will earn magicians applauses and guess what? prestige.Then, the least you can expect from the film is to follow these three rules even in the loosest possible way if it means wowing you with a spectacular surprise. And given that it's a Nolan film about the deadly art of illusion, much more opening with the killing of a magician, the imprisonment of his rival whom everything accuses, your twist-radar is set from the start, so not any twist will do. Whatever the prestige will be, if it's not venturing in the realm of feasibility, something will have been missed. We're dealing with magic after all, not fantasy, not sci-fi. I insist on the sci-fi element because the film opens with some electrical contraption that shakes its credibility from the start until a reassuring trap door shows and we can let a sight of relief go.French called electricity a Fairy so it all makes sense that magicians would use it as a device for generating illusion, just like rivals Edison and Tesla were perceived as wizards. After all, it's also established that magic is about what you see and what you don't and the use of lights and darkness is integral to the act. Still, I didn't like that machine. It felt incongruous and weird in a period drama and I was afraid Nolan would end up inserting some Batman-like device. And when he said in the \"making of\" video that he wanted to portray magic according to his personal vision of film-making, I thought \"no kidding?\", I'm pretty sure everyone got the parallel, especially when magical acts use special effects worthy of a Spielberg film. So Nolan gets a little carried away at the end while the first two acts of the movie had really gotten me involved, I mean the escalating rivalry between the two magicians Alfred Bowden (Christian Bale) and Robert Angier (Hugh Jackman) and their attempts to destroy one's act or find one's secret. What Nolan got right is that the rivalry mostly works as a foil to plunge us in the world of magic and know all the tricks. After all, that's the greatest thrill about magic, seeing how it works. For instance, the way a magician puts a dove in a cage and then flattens it to magically making the dove reappear under a handkerchief always made me scratch my head... but in this Dickensian universe where there's no pity for little children, why should there for innocent animals?The trigger of the rivalry also helps to understand how one of the most famous magic tricks, the \"escape from the tank water\" that made Houdini's reputation, is indirectly explained. Working as false audience members, Bowden and Angier are assigned to tie the magician's pretty assistant (Piper Perabo), one of them makes the kind of knot that doesn't leave any chance for the poor girl, who happens to be the other's wife. We gather that from then, it's personal. Another pivotal moment occurs when one conceives his masterpiece, an act that consists on getting in a door and coming out of another. He calls it \"The Transported Man\", for us, it looks like teleportation and it justifies why the rival is devoured by jealousy, although Caine's character can only see one explanation: there must be a double.At that point of the review, it's impossible to go further without spoiling the film. It's engaging enough to make you forget there's a twist but it's not spoiling the film to say that there's a twist, since it's the essence of magic. You've got to wow the audience with a surprise at the end. With the seemingly death of a character right at the start of the film, the battle to know everyone's tricks and the existence of a double, anyone could reassemble the pieces of the puzzle. But you know Nolan has more than a trick in his sleeve and that's both a blessing and a curse. Granted anticipations are to be toyed a little to be emotionally rewarded, all he had to do was working on the narrative structure to make what we know first a more effective reveal or a shock.Instead of that, Nolan relied on a far fetched revelation combined with an implementation that destroyed the whole atmosphere built throughout the film. From the start, we follow magicians who are dedicated to their passion, which is good, but the escalation toward sadism and some ends-justifying-the-means means made their whole approach to their art debatable, leaving no room for sympathy. In this cruel battle of wits, women are reduced to disposable pawns (Rebecca Hall and Scarlett Johannsen would get more dimensional roles in a certain Woody Allen's movie). The first two acts, we can call them 'pledges' and 'turns' are great but then the film goes downhill. One thing for sure, I hated that Tesla Machine, and no offense to David Bowie, but Tesla was quite a handsome fellow whom I doubt spoke with such a heavy British accent. Nolan wanted his film-making to echo magic, but he let the reverse thing operate."
    },
    {
      "username": "orko_dutta",
      "userUrl": "https://www.imdb.com/user/ur14971063",
      "reviewLink": "https://www.imdb.com/review/rw4992738",
      "warningSpoilers": false,
      "date": "13 July 2019",
      "rate": "8",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Fantastic!",
      "content": "The final reveal in a magic trick is the most thrilling experience. So is that of this movie. The Prestige is a masterful exercise in storytelling with superb direction and powerful performances. I was floored by the deftness of how Nolan weaved and juxtaposed the non linear narrative so flawlessly. What makes this movie so incredible is that while it is indeed a movie about magicians (or illusionists) it is also a complex character study about how self destructive obsessions are with a sideline love story and a sci-fi twist - very unique."
    },
    {
      "username": "FeastMode",
      "userUrl": "https://www.imdb.com/user/ur104603847",
      "reviewLink": "https://www.imdb.com/review/rw4957751",
      "warningSpoilers": true,
      "date": "25 June 2019",
      "rate": "10",
      "helpful": "19 out of 25 found this helpful.",
      "title": "my notes",
      "content": "Omg. possibly the greatest film ever made. the most genius story ever put to film. I keep saying it's hard for me to believe that it's even possible to come up with such a smart story. Amazing acting throughout. Intense throughout. Seems to get better with each viewing (5 viewings) SPOILERS after watching this for a 5th time, i still picked up on things that i don't think i noticed before, which is so impressive of this movie. the biggest one was that i could tell which brother was being portrayed by bale. the one that got married was nicer and calmer and more comforting. the one that sexes scarlett josexy is meaner, short-tempered and cockier. the fact that i could tell who was who, based on very subtle differences in his acting style, he's the GOAT for a reason. bale is a master of his craft."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1645625",
      "warningSpoilers": false,
      "date": "28 April 2007",
      "rate": "9",
      "helpful": "27 out of 39 found this helpful.",
      "title": "A Great Tale of Rivalry, Obsession, Revenge and Sacrifice",
      "content": "In the end of the Nineteenth Century, in London, Robert Angier (Hugh Jackman), his beloved wife Julia McCullough (Piper Perabo) and Alfred Borden (Christian Bale) are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.\"The Prestige\" is a great tale of rivalry, obsession, revenge and sacrifice. The unpredictable screenplay has many twists, disclosing unusual situations and hooking the attention of the viewer until the very last scene. Christopher Nolan, after the masterpiece \"Memento\", offers another excellent movie for the cinema lovers, better and better than the Oscar winner \"The Departed\". The amazing dispute between the outstanding Christian Bale and Hugh Jackman is supported by the extraordinary Michael Caine and a wonderful cinematography. My vote is nine.Title (Brazil): \"O Grande Truque\" (\"The Great Trick\")"
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3403261",
      "warningSpoilers": false,
      "date": "26 January 2016",
      "rate": "",
      "helpful": "12 out of 16 found this helpful.",
      "title": "fascinating",
      "content": "a film about magic at different levels. the magic as art. the magic as axis of life. art as only way to survive. beautiful, mysterious, ambiguous and almost impeccable. in fact, brilliant job. and this status is result of delicate-precise mixture of acting, impeccable story, splendid atmosphere and the feeling than competition escapes from the screen. a seductive detail - David Bowie as Nikola Tesla, a role who gives to film a special flavor. at first sigh, story of a cruel fight for success. or a portrait of manipulation art. in fact, fresco of a time. and one of admirable roles for Christian Bale and Hugh Jackman."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2524436",
      "warningSpoilers": true,
      "date": "27 November 2011",
      "rate": "8",
      "helpful": "10 out of 13 found this helpful.",
      "title": "\"It is very rare to see... real magic.\"",
      "content": "Oh man, this one had me right up to the part with the transporter/duplicator machine. Until then it was a compelling and complex tale dealing in murder, mystery and intrigue with a clever backdrop of magicians attempting to outdo each other with the grandest illusion of all time. What I'm not going to do is go back and watch this three times in a row like I did with \"Memento\" because when all is said and done, I won't be any better off. In a way I felt cheated that an 1880's era film would bring in a fictional sci-fi element the way it did. It seems to me the story could have gotten around that contrivance to come up with a more realistic resolution that confined itself to existing science and techniques of illusion. Then, when Borden (Christian Bale) had his final showdown with Angier (Hugh Jackman), he could have caught the bullet to end the picture on a more promising note. I don't really mean to sound so harsh on the film because like I said, up to the Tesla part this story was going great guns. Maybe because the guy portraying Tesla looked so much like David Bowie, it kept me off stride for a while as well. Then it turned out to be Bowie when the credits rolled, and I was back to thinking about that business with the cats and the hats. Maybe the whole thing was an illusion."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw4637987",
      "warningSpoilers": false,
      "date": "10 February 2019",
      "rate": "10",
      "helpful": "16 out of 23 found this helpful.",
      "title": "Does anybody look better in a top hat and tails than Hugh Jackman?...",
      "content": "... but I guess that is really beside the point.Christian Bale and Hugh Jackman play two young British magicians - Alfred Borden and Robert Angier - trying to learn the tricks of the trade, somewhat even allied at first. Borden is a common Londoner, but Angier is to the manor born, using an alias in his magic work so as to not to embarrass his rich Victorian family. In the pursuit of a more fantastic trick a terrible accident occurs and Angier loses somebody close to him, vowing revenge against Borden, whom he holds responsible.These two are both the Roadrunner and Wiley Coyote to one another. Each one tries to sabotage and learn the other's tricks, make each other look ridiculous, etc. Angier is the more dangerous of the two because he is truly intent on killing Borden when he infiltrates his \"catch the bullet\" act early on in the film and, instead, maims him. The rivalry ratchets up to increasingly dangerous proportions. It is ultimately a fine piece of drama as to how far these two are willing to go in their obsession and for their art, with them both ultimately living tragic and miserable lives in the process. So much sacrifice for what most people would consider a trivial pastime. It is madness beyond obsession.This is a very entertaining and thought provoking film, and there is plenty of foreshadowing. Watch closely and watch it twice. I honestly don't think Christopher Nolan would be capable of linear storytelling if his life depended on it, but he is a master of this adapted material. At the end I could only go - \"Brilliant\".Scarlett Johannson plays Angier's lover who has a pivotal role in how the final act plays out. Rebecca Hall is Sarah, Borden's wife, who can't figure out why her husband seems to only love her on some days. David Bowie lends a real air of mystery to his portrayal of Nikola Tesla. But who else but Bowie could believably introduce his character by walking through lightning? Yes, the Tesla-Edison feud gets incorporated into the film and even a sci-fi angle is thrown into the plot. Michael Caine, as Jackman's magician mentor, seems to be playing his Alfred character from The Dark Knight. He has a supporting role, but watch him carefully, he has some of the most important lines of the film. And his final decision - do you think it was correct? Did two wrongs make a right in this unique situation?I wish I could tell you more, but I would give away the plot if I did. This is truly one of the better films made in the 21st century, and I largely don't like films made after 1960. Highly recommended and a real head scratcher, especially given the last line of the film."
    },
    {
      "username": "harrylosborne",
      "userUrl": "https://www.imdb.com/user/ur56820537",
      "reviewLink": "https://www.imdb.com/review/rw6896819",
      "warningSpoilers": false,
      "date": "9 May 2021",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Magic in parts, meh in others",
      "content": "The first time I watched \"The Prestige\", I didn't think anything of it whatsoever. However, on reflection, I think it's a film to be taken with a pinch of salt, and not just when regarding the magic.This movie suffers from two main characters having the thickest plot armour imaginable - making all of their encounters feel inconsequential. This is a fairly severe oversight in an otherwise robust film that does provide intrigue, but still lacks on a fundamental level.Nolan is one to weave as complex a tale as he can, and here is no different. Starting with a dramatic but unexplained death, the story plots the rivalry between two pioneering magicians: one who prizes showmanship and theatrics, and the other who reveres the art above all else. I prefer Hugh Jackman's performance to Christian Bale's (not something I would normally say), but Bale's feels a bit too abrasive and cynical even for the character design.What lost me a bit was the whole Nikola Tesla arc, where Nolan tries bridging the gap between illusion and reality. It's all a bit clunky, and whilst I don't particularly see why David Bowie was brought in for the role, I don't see anyone else doing much more with the material either.The music is fairly minor in the story (not orchestrated by the usual Hans Zimmer), so doesn't elevate the film like in most of Nolan's other projects. Stylistically, there is a faithfulness to 19th century London; period attire is par for the course, but there is a decent finesse to the whole endeavour. The scenes in the USA are the best looking parts, as the scenery across the pond gives a little more scope for artistic license.Mercifully, Nolan does leave most of the chronology alone, allowing a more rigid story to be told. Towards the end, I did begin to feel a greater sense of attachment - the conflict between the protagonists is palpable - but the romance aspects felt contrived and just like plot padding. I was invested in the finale, and there certainly are dramatic twists and turns, but in my opinion, they require you to accept some flawed storytelling tactics.\"The Prestige\" is definitely not one of Nolan's best: whilst it does exhibit shades of what makes his masterpieces so powerful, it also struggles with hurdles that even basic stories should be practically immune to.Invulnerability breaks immersion, and is one of the issues I had with \"Tenet\" 15 years later. That alone inhibits this movie from ascending into hallowed ground, condemning it to just being a worthwhile watch."
    }
  ],
  "errorMessage": ""
}