{
  "imDbId": "tt0482571",
  "title": "The Prestige",
  "fullTitle": "The Prestige (2006)",
  "type": "Movie",
  "year": "2006",
  "language": "en",
  "titleInLanguage": "The Prestige (film)",
  "url": "https://en.wikipedia.org/wiki/The_Prestige_(film)",
  "plotShort": {
    "plainText": "The Prestige is a 2006 psychological thriller film directed by Christopher Nolan, written by Nolan and his brother Jonathan and based on the 1995 novel by Christopher Priest. It stars Hugh Jackman as Robert Angier and Christian Bale as Alfred Borden, rival stage magicians in Victorian London who feud over a perfect teleportation trick.\r\nThe cast also features Scarlett Johansson, Michael Caine, Piper Perabo, Andy Serkis, Rebecca Hall, and David Bowie as Nikola Tesla. The film reunites Nolan with actors Bale and Caine from Batman Begins and returning cinematographer Wally Pfister, production designer Nathan Crowley, and editor Lee Smith.\r\nThe Prestige was released on October 20, 2006, to positive reviews and grossed $109 million worldwide against a production budget of $40 million. It received Academy Award nominations for Best Art Direction and Best Cinematography.",
    "html": "<p>The Prestige is a 2006 psychological thriller film directed by Christopher Nolan, written by Nolan and his brother Jonathan and based on the 1995 novel by Christopher Priest. It stars Hugh Jackman as Robert Angier and Christian Bale as Alfred Borden, rival stage magicians in Victorian London who feud over a perfect teleportation trick.</p><p>The cast also features Scarlett Johansson, Michael Caine, Piper Perabo, Andy Serkis, Rebecca Hall, and David Bowie as Nikola Tesla. The film reunites Nolan with actors Bale and Caine from Batman Begins and returning cinematographer Wally Pfister, production designer Nathan Crowley, and editor Lee Smith.</p><p>The Prestige was released on October 20, 2006, to positive reviews and grossed $109 million worldwide against a production budget of $40 million. It received Academy Award nominations for Best Art Direction and Best Cinematography.</p>"
  },
  "plotFull": {
    "plainText": "The Prestige is a 2006 psychological thriller film directed by Christopher Nolan, written by Nolan and his brother Jonathan and based on the 1995 novel by Christopher Priest. It stars Hugh Jackman as Robert Angier and Christian Bale as Alfred Borden, rival stage magicians in Victorian London who feud over a perfect teleportation trick.\r\nThe cast also features Scarlett Johansson, Michael Caine, Piper Perabo, Andy Serkis, Rebecca Hall, and David Bowie as Nikola Tesla. The film reunites Nolan with actors Bale and Caine from Batman Begins and returning cinematographer Wally Pfister, production designer Nathan Crowley, and editor Lee Smith.\r\nThe Prestige was released on October 20, 2006, to positive reviews and grossed $109 million worldwide against a production budget of $40 million. It received Academy Award nominations for Best Art Direction and Best Cinematography.\r\nPlot\r\nIn 1890s London, Robert Angier and Alfred Borden work as shills for a magician, under the mentorship of John Cutter, an engineer who designs stage magic. During a water tank trick, Angier's wife Julia fails to escape and drowns. Angier, devastated, accuses Borden of using a riskier knot, causing her death. The two become bitter enemies and part ways. Borden begins a solo act while Cutter helps Angier launch his own career. In retaliation for his wife's death, Angier sabotages Borden's bullet catch trick and shoots off two of the latter's fingers. Borden later develops a trick he calls \"The Transported Man\", in which he appears to travel instantly between two wardrobes on opposite ends of the stage.\r\nUnable to discern Borden's method, Angier hires a double, Gerald Root, to perform his own version of the trick. The imitation is a greater success, but Angier is dissatisfied, as he ends the trick hidden under the stage while Root basks in the applause. Angier has his assistant Olivia spy on Borden to learn how he performs The Transported Man. However, Olivia falls in love with Borden and becomes his assistant. With her help, Borden sabotages Angier's act. Confronted by Angier, Olivia gives him a copy of Borden's encoded diary. Angier acquires the keyword to decode it, \"TESLA\", by threatening to kill Borden's stage engineer, Fallon. The diary takes Angier to America to meet scientist Nikola Tesla, who supposedly built a machine for The Transported Man trick.\r\nAngier realizes the diary is fraudulent, created as a distraction, but Tesla still manages to create a machine for him. However, instead of teleporting objects, Tesla's machine creates a duplicate of them a short distance away. Tesla is driven from Colorado Springs by agents of his rival, Thomas Alva Edison, but has the machine delivered to Angier. He advises Angier to destroy it, saying it will bring him nothing but misery. Borden's wife, Sarah, is driven to suicide by his contradictory personality. Borden reveals to Olivia that he never loved Sarah and that he loves her more. Disgusted by Borden's seeming inhumanity over his wife's death and the two magicians' feud, Olivia leaves. In London, Angier debuts \"The Real Transported Man\" using Tesla's machine, appearing to teleport across the theater.\r\nBorden sneaks backstage and witnesses Angier fall through a trapdoor and drown in a water tank. Borden is discovered by Cutter and turned over to the police. He is later found guilty of murder and sentenced to death. Lord Caldlow, an aristocrat interested in magic, offers to adopt Borden's soon-to-be orphaned daughter Jess, so she is not sent to the workhouses, in exchange for Borden's tricks. However, on meeting Caldlow, Borden realizes that it is Angier in disguise, come to gloat. When Cutter realizes that Angier is still alive, he is disgusted that Angier allowed Borden to be sentenced but agrees to help dispose of Tesla's machine. Borden is hanged for Angier's murder. Back at the theatre, Angier is shot by a stranger who reveals himself as Borden.\r\nHow each man performed the Transported Man act is revealed: \"Alfred Borden\" was an identity shared by a pair of identical twins; offstage when one was \"Borden\", the other was disguised as \"Fallon\". When Angier had shot off one of the twin's fingers, the other amputated his own fingers to maintain the disguise. The surviving twin loved Sarah while his brother had loved Olivia. Meanwhile, when Angier used Tesla's machine, every performance created a new Angier, while the original drowned in a tank beneath the stage. Angier dies from his gunshot and drops his lantern, setting the theatre on fire. Borden leaves and picks up Jess at Cutter's workshop. In the burning theater, rows of tanks hold dead Angiers.\r\nCast\r\nHugh Jackman as Robert \"The Great Danton\" Angier / Lord Caldlow, an aristocratic magician. Nolan cast Jackman, stating that Angier \"has a wonderful understanding of the interaction between a performer and a live audience\", a quality he believed Jackman possessed. Jackman based his portrayal of Angier on 1950s-era magician Channing Pollock. Jackman also portrays Gerald Root, an alcoholic double used for Angier's New Transported Man.\r\nChristian Bale as Alfred \"The Professor\" Borden / Bernard Fallon, a working-class magician. While Nolan had previously cast Bale as Batman in Batman Begins (2005), he did not consider Bale for the role of Borden until Bale contacted him about the script. Nolan subsequently believed that Bale was \"exactly right\" for the part and that it was \"unthinkable\" for anyone else to play it. Nolan suggested that the actors not read the original novel, but Bale ignored the advice.\r\nMichael Caine as John Cutter, the stage engineer (ingenieur) who works with Angier and Borden. Caine had previously collaborated with Nolan and Bale in Batman Begins. Nolan noted that the part had been written \"before I'd ever met\" Caine. Caine described Cutter as \"a teacher, a father and a guide to Angier\". In trying to create the character's nuanced portrait, Caine altered his voice and posture.\r\nScarlett Johansson as Olivia Wenscombe, Angier and Borden's assistant. Nolan was \"very keen\" for Johansson to play the role, and when he met with her to discuss it, \"she just loved the character\".\r\nPiper Perabo as Julia McCullough, Milton the Magician's assistant and Angier's wife.\r\nRebecca Hall as Sarah Borden, Borden's wife. Hall had to relocate from North London to Los Angeles in order to shoot the film, although the film itself takes place in London.\r\nDavid Bowie as Nikola Tesla, the real-life inventor who creates a teleportation device for Angier. For Tesla, Nolan wanted someone who was not necessarily a film star but was \"extraordinarily charismatic\". Nolan stated that Bowie \"was really the only guy I had in mind to play Tesla because his function in the story is a small but very important role\". Nolan contacted Bowie, who initially turned down the part. A lifelong fan, Nolan flew out to New York to pitch the role to Bowie in person, telling him no one else could possibly play the part; Bowie accepted after a few minutes.\r\nAndy Serkis as Mr. Alley, Tesla's assistant. Serkis said he played Alley with the belief that he was \"once a corporation man who got excited by this maverick, Tesla, so jumped ship and went with the maverick\". Serkis described Alley as a \"gatekeeper\", a \"conman\", and \"a mirror image of Michael Caine's character.\" Serkis, a big fan of Bowie, said he was enjoyable to work with, describing him as \"very unassuming, very down to earth... very at ease with himself and funny.\"\r\nRicky Jay as Milton the Magician, an older magician who employs Angier and Borden at the beginning of their careers. Jay and Michael Weber trained Jackman and Bale for their roles with brief instruction in various stage illusions. The magicians gave the actors limited information, allowing them to know enough to pull off a scene.\r\nRoger Rees as Owens, a solicitor working for Lord Caldlow.\r\nW. Morgan Sheppard as Merrit, the owner of a theater where Angier initially performs.\r\nSamantha Mahurin as Jess Borden, the daughter of Borden and Sarah.\r\nDaniel Davis as the judge presiding over Borden's trial.\r\nRuss Fega as Man in Hotel.\r\nProduction\r\nJulian Jarrold's and Sam Mendes's producer approached Christopher Priest for an adaptation of his novel The Prestige. Priest was impressed with Nolan's films Following and Memento, and subsequently, producer Valerie Dean brought the book to Nolan's attention. In October 2000, Nolan traveled to the United Kingdom to publicize Memento, as Newmarket Films was having difficulty finding a United States distributor. While in London, Nolan read Priest's book and shared the story with his brother while walking around in Highgate (a location later featured in the scene where Angier ransoms Borden's stage engineer in Highgate Cemetery). The development process for The Prestige began as a reversal of their earlier collaboration: Jonathan Nolan had pitched his initial story for Memento to his brother during a road trip.\r\nA year later, the option on the book became available and was purchased by Aaron Ryder of Newmarket Films. In late 2001, Nolan became busy with the post-production of Insomnia, and asked his brother Jonathan to help work on the script. The writing process was a long collaboration between the Nolan brothers, occurring intermittently over a period of five years. In the script, the Nolans emphasized the magic of the story through the dramatic narrative, playing down the visual depiction of stage magic. The three-act screenplay was deliberately structured around the three elements of the film's illusion: the pledge, the turn, and the prestige. \"It took a long time to figure out how to achieve cinematic versions of the very literary devices that drive the intrigue of the story,\" Christopher Nolan told Variety: \"The shifting points of view, the idea of journals within journals and stories within stories. Finding the cinematic equivalents of those literary devices was very complex.\" Although the film is thematically faithful to the novel, two major changes were made to the plot structure during the adaptation process: the novel's spiritualism subplot was removed, and the modern-day frame story was replaced with Borden's wait for the gallows. Priest approved of the adaptation, describing it as \"an extraordinary and brilliant script, a fascinating adaptation of my novel.\"\r\nIn early 2003, Nolan planned to direct the film before the production of Batman Begins accelerated. Following the release of Batman Begins, Nolan started up the project again, negotiating with Jackman and Bale in October 2005. While the screenplay was still being written, production designer Nathan Crowley began the set design process in Nolan's garage, employing a \"visual script\" consisting of scale models, images, drawings, and notes. Jonathan and Christopher Nolan finished the final shooting draft on January 13, 2006, and began production three days later on January 16. Filming ended on April 9.\r\nCrowley and his crew searched Los Angeles for almost seventy locations that resembled fin de siècle London. Jonathan Nolan visited Colorado Springs to research Nikola Tesla and based the electric bulb scene on actual experiments conducted by Tesla. Nathan Crowley helped design the scene for Tesla's invention; It was shot in the parking lot of the Mount Wilson Observatory. Influenced by a \"Victorian modernist aesthetic,\" Crowley chose four locations in the Broadway theater district in downtown Los Angeles for the film's stage magic performances: the Los Angeles Theatre, the Palace Theatre, the Los Angeles Belasco, and the Tower Theatre. Crowley also turned a portion of the Universal back lot into Victorian London. Osgood Castle in Colorado was also used as a location.\r\nNolan built only one set for the film, an \"under-the-stage section that houses the machinery that makes the larger illusions work,\" preferring to simply dress various Los Angeles locations and sound stages to stand in for Colorado and Victorian England. In contrast to most period pieces, Nolan kept up the quick pace of production by shooting with handheld cameras, and refrained from using artificial lighting in some scenes, relying instead on natural light on location. Costume designer Joan Bergin chose attractive, modern Victorian fashions for Scarlett Johansson; cinematographer Wally Pfister captured the mood with soft earth tones as white and black colors provided background contrasts, bringing actors' faces to the foreground. Editing, scoring, and mixing finished on September 22, 2006.\r\nThemes\r\nThe rivalry between Angier and Borden dominates the film. Obsession, secrecy, and sacrifice fuel the battle, as both magicians contribute their fair share to a deadly duel of one-upmanship, with disastrous results. Angier's obsession with beating Borden costs him Cutter's friendship, while providing him with a collection of his own dead clones; Borden's obsession with maintaining the secrecy of his twin leads Sarah to question their relationship, eventually resulting in her suicide when she suspects the truth. Angier and one of the twins both lose Olivia's love because of their inhumanity. Finally, Borden is hanged and the last copy of Angier shot. Their struggle is also expressed through class warfare: Borden as The Professor, a working-class magician who gets his hands dirty, versus Angier as The Great Danton, a classy, elitist showman whose accent makes him appear American. Film critic Matt Brunson claimed that a complex theme of duality is exemplified by Angier and Borden, that the film chooses not to depict either magician as good or evil.\r\nAngier's theft of Borden's teleportation illusion in the film echoes many real-world examples of stolen tricks among magicians. Outside the film, similar rivalries include magicians John Nevil Maskelyne and Harry Kellar's dispute over a levitation illusion. Gary Westfahl of Locus Online also notes a \"new proclivity for mayhem\" in the film over the novel, citing the murder/suicide disposition of Angier's duplicates and intensified violent acts of revenge and counter-revenge. This \"relates to a more general alteration in the events and tone of the film\" rather than significantly changing the underlying themes.\r\nNor is this theme of cutthroat competition limited to sleight of hand: the script incorporates the popular notion that Nikola Tesla and Thomas Edison were directly engaged in the war of the currents, a rivalry over electrical standards, which appears in the film in parallel to Angier and Borden's competition for magical supremacy. In the novel, Tesla and Edison serve as foils for Angier and Borden, respectively.\r\nDen Shewman of Creative Screenwriting says the film asks how far one would go to devote oneself to an art. The character of Chung Ling Soo, according to Shewman, is a metaphor for this theme. Film critic Alex Manugian refers to this theme as the \"meaning of commitment.\"\r\nNicolas Rapold of Film Comment addresses the points raised by Shewman and Manugian in terms of the film's \"refracted take on Romanticism\":\r\nAngier's technological solution—which suggests art as sacrifice, a phoenix-like death of the self—and Borden's more meat-and-potatoes form of stagecraft embody the divide between the artist and the social being.\r\nFor Manugian the central theme is \"obsession,\" but he also notes the supporting themes of the \"nature of deceit\" and \"science as magic.\" Manugian criticizes the Nolans for trying to \"ram too many themes into the story.\"\r\nRelease\r\nTouchstone Pictures opted to move the release date forward by a week, from the original October 27, to October 20, 2006. The film earned $14.8 million on opening weekend in the United States, debuting at #1. It grossed $109 million, including $53 million from the United States. The film received nominations for the Academy Award for Best Art Direction (Nathan Crowley and Julie Ochipinti) and the Academy Award for Best Cinematography (Wally Pfister), as well as a nomination for the Hugo Award for Best Dramatic Presentation, Long Form in 2007.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 76% based on 202 reviews, with an average rating of 7.1/10. The website's critics consensus reads, \"Full of twists and turns, The Prestige is a dazzling period piece that never stops challenging the audience.\" Metacritic assigned the film a weighted average score of 66 out of 100, based on 36 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.\r\nClaudia Puig of USA Today described the film as \"one of the most innovative, twisting, turning art films of the past decade.\" Drew McWeeny gave the film a glowing review, saying it demands repeat viewing, with Peter Travers of Rolling Stone agreeing. On At the Movies with Ebert and Roeper, Richard Roeper and guest critic A.O. Scott gave the film a \"two thumbs up\" rating. Todd Gilchrist of IGN applauded the performances of Jackman and Bale whilst praising Nolan for making \"this complex story as easily understandable and effective as he made the outwardly straightforward comic book adaptation (Batman Begins) dense and sophisticated... any truly great performance is almost as much showmanship as it is actual talent, and Nolan possesses both in spades.\" CNN.com and Village Voice film critic Tom Charity listed it among his best films of 2006. Philip French of The Observer recommended the film, comparing the rivalry between the two main characters to that of Mozart and Salieri in the highly acclaimed Amadeus.\r\nOn the other hand, Dennis Harvey of Variety criticized the film as gimmicky, though he felt the cast did well in underwritten roles. Kirk Honeycutt of The Hollywood Reporter felt that characters \"...are little more than sketches. Remove their obsessions, and the two magicians have little personality.\" Nonetheless, the two reviewers praised David Bowie as Tesla, as well as the production values and cinematography. On a simpler note, Emanuel Levy has said: \"Whether viewers perceive The Prestige as intricately complex or just unnecessarily complicated would depend to a large degree on their willingness to suspend disbelief for two hours.\" He gave the film a B grade.\r\nRoger Ebert gave the film three stars out of four, describing the revelation at the end as a \"fundamental flaw\" and a \"cheat.\" He wrote, \"The pledge of Nolan's The Prestige is that the film, having been metaphorically sawed in two, will be restored; it fails when it cheats, as, for example, if the whole woman produced on the stage were not the same one so unfortunately cut in two.\" R.J. Carter of The Trades felt, \"I love a good science fiction story; just tell me in advance.\" He gave the film a B−. Christopher Priest, who wrote the novel the film is based on, saw it three times as of January 5, 2007, and his reaction was \"'Well, holy shit.' I was thinking, 'God, I like that,' and 'Oh, I wish I'd thought of that.'\"\r\nThe film has grown in stature since its release. In 2009, The A.V. Club named The Prestige as one of the best films of the 2000s. The film was included in American Cinematographer's \"Best-Shot Film of 1998-2008\" list, ranking at 36. More than 17,000 people around the world participated in the final vote. In 2020, Empire magazine ranked it among \"The 100 Greatest Movies Of The 21st Century\".\r\nMusic\r\nThe film score was written by English musician and composer David Julyan. Julyan had previously collaborated with director Christopher Nolan on Following, Memento and Insomnia. Following the film's narrative, the soundtrack had three sections: the Pledge, the Turn, and the Prestige.\r\nTrack listing\r\nAll music is composed by David Julyan.\r\nSome critics were disappointed with the score, acknowledging that while it worked within the context of the film, it was not enjoyable by itself. Jonathan Jarry of SoundtrackNet described the score as \"merely functional,\" establishing the atmosphere of dread but never taking over. Although the reviewer was interested with the score's notion, Jarry found the execution was \"extremely disappointing.\"\r\nChristopher Coleman of Tracksounds felt that though it was \"...a perfectly fitting score,\" it was completely overwhelmed by the film, and totally unnoticed at times. Christian Clemmensen of Filmtracks recommended the soundtrack for those who enjoyed Julyan's work on the film, and noted that it was not for those who expected \"any semblance of intellect or enchantment in the score to match the story of the film.\" Clemmensen called the score lifeless, \"constructed on a bed of simplistic string chords and dull electronic soundscapes.\"\r\nThe song \"Analyse\" by Radiohead frontman Thom Yorke is played over the credits.\r\nHome media\r\nThe Region 1 disc is by Buena Vista Home Entertainment, and was released on February 20, 2007, and is available on DVD and Blu-ray formats. The Warner Bros. Region 2 DVD was released on March 12, 2007. It is also available in both BD and regionless HD DVD in Europe (before HD DVD was canceled). Special features are minimal, with the documentary Director's Notebook: The Prestige – Five Making-of Featurettes, running roughly twenty minutes combined, an art gallery and the trailer. Nolan did not contribute to a commentary as he felt the film primarily relied on an audience's reaction and did not want to remove the mystery from the story.\r\nThe film was released by Warner Bros. Home Entertainment on Ultra HD Blu-ray on December 18, 2017 in the United Kingdom. The film was also released by Touchstone Home Entertainment on Ultra HD Blu-ray on December 19, 2017 in the United States.",
    "html": "<p>The Prestige is a 2006 psychological thriller film directed by Christopher Nolan, written by Nolan and his brother Jonathan and based on the 1995 novel by Christopher Priest. It stars Hugh Jackman as Robert Angier and Christian Bale as Alfred Borden, rival stage magicians in Victorian London who feud over a perfect teleportation trick.</p><p>The cast also features Scarlett Johansson, Michael Caine, Piper Perabo, Andy Serkis, Rebecca Hall, and David Bowie as Nikola Tesla. The film reunites Nolan with actors Bale and Caine from Batman Begins and returning cinematographer Wally Pfister, production designer Nathan Crowley, and editor Lee Smith.</p><p>The Prestige was released on October 20, 2006, to positive reviews and grossed $109 million worldwide against a production budget of $40 million. It received Academy Award nominations for Best Art Direction and Best Cinematography.</p><br/><h3>Plot</h3><p>In 1890s London, Robert Angier and Alfred Borden work as shills for a magician, under the mentorship of John Cutter, an engineer who designs stage magic. During a water tank trick, Angier's wife Julia fails to escape and drowns. Angier, devastated, accuses Borden of using a riskier knot, causing her death. The two become bitter enemies and part ways. Borden begins a solo act while Cutter helps Angier launch his own career. In retaliation for his wife's death, Angier sabotages Borden's bullet catch trick and shoots off two of the latter's fingers. Borden later develops a trick he calls \"The Transported Man\", in which he appears to travel instantly between two wardrobes on opposite ends of the stage.</p><p>Unable to discern Borden's method, Angier hires a double, Gerald Root, to perform his own version of the trick. The imitation is a greater success, but Angier is dissatisfied, as he ends the trick hidden under the stage while Root basks in the applause. Angier has his assistant Olivia spy on Borden to learn how he performs The Transported Man. However, Olivia falls in love with Borden and becomes his assistant. With her help, Borden sabotages Angier's act. Confronted by Angier, Olivia gives him a copy of Borden's encoded diary. Angier acquires the keyword to decode it, \"TESLA\", by threatening to kill Borden's stage engineer, Fallon. The diary takes Angier to America to meet scientist Nikola Tesla, who supposedly built a machine for The Transported Man trick.</p><p>Angier realizes the diary is fraudulent, created as a distraction, but Tesla still manages to create a machine for him. However, instead of teleporting objects, Tesla's machine creates a duplicate of them a short distance away. Tesla is driven from Colorado Springs by agents of his rival, Thomas Alva Edison, but has the machine delivered to Angier. He advises Angier to destroy it, saying it will bring him nothing but misery. Borden's wife, Sarah, is driven to suicide by his contradictory personality. Borden reveals to Olivia that he never loved Sarah and that he loves her more. Disgusted by Borden's seeming inhumanity over his wife's death and the two magicians' feud, Olivia leaves. In London, Angier debuts \"The Real Transported Man\" using Tesla's machine, appearing to teleport across the theater.</p><p>Borden sneaks backstage and witnesses Angier fall through a trapdoor and drown in a water tank. Borden is discovered by Cutter and turned over to the police. He is later found guilty of murder and sentenced to death. Lord Caldlow, an aristocrat interested in magic, offers to adopt Borden's soon-to-be orphaned daughter Jess, so she is not sent to the workhouses, in exchange for Borden's tricks. However, on meeting Caldlow, Borden realizes that it is Angier in disguise, come to gloat. When Cutter realizes that Angier is still alive, he is disgusted that Angier allowed Borden to be sentenced but agrees to help dispose of Tesla's machine. Borden is hanged for Angier's murder. Back at the theatre, Angier is shot by a stranger who reveals himself as Borden.</p><p>How each man performed the Transported Man act is revealed: \"Alfred Borden\" was an identity shared by a pair of identical twins; offstage when one was \"Borden\", the other was disguised as \"Fallon\". When Angier had shot off one of the twin's fingers, the other amputated his own fingers to maintain the disguise. The surviving twin loved Sarah while his brother had loved Olivia. Meanwhile, when Angier used Tesla's machine, every performance created a new Angier, while the original drowned in a tank beneath the stage. Angier dies from his gunshot and drops his lantern, setting the theatre on fire. Borden leaves and picks up Jess at Cutter's workshop. In the burning theater, rows of tanks hold dead Angiers.</p><br/><h3>Cast</h3><ul><li>Hugh Jackman as Robert \"The Great Danton\" Angier / Lord Caldlow, an aristocratic magician. Nolan cast Jackman, stating that Angier \"has a wonderful understanding of the interaction between a performer and a live audience\", a quality he believed Jackman possessed. Jackman based his portrayal of Angier on 1950s-era magician Channing Pollock. Jackman also portrays Gerald Root, an alcoholic double used for Angier's New Transported Man.</li><li>Christian Bale as Alfred \"The Professor\" Borden / Bernard Fallon, a working-class magician. While Nolan had previously cast Bale as Batman in Batman Begins (2005), he did not consider Bale for the role of Borden until Bale contacted him about the script. Nolan subsequently believed that Bale was \"exactly right\" for the part and that it was \"unthinkable\" for anyone else to play it. Nolan suggested that the actors not read the original novel, but Bale ignored the advice.</li><li>Michael Caine as John Cutter, the stage engineer (ingenieur) who works with Angier and Borden. Caine had previously collaborated with Nolan and Bale in Batman Begins. Nolan noted that the part had been written \"before I'd ever met\" Caine. Caine described Cutter as \"a teacher, a father and a guide to Angier\". In trying to create the character's nuanced portrait, Caine altered his voice and posture.</li><li>Scarlett Johansson as Olivia Wenscombe, Angier and Borden's assistant. Nolan was \"very keen\" for Johansson to play the role, and when he met with her to discuss it, \"she just loved the character\".</li><li>Piper Perabo as Julia McCullough, Milton the Magician's assistant and Angier's wife.</li><li>Rebecca Hall as Sarah Borden, Borden's wife. Hall had to relocate from North London to Los Angeles in order to shoot the film, although the film itself takes place in London.</li><li>David Bowie as Nikola Tesla, the real-life inventor who creates a teleportation device for Angier. For Tesla, Nolan wanted someone who was not necessarily a film star but was \"extraordinarily charismatic\". Nolan stated that Bowie \"was really the only guy I had in mind to play Tesla because his function in the story is a small but very important role\". Nolan contacted Bowie, who initially turned down the part. A lifelong fan, Nolan flew out to New York to pitch the role to Bowie in person, telling him no one else could possibly play the part; Bowie accepted after a few minutes.</li><li>Andy Serkis as Mr. Alley, Tesla's assistant. Serkis said he played Alley with the belief that he was \"once a corporation man who got excited by this maverick, Tesla, so jumped ship and went with the maverick\". Serkis described Alley as a \"gatekeeper\", a \"conman\", and \"a mirror image of Michael Caine's character.\" Serkis, a big fan of Bowie, said he was enjoyable to work with, describing him as \"very unassuming, very down to earth... very at ease with himself and funny.\"</li><li>Ricky Jay as Milton the Magician, an older magician who employs Angier and Borden at the beginning of their careers. Jay and Michael Weber trained Jackman and Bale for their roles with brief instruction in various stage illusions. The magicians gave the actors limited information, allowing them to know enough to pull off a scene.</li><li>Roger Rees as Owens, a solicitor working for Lord Caldlow.</li><li>W. Morgan Sheppard as Merrit, the owner of a theater where Angier initially performs.</li><li>Samantha Mahurin as Jess Borden, the daughter of Borden and Sarah.</li><li>Daniel Davis as the judge presiding over Borden's trial.</li><li>Russ Fega as Man in Hotel.</li></ul><br/><h3>Production</h3><p>Julian Jarrold's and Sam Mendes's producer approached Christopher Priest for an adaptation of his novel The Prestige. Priest was impressed with Nolan's films Following and Memento, and subsequently, producer Valerie Dean brought the book to Nolan's attention. In October 2000, Nolan traveled to the United Kingdom to publicize Memento, as Newmarket Films was having difficulty finding a United States distributor. While in London, Nolan read Priest's book and shared the story with his brother while walking around in Highgate (a location later featured in the scene where Angier ransoms Borden's stage engineer in Highgate Cemetery). The development process for The Prestige began as a reversal of their earlier collaboration: Jonathan Nolan had pitched his initial story for Memento to his brother during a road trip.</p><p>A year later, the option on the book became available and was purchased by Aaron Ryder of Newmarket Films. In late 2001, Nolan became busy with the post-production of Insomnia, and asked his brother Jonathan to help work on the script. The writing process was a long collaboration between the Nolan brothers, occurring intermittently over a period of five years. In the script, the Nolans emphasized the magic of the story through the dramatic narrative, playing down the visual depiction of stage magic. The three-act screenplay was deliberately structured around the three elements of the film's illusion: the pledge, the turn, and the prestige. \"It took a long time to figure out how to achieve cinematic versions of the very literary devices that drive the intrigue of the story,\" Christopher Nolan told Variety: \"The shifting points of view, the idea of journals within journals and stories within stories. Finding the cinematic equivalents of those literary devices was very complex.\" Although the film is thematically faithful to the novel, two major changes were made to the plot structure during the adaptation process: the novel's spiritualism subplot was removed, and the modern-day frame story was replaced with Borden's wait for the gallows. Priest approved of the adaptation, describing it as \"an extraordinary and brilliant script, a fascinating adaptation of my novel.\"</p><p>In early 2003, Nolan planned to direct the film before the production of Batman Begins accelerated. Following the release of Batman Begins, Nolan started up the project again, negotiating with Jackman and Bale in October 2005. While the screenplay was still being written, production designer Nathan Crowley began the set design process in Nolan's garage, employing a \"visual script\" consisting of scale models, images, drawings, and notes. Jonathan and Christopher Nolan finished the final shooting draft on January 13, 2006, and began production three days later on January 16. Filming ended on April 9.</p><p>Crowley and his crew searched Los Angeles for almost seventy locations that resembled fin de siècle London. Jonathan Nolan visited Colorado Springs to research Nikola Tesla and based the electric bulb scene on actual experiments conducted by Tesla. Nathan Crowley helped design the scene for Tesla's invention; It was shot in the parking lot of the Mount Wilson Observatory. Influenced by a \"Victorian modernist aesthetic,\" Crowley chose four locations in the Broadway theater district in downtown Los Angeles for the film's stage magic performances: the Los Angeles Theatre, the Palace Theatre, the Los Angeles Belasco, and the Tower Theatre. Crowley also turned a portion of the Universal back lot into Victorian London. Osgood Castle in Colorado was also used as a location.</p><p>Nolan built only one set for the film, an \"under-the-stage section that houses the machinery that makes the larger illusions work,\" preferring to simply dress various Los Angeles locations and sound stages to stand in for Colorado and Victorian England. In contrast to most period pieces, Nolan kept up the quick pace of production by shooting with handheld cameras, and refrained from using artificial lighting in some scenes, relying instead on natural light on location. Costume designer Joan Bergin chose attractive, modern Victorian fashions for Scarlett Johansson; cinematographer Wally Pfister captured the mood with soft earth tones as white and black colors provided background contrasts, bringing actors' faces to the foreground. Editing, scoring, and mixing finished on September 22, 2006.</p><br/><h3>Themes</h3><p>The rivalry between Angier and Borden dominates the film. Obsession, secrecy, and sacrifice fuel the battle, as both magicians contribute their fair share to a deadly duel of one-upmanship, with disastrous results. Angier's obsession with beating Borden costs him Cutter's friendship, while providing him with a collection of his own dead clones; Borden's obsession with maintaining the secrecy of his twin leads Sarah to question their relationship, eventually resulting in her suicide when she suspects the truth. Angier and one of the twins both lose Olivia's love because of their inhumanity. Finally, Borden is hanged and the last copy of Angier shot. Their struggle is also expressed through class warfare: Borden as The Professor, a working-class magician who gets his hands dirty, versus Angier as The Great Danton, a classy, elitist showman whose accent makes him appear American. Film critic Matt Brunson claimed that a complex theme of duality is exemplified by Angier and Borden, that the film chooses not to depict either magician as good or evil.</p><p>Angier's theft of Borden's teleportation illusion in the film echoes many real-world examples of stolen tricks among magicians. Outside the film, similar rivalries include magicians John Nevil Maskelyne and Harry Kellar's dispute over a levitation illusion. Gary Westfahl of Locus Online also notes a \"new proclivity for mayhem\" in the film over the novel, citing the murder/suicide disposition of Angier's duplicates and intensified violent acts of revenge and counter-revenge. This \"relates to a more general alteration in the events and tone of the film\" rather than significantly changing the underlying themes.</p><p>Nor is this theme of cutthroat competition limited to sleight of hand: the script incorporates the popular notion that Nikola Tesla and Thomas Edison were directly engaged in the war of the currents, a rivalry over electrical standards, which appears in the film in parallel to Angier and Borden's competition for magical supremacy. In the novel, Tesla and Edison serve as foils for Angier and Borden, respectively.</p><p>Den Shewman of Creative Screenwriting says the film asks how far one would go to devote oneself to an art. The character of Chung Ling Soo, according to Shewman, is a metaphor for this theme. Film critic Alex Manugian refers to this theme as the \"meaning of commitment.\"</p><p>Nicolas Rapold of Film Comment addresses the points raised by Shewman and Manugian in terms of the film's \"refracted take on Romanticism\":</p><blockquote>Angier's technological solution—which suggests art as sacrifice, a phoenix-like death of the self—and Borden's more meat-and-potatoes form of stagecraft embody the divide between the artist and the social being.</blockquote><p>For Manugian the central theme is \"obsession,\" but he also notes the supporting themes of the \"nature of deceit\" and \"science as magic.\" Manugian criticizes the Nolans for trying to \"ram too many themes into the story.\"</p><br/><h3>Release</h3><p>Touchstone Pictures opted to move the release date forward by a week, from the original October 27, to October 20, 2006. The film earned $14.8 million on opening weekend in the United States, debuting at #1. It grossed $109 million, including $53 million from the United States. The film received nominations for the Academy Award for Best Art Direction (Nathan Crowley and Julie Ochipinti) and the Academy Award for Best Cinematography (Wally Pfister), as well as a nomination for the Hugo Award for Best Dramatic Presentation, Long Form in 2007.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 76% based on 202 reviews, with an average rating of 7.1/10. The website's critics consensus reads, \"Full of twists and turns, The Prestige is a dazzling period piece that never stops challenging the audience.\" Metacritic assigned the film a weighted average score of 66 out of 100, based on 36 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.</p><p>Claudia Puig of USA Today described the film as \"one of the most innovative, twisting, turning art films of the past decade.\" Drew McWeeny gave the film a glowing review, saying it demands repeat viewing, with Peter Travers of Rolling Stone agreeing. On At the Movies with Ebert and Roeper, Richard Roeper and guest critic A.O. Scott gave the film a \"two thumbs up\" rating. Todd Gilchrist of IGN applauded the performances of Jackman and Bale whilst praising Nolan for making \"this complex story as easily understandable and effective as he made the outwardly straightforward comic book adaptation (Batman Begins) dense and sophisticated... any truly great performance is almost as much showmanship as it is actual talent, and Nolan possesses both in spades.\" CNN.com and Village Voice film critic Tom Charity listed it among his best films of 2006. Philip French of The Observer recommended the film, comparing the rivalry between the two main characters to that of Mozart and Salieri in the highly acclaimed Amadeus.</p><p>On the other hand, Dennis Harvey of Variety criticized the film as gimmicky, though he felt the cast did well in underwritten roles. Kirk Honeycutt of The Hollywood Reporter felt that characters \"...are little more than sketches. Remove their obsessions, and the two magicians have little personality.\" Nonetheless, the two reviewers praised David Bowie as Tesla, as well as the production values and cinematography. On a simpler note, Emanuel Levy has said: \"Whether viewers perceive The Prestige as intricately complex or just unnecessarily complicated would depend to a large degree on their willingness to suspend disbelief for two hours.\" He gave the film a B grade.</p><p>Roger Ebert gave the film three stars out of four, describing the revelation at the end as a \"fundamental flaw\" and a \"cheat.\" He wrote, \"The pledge of Nolan's The Prestige is that the film, having been metaphorically sawed in two, will be restored; it fails when it cheats, as, for example, if the whole woman produced on the stage were not the same one so unfortunately cut in two.\" R.J. Carter of The Trades felt, \"I love a good science fiction story; just tell me in advance.\" He gave the film a B−. Christopher Priest, who wrote the novel the film is based on, saw it three times as of January 5, 2007, and his reaction was \"'Well, holy shit.' I was thinking, 'God, I like that,' and 'Oh, I wish I'd thought of that.'\"</p><p>The film has grown in stature since its release. In 2009, The A.V. Club named The Prestige as one of the best films of the 2000s. The film was included in American Cinematographer's \"Best-Shot Film of 1998-2008\" list, ranking at 36. More than 17,000 people around the world participated in the final vote. In 2020, Empire magazine ranked it among \"The 100 Greatest Movies Of The 21st Century\".</p><h4>Music</h4><p>The film score was written by English musician and composer David Julyan. Julyan had previously collaborated with director Christopher Nolan on Following, Memento and Insomnia. Following the film's narrative, the soundtrack had three sections: the Pledge, the Turn, and the Prestige.</p><h4>Track listing</h4><p>All music is composed by David Julyan.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Are You Watching Closely?\"</td><td class=\"tracklist-length\">1:51</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Colorado Springs\"</td><td class=\"tracklist-length\">4:15</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"The Light Field\"</td><td class=\"tracklist-length\">1:50</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Borden Meets Sarah\"</td><td class=\"tracklist-length\">2:11</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Adagio for Julia\"</td><td class=\"tracklist-length\">2:03</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"A New Trick\"</td><td class=\"tracklist-length\">4:29</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"The Journal\"</td><td class=\"tracklist-length\">2:55</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"The Transported Man\"</td><td class=\"tracklist-length\">2:36</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"No, Not Today\"</td><td class=\"tracklist-length\">2:31</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Caught\"</td><td class=\"tracklist-length\">1:39</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Cutter Returns\"</td><td class=\"tracklist-length\">2:13</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"The Real Transported Man\"</td><td class=\"tracklist-length\">2:28</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Man's Reach Exceeds His Imagination\"</td><td class=\"tracklist-length\">2:08</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Goodbye to Jess\"</td><td class=\"tracklist-length\">2:53</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Sacrifice\"</td><td class=\"tracklist-length\">5:15</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"The Price of a Good Trick\"</td><td class=\"tracklist-length\">5:05</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"The Prestige\"</td><td class=\"tracklist-length\">1:40</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"The Tesla\"</td><td class=\"tracklist-length\">1:30</td></tr></tbody></table><p>Some critics were disappointed with the score, acknowledging that while it worked within the context of the film, it was not enjoyable by itself. Jonathan Jarry of SoundtrackNet described the score as \"merely functional,\" establishing the atmosphere of dread but never taking over. Although the reviewer was interested with the score's notion, Jarry found the execution was \"extremely disappointing.\"</p><p>Christopher Coleman of Tracksounds felt that though it was \"...a perfectly fitting score,\" it was completely overwhelmed by the film, and totally unnoticed at times. Christian Clemmensen of Filmtracks recommended the soundtrack for those who enjoyed Julyan's work on the film, and noted that it was not for those who expected \"any semblance of intellect or enchantment in the score to match the story of the film.\" Clemmensen called the score lifeless, \"constructed on a bed of simplistic string chords and dull electronic soundscapes.\"</p><p>The song \"Analyse\" by Radiohead frontman Thom Yorke is played over the credits.</p><h4>Home media</h4><p>The Region 1 disc is by Buena Vista Home Entertainment, and was released on February 20, 2007, and is available on DVD and Blu-ray formats. The Warner Bros. Region 2 DVD was released on March 12, 2007. It is also available in both BD and regionless HD DVD in Europe (before HD DVD was canceled). Special features are minimal, with the documentary Director's Notebook: The Prestige – Five Making-of Featurettes, running roughly twenty minutes combined, an art gallery and the trailer. Nolan did not contribute to a commentary as he felt the film primarily relied on an audience's reaction and did not want to remove the mystery from the story.</p><p>The film was released by Warner Bros. Home Entertainment on Ultra HD Blu-ray on December 18, 2017 in the United Kingdom. The film was also released by Touchstone Home Entertainment on Ultra HD Blu-ray on December 19, 2017 in the United States.</p><br/>"
  },
  "errorMessage": ""
}