{
  "imDbId": "tt0034583",
  "title": "Casablanca",
  "fullTitle": "Casablanca (1942)",
  "type": "Movie",
  "year": "1942",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-casablanca-1942",
      "rate": "100",
      "content": "The dialogue is so spare and cynical it has not grown old-fashioned. Much of the emotional effect of Casablanca is achieved by indirection; as we leave the theater, we are absolutely convinced that the only thing keeping the world from going crazy is that the problems of three little people do after all amount to more than a hill of beans."
    },
    {
      "publisher": "Empire",
      "author": "Angie Errigo",
      "link": "https://www.empireonline.com/movies/reviews/casablanca-review/",
      "rate": "100",
      "content": "Much more fun than its stuffy \"Greatest Film Ever Made\" tag suggests, with a literate script, stylish direction, a great song and cinema's most romantic couple in Bogie and Bergman."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/casablanca",
      "rate": "100",
      "content": "Casablanca accomplishes that which only a truly great film can: enveloping the viewer in the story, forging an unbreakable link with the characters, and only letting go with the end credits."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Jeremiah Kipp",
      "link": "",
      "rate": "100",
      "content": "The film has a peculiar magic to it, and because of its pace the richness of its sense of detail often goes unnoticed."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2012/feb/09/casablanca-review",
      "rate": "100",
      "content": "Seventy years on, this great romantic noir is still grippingly powerful: a movie made at a time when it was far from clear the Nazis were going to lose."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1942/film/reviews/casablanca-2-1200413952/",
      "rate": "100",
      "content": "Despite the fact that the fortunate turn or military events has removed the city of Casablanca, in French Morocco, from the Vichyfrance sphere and has thus in one respect dated the film, the combination of fine performances, engrossing story and neat direction make that easily forgotten. Film should be a solid moneymaker everywhere."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "https://www.newyorker.com/culture/culture-desk/everybody-comes-to-ricks-casablanca-on-the-big-screen",
      "rate": "100",
      "content": "The most familiar movie in the world is still fresh; it has so many little busy corners to nestle in... Casablanca is the most sociable, the most companionable film ever made. Life as an endless party."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/films/2016/05/16/casablanca-michael-curtizs-1942-film-is-a-classic-love-story---w/",
      "rate": "100",
      "content": "There are some of the very finest character actors that Warner Brothers could muster and a rich, detailed screenplay studded with an indecent number of sparklingly quotable lines. It is a movie to play again, and again."
    },
    {
      "publisher": "Village Voice",
      "author": "Serena Donadoni",
      "link": "",
      "rate": "100",
      "content": "Casablanca was filmed in the safety of the Warner Bros. lot, but the cast of immigrants and exiles who had fled the Third Reich conveyed their visceral fear. While the future was uncertain, the resolute characters of this exquisite wartime drama found peace through love and resistance."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/casablanca-review-1942-movie-752498/",
      "rate": "100",
      "content": "Here is a drama that lifts you right out of your seat."
    }
  ],
  "errorMessage": ""
}