{
  "imDbId": "tt0034583",
  "title": "Casablanca",
  "fullTitle": "Casablanca (1942)",
  "type": "Movie",
  "year": "1942",
  "items": [
    {
      "username": "slokes",
      "userUrl": "https://www.imdb.com/user/ur2375356",
      "reviewLink": "https://www.imdb.com/review/rw1000255",
      "warningSpoilers": false,
      "date": "16 January 2005",
      "rate": "10",
      "helpful": "349 out of 406 found this helpful.",
      "title": "The Fundamental Things Apply...",
      "content": "\"Casablanca\" remains Hollywood's finest moment, a film that succeeds on such a vast scale not because of anything experimental or deliberately earthshaking in its design, but for the way it cohered to and reaffirmed the movie-making conventions of its day. This is the film that played by the rules while elevating the form, and remains the touchstone for those who talk about Hollywood's greatness.It's the first week in December, 1941, and in the Vichy-controlled African port city of Casablanca, American ex-pat Rick Blaine runs a gin joint he calls \"Rick's Cafe Americaine.\" Everybody comes to Rick's, including thieves, spies, Nazis, partisans, and refugees trying to make their way to Lisbon and, eventually, America. Rick is a tough, sour kind of guy, but he's still taken for a loop when fate hands him two sudden twists: A pair of unchallengeable exit visas, and a woman named Ilsa who left him broken-hearted in Paris and now needs him to help her and her resistance-leader husband escape.Humphrey Bogart is Rick and Ingrid Bergman is Ilsa, in roles that are archetypes in film lore. They are great parts besides, very multilayered and resistant to stereotype, and both actors give career performances in what were great careers. He's mad at her for walking out on him, while she wants him to understand her cause, but there's a lot going on underneath with both, and it all spills out in a scene in Rick's apartment that is one of many legendary moments.\"Casablanca\" is a great romance, not only for being so supremely entertaining with its humor and realistic-though-exotic wartime excitement, but because it's not the least bit mushy. Take the way Rick's face literally breaks when he first sees Ilsa in his bar, or how he recalls the last time he saw her in Paris: \"The Germans wore gray, you wore blue.\" There's a real human dimension to these people that makes us care for them and relate to them in a way that belies the passage of years.For me, and many, the most interesting relationship in the movie is Rick and Capt. Renault, the police prefect in Casablanca who is played by Claude Rains with a wonderful subtlety that builds as the film progresses. Theirs is a relationship of almost perfect cynicism, one-liners and professions of neutrality that provide much humor, as well as give a necessary display of Rick's darker side before and after Ilsa's arrival.But there's so much to grab onto with a film like this. You can talk about the music, or the way the setting becomes a living character with its floodlights and Moorish traceries. Paul Henreid is often looked at as a bit of a third wheel playing the role of Ilsa's husband, but he manages to create a moral center around which the rest of the film operates, and his enigmatic relationship with Rick and especially Ilsa, a woman who obviously admires her husband but can't somehow ever bring herself to say she loves him, is something to wonder at.My favorite bit is when Rick finds himself the target of an entreaty by a Bulgarian refugee who just wants Rick's assurance that Capt. Renault is \"trustworthy,\" and that, if she does \"a bad thing\" to secure her husband's happiness, it would be forgivable. Rick flashes on Ilsa, suppresses a grimace, tries to buy the woman off with a one-liner (\"Go back to Bulgaria\"), then finally does a marvelous thing that sets the whole second half of the film in motion without much calling attention to itself.It's not fashionable to discuss movie directors after Chaplin and before Welles, but surely something should be said about Michael Curtiz, who not only directed this film but other great features like \"Captain Blood\" and \"Angels With Dirty Faces.\" For my money, his \"Adventures Of Robin Hood\" was every bit \"Casablanca's\" equal, and he even found time the same year he made \"Casablanca\" to make \"Yankee Doodle Dandy.\" When you watch a film like this, you aren't so much aware of the director, but that's really a testament to Curtiz's artistry. \"Casablanca\" is not only exceptionally well-paced but incredibly well-shot, every frame feeling well-thought-out and legendary without distracting from the overall story.Curtiz was a product of the studio system, not a maverick like Welles or Chaplin, but he found greatness just as often, and \"Casablanca,\" also a product of the studio system, is the best example. It's a film that reminds us why we go back to Hollywood again and again when we want to refresh our imaginations, and why we call it \"the dream factory.\" As the hawker of linens tells Ilsa at the bazaar, \"You won't find a treasure like this in all Morocco.\" Nor, for that matter, in all the world."
    },
    {
      "username": "Jaymay",
      "userUrl": "https://www.imdb.com/user/ur0401212",
      "reviewLink": "https://www.imdb.com/review/rw0026277",
      "warningSpoilers": false,
      "date": "23 August 2003",
      "rate": "10",
      "helpful": "1,031 out of 1,097 found this helpful.",
      "title": "HOW TO WATCH THIS MOVIE",
      "content": "There are literally hundreds of comments about this movie on IMDB. Many of them exhort its greatness. I don't disagree with them.But I'd like to add a suggestion to those of you out there who haven't seen this film. I'd like to tell you HOW to watch it.The people who made this movie didn't think they were producing a masterpiece. Bergman left the shoot disgusted. The screenwriters were on salary for Warners, writing half a dozen movies a year, and this was just one more. Bogie was punching the clock in the middle of a workhorse career.So as an audience member, you can't sit down expecting gilded greatness.Don't have a Casablaca party. Don't watch it on your first date, hoping it will lend that \"Romantic Touch.\" Don't watch it as part of your \"I need to watch the Best 10 movies of all time\" Film School project.Buy this movie on DVD. Have it at the ready. And then, one Friday night, when your plans fall through and you find it's 10:30pm and there's nothing on TV that's any good, open a six pack of beer, or pour yourself some wine, and watch this movie in a darkened room.The characters in Casablanca are absolutely devoid of sentimentalism. Every one of them sees the world without a hint of rose color in their lenses. As Rick says, \"Three little people don't amount to a hill of beans in this big old world.\" If you're in a mood where you understand what he's saying, watch this movie and it will transport you.There is no single movie that deserves to be called the best movie of all time. Because movies, when all is said and done, don't amount to a hill of beans. They are meant to entertain us, not for us to worship THEM.But no movie has ever known this fact like Casablanca. If you watch Casablance this way, with no expectations, with no \"hype,\" you might catch 10 percent of its greatness on one viewing. And that will be enough to start you on your way.Happy viewing, kid."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1310037",
      "warningSpoilers": false,
      "date": "8 March 2006",
      "rate": "10",
      "helpful": "149 out of 185 found this helpful.",
      "title": ".....it's still the same old story, a fight for love and glory, a case of do or die, the world will always welcome lovers, As Time Goes By.\"",
      "content": "It's one of the great Hollywood legends how George Raft helped make Humphrey Bogart a leading man by turning down in succession, High Sierra, The Maltese Falcon, and Casablanca. Maybe Raft showed some good sense in letting a better actor handle those roles. In any event we've got some proof in the case of Casablanca.Check out some time a film called Background to Danger that Warner Brothers did with George Raft that also featured Peter Lorre and Sydney Greenstreet. Had Raft ever done Casablanca the film would have been a routine action/adventure story just like Background to Danger. Instead with Bogey we get that, but also one of the great love stories of the century. Humphrey Bogart set the standard for playing expatriate American soldiers of fortune in Casablanca. Right now he's between wars running Rick's Cafe Americain in Casablanca in Morocco, an area controlled for the moment by the Vicky French government. He's got his fingers in a whole lot of pies, but Bogey operates with his own code of ethics. He sticks his neck out for nobody.Nobody except the great love of his life Ingrid Bergman who left him mysteriously in Paris as he was fleeing the oncoming German occupation. She walks back into his life with a husband, Paul Henreid who is a well known anti-fascist leader.The rest of the film is a contest for Bogey's soul. Torn between his great love, his own anti-fascist beliefs, and certain practical necessities of operating a liquor and gaming establishment in a hostile environment. So many things combine to make Casablanca the great film it is. Ingrid Bergman's lovely incandescence melding and melting Bogey's cynical screen persona. The indelible characterizations of Peter Lorre, Sydney Greenstreet, Claude Rains, Conrad Veidt and the whole rest of a 100% perfectly cast film. And the revival of a great ballad which serves as Casablanca's theme song.I say revival because As Time Goes By was introduced in 1931 in the George White Scandals on Broadway by Rudy Vallee. He made a record of it which sold quite a few disks back then. But by the merest of coincidences there was a strike that lasted two years that just began around the time Casablanca came out. The Musicians Union struck against the record companies. With no new records being made RCA Victor re-released Vallee's record and it became a monster hit on revival.Also when Casablanca came out as if the White House had a personal interest in the film FDR and Churchill had the first of their wartime conferences in----Casablanca of all places. Jack Warner must have said a prayer for that to happen.There are so many classic scenes and lines from Casablanca you can write a comment just by listing them. But my favorite has always been when the Germans have taken over Rick's place and are singing some of their songs, Paul Henreid goes to orchestra leader and asks him to lead La Marsellaise. With a nod from Bogey, the orchestra plays, Henreid leads them and the rest of the non-Germans in the cafe join in. Over 60 years later, one still gets a thrill from that act of defiance.Bogart and Rains were nominated for Best Actor and Best Supporting Actor. Any of the others could have been as well. As I said before Casablanca is perfectly cast right down to minor roles like Curt Bois as a pickpocket, John Qualen as a fellow resistance leader, and S.Z. Sakall as a waiter at Rick's. If there was an award for ensemble cast, Casablanca would have won it. As it was it did win for Best Picture of 1943 and best director for Michael Curtiz.Casablanca will be seen and loved by filmgoers for generations unto infinity, as time goes by."
    },
    {
      "username": "kdryan",
      "userUrl": "https://www.imdb.com/user/ur0529895",
      "reviewLink": "https://www.imdb.com/review/rw0960403",
      "warningSpoilers": false,
      "date": "10 November 2004",
      "rate": "10",
      "helpful": "608 out of 686 found this helpful.",
      "title": "A masterwork for all time...",
      "content": "There is a scene about halfway through the movie Casablanca that has become commonly known as 'The Battle of the Anthems' throughout the film's long history. A group of German soldiers has come into Rick's Café American and are drunkenly singing the German National Anthem at the top of their voice. Victor Lazlo, the leader of the French Resistance, cannot stand this act and while the rest of the club stares appalled at the Germans, Lazlo orders the band to play 'Le Marseilles (sic?)' the French National Anthem. With a nod from Rick, the band begins playing, with Victor singing at the top of HIS voice. This in turn, inspires the whole club to begin singing and the Germans are forced to surrender and sit down at their table, humbled by the crowd's dedication. This scene is a turning point in the movie, for reasons that I leave to you to discover. As I watched this movie again tonight for what must be the 100th time, I noticed there was a much smaller scene wrapped inside the bigger scene that, unless you look for it, you may never notice. Yvonne, a minor character who is hurt by Rick emotionally, falls into the company of a German soldier. In a land occupied by the Germans, but populated by the French, this is an unforgivable sin. She comes into the bar desperately seeking happiness in the club's wine, song, and gambling. Later, as the Germans begin singing we catch a glimpse of Yvonne sitting dejectedly at a table alone and in this brief glimpse, it is conveyed that she has discovered that this is not her path to fulfillment and she has no idea where to go from there. As the singing progresses, we see Yvonne slowly become inspired by Lazlo's act of defiance and by the end of the song, tears streaming down her face, she is singing at the top of her voice too. She has found her redemption. She has found something that will make her life never the same again from that point on. Basically, this is Casablanca in a nutshell. On the surface, you may see it as a romance, or as a story of intrigue, but that is only partially correct.The thing that makes Casablanca great is that it speaks to that place in each of us that seeks some kind of inspiration or redemption. On some level, every character in the story receives the same kind of catharsis and their lives are irrevocably changed. Rick's is the most obvious in that he learns to live again, instead of hiding from a lost love. He is reminded that there are things in the world more noble and important than he is and he wants to be a part of them. Louis, the scoundrel, gets his redemption by seeing the sacrifice Rick makes and is inspired to choose a side, where he had maintained careful neutrality. The stoic Lazlo gets his redemption by being shown that while thousands may need him to be a hero, there is someone he can rely upon when he needs inspiration in the form of his wife, who was ready to sacrifice her happiness for the chance that he would go on living. Even Ferrai, the local organized crime leader gets a measure of redemption by pointing Ilsa and Lazlo to Rick as a source of escape even though there is nothing in it for him. This is the beauty of this movie. Every time I see it (and I have seen it a lot) it never fails that I see some subtle nuance that I have never seen before. Considering that the director would put that much meaning into what is basically a throw away moment (not the entire scene, but Yvonne's portion) speaks bundles about the quality of the film. My wife and I watched this movie on our first date, and since that first time over 12 years ago, it has grown to be, in my mind, the greatest movie ever made."
    },
    {
      "username": "smatysia",
      "userUrl": "https://www.imdb.com/user/ur0111731",
      "reviewLink": "https://www.imdb.com/review/rw0970471",
      "warningSpoilers": false,
      "date": "30 November 2004",
      "rate": "10",
      "helpful": "26 out of 29 found this helpful.",
      "title": "Here's looking at Ingrid Bergman",
      "content": "Wow! Ingrid Bergman was at her best in this one, as well as her most sad, doe-eyed, beautiful. The part of Rick seemed made for Bogey, with the snappy repartee, and the cynical shell around what Renault refers to as \"a rank sentimentalist\". It seems like every time I see this film I notice something new. This time it had to do with the Bulgarian woman, Annina Brandel, who Rick rescues from the carnal plotting of Captain Renault. I never gave this scene much thought, just assuming that it was a way to plumb the limits of Rick's cynicism, as noted above. But later, during the scene where Ilsa tells Rick that she'll stay with him if he will use the letters of transit for Laszlo, I realized that the two scenes were a common theme, that Rick realizes he'd be no different from Renault if he followed through with that. I guess one gets lazy seeing modern Hollywood fare. Nowadays, the director would have used a flashback image or something, in order to bludgeon the viewer with the correlation. But back then, with a better-educated public, one could allow audiences to discover things for themselves. It was also skillful how these films could be more or less suitable for children, as well as adults. When I saw this film as a child, it never occurred to me that Rick and Ilsa had had sex. But the clues, while too subtle for a child, were pretty obvious to me as a man. Like many people this film is my all-time favorite. Grade: A+++++"
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw0026010",
      "warningSpoilers": false,
      "date": "17 May 2001",
      "rate": "",
      "helpful": "105 out of 133 found this helpful.",
      "title": "As time goes by, it's still one of the all-time greats...",
      "content": "While my personal Bogey favorite is still his Sam Spade in 'The Maltese Falcon', his cynical nightclub owner, Rick, in 'Casablanca', is also a standout. Rather than some \"off the cuff\" comments, I'll quote instead from my article on Claude Rains (from March 2000 issue of CLASSIC IMAGES) that pretty well sums up the film:\"It was 1943's 'Casablanca', bustling with melodramatic wartime intrigue, that really put him (Claude Rains) in the forefront as one of the screen's smoothest character actors, almost--but not quite--stealing the film from Humphrey Bogart and Ingrid Bergman, as the uniformed Captain Louis Renault who investigates the goings-on at Rick's notorious cafe. Nobody associated with the film guessed that it would become a screen classic, least of all its director, Michael Curtiz, the prolific WB director to whom it was just another assignment. It went on to win the Oscar for Best Film of 1943 with an award for Curtiz' taut direction.Oddly enough, the film's memorable airport ending was written and conceived just shortly before filming wrapped up, with neither Bergman nor Bogart knowing whether or not she would leave him for husband Paul Henried. Wartime audiences loved the film. Sydney Greenstreet, Conrad Veidt, Victor Francen and Peter Lorre all gave sterling performances and Rains was again nominated for Best Supporting actor.\"And by the way, I disagree with a former comment indicating the black and white photography of this film was primitive as compared to today's. Incredible nonsense!! As a matter of fact, the film's black and white cinematography was nominated for an Oscar!Ingrid Bergman was at the peak of her radiant beauty in this one--and Bogey was firing on all six cylinders. Great chemistry! As time goes by, we still have 'Casablanca'..."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0026057",
      "warningSpoilers": false,
      "date": "6 December 2001",
      "rate": "",
      "helpful": "103 out of 129 found this helpful.",
      "title": "A Classic Worth Remembering",
      "content": "While there's not anything new to be said about \"Casablanca\", it's good to see one of the classics still getting some attention. By most standards it is at least very good, and there are good reasons why so many still remember it so fondly. Not everyone who watches it today shares the opinion that it is a classic, but it's still good to see fans of modern movies giving it a try for themselves.The cast is one of its main strengths, not just Bogart and Bergman but also the fine supporting cast. Rains, Greenstreet, Lorre, and the others are indispensable to the atmosphere and the story, and each has some very good moments. It does have its imperfections, but it was not expected to be a classic or blockbuster - everything you read about the production suggests that it was made in a rather slap-dash fashion, under constraints that would have wrecked most other films. It's not hard to see the little ways that this affected the finished product, such as the times when the plot strains credibility a bit, or the characters seem to behave somewhat oddly. (In particular, it might have been even more satisfying if Bergman's character had been a little stronger - Ilsa is charming, but that's entirely thanks to what Bergman does with her; the character herself as written seems somewhat shallow.)But it turned out anyway to be an excellent combination of actors, characters, and story, a combination that more than makes up for everything else. Different viewers probably remember and enjoy \"Casablanca\" for different reasons, because it seemingly has a little of everything. While perhaps not perfect, it is well worth remembering and watching."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1998393",
      "warningSpoilers": false,
      "date": "30 December 2008",
      "rate": "10",
      "helpful": "54 out of 67 found this helpful.",
      "title": "A perfect film.",
      "content": "Although I have so far reviewed over 5700 films, I haven't yet reviewed CASABLANCA--mostly because nothing I can say about the film can add to the many excellent and insightful reviews for this cinematic masterpiece. But, having seen it several times, I guess it's worth at least saying a few words out the film.Although Humphrey Bogart is one of the finest actors ever and he made many, many wonderful films, I think it's not much of a stretch to say this is his best performance and best film. He was perfect for the world-weary and cynical Rick. Sure, African QUEEN, THE CAINE MUTINY and several other of his films were brilliant, but none come close to CASABLANCA because in my opinion CASABLANCA is a perfect film--or about as close to one as you can find. If IMDb were not so heavily weighted in favor of newer films (just look at the top 250), it probably would be at the top of the list. For example, you can't seriously think that THE SHAWSHANK REDEMPTION and THE DARK KNIGHT are better films, though they both are ranked higher on the list. Now this isn't to say these are bad films--heck they are terrific,...just not in the same category as CASABLANCA.Aside from Bogart, the film also is directed perfectly by Michael Curtiz--with excellent pacing, atmosphere and charm. The supporting cast is amazing--one of the best you could find in a film. In addition to the great stock Warner Brothers character actors (such as Sydney Greenstreet, Peter Lorre and Cuddles Sakall), Conrad Veidt is the perfect scary Nazi, Claude Rains is his usual wonderful self, Ingrid Bergman luminous and Paul Henreid, though a great actor, is somewhat lost among all the immense talent! Amazing music, a top script and all the style and quality that Warner Brothers could muster--this is my pick for top film ever. A fine romance and a fine film about people."
    },
    {
      "username": "Dockelektro",
      "userUrl": "https://www.imdb.com/user/ur0448368",
      "reviewLink": "https://www.imdb.com/review/rw0026232",
      "warningSpoilers": false,
      "date": "17 March 2003",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Now I finally know why this one is one of the best",
      "content": "Probably the most legendary movie of all time, I finally got to see it, it was a great hole in my movie-viewing history. And finally I got to understand why a classic movie like this has made its mark in history. The intricate political plot comes first, and sets the movie on a melting pot of the second world war, where everyone hopes and dies for an opportunity to reach the USA via Lisbon. This would provide sufficient material for hundreds of movies, but enter Humphrey Bogart, Ingrid Bergman, magnificent cinematography, role model storytelling, a perfect supporting cast, some of the best dialogue ever commited to celluloid and Dooley Wilson singing THAT song, and history was made. More than 60 years of jaw-drops are sufficient to give the sceptics a good reason to make them understand that this is probably the greatest classic movie of all times, and one of the best ever made in the past, present and future."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2458505",
      "warningSpoilers": true,
      "date": "14 July 2011",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "We'll always have \"Casablanca\" ...",
      "content": "A few movies managed to achieve such a legendary status. Think about it, all you have to do is to hum the first notes of 'As Time Goes By' ta-da ta-da ta-daaa and a whole universe resurrects in your memories, forever incarnated by these two profiles staring at each other, Humphrey Bogart in the iconic trench-coat of his career-defining role, and Ingrid Bergman, as gracious as ever.One word : \"Casablanca\", and a gallery of characters revives, Sam, the piano player, these unforgettable second-billed actors who graced the silver screen in these black and white days, Conrad Veidt, Sidney Greenstreet, Peter Lorre, an international cast and so many immortal scenes, Rick Blaine's bourbon-driven melancholy while remembering the good old days with Ilsa, the patriotic fervor expressed during the singing of La Marseillaise and probably the most emotional farewell scene ever, followed by \"the beginning of a beautiful friendship\" as the ending of a beautiful movie. Of course, the list would be incomplete without the mention of Michael Curtiz' masterful direction, the dazzling shadowy cinematography and the Esptein twins' perfect script that lurched the film into Pop-Culture : \"Here's looking at you, kid\", \"We'll always have Paris\" and so many unforgettable lines that became catchphrases on their own. But still, everything would all have been secondary if it wasn't for THE element that made \"Casablanca\" such a legendary film : it's a beautiful romance.60 years later, the movie still divides, should have Ilsa gone with Rick or Laszlo? The consensus is that she did the right choice, but there's no doubt that the truer love was Rick. The film perfectly captured the dilemma of a real triangular love as Ilsa's husband, Viktor Lazslo is fundamentally a good man, a heroic resistant fighter who escaped from a concentration camp, and the only man who inspired Rick Blaine a bit of admiration. As an ex-freedom fighter, Rick sure understands the value of courage and visibly, something from the past has metamorphosed his idealistic nature into the cynical and detached mask of a lone wolf figure. Who else than Humphrey Bogart could have played this role with such intensity? Intense but still profoundly romantic as the wound in Rick's heart opens when Lazslo comes back with Ilsa, Rick's former love, back then in Paris.The international atmosphere of the Rick's Café nightclub gives it a unique and absolutely endearing flavor spiced up that pivotal night, when Ilsa asks Sam to play 'As Time Goes By', we understand that this song has a poignant significance, as the last one she and Rick heard as lovers, before the War came and ruined everything. Ilsa ran out of Rick who, like most of the refugees, escaped from the German invasion leaving Paris to Marseilles, then Marseilles to Oran, and from Oran to Casablanca, in French Morocco, freed from the German control, to get visas to the neutral Portugal, the only way to America. Rick exiled himself in Casablanca, as if something was unconsciously keeping him within the War, and when he delivers the legendary : \"Of all the gin joints in all the towns in all the world, she walks into mine\" is he really lamenting? When Ilsa re-enters his life, his office, Rick's bitterness made him say the wrong words, but then he painfully realizes he still loves her, and that Lazlso took her from him.Lazslo and Ilsa need two 'letters of transit' to go to Lisbon, and by an ironic coincidence, Rick got those two tickets from a suave criminal named Ugarte who got them by murdering two German couriers. With the death of Ugarte, the two tickets for freedom were in Rick's hand and a great moral dilemma in his heart : contributing to the War effort and lose the love or his life, or following his motto : \"I stick my neck out for nobody\". Rick's true nature can't fool anyone, but the romance gains in complexity when Ilsa revealing to Rick why she left him, reconciles with him and realizes she loves him more than ever and can't leave him again. The romance is in a dead-end, and compromised by the antagonistic presence of the Major Heinrich Strasser who can't allow Lazzlo to escape. Strasser counts on the collaboration of Vichy's government, incarnated by Captain Renault, another character we still don't know where his heart belongs to, as he said : \"This is my least vulnerable spot\" Ultimately, and I guess this is what makes the movie so inspiring, as said Roger Ebert in his brilliant commentary, all the characters aren't bad people. Even the ambiguity of Captain Renault is a nice writing touch that allows to keep uncertain the role he's going to play, although the roulette episode proved his good heart. Even Greenstreet as the head of the criminal underworld and Rick's business rival accepts to buy him out and keep all the employees, even Yvonne, the French girl who dated a Nazi officer couldn't hide her tears when the Marseillaise was sung. Finally, the heroic nature of Rick Blaine prevailed as he decided to take care of everything, fooling Ilsa, Lazzslo, and Renault, but ultimately getting them in the plane. Renault also redeemed himself by the \"Round up the usual suspects\" to clear Rick of shooting Major Strasser before he could order to cancel the flight.Rick, #4 hero in the American Film Institute, explains his decision to Ilsa : \"I'm no good at being noble, but it doesn't take much to see that the problems of three little people don't amount to a hill of beans in this crazy world\". He's twice wrong. First, Rick is excellent at being noble. Secondly, now that WW2 is over but not \"Casablanca\"'s legendary status, whether you love old, classic, black and white films or not, you should ask yourself if the problems of three little problems aren't finally the essence of the most beautiful acts that humanity could inspire."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw1771694",
      "warningSpoilers": false,
      "date": "28 November 2007",
      "rate": "",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Wartime Themes",
      "content": "Love and sacrifice during WWII underlie the story about a café owner named Rick (Humphrey Bogart), and his link to two intellectual refugees from Nazi occupied France. Ilsa (Ingrid Bergman) and Victor Laszlo (Paul Henreid) seek asylum here in politically neutral Casablanca and, like other European refugees, gravitate to Rick's upscale café, near the city's airport, with its revolving searchlight.Rick is a middle-aged cynic who also has a touch of sentimentalism, especially for people in need, like Ilsa and Victor. The film's story is ideal for romantics everywhere.Much of the plot takes place inside Rick's café, an ornate nightclub with archways and high ceilings. Rick's is a gathering place for an eclectic mix of patrons, from locals to those who have arrived from countries throughout Europe. It's this deliciously international ambiance of Rick's café that renders this film so appealing, with a variety of interesting accents, clothes, and uniforms. And, of course, there's Sam, the piano player, who plays all the favorites, including \"As Time Goes By\".All of the film's technical elements are excellent including the script, with its colorful characters, like the debonair Captain Renault (Claude Rains); and Signor Ferrari (Sydney Greenstreet), the articulate and portly \"leader of all illegal activities in Casablanca\". And a minor character that made an impression on me was the guitar playing female singer at Rick's (Corinna Mura), whose beautifully operatic voice was an unexpected delight in this smoke filled saloon.The film's dialogue, though substantial, is clever and lively, like when Captain Renault observes Rick escorting an intoxicated woman out of the bar: \"How extravagant you are, throwing away women like that; some day they may be scarce\".High-contrast B&W lighting renders a noir look. And that pounding score at the film's beginning is stunning; it evokes a feeling of far-off adventure.\"Casablanca\" differs from traditional noir films, mostly as a result of its ending. Rick must make a choice between his own interests and the interests of others. The choice he makes enjoins viewers to a sense of courage and optimism, an individual's example of proper collective behavior in the war against Nazi Germany."
    },
    {
      "username": "Sober-Friend",
      "userUrl": "https://www.imdb.com/user/ur16178412",
      "reviewLink": "https://www.imdb.com/review/rw4104297",
      "warningSpoilers": false,
      "date": "25 March 2018",
      "rate": "10",
      "helpful": "31 out of 35 found this helpful.",
      "title": "A Perfect Film But Let's Clear Up A Few Rumors",
      "content": "In December 1941, American expatriate Rick Blaine owns an upscale nightclub and gambling den in Casablanca. \"Rick's Café Américain\" attracts a varied clientele, including Vichy French and German officials, refugees desperate to reach the still-neutral United States, and those who prey on them. Although Rick professes to be neutral in all matters, he ran guns to Ethiopia during its war with Italy and fought on the Loyalist side in the Spanish Civil War.Petty crook Ugarte boasts to Rick of \"letters of transit\" obtained by murdering two German couriers. The papers allow the bearers to travel freely around German-controlled Europe and to neutral Portugal, and are priceless to the refugees stranded in Casablanca. Ugarte plans to sell them at the club, and asks Rick to hold them. Before he can meet his contact, Ugarte is arrested by the local police under the command of Captain Louis Renault, the unabashedly corrupt Vichy prefect of police. Ugarte dies in custody without revealing that he entrusted the letters to Rick.Now let's clear up some rumors. Muh has been written about \"Casablanca\" but a few rumors often get repeated. One of them is Ingrid Bergman saying \"The screenplay was not completed when they started shooting\". That is not true. Warner Brothers never put a film into production unless they had a complete screenplay. Now they kept a few things secret from Ingrid Bergman. She did not have a complete screenplay. The director and Warners thought they would get a better performance out of her if she did not know a few things. However it was not uncommon for \"things to change\" while a film was in production. \"Casablanca was no exception! Another rumor was that Ronald Reagan was cast to play Ric! He was only \"thought of\" but for only a few seconds. Almost everyone in Hollywood was until Bogart was cast! Rumor #3 The film was an out of control production! This is not true! This was shot in 18 days. Another things people don't quit notice is how fast people talk in this film! The film runs 102 minutes. The screenplay is 125+ minutes. The average screenplay is one minute of screen time per written page! If this film was made by today's standards it would run almost 45 minutes longer.Now if you never seen the film you are lucky. The film is exciting as it is romantic. Not one minute of screen time is squandered. Today's filmmakers would not know how to make a film like this unless \"Batman\" plays Ric!"
    },
    {
      "username": "gpeevers",
      "userUrl": "https://www.imdb.com/user/ur3032357",
      "reviewLink": "https://www.imdb.com/review/rw4756476",
      "warningSpoilers": true,
      "date": "1 April 2019",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Greatest Film Ever for Me",
      "content": "Why do I consider this to be the greatest film ever, to begin with I consider it to be the most enjoyable film I have ever watched and the most re-watchable. The key ingredients in my mind include; wonderful dialogue (so many quotable oft repeated lines), amazing performances, a superb story that while relatively straightforward is also highly enjoyable and finally the great black and white cinematography. Beyond these ingredients its also a film moves quickly and I can't think of a single scene I found either uninteresting or unnecessary.For those that desire a synopsis, Rick (Humphrey Bogart) is an American expatriate running a popular nightclub in Casablanca a city under Vichy control. The cool disinterested facade Rick maintains is shaken when Ilsa (Ingrid Bergman) his former lover whom he thought dead appears suddenly in his club with her husband a resistance leader who requires safe passage out of German controlled territory. In order for the escape to succeed Rick must not only hide them from the Germans but also the local French police commander (Claude Raines) who is a friend but also a collaborator.My favorite performance here will always be that of Humphrey Bogart as Rick a man of nobility while evidencing ambivalence, but his performance is closely followed by the wonderful Claude Raines and the limited but iconic performances of Sydney Greenstreet and Peter Lorre. While Ingrid Bergman apparently did not enjoy her experience and it may not be among her greatest roles I thought it was still a great performance, and also that the chemistry between Bogart and herself was utterly convincing. Further I found both Paul Henreid in the thankless role of the other man in the love triangle and Conrad Veidt as the local German commander to be quite effective along with a good supporting cast.As I have seen more and more of Michael Curtiz films I have come to believe he is an underrated director, its true he was not an auteur but a studio director who made the films he was assigned and he was not apparently a pleasant person to work with he has did leave behind an incredible legacy of films."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2084081",
      "warningSpoilers": false,
      "date": "21 June 2009",
      "rate": "10",
      "helpful": "33 out of 42 found this helpful.",
      "title": "One of the best black and white films I have ever had the privilege of watching!",
      "content": "Casablanca is just an extraordinary film, if I had to describe it in one word, it would have to be perfection! I honestly don't care that it's an old film, I personally think that's not a convincing enough excuse for hating a film as wonderful as this , because you are seriously missing out, if you haven't seen it. The cinematography is just fantastic, with clever brooding camera-work. The music by Max Steiner is outstanding, from the sweeping haunting love theme As Time Goes By, to the excerpts of the french national anthem. The scene where everyone starts singing in the café was extraordinary and one of the many highlights of the film. The screenplay is unquestionably one of the finest in the history of cinema, right up there with Shawshank Redemption and All About Eve, containing great memorable lines such as \"seems as though Destiny is at hand\". The performances were superlative, Humphrey Bogart giving one of cinema's greatest lead performances as the \"cynical sentimentalist\" Rick Blain. Also superb are Ingrid Bergman who positively lights up the screen as Ilsa, the young woman who breaks his heart, Paul Henreid as the fugitive husband, and Claude Rains as Captain Renault. The plot is a little complicated, but I couldn't help being impressed with the performances and the screenplay. Not to mention a timeless love story that I don't think has ever been topped. Overall, a masterpiece, that quite rightly received an academy award for best picture. 10/10 Bethany Cox"
    },
    {
      "username": "jwpeel-1",
      "userUrl": "https://www.imdb.com/user/ur2187250",
      "reviewLink": "https://www.imdb.com/review/rw0026380",
      "warningSpoilers": false,
      "date": "11 August 2004",
      "rate": "",
      "helpful": "197 out of 250 found this helpful.",
      "title": "Of all the classics in all the films in all the world, this is the best!",
      "content": "This is a film that MUST belong in every video collection in the U.S. is not in the world. The stories about it's making are legendary from the constant rewrites to the apocrypha of casting stories.What is amazing to me, and the reason I believe it holds audiences almost spellbound in successive viewings, is the connection with the horrors of World War II was almost every single cast member. Sidney Greenstreet had lost a son in combat, and a number of the cast members fled Europe to escape the ravages of a Hitler regime. Even the evil Nazi character Major Strasser (played with relish by Conrad Veidt) had left Nazi Germany to escape almost sure internment and possible death in a concentration camp. Here was a man who was a legend in German film history as the murdering somnambulist (a possible warning about the Nazi soldiers to come?) and because of the vicious anti-Semitism and racism of the Germany of the '30s and '40s, we in America and in Hollywood were given a great gift.Everyone in this film is fabulous, but it is the chemistry of Rick (Bogart) and Ilsa (Bergman) been truly holds the film together. When I saw this film almost frame by frame in the limited book series of classic films that were produced in the late 1960s, I was stunned by the subtlety of facial expressions that conveyed so much of Rick Blaine's character by a marvelous actor Humphrey Bogart. There is a reason why he was named the actor of the century.While every person in the film becomes a real flesh and blood presence, the story of Rick and Ilsa is the center of this cinema feast.I must confess that I have seen this picture so many times that I can recite every single line in the movie to the consternation of my wife who can't watch it with me anymore. The line that sticks out the most for me, and which against cheers from New Yorkers whenever it plays in the theater. It is when Bogart says to the Nazis seated at his table, \"There are parts of New York I wouldn't advise you to invade.\" And what makes this line so memorable is that Humphrey Bogart did indeed star in another motion picture for Warner Brothers where that very thing formed the basis for the script. That movie was \"All Through The Night.\" I love this movie too, and I'm not even a New Yorker.There have been many attempts to revisit \"Casablanca,\" but only the original makes you really feel what it was like to live through \"The Good War\" in a faraway place like Casablanca in French Morocco.Even though such trickery as midget airport workers, fog machines and cardboard cutout airplanes were utilized, this film convinces through its beautiful story with many layers, and characters that are so well realized.If you've never seen this movie before, shame on you and see it immediately. If you only seen it once, I believe you will come back to it more than once. This is just about the most perfect film ever made and it is a miracle that that is so considering that there were so many hands in the pie. (Excuse me for my mixing my metaphors. It's late, and I get emotional just thinking about this classic film masterpiece.)Play it again and again and again and again, Sam."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0026164",
      "warningSpoilers": true,
      "date": "28 November 1999",
      "rate": "10",
      "helpful": "73 out of 97 found this helpful.",
      "title": "Cinema par Excellence!",
      "content": "Michael Curtiz's \"Casablanca\" opens on maps while a narrator gives a detailed exposition of the many twists and turns of Casablanca in the French Morocco, as a refugee route from wartime Europe...The Nazi envoy, Major Heinrich Strasser puts it: 'Human life is cheap in Casablanca.\" Of course because a man may be executed in its crowded market before Marshal Pétain's portrait or where a charming girl may guarantee an exit visa by spending her night with the Prefect of Police...Rick's Café is the point of intersection, the espionage center, the background for Allied offensive, the focal point as refugees from Nazi-occupied Europe seek to gain exit visas to Lisboa... The interesting club so well organized, leads to an open arena of conspiracy, counterspies, secret plans, black market transactions, in which the games and fights are between arrogant Nazis, patriotic French, idealists, murderers, pickpockets and gamblers around a roulette wheel, where a ball could rest on Rick's command against the settled number 22...\"Casablanca\" is an adventure film which victory is not won with cannons and guns... The action, the fight, the war takes place inside Rick's walls rather than outside...But who is this Rick? What is his magical power? His secret weapon? Rick is the anti-fascist with hard feelings, the former soldier of fortune who has grown tired of smuggling and fighting, and is now content to sit out the war in his own neutral territory... Even loyalty to a friend doesn't move him as he refuses to help Ugarte, a desperately frightened little courier who is fleeing from the police...Emphatically, Rick says, \"I stick my neck out for nobody.\" But we know he will do just that in a very short time, for into his quiet life comes a haunting vision from his past, the beautiful woman he still loves and bitterly remembers... She is married to an underground leader and she desperately needs those papers Rick conveniently now has in his possession... The cynical Rick's facade of neutrality begins to weaken as he recalls the bittersweet memories of his past love affair, memories triggered repeatedly when the strains of \"As Time Goes By\" come from Sam, his piano-playing confidante...But \"Casablanca\" basic message is a declaration of self-sacrifice... War World II demanded all! The words stated by Rick at the airport had their impact: 'The problems of three people don't amount to a hill of beans in this crazy world.' It goes without saying that Bogart is incomparable when he seems most like himself... His way with a line makes \"Casablanca\" dialog part of the collective memory: 'I remember every detail. The Germans wore gray. You were blue.' Intermixed in this intrigue are all the fascinating and beautifully acted supporting roles With his customary skill, Claude Rains plays Major Renault, a prefect of police who is like Bogart in many ways... He, too, claims neutrality, but is definitely against the Nazis... He is Rick's most devoted adversary, tauntingly calling the man a \"sentimentalist\" and delivering his share of cynically amusing lines... When he makes a small bet and is encouraged to make a bigger one, he remarks that he is only a \"poor corrupt official.\" Ingrid Bergman is fascinating as the lovely heroine, the mysterious impossible woman of an impossible love, the tender mood of every man, the love-affair, the quality of being romantic, the traditional woman enclosed by two rivals, symbol of a besieged Europe...Paul Henreid is Victor Laszlo, the anti-Nazi resistance leader, seeking in Morocco the two letters of transit signed by General De Gaulle...Sidney Greenstreet is the black marketeer on good terms with Rick, the rival owner of the 'Blue Parrot,' the acceptable face of corruption...Peter Lorre is Ugarte, the racketeer, the dealer of anything illegal, the killer, driven into a corner by the Vichy police, who has given Rick two letter of transit...Conrad Veidt is the very essence of German rigidity, unfeeling, unconcerned about life, but firmly believing in the foolish ideology of his Nazi compatriots...\"Casablanca\" covers many highlights: The Marseillaise against the Horst Wessel song inspiring sequence; the blissful days in Paris; Ilsa's emotional words to Rick in occupied Paris; the champagne toast; Ilsa's request to Sam; the poetry of the magic words and the beautiful voice of Dooley Wilson; Captain Renault's words in the airport; and the farewell...The magic that developed from the teaming of Bogart and Bergman is enough to make a new romantic figure out of the former tough guy... To his cynicism, his own code of ethics, his hatred of the phoniness in all human behavior, he now added the softening traits of tenderness and compassion and a feeling of heroic commitment to a cause... They helped him complete the portrayal of the ideal man who all men wished to rival...One can look at hundreds of films produced during this period without finding any whose composite pieces fall so perfectly into place... Its photography is outstanding, the music score is inventive, the editing is concise and timed perfectly... Bogart's and Bergman's love scenes create a genuinely romantic aura, capturing a sensitivity between the two stars one would not have believed possible...\"Casablanca\" is a masterpiece of entertainment, an outstanding motion picture which brought Bogart his first Academy Award nomination (he lost to Paul Lukas for \"Watch On the Rhine\") and won Awards for Best Picture of the Year, Best Director and Best Screenplay..."
    },
    {
      "username": "gigan-92",
      "userUrl": "https://www.imdb.com/user/ur20916867",
      "reviewLink": "https://www.imdb.com/review/rw2559245",
      "warningSpoilers": false,
      "date": "1 February 2012",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "\"It seems destiny has taken a hand.\"",
      "content": "This film is a monumental piece of film history. I can honestly it might just be one of the best movies of all time. If anything, you have to acknowledge the writing. Almost every single line of dialogue in the film is a household terminology to this day, most people paying tribute to the film without even knowing it. That's why I wanted to use a less popular quote for the title, and it has its own meanings within the film. Another joy of the film is composer Max Steiner; yes, Max Steiner of 1933's \"King Kong\". His music is timeless, and he captures the mystery and romance of the film perfectly.It's definitely a love story at a glance, one of the best ever told if not so, but I view it more as a story of sacrifice, on the part of both lovers. The film is also a piece of history, taking place during the Second World War It entails a time when the Third Reich's immense shadow was cast over all of Europe, and the film portrays this quite nicely. However the film is about more than Charlie Chaplin poking fun at the Nazi Party (gotta love Chaplin). There is quite a bit of nicely done comedy within the weaving of it all, but it's balanced just right.I'm not sure if it qualifies as a film noir exactly, but Rick (Humphrey Bogart) is cynical enough to fit the bill and the use of shadows is quite extraordinary. The setting and lighting during the best scenes of the movie are darkened rooms, making it all the more intense. As I said before, Rick, with his sarcasm and pessimism, is one of my favorite characters of all time. To me the movie is about him most of all. He sees the events taking place before him, knows he must act, but for a while chooses not to. The beauty of it all is that we know why and we feel for him.All the performances are incredible. Like all golden era Hollywood flicks of the 50s, it draws our attention without the use of bloodshed and sexuality. Although don't be mistaken, it is indeed used here and very subtly I add. Its takes a film lover's eyes and ears to catch it, and the story telling is just marvelous.One cannot be a true fan of cinema without having seen \"Casablanca\"."
    },
    {
      "username": "Danimal-7",
      "userUrl": "https://www.imdb.com/user/ur0421533",
      "reviewLink": "https://www.imdb.com/review/rw0026141",
      "warningSpoilers": true,
      "date": "27 August 1999",
      "rate": "10",
      "helpful": "83 out of 103 found this helpful.",
      "title": "For all-around entertainment, the best I've ever seen",
      "content": "CASABLANCA is the best treatment ever of the ancient theme of the love triangle. Set in World War II Casablanca, a Moroccan city under the control of the collaborationist Vichy French government, the movie starts with a news wire that two German couriers have been murdered and their letters of transit stolen. Each letter will permit one person to leave Casablanca to a neutral country.Enter Humphrey Bogart as Rick Blaine, owner of the shady but cheerful Cafe Americaine. Rick is a cynical and hard-nosed man whose motto is, \"I stick my neck out for nobody.\" Like many a cynic, Rick is an embittered ex-idealist, still nursing his wounds from being abandoned by his lover Ilsa (Ingrid Bergman). By chance he falls into possession of the missing letters of transit.Enter Ilsa, who comes to Casablanca on the arm of Czech Resistance leader Victor Laszlo (Paul Henreid), a few steps ahead of the Nazi police. We now have three people and two letters of transit. Who will reach America, and who will stay in Casablanca?I know no other movie that so perfectly balances humor, romance, and drama. The soul of good drama lies in presenting characters with hard choices, and few choices are as hard, or as illuminating of the protagonists' makeup, as the choices in CASABLANCA. All of the characters must decide what they will give up for love, for honor, and for themselves. The scenes of Rick and Ilsa's love, years ago in Paris, are some of the finest romantic scenes in cinema. And the humor, particularly in the person of Casablanca's Prefect of Police, Louis Renault, has contributed dozens of dry witticisms to our everyday language - \"I am shocked! Shocked! - \"The Germans wore gray, you wore blue.\" - \"I was misinformed.\" - \"It would take a miracle to get you out of Casablanca, and the Germans have outlawed miracles.\" So perfectly blended are these three major elements that you cannot point to a single shot or scene that should have been eliminated from the movie. Never try to watch only one scene from CASABLANCA; you will inevitably be absorbed until the very end of the film. It is little short of miraculous that the chaotically mismanaged shooting of this movie resulted in such a magnificent final product; it speaks volumes for luck and for Owen Marks' and Michael Curtiz' post-production editing.I have never encountered a movie whose supporting cast was so perfectly realized. Every minor character is a fleshed-out, realistic individual, from Sasha to Carl the headwaiter to Rick's competitor Ferrari to the self-effacing criminal Ugarte. Claude Rains' Captain Renault (\"I'm only a poor corrupt official\") steals scene after scene, and Dooley Wilson's Sam is a refreshingly loyal, charismatic and sympathetic conception from an era when almost all black characters were rendered as demeaning stereotypes. The only character who tastes of the cliche is the villainous Major Strasser, which can be forgiven in a wartime production.The only film I have ever seen as tautly effective as CASABLANCA is GLORY. Although the 54th Mass.'s story is arguably superior even to CASABLANCA for sheer dramatic power and acting talent, GLORY lacks CASABLANCA's wonderful humor and romance, which causes me to give the edge to Curtiz' classic as the better-rounded movie. I have yet to see CASABLANCA surpassed.Rating: **** out of ****."
    },
    {
      "username": "RWiggum",
      "userUrl": "https://www.imdb.com/user/ur0420183",
      "reviewLink": "https://www.imdb.com/review/rw0026321",
      "warningSpoilers": false,
      "date": "29 March 2004",
      "rate": "10",
      "helpful": "514 out of 598 found this helpful.",
      "title": "We'll Always Have Casablanca",
      "content": "Spoilers ahead, but then again, who isn't familiar with Casablanca, even if one hasn't seen it?I've been watching 'Casablanca' over and over again since I bought the Special Edition DVD, and is there any film out there one can watch again and again without ever being tired of it? And does any film appeal to a broader audience? Just everything about it seems to be as close to perfection as it only can be.But what exactly is so special about it? Is it its great genre mix, never equaled by another film? When we think of 'Casablanca' first, we remember it as a romantic film (well, most of us do). But then again, its also a drama involving terror, murder and flight. One can call it a character study, centering on Rick. And there are quite a few moments of comedic delight, just think of the pickpocket (\"This place is full of vultures, vultures everywhere!\") or the elderly couple on the last evening before their emigration to the US (\"What watch?\").But 'Casablanca' is not only great as a whole, it still stands on top if we break it apart and look at single lines of dialog, scenes or performances alone. Is there any other film which has more quotable dialog than 'Casablanca'? 'Pulp Fiction' is on my mind here, and 'All About Eve' and 'Sunset Blvd.' come close, too, but still I think 'Casablanca' tops everything else. And not only is the dialog great, it's unforgettably delivered, especially by Humphrey Bogart (\"I was misinformed.\") and Claude Rains (\"I am shocked, shocked to find that gambling is going on here\"). Many of scenes have become a part of film history; the duel of 'Die Wacht am Rhein' and 'La Marseillaise' is probably one of the greatest scenes ever shot (the only I can think of that would rival it for the #1 spot is Hynkel and the globe from Chaplin's 'The Great Dictator'), and the last scene is probably even familiar to the few people who've never seen 'Casablanca'. Am I the only one who is absolutely convinced that the film wouldn't have become what it is today if Rick and Ilsa would have ended up as the lucky couple?About the performances: So much has been said about the uniqueness of Humphrey Bogart's and Ingrid Bergman's chemistry as Rick and Ilsa, about Claude Rains' terrific turn as Renault, about the scene-stealing performances by Peter Lorre (one of the 10 all-time greatest actors) as Ugarte and Sydney Greenstreet as Ferrari and about Dooley Wilson stopping the show as Sam. I'd love to emphasize here two other performances, one that is not mentioned quite as often and one which is blatantly overlooked: Conrad Veidt as Major Strasser had a really difficult task here, as his character is the only evil one, but still Strasser is not a one-dimensional character, and it took more than 50 years until another actor gave an equally (maybe even more) impressive performance as a Nazi, Ralph Fiennes in 'Schindler's List'. But why no one ever mentions S. K. Sakall, who plays Carl, the jolly waiter at Rick's Café Américain, is beyond me. He has definitely more screen time than Lorre, Greenstreet and Wilson, and probably about as much as Veidt, and he's a joy whenever he's on the screen. I simply love his reaction when the pickpocket (\"Vultures everywhere!\") accidentally bumps into him, or the reaction to the \"What watch\"-dialog. Or how he says he gave Strasser the best table, \"being a German, he would have taken it anyway\". His performance is simply criminally overlooked.So is there a weakest link in 'Casablanca'? Every film, no matter how close to perfection, has a minor flaw or two, so one can find them in 'Casablanca', too, if one really tries hard. So yes, one might ask how much sense the entire mumbo jumbo about the letters of transit makes. One might point out that Paul Henreid, although his performance is certainly good, doesn't come close to the greatness of any of his co-stars. However, the film is so close to perfection that I'm almost ashamed that I'm so desperately trying to find less-than-perfect elements.So whatever films will come, how many sequels will overflow the screen, and how much junk we will have to sit through, one thing is certain if we're desperate to see a great film: We'll always have Casablanca!"
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2142295",
      "warningSpoilers": false,
      "date": "17 October 2009",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The writing, the character actors, the lighting, and then, for dessert, some romance, too. Oh, and America goes to war at last.",
      "content": "Casablanca (1942)When Rick (the inimitable Bogart) says to Sam (the inimitable Dooley Wilson), \"If it's December 1941 in Casablanca, what time is it in New York?\" he's announcing to everyone that this is a movie about Pearl Harbor. That is, it is about this hardboiled, pre-noir American type, who sticks his neck out for no one, and his growing need to go to war.Need and desire. That's part of the compelling mood of the movie--everything feels like it has to be so. Americans are (by implication) really good at heart, and of course we'll come to the air of pretty Norwegians trapped by love and reluctant Frenchmen trapped by circumstance and all those very interesting lovable refugees (some real refugee actors), trapped by Nazi meanness and brutality, plain and simple.The romance? That, in a way, is the MacGuffin, not the other way around. Certainly, the famous end to the movie leaves the romance in the dust. Casablanca is a call to arms, for all the best reasons, and it appeals across the decades, too. In fact, the movie premiered on Thanksgiving, 1942, so the U.S. is fully in the war by the time people see it. And it resonates as a confirmation, and almost as prescient. We trust Bogart, by now, to be the right kind of man in every circumstance, just like our own men, husbands, fathers, brothers on the field.These great things don't make the movie great. Not as a movie. The writing, above all, does that (the Epsteins labored and were as inspired as they were gifted in this, with Howard Koch). But the filming is gorgeous, every scene filled with dense layers foreground to back, including layers of light, and often moving light, from searchlights and passing cars, or in the café as the lights move from piano to band and so on. Actors move across the screen in fluid conversation, sometimes for a laugh, often for a drink, eventually to see Rick, or to fret about getting out, getting to Lisbon, getting to America. It's all idealized and frightening at the same time. The bit actors are astonishing, the direction by the seasoned but unexceptional Curtiz is compact and elegant. Bogart is perfect. There isn't much to say new, or old, that's worth the time here, with everything out there so well said already. Just Google the movie and read away. Or better yet, watch it again. If you think you've seen the movie enough, look beyond plot and really listen to the writing, and watch the camera-work and lights. It's not a great film by accident, and it doesn't hide why it's great. There are better films, I suppose, of course there are, depending who you ask and on what day. But not many."
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw2330421",
      "warningSpoilers": false,
      "date": "27 October 2010",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "\"Who's got trouble? We got trouble.\"",
      "content": "For the Allies, 1943 was perhaps the grimmest and most desperate year of the war, as the conflict threatened to grind on into stalemate. Back on the home front, movie production was responding appropriately, cutting back on the flag-waving calls-to-arms, and making pictures that were more about hope, endurance, and getting on with life during a state of war. This is where Casablanca fits in.Everybody knows about Casablanca – even people who think they don't will probably be tacitly aware of its many quotable lines. Why has the picture become such a cultural monument? The reasons are many, but that quotable script is as good a place to start as any. Casablanca is based on a (then un-produced) play by Murray Bennet and Joan Alison, which provided the outline. However it was given its Hollywood makeover by celebrated screen writing twins Julius and Philip Epstein, whose best picture up to this point had probably been The Strawberry Blonde (1941) with James Cagney; a witty, rather sentimental and very musical period piece. The Epsteins have brought many similar touches to this picture, especially their approach to music and comedy. Many of the key moments have a musical underpinning; not just the recurring love theme \"As Time Goes By\", but the playing of the Marseilles to drown out the Nazis, or the \"Knock on Wood\" number which is played in the first scene at Rick's, and very much establishes the atmosphere of the joint. The Epstein brand of humour doesn't rely on a handful of ridiculous and exaggerated characters, as was the usual at this time. Instead, the jokes all arise from normal things that we might laugh at in real life, such as the market trader reducing the price when he realises Ingrid Bergman is \"a special friend of Rick's\". This sort of thing is crucial for Casablanca, because it allows a little touch of humour without robbing the story of its dignity or credibility.Then there is the director Michael Curtiz, a man who has not been deified by the magic wand of the auteur theory, and yet one whom any serious film scholar is forced to pay attention to simply because of the number of important pictures he helmed. Despite this being his best-known picture, he is himself better known for the series of swashbucklers he made with Errol Flynn in the mid-to-late 1930s. It is true that Curtiz's style tended to be very technical, and certainly his most noticeable work has been in the action genre, so as such his having directed Casablanca is seen as being coincidental to its success. Still, his shrewd mechanical mind has added a thing or two to this picture. Take that opening shot of the city, panning down from the mosque tower into the busy street. It's a complex, cluttered shot, but it really gives us a feel for the location and that tense atmosphere, with great touches like those two extras bickering in the foreground. A lot of Curtiz pictures begin with a shot like this – crowd scenes that look completely random and extremely realistic, and yet are full of meaning and rich in detail. Curtiz was also not quite the mean-minded movie-making machine that he is sometimes painted as. He did have a feel for romance and sentiment if it was a picture that relied upon it. Casablanca features quite a few uncomplicated close-ups of characters in emotional intensity, just about the only uncluttered shots you get in a Curtiz movie, and they are incredibly moving.But of course, what would these close-ups be if they weren't of great actors? Casablanca has a flawless cast, but also a very bold one at the time. Humphrey Bogart was only just starting to play leading roles, and even then he was generally an anti-hero. However, Casablanca solidified his screen-persona, a tough individualist on the outside, but a good man at heart, albeit one loathe to reveal it. By showing that there was a human side to his charismatic demeanour, he gave his best performance to that point. Bergman too was just on the cusp of stardom, but she pulls off a role of frailty and tearfulness without getting hysterical, as many a lesser actress would have done. And then there is Claude Rains, one of the few long-established players in the picture. Rains is playing his usual type – perhaps his archetypal role – and it is actually one not unlike Bogart's, with the crucial difference being that Rains revels in his amorality. And yet Rains's art is that he makes this character, who is utterly despicable on paper, likable on screen.On that note, it's tempting to view Bogart and Rains as the two leads – not Bogart and Bergman. It is Bogart and Rains whose story arcs deal with the main theme of Casablanca – whether to strive for individual gain or to fight for the good of the people. And this is after all a movie about people, and hope in the unity of people. There is this feeling of people brought together by their desperate situation, which permeates Rick's and the picture in general, and it's something writers, director and cast have all contributed to. It makes us feel that the struggles of every minor player – Peter Lorre's nervous underground agent, Joy Page's young wife desperate to escape the city, S.Z. Sakall's jovial headwaiter, the sadly-unsung Dooley Wilson – are as important and immediate as those of the lead players. It is perhaps more than anything else this rich humanity that made the picture connect with wartime audiences, and has made it a work of power and resonance ever since."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8751209",
      "warningSpoilers": false,
      "date": "22 December 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A story that will never get tired, incredible film.",
      "content": "American in Casablanca, Rick Blaine holds the fate of his former lover Ilsa Lund and her husband, who's trying to flee The Nazis.I've just watched this film for the very first time, and I plan to watch it again on Christmas morning, before the events of the day start.What an enchanting, magical experience this couple of hours of viewing was, true screen greats bringing to life a magical story.Casablanca is not what I was expecting, it's a war film with a twist, a story seen through the eyes of people fortunate to escape Europe, it's a love story, with a difference.The characters are captivating, they all feel very real, a mix of hope and fear etched over their faces, a harsh reality to all of them, none of them are syrupy sweet or sentimental, you feel a true sense of desperation.Ingrid Bergman's finest hour, a gracious beauty, her presence is quite enchanting, Bogart delivers a superb performance, the presence of the pair is quite something, the whole cast are terrific.Amazing to think that this was made in the middle of The Second World War, indeed I believe several of The German characters, were German Jews who had fled The Nazis.Watching this was quite an experience, 10/10."
    },
    {
      "username": "tyson-hunsaker",
      "userUrl": "https://www.imdb.com/user/ur33875393",
      "reviewLink": "https://www.imdb.com/review/rw3816865",
      "warningSpoilers": false,
      "date": "27 September 2017",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Rightfully one of cinema's finest stories ever told.",
      "content": "\"Casablanca\" is a timely and timeless classic about a politically neutral saloon owner Rick in unoccupied France at a crossroads of destiny, conviction, and courage in his life. \"Casablanca\" is on the top of every film class's watchlist to study for just about every aspect of filmmaking imaginable. While the film's plot is air-shut tight and the characterization feels authentic over 70 years later, the main focus of \"Casablanca\" is idea focused. During a time of political neutrality, America was entering the war as was Rick, our hard-on-the-edges protagonist. This can be considered an \"enlist\" film to anyone on the fence. Because of it's conviction-driven focus on ideas and philosophy, and how grounded those struggles feel, \"Casablanca\" remains one of the most well regarded classics of all time. The struggles of Rick are applicable to anyone who watches the film, drawing on universal themes like conviction, courage, compassion, and love. The character of Rick is a fascinating one on an individual basis. We're set up to a character who's meticulous and thoughtful in the way he does things, paralleled by the chess game he has with no one. At the same time, we know of his loneliness without a partner to play with. We understand the respect he commands with patrons of the saloon yet the deep friendship he experiences with Sam. And while his corrupt inner shell shared with the chief is off-putting like a villain, we know he's \"...at heart, a sentimentalist\" when we learn of his passionate love for Ingrid Bergman's Ilsa. \"Casablanca\" also features some of cinema's most iconic and beautifully crafted cinematography by the great Arthur Edeson and of course the director, Michael Curtiz's masterful control of capturing the romantic moment. Not only on a story-telling, narrative perspective, \"Casablanca\" is worth studying for it's remarkable technical quality. While the film may be as close to perfect as one can get, some of the third act moments can feel unnatural and forced which could disorient some modern viewers. Nitpicking aside, \"Casablanca\" remains one of cinema's finest pieces of celluloid to date. Anyone looking for another round of film study or a clean dive into old classic films, this would be perfect to start with. It's rich in themes, characters, and intelligence."
    },
    {
      "username": "Prabhuraj",
      "userUrl": "https://www.imdb.com/user/ur5442036",
      "reviewLink": "https://www.imdb.com/review/rw4533163",
      "warningSpoilers": false,
      "date": "25 December 2018",
      "rate": "10",
      "helpful": "37 out of 44 found this helpful.",
      "title": "An absolutely beautiful masterpiece",
      "content": "My favorite film of all time. Beautiful plot that naturally weaves together and builds to a truly emotional climax. Could affect even the most nihilistic of people. A masterpiece that is truly one of the greatest films ever made. 10/10"
    },
    {
      "username": "mryerson",
      "userUrl": "https://www.imdb.com/user/ur1159545",
      "reviewLink": "https://www.imdb.com/review/rw1219202",
      "warningSpoilers": false,
      "date": "18 November 2005",
      "rate": "",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Of all the gin joints, in all the world...",
      "content": "Sunday, November the 20th is the anniversary of Marcel Dalio's death in 1983. It was the end of a serendipitous life. You know him. He was a citizen of the world. Born Israel Moshe Blauschild, in Paris, in 1900, he became a much sought-after character actor. His lovely animated face with its great expressive eyes became familiar across Europe. He appeared in Jean Renoir's idiosyncratic Rules of the Game, and Grand Illusion, arguably the greatest of all films. True to his Frenchman's heart, he married the very young, breathtaking beauty Madeleine LeBeau. He worked with von Stroheim and Pierre Chenal. He had it all.But then the Germans crushed Poland, swept across Belgium and pressed on toward Paris. He waited until the last possible moment and finally, with the sound of artillery clearly audible, with Madeleine, fled in a borrowed car to Orleans and then, in a freight train, to Bordeaux and finally to Portugal. In Lisbon, they bribed a crooked immigration official and were surreptitiously given two visas for Chile. But on arriving in Mexico City, it was discovered the visas were rank forgeries. Facing deportation, Marcel and Madeleine found themselves making application for political asylum with virtually every country in the western hemisphere. Weeks passed until Canada finally issued them temporary visas and they left for Montreal.Meanwhile, France had fallen and, in the process of subjugating the country, the Germans had found some publicity stills of Dalio. A series of posters were produced and were then displayed throughout the city with the caption 'a typical Jew' so that citizens could more easily report anyone suspected of unrepentant Jewishness. The madness continued. 'Entree des artistes', a popular film, was ordered re-edited so that Dalio's scenes could be deleted and re-shot with another, non-Jewish, actor.After a short time, friends in the film industry arranged for them to arrive in Hollywood. Nearly broke, Marcel was immediately put to work in a string of largely forgettable films. Madeleine, a budding actress in her own right, was ironically cast in 'Hold Back the Dawn', a vehicle for Charles Boyer with a plot driven by the efforts of an émigré (Boyer) trying desperately to cross into the United States from Mexico. But the real irony was waiting at Warner Brothers.In early 1942, Jack Warner was driving production of a film based on a one act play, 'Everybody Comes to Rick's' but had no screenplay. What he had was a mishmash of treatments loosely based on the play and two previous movies. But he had a projected release date and a commitment to his distributors to have a movie for that time slot and little else. Warner Brothers started to wing it.Shooting started without a screenplay and little plot. Principal players were cast and a director hired but casting calls for supporting roles and bit players continued and sometime in the early spring Marcel Dalio and Madeleine LeBeau were cast as, respectively, a croupier and a romantic entanglement for the male lead. Veteran screen-writers were hired to produce a running screenplay, sometimes delivering pages of dialogue one day, for scenes to be shot the following day. No one knew exactly where the plot would go or how the story would turn out. No one was sure of the ending. And, of course, they produced a classic, perhaps the finest American movie.They produced a screenplay of multiple genres, rich with characterizations, perfectly in tune with the unfolding events in Europe and loaded with talent from top to bottom. Oh, and they changed the title to 'Casablanca'.It is so well known, that many lines of long-memorized dialogue have passed into the slang idiom. 'We'll always have Paris', 'I was misinformed', 'Here's looking at you, kid', ' I am shocked! Shocked! To find that there's gambling going on in here!', 'Louis, I think this is the beginning of a beautiful friendship', 'Oh he's just like any other man, only more so', 'I don't mind a parasite. I object to a cut-rate one', 'Round up the usual suspects', and, of course, the oft quoted, apocryphal, 'Play it again, Sam'.Madeleine LeBeau plays Yvonne, the jilted lover of Humphrey Bogart, who is seen drowning her sorrows at the bar early in the film and who later, to get back at Rick and looking for solace takes up with a German officer finding only self-hatred. She is luminous.And when Claude Rains delivers the signature line, 'I'm shocked! Shocked! To find that there's gambling going on in here!' the croupier, Emil, played by Marcel Dalio, approaches from the roulette table and says simply, 'Your winnings, sir.' It is a delicious moment ripe with scripted irony, one among many in this film, but one made all the more so, knowing where Dalio came from and what he and his wife had endured to arrive at that line.I have often wondered exactly when they saw the final script or if they only realised the many parallels to their own lives when the film was released.Alas, they separated and divorced the next year, both going on to long successful careers. Dalio never remarried.Late in his career, when Mike Nichols was looking for a vaguely familiar face to deliver a long and worldly, near-monologue in Catch-22, he turned to Dalio. Faced with a hopelessly idealistic young American pilot, Dalio, as simply 'old man in whore house', in tight close-up, delivers a discourse on practical people faced with impractical circumstances, of the virtues of expedience in the face of amorality . Using his wonderful plastic features, now beginning to sag, in a voice full of melancholy, the old man reassures the young man that regardless of what 'grand themes' may be afoot in the world, in the end, little matters but survival."
    }
  ],
  "errorMessage": ""
}