{
  "imDbId": "tt0017136",
  "title": "Metropolis",
  "fullTitle": "Metropolis (1927)",
  "type": "Movie",
  "year": "1927",
  "items": [
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "100",
      "content": "Seeing it is a time-bending experience, a way of visiting the past and glimpsing the past's idea of the future. A masterpiece of art direction, the movie has influenced our vision of the future ever since, with its imposing white monoliths and starched facades."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "100",
      "content": "You've seen the rest; now see the best."
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Steven Rea",
      "link": "https://www.inquirer.com/entertainment/?id=40181&amp;reviewId=3365",
      "rate": "100",
      "content": "An awesome cinema spectacle."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "Does what many great films do, creating a time, place and characters so striking that they become part of our arsenal of images for imagining the world."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "https://www.chicagotribune.com/entertainment/things-to-do/",
      "rate": "100",
      "content": "Trashy and glorious, the restored Metropolis is a pop epic for the ages."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/2002/0712/p15s02-almo.html",
      "rate": "100",
      "content": "Metropolis has a place in world history as well as in the annals of fantasy. Adolf Hitler was said to have loved it, and Lang eventually fled Germany for Hollywood when the Third Reich wanted him to run its movie industry. Few movies of any era offer so much varied food for thought, cinematically and politically. Its new restoration is a major motion-picture event."
    },
    {
      "publisher": "Chicago Reader",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "Departing from a masterful manipulation of space, Lang transforms the futuristic city of the title into a field of dreams centered on death and sexuality."
    },
    {
      "publisher": "The New York Times",
      "author": "Dana Stevens",
      "link": "https://www.nytimes.com/2002/07/12/movies/critic-s-notebook-a-restored-german-classic-of-futuristic-angst.html",
      "rate": "90",
      "content": "Metropolis retains its power to overwhelm, trouble and move because it is connected to the deep anxieties of modern life as if by a high-voltage cable."
    },
    {
      "publisher": "Film Threat",
      "author": "Ron Wells",
      "link": "",
      "rate": "80",
      "content": "After half a century, does the story hold up? Eh, pretty much. In the end, the story doesn't really matter that much as this is really a vehicle for the amazing visuals."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "What ultimately saves the film from both silliness and ponderousness is not its simplistic social message, not its now-stale theme, nor its disappointing characterizations, but rather the dazzling cinematic (and theatrical) bag of tricks which Lang and company employed to keep things moving."
    }
  ],
  "errorMessage": ""
}