{
  "imDbId": "tt0017136",
  "title": "Metropolis",
  "fullTitle": "Metropolis (1927)",
  "type": "Movie",
  "year": "1927",
  "items": [
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1275605",
      "warningSpoilers": false,
      "date": "26 January 2006",
      "rate": "10",
      "helpful": "107 out of 128 found this helpful.",
      "title": "Heart is the Mediator Between Brains and Muscles - A Futuristic View of the Fight of Classes",
      "content": "In the future, the society of Metropolis is divided in two social classes: the workers, who live in the underground below the machines level, and the dominant classes that lives on the surface. The workers are controlled by their leader Maria (Brigitte Helm), who wants to find a mediator between the upper class lords and the workers, since she believes that a heart would be necessary between brains and muscles. Maria meets Freder Fredersen (Gustav Fröhlich), the son of the Lord of Metropolis Johhan Fredersen (Alfred Abel), in a meeting of the workers, and they fall in love for each other. Meanwhile, Johhan decides that the workers are no longer necessary for Metropolis, and uses a robot pretending to be Maria to promote a revolution of the working class and eliminate them.\"Metropolis\" is a fantastic futuristic view of the fight of classes. When \"Metropolis\" was shot, it was a romantic revolutionary period of mankind history, with socialist movements around the world. Fritz Lang directed and wrote the screenplay of this masterpiece certainly inspired in this historical moment and defending a position of agreement and understanding between both sides, showing that they need each other. I wonder how this great director was able to produce such special effects in 1927, with very primitive cameras and equipment. The city of Metropolis is visibly inspired in New York. The performance of Brigitte Helm is stunning in her double role, and this movie is mandatory for any person that says that like cinema as an art. My vote is ten.Title (Brazil): \"Metropolis\"Note: On 05 March 2019, I saw this film again on Blu-Ray."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0004265",
      "warningSpoilers": false,
      "date": "16 February 2001",
      "rate": "10",
      "helpful": "158 out of 186 found this helpful.",
      "title": "Early science fiction story that presents a pessimistic prediction of a future society.",
      "content": "Who ever heard of an epic science fiction film? Especially in the 1920s? Sure, some science fiction movies are huge today, such as George Lucas' latest goofy Star Wars movie, but in 1926, Fritz Lang came out with a brilliant film about what the future would be like if people went on living the way they were living back then. And sure enough, we went right ahead living the way we were living, the population got bigger and more crowded, and now modern society is not a whole lot different from what was presented in Metropolis. The story is about a young rich kid without a care in the world who becomes concerned about the way that society (Metropolis) was run by his father, John Frederson, the master of Metropolis. He lives in a Pleasure Garden' high above the level of the workers', and he worries about what would happen if the huge number of workers were to turn against his father, given the terrible conditions under which they live and work. Some of the best scenes in the film take place in the underground mines, showing the workers portrayed as little more than components on a gigantic, sinister looking machine. The scene where the machine overheated even contained some impressive stunts, as well as interesting cinematography as the machine transforms into a giant devil-looking monster. After countless workers are consumed by it (no wonder this was Hitler's favorite film), they are immediately replaced by other workers, who go right to the same spots that the previous men left and resume their robotic movements. If some of these scenes, men can be seen being carried away on stretchers after having been injured, and the rest of the workers keep right on working, hardly even noticing.The way that the workers are portrayed as lifeless machines is one of the more potent elements of this film, as well as the most revealing about the directors intentions. When his son complains about the tragic things that go on in the mines, Frederson replies that such accidents are unavoidable, but his son still insists that they deserve credit for building the city. This is the kind of content that foreshadows some serious mutiny, and at the same time it shows what may very well happen when large groups of people feel mistreated. `Never underestimate the power of stupid people in large groups' is a saying that doesn't necessarily only apply to stupid people, as Metropolis suggests. Fritz Lang brilliantly portrays this very complex story with extremely limited dialogue, and the result is still compelling today. The special effects in this film are decades ahead of its time  it even resembles The Fifth Element in many ways (except that the two films can hardly be compared)  and the acting and especially the elaborately created sets are stunning to say the least. An excellent film, Metropolis is one of the few that should never be forgotten."
    },
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw1157878",
      "warningSpoilers": false,
      "date": "25 August 2005",
      "rate": "8",
      "helpful": "102 out of 124 found this helpful.",
      "title": "So old and yet so futuristic!",
      "content": "Fritz Lang's groundbreaking landmark remains one of the biggest mysteries in the world of cinema. How can a movie that'll soon turn 80 years old still look so disturbingly futuristic?? The screenplay by Thea Von Harbou is still very haunting and courageously assails social issues that are of all ages. The world has been divided into two main categories: thinkers & workers! If you belong to the first category, you can lead a life of luxury above ground but if you're a worker, your life isn't worth a penny, and you're doomed to perilous labor underground. The further expansions and intrigues in the screenplay are too astonishing to spoil, so I strongly advise that you check out the film yourself. It's essential viewing, anyway! \"Metropolis\" is a very demanding film-experience and definitely not always entertaining. But, as it is often the case with silent-cinema classics, the respect and admiration you'll develop during watching it will widely excel the enjoyment-aspect. Fritz' brutal visual style still looks innovative and few directors since were able to re-create a similarly nightmarish composition of horizontal and vertical lines. Many supposedly 'restored' versions have been released over the years (in 1984 and 2002, for example) but the 1926-version is still the finest in my opinion, even though that one already isn't as detailed and punctual as Lang intended it. \"Metropolis\" perhaps is THE most important and influential movie ever made. \"2001: A Space Odyssey\", \"Star Wars\" and \"Blade Runner\" owe their existence (or at least their power) to it."
    },
    {
      "username": "BaronBl00d",
      "userUrl": "https://www.imdb.com/user/ur0166205",
      "reviewLink": "https://www.imdb.com/review/rw0004243",
      "warningSpoilers": false,
      "date": "1 February 2000",
      "rate": "",
      "helpful": "109 out of 130 found this helpful.",
      "title": "Movie Milestone and Masterpiece!",
      "content": "Metropolis is surely one of the greatest films ever made. Its scope, its reach, its magnitude and its message are truly incredible even by today's standards of film-making. Seen in context of its premier in 1927, Metropolis is a giant of filmdom and film history. Lots of people always ask what makes a movie great, and in particular, Metropolis. A great film is one that stirs the imagination, leaves the viewer with images that will last perhaps forever, forces contemplation of issues dealing with the very essence of life, and achieves a kind of immortality. Metropolis is a film that succeeds with each of these criteria. Metropolis is a film that hailed in a new era of making films with it futuristic settings, halluciatory scenes, and its breadth of spirit and sheer scope, most clearly exhibited by its cast of epic proportions. There are images that blind the viewer with genius such as the beginning scene of the changing of the workers or the creation of the robot Maria. Metropolis challenges its viewers to think about their relationship with society both as a whole and with each individual, as well as contemplate the rationale of divisions amongst peoples and groups. Lastly, Metropolis has stood the test of time. It is a landmark film and an ignitor for the evolution of the science fiction/fantasy film genre. The story itself is simple,a Biblical allegory, about how people with a vision should share that vision in order to make it happen. The film is anything but simple. It is immense, and a rich legacy that director Fritz Lang has left us."
    },
    {
      "username": "PIST-OFF",
      "userUrl": "https://www.imdb.com/user/ur0264325",
      "reviewLink": "https://www.imdb.com/review/rw0004225",
      "warningSpoilers": false,
      "date": "24 April 1999",
      "rate": "9",
      "helpful": "116 out of 137 found this helpful.",
      "title": "The father of sci-fi cinema.",
      "content": "Silent movies are not for everyone. Neither are subtitles. Those brave enough to view a movie with no sound and words that are far and few between should definitely enjoy this silent masterpiece. One of the biggest productions of its time, Metropolis still holds its own when set design and special effects are compared. But what Metropolis really has is orginality. This German-Expressionist film had such originality in everything from its costumes to its views of a future (modern) city that its ideas can still be seen everywhere in modern sci-fi. Star Wars's C-3PO was based on Bridgette Helm's robot. Dark City and Brazil both have Metropolis look-a-like cities. This is a very good movie. It's too bad most movies don't have its originality."
    },
    {
      "username": "The_Film_Cricket",
      "userUrl": "https://www.imdb.com/user/ur0310469",
      "reviewLink": "https://www.imdb.com/review/rw0004380",
      "warningSpoilers": false,
      "date": "30 May 2004",
      "rate": "",
      "helpful": "23 out of 25 found this helpful.",
      "title": "The story elements are so familiar that you tend to forget some of them started here.",
      "content": "We have seen so many movies now that even those of us who study them tend to forget where certain familiarities were born. The science fiction elements presented in Fritz Lang's 'Metropolis' are so familiar to us that they have become not just the genre standard but almost a given. The notion of a city as an urban hell ruled by the upper-class and operated by slave-like poor. The notion of the city that seems to touch the heavens. The notion of a mad scientist giggling in his lab as he plays God. The lone hero who discovers the diabolical machinations of the villain and tries to throw a monkey wrench into his plan. These elements can be found in this film's ancestors 'Frankenstein', 'Batman', 'Gattaca' and the cities of 'Blade Runner', 'Star Wars' and 'The Fifth Element'. All of these films contain elements that were inspired by Lang's work.'Metropolis' has gone down in history as one of the most influential films ever made, certainly one of the most studied silent films and yet the movie sort of languishes. After its success in 1927 the film has had an uneasy time. It's pedigree as a silent film turns off the usual science fiction audience and it is sort of a footnote in the history of the genre. One restored version after another has tried to reconstruct the film as best it could because some of the footage of the film has been lost through neglect and silly studio censoring. Some of the restorations work but most do not so we sometimes wonder what an experience this must have been like in 1927. Unless a lost version surfaces (as it did with the recently uncovered print of Valentino's 1922 film 'Beyond the Rocks') the complete work my never be seen again. The restored version released on DVD in 2001 was based on a digital restoration at 2K resolution from all available sources. It's the best version that I've seen and I would highly recommend that one if you haven't seen the film. The worst is a 1994 print put out by GoodTimes video which contains not an ounce of restoration, the film in grainy and difficult to see, it doesn't even have a soundtrack. I call that one the worst because I'm still a little ambivalent about the 1984 restored version by Georgio Moroder with color tinting (good), sound effects (not so good) and a soundtrack that includes songs by Loverboy, Freddy Mercury, Bonnie Tyler, Adam Ant and Pat Benatar (yuck!).Those who study the film (myself included) find the story impenetrable. Some films you can easily decipher but 'Metropolis' has a plot that is so maddeningly erratic that it's hard to pin it down as a whole. Many conceded that as a fault but I think it adds to the film's chaotic nature. It takes place in the future (restored versions offer title cards that suggest that it's the year 2000 but I don't go by that) in an overcrowded city with immense skyscrapers (the Gothic, sometimes grotesque architecture suggests that the buildings were constructed in a hurry). The rich in Metropolis are content with their lives, dancing in their penthouses and spending their money. The poor work as slaves beneath the city like cogs in a machine. Lang choreographs the scenes in the subterranean levels magnificently so that the workers are never out of step. They don't so much work as toil under oppression like Ramses' slaves building his pyramids. The rich and poor of Metropolis are ignorant of one another. One person that isn't ignorant of the class division is Joh Fredersen a ruthless businessman who rules Metropolis from his office.His son Freder happily enjoys the Pleasure Gardens one day when he notices a woman rising from the underground caves with a group of the worker's children. Curious, he follows her to the depths and is aghast at the tyranny in motion there. The woman is Maria, a revolutionary who holds sermons to remind the workers that a peaceful resolution can and must be found.Freder uncovers a plot by Rotwang, the mad scientist to create a robotic version of Maria to convince the workers to rise up and take arms. This leads to the film's most famous scene when the robot becomes flesh and blood and the false prophet opens her eyes to reveal two dead sparkling orbs. Rotwang kidnaps the real Maria and sends the false one to convince the workers to rise up and then taunt the rich men and drive them into a sexual frenzy.Then all Hell breaks loose, but the rest I must leave to you to discover.Lang based the film on the book written by his wife Thea Von Harbou. In the book the story is about a chaotic as the film (and therefore less successful), the difference is that Lang has the visuals to suggest the chaos where the book did not. He uses every technical tool at his disposal to visualize the Hell of the subterranean machine run by the workers. At one point Freder, disguised as a worker, witnesses one of the huge machines explode and visualizes it as a horrendous monster swallowing workers by the dozen. Another suggests an odd device, a giant dial in which the worker is made to keep the arms in the same place as the light bulbs go on and off around it's edge. The machine doesn't seem to have any purpose until Freder imagines it as a giant clock and tries to pull the arms forward to end the merciless day.The film is one of the pinnacles of German Expressionism, astonishing in its use of light and shadow. One of the best examples is the scene in which Rotwang pursues the real Maria through the caves using only a beam of light to strike terror as he closes in. Another brilliant moment comes with Maria's erotic dance as the men gawk, the camera filled with their moist eyes. This scene was completely removed after the initial release and not restored until home video.Other moments have deeper resonance. There is something unsettling about the hundreds of workers toiling in the underground caves. Walking to work they march with their heads down, dressed in uniforms and caps. It reminded me of the Jews being led into the Nazi Death Camps. There is a buried foreshadowing of Hitler. More obvious are Lang's biblical references. The rise of the city parallels Maria's retelling of the story of the Tower of Babel. The giant pentagram in Rotwang's lab as he plays God. The breathtaking image of the plague-bringer who comes wielding an obscene scythe. The very heaven and hell nature of Metropolis itself. There is even a Christ-like quality in Maria who gives her sermons and reinforces that indeed blessed are the peacemakers.These elements and images are brought to the film because of Lang's insistence on no less then absolute perfection. He was known as a sometimes cruel taskmaster, working his cast and crew like a dictator. He cast some 20,000 extras (1500 of them for the Tower of Babel sequence alone) and worked them from morning till night. The water which covered the set for the climactic flood was ice cold. Many of the extras were soaked through from morning till night. Actress Brigette Helm was nearly killed several times, once by a fall and another by the fact that the bonfire scene was real! Helm was so rattled by her experience working with Lang that she thereafter refused to make another film with him.I could go on and on, this film all great films invite lengthy discussions. It can be seen in at least a hundred different ways, as a foreshadowing of fascism or the tyranny of communism or just capitalism boiling over. But when you get down to it the best way to view 'Metropolis' is not as a film to pick apart but simply as a film of it's time, Lang created the story of a world gone mad while the world around him was going mad."
    },
    {
      "username": "F Gwynplaine MacIntyre",
      "userUrl": "https://www.imdb.com/user/ur1609079",
      "reviewLink": "https://www.imdb.com/review/rw2268894",
      "warningSpoilers": false,
      "date": "24 June 2010",
      "rate": "10",
      "helpful": "74 out of 92 found this helpful.",
      "title": "My favourite film, my last review.",
      "content": "'Metropolis' is my all-time favourite movie, so I've saved this for the last review that I plan to write for this wonderful website IMDb. I've enjoyed sharing my experiences of the movies I've seen, but now I'm moving on to other passions.Although written by Fritz Lang's wife Thea von Harbou, 'Metropolis' was originally Lang's idea: he was inspired by the sight of New York's skyscrapers when he sailed to America in 1925. During his American trip, he visited the set of 'The Phantom of the Opera' and met Lon Chaney! Too bad the encounter wasn't filmed.Despite its epic power, 'Metropolis' makes very little sense. The two major male characters are a father and son named Freder and Fredersen, so why is the one named Freder*sen* the father (not son) of the one cried Freder? Why does the master of Metropolis deliberately connive to destroy the city that he built? Why is Rotwang's crude little cottage the only pre-Fredersen building that wasn't demolished during the construction of this city? (Von Harbou's very long and unwieldy novelisation of her script establishes this fact but never explains it.) How and why did Rotwang's high-tech laboratory manage to get constructed BENEATH that cottage without disturbing it?For modern viewers, some of the plot's incoherence can be blamed on missing footage, particularly in American prints. The distributors for this film's original Stateside release commissioned playwright Channing Pollock to translate the German titles. A major subplot of the backstory features a deceased woman named Hel, who was married to Rotwang but left him to marry Fredersen and give birth to Freder. This unseen woman's name could not easily be changed for the American version, due to a couple of shots of her memorial, engraved with the Teutonic name HEL. Apparently, Pollock feared that American viewers would be offended by this word's similarity to 'Hell', so he simply excised the entire subplot from this long movie.The real-life drama on the set of 'Metropolis' must've been quite interesting in itself. Mad scientist Rotwang (alias Doctor Strangeglove) is played by actor Rudolf Klein-Rogge, who had been married to scenarist von Harbou before she left him to marry Fritz Lang, the mastermind of this film. In 'Metropolis', Rotwang's wife left him to marry the master of Metropolis. I'd love to know how Klein-Rogge felt about the fact that his real-life marital (and sexual) situation was the inspiration for key plot elements of this movie ... and I wonder how Klein-Rogge felt about knowing that the entire cast and crew knew this as well.Most astonishing about this gargantuan production is the fact that nearly all of 'Metropolis' was actually built to scale, with just a couple of miniatures.Trivia tidbit: actress Brigitte Helm was cast in the dual female role largely because she was flat-chested, and therefore she could easily fit inside the mechanical suit for the Robotrix. A more busty actress would have suffered constant discomfort inside those galvanised bosoms of the metal costume. I learnt this more than 20 years ago from an eldery Austrian stagehand who worked on the film.For all its flaws, 'Metropolis' will always be my favourite movie. I've enjoyed writing all these reviews for IMDb. The joy of posting my reviews on this site has brought me many friendships and a few enemies. Well, you can't win 'em all.Nitrate film stock doesn't last forever, and all good things come to a happy ending. This is my last review here. I'll keep watching movies, but other passions are important to me as well. Thank you, IMDb, and thank you to everyone who has read my reviews. I will happily rate 'Metropolis' a full 10 out of 10."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6137228",
      "warningSpoilers": false,
      "date": "30 September 2020",
      "rate": "9",
      "helpful": "14 out of 15 found this helpful.",
      "title": "The Foundation of Dystopian Science Fiction...",
      "content": "Absolutely crammed full of future references to all of your favourite science fiction feature films, series, books, comics and video games. There's also quite a lot rooted in the current world of science non-fiction with the age of automation and robots concurrently being consumed by A.I. and Machine Learning. You could squeeze gene editing in as well if you have the imagination.I saw a clean restored version and spent a lot of time wishing I was consuming the experience in a cinema as a result. Ambitious, visionary and epic in its making - seldom can any film lay claim to having such huge influence. It must have been quite breathtaking for the paying public of the day, in their time away from the grindstone, to encounter such an alien and yet metaphorically familiar world, as the one they encountered here."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw4979056",
      "warningSpoilers": false,
      "date": "5 July 2019",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Even if you ignore the story, I could spend 150 minutes staring at the art design...",
      "content": "... and the story is worth paying attention! It is just about a perfect silent film experience. It is the story of a two-tiered society. Above ground, a modern city, with most of the young people immersed in decadent behavior and leisure, because all of the machines, below ground, do the work. Joh Fredersen is the architect of the city, and must be some kind of strongman, because if he fires you the result is you are sent to live \"in the depths\", below the city, with the workers. The workers have an existence so bleak that they trudge together in some kind of synchronized slouched shuffle as the shift changes among those tied to the giant machines. Even those getting off for the shift show no joy. It is almost prescient of concentration camp occupants a decade or so later .Freder, Joh Fredersen's son, has life change for him when Maria, a beauiful young prophetess, emerges from the depths with the children of the workers' city and mentions that these young men playing above are their brothers. He wants to learn all he can about the workers below, and does not share dad's indifference at their fate. Worried about the prophetess perhaps inciting the workers to rebel, and worried about his son's over concern for and curiosity about the workers, Joh Fredersen goes to consult the inventor Rottwang.This is his first mistake, because Rottwang hates Joh Fredersen, and he's quite open about it. Apparently \"Hel\", Fredersen's wife, once belonged to Rottwang, but married Fredersen and died giving birth to Freder. Forgive and forget are just not in Rottwang's vocabulary, and to prove it he has a giant statue, a kind of tomb erected in his home to her memory. So when Fredersen asks for Rottwang's help to destroy the faith that Freder and the workers have in Maria, he shouldn't be so sure that this isn't a plan to destroy Fredersen instead, and yet Fredersen stupidly trusts him.Let me just say that my husband likes few silent films, but he'll sit down and watch Metropolis every time because the sets are so engrossing. Such symbolism goes on here. \"Maria\" must be an analog of the Virgin Mary. There are references to one of the machines when it boils over and explodes as \"Moloch\" the god to which human beings were sacrificed by being thrown into a raging fire. When Maria appears in the catacombs below the workers' city, it appears to be some kind of makeshift chapel with three crosses on one side and two crosses in the middle. Why five crosses? Then when Maria talks about the Tower of Babel she turns it into some kind of lesson on mistreated and abused labor. And then there is a reference to \"Babylon the Great\" in such a way as I think Saint John never intended. And on it goes.With this being a little more than a decade out from WWII, I couldn't help but wonder what happened to these German actors and actresses. Brigette Helm, who played Maria, lived a long life, but the coming of sound and the take over of the German film industry by the government caused her to retreat to Switzerland, where she lived until 1996 at age 90. Alfred Abel, who played Joh Frederson, died in Berlin in 1937. Gustav Frohlich, who played Freder, lived until age 85 in 1987. He served in the German army during the war, and he was banned from acting from 1941-1943 because of a dust up he had with Joseph Goebbels over Frohlich's girlfriend at the time.I'd highly recommend this for a bewildering plot and eye popping art design."
    },
    {
      "username": "ACitizenCalledKane",
      "userUrl": "https://www.imdb.com/user/ur4306474",
      "reviewLink": "https://www.imdb.com/review/rw0971786",
      "warningSpoilers": false,
      "date": "3 December 2004",
      "rate": "8",
      "helpful": "222 out of 255 found this helpful.",
      "title": "Highly influential and, dare I say, prophetic?",
      "content": "Fritz Lang's Metropolis is the first true masterpiece of science fiction in film. You can see it's influence in films such as Star Wars, The Matrix, Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb, Blade Runner, and countless others. Despite the fact that parts of the film are no longer available, the efforts to reconstruct the original film from its remains are valiant enough to provide enough to make the story clear. The special effects were far ahead of their time and the set designs were, in some cases, phenomenal. I can see where some people may not enjoy this movie. It is hard for some to really appreciate a movie that is 77 years old, because a lot has happened in film since then. Yet, if you look at the basic elements of this movie - its story, characters, artwork, cinematography, etc., I believe this movie has just as much to offer now as it must have in the late 1920's. Also, take into consideration the asthetics of German expressionist film when viewing this. The performances and set designs are going to be over the top. That was part of the style. Metropolis may not be for everyone, but, for those willing to read between the lines, this film still has a lot to offer!"
    },
    {
      "username": "ignatz928",
      "userUrl": "https://www.imdb.com/user/ur4708706",
      "reviewLink": "https://www.imdb.com/review/rw1067562",
      "warningSpoilers": false,
      "date": "25 April 2005",
      "rate": "9",
      "helpful": "171 out of 195 found this helpful.",
      "title": "Watch the Kino DVD!",
      "content": "Technically speaking, I have seen this Fritz Lang silent sci-fi before, but this was the first time I saw it in any shape by which I could fairly evaluate it. I had previously watched Metropolis on a public domain VHS from the 80s. The print was terribly scratched and while there were a few memorable images, the story was so incoherent that their context was usually unclear. Though this was clearly not the best way to see Metropolis, I was still left with an impression of this supposed classic as a dusty museum piece that was praised by critics because they were expected to like it. So finally seeing a restored and expanded copy was as much as a revelation as seeing Once Upon a Time in the West letter boxed in how it led me to reevaluate my opinion of the movie. The movie is a strange mixture of political speculation political parable, apocalyptic fantasy, and religious allegory. It depicts a futuristic city that is divided between the wretched workers, who toil in the depths tending the machines, and the upper classes, who dwell in luxury up in the skyscrapers. The hero, the idle, pampered son of the city's supervisor Joh Fredersen, changes his ways and becomes concerned with the plight of the lower classes after catching a glimpse of Maria, the Madonna of the workers. His father, meanwhile, is plotting to thwart Maria with the help of the mad scientist Rotwang, who has discovered how to create robot replicas of human beings. One of the most surprising things about watching this version is just how much I didn't see. In addition to restoring scenes to the film, the DVD also includes inter titles to explain pieces of the plot that cannot be found in any version. With these changes, the story becomes much clearer, particularly the machinations of Rotwang and the master of Metropolis. Perhaps most importantly, a whole new subplot is added involving the hero's dead mother Hel, who was loved by both his father and Rotwang. With this clarification of the back-story, the close but adversarial relationship between Rotwang and Fredersen becomes much clearer. In some ways it recalls the family back-story of the Star Wars movies. Of course, the real strength of Metropolis isn't the story, which is pretty silly and probably wouldn't have worked in anything but a silent film, but its amazing visuals, which in their scale and ambitiousness look forward to 2001 and Blade Runner. Actually, though in most respects silent films now look primitive, one area in which they have the edge over modern film-making is in their frequently grandiose production design. Metropolis employs huge sets to show the hellish factories of the subterranean world. The models of the city's towering skyscrapers are also surprisingly convincing for a 1920s film. Even beyond the expansive production design and (for the time) special effects, Lang's visuals are all consistently inventive. The robot Maria provides some of the movie's most iconic images, including her transformation into a human being. In a later scene, she performs for upper-class men in a nightclub, and as she performs a striptease that in 1920s Germany was apparently seen as very decadent, the screen is filled with wet staring eyeballs. A sign of Lang's visual lavishness, and the studio's, that he doesn't hesitate to throw in lavish dream and hallucination sequences to drive home a point or illustrate a character's state of mind. For instance, when the hero first enters the subterranean city and sees rows upon rows of workers toiling on huge machines, he imagines the furnace transforming into a monstrous idol's head into which the workers are being sacrificed. At another point, while he's sick in bed he imagines statues of the Seven Deadly Sins coming to life and advancing out from a wall in a cathedral. When Maria preaches her message of peace and understanding to the workers, she tells them the story of the Tower of Babel of a management vs. labor parable, and Lang gives us spectacular images of the tower's construction and fall. In a sound film many of these scenes would have seemed redundant and over-literal, but they're what silent cinema does best -tell a story without the advantage- or obstacle- of dialogue. The story is a little slow to start, but once it picks up Metropolis becomes one of the most directly involving silent films that I've seen. In addition to being a pioneering example of the cinematic possibilities of science fiction, Metropolis also has to be one of the earliest disaster films, as the workers riot and sabotage the machines, endangering the entire city. Lang creates a sense of rising fury and nihilism in the last hour that in a strange way reminded me of what was going to happen to Germany in less than 20 years."
    },
    {
      "username": "elicopperman",
      "userUrl": "https://www.imdb.com/user/ur81864032",
      "reviewLink": "https://www.imdb.com/review/rw4615492",
      "warningSpoilers": false,
      "date": "30 January 2019",
      "rate": "8",
      "helpful": "14 out of 15 found this helpful.",
      "title": "The Future Displayed through Social Allegory",
      "content": "Whenever people are asked what they consider to be revolutionary and historically significant in terms of classic cinema, one answer that frequently comes up is Metropolis, and it's not hard to see why. In addition to being a very impressive technical achievement for its time, the film is well known as the very first feature-length sci fi film. While it wasn't met with a very warm reception upon its release (not to mention having been cut since then), it has made a massive impact over the decades for its biting allegory and themes of purity mixed in with knowledge and strength.Set in a futuristic urban dystopia, high class city planner Joh Fredersen lives in the Tower of Babel around the prestigious city, which is atop its underground equivalent filled with workers who manage the machinery that support it. The actual story revolves around Joh's son Freder and the holy figure Maria trying to overcome the major split between the two parts. Director Fritz Lang and writer Thea von Harbou develop the film's plot through world building, as it's made clear from the start that the workers of the surface-level power plant toil with the equipment tirelessly year by year. Satirically, the workers are the clocks controlled by the ringleader Frederson. In a way, the film lets the viewers think about the societal differences between individuals and power without spoon-feeding the message as much as showcasing it through distinctive nations.Admittedly, the film doesn't really develop the characters outside of their basic tropes and goals, but they're by no means bad. If anything, they're meant more to guide the events of the different classes throughout the story's progression. Freder knows all the wrong doings of tampering with technology, therefore he wishes there to be a proper balance between the thinkers and the builders, hence why he adores Maria so much. Speaking of Maria, she is the saintly guide to the workers looking for hope, but her purity comes at a price of the mad scientist Rotwag who builds a robot to replicate his loved one Hel (who ended up becoming Freder's mother). Without spoiling much, let's just say that what he does to Maria really causes the film to get suspenseful. The remaining cast are mainly easily manipulated individuals looking for the right voice to lead them.But of course, the feature's visual style is timelessly breathtaking. Most of the special effects were huge innovations at a time of severe technological limitations, and some even work as substance depending on some given scenes (like the mythos behind the Tower of Babel). Many of the contraptions and backdrops have clearly inspired the likes of Blade Runner, Futurama and even Batman over the years, mainly through the gothic architect and abstract landscapes. Admittedly, a lot of the acting is really over the top by today's standards, but that's more attributed to the dynamic gestural performances commonplace back in the day. That, and many scenes do kind of drag on a bit for their own good. However, the narrative and message are meant to be told through these elaborate sets and melodramatic performances to gain the necessary emotional resonance for such an ambitious project like this.In conclusion, Metropolis is a prime example of how something can stand the test of time through technical brilliance and emotional resonance based on a political allegory. It's funny how Fritz Lang believed this film to be the prediction of how the future would be perceived back in the 1920s, because it's not too far off from today. Technology is a great usage and all, but all the amazing knowledge and manual labor in the world are nothing without the necessary negotiating in case one spirals out of control, something that many corporations these days fail to realize. If you are yet to check this film out, definitely feel free to do so to remind yourself how important it is to maintain order around advanced infrastructure."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw6856713",
      "warningSpoilers": false,
      "date": "27 April 2021",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Far ahead of its time n still rocks.",
      "content": "I first saw this in the early 90s.Revisited the 148 mins restored version recently.The special effects, set designs, the futuristic cityscape with the skyscrapers, the aerial roads, the catacombs, the cathedral, Rotwang's house, the long stairs, the rooftops, the scary demonic statues, etc.Man, this movie still amazes me and i am in awe of this movie.Indeed it is the granddaddy n mother of all science fiction movies.The chase n fight on the roof of the cathedral, i can just imagine the tension it must have created on audiences' minds 94 years back.The hallucination scene where the machine is the temple of Moloch and the workers are being fed to it, creepy enuff.The false Maria as the whore of Babylon, riding on the back of a many-headed dragon is wonderfully done."
    },
    {
      "username": "Bockharn",
      "userUrl": "https://www.imdb.com/user/ur0062626",
      "reviewLink": "https://www.imdb.com/review/rw0004376",
      "warningSpoilers": false,
      "date": "13 March 2004",
      "rate": "10",
      "helpful": "188 out of 217 found this helpful.",
      "title": "Restored Kino DVD changed my view of this film.",
      "content": "I doubt that I'd ever seen anything resembling a \"complete\" version of METROPOLIS before, though certain of its scenes were familiar to me, if only as used and abused in such films as Diane Keaton's HEAVEN (1987). In any case, whatever I had seen before had nothing like the clarity and beauty of the Kino restoration. I expected to be distracted by the restoration's technique of concise written descriptions of missing sequences, but the narrative coherence that these provided was definitely worth it. As \"exaggerated\" as the style of acting seems by contemporary standards, some performances, such as the Master of the city, are amazingly nuanced and layered, and Brigitte Helm is stunning as both Maria and her evil clone. The meticulous design of the film, the unerring camera placement and Lang's muscular choreography of the crowd scenes are breathtaking. I'd thought of METROPOLIS as a curiosity (\"important\" = \"dull\") but now I've come to appreciate it as the seminal work it has always been."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw1139156",
      "warningSpoilers": true,
      "date": "31 July 2005",
      "rate": "8",
      "helpful": "20 out of 26 found this helpful.",
      "title": "\"Who are the slaves of the machines?\"",
      "content": "\"There can be no understanding between the hands and the brain unless the heart acts as mediator.\" This is the predominant theme of \"Metropolis\", and director Fritz Lang finds numerous ways to say and visualize his message during the course of the film. The movie relies on repeated visual imagery to make it's point, and does so effectively even if tedious at times. Particularly effective is the representation of the worker society as an almost single living unit, moving trance like to their appointed time and task. The use of a \"ten hour\" clock in the workers' chamber constantly draws our attention, as does the hangdog posture of the individual slaves who grind out their workday as if in a daze.Amid this rabble, worker Maria (Brigitte Helm) is the inspirational voice of the workers, offering hope for a brighter future by a mediator yet to appear. However the Master of Metropolis John Frederson (Alfred Abel) sees in her a way to quell the underlying frustration of the workers, commissioning his scientist Rotwang to create a robot Maria to plant discord among the workers. Rotwang's laboratory would have done Frankenstein proud, and the creation of the robot is a marvel of cinematic imagery. The robot Maria's \"belly dance\" transforms into a scene of such raw energy and sexual awareness that it awakens the statues of the Seven Deadly Sins, one of the master strokes of this expressionist film.So much imagery in fact is layered into \"Metropolis\" that it's safe to say that repeat viewings will lead to even more interpretations of it's vision, and not simply for it's denunciation of a class society. Both timely and timeless, the film captures a dynamism that inspires passion even after nearly eighty years following it's original release."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1925667",
      "warningSpoilers": false,
      "date": "7 August 2008",
      "rate": "7",
      "helpful": "22 out of 29 found this helpful.",
      "title": "New Restored Version Worth Checking Out",
      "content": "For its time, this movie has stunning visuals, kind of Kubrick-esqe in appearance, especially the opening scenes of workers going and coming from work. It's very strange, with the group leaving walking with their heads down like zombies.The set designs in here are also something that might draw your attention. This really has a futuristic look. I thought the visuals were fascinating. This was \"German expressionist\" filmwork at its height, I would think. Director Fritz Lang went on to become a very famous man in his profession. This wasn't his first effort but, I think this might have been the film that put him \"on the map,\" so to speak. Several years later, he gained a lot more fame with \"M.\" At any rate, with the photography, sets and overall Flash Gordon-type sci-fi look, this must have been a real eye-opener to movies viewers 80 years ago. I still think they look very cool today. The music was also very dramatic, at least in this restored 5.1 surround sound restoration DVD, put out by Klino.Obviously, the eye makeup on men and the exaggerated motions by actors in silent films look a little hokey but I was mesmerized by Brigitte Helm, who plays \"Maria\" and her evil clone. She is something else! I also appreciated Klino's explanation of lost footage and how they did the best they could do to still make the story flow together. They did an outstanding job. I wouldn't attempt to watch this on anything less than this DVD, which looks pretty darn good.This is a \"worker\" story about a man wanting to trade his comfortable life to join the oppressed workers, who do their thing beneath the earth in \"Metropolis.\" Workers are seen as nothing but replaceable robots. If someone gets hurt, they get carted away and replaced immediately but some other zombie-like human. Of course, people being mistreated can only take it for so long before rebellion. That's history, from the days of the Jewish slaves in Egypt to today, so that's part of this story, too. I won't say more to ruin it.I don't want to mislead people on one major point: today's audiences watching this. Few people in 2008 watch silent movies. To ask them to sit through two hours of a silent film is, obviously, asking a lot. I had to break this up into several viewings, myself, but that's okay. I still enjoyed it.....but it a silent movie this long is not easy to sit through. You have to be a student of film, or a big film buff, to watch this....but those people will be rewarded. Over 250 reviews in here show you this film has enough to offer, or at least take a look. Now that this restored version is available, check it out!"
    },
    {
      "username": "cartman_1337",
      "userUrl": "https://www.imdb.com/user/ur0322329",
      "reviewLink": "https://www.imdb.com/review/rw0004229",
      "warningSpoilers": false,
      "date": "12 May 1999",
      "rate": "10",
      "helpful": "262 out of 329 found this helpful.",
      "title": "_The_ perfect sci-fi movie!",
      "content": "This must be one of the greatest movies of all time. I found myself almost in a state of shock during the whole movie. Everything was perfect. The story was great, the filming was pure genius and the effects directly from another dimension.I don't think any movie after this one have gotten so much out of the available effects of the time as this one. Nowadays they have super computers generating special effects. Sure they look good, but it's no big deal making them. Back in 1926 computers weren't even invented yet, all effects had to be done by hand or in simple editing. And when you take a look at all the thins that have been done in this movie, it's impossible not to get impressed. Huge buildings, explosions, flooding, picture phones (however did he come up with the very idea?), transformation sequences, robots and so on. No movie has ever pulled the limits of special effects as much as this one. Star Wars and Jurassic Park are also known as limit pullers in special effects, but they don't even come close.Then you have the filming. Everything is perfect. The use of body language is tremendous, the light setting perfect, everything well timed and perfectly captured by the camera. I've never been witness to such a treat in filming other places.And the story!!! Perfect in every detail. Intriguing, exciting and thrilling with lots of religious undertones and tyranic leaders. No wonder Hitler liked this movie...I don't know how the original music of the film was, but the new music for the restored 139 minute version I saw was really good and moodseting.All in all. This is one of the most perfect movies of all time, and it deserves anything it can get. Never has a 10/10 been as secure as for this movie..."
    },
    {
      "username": "Igenlode Wordsmith",
      "userUrl": "https://www.imdb.com/user/ur1448185",
      "reviewLink": "https://www.imdb.com/review/rw1344057",
      "warningSpoilers": false,
      "date": "17 April 2006",
      "rate": "6",
      "helpful": "71 out of 102 found this helpful.",
      "title": "Stunning imagery, pity about the plot",
      "content": "One definitely can't fault the breadth and ambition of Fritz Lang's vision, even if, as always with depictions of the future, there are a few forgivable blind spots. (The cars that swarm up and down the multiple levels of Metropolis are unmistakably the standard models of the 1920s, as are the flying-machines that buzz about them; while the business dress of tomorrow's rulers, unlike their exotic leisure wear, doesn't appear to have advanced one iota!)H.G.Wells criticised the film for its adherence to arty image over scientific rigour, and as a piece of coherent science fiction it's certainly as lacking as he claimed. The machines exist to appear awesome and to torment their workers rather than to perform any apparent task, and there is no explanation of how this society functions, how it evolved or how it is sustained, let alone of the incongruities that must surely lie behind such anomalous locations as the catacombs and the cathedral. But Wells' own futuristic film, \"Things to Come\", conceived in direct riposte to Lang's 'unscientific' approach, is tedious and talky as a result, didactic in its heavy-footed philosophy and explanations, and lacking in artistic vision: \"Metropolis\" may be 'soft' SF, but its approach undoubtedly makes for better cinema.I am not, however, impressed by it as a film. Masterpiece of Modernism it may be -- but great design and special effects can't save today's big-budget clunkers from deficiencies of character and plot, and they don't save this one. Ironically, I suspect that its reputation has benefited greatly from its being the only silent film many of its viewers have ever encountered: reading through the IMDb pages, I see well-meaning comments like \"Great -- when you consider how primitive cinema was in 1927\" and \"once you get used to the fact that it takes about ten gestures to convey one sentence...\" It wasn't -- and it doesn't!As silent films go, this is in many places agonizingly slow and repetitious, marred by clumsy acting, tendentious titles and overwrought gestures. By the late 1920s, cinema had progressed far beyond this laboured pantomime: in Lang's case the heavy stylisation may have been a deliberate choice, but compared to the fluidity of contemporaries such as Sjostrom's \"The Wind\" or \"The Scarlet Letter\", Asquith's \"Underground\" or \"Shooting Stars\", and Murnau's \"Sunrise\", the film comes across as ten years behind the times. The problem is not necessarily with the actors -- Brigitte Helm, as has been observed, does an excellent job in differentiating her two characters -- but with the direction and pacing.We saw the restored version with the original Gottfried Huppertz score; the latter didn't always seem to fit too well, with pops, jumps and awkward silences, but this was I assume due either to the difficulty of fitting it to allow for the missing material, or to problems in the projection booth when running a newly-arrived print for the first time. However, the painstaking summary of the various 'missing scenes' only ended up increasing my appreciation of what a good job had been done in the editing-down in the first place! To take a single example: where the edited version conveys Freder's sudden recollection that he is supposed to be the workers' long-awaited 'mediator' via the simple juxtaposition of three shots -- the shift-change whistle announcing the meeting, the catacombs and Freder suddenly struck by an idea and rushing off -- the restoration betrays the fact that a couple of scenes of mimed dialogue were originally provided to spell out the message at painstaking length...It is interesting to see how it was done, but most of the cuts are either an improvement or a very clever abridgement, and by and large I didn't feel that what was omitted had been any great loss. In fact, frankly I felt that the film was in need of further editing at certain points, such as Rotwang's pursuit of Maria through the catacombs. She screams, and runs, and screams, and runs, and is pursued by a searchlight effect; it's clever, self-consciously clever, the first couple of times, but the repetition becomes tedious to the point of caricature. Plot infelicities abound in increasing numbers, culminating in the infamous 'Hunchback of Notre Dame'-style ending where the mad scientist carries off the girl across the roof of the cathedral hotly pursued by Our Hero, which raised giggles, in a hitherto serious and respectful audience, with which I couldn't help but sympathise.This is a film to see once in a lifetime so that you can say that you have seen it -- not least because most of the impact lies in the visuals. But it's all surface and no substance: the characters act arbitrarily, the plot is subservient to the Message, the pacing is like treacle, the story-telling technique is primitive, and really all it has going for it is the visual flair and the special effects. I quite honestly believe that this work would be better appreciated as a set of stills in a glossy brochure; an exhibit in a design exhibition. This is not cinema as I love it -- it's innovative, it may be Art, but as an actual film it's only a poor shadow."
    },
    {
      "username": "Birwin",
      "userUrl": "https://www.imdb.com/user/ur0170123",
      "reviewLink": "https://www.imdb.com/review/rw0004302",
      "warningSpoilers": false,
      "date": "18 December 1998",
      "rate": "10",
      "helpful": "181 out of 230 found this helpful.",
      "title": "A fantastic movie, a must see",
      "content": "I was shocked to find myself riveted to this movie. This is without a doubt the best sci-fi movie I've ever seen! Let me explain my position. We have all seen modern sci-fi movies, and argued over which is the best ever made, but those film makers have high speed film and computers. Imagine trying to make a movie today with only the tools available to Fritz Lang in 1925, and even if you used a modern camcorder it would be nigh impossible! This is a must see for all persons interested in the history of film, as well as just good fun for everyone. The social metaphores as well as the religious and philosophical double meanings are a sight to behold."
    },
    {
      "username": "frankde-jong",
      "userUrl": "https://www.imdb.com/user/ur35683824",
      "reviewLink": "https://www.imdb.com/review/rw5183222",
      "warningSpoilers": false,
      "date": "12 October 2019",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Sissy story but a great film",
      "content": "For a long time the story of \"Metropolis\" was incomprehensible because of lost footage. In 2008 in Buenos Aires parts of the movie that were considered lost were rediscovered and the story made sense again.That the story made sense is not to say that it is a great story. Too many characters are one dimensional or not very realistic. Freder (the son) is totally naive and Maria is too much saint-like. On top of that the motto of the film \" The mediator between head and hands must be the heart\" is a bit sack baked.Nevertheless \"Metropolis\" is one of the great films of all time and a model for science fiction movies up to this day.The elaboration may be too idealistic, but \"Metropolis\" has two themes that are socially very relevant. In the first place the mechanization of work. This theme is illustrated by a choreography of workers that illustrates their subordination to the machines. With respect to this theme \"Metropolis\" is the predecessor of films such as \"A nous la liberte\" (1931, Rene Clair) and \"Modern times\" (1936, Charlie Chaplin). In the second place the dichotomy between the happy few and the poor workers. In this respect \"Metropolis\" is the predecessor of \"Blade runner\" (1982, Ridley Scott) (although in that film the poor were not the workers but the robots / replicants).Apart from relevant themes the film has also a very convincing filmlanguage, in some cases innovative in other instances going back to older movies. I will give a few examples. The machine turning into a savage monster in the fantasy of young Freder (\"Cabiria\", 1914, Giovanni Pastrone). The transformation of dead material into living one (\"Frankenstein, 1931, James Whale). The mad scientist Rotwang with the hand with a black glove (\"Dr Strangelove\" 1964, Stanley Kubrick).Apart from that the architecure in \"Metropolis\" (inspired by the New York skyline) is, combined with the art deco interiors, unsurpassed.All in all \"Metropolis\" is one of the highlights pf German expressionism."
    },
    {
      "username": "utgard14",
      "userUrl": "https://www.imdb.com/user/ur1896124",
      "reviewLink": "https://www.imdb.com/review/rw3088885",
      "warningSpoilers": false,
      "date": "19 September 2014",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "\"Do you think that losing a hand is too high a price to pay for re-creating Hel?!\"",
      "content": "Peerless silent sci-fi masterpiece from Fritz Lang. My favorite film of his and probably my favorite silent film overall. A masterfully crafted epic with striking visuals that will blow your mind, especially given that this was released in 1927. The special effects and sets are remarkable and unlike anything else seen at the time. The style has been copied many times down through the decades. It's still being copied today. There are maybe a handful of films that have been as stylistically influential as Metropolis. The story is intriguing and thought-provoking, although it may not be the cup of tea for sensitive political types. Hopefully even those people will be able to appreciate the remarkable technical and artistic achievements of this film. A lot of people will balk at watching this because it's a silent movie. Well they are missing out on something truly special. Epic, classic, and groundbreaking are words that are often overused with many movies but not this one. This is a true work of art that deserves all the praise it gets."
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw1072196",
      "warningSpoilers": false,
      "date": "2 May 2005",
      "rate": "10",
      "helpful": "12 out of 18 found this helpful.",
      "title": "The \"Blade Runner\" of the '20's.",
      "content": "This truly is a classic masterpiece and honestly one of the best movies ever made. The story is brilliant and the visuals amazing.I have seen the German 147 minutes version of the movie, without subtitles. Yes it's a long watch but it's worth every second of it. Basically only reason why the movie is so long is because they need about ten hand gestures to speak one sentence. It's kind of dreadful to look at first but once you're used to it, it shouldn't trouble you anymore.In many ways this movie can be regarded as the \"Blade Runner\" of the '20's. \"Metropolis\" is set in a futuristic world that has a same kind of atmosphere as in \"Blade Runner\". The mix of '20's cars and propeller-planes with futuristic machines, highways, buildings and androids is very unusual but an absolutely awesome thing to look at. The movie was ahead of its time and in some ways also prophetic.The story is absolutely the best thing of the movie. Also the way the story is told and directed by Fritz Lang deserves credit. The story is tense and has quite some symbolism, layers and storyline's but remains always easy to follow. The ending is truly spectacular and tense. The way how spectacular and tense the ending and the entire movie in general was, really surprised me in a positive way.The sets are obviously fake and miniatures at times but they still manage to convince and impress. Further more the movie is filled with some fantastic and very convincing early special effects.Man who also deserves credit is Alfred Abel. Wow, what a great actor he was in this movie.An absolute must see and one of the best movies of all time.10/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "morrison-dylan-fan",
      "userUrl": "https://www.imdb.com/user/ur5424352",
      "reviewLink": "https://www.imdb.com/review/rw2471594",
      "warningSpoilers": true,
      "date": "9 August 2011",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Metropolis:The Reconstructed and Restored Cut.",
      "content": "Ever since I've decided to become introduced to silent cinema,with Alfred Hitchcock's outline- setting film The Manxman and John Ford's industrial revaluation western The Iron Horse,the name Fritz Lang has had an almost magnetic grip of being at the very top of my list,of directors whose work I have been eagerly wanting to view.When I heard a few years ago,about a \"holy grail\" being struck for film history,with a worn out copy of Langs silent epic Metropolis being pulled out of oblivion,and leading to the huge discovery of twenty five minutes of missing scenes/moments being found in the print.After reading that the film was going to be kept safely in a preservation society,due to the understandably fragile nature of the film,my expectations of this cut of the film coming out on home video gradually disappeared.Years later,I decided to search on Amazon UK to see what titles had been realised from The Masters Of Cinema DVD company. (the UK's version of Criterion) To my amazement,right at the very top of the page,was a very sophisticated looking DVD of the reconstructed/restored edition of Metropolis!.With having just started to discover the world of silent cinema,and looking at one of the most tempting DVDs which I have seen in years,I felt that it was the perfect time for me to see the full creation of Fritz Lang's futuristic city.The plot: Being the son of arguably the biggest titan/philanthropist of a very advance industrial city called Metropolis,Freder has lived a life of complete bliss,where anything he has desired to achieve,has been reached to a level of success, that most of the residents of the city will never reach.Whilst out walking one day,Freder catches a quick glimpse of a girl who he instantly becomes obsessed with seeing again.As Freder is attempting to build the courage to go up to the girl,the girl is suddenly griped by security guards,who drag her down to the second level of Metropolis, where the workers who keep this huge city alive are kept,whilst the rich people in Metropolis live in mansions/villas on the \"Top\" level.Not being deterred one bit,Freder decides to secretly travel to the second level for the first time in his life.Getting deeper and deeper into the second level,Freder starts to become extremely sicken at the level of depravity and hopelessness that the lives of the workers have become engulfed in,with some of them even being thrown into a machine to die,just to \"help\" keep the cites electricity going. Horrififed by his discovery's,,Freder goes to tell his father Jon about what he has seen in the workers section of the city.To his complete surprise Jon dismisses everything that his son has told him,due to him feeling that the city must stay \"alive\" in anyway possible.Fearing that Freder might attempt to help an uprising begin,and finding out that some workers have gotten hold of secret documents which show the inside stricter to Metropolis's power supply,Jon decides to hire a spy called The Thin man to keep an eye on his son and the workers.Following him,The Thin man gets hold of the inventor of Metropolis:C.A Wotwang to guide him around the city.With there eyes all on him,Freder is eventually found to be attending a secret meeting,where him and a huge number of workers are getting told about a new philosophy from a woman called Maria (who Freder has been crazy about,since catching a quick glimpse of her on the top level of Metropolis)Attempting to accept for the first time in his life that a fall from power might be upon them,Jon and C.A. take the most drastic measures possible to destroy the bubbling uprising,by inventing a robot.Quickly getting hold of Maria,C.A. transfers her appearance to the robot (who he will be controlling).Having succeeded in the transfer of Maria's appearance,C.A. and Jon begin to pray that their fake Maria will stop the up rising dead in its tracks,although none of them have any idea about how much (the real) Maria's philosophy is affecting the workers,who are starting to build up into something that none of them may be able to topple... View on the film: The first people who deserve a huge round of applause are The Master Of Cinema makers,who have created a obviously lovingly made DVD/Blu- Ray.Although the \"new\" 25 minutes of extra footage does contain a good amount of grain, (which is understandable,due to the reels of film being left to gather dust) the footage which has been used in previous editions of the film,has now been given a mesmerising remastering,with the quality of the picture being one that could beat a huge number of films made today!.For the adaptation of her own novel,screenwriter Thea Von Harbou, (who Lang would later divorce,shortly after she had become a member of the Nazi's)interestingly shows that during the workers revolt against the \"higher-ups\",they all struggle to become distinct individuals.With the first part of the film, showing the workers being used as puppets to keep the city alive,who are also hidden away as an embarrassing,necessary \"evil\" for the higher-ups,to the second half of the film,where the workers turn into a mass tidal-wave,whose destructive nature,leads them to even (temporally) forgetting about their children!.Along with the brilliantly tense screenplay of his then- wife,Fritz Lang delivers the film with masterful directing.For the two levels of Metropolis Lang creates two extremely different \"worlds\",With the workers level having a menacing foggy Noirish look,which helps to give a sense that anyone could jump out and attack you,to the top level,which is filled with mind-blowing technology,and packed with stunning housing.For the excellent characters of The Thin Man and C.A. Wotwang,Lang gives the film an amazing,creepy Gothic feel,with The Thin Man looking like Dracular working undercover as a spy!.Looking at the structure of the film,Lang seems to have created two distinct parts,which combined to make one unforgettable whole,due to Lang delivering an astonishing film,which mixes gripping Noirish moments,and still-stunningly executed special effects."
    },
    {
      "username": "anaconda-40658",
      "userUrl": "https://www.imdb.com/user/ur60028700",
      "reviewLink": "https://www.imdb.com/review/rw3226143",
      "warningSpoilers": true,
      "date": "24 April 2015",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The Future of Sci-Fi!",
      "content": "Metropolis (1927): Dir: Fritz Lang / Cast: Gustay Frohlich, Brigitte Helm, Alfred Abel, Rudolf Klein-Rogge, Heinrich George: Absolute masterpiece by director Fritz Lang about man's slavery to machines. Workers file onto an elevator in a haunting manner overseen by their boss who is angered when his son Fleder passes through the gate to observe the operation. Fleder is transfixed on Maria who is a Christ-like figure instructing peace. The boss turns to a mad scientist who constructs a robot in Maria's image. She will lead the people to destruction by destroying the machines. By doing this the operation floods putting workers out of homes. Meanwhile the mad scientist kidnaps Maria thus placing Fleder in a position of heroism. Extraordinary vision of mechanics and magnificent production that put Lang ahead of his time. The machinery is detailed and visualized paving the road to an onslaught of clones that mostly never measure up. Alfred Abel plays the boss who symbolizes man's lack of understanding as well as the portal to improvement. Rudolf Klein-Rogge plays the scientist who symbolizes corruption and defeat. Brigitte Helm as Maria symbolizes peace and the hope for a brighter future. Heinrich George as the foreman represents the common citizen or worker who is deemed an explanation when catastrophe hits. Gustay Frohlich as Fleder represents the willingness to improve. Score: 10 / 10"
    },
    {
      "username": "trashgang",
      "userUrl": "https://www.imdb.com/user/ur12844960",
      "reviewLink": "https://www.imdb.com/review/rw3324906",
      "warningSpoilers": false,
      "date": "28 September 2015",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "man machine",
      "content": "A masterpiece that's all I can say. Go figure out how they did all the effects back then. Editing wasn't what we see nowadays and CGI wasn't done of course so it had to be done all in-camera or layer on layer for special effects. German expressionism on it's best. Finally since a few years full uncut after finding the reel in Buenos Aires in really bad conditions. It shows in the full uncut but it doesn't bother. just seen it finally on Blu Ray it's worth picking up. Not only for the restoration but for the flick itself of course. Just see the settings how wonderful they were. What even surprised me was that in the beginning one dancer is showing her breasts and that for 1927! Even the main lead Brigitte Helm transformed into the robot goes dirty dancing. One of the last silent movies made, it was in the same year that The Jazz Singer came out with sound. Even clocking in way over 2 hours not one minute did it bore me. Cult classic that did stand the time and is still actual. Gore 0/5 Nudity 0/5 Effects 5/5 Story 5/5 Comedy 0/5"
    }
  ],
  "errorMessage": ""
}