{
  "imDbId": "tt0107048",
  "title": "Groundhog Day",
  "fullTitle": "Groundhog Day (1993)",
  "type": "Movie",
  "year": "1993",
  "items": [
    {
      "publisher": "Washington Post",
      "author": "Hal Hinson",
      "link": "https://www.washingtonpost.com/wp-srv/style/longterm/movies/videos/groundhogdaypghinson_a0a7e9.htm",
      "rate": "90",
      "content": "For once, the audience isn't forced to surrender its intelligence (or its healthy cynicism) to embrace the film's sunny resolution."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Scott Tobias",
      "link": "http://survey-smiles.com/",
      "rate": "90",
      "content": "A hilarious and unexpectedly profound comedy."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "This movie has all the qualities necessary to be a crowd-pleaser: likable characters, charismatic performers, a strong, capably-executed premise, and lots of laughs."
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "80",
      "content": "Murray, more often than not, is pretty unbearable; but here, playing a man who is unbearable, Murray begins convincingly, amusingly, and gets even more amusing as he metamorphoses. [15 Mar 1993, p.24]"
    },
    {
      "publisher": "The New York Times",
      "author": "Elvis Mitchell",
      "link": "",
      "rate": "80",
      "content": "That glimmer of recognition is what makes Groundhog Day a particularly witty and resonant comedy, even when its jokes are more apt to prompt gentle giggles than rolling in the aisles."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "75",
      "content": "A demonstration of the way time can sometimes give us a break."
    },
    {
      "publisher": "",
      "author": "Austin Chronicle",
      "link": "https://www.austinchronicle.com/events/film/1993-02-19/groundhog-day/",
      "rate": "67",
      "content": "There were a lot of ways for this film to go stupid; it succumbs to none of them."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "67",
      "content": "The funniest moments in Groundhog Day come when Phil takes sneaky advantage of his predicament-by, say, pumping a sexy woman in the local coffee shop for facts about her past and then, ''the next day,'' using the information to lure her into bed. What the movie lacks is the ingenious, lapidary comic structure that could have made these moments fuse into something tricky and wild."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Rick Groen",
      "link": "",
      "rate": "63",
      "content": "Dial your expectations to moderate, burrow in for the duration, and you won't be disappointed - it ain't exactly springtime, but there are worse things than an amiable outing on a winter's night."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "60",
      "content": "Considering that none of the characters is fresh or interesting, it's a commendable achievement that the quality of the storytelling alone keeps the movie watchable and likable."
    }
  ],
  "errorMessage": ""
}