{
  "imDbId": "tt5027774",
  "title": "Three Billboards Outside Ebbing, Missouri",
  "fullTitle": "Three Billboards Outside Ebbing, Missouri (2017)",
  "type": "Movie",
  "year": "2017",
  "items": [
    {
      "publisher": "The Guardian",
      "author": "Xan Brooks",
      "link": "https://www.theguardian.com/film/2017/sep/04/three-billboards-outside-ebbing-missouri-review-frances-mcdormand-martin-mcdonagh",
      "rate": "100",
      "content": "Those familiar with McDonagh’s work will be unsurprised to learn that Three Billboards is a bold and showboating affair, robustly drawn and richly written; a violent carnival of small-town American life. Yet it has a big, beating heart, even a rough-edged compassion for its brawling inhabitants."
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/films/0/three-billboards-outside-ebbing-missouri-reviewmartin-mcdonaghs/",
      "rate": "100",
      "content": "It all makes for soaringly satisfying viewing, yet the satisfaction comes from blistering performances and virtuosic screenwriting, and absolutely nothing else."
    },
    {
      "publisher": "IndieWire",
      "author": "Ben Croll",
      "link": "https://www.indiewire.com/features/general/three-billboards-outside-ebbing-missouri-review-frances-mcdormand-venice-1201872841/",
      "rate": "91",
      "content": "Not only is Three Billboards Outside of Ebbing, Missouri the director’s most accomplished film yet, it’s also his most compassionate."
    },
    {
      "publisher": "The Playlist",
      "author": "Gregory Ellwood",
      "link": "",
      "rate": "91",
      "content": "What immediately comes to the forefront is that McDonagh has choreographed an almost impossible feat of a brutally dark comedy that, thanks to both Rockwell and McDormand, elicits an emotional response you simply don’t see coming."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "David Rooney",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/three-billboards-ebbing-missouri-review-venice-2017-1034931/",
      "rate": "90",
      "content": "While the film continues almost throughout to generate great whoops of shocking laughter, it's the notes of genuine sorrow, compassion and contrition that resonate."
    },
    {
      "publisher": "The A.V. Club",
      "author": "A.A. Dowd",
      "link": "https://www.avclub.com/the-unpredictable-three-billboards-outside-ebbing-miss-1820287079",
      "rate": "83",
      "content": "Landing closer to Coens country, Three Billboards is more of a slow-roasting tragicomedy about grief and culpability, with higher stakes, a lower gag count, and emphasis on the tragic. But McDonagh still lives for detours and digressions, for the opportunity to stall the plot and humorously slow play a conversation."
    },
    {
      "publisher": "CineVue",
      "author": "John Bleasdale",
      "link": "",
      "rate": "80",
      "content": "Three Billboards Outside Ebbing, Missouri is a multi-layered piece with such swathes of great dialogue that it will no doubt reward - if not demand - multiple viewings. It's also another item of evidence pointing toward a filmmaker getting into his stride."
    },
    {
      "publisher": "Time Out London",
      "author": "Dave Calhoun",
      "link": "",
      "rate": "80",
      "content": "It’s full of sharp dialogue and entertaining characters and fuelled by a wryly enlightened view of our world and how it can be at once cruel and caring. For a story built on such dark foundations, it’s weirdly reassuring. It’s also enormous fun."
    },
    {
      "publisher": "Variety",
      "author": "Owen Gleiberman",
      "link": "https://variety.com/2017/film/reviews/review-three-billboards-review-frances-mcdormand-1202546444/",
      "rate": "80",
      "content": "It’s far from a masterpiece, yet it holds you, it adds up, and it’s something to see."
    },
    {
      "publisher": "Screen Daily",
      "author": "Fionnuala Halligan",
      "link": "",
      "rate": "70",
      "content": "Anchored by a funny, foul-mouthed performance from McDormand, McDonagh’s daringly-structured dark comedy is rich and layered and often laugh-out-loud funny but trips over constant tonal shifts."
    }
  ],
  "errorMessage": ""
}