{
  "imDbId": "tt5027774",
  "title": "Three Billboards Outside Ebbing, Missouri",
  "fullTitle": "Three Billboards Outside Ebbing, Missouri (2017)",
  "type": "Movie",
  "year": "2017",
  "items": [
    {
      "username": "PedroPires90",
      "userUrl": "https://www.imdb.com/user/ur26163020",
      "reviewLink": "https://www.imdb.com/review/rw8047364",
      "warningSpoilers": false,
      "date": "10 April 2022",
      "rate": "9",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Real world",
      "content": "I'm completely tired of people who think films should only have black or white characters, people who think films should not show racism, homophobia, stupid people, like that is not...the fu****' real world? That's why I think I like this much. It's not afraid to shock and it's not afraid to make you think. Good people make some bad things. Bad people make some good things. People can change. I know this is a lot for this new world order where you are right 100% of the time or wrong 100% of the time, but this is what being human means.It's curious because even if I feel those grey areas gave the film a really strong plausibility quality, at the same time I feel this town has a huge number of ignorant and fool people. Maybe too many? I don't know. I felt I can perfectly understand why McDormand accepted this role, as this seems to be written by her husband and his brother, with that blend of comedy and drama that it makes it really unique.By the way, speaking about McDormand...what a stupendously enormous interpretation. One of the best acts I've ever seen and she won the day immediately on her very first confrontation with the priest. What a woman, what an actress! Very strong performance from all the cast - Sam Rockwell starts as a racist+homophobic Dewey and transforms himself through the film in an incredible way; Woody Harrelson was phenomenal when in scene and Peter Dinklage and Clarke Peters even with less time, had time and space to shine.Loved the soundtrack of this, the score, the editing and how McDonagh was courageous and unafraid directing all these elements, being provocative and putting us in many shoes (and minds) that we probably didn't want to be.I think it's easy to say I would like to see some kind of a different ending, but I must admit that you need balls to go this way and, after thinking about it, I can totally understand the decision. It makes sense. After all, this was never about the investigation or finding who did it. It was all about the characters, these ugly and/or traumatised bast****, how they can grow as people and how they can overcome their trauma."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw3876392",
      "warningSpoilers": false,
      "date": "7 December 2017",
      "rate": "8",
      "helpful": "201 out of 293 found this helpful.",
      "title": "Anger begets more anger",
      "content": "Frances McDormand is a grieving mother who puts up \"Three Billboards Outside of Ebbing, Missouri\" in this 2017 black comedy directed by Martin McDonagh.Mildred Hayes (McDormand) is disgusted that the police haven't found her daughter's rapist and killer, so she takes out billboards asking why the chief of police, Willoughby (Woody Harrelson) hasn't done anything about the case.The billboards set off anger, violence, and revenge motifs in this small town. Things become worse when a pent-up police officer, Dixon (Sam Rockwell) becomes enraged and starts acting out.Lots of swearing, lots of violence, and lots of laughs to be had in this film. It was strange to watch as I had just seen another film, Past Life, that focused on the subject of anger and pain, and how it can eat a person up and destroy them. This film is yet another good illustration of that, as Mildred stops at nothing to make a point.The one-liners are amazing, and Mildred's speech to the priest who comes by to ask her to remove the billboards is hilarious. The movie is filled with strong performances and equally well-developed characters. We see all of their sides - violent, kind, vengeful, angry, sad; we finally realize they're just people driven in some cases to extremes.Harrelson's performance is touching -- we're prepared to dislike him but his sincerity and humanity come through. As Dixon, Rockwell seems like a monster, but once he acts out, he's able to focus his energy a little better.And then there's McDormand, a powerhouse. She's not good ol' Marge in Fargo. She's a tough woman with a broken heart who takes out her anger any way she can. It's a beautiful, multilayered performance. Highly recommended, asking the questions of where revenge and hatred can take us, and deciding when and if it stops."
    },
    {
      "username": "tyson-hunsaker",
      "userUrl": "https://www.imdb.com/user/ur33875393",
      "reviewLink": "https://www.imdb.com/review/rw3874699",
      "warningSpoilers": false,
      "date": "4 December 2017",
      "rate": "9",
      "helpful": "456 out of 618 found this helpful.",
      "title": "A thought-provoking and darkly comedic drama with lots to say.",
      "content": "\"Three Billboards outside Ebbing, Missouri\" marks a milestone for writer/directer Martin McDonagh and is an idea piece on a mother's struggle with her town after posting billboards containing a call to action in regards to her murdered daughter. With outstanding screen writing and near perfect editing, this powerhouse of a film is easily one of the best all year and is driven with force and intensity by its lead, Frances McDormand.What begins as a narrow and focused drama, gradually escalates to a film with big themes and ideas, relevant social commentary, and much more subplots than anticipated. \"Three Billboards outside Ebbing, Missouri\" is packed with questions and a few answers about anger, revenge, violence, and kindness. The story shows people in a realistic light I've never quite seen before. We're presented with characters and their genuine emotions. Nothing feels sugarcoated of fluffed but it never lacks emotional impact either. The movie balances its seemingly contradictory tones beautifully by crafting a dark comedy that feels heavy due to strong subject matter, while at the same time, utilizing comedic moments that feel completely natural to the character's motivations. It's obvious great care was taken into this script and the method in which it's constructed. One of the most talked about elements to this film are the strong performances; particularly by Frances McDormand and Sam Rockwell. Rightfully so, this is some of their best (if not their best) work these eyes have beheld and they steal the show in every film they're in. That's not take away from Woody Harrelson and Lucas Hedges, as well as the entire cast who give memorable performances and paint shockingly believable characters that we feel we know personally. If there is anything that might turn audiences away from this film, it might be its harsh subject matter despite none of it every being depicted as well as its language and execution with the material. Personally, this has a strong impact and I wouldn't have changed anything about it. It's a highly recommended film with a lot to ponder at the end and is definitely a contender for best movie of the year. Definitely don't miss this one."
    },
    {
      "username": "Semisonic",
      "userUrl": "https://www.imdb.com/user/ur41574791",
      "reviewLink": "https://www.imdb.com/review/rw4065779",
      "warningSpoilers": false,
      "date": "17 February 2018",
      "rate": "9",
      "helpful": "248 out of 350 found this helpful.",
      "title": "Anger, what it begets, and what to do about it",
      "content": "When you think about great cinema, you often imagine some grandiose epic setting which all that greatness builds upon. The likes of Gone With the Wind or Godfather or The Shawshank Redemption, such films span through decades or cover the major historic events.But a great story isn't necessary grand on the outside. Three Billboards Outside Ebbing, Missouri is like a tiny rabbit hole size of those three wooden screens, but stick a head in - and you'll see a huge empty space laid with people's sorrow, guilt and regret. And that emptiness sucks you in and leaves no way to stay untouched.But there's also hope. Hope for justice. Hope for retribution. And maybe even hope that it's still not too late to change something, or to change yourself. That nothing is absolutely black and white. That even in the darkest moments of our lives there's some room for a sense of humor, maybe a sad and bitter one but still one worth a warm smile.This world is a crooked place, where crime often goes unpunished. And Peter Dinklage's small role in this film, as a reference to another not so pretty world where the \"happily ever after\" way doesn't quite exist, is a stinging reminder of that. TBOEM does not, however, try to pull the magic sword out of the stone and go crush the wicked and protect the righteous. Instead, it shows that sometimes, crumbling under the weight of the evil things that fall on us, we lose our own limits and become those who sow evil ourselves. Anger does beget even more anger.And maybe the reason that makes America great indeed is that, with all the messed up stuff happening without and within, it's in your culture to value forgiveness, something Christianity teaches everyone but not everyone tends to listen. To suffer without guilt, yet to offer a helping hand to your offender when he's down and wounded. To break the circle of evil and help each other wake that yearning for decency that everyone has inside them, albeit dormant sometimes. Forgiveness is tough, and, just like revenge, it doesn't bring back the things - or people - we've lost. But at least it helps to hold onto what could still be here.Yeah, it's just a movie, and most people aren't as deep and philosophical as the movie characters can afford to be. But if some unrealistic complexity (and sometimes even wisdom) of the simple people could make some real regular people on the other side of the screen stop and think over their own real regular ways, maybe that's exactly what we need from time to time. Because life is still here, and so are the multiple choices it gives, And which road to choose today, we can still decide along the way."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw4057486",
      "warningSpoilers": false,
      "date": "9 February 2018",
      "rate": "8",
      "helpful": "33 out of 49 found this helpful.",
      "title": "Comedy, tragedy and morality rolled into one",
      "content": "Saw 'Three Billboards Outside Ebbing, Missouri' on the promise of one of the year's best trailers, the immensely talented cast, the intriguing subject matter, the receiving and pending of numerous accolades and being familiar with Martin McDonagh's previous work. On the most part 'Three Billboards Outside Ebbing, Missouri' was incredibly well done. Understandably it is not for all. The film has already been criticised for implausibility, bigotry, the ending and its lack of character likeability and over-the-top actions, though often without acknowledging the film's many strengths and resorting to condescension (a big bugbear of mine) towards people who liked it let alone loved it. Did have a couple of issues with 'Three Billboards Outside Ebbing, Missouri' myself. The ending is far too abrupt and without resolution in a film crying out for one. Epileptics should beware too of a dizzyingly edited attempted murder scene, understand why it was edited that way but will admit that it did make me feel ill watching it (luckily it quickly passed). Abbie Cornish felt out of place here, she doesn't have a lot to do (not enough to single handedly ruin the film, she would have to have a far more major role to do that) but everything about her just jarred. There are some implausible behaviours and consequences, Dixon's actions were more than just a sackable offense for instance.However, there is so much to like about 'Three Billboards Outside Ebbing, Missouri'. With the sole exception of Cornish, who isn't in it enough to ruin the film, the acting is brilliant. Frances McDormand's performance is a career high and one of the year's best, very heartfelt and fiery, even if you don't condone some of her actions it is hard not to feel for her as she goes through every mother's worst nightmare. Woody Harrelson is heart-breaking and has the film's most sympathetic character perhaps (either he or Peter Dinklage's, although Dinklage doesn't have the film's most tragic scene). Sam Rockwell is similarly a revelation, you initially dislike his character but later on his 180 is incredibly moving and he is the character who changes and redeems the most. Peter Dinklage always makes anything better and it's the same here just by his presence alone and his performance is the most likeable one, especially towards the end where one actually feels sorry for him. Another standout is the writing, do not let the heavy use of profanity put you off. There are parts that are darkly comic and induce a number of chuckles and laugh out louds. The film also works as being one that is morally nuanced and complex, the characters are not \"likeable\" ones, neither were they intended to be, and make questionable decisions but they undergo changes that sees them in a different perspective (Dixon especially). A large part of me found it difficult to not relate to Mildred, her actions are extreme at times but there are parents in the same situation that feel similarly seeing as grief is an incredibly powerful and complex emotion. It's the tragic elements that resonate most though, with its heavy going themes handled very poignantly and harrowingly. 'Three Billboards Outside Ebbing, Missouri' has a story that is deliberate but also gripping, with an adept balance of its varied tones. Which is why it is sad that it ends as unsatisfyingly as it does. With the exception of one scene, 'Three Billboards Outside Ebbing, Missouri' is succinctly edited and grittily and beautifully shot. McDonagh directs very skilfully. Carter Burwell's music score fits perfectly and is a hypnotic, understated and melancholic score in its own right. Just as fitting in a somewhat ironic way is the use of the gorgeous \"Last Rose of Summer\" exquisitely sung by Renee Fleming, whose voice one familiar with and loves classical music and opera (like me) recognises from anywhere. Overall, gripping and very well done film if not perfect. The performances are among the best of the year especially but the film itself as an overall whole just falls a tad short of being one of the year's best films. 8/10 Bethany Cox"
    },
    {
      "username": "ronakkotian",
      "userUrl": "https://www.imdb.com/user/ur81971791",
      "reviewLink": "https://www.imdb.com/review/rw7052001",
      "warningSpoilers": false,
      "date": "21 June 2021",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "This is how a drama should be!",
      "content": "Martin McDonagh has made critically acclaimed throughout his career. I haven't seen In Bruges but I liked Seven Psychopaths. However, it's with Three Billboards Outside Ebbing, Missouri that made me realise what a talented writer and director he is.Three Billboards Outside Ebbing, Missouri follows Mildred, a mother that rents three billboards to challenge the authorities in order to find and capture her daughter's murderer after they fail to do so.With this film, Martin McDonagh has crafted one of my favourite dramas to ever exist. I was thoroughly entertained throughout and couldn't spot a single thing I didn't like. One of the best parts of this film is its unpredictability. With a story like this, I thought I knew where it was headed but McDonagh managed to surprise me every time. Without taking the route many films do with this kind of story, McDonagh subverts our expectations by taking us on a more psychological journey with the characters of Mildred, Dixon and Willoughby. The writing is one of the smartest I've ever seen as McDonagh writes characters with immense depth and emotion. No character is perfect and as the films unfolds, McDonagh peels back the layers of each one of them to create an arc you wouldn't expect them to have on their odyssey of anger, revenge and love. The realistic and humane approach McDonagh takes made me genuinely care about the characters. There are also moments of dark humour spread across but they don't take away from the dramatic elements and impact you're meant to feel.Aside from Martin McDonagh's outstanding writing and direction, the acting is some of the best you'll see. Frances McDormand is an actress that consistently delivers exceptional performances and her performance as Mildred is one of her best. She is an absolute force to be reckoned with and deserves winner the Oscar for her work here. Sam Rockwell is extraordinary as Dixon. This is his best performance yet and he deserves all the awards he got for this film. Woody Harrelson is terrific as usual and plays Willoughby with enormous skill. John Hawkes, Peter Dinklage, Lucas Hedges and Caleb Landry Jones are also great.Every single aspect of Three Billboards Outside Ebbing, Missouri is done exceptionally well. Without a doubt, this is one of the greatest films of 2017. With its dark subject matter, impeccable writing, directing and extraordinary acting, I consider this film to be one of the best dramas to ever exist."
    },
    {
      "username": "rubenm",
      "userUrl": "https://www.imdb.com/user/ur2121650",
      "reviewLink": "https://www.imdb.com/review/rw3833403",
      "warningSpoilers": false,
      "date": "16 October 2017",
      "rate": "9",
      "helpful": "226 out of 366 found this helpful.",
      "title": "Extremely funny film about grief, anger, revenge and violence",
      "content": "It seemed that the pregnant police detective Marge Gunderson from 'Fargo' would forever be the most memorable character of Frances McDormand's acting career. But now I'm not so sure. Mildred Hayes, the heroine from 'Three Billboards', is a serious contender. This might well be her best performance ever.The part of Mildred Hayes was written with McDormand in mind. Hayes is a divorced single mother, living with her son on the outskirts of a small, remote town. She had a daughter too, but the girl was raped and killed on a quiet mountain road not far from home. Frustrated by the lack of progress of the investigation, Hayes decides to rent three dilapidated billboards, publicly accusing the local police chief of incompetence. By doing so, she attracts the attention of the media, angers almost the entire town and causes a succession of increasingly violent actions.Although the film is about grief, anger, revenge and violence, it is extremely funny. Above all because of Mildred Hayes' stubborn character and her ability to verbally humiliate people by her extremely sharp tongue. The monologue she delivers when a priest visits her house to tell her she has gone too far, is priceless.Apart from McDormand's performance, the screenplay is another great feature of this film. The story is full of unexpected twists, gradually shifting the positions of the main characters towards each other. None of the characters are one-dimensional: they all reveal surprising parts of their personalities as the story moves forward.And then there is the overall, almost Coen-esque atmosphere of a small town full of colourful characters. There is a racist cop, a friendly midget, a smart advertising guy and a pretty girl who is so dumb she doesn't know the difference between polo and polio.It is hard to mention something negative about this film. 'Three Billboards' is, from start to finish, a great movie. I can't imagine anyone not enjoying it."
    },
    {
      "username": "FallonTimberlake2016",
      "userUrl": "https://www.imdb.com/user/ur65176833",
      "reviewLink": "https://www.imdb.com/review/rw3845134",
      "warningSpoilers": false,
      "date": "30 October 2017",
      "rate": "10",
      "helpful": "338 out of 500 found this helpful.",
      "title": "A comedic masterpiece with a stellar leading performance from Frances McDormand.",
      "content": "Three Billboards Outside Ebbing, Missouri is a dark comedy that has an a-list cast with names like Frances McDormand, Woody Harrelson, Sam Rockwell, John Hawkes, and Peter Dinklage. It centers around Mildred Hayes, a woman whose daughter was raped and killed, and who believes that the local police have not done enough about it. In reaction, she erects three billboards outside of her town that send a message to the sheriff about the state of the investigation.Writer/director Martin McDonagh (Seven Psychopaths, In Bruges) has outdone himself with this one. In my opinion, if this isn't one of the top Oscar contenders come awards season, then Hollywood has officially lost its mind.Basically everything about this film works: from the acting, to the writing, to the direction. Mcdormand gives the performance of her career here, giving us humor through all the pain clearly shown on her face. Rockwell also gives his best performance here as a cop who isn't that bright and is more than a little racist. Three Billboards Outside Ebbing, Missouri is probably the most unpredictable film of the year, and that's coming from a year that includes films like Baby Driver and Logan. There are scenes where you think that you know where the plot is going, but then midway through it completely flips the script. For the entire run-time of this film, I was invested. It has the perfect run-time; it ends exactly when it needs to and there is not a scene that feels out of place. It seems like one of the hardest things to do in film nowadays is to balance comedy and drama. However, this movie does it effortlessly. Each scene has just the right amount of comedy and drama, and sometimes, despite the fact that you're laughing, it's easy to forget that jokes are being made.Also, the message that this film gives off resonates very powerfully with you after the film finishes. It makes you see the good side in humanity, despite our flaws. No character in this film is a cliché one-dimensional shell of a person. Everybody has a reason for being there, which is more than some films recently have offered.Three Billboards Outside Ebbing, Missouri is easily one of the best and most enjoyable films of 2017, and it will make you laugh, cry, and think all in one sitting. There are not any clear flaws with this film that I can find, but I am still searching.I give Three Billboards Outside Ebbing, Missouri an A+."
    },
    {
      "username": "chicagopoetry",
      "userUrl": "https://www.imdb.com/user/ur19589623",
      "reviewLink": "https://www.imdb.com/review/rw3866838",
      "warningSpoilers": true,
      "date": "25 November 2017",
      "rate": "7",
      "helpful": "429 out of 736 found this helpful.",
      "title": "Beware the p(l)ot holes near the billboards",
      "content": "I will say that I enjoyed this film, mostly due to Frances McDormand's performance. It was surprisingly funny given its subject matter. But after thinking about it for a few days after watching it, I have to say a few words about the writing, because it seems everyone is raving about how \"Oscar worthy\" the writing here is, and at first glance, I thought so too. But thinking back on it, I'd have to say the writing is actually pretty sloppy. There's a lot of stuff here that doesn't make a whole lot of sense, and I mean a lot. I can't explain this without revealing spoilers, so be warned.--Most strikingly the (deputy?) Chief Dixon violently attacks Welby, busts his face with his gun, throws him out of a window and proceeds to kick him while he's down, all in eyes view of the new Chief Abercrombie. Sure, he gets fired. But not arrested? Not even sued?--And as for Abercrombie. He shows up the morning after the previous Police Chief died and declares that \"they\" sent him as a replacement. They who? Is there some force outside of Ebbing that dictates who their police chief is? That part really didn't make any sense to me. Also, replacing one of the main characters halfway through the film, a character we're starting to get to know, with a stereotype that we don't know anything about, was rather odd.--Someone lights the billboards on fire. But apparently only the paper on them burns, not the old wood that's been sitting there decaying since the 80s, because they are able to paste duplicate posters to the existing structures without any problems. That's laughable. That old wood would have been a pile of smoldering cinder.--Mildred is portrayed as such a tough-ass, assaulting a dentist, kicking children in the crotch (with no repercussions I might add), storming into the police station spouting vulgarities, but when she's confronted by a guy who suggests he's actually the one who killed her daughter, she freezes and seems helpless. One might say the fact that she didn't go psycho in this scene is what makes this screenplay original but someone else, like me, might argue that it's just out of her character and doesn't make a lick of sense.--Chief Willoughby for some reason is an old geezer but has a young, attractive Australian wife. He also has two young girls. Yet he's completely vulgar around them. While instructing them about a game of fishing he invents, he calls the blanket they are sitting on the \"god-dam blanked\"--twice--to little four or five year old girls. He says to his wife later that it's her turn to \"clean the horse *hit\" out of the barn. OK, I actually have quite a bit of experience tending horses. It's not called \"*hit\" it's called manure and you wouldn't even call it that--you'd just say \"clean the barn\" if you really owned horses. The writing of his character, other than the scene between him and McDormand while they were sitting on the swings, was actually horrible.--Mildred burns the police station down, throwing 5 Molotov cocktails out of the still broken windows of the advertising agency across the street (not boarded up by then?). And the new Chief just accepts the explanation that she didn't do it because she was with James. No more investigation. Ho hum. Police station burned but oh well. And then a few scenes later, Dixon is apparently in the suppose to be burned down police station sitting there having a conversation with the new Chief.--Dixon is a complete jerk to the bone. He gets a letter postmortem from the now deceased Chief. Suddenly he's a good guy. Yeah right.I could go on and on with this but I'm afraid my word limit here is going to expire soon. I'll still give this film a 7 star rating because I DID enjoy watching it, but the writing here is really not all it's cracked up to be. It does feel like it's a big novel with a lot of twists, but in retrospect it's more like a parody of a big novel with a lot of twists, and the twists don't make a whole lot of sense."
    },
    {
      "username": "GODZILLA_Alpha_Predator",
      "userUrl": "https://www.imdb.com/user/ur30915026",
      "reviewLink": "https://www.imdb.com/review/rw3809552",
      "warningSpoilers": false,
      "date": "18 September 2017",
      "rate": "9",
      "helpful": "237 out of 369 found this helpful.",
      "title": "A dark, twisted comedy about grief, tragedy and three billboards",
      "content": "Having recently won the People's Choice Awards at TIFF, Three Billboards outside Ebbing, Missouri is very easy to see why it won.Three Billboards is a dark but also funny and heart-felt story about one woman's quest to get justice for her daughter's rape and murder. After Mildred Haynes buys three billboards with words written on them accusing the town's well-liked sheriff of having not found her daughter's killer, it sets a series of events that turns the citizens and the cops against her.The thing I can say about Three Billboards without going into spoilers is that it is wildly unpredictable. One moment you think things are going one direction as expected then it takes hard left turn that only adds to the dynamic between the characters. As the pressure within the town builds and anger is pointed towards Mildred, we see many of these characters evolve in order to deal with tragedy and grief and learn to find peace. And the movie goes through a roller-coaster of emotions. One moment you are laughing your butt off from the hilarious dialogue then you feel like someone just punched you in the gut. With every victory you think this story brings you feel like it was taken away from because of the world's unfairness and injustice. In lesser hands the mixture of dark and comedic tones would not work, but director and writer Martin McDonagh knows how to balance them to perfection.The performances here just through the roof. Frances McDormand delivers a performance that will for sure get her into the Lead Actress awards race at the Oscars. As Mildred, McDormand just cuts loose with her performance with every line of hate, cynicism and cursing towards everyone she feels doesn't truly understand the internal pain she is going through. But McDormand does now and then show a soft side to Mildred. It shows that Mildred is just person like everyone who has her own way of dealing with the tragedy of loosing her own child. And Sam Rockwell also gives one of the best performances of his career as the flawed and very misguided cop Dixon. The character of Dixon is short-tempered, volatile, and not bright with some baggage of his own that the locals accuse him of. But Sam Rockwell brings his charm and sincerity to what could be a rather unlikable character. And in the latter half, you see Dixon go through a tremendous arc of learning to care about others rather then just being angry towards them. Other great performances that should be called out are Woody Harrelson, Peter Dinklage, John Hawk and Caleb Landry Jones.Three Billboards outside Ebbing, Missouri is easily one of the best movies this year and is worth seeing once it comes out in wide releases."
    },
    {
      "username": "MongoLloyd",
      "userUrl": "https://www.imdb.com/user/ur11298748",
      "reviewLink": "https://www.imdb.com/review/rw4016170",
      "warningSpoilers": true,
      "date": "28 December 2017",
      "rate": "4",
      "helpful": "376 out of 643 found this helpful.",
      "title": "Is this a masterpiece?",
      "content": "Pretty cool cast, and interesting premise muddied by oddities, implausibilities, and a juvenile sense of story. Is this a film set in a world where crazy stuff happens as a matter of course, or a normal every day world where crazy stuff happens every now and then? In this film, I see pretty normal people doing normal things and having normal things happen to them, so why is it the writer/director chose to litter what could have been a very good film with SO much bizarro bs? And with literally ZERO character development? Three giant billboards THAT close to the road and THAT close together - I've driven all over the country and never saw that. Billboards in rural areas tend to be smaller and definitely not that close together for obvious reasons. WHO is this woman, Mildred? We know literally nothing about her beside the fact that her daughter was murdered. Eventually we find out she's divorced and has a son who lives with her, but if one is to care about the protagonist, character development is crucial. As it is, it's interesting to watch her do and say crazy stuff, but I couldn't care less about her.WHY is it, two male characters directly related to the protagonist have a girlfriend & wife 20+ years their junior? Do they live in a part of the country where such a thing is commonplace? What are the odds of that? Probably about the same as if your dentist won the lottery but then your mailman did also. Yes, possible, but very, very odd and distracting.Why does Willoughby's wife have an English accent? Was he in the military and met her while overseas? Is it common for a small town in Missouri to have British accented residents? If there was ANY character development, maybe we'd know these things. As it is, it's distracting and elicits questions that shouldn't have to be asked. $5000/month for three previously forgotten about, decrepit billboards on a road people don't use anymore? LOL. For someone who is supposed to be a savvy, tough, non-nonsense older lady with the wisdom of the Buddha, that's pretty dumb.A cop smashes office windows, assaults a man and throws him out a 2nd story window with no jail time. Really?! Why does Willoughby have fatal cancer? Seems as no more than a cheap device used to heap more disdain on Mildred. Yawn. Dixon ends up in the same hospital room as the man he assaulted? Is that supposed to be ironic? And again, what are the odds? Mildred firebombs the police station, nearly kills a cop, and then just says \"I didn't do it\" and that's the end of it?! Really? Some creepy stranger visits Mildred in her store and harasses her, THEN is overheard in a bar talking about committing a crime, maybe the crime in question, but alas even after Dixon cleverly retrieves dna from the guy, it turns out he's not even a local, and wasn't around when the crime occurred. Why then does the creepy guy know so much about the crime in question and WHY is he harassing Mildred!?!?!?! WHY?Then to top off ALL that nonsense, Dixon and Mildred decide to go murder the creepy guy anyway, LOL, how profound."
    },
    {
      "username": "damian-fuller",
      "userUrl": "https://www.imdb.com/user/ur38801254",
      "reviewLink": "https://www.imdb.com/review/rw3874512",
      "warningSpoilers": true,
      "date": "4 December 2017",
      "rate": "9",
      "helpful": "343 out of 485 found this helpful.",
      "title": "Fires Of The Heart",
      "content": "Frances McDormand is, without question, one of the very best actresses of hers or any generation. Wow! And like most of the greatest she goes for characters who don't ask for sympathy. The truth is in her eyes, always. So, naturally, I followed her every inch of the way. She is surrounded by a fantastic group of actors. Woody Harrelson is just extraordinary but perhaps the biggest surprise is Sam Rockwell making his one eighty not just believable but very moving. Martin McDonagh's writing is the magic potion that keeps everything together and when I say everything I mean everything. Humor and horror as if it were practically the same thing. The dialogue is brilliant and Frances McDorman deserves the last paragraph. Her face is a wonder. Superb performance. Don't miss it."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw4134719",
      "warningSpoilers": false,
      "date": "19 April 2018",
      "rate": "9",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Inconsolable grief",
      "content": "It's ironic that the first of Frances McDormand's Oscars came for her portrayal of a sheriff in Fargo. For her second one she plays the antagonist to a sheriff she feels isn't doing her job. The sheriff is a most popular individual in the town, Woody Harrelson. But this is a woman with a mission.None of the people in Three Billboards Outside Ebbing Missouri are of any kind of heroic stature. They're just I suspect as ordinary as any of us with our good points and bad. One of them, Deputy Sam Rockwell is one unapologetic racist who uses his badge to harass and assault folks of a different skin tone. He's McDormand's greatest antagonist and in the end the two come to an interesting relationship.McDormand is a mother who just can't accept the loss of her daughter. I'm the son of one who never got over the loss of her daughter. But my sister died of natural causes, McDormand's teen daughter went out one night against parental advice and was raped and murdered.That was months ago and there's no accepting her loss for McDormand. She got her Best Actress Oscar not just for words spoken, but for some incredible body language and facial expressions. Her rage at what she sees is the lack of interest by law enforcement will not be abated.So what she has done is out of whatever money she has scraped up together is pay for three large billboards outside the main thoroughfare of the town of Ebbing, Missouri calling attention to the lack of progress on her daugher's homicide and getting personal with Chief Woody Harrelson. Harrelson in turn has some personal problems of a serious nature which the town knows about and the sympathy that McDormand might have had is turning to resentment toward her.Her grief isn't the only thing that has turned McDormand into the unpleasant creature she is. Her husband John Hawkes who seems to be no great prize himself left her for a 19 year old chippie. Her son Lucas Hedges is also feeling alienated from both parents.There's no such place as Ebbing, Missouri but the uniformly fine ensemble of players sure makes you think you're in mid country America looking in on a place that's a cross between Grover's Corner in Our Town and Winesburg, Ohio in the 21st century. Of course the cast is topped by Oscar winners Frances McDormand for Best Actress and Sam Rockwell for Best Supporting Actor. Woody Harrelson also got an Oscar nomination for Best Supporting Actor and the film was nominated in a bunch of other categories including Best Picture.See this one by all means."
    },
    {
      "username": "Turfseer",
      "userUrl": "https://www.imdb.com/user/ur0225436",
      "reviewLink": "https://www.imdb.com/review/rw3873107",
      "warningSpoilers": true,
      "date": "2 December 2017",
      "rate": "3",
      "helpful": "201 out of 401 found this helpful.",
      "title": "Overrated quirk-fest from playwright turned screenwriter, seeks redemption for vigilantes",
      "content": "Combine the quirky characters of the master of quirk, Wes Anderson, and sensibility of adolescent wish fulfillment fantasy director Quentin Tarantino, and what do you end up with? The year's most overrated \"black comedy,\" Three Billboards Outside Ebbing, Missouri. It's the work of playwright by trade, Martin McDonagh, who's been quoted as saying that he prefers writing for film over theater (why couldn't he stick with the stage if that's his primary area of expertise?).McDonagh's strategy is to appeal to both liberals and conservatives but in the end he remains squarely in the liberal camp. He serves up absurd characters that appeal to the baser elements in our culture but infuses them with \"hearts of gold\" so they appear to straddle both liberal and reactionary fences, but actually exist in none.Take for example his main character, Mildred Hayes (played by a haggard-looking, one-note Frances McDormand) who puts up the three billboards outside of town, frustrated by Sheriff Willoughby (Woody Harrelson) and his small town police department's inability to catch the man who murdered her daughter seven months earlier. The foul-mouthed Hayes functions outside the law and McDonagh throws a bone to reactionaries, asking us to approve of Hayes' desire for revenge and endorsement of vigilantism.McDonagh's other rebel is Officer Jason Dixon (Sam Rockwell), a racist who tries to top Hayes in her quest to be the top-rated anti-social misfit in town. First he arrests Hayes' co- worker pal Denise on trumped up marijuana possession charges and after he learns of Sheriff Willoughby's suicide following the revelation of a cancer diagnosis, he goes after Red (the man responsible for renting the billboards to Hayes) and throws him out a second floor window (instead of arresting him, the new black police chief merely fires him! What's up with that?).Just like Hayes, Dixon finds a scapegoat to assuage his guilt over Sheriff's Willoughby's death. When Hayes finds her billboards ablaze, she naturally pins the blame on Dixon and firebombs police headquarters. It's at this point that McDonagh rather simplistically attempts to redeem his protagonists. The saintly, all- knowing Willoughby, in a letter he leaves for Dixon after his death, reassures the errant former officer that he's not such a bad guy after all, provided that he gives up his bigoted ways.After Dixon survives the firebombing at the police station where he went to read Willoughby's letter, he decides to help Hayes after overhearing a potential suspect who might have killed her daughter. During a fight with the suspect in the bar, he manages to obtain the man's DNA. In an original plot twist, the DNA does not match and the potential murderer is ruled out as a suspect in Hayes' daughter's death.With Hayes apologizing to Dixon for the firebombing of the police station (she escapes being charged aided by an alibi from a dwarf who lives in town), the two vigilantes make their way to Idaho to seek revenge on the now ruled out suspect in Hayes' daughter's death, as they are convinced he's guilty of other crimes of rape, and deserves punishment.McDonagh, however, is uneasy with the idea that Hayes and Dixon would actually go through with their extra-judicial act-so he throws in a caveat. As they're talking to one another in the car, it's probably the unheard voice of the goodly Sheriff Willoughby which is still in the air. Hayes and Dixon express doubts about actually going through with the plan-the implication of course is that they will not engage in another act of violence-that they in fact have \"learned their lesson,\" and now are ready to act as law-abiding citizens.It might be reassuring to a liberal audience that the bad guys suddenly become \"good\"-that there is a measure of redemption for the two who have become unhinged by the deaths of people close to them. In reality, vigilantes remain vigilantes, and such reversals in outlook are highly unlikely. But even if one accepts the improbable Deus ex machina, McDonagh's willingness to excuse all the prior bad conduct, suggests a crack in the screenwriter's moral compass.Ultimately, McDonagh wants his quirk-fest both ways. He revels in the bad acts of vigilantism, appealing to the aforementioned \"baser instincts\"; but offers up redemption for his bad actors, in the form of a martyred lawman, who like a saint from above, offers words of wisdom for the ages."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw6563058",
      "warningSpoilers": false,
      "date": "4 February 2021",
      "rate": "9",
      "helpful": "13 out of 20 found this helpful.",
      "title": "A powerful film that draws many emotions.",
      "content": "Mildred refuses to give up in her fight for justice for her murdered daughter, she puts up three billboards blaming The Police incompetence.This film is genuinely outstanding. I felt multiple emotions watching it, frustration, sadness, anger, repulsion, disbelief, and on the odd occasion a little humour.Officer Dixon, I hate you, a violent, racist, brain dead thug, he comes across as someone who can barely even tie his own shoe laces, let alone undertake any form of detection. Rockwell, is just terrific.Frances McDormand is astonishing as Mildred, it is a truly brilliant showing from her, I've seen her several times, and I am a fan, I had no idea she was this gold.The whole cast are terrific, McDormand and Rockwell are superb.It doesn't show the Police of Missouri in a good light, you're sometimes wondering if this film is set in 1965.Thought provoking throughout, it's a brilliant film, 9/10."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw4028832",
      "warningSpoilers": true,
      "date": "10 January 2018",
      "rate": "7",
      "helpful": "41 out of 76 found this helpful.",
      "title": "Deceptive Ending Without a Conclusion",
      "content": "\"Three Billboards Outside Ebbing, Missouri\" is a great crime movie in an environment of grief, anger, remorse, racism, violence, sympathy and a sophisticated black-humor. The performances are top-notch and it is hard to point out only one or two names in the cast, indeed a constellation of stars. Maybe the performances of Frances McDormand, Woody Harrelson and Sam Rockwell may be highlighted since they are the lead. Unfortunatelly the deceptive ending without a conclusion throws cold water in this film. The redemption of Dixon finding the rapist killer would have given some hope to the story. But the author decided to keep a dark ending without conclusion. Claude Chabrol was a master in mystery films with open end; however his conclusion were subtle and ambiguous, giving the chance to the audience to discuss possibilities based on his or her interpretation of the storyline. But the conclusion of \"Three Billboards Outside Ebbing, Missouri\" is indeed a cliffhanger usually used in TV series or films written for franchise or at least a sequence. My vote is seven.Title (Brazil): \"Três Anúncios Para um Crime\" (\"Three Billboards for a Crime\")"
    },
    {
      "username": "ramfat",
      "userUrl": "https://www.imdb.com/user/ur46220531",
      "reviewLink": "https://www.imdb.com/review/rw4063969",
      "warningSpoilers": true,
      "date": "16 February 2018",
      "rate": "4",
      "helpful": "388 out of 665 found this helpful.",
      "title": "The best way to express your grief is by committing multiple felonies.",
      "content": "First, let's all just accept the premise that police beat up random black people for no reason whatsoever. Also, police are inept, because they can't find someone to arrest for the murder and rape of your daughter, even though there is zero forensic evidence. Next let's take a moment to reflect on the time you told your daughter \"I hope you get raped on the way too\". Now it's time to start lashing out at the world because you are angry. Start by committing 2 felonies against a dentist. It's also a good idea to go into a police station and tell them what horrible people they are. When your signs get set on fire, climb onto one of the burning signs and stand at the top of the flames. Next, fire-bomb a police station, because you are still mad, even though there is still no evidence or suspects. Finally, if you can't find the actual person who committed the crime, instead go murder a complete stranger on a hunch. This is all very profound and heart-wrenching...can't you tell by the music?The police chief isn't so bad though, because he has cancer and is spitting up blood. He thinks it's best to leave the hospital, because what do doctors know about dealing with cancer. He doesn't want his wife and kid's final memories of him to be slowly dying in a hospital, so instead their final memories will be of him blowing his own brains out in the barn. Thankfully, a streetwise black police chief came in to take over for the inept and racist white police officers. Now things will finally get done."
    },
    {
      "username": "areatw",
      "userUrl": "https://www.imdb.com/user/ur66517869",
      "reviewLink": "https://www.imdb.com/review/rw4112606",
      "warningSpoilers": false,
      "date": "1 April 2018",
      "rate": "8",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Unusually deep for a crime drama",
      "content": "Original, deep and thought provoking films like this one are hard to come by these days. 'Three Billboards Outside Ebbing, Missouri' takes a completely different approach to the conventional crime drama. Instead of detailing the story behind the missing girl, the focus is instead of the mother's way of dealing with the disappearance and how she handles her grief and anger towards the authorities.This film is excellent in just about every area. The script is intelligent and surprisingly funny, the storyline engaging and convincing, and the acting is first rate. Frances McDormand is outstanding in the lead and thoroughly deserved her Oscar.'Three Billboards' is a unique and fascinating film, great filmmaking all-round and highly recommended."
    },
    {
      "username": "gradyharp",
      "userUrl": "https://www.imdb.com/user/ur3223254",
      "reviewLink": "https://www.imdb.com/review/rw4079194",
      "warningSpoilers": false,
      "date": "2 March 2018",
      "rate": "10",
      "helpful": "24 out of 42 found this helpful.",
      "title": "'All this anger, man, it just begets greater anger.'",
      "content": "Martin McDonagh (In Bruges, Seven Psychopaths) wrote and directed this very tough but brilliant story about anger, revenge, agony, prejudice - and redemption. Every character in this dramatic tour de force is drawn with equal parts hate and anger - with a dollop of hope and forgiveness and reconciliation in the end. It is a phenomenal achievement. The language is saturated with foul/vulgar/trash type language but it fits the area and the particular character in this darkly comic drama. After months have passed without a culprit in her daughter's murder case, Mildred Hayes (Frances McDormand) makes a bold move, painting three signs leading into her town with a controversial message directed at William Willoughby (Woody Harrelson), the town's revered chief of police. When his second-in-command Officer Dixon (Sam Rockwell), an immature mother's boy with a penchant for violence, gets involved, the battle between Mildred and Ebbing's law enforcement is only exacerbated. Mildred's son (Lucas Hedges) is seemingly the only stable character despite his absentee father (John Hawkes) and 19-year-old girlfriend (Samara Weaving) antics and his mother's foul pained mood. The pinnacle of angry young men is policeman Dixon (Sam Rockwell in a brilliant performance) whose movements include severely harming the sign maker (Caleb Landry Jones) as well as violating all manner of laws. Peter Dinklage portrays James, the 'town midget' whose role is also key to the denouement of the action.Rape, murder, arson and many other forms of violence fill the screen but McDonagh makes it all make sense. McDormand, Rockwell, and Harelson are astonishingly but then there isn't a weak member in this extraordinary cast. This is one of the best films of the year, despite the subject matter at the core of it."
    },
    {
      "username": "cdcrb",
      "userUrl": "https://www.imdb.com/user/ur22910970",
      "reviewLink": "https://www.imdb.com/review/rw3854540",
      "warningSpoilers": true,
      "date": "10 November 2017",
      "rate": "4",
      "helpful": "154 out of 302 found this helpful.",
      "title": "bitterness and hate rolled into one",
      "content": "it's unfortunate to use the word comedy, dark or otherwise, with regard to this film. unpleasant would be a better adjective. if you've seen the trailer you know what the billboards are about. if not, you'll know when you see the movie. revenge and guilt are being served up cold. deep down, apparently, every one has a heart of gold. racists, wife beaters. whatever. I did not buy it. others have."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4095968",
      "warningSpoilers": false,
      "date": "18 March 2018",
      "rate": "6",
      "helpful": "25 out of 46 found this helpful.",
      "title": "so many issues",
      "content": "In the town of Ebbing, Missouri, Mildred Hayes (Frances McDormand) rents three billboards on an isolated road to berate police chief Willoughby (Woody Harrelson) for his failure to find her daughter's killer. Willoughby is actually dying from cancer and the town ostracizes her. Dixon (Sam Rockwell) is a volatile racist deputy living with his overbearing mother.British Irish filmmaker Martin McDonagh tackles Americana. He has incorporated plenty of American issues but it's done as an outsider looking in. I wonder if Rockwell starts his performing with an American director, he wouldn't be told to take it a different way. His action in the middle of the movie is absolutely crazy. The aftermath needs more expanding rather than a simple firing. I can't believe that he's not locked up. Then his character takes a 180 turn as the movie climaxes. He leaves the movie a two dimensional billboard rather than a fully formed human character. I am much more impressed with Mildred, Willoughby, and their connection. McDormand delivers a driven character of the first order and Harrelson is more human in his reservation. There is real power behind their performances whereas Rockwell is doing a cartoon. I am surprised at its critical love. Some of this is funny and there are plenty of intriguing characters. The issues are so important that I can't take this as satire. I have issues."
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw4188880",
      "warningSpoilers": false,
      "date": "3 June 2018",
      "rate": "1",
      "helpful": "39 out of 75 found this helpful.",
      "title": "Ebbing away",
      "content": "I'm not much of a fan of the whole Coen Brothers non-linear method of film making I have to say and identified quite early on that this particular movie fell squarely into whatever category that might be. I guess I should have known from the offbeat title and cast that things would go every which way but loose and so it proves.The initial idea of angry mother Frances McDormand broadcasting her frustration at her local police division by paying for three adjacent billboards to highlight their inaction over the unsolved rape and murder of her daughter some seven months previously might have worked in my view, not least as a whodunit, but was soon swamped by the introduction of several unusual characters and as many unlikely situations.So we're introduced soon enough to Woody Harrelson's terminally ill chief of police who McDormand's character names and shames on the billboards, Sam Rockwell as his mother-fixated, redneck deputy, with many more minor characters too numerous to mention, like the dwarf who alibis MacDormand at an important moment in the story, her abusive ex-husband now dating a 19 year old pretty bimbo and the new black chief of police who takes over Harrelson's job and whose first action is to overlook Rockwell's near-murder of the homosexual young owner of the billboard company with whom it's fair to say, he doesn't see eye to eye.The movie is a succession of tangential plot shifts and unbelievable coincidence. No doubt the writer - director was presenting us with themes of forgiveness, redemption and guilt set in the backward-thinking, crazy-quilt Deep South just to double underline these issues and make the viewer think deeply about all this serious existential stuff y'all.Sorry, but I didn't buy any of it. The acting didn't impress me much either, and that includes McDormand's Oscar-winning turn. In the end, for me, it was just another of those eccentric, eclectic films that tries to implant what it thinks are memorable images or extraordinary characters into the viewer's consciousness and by its exaggeration and distortion somehow mirror society in some profound way. All I got from it in the end was a mixed sense of manipulation, confusion and cynicism and how easy it is to put a movie like this together and call it art.Sorry, not for me and you can broadcast that on any billboard you care to mention."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw4071575",
      "warningSpoilers": false,
      "date": "23 February 2018",
      "rate": "10",
      "helpful": "34 out of 63 found this helpful.",
      "title": "Awesome film. Very entertaining inspite of the matter being serious n dark. The mamma's boy deserves an Oscar.",
      "content": "Saw this in a theatre. Very entertaining film with relevant social issues. The film deserves best film Oscar n Rockwell best supporting actor. The best part about this film is the character development and the awesome ensemble cast and their performances. Frances McDormands performance is solid but Sam Rockwell cannot be ignored n Woody Harrelson is always a treat to watch. Another great aspect is the writing. McDonagh did a terrific job. He tackled the films serious dark material very well n made the film bearable to watch by adding enuff humor, unpredictability, tension n beautiful locations. The editing n cinematography is good too. This film was captivating n mesmerising n not at all slow as compared to most Oscar nominated films. Havnt seen the directors previous films but will definitely check it out as after watchin this film i can b sure of em being good."
    },
    {
      "username": "Coralknight",
      "userUrl": "https://www.imdb.com/user/ur14477953",
      "reviewLink": "https://www.imdb.com/review/rw4075761",
      "warningSpoilers": true,
      "date": "27 February 2018",
      "rate": "2",
      "helpful": "39 out of 67 found this helpful.",
      "title": "A LOT to overlook",
      "content": "OK, let's just forget all the plot-holes here; like the fact that two people sitting in front of a burning police station would not simply be \"free to be on their way\". Or like a police officer throwing another man out a window and being witnessed by the police chief would simply be asked to turn in his badge and gun. Or that a woman who has an apparent blood-lust, capable of fire-bombing a building and watching a man on fire simply crawl out while doing nothing would let another strange man threaten her, break her items, then just let him walk away without reporting it. Yes...let's forget these and the MANY other plot holes in this entire mess...and what are we left with? Just a sad, bitter sermon on how all men are just plain evil if left to their own devices...yet white women must always get a pass in life (just because...don't ask why or you're a misogynist!) What this campy, meandering, cartoonish and pointless film DOES confirm is that most people are idiots, and will \"love!\" any film that confirms their belief or opinions."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4019941",
      "warningSpoilers": false,
      "date": "1 January 2018",
      "rate": "6",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Not bad but lacks focus",
      "content": "In an effort to track down who raped and murdered her daughter, Mildred Hayes has three billboards erected outside her town of Ebbing, Missouri. They accuse the Sheriff of doing nothing to catch the killer. This causes a largely adverse reaction amongst the town's folk , not least one of the sheriff's deputies, the hot-headed, irascible Jason Dixon.Heaps of potential, much of which is wasted. The movie is intriguing and entertaining from the outset - the murder mystery, the town dynamic, the interesting array of characters, all presented with dark tongue-in-cheek humour. Just from the trailer this reminded me of a Coen Brothers movie (not just because it stars Frances McDormand and feels Fargo-esque, or because McDormand is married to Joel Coen) and the initial part of the movies goes some way to reinforce this. However, writer-director Martin McDonagh (In Bruges, Seven Psychopaths) never quite matches the effortless slickness, tightness, engagement, focus and story-telling ability of the Coens. Most tellingly, the plot seems to stumble along, with no clear direction. Yes, there is the murder mystery, which is intriguing to the very end, but the sub-plots around it seem disjointed. Moreover, there is little in the way of clear themes. Even at the end, the messaging is confused and seems to be more a case of McDonagh having a bet each way, rather than making a solid point.A little bit of focus would have gone a long way.Can't fault the cast though. Frances McDormand is excellent as Mildred Hayes, as is Sam Rockwell as Dixon and Woody Harrelson as Sheriff Willoughby. Good supporting cast which includes some biggish names - Peter Dinklage, Abbie Cornish and Kerry Condon."
    }
  ],
  "errorMessage": ""
}