{
  "imDbId": "tt5027774",
  "title": "Three Billboards Outside Ebbing, Missouri",
  "fullTitle": "Three Billboards Outside Ebbing, Missouri (2017)",
  "type": "Movie",
  "year": "2017",
  "language": "en",
  "titleInLanguage": "Three Billboards Outside Ebbing, Missouri",
  "url": "https://en.wikipedia.org/wiki/Three_Billboards_Outside_Ebbing,_Missouri",
  "plotShort": {
    "plainText": "Three Billboards Outside Ebbing, Missouri is a 2017 crime drama film written, directed, and co-produced by Martin McDonagh and starring Frances McDormand as a Missouri woman who rents three roadside billboards to draw attention to her daughter's unsolved rape and murder. Woody Harrelson, Sam Rockwell, John Hawkes, Peter Dinklage, Abbie Cornish, Lucas Hedges, Željko Ivanek, and Caleb Landry Jones appear in supporting roles. The film was theatrically released in the United States in November 2017 and in the United Kingdom in January 2018 by Fox Searchlight Pictures, and it grossed $160 million at the worldwide box office.\r\nCritical reception for the film was highly positive, with particular acclaim given to McDonagh's screenplay and direction, as well as the performances of McDormand, Rockwell, and Harrelson. McDormand and Rockwell each won the Academy Award, Golden Globe Award, SAG Award, BAFTA Award, and Critics' Choice Award for Best Actress and Best Supporting Actor, respectively, and Harrelson received Oscar, SAG, and BAFTA nominations. McDonagh won the Golden Globe Award and BAFTA Award for his screenplay, and the film won the Golden Globe Award and BAFTA Award for Best Picture.",
    "html": "<p>Three Billboards Outside Ebbing, Missouri is a 2017 crime drama film written, directed, and co-produced by Martin McDonagh and starring Frances McDormand as a Missouri woman who rents three roadside billboards to draw attention to her daughter's unsolved rape and murder. Woody Harrelson, Sam Rockwell, John Hawkes, Peter Dinklage, Abbie Cornish, Lucas Hedges, Željko Ivanek, and Caleb Landry Jones appear in supporting roles. The film was theatrically released in the United States in November 2017 and in the United Kingdom in January 2018 by Fox Searchlight Pictures, and it grossed $160 million at the worldwide box office.</p><p>Critical reception for the film was highly positive, with particular acclaim given to McDonagh's screenplay and direction, as well as the performances of McDormand, Rockwell, and Harrelson. McDormand and Rockwell each won the Academy Award, Golden Globe Award, SAG Award, BAFTA Award, and Critics' Choice Award for Best Actress and Best Supporting Actor, respectively, and Harrelson received Oscar, SAG, and BAFTA nominations. McDonagh won the Golden Globe Award and BAFTA Award for his screenplay, and the film won the Golden Globe Award and BAFTA Award for Best Picture.</p>"
  },
  "plotFull": {
    "plainText": "Three Billboards Outside Ebbing, Missouri is a 2017 crime drama film written, directed, and co-produced by Martin McDonagh and starring Frances McDormand as a Missouri woman who rents three roadside billboards to draw attention to her daughter's unsolved rape and murder. Woody Harrelson, Sam Rockwell, John Hawkes, Peter Dinklage, Abbie Cornish, Lucas Hedges, Željko Ivanek, and Caleb Landry Jones appear in supporting roles. The film was theatrically released in the United States in November 2017 and in the United Kingdom in January 2018 by Fox Searchlight Pictures, and it grossed $160 million at the worldwide box office.\r\nCritical reception for the film was highly positive, with particular acclaim given to McDonagh's screenplay and direction, as well as the performances of McDormand, Rockwell, and Harrelson. McDormand and Rockwell each won the Academy Award, Golden Globe Award, SAG Award, BAFTA Award, and Critics' Choice Award for Best Actress and Best Supporting Actor, respectively, and Harrelson received Oscar, SAG, and BAFTA nominations. McDonagh won the Golden Globe Award and BAFTA Award for his screenplay, and the film won the Golden Globe Award and BAFTA Award for Best Picture.\r\nPlot\r\nIn the fictional town of Ebbing, Missouri, Mildred Hayes is grieving over the rape and murder of her teenage daughter, Angela, seven months earlier. Angry over the lack of progress in the investigation, she rents three disused billboards near her home and posts on them: \"Raped While Dying\", \"And Still No Arrests?\", \"How Come, Chief Willoughby?\". They attract attention, so Bill Willoughby, the local chief of police, visits Mildred, but is unable to persuade her to take them down, even by revealing he has terminal pancreatic cancer. He renews his efforts to solve the case, but does not get anywhere.\r\nMany townspeople are upset by the billboards, including Jason Dixon, a racist, alcoholic police officer, who unsuccessfully tries to intimidate Red Welby, who rented Mildred the billboards, into taking them down. Mildred's dentist is sympathetic to Willoughby and menaces her during an appointment, so she drills a hole in his thumbnail. Willoughby brings her in for questioning and accidentally coughs up blood into her face. He has her released and is hospitalized, though he soon checks himself out against medical advice.\r\nThe billboards have further strained Mildred's relationship with her son, Robbie, and she recalls that her last interaction with Angela was an argument. Her abusive ex-cop ex-husband Charlie confronts her about the billboards and ends up revealing that, shortly before Angela's murder, he had turned down her request to come live with him.\r\nAt his mother's suggestion, Dixon arrests Mildred's friend Denise on trivial drug possession charges to put pressure on Mildred. Willoughby spends an idyllic day with his wife, Anne, and their two daughters, and then takes his own life to spare his family from watching him die slowly. Dixon reacts to the news by assaulting Welby and throwing him out a second-story window. This is witnessed by Abercrombie, Willoughby's replacement, who fires Dixon.\r\nBefore his death, Willoughby wrote several letters, including one to Mildred. Anne delivers it, interrupting an unknown man who was menacing Mildred at work. In the letter, Willoughby tells Mildred that she was not a factor in his suicide and that he secretly paid to keep the billboards up another month.\r\nAfter the billboards are destroyed by arson, Mildred retaliates by tossing Molotov cocktails at the police station, which she believes to be unoccupied for the night. However, Dixon is inside reading Willoughby's letter to him, which advises him to let go of hate and embrace love if he wants to be a detective someday; he manages to escape the blaze with Angela's case file. James, an acquaintance of Mildred, happens by and extinguishes Dixon's burning clothes before providing Mildred with an alibi. Dixon is put in the same hospital room as Welby, to whom he apologizes.\r\nJerome, who was part of the team that put up the billboards, brings Mildred a set of copies and helps her restore the signs. Discharged from the hospital, Dixon overhears the man who menaced Mildred bragging in a bar about raping a girl in the same manner as Angela. He notes the number on the man's Idaho license plate and then scratches the man's face to get a DNA sample, passively accepting the resulting beating.\r\nMildred is on a date with James to thank him for his help, when Charlie enters with his 19-year-old girlfriend Penelope and apologizes for burning the billboards when he was drunk. Unnerved that she retaliated against the wrong target, Mildred abruptly calls off the date, but James misinterprets her decision as embarrassment to be seen with him and leaves the restaurant in disgust.\r\nAbercrombie informs Dixon that the DNA sample is not a match and the man was overseas on military duty at the time of Angela's death. Dixon gives Mildred the disappointing news and, believing the man to be guilty of some other rape, the pair plan a trip to Idaho to kill him. As they set out, Mildred confesses that she set the police station on fire, which Dixon had already assumed. They both express uncertainty about their mission, but Mildred says they can decide what to do along the way.\r\nCast\r\nFrances McDormand as Mildred Hayes\r\nWoody Harrelson as Bill Willoughby, Ebbing's police chief\r\nSam Rockwell as Jason Dixon, a police officer in Ebbing\r\nJohn Hawkes as Charlie Hayes, Mildred's abusive ex-husband\r\nPeter Dinklage as James, an Ebbing resident who has a crush on Mildred\r\nAbbie Cornish as Anne Willoughby, Bill's wife\r\nLucas Hedges as Robbie Hayes, Mildred and Charlie's teenage son\r\nŽeljko Ivanek as Cedric Connolly, Ebbing Police's desk sergeant\r\nCaleb Landry Jones as Red Welby, who handles sales at Ebbing Advertising Company\r\nClarke Peters as Abercrombie, Chief Willoughby's replacement\r\nSamara Weaving as Penelope, Charlie's much-younger girlfriend\r\nKerry Condon as Pamela, the office manager at Ebbing Advertising Company\r\nDarrell Britt-Gibson as Jerome, who puts up billboards for Ebbing Advertising Company\r\nKathryn Newton as Angela Hayes, Mildred and Charlie's deceased teenage daughter, who is seen in a flashback\r\nBrendan Sexton III as Crop-Haired Guy, an Idaho resident who harasses Mildred and attacks Dixon\r\nSandy Martin as Momma Dixon, Jason Dixon's mother\r\nProduction\r\nDevelopment\r\nWhile traveling through the Southern United States c. 1998, Martin McDonagh came across a couple of accusatory billboards that alleged a woman named Kathy Page had been murdered by her husband Steve Page in Vidor, Texas, and highlighted the incompetence of the police in solving the case. McDonagh described the billboards, which he presumed had been put up by the victim's mother, as \"raging and painful and tragic\" and was deeply affected by them, saying the image \"stayed in my mind kept gnawing at me\". This incident, combined with his desire to create strong female characters, inspired McDonagh to write the story for Three Billboards Outside Ebbing, Missouri. He said it took him about ten years to decide \"it was a mother who had taken these things out. It all became fiction based on a couple of actual billboards\".\r\nCasting\r\nThe character of Mildred was written with Frances McDormand in mind, and the character of Dixon was written specially for Sam Rockwell. McDormand initially felt she was older than the character as it was written and suggested Mildred be Angela's grandmother, rather than her mother, but McDonagh disagreed, feeling it would change the story too much, and eventually McDormand's husband Joel Coen persuaded her to take the part regardless.\r\nJohn Wayne served as an inspiration for McDormand in her portrayal of Mildred, and Rockwell, wanting to make his character \"the exact opposite\" of Mildred, took inspiration from Lee Marvin, Wayne's co-star in The Man Who Shot Liberty Valance.\r\nFilming\r\nPrincipal photography began on May 2, 2016, in Sylva, North Carolina, and ran for 33 days. Allison Outdoor Advertising of Sylva built the billboards, which were put in a pasture near Black Mountain, North Carolina, 60 miles east of Sylva. When not filming, the billboards were usually covered because people in the area found them upsetting. David Penix of Arden, North Carolina, subsequently bought the billboards and used the wood for a roof in Douglas Lake, Tennessee, though the messages are no longer legible.\r\nTown Pump Tavern in Black Mountain, which had been featured in The World Made Straight (2015), was closed for three days while filming took place inside. A pool table and booths were added, but the bar's actual sign appears in the film.\r\nMusic\r\nCarter Burwell's score for the film was nominated for Best Original Score at the 90th Academy Awards. It was Burwell's third collaboration with McDonagh, as he had served as composer for McDonagh's first two feature films, In Bruges (2008) and Seven Psychopaths (2012). The film also features songs by ABBA, Joan Baez, The Felice Brothers, the Four Tops, Monsters of Folk, and Townes Van Zandt.\r\nTrack listing\r\nAll tracks composed by Carter Burwell, unless otherwise noted.\r\nRelease\r\nThree Billboards premiered in competition at the 74th Venice International Film Festival on September 4, 2017. It was also screened at the Toronto International Film Festival, the San Sebastián International Film Festival, the BFI London Film Festival, the Zurich Film Festival, and the Mar del Plata International Film Festival, among many others.\r\nIn the United States, the film received a limited release by Fox Searchlight Pictures on November 10, 2017, in advance of its wide release on December 1. On February 27, 2018, it was released on 4K Ultra HD, Blu-ray, and DVD, with Six Shooter, McDonagh's 2004 Academy Award-winning short film, included as a bonus.\r\nBox office\r\nThe film grossed $54.5 million in the United States and Canada, and $105.7 million in other countries, for a worldwide box office total of $160.2 million.\r\nIn its limited opening weekend, the film made $322,168 from four theaters, for a per-theater average of $80,542, the fourth-best of 2017. It made $1.1 million from 53 theaters its second weekend and $4.4 million from 614 its third, finishing 9th and 10th at the box office, respectively.\r\nThe weekend following its four Golden Globe wins on January 7, 2018, the film was added to 712 theaters (for a total of 1,022) and grossed $2.3 million, an increase of 226% from the previous weekend's $706,188. Two weeks later, following the announcement of the film's seven Oscar nominations, it made $3.6 million, an increase of 87% over the previous week's $1.9 million, finishing 13th at the American box office. The weekend of March 9–11, following its two Oscar wins on March 4, the film made $705,000, down 45% from the previous weekend's $1.3 million.\r\nReception\r\nOn the review aggregator website Rotten Tomatoes, 90% of 414 critics' reviews are positive, with an average rating of 8.4/10. The website's consensus reads: \"Three Billboards Outside Ebbing, Missouri deftly balances black comedy against searing drama – and draws unforgettable performances from its veteran cast along the way.\" Metacritic, which uses a weighted average, assigned the film a score of 88 out of 100, based on 50 critics, indicating \"universal acclaim\".\r\nOwen Gleiberman of Variety praised the film's performances, stating that \"It's Mildred's glowering refusal to back down that defines her, and McDormand brilliantly spotlights the conflicted humanity beneath the stony façade\", and calling Rockwell's performance a \"revelation.\" Steve Pond, writing for TheWrap, praised McDonagh's writing, calling it \"very funny, very violent and surprisingly moving.\"\r\nLess flatteringly, The New York Times columnist Wesley Morris likened McDonagh's portrayal of rural America to \"a set of postcards from a Martian lured to America by a cable news ticker and by rumors of how easily flattered and provoked we are.\" Manohla Dargis, also writing for The New York Times, said in her review: \" jokes can be uninterestingly glib with tiny, bloodless pricks that are less about challenging the audience than about obscuring the material's clichés and overriding theatricality.\" In The New Yorker, Tim Parks praised the film's \"magnificently photographed images\", but wrote that the plot contained \"a thousand cheap coincidences\", and concluded that the film is \"empty of emotional intelligence\" and \"devoid of any remotely honest observation of the society it purports to serve.\"\r\nThe film was controversial for its handling of racial themes, particularly surrounding the redemptive arc of Officer Dixon, whose alleged torturing of an African American prisoner before the events of the film is referred to several times. In The Daily Beast, blogger Ira Madison III described the treatment of Rockwell's character as \"altogether offensive McDonagh's attempts to script the black experience in America are often fumbling and backward and full of outdated tropes.\" Alyssa Rosenberg noted in The Washington Post that \" redemption doesn't merely defang his previous venomous bigotry; it softens Mildred's character development.\"\r\nFocussing on the film's treatment of sexual violence, Oliver Kenny pointed out that the film is unusual for not foregrounding images of the rape victim, and welcomed the shift from a focus on the rape itself to how the community handles rape, however poorly or mishandled their approach may be. In this case, the flawed and problematic nature of all the characters (who are each bigoted, racist, judgemental, selfish, and thoughtless in their own ways) is actually one of the film's strong points: \"We must therefore think about Three Billboards in the context of rape imagery. Not just as a film that considers discourses around rape but one that does so without depicting the rape itself, without pursuing eye-for-an-eye revenge narratives as a crowd-pleasing solution and without pandering to a black-and-white narrative of evil-doing perpetrators, angelic victims and innocent bystanders. It is a film that entwines everyone in its narrative: the local residents, the police, the news reporters as well as us, the spectator, as we are swung back and forth between the competing ethical interests of all the characters, each of whom is worthy and flawed, invoking empathy and open to negative judgment.\"\r\nAccolades\r\nAt the 75th Golden Globe Awards, Three Billboards won Best Motion Picture – Drama, Best Actress – Drama (McDormand), Best Supporting Actor (Rockwell), and Best Screenplay, and it was also nominated for Best Director and Best Original Score. The film was nominated in nine categories at the 71st British Academy Film Awards and won five awards: both Best Film and Outstanding British Film (making it and The King's Speech (2010) the only films to win both awards since the latter category was reintroduced in 1992), Best Leading Actress (McDormand), Best Supporting Actor (Rockwell), and Best Screenplay (Original). At the 24th Screen Actors Guild Awards, the film was nominated for four awards and won three, including Outstanding Performance by a Cast in a Motion Picture. It was nominated for six awards at the 23rd Critics' Choice Awards and won three, including Best Acting Ensemble. At the 90th Academy Awards, the film received seven nominations, including for Best Picture, Best Actress (McDormand), Best Supporting Actor (both Rockwell and Harrelson), and Best Original Screenplay, and McDormand and Rockwell took home their respective awards.\r\nThe film was named one of the top 10 films of the year by the American Film Institute. It won the top prize, the People's Choice Award, at the 2017 Toronto International Film Festival, and won the Audience Award at the 2017 San Sebastián International Film Festival.\r\nImpact\r\nSigns inspired by the billboards in the film have been used in protests by numerous groups around the world. Both McDonagh and McDormand have responded positively to this, with McDonagh saying that \"You couldn't ask for anything more than for an angry film to be adopted by protests,\" and McDormand saying she is \"thrilled that activists all over the world have been inspired by the set decoration of the three billboards in Martin's film.\"\r\nOn February 3, 2018, a mural was erected outside Bristol city centre in England depicting three billboards like those in the film, which read: \"Our NHS is dying\", \"And still no more funding\", \"How come, Mrs May\". It was installed by the groups People's Republic of Stokes Croft and Protect Our NHS in response to the alleged privatization of the National Health Service (NHS) and the death of a 15-year-old girl that the coroner attributed to neglect caused by a lack of NHS resources and care.\r\nOn February 15, 2018, Justice4Grenfell, an advocacy group created in response to the Grenfell Tower fire, hired three vans with electronic screens to protest perceived inaction in response to the fire the previous June. The vans were driven around London and displayed messages in the style of the billboards in the film: \"71 Dead\", \"And Still No Arrests?\", \"How Come?\".\r\nOn the night of February 15, 2018, the movement #OccupyJustice set up three billboards and a number of banners in Malta to mark the four-month anniversary of the murder of journalist Daphne Caruana Galizia. The billboards bore the text: \"A Journalist Killed. No Justice.\", \"A Country Robbed. No Justice.\", \"No Resignations. No Justice.\". The authorities removed the billboards the following day, stating that they were illegal. The government was criticized for this move, and a day after their removal, activists laid down banners with similar text near Auberge de Castille, the office of the Prime Minister.\r\nIn response to the Stoneman Douglas High School shooting that took place on February 14, 2018, in Parkland, Florida, activist group Avaaz had three vans circle Florida senator Marco Rubio's offices displaying: \"Slaughtered in School\", \"And Still No Gun Control?\", \"How Come, Marco Rubio?\".\r\nOn February 22, 2018, the Union of Medical Care and Relief Organizations, protesting the inaction of the UN in response to the Syrian Civil War, set up three billboards outside the United Nations building in New York that read: \"500,000 Dead in Syria\", \"And still no action?\", \"How come, Security Council\".\r\nShortly before the 90th Academy Awards ceremony (on or around March 1, 2018), conservative street artist Sabo set up three billboards in Los Angeles, stating: \"We all knew and still no arrests\", \"And the Oscar for Biggest Pedophile goes to...\", \"Name names on stage or shut the hell up!\"\r\nOn International Women's Day 2018 (March 8), three billboards were put in downtown Pristina, Kosovo, to protest the death of two women as a result of domestic violence.\r\nOn March 24, 2018, signs inspired by Three Billboards appeared at March for Our Lives gun safety rallies across the U.S. and around the world.\r\nIn January 2019, Chinese artist Wu Qiong and a gay policeman launched a public protest campaign in which bright-red trucks bearing slogans denouncing homosexual \"conversion therapy\" were paraded through several major cities in China, including Shanghai, Beijing, and Nanjing.\r\nWang Qishan, China's vice-president, said he understood supporters of U.S. president Donald Trump, in part, through watching the film.",
    "html": "<p>Three Billboards Outside Ebbing, Missouri is a 2017 crime drama film written, directed, and co-produced by Martin McDonagh and starring Frances McDormand as a Missouri woman who rents three roadside billboards to draw attention to her daughter's unsolved rape and murder. Woody Harrelson, Sam Rockwell, John Hawkes, Peter Dinklage, Abbie Cornish, Lucas Hedges, Željko Ivanek, and Caleb Landry Jones appear in supporting roles. The film was theatrically released in the United States in November 2017 and in the United Kingdom in January 2018 by Fox Searchlight Pictures, and it grossed $160 million at the worldwide box office.</p><p>Critical reception for the film was highly positive, with particular acclaim given to McDonagh's screenplay and direction, as well as the performances of McDormand, Rockwell, and Harrelson. McDormand and Rockwell each won the Academy Award, Golden Globe Award, SAG Award, BAFTA Award, and Critics' Choice Award for Best Actress and Best Supporting Actor, respectively, and Harrelson received Oscar, SAG, and BAFTA nominations. McDonagh won the Golden Globe Award and BAFTA Award for his screenplay, and the film won the Golden Globe Award and BAFTA Award for Best Picture.</p><br/><h3>Plot</h3><p>In the fictional town of Ebbing, Missouri, Mildred Hayes is grieving over the rape and murder of her teenage daughter, Angela, seven months earlier. Angry over the lack of progress in the investigation, she rents three disused billboards near her home and posts on them: \"Raped While Dying\", \"And Still No Arrests?\", \"How Come, Chief Willoughby?\". They attract attention, so Bill Willoughby, the local chief of police, visits Mildred, but is unable to persuade her to take them down, even by revealing he has terminal pancreatic cancer. He renews his efforts to solve the case, but does not get anywhere.</p><p>Many townspeople are upset by the billboards, including Jason Dixon, a racist, alcoholic police officer, who unsuccessfully tries to intimidate Red Welby, who rented Mildred the billboards, into taking them down. Mildred's dentist is sympathetic to Willoughby and menaces her during an appointment, so she drills a hole in his thumbnail. Willoughby brings her in for questioning and accidentally coughs up blood into her face. He has her released and is hospitalized, though he soon checks himself out against medical advice.</p><p>The billboards have further strained Mildred's relationship with her son, Robbie, and she recalls that her last interaction with Angela was an argument. Her abusive ex-cop ex-husband Charlie confronts her about the billboards and ends up revealing that, shortly before Angela's murder, he had turned down her request to come live with him.</p><p>At his mother's suggestion, Dixon arrests Mildred's friend Denise on trivial drug possession charges to put pressure on Mildred. Willoughby spends an idyllic day with his wife, Anne, and their two daughters, and then takes his own life to spare his family from watching him die slowly. Dixon reacts to the news by assaulting Welby and throwing him out a second-story window. This is witnessed by Abercrombie, Willoughby's replacement, who fires Dixon.</p><p>Before his death, Willoughby wrote several letters, including one to Mildred. Anne delivers it, interrupting an unknown man who was menacing Mildred at work. In the letter, Willoughby tells Mildred that she was not a factor in his suicide and that he secretly paid to keep the billboards up another month.</p><p>After the billboards are destroyed by arson, Mildred retaliates by tossing Molotov cocktails at the police station, which she believes to be unoccupied for the night. However, Dixon is inside reading Willoughby's letter to him, which advises him to let go of hate and embrace love if he wants to be a detective someday; he manages to escape the blaze with Angela's case file. James, an acquaintance of Mildred, happens by and extinguishes Dixon's burning clothes before providing Mildred with an alibi. Dixon is put in the same hospital room as Welby, to whom he apologizes.</p><p>Jerome, who was part of the team that put up the billboards, brings Mildred a set of copies and helps her restore the signs. Discharged from the hospital, Dixon overhears the man who menaced Mildred bragging in a bar about raping a girl in the same manner as Angela. He notes the number on the man's Idaho license plate and then scratches the man's face to get a DNA sample, passively accepting the resulting beating.</p><p>Mildred is on a date with James to thank him for his help, when Charlie enters with his 19-year-old girlfriend Penelope and apologizes for burning the billboards when he was drunk. Unnerved that she retaliated against the wrong target, Mildred abruptly calls off the date, but James misinterprets her decision as embarrassment to be seen with him and leaves the restaurant in disgust.</p><p>Abercrombie informs Dixon that the DNA sample is not a match and the man was overseas on military duty at the time of Angela's death. Dixon gives Mildred the disappointing news and, believing the man to be guilty of some other rape, the pair plan a trip to Idaho to kill him. As they set out, Mildred confesses that she set the police station on fire, which Dixon had already assumed. They both express uncertainty about their mission, but Mildred says they can decide what to do along the way.</p><br/><h3>Cast</h3><ul><li>Frances McDormand as Mildred Hayes</li><li>Woody Harrelson as Bill Willoughby, Ebbing's police chief</li><li>Sam Rockwell as Jason Dixon, a police officer in Ebbing</li><li>John Hawkes as Charlie Hayes, Mildred's abusive ex-husband</li><li>Peter Dinklage as James, an Ebbing resident who has a crush on Mildred</li><li>Abbie Cornish as Anne Willoughby, Bill's wife</li><li>Lucas Hedges as Robbie Hayes, Mildred and Charlie's teenage son</li><li>Željko Ivanek as Cedric Connolly, Ebbing Police's desk sergeant</li><li>Caleb Landry Jones as Red Welby, who handles sales at Ebbing Advertising Company</li><li>Clarke Peters as Abercrombie, Chief Willoughby's replacement</li><li>Samara Weaving as Penelope, Charlie's much-younger girlfriend</li><li>Kerry Condon as Pamela, the office manager at Ebbing Advertising Company</li><li>Darrell Britt-Gibson as Jerome, who puts up billboards for Ebbing Advertising Company</li><li>Kathryn Newton as Angela Hayes, Mildred and Charlie's deceased teenage daughter, who is seen in a flashback</li><li>Brendan Sexton III as Crop-Haired Guy, an Idaho resident who harasses Mildred and attacks Dixon</li><li>Sandy Martin as Momma Dixon, Jason Dixon's mother</li></ul><br/><h3>Production</h3><h4>Development</h4><p>While traveling through the Southern United States c. 1998, Martin McDonagh came across a couple of accusatory billboards that alleged a woman named Kathy Page had been murdered by her husband Steve Page in Vidor, Texas, and highlighted the incompetence of the police in solving the case. McDonagh described the billboards, which he presumed had been put up by the victim's mother, as \"raging and painful and tragic\" and was deeply affected by them, saying the image \"stayed in my mind kept gnawing at me\". This incident, combined with his desire to create strong female characters, inspired McDonagh to write the story for Three Billboards Outside Ebbing, Missouri. He said it took him about ten years to decide \"it was a mother who had taken these things out. It all became fiction based on a couple of actual billboards\".</p><h4>Casting</h4><p>The character of Mildred was written with Frances McDormand in mind, and the character of Dixon was written specially for Sam Rockwell. McDormand initially felt she was older than the character as it was written and suggested Mildred be Angela's grandmother, rather than her mother, but McDonagh disagreed, feeling it would change the story too much, and eventually McDormand's husband Joel Coen persuaded her to take the part regardless.</p><p>John Wayne served as an inspiration for McDormand in her portrayal of Mildred, and Rockwell, wanting to make his character \"the exact opposite\" of Mildred, took inspiration from Lee Marvin, Wayne's co-star in The Man Who Shot Liberty Valance.</p><h4>Filming</h4><p>Principal photography began on May 2, 2016, in Sylva, North Carolina, and ran for 33 days. Allison Outdoor Advertising of Sylva built the billboards, which were put in a pasture near Black Mountain, North Carolina, 60 miles east of Sylva. When not filming, the billboards were usually covered because people in the area found them upsetting. David Penix of Arden, North Carolina, subsequently bought the billboards and used the wood for a roof in Douglas Lake, Tennessee, though the messages are no longer legible.</p><p>Town Pump Tavern in Black Mountain, which had been featured in The World Made Straight (2015), was closed for three days while filming took place inside. A pool table and booths were added, but the bar's actual sign appears in the film.</p><br/><h3>Music</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Three Billboards Outside Ebbing, Missouri</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">Various artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">November 10, 2017</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Folk</span>, <span>Americana</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">44</span>:<span class=\"s\">06</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Varèse Sarabande</span></td></tr></tbody></table><p>Carter Burwell's score for the film was nominated for Best Original Score at the 90th Academy Awards. It was Burwell's third collaboration with McDonagh, as he had served as composer for McDonagh's first two feature films, In Bruges (2008) and Seven Psychopaths (2012). The film also features songs by ABBA, Joan Baez, The Felice Brothers, the Four Tops, Monsters of Folk, and Townes Van Zandt.</p><h4>Track listing</h4><p>All tracks composed by Carter Burwell, unless otherwise noted.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Writer(s)</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Mildred Goes to War\"</td><td> </td><td class=\"tracklist-length\">1:22</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"The Deer\"</td><td> </td><td class=\"tracklist-length\">2:06</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Buckskin Stallion Blues\" (performed by <span>Townes Van Zandt</span>)</td><td><span>Townes Van Zandt</span></td><td class=\"tracklist-length\">2:59</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"A Cough of Blood, A Dark Drive\"</td><td> </td><td class=\"tracklist-length\">2:37</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"I've Been Arrested\"</td><td> </td><td class=\"tracklist-length\">0:38</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Fruit Loops\"</td><td> </td><td class=\"tracklist-length\">1:29</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"His Master's Voice\" (performed by <span>Monsters of Folk</span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li><span>Jim James</span></li><li><span>Conor Oberst</span></li><li><span>M. Ward</span></li><li><span>Mike Mogis</span></li></ul></div></td><td class=\"tracklist-length\">4:49</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Billboards On Fire\"</td><td> </td><td class=\"tracklist-length\">2:24</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Slippers\"</td><td> </td><td class=\"tracklist-length\">1:19</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"<span>The Last Rose of Summer</span>\" (performed by <span class=\"mw-redirect\">Renee Fleming</span> and <span>Jeffrey Tate</span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Words: <span>Thomas Moore</span></li><li>Music: <span>Friedrich von Flotow</span></li></ul></div></td><td class=\"tracklist-length\">4:51</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"My Dear Anne\"</td><td> </td><td class=\"tracklist-length\">2:35</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"<span>Walk Away Renée</span>\" (performed by <span class=\"mw-redirect\">The Four Tops</span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li><span>Michael Brown</span></li><li>Bob Calilli</li><li>Tony Sansone</li></ul></div></td><td class=\"tracklist-length\">2:44</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Billboards Are Back\"</td><td> </td><td class=\"tracklist-length\">1:24</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Collecting Samples\"</td><td> </td><td class=\"tracklist-length\">1:15</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Sorry Welby\"</td><td> </td><td class=\"tracklist-length\">1:43</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"<span>The Night They Drove Old Dixie Down</span>\" (performed by <span>Joan Baez</span>)</td><td><span>Robbie Robertson</span></td><td class=\"tracklist-length\">3:23</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Countermove\"</td><td> </td><td class=\"tracklist-length\">1:56</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Can't Give Up Hope\"</td><td> </td><td class=\"tracklist-length\">0:30</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Buckskin Stallion Blues\" (performed by Amy Annelle)</td><td>Townes Van Zandt</td><td class=\"tracklist-length\">3:21</td></tr></tbody></table><br/><h3>Release</h3><p>Three Billboards premiered in competition at the 74th Venice International Film Festival on September 4, 2017. It was also screened at the Toronto International Film Festival, the San Sebastián International Film Festival, the BFI London Film Festival, the Zurich Film Festival, and the Mar del Plata International Film Festival, among many others.</p><p>In the United States, the film received a limited release by Fox Searchlight Pictures on November 10, 2017, in advance of its wide release on December 1. On February 27, 2018, it was released on 4K Ultra HD, Blu-ray, and DVD, with Six Shooter, McDonagh's 2004 Academy Award-winning short film, included as a bonus.</p><h4>Box office</h4><p>The film grossed $54.5 million in the United States and Canada, and $105.7 million in other countries, for a worldwide box office total of $160.2 million.</p><p>In its limited opening weekend, the film made $322,168 from four theaters, for a per-theater average of $80,542, the fourth-best of 2017. It made $1.1 million from 53 theaters its second weekend and $4.4 million from 614 its third, finishing 9th and 10th at the box office, respectively.</p><p>The weekend following its four Golden Globe wins on January 7, 2018, the film was added to 712 theaters (for a total of 1,022) and grossed $2.3 million, an increase of 226% from the previous weekend's $706,188. Two weeks later, following the announcement of the film's seven Oscar nominations, it made $3.6 million, an increase of 87% over the previous week's $1.9 million, finishing 13th at the American box office. The weekend of March 9–11, following its two Oscar wins on March 4, the film made $705,000, down 45% from the previous weekend's $1.3 million.</p><br/><h3>Reception</h3><p>On the review aggregator website Rotten Tomatoes, 90% of 414 critics' reviews are positive, with an average rating of 8.4/10. The website's consensus reads: \"Three Billboards Outside Ebbing, Missouri deftly balances black comedy against searing drama – and draws unforgettable performances from its veteran cast along the way.\" Metacritic, which uses a weighted average, assigned the film a score of 88 out of 100, based on 50 critics, indicating \"universal acclaim\".</p><p>Owen Gleiberman of Variety praised the film's performances, stating that \"It's Mildred's glowering refusal to back down that defines her, and McDormand brilliantly spotlights the conflicted humanity beneath the stony façade\", and calling Rockwell's performance a \"revelation.\" Steve Pond, writing for TheWrap, praised McDonagh's writing, calling it \"very funny, very violent and surprisingly moving.\"</p><p>Less flatteringly, The New York Times columnist Wesley Morris likened McDonagh's portrayal of rural America to \"a set of postcards from a Martian lured to America by a cable news ticker and by rumors of how easily flattered and provoked we are.\" Manohla Dargis, also writing for The New York Times, said in her review: \" jokes can be uninterestingly glib with tiny, bloodless pricks that are less about challenging the audience than about obscuring the material's clichés and overriding theatricality.\" In The New Yorker, Tim Parks praised the film's \"magnificently photographed images\", but wrote that the plot contained \"a thousand cheap coincidences\", and concluded that the film is \"empty of emotional intelligence\" and \"devoid of any remotely honest observation of the society it purports to serve.\"</p><p>The film was controversial for its handling of racial themes, particularly surrounding the redemptive arc of Officer Dixon, whose alleged torturing of an African American prisoner before the events of the film is referred to several times. In The Daily Beast, blogger Ira Madison III described the treatment of Rockwell's character as \"altogether offensive McDonagh's attempts to script the black experience in America are often fumbling and backward and full of outdated tropes.\" Alyssa Rosenberg noted in The Washington Post that \" redemption doesn't merely defang his previous venomous bigotry; it softens Mildred's character development.\"</p><p>Focussing on the film's treatment of sexual violence, Oliver Kenny pointed out that the film is unusual for not foregrounding images of the rape victim, and welcomed the shift from a focus on the rape itself to how the community handles rape, however poorly or mishandled their approach may be. In this case, the flawed and problematic nature of all the characters (who are each bigoted, racist, judgemental, selfish, and thoughtless in their own ways) is actually one of the film's strong points: \"We must therefore think about Three Billboards in the context of rape imagery. Not just as a film that considers discourses around rape but one that does so without depicting the rape itself, without pursuing eye-for-an-eye revenge narratives as a crowd-pleasing solution and without pandering to a black-and-white narrative of evil-doing perpetrators, angelic victims and innocent bystanders. It is a film that entwines everyone in its narrative: the local residents, the police, the news reporters as well as us, the spectator, as we are swung back and forth between the competing ethical interests of all the characters, each of whom is worthy and flawed, invoking empathy and open to negative judgment.\"</p><h4>Accolades</h4><p>At the 75th Golden Globe Awards, Three Billboards won Best Motion Picture – Drama, Best Actress – Drama (McDormand), Best Supporting Actor (Rockwell), and Best Screenplay, and it was also nominated for Best Director and Best Original Score. The film was nominated in nine categories at the 71st British Academy Film Awards and won five awards: both Best Film and Outstanding British Film (making it and The King's Speech (2010) the only films to win both awards since the latter category was reintroduced in 1992), Best Leading Actress (McDormand), Best Supporting Actor (Rockwell), and Best Screenplay (Original). At the 24th Screen Actors Guild Awards, the film was nominated for four awards and won three, including Outstanding Performance by a Cast in a Motion Picture. It was nominated for six awards at the 23rd Critics' Choice Awards and won three, including Best Acting Ensemble. At the 90th Academy Awards, the film received seven nominations, including for Best Picture, Best Actress (McDormand), Best Supporting Actor (both Rockwell and Harrelson), and Best Original Screenplay, and McDormand and Rockwell took home their respective awards.</p><p>The film was named one of the top 10 films of the year by the American Film Institute. It won the top prize, the People's Choice Award, at the 2017 Toronto International Film Festival, and won the Audience Award at the 2017 San Sebastián International Film Festival.</p><br/><h3>Impact</h3><p>Signs inspired by the billboards in the film have been used in protests by numerous groups around the world. Both McDonagh and McDormand have responded positively to this, with McDonagh saying that \"You couldn't ask for anything more than for an angry film to be adopted by protests,\" and McDormand saying she is \"thrilled that activists all over the world have been inspired by the set decoration of the three billboards in Martin's film.\"</p><ul><li>On February 3, 2018, a mural was erected outside Bristol city centre in England depicting three billboards like those in the film, which read: \"Our NHS is dying\", \"And still no more funding\", \"How come, Mrs May\". It was installed by the groups People's Republic of Stokes Croft and Protect Our NHS in response to the alleged privatization of the National Health Service (NHS) and the death of a 15-year-old girl that the coroner attributed to neglect caused by a lack of NHS resources and care.</li><li>On February 15, 2018, Justice4Grenfell, an advocacy group created in response to the Grenfell Tower fire, hired three vans with electronic screens to protest perceived inaction in response to the fire the previous June. The vans were driven around London and displayed messages in the style of the billboards in the film: \"71 Dead\", \"And Still No Arrests?\", \"How Come?\".</li><li>On the night of February 15, 2018, the movement #OccupyJustice set up three billboards and a number of banners in Malta to mark the four-month anniversary of the murder of journalist Daphne Caruana Galizia. The billboards bore the text: \"A Journalist Killed. No Justice.\", \"A Country Robbed. No Justice.\", \"No Resignations. No Justice.\". The authorities removed the billboards the following day, stating that they were illegal. The government was criticized for this move, and a day after their removal, activists laid down banners with similar text near Auberge de Castille, the office of the Prime Minister.</li><li>In response to the Stoneman Douglas High School shooting that took place on February 14, 2018, in Parkland, Florida, activist group Avaaz had three vans circle Florida senator Marco Rubio's offices displaying: \"Slaughtered in School\", \"And Still No Gun Control?\", \"How Come, Marco Rubio?\".</li></ul><ul><li>On February 22, 2018, the Union of Medical Care and Relief Organizations, protesting the inaction of the UN in response to the Syrian Civil War, set up three billboards outside the United Nations building in New York that read: \"500,000 Dead in Syria\", \"And still no action?\", \"How come, Security Council\".</li><li>Shortly before the 90th Academy Awards ceremony (on or around March 1, 2018), conservative street artist Sabo set up three billboards in Los Angeles, stating: \"We all knew and still no arrests\", \"And the Oscar for Biggest Pedophile goes to...\", \"Name names on stage or shut the hell up!\"</li><li>On International Women's Day 2018 (March 8), three billboards were put in downtown Pristina, Kosovo, to protest the death of two women as a result of domestic violence.</li><li>On March 24, 2018, signs inspired by Three Billboards appeared at March for Our Lives gun safety rallies across the U.S. and around the world.</li><li>In January 2019, Chinese artist Wu Qiong and a gay policeman launched a public protest campaign in which bright-red trucks bearing slogans denouncing homosexual \"conversion therapy\" were paraded through several major cities in China, including Shanghai, Beijing, and Nanjing.</li></ul><p>Wang Qishan, China's vice-president, said he understood supporters of U.S. president Donald Trump, in part, through watching the film.</p><br/>"
  },
  "errorMessage": ""
}