{
  "imDbId": "tt0405159",
  "title": "Million Dollar Baby",
  "fullTitle": "Million Dollar Baby (2004)",
  "type": "Movie",
  "year": "2004",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "100",
      "content": "Under Eastwood's painstakingly stripped-down direction -- his filmmaking has become the cinematic equivalent of Hemingway's spare though precise prose -- the story emerges as that rarest of birds, an uplifting tragedy."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "https://variety.com/2004/film/awards/million-dollar-baby-3-1200529218/",
      "rate": "100",
      "content": "Staying at the top of his game when most of his contemporaries have long since hung up their gloves, Clint Eastwood delivers another knockout punch with Million Dollar Baby."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "100",
      "content": "Eastwood takes the audience to raw, profoundly moving places. If you fear strong emotions, this is not for you. But if you want to see Hollywood filmmaking at its most potent, Eastwood has delivered the real deal."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "https://www.newyorker.com/magazine/the-current-cinema",
      "rate": "100",
      "content": "Has a beautifully modulated sadness that's almost musical. Eastwood once made a movie about Charlie Parker (\"Bird\"), but this picture has the smoothly melancholic tones of Coleman Hawkins at his greatest."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "100",
      "content": "Achieves a mellowness and melancholy that recalls the jazzy dissonance of director (and here, composer) Eastwood's best work: \"The Outlaw Josey Wales,\" \"Bird,\" \"Unforgiven\" and \"Mystic River.\""
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "100",
      "content": "Perhaps the director's most touching, most elegiac work yet, Million Dollar Baby is a film that does both the expected and the unexpected, that has the nerve and the will to be as pitiless as it is sentimental."
    },
    {
      "publisher": "The New York Times",
      "author": "Dana Stevens",
      "link": "https://www.nytimes.com/2004/12/15/movies/3-people-seduced-by-the-bloody-allure-of-the-ring.html",
      "rate": "100",
      "content": "With its careful, unassuming naturalism, its visual thrift and its emotional directness, Million Dollar Baby feels at once contemporary and classical, a work of utter mastery that at the same time has nothing in particular to prove."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "88",
      "content": "The knockout punch comes from Eastwood. His stripped-down performance -- as powerful as anything he's ever done -- has a rugged, haunting beauty. The same goes for the movie."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "It is a rich and challenging motion picture that both affirms life and emphasizes its fragility. Eastwood touches our hearts and energizes our minds without resorting to overt manipulation."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "80",
      "content": "All the same, Eastwood's point of view has been seasoned enough to locate poignancy and respect for his protagonists where you least expect -- saying it's an old man's movie is a serious compliment."
    }
  ],
  "errorMessage": ""
}