{
  "imDbId": "tt0758758",
  "title": "Into the Wild",
  "fullTitle": "Into the Wild (2007)",
  "type": "Movie",
  "year": "2007",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "https://ew.com/article/2007/09/19/wild-8/",
      "rate": "91",
      "content": "The beauty of Into the Wild, which Penn has written and directed with magnificent precision and imaginative grace, is that what Christopher is running from is never as important as what he's running TO."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Scott Tobias",
      "link": "https://www.avclub.com/",
      "rate": "91",
      "content": "There's a bittersweet quality to McCandless' story that Penn captures intuitively."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "To these eyes, Into the Wild is an unusually soulful and poetic movie that crystallizes McCandless in all his glittering enigma, and allows us to decide for ourselves whether he was the spiritual son of Thoreau, Tolstoy, and John Muir, or the boy most likely to become Theodore Kaczynski."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/movies/i/into_wild.html",
      "rate": "88",
      "content": "Into the Wild is a beautifully made motion picture and some of the segments (especially those with Hal Holbrook and those that transpire around \"the magic bus\" in Alaska) are powerful."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "88",
      "content": "Penn, in tandem with the superb cinematographer Eric Gautier (The Motorcycle Diaries), captures the majesty and terror of the wilderness in ways that make you catch your breath."
    },
    {
      "publisher": "The New York Times",
      "author": "A.O. Scott",
      "link": "https://www.nytimes.com/2007/09/21/movies/21wild.html?ref=movies",
      "rate": "80",
      "content": "Though the film’s structure may be tragic, its spirit is anything but."
    },
    {
      "publisher": "Wall Street Journal",
      "author": "Joe Morgenstern",
      "link": "https://www.wsj.com/articles/SB119032976515834521",
      "rate": "80",
      "content": "From seductive start to shattering finish, the film is as stirring, entertaining and steadfastly thrilling as it is beautiful."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "Peter Rainer",
      "link": "https://www.csmonitor.com/2007/0921/p14s02-almo.html",
      "rate": "75",
      "content": "Penn has a real feeling for the stray moments in life that suddenly rush up and overwhelm us with emotion. He also has an eye for beauty in the wilds, of which this film has many. And he's very good with actors. What he lacks is a sharper eye for the wooziness of romanticism, and that wooziness, despite some truly breathtaking moments, infuses Into the Wild."
    },
    {
      "publisher": "Variety",
      "author": "Dennis Harvey",
      "link": "",
      "rate": "70",
      "content": "Sean Penn delivers a compelling, ambitious work that will satisfy most admirers of the book."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/37646/",
      "rate": "50",
      "content": "With all the narration and fits of slow motion, the movie seems like the work of a nervous chain-smoker. It lacks concentration--and with it, the potential for rapture."
    }
  ],
  "errorMessage": ""
}