{
  "imDbId": "tt0758758",
  "title": "Into the Wild",
  "fullTitle": "Into the Wild (2007)",
  "type": "Movie",
  "year": "2007",
  "items": [
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3851128",
      "warningSpoilers": true,
      "date": "6 November 2017",
      "rate": "7",
      "helpful": "9 out of 9 found this helpful.",
      "title": "\"Is anybody here?\"",
      "content": "I come away from this movie somewhat conflicted, not about the picture itself but of it's principal character, Christopher McCandless. I say that with some reservation as well, because when I was his age and fresh out of college, I spent a lot of time steeped in existentialist thought trying to figure out the meaning of life and how to conduct my own. In McCandless's case, there was also the family dysfunction at work, something that I never had to contend with growing up.At the heart of the movie, I don't have a lot of problem with Chris's philosophy of \"If you want something in life, reach out and grab it\". The paradox in that statement occurred exactly at the time he was saying those words to guitarist Tracy (Kristen Stewart) who fell hard for Chris at the traveler's camp. She was 'reaching out to grab it' and things weren't going to work out for her in quite the same way. So life has it's way of throwing those kinds of curveballs at you.No doubt some will find the message of uninhibited freedom and life without constraints to be an appealing one, but in the final analysis, doesn't the mere fact of existence require one to do the prudent thing? Chris McCandless's death was so unnecessary. Chances are, had he gone on to live say, a full five or ten years in the wild, he might have come to an entirely different conclusion about the meaning of his life and how to be a productive citizen of the world. His reading of Tolstoy offered a clue to an acceptable view of happiness - work which may be of some use, rest, nature, books and music. Loneliness didn't seem to be part of that equation."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw2099585",
      "warningSpoilers": false,
      "date": "21 July 2009",
      "rate": "10",
      "helpful": "167 out of 220 found this helpful.",
      "title": "Beautiful Film, Even Better Than The Book",
      "content": "For a movie to be even better than a good book is no small feat. Yet, that's how I felt after watching this film. It really impressed me. One of the reasons is the fantastic cinematography. Man, this is a beautifully filmed and, at 142 minutes, there are a lot of great scenes to admire.Sean Penn directed and Eddie Gautier was the Director Of Photography. I can't stand Penn as a person but fair-is-fair and I think he's great as a director, having seen his work in \"The Pledge\" and \"The Crossing Guard.\" The main actor, Emile Hirsch, who plays \"Chris McCandless\" (a.k.a. \"Alexander Supertramp\" reminded me of Leonardo DiCaprio with his looks, build and voice inflection. He is very credible as the young guy who wants nothing to do with materialistic society and dreams of living in the wilds of Alaska. The problem was that he was unprepared and underestimated what he was up against.Two people who fascinated me the most in here were two extremes, age-wise - Hal Holbrook and Kristen Stewart. It was really great to see the veteran Holbrook (\"Ron France\") again. He was about 82 when he made this film and hadn't acted in a film in a few years. He was terrific, too. He had some of the most memorable scenes in the story. Meanwhile, teenager Stewart was captivating as \"Tracy Tatro,\" who had a crush on \"Alex.\" This young woman is on her way to stardom.Brian Dierker and Catherine Keener also were really, really interesting as the aging hippie couple, \"Rainey\" and \"Jan.\" I kept thinking, I know this guy when listening to Dierker's voice, finally guessing it was Jeff Bridges underneath all the beard....but it Dierker, a guy who rarely acts in films.Knowing the book, the only part of the film that caught be off-guard was the young Swedish couple. I don't remember them in the book but I'll never forget this in this film!! One could debate the pros and cons of Chris McCandless for hours, so no sense going into that here. I thought the film was pretty kind to him. You read more in the book about how he hurt a lot of people with his silence. Either way, it's a a fascinating story and a beautiful film."
    },
    {
      "username": "jaredmobarak",
      "userUrl": "https://www.imdb.com/user/ur2020154",
      "reviewLink": "https://www.imdb.com/review/rw1731003",
      "warningSpoilers": false,
      "date": "16 September 2007",
      "rate": "9",
      "helpful": "446 out of 606 found this helpful.",
      "title": "TIFF07, review 3: Facing the blind deaf stone alone Into the Wild",
      "content": "Sean Penn's new movie Into the Wild arrives on the wave of a well-regarded novel about a college graduate who decides that the anger and violence in civilized society is too much to handle and commences a journey through nature in order to truly live life as it was meant to be. This film is a wonderful glimpse into the life of a kid, wise beyond his years, and the bonds that he creates with people along the way. A victim of excess in wealth and a shortage of love, Christopher McCandless hid inside his mind behind knowledge and philosophy, building up his intellectual strength, as well as the physical, in order to complete his trek, ultimately leading him to Alaska. Penn never falls into the trap of showing too much heartbreak on the side of McCandless's parents, because he doesn't want the audience to second-guess the decision he made. There is no debate to be had here, our protagonist has no alternative but to get out and live off the land. Only being completely self-sufficient can he grasp a meaning for his life and one day perhaps go back with that knowledge fully learned.Emile Hirsch is absolutely brilliant with his good-natured attitude and affable charm. His character believes that human contact is not necessary for happiness and never seeks out relationships. However, his character is so likable that they find him and latch on, not to change his mind, but to experience his level of being and hopefully learn something from him and help enlarge his vocabulary on life. The people he meets help him to fully grasp the decision of life in the wild and be able to survive it. Never coming off condescendingly to those he crosses paths with, Hirsch always holds a smile on his face. One scene, where he meets up with a couple of people from Europe, proves how contagious a clear outlook on life without the troubles of societal restraints can be. These three kids have a blast, if only for a few minuteswith Hirsch being chased by the police for rafting with no licenseand it makes one wonder if maybe we all should take a journey into nature and feel the freedom and full warmth of heart that a lack of stress to succeed in the business world can give.All the supporting players are magnificent at helping show the side to McCandless that Penn needs on display to succeed. Hal Holbrook, Brian Dierker, and Catherine Keener are by far the best of these side characters with Vince Vaughn and Kirsten Stewart adding some charm too. Dierker, Keener, and Stewart play hippie, flower-child type roles and allow Hirsch to show off how modest and unselfish he is. This is the family he deserved to have from birth and he is the son they wished their lives had earned them. At their best, all four together give some of the most emotionally charged moments in the film. Holbrook, on-the-other-hand, helps give insight into the philosophy that Hirsch needs to live with in order to survive the loneliness, looking him in the face, to come in Alaska. It is truly fascinating to see how every person adds something to his overall experience and to the tools he needs.Hirsch deserves a lot of credit because he truly outshines the film itself with his dedication and sacrifice to the role. The length of time needed to allow him the ability to lose the weight necessary for a main plot point in the movie is crazy. If the time wasn't that long and Hirsch did it all rapidly, I'm even more impressed. With all that, there are many instances free of dialogue that he needs to carry with body language and actions alone. True, much of this is enhanced by a wonderful soundtrack from Eddie Vedder, but evenso it is a remarkable performance. Kudos to Sean Penn for a gorgeous filming job also. He captures the countryside with grace, while infusing many moments of visual style by slow-motioning glimpses, knowing when to show the family left behind, utilizing informative and essential voice-over, and even breaking the fourth wall. When Hirsch first looks into the camera, at the audience, it does not seem unnatural in the slightest, but instead an amazing link for the viewers to take a look into his soul like those that crossed his path have. McCandless is so pure that it almost feels like glimpsing the calm protectiveness of God."
    },
    {
      "username": "komic09",
      "userUrl": "https://www.imdb.com/user/ur20631898",
      "reviewLink": "https://www.imdb.com/review/rw2178948",
      "warningSpoilers": true,
      "date": "22 December 2009",
      "rate": "8",
      "helpful": "356 out of 398 found this helpful.",
      "title": "missing the point...",
      "content": "I'm finding it hard to see why this film has taken such a tongue lashing (or keyboard lashing) by some people...mostly it is said that the main character is selfish and self indulgent, and that this film builds him up to be some kind of hero..but I think that's missing the point...through-out I was thinking about how, on one hand it was admirable that he wanted to break from the materialistic, money grabbing oppressive shackles placed on us by modern society, but on the other, how he had gone about it in such an irresponsible, hurtful and self-righteous way...the way he abandoned his parents and loving sister without a phone call note or explanation, and from the people he met along the way, like the kind old man and young romance, especially compounded this...and ultimately he realised this at the end by scribbling into a book, \"happiness only real when shared\" surely that is the lesson here! that his selfish, hurtful adolescent behaviour was wrong, and he ultimately paid a terrible cost.So ignore that haters...they are looking at this story the wrong way! Very much worth an open minded viewing!"
    },
    {
      "username": "shark-43",
      "userUrl": "https://www.imdb.com/user/ur0450109",
      "reviewLink": "https://www.imdb.com/review/rw1752103",
      "warningSpoilers": true,
      "date": "24 October 2007",
      "rate": "10",
      "helpful": "214 out of 297 found this helpful.",
      "title": "Sneaks Up On You",
      "content": "INTO THE WILD definitely works as a film - I had read the book so I certainly knew the tragic story of this young man's life but I was blown away by the performances. In fact, to have this young talent Emile Hirsch working with the old, legendary Hal Holbrook makes the film a must see - in fact, their scene near the end in the truck is one of the best pieces of acting I have ever seen on film - Holbrook is amazing there. He deserves a Best Supporting Actor nomination (but probably won't get it). The film is by no means perfect - there are pacing problems but Penn does use the flashbacks incredibly well and the film builds power as it goes along. Hirsch is so real - I remember noticing how talented he was in the indie flick Dangerous Life Of Altar Boys and I also thought he was very good in the so-so Alpha Dog film. But Penn gets a terrific performance out of him as well as Catherine Keener, Vince Vaughn, Wm. Hurt, Kirsten Stewart, jena Malone and everyone else for that matter. I can see how this film might not be for every one, but I was very moved by it and days later - certain images and moments stayed with me. Penn is getting better as a filmmaker with each movie he makes."
    },
    {
      "username": "Ricky_Roma__",
      "userUrl": "https://www.imdb.com/user/ur5767111",
      "reviewLink": "https://www.imdb.com/review/rw1776196",
      "warningSpoilers": true,
      "date": "7 December 2007",
      "rate": "",
      "helpful": "657 out of 962 found this helpful.",
      "title": "Blind hero-worship of an idiot (spoilers)",
      "content": "Christopher McCandless lived a silly life and died a silly death. Here was a guy who gave his savings to Oxfam, left home without uttering a word to his family and who thought salvation lay in the wilderness. Too bad, then, that he ate the wrong type of plant and carked it.All the time we're told what complete bastards McCandless' parents are. They drove Christopher into the wild. But what was their crime? Apparently they argued some, even lied a little and their children were born out of wedlock. Okay, they're not the best parents in the world, but do they deserve the harsh treatment that their son dishes out  no letters, no postcards, no phone calls? Well, if you're a massive jerk and you're somehow unable to comprehend that human relationships are more complicated than a simple 'they're good' or 'they're bad', then you may be able to build a case for young Christopher, but if you have any depth of feeling in your soul, you may well think that McCandless punished his parents beyond anything that is reasonable. And also remember that he never contacted his beloved sister. She got the silent treatment as well. However, we have a scene where Christopher goes to call her, but instead he gives his quarter to an old man who is running out of change. What a great guy, we're asked to think. See how he lends a helping hand to strangers. But what about his poor sister, the person who loves him most in the world? This apparently is his one feeble attempt to reach out and tell her that he's okay.But no, Christopher is determined to live alone in the wilderness - to find himself. He wants to escape from a sick society where people treat each other poorly. Hell, his parents even have the nerve to offer to buy him a new car and pay for a Harvard education. Those phonies. Those shallow fakers who give him a home to live in and money to spend. How disgusting they are.Okay, so fair enough, the parents that we're presented with here are stiff, middle class dweebs who are more interested in appearances than anything of any substance, but what had me shaking my head was the assertion that Christopher's disappearance made them better people. Suddenly they're thoughtful and united and in tune with one another. Yes, that's what every strained marriage needs  their children to put them through a couple of years of hell.But what I find most objectionable is the romanticising of the wilderness. Is this the only way that anyone can find themselves, by opening their arms and standing on the edge of a mountain and by kayaking down a river? Isn't there any other way? Apparently not. We even get a scene where Christopher, briefly stranded in LA, looks into a restaurant populated by smarmy bastards and sees a yuppie version of himself. You see what he'd become if he stayed in the city? Hunting moose and talking to hippies is the only way to become a rounded individual.But the disaffection with society in this film is incredibly adolescent. In one scene, Christopher and a buddy of his just start impotently shouting 'society!' Yeah, society sucks and the wilderness is great. The wilderness never starved anyone, ate anyone or froze their balls off. In the eyes of every bear and moose is truth and beauty, and on the cold streets of civilisation is a steady flow of lies and deceit.However, at the end, Christopher maybe finally begins to understand that his quest is full of crap. He writes something along the lines that happiness is meaningless if you don't have someone to share it with. It took you all that time to figure that out? That human connections are what make life bearable? You could have found that out back home, sitting on your couch in your underpants, stuffing Cheetos down your throat.But of course, it's the journey that matters, isn't it? And what a tedious journey it is. Christopher meets hippies and quirky foreigners (who are good) and men with badges (who are bad). He helps people like a shaggy-haired Littlest Hobo and enjoys the milk of human kindness. Well, he enjoys the milk of human kindness as long as the people are poor. Everyone who has no money in this film is an insightful, kind-hearted, itinerant poet. Plus none of the hippies he meets are smelly, ugly, incoherent bastards who drown in their own drug-fuelled nonsense. No, they're inspiring people, who plaster their vehicles with outdated sentiments like 'freedom', 'peace' and 'love'.But it's notable that there's a moment when even a bear won't eat Christopher. Supposedly the bear turns his nose up at him because the kid stays calm or perhaps because he's so sick he doesn't smell that good. But I'd like to think that the bear turns his nose up because it's BS he can smell, and lots of it.However, as we all know from Timothy Treadwell, bears don't mind a bit of BS, but alas the film can't even come close to the genius of Grizzly Man, a film that shows you're no closer to finding reality in the wilderness than you are on the city streets. The problem here is that Penn is celebrating McCandless' folly instead of investigating it. Not for one moment are we asked to consider that this kid is perhaps a bit of an idiot. We're meant to find his journey inspiring and his plight tragic. But instead it's neither of those things. And at the end his death is elevated to grandiose status (it's shot like he's ascending to heaven, that he's communing with god). But in reality his death is what happens when a deluded moron tries to live in the wilderness without a map or enough food."
    },
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw4987720",
      "warningSpoilers": false,
      "date": "10 July 2019",
      "rate": "9",
      "helpful": "23 out of 30 found this helpful.",
      "title": "Touching",
      "content": "Stunning scenery, brilliant directing from Sean Penn, soulful songs from Eddie Vedder, and a remarkable, true story. Christopher McCandless (Emile Hirsch) is a college graduate from an affluent upbringing who decides to abandon his possessions and money and to live life out on the road, ala Jack London or Jack Kerouac during parts of their lives. He's a fascinating character because of his idealism and his nonconformity; he's intelligent and kind, and yet he doesn't value human relationships, preferring solitude and a deep connection to nature. Hirsch plays the part very well, displaying an easy, personable warmth but at the same time a determination to go his own way, damn the consequences. He also really looks the part, including scenes where he had to lose quite a bit of weight. His character is troubled from an upbringing that was riddled with strife, and in one moments says so simply (and sadly) \"Some people feel like they don't deserve love. They walk away quietly into empty spaces, trying to close the gaps of the past,\" and yet we get the feeling that is just one aspect of a complicated and yet simple guy.I think some people are turned off by what they feel was a glorification, but I didn't feel that way at all. We see the trail of tears he leaves behind him, with his parents and sister devastated by not hearing from him, and him ignoring some of the kindly advice he receives along the way. He is also brutal to an old man (Hal Holbrook) who so very generously offers to adopt him, in what is a fantastic scene. Holbrook is also brilliant when he tells the young man \"when you forgive, you love.\" We see him take risks which pay off (kayaking down a rampaging river), and of course others which do not (going into the true wild of Alaska without a map or enough preparation). For that he is sometimes vilified or mocked, but I admired him for not conforming like the rest of us, and for living life on his own terms. He certainly was not cheated. And in the end, he has his moment of realization, that \"happiness (is) only real when shared\", which is a moment that is incredibly poignant.I loved the literary references in the film, starting with the title card quoting Byron, which seems so perfect: \"There is a pleasure in the pathless woods; / There is a rapture on the lonely shore; / There is society, where none intrudes, / By the deep sea, and music in its roar; / I love not man the less, but Nature more...\"And at the end as I thought about McCandless's life, I thought that this passage from Thoreau was nowhere more suitable: \"Why should we be in such desperate haste to succeed, and in such desperate enterprises? If a man does not keep pace with his companions, perhaps it is because he hears a different drummer. Let him step to the music which he hears, however measured or far away.\""
    },
    {
      "username": "mstomaso",
      "userUrl": "https://www.imdb.com/user/ur3824745",
      "reviewLink": "https://www.imdb.com/review/rw1867071",
      "warningSpoilers": false,
      "date": "1 May 2008",
      "rate": "8",
      "helpful": "153 out of 239 found this helpful.",
      "title": "2008's Version of On the Road?",
      "content": "Who Is Chris McCandless? A true supertramp? An obsessive, emotionally damaged egomaniac? Suicidal thrill-seeker? A Kerouac-like drifter addicted to the search for an ever-evasive truth? A high-functioning schizophrenic? The 21st century youth culture reincarnation of John Gault? Or just a kid going through a difficult time and looking for some distance to sort it all out? Sean Penn's pop-philosophical examination of this young man's voyage across America, to Alaska, and to the depths of his young soul will give you an interpretation at least. While it is not clear exactly whose interpretation we are seeing, it is very clear that Penn respects his subject and gave this film about as much thought and power as he could inject it with. And the film did remind me of something very true about the self-righteous naiveté of youth.I am not concerned at all with the accuracy of the film, and, while it is tempting to compare this film to Werner Herzog's excellent but less fictionalized \"Grizzly Man\", the subjects are really too widely disparate; Herzog and Penn's perspective on humanity is too different to produce a meaningful comparison. The targets of this comparison, too big and too easy. But I will make one comment about the two films - Penn's film is much more or a tribute to its protagonist than Herzog's.I found Into the Wild to be a gripping, thoughtful film. The script was good, but sometimes a bit pretentious - occasionally crossing the line between character development and character worship. Penn's direction and cinematography are masterful. The acting - every member of the cast included - is absolutely excellent.Recommended - but not for light cheerful entertainment."
    },
    {
      "username": "trigger_jam",
      "userUrl": "https://www.imdb.com/user/ur4594044",
      "reviewLink": "https://www.imdb.com/review/rw1743275",
      "warningSpoilers": false,
      "date": "8 October 2007",
      "rate": "10",
      "helpful": "399 out of 528 found this helpful.",
      "title": "Justice done.",
      "content": "The sensitivity with which Krakauer captured the essence of McCandless and his adventure is extended aptly to the movie format by Sean Penn. Even if one might not be able to appreciate the purpose for Alex's journey, I don't think anyone would be able to deny that Into the Wild is a sensitive and poignant cinematic experience. There are scenes in this movie that one will never be able to forget, particularly the ending sequence. This movie will easily pull its audience into a philosophical debate for the truth about who was right and wrong isn't easy to distinguish. Sean Penn certainly doesn't try to answer those questions, questions that McCandless' life left for his family and the rest of us. Penn does well to tread a delicate objective but not indifferent line. Certainly the best movie of this year and one of the best ever made. The story, the story itself is great."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2210991",
      "warningSpoilers": true,
      "date": "21 February 2010",
      "rate": "",
      "helpful": "12 out of 15 found this helpful.",
      "title": "A Prairie Home Companion",
      "content": "Sean Penn's \"Into The Wild\" is perhaps best viewed as being part of a recent wave of eco-themed films (\"Wall-E\", \"Avatar\", \"The Happening\", \"An Inconvenient Truth\", \"Grizzly Man\", \"Dreamland\", \"Day The Earth Stood Still\", \"Antichrist\", \"Day After Tomorrow\", \"Happy Feet\" etc). Most of these films urge their audiences to \"return to nature\", \"retreat to some pastoral existence\" or \"save the planet\" (without looking at the systemic or economic forces which completely undermine or neutralise such wants).Interestingly, aside from \"Antichrist\", \"Grizzly Man\" and \"Into The Wild\", nature in these films is always portrayed as being some kind of mystical, \"balanced\" system. While mega-studios, quite ironically, advise us to harmonize with nature, \"smaller\" directors (Penn, Herzog, Von Trier) seem to instead posit worlds in which nature is vile and base. Nature is still portrayed as being majestic and splendid, but is then associated with asphyxiation and choking, death and rot. The only harmony – as Werner Herzog once famously said – is that of overwhelming and collective murder. Murder, then, is the central theme of both \"Grizzly Man\" and \"Into The Wild\". Like Sydney Pollack's \"Jerremiah Johnson\", both films are about young men (Christopher McCandless in Penn's film, Timothy Treadwell in Herzog's) who cut themselves off from civilisation and venture off into the wilderness. Of course both Herzog and Penn initially romanticise their central characters' flights. They see beauty in this journey and a kind of crazy inner strength (McCandless rejects vapid materialism, 9 to 5 routines and sees the modern word as being a hindrance which atrophies humanity and conscience ). But both artists are also careful to counter this idealism with nature at its most violent. And so both films find their heroes \"leaving civilisation\", but only because they've first suffered a total, psychological collapse. They now disbelieve in their Master Signifiers, in their Symbolic Orders, and see civilisation itself as being representative of that which is arbitrary and chaotic. Both films then end with the deaths of their central characters, McCandless killed by a lowly poisonous berry, Treadwell killed by a mighty grizzly bear. This is not romanticism: the impetus for our adventures is something sad and pathetic, even if they're absolutely right. Their problem is that they've diagnosed civilisation but idealised Nature, a fatal failing; mankind's history is a history of battling the wild outdoors. Respect Nature. Approach with caution.And so both Treadwell and McCandless are portrayed as being disenchanted idealists who cut themselves off from a world they no longer feel apart of, no longer trust, no longer believe in. But while Penn romanticises Christopher's idealistic dream of \"entering the wilderness\", he is careful to counter this with nature at its most violent. Christopher hunts for food but recoils from maggots, Christopher attempts to cross a river, but nature's violent highways prove too powerful, Christopher forages for berries, but eats only poisonous weeds which ultimately kill him.The result is that Penn celebrates disenchantment and urges one to disconnect (mental breakdown, oft the precursor to wisdom), even as he warns that drifting too far is itself a form of suicide or self-destruction. Chris wants to cut himself off from mankind (the film opens with a quote from the Romantic Movement which advocates \"ostracizing oneself from humanity\"), but also learns that \"Happiness Is Real Only When Shared\" (the last dreams he has is of hugging his parents). And that's Penn's irony: it is the connections that Christopher makes with other people as he continues along on his journey which allowed him to survive in the wilderness for as long as he did. When towards the end of the film Christopher turns down an offer to live with an elderly man, he effectively gave up entirely on humanity. This total disconnection, this suicidal action, is ultimately what the film warns of.The kind of balance that the film longs for is thus similar to the teachings of Thoreau, who advocated finding a middle ground between rejecting and fully embracing the wilderness. The people Chris meets (and rejects) along his journey are thus in possession of the life he longs for.Elsewhere the film is about the enchantment of text and the romance of words. Krakauer wrote about Chris not only because Chris' journey was inspired by idealistic books (Chris takes literature rather than food with him) but because Chris was himself a writer and left behind numerous documents. What the film thus does is sets up a war between the word (fantasy) and the image (world). As each level of text is one step removed from reality, image eventually wins, the image of a berry and the failure to correctly read it being what ultimately kills Chris.Audiences typically view Chris as either a \"hero\" or a \"jerk\", but he's more a lost, fragile child. Having learnt that everything he knew about his parents and his own history was a lie, Chris began to distrust everything. Suddenly all truths were shattered. The only way for Christopher's mind to cope with this subjective destitution was to then enter a little fantasy world in which he's a \"noble adventurer\". As he loves meta-acting, Penn thus has actor Emile Hirsch play Christopher as a wounded guy playing the role of the very romantic hero he reads about in books.Elsewhere, like Kirk Douglas' \"Lonely Are The Brave\", Penn contrast modern technology with primitivism. He stresses the artificiality of the caravans and abandoned buses which Christopher relies on to survive, and counterpoints Christopher's physical death with a near spiritual shot of a modern passenger jet. The film does not condemn modern technology, it recognises it as a necessity. The film then ends with Christopher's body seemingly \"transcending\" into heaven. The film then rewinds, his body sucked into the ground, Penn's camera pulling back such that Christopher's corpse seems to be asphyxiated by Nature. 8.5/10 – Worth two viewings."
    },
    {
      "username": "suebasko",
      "userUrl": "https://www.imdb.com/user/ur1482722",
      "reviewLink": "https://www.imdb.com/review/rw1728785",
      "warningSpoilers": true,
      "date": "11 September 2007",
      "rate": "",
      "helpful": "411 out of 625 found this helpful.",
      "title": "One of the best movies I've ever seen",
      "content": "One of the best movies I've ever seen. Beautiful, deep, true, adventurous, sad, occasionally funny, real, at times very touching. Based on a real-life novel, it is written and directed by Sean Penn. I have always loved the movie work of Sean Penn. Congratulations and thank you to Mr. Penn on giving me a few hours of though-provoking delight. Can you say Oscar? This movie says it loud and clear! The story; Christopher McCandless, just graduated from college in the early 1990s, goes off on an adventure. He is smitten with books he readsThoreau, London, Byron. He wants no money, so he gives his to needy causes or burns it. Chris is cocky, driven, industrious. He is traumatized by his parents' bad marriage. He tries to work through his anguish. He seems determined to destroy himself just to prove that he has different values than his parents. He is inconsiderate of his family and keeps them worried about his whereabouts and safety, as if a single reassuring phone call would ruin his rebellion. He fancies himself a philosopher, but acts the petulant child. It is a great credit to the film that we see these character flaws in our hero. Off on the road, he makes a number of foolish choices  and suffers from some of them. Other foolish choices, such as daring to kayak a rapid river, bring him joy. He meets a lot of people and almost all are kind to him. His interactions with people are intense, the kind you have when you are planning to run off and disappear while you are still a mysterious entity. He avoids getting too close to anyone.The movie is gorgeous. Mountains, plains, sky, rivers, animals. The acting is fantastic, totally believable. The actors are incredible and perfectly cast  Catherine Keener as an aging hippie vagabond, Vince Vaughn as a wacky farmer growing who knows what, William Hurt as Chris' potbellied suburbanite dad, Marcia Gay Harden as the type of mom who breeds children who wants to run off to the wilderness to escape from her. Emile Hirsch plays Chris, and does a great job of it. When an actual photo of the real Chris McCandless comes on screen, we see that Hirsch resembles him. Original songs by Eddie Vedder give the right feel  that of a well-to-do young white man heading out on a chosen adventure, getting gritty by choice. His goal is to get to Alaska, but on the way there, he hits many other states and Mexico, too.Chris is a clueless kid from the warm South. He plans to go to Alaska, yet only arrives with any needed equipment because kind folks force it upon him  a machete, warm clothes, rubber boots. He's highly educated and gets good grades, yet, early on his trip, ignores a big sign that warns of flash floods. That prepares us that we are going to wince many times at his low level of common sense, while at the same time reveling in his physical strength and willingness to press on. At one point, Chris passes through Los Angeles. He is dirty, hungry, tired, and goes to a downtown mission shelter. The other men there are also dirty, hungry, and tired, but not of their own choosing. It is not their adventure, it is their life. He realizes fast that he does not want to feel categorized with men who are in dire straits due to misfortune and not due to following their own adventure. The movie shows Chris as an honorable young man. I do not want to give away any of the plot, so I'll just say  the young man has principles and so does the movie.A few parts of the movie confused me. After Chris's college graduation, he meets h is parents at a restaurant. He brings with him a lovely young woman, obviously his date. Weirdly, it turns out that she is his sister! There is more confusion when Chris picks up work on a farm run by Wayne, the Vince Vaughn character. What are they growing or doing? What's up? There is an unintentionally funny scene where an old man tells Chris that he does not have time for adventures because he is too busy with leather. I thought the old guy was confessing being into whips and chaps. But no, he has a workshop where he tools leather. There were a couple spots where the editing distracted from the movie. I saw a preview; maybe it was a rough cut. There's a scene on the farm where a triple screen is used  like a cheesy commercial. Another scene, where Chris is eating an apple, is a series of jump cuts, which I really liked. It seemed an homage to French auteur filmmakers. But it ends with Chris mugging at the camera. With it, Sean Penn breaks the believability and acknowledges that yes, this is just us making a movie. There is another part where Chris is in a car with the older man who is dropping him off. As they pull up, there is an inexplicable cutaway shot of what looks to be the head of a cannon. Much of the movie is like a travel montage or music video involving mountains and sky. The scenes are so beautiful. I know people that have elements of Chris in them. And I think I've met all the characters he runs into out on the road."
    },
    {
      "username": "Chris Knipp",
      "userUrl": "https://www.imdb.com/user/ur1501216",
      "reviewLink": "https://www.imdb.com/review/rw1735398",
      "warningSpoilers": true,
      "date": "22 September 2007",
      "rate": "9",
      "helpful": "83 out of 137 found this helpful.",
      "title": "One hell of a young man",
      "content": "Sean Penn's 'Into the Wild' is a passionate and faithful evocation of Jon Krakauer's book about Chris McCandless. It's the troubling and complex story of a young idealist and seeker who was also a rebellious child and beloved brother who gave away his $24,000 savings to Oxfam after college, went off in an old Datsun and left his family behind, and disappeared for two years wandering the country, only to be found by hunters dead of poisoning and starvation in an abandoned bus in the wilds of Alaska.It's been said as a criticism of Penn's movie that it isn't as neutral about McCandless as Krakauers's book. It is true that Emile Hirsch as Chris, who called himself Alexander Supertramp on the road, is such a joyous and appealing character it's hard to focus on the arbitrariness and foolhardiness of the young man. Hirsch gives his all. He has shown his knack for playing bad good boysparticularly in 'Dangerous Lives of Altar Boys' and 'Lords of Dogtown'and for playing wild misfitsin the little seen 'The Mudge Boy.' This is the first great role he's had, and he deserves it. His work is a wonderful melding of \"negative capability\" and generosity. It comes naturally to him to embody exuberance, boldness, and joy. If there was something off-putting or stern in the real-life McCandless, it's not very noticeable in Hirsch. But Hirsch's enthusiasm makes sense of the great adventure and self-discovery this story recounts. (Sadly, McCandless never seemed more ready to embrace life, and to overcome all his doubts about people and family, than right near his end.) All the faults McCandless had and mistakes he made made are there in the story as Penn tells it; if he has altered facts (and necessarily left some out), he hasn't done so to make the young man's plans seem clearer or his choices wiser, and the movie is replete with specific detail.'Into the Wild,' true, is itself a little on the wild and loud side, with its occasionally obtrusive Eddie Vedder soundtrack, it's insanely vivid characterslike the young Danish couple on the banks of the Colorado, Vince Vaughan's intense, grinning grain farmer, Hal Holbrook's fabulously sad, shut-down old widower. There is another kind of overload in the occasional use of split screens. But it all unfolds very much as Jon Krakauer's book does, with interludes at the \"magic bus\" where Chris met his doom constantly intercut with episodes from his travels earlier during his two wander-years. And incredible episodes they are: roaming with a warm hippie couple; illegally and hair-raisingly running the Colorado rapids in a kayak; working in the big grain elevator and loving it; riding the rails and loving that too, till he's caught and beaten; escaping a flophouse in L.A.; staying with old Mr. Franz (Holbrook), learning from him how to engrave leather belts and persuading him to climb a mountain; and then off into the hostile snow country with a big back pack and sheer will. Many voiceovers from Chris's sister add more about the sibling relationship than was in the book; the family \"fearlessly\" cooperated in the film-making. McCandless's stern NASA honcho dad (William Hurt) and uptight mother (Marcia Gay Harden) are as unappealing as he saw them, but are not overdrawnor underrepresented. Among other things Sean Penn's film is a remarkable balancing act.It's obvious this story had to be made into a movie, and it's hard to imagine how anyone could have done it better than Penn and his fine cast. All Penn's directorial efforts have been heartfelt and earnest, but this of his films thus far is his greatest artistic success and has the widest appeal. Into the Wild is a good balance of the emotionally wrenching and the thought-provoking. It contains so many themes and poses so many questionsabout youth, about time, about responsibility. Chris isn't to be confused with Herzog's 'Grizzly Man'. He's aware of the danger of nature. It's just that he has the hubris of daring to approach it with too little knowledge and experience, knowing the risk, and taking it. And indeed he might have made it and gotten back out, but for two or three terrible mistakes. Nature is unforgiving.Chris McCandless was unforgiving too. But if he read the romantic Bible of his own life lived in those intense two years and lived to tell of them, the film suggests, he would have learned to love and forgive. He was bright, talented, passionate about life, a seeker or rare moral fervor who read and thought and recorded all that happened in those last days. His death was sadly premature. But there are signsthey're clear in Krakauer's bookthat he made an impact on the world he inhabited and the people he met. Vince Vaughan's character shouts, \"You're one hell of a young man. You're one hell of a young man!\" He died terribly alone. But maybe the tree that falls in the forest is heard after all. \"Quant'e' bella giovanezza,\" goes an Italian renaissance verse, \"Che si fugge tuttavia.\" How beautiful is youth, which flees straightaway. McCandless' story embodies those lines.'Into the Wild' seems more moving and thought-provoking than any other recent film, and may be destined to become some kind of classican 'Easy Rider', some have said, for our times. It's about society and nature, about family, about idealism and aloneness; most of all it's about the dangerous, heartbreakingly brief and beautiful romanticism of youth. In those two years, Chris McCandless lived a whole, remarkable, life. And Sean Penn has captured those two years for us."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw5463716",
      "warningSpoilers": false,
      "date": "6 February 2020",
      "rate": "7",
      "helpful": "34 out of 55 found this helpful.",
      "title": "A most unique...but not entirely pleasant viewing experience.",
      "content": "There is a certain irony to the story from \"Into the Wild\", as Hollywood, the land of excess, does a film about a man who got rid of all his possessions in order to live simply off the land. It would be like me (at 250 pounds) writing a diet book! Now I am not attacking Sean Penn or the film or any of the ones who made the film...but in general I just cannot associate Hollywood with the life of Christopher McCandless!The story begins with Chris graduating from Emory University, a prestigious school in Georgia. Now you'd think he would be on the fast track to financial success...but instead he gives away nearly everything he has and heads into the wilderness to live a bit like a nomad. It seems Chris was tired of a life of acquiring things and wanted to live simply...and mostly alone. He also seemed to be running away from himself....or at least who he and his family were. Ultimately his life would take him from the American Southwest all the way to the wilds of Alaska. This tale is based on a true story, as told by Chris' sister in the film.I think this is a movie where I enjoyed the style more than the story itself. I liked the simple style, the simple music and the mostly lesser-named stars in the picture. I also respect how much Emile Hirsch put himself out for the role...his weight loss throughout the movie was dramatic. As a trained therapist, however, I couldn't help but think the Chris would have benefited a lot from therapy before taking such a huge leap in his life. He was clearly, in an odd way, suicidal and I was concerned how the film seemed to romanticize this. Overall, an interesting but often unpleasant and overlong movie...worth seeing once but not a film I'd rush to recommend."
    },
    {
      "username": "phenomynouss",
      "userUrl": "https://www.imdb.com/user/ur5368428",
      "reviewLink": "https://www.imdb.com/review/rw4466572",
      "warningSpoilers": false,
      "date": "18 November 2018",
      "rate": "1",
      "helpful": "47 out of 73 found this helpful.",
      "title": "luddite fetishization of a coddled man in way over his head",
      "content": "I found something utterly fascinating in the true story of Christopher McCandless, venturing out into the \"wild\" of Alaska with basically nothing but a gun and some food, and eventually succumbing to the inevitable. I passed no judgment on him or his decisions when I read through the story, focusing more on the mystery of what drove him to a vagabond existence culminating in total hermitage from which he absolutely could not survive. The cliché of \"the devil is in the details\" is one horribly true here, and tends to tear apart the story. In truth, McCandless essentially committed suicide. He refused all the necessary help to survive in the cold, did not even learn how to dry meat, and, had he had a map, could have easily walked back to civilization at almost any point in time. In fact, we can learn almost nothing from McCandless or his time spent in the wild, as his journal entries are as mindless and empty and almost completely devoid of any real content. They literally amount to things like \"Day 2: Fall through the ice day.\" \"Day 4: Magic bus day.\" \"Day 9: Weakness.\" \"Day 10: Snowed in.\" \"Day 68: Beaver Dam. Disaster.\" \"Day 107 (the last entry): Beautiful berries\" Going into the actual film itself, we get virtually none of this. Instead we are taken on a tediously long, droning journey that covers almost none of the survival aspects and just covers his wandering through the US in the years leading up to the event. Throughout this \"journey\" we're treated to overly dramatic musical montages waxing poetic on how \"society, man, society is just society, man\" ranting and railing with all the emptiness and incoherence of someone with basic understanding of almost everything, but knowledge of almost nothing.Life sure does sucks for a rich white kid who graduates from a prestigious university with nearly all A's, the movie tells us. How can you be happy with things like money and a job instead of living in the woods, hanging out with psychotically upbeat Danish tourists you meet after barely surviving a dangerous river paddling you jump in with 0 paddling experience, ignoring the guy who tells you you need to sign on with a professional because you could die. What does he know? Society, man. Screw society, man. The truth about the abuse he and his sister suffered from their parents wasn't revealed publicly by the time his movie was made (though she did disclose it off the record to the book author Jon Krakauer), so it's never made fully explicit here. But the whole theme of the movie is such that it doesn't matter, because it doesn't easily fit into the theme that \"society sucks and you can only be happy living in the woods\". The immense scale of the romanticization is insufferable. It becomes painfully pretentious almost immediately and it makes the protagonist thoroughly unlikeable; a vapid, empty vessel literally living the dream of the vapid spoiled white kid who worships nature and thinks modern society is a drag. The least I can say about this fictional version of McCandless is he is at least completely devoid of the self-righteous spite and meanness of a character like Holden Caulfield. He's not rubbing our faces in this pretentious message; the film itself is, and sometimes it seems as if he's just as much a victim as we are, having his adventure luridly fetishized as if he were an idol, and not someone who was way in over their head. I can't help but think of a similar story of someone who died in the Alaska wilderness, Carl McCunn in 1981. He went with almost 2 tons of food and supplies, multiple weapons, and actually left highly detailed journal entries telling a tragic story of a man who made a rather different mistake; He did not make it clear to the pilot who left him in the wilderness to return for him 5 months later. As 5 months slips into 6 months, you can clearly feel the pain in his entries as he realizes he is likely never coming back alive, and no one is likely to come looking for him. At one point, he is even spotted by a state trooper flying over in a plane, but laments in his journal that he apparently accidentally signaled to the trooper that he was okay and not in need of rescue. His final entry is a plea to God to forgive him and look over his family, then writing \"They say it doesn't hurt\" before taking his own life rather than freeze to death. There's nothing remotely like that in this film. The film barely lingers on Chris's experience of solitude in the wild, preferring to go on and on and on and on and on and on and on and on with his silly adventures, interspersed with upbeat montage after montage set to popular music"
    },
    {
      "username": "Ozzy2000",
      "userUrl": "https://www.imdb.com/user/ur15869926",
      "reviewLink": "https://www.imdb.com/review/rw1856720",
      "warningSpoilers": true,
      "date": "13 April 2008",
      "rate": "1",
      "helpful": "181 out of 303 found this helpful.",
      "title": "Dumb and futile death by misadventure by a spoiled rich kid",
      "content": "This really stupid glorification tribute film financed by the extremely wealthy McCandless whose son died a futile death from poisoning , starvation and overexposure in the Alaskan wilderness. Having graduated from Emory University the super spoiled typical rich kid rebels against what is expected of him by his parents. Like most of his type knowing full well he can always fall back on his parents wealth when it suits them to do so he then sets out on squandering his allowance after reportedly having donating his allowance to charity. The character playing his sister provides a narrative throughout the film providing a rational that his parents premarital experiences as well as their highly strained marriage as the reason for his escape into irresponsible living.This mainly fantasized account of Chris McCandless's last stage of life includes all these encounters that paint him as a much loved eccentric character idolized by young women, a grain farmer, welfare workers, burnt out hippies and an old man who wants to adopt him. He breaks ecological laws by rafting down the Colorado river without a permit to Mexico where he sweet talks his way back into the USA without ID papers. McCandless then finishes his little road trip adventure with a hunting trip to the Alaskan wilderness. Despite being fully equipped and armed the idiot McCandless manages to die of a combination of starvation, poisoning and over exposure. Sean Penn directs this silly film which will no doubt find fans amongst superficial young women and other well to do hippie types. I suspect these types of films inspire young people to take foolish paths in life that only the rich can afford to take and have seen this happen to friends of mine with similar disastrous consequences. I'm giving it one star because maybe it will inspire other idiots to perish in the wilderness. I was not keen on the wasteful shooting of Alaskan wildlife for McCandless's camping experiment. Great comedy material."
    },
    {
      "username": "wyattej2000",
      "userUrl": "https://www.imdb.com/user/ur13661893",
      "reviewLink": "https://www.imdb.com/review/rw1751405",
      "warningSpoilers": true,
      "date": "23 October 2007",
      "rate": "1",
      "helpful": "121 out of 186 found this helpful.",
      "title": "Good movie about an idiot.",
      "content": "This is a really good movie, unfortunately I could not remove myself from the fact that the main character was a complete moron. First of all contrary to what people feel, \"dropping out of society\" is a lazy, b.s. way of rebelling against corporate society, and never achieves anything but a self fulfilled prophecy. Here is what native Alaskans felt about this fool in general. \"Krakauer's book made McCandless a heroic figure to many.Unlike Krakauer and many readers of his book, who have a largely sympathetic view of McCandless, some Alaskans have negative views of both McCandless and those who romanticize his fate. McCandless was unaware that a hand-operated tram crossed the river a quarter mile from the Stampede Trail, while a nearby shelter was stocked with emergency supplies, as described in Krakauer's book. However, the three nearby cabins were broken in and vandalized extensively at some point after mid-April, thus destroying food and first-aid supplies, as noted by Jon Krakauer. Alaskan Park Ranger Peter Christian wrote: \"I am exposed continually to what I will call the 'McCandless Phenomenon.' People, nearly always young men, come to Alaska to challenge themselves against an unforgiving wilderness landscape where convenience of access and possibility of rescue are practically nonexistent ... When you consider McCandless from my perspective, you quickly see that what he did wasn't even particularly daring, just stupid, tragic, and inconsiderate. First off, he spent very little time learning how to actually live in the wild. He arrived at the Stampede Trail without even a map of the area. If he had a good map he could have walked out of his predicament ... Essentially, Chris McCandless committed suicide.\" Judith Kleinfeld wrote in the Anchorage Daily News that \"many Alaskans react with rage to his stupidity. You'd have to be a complete idiot, they say, to die of starvation in summer 20 miles off the Park's Highway.\"[12] Thank you very much, but making a martyr out of a moron is just too much."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw2080297",
      "warningSpoilers": true,
      "date": "13 June 2009",
      "rate": "7",
      "helpful": "9 out of 12 found this helpful.",
      "title": "In search of time not found.",
      "content": "I've never seen a movie quite like this one, not an American movie at any rate. The one that comes closest, maybe, is \"Easy Rider,\" but that one was full of plot points and ambition, raggedy though they turned out. \"Into the Wild\" is more like an assemblage of episodes from a self-made movie, put together with the help of some family friends who happen to be professional actors.Emile Hirsch is the non-fictional Chris McCandless who gives away everything he owns, takes to the road, and winds up owning nothing in the Alaskan wilderness, not even the opportunity to savor the emotional fulfillment of being completely and utterly alone.Hirsch isn't bad either. He is transformed from chubby and cheerful at the start to thin and desperate by the end. I would guess the film sticks pretty closely to its origins, which I think I remember reading in The New Yorker years ago.The narration is based on Chris's sister's memories and on Chris's own journal but narrations can be misleading or sometimes plain wrong. It seems to be all the fault of McCandless's bickering parents. It was they who drove him to these peregrinations. Well -- that's kind of an easy way out. It provides a satisfying explanation for a story that is likely to be otherwise unexplainable, at least until we know more about neurology. It's always easy to find a trigger for behavior in our past experiences. Psychoanalysis rode that horse for generations. In reality I suspect that strangeness in people is partly a given at birth, and the explanations are post hoc and fitted to the cultural climate. It's tough enough being the parent of an odd child without being blamed for every odd thing he does.Where was I? I think I started out for the Sea of Cortez and found myself, like Chris, in the North Woods.The photography is sometimes stunning, often appealing, and sometimes as idiosyncratic as Ray Bolger's dance in \"The Wizard of Oz.\" Step motion, slow motion, negative shots, all are employed but not, thank God, to the point of nausea. The whole film is leisurely, moving back and forth from Chris's encounters at home and on the road, to the Magic Bus he lives in at the top of the world.Good actors. Nobody in the movie flubs it. Catherine Keener and William Hurt are exceptional performers but they have little to do on screen. Hurt does get a chance to register some convincing abject anguish at the end. Hal Holbrook, now an older man, has never been quite as good as he is here. A home run for Holbrook.Does the movie have a point? Well, it certainly tries to impose one on the narrative, something along the lines of spiritual fulfillment is worth any price, even life itself. Hirsch dies with an open smile on his face, gazing at opalescent clouds. (If I remember correctly, the real Chris assumed his absence would be noticed and was waiting for an expected helicopter rescue.) The fuzzy points I would take away don't include our need for others in any but a mechanical sense. (We need others to make our shoes and guns.) There have been successful hermits before. I certainly wouldn't conclude from this story that nature is cruel because it isn't. It's just indifferent. What are we, after all, except a widespread large mammal that happens to call itself Homo sapiens?"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw6947249",
      "warningSpoilers": false,
      "date": "21 May 2021",
      "rate": "7",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Good but not great",
      "content": "Good, but as great as it is made out to be. Great scenery and cinematography, like a National Geographic documentary. Great soundtrack by Eddie Vedder. The central plot is very interesting and thought-provoking, but it gets done to death. From a point the movie just drifts. A shorter, more focussed film would have been much more watchable.Emile Hirsch is great in the lead role and really unhabits the part (down to the emaciated look). The supporting cast are a Hollywood who's who - William Hurt, Hal Holbrook, Catherine Keener, Marcia Gay Harden, Vince Vaughn, Jena Malone, Kristen Stewart."
    },
    {
      "username": "TheAnimalMother",
      "userUrl": "https://www.imdb.com/user/ur18519281",
      "reviewLink": "https://www.imdb.com/review/rw2151707",
      "warningSpoilers": true,
      "date": "3 November 2009",
      "rate": "9",
      "helpful": "23 out of 33 found this helpful.",
      "title": "*The Hearts Search For True Heart*",
      "content": "I agree with many others who have said that the main character makes some bad decisions (And you haven't?), and I agree that the film's story is far from the greatest story that has ever been made into a film. However, the story here is an important one that has a lot to say about being human. The story itself is certainly not at all an easy one to tell through the cinematic medium. Nonetheless, I really do think Sean Penn has captured this story nearly as well as it possibly could have been told on film, and that in itself is a stunning accomplishment. This story is so real, so human, that it reaches out and has obviously grabbed a ton of peoples hearts, including mine. The scenes themselves give off a very authentic feeling, even where some parts are somewhat rushed through for the betterment of the whole story, it ends up working well in full scope. Many of the scenes are extremely intimate, including the scene where Hirsch looks directly into the camera to increase this very aspect I feel. I know a lot of people have criticized this part, and I agree in most films it would have no place whatsoever, but here it is a very daring and effective decision by Penn in my opinion. Much of the film displays a vast amount of scenic beauty, and the scenes at slab city are nothing short of 'classic'.To me, the important thing to take from the film is not why Chris decided to leave his parents and society. Nor do I think anyone can in their right mind criticize this decision he made. That is pointless. The fact is that it was his choice, whatever his accumulative reasons may have been is beside the point. The value here is in what he learns from the experience, and the incredible way in which he and Sean Penn have now shared that message with the rest of the world.Eddie Vedders music was obviously the perfect choice for this film, as it sways with emotional depth and helps to carry the films authentic feel. There are many great acting performances here as well, none better than Catherine Keener's brilliant delivery of grace and genuine heart.The story here ventures into the territory that drives all human experience. The search for authentic heart that all people, knowingly or not search for.The heart searches for heart, only to find itself treading in a sea of broken hearts, all cut from the same Divine Cloth. The One, and the many...forever lost within ourselves.\"Happiness only real when shared\" Chris McCandless9.5/10"
    },
    {
      "username": "treeline1",
      "userUrl": "https://www.imdb.com/user/ur1721672",
      "reviewLink": "https://www.imdb.com/review/rw2086887",
      "warningSpoilers": true,
      "date": "26 June 2009",
      "rate": "",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Poignant adventure story",
      "content": "When Chris McCandless (Emile Hirsch) graduated from college, he had one goal in life - to finally break away from his unhappy family and the constraints of society in general and live off the land in Alaska. The episodic film flashes back and forth between Chris' adventures in Alaska and the months leading up to it, focusing on the people who befriended him, including an aging hippie couple and a lonely, old man (well-played by the venerable Hal Holbrook).Based on a true story and narrated with many of Chris' journal entries, the film is an emotional roller coaster; I was torn between admiring his youthful idealism and courage and hating him for the pain he inflicted on his family. The movie feels much like a documentary as it follows Chris hitchhiking and working his way across the country and then surviving, at first, quite well in Alaska.Emile Hirsch is well-cast as Chris and makes you care about him right from the start. He did all of his demanding stunts himself and even lost 40 pounds to play the ailing Chris. It is a very touching story. Amid the splendor of the wilderness but ultimately alone, Chris finally understood that happiness is only real when it is shared. Highly recommended."
    },
    {
      "username": "RalphNumbers",
      "userUrl": "https://www.imdb.com/user/ur5519432",
      "reviewLink": "https://www.imdb.com/review/rw2337505",
      "warningSpoilers": true,
      "date": "12 November 2010",
      "rate": "1",
      "helpful": "31 out of 44 found this helpful.",
      "title": "Aggrandizes insanity",
      "content": "This wholly misguided effort attempts to celebrate the self destruction of a mentally ill man.Even more odd is how the narrative attempts to convey some kind of perversion of a redemptive character arc.Ironically, the film is inadvertently symbolic of the hardcore American Left -- showcases the naivete, misguided ego and ultimate reckoning of those whom Lenin allegedly anointed \"useful idiots.\"But then, what would one expect from the naive, misguided ego of Sean Penn?Brings to mind the 1942 Italian production of Ayn Rand's \"We The Living\" (\"Noi vivi\"), of which the misguided Mussolini was so proud...because he didn't grasp how the film undercut his own warped political philosophy."
    },
    {
      "username": "h-talbot",
      "userUrl": "https://www.imdb.com/user/ur4909264",
      "reviewLink": "https://www.imdb.com/review/rw1798699",
      "warningSpoilers": false,
      "date": "12 January 2008",
      "rate": "8",
      "helpful": "201 out of 323 found this helpful.",
      "title": "Oscar material",
      "content": "I watched this movie on the aeroplane after searching through the movie list and not finding anything else interesting to watch. I didn't even know what the film was called until the ending credits. However, what I saw was amazing - the acting and scenery was excellent and the plot was thought provoking. More people should watch this to appreciate the message to us all. I was also surprised to see it was was actually a true story which made it even more interesting (I love films that are based on true stories). It is one of the best movies i've seen that portrays the contrast between a materialistic world vs the natural world that is at the core of the universe. This is a film that can easily be overlooked but not forgotten."
    },
    {
      "username": "filipemanuelneto",
      "userUrl": "https://www.imdb.com/user/ur53053227",
      "reviewLink": "https://www.imdb.com/review/rw6890059",
      "warningSpoilers": false,
      "date": "8 May 2021",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "An excellent film that tells the life story of a controversial adventurer of our time.",
      "content": "I went to see this film without reading much about it, driven by curiosity. It is an excellent film, although it is difficult to see, and the main character has ideas, attitudes and motivations that can be discussed. Very well directed by Sean Penn, the film tells the life (brief, since he died very young) of Christopher McCandless, a.k.a. Alexander Supertramp. As the film shows, he was from a wealthy family and had a good education, but he carried with him the revolt against his abusive father and his passive mother. Then, he acquired a lot of disdain for capitalist, materialistic, consumerist society in which he never saw himself: burning and giving his money, abandoning everything that was not essential, he left his old life behind and started to wandering, as a vagabond, in the middle of the wild, before moving on to his great goal: Alaska.Much more than the film itself, it is the figure of Chris McCandless that proves to be fascinating: he could be seen as a utopian idealist in search of a dream, a spoiled young man angered against his family or a traumatized man, fiercely determined to purge his past through destructive self-denial. Personally, I admire his iron determination, the way he did not hesitate to venture out, against all odds and, not infrequently, against all good sense. But I admire that because I would never have the courage (or perhaps the recklessness?) to imitate him. In any case, he is a figure who will remain controversial and will certainly continue to raise questions and attract fans and critics.I really enjoyed the work of Emile Hirsch for the film. The actor worked hard and gave himself completely to the character, not hesitating to dispense the help of stunts and to lose weight until he looked like a war survivor. He truly embodied the character and gave us an excellent dramatic job. Beside him, there is a wide and interesting range of supporting actors who brighten up the film: Marcia Gay Harden, William Hurt, Catherine Keener. In some brief but important characters, we have the easily recognizable names of Vince Vaughn and Kristen Stewart. Much more remarkable and interesting, Hal Holbrook's work in a philosophical character that only appears for a few minutes, earned him the nomination for an Oscar for Best Supporting Actor.Technically, the film has several points worthy of praise and positive mention, starting with an excellent camera work, which makes the most of the natural beauty of the filming locations, and a great cinematography where light and shadow are magnificently used. It is a very long film, but the editing work was excellent, and I felt that the story told fully justifies the two and a half hours in length. The sets are good (especially the bus) and also the costumes, particularly that of the main character, with his hair and beard giving him an increasingly wild, sloppy look. The makeup team's work also deserves a note of praise for the way it left Hirsch's face particularly emaciated and pale for some scenes."
    },
    {
      "username": "billyfish",
      "userUrl": "https://www.imdb.com/user/ur1304222",
      "reviewLink": "https://www.imdb.com/review/rw2099772",
      "warningSpoilers": true,
      "date": "21 July 2009",
      "rate": "3",
      "helpful": "31 out of 47 found this helpful.",
      "title": "Idealistic \"self-sufficient\" character who is in fact a naive and hypocritical parasite",
      "content": "The main character, Chris, started to annoy me almost immediately and the feeling grew as the movie progressed. Who would be so self-centered and selfish that they would burn their money? At least leave it under a rock for some poor traveler to enjoy! He travels by bumming rides (and food) from others -- how hypocritical can the \"self-sufficient\" man become? He's happy he found a straw hat in a field -- are we supposed to respect him for that? Perhaps if he had had the skill to make the hat himself, he might have earned some grudging respect. Then he hikes \"into the wild\" in Alaska (after having bummed yet another ride) and settles in an abandoned bus. He's nothing but a gigantic parasite, going on interminably about how evil money is, while at the same time enjoying the fruits of other people's labor (and money), even if some of the items have been discarded. I wish he had never found the bus, but had had to live under a tree. How long would he have lasted then? To top off his irresponsible behavior and total selfishness, he simply disappears without informing his family, causing them no end of emotional stress. I'm sorry, this character was just an asshole. I'm only halfway into the movie right now, but having read other spoilers, I know he eventually dies, apparently in a senseless fashion. I perversely find myself looking forward to this event, as horrible as that sounds. I cannot believe that this movie was nominated for an Oscar. It's a silly movie about a completely unlikeable and annoyingly naive fool who in the end gets what he deserves."
    },
    {
      "username": "paulclaassen",
      "userUrl": "https://www.imdb.com/user/ur2263198",
      "reviewLink": "https://www.imdb.com/review/rw5711482",
      "warningSpoilers": false,
      "date": "5 May 2020",
      "rate": "3",
      "helpful": "16 out of 26 found this helpful.",
      "title": "Oh, whatever...",
      "content": "Sean Penn did a good job bringing the film to life. However, I have so many issues with this film.The cinematography is beautiful, helped off course by the stunning landscapes. The dialogue is very poetic, and the performances were good. The extreme close-up photography, though, was a bit nauseating at times.The film can easily be seen as a celebration of life (albeit a bit extreme!), and to explore and experience the beauty of nature. Nowadays we tend to forget nature actually exists. As for Chris, he did some nonsensical things along the way. Often, he came across as extremely ungrateful, and even selfish. His argument for not needing (any) money was absurd.There were moments I felt the film was stagnating, and I wanted to push it along. 148 minutes is just way too long for a film like this to sit through, especially also since it is slow moving, and the non-linear narration. So, although it is a very well made film, - and there probably are a few lessons to be learnt here - it simply wasn't entertaining enough.Based on fact, I'm wondering whether I should actually feel sorry for real-life Chris McCandless, on who's adventures the film is based. He brought what happened to him upon himself. Pure self-indulgence! He didn't think his adventure through properly and didn't plan ahead, and certainly didn't do enough research - typical spoiled brat! Having given his ENTIRE savings to charity tells me he was never planning on returning, and that this was probably a suicide mission.After more than tow hours and an ending I somehow predicted, I was really glad when it ended."
    }
  ],
  "errorMessage": ""
}