{
  "imDbId": "tt0758758",
  "title": "Into the Wild",
  "fullTitle": "Into the Wild (2007)",
  "type": "Movie",
  "year": "2007",
  "language": "en",
  "titleInLanguage": "Into the Wild (film)",
  "url": "https://en.wikipedia.org/wiki/Into_the_Wild_(film)",
  "plotShort": {
    "plainText": "Into the Wild is a 2007 American biographical adventure drama film written, co-produced, and directed by Sean Penn. It is an adaptation of the 1996 non-fiction book of the same name written by Jon Krakauer and tells the story of Christopher McCandless (\"Alexander Supertramp\"), a man who hiked across North America into the Alaskan wilderness in the early 1990s. The film stars Emile Hirsch as McCandless, Marcia Gay Harden as his mother, William Hurt as his father, Jena Malone, Catherine Keener, Brian H. Dierker, Vince Vaughn, Kristen Stewart, and Hal Holbrook.\r\nThe film premiered during the 2007 Rome Film Fest and opened outside Fairbanks, Alaska, on September 21, 2007. It received critical acclaim and grossed $56 million worldwide. It was nominated for two Golden Globes and won the award for Best Original Song: \"Guaranteed\" by Eddie Vedder. It was also nominated for two Academy Awards: Best Editing and Best Supporting Actor for Holbrook.",
    "html": "<p>Into the Wild is a 2007 American biographical adventure drama film written, co-produced, and directed by Sean Penn. It is an adaptation of the 1996 non-fiction book of the same name written by Jon Krakauer and tells the story of Christopher McCandless (\"Alexander Supertramp\"), a man who hiked across North America into the Alaskan wilderness in the early 1990s. The film stars Emile Hirsch as McCandless, Marcia Gay Harden as his mother, William Hurt as his father, Jena Malone, Catherine Keener, Brian H. Dierker, Vince Vaughn, Kristen Stewart, and Hal Holbrook.</p><p>The film premiered during the 2007 Rome Film Fest and opened outside Fairbanks, Alaska, on September 21, 2007. It received critical acclaim and grossed $56 million worldwide. It was nominated for two Golden Globes and won the award for Best Original Song: \"Guaranteed\" by Eddie Vedder. It was also nominated for two Academy Awards: Best Editing and Best Supporting Actor for Holbrook.</p>"
  },
  "plotFull": {
    "plainText": "Into the Wild is a 2007 American biographical adventure drama film written, co-produced, and directed by Sean Penn. It is an adaptation of the 1996 non-fiction book of the same name written by Jon Krakauer and tells the story of Christopher McCandless (\"Alexander Supertramp\"), a man who hiked across North America into the Alaskan wilderness in the early 1990s. The film stars Emile Hirsch as McCandless, Marcia Gay Harden as his mother, William Hurt as his father, Jena Malone, Catherine Keener, Brian H. Dierker, Vince Vaughn, Kristen Stewart, and Hal Holbrook.\r\nThe film premiered during the 2007 Rome Film Fest and opened outside Fairbanks, Alaska, on September 21, 2007. It received critical acclaim and grossed $56 million worldwide. It was nominated for two Golden Globes and won the award for Best Original Song: \"Guaranteed\" by Eddie Vedder. It was also nominated for two Academy Awards: Best Editing and Best Supporting Actor for Holbrook.\r\nPlot\r\nIn April 1992, Christopher McCandless arrives in a remote area called Healy, just north of Denali National Park and Preserve in Alaska. Noting McCandless' unpreparedness, the man who drops him off gives him gumboots.\r\nMcCandless sets up camp in an abandoned city bus that he calls \"The Magic Bus\". He is content with the isolation, the beauty of nature, and the thrill of living off the land. He hunts with a .22, reads books, and keeps a journal as he prepares his new life in the wild.\r\nFlashback\r\nIn May 1990, McCandless graduates with high honors from Emory University. He is disenchanted with modern society after discovering he and his sister Carine were born out of wedlock.\r\nMcCandless destroys his credit cards and identification, donates his savings to Oxfam and sets out on a cross-country drive in his Datsun 210 to experience life in the wilderness. He does not tell his parents nor Carine what he is doing or where he is going and does not contact them after his departure. This causes his parents to become increasingly anxious.\r\nAt Lake Mead, McCandless' car is caught in a flash flood; he abandons it and begins hitchhiking. Burning what remains of his cash, he assumes the name \"Alexander Supertramp\". In Northern California, McCandless encounters hippie couple Jan and Rainey. Rainey tells him his relationship with Jan is failing, which McCandless helps rekindle.\r\nIn September, McCandless arrives in Carthage, South Dakota, and works for a contract harvesting company owned by Wayne Westerberg. He leaves after Westerberg is arrested for satellite piracy.\r\nMcCandless kayaks down the Colorado River and, though told by park rangers he may not do so without a license, ignores their warnings and goes downriver to Mexico. His kayak is lost in a dust storm, and he crosses back into the United States on foot. Unable to hitch a ride, he jumps on freight trains to Los Angeles. Not long after arriving, however, he starts feeling \"corrupted\" by modern civilization and leaves. He is forced to resume hitchhiking when railroad police catch and beat him.\r\nIn December 1991, McCandless arrives at Slab City, in the Imperial Valley, and encounters Jan and Rainey again. He also meets Tracy Tatro, a teenage girl who shows interest in him, but he turns her down because she is a minor. After the holidays, McCandless continues heading for Alaska.\r\nOne month later, camping near Salton City, McCandless meets Ron Franz, a retired widower who lost his family in a car accident while he was serving in the United States Army. He leads a lonely life in a workshop as a leather worker. Franz teaches McCandless leatherwork, resulting in the making of a belt detailing his travels.\r\nAfter two months with Franz, McCandless decides to leave for Alaska. Franz gives McCandless his old camping and travel gear, along with an offer to adopt him as his grandchild. McCandless tells him they should discuss it after he returns from Alaska.\r\nFlashforward\r\nFour months later, at the abandoned bus, life for McCandless becomes harder, and he makes several poor decisions. Trying to live off the land, he hunts down a large moose with his rifle, but cannot preserve the meat and it spoils within days. As his supplies dwindle, he realizes that nature can be harsh.\r\nMcCandless concludes that true happiness can be found only when shared with others, and he seeks to return from the wild to his friends and family. However, he finds that the stream he crossed during the winter has become wide, deep, and violent due to the thaw, and he is unable to cross. Defeated, he returns to the bus.\r\nIn a desperate act, McCandless gathers and eats roots and plants. He confuses similar plants and eats a poisonous one, falling sick as a result. Slowly dying, he continues to document his process of self-realization, and imagines what it might have been like if he had managed to return to his family. He writes a farewell note to the world and crawls into his sleeping bag to die.\r\nTwo weeks later, moose hunters find his body. Shortly afterwards, Carine returns to Virginia with her brother's ashes in her backpack.\r\nCast\r\nEmile Hirsch as Chris McCandless a.k.a. Alexander Supertramp\r\nMarcia Gay Harden as Billie McCandless\r\nWilliam Hurt as Walt McCandless\r\nJena Malone as Carine McCandless\r\nCatherine Keener as Jan Burres\r\nBrian H. Dierker as Rainey\r\nHal Holbrook as Ron Franz\r\nKristen Stewart as Tracy Tatro\r\nVince Vaughn as Wayne Westerberg\r\nZach Galifianakis as Kevin\r\nThure Lindhardt as Mads\r\nSigne Egholm Olsen as Sonja\r\nMerritt Wever as Lori\r\nJim Gallien as Himself\r\nLeonard Knight as Himself\r\nR. D. Call as Bull\r\nCheryl Harrington as social worker\r\nBart the Bear 2 as The Bear\r\nProduction\r\nThe scenes of graduation from Emory University in the film were shot in late 2006 on the front lawn of Reed College. Some of the graduation scenes were also filmed during the actual Emory University graduation on May 15, 2006. The Alaska scenes depicting the area around the abandoned bus on the Stampede Trail were filmed 50 miles (80 km) south of where McCandless actually died, in the tiny town of Cantwell. Filming at the actual bus would have been too remote for the technical demands of a movie shoot. A replica bus used in the movie is now a tourist attraction at a restaurant in Healy, Alaska.\r\nBrian Dierker, who plays a major supporting role in the film as Rainey, had no previous acting experience and became involved in the production to be a guide for the rafting scenes.\r\nRelease\r\nCritical response\r\nThe review aggregator Rotten Tomatoes reports that 83% of 200 reviews of the film were positive, with an average rating of 7.50/10. The site's critics consensus reads: \"With his sturdy cast and confident direction, Sean Penn has turned a complex work of nonfiction like Into the Wild into an accessible and poignant character study.\" Metacritic assigned the film an average score of 73 out of 100 based on 38 critics, indicating \"generally favorable reviews\".\r\nRoger Ebert of the Chicago Sun-Times gave the film four stars out of four and described it as \"spellbinding\". Ebert wrote that Emile Hirsch gives a \"hypnotic performance\", commenting: \"It is great acting, and more than acting.\" Ebert added, \"The movie is so good partly because it means so much, I think, to its writer-director, Sean Penn.\"\r\nAccolades\r\nWins\r\n65th Golden Globe AwardsBest Original Song – Motion Picture (\"Guaranteed\")\r\nBest Original Song – Motion Picture (\"Guaranteed\")\r\nGotham Awards Best Feature Film\r\nBest Feature Film\r\nMill Valley Film Festival Best Actor (Emile Hirsch)\r\nBest Actor (Emile Hirsch)\r\nPalm Springs International Film Festival Director of the Year Award (Sean Penn) Rising Star Award Actor (Emile Hirsch)\r\nDirector of the Year Award (Sean Penn)\r\nRising Star Award Actor (Emile Hirsch)\r\nNational Board of Review Breakthrough Performance – Male (Emile Hirsch)\r\nBreakthrough Performance – Male (Emile Hirsch)\r\nRome Film Festival Jury Award (William Pohlad), (Art Linson), (Sean Penn)\r\nJury Award (William Pohlad), (Art Linson), (Sean Penn)\r\nSão Paulo International Film Festival Best Foreign Language Film (Sean Penn)\r\nBest Foreign Language Film (Sean Penn)\r\nNominations\r\n80th Academy AwardsBest Supporting Actor (Hal Holbrook) Best Film Editing (Jay Cassidy)\r\nBest Supporting Actor (Hal Holbrook)\r\nBest Film Editing (Jay Cassidy)\r\n65th Golden Globe AwardsBest Original Score – Motion Picture (Michael Brook, Kaki King, Eddie Vedder)\r\nBest Original Score – Motion Picture (Michael Brook, Kaki King, Eddie Vedder)\r\nAmerican Cinema Editors Best Edited Feature Film – Dramatic (Jay Cassidy)\r\nBest Edited Feature Film – Dramatic (Jay Cassidy)\r\nBroadcast Film Critics Association Best Film Best Actor (Emile Hirsch) Best Supporting Actor (Hal Holbrook) Best Supporting Actress (Catherine Keener) Best Director (Sean Penn) Best Writer (Sean Penn) Best Song (\"Guaranteed\")\r\nBest Film\r\nBest Actor (Emile Hirsch)\r\nBest Supporting Actor (Hal Holbrook)\r\nBest Supporting Actress (Catherine Keener)\r\nBest Director (Sean Penn)\r\nBest Writer (Sean Penn)\r\nBest Song (\"Guaranteed\")\r\n34th César Awards Best Foreign Film\r\nBest Foreign Film\r\nChicago Film Critics Association Awards Best Picture Best Screenplay – Adapted (Sean Penn) Best Supporting Actor (Hal Holbrook)\r\nBest Picture\r\nBest Screenplay – Adapted (Sean Penn)\r\nBest Supporting Actor (Hal Holbrook)\r\nDirectors Guild of America Awards Best Director – Film (Sean Penn)\r\nBest Director – Film (Sean Penn)\r\nCinema Audio Society Outstanding Achievement in Sound Mixing for Motion Pictures\r\nOutstanding Achievement in Sound Mixing for Motion Pictures\r\nCostume Designers Guild Awards Excellence in Costume Design for Film – Contemporary\r\nExcellence in Costume Design for Film – Contemporary\r\nFilm Critics Circle of Australia Awards Best Foreign Film – English Language (Sean Penn)\r\nBest Foreign Film – English Language (Sean Penn)\r\nGrammy Awards Best Song Written for Motion Picture, Television or Other Visual Media (\"Guaranteed\")\r\nBest Song Written for Motion Picture, Television or Other Visual Media (\"Guaranteed\")\r\nGotham Awards Breakthrough Actor (Emile Hirsch)\r\nBreakthrough Actor (Emile Hirsch)\r\nSatellite Awards Best Original Song (\"Rise\")\r\nBest Original Song (\"Rise\")\r\nScreen Actors Guild Awards Outstanding Performance by a Cast in a Motion Picture Outstanding Performance by a Male Actor in a Leading Role (Emile Hirsch) Outstanding Performance by a Male Actor in a Supporting Role (Hal Holbrook) Outstanding Performance by a Female Actor in a Supporting Role (Catherine Keener)\r\nOutstanding Performance by a Cast in a Motion Picture\r\nOutstanding Performance by a Male Actor in a Leading Role (Emile Hirsch)\r\nOutstanding Performance by a Male Actor in a Supporting Role (Hal Holbrook)\r\nOutstanding Performance by a Female Actor in a Supporting Role (Catherine Keener)\r\nUSC Scripter Award USC Scripter Award (Sean Penn) (screenwriter), (Jon Krakauer) (author)\r\nUSC Scripter Award (Sean Penn) (screenwriter), (Jon Krakauer) (author)\r\nWriters Guild of America Awards Best Adapted Screenplay (Sean Penn)\r\nBest Adapted Screenplay (Sean Penn)\r\nTop ten lists\r\nThe American Film Institute listed the film as one of ten AFI Movies of the Year for 2007.\r\nNational Board of Review named it one of the Top Ten Films of the Year.\r\nInto the Wild also ranks 473rd in Empire magazine's 2008 list of the 500 greatest movies of all time.\r\nThe film appeared on many critics' top ten lists of the best films of 2007.\r\n1st: Ben Lyons, The Daily 10\r\n2nd: Ann Hornaday, The Washington Post\r\n2nd: Tasha Robinson, The A.V. Club\r\n3rd: James Berardinelli, ReelViews\r\n3rd: Kevin Crust, Los Angeles Times\r\n3rd: Peter Travers, Rolling Stone\r\n4th: Kyle Smith, New York Post\r\n5th: Claudia Puig, USA Today\r\n5th: David Germain, Associated Press\r\n5th: Joe Morgenstern, The Wall Street Journal\r\n6th: Carrie Rickey, The Philadelphia Inquirer\r\n6th: Steven Rea, The Philadelphia Inquirer\r\n7th: A.O. Scott, The New York Times (tied with The Diving Bell and the Butterfly)\r\n7th: Noel Murray, The A.V. Club\r\n9th: Christy Lemire, Associated Press\r\n10th: Roger Ebert, Chicago Sun-Times\r\nBox office\r\nIn North America, Into the Wild initially opened in limited release in four theaters and grossed $212,440, posting a per-theater average of $53,110. For the next several weeks, the film remained in limited release until it expanded to over 600 theaters on October 19, 2007; in its first weekend of wide release, the film grossed just $2.1 million for a per-theater average of $3,249. As of December 25, 2008, the film grossed $18,354,356 domestically and $37,281,398 internationally. In total, the film has grossed $55,635,754 worldwide.\r\nHome media\r\nInto the Wild was released on March 4, 2008, on standard DVD, Two-Disc Special Collector's Edition DVD, and standard HD DVD. The special edition DVD and HD DVD contain two special features entitled The Story, The Characters and The Experience. The Blu-ray Disc edition was released in France on July 16, 2008. The Blu-ray edition for the US was released on December 16, 2008.\r\nSoundtrack\r\nThe songs on the soundtrack were performed by Eddie Vedder, lead singer of Pearl Jam, and Jerry Hannan. Vedder won a Golden Globe for Best Original Song for the song \"Guaranteed\". The score was written and performed by Michael Brook and Kaki King. The music at the end of the theatrical trailer is \"Acts of Courage\" by X-Ray Dog, a company that supplies music for many movie trailers. Eddie Vedder said whilst writing the songs on the album \"I spent three days giving him (Sean Penn) colors that I could paint with. Different sounds. It would be pump organ and vocal, or it would be an uptempo song. I just gave him 25 minutes of music, stuff I felt that were colors on the palette. And I really didn't think anything was gonna come out of it. Maybe a little piece or something\".\r\nAftermath\r\nThe abandoned and decaying bus on the Stampede Trail where McCandless died became a pilgrimage destination for fans. In the 1940s, a road crew had taken the bus to a remote trail in Denali Borough, Alaska, 30 miles (50 km) from the nearest town, according to Denali Borough Mayor, Clay Walker. Visitors had to cross the dangerous Teklanika River. In 2010, a Swiss woman drowned. In 2019, a newlywed Belarusian woman drowned in the swollen river on her way to the site. Five Italians were rescued in February 2020, with one suffering from severe frostbite, and a stranded Brazilian was rescued in April 2020. In total, 15 search and rescue operations for visitors were carried out between 2009 and 2017.\r\nOn June 18, 2020, the bus was removed due to public safety concerns. It was air-lifted by a US army Chinook helicopter to an undisclosed location pending a decision about its final destination. On September 24, 2020, the Museum of The North at the University of Alaska (Fairbanks) announced that it had become the permanent home of Magic Bus 142, to be restored for an outdoor exhibit.",
    "html": "<p>Into the Wild is a 2007 American biographical adventure drama film written, co-produced, and directed by Sean Penn. It is an adaptation of the 1996 non-fiction book of the same name written by Jon Krakauer and tells the story of Christopher McCandless (\"Alexander Supertramp\"), a man who hiked across North America into the Alaskan wilderness in the early 1990s. The film stars Emile Hirsch as McCandless, Marcia Gay Harden as his mother, William Hurt as his father, Jena Malone, Catherine Keener, Brian H. Dierker, Vince Vaughn, Kristen Stewart, and Hal Holbrook.</p><p>The film premiered during the 2007 Rome Film Fest and opened outside Fairbanks, Alaska, on September 21, 2007. It received critical acclaim and grossed $56 million worldwide. It was nominated for two Golden Globes and won the award for Best Original Song: \"Guaranteed\" by Eddie Vedder. It was also nominated for two Academy Awards: Best Editing and Best Supporting Actor for Holbrook.</p><br/><h3>Plot</h3><p>In April 1992, Christopher McCandless arrives in a remote area called Healy, just north of Denali National Park and Preserve in Alaska. Noting McCandless' unpreparedness, the man who drops him off gives him gumboots.</p><p>McCandless sets up camp in an abandoned city bus that he calls \"The Magic Bus\". He is content with the isolation, the beauty of nature, and the thrill of living off the land. He hunts with a .22, reads books, and keeps a journal as he prepares his new life in the wild.</p><h4>Flashback</h4><p>In May 1990, McCandless graduates with high honors from Emory University. He is disenchanted with modern society after discovering he and his sister Carine were born out of wedlock.</p><p>McCandless destroys his credit cards and identification, donates his savings to Oxfam and sets out on a cross-country drive in his Datsun 210 to experience life in the wilderness. He does not tell his parents nor Carine what he is doing or where he is going and does not contact them after his departure. This causes his parents to become increasingly anxious.</p><p>At Lake Mead, McCandless' car is caught in a flash flood; he abandons it and begins hitchhiking. Burning what remains of his cash, he assumes the name \"Alexander Supertramp\". In Northern California, McCandless encounters hippie couple Jan and Rainey. Rainey tells him his relationship with Jan is failing, which McCandless helps rekindle.</p><p>In September, McCandless arrives in Carthage, South Dakota, and works for a contract harvesting company owned by Wayne Westerberg. He leaves after Westerberg is arrested for satellite piracy.</p><p>McCandless kayaks down the Colorado River and, though told by park rangers he may not do so without a license, ignores their warnings and goes downriver to Mexico. His kayak is lost in a dust storm, and he crosses back into the United States on foot. Unable to hitch a ride, he jumps on freight trains to Los Angeles. Not long after arriving, however, he starts feeling \"corrupted\" by modern civilization and leaves. He is forced to resume hitchhiking when railroad police catch and beat him.</p><p>In December 1991, McCandless arrives at Slab City, in the Imperial Valley, and encounters Jan and Rainey again. He also meets Tracy Tatro, a teenage girl who shows interest in him, but he turns her down because she is a minor. After the holidays, McCandless continues heading for Alaska.</p><p>One month later, camping near Salton City, McCandless meets Ron Franz, a retired widower who lost his family in a car accident while he was serving in the United States Army. He leads a lonely life in a workshop as a leather worker. Franz teaches McCandless leatherwork, resulting in the making of a belt detailing his travels.</p><p>After two months with Franz, McCandless decides to leave for Alaska. Franz gives McCandless his old camping and travel gear, along with an offer to adopt him as his grandchild. McCandless tells him they should discuss it after he returns from Alaska.</p><h4>Flashforward</h4><p>Four months later, at the abandoned bus, life for McCandless becomes harder, and he makes several poor decisions. Trying to live off the land, he hunts down a large moose with his rifle, but cannot preserve the meat and it spoils within days. As his supplies dwindle, he realizes that nature can be harsh.</p><p>McCandless concludes that true happiness can be found only when shared with others, and he seeks to return from the wild to his friends and family. However, he finds that the stream he crossed during the winter has become wide, deep, and violent due to the thaw, and he is unable to cross. Defeated, he returns to the bus.</p><p>In a desperate act, McCandless gathers and eats roots and plants. He confuses similar plants and eats a poisonous one, falling sick as a result. Slowly dying, he continues to document his process of self-realization, and imagines what it might have been like if he had managed to return to his family. He writes a farewell note to the world and crawls into his sleeping bag to die.</p><p>Two weeks later, moose hunters find his body. Shortly afterwards, Carine returns to Virginia with her brother's ashes in her backpack.</p><br/><h3>Cast</h3><ul><li>Emile Hirsch as Chris McCandless a.k.a. Alexander Supertramp</li><li>Marcia Gay Harden as Billie McCandless</li><li>William Hurt as Walt McCandless</li><li>Jena Malone as Carine McCandless</li><li>Catherine Keener as Jan Burres</li><li>Brian H. Dierker as Rainey</li><li>Hal Holbrook as Ron Franz</li><li>Kristen Stewart as Tracy Tatro</li><li>Vince Vaughn as Wayne Westerberg</li><li>Zach Galifianakis as Kevin</li><li>Thure Lindhardt as Mads</li><li>Signe Egholm Olsen as Sonja</li><li>Merritt Wever as Lori</li><li>Jim Gallien as Himself</li><li>Leonard Knight as Himself</li><li>R. D. Call as Bull</li><li>Cheryl Harrington as social worker</li><li>Bart the Bear 2 as The Bear</li></ul><br/><h3>Production</h3><p>The scenes of graduation from Emory University in the film were shot in late 2006 on the front lawn of Reed College. Some of the graduation scenes were also filmed during the actual Emory University graduation on May 15, 2006. The Alaska scenes depicting the area around the abandoned bus on the Stampede Trail were filmed 50 miles (80 km) south of where McCandless actually died, in the tiny town of Cantwell. Filming at the actual bus would have been too remote for the technical demands of a movie shoot. A replica bus used in the movie is now a tourist attraction at a restaurant in Healy, Alaska.</p><p>Brian Dierker, who plays a major supporting role in the film as Rainey, had no previous acting experience and became involved in the production to be a guide for the rafting scenes.</p><br/><h3>Release</h3><h4>Critical response</h4><p>The review aggregator Rotten Tomatoes reports that 83% of 200 reviews of the film were positive, with an average rating of 7.50/10. The site's critics consensus reads: \"With his sturdy cast and confident direction, Sean Penn has turned a complex work of nonfiction like Into the Wild into an accessible and poignant character study.\" Metacritic assigned the film an average score of 73 out of 100 based on 38 critics, indicating \"generally favorable reviews\".</p><p>Roger Ebert of the Chicago Sun-Times gave the film four stars out of four and described it as \"spellbinding\". Ebert wrote that Emile Hirsch gives a \"hypnotic performance\", commenting: \"It is great acting, and more than acting.\" Ebert added, \"The movie is so good partly because it means so much, I think, to its writer-director, Sean Penn.\"</p><h4>Accolades</h4><h4>Wins</h4><ul><li>65th Golden Globe AwardsBest Original Song – Motion Picture (\"Guaranteed\")</li><li>Best Original Song – Motion Picture (\"Guaranteed\")</li><li>Gotham Awards Best Feature Film</li><li>Best Feature Film</li><li>Mill Valley Film Festival Best Actor (Emile Hirsch)</li><li>Best Actor (Emile Hirsch)</li><li>Palm Springs International Film Festival Director of the Year Award (Sean Penn) Rising Star Award Actor (Emile Hirsch)</li><li>Director of the Year Award (Sean Penn)</li><li>Rising Star Award Actor (Emile Hirsch)</li><li>National Board of Review Breakthrough Performance – Male (Emile Hirsch)</li><li>Breakthrough Performance – Male (Emile Hirsch)</li><li>Rome Film Festival Jury Award (William Pohlad), (Art Linson), (Sean Penn)</li><li>Jury Award (William Pohlad), (Art Linson), (Sean Penn)</li><li>São Paulo International Film Festival Best Foreign Language Film (Sean Penn)</li><li>Best Foreign Language Film (Sean Penn)</li></ul><h4>Nominations</h4><ul><li>80th Academy AwardsBest Supporting Actor (Hal Holbrook) Best Film Editing (Jay Cassidy)</li><li>Best Supporting Actor (Hal Holbrook)</li><li>Best Film Editing (Jay Cassidy)</li><li>65th Golden Globe AwardsBest Original Score – Motion Picture (Michael Brook, Kaki King, Eddie Vedder)</li><li>Best Original Score – Motion Picture (Michael Brook, Kaki King, Eddie Vedder)</li><li>American Cinema Editors Best Edited Feature Film – Dramatic (Jay Cassidy)</li><li>Best Edited Feature Film – Dramatic (Jay Cassidy)</li><li>Broadcast Film Critics Association Best Film Best Actor (Emile Hirsch) Best Supporting Actor (Hal Holbrook) Best Supporting Actress (Catherine Keener) Best Director (Sean Penn) Best Writer (Sean Penn) Best Song (\"Guaranteed\")</li><li>Best Film</li><li>Best Actor (Emile Hirsch)</li><li>Best Supporting Actor (Hal Holbrook)</li><li>Best Supporting Actress (Catherine Keener)</li><li>Best Director (Sean Penn)</li><li>Best Writer (Sean Penn)</li><li>Best Song (\"Guaranteed\")</li><li>34th César Awards Best Foreign Film</li><li>Best Foreign Film</li><li>Chicago Film Critics Association Awards Best Picture Best Screenplay – Adapted (Sean Penn) Best Supporting Actor (Hal Holbrook)</li><li>Best Picture</li><li>Best Screenplay – Adapted (Sean Penn)</li><li>Best Supporting Actor (Hal Holbrook)</li><li>Directors Guild of America Awards Best Director – Film (Sean Penn)</li><li>Best Director – Film (Sean Penn)</li><li>Cinema Audio Society Outstanding Achievement in Sound Mixing for Motion Pictures</li><li>Outstanding Achievement in Sound Mixing for Motion Pictures</li><li>Costume Designers Guild Awards Excellence in Costume Design for Film – Contemporary</li><li>Excellence in Costume Design for Film – Contemporary</li><li>Film Critics Circle of Australia Awards Best Foreign Film – English Language (Sean Penn)</li><li>Best Foreign Film – English Language (Sean Penn)</li><li>Grammy Awards Best Song Written for Motion Picture, Television or Other Visual Media (\"Guaranteed\")</li><li>Best Song Written for Motion Picture, Television or Other Visual Media (\"Guaranteed\")</li><li>Gotham Awards Breakthrough Actor (Emile Hirsch)</li><li>Breakthrough Actor (Emile Hirsch)</li><li>Satellite Awards Best Original Song (\"Rise\")</li><li>Best Original Song (\"Rise\")</li><li>Screen Actors Guild Awards Outstanding Performance by a Cast in a Motion Picture Outstanding Performance by a Male Actor in a Leading Role (Emile Hirsch) Outstanding Performance by a Male Actor in a Supporting Role (Hal Holbrook) Outstanding Performance by a Female Actor in a Supporting Role (Catherine Keener)</li><li>Outstanding Performance by a Cast in a Motion Picture</li><li>Outstanding Performance by a Male Actor in a Leading Role (Emile Hirsch)</li><li>Outstanding Performance by a Male Actor in a Supporting Role (Hal Holbrook)</li><li>Outstanding Performance by a Female Actor in a Supporting Role (Catherine Keener)</li><li>USC Scripter Award USC Scripter Award (Sean Penn) (screenwriter), (Jon Krakauer) (author)</li><li>USC Scripter Award (Sean Penn) (screenwriter), (Jon Krakauer) (author)</li><li>Writers Guild of America Awards Best Adapted Screenplay (Sean Penn)</li><li>Best Adapted Screenplay (Sean Penn)</li></ul><h4>Top ten lists</h4><p>The American Film Institute listed the film as one of ten AFI Movies of the Year for 2007.</p><p>National Board of Review named it one of the Top Ten Films of the Year.</p><p>Into the Wild also ranks 473rd in Empire magazine's 2008 list of the 500 greatest movies of all time.</p><p>The film appeared on many critics' top ten lists of the best films of 2007.</p><ul><li>1st: Ben Lyons, The Daily 10</li><li>2nd: Ann Hornaday, The Washington Post</li><li>2nd: Tasha Robinson, The A.V. Club</li><li>3rd: James Berardinelli, ReelViews</li><li>3rd: Kevin Crust, Los Angeles Times</li><li>3rd: Peter Travers, Rolling Stone</li><li>4th: Kyle Smith, New York Post</li><li>5th: Claudia Puig, USA Today</li><li>5th: David Germain, Associated Press</li><li>5th: Joe Morgenstern, The Wall Street Journal</li><li>6th: Carrie Rickey, The Philadelphia Inquirer</li><li>6th: Steven Rea, The Philadelphia Inquirer</li><li>7th: A.O. Scott, The New York Times (tied with The Diving Bell and the Butterfly)</li><li>7th: Noel Murray, The A.V. Club</li><li>9th: Christy Lemire, Associated Press</li><li>10th: Roger Ebert, Chicago Sun-Times</li></ul><h4>Box office</h4><p>In North America, Into the Wild initially opened in limited release in four theaters and grossed $212,440, posting a per-theater average of $53,110. For the next several weeks, the film remained in limited release until it expanded to over 600 theaters on October 19, 2007; in its first weekend of wide release, the film grossed just $2.1 million for a per-theater average of $3,249. As of December 25, 2008, the film grossed $18,354,356 domestically and $37,281,398 internationally. In total, the film has grossed $55,635,754 worldwide.</p><h4>Home media</h4><p>Into the Wild was released on March 4, 2008, on standard DVD, Two-Disc Special Collector's Edition DVD, and standard HD DVD. The special edition DVD and HD DVD contain two special features entitled The Story, The Characters and The Experience. The Blu-ray Disc edition was released in France on July 16, 2008. The Blu-ray edition for the US was released on December 16, 2008.</p><br/><h3>Soundtrack</h3><p>The songs on the soundtrack were performed by Eddie Vedder, lead singer of Pearl Jam, and Jerry Hannan. Vedder won a Golden Globe for Best Original Song for the song \"Guaranteed\". The score was written and performed by Michael Brook and Kaki King. The music at the end of the theatrical trailer is \"Acts of Courage\" by X-Ray Dog, a company that supplies music for many movie trailers. Eddie Vedder said whilst writing the songs on the album \"I spent three days giving him (Sean Penn) colors that I could paint with. Different sounds. It would be pump organ and vocal, or it would be an uptempo song. I just gave him 25 minutes of music, stuff I felt that were colors on the palette. And I really didn't think anything was gonna come out of it. Maybe a little piece or something\".</p><br/><h3>Aftermath</h3><p>The abandoned and decaying bus on the Stampede Trail where McCandless died became a pilgrimage destination for fans. In the 1940s, a road crew had taken the bus to a remote trail in Denali Borough, Alaska, 30 miles (50 km) from the nearest town, according to Denali Borough Mayor, Clay Walker. Visitors had to cross the dangerous Teklanika River. In 2010, a Swiss woman drowned. In 2019, a newlywed Belarusian woman drowned in the swollen river on her way to the site. Five Italians were rescued in February 2020, with one suffering from severe frostbite, and a stranded Brazilian was rescued in April 2020. In total, 15 search and rescue operations for visitors were carried out between 2009 and 2017.</p><p>On June 18, 2020, the bus was removed due to public safety concerns. It was air-lifted by a US army Chinook helicopter to an undisclosed location pending a decision about its final destination. On September 24, 2020, the Museum of The North at the University of Alaska (Fairbanks) announced that it had become the permanent home of Magic Bus 142, to be restored for an outdoor exhibit.</p><br/>"
  },
  "errorMessage": ""
}