{
  "imDbId": "tt0064116",
  "title": "Once Upon a Time in the West",
  "fullTitle": "Once Upon a Time in the West (1968)",
  "type": "Movie",
  "year": "1968",
  "items": [
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/2000-08-30/once-upon-a-time-in-the-west/",
      "rate": "100",
      "content": "An additional treat is seeing Hollywood good guy Henry Fonda playing one of the nastiest curs in the West. Once Upon a Time in the West is one of the great films in cinema history. (8/30/2000 Review)"
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "100",
      "content": "Leone brought back a masterpiece, a film that expands his baroque, cartoonish style into genuine grandeur, weaving dozens of thematic variations and narrative arabesques around a classical western foundation myth.(Review of Original Release)"
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Sergio Leone's masterpiece. In Once Upon a Time in the West, Leone pulls together all the themes, characterizations, visuals, humor, and musical experiments of the three \"Dollars\" films and comes up with a true epic western. It is a stunning, operatic film of breadth, detail, and stature that deserves to be considered among the greatest westerns ever made. (Review of Original Release)"
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Akira Kurosawa once said that Toshiro Mifune could give him in three feet of film the emotion any other actor would take 10 to deliver, but in a single flash of Fonda's electric turquoise orbs, Leone (Kurosawa's first and sincerest flatterer-imitator) managed to say as much about John Ford, the devil, and the corruptions of the Way Out Western world as the genre ever would."
    },
    {
      "publisher": "LarsenOnFilm",
      "author": "Josh Larsen",
      "link": "http://www.larsenonfilm.com/once-upon-a-time-in-the-west",
      "rate": "88",
      "content": "It’s probably unwise to come to Leone looking for too much in the way of feminism. Instead, Once Upon a Time in the West offers quintessential examples of the things he was better known for, including another blustery Ennio Morricone score. Visually, he mostly vacillates between extreme close-ups of intense faces and vast widescreen compositions, a technique that is lurching but also luridly beautiful."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1968/film/reviews/once-upon-a-time-in-the-west-1200421869/",
      "rate": "70",
      "content": "Henry Fonda and Jason Robards relish each screen minute as the heavies, and Charles Bronson plays Clint Eastwood's 'man with no name' role. (Review of Original Release)"
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "63",
      "content": "Good fun, especially if you like Leone's way of savoring the last morsel of every scene. (Review of Original Release)"
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "60",
      "content": "The biggest, longest, most expensive Leone Western to date, and, in many ways, the most absurd... Granting the fact that it is quite bad, Once Upon the Time in the West is almost always interesting, wobbling, as it does, between being an epic lampoon and a serious hommage to the men who created the dreams of Leone's childhood. (Review of Original Release)"
    },
    {
      "publisher": "Film Threat",
      "author": "Phil Hall",
      "link": "",
      "rate": "50",
      "content": "Alas, the big screen also magnifies the problems with Once Upon a Time in the West. Specifically, Leone’s insistence on style trumped the need for substance. The film is basically a B-Western stretched an agonizing 165 minutes."
    }
  ],
  "errorMessage": ""
}