{
  "imDbId": "tt0064116",
  "title": "Once Upon a Time in the West",
  "fullTitle": "Once Upon a Time in the West (1968)",
  "type": "Movie",
  "year": "1968",
  "items": [
    {
      "username": "TheDragonTrader",
      "userUrl": "https://www.imdb.com/user/ur78746336",
      "reviewLink": "https://www.imdb.com/review/rw4800696",
      "warningSpoilers": false,
      "date": "24 April 2019",
      "rate": "10",
      "helpful": "158 out of 165 found this helpful.",
      "title": "More Western than 'The Western' itself",
      "content": "In full silence, three mysterious men in long trench coats wait in a remote train station. Their faces have anticipation written all over them, even while the most interesting things they can find to do are toying with a fly, drinking water from a hat and cracking their fingers. A dog runs past. The windmill squeaks. The ticket vendor is locked away. The heath bounces off the wooden platform. The men sweat.Are you bored yet? Then this movie is probably not for you.But are you dying to know what the three men are waiting for? Does a light anxiety creep onto you whilst reading that description? Can't you wait for the tension to resolve? Then this movie is all you ever wanted.The almost lawless world where outlaws and bandits roam the country with ease that is the setting of the story, is shown by Tonino Delli Colli (director of photography) in all its splendorous grandeur and it's uncountable little details. The set pieces, the costumes and the real life locations in Arizona and Utah make everything believable. And together with the characters and figurants, everything creates a vibrant and utterly believable Western civilisation.Charles Bronson plays the man with the harmonica: a lone wolf looking for something that he chooses not to reveal to anyone until he gets it. A character with no name roaming the endless fields under the sun, announcing his presence at all times with the same melody he plays on his harmonica that echo's in an unsettling way. Bronson does this brilliantly, with a face that overflows with held back emotions and a determination that is downright scary.In a tavern the man meets Manuel 'Cheyenne' Gutiérrez (Jason Robards), a bandit that recently escaped being hung by the neck, re-joining his band of outlaws. With already greying hair, he takes on the situation that arises in the area, trying his part to be the hero that saves the day. Robards portrays a character that, by only one look at him, we can see how the years have shaped him. His performance is outstanding; we want to grab a drink with Cheyenne, but we also get the feeling that being on your guard around him wouldn't be an overrated luxury.The 'damsel in distress' (although she isn't in the original meaning of the word) Jill McBain (played by Claudia Cardinale) turns into a toy of Fate itself. Without any warning she gets involved in something quite over her head, but she handles it masterfully; she refuses to return to New Orleans with her tail between her legs and stays to face the difficulties put before her. Cardinale playing Jill is both an erotic marvel and a woman you wouldn't want to cross.They are all opposed by Frank (Henry Fonda): the local gang leader with a heart of stone and a business proposal at the ready at all times. With his ruthless blue eyes and his gun at the ready he keeps the town quiet. Fonda gives you the creeps with just one gaze at the camera and every sentence leaves the bitter taste of malfeasance.And finally, Gabriele Ferzetti finishes the line of main characters with his deliciously sickening portrayal of the crippled railroad baron Morton. A character that you'd like to slap in the face, but one you feel pity for as well. Outstandingly brought!The soundtrack is composed by the never beaten maestro of film scoring himself: Ennio Morricone. His genius lies in the creation of themes and melodies that will haunt your dreams forever for better or worse. The melancholic main theme that is brought with a heavenly choir draws tears from your eyes after hearing only a couple of chords. The theme of the man with the harmonica is as unsettling as it is epic and Cheyennes' theme creates the lighter counter points in the movie. Morricone uses these motifs ingeniously, hinting at plot points, character motifs and feelings and giving you a sense of the world the movie takes place in. If I could give twelve out of ten stars for the score, I'd do it.Sergio Leone was a masterful director, no need to prove that. He manages to turn even a scene of seven minutes, where three men are merely waiting for a train, into an epic storyline. Two hours and three quarters the tension builds and then resolves... partially, always building towards the end. And that finale! That finale! That finale chilled me to the bone! Throughout the film, question after question is raised, and when one question is answered, another one pops up. So when all pieces of the puzzle fall into place to the score of Ennio Morricone, how can one not be moved by it?For Leone, there was no better way to reach the top of the Western genre.And for us, there never will be a film that is more Western than 'Once Upon a Time in the West'."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2927512",
      "warningSpoilers": false,
      "date": "24 December 2013",
      "rate": "10",
      "helpful": "273 out of 309 found this helpful.",
      "title": "It doesn't get any better than this: this is movie history",
      "content": "This one only gets better with each viewing. Leone's masterful storytelling and Morricone's crazy, beautiful, epic soundtrack; desperate, haunted faces which look like the barren landscapes the story is set in and a plot that unfolds with impeccable pacing to culminate in THE ultimate western finale.As in Leone's previous films, music isn't just used to add to the atmosphere but is essential to the story, or perhaps even more: Morricone's main musical theme plays the actual role of a (or rather: the) protagonist in the film. Anyone who thought that the so called \"Spaghetti westerns\" were nothing but cheap, violent B-movies had to reconsider after seeing this film. It doesn't get any better than this: this is movie history; iconic, classic, unforgettable, epic. For this film, I just run out of superlatives.My vote: 10 out of 10Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "myriamlenys",
      "userUrl": "https://www.imdb.com/user/ur77838279",
      "reviewLink": "https://www.imdb.com/review/rw5163719",
      "warningSpoilers": true,
      "date": "5 October 2019",
      "rate": "9",
      "helpful": "25 out of 27 found this helpful.",
      "title": "thumping good Western with an almost operatic quality",
      "content": "One of the great classics : a riveting, wildly immersive Western set against the historical backdrop of the expansion of the railroads. The Ennio Morricone music is rousing, the scenery is jaw-dropping and the various characters spring to colourful life.This last fact owes much to the casting, which includes a bit of truly inspired counter-casting : actor Henry Fonda, used to playing pretty decent guys, takes on the sable-black persona of an amoral middle-aged mercenary fully capable of killing random children. It's a marvellously chilling performance - but wait for the ending of the movie, where a short flash-back shows the mercenary as a young man already much given to taunting and torturing. Fonda takes on a sick, twisted intensity that can only be described as diabolical.Now this is a long and intense movie which requires attentive viewing, meaning that it is a good idea to create an intermission and watch it in two parts. But do watch it - it's excellent."
    },
    {
      "username": "Jeremy_Urquhart",
      "userUrl": "https://www.imdb.com/user/ur26226712",
      "reviewLink": "https://www.imdb.com/review/rw3818833",
      "warningSpoilers": false,
      "date": "30 September 2017",
      "rate": "10",
      "helpful": "43 out of 49 found this helpful.",
      "title": "Without a doubt, one of the best Westerns of all time",
      "content": "I won't claim to have the ability to say anything new about this movie. It's been around for nearly fifty years, and is widely regarded as not just one the best Spaghetti Westerns of all time, but one of the best Westerns full stop. And it's not hard to see why: an incredible soundtrack, strong performances from the entire main cast, some surprisingly good humour and funny one-liners, a few tense sequences, a well-told story that doesn't rely on excessive dialogue or exposition, and consistently amazing cinematography and direction throughout. At least half the frames in this movie would probably make good paintings- no exaggeration.It's probably the marriage of the great visuals and soundtrack that make Once Upon a Time in the West work as well as it does. There's a good number of dramatic camera movements and interesting reveals that are tied up perfectly with the music- almost like some kind of singing-free musical at some points.Sergio Leone was one of the greatest directors of all time. It's a real shame that he apparently never got the kind of recognition he gets nowadays while he was still alive. Out of all his films, there's a strong argument to be made for this one being the closest to perfect. Honestly, there's not a lot that could be changed to make it better. My biggest direct gripe is the way the title pops up at the very end of the film, and rotates in a full circle before it disappears. It looks really cheesy, and comes close to killing the mood the otherwise extremely strong ending creates. While we're on complaints, another minor one would be that I want to say the film feels a little too long- maybe about 10 to 15 minutes. But at the same time, I wouldn't really know what to cut. Every scene is so well-constructed and orchestrated, and there's always something interesting to look at or listen to or think about, so I'm not really sure what should be cut. It's a pretty weak complaint, I know. Like I said, this thing's close to perfect.The Good The Bad and The Ugly might be a tiny bit more entertaining, and Once Upon a Time in America might have a slightly better soundtrack and stronger emotional moments (for me, personally), but it's still really hard to find much to complain about here. Absolutely recommended to any Western fan, and it gets a little better every time I watch it (four for me now, and counting)."
    },
    {
      "username": "thinker1691",
      "userUrl": "https://www.imdb.com/user/ur3902771",
      "reviewLink": "https://www.imdb.com/review/rw1681666",
      "warningSpoilers": false,
      "date": "27 June 2007",
      "rate": "9",
      "helpful": "48 out of 56 found this helpful.",
      "title": "\"When you've killed Four, it's easy to make it five.\"",
      "content": "In the annals of western film lore, there are good and bad films. This is one of the finest. Because \"Once Upon A Time in The West\" is such a remarkable film, it is hard to define what makes it so memorable. The story centers on a beautiful former prostitute called Jill McBain (Claudia Cardinale) who arrives to assume the role of wife to a stubborn, crazy, red-headed Irishman with a dream. Waiting, instead is tragedy and 'Mr. Morton' who is a powerful, but ailing land grabbing baron (Gabriele Ferzetti) who desires to crush everything and everyone who stands in his way to reach the Pacific ocean with his railroad. To help him is an equally ruthless gunfighter named Frank (Henry Fonda; the success of this movie owes much to Fonda who plays a very convincing heavy) who has been removing obstacles for years and now targets the McBain family for death and that includes Jill. Unfortunately for Frank, he has accrued many enemies over the years with one particular, mysterious and deadly Harmonica playing stranger seeking revenge. Frank arranges for three of his best and fastest gun hands to meet and eliminate the stranger at the train-station. Joining the instrument playing stranger is an unpredictable, half-breed, renegade, who is a notorious gunfighter called 'Cheyenne.' ( Jason Robards ) The entire film is a triumph to the superb direction of Sergio Leone, who christens each major character with their own theme song. Each theme was created by Ennio Morricone and when the character makes an entrance, the theme prepares the audience for mood change, drama, action, and lifelong memories. Special guest appearances, by Woody Strode, Jack Elam, Keenan Wynn and Lionel Stander add to the classic nature of this excellent story. ****"
    },
    {
      "username": "alansabljakovic-39044",
      "userUrl": "https://www.imdb.com/user/ur70682706",
      "reviewLink": "https://www.imdb.com/review/rw5223755",
      "warningSpoilers": false,
      "date": "30 October 2019",
      "rate": "9",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Masterpiece",
      "content": "The score is amazing and Henry Forda is magnficent. I can see why this is James Gunn's favorite movie. One of the best westerns packed with action and tension."
    },
    {
      "username": "mattywoh",
      "userUrl": "https://www.imdb.com/user/ur18371412",
      "reviewLink": "https://www.imdb.com/review/rw5253482",
      "warningSpoilers": false,
      "date": "13 November 2019",
      "rate": "9",
      "helpful": "41 out of 43 found this helpful.",
      "title": "I Never Get Tired Of Watching...",
      "content": "I won't go into the story, but it's true, I never tire of this movie---At first i thought Charles Bronson wouldn't be able to keep up with acting heavyweights Henry Fonda and Jason Robards, but Bronson's physical abilities, combined with his minimalist close-ups practically steal the show---His goodness came through in the close-ups toward the movie's end, I thought it was Charles Bronson's greatest screen work."
    },
    {
      "username": "secondtake",
      "userUrl": "https://www.imdb.com/user/ur20961309",
      "reviewLink": "https://www.imdb.com/review/rw2334250",
      "warningSpoilers": false,
      "date": "5 November 2010",
      "rate": "8",
      "helpful": "32 out of 39 found this helpful.",
      "title": "Hey, it's slow on purpose. Is that a good thing? When it's this gorgeous, yes.",
      "content": "Once Upon a Time in the West (1968)On the heels of \"The Good, The Bad, and The Ugly,\" is this equally sprawling and archetypal Western, this time with less obvious dubbing, and Henry Fonda as a kind of tie in to Hollywood's hero paradigm. It's indescribably beautiful, one of the most gorgeous Westerns ever photographed, indeed a model for good visual directing and cinematography in any genre. That alone makes the almost three hours a pure pleasure.But it's not a fast movie in any other way. It can't be. It depends on lingering over delicious details, small ones, shot up close in startling detail and ever deadpan looks and steely eyes. Nothing is believable and it's not meant to be. It's not even a fable, quite, but more a celebration of being inside an incredible film, as strange as that sounds. Not that the scenes are not believable--even the very last shots of the makeshift town and the railroad being built is about as realistic as it gets. Great stuff.Plot? You might, at times, wonder where the plot went. There are lots of bad guys, and you're not totally sure there's a protagonist, unless the one woman in the movie is the center of our concerns, even if she is clearly a bystander to it all. When it gets clear, in the last twenty minutes, it's again archetypal (and has echoes of the over the tops showdown in \"Good Bad and Ugly\"). A small bit of slow motion (not needed normally in a movie where everything is slow already) makes clear this is the key moment in the film, the thing that made the rest of it, with all its confusing and violent layers, sensible.For my money, I'd love all this incredible visceral stuff, the sounds and sights, filled in with some kind of deeply felt conflict, not a purely dramatic one. I watch and am shocked, or swept away, or impressed, or dazzled, but I'm actually never moved, not from the heart. And there are plenty of aspects here that should really move us--including feeling for the woman's plight, rather than simply recognizing that it is, after all, quite a plight.Still, another landmark Sergio Leone movie."
    },
    {
      "username": "stryker-5",
      "userUrl": "https://www.imdb.com/user/ur0150331",
      "reviewLink": "https://www.imdb.com/review/rw0106407",
      "warningSpoilers": false,
      "date": "4 January 2001",
      "rate": "",
      "helpful": "348 out of 457 found this helpful.",
      "title": "\"Something To Do With Death\"",
      "content": "Sergio goes Hollywood for this big-name, big-budget Spaghetti Western. Fonda, Bronson, Robards and Cardinale queue up and take Leone's choreographic direction in an epic tale of blood and revenge.Frank is a bad guy who has killed a lot of people. He now works for a railroad entrepreneur whose ruthless sterile tracks are spreading ever westward. The time has come for the real Americans to confront both the railroad and Frank.Leone sat down with film intellectuals Bernardo Bertolucci and Dario Argento and watched dozens of Hollywood westerns. From this saturation-viewing emerged a 300-page treatment which was eventually distilled into the script, penned by Leone and Sergio Donati. There are conscious echoes of \"Shane\" and \"High Noon\" in the meticulously-plotted screenplay. Ennio Morricone apparently sat in on the planning stage and had composed the score in toto before shooting began, the reverese of the usual process of fitting music to existing footage. The result is a tight matching of soundtrack and visuals. Robards, Bronson and Cardinale each have musical 'signatures' which play whenever their characters are onscreen. Bronson's is an eerily-wailing harmonica, Robards has the plonking banjo and Cardinale the lush strings. So intricately was everything structured that the themes were available to be played on set, so that the actors could co-ordinate every nuance of gesture to fit with the score.The film is a grandiose lament to the death of the Wild West. Decay is everywhere to be seen. Streets, bars, buildings and people all have a beat-up, grungy look. When Cheyenne (Robards) pauses beside a rough-hewn wooden post, there is little difference in texture between his face and the post. Morton the cripple is killing the romantic West of open spaces with his \"snail trail\" of railroad tracks, leaving the fine adventurous men (Cheyenne and Harmonica) nowhere to go.There can be few opening scenes with the visual and aural brilliance of this one. Three bad guys stake out Flagstone's railroad depot in a High Noon pastiche. Jack Elam (who was actually in \"High Noon\") leads the villains. The only spoken words throughout this long (but totally gripping) scene are uttered by the old station clerk. Haunting rhythms raise the tension to an unbearable pitch ... the squeaking windmill, the chattering tickertape, the creaking bench. This wonderful crescendo climaxes with the appearance of Bronson, a sequence as stylised and choreographed as a Shinto ceremony, all the more effective for the absence of spontaneity.Equal to and counterbalancing this scene is the very next one, the introduction of Frank. This time it is \"Shane\" that gets the treatment as the McBain boy spots five men in yellow duster topcoats. A growing sense of unease on the McBain homestead is beautifully conveyed (was the stopping of a cicada chirp ever so effective?) A cinematic multiple orgasm ensues, with the musical theme crashing in as the boy sees the devastation, and the camera swoops round to reveal the baddie to be none other than Henry Fonda as Morricone's trademark solitary tubular bell peals out.Cheyenne's entrance is also a piece of impressive cinema. Inside Lionel Stander's strange labyrinthine tavern, quite unlike any saloon ever filmed before, the violence which hovers around Cheyenne like a dustcloud is heard but not seen, preparing us for his appearance in person. The sliding of the lamp towards Bronson works brilliantly, the film's two good men sharing the light of humour, the symbolic forging of a meaningful friendship.By a slow accretion, the plot reveals itself. The leviathan of the railroad must be stopped, and there must be a reckoning with Frank. Gradually the fates of the main characters converge, and swim into sharp focus for the shoot-out.It is not the story, excellent though that is, which lingers in the memory, but rather a hundred individual flashes of brilliance: Claudia Cardinale (are those eyes for real?) filmed on the bed, viewed vertically downward, through a lace canopy: Cheyenne's surprise method of concealing himself on the train: Morton (\"when you're not on that train, you're like a turtle out of its shell\") imprisoned by the armature that helps him walk: the 'heartbeat' of the train's engine during the cardgame: the tension of the ambush preparations against Frank: the eruption of guitar music as Bronson enters the frame: Bronson's stillness and self-possession, the emblem of his righteousness: Fonda's eyes flickering rapidly in his motionless head, denoting the waning of his self-confidence: the amazing super-close-ups of Bronson: and the weird brick arch, the only man-made intrusion into the entire terrain, and the focus of human depravity."
    },
    {
      "username": "daxsir",
      "userUrl": "https://www.imdb.com/user/ur65033527",
      "reviewLink": "https://www.imdb.com/review/rw3399832",
      "warningSpoilers": false,
      "date": "21 January 2016",
      "rate": "10",
      "helpful": "123 out of 135 found this helpful.",
      "title": "Art",
      "content": "This is my fav film. It is more like watching a piece of art. The look is fantastic. The director does a perfect job. The acting is wonderful. The story is not the strongest ever but it should be watched to experience it. If your a film lover you can't fail but admire this film.Charles Bronson is the perfect broody loner. Henry Fonda surprises everyone by giving a strong performance as a bad guy. The close up of his eyes is stunning. The camera work and close ups have never been done better. The music is as good as anything you will find in a movie. Throw in the scenes when you first see Henry Fonda. The scene at the railway station which the water dripping on the hat. The sound of the spinning water tower. To me the closet movie to ART i have ever seen and i have seen a lot of films."
    },
    {
      "username": "bobsgrock",
      "userUrl": "https://www.imdb.com/user/ur9972457",
      "reviewLink": "https://www.imdb.com/review/rw1967587",
      "warningSpoilers": false,
      "date": "29 October 2008",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Leone goes a new route with the same results.",
      "content": "With a style very much unlike that of his previous three Westerns, Once Upon a Time in the West takes a long time to tell this epic and powerful tale of three men all connected by their past and all destined to connect in the future. The acting is universally excellent with Fonda playing a very uncharacteristic part, but since he is such a great actor he has no problem filling the shoes of the merciless gunslinger, Frank. Jason Robards is great as the outlaw with a good heart, Cheyenne; and Charles Bronson is very Eastwood-like as a man known only as Harmonica with a mysterious past and a quick draw. The central character, though, is that of the beautiful Claudia Cardinale as Jill, a widow seeking revenge.Sergio Leone used a slower, more romantic style for this Western, but he still was able to produce some great images and a story that will forever be remembered. He doesn't deal too much with character development, rather showing us their actions and letting that speak for themselves. And, of course we cannot forget the score by Ennio Moriconne. Though not as memorable as The Good, Bad and the Ugly, it adds a great deal to the film. Certainly one of the best Westerns ever made, this is film making at a very high degree."
    },
    {
      "username": "Scott-8",
      "userUrl": "https://www.imdb.com/user/ur0012815",
      "reviewLink": "https://www.imdb.com/review/rw0106364",
      "warningSpoilers": true,
      "date": "10 April 1999",
      "rate": "",
      "helpful": "337 out of 438 found this helpful.",
      "title": "One of the best",
      "content": "There's two things that stand out to me always about this movie, and indeed about all of Sergio Leone's movies. One is his understanding of pacing events, and the other is using his actors/actresses to actually act. When you see Claudia Cardinale riding up to the ranch, all you see is her face, but you can tell instantly what she is looking at and everything she's feeling. You know Henry Fonda's the bad guy, but when he smiles faintly at the young boy, you feel there's something more to him, a personality and human qualities, even if he is evil. The final shoot-out itself is a masterpiece. The two protagonists say nothing, but as they face off the music lets you know the moment as come. As they stand ready the scene that's been hinted at throughout the movie plays out like a dream, revealing what the whole story was about. Then, without warning, they draw and fire. Just as in real life, it's over before you notice it. What today's movies lack is how quickly they cater to MTV video inspired nonstop action and endless clichés. The bad and good guy duke it it out, the violence is so extreme that no human could actually survive it, and always just when you think the bad guy is dead he gets back up for one last shot. How much I wish today's film makers would learn Leone's lesson about TIMING, and let suspense build rather than force it in. The music score, which had certain pieces and sections for various moods and to signify the main characters, is one of my favorites. Even if Clint Eastwood wasn't in it, Charles Bronson fills the role of the mysterious stranger and adds his own elements to the character. How I wish they still made movies like this"
    },
    {
      "username": "framptonhollis",
      "userUrl": "https://www.imdb.com/user/ur59554469",
      "reviewLink": "https://www.imdb.com/review/rw3337052",
      "warningSpoilers": false,
      "date": "17 October 2015",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "One of the Great Westerns",
      "content": "This film is one of the greats! It is an epic western from the acclaimed filmmaker Sergio Leone. This is the first film of his that I've been able to see from the filmmaker, and I've heard that his film \"The Good, the Bad, and the Ugly\" is even better! But, as of now, I've only seen \"Once Upon a Time in the West\".The film is a classic epic spaghetti western, with great atmosphere, great performances, and, of course, an excellent soundtrack by Ennio Morricone! All of this elements coming together create a beautiful, jaw-dropping, and powerful experience that has deserved all of the praise that it has received."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw3731319",
      "warningSpoilers": false,
      "date": "15 June 2017",
      "rate": "9",
      "helpful": "35 out of 48 found this helpful.",
      "title": "A bit slow n tedious but still one of the best western film. Fonda was terrific.",
      "content": "As a fan of Westerns, I saw this film many times in the early 90s. Saw this recently again on a DVD aft many years. The plot- Claudia Cardinale arrives at her ranch, to find that her husband has been murdered by hired gun Henry Fonda. Mysterious gunman Charles Bronson wants an appointment with Fonda. Bronson teams up with outlaw Jason Robards to help protect Cardinale n her ranch from Fondas evil intentions. There are long scenes where you get close shots of a person's face. Sergio Leone loves the stare-down, and you can see it in virtually all of his films. In this movie he allows the camera to linger longer than ever before. You get those quiet scoreless scenes where the natural sounds of the environment are greatly exaggerated. Leone's opponents take a long time to feel each other out before they act. One may find the long stretches of silence and inaction tedious n boring. Honestly, even i found some scenes boring, especially the opening scene. Henry Fonda is terrific. No one expected him to play such a ruthless and brutal killer. Bronson was decent but Jason Robards was much better with his tip on guys patting females bottom n the tip on don't get shot by a person who doesn't know to shoot. One of the best part bah the film was Ennio Morricone's score, especially the recurring harmonica music during the final closing fight. This is Morricone's best moment in a long, treasured career. I was surprised to know that the story was written by Dario Argento."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2366482",
      "warningSpoilers": false,
      "date": "9 January 2011",
      "rate": "10",
      "helpful": "25 out of 36 found this helpful.",
      "title": "One of the biggest and boldest westerns you will ever see",
      "content": "Although I have not seen all his films, I have yet to see a Sergio Leone film I hate. The movies I have seen of his are visually gorgeous with superb scores and interesting stories and characters. Once Upon a Time in the West is no exception. It is long and slow, but I think the film was deliberately paced like that.Once Upon a Time in the West does take a lot of risks, including improvising the action around the score's moods. This was a risk that paid off. The story is rich and compelling and the dialogue is thought provoking and beautifully written. Leone also proved what a fine director he was by directing so wonderfully on this film.The characters are great and quite complex, and are further advantaged by being wonderfully portrayed. There is the brutish gunfighter, the beautiful widow, the mysterious harmonica player and the sympathetic outlaw. Henry Fonda particularly does brilliantly in the role of Frank. The visuals once again are exquisite and quite grandiose in its scope and beauty, while Ennio Morricone's wonderfully operatic-like score fully justifies why he is considered one of the all-time great film composers.All in all, a big and bold western and one unlike any other. It also took risks, ones which could have gone horribly wrong but due to the evident work and care of all involved, they paid off. 10/10 Bethany Cox"
    },
    {
      "username": "raphaklopper",
      "userUrl": "https://www.imdb.com/user/ur37892465",
      "reviewLink": "https://www.imdb.com/review/rw2892954",
      "warningSpoilers": false,
      "date": "23 October 2013",
      "rate": "10",
      "helpful": "35 out of 44 found this helpful.",
      "title": "The Best Western ever made??? Not quite, but still is AMAZING!",
      "content": "After the great success of the masterpiece \"The Good, The Bad and The Ugly\" which perfectly finished the \"Dollars\" trilogy. Sergio Leone get bored with nothing to do, and decided to start another trilogy, the \"America\" trilogy with \"Once upon a time in the West\". That today is considered the best Western ever made in the history of cinema.\"Once upon a time in the West\" begins when the farmer Brett McBain (Frank Wolff) and his sons are murdered in cold blood by the hands of the ruthless bounty-killer Frank (Henry Fonda) who puts the blame on the criminal Cheyenne (Jason Robards). Frank was hired by the legged-rail baron Morton (Gabrielle Ferzetti) to just scare away McBain and his family of their land, because she would be much valued with the advancement of the railroad. But on the same day Jill (Claudia Cardinale) arrives in town, coming from New Orleans, and when she finds out of the crime she reveals that she married Brett McBain weeks before in New Orleans and therefore the land still had a owner. On the same day, Jill meets a mysterious man who is known for Harmonica (Charles Bronson) because he always carries with himself a harmonica, and offers itself as a protector of Jill. And when the criminal Cheyenne knows that he is being unfairly prosecuted, he decides to join forces with Harmonica to help Jill keep the lands of her deceased husband. But a web of mystery and deceit circulates between the contradictory relationship of the characters.When the film premiered at the time it was poorly received by critics and was a box office failure, only today that the critics and the public praised the film as not only the best Sergio Leone's movie, but also the best Western ever made. Well, not quite (in my opinion), but I understand why people praise him as such. The main complain of the critics to the film at the time, it was that the film was extreme slow. But this slowness is caused by some reasons.The first one is that the film was completely different from all the Western films ever made, even from the \"Dollars\" trilogy because Leone gives the film a dramatic tone. What Leone tries to show in the story is the end of the Old West, the title shows that perfectly. The original translation from Italian to English was \"Once upon a time THE West\", that is, the end of the Old West. And that originally came in the time of the advance of the railways, and the grand corruption and death that she brought to the population. Leone shows that giving the film an excellent script (written by him and Sergio Donati), which gives the film a superb narrative with beautiful dialogs between the characters, but like any Leone's film, it never loses his great sense of humor.The other reason is, as always. the magnificent direction of Leone, which once again shows advanced for its time. With its perfect close-ups on characters and enormous scenarios, making everything beautiful and epic. But there it comes the problem that prevents the film to even beat \"The Good, The Bad and The Ugly\". Leone was known for his quiet moments brilliantly filmed, and \"Once upon a time\" is full of them (but maybe too much). Without considering the first 10 minutes of the film (which is brilliant, putting us in the heat of the scene), but others seem to boring taking the power of narrative and our investment on them.Another problem with the film is the relevance of the characters. Not that they are not superb and memorable (which they are): Jill is nothing more nor less than the representation of the women in the world of men in the Old West and its extreme strength and intelligence, along with an excellent performance from Cardinale; Cheyenne can be compared with Tuco from \"The Good, The Bad and the Ugly\", both characters are cruel bandits, but in several times they are shown to be simple human beings with their problems and their kind and innocent side; Frank is another cruel-badass villain that Leone built in his films, Frank is a bounty-killer who in previous films its showed that they are honored to their \"job\", do whoever they were told and paid for and nothing more. But Frank in the film betrays its own principles, and gets into the corrupt world of the railways; Harmonica is almost the same character that Clint Eastwood was in previous Leone films. Mysterious, don't talk much, and never shows his true motives (only at the most epic and badass moment of the film). All characters are fantastic, but thanks to the silent moments of Leone, their relevance and relationship fails in several moments in the history.I don't agree that this is the best Western film ever made, but I understand why people consider it so. From a fabulous story that shows excellently the end of the era of legends with a flawless script, magnificent direction and unforgettable characters. All this makes \"Once upon a time\" not only one of the best Western films ever made, but a beautiful masterpiece of cinema and the beginning of another amazing trilogy! 10/10"
    },
    {
      "username": "mrmystery99",
      "userUrl": "https://www.imdb.com/user/ur53430082",
      "reviewLink": "https://www.imdb.com/review/rw4147528",
      "warningSpoilers": false,
      "date": "29 April 2018",
      "rate": "9",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Just. Amazing.",
      "content": "This one only gets better with each viewing. Leone's masterful storytelling and Morricone's crazy, beautiful, epic soundtrack; desperate, haunted faces that look like the barren landscapes the story is set in and a plot that unfolds with impeccable pacing to culminate in THE ultimate western finale. As in Leone's previous films, music isn't just used to add to the atmosphere but is essential to the story, or perhaps even more: Morricone's main musical theme plays the actual role of a (or rather: the) protagonist in the film. Anyone who thought that the so called \"Spaghetti Westerns\" were nothing but cheap, violent B-movies had to reconsider after seeing this film. It doesn't get any better than this: this is movie history; iconic, classic, unforgettable, epic - for this film, I just run out of words."
    },
    {
      "username": "ptsj-music",
      "userUrl": "https://www.imdb.com/user/ur58288791",
      "reviewLink": "https://www.imdb.com/review/rw3538312",
      "warningSpoilers": true,
      "date": "5 September 2016",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "A film any actor would just die to be in.",
      "content": "The opening scene in this masterpiece from Sergio Leone is alone worth the 10 points. I would add another 10 if I could. To think that the three main actors from another work by the great master, \"The Good And The Bad And The Ugly\", Clint Eastwood, Eddie Wallach and Lee Van Cleef, said NO to appear as the three bad guys in the film's beginning, is just hilarious. Any actor would die just to be in this film. But these three guys were all thinking to highly of themselves, and didn't consider such a \"small role\" to be a great honor. It's not hard to understand Leone's meta intention to ask the three heroes to appear like that, but perhaps we all should thank them for refusing, because how much more epic didn't Jack Elam, Woody Strode and Al Mulock become after acting in this famous scene. They are simply perfect for it. Even more incredible is that Mulock committed suicide with his costume still on, and this way actually died, if not for playing a part in the film. His reason will forever be untold. One person getting too little credit is Leone's co-screenwriter, another Sergio by the surname Donati, who together with Dario Argento and Bernardo Bertolucci really must have inspired Leone to get at top level. Every single actor in the film are at their top level too and make appearances so perfect that the audience forget that this is fiction. Personally I have seen it again and again only to see the beautiful and great acting Claudia Cardinale appear. But I believe Charles Bronson got the part mainly because he had the perfect looks and the most amazing eyes. Also, Bronson pretending to play the harmonica is THE ONLY just a little annoying thing about the film, even though the character's name is Harmonica. I am certain that the master behind the fantastic music score, Ennio Morricone, had little or no saying in this, the one place where music and picture don't fit together. There are so many to mention and give the very best credits. Tonino Delli Colli, director of photography, has caught the actor's faces, in particular Henry Fonda's and Charles Bronson's, but also the grand landscape and every important and non important detail in such an amazing way, it's totally stunning, and all the way. Nino Baragli is the master of editing. The total is so well composed that it just can't be made better. We can smell the air, taste the dust and feel every part of the setting. This is not Spaghetti Western, this is Italian epic film art at its very, very best!"
    },
    {
      "username": "bgkerfant-09664",
      "userUrl": "https://www.imdb.com/user/ur84827809",
      "reviewLink": "https://www.imdb.com/review/rw5142311",
      "warningSpoilers": false,
      "date": "25 September 2019",
      "rate": "10",
      "helpful": "74 out of 79 found this helpful.",
      "title": "A masterpiece",
      "content": "It's hard to believe this movie is from 1968. Very modern way of filming for the time. Sergio Leone gave time to each scene... something that new directors seem afraid to do... Great story about the last days of an era. Amazing music and the originality of linking a specific melody to each main character. And all these close-up to character's eyes... Just a wonderful movie."
    },
    {
      "username": "daniken",
      "userUrl": "https://www.imdb.com/user/ur1496036",
      "reviewLink": "https://www.imdb.com/review/rw0106454",
      "warningSpoilers": false,
      "date": "23 June 2002",
      "rate": "10",
      "helpful": "849 out of 1,034 found this helpful.",
      "title": "No western has ever come close to this one....and no western ever will.",
      "content": "I can't quite find the words to even come close to describing the pure brilliance of this movie. When this movie was made, the western genre was dominated by the big hollywood studios. The western was taken by these studios and transformed into an opportunity to portray classic superheroes like John Wayne and Burt Lancaster in their fight against all sorts of smalltime crooks and outlaws in smalltime stories and smalltime towns. It was a genuine effort to portray 'Americanism', the American Way, along with a romanticised view of the west as 'Frontier country' where good always triumphed over bad and where the life was hard but honest. It was the American Way.And then came this film. The title, 'Once Upon A Time In The West' must have seemed to mean nothing more than 'just another western' to the unexpecting viewers at the time. Oh boy were they wrong. With this movie, Sergio Leone singlehandedly redefined the western genre and no American western would ever match the brilliant spirit in which it was made. While the story is basically the same as in any other western, it is the WAY in which it is presented that so clearly distances this western from others. Whereas other westerns are simply stories that are designed to entertain, this movie is an emotional masterpiece that will move your heart. Sergio Leone takes the ordinary western and replaces words with looks, and conversations with feelings and emotions. With his brutal but honest portrayal of the sheer hardness of life and death in those times he thoroughly destroys the old romantic idea of the west as a 'generally-hunky-dory-kind-of-scene with the occasional bad guy and indian' and replaces it with an eerie, dark, hot and dry place where life is cheap and only the strongest will survive.I cannot adequately convey in words the way in which Sergio Leone deepens and defines the characters by pure means of visual persuasion. It starts with the three gunman in the beginning of the movie, waiting for some reason at a train station for someone or something that obviously is going to be on the next train. No explanation, no conversation; not a word is said. Even the stationmaster is ushered into captivity without a single audible threat. Then comes the waiting... Any other director would have skipped directly to the moment of arrival, but Sergio Leone takes minutes of boredom and translates it into a visual feast, deepening the characters that are portrayed and making them more human, more real to the viewer, while at the same time encompassing us with a deep dark sense of foreboding. This way in which the story is not just augmented but in times completely replaced by the sheer visual drama, is perfected by the absolute fantastic music, directed by Ennio Morricone. Who needs words and explanations when the combined forces of cinematic mastery and heart-tearing music are not just able to carry the story, but pick it up and push it up to such heights of excellence that it has no equal in it's genre?Another great feat that adds to the power of this movie is the minimalistic way of portrayal of the characters as real, emotional people. Not a single word is said that isn't required for the understanding of the story, yet the characters feel more true than those in movies where whole conversations are added merely to explain their motives. Instead of words, the camera focuses on the characters...so that you can simply read the emotion off their faces. Often no explanation is given other than than a mere facial expression. No superheroes or supercriminals, just real, desire-laden, traumatised, obsessed people that act upon motives inherently understood by the viewer.All in all this is without a single doubt in my mind the greatest western of all times, and even though Sergio Leone has made many more mindblowing, heart-shattering westerns like this one, like 'A Fistful of Dynamite', 'The Good The Bad and The Ugly', and 'For a Few Dollars More', none could equal 'Once Upon A Time In The West' in sheer magnitude of perfection. Western has never been the same since....I only wish I'd have been there in 1969 when the movie was new and see it, for the first time with fresh innocent eyes and an unexpecting mind..just like 2001: A Space Odyssey (also of 1969, a year of legends).A tip for those who have never seen this movie: Bribe, beg, borrow, or steal yourself into possession of a Videobeam and Hifi-audio equipment if you can't find a cinema that is showing this movie. Turn the audio up WAY HIGH (never mind the neighbors) and prepare never to be the same again.........I (obviously) gave this movie a 10 because no matter how hard I try I can't find anything less than perfect about it."
    },
    {
      "username": "RatedVforVinny",
      "userUrl": "https://www.imdb.com/user/ur16998042",
      "reviewLink": "https://www.imdb.com/review/rw5327838",
      "warningSpoilers": false,
      "date": "17 December 2019",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "The rest is Western history.",
      "content": "A true vision of the 'Wild West' frontier, from the Italian maestro Sergio Leone. All of his films apart from 'Duck, You Sucker!', are either perfect, or near perfect productions. I have a slight preference for the 'Dollars Trilogy' but this epic is simply magnificent. You just won't see a poor review to this one, as it's already a certified classic. Is highly ironic that 'A Fistful of Dollars' was so poorly received on its initial release but just four years later, the world had already bowed to the genius of both the director and especially Ennio Morricone (who scored the film, even before the first shot was filmed). A further masterstroke, was casting Henry Fonda, as the bad man and with a whole host of stars as the back up. Timeless in every aspect, coupled with some of the very finest gun-play."
    },
    {
      "username": "anaconda-40658",
      "userUrl": "https://www.imdb.com/user/ur60028700",
      "reviewLink": "https://www.imdb.com/review/rw3540963",
      "warningSpoilers": true,
      "date": "9 September 2016",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Once Upon a Time There Was Henry Fonda.",
      "content": "Once Upon A Time in the West (1968): Dir: Sergio Leone / Cast: Charles Bronson, Henry Fonda, Jason Robards, Claudia Cardinale, Gabriele Ferzetti: Epic western that refers to the passing of events that shape our future despite forgotten souls. Charles Bronson plays a nameless gunslinger who is identified by the harmonica that pierces the night. He seeks vengeance upon the ruthless Frank, played with calm cruel delivery by Henry Fonda. The setting is Flagstone and the place is Sweetwater, land where water exists for the steam locomotives. Gabriele Ferzetti plays a crippled tycoon who wants this land and sends Frank to scare off those living there. Instead Frank kills the owner and his children and pins the blame on bandit Cheyenne, played by Jason Robards. Claudia Cardinale plays the new owner. She is a prostitute and new wife of the deceased owner. Cardinale brings out her grit teeth anger and her willingness to face intimidation. At three hours director Sergio Leone, a veteran in the genre presents standoffs and numerous gun fights including one aboard a moving train. Bronson is silent and determined to right the past. Fonda dominates with careful progressive evil. Robards is the sinner seeking redemption. Ferzetti is disabled but deceitful and ruthless. Cardinale is the pretty flower growing in poisonous soil and she faces the west living within the tragedy left by greed. Score: 10 / Writing: 100% / Themes: 100% / Acting: 100% / Directing: 100% / Visual: 100%"
    },
    {
      "username": "chuck-hickl",
      "userUrl": "https://www.imdb.com/user/ur33658222",
      "reviewLink": "https://www.imdb.com/review/rw4625697",
      "warningSpoilers": false,
      "date": "4 February 2019",
      "rate": "9",
      "helpful": "61 out of 68 found this helpful.",
      "title": "When movies were art....",
      "content": "To watch this again after so many years and after so much has changed in movie making, what a joy. The intro scene itself is a work of cinematic genius. Too bad most these days don't have the patience or appreciation for the plot making and cinematography these days. If you appreciate excellent camera work, scene making and soundtrack working together, I can't imagine you would be disappointed in this movie."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3284039",
      "warningSpoilers": false,
      "date": "25 July 2015",
      "rate": "9",
      "helpful": "15 out of 22 found this helpful.",
      "title": "symphonic style",
      "content": "The man with a Harmonica (Charles Bronson) arrives at a desolate train station. He's met by three gunmen sent by Frank (Henry Fonda) and he promptly kills them. Jill (Claudia Cardinale) is a new young bride from New Orleans. She arrives to live with her husband Brett McBain and his family in an isolated desert homestead he calls Sweatwater. She finds the whole McBain family massacred. Cheyenne (Jason Robards) is the prime suspect but he joins her along with Harmonica to seek revenge on the real killers, Frank and his men who are working for the railroad.This is a western dripping with the Sergio Leone style. The story is simple. It's a lot of attitude. The movie starts with the great Harmonica arrival scene. Woody Strode and Jack Elam are so great that I wish they survived to stay in the movie. A minor problem is that the opening scene is so great that the rest of the movie struggles at times to return to that level."
    },
    {
      "username": "Sadako-Toyboy",
      "userUrl": "https://www.imdb.com/user/ur0395650",
      "reviewLink": "https://www.imdb.com/review/rw0106380",
      "warningSpoilers": false,
      "date": "26 July 1999",
      "rate": "",
      "helpful": "338 out of 433 found this helpful.",
      "title": "pure cinematic paradise",
      "content": "Thank god that I'm a Bronson fan. This was my first Leone movie, and dumb kid that I was, I actually watched it thinking I was in for a typical Bronson \"vehicle\"! Looking back I'm thankful, because if it wasn't for his involvement, I would never have discovered the beauty and majesty that is Once Upon a Time in the West.I absolutely love this movie. It's probably my all time favourite, certainly one of the few that I can watch OVER and OVER again without losing interest. I love the way Leone creates intrigue and mystery around what is a relatively thin plot. He can make even the smallest twist of fate seem like an epic turn of events, with that amazing sense of revelation that he generates out of old hackneyed situations (something Argento has since picked up). Leone proves in this film that he could seemingly take anyone, even peripheral characters, and give them screen charisma without using dialogue as a crutch.OUATITW features the most tense two man stand-offs ever, with some serious deja-vu in the direction of his \"Dollars\" trilogy. In fact, it does feel like those three movies were warm ups, practice sessions in the build up to OUATITW. Here though, he perfected everything; despite the long running time, it's all focused, and without a single irrelevant scene. For me, the two hours plus just fly by, I wish it would never end. Leone was without question at his artistic peak when he made this, that's not to say that he went downhill from then on, but I honestly don't think he ever did another film where everything came together so perfectly.The cast is flawless. Fonda eclipsed every good guy he ever did in one fell swoop, truly chilling. Robards is a great comic character, the lovable rogue with an edge. And Cardinale is more than just (incredible) window dressing; she switches between passionate, angry, delicate and sentimental at all the right moments.Which leaves the hero; I'm a huge Eastwood fan, but I honestly don't believe he could have done the role justice. His \"man with no name\" was a cool, sly character with hidden complexities. Eastwood always does these layered personalities, with some kind of mental baggage. Bronson, on the other hand, mostly does himself; simple, uncomplicated figures with only one state of mind, that's why he's put in so many revenge flicks. Plus, he looks like he's been seriously wronged at some point in his life, Eastwood doesn't have that quality. Bronson is the genuine hard-as-nails article. You can readily imagine that, had he been born decades earlier and been put in the same situation, he would resolve the problem in much the same way as his character in the movie (sometimes I affectionately refer to this movie as Deathwish part 0- could Harmonica be the great granddaddy of Paul Kersey?).Of course the other great contribution is the music. I still think that the main theme is one of the most breathtaking pieces of music I have ever heard. It affects me deeply whenever I hear it, regardless of the mood I'm in. Maybe I should listen to more opera or something, I don't know, but that's the way I feel. And the individual character themes are just so well integrated into the film, it's unbelievable. Leone replaces words with music, and it conveys so much more in return. Bronson just plays that melancholy tune on the harmonica instead of answering people back, it consistently cracks me up.High Noon, Naked Spur, Shane, The Searchers, etc. are all classics of the genre, but I really don't think it's possible to compare those \"traditional\" westerns with OUATITW. For me, it exists on a plane of it's own, it's the kind of film experience that you let wash over you, a waking dream. I recommend this movie to anyone, if you're on the right wavelength you'll be greatly rewarded."
    }
  ],
  "errorMessage": ""
}