{
  "imDbId": "tt0064116",
  "title": "Once Upon a Time in the West",
  "fullTitle": "Once Upon a Time in the West (1968)",
  "type": "Movie",
  "year": "1968",
  "language": "en",
  "titleInLanguage": "Once Upon a Time in the West",
  "url": "https://en.wikipedia.org/wiki/Once_Upon_a_Time_in_the_West",
  "plotShort": {
    "plainText": "Once Upon a Time in the West (Italian: C'era una volta il West, \"Once upon a time (there was) the West\") is a 1968 epic Spaghetti Western film directed by Sergio Leone, who co-wrote it with Sergio Donati based on a story by Dario Argento, Bernardo Bertolucci, and Leone. It stars Henry Fonda, cast against type as the villain, Charles Bronson as his nemesis, Jason Robards as a bandit, and Claudia Cardinale as a newly widowed homesteader. The widescreen cinematography was by Tonino Delli Colli, and the acclaimed film score was by Ennio Morricone.\r\nAfter directing The Good, the Bad and the Ugly, Leone decided to retire from Westerns and aimed to produce his film based on the novel The Hoods, which eventually became Once Upon a Time in America. However, Leone accepted an offer from Paramount Pictures providing Henry Fonda and a budget to produce another Western. He recruited Bertolucci and Argento to devise the plot of the film in 1966, researching other Western films in the process. After Clint Eastwood turned down an offer to play the movie's protagonist, Bronson was offered the role. During production, Leone recruited Donati to rewrite the script due to concerns over time limitations.\r\nThe original version by the director was 166 minutes when it was first released on 21 December 1968. This version was shown in European cinemas, and was a box-office success. For the US release on 28 May 1969, Once Upon a Time in the West was edited down to 145 minutes by Paramount and was a financial flop.\r\nThe film is the first installment in Leone's Once Upon a Time trilogy, followed by Duck, You Sucker! and Once Upon a Time in America, though the films do not share any characters in common.\r\nIn 2009, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". The film is regarded as one of the greatest westerns of all time and one of the greatest films of all time.",
    "html": "<p>Once Upon a Time in the West (Italian: C'era una volta il West, \"Once upon a time (there was) the West\") is a 1968 epic Spaghetti Western film directed by Sergio Leone, who co-wrote it with Sergio Donati based on a story by Dario Argento, Bernardo Bertolucci, and Leone. It stars Henry Fonda, cast against type as the villain, Charles Bronson as his nemesis, Jason Robards as a bandit, and Claudia Cardinale as a newly widowed homesteader. The widescreen cinematography was by Tonino Delli Colli, and the acclaimed film score was by Ennio Morricone.</p><p>After directing The Good, the Bad and the Ugly, Leone decided to retire from Westerns and aimed to produce his film based on the novel The Hoods, which eventually became Once Upon a Time in America. However, Leone accepted an offer from Paramount Pictures providing Henry Fonda and a budget to produce another Western. He recruited Bertolucci and Argento to devise the plot of the film in 1966, researching other Western films in the process. After Clint Eastwood turned down an offer to play the movie's protagonist, Bronson was offered the role. During production, Leone recruited Donati to rewrite the script due to concerns over time limitations.</p><p>The original version by the director was 166 minutes when it was first released on 21 December 1968. This version was shown in European cinemas, and was a box-office success. For the US release on 28 May 1969, Once Upon a Time in the West was edited down to 145 minutes by Paramount and was a financial flop.</p><p>The film is the first installment in Leone's Once Upon a Time trilogy, followed by Duck, You Sucker! and Once Upon a Time in America, though the films do not share any characters in common.</p><p>In 2009, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". The film is regarded as one of the greatest westerns of all time and one of the greatest films of all time.</p>"
  },
  "plotFull": {
    "plainText": "Once Upon a Time in the West (Italian: C'era una volta il West, \"Once upon a time (there was) the West\") is a 1968 epic Spaghetti Western film directed by Sergio Leone, who co-wrote it with Sergio Donati based on a story by Dario Argento, Bernardo Bertolucci, and Leone. It stars Henry Fonda, cast against type as the villain, Charles Bronson as his nemesis, Jason Robards as a bandit, and Claudia Cardinale as a newly widowed homesteader. The widescreen cinematography was by Tonino Delli Colli, and the acclaimed film score was by Ennio Morricone.\r\nAfter directing The Good, the Bad and the Ugly, Leone decided to retire from Westerns and aimed to produce his film based on the novel The Hoods, which eventually became Once Upon a Time in America. However, Leone accepted an offer from Paramount Pictures providing Henry Fonda and a budget to produce another Western. He recruited Bertolucci and Argento to devise the plot of the film in 1966, researching other Western films in the process. After Clint Eastwood turned down an offer to play the movie's protagonist, Bronson was offered the role. During production, Leone recruited Donati to rewrite the script due to concerns over time limitations.\r\nThe original version by the director was 166 minutes when it was first released on 21 December 1968. This version was shown in European cinemas, and was a box-office success. For the US release on 28 May 1969, Once Upon a Time in the West was edited down to 145 minutes by Paramount and was a financial flop.\r\nThe film is the first installment in Leone's Once Upon a Time trilogy, followed by Duck, You Sucker! and Once Upon a Time in America, though the films do not share any characters in common.\r\nIn 2009, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". The film is regarded as one of the greatest westerns of all time and one of the greatest films of all time.\r\nPlot\r\nA train arrives at the Old West town of \"Flagstone\". A man with a harmonica alights and plays the instrument as he faces three gunfighters who are waiting for him. Their leader, an outlaw called Frank, is not there and \"Harmonica\" opens fire, killing all three. Frank is working as a hired gunman for the railroad tycoon, Morton, who is trying to acquire land owned by Brett McBain's family.\r\nThe dusters worn by the three outlaws lead Harmonica to believe they were members of a different gang led by Cheyenne, another outlaw. Meanwhile, Frank and his henchmen kill McBain and his three children at their \"Sweetwater\" ranch and leave behind evidence to frame Cheyenne for the murders.\r\nA woman named Jill arrives in Flagstone, supposedly to marry McBain at Sweetwater. In fact, she is a former New Orleans prostitute who married McBain a month earlier, so she is the sole heir to Sweetwater. As it will emerge, McBain knew the railroad would pass through Sweetwater one day and planned to build a watering station there, subject to a reverter that he will forfeit Sweetwater if the station is not built by the time the railroad reaches it. Morton only told Frank to intimidate McBain, and the murder has put them at odds. Morton wants to make a deal with Jill, but Frank wants the land for himself.\r\nCheyenne denies that it was his men who ambushed Harmonica and murdered the McBains. Harmonica saves Jill from two of Frank's men and spies out the railway carriage to which Morton is confined on crutches, owing to his spinal tuberculosis. Harmonica discovers the connection between Frank and Morton but is seen and captured. When Frank asks for Harmonica's name, he replies with names of men that Frank has killed in the past. Frank is called away and Cheyenne rescues Harmonica. The two collaborate to help Jill save Sweetwater, using stockpiled materials to start building a station.\r\nAfter a threatening sexual encounter with Frank, Jill is forced to auction the land while Frank's henchmen intimidate the bidders in order to keep the purchase price low. Suddenly, Harmonica appears with Cheyenne in tow and bids $5,000, which is the price on Cheyenne's head as a wanted fugitive, and gets the property himself. Meanwhile, Morton has bribed Frank's own men to kill him, but Harmonica intervenes to save Frank from being ambushed in the street. When Jill condemns Harmonica for saving Frank's life, he replies: \"I didn't let them (Frank's men) kill him and that's not the same thing\".\r\nCheyenne soon escapes custody and he and his gang engage Frank's remaining men in a gunfight on Morton's train. Except for Cheyenne, who heads to Sweetwater, everyone is killed, including Morton. When Frank sees the aftermath of the fight, he rides to Sweetwater too, where he finds Harmonica waiting. Cheyenne has arrived earlier, but he remains in the ranch house with Jill. Outside, Harmonica and Frank engage in a showdown; through a flashback, it is revealed that Frank had hanged Harmonica's older brother, forcing the younger brother to support him on his shoulders. Just before the panting boy collapsed under the weight, Frank had forced a harmonica into his mouth, telling him to \"keep your lovin' brother happy\".\r\nHarmonica beats Frank to the draw. As he lies dying, Frank again asks Harmonica's identity and Harmonica places the instrument in Frank's mouth. Frank remembers, nods his head, and dies.\r\nJill hopes Harmonica will stay with her but, as Cheyenne has already told her, that won't happen. Jill asks Harmonica to come back and he says: \"Some day\". Harmonica and Cheyenne leave Sweetwater together, but Cheyenne collapses and dies from a gut wound he received in the gunfight with Morton. As Harmonica departs carrying Cheyenne's body on a horse, Jill serves water to the railroad workers arriving at the new station.\r\nCast\r\nClaudia Cardinale as Jill McBain\r\nHenry Fonda as Frank\r\nJason Robards as Manuel \"Cheyenne\" Gutiérrez\r\nCharles Bronson as \"Harmonica\"\r\nGabriele Ferzetti as Mr. Morton\r\nPaolo Stoppa as Sam, the Coachman\r\nMarco Zuanelli as Wobbles\r\nKeenan Wynn as the Sheriff of Flagstone\r\nFrank Wolff as Brett McBain\r\nLionel Stander as the barman\r\nWoody Strode as Stony, first gunman\r\nJack Elam as Snaky, second gunman\r\nAl Mulock as Knuckles, third gunman\r\nEnzo Santaniello as Timmy McBain\r\nSimonetta Santaniello as Maureen McBain\r\nStefano Imparato as Patrick McBain\r\nBenito Stefanelli as Frank's Lieutenant\r\nAldo Sambrell as Cheyenne's Lieutenant\r\nProduction\r\nOrigins\r\nAfter making his American Civil War epic The Good, the Bad and the Ugly, Leone had intended to make no more Westerns, believing he had said all he wanted to say. He had come across the novel The Hoods by the pseudonymous \"Harry Grey\", a fictionalized book based on the author's own experiences as a Jewish hood during Prohibition, and planned to adapt it into a film (17 years later, it would become his final film, Once Upon a Time in America). Leone, though, was offered only Westerns by the Hollywood studios. United Artists (which had produced the Dollars Trilogy) offered him the opportunity to make a film starring Charlton Heston, Kirk Douglas, and Rock Hudson, but Leone refused. When Paramount offered Leone a generous budget along with access to Henry Fonda—his favorite actor, and one with whom he had wanted to work for virtually all of his career—Leone accepted the offer.\r\nLeone commissioned Bernardo Bertolucci and Dario Argento to help him devise a film treatment in late 1966. The men spent much of the following year watching and discussing numerous classic Westerns, such as High Noon, The Iron Horse, The Comancheros, and The Searchers at Leone's house, and constructed a story made up almost entirely of \"references\" to American Westerns.\r\nBeginning with The Good, the Bad and the Ugly, which originally ran for three hours, Leone's films had usually been cut (often quite considerably) for box-office release. Leone was very conscious of the length of Once Upon a Time in the West during filming, and subsequently commissioned Sergio Donati, who had worked on several of Leone's other films, to help him refine the screenplay, largely to curb the length of the film toward the end of production. Many of the film's most memorable lines of dialogue came from Donati, or from the film's English dialogue adapter, expatriate American actor Mickey Knox.\r\nStyle and pacing\r\nFor Once Upon a Time in the West, Leone changed his approach over his earlier Westerns. Whereas the \"Dollars\" films were quirky and up-tempo, a celebratory yet tongue-in-cheek parody of the icons of the Wild West, this film is much slower in pace and somber in theme. Leone's distinctive style, which is very different from, but very much influenced by, Akira Kurosawa's Sanshiro Sugata (1943), is still present, but has been modified for the beginning of Leone's second trilogy, the so-called Once Upon a Time trilogy. The characters in this film are also beginning to change markedly over their predecessors in the Dollars trilogy. They are not quite as defined and, unusual for Leone characters up to this point, they begin to change (or at least attempt to) over the course of the story. This signals the start of the second phase of Leone's style, which was further developed in Duck, You Sucker! and Once Upon a Time in America.\r\nThe film features long, slow scenes with very little dialogue and little happening, broken by brief and sudden violence. Leone was far more interested in the rituals preceding violence than in the violence itself. The tone of the film is consistent with the arid semidesert in which the story unfolds, and imbues it with a feeling of realism that contrasts with the elaborately choreographed gunplay.\r\nLeone liked to tell the story of a cinema in Paris where the film ran uninterrupted for two years. When he visited this theater, he was surrounded by fans who wanted his autograph, as well as the projectionist, who was less than enthusiastic. Leone claimed the projectionist told him, \"I kill you! The same movie over and over again for two years! And it's so SLOW!\"\r\nLocations\r\nInteriors for the film were shot in Cinecittà studios, Rome. The opening sequence with the three gunmen meeting the train was one of the sequences filmed in Spain. Shooting for scenes at Cattle Corner Station, as the location was called in the story, was scheduled for four days and was filmed at the \"ghost\" railway station in the municipality of La Calahorra, near Guadix, in the Province of Granada, Spain, as were the scenes of Flagstone. Shooting for the scenes in the middle of the railway were filmed along the Guadix–Hernán-Valle railway line. Scenes at the Sweetwater Ranch were filmed in the Tabernas Desert, Spain; the ranch is still located at what is now called Western Leone. The brick arch, where Bronson's character flashes back to his youth and the original lynching incident, was built near a small airport 15 miles north of Monument Valley, in Utah, and two miles from U.S. Route 163 (which links Gouldings Lodge and Mexican Hat). Monument Valley itself is used extensively for the route Jill travels towards her new family in Sweetwater.\r\nCasting\r\nFonda did not accept Leone's first offer to play Frank, so Leone flew to New York to convince him, telling him: \"Picture this: the camera shows a gunman from the waist down pulling his gun and shooting a running child. The camera tilts up to the gunman's face and… it's Henry Fonda\". After meeting with Leone, Fonda called his friend Eli Wallach, who had co-starred in The Good, the Bad and the Ugly. Wallach advised Fonda to do the film, telling him \"You will have the time of your life\".\r\nWhen he accepted the role, Fonda came to the set with brown contact lenses and facial hair. Fonda felt having dark eyes and facial hair would blend well with his character's evil, and also help the audience to accept this \"new\" Fonda as the bad guy, but Leone immediately told him to remove the contacts and facial hair. Leone felt that Fonda's blue eyes best reflected the cold, icy nature of the killer.\r\nFollowing the film's completion, Once Upon a Time in the West was dubbed into several languages, including Italian, French, German, Spanish, and English. For the English dub, the voices of many of the American cast, including Fonda, Bronson, Robards, Wynn, Wolff, and Lionel Stander, were used. However, the rest of the cast had to be dubbed by other actors – including Claudia Cardinale, who was dubbed by actress Joyce Gordon, Gabriele Ferzetti, who was voiced by Gordon's husband, Bernard Grant, and Jack Elam.\r\nMusic\r\nThe music was written by composer Ennio Morricone, Leone's regular collaborator, who wrote the score under Leone's direction before filming began. As in The Good, the Bad and the Ugly, the haunting music contributes to the film's grandeur and, like the music for The Good, the Bad and the Ugly, is considered one of Morricone's greatest compositions.\r\nThe film features leitmotifs that relate to each of the main characters (with their own theme music), as well as to the spirit of the American West. Especially compelling are the wordless vocals by Italian singer Edda Dell'Orso during the theme music for Jill McBain. Leone's desire was to have the music available and played during filming. Leone had Morricone compose the score before shooting started and played the music in the background for the actors on set.\r\nExcept for about a minute of the \"Judgment\" motif, before Harmonica kills the three outlaws, no soundtrack music is played until the end of the second scene, when Fonda makes his first entry. During the beginning of the film, Leone instead uses a number of natural sounds, for instance, a turning wheel in the wind, sound of a train, grasshoppers, shotguns while hunting, wings of pigeons, etc., in addition to the diegetic sound of the harmonica.\r\nRelease\r\nEuropean release\r\nThe film was a massive hit in France, and was easily the most successful film released there in 1969, with 14.8 million admissions, ranking seventh of all time. It sparked a brief fashion trend for duster coats, which took such proportions that Parisian department stores such as Au Printemps had to affix signs on escalators warning patrons to keep their \"maxis\", as they were called, clear from the edges of moving steps to prevent jamming.\r\nIt was also the most popular film in Germany with admissions of 13 million, ranking third of all time.\r\nAmerican release\r\nIn the US, Paramount edited the film to about 145 minutes for the wide release, but the film underperformed at the box office, earning $2.1M in rentals in North America.\r\nThese scenes were cut for the American release:\r\nThe entire scene at Lionel Stander's trading post. Cheyenne (Robards) was not introduced in the American release until his arrival at the McBain ranch later in the film. Stander remained in the credits, though he did not appear in this version at all.\r\nThe scene in which Morton and Frank discuss what to do with Jill at the Navajo Cliffs.\r\nMorton's death scene was reduced considerably.\r\nCheyenne's death scene was completely excised.\r\nOtherwise, one scene was slightly longer in the US version than in the international film release: Following the opening duel (where all four gunmen fire and fall), Charles Bronson's character stands up again, showing that he had only been shot in the arm. This part of the scene had been originally cut by director Sergio Leone for the worldwide theatrical release. It was added again for the U.S. market, because the American distributors feared American viewers would not understand the story otherwise, especially since Harmonica's arm wound is originally shown for the first time in the scene at the trading post, which was cut for the shorter U.S. version.\r\nThe English-language version was restored to around 165 minutes for a re-release in 1984, and for its video release the following year.\r\nDirector's cut\r\nIn Italy, a 175-minute director's cut features a yellow tint filter, and several scenes were augmented with additional material. This director's cut was available on home video until the early 2000s, and still airs on TV, but more recent home-video releases have used the international cut.\r\nHome media\r\nAfter years of public requests, Paramount released a two-disc \"Special Collector's Edition\" of Once Upon a Time in the West on 18 November 2003, with a running time of 165 minutes (158 minutes in some regions). This release is the color 2.35:1 aspect ratio version in anamorphic widescreen, closed captioned, and Dolby. Commentary is also provided by film experts and historians, including John Carpenter, John Milius, Alex Cox, film historian and Leone biographer Sir Christopher Frayling, Dr. Sheldon Hall, and actors Claudia Cardinale and Gabriele Ferzetti, and director Bernardo Bertolucci, a co-writer of the film.\r\nThe second disc has special features, including three recent documentaries on several aspects of the film:\r\nAn Opera of Violence\r\nThe Wages of Sin\r\nSomething to Do with Death\r\nThe film was released on Blu-ray on 31 May 2011.\r\nRestored version\r\nA restored 4K version was published by Cineteca Bologna in 2018, with improved colors and image quality.\r\nReception\r\nBox office\r\nIn Italy, the film sold 8,870,732 tickets. In the United States, it grossed $5,321,508, from 3.7 million ticket sales. It sold a further 14,873,804 admissions in France and 13,018,414 admissions in Germany, for a total of 40,462,950 tickets sold worldwide.\r\nCritical response\r\nOnce Upon a Time in the West was reviewed in 1969 in the Chicago Sun-Times by Roger Ebert, who gave it two and a half stars out of four. He found the film \"good fun\" and \"a painstaking distillation\" of Leone's famous style, with intriguing performances by actors cast against their type and a richness of detail projecting \"a sense of life of the West\" made possible by Paramount's larger budget for this Leone film. Ebert complained, however, of the film's length and convoluted plot, which he said only becomes clear by the second hour. While viewing Cardinale as a good casting choice, he said she lacked the \"blood-and-thunder abandon\" of her performance in Cartouche (1962), blaming Leone for directing her \"too passively\".\r\nIn subsequent years, the film developed a greater standing among critics, as well as a cult following. Directors such as Martin Scorsese, George Lucas, Quentin Tarantino, and Vince Gilligan have cited the film as an influence on their work. It has also appeared on prominent all-time critics lists, including Time's 100 greatest films of the 20th century and Empire's 500 greatest movies of all time, where it was the list's highest-ranking Western at number 14. Popular culture scholar Christopher Frayling regarded it as \"one of the greatest films ever made\".\r\nReview aggregation website Rotten Tomatoes reports a 95% approval rating based on 66 reviews, with an average score of 9.20/10. The critical consensus reads: \"A landmark Sergio Leone spaghetti Western masterpiece featuring a classic Morricone score\". Metacritic gives the film a weighted average score of 82 out of 100 based on reviews from 9 critics, indicating \"universal acclaim\".\r\nAccolades\r\nTime named Once Upon a Time in the West as one of the 100 greatest films of all time.\r\nIn They Shoot Pictures, Don't They's list of the 1000 Greatest Films, Once Upon a Time in the West is placed at number 62.\r\nTotal Film placed Once Upon a Time in the West in their special edition issue of the 100 Greatest Movies.\r\nIn 2008, Empire held a poll of \"the 500 Greatest Movies of All Time\", taking votes from 10,000 readers, 150 filmmakers, and 50 film critics. \"Once Upon a Time in the West\" was voted in at number 14, the highest Western on the list. In 2017, it was then ranked at number 52 on Empire's poll for \"The 100 Greatest Movies\" (the second-highest Western on the list).\r\nIn 2009, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically significant\".\r\nIn 2010, The Guardian ranked it third in its \"The 25 Best Action and War Films of All Time\" list; and in 2013 the paper ranked it first in its \"Top 10 Movie Westerns\" list.\r\nIn the 2012 Sight & Sound polls, it was ranked the 78th-greatest film ever made in the critics' poll and 44th in the directors' poll.\r\nIn 2014, Time Out polled several film critics, directors, actors, and stunt actors to list their top action films. Once Upon A Time In The West placed 30th on their list.\r\nYear-end lists\r\nThe film is recognized by American Film Institute in these lists:\r\n2003: AFI's 100 Years...100 Heroes & Villains: Frank – Nominated Villain\r\nFrank – Nominated Villain\r\n2005: AFI's 100 Years of Film Scores – Nominated\r\nFilm references\r\nLeone's intent was to take the stock conventions of the American Westerns of John Ford, Howard Hawks, and others, and rework them in an ironic fashion, essentially reversing their intended meaning in their original sources to create a darker connotation. The most obvious example of this is the casting of veteran film good guy Henry Fonda as the villainous Frank, but many other, more subtle reversals occur throughout the film. According to film critic and historian Christopher Frayling, the film quotes from as many as 30 classic American Westerns.\r\nThe major films referenced include:\r\nThe Comancheros (1961): The names \"McBain\" and \"Sweetwater\" may come from this film. Contrary to popular belief, the name of the town \"Sweetwater\" was not taken from Victor Sjöström's silent epic drama The Wind. Bernardo Bertolucci has stated that he looked at a map of the Southwestern United States, found the name of the town in Arizona, and decided to incorporate it into the film. However, both \"Sweetwater\" and a character named \"McBain\" appeared in The Comancheros, which Leone admired.\r\nJohnny Guitar (1954): Jill and Vienna have similar backstories (both are former prostitutes who become saloonkeepers), and both own land where a train station will be built because of access to water. Also, Harmonica, like Sterling Hayden's title character, is a mysterious, gunslinging outsider known by his musical nickname. Some of West's central plot (Western settlers vs. the railroad company) may be recycled from Nicholas Ray's film.\r\nThe Iron Horse (1924): West may contain several subtle references to this film, including a low-angle shot of a shrieking train rushing towards the screen in the opening scene, and the shot of the train pulling into the Sweetwater station at the end.\r\nShane (1953): The massacre scene in West features young Timmy McBain out hunting with his father, just as Joey does in this movie. The funeral of the McBains is borrowed almost shot-for-shot from Shane.\r\nThe Searchers (1956): Leone admitted that the rustling bushes, the silencing of insect sounds, and the fluttering grouse that suggests menace is approaching the farmhouse when the McBain family is massacred were all taken from The Searchers. The ending of the film—where Western nomads Harmonica and Cheyenne move on rather than join modern society—also echoes the famous ending of Ford's film.\r\nWinchester '73 (1950): The scenes in West at the trading post are claimed to be based on those in Winchester '73, but the resemblance is slight.\r\nThe Man Who Shot Liberty Valance (1962): The dusters (long coats) worn by Cheyenne and his gang (and by Frank and his men while impersonating them) resemble those worn by Liberty Valance (Lee Marvin) and his henchmen when they are introduced in this film. In addition, the auction scene in West was intended to recall the election scene in Liberty Valance.\r\nThe Last Sunset (1961): The final duel between Frank and Harmonica is shot almost identically to the duel between Kirk Douglas and Rock Hudson in this film.\r\nDuel in the Sun (1946): The character of Morton, the crippled railroad baron in West, was based on the character played by Lionel Barrymore in this film.",
    "html": "<p>Once Upon a Time in the West (Italian: C'era una volta il West, \"Once upon a time (there was) the West\") is a 1968 epic Spaghetti Western film directed by Sergio Leone, who co-wrote it with Sergio Donati based on a story by Dario Argento, Bernardo Bertolucci, and Leone. It stars Henry Fonda, cast against type as the villain, Charles Bronson as his nemesis, Jason Robards as a bandit, and Claudia Cardinale as a newly widowed homesteader. The widescreen cinematography was by Tonino Delli Colli, and the acclaimed film score was by Ennio Morricone.</p><p>After directing The Good, the Bad and the Ugly, Leone decided to retire from Westerns and aimed to produce his film based on the novel The Hoods, which eventually became Once Upon a Time in America. However, Leone accepted an offer from Paramount Pictures providing Henry Fonda and a budget to produce another Western. He recruited Bertolucci and Argento to devise the plot of the film in 1966, researching other Western films in the process. After Clint Eastwood turned down an offer to play the movie's protagonist, Bronson was offered the role. During production, Leone recruited Donati to rewrite the script due to concerns over time limitations.</p><p>The original version by the director was 166 minutes when it was first released on 21 December 1968. This version was shown in European cinemas, and was a box-office success. For the US release on 28 May 1969, Once Upon a Time in the West was edited down to 145 minutes by Paramount and was a financial flop.</p><p>The film is the first installment in Leone's Once Upon a Time trilogy, followed by Duck, You Sucker! and Once Upon a Time in America, though the films do not share any characters in common.</p><p>In 2009, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". The film is regarded as one of the greatest westerns of all time and one of the greatest films of all time.</p><br/><h3>Plot</h3><p>A train arrives at the Old West town of \"Flagstone\". A man with a harmonica alights and plays the instrument as he faces three gunfighters who are waiting for him. Their leader, an outlaw called Frank, is not there and \"Harmonica\" opens fire, killing all three. Frank is working as a hired gunman for the railroad tycoon, Morton, who is trying to acquire land owned by Brett McBain's family.</p><p>The dusters worn by the three outlaws lead Harmonica to believe they were members of a different gang led by Cheyenne, another outlaw. Meanwhile, Frank and his henchmen kill McBain and his three children at their \"Sweetwater\" ranch and leave behind evidence to frame Cheyenne for the murders.</p><p>A woman named Jill arrives in Flagstone, supposedly to marry McBain at Sweetwater. In fact, she is a former New Orleans prostitute who married McBain a month earlier, so she is the sole heir to Sweetwater. As it will emerge, McBain knew the railroad would pass through Sweetwater one day and planned to build a watering station there, subject to a reverter that he will forfeit Sweetwater if the station is not built by the time the railroad reaches it. Morton only told Frank to intimidate McBain, and the murder has put them at odds. Morton wants to make a deal with Jill, but Frank wants the land for himself.</p><p>Cheyenne denies that it was his men who ambushed Harmonica and murdered the McBains. Harmonica saves Jill from two of Frank's men and spies out the railway carriage to which Morton is confined on crutches, owing to his spinal tuberculosis. Harmonica discovers the connection between Frank and Morton but is seen and captured. When Frank asks for Harmonica's name, he replies with names of men that Frank has killed in the past. Frank is called away and Cheyenne rescues Harmonica. The two collaborate to help Jill save Sweetwater, using stockpiled materials to start building a station.</p><p>After a threatening sexual encounter with Frank, Jill is forced to auction the land while Frank's henchmen intimidate the bidders in order to keep the purchase price low. Suddenly, Harmonica appears with Cheyenne in tow and bids $5,000, which is the price on Cheyenne's head as a wanted fugitive, and gets the property himself. Meanwhile, Morton has bribed Frank's own men to kill him, but Harmonica intervenes to save Frank from being ambushed in the street. When Jill condemns Harmonica for saving Frank's life, he replies: \"I didn't let them (Frank's men) kill him and that's not the same thing\".</p><p>Cheyenne soon escapes custody and he and his gang engage Frank's remaining men in a gunfight on Morton's train. Except for Cheyenne, who heads to Sweetwater, everyone is killed, including Morton. When Frank sees the aftermath of the fight, he rides to Sweetwater too, where he finds Harmonica waiting. Cheyenne has arrived earlier, but he remains in the ranch house with Jill. Outside, Harmonica and Frank engage in a showdown; through a flashback, it is revealed that Frank had hanged Harmonica's older brother, forcing the younger brother to support him on his shoulders. Just before the panting boy collapsed under the weight, Frank had forced a harmonica into his mouth, telling him to \"keep your lovin' brother happy\".</p><p>Harmonica beats Frank to the draw. As he lies dying, Frank again asks Harmonica's identity and Harmonica places the instrument in Frank's mouth. Frank remembers, nods his head, and dies.</p><p>Jill hopes Harmonica will stay with her but, as Cheyenne has already told her, that won't happen. Jill asks Harmonica to come back and he says: \"Some day\". Harmonica and Cheyenne leave Sweetwater together, but Cheyenne collapses and dies from a gut wound he received in the gunfight with Morton. As Harmonica departs carrying Cheyenne's body on a horse, Jill serves water to the railroad workers arriving at the new station.</p><br/><h3>Cast</h3><ul><li>Claudia Cardinale as Jill McBain</li><li>Henry Fonda as Frank</li><li>Jason Robards as Manuel \"Cheyenne\" Gutiérrez</li><li>Charles Bronson as \"Harmonica\"</li><li>Gabriele Ferzetti as Mr. Morton</li><li>Paolo Stoppa as Sam, the Coachman</li><li>Marco Zuanelli as Wobbles</li><li>Keenan Wynn as the Sheriff of Flagstone</li><li>Frank Wolff as Brett McBain</li><li>Lionel Stander as the barman</li><li>Woody Strode as Stony, first gunman</li><li>Jack Elam as Snaky, second gunman</li><li>Al Mulock as Knuckles, third gunman</li><li>Enzo Santaniello as Timmy McBain</li><li>Simonetta Santaniello as Maureen McBain</li><li>Stefano Imparato as Patrick McBain</li><li>Benito Stefanelli as Frank's Lieutenant</li><li>Aldo Sambrell as Cheyenne's Lieutenant</li></ul><br/><h3>Production</h3><h4>Origins</h4><p>After making his American Civil War epic The Good, the Bad and the Ugly, Leone had intended to make no more Westerns, believing he had said all he wanted to say. He had come across the novel The Hoods by the pseudonymous \"Harry Grey\", a fictionalized book based on the author's own experiences as a Jewish hood during Prohibition, and planned to adapt it into a film (17 years later, it would become his final film, Once Upon a Time in America). Leone, though, was offered only Westerns by the Hollywood studios. United Artists (which had produced the Dollars Trilogy) offered him the opportunity to make a film starring Charlton Heston, Kirk Douglas, and Rock Hudson, but Leone refused. When Paramount offered Leone a generous budget along with access to Henry Fonda—his favorite actor, and one with whom he had wanted to work for virtually all of his career—Leone accepted the offer.</p><p>Leone commissioned Bernardo Bertolucci and Dario Argento to help him devise a film treatment in late 1966. The men spent much of the following year watching and discussing numerous classic Westerns, such as High Noon, The Iron Horse, The Comancheros, and The Searchers at Leone's house, and constructed a story made up almost entirely of \"references\" to American Westerns.</p><p>Beginning with The Good, the Bad and the Ugly, which originally ran for three hours, Leone's films had usually been cut (often quite considerably) for box-office release. Leone was very conscious of the length of Once Upon a Time in the West during filming, and subsequently commissioned Sergio Donati, who had worked on several of Leone's other films, to help him refine the screenplay, largely to curb the length of the film toward the end of production. Many of the film's most memorable lines of dialogue came from Donati, or from the film's English dialogue adapter, expatriate American actor Mickey Knox.</p><h4>Style and pacing</h4><p>For Once Upon a Time in the West, Leone changed his approach over his earlier Westerns. Whereas the \"Dollars\" films were quirky and up-tempo, a celebratory yet tongue-in-cheek parody of the icons of the Wild West, this film is much slower in pace and somber in theme. Leone's distinctive style, which is very different from, but very much influenced by, Akira Kurosawa's Sanshiro Sugata (1943), is still present, but has been modified for the beginning of Leone's second trilogy, the so-called Once Upon a Time trilogy. The characters in this film are also beginning to change markedly over their predecessors in the Dollars trilogy. They are not quite as defined and, unusual for Leone characters up to this point, they begin to change (or at least attempt to) over the course of the story. This signals the start of the second phase of Leone's style, which was further developed in Duck, You Sucker! and Once Upon a Time in America.</p><p>The film features long, slow scenes with very little dialogue and little happening, broken by brief and sudden violence. Leone was far more interested in the rituals preceding violence than in the violence itself. The tone of the film is consistent with the arid semidesert in which the story unfolds, and imbues it with a feeling of realism that contrasts with the elaborately choreographed gunplay.</p><p>Leone liked to tell the story of a cinema in Paris where the film ran uninterrupted for two years. When he visited this theater, he was surrounded by fans who wanted his autograph, as well as the projectionist, who was less than enthusiastic. Leone claimed the projectionist told him, \"I kill you! The same movie over and over again for two years! And it's so SLOW!\"</p><h4>Locations</h4><p>Interiors for the film were shot in Cinecittà studios, Rome. The opening sequence with the three gunmen meeting the train was one of the sequences filmed in Spain. Shooting for scenes at Cattle Corner Station, as the location was called in the story, was scheduled for four days and was filmed at the \"ghost\" railway station in the municipality of La Calahorra, near Guadix, in the Province of Granada, Spain, as were the scenes of Flagstone. Shooting for the scenes in the middle of the railway were filmed along the Guadix–Hernán-Valle railway line. Scenes at the Sweetwater Ranch were filmed in the Tabernas Desert, Spain; the ranch is still located at what is now called Western Leone. The brick arch, where Bronson's character flashes back to his youth and the original lynching incident, was built near a small airport 15 miles north of Monument Valley, in Utah, and two miles from U.S. Route 163 (which links Gouldings Lodge and Mexican Hat). Monument Valley itself is used extensively for the route Jill travels towards her new family in Sweetwater.</p><h4>Casting</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This article <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span>. Unsourced material may be challenged and removed.<br><small><span class=\"plainlinks\"><i>Find sources:</i> <span rel=\"nofollow\" class=\"external text\">\"Once Upon a Time in the West\"</span> – <span rel=\"nofollow\" class=\"external text\">news</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">newspapers</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">books</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">scholar</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">JSTOR</span></span></small></span>  <span class=\"date-container\"><i>(<span class=\"date\">October 2014</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>Fonda did not accept Leone's first offer to play Frank, so Leone flew to New York to convince him, telling him: \"Picture this: the camera shows a gunman from the waist down pulling his gun and shooting a running child. The camera tilts up to the gunman's face and… it's Henry Fonda\". After meeting with Leone, Fonda called his friend Eli Wallach, who had co-starred in The Good, the Bad and the Ugly. Wallach advised Fonda to do the film, telling him \"You will have the time of your life\".</p><p>When he accepted the role, Fonda came to the set with brown contact lenses and facial hair. Fonda felt having dark eyes and facial hair would blend well with his character's evil, and also help the audience to accept this \"new\" Fonda as the bad guy, but Leone immediately told him to remove the contacts and facial hair. Leone felt that Fonda's blue eyes best reflected the cold, icy nature of the killer.</p><p>Following the film's completion, Once Upon a Time in the West was dubbed into several languages, including Italian, French, German, Spanish, and English. For the English dub, the voices of many of the American cast, including Fonda, Bronson, Robards, Wynn, Wolff, and Lionel Stander, were used. However, the rest of the cast had to be dubbed by other actors – including Claudia Cardinale, who was dubbed by actress Joyce Gordon, Gabriele Ferzetti, who was voiced by Gordon's husband, Bernard Grant, and Jack Elam.</p><br/><h3>Music</h3><p>The music was written by composer Ennio Morricone, Leone's regular collaborator, who wrote the score under Leone's direction before filming began. As in The Good, the Bad and the Ugly, the haunting music contributes to the film's grandeur and, like the music for The Good, the Bad and the Ugly, is considered one of Morricone's greatest compositions.</p><p>The film features leitmotifs that relate to each of the main characters (with their own theme music), as well as to the spirit of the American West. Especially compelling are the wordless vocals by Italian singer Edda Dell'Orso during the theme music for Jill McBain. Leone's desire was to have the music available and played during filming. Leone had Morricone compose the score before shooting started and played the music in the background for the actors on set.</p><p>Except for about a minute of the \"Judgment\" motif, before Harmonica kills the three outlaws, no soundtrack music is played until the end of the second scene, when Fonda makes his first entry. During the beginning of the film, Leone instead uses a number of natural sounds, for instance, a turning wheel in the wind, sound of a train, grasshoppers, shotguns while hunting, wings of pigeons, etc., in addition to the diegetic sound of the harmonica.</p><br/><h3>Release</h3><h4>European release</h4><p>The film was a massive hit in France, and was easily the most successful film released there in 1969, with 14.8 million admissions, ranking seventh of all time. It sparked a brief fashion trend for duster coats, which took such proportions that Parisian department stores such as Au Printemps had to affix signs on escalators warning patrons to keep their \"maxis\", as they were called, clear from the edges of moving steps to prevent jamming.</p><p>It was also the most popular film in Germany with admissions of 13 million, ranking third of all time.</p><h4>American release</h4><p>In the US, Paramount edited the film to about 145 minutes for the wide release, but the film underperformed at the box office, earning $2.1M in rentals in North America.</p><p>These scenes were cut for the American release:</p><ul><li>The entire scene at Lionel Stander's trading post. Cheyenne (Robards) was not introduced in the American release until his arrival at the McBain ranch later in the film. Stander remained in the credits, though he did not appear in this version at all.</li><li>The scene in which Morton and Frank discuss what to do with Jill at the Navajo Cliffs.</li><li>Morton's death scene was reduced considerably.</li><li>Cheyenne's death scene was completely excised.</li></ul><p>Otherwise, one scene was slightly longer in the US version than in the international film release: Following the opening duel (where all four gunmen fire and fall), Charles Bronson's character stands up again, showing that he had only been shot in the arm. This part of the scene had been originally cut by director Sergio Leone for the worldwide theatrical release. It was added again for the U.S. market, because the American distributors feared American viewers would not understand the story otherwise, especially since Harmonica's arm wound is originally shown for the first time in the scene at the trading post, which was cut for the shorter U.S. version.</p><p>The English-language version was restored to around 165 minutes for a re-release in 1984, and for its video release the following year.</p><h4>Director's cut</h4><p>In Italy, a 175-minute director's cut features a yellow tint filter, and several scenes were augmented with additional material. This director's cut was available on home video until the early 2000s, and still airs on TV, but more recent home-video releases have used the international cut.</p><h4>Home media</h4><p>After years of public requests, Paramount released a two-disc \"Special Collector's Edition\" of Once Upon a Time in the West on 18 November 2003, with a running time of 165 minutes (158 minutes in some regions). This release is the color 2.35:1 aspect ratio version in anamorphic widescreen, closed captioned, and Dolby. Commentary is also provided by film experts and historians, including John Carpenter, John Milius, Alex Cox, film historian and Leone biographer Sir Christopher Frayling, Dr. Sheldon Hall, and actors Claudia Cardinale and Gabriele Ferzetti, and director Bernardo Bertolucci, a co-writer of the film.</p><p>The second disc has special features, including three recent documentaries on several aspects of the film:</p><ul><li>An Opera of Violence</li><li>The Wages of Sin</li><li>Something to Do with Death</li></ul><p>The film was released on Blu-ray on 31 May 2011.</p><h4>Restored version</h4><p>A restored 4K version was published by Cineteca Bologna in 2018, with improved colors and image quality.</p><br/><h3>Reception</h3><h4>Box office</h4><p>In Italy, the film sold 8,870,732 tickets. In the United States, it grossed $5,321,508, from 3.7 million ticket sales. It sold a further 14,873,804 admissions in France and 13,018,414 admissions in Germany, for a total of 40,462,950 tickets sold worldwide.</p><h4>Critical response</h4><p>Once Upon a Time in the West was reviewed in 1969 in the Chicago Sun-Times by Roger Ebert, who gave it two and a half stars out of four. He found the film \"good fun\" and \"a painstaking distillation\" of Leone's famous style, with intriguing performances by actors cast against their type and a richness of detail projecting \"a sense of life of the West\" made possible by Paramount's larger budget for this Leone film. Ebert complained, however, of the film's length and convoluted plot, which he said only becomes clear by the second hour. While viewing Cardinale as a good casting choice, he said she lacked the \"blood-and-thunder abandon\" of her performance in Cartouche (1962), blaming Leone for directing her \"too passively\".</p><p>In subsequent years, the film developed a greater standing among critics, as well as a cult following. Directors such as Martin Scorsese, George Lucas, Quentin Tarantino, and Vince Gilligan have cited the film as an influence on their work. It has also appeared on prominent all-time critics lists, including Time's 100 greatest films of the 20th century and Empire's 500 greatest movies of all time, where it was the list's highest-ranking Western at number 14. Popular culture scholar Christopher Frayling regarded it as \"one of the greatest films ever made\".</p><p>Review aggregation website Rotten Tomatoes reports a 95% approval rating based on 66 reviews, with an average score of 9.20/10. The critical consensus reads: \"A landmark Sergio Leone spaghetti Western masterpiece featuring a classic Morricone score\". Metacritic gives the film a weighted average score of 82 out of 100 based on reviews from 9 critics, indicating \"universal acclaim\".</p><h4>Accolades</h4><ul><li>Time named Once Upon a Time in the West as one of the 100 greatest films of all time.</li><li>In They Shoot Pictures, Don't They's list of the 1000 Greatest Films, Once Upon a Time in the West is placed at number 62.</li><li>Total Film placed Once Upon a Time in the West in their special edition issue of the 100 Greatest Movies.</li><li>In 2008, Empire held a poll of \"the 500 Greatest Movies of All Time\", taking votes from 10,000 readers, 150 filmmakers, and 50 film critics. \"Once Upon a Time in the West\" was voted in at number 14, the highest Western on the list. In 2017, it was then ranked at number 52 on Empire's poll for \"The 100 Greatest Movies\" (the second-highest Western on the list).</li><li>In 2009, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically significant\".</li><li>In 2010, The Guardian ranked it third in its \"The 25 Best Action and War Films of All Time\" list; and in 2013 the paper ranked it first in its \"Top 10 Movie Westerns\" list.</li><li>In the 2012 Sight & Sound polls, it was ranked the 78th-greatest film ever made in the critics' poll and 44th in the directors' poll.</li><li>In 2014, Time Out polled several film critics, directors, actors, and stunt actors to list their top action films. Once Upon A Time In The West placed 30th on their list.</li></ul><h4>Year-end lists</h4><p>The film is recognized by American Film Institute in these lists:</p><ul><li>2003: AFI's 100 Years...100 Heroes & Villains: Frank – Nominated Villain</li><li>Frank – Nominated Villain</li><li>2005: AFI's 100 Years of Film Scores – Nominated</li></ul><br/><h3>Film references</h3><p>Leone's intent was to take the stock conventions of the American Westerns of John Ford, Howard Hawks, and others, and rework them in an ironic fashion, essentially reversing their intended meaning in their original sources to create a darker connotation. The most obvious example of this is the casting of veteran film good guy Henry Fonda as the villainous Frank, but many other, more subtle reversals occur throughout the film. According to film critic and historian Christopher Frayling, the film quotes from as many as 30 classic American Westerns.</p><p>The major films referenced include:</p><ul><li>The Comancheros (1961): The names \"McBain\" and \"Sweetwater\" may come from this film. Contrary to popular belief, the name of the town \"Sweetwater\" was not taken from Victor Sjöström's silent epic drama The Wind. Bernardo Bertolucci has stated that he looked at a map of the Southwestern United States, found the name of the town in Arizona, and decided to incorporate it into the film. However, both \"Sweetwater\" and a character named \"McBain\" appeared in The Comancheros, which Leone admired.</li><li>Johnny Guitar (1954): Jill and Vienna have similar backstories (both are former prostitutes who become saloonkeepers), and both own land where a train station will be built because of access to water. Also, Harmonica, like Sterling Hayden's title character, is a mysterious, gunslinging outsider known by his musical nickname. Some of West's central plot (Western settlers vs. the railroad company) may be recycled from Nicholas Ray's film.</li><li>The Iron Horse (1924): West may contain several subtle references to this film, including a low-angle shot of a shrieking train rushing towards the screen in the opening scene, and the shot of the train pulling into the Sweetwater station at the end.</li><li>Shane (1953): The massacre scene in West features young Timmy McBain out hunting with his father, just as Joey does in this movie. The funeral of the McBains is borrowed almost shot-for-shot from Shane.</li><li>The Searchers (1956): Leone admitted that the rustling bushes, the silencing of insect sounds, and the fluttering grouse that suggests menace is approaching the farmhouse when the McBain family is massacred were all taken from The Searchers. The ending of the film—where Western nomads Harmonica and Cheyenne move on rather than join modern society—also echoes the famous ending of Ford's film.</li><li>Winchester '73 (1950): The scenes in West at the trading post are claimed to be based on those in Winchester '73, but the resemblance is slight.</li><li>The Man Who Shot Liberty Valance (1962): The dusters (long coats) worn by Cheyenne and his gang (and by Frank and his men while impersonating them) resemble those worn by Liberty Valance (Lee Marvin) and his henchmen when they are introduced in this film. In addition, the auction scene in West was intended to recall the election scene in Liberty Valance.</li><li>The Last Sunset (1961): The final duel between Frank and Harmonica is shot almost identically to the duel between Kirk Douglas and Rock Hudson in this film.</li><li>Duel in the Sun (1946): The character of Morton, the crippled railroad baron in West, was based on the character played by Lionel Barrymore in this film.</li></ul><br/>"
  },
  "errorMessage": ""
}