{
  "imDbId": "tt0031679",
  "title": "Mr. Smith Goes to Washington",
  "fullTitle": "Mr. Smith Goes to Washington (1939)",
  "type": "Movie",
  "year": "1939",
  "items": [
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/mr-smith-goes-washington-review/",
      "rate": "100",
      "content": "Demonstrating that the greatest political evil is indifference, this appeal to a world on the verge of war has lost none of its relevance."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1939/film/reviews/mr-smith-goes-to-washington-1200412404/",
      "rate": "100",
      "content": "There’s tremendous dramatic impact threaded throughout the picture, interwoven with those deft human episodes which have become familiar with Capra’s direction in previous pictures. He keys the motivation of his basic premise without wasting time, and then carries it through vigorously."
    },
    {
      "publisher": "The New York Times",
      "author": "Frank S. Nugent",
      "link": "https://www.nytimes.com/reviews/movies?res=9403EED8143EE23ABC4851DFB6678382629EDE",
      "rate": "100",
      "content": "[Capra] has paced it beautifully and held it in perfect balance, weaving his romance lightly through the political phases of his comedy, flicking a sardonic eye over the Washington scene, racing out to the hinterland to watch public opinion being made and returning miraculously in time to tie all the story threads together into a serious and meaningful dramatic pattern."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/mr-smith-goes-to-washington/review/2000345538/",
      "rate": "100",
      "content": "While MR. SMITH GOES TO WASHINGTON is the most moral of films, it is so artfully filled with real emotion that it never becomes heavy-handed."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://content.time.com/time/subscriber/article/0,33009,772274,00.html",
      "rate": "90",
      "content": "The acting of the brilliant cast is sometimes superb. But Mr. Smith Goes to Washington is bigger than any of these things. Its real hero is not calfy Jeff Smith, but the things he believes, as embodied in the hero of U. S. democracy's first crisis, Abraham Lincoln."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Quintessential Capra - popular wish-fulfilment served up with such fast-talking comic panache that you don't have time to question its cornball idealism."
    },
    {
      "publisher": "Chicago Reader",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "This is classic Capracorn, with the greatest girl cynic of the 30s, Jean Arthur."
    },
    {
      "publisher": "The New Yorker",
      "author": "Pauline Kael",
      "link": "",
      "rate": "60",
      "content": "No one else can balance the ups and downs of wistful sentiment and corny humor the way Capra can - but if anyone else should learn to, kill him."
    },
    {
      "publisher": "",
      "author": "The New Republic",
      "link": "https://newrepublic.com/article/80908/tnr-film-classic-mr-smith-goes-washington-1939",
      "rate": "40",
      "content": "Clumsy and irritating."
    }
  ],
  "errorMessage": ""
}