{
  "imDbId": "tt0031679",
  "title": "Mr. Smith Goes to Washington",
  "fullTitle": "Mr. Smith Goes to Washington (1939)",
  "type": "Movie",
  "year": "1939",
  "language": "en",
  "titleInLanguage": "Mr. Smith Goes to Washington",
  "url": "https://en.wikipedia.org/wiki/Mr._Smith_Goes_to_Washington",
  "plotShort": {
    "plainText": "Mr. Smith Goes to Washington is a 1939 American political comedy-drama film directed by Frank Capra, starring Jean Arthur and James Stewart, and featuring Claude Rains and Edward Arnold. The film is about a newly appointed United States Senator who fights against a corrupt political system, and was written by Sidney Buchman, based on Lewis R. Foster's unpublished story \"The Gentleman from Montana\". The film was controversial when it was first released, but successful at the box office, and it made Stewart a major star. It was also loosely based on the life of Montana U.S. Senator Burton Wheeler, who underwent a similar experience when he was investigating the Warren Harding administration.\r\nMr. Smith Goes to Washington was nominated for eleven Academy Awards, including Best Picture, Best Director and Best Actor, winning Best Original Story. Considered to be one of the greatest films of all time, the film was selected by the Library of Congress as one of the first 25 films for preservation in the United States National Film Registry in 1989, for being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>Mr. Smith Goes to Washington is a 1939 American political comedy-drama film directed by Frank Capra, starring Jean Arthur and James Stewart, and featuring Claude Rains and Edward Arnold. The film is about a newly appointed United States Senator who fights against a corrupt political system, and was written by Sidney Buchman, based on Lewis R. Foster's unpublished story \"The Gentleman from Montana\". The film was controversial when it was first released, but successful at the box office, and it made Stewart a major star. It was also loosely based on the life of Montana U.S. Senator Burton Wheeler, who underwent a similar experience when he was investigating the Warren Harding administration.</p><p>Mr. Smith Goes to Washington was nominated for eleven Academy Awards, including Best Picture, Best Director and Best Actor, winning Best Original Story. Considered to be one of the greatest films of all time, the film was selected by the Library of Congress as one of the first 25 films for preservation in the United States National Film Registry in 1989, for being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "Mr. Smith Goes to Washington is a 1939 American political comedy-drama film directed by Frank Capra, starring Jean Arthur and James Stewart, and featuring Claude Rains and Edward Arnold. The film is about a newly appointed United States Senator who fights against a corrupt political system, and was written by Sidney Buchman, based on Lewis R. Foster's unpublished story \"The Gentleman from Montana\". The film was controversial when it was first released, but successful at the box office, and it made Stewart a major star. It was also loosely based on the life of Montana U.S. Senator Burton Wheeler, who underwent a similar experience when he was investigating the Warren Harding administration.\r\nMr. Smith Goes to Washington was nominated for eleven Academy Awards, including Best Picture, Best Director and Best Actor, winning Best Original Story. Considered to be one of the greatest films of all time, the film was selected by the Library of Congress as one of the first 25 films for preservation in the United States National Film Registry in 1989, for being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nThe governor of an unnamed western state, Hubert \"Happy\" Hopper, has to pick a replacement for the recently deceased U.S. Senator Sam Foley. His corrupt political boss, Jim Taylor, pressures Hopper to choose his handpicked stooge, Horace Miller, while popular committees want a reformer, Henry Hill. The governor's children want him to select Jefferson Smith, the head of the Boy Rangers. Unable to make up his mind between Taylor's stooge and the reformer, Hopper decides to flip a coin. When it lands on edge – and next to a newspaper story on one of Smith's accomplishments – he chooses Smith, calculating that his wholesome image will please the people. At the same time, his naivety will make him easy to manipulate.\r\nJunior Senator Smith is taken under the wing of the publicly esteemed, but secretly crooked, Senator Joseph Paine, who was Smith's late father's friend. Smith develops an immediate attraction to the senator's daughter, Susan. At Senator Paine's home, Smith has a conversation with Susan, fidgeting and bumbling, entranced by the young socialite. Smith's naïve and honest nature allows the unforgiving Washington press to take advantage of him, quickly tarnishing Smith's reputation with ridiculous front-page pictures and headlines branding him a bumpkin.\r\nTo keep Smith busy, Paine suggests he propose a bill. With the help of his secretary, Clarissa Saunders, who was the aide to Smith's predecessor and had been around Washington and politics for years, Smith comes up with a bill to authorize a federal government loan to buy some land in his home state for a national boys' camp, to be paid back by youngsters across America. Donations pour in immediately. However, the proposed campsite is already part of a dam-building graft scheme included in an appropriations bill framed by the Taylor political machine and supported by Senator Paine.\r\nUnwilling to crucify the worshipful Smith so that their graft plan will go through, Paine tells Taylor he wants out, but Taylor reminds him that Paine is in power primarily through Taylor's influence. Paine then advises Smith to keep silent about the matter. The following day, when Smith speaks out about the bill at Senate, the machine in his state—through Paine—accuses Smith of trying to profit from his bill by producing fraudulent evidence that Smith already owns the land in question. Smith is too shocked and angry by Paine's betrayal to defend himself and runs away.\r\nSaunders, who looked down on Smith at first, but has come to believe in him, talks him into launching a filibuster to postpone the appropriations bill and prove his innocence on the Senate floor just before the vote to expel him. In his last chance to prove his innocence, he talks non-stop for about 25 hours, reaffirming the American ideals of freedom and disclosing the dam scheme's true motives. Yet none of the senators are convinced.\r\nThe constituents try to rally around him, but the entrenched opposition is too powerful, and all attempts are crushed. Owing to the influence of Taylor's machine, newspapers and radio stations in Smith's home state, on Taylor's orders, refuse to report what Smith has to say and even distort the facts against the senator. The Boy Rangers' effort to spread the news in support of Smith results in vicious attacks on the children by Taylor's minions.\r\nAlthough all hope seems lost, the senators begin to pay attention as Smith approaches utter exhaustion. Paine has one last card up his sleeve: he brings in bins of letters and telegrams from Smith's home state, purportedly from average people demanding his expulsion. Nearly broken by the news, Smith finds a small ray of hope in a friendly smile from the President of the Senate. Smith vows to press on until people believe him but immediately collapses in a faint. Overcome with the pangs of remorse, Paine leaves the Senate chamber and attempts to commit suicide by gunshot but is stopped by onlooking senators. He then bursts back into the Senate chamber, shouting a confession to the whole scheme; the reformed Paine further insists that he must be expelled from the Senate and affirms Smith's innocence to Clarissa's delight. The President of the Senate observes the ensuing chaos with amusement.\r\nCast\r\nCast notes:\r\nAmong the unbilled veteran character actors seen in the film are Guy Kibbee's brother, Milton Kibbee, who has a bit as a reporter; Lafe McKee; and Matt McHugh of the McHugh acting family. Also in the film in minor roles are Dub Taylor and Jack Carson, later well-known actors. Silent film star Hank Mann played a photographer.\r\nProduction\r\nColumbia Pictures originally purchased Lewis R. Foster's unpublished story, variously called \"The Gentleman from Montana\" and \"The Gentleman from Wyoming\", as a vehicle for Ralph Bellamy, but once Frank Capra came on board as director – after Rouben Mamoulian had expressed interest – the film was to be a sequel to his Mr. Deeds Goes to Town, called Mr. Deeds Goes to Washington, with Gary Cooper reprising his role as Longfellow Deeds. Because Cooper was unavailable, Capra then \"saw it immediately as a vehicle for Jimmy Stewart and Jean Arthur\", and Stewart was borrowed from MGM. Capra said of Stewart: \"I knew he would make a hell of a Mr. Smith ... He looked like the country kid, the idealist. It was very close to him.\"\r\nAlthough a youth group is featured in the story, the Boy Scouts of America refused to allow their name to be used in the film and instead the fanciful \"Boy Rangers\" was used.\r\nIn January 1938, both Metro-Goldwyn-Mayer and Paramount Pictures submitted Foster's story to the censors at the Hays Office, likely indicating that both studios had an interest in the project before Columbia purchased it. Joseph Breen, the head of that office, warned the studios: \"e would urge most earnestly that you take serious counsel before embarking on the production of any motion picture based on this story. It looks to us like one that might well be loaded with dynamite, both for the motion picture industry, and for the country at large.\" Breen specifically objected to \"the generally unflattering portrayal of our system of Government, which might well lead to such a picture being considered, both here, and more particularly abroad, as a covert attack on the Democratic form of government\", and warned that the film should make clear that \"the Senate is made up of a group of fine, upstanding citizens, who labor long and tirelessly for the best interests of the nation\".\r\nLater, after the screenplay had been written and submitted, Breen reversed course, saying of the film, \"It is a grand yarn that will do a great deal of good for all those who see it and, in my judgment, it is particularly fortunate that this kind of story is to be made at this time. Out of all Senator Jeff's difficulties there has been evolved the importance of a democracy and there is splendidly emphasized the rich and glorious heritage which is ours and which comes when you have a government 'of the people, by the people, and for the people'\".\r\nThe film was in production from April 3, 1939, to July 7 of that year. Some location shooting took place in Washington, D.C., at Union Station and at the United States Capitol, as well as other locations for background use.\r\nIn the studio, to ensure authenticity, an elaborate set was created, consisting of Senate committee rooms, cloak rooms, and hotel suites, as well as specific Washington, D.C., monuments, all based on a trip Capra and his crew made to the capital. Even the Press Club of Washington was reproduced in minute detail, but the major effort went into a faithful reproduction of the Senate Chamber on the Columbia lot. James D. Preston, a former superintendent of the Senate gallery, acted as technical director for the Senate set, as well as advising on political protocol. The production also utilized the \"New York street set\" on the Warner Bros. lot, using 1,000 extras when that scene was shot.\r\nThe ending of the film was apparently changed at some point, as the original program describes Stewart and Arthur returning to Smith's hometown, where they are met by a big parade, with the implication that they are married and starting a family. In addition, the Taylor political machine is shown being crushed; Smith, riding a motorcycle, visits Senator Paine and forgives him; and a visit to Smith's mother is included. Some of this footage can be seen in the film's trailer.\r\nImpact\r\nThe film premiered in Constitution Hall in Washington, D.C., on October 17, 1939, sponsored by the National Press Club, an event to which 4,000 guests were invited, including 45 senators. Mr. Smith Goes to Washington was attacked by the Washington press, and politicians in the U.S. Congress, as anti-American and pro-Communist for its portrayal of corruption in the American government. While Capra claims in his autobiography that some senators walked out of the premiere, contemporary press accounts are unclear about whether this occurred or not, or whether senators yelled back at the screen during the film.\r\nIt is known that Alben W. Barkley, a Democrat and the Senate Majority Leader, called the film \"silly and stupid\", and said it \"makes the Senate look like a bunch of crooks\". He also remarked that the film was \"a grotesque distortion\" of the Senate, \"as grotesque as anything ever seen! Imagine the Vice President of the United States winking at a pretty girl in the gallery in order to encourage a filibuster!\" Barkley thought the film \"showed the Senate as the biggest aggregation of nincompoops on record!\"\r\nPete Harrison, a respected journalist and publisher of the motion picture trade journal Harrison's Reports, suggested that the Senate pass a bill allowing theater owners to refuse to show films that \"were not in the best interest of our country\". That did not happen, but one of the ways that some senators attempted to retaliate for the damage they felt the film had done to the reputation of their institution was by pushing the passage of the Neely Anti-Block Booking Bill, which eventually led to the breakup of the studio-owned theater chains in the late 1940s. Columbia responded by distributing a program which put forward the film's patriotism and support of democracy and publicized the film's many positive reviews.\r\nOther objections were voiced as well. Joseph P. Kennedy, the American Ambassador to Great Britain, wrote to Capra and Columbia head Harry Cohn to say that he feared the film would damage \"America’s prestige in Europe\", and because of this urged that it be withdrawn from European release. Capra and Cohn responded, citing the film's review, which mollified Kennedy to the extent that he never followed up, although he privately still had doubts about the film.\r\nThe film was banned in Hitler's Germany, Mussolini's Italy, and in Franco's Spain. In the Soviet Union, the film was released to cinemas in December of 1950 as The Senator. According to Capra, the film was also dubbed in certain European countries to alter the message of the film so it conformed with official ideology.\r\nWhen a ban on American films was imposed in German occupied France in 1942, some theaters chose to show Mr. Smith Goes to Washington as the last movie before the ban went into effect. One theater owner in Paris reportedly screened the film nonstop for 30 days after the ban was announced.\r\nThe critical response to the film was more measured than the reaction by politicians, domestic and foreign. The critic for The New York Times, for instance, Frank S. Nugent, wrote that \" is operating, of course, under the protection of that unwritten clause in the Bill of Rights entitling every voting citizen to at least one free swing at the Senate. Mr. Capra's swing is from the floor and in the best of humor; if it fails to rock the august body to its heels – from laughter as much as from injured dignity – it won't be his fault but the Senate's, and we should really begin to worry about the upper house.\"\r\nMr. Smith Goes to Washington has been called one of the quintessential whistleblower films in American history. Dr. James Murtagh and Dr. Jeffrey Wigand cited this film as a seminal event in U.S. history at the first \"Whistleblower Week in Washington\" (May 13–19, 2007).\r\nMr. Smith Goes to Washington has often been listed as among Capra's best, but it has been noted that it \"marked a turning point in Capra's vision of the world, from nervous optimism to a darker, more pessimistic tone. Beginning with American Madness (1932), such Capra films as Lady for a Day (1933), It Happened One Night (1934), Mr. Deeds Goes to Town (1936), and You Can’t Take It With You (1938) had trumpeted their belief in the decency of the common man. In Mr. Smith Goes to Washington, however, the decent common man is surrounded by a venal, petty and thuggish group of crooks. Everyone in the film – except for Jefferson Smith and his tiny cadre of believers – is either in the pay of the political machine run by Edward Arnold's James Taylor or complicit in Taylor's corruption through their silence, and they all sit by as innocent people, including children, are brutalized and intimidated, rights are violated, and the government is brought to a halt\".\r\nNevertheless, Smith's filibuster and the tacit encouragement of the Senate President are both emblematic of the director's belief in the difference that one individual can make. This theme would be expanded further in Capra's It's a Wonderful Life (1946) and other films.\r\nBox office\r\nMr. Smith Goes to Washington was a box office success upon its release, earning theatrical rentals of $3.5 million in the United States alone. It became the second-highest-grossing film of 1939 and was also the third highest-grossing film of the 1930s decade, only behind Gone with the Wind and Snow White and the Seven Dwarfs.\r\nAwards and honors\r\nAcademy Awards\r\nMr. Smith Goes to Washington was nominated for 11 Academy Awards, but won only one.\r\nOther honors\r\nMr. Smith Goes to Washington was named as one of the best films of 1939 by The New York Times and Film Daily, and was nominated for Best Film by the National Board of Review.\r\nJames Stewart won the 1939 New York Film Critics Circle Award for Best Actor.\r\nIn 1989, Mr. Smith Goes to Washington was added to the United States National Film Registry as being deemed \"culturally, historically, or aesthetically significant\".\r\nAmerican Film Institute recognition\r\n1998 AFI's 100 Years...100 Movies #29\r\n2003 AFI's 100 Years...100 Heroes & Villains: Jefferson Smith, Hero #11 Senator Joseph Paine, Villain – Nominated\r\nJefferson Smith, Hero #11\r\nSenator Joseph Paine, Villain – Nominated\r\n2006 AFI's 100 Years...100 Cheers #5\r\n2007 AFI's 100 Years...100 Movies (10th Anniversary Edition) #26\r\nRemakes\r\nIn 1949, Columbia planned, but never actually produced, a sequel to Mr. Smith Goes to Washington, called Mr. Smith Starts a Riot. They also considered doing a gender-reversed remake in 1952, with Jane Wyman playing the lead role.\r\nA television series of the same name, Mr. Smith Goes to Washington, ran on ABC during the 1962–1963 season, starring Fess Parker, Sandra Warner and Red Foley.\r\nProducer Frank Capra Jr. remade the film as part of Tom Laughlin's Billy Jack series, Billy Jack Goes to Washington (1977).\r\nThe film was also loosely remade as The Distinguished Gentleman (1992), starring Eddie Murphy.\r\nThe 2019 Australian political drama television series Total Control features a remarkably similar plot, this time with the new Senator being an Indigenous Australian woman played by Deborah Mailman recruited to the Australian Senate.\r\nIn popular culture\r\nThe March 10, 1940 broadcast of Jack Benny's NBC radio show featured a parody entitled \"Mr. Benny Goes to Washington\".\r\nThe VHS release of Ernest Rides Again featured the opening Saturday Night Live-based short \"Mr. Bill Goes to Washington\".\r\nThe Simpsons has parodied it several times, including the third season episode \"Mr. Lisa Goes to Washington\", which deals with Lisa Simpson's disillusionment with Washington government, following her winning a trip to Washington as a prize in an essay contest; the eleventh season premiere \"Beyond Blunderdome\" which includes a remake of Mr. Smith Goes to Washington, starring Mel Gibson (voiced by himself) as Jefferson Smith; and the fourteenth season episode \"Mr. Spritz Goes to Washington\" .\r\nFor their 2002 season, the San Francisco Mime Troupe presented a musical, Mr. Smith Goes to Obscuristan, which tells the story of \"an idealistic innocent who learns firsthand what Presidency of George W. Bush means when it claims to support democratic principles at home and abroad\" in a post-9/11 setting.\r\nThe short-lived NBC political drama Mister Sterling (2003) was described as \"a Mr. Smith Goes to Washington for the 21st century\", with the show centering on an idealistic young senator from California, coming to grips with Washington and appointed by a scheming, underhanded governor.\r\nIn the TV series Highway to Heaven, the eleventh episode of season three is entitled, \"Jonathan Smith Goes to Washington\" (1986). The appeal made in that episode was regarding healthcare, and a filibuster was employed.\r\nIn the TV series Scandal, the third episode of season three is entitled, \"Mrs. Smith Goes to Washington\" (2013).",
    "html": "<p>Mr. Smith Goes to Washington is a 1939 American political comedy-drama film directed by Frank Capra, starring Jean Arthur and James Stewart, and featuring Claude Rains and Edward Arnold. The film is about a newly appointed United States Senator who fights against a corrupt political system, and was written by Sidney Buchman, based on Lewis R. Foster's unpublished story \"The Gentleman from Montana\". The film was controversial when it was first released, but successful at the box office, and it made Stewart a major star. It was also loosely based on the life of Montana U.S. Senator Burton Wheeler, who underwent a similar experience when he was investigating the Warren Harding administration.</p><p>Mr. Smith Goes to Washington was nominated for eleven Academy Awards, including Best Picture, Best Director and Best Actor, winning Best Original Story. Considered to be one of the greatest films of all time, the film was selected by the Library of Congress as one of the first 25 films for preservation in the United States National Film Registry in 1989, for being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>The governor of an unnamed western state, Hubert \"Happy\" Hopper, has to pick a replacement for the recently deceased U.S. Senator Sam Foley. His corrupt political boss, Jim Taylor, pressures Hopper to choose his handpicked stooge, Horace Miller, while popular committees want a reformer, Henry Hill. The governor's children want him to select Jefferson Smith, the head of the Boy Rangers. Unable to make up his mind between Taylor's stooge and the reformer, Hopper decides to flip a coin. When it lands on edge – and next to a newspaper story on one of Smith's accomplishments – he chooses Smith, calculating that his wholesome image will please the people. At the same time, his naivety will make him easy to manipulate.</p><p>Junior Senator Smith is taken under the wing of the publicly esteemed, but secretly crooked, Senator Joseph Paine, who was Smith's late father's friend. Smith develops an immediate attraction to the senator's daughter, Susan. At Senator Paine's home, Smith has a conversation with Susan, fidgeting and bumbling, entranced by the young socialite. Smith's naïve and honest nature allows the unforgiving Washington press to take advantage of him, quickly tarnishing Smith's reputation with ridiculous front-page pictures and headlines branding him a bumpkin.</p><p>To keep Smith busy, Paine suggests he propose a bill. With the help of his secretary, Clarissa Saunders, who was the aide to Smith's predecessor and had been around Washington and politics for years, Smith comes up with a bill to authorize a federal government loan to buy some land in his home state for a national boys' camp, to be paid back by youngsters across America. Donations pour in immediately. However, the proposed campsite is already part of a dam-building graft scheme included in an appropriations bill framed by the Taylor political machine and supported by Senator Paine.</p><p>Unwilling to crucify the worshipful Smith so that their graft plan will go through, Paine tells Taylor he wants out, but Taylor reminds him that Paine is in power primarily through Taylor's influence. Paine then advises Smith to keep silent about the matter. The following day, when Smith speaks out about the bill at Senate, the machine in his state—through Paine—accuses Smith of trying to profit from his bill by producing fraudulent evidence that Smith already owns the land in question. Smith is too shocked and angry by Paine's betrayal to defend himself and runs away.</p><p>Saunders, who looked down on Smith at first, but has come to believe in him, talks him into launching a filibuster to postpone the appropriations bill and prove his innocence on the Senate floor just before the vote to expel him. In his last chance to prove his innocence, he talks non-stop for about 25 hours, reaffirming the American ideals of freedom and disclosing the dam scheme's true motives. Yet none of the senators are convinced.</p><p>The constituents try to rally around him, but the entrenched opposition is too powerful, and all attempts are crushed. Owing to the influence of Taylor's machine, newspapers and radio stations in Smith's home state, on Taylor's orders, refuse to report what Smith has to say and even distort the facts against the senator. The Boy Rangers' effort to spread the news in support of Smith results in vicious attacks on the children by Taylor's minions.</p><p>Although all hope seems lost, the senators begin to pay attention as Smith approaches utter exhaustion. Paine has one last card up his sleeve: he brings in bins of letters and telegrams from Smith's home state, purportedly from average people demanding his expulsion. Nearly broken by the news, Smith finds a small ray of hope in a friendly smile from the President of the Senate. Smith vows to press on until people believe him but immediately collapses in a faint. Overcome with the pangs of remorse, Paine leaves the Senate chamber and attempts to commit suicide by gunshot but is stopped by onlooking senators. He then bursts back into the Senate chamber, shouting a confession to the whole scheme; the reformed Paine further insists that he must be expelled from the Senate and affirms Smith's innocence to Clarissa's delight. The President of the Senate observes the ensuing chaos with amusement.</p><br/><h3>Cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><ul><li><span>Jean Arthur</span> as Clarissa Saunders</li><li><span>James Stewart</span> as Jefferson \"Jeff\" Smith</li><li><span>Claude Rains</span> as Senator Joseph Harrison \"Joe\" Paine</li><li><span>Edward Arnold</span> as Jim Taylor</li><li><span>Guy Kibbee</span> as Governor Hubert \"Happy\" Hopper</li><li><span>Thomas Mitchell</span> as \"Diz\" Moore</li><li><span>Eugene Pallette</span> as Chick McGann</li><li><span>Beulah Bondi</span> as Ma Smith</li><li><span>H. B. Warner</span> as <span class=\"mw-redirect\">Senate Majority Leader</span></li><li><span>Harry Carey</span> as <span>President of the Senate</span></li><li><span>Astrid Allwyn</span> as Susan Paine</li><li><span>Ruth Donnelly</span> as Mrs. Hopper</li><li><span>Grant Mitchell</span> as Senator MacPherson</li><li><span>Porter Hall</span> as Senator Monroe</li><li><span>Pierre Watkin</span> as <span class=\"mw-redirect\">Senate Minority Leader</span></li><li><span class=\"mw-redirect\">Charles Lane</span> as \"Nosey\", reporter</li><li><span>William Demarest</span> as Bill Griffith</li><li><span>Dick Elliott</span> as Carl Cook</li><li>The Hopper Boys:<ul><li><span class=\"mw-redirect\">Billy Watson</span></li><li><span>Delmar Watson</span></li><li>John Russell</li><li><span class=\"mw-redirect\">Harry Watson</span></li><li>Gary Watson</li><li>Baby Dumpling (<span>Larry Simms</span>)</li></ul></li><li><span>H. V. Kaltenborn</span> as himself</li></ul></td><td style=\"text-align: left; vertical-align: top; padding-left: 4em;\"><p><b>Uncredited</b></p><ul><li><span>Russell Simpson</span> as Kenneth Allen</li><li><span>Dick Jones</span> as Richard \"Dickie\" Jones, Senate Page Boy</li><li>Nick Copeland as Senate Reporter</li><li><span>Anne Cornwall</span> as Senate Reporter</li><li><span>Gino Corrado</span> as Barber</li><li><span>Maurice Costello</span> as Diggs – Newsman</li><li><span>Alec Craig</span> as Speaker</li><li>Beatrice Curtis as Paine's Secretary</li><li><span>Lew Davis</span> as Senate Clerk</li><li>Dulcie Day as Senate Reporter</li><li>Wally Dean as Paine's Friend</li><li><span>Vernon Dent</span> as Senate Reporter</li><li><span>Harry Depp</span> as Hat Salesman / Secretary</li><li><span>Robert Middlemass</span> as 2nd Radio Announcer</li><li><span>Gladys Gale</span> as Committee Woman</li><li><span>Stanley Andrews</span> as Senator Hodges</li><li><span>Harlan Briggs</span> as Mr. Edwards, howling citizen</li></ul><p> </p></td></tr></tbody></table><p>Cast notes:</p><ul><li>Among the unbilled veteran character actors seen in the film are Guy Kibbee's brother, Milton Kibbee, who has a bit as a reporter; Lafe McKee; and Matt McHugh of the McHugh acting family. Also in the film in minor roles are Dub Taylor and Jack Carson, later well-known actors. Silent film star Hank Mann played a photographer.</li></ul><br/><h3>Production</h3><p>Columbia Pictures originally purchased Lewis R. Foster's unpublished story, variously called \"The Gentleman from Montana\" and \"The Gentleman from Wyoming\", as a vehicle for Ralph Bellamy, but once Frank Capra came on board as director – after Rouben Mamoulian had expressed interest – the film was to be a sequel to his Mr. Deeds Goes to Town, called Mr. Deeds Goes to Washington, with Gary Cooper reprising his role as Longfellow Deeds. Because Cooper was unavailable, Capra then \"saw it immediately as a vehicle for Jimmy Stewart and Jean Arthur\", and Stewart was borrowed from MGM. Capra said of Stewart: \"I knew he would make a hell of a Mr. Smith ... He looked like the country kid, the idealist. It was very close to him.\"</p><p>Although a youth group is featured in the story, the Boy Scouts of America refused to allow their name to be used in the film and instead the fanciful \"Boy Rangers\" was used.</p><p>In January 1938, both Metro-Goldwyn-Mayer and Paramount Pictures submitted Foster's story to the censors at the Hays Office, likely indicating that both studios had an interest in the project before Columbia purchased it. Joseph Breen, the head of that office, warned the studios: \"e would urge most earnestly that you take serious counsel before embarking on the production of any motion picture based on this story. It looks to us like one that might well be loaded with dynamite, both for the motion picture industry, and for the country at large.\" Breen specifically objected to \"the generally unflattering portrayal of our system of Government, which might well lead to such a picture being considered, both here, and more particularly abroad, as a covert attack on the Democratic form of government\", and warned that the film should make clear that \"the Senate is made up of a group of fine, upstanding citizens, who labor long and tirelessly for the best interests of the nation\".</p><p>Later, after the screenplay had been written and submitted, Breen reversed course, saying of the film, \"It is a grand yarn that will do a great deal of good for all those who see it and, in my judgment, it is particularly fortunate that this kind of story is to be made at this time. Out of all Senator Jeff's difficulties there has been evolved the importance of a democracy and there is splendidly emphasized the rich and glorious heritage which is ours and which comes when you have a government 'of the people, by the people, and for the people'\".</p><p>The film was in production from April 3, 1939, to July 7 of that year. Some location shooting took place in Washington, D.C., at Union Station and at the United States Capitol, as well as other locations for background use.</p><p>In the studio, to ensure authenticity, an elaborate set was created, consisting of Senate committee rooms, cloak rooms, and hotel suites, as well as specific Washington, D.C., monuments, all based on a trip Capra and his crew made to the capital. Even the Press Club of Washington was reproduced in minute detail, but the major effort went into a faithful reproduction of the Senate Chamber on the Columbia lot. James D. Preston, a former superintendent of the Senate gallery, acted as technical director for the Senate set, as well as advising on political protocol. The production also utilized the \"New York street set\" on the Warner Bros. lot, using 1,000 extras when that scene was shot.</p><p>The ending of the film was apparently changed at some point, as the original program describes Stewart and Arthur returning to Smith's hometown, where they are met by a big parade, with the implication that they are married and starting a family. In addition, the Taylor political machine is shown being crushed; Smith, riding a motorcycle, visits Senator Paine and forgives him; and a visit to Smith's mother is included. Some of this footage can be seen in the film's trailer.</p><br/><h3>Impact</h3><p>The film premiered in Constitution Hall in Washington, D.C., on October 17, 1939, sponsored by the National Press Club, an event to which 4,000 guests were invited, including 45 senators. Mr. Smith Goes to Washington was attacked by the Washington press, and politicians in the U.S. Congress, as anti-American and pro-Communist for its portrayal of corruption in the American government. While Capra claims in his autobiography that some senators walked out of the premiere, contemporary press accounts are unclear about whether this occurred or not, or whether senators yelled back at the screen during the film.</p><p>It is known that Alben W. Barkley, a Democrat and the Senate Majority Leader, called the film \"silly and stupid\", and said it \"makes the Senate look like a bunch of crooks\". He also remarked that the film was \"a grotesque distortion\" of the Senate, \"as grotesque as anything ever seen! Imagine the Vice President of the United States winking at a pretty girl in the gallery in order to encourage a filibuster!\" Barkley thought the film \"showed the Senate as the biggest aggregation of nincompoops on record!\"</p><p>Pete Harrison, a respected journalist and publisher of the motion picture trade journal Harrison's Reports, suggested that the Senate pass a bill allowing theater owners to refuse to show films that \"were not in the best interest of our country\". That did not happen, but one of the ways that some senators attempted to retaliate for the damage they felt the film had done to the reputation of their institution was by pushing the passage of the Neely Anti-Block Booking Bill, which eventually led to the breakup of the studio-owned theater chains in the late 1940s. Columbia responded by distributing a program which put forward the film's patriotism and support of democracy and publicized the film's many positive reviews.</p><p>Other objections were voiced as well. Joseph P. Kennedy, the American Ambassador to Great Britain, wrote to Capra and Columbia head Harry Cohn to say that he feared the film would damage \"America’s prestige in Europe\", and because of this urged that it be withdrawn from European release. Capra and Cohn responded, citing the film's review, which mollified Kennedy to the extent that he never followed up, although he privately still had doubts about the film.</p><p>The film was banned in Hitler's Germany, Mussolini's Italy, and in Franco's Spain. In the Soviet Union, the film was released to cinemas in December of 1950 as The Senator. According to Capra, the film was also dubbed in certain European countries to alter the message of the film so it conformed with official ideology.</p><p>When a ban on American films was imposed in German occupied France in 1942, some theaters chose to show Mr. Smith Goes to Washington as the last movie before the ban went into effect. One theater owner in Paris reportedly screened the film nonstop for 30 days after the ban was announced.</p><p>The critical response to the film was more measured than the reaction by politicians, domestic and foreign. The critic for The New York Times, for instance, Frank S. Nugent, wrote that \" is operating, of course, under the protection of that unwritten clause in the Bill of Rights entitling every voting citizen to at least one free swing at the Senate. Mr. Capra's swing is from the floor and in the best of humor; if it fails to rock the august body to its heels – from laughter as much as from injured dignity – it won't be his fault but the Senate's, and we should really begin to worry about the upper house.\"</p><p>Mr. Smith Goes to Washington has been called one of the quintessential whistleblower films in American history. Dr. James Murtagh and Dr. Jeffrey Wigand cited this film as a seminal event in U.S. history at the first \"Whistleblower Week in Washington\" (May 13–19, 2007).</p><p>Mr. Smith Goes to Washington has often been listed as among Capra's best, but it has been noted that it \"marked a turning point in Capra's vision of the world, from nervous optimism to a darker, more pessimistic tone. Beginning with American Madness (1932), such Capra films as Lady for a Day (1933), It Happened One Night (1934), Mr. Deeds Goes to Town (1936), and You Can’t Take It With You (1938) had trumpeted their belief in the decency of the common man. In Mr. Smith Goes to Washington, however, the decent common man is surrounded by a venal, petty and thuggish group of crooks. Everyone in the film – except for Jefferson Smith and his tiny cadre of believers – is either in the pay of the political machine run by Edward Arnold's James Taylor or complicit in Taylor's corruption through their silence, and they all sit by as innocent people, including children, are brutalized and intimidated, rights are violated, and the government is brought to a halt\".</p><p>Nevertheless, Smith's filibuster and the tacit encouragement of the Senate President are both emblematic of the director's belief in the difference that one individual can make. This theme would be expanded further in Capra's It's a Wonderful Life (1946) and other films.</p><br/><h3>Box office</h3><p>Mr. Smith Goes to Washington was a box office success upon its release, earning theatrical rentals of $3.5 million in the United States alone. It became the second-highest-grossing film of 1939 and was also the third highest-grossing film of the 1930s decade, only behind Gone with the Wind and Snow White and the Seven Dwarfs.</p><br/><h3>Awards and honors</h3><h4>Academy Awards</h4><p>Mr. Smith Goes to Washington was nominated for 11 Academy Awards, but won only one.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Result</th><th>Winner</th></tr><tr><td><small><span>Outstanding Production</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Columbia Pictures</span> (<span>Frank Capra</span>)<br> <small>Winner was <span>David O. Selznick</span> – <i><span>Gone with the Wind</span></i></small></td></tr><tr><td><small><span>Best Director</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Frank Capra</span><br> <small>Winner was <span>Victor Fleming</span> – <i><span>Gone with the Wind</span></i></small></td></tr><tr><td><small><span>Best Actor</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>James Stewart</span><br> <small>Winner was <span>Robert Donat</span> – <i><span>Goodbye, Mr. Chips</span></i></small></td></tr><tr><td><small><span>Best Writing, Screenplay</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Sidney Buchman</span><br> <small>Winner was <span>Sidney Howard</span> – <i><span>Gone with the Wind</span></i></small></td></tr><tr><td><small><span>Best Writing, Original Story</span></small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Lewis R. Foster</span></td></tr><tr><td rowspan=\"2\"><small><span>Best Supporting Actor</span></small></td><td rowspan=\"2\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Claude Rains</span></td></tr><tr><td><span>Harry Carey</span><br> <small>Winner was <span>Thomas Mitchell</span> – <i><span>Stagecoach</span></i></small></td></tr><tr><td><small><span>Best Art Direction</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Lionel Banks</span><br> <small>Winner was <span>Lyle R. Wheeler</span> – <i><span>Gone with the Wind</span></i></small></td></tr><tr><td><small><span>Best Film Editing</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Gene Havlick</span>, <span>Al Clark</span><br> <small>Winner was <span>Hal C. Kern</span>, <span>James E. Newcom</span> – <i><span>Gone with the Wind</span></i></small></td></tr><tr><td><small><span>Best Music, Scoring</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Dimitri Tiomkin</span><br> <small>Winner was <span>Herbert Stothart</span> – <i><span>The Wizard of Oz</span></i></small></td></tr><tr><td><small><span>Best Sound Recording</span></small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>John P. Livadary</span><br> <small>Winner was <span>Bernard B. Brown</span> – <i><span>When Tomorrow Comes</span></i></small></td></tr></tbody></table><h4>Other honors</h4><ul><li>Mr. Smith Goes to Washington was named as one of the best films of 1939 by The New York Times and Film Daily, and was nominated for Best Film by the National Board of Review.</li><li>James Stewart won the 1939 New York Film Critics Circle Award for Best Actor.</li><li>In 1989, Mr. Smith Goes to Washington was added to the United States National Film Registry as being deemed \"culturally, historically, or aesthetically significant\".</li></ul><h4>American Film Institute recognition</h4><ul><li>1998 AFI's 100 Years...100 Movies #29</li><li>2003 AFI's 100 Years...100 Heroes & Villains: Jefferson Smith, Hero #11 Senator Joseph Paine, Villain – Nominated</li><li>Jefferson Smith, Hero #11</li><li>Senator Joseph Paine, Villain – Nominated</li><li>2006 AFI's 100 Years...100 Cheers #5</li><li>2007 AFI's 100 Years...100 Movies (10th Anniversary Edition) #26</li></ul><br/><h3>Remakes</h3><ul><li>In 1949, Columbia planned, but never actually produced, a sequel to Mr. Smith Goes to Washington, called Mr. Smith Starts a Riot. They also considered doing a gender-reversed remake in 1952, with Jane Wyman playing the lead role.</li><li>A television series of the same name, Mr. Smith Goes to Washington, ran on ABC during the 1962–1963 season, starring Fess Parker, Sandra Warner and Red Foley.</li><li>Producer Frank Capra Jr. remade the film as part of Tom Laughlin's Billy Jack series, Billy Jack Goes to Washington (1977).</li><li>The film was also loosely remade as The Distinguished Gentleman (1992), starring Eddie Murphy.</li><li>The 2019 Australian political drama television series Total Control features a remarkably similar plot, this time with the new Senator being an Indigenous Australian woman played by Deborah Mailman recruited to the Australian Senate.</li></ul><br/><h3>In popular culture</h3><ul><li>The March 10, 1940 broadcast of Jack Benny's NBC radio show featured a parody entitled \"Mr. Benny Goes to Washington\".</li><li>The VHS release of Ernest Rides Again featured the opening Saturday Night Live-based short \"Mr. Bill Goes to Washington\".</li><li>The Simpsons has parodied it several times, including the third season episode \"Mr. Lisa Goes to Washington\", which deals with Lisa Simpson's disillusionment with Washington government, following her winning a trip to Washington as a prize in an essay contest; the eleventh season premiere \"Beyond Blunderdome\" which includes a remake of Mr. Smith Goes to Washington, starring Mel Gibson (voiced by himself) as Jefferson Smith; and the fourteenth season episode \"Mr. Spritz Goes to Washington\" .</li><li>For their 2002 season, the San Francisco Mime Troupe presented a musical, Mr. Smith Goes to Obscuristan, which tells the story of \"an idealistic innocent who learns firsthand what Presidency of George W. Bush means when it claims to support democratic principles at home and abroad\" in a post-9/11 setting.</li><li>The short-lived NBC political drama Mister Sterling (2003) was described as \"a Mr. Smith Goes to Washington for the 21st century\", with the show centering on an idealistic young senator from California, coming to grips with Washington and appointed by a scheming, underhanded governor.</li><li>In the TV series Highway to Heaven, the eleventh episode of season three is entitled, \"Jonathan Smith Goes to Washington\" (1986). The appeal made in that episode was regarding healthcare, and a filibuster was employed.</li><li>In the TV series Scandal, the third episode of season three is entitled, \"Mrs. Smith Goes to Washington\" (2013).</li></ul><br/>"
  },
  "errorMessage": ""
}