{
  "imDbId": "tt7286456",
  "title": "Joker",
  "fullTitle": "Joker (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "publisher": "IGN",
      "author": "Jim Vejvoda",
      "link": "",
      "rate": "100",
      "content": "Featuring a riveting, fully realized, and Oscar-worthy performance by Joaquin Phoenix, Joker would work just as well as an engrossing character study without any of its DC Comics trappings; that it just so happens to be a brilliant Batman-universe movie is icing on the Batfan cake. You will likely leave Joker feeling like I did: unsettled and ready to debate the film for years to come."
    },
    {
      "publisher": "Total Film",
      "author": "Jordan Farley",
      "link": "https://www.gamesradar.com/joker-movie-review/",
      "rate": "100",
      "content": "More character study than comic book movie, and anchored by an Oscar-worthy Joaquin Phoenix, Joker is a bravura blockbuster that proves you don’t need superpowered scraps to dazzle."
    },
    {
      "publisher": "Time Out",
      "author": "Phil de Semlyen",
      "link": "",
      "rate": "100",
      "content": "Joaquin Phoenix is devastating as the villain-in-the-making in this incendiary tale of psychological escape and psychopathy."
    },
    {
      "publisher": "",
      "author": "Empire",
      "link": "https://www.empireonline.com/movies/reviews/joker/",
      "rate": "100",
      "content": "Bold, devastating and utterly beautiful, Todd Phillips and Joaquin Phoenix have not just reimagined one of the most iconic villains in cinema history, but reimagined the comic book movie itself."
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/films/0/joker-review-joaquin-phoenix-good-fight-club-time/",
      "rate": "80",
      "content": "A part of me found Todd Phillips’s radical rethinking of the Batman villain Joker thrillingly uncompromising and hair-raisingly timely. Another thinks it should be locked in a strongbox then dropped in the ocean and never released."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "David Rooney",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/joker-review-1235309/",
      "rate": "80",
      "content": "This is Phoenix's film, and he inhabits it with an insanity by turns pitiful and fearsome in an out-there performance that's no laughing matter. Not to discredit the imaginative vision of the writer-director, his co-scripter and invaluable tech and design teams, but Phoenix is the prime force that makes Joker such a distinctively edgy entry in the Hollywood comics industrial complex."
    },
    {
      "publisher": "The Film Stage",
      "author": "Rory O'Connor",
      "link": "",
      "rate": "75",
      "content": "For all its merits, however, Joker relies on perhaps a touch too much exposition as it attempts to shape a digestible origin story."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/criticism/movies/joker-review-joaquin-phoenix-1202170236/",
      "rate": "58",
      "content": "It’s good enough to be dangerous, and bad enough to demand better. It’s going to turn the world upside down and make us all hysterical in the process. For better or worse, it’s exactly the movie the Joker would want."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/joker-film-review-joaquin-phoenix-robert-de-niro-dc-2019/",
      "rate": "55",
      "content": "The broadness of Phoenix’s work allows the rest of the ensemble — particularly Conroy, Zazie Beetz as a single-mom neighbor, and MVP character actors like Bill Camp, Shea Whigham and Brian Tyree Henry — to dial it down and give effectively human-size performances."
    },
    {
      "publisher": "RogerEbert.com",
      "author": "Glenn Kenny",
      "link": "https://www.rogerebert.com/reviews/joker-movie-review-2019",
      "rate": "50",
      "content": "As social commentary, Joker is pernicious garbage. But besides the wacky pleasures of Phoenix’s performance, it also displays some major movie studio core competencies, in a not dissimilar way to what “A Star Is Born” presented last year."
    }
  ],
  "errorMessage": ""
}