{
  "imDbId": "tt7286456",
  "title": "Joker",
  "fullTitle": "Joker (2019)",
  "type": "Movie",
  "year": "2019",
  "items": [
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8987715",
      "warningSpoilers": false,
      "date": "12 April 2023",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "The King of Tragedy...",
      "content": "Arthur Fleck's a guy with lofty aspirations, wants to make you laugh and disturb your foundations, although, he's not really that funny, he ain't going to make much money, so before you start, curtail your expectations; unlike Arthur, you won't be having laughing fits, as he aspires to get some television glitz, dispatches tormentors with glee, it's a substantial, hefty fee, but I guarantee, it won't leave you in bits; although, if schadenfreude's your thing you might just chuckle, but if it's not, the story may just make you buckle, as those on, the lower rungs, tend to not have, that much fun, and quite often, from the day they learned to suckle."
    },
    {
      "username": "TVpotatoCat",
      "userUrl": "https://www.imdb.com/user/ur53620903",
      "reviewLink": "https://www.imdb.com/review/rw5190060",
      "warningSpoilers": true,
      "date": "15 October 2019",
      "rate": "7",
      "helpful": "1,340 out of 1,963 found this helpful.",
      "title": "I would not call it a masterpiece as some did",
      "content": "There is no doubt that the movie was well thought of - from the plot to execution. I must praise Phoenix's superb acting. He managed to portray very believably the awkward social reject and also the crazy murderer that he became. I really think it's a role only few could do. It was also very interesting to watch how he deteriorated mentally and little by little gave up on trying to fit into society. Gotta hand it to the script writer - the plot was unpredictable.But...There wasn't anything too complex about Arthur's mental state. No deep psychological analysis, or a web of many deep factors that created a one of a kind psychotic maniac. Could it be that I was expecting too much? Very possible since I came with very high expectations after reading some reviews. What doesn't have anything with expectations is that at the end he didn't remind much of the original Joker. He felt more like a simply society reject that went completely crazy and started killing people. Not that much different from many other serial killers or mass murderers. He didn't have the master mind that so much designated the Joker and made him different from a simple murderer. Another thing is that there were long parts of the movie that felt very dull. Also I found it hard to buy the reason behind the riots in the city and the role the Joker played in them. Even if taken into account that the poverty and anger was cooking for a long time in that society, it still feels somewhat absurd that killing three people in the subway made the joker so notorious. In conclusion, I can identify with the character which gave me a lasting impression of the movie, and this movie could have been very great if it was a movie about how a person that's rejected by society turns slowly into a serial killer. But as a movie about the Joker I felt it was lacking. Lacking the things that made the Joker actually the Joker, and not just another crazy murderer."
    },
    {
      "username": "brianmlucas",
      "userUrl": "https://www.imdb.com/user/ur23097787",
      "reviewLink": "https://www.imdb.com/review/rw5162362",
      "warningSpoilers": false,
      "date": "5 October 2019",
      "rate": "9",
      "helpful": "953 out of 1,430 found this helpful.",
      "title": "Not a spoon feeding of CGI fueled faux drama.",
      "content": "The movie affects you in a way that makes it physically painful to experience, but in a good way."
    },
    {
      "username": "Aman_Goyal",
      "userUrl": "https://www.imdb.com/user/ur68129834",
      "reviewLink": "https://www.imdb.com/review/rw5092831",
      "warningSpoilers": false,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "3,143 out of 4,076 found this helpful.",
      "title": "Perfect in every aspect.",
      "content": "Truly a masterpiece, The Best Hollywood film of 2019, one of the Best films of the decade... And truly the Best film to bring a comic book so chillingly and realistically to real ife. Remarkable Direction, Cinematography, Music and the Acting. Some people are surprised to find it DISTURBING and VIOLENT, but it's a necessity and message. It's about society and reflects those underappreciated/unrecognized/bullied people, proving they can do something too. The way it shows class difference, corruption and how rich and talented rule others around them is not exaggerated and that's what makes it different. It's BELIEVABLE. There could be multiple JOKERs living in our society that could shake those around them in much bitter way than the film shows making people uncomforting people. Consider this a wake up call, a message, but first a film. A PERFECT film."
    },
    {
      "username": "Come-and-Review",
      "userUrl": "https://www.imdb.com/user/ur53645293",
      "reviewLink": "https://www.imdb.com/review/rw5093557",
      "warningSpoilers": false,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "1,594 out of 2,189 found this helpful.",
      "title": "A psychological study, rather than a superhero flick",
      "content": "I have seen Joker yesterday at Venice an early ill-fated screening. We had some trouble with audio that lead to a near-hour delay, but it definitely was worth it.Joker deserved to be presented at Venice Film Festival, an event that regards cinema as a form of art, because this film is far from a blockbuster or a mere entertainer movie, as most films in the genre are.It focuses on the psyche of the main character, as it slowly crumbles under the pressure of society. And thus, Joaquin Phoenix does a wonderful performance, earning almost surely a nomination at the oscars at least. It's a take on the Joker that differs from Ledger's, but I'd say that both are equally as good. The main difference might be that Ledger's joker is a rational that acts insane, while Phoenix's is insane to the root.Despite being a movie about a superhero villain, Joker is much superior to most of the movies of the genre (I'd exclude the Dark Knight Trilogy only, but Joker is easily as good as Nolan's movies, or at least very close). It is a small-scaled film, with a distinct style and cinematography (that cannot but be appreciated) and a set of very cinephile references that however do not feel too forced or overly opressive. (most notable are the similarities to Scorsese's 'Taxi Driver' and his 'The King of Comedy', but also Chaplin's 'Modern Times' is somewhat referenced).I am eager to see more non-comedic efforts by Todd Phillips. This movie was so far probably the best of 2019 (at worst contested so far only by Dolor Y Gloria or Once Upon a Time in Hollywood), and that should be very convincing."
    },
    {
      "username": "mariamelkott",
      "userUrl": "https://www.imdb.com/user/ur68236610",
      "reviewLink": "https://www.imdb.com/review/rw5159217",
      "warningSpoilers": false,
      "date": "3 October 2019",
      "rate": "10",
      "helpful": "1,852 out of 2,531 found this helpful.",
      "title": "Went for a second time to watch",
      "content": "I get why some people hate this . It's because of the political message and how some people think that you need get empathy for Arthur's madness. But come on that is not the point and it will never be. Enjoy this masterpiece because Joaquin Phoenix and Todd Phillips overdid themselves with this movie . The acting,music and cinematography are just amazing ! Please enjoy the movie without overthinking it."
    },
    {
      "username": "VallejoDiego",
      "userUrl": "https://www.imdb.com/user/ur60866846",
      "reviewLink": "https://www.imdb.com/review/rw5160176",
      "warningSpoilers": false,
      "date": "4 October 2019",
      "rate": "10",
      "helpful": "1,953 out of 2,617 found this helpful.",
      "title": "JUST AMAZING. How does this movie exist.",
      "content": "Let me start off by saying if Joaquin Phoneix doesn't get his Oscar for this movie. Then the Oscars should be cancelled. Phoneix is amazing as you might've heard from every review ever! But Todd Phillips. Is at his best here. The story lines he takes and visuals are just breathtaking. The score!! Omg the Score! Every time that score came on, I felt very uncomfortable, like something horrible was about to happen. It was GREAT. The Inspirations from Taxi Driver and King of Comedy are there, and add so much for the movie. And I got to be honest. There are scenes that are very violent. And its disturbing. But I honestly expected it to be WAYYYY more violent from all the controversy going on. Overall this movie was GREAT. Come Oscar season, it needs to be nominated for Best Picture, ScreenPlay, Cinematography, Actor, Score and Director"
    },
    {
      "username": "MihaVrhunc",
      "userUrl": "https://www.imdb.com/user/ur35451356",
      "reviewLink": "https://www.imdb.com/review/rw5159304",
      "warningSpoilers": false,
      "date": "3 October 2019",
      "rate": "10",
      "helpful": "3,537 out of 4,380 found this helpful.",
      "title": "Outstanding movie with a haunting performance and best character development ever seen",
      "content": "Every once in a while a movie comes, that truly makes an impact. Joaquin's performance and scenography in all it's brilliance. Grotesque, haunting and cringy. Hard to watch at times,... but so mesmerizing, you won't blink an eye watching it. Tragic, but with seriously funny moments. Emotional rollercoaster - sometimes, with multiple emotions popping-up at the same time.this is far from a typical action-riddled predictable super-hero movie - it's a proper psychological thriller/drama, with the single best character development I have ever seen."
    },
    {
      "username": "lesterarnoldpinto",
      "userUrl": "https://www.imdb.com/user/ur15820252",
      "reviewLink": "https://www.imdb.com/review/rw5168360",
      "warningSpoilers": false,
      "date": "7 October 2019",
      "rate": "10",
      "helpful": "3,423 out of 4,335 found this helpful.",
      "title": "Only certain people can relate",
      "content": "This is a movie that only those who have felt alone and isolated can truly relate to it. You understand the motive and you feel sorry for the character. A lot of people will see this movie and think that it encourages violence. But truly, this movie should encourage each and every one of us to become a better person, treat everyone with respect and make each other feel like they belong in this world, instead of making them feel isolated."
    },
    {
      "username": "ernestoherreraf",
      "userUrl": "https://www.imdb.com/user/ur87688280",
      "reviewLink": "https://www.imdb.com/review/rw5212774",
      "warningSpoilers": false,
      "date": "25 October 2019",
      "rate": "7",
      "helpful": "630 out of 992 found this helpful.",
      "title": "Is it great? I don't know.",
      "content": "When I heard everyone saying that this is the film of the year and all the reviews flooding in with 10's, I was quite hyped and excited for this movie. When I walked out of the cinema, I felt hollow and empty.Before I continue writing, let me say this, This is NOT the film of the year nor is it a real masterpiece. The cinematography is excellent and the acting is incredible, that's just it. The side-characters are bland and overly dramatic. The plot heavily relies on plot-twists and the film is so harsh that it actually falls flat on it's face.Are there no good points though? Phoenix is phenomenal and the score is great. The cinematography is also incredible but the plot is not that great at all. It even has plot holes and scenes that left me empty.Film of the year? Nope."
    },
    {
      "username": "johnnash-18420",
      "userUrl": "https://www.imdb.com/user/ur68065257",
      "reviewLink": "https://www.imdb.com/review/rw5092878",
      "warningSpoilers": false,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "1,524 out of 2,162 found this helpful.",
      "title": "Joaquin 'OSCAR', Joker = best Dark suspense thriller ... Darker than dark Knight.",
      "content": "It's sad that Joaquin missed Oscar for 'The gladiator' as he was very compelling Villain. But I am quite confident he will win it for the 'Joker'. Damn what a movie !!! Keeps u on the toes all the time. Unpredictable storyline and really a deep interesting plot. Did I forget to mention acting ? Damn Do niro and Joaquin teach u what really is 5 star acting. To enjoy this movie, get a wine in your hand, close the curtains, turn of ur cellphones and put do not disturb sign on ur door. Best Dark thriller suspense movie you will get to experience."
    },
    {
      "username": "RayCharles81",
      "userUrl": "https://www.imdb.com/user/ur14262019",
      "reviewLink": "https://www.imdb.com/review/rw5170121",
      "warningSpoilers": true,
      "date": "7 October 2019",
      "rate": "6",
      "helpful": "669 out of 1,092 found this helpful.",
      "title": "Worthy Acting Performance By Phoenix Worth a Watch, but This Joker is Not Smart Enough to Become the Joker We've Come to Know",
      "content": "Here, we have a broken man whose mental instability and illness is the catalyst for what Arthur Fleck eventually becomes, but I mean nowhere in this movie do we witness any kind of intellectual prowess, high intelligence, or even any miniscule reference to his wit and smarts to believe he has what it takes to become the Joker from the previous films.Also, there is merit to the theory that the whole entire movie was a dream playing out in his imagination, and he was conveying that to the psychiatrist the whole movie, which connects to the end since it starts with him meeting a psychiatrist and we know he was making things up by the revelations. In addition, there is no factuality to the idea that he was Thomas Wayne's lovechild. Joker is having a delusion of grandiose throughout the story, connecting himself to powerful people and situations, which would be a semi-trait of his narcissism, as well (although narcissism is far from his predominant psychological problems). I'd prefer this theory because it would explain why Fleck lacked any kind of pragmatism and intelligence we've come to expect throughout this movie.The Joker is playing the psychotherapist the whole time, making her feel sympathy and bad for him (as well as the audience), and that's the joke on her at the end, which enables him to kill her, too. This is Joker's own fantasy origin story, which has little validity.Go ahead and downvote, but there's no way this take on the Joker is intelligent and mentally competent enough to become Ledger's Joker."
    },
    {
      "username": "horrorgasm",
      "userUrl": "https://www.imdb.com/user/ur8035952",
      "reviewLink": "https://www.imdb.com/review/rw5408799",
      "warningSpoilers": false,
      "date": "14 January 2020",
      "rate": "",
      "helpful": "522 out of 901 found this helpful.",
      "title": "Yikes. THIS is people's \"best movie ever\"?",
      "content": "The recurring themes of so many of the 10 star reviews here should tell you a lot about this movie and its audience. If you can't get through a movie review without tossing in one or more claims that \"THIS movie is so much better and smarter than YOUR superhero movie\" (or even basing your entire review around this premise), then I hate to break it to you, but kid, you're nowhere near as intelligent and grown up as you think you are. This \"my comic publisher is better than yours\" BS should have been left behind on your grade school playground, it has absolutely no relevance to the quality of this movie, and your opinion of this movie should be considered highly suspect if you're in this group.I gotta say, if this movie was also your idea of the most perfect film ever made, you really need to get out more. Look, I get it. If you live in a safe little box where all you watch are superhero movies and mainstream blockbusters then I understand how exposure to themes like this for the first time would seem new and exciting to you, and I think we can all agree that this is probably the best DC Comics related movie in the last decade or so (though that's not a high bar to meet) and of course Joaquin Phoenix is a very talented actor, but stop and take a step back and look at this thing.Joker does indeed present a theme that is of importance to our society, that of the neglect and demonizing of the mentally ill to a degree that sometimes creates monsters which everyone around them should have seen coming a mile away if they hadn't been too busy looking away to avoid feeling uncomfortable. Unfortunately, reminding us all of the fact that this situation still exists is all this movie really has to say. It dances around important subjects like \"HEY KIDS, CLASS INEQUALITY!\", but then never offers any actual insight into them, usually because it's too busy making forced Batman references or dropping cringey little edgy moments like the \"Don't smile\" sign scene which seem to have been designed solely to have something for Hot Topic to print a new t-shirt of. Between that and every single plot twist being telegraphed so very far in advance because a lot of us have seen all these exact same twists so very many times before, I just wasn't impressed.Perhaps if this had been an actual stand-alone movie of its own instead of being shackled by its completely unnecessary ties to the Batman universe it could have done something more interesting with its themes. Don't get me wrong, I don't have any problem with superhero movies, but it just feels so gratuitous here, as if someone came up with this idea, pitched it to an executive, and was told \"sounds great, but can you make it a Batman movie somehow?\", and I'm sorry, but I'm just not into a movie trying to tell me a half-hearted, yet dead-serious speech about mental illness in modern society while simultaneously constantly reminding me that it's technically a superhero movie because $$$"
    },
    {
      "username": "postofficecb",
      "userUrl": "https://www.imdb.com/user/ur115622090",
      "reviewLink": "https://www.imdb.com/review/rw5784230",
      "warningSpoilers": false,
      "date": "30 May 2020",
      "rate": "5",
      "helpful": "127 out of 214 found this helpful.",
      "title": "Acting Cannot Save Mediocre Script",
      "content": "They say it's all in the writing. And this is a great example of that. Good acting and production values cannot save a script steeped in tiresome stereotypes and a failure to delve into a character's identity. We meet the Joker when already imbalanced and his so-called descent into madness is really a couple weeks away; far from a descent, it's a stroll. This is not a character study, despite claims to the contrary. It's a showcase of a good actor overly contorting his body and laughing manically as a mistaken expression of madness. Where is the past? Where are the influences? Where are the conflicts? What are the seminal moments that create the spiral? Perhaps if he had really had that relationship, and had it gone sour, it would justify a descent. Instead, it's a fait accompli. This is lazy writing, focused more on fancy long shots of Joaquin Phoenix dancing crazily than producing something of value to the franchise."
    },
    {
      "username": "logical_guy",
      "userUrl": "https://www.imdb.com/user/ur95026285",
      "reviewLink": "https://www.imdb.com/review/rw5092869",
      "warningSpoilers": false,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "2,571 out of 3,386 found this helpful.",
      "title": "MASTERPIECE ðŸ˜",
      "content": "Joaquin Phoenix gives a tour de force performance, fearless and stunning in its emotional depth and physicality. It's impossible to talk about this without referencing Heath Ledger's Oscar-winning performance from The Dark Knight, widely considered the definitive live-action portrayal of the Joker, so let's talk about it. The fact is, everyone is going to be stunned by what Phoenix accomplishes, because it's what many thought impossible - a portrayal that matches and potentially exceeds that of The Dark Knight's Clown Prince of Crime"
    },
    {
      "username": "burkholdermicah",
      "userUrl": "https://www.imdb.com/user/ur69497384",
      "reviewLink": "https://www.imdb.com/review/rw5096219",
      "warningSpoilers": false,
      "date": "2 September 2019",
      "rate": "10",
      "helpful": "1,254 out of 1,946 found this helpful.",
      "title": "Joker > Endgame",
      "content": "Need I say more? Everything about this Movie is Masterful in every single way! Joker isn't just an awesome comic book movie, it's an awesome movie, period. It offers no easy answers to the unsettling questions it raises about a cruel society in decline. Joaquin Phoenix's fully committed performance and Todd Phillips' masterful albeit loose reinvention of the DC source material make Joker a film that should leave comic book fans and non-fans alike disturbed and moved in all the right ways."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw5531830",
      "warningSpoilers": false,
      "date": "7 March 2020",
      "rate": "10",
      "helpful": "114 out of 176 found this helpful.",
      "title": "It's About a Man",
      "content": "While I've watched many of the superhero movies that have come down the pike, they are often the same. So the compensation for sensational plots involves great special effects and non-stop action. They are fun and I don't mean to dis them. What is missing is a truly psychological drama. We don't get into the heads of the characters. This film is incredible as we watch a man confront his demons. We see him made fun of, attacked, and beaten. When he responds, he is seen as crazy. He also find that he is diminished in the eye of a counselor, and his mother has kept a secret. I thought it gave us a foundation for the Batman mythos without getting to deeply into it. Acting, atmosphere, and a sophisticated plot makes this a really excellent film."
    },
    {
      "username": "kdagoulis26",
      "userUrl": "https://www.imdb.com/user/ur33655060",
      "reviewLink": "https://www.imdb.com/review/rw5160204",
      "warningSpoilers": false,
      "date": "4 October 2019",
      "rate": "10",
      "helpful": "2,239 out of 2,937 found this helpful.",
      "title": "The Hype is real",
      "content": "Most of the time movies are anticipated like this they end up falling short, way short. Joker is the first time I was more than happy with the hype. Please ignore the complaints of \"pernicious violence\" as they are embarrassing to say the least. We haven't seen a comic movie this real before. If we ever \"deserved\" a better class of criminal - Phillips and Phoenix have delivered. This is dark, Joker IS dark and you will fall in love with the villain as you should. The bad guys are always more romantic anyway."
    },
    {
      "username": "pejv22",
      "userUrl": "https://www.imdb.com/user/ur39291856",
      "reviewLink": "https://www.imdb.com/review/rw5093217",
      "warningSpoilers": true,
      "date": "1 September 2019",
      "rate": "10",
      "helpful": "906 out of 1,361 found this helpful.",
      "title": "Venice 76 review",
      "content": "I have just watched the Joker in Venice and I will say if Joaquin doesn't get an Oscar this year then something is wrong with this world. This perfomance is just jaw-dropping, it glues you to the screen and doesn't let go till the end. Story is very good and has some interesting connections with Batman lore(especially one you can't guess from trailers). There are some scenes that are so tense ,well-acted and imaginative that push this movie to 10. Cinematography and direction are great, Todd has proven himself as a director. Robert is also good in his \"small\" role. Will definitely see it again as soon as it out in October."
    },
    {
      "username": "Nhirscher",
      "userUrl": "https://www.imdb.com/user/ur57246624",
      "reviewLink": "https://www.imdb.com/review/rw5159968",
      "warningSpoilers": true,
      "date": "4 October 2019",
      "rate": "8",
      "helpful": "375 out of 617 found this helpful.",
      "title": "\"That's Life.\"",
      "content": "In an era of cinema so saturated with superheroes and gritty remakes, Todd Phillips and Phoenix somehow take a character so deeply intrenched in pop culture and create something compelling and unique. This film is unafraid to be bleak and scary without offering much to the viewer as a means of comfort. The only way we can deal with the harsh cruelties of the world is by treating it as a joke. Upon leaving this movie, you will not hate Joker, you will hate the world that made him.Phoenix simply cannot be praised enough. He brings both sympathy and tragedy in the way he moves his eyes, the way he contorts his shoulders, the way he laughs. A lesser actor would be unable to swing his moods from as far extremes as Phoenix does nor add the layers that Phoenix intricately builds for his character. The way he twists and writhes his body is mesmerizing and brings even more tragedy to the Joker. This is Phoenix's movie.As for the technical side, this movie is far different than any other super hero films of recent years. The cinematographer and director choose a shallow focus, giving Pheonix a) the undivided attention of the viewer and b) a more personal feel to the film. There are wide shots with deep focus, but they are used sparingly because this movie is about a character, not action or explosions. The color palette of this movie is intentionally composed of dour greens, blues and tepid yellows--- all of which gives the world a sickly feel. The soundtrack is used affectively, bringing waves of optimism to intentionally clash with our protagonist's angry depression. This film will likely be compared to The Dark Knight and DCEU films, which I don't find to be fair. This film is far more akin to The Machinist and The King of Comedy in tone and visual style.I recommend this film, and I think anything short of an Oscar nomination for Phoenix would be disrespectful to the effort he gives. However, I have one gripe I would like to voice. I found the tie-ins to the Wayne family to be unnecessary. It came across as pandering to an audience that loves Easter eggs more-so than the story itself. In my opinion, I think the story would have worked even better if it had distanced itself from the Batman story. Other than that, I had little issue with the rest of the film.Joker is a movie that tells us life is full of sadness, and then gives us a character whose purpose is to spread laughter and joy. I was going to finish this review with a joke, but, you wouldn't get it."
    },
    {
      "username": "HakuMashentay",
      "userUrl": "https://www.imdb.com/user/ur60609633",
      "reviewLink": "https://www.imdb.com/review/rw5230678",
      "warningSpoilers": false,
      "date": "2 November 2019",
      "rate": "7",
      "helpful": "772 out of 1,310 found this helpful.",
      "title": "OMG - Am I getting old or are people getting more stupid",
      "content": "I was so hyped up to see this movie, loved the trailer, only movie I have wanted to watch in the cinema for a very long time.I watched it and was bored. the aesthetics were amazing, music was good, story and execution was meh. the performance of the joker was a good performance but people raving about this are driving me mad. either you have not seen many movies or I have seen too many.this movie was bang average and was actually boring. I was actually thinking about leaving half way through as I was bored out of my mind.I do not regret watching it but it is being so overhyped that I am so confused right now. I think it had a good premise but could have been so much more, so much more.Signs of a great movie is the repeat viewing of it or it moving you, joker did not move me whatsoever and I would not watch it again.I thought maybe people are getting paid to write good review but have actually met people who think it is the best movie ever.... OMGGGThis movie is bang average and way overhyped.phoenix performance is good but as the story and execution is so bad, I feel he never even touched the higher spectrum of performance he could have with the character.I have experienced and seen worse in my life, if this made you feel, you are (i hate this word but have to use it) a snowflake. Please get off social media and live life.there is a real world out there."
    },
    {
      "username": "link9933",
      "userUrl": "https://www.imdb.com/user/ur12717785",
      "reviewLink": "https://www.imdb.com/review/rw5165511",
      "warningSpoilers": false,
      "date": "6 October 2019",
      "rate": "10",
      "helpful": "740 out of 1,124 found this helpful.",
      "title": "Good lord",
      "content": "The acting, cinematography, sound design, and the script itself is phenomenal. This movie is a triumph. Joaquin Pheonix deserves an Oscar win for this tbh."
    },
    {
      "username": "Red_Identity",
      "userUrl": "https://www.imdb.com/user/ur15562504",
      "reviewLink": "https://www.imdb.com/review/rw5179068",
      "warningSpoilers": false,
      "date": "11 October 2019",
      "rate": "",
      "helpful": "84 out of 150 found this helpful.",
      "title": "Well filmed but empty",
      "content": "What can I say about it that hasn't already been said? It's not a terrible film, but it's not a great (or even a really good one) either. The technical aspects are great. The score and cinematography are really good. Many individual scenes are also good. But as a whole, it just feels unnecessary. Not just that, but tone deaf as well. What it's trying to say about mental illness is problematic. Why? Because it's not really sure what it's trying to say or if it's even trying to say anything about it at all. Instead, it was added in there because, well, it's easy right? Joaquin Phoenix really does excel in many scenes of the film, but I'm not sure I would want him winning an Oscar for this. Overall, it's also just not that interesting. It's kind of... boring at times. And for a Joker film to be boring? That's a crucial offense. And I guess everyone is entitled to their opinion, but I seriously wonder if those people calling this a \"masterpiece\" have even seen Taxi Driver or The King of Comedy."
    },
    {
      "username": "romanwatson",
      "userUrl": "https://www.imdb.com/user/ur62045591",
      "reviewLink": "https://www.imdb.com/review/rw5166255",
      "warningSpoilers": false,
      "date": "6 October 2019",
      "rate": "7",
      "helpful": "741 out of 1,114 found this helpful.",
      "title": "Between a 7 and an 8",
      "content": "I thought this film was good but I just don't get the hype personally. The acting was amazing and the film was good overall but I think 'masterpiece' and 'film of the year' are a bit overused throughout the reviews. In no way did I dislike this film, I thought it was really good, just overhyped. I feel as though a lot of the 10/10 reviews are purely based on the fact that it already has amazing reviews and so people want to carry the praise further and that it is about the joker. If this film was released and was about some random guy in the same situation, I don't think the reviews would be as high but maybe that's the point."
    },
    {
      "username": "piecookie",
      "userUrl": "https://www.imdb.com/user/ur22570902",
      "reviewLink": "https://www.imdb.com/review/rw5201147",
      "warningSpoilers": true,
      "date": "20 October 2019",
      "rate": "5",
      "helpful": "751 out of 1,254 found this helpful.",
      "title": "Extremely overrated",
      "content": "I know this is an unpopular opinion, but honestly this movie is overrated and boring. 2 hours felt like 3 and a half.I don't buy the whole thing where he is invited to the show. The meta \"standup\" he made was extremely dull and boring. Then gets allowed to broadcast for that long without being interrupted, also being transported in the most shitty police-car ever after that, it's just not believeable enough to me.He also acted the same when he was on meds aswell as off, so that part didn't make sense either. The police must also be really not catching this guy faster after the homocide.It has some good parts but they can be boiled down to maybe 5 minutes. Is this a movie I would watch again? Probably not."
    }
  ],
  "errorMessage": ""
}