{
  "imDbId": "tt7286456",
  "title": "Joker",
  "fullTitle": "Joker (2019)",
  "type": "Movie",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "Joker (2019 film)",
  "url": "https://en.wikipedia.org/wiki/Joker_(2019_film)",
  "plotShort": {
    "plainText": "Joker is a 2019 American neo-noir psychological thriller film directed by Todd Phillips, who also co-wrote the screenplay with Scott Silver. The film, based on DC Comics characters, stars Joaquin Phoenix as the Joker and serves as a standalone origin story for the character. Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comic whose descent into mental illness and nihilism inspires a violent countercultural revolution against the prosperous in a decaying Gotham City. Robert De Niro, Zazie Beetz and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.\r\nPhillips conceived Joker in 2016 and wrote the script with Silver throughout 2017. The two were inspired by 1970s character studies and the films of Martin Scorsese, particularly Taxi Driver (1976) and The King of Comedy (1982), who was initially attached to the project as a producer. The film loosely adapts plot elements from Batman: The Killing Joke (1988), but Phillips and Silver otherwise did not look to specific comics for inspiration. Phoenix became attached in February 2018 and was cast that July, while the majority of the cast signed on by August. Principal photography took place in New York City, Jersey City and Newark, from September to December 2018. Joker is the first live-action theatrical Batman film to receive an R rating from the Motion Picture Association.\r\nJoker premiered at the 76th Venice International Film Festival on August 31, 2019, where it won the Golden Lion and was theatrically released in the United States on October 4, 2019. The film received polarizing reviews from critics, with praise directed toward Phoenix's performance, Phillips' direction, the visual style, editing, musical score, and cinematography, while the tone, portrayal of mental illness, and handling of violence divided opinions. The film was a box office success and set records for an October release. It grossed over $1 billion, the first R-rated film to do so and became the sixth-highest-grossing film of 2019 during its theatrical run. The film also received numerous accolades.\r\nA sequel, Joker: Folie à Deux, is scheduled to be released on October 4, 2024.",
    "html": "<p>Joker is a 2019 American neo-noir psychological thriller film directed by Todd Phillips, who also co-wrote the screenplay with Scott Silver. The film, based on DC Comics characters, stars Joaquin Phoenix as the Joker and serves as a standalone origin story for the character. Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comic whose descent into mental illness and nihilism inspires a violent countercultural revolution against the prosperous in a decaying Gotham City. Robert De Niro, Zazie Beetz and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.</p><p>Phillips conceived Joker in 2016 and wrote the script with Silver throughout 2017. The two were inspired by 1970s character studies and the films of Martin Scorsese, particularly Taxi Driver (1976) and The King of Comedy (1982), who was initially attached to the project as a producer. The film loosely adapts plot elements from Batman: The Killing Joke (1988), but Phillips and Silver otherwise did not look to specific comics for inspiration. Phoenix became attached in February 2018 and was cast that July, while the majority of the cast signed on by August. Principal photography took place in New York City, Jersey City and Newark, from September to December 2018. Joker is the first live-action theatrical Batman film to receive an R rating from the Motion Picture Association.</p><p>Joker premiered at the 76th Venice International Film Festival on August 31, 2019, where it won the Golden Lion and was theatrically released in the United States on October 4, 2019. The film received polarizing reviews from critics, with praise directed toward Phoenix's performance, Phillips' direction, the visual style, editing, musical score, and cinematography, while the tone, portrayal of mental illness, and handling of violence divided opinions. The film was a box office success and set records for an October release. It grossed over $1 billion, the first R-rated film to do so and became the sixth-highest-grossing film of 2019 during its theatrical run. The film also received numerous accolades.</p><p>A sequel, Joker: Folie à Deux, is scheduled to be released on October 4, 2024.</p>"
  },
  "plotFull": {
    "plainText": "Joker is a 2019 American neo-noir psychological thriller film directed by Todd Phillips, who also co-wrote the screenplay with Scott Silver. The film, based on DC Comics characters, stars Joaquin Phoenix as the Joker and serves as a standalone origin story for the character. Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comic whose descent into mental illness and nihilism inspires a violent countercultural revolution against the prosperous in a decaying Gotham City. Robert De Niro, Zazie Beetz and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.\r\nPhillips conceived Joker in 2016 and wrote the script with Silver throughout 2017. The two were inspired by 1970s character studies and the films of Martin Scorsese, particularly Taxi Driver (1976) and The King of Comedy (1982), who was initially attached to the project as a producer. The film loosely adapts plot elements from Batman: The Killing Joke (1988), but Phillips and Silver otherwise did not look to specific comics for inspiration. Phoenix became attached in February 2018 and was cast that July, while the majority of the cast signed on by August. Principal photography took place in New York City, Jersey City and Newark, from September to December 2018. Joker is the first live-action theatrical Batman film to receive an R rating from the Motion Picture Association.\r\nJoker premiered at the 76th Venice International Film Festival on August 31, 2019, where it won the Golden Lion and was theatrically released in the United States on October 4, 2019. The film received polarizing reviews from critics, with praise directed toward Phoenix's performance, Phillips' direction, the visual style, editing, musical score, and cinematography, while the tone, portrayal of mental illness, and handling of violence divided opinions. The film was a box office success and set records for an October release. It grossed over $1 billion, the first R-rated film to do so and became the sixth-highest-grossing film of 2019 during its theatrical run. The film also received numerous accolades.\r\nA sequel, Joker: Folie à Deux, is scheduled to be released on October 4, 2024.\r\nPlot\r\nA clown and aspiring stand-up comedian named Arthur Fleck lives with his mother, Penny, in crime-ridden Gotham City. Arthur suffers from a neurological disorder that causes him to have random, uncontrollable laughing fits, requiring medication for which he depends on social services. After Arthur is attacked by juvenile delinquents, his co-worker Randall gives him a revolver for self-defense. Arthur pursues a relationship with his neighbor, single mother Sophie, and invites her to see his routine at a comedy club.\r\nArthur is fired from his job at a children's hospital when he accidentally exposes the gun despite his explanation that it was given to him by Randall, who denies this. While riding home on the subway still wearing his clown makeup, Arthur is mocked and beaten by drunk businessmen from Wayne Investments; he fatally shoots two of them in self-defense and murders the third as he attempts to flee. The killings are condemned by their employer, billionaire mayoral candidate Thomas Wayne. Protesters begin donning clown masks in Arthur's image. Budget cuts shut down the social service program, leaving Arthur without his medication.\r\nSophie attends Arthur's stand-up routine, which goes poorly; he laughs uncontrollably, and his jokes fall flat. Arthur intercepts a letter from Penny to Thomas, alleging that he is Thomas' illegitimate son, and berates his mother for hiding the truth. He goes to Wayne Manor, where he meets Thomas's young son Bruce, but flees after a scuffle with family butler Alfred Pennyworth. Penny suffers a stroke and is hospitalized. Arthur's idol, popular late-night talk show host Murray Franklin, presents clips of Arthur's failed performance on his show and mocks him.\r\nArthur confronts Thomas at a film theatre. Thomas tells him that he is not his father, and Penny is not his biological mother. In denial, Arthur visits Arkham State Hospital and steals Penny's file, which states she was a narcissist who adopted Arthur while working as a housekeeper for the Waynes in the 1950s. Penny then raised Arthur with her abusive boyfriend, who later died in jail. Penny was sent to Arkham for allowing the abuse. Distraught, Arthur enters Sophie's apartment unannounced. Frightened, Sophie asks him to leave, revealing their relationship to be a figment of Arthur's imagination. The following day, Arthur smothers Penny to death at the hospital.\r\nAfter his stand-up clips go viral, Arthur is invited to appear on Murray's show. He subsequently plans to commit suicide during the broadcast. While crafting a clown-inspired persona, he is visited by Randall and another ex-colleague, Gary. Arthur kills Randall, but spares Gary for his kindness to Arthur in the past. Two detectives investigating Arthur's involvement in the murders of the businessmen pursue him onto a subway filled with clown protesters. One detective accidentally shoots and kills a protester, thus inciting a riot, while Arthur escapes.\r\nBefore the show goes live, Arthur asks Murray to introduce him as \"Joker.\" Arthur begins telling morbid jokes, confesses to the subway murders, rants about how society abandons the downtrodden and mentally ill, and berates Murray for ridiculing him. After one more morbid joke, Arthur fatally shoots him on air. He is arrested, and riots erupt across Gotham. One of the rioters corners the Wayne family in an alley and murders Thomas and his wife, sparing Bruce. Rioters in an ambulance crash into the police car carrying Arthur, freeing him; he stands atop the car, starts to dance to the cheers of the crowd, and smears blood on his face into the shape of a smile.\r\nAt Arkham, Arthur laughs to himself about a joke whilst with a therapist, but declines to tell it, claiming she wouldn't get it. He leaves behind a trail of bloodied shoeprints as he is chased down a corridor by an orderly.\r\nCast\r\nJoaquin Phoenix as Arthur Fleck / Joker: A mentally ill, impoverished party clown and stand-up comedian disregarded by society, whose history of abuse causes him to become a nihilistic criminal with a clown-themed persona. Phoenix had been interested in a low-budget \"character study\" of a comic book character and said the film \"feels unique, it is its own world in some ways and maybe It might as well be the thing that scares you the most.\" Phoenix lost 52 pounds (23 kg) for his role in the film.\r\nRobert De Niro as Murray Franklin: A talk show host who plays a role in Arthur's downfall. De Niro said his role in Joker pays homage to his character from The King of Comedy (1983), Rupert Pupkin, who is a comedian obsessed with a talk-show host.\r\nZazie Beetz as Sophie Dumond: A cynical single mother and Arthur's \"love interest\". Beetz, a \"huge fan\" of Phoenix, said that it was \"an honor\" to costar with him and that she learned a lot working with him on set.\r\nFrances Conroy as Penny Fleck: Arthur's mentally and physically ill mother, who formerly worked for Thomas Wayne. Canadian actress Hannah Gross portrays a young Penny.\r\nAdditionally, Brett Cullen portrays Thomas Wayne, a billionaire running for mayor of Gotham. Alec Baldwin was initially cast in the role, but dropped out due to scheduling conflicts. Carrie Louise Putrello portrays Thomas's wife Martha, although the character has no lines and is never referred to by name. Douglas Hodge plays Alfred Pennyworth, the butler and caretaker of the Wayne family, and Dante Pereira-Olson plays Bruce Wayne, Thomas' son, who becomes the Joker's archenemy Batman as an adult.\r\nAdditional cast members include Glenn Fleshler and Leigh Gill as Randall and Gary, Arthur's clown co-workers; Bill Camp and Shea Whigham as detectives Garrity and Burke in the Gotham City Police Department; Marc Maron as Gene Ufland, a producer on Franklin's show; Sharon Washington as Arthur's social worker; Josh Pais as Hoyt Vaughn, Arthur's agent; Brian Tyree Henry as Clark, a clerk at Arkham State Hospital; Ben Warheit, Michael Benz and Carl Lundstedt as bankers who harass Arthur; Gary Gulman and Sam Morril as comedians at an open mic where Arthur performs; and Bryan Callen as Javier, a co-worker of Arthur. Justin Theroux has an uncredited cameo as Ethan Chase, a celebrity guest on Franklin's show.\r\nProduction\r\nDevelopment\r\nBetween 2014 and 2015, Joaquin Phoenix expressed interest to his agent in acting in a low-budget \"character study\" type of film about a comic book villain, like DC Comics character the Joker. Phoenix had thought of the idea 1 to 2 years before Phillips conceived Joker in 2016. Phoenix had previously declined to act in the Marvel Cinematic Universe because he would have been required to reprise a role, such as the Hulk (initially portrayed by Edward Norton before he was recast by Mark Ruffalo) or Doctor Strange, in multiple films. Phoenix ruled out the Joker for his \"character study\" idea and tried to think of a different one. \"I thought, 'You can't do the Joker, because, you know, it's just you can't do that character, it's just been done.'\" Phoenix's agent suggested setting up an exploratory meeting with Warner Bros., but he declined and let go of the idea. Similarly, Todd Phillips had been offered to direct comic-based films a number of times, but declined because he thought they were \"loud\" and did not interest him. According to Phillips, Joker was created from his idea to create a different, more grounded comic book film. He was attracted to the Joker because he did not think there was a definitive portrayal of the character, which he knew would provide considerable creative freedom.\r\nPhillips pitched the idea for Joker to Warner Bros. after his film War Dogs premiered in August 2016. Prior to War Dogs, Phillips was mostly known for his comedy films, such as Road Trip (2000), Old School (2003) and The Hangover (2009); War Dogs marked a venture into more unsettling territory. During the premiere, Phillips realized \"War Dogs wasn't going to set the world on fire and I was thinking, 'What do people really want to see?'\" In addition, he found that it was difficult to make comedy films in the \"woke culture\", throughout opposition of \"30 million people on Twitter\". He finally thought that \"How do I do something irreverent, but fuck comedy? Oh I know, let's take the comic book movie universe and turn it on its head with this\". He proposed that DC Films differentiate its slate from the competing Marvel Studios' by producing low-budget, standalone films. After the successful release of Wonder Woman (2017), DC Films decided to deemphasize the shared nature of its DC-based film franchise, the DC Extended Universe (DCEU). In August 2017, Warner Bros. and DC Films revealed plans for the film, with Phillips directing and co-writing with Scott Silver and Martin Scorsese set to co-produce with Phillips. According to Tatiana Siegel of The Hollywood Reporter, Scorsese considered directing Joker before Phillips was chosen, though a Warner Bros. source said he only became involved because the film needed a New York City-based producer.\r\nAccording to Kim Masters and Borys Kit of The Hollywood Reporter, Jared Leto, who portrayed the Joker in the DCEU, was displeased by the existence of a project separate from his interpretation. In October 2019, Masters reported that Leto \"felt 'alienated and upset'\" when he learned that Warner Bros.—which had promised him a standalone DCEU Joker film—let Phillips proceed with Joker, going as far as to ask his music manager Irving Azoff to get the project canceled. Masters added that Leto's irritation was what caused him to end his association with Creative Artists Agency (CAA), as he believed \"his agents should have told him about the Phillips project earlier and fought harder for his version of Joker.\" However, sources associated with Leto deny that he attempted to get Joker canceled and left CAA because of it.\r\nWarner Bros. pushed for Phillips to cast Leonardo DiCaprio as the Joker, hoping to use his frequent collaborator Scorsese's involvement to attract him. However, Phillips said that Phoenix was the only actor he considered, and that he and Silver wrote the script with Phoenix in mind, \"The goal was never to introduce Joaquin Phoenix into the comic book movie universe. The goal was to introduce comic book movies into the Joaquin Phoenix universe.\" Phoenix said when he learned of the film, he became excited because it was the kind he was looking to make, describing it as unique and stating it did not feel like a typical \"studio movie.\" It took him some time to commit to the role, as it intimidated him and he said \"oftentimes, in these movies, we have these simplified, reductive archetypes and that allows for the audience to be distant from the character, just like we would do in real life, where it's easy to label somebody as evil and therefore say, 'Well, I'm not that.'\"\r\nWriting\r\nIt was a yearlong process from when we finished the script just to get the new people on board with this vision, because I pitched it to an entirely different team than made it. There were emails about: 'You realize we sell Joker pajamas at Target.' There were a zillion hurdles, and you just sort of had to navigate those one at a time At the time, I would curse them in my head every day. But then I have to put it in perspective and go, 'They're pretty bold that they did this.'\r\n– Todd Phillips\r\nPhillips and Silver wrote Joker throughout 2017 and the writing process took about a year. According to producer Emma Tillinger Koskoff, it took some time to get approval for the script from Warner Bros., partly because of concerns over the content. Similarly, Phillips commented that there were \"a zillion hurdles\" during the year-long writing process due to the visibility of the character. Phillips said that while the script's themes may reflect modern society, the film was not intended to be political. He also noted that Joker is a story about child trauma and mental illness. In their script, Phillips talked about how difficult it is for patients to reveal their diagnoses, referring to a line from the film: \"The worst part of having a mental illness is that people expect you to behave as if you don't.\"\r\nThe script draws inspiration from Scorsese films such as Taxi Driver (1976), Raging Bull (1980) and The King of Comedy (1983), as well as Phillips' Hangover Trilogy. Other films Phillips has cited as inspiration include character studies released in the 1970s—such as Serpico (1973) and One Flew Over the Cuckoo's Nest (1975)—the silent film The Man Who Laughs (1928) and several musicals. Phillips said that aside from the tone, he did not consider Joker that different from his previous work, such as his Hangover films. The film's premise was inspired by Alan Moore and Brian Bolland's graphic novel Batman: The Killing Joke (1988), which depicts the Joker as a failed stand-up comedian, while the climactic talk show scene was inspired by a similar scene in Frank Miller's The Dark Knight Returns (1986). However, Phillips said the film does not \"follow anything from the comic books... That's what was interesting to me. We're not even doing Joker, but the story of becoming Joker.\" Phillips later clarified that he meant they did not look to a specific comic for inspiration, but rather \"picked and chose what we liked\" from the character's history. Having grown up in New York, Phillips also drew inspiration from life in New York City during the early 1980s. The Subway shooting scene and its aftermath were inspired by the 1984 New York City Subway shooting, while Arthur Fleck is partially based on the shooting's perpetrator, Bernhard Goetz.\r\nPhillips and Silver found the most common Joker origin story, in which the character is disfigured after falling into a vat of acid, too unrealistic. Instead, they used certain elements of the Joker lore to produce an original story, which Phillips wanted to feel as authentic as possible. Because the Joker does not have a definitive origin story in the comics, Phillips and Silver were given considerable creative freedom and \"pushed each other every day to come up with something totally insane.\" While the Joker had appeared in several films before, Phillips thought it was possible to produce a new story featuring the character. \"It's just another interpretation, like people do interpretations of Macbeth,\" he told The New York Times. However, they did try to retain the ambiguous \"multiple choice\" nature of the Joker's past by positioning the character as an unreliable narrator—with entire storylines simply being his delusions—and left what mental illnesses he suffers from unclear. As such, Phillips said the entire film is open to interpretation.\r\nWhen a draft of the film's script, written in April 2018, was leaked and spread on the internet, Phillips stated that it was an old version from six months before filming began. Phillips also declined to take legal action against the spread of the script, stating that he liked having an old version circulate.\r\nPre-production\r\nFollowing the disappointing critical and financial performance of Justice League (2017), in January 2018 Walter Hamada replaced Jon Berg as the head of DC-based film production at Warner Bros. Hamada sorted through the various DC films in development, canceling some while advancing work on others; the film was set to begin filming in late 2018 with a small budget of $55 million. Kim Masters of The Hollywood Reporter said Warner Bros. was reluctant to let Joker move forward and gave it a small budget in an effort to dissuade Phillips. Phillips said that Hamada did not understand what he was trying to do. By June, Robert De Niro was under consideration for a supporting role in the film. The deal with Phoenix was finalized in July 2018, after four months of persuasion from Phillips. Immediately afterwards, Warner Bros. officially green-lit the film, titled it Joker and gave it an October 4, 2019, release date. Warner Bros. described the film as \"an exploration of a man disregarded by society is not only a gritty character study, but also a broader cautionary tale.\"\r\nScorsese's longtime associate Koskoff joined to produce, although Scorsese left his producing duties due to other obligations. Scorsese considered serving as an executive producer, but was preoccupied with his film The Irishman. It was also confirmed that the film would have no effect on Leto's Joker and would be the first in a new series of DC films unrelated to the DCEU. In July, Zazie Beetz was cast in a supporting role and De Niro entered negotiations in August. Frances McDormand declined an offer to portray the mother of the Joker and Frances Conroy was cast. At the end of July, Marc Maron, and Bryan Callen joined the cast. Alec Baldwin was cast as Thomas Wayne on August 27, but dropped out two days later due to scheduling conflicts. Baldwin also noted the character's description as a reason for his departure, which called Thomas Wayne \"a cheesy and tanned businessman who is more in the mold of a 1980s Donald Trump\".\r\nFilming\r\nPrincipal photography commenced in September 2018 in New York City, under the working title Romeo. Shortly after filming began, De Niro, Brett Cullen, Shea Whigham, Glenn Fleshler, Bill Camp, Josh Pais and Douglas Hodge were announced to have joined the film, with Cullen replacing Baldwin. Bradley Cooper joined the film as a producer, and the director of photography was Lawrence Sher, both of whom Phillips had previously collaborated with. On September 22, a scene depicting a violent protest was filmed at the Church Avenue station in Kensington, Brooklyn, although the station was modified to look like the Bedford Park Boulevard station in the Bronx. Filming of violent scenes also took place at the abandoned lower platform of the Ninth Avenue station in Sunset Park, Brooklyn.\r\nAccording to Beetz, Phillips rewrote the entire script during production; because Phoenix lost so much weight for the film, there would not be an opportunity for reshoots. She recalled, \"we would go into Todd's trailer and write the scene for the night and then do it. During hair and makeup we'd memorize those lines and then do them and then we'd reshoot that three weeks later.\" Phillips recalled Phoenix sometimes walked off-set during filming because he lost self-control and needed to compose himself—to the confusion of other actors, who felt they had done something wrong. De Niro was one of the few Phoenix never walked out on and De Niro said he was \"very intense in what he was doing, as it should be, as he should be.\"\r\nFilming in Jersey City started on September 30 and shut down Newark Avenue, while filming in November, starting on November 9, shut down Kennedy Boulevard. Filming in Newark began on October 13 and lasted until October 16. Shortly before the Newark filming, SAG-AFTRA received a complaint that extras were locked in subway cars for more than three hours during filming in Brooklyn, a break violation. The issue was quickly resolved after a representative visited the set. That month, Dante Pereira-Olson joined the cast as a young Bruce Wayne. Whigham said towards the end of October the film was in \"the middle\" of production, adding that it was an \"intense\" and \"incredible\" experience. By mid-November, filming had moved back to New York. Filming wrapped on December 3, 2018, with Phillips posting a picture on his Instagram feed later in the month to commemorate the occasion.\r\nIn The Hollywood Reporter interview, Emma Tillinger Koskoff said that most stressful filming was the \"Stair Dance\" scene; because there were no laws on paparazzi in New York City, filming was disrupted by them. Initially, Lawrence Sher and Phillips had wanted to film on 65mm film for the 70mm format, but Warner Bros. rejected this due to cost, and the film was subsequently shot in using Arri Alexa 65 digital cameras. Warner Bros. did however end up giving Joker a limited theatrical release in converted 70mm and 35mm presentations.\r\nPost-production\r\nPhillips confirmed he was in the process of editing Joker in March 2019. At CinemaCon the following month, he stated the film was \"still taking shape\" and was difficult to discuss, as he hoped to maintain secrecy. Phillips also denied most reports surrounding the film, which he felt was because it is \"an origin story about a character that doesn't have a definitive origin.\" Brian Tyree Henry was also confirmed to have a role in the film. The visual effects were provided by Scanline VFX and Shade VFX and supervised by Matthew Giampa and Bryan Godwin, with Erwin Rivera serving as the overall supervisor. Joker used less VFX work than other comics films, except few scenes including that Arthur smeared smile by his blood in crowd.\r\nOne scene that was cut from the film depicted Sophie watching Arthur's appearance on Franklin's show. The scene was intended to show the audience that she is still alive (as the film otherwise implies that Arthur kills her), but Phillips decided it would disrupt the narrative, which is portrayed from Arthur's point of view. In another deleted scene, Arthur reveals his crimes to a co-worker; the scene was ultimately removed because it provided \"too much information\" in the form of exposition.\r\nThe film's final budget was $55–70 million, considered by The Hollywood Reporter \"a fraction\" of the cost of a typical comic book-based film. In comparison, the previous villain-centered DC film, Suicide Squad (2016), cost $175 million. $25 million of Joker's budget was covered by the Toronto-based financing company Creative Wealth Media, while Village Roadshow Pictures and Bron Studios each contributed 25%. Joker was also the first live-action theatrical film in the Batman film franchise to receive an R rating from the Motion Picture Association of America, officially for \"strong bloody violence, disturbing behavior, language and brief sexual images.\" In the United Kingdom, the BBFC gave the film a 15 certificate for \"strong bloody violence language\".\r\nDesign\r\nSet\r\nGotham City in Joker was set in 1980s New York City, according to Todd Phillips, \"to separate it, quite frankly, from the DC universe\". Mark Friedberg, the production designer of this film, said he established the filming location of Gotham Square in Newark as a film set because there was still poverty. He wanted Gotham to look like a gritty city, as described in Taxi Driver, therefore named all structures and lines in this film and drew a specific map of Gotham city. He displayed 1970s brightly colored muscle cars on the set, \"conveying dissonance and being awful and beautiful at the same time\". He also tried to describe Gotham as a decaying city through graffiti, garbage on the road and cracked sidewalks. The VFX team added fictional buildings, changing the skyline of the city to give the sense that the city was pressing down on Arthur. Lawrence Sher said sodium-vapor lights were used in this film, representing Arthur's isolation and his more hopeful side.\r\nArkham State Hospital is based on Arkham Asylum. Warner Bros. Korea explained that it is a more realistic name in the real world. The exterior of Arkham State hospital was filmed at Brooklyn Army Terminal, while the interior was pictured in Metropolitan Hospital Center of Harlem. Throughout the film, two walls are shown inside Arkham State Hospital; one is clearly white in the first and last scenes, the other is dirty yellow in the scene in which Arthur runs with a medical report. This difference was intended to make the audience confused and to question the possibility that Arthur had been in hospital the entire time.\r\nCharacter design\r\nOne of the most important inspiration affected behavior of Arthur is Little Tramp in Modern Times. Phillips confirmed that his ridiculous movement was referred from Charlie Chaplin, in commentary video of Vanity Fair. Phoenix revealed that Arthur's dance was inspired by that of Ray Bolger, while the gesture making smile by two fingers was from scarecrow in The Wizard of Oz. In preparation, Phoenix lost 52 pounds (24 kg) to look “wolf-like and malnourished and hungry.”, and based his laugh on \"videos of people suffering from pathological laughter.\" He also sought to portray a character who audiences could not identify with and did not look to previous Joker actors for inspiration; instead, he read a book about political assassinations so he could understand killers and motivations.\r\nIn a behind-the-scenes video, Phillips explained that Arthur's normal face is the real mask and the Joker is the true personality. He also said, in LA Times interview, that the genuine laugh of Arthur is only in the last scene. Director Todd Phillips said that he intentionally left it ambiguous as to whether Arthur becomes the Joker of traditional Batman stories or inspires a separate character, although Phoenix believes that Arthur is the former.\r\nMake-up and costumes\r\nNicki Ledermann and Kay Georgiou, the makeup designer and hairstylist tried to show Arthur Fleck to \"be handmade and realistic\". Georgiou designated Arthur as a man with unwashed hair. Arthur's costumes, designed by Mark Bridges, were matched to look \"aged, overdyed and distressed\" through wearing him with cheap polyester pants and acrylic sweater. His color palette was set in '80s; blue, maroon, brown, mauve and gray. In Deadline Hollywood interview, Bridges explained Arthur's costume color started to juvenile mode, going darker with the tone of the story. In the first scene, Arthur's \"too small\" hooded jacket and white socks emphasize the childish concept. It was a reflection of him living with his mother Penny, with her calling him \"my little boy\", and the influence of Charlie Chaplin. However, he wore a charcoal sweater in the interview with the social worker and finally was in a \"scab-colored knit top\" in Arkham State Hospital. A line depicting his old suit for many years was interpreted a mustard-toned vest and a patterned bottle-green shirt. Meanwhile, Arthur in doctor costume is the homage of Joker in The Dark Knight, wearing nurse uniform to meet Harvey Dent in Gotham Hospital.\r\nAfter turning Arthur into Joker, his design was also changed. His hair was dyed \"broccoli\" green and he wore a suit similar to the one in the original Batman series. However, the Joker suit in this film had different colors compared to previous films (purple suit with a green or yellow shirt). Mark Bridges noted that it was result of Phillips' intention to not want to be \"connected to anything else\". Initially, the color of the suit in the script was set to terracotta, but Bridges changed this to red to give \"more expressive\" emotion. Additionally, his suit colors (green, yellow, purple and red) were compared with those of his antagonists, including Thomas Wayne, giving them to gray and blue like Batman. Clown makeup was drawn with a classic, antique feel, with darker colors and tones and menacing eyebrows. Due to copyright laws stating that no two clowns can look alike, Ledermann faced a challenge.\r\nMusic\r\nIn August 2018, Hildur Guðnadóttir was hired to compose the film's score. Hildur began writing music after reading the script and meeting with Phillips, who \"had a lot of strong ideas\" about how he thought the score should sound. She worked on the Joker score alongside the score for the drama miniseries Chernobyl; Hildur told The Hindu's Divya-Kala Bhavani switching between the two was challenging because the scores were so different.\r\nAdditionally, the film features the songs \"That's Life\", \"Send In the Clowns\", \"White Room\" and \"Rock and Roll Part 2\". The use of \"Rock and Roll Part 2\" generated controversy when it was reported that its singer, convicted child sex offender Gary Glitter, would receive royalties, but it was later confirmed he would not. The score was released on October 2, 2019, by WaterTower Music. Hildur's music won numerous awards including an Academy Award, a Satellite Award, a Saturn Award, the Hollywood Music in Media Awards (HMMA) and the Golden Globe Award for Best Original Score, with the latter making her the first woman to win as a solo composer in that category.\r\nMarketing\r\nPhillips promoted the film by posting on set photos on his Instagram account. On September 21, 2018, he released test footage of Phoenix in-costume as the Joker, with \"Laughing\" by The Guess Who accompanying the footage. At CinemaCon on April 2, 2019, Phillips unveiled the first trailer for the film, which was released online the following day. The trailer, prominently featuring the song \"Smile\" performed by Jimmy Durante, generated positive responses, with some commentators comparing it to Taxi Driver and Requiem for a Dream and praising Phoenix's performance. Writers described the trailer as dark and gritty, with ComicBook.com's Jenna Anderson feeling it appeared more like a psychological thriller than a comic book film. Actor Mark Hamill, who has voiced the Joker since the 1992 cartoon Batman: The Animated Series, expressed enthusiasm on Twitter. Conversely, io9's Germain Lussier said the trailer revealed too little and that it was too similar to photos Phillips had posted on Instagram. While he still believed it exhibited potential, Lussier overall thought the trailer was not \"a home run.\" The trailer received over eight million views in the first few hours of release.\r\nOn August 25, 2019, Phillips released six brief teasers that contained flashes of writing, revealing the second trailer would be released on August 28. Filmmaker Kevin Smith commended the trailer, stating he thought the film \"would still work even if didn't exist\" and praising its uniqueness. Overall, Deadline Hollywood estimated that Warner Bros. spent $120 million on promotion and advertisements.\r\nAfter release in theaters, Warner Bros. used negative critics on this film for promotion.\r\nRelease\r\nTheatrical\r\nJoker had its world premiere at the 76th Venice International Film Festival on August 31, 2019, where it received an eight-minute standing ovation and won the Golden Lion award. It also screened at the Toronto International Film Festival on September 9, 2019. The film was released theatrically by Warner Bros. Pictures on October 4, 2019, in the United States and a day earlier in Australia and several other international markets. On November 16, 2019, it was screened at the White House for President Donald Trump, who reportedly enjoyed the film. Some theaters released this movie on 70mm film, by original intention of the movie's director. Following its nominations at various awards shows, the film was scheduled to be rereleased in theaters across North America, beginning on January 17, 2020.\r\nSecurity concerns\r\nOn September 18, 2019, the United States Army distributed an email warning service members of potential violence at theaters screening the film and noting the Joker character's popularity among the incel community. A separate memo revealed the Army received \"credible\" information from Texas law enforcement \"regarding the targeting of an unknown movie theater during the release.\" The film, forbidden to minors under 17 in the USA, has unleashed the now usual problem of the possible imitations of the criminal behaviors represented in the film in ordinary life. However, according to Deadline Hollywood, the FBI and the United States Department of Homeland Security found no credible threats surrounding the release of the film.\r\nIn an interview with TheWrap, Phillips expressed surprise at criticism of the film's dark tone, stating \"it's because outrage is a commodity\" and calling critics of the film \"far left\". Phoenix walked out of an interview by The Telegraph when asked if the film could inspire mass shooters. He later returned to finish the interview, but did not answer the question. Following this, journalists were disinvited from the premiere at TCL Chinese Theatre, with only photographers being allowed to interact with the filmmakers and cast on the carpet. In a statement to Variety, Warner Bros. said that \"A lot has been said about Joker and we just feel it's time for people to see the film.\"\r\nThe film did not play at the Aurora, Colorado movie theater where the 2012 mass shooting occurred during a screening of The Dark Knight Rises. Three families of victims, as well as the mother of a witness, signed a letter to Warner Bros. with the request. Additionally, Landmark Theaters prohibited moviegoers from wearing Joker costumes during its run, while the Los Angeles and New York City Police Departments increased police visibility at area theaters, though they did not receive \"any specific threat.\"\r\nHome media\r\nJoker was released on Digital HD on December 17, 2019, and on DVD, Blu-ray and Ultra HD Blu-ray on January 7, 2020. It debuted on HBO on May 16, 2020, and on HBO Max when it launched on May 27, 2020.\r\nReception\r\nBox office\r\nJoker grossed $335.5 million in the United States and Canada and $738.5 million in other territories, for a worldwide total of $1.074 billion. It is the sixth-highest-grossing film of 2019 and the highest-grossing R-rated film of all time, as well as the first R-rated film to pass the billion-dollar mark. In terms of budget-to-gross ratio, Joker is also the most profitable film based on a comic book, due to its small budget and little decline in week-to-week grosses during its theatrical run, surpassing the record previously held by Deadpool. Deadline Hollywood estimated the film made a net profit of $437 million, when factoring together all expenses and revenues.\r\nIn August 2019, BoxOffice magazine analyst Shawn Robbins wrote that he expected Joker to gross $60–90 million during its opening weekend in North America. Following the film's premiere, BoxOffice predicted Joker could open to $70–95 million domestically. Later updating to $85–105 million, Robbins suggested it could become the first October release to open to over $100 million and surpass the record set by Venom in 2018. However, Comscore's senior media analyst Paul Dergarabedian thought the film would open closer to $50 million because it is not a \"typical comic-book movie.\" Three weeks prior to its release, official industry tracking projected the film would debut to $65–80 million, with some estimates going as high as $90 million. The week of its release, Atom Tickets announced pre-sale totals for the film were outpacing those of Venom and It Chapter Two ($91.1 million debut) and that Joker was its second-bestselling R-rated film of 2019 behind John Wick: Chapter 3 – Parabellum.\r\nJoker opened in 4,374 theaters in North America and made $39.9 million on its first day, including $13.3 million from Thursday night previews, besting Venom's respective October records. The film also had the biggest October opening day of any film, beating out Halloween. It went on to break Venom's record for having the biggest October opening weekend, finishing with a domestic total of $96.2 million. The film set career records for Phoenix, Phillips and De Niro and was the fourth-largest debut for an R-rated film of all time. This record would cross over The Matrix Reloaded, staying behind Deadpool, Deadpool 2 and It. It was also Warner Bros.' biggest domestic opening in two years. In its second weekend the film fell just 41.8% to $55.9 million, remaining in first and marking the best second-weekend October total (besting Gravity's $43.1 million in 2013). It made $29.2 million in its third weekend and $19.2 million in its fourth, finishing second behind Maleficent: Mistress of Evil both times. After 155 days, Joker's American theatrical run wrapped up on March 5, 2020 with a final gross of $355.5 million, making it the fourth-highest domestic gross for an R-rated film, behind The Passion of the Christ, Deadpool and American Sniper.\r\nWorldwide, the film was projected to debut to around $155 million, including $75 million from 73 overseas territories. It made $5.4 million from four countries on its first day and $18.7 million from 47 in its second, for a two-day total of $24.6 million. It went on to greatly exceed expectations, making $140.5 million from overseas territories and a total $234 million worldwide. Its largest markets were South Korea (a Warner Bros. record $16.3 million), the United Kingdom ($14.8 million), Mexico ($13.1 million) and Japan ($7 million). With this, it became the biggest worldwide opening for an October film. During its second weekend, the film made an additional $125.7 million worldwide, and $77.9 million in its third. By this point, industry analysts expected Joker to become the highest-grossing R-rated film of all time, with some suggesting that it could finish its run with over $1 billion. The film became the highest-grossing R-rated film in its fourth weekend, during which it grossed $47.8 million internationally, and passed the billion-dollar mark about a month into its theatrical release.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, Joker holds an approval rating of 69% based on 597 reviews, with an average rating of 7.3/10. The site's critical consensus reads, \"Joker gives its infamous central character a chillingly plausible origin story that serves as a brilliant showcase for its star – and a dark evolution for comics-inspired cinema.\" Metacritic, which uses a weighted average, assigned the film a score of 59 out of 100 based on 60 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale, while those at PostTrak gave it an overall positive score of 84% (with an average 4 out of 5 stars) and a 60% \"definite recommend\".\r\nMark Kermode of The Observer rated the film 4 out of 5 stars, stating \"Joker has an ace card in the form of Joaquin Phoenix's mesmerisingly physical portrayal of a man who would be king.\" Writing for IGN, Jim Vejvoda gave Joker a perfect score, saying that the film \"would work just as well as an engrossing character study without any of its DC Comics trappings; that it just so happens to be a brilliant Batman-universe movie is icing on the Batfan cake.\" He found it a powerful and unsettling allegory of contemporary neglect and violence and described Phoenix's performance as the Joker as engrossing and \"Oscar-worthy\". Similarly, Xan Brooks of The Observer—who also gave the film a perfect score—called it \"gloriously daring and explosive\" and appreciated how Phillips used elements from Scorsese films to create an original story. Variety's Owen Gleiberman wrote, \"Phoenix is astonishing as a mentally ill geek who becomes the killer-clown Joker in Todd Phillips' neo-Taxi Driver knockout: the rare comic-book movie that expresses what's happening in the real world.\"\r\nComicBook.com's Brandon Davis acclaimed Joker as a groundbreaking comic book adaptation that he found scarier than most 2019 horror films. Davis compared it favorably to the 2008 Batman film The Dark Knight, praised the cinematography and performances and called it a film that needed to be seen to be believed. Deadline Hollywood's Pete Hammond believes the film redefines the Joker and is \"impossible to shake off\". Hammond also praised the story and performances and summarized the film as \"a bravura piece of filmmaking that speaks to the world we are actually living in today in ways that few movies do.\" Peter Travers of Rolling Stone said he was lost for words in describing Phoenix's performance, calling the film \"gut-wrenching\" and \"simply stupendous\".\r\nDavid Ehrlich of IndieWire was more mixed and gave the film a \"C+\". He felt that while \"Joker is the boldest and most exciting superhero movie since The Dark Knight\", it was \"also incendiary, confused and potentially toxic\". Ehrlich thought that the film would make DC fans happy and praised Phoenix's performance, but criticized Phillips' direction and the lack of originality. A critical review came from Glenn Kenny of RogerEbert.com, who gave the film two stars out of four. Though he praised the performances and thought the story worked, Kenny criticized the social commentary and Phillips' direction, finding the film too derivative and believing its focus was \"less in entertainment than in generating self-importance\". In an analysis of the character Joker, Onmanorama's Sajesh Mohan wrote that the movie was cliché-ridden, the only original part being Joaquin Phoenix's acting. \"The movie, with great pain and in detail, explains how Arthur Fleck turns into Joker dejected by the way the world treats him. Thanks to Phillips and Silver, Phoenix was able to bring out the king among the Jokers,\" the analysis read.\r\nStephanie Zacharek of Time magazine, in a negative review, labeled Phoenix's performance over-the-top and felt that while Phillips tried to \" us a movie all about the emptiness of our culture... he's just offering a prime example of it.\" She argued the plot was nonexistent, \"dark only in a stupidly adolescent way\" and \"stuffed with phony philosophy\". Meanwhile, NPR's Glen Weldon thought the film lacked innovation and said its sympathetic take on the Joker was \"wildly unconvincing and mundanely uninteresting\". Weldon also described Joker as trying too hard to deviate from the comics and, as a result, coming off as an imitation of films like Taxi Driver. Peter Bradshaw of The Guardian called it \"the most disappointing film of the year\". While praising Phoenix's performance and the first act, he criticized the film's political plot developments and overall found it too derivative of various Scorsese films.\r\nIndustry response\r\nJoker generated positive responses from industry figures. DC Comics chief creative officer Jim Lee praised it as \"intense, raw and soulful\" and stated that it had remained true to the character despite deviating from the source material. Actor Mark Hamill, who has voiced the Joker in animation and video games since Batman: The Animated Series, thought the film had \"brilliantly\" reinvented the character and gave it \" thumbs up\". Superman (1978) director Richard Donner called the film \"brilliant\", \"fascinating\", \"really well-written\" and stated that Phoenix's performance was \"genius\". Documentary filmmaker Michael Moore called Joker a \"cinematic masterpiece\" and stated it was a \"danger to society\" if people did not see it. Actor Josh Brolin found the film powerful: \"To appreciate Joker I believe you have to have either gone through something traumatic in your lifetime (and I believe most of us have) or understand somewhere in your psyche what true compassion is\". Actor Vincent D'Onofrio vocally commended Phoenix's performance in the film on Twitter, stating that he \"deserve recognition for this performance\", while actress Jessica Chastain agreed, replying: \"It's one of the greatest pieces of acting I've ever seen\". Actress and screenwriter Phoebe Waller-Bridge also praised the film, stating: \"I think the reason people got so uncomfortable is because it feels too true, too raw. I was watching it and thinking to myself, God, if this came out a year into Obama's time in office, I don't think we'd be feeling as worried about it\". Filmmaker David Fincher said of the film's unexpected success, \"Nobody would have thought they had a shot at a giant hit with Joker had The Dark Knight not been as massive as it was. I don't think anyone would have looked at that material and thought, 'Yeah, let's take Travis Bickle and Rupert Pupkin and conflate them, then trap him in a betrayal of the mentally ill and trot it out for a billion dollars'\". Actor Brendan Gleeson felt that Phoenix's performance as the Joker was absolutely \"indelible\" and one of the most magnificent achievements in cinema he has ever seen, incidentally being that the reason he opted to join the film's sequel Joker: Folie à Deux (2024).\r\nAccolades\r\nJoaquin Phoenix's performance in the film won him multiple awards, including an Academy Award for Best Actor, a BAFTA Award for Best Actor in a Leading Role, a Critics' Choice Movie Award for Best Actor, a Golden Globe Award for Best Actor – Motion Picture Drama and a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role.\r\nJoker won the Best Actor (Phoenix) and Best Original Score awards at the 92nd Academy Awards. It received overall eleven nominations (including Best Picture) from the ceremony, breaking the record of eight held by The Dark Knight for the most nominations received by a film based on a comic book, comic strip or graphic novel. Hildur Guðnadóttir also became the first woman to win an original score Oscar since The Full Monty in 1998. At the 73rd British Academy Film Awards, the film won Best Actor in a Leading Role (Phoenix), Best Casting and Best Original Music out of a leading eleven nominations including Best Film. The film was nominated for four Golden Globe Awards for the 77th ceremony, winning the awards for Best Original Score and Best Actor (Phoenix). The film was nominated for seven awards at the 25th Critics' Choice Awards, winning Best Actor (Phoenix) and Best Score and was included in the American Film Institute and Cahiers du Cinéma's top 10 films of 2019.\r\nHaving won an award at the 26th Screen Actors Guild Awards for Phoenix's performance, Joker also received nominations from other guilds including the Writers Guild of America Awards and the Producers Guild of America. It won a Best Period and/or Character Make-Up in a Feature-Length Motion Picture award from the Make-Up Artists and Hair Stylists Guild. An American production, the film won the Golden Lion at the 76th Venice International Film Festival.\r\nThemes and analysis\r\nJoker deals with the themes of mental illness and its effects. While its depiction of the Joker has been described as reminiscent of those who commit mass shootings in the United States as well as members of the incel community, Christina Newland of The Guardian concludes that Fleck is not an incel, but wrote that incels are likely to relate to him. Vejvoda, Hammond and Newland interpreted the film as a cautionary tale—society's disregard of those who are less fortunate will create a person like the Joker. Stephen Kent, writing for the Washington Examiner, described Arthur Fleck as blending shared aspects of mass shooters and interpreted its message as a reminder that society is riddled with men like the Joker. Writing in People's World, Chauncey K. Robinson said the film \"walks a fine line between exploration and validation\" of Joker's character and is \"ultimately an in-your-face examination of a broken system that creates its own monsters.\"\r\nSome writers have expressed concern that Joker's sympathetic portrayal of a homicidal maniac could inspire real-world violence. Richard Lawson of Vanity Fair found the film was too sympathetic towards \"white men who commit heinous crimes\" and that the sociopolitical ideologies represented in the film are \"evils that are far more easily identifiable\" to people \"who shoot up schools and concerts and churches, who gun down the women and men they covet and envy, who let loose some spirit of anarchic animus upon the world—there's almost a woebegone mythos placed on them in the search for answers.\" Jim Geraghty of National Review wrote he was \"worried that a certain segment of America's angry, paranoid, emotionally unstable young men will watch Joaquin Phoenix descending into madness and a desire to get back at society by hurting as many people as possible and exclaim, 'finally, somebody understands me!'\" Contrarily, Michael Shindler, reviewing the film in Mere Orthodoxy, while agreeing that Joker depicts a sympathetic wish fulfillment fantasy, contends (drawing on insights from Sigmund Freud and Jacques Lacan) that it is for precisely that reason that the film will, if anything, preemptively quell real-world violence by rendering \"the Flecks of the world into meek somnambulists.\"\r\nBritish neurocriminologist Adrian Raine was impressed by how accurate the film's depiction of the psychology of a murderer was. In an interview with Vanity Fair, he described it as \"a great educational tool\" and stated that he planned to present film clips during his classes. Psychiatrist Kamran Ahmed highlighted the factors in Arthur's childhood such as parental abuse and loss and family history of mental illness in the genesis of his condition. American psychiatrist Imani Walker, who is known for her Bravo television series Married to Medicine Los Angeles and working with violent criminals with mental disorders, analyzed the Joker's apparent mental disorders and circumstances and noted that Arthur tries to find help before his downfall, only to be abandoned. She says of Arthur and others in poverty who have mental illness: \"We as a society don't even pretend that they're real people and that's what this movie is about. He never had a chance.\" Forensic psychiatrist Ziv Cohen criticized the film as misrepresenting the mentally ill as violent. He argued the film conflates psychopathy (a lack of conscience) with mental illness, thereby creating a false impression of the mentally ill as dangerous.\r\nMicah Uetricht, managing director of Jacobin, opined in a review published by The Guardian that he was shocked that the media did not understand the movie's message: \"we got a fairly straightforward condemnation of American austerity: how it leaves the vulnerable to suffer without the resources they need and the horrific consequences for the rest of society that can result\"; Uetricht thus declares that Joker presents a world that has devolved into \"barbarism\". Uetricht states that these themes are unsubtle to the extent that it was surprising that most media outlets had not identified them. Ahmed also highlights the lack of funding for already-stretched mental health services worldwide being alluded to.\r\nThe film's director and co-screenwriter, Todd Phillips, has stated that Joker is \"certainly not a political film.\" Phillips has also commented on discourse surrounding the film, pushing back on several criticisms surrounding its themes. He responded to critics who have expressed concerns over the film's violence, saying \"Isn’t it good to have these discussions about these movies, about violence? Why is that a bad thing if the movie does lead to a discourse about it?\" Phillips also commented on political backlash to the film, saying \"What’s outstanding to me in this discourse in this movie is how easily the far left can sound like the far right when it suits their agenda. It’s really been eye-opening for me.\"\r\nCultural impact\r\nDuring a Five Star Movement event in October 2019, Italian comedian and politician Beppe Grillo gave a speech wearing the Joker's makeup. Yusuke Kawai, the governor of Chiba Prefecture, appeared on NHK with a Joker costume in 2021. References to the character were also found in anti-government protests worldwide. During the 17 October Revolution, a group of graffiti artists called Ashekm painted a mural of the Joker holding a Molotov cocktail and it was also reported that there was a Joker facepaint station at the protests in Beirut. In Los Ángeles, Chile, during the 2019–2022 Chilean protests, the phrase \"We are all clowns\", which is adopted by Gotham City protesters in the movie, was written at the foot of a statue. In Hong Kong, protesters challenged an emergency decree prohibiting the wearing of masks by wearing those of fictional characters such as the Joker. In France, during the Yellow Vest Protests, firefighters donned Joker makeup holding placards. In 2020, during the George Floyd protests, Argentine president Alberto Fernández compared the pictures of the protests to those seen in the film.\r\nOne of the locations seen in the film, a set of stairs in the Bronx, New York City, has been dubbed the Joker Stairs. The stairs have become a tourist destination and the subject of internet memes, with visitors often reenacting the scene from the film in which Fleck dances down the stairs in his Joker attire. Ukrainian boxing champion Oleksandr Usyk wore a suit resembling that of Joker in a pre-fight press conference leading up to his fight with Anthony Joshua.\r\nSequel\r\nWhile Joker was intended to be a standalone film with no sequels, Warner Bros. Entertainment also intended for it to launch a new franchise named DC Black, which would include DC Comics-based films unrelated to the DCEU with darker and more experimental material. It was later established as part of the \"DC Elseworlds\" lineup in 2023 by DC Studios CEO James Gunn in order to differentiate it from his upcoming DC Universe project. In August 2019, Todd Phillips stated that he would be interested in making a sequel, depending on the film's performance and Phoenix's interest. He stated that the movie was pitched as standalone, \"one movie, and that's it.\" In October 2019, Phoenix stated in an interview, \"I can't stop thinking about it...if there's something else we can do with Joker that might be interesting,\" and concluded, \"It's nothing that I really wanted to do prior to working on this movie. I don't know that there is...Because it seemed endless, the possibilities of where we can go with the character.\"\r\nIn November 2019, The Hollywood Reporter announced that a sequel was in development, though this was later disputed by Deadline Hollywood. Phillips responded to these reports, by saying that there were discussions with Warner Bros. for a sequel, but that it was not currently in development. He later clarified that despite ongoing rumors, the then-upcoming Matt Reeves-directed film centered around Batman was not related to Joker. Later, he expressed interest in a potential spin-off film centered around Batman in his Joker's universe, stating: \"What I would like to see someone tackle is what Batman looks like from that Gotham. I'm not saying I'm going to do that.\"\r\nIn May 2021, it was stated that a Joker sequel was in development. Later that month, Phillips had entered negotiations to serve as a screenwriter. In January 2022, Willem Dafoe expressed interest in appearing in the sequel. By June, the sequel was officially confirmed to be in development with Phillips serving as director with a script he co-wrote with Silver. The working title of the project was revealed to be Joker: Folie à Deux. Lady Gaga reportedly was in negotiations to star alongside Phoenix as Harley Quinn and it was also reported that the film would be a movie musical. Phoenix's salary, as a result of the first film's commercial success, increased from $4.5 million to $20 million for the sequel. On August 3, Warner Bros. Pictures announced that the film will be released on October 4, 2024. Gaga confirmed the next day that she would star in it. Shortly after, Beetz was in negotiations to reprise her role as Sophie Dumond in the sequel. She was confirmed on September 1, 2022, alongside Brendan Gleeson. On September 7 and September 13 respectively, Catherine Keener and Jacob Lofland were cast in undisclosed roles. On October 20, Industry actor Harry Lawtey was reported by Deadline Hollywood to have been cast in what was described to be a \"big role\" in the film.\r\nOn December 10, 2022, production began, with Phillips releasing a first look of Phoenix's reprisal as the Joker on his Instagram account.",
    "html": "<p>Joker is a 2019 American neo-noir psychological thriller film directed by Todd Phillips, who also co-wrote the screenplay with Scott Silver. The film, based on DC Comics characters, stars Joaquin Phoenix as the Joker and serves as a standalone origin story for the character. Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comic whose descent into mental illness and nihilism inspires a violent countercultural revolution against the prosperous in a decaying Gotham City. Robert De Niro, Zazie Beetz and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.</p><p>Phillips conceived Joker in 2016 and wrote the script with Silver throughout 2017. The two were inspired by 1970s character studies and the films of Martin Scorsese, particularly Taxi Driver (1976) and The King of Comedy (1982), who was initially attached to the project as a producer. The film loosely adapts plot elements from Batman: The Killing Joke (1988), but Phillips and Silver otherwise did not look to specific comics for inspiration. Phoenix became attached in February 2018 and was cast that July, while the majority of the cast signed on by August. Principal photography took place in New York City, Jersey City and Newark, from September to December 2018. Joker is the first live-action theatrical Batman film to receive an R rating from the Motion Picture Association.</p><p>Joker premiered at the 76th Venice International Film Festival on August 31, 2019, where it won the Golden Lion and was theatrically released in the United States on October 4, 2019. The film received polarizing reviews from critics, with praise directed toward Phoenix's performance, Phillips' direction, the visual style, editing, musical score, and cinematography, while the tone, portrayal of mental illness, and handling of violence divided opinions. The film was a box office success and set records for an October release. It grossed over $1 billion, the first R-rated film to do so and became the sixth-highest-grossing film of 2019 during its theatrical run. The film also received numerous accolades.</p><p>A sequel, Joker: Folie à Deux, is scheduled to be released on October 4, 2024.</p><br/><h3>Plot</h3><p>A clown and aspiring stand-up comedian named Arthur Fleck lives with his mother, Penny, in crime-ridden Gotham City. Arthur suffers from a neurological disorder that causes him to have random, uncontrollable laughing fits, requiring medication for which he depends on social services. After Arthur is attacked by juvenile delinquents, his co-worker Randall gives him a revolver for self-defense. Arthur pursues a relationship with his neighbor, single mother Sophie, and invites her to see his routine at a comedy club.</p><p>Arthur is fired from his job at a children's hospital when he accidentally exposes the gun despite his explanation that it was given to him by Randall, who denies this. While riding home on the subway still wearing his clown makeup, Arthur is mocked and beaten by drunk businessmen from Wayne Investments; he fatally shoots two of them in self-defense and murders the third as he attempts to flee. The killings are condemned by their employer, billionaire mayoral candidate Thomas Wayne. Protesters begin donning clown masks in Arthur's image. Budget cuts shut down the social service program, leaving Arthur without his medication.</p><p>Sophie attends Arthur's stand-up routine, which goes poorly; he laughs uncontrollably, and his jokes fall flat. Arthur intercepts a letter from Penny to Thomas, alleging that he is Thomas' illegitimate son, and berates his mother for hiding the truth. He goes to Wayne Manor, where he meets Thomas's young son Bruce, but flees after a scuffle with family butler Alfred Pennyworth. Penny suffers a stroke and is hospitalized. Arthur's idol, popular late-night talk show host Murray Franklin, presents clips of Arthur's failed performance on his show and mocks him.</p><p>Arthur confronts Thomas at a film theatre. Thomas tells him that he is not his father, and Penny is not his biological mother. In denial, Arthur visits Arkham State Hospital and steals Penny's file, which states she was a narcissist who adopted Arthur while working as a housekeeper for the Waynes in the 1950s. Penny then raised Arthur with her abusive boyfriend, who later died in jail. Penny was sent to Arkham for allowing the abuse. Distraught, Arthur enters Sophie's apartment unannounced. Frightened, Sophie asks him to leave, revealing their relationship to be a figment of Arthur's imagination. The following day, Arthur smothers Penny to death at the hospital.</p><p>After his stand-up clips go viral, Arthur is invited to appear on Murray's show. He subsequently plans to commit suicide during the broadcast. While crafting a clown-inspired persona, he is visited by Randall and another ex-colleague, Gary. Arthur kills Randall, but spares Gary for his kindness to Arthur in the past. Two detectives investigating Arthur's involvement in the murders of the businessmen pursue him onto a subway filled with clown protesters. One detective accidentally shoots and kills a protester, thus inciting a riot, while Arthur escapes.</p><p>Before the show goes live, Arthur asks Murray to introduce him as \"Joker.\" Arthur begins telling morbid jokes, confesses to the subway murders, rants about how society abandons the downtrodden and mentally ill, and berates Murray for ridiculing him. After one more morbid joke, Arthur fatally shoots him on air. He is arrested, and riots erupt across Gotham. One of the rioters corners the Wayne family in an alley and murders Thomas and his wife, sparing Bruce. Rioters in an ambulance crash into the police car carrying Arthur, freeing him; he stands atop the car, starts to dance to the cheers of the crowd, and smears blood on his face into the shape of a smile.</p><p>At Arkham, Arthur laughs to himself about a joke whilst with a therapist, but declines to tell it, claiming she wouldn't get it. He leaves behind a trail of bloodied shoeprints as he is chased down a corridor by an orderly.</p><br/><h3>Cast</h3><ul><li>Joaquin Phoenix as Arthur Fleck / Joker: A mentally ill, impoverished party clown and stand-up comedian disregarded by society, whose history of abuse causes him to become a nihilistic criminal with a clown-themed persona. Phoenix had been interested in a low-budget \"character study\" of a comic book character and said the film \"feels unique, it is its own world in some ways and maybe It might as well be the thing that scares you the most.\" Phoenix lost 52 pounds (23 kg) for his role in the film.</li><li>Robert De Niro as Murray Franklin: A talk show host who plays a role in Arthur's downfall. De Niro said his role in Joker pays homage to his character from The King of Comedy (1983), Rupert Pupkin, who is a comedian obsessed with a talk-show host.</li><li>Zazie Beetz as Sophie Dumond: A cynical single mother and Arthur's \"love interest\". Beetz, a \"huge fan\" of Phoenix, said that it was \"an honor\" to costar with him and that she learned a lot working with him on set.</li><li>Frances Conroy as Penny Fleck: Arthur's mentally and physically ill mother, who formerly worked for Thomas Wayne. Canadian actress Hannah Gross portrays a young Penny.</li></ul><p>Additionally, Brett Cullen portrays Thomas Wayne, a billionaire running for mayor of Gotham. Alec Baldwin was initially cast in the role, but dropped out due to scheduling conflicts. Carrie Louise Putrello portrays Thomas's wife Martha, although the character has no lines and is never referred to by name. Douglas Hodge plays Alfred Pennyworth, the butler and caretaker of the Wayne family, and Dante Pereira-Olson plays Bruce Wayne, Thomas' son, who becomes the Joker's archenemy Batman as an adult.</p><p>Additional cast members include Glenn Fleshler and Leigh Gill as Randall and Gary, Arthur's clown co-workers; Bill Camp and Shea Whigham as detectives Garrity and Burke in the Gotham City Police Department; Marc Maron as Gene Ufland, a producer on Franklin's show; Sharon Washington as Arthur's social worker; Josh Pais as Hoyt Vaughn, Arthur's agent; Brian Tyree Henry as Clark, a clerk at Arkham State Hospital; Ben Warheit, Michael Benz and Carl Lundstedt as bankers who harass Arthur; Gary Gulman and Sam Morril as comedians at an open mic where Arthur performs; and Bryan Callen as Javier, a co-worker of Arthur. Justin Theroux has an uncredited cameo as Ethan Chase, a celebrity guest on Franklin's show.</p><br/><h3>Production</h3><h4>Development</h4><p>Between 2014 and 2015, Joaquin Phoenix expressed interest to his agent in acting in a low-budget \"character study\" type of film about a comic book villain, like DC Comics character the Joker. Phoenix had thought of the idea 1 to 2 years before Phillips conceived Joker in 2016. Phoenix had previously declined to act in the Marvel Cinematic Universe because he would have been required to reprise a role, such as the Hulk (initially portrayed by Edward Norton before he was recast by Mark Ruffalo) or Doctor Strange, in multiple films. Phoenix ruled out the Joker for his \"character study\" idea and tried to think of a different one. \"I thought, 'You can't do the Joker, because, you know, it's just you can't do that character, it's just been done.'\" Phoenix's agent suggested setting up an exploratory meeting with Warner Bros., but he declined and let go of the idea. Similarly, Todd Phillips had been offered to direct comic-based films a number of times, but declined because he thought they were \"loud\" and did not interest him. According to Phillips, Joker was created from his idea to create a different, more grounded comic book film. He was attracted to the Joker because he did not think there was a definitive portrayal of the character, which he knew would provide considerable creative freedom.</p><p>Phillips pitched the idea for Joker to Warner Bros. after his film War Dogs premiered in August 2016. Prior to War Dogs, Phillips was mostly known for his comedy films, such as Road Trip (2000), Old School (2003) and The Hangover (2009); War Dogs marked a venture into more unsettling territory. During the premiere, Phillips realized \"War Dogs wasn't going to set the world on fire and I was thinking, 'What do people really want to see?'\" In addition, he found that it was difficult to make comedy films in the \"woke culture\", throughout opposition of \"30 million people on Twitter\". He finally thought that \"How do I do something irreverent, but fuck comedy? Oh I know, let's take the comic book movie universe and turn it on its head with this\". He proposed that DC Films differentiate its slate from the competing Marvel Studios' by producing low-budget, standalone films. After the successful release of Wonder Woman (2017), DC Films decided to deemphasize the shared nature of its DC-based film franchise, the DC Extended Universe (DCEU). In August 2017, Warner Bros. and DC Films revealed plans for the film, with Phillips directing and co-writing with Scott Silver and Martin Scorsese set to co-produce with Phillips. According to Tatiana Siegel of The Hollywood Reporter, Scorsese considered directing Joker before Phillips was chosen, though a Warner Bros. source said he only became involved because the film needed a New York City-based producer.</p><p>According to Kim Masters and Borys Kit of The Hollywood Reporter, Jared Leto, who portrayed the Joker in the DCEU, was displeased by the existence of a project separate from his interpretation. In October 2019, Masters reported that Leto \"felt 'alienated and upset'\" when he learned that Warner Bros.—which had promised him a standalone DCEU Joker film—let Phillips proceed with Joker, going as far as to ask his music manager Irving Azoff to get the project canceled. Masters added that Leto's irritation was what caused him to end his association with Creative Artists Agency (CAA), as he believed \"his agents should have told him about the Phillips project earlier and fought harder for his version of Joker.\" However, sources associated with Leto deny that he attempted to get Joker canceled and left CAA because of it.</p><p>Warner Bros. pushed for Phillips to cast Leonardo DiCaprio as the Joker, hoping to use his frequent collaborator Scorsese's involvement to attract him. However, Phillips said that Phoenix was the only actor he considered, and that he and Silver wrote the script with Phoenix in mind, \"The goal was never to introduce Joaquin Phoenix into the comic book movie universe. The goal was to introduce comic book movies into the Joaquin Phoenix universe.\" Phoenix said when he learned of the film, he became excited because it was the kind he was looking to make, describing it as unique and stating it did not feel like a typical \"studio movie.\" It took him some time to commit to the role, as it intimidated him and he said \"oftentimes, in these movies, we have these simplified, reductive archetypes and that allows for the audience to be distant from the character, just like we would do in real life, where it's easy to label somebody as evil and therefore say, 'Well, I'm not that.'\"</p><h4>Writing</h4><blockquote>It was a yearlong process from when we finished the script just to get the new people on board with this vision, because I pitched it to an entirely different team than made it. There were emails about: 'You realize we sell Joker pajamas at Target.' There were a zillion hurdles, and you just sort of had to navigate those one at a time At the time, I would curse them in my head every day. But then I have to put it in perspective and go, 'They're pretty bold that they did this.'</blockquote><p>– Todd Phillips</p><p>Phillips and Silver wrote Joker throughout 2017 and the writing process took about a year. According to producer Emma Tillinger Koskoff, it took some time to get approval for the script from Warner Bros., partly because of concerns over the content. Similarly, Phillips commented that there were \"a zillion hurdles\" during the year-long writing process due to the visibility of the character. Phillips said that while the script's themes may reflect modern society, the film was not intended to be political. He also noted that Joker is a story about child trauma and mental illness. In their script, Phillips talked about how difficult it is for patients to reveal their diagnoses, referring to a line from the film: \"The worst part of having a mental illness is that people expect you to behave as if you don't.\"</p><p>The script draws inspiration from Scorsese films such as Taxi Driver (1976), Raging Bull (1980) and The King of Comedy (1983), as well as Phillips' Hangover Trilogy. Other films Phillips has cited as inspiration include character studies released in the 1970s—such as Serpico (1973) and One Flew Over the Cuckoo's Nest (1975)—the silent film The Man Who Laughs (1928) and several musicals. Phillips said that aside from the tone, he did not consider Joker that different from his previous work, such as his Hangover films. The film's premise was inspired by Alan Moore and Brian Bolland's graphic novel Batman: The Killing Joke (1988), which depicts the Joker as a failed stand-up comedian, while the climactic talk show scene was inspired by a similar scene in Frank Miller's The Dark Knight Returns (1986). However, Phillips said the film does not \"follow anything from the comic books... That's what was interesting to me. We're not even doing Joker, but the story of becoming Joker.\" Phillips later clarified that he meant they did not look to a specific comic for inspiration, but rather \"picked and chose what we liked\" from the character's history. Having grown up in New York, Phillips also drew inspiration from life in New York City during the early 1980s. The Subway shooting scene and its aftermath were inspired by the 1984 New York City Subway shooting, while Arthur Fleck is partially based on the shooting's perpetrator, Bernhard Goetz.</p><p>Phillips and Silver found the most common Joker origin story, in which the character is disfigured after falling into a vat of acid, too unrealistic. Instead, they used certain elements of the Joker lore to produce an original story, which Phillips wanted to feel as authentic as possible. Because the Joker does not have a definitive origin story in the comics, Phillips and Silver were given considerable creative freedom and \"pushed each other every day to come up with something totally insane.\" While the Joker had appeared in several films before, Phillips thought it was possible to produce a new story featuring the character. \"It's just another interpretation, like people do interpretations of Macbeth,\" he told The New York Times. However, they did try to retain the ambiguous \"multiple choice\" nature of the Joker's past by positioning the character as an unreliable narrator—with entire storylines simply being his delusions—and left what mental illnesses he suffers from unclear. As such, Phillips said the entire film is open to interpretation.</p><p>When a draft of the film's script, written in April 2018, was leaked and spread on the internet, Phillips stated that it was an old version from six months before filming began. Phillips also declined to take legal action against the spread of the script, stating that he liked having an old version circulate.</p><h4>Pre-production</h4><p>Following the disappointing critical and financial performance of Justice League (2017), in January 2018 Walter Hamada replaced Jon Berg as the head of DC-based film production at Warner Bros. Hamada sorted through the various DC films in development, canceling some while advancing work on others; the film was set to begin filming in late 2018 with a small budget of $55 million. Kim Masters of The Hollywood Reporter said Warner Bros. was reluctant to let Joker move forward and gave it a small budget in an effort to dissuade Phillips. Phillips said that Hamada did not understand what he was trying to do. By June, Robert De Niro was under consideration for a supporting role in the film. The deal with Phoenix was finalized in July 2018, after four months of persuasion from Phillips. Immediately afterwards, Warner Bros. officially green-lit the film, titled it Joker and gave it an October 4, 2019, release date. Warner Bros. described the film as \"an exploration of a man disregarded by society is not only a gritty character study, but also a broader cautionary tale.\"</p><p>Scorsese's longtime associate Koskoff joined to produce, although Scorsese left his producing duties due to other obligations. Scorsese considered serving as an executive producer, but was preoccupied with his film The Irishman. It was also confirmed that the film would have no effect on Leto's Joker and would be the first in a new series of DC films unrelated to the DCEU. In July, Zazie Beetz was cast in a supporting role and De Niro entered negotiations in August. Frances McDormand declined an offer to portray the mother of the Joker and Frances Conroy was cast. At the end of July, Marc Maron, and Bryan Callen joined the cast. Alec Baldwin was cast as Thomas Wayne on August 27, but dropped out two days later due to scheduling conflicts. Baldwin also noted the character's description as a reason for his departure, which called Thomas Wayne \"a cheesy and tanned businessman who is more in the mold of a 1980s Donald Trump\".</p><h4>Filming</h4><p>Principal photography commenced in September 2018 in New York City, under the working title Romeo. Shortly after filming began, De Niro, Brett Cullen, Shea Whigham, Glenn Fleshler, Bill Camp, Josh Pais and Douglas Hodge were announced to have joined the film, with Cullen replacing Baldwin. Bradley Cooper joined the film as a producer, and the director of photography was Lawrence Sher, both of whom Phillips had previously collaborated with. On September 22, a scene depicting a violent protest was filmed at the Church Avenue station in Kensington, Brooklyn, although the station was modified to look like the Bedford Park Boulevard station in the Bronx. Filming of violent scenes also took place at the abandoned lower platform of the Ninth Avenue station in Sunset Park, Brooklyn.</p><p>According to Beetz, Phillips rewrote the entire script during production; because Phoenix lost so much weight for the film, there would not be an opportunity for reshoots. She recalled, \"we would go into Todd's trailer and write the scene for the night and then do it. During hair and makeup we'd memorize those lines and then do them and then we'd reshoot that three weeks later.\" Phillips recalled Phoenix sometimes walked off-set during filming because he lost self-control and needed to compose himself—to the confusion of other actors, who felt they had done something wrong. De Niro was one of the few Phoenix never walked out on and De Niro said he was \"very intense in what he was doing, as it should be, as he should be.\"</p><p>Filming in Jersey City started on September 30 and shut down Newark Avenue, while filming in November, starting on November 9, shut down Kennedy Boulevard. Filming in Newark began on October 13 and lasted until October 16. Shortly before the Newark filming, SAG-AFTRA received a complaint that extras were locked in subway cars for more than three hours during filming in Brooklyn, a break violation. The issue was quickly resolved after a representative visited the set. That month, Dante Pereira-Olson joined the cast as a young Bruce Wayne. Whigham said towards the end of October the film was in \"the middle\" of production, adding that it was an \"intense\" and \"incredible\" experience. By mid-November, filming had moved back to New York. Filming wrapped on December 3, 2018, with Phillips posting a picture on his Instagram feed later in the month to commemorate the occasion.</p><p>In The Hollywood Reporter interview, Emma Tillinger Koskoff said that most stressful filming was the \"Stair Dance\" scene; because there were no laws on paparazzi in New York City, filming was disrupted by them. Initially, Lawrence Sher and Phillips had wanted to film on 65mm film for the 70mm format, but Warner Bros. rejected this due to cost, and the film was subsequently shot in using Arri Alexa 65 digital cameras. Warner Bros. did however end up giving Joker a limited theatrical release in converted 70mm and 35mm presentations.</p><h4>Post-production</h4><p>Phillips confirmed he was in the process of editing Joker in March 2019. At CinemaCon the following month, he stated the film was \"still taking shape\" and was difficult to discuss, as he hoped to maintain secrecy. Phillips also denied most reports surrounding the film, which he felt was because it is \"an origin story about a character that doesn't have a definitive origin.\" Brian Tyree Henry was also confirmed to have a role in the film. The visual effects were provided by Scanline VFX and Shade VFX and supervised by Matthew Giampa and Bryan Godwin, with Erwin Rivera serving as the overall supervisor. Joker used less VFX work than other comics films, except few scenes including that Arthur smeared smile by his blood in crowd.</p><p>One scene that was cut from the film depicted Sophie watching Arthur's appearance on Franklin's show. The scene was intended to show the audience that she is still alive (as the film otherwise implies that Arthur kills her), but Phillips decided it would disrupt the narrative, which is portrayed from Arthur's point of view. In another deleted scene, Arthur reveals his crimes to a co-worker; the scene was ultimately removed because it provided \"too much information\" in the form of exposition.</p><p>The film's final budget was $55–70 million, considered by The Hollywood Reporter \"a fraction\" of the cost of a typical comic book-based film. In comparison, the previous villain-centered DC film, Suicide Squad (2016), cost $175 million. $25 million of Joker's budget was covered by the Toronto-based financing company Creative Wealth Media, while Village Roadshow Pictures and Bron Studios each contributed 25%. Joker was also the first live-action theatrical film in the Batman film franchise to receive an R rating from the Motion Picture Association of America, officially for \"strong bloody violence, disturbing behavior, language and brief sexual images.\" In the United Kingdom, the BBFC gave the film a 15 certificate for \"strong bloody violence language\".</p><br/><h3>Design</h3><h4>Set</h4><p>Gotham City in Joker was set in 1980s New York City, according to Todd Phillips, \"to separate it, quite frankly, from the DC universe\". Mark Friedberg, the production designer of this film, said he established the filming location of Gotham Square in Newark as a film set because there was still poverty. He wanted Gotham to look like a gritty city, as described in Taxi Driver, therefore named all structures and lines in this film and drew a specific map of Gotham city. He displayed 1970s brightly colored muscle cars on the set, \"conveying dissonance and being awful and beautiful at the same time\". He also tried to describe Gotham as a decaying city through graffiti, garbage on the road and cracked sidewalks. The VFX team added fictional buildings, changing the skyline of the city to give the sense that the city was pressing down on Arthur. Lawrence Sher said sodium-vapor lights were used in this film, representing Arthur's isolation and his more hopeful side.</p><p>Arkham State Hospital is based on Arkham Asylum. Warner Bros. Korea explained that it is a more realistic name in the real world. The exterior of Arkham State hospital was filmed at Brooklyn Army Terminal, while the interior was pictured in Metropolitan Hospital Center of Harlem. Throughout the film, two walls are shown inside Arkham State Hospital; one is clearly white in the first and last scenes, the other is dirty yellow in the scene in which Arthur runs with a medical report. This difference was intended to make the audience confused and to question the possibility that Arthur had been in hospital the entire time.</p><h4>Character design</h4><p>One of the most important inspiration affected behavior of Arthur is Little Tramp in Modern Times. Phillips confirmed that his ridiculous movement was referred from Charlie Chaplin, in commentary video of Vanity Fair. Phoenix revealed that Arthur's dance was inspired by that of Ray Bolger, while the gesture making smile by two fingers was from scarecrow in The Wizard of Oz. In preparation, Phoenix lost 52 pounds (24 kg) to look “wolf-like and malnourished and hungry.”, and based his laugh on \"videos of people suffering from pathological laughter.\" He also sought to portray a character who audiences could not identify with and did not look to previous Joker actors for inspiration; instead, he read a book about political assassinations so he could understand killers and motivations.</p><p>In a behind-the-scenes video, Phillips explained that Arthur's normal face is the real mask and the Joker is the true personality. He also said, in LA Times interview, that the genuine laugh of Arthur is only in the last scene. Director Todd Phillips said that he intentionally left it ambiguous as to whether Arthur becomes the Joker of traditional Batman stories or inspires a separate character, although Phoenix believes that Arthur is the former.</p><h4>Make-up and costumes</h4><p>Nicki Ledermann and Kay Georgiou, the makeup designer and hairstylist tried to show Arthur Fleck to \"be handmade and realistic\". Georgiou designated Arthur as a man with unwashed hair. Arthur's costumes, designed by Mark Bridges, were matched to look \"aged, overdyed and distressed\" through wearing him with cheap polyester pants and acrylic sweater. His color palette was set in '80s; blue, maroon, brown, mauve and gray. In Deadline Hollywood interview, Bridges explained Arthur's costume color started to juvenile mode, going darker with the tone of the story. In the first scene, Arthur's \"too small\" hooded jacket and white socks emphasize the childish concept. It was a reflection of him living with his mother Penny, with her calling him \"my little boy\", and the influence of Charlie Chaplin. However, he wore a charcoal sweater in the interview with the social worker and finally was in a \"scab-colored knit top\" in Arkham State Hospital. A line depicting his old suit for many years was interpreted a mustard-toned vest and a patterned bottle-green shirt. Meanwhile, Arthur in doctor costume is the homage of Joker in The Dark Knight, wearing nurse uniform to meet Harvey Dent in Gotham Hospital.</p><p>After turning Arthur into Joker, his design was also changed. His hair was dyed \"broccoli\" green and he wore a suit similar to the one in the original Batman series. However, the Joker suit in this film had different colors compared to previous films (purple suit with a green or yellow shirt). Mark Bridges noted that it was result of Phillips' intention to not want to be \"connected to anything else\". Initially, the color of the suit in the script was set to terracotta, but Bridges changed this to red to give \"more expressive\" emotion. Additionally, his suit colors (green, yellow, purple and red) were compared with those of his antagonists, including Thomas Wayne, giving them to gray and blue like Batman. Clown makeup was drawn with a classic, antique feel, with darker colors and tones and menacing eyebrows. Due to copyright laws stating that no two clowns can look alike, Ledermann faced a challenge.</p><br/><h3>Music</h3><p>In August 2018, Hildur Guðnadóttir was hired to compose the film's score. Hildur began writing music after reading the script and meeting with Phillips, who \"had a lot of strong ideas\" about how he thought the score should sound. She worked on the Joker score alongside the score for the drama miniseries Chernobyl; Hildur told The Hindu's Divya-Kala Bhavani switching between the two was challenging because the scores were so different.</p><p>Additionally, the film features the songs \"That's Life\", \"Send In the Clowns\", \"White Room\" and \"Rock and Roll Part 2\". The use of \"Rock and Roll Part 2\" generated controversy when it was reported that its singer, convicted child sex offender Gary Glitter, would receive royalties, but it was later confirmed he would not. The score was released on October 2, 2019, by WaterTower Music. Hildur's music won numerous awards including an Academy Award, a Satellite Award, a Saturn Award, the Hollywood Music in Media Awards (HMMA) and the Golden Globe Award for Best Original Score, with the latter making her the first woman to win as a solo composer in that category.</p><br/><h3>Marketing</h3><p>Phillips promoted the film by posting on set photos on his Instagram account. On September 21, 2018, he released test footage of Phoenix in-costume as the Joker, with \"Laughing\" by The Guess Who accompanying the footage. At CinemaCon on April 2, 2019, Phillips unveiled the first trailer for the film, which was released online the following day. The trailer, prominently featuring the song \"Smile\" performed by Jimmy Durante, generated positive responses, with some commentators comparing it to Taxi Driver and Requiem for a Dream and praising Phoenix's performance. Writers described the trailer as dark and gritty, with ComicBook.com's Jenna Anderson feeling it appeared more like a psychological thriller than a comic book film. Actor Mark Hamill, who has voiced the Joker since the 1992 cartoon Batman: The Animated Series, expressed enthusiasm on Twitter. Conversely, io9's Germain Lussier said the trailer revealed too little and that it was too similar to photos Phillips had posted on Instagram. While he still believed it exhibited potential, Lussier overall thought the trailer was not \"a home run.\" The trailer received over eight million views in the first few hours of release.</p><p>On August 25, 2019, Phillips released six brief teasers that contained flashes of writing, revealing the second trailer would be released on August 28. Filmmaker Kevin Smith commended the trailer, stating he thought the film \"would still work even if didn't exist\" and praising its uniqueness. Overall, Deadline Hollywood estimated that Warner Bros. spent $120 million on promotion and advertisements.</p><p>After release in theaters, Warner Bros. used negative critics on this film for promotion.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>Joker had its world premiere at the 76th Venice International Film Festival on August 31, 2019, where it received an eight-minute standing ovation and won the Golden Lion award. It also screened at the Toronto International Film Festival on September 9, 2019. The film was released theatrically by Warner Bros. Pictures on October 4, 2019, in the United States and a day earlier in Australia and several other international markets. On November 16, 2019, it was screened at the White House for President Donald Trump, who reportedly enjoyed the film. Some theaters released this movie on 70mm film, by original intention of the movie's director. Following its nominations at various awards shows, the film was scheduled to be rereleased in theaters across North America, beginning on January 17, 2020.</p><h4>Security concerns</h4><p>On September 18, 2019, the United States Army distributed an email warning service members of potential violence at theaters screening the film and noting the Joker character's popularity among the incel community. A separate memo revealed the Army received \"credible\" information from Texas law enforcement \"regarding the targeting of an unknown movie theater during the release.\" The film, forbidden to minors under 17 in the USA, has unleashed the now usual problem of the possible imitations of the criminal behaviors represented in the film in ordinary life. However, according to Deadline Hollywood, the FBI and the United States Department of Homeland Security found no credible threats surrounding the release of the film.</p><p>In an interview with TheWrap, Phillips expressed surprise at criticism of the film's dark tone, stating \"it's because outrage is a commodity\" and calling critics of the film \"far left\". Phoenix walked out of an interview by The Telegraph when asked if the film could inspire mass shooters. He later returned to finish the interview, but did not answer the question. Following this, journalists were disinvited from the premiere at TCL Chinese Theatre, with only photographers being allowed to interact with the filmmakers and cast on the carpet. In a statement to Variety, Warner Bros. said that \"A lot has been said about Joker and we just feel it's time for people to see the film.\"</p><p>The film did not play at the Aurora, Colorado movie theater where the 2012 mass shooting occurred during a screening of The Dark Knight Rises. Three families of victims, as well as the mother of a witness, signed a letter to Warner Bros. with the request. Additionally, Landmark Theaters prohibited moviegoers from wearing Joker costumes during its run, while the Los Angeles and New York City Police Departments increased police visibility at area theaters, though they did not receive \"any specific threat.\"</p><h4>Home media</h4><p>Joker was released on Digital HD on December 17, 2019, and on DVD, Blu-ray and Ultra HD Blu-ray on January 7, 2020. It debuted on HBO on May 16, 2020, and on HBO Max when it launched on May 27, 2020.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Joker grossed $335.5 million in the United States and Canada and $738.5 million in other territories, for a worldwide total of $1.074 billion. It is the sixth-highest-grossing film of 2019 and the highest-grossing R-rated film of all time, as well as the first R-rated film to pass the billion-dollar mark. In terms of budget-to-gross ratio, Joker is also the most profitable film based on a comic book, due to its small budget and little decline in week-to-week grosses during its theatrical run, surpassing the record previously held by Deadpool. Deadline Hollywood estimated the film made a net profit of $437 million, when factoring together all expenses and revenues.</p><p>In August 2019, BoxOffice magazine analyst Shawn Robbins wrote that he expected Joker to gross $60–90 million during its opening weekend in North America. Following the film's premiere, BoxOffice predicted Joker could open to $70–95 million domestically. Later updating to $85–105 million, Robbins suggested it could become the first October release to open to over $100 million and surpass the record set by Venom in 2018. However, Comscore's senior media analyst Paul Dergarabedian thought the film would open closer to $50 million because it is not a \"typical comic-book movie.\" Three weeks prior to its release, official industry tracking projected the film would debut to $65–80 million, with some estimates going as high as $90 million. The week of its release, Atom Tickets announced pre-sale totals for the film were outpacing those of Venom and It Chapter Two ($91.1 million debut) and that Joker was its second-bestselling R-rated film of 2019 behind John Wick: Chapter 3 – Parabellum.</p><p>Joker opened in 4,374 theaters in North America and made $39.9 million on its first day, including $13.3 million from Thursday night previews, besting Venom's respective October records. The film also had the biggest October opening day of any film, beating out Halloween. It went on to break Venom's record for having the biggest October opening weekend, finishing with a domestic total of $96.2 million. The film set career records for Phoenix, Phillips and De Niro and was the fourth-largest debut for an R-rated film of all time. This record would cross over The Matrix Reloaded, staying behind Deadpool, Deadpool 2 and It. It was also Warner Bros.' biggest domestic opening in two years. In its second weekend the film fell just 41.8% to $55.9 million, remaining in first and marking the best second-weekend October total (besting Gravity's $43.1 million in 2013). It made $29.2 million in its third weekend and $19.2 million in its fourth, finishing second behind Maleficent: Mistress of Evil both times. After 155 days, Joker's American theatrical run wrapped up on March 5, 2020 with a final gross of $355.5 million, making it the fourth-highest domestic gross for an R-rated film, behind The Passion of the Christ, Deadpool and American Sniper.</p><p>Worldwide, the film was projected to debut to around $155 million, including $75 million from 73 overseas territories. It made $5.4 million from four countries on its first day and $18.7 million from 47 in its second, for a two-day total of $24.6 million. It went on to greatly exceed expectations, making $140.5 million from overseas territories and a total $234 million worldwide. Its largest markets were South Korea (a Warner Bros. record $16.3 million), the United Kingdom ($14.8 million), Mexico ($13.1 million) and Japan ($7 million). With this, it became the biggest worldwide opening for an October film. During its second weekend, the film made an additional $125.7 million worldwide, and $77.9 million in its third. By this point, industry analysts expected Joker to become the highest-grossing R-rated film of all time, with some suggesting that it could finish its run with over $1 billion. The film became the highest-grossing R-rated film in its fourth weekend, during which it grossed $47.8 million internationally, and passed the billion-dollar mark about a month into its theatrical release.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, Joker holds an approval rating of 69% based on 597 reviews, with an average rating of 7.3/10. The site's critical consensus reads, \"Joker gives its infamous central character a chillingly plausible origin story that serves as a brilliant showcase for its star – and a dark evolution for comics-inspired cinema.\" Metacritic, which uses a weighted average, assigned the film a score of 59 out of 100 based on 60 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale, while those at PostTrak gave it an overall positive score of 84% (with an average 4 out of 5 stars) and a 60% \"definite recommend\".</p><p>Mark Kermode of The Observer rated the film 4 out of 5 stars, stating \"Joker has an ace card in the form of Joaquin Phoenix's mesmerisingly physical portrayal of a man who would be king.\" Writing for IGN, Jim Vejvoda gave Joker a perfect score, saying that the film \"would work just as well as an engrossing character study without any of its DC Comics trappings; that it just so happens to be a brilliant Batman-universe movie is icing on the Batfan cake.\" He found it a powerful and unsettling allegory of contemporary neglect and violence and described Phoenix's performance as the Joker as engrossing and \"Oscar-worthy\". Similarly, Xan Brooks of The Observer—who also gave the film a perfect score—called it \"gloriously daring and explosive\" and appreciated how Phillips used elements from Scorsese films to create an original story. Variety's Owen Gleiberman wrote, \"Phoenix is astonishing as a mentally ill geek who becomes the killer-clown Joker in Todd Phillips' neo-Taxi Driver knockout: the rare comic-book movie that expresses what's happening in the real world.\"</p><p>ComicBook.com's Brandon Davis acclaimed Joker as a groundbreaking comic book adaptation that he found scarier than most 2019 horror films. Davis compared it favorably to the 2008 Batman film The Dark Knight, praised the cinematography and performances and called it a film that needed to be seen to be believed. Deadline Hollywood's Pete Hammond believes the film redefines the Joker and is \"impossible to shake off\". Hammond also praised the story and performances and summarized the film as \"a bravura piece of filmmaking that speaks to the world we are actually living in today in ways that few movies do.\" Peter Travers of Rolling Stone said he was lost for words in describing Phoenix's performance, calling the film \"gut-wrenching\" and \"simply stupendous\".</p><p>David Ehrlich of IndieWire was more mixed and gave the film a \"C+\". He felt that while \"Joker is the boldest and most exciting superhero movie since The Dark Knight\", it was \"also incendiary, confused and potentially toxic\". Ehrlich thought that the film would make DC fans happy and praised Phoenix's performance, but criticized Phillips' direction and the lack of originality. A critical review came from Glenn Kenny of RogerEbert.com, who gave the film two stars out of four. Though he praised the performances and thought the story worked, Kenny criticized the social commentary and Phillips' direction, finding the film too derivative and believing its focus was \"less in entertainment than in generating self-importance\". In an analysis of the character Joker, Onmanorama's Sajesh Mohan wrote that the movie was cliché-ridden, the only original part being Joaquin Phoenix's acting. \"The movie, with great pain and in detail, explains how Arthur Fleck turns into Joker dejected by the way the world treats him. Thanks to Phillips and Silver, Phoenix was able to bring out the king among the Jokers,\" the analysis read.</p><p>Stephanie Zacharek of Time magazine, in a negative review, labeled Phoenix's performance over-the-top and felt that while Phillips tried to \" us a movie all about the emptiness of our culture... he's just offering a prime example of it.\" She argued the plot was nonexistent, \"dark only in a stupidly adolescent way\" and \"stuffed with phony philosophy\". Meanwhile, NPR's Glen Weldon thought the film lacked innovation and said its sympathetic take on the Joker was \"wildly unconvincing and mundanely uninteresting\". Weldon also described Joker as trying too hard to deviate from the comics and, as a result, coming off as an imitation of films like Taxi Driver. Peter Bradshaw of The Guardian called it \"the most disappointing film of the year\". While praising Phoenix's performance and the first act, he criticized the film's political plot developments and overall found it too derivative of various Scorsese films.</p><h4>Industry response</h4><p>Joker generated positive responses from industry figures. DC Comics chief creative officer Jim Lee praised it as \"intense, raw and soulful\" and stated that it had remained true to the character despite deviating from the source material. Actor Mark Hamill, who has voiced the Joker in animation and video games since Batman: The Animated Series, thought the film had \"brilliantly\" reinvented the character and gave it \" thumbs up\". Superman (1978) director Richard Donner called the film \"brilliant\", \"fascinating\", \"really well-written\" and stated that Phoenix's performance was \"genius\". Documentary filmmaker Michael Moore called Joker a \"cinematic masterpiece\" and stated it was a \"danger to society\" if people did not see it. Actor Josh Brolin found the film powerful: \"To appreciate Joker I believe you have to have either gone through something traumatic in your lifetime (and I believe most of us have) or understand somewhere in your psyche what true compassion is\". Actor Vincent D'Onofrio vocally commended Phoenix's performance in the film on Twitter, stating that he \"deserve recognition for this performance\", while actress Jessica Chastain agreed, replying: \"It's one of the greatest pieces of acting I've ever seen\". Actress and screenwriter Phoebe Waller-Bridge also praised the film, stating: \"I think the reason people got so uncomfortable is because it feels too true, too raw. I was watching it and thinking to myself, God, if this came out a year into Obama's time in office, I don't think we'd be feeling as worried about it\". Filmmaker David Fincher said of the film's unexpected success, \"Nobody would have thought they had a shot at a giant hit with Joker had The Dark Knight not been as massive as it was. I don't think anyone would have looked at that material and thought, 'Yeah, let's take Travis Bickle and Rupert Pupkin and conflate them, then trap him in a betrayal of the mentally ill and trot it out for a billion dollars'\". Actor Brendan Gleeson felt that Phoenix's performance as the Joker was absolutely \"indelible\" and one of the most magnificent achievements in cinema he has ever seen, incidentally being that the reason he opted to join the film's sequel Joker: Folie à Deux (2024).</p><h4>Accolades</h4><p>Joaquin Phoenix's performance in the film won him multiple awards, including an Academy Award for Best Actor, a BAFTA Award for Best Actor in a Leading Role, a Critics' Choice Movie Award for Best Actor, a Golden Globe Award for Best Actor – Motion Picture Drama and a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role.</p><p>Joker won the Best Actor (Phoenix) and Best Original Score awards at the 92nd Academy Awards. It received overall eleven nominations (including Best Picture) from the ceremony, breaking the record of eight held by The Dark Knight for the most nominations received by a film based on a comic book, comic strip or graphic novel. Hildur Guðnadóttir also became the first woman to win an original score Oscar since The Full Monty in 1998. At the 73rd British Academy Film Awards, the film won Best Actor in a Leading Role (Phoenix), Best Casting and Best Original Music out of a leading eleven nominations including Best Film. The film was nominated for four Golden Globe Awards for the 77th ceremony, winning the awards for Best Original Score and Best Actor (Phoenix). The film was nominated for seven awards at the 25th Critics' Choice Awards, winning Best Actor (Phoenix) and Best Score and was included in the American Film Institute and Cahiers du Cinéma's top 10 films of 2019.</p><p>Having won an award at the 26th Screen Actors Guild Awards for Phoenix's performance, Joker also received nominations from other guilds including the Writers Guild of America Awards and the Producers Guild of America. It won a Best Period and/or Character Make-Up in a Feature-Length Motion Picture award from the Make-Up Artists and Hair Stylists Guild. An American production, the film won the Golden Lion at the 76th Venice International Film Festival.</p><br/><h3>Themes and analysis</h3><p>Joker deals with the themes of mental illness and its effects. While its depiction of the Joker has been described as reminiscent of those who commit mass shootings in the United States as well as members of the incel community, Christina Newland of The Guardian concludes that Fleck is not an incel, but wrote that incels are likely to relate to him. Vejvoda, Hammond and Newland interpreted the film as a cautionary tale—society's disregard of those who are less fortunate will create a person like the Joker. Stephen Kent, writing for the Washington Examiner, described Arthur Fleck as blending shared aspects of mass shooters and interpreted its message as a reminder that society is riddled with men like the Joker. Writing in People's World, Chauncey K. Robinson said the film \"walks a fine line between exploration and validation\" of Joker's character and is \"ultimately an in-your-face examination of a broken system that creates its own monsters.\"</p><p>Some writers have expressed concern that Joker's sympathetic portrayal of a homicidal maniac could inspire real-world violence. Richard Lawson of Vanity Fair found the film was too sympathetic towards \"white men who commit heinous crimes\" and that the sociopolitical ideologies represented in the film are \"evils that are far more easily identifiable\" to people \"who shoot up schools and concerts and churches, who gun down the women and men they covet and envy, who let loose some spirit of anarchic animus upon the world—there's almost a woebegone mythos placed on them in the search for answers.\" Jim Geraghty of National Review wrote he was \"worried that a certain segment of America's angry, paranoid, emotionally unstable young men will watch Joaquin Phoenix descending into madness and a desire to get back at society by hurting as many people as possible and exclaim, 'finally, somebody understands me!'\" Contrarily, Michael Shindler, reviewing the film in Mere Orthodoxy, while agreeing that Joker depicts a sympathetic wish fulfillment fantasy, contends (drawing on insights from Sigmund Freud and Jacques Lacan) that it is for precisely that reason that the film will, if anything, preemptively quell real-world violence by rendering \"the Flecks of the world into meek somnambulists.\"</p><p>British neurocriminologist Adrian Raine was impressed by how accurate the film's depiction of the psychology of a murderer was. In an interview with Vanity Fair, he described it as \"a great educational tool\" and stated that he planned to present film clips during his classes. Psychiatrist Kamran Ahmed highlighted the factors in Arthur's childhood such as parental abuse and loss and family history of mental illness in the genesis of his condition. American psychiatrist Imani Walker, who is known for her Bravo television series Married to Medicine Los Angeles and working with violent criminals with mental disorders, analyzed the Joker's apparent mental disorders and circumstances and noted that Arthur tries to find help before his downfall, only to be abandoned. She says of Arthur and others in poverty who have mental illness: \"We as a society don't even pretend that they're real people and that's what this movie is about. He never had a chance.\" Forensic psychiatrist Ziv Cohen criticized the film as misrepresenting the mentally ill as violent. He argued the film conflates psychopathy (a lack of conscience) with mental illness, thereby creating a false impression of the mentally ill as dangerous.</p><p>Micah Uetricht, managing director of Jacobin, opined in a review published by The Guardian that he was shocked that the media did not understand the movie's message: \"we got a fairly straightforward condemnation of American austerity: how it leaves the vulnerable to suffer without the resources they need and the horrific consequences for the rest of society that can result\"; Uetricht thus declares that Joker presents a world that has devolved into \"barbarism\". Uetricht states that these themes are unsubtle to the extent that it was surprising that most media outlets had not identified them. Ahmed also highlights the lack of funding for already-stretched mental health services worldwide being alluded to.</p><p>The film's director and co-screenwriter, Todd Phillips, has stated that Joker is \"certainly not a political film.\" Phillips has also commented on discourse surrounding the film, pushing back on several criticisms surrounding its themes. He responded to critics who have expressed concerns over the film's violence, saying \"Isn’t it good to have these discussions about these movies, about violence? Why is that a bad thing if the movie does lead to a discourse about it?\" Phillips also commented on political backlash to the film, saying \"What’s outstanding to me in this discourse in this movie is how easily the far left can sound like the far right when it suits their agenda. It’s really been eye-opening for me.\"</p><br/><h3>Cultural impact</h3><p>During a Five Star Movement event in October 2019, Italian comedian and politician Beppe Grillo gave a speech wearing the Joker's makeup. Yusuke Kawai, the governor of Chiba Prefecture, appeared on NHK with a Joker costume in 2021. References to the character were also found in anti-government protests worldwide. During the 17 October Revolution, a group of graffiti artists called Ashekm painted a mural of the Joker holding a Molotov cocktail and it was also reported that there was a Joker facepaint station at the protests in Beirut. In Los Ángeles, Chile, during the 2019–2022 Chilean protests, the phrase \"We are all clowns\", which is adopted by Gotham City protesters in the movie, was written at the foot of a statue. In Hong Kong, protesters challenged an emergency decree prohibiting the wearing of masks by wearing those of fictional characters such as the Joker. In France, during the Yellow Vest Protests, firefighters donned Joker makeup holding placards. In 2020, during the George Floyd protests, Argentine president Alberto Fernández compared the pictures of the protests to those seen in the film.</p><p>One of the locations seen in the film, a set of stairs in the Bronx, New York City, has been dubbed the Joker Stairs. The stairs have become a tourist destination and the subject of internet memes, with visitors often reenacting the scene from the film in which Fleck dances down the stairs in his Joker attire. Ukrainian boxing champion Oleksandr Usyk wore a suit resembling that of Joker in a pre-fight press conference leading up to his fight with Anthony Joshua.</p><br/><h3>Sequel</h3><p>While Joker was intended to be a standalone film with no sequels, Warner Bros. Entertainment also intended for it to launch a new franchise named DC Black, which would include DC Comics-based films unrelated to the DCEU with darker and more experimental material. It was later established as part of the \"DC Elseworlds\" lineup in 2023 by DC Studios CEO James Gunn in order to differentiate it from his upcoming DC Universe project. In August 2019, Todd Phillips stated that he would be interested in making a sequel, depending on the film's performance and Phoenix's interest. He stated that the movie was pitched as standalone, \"one movie, and that's it.\" In October 2019, Phoenix stated in an interview, \"I can't stop thinking about it...if there's something else we can do with Joker that might be interesting,\" and concluded, \"It's nothing that I really wanted to do prior to working on this movie. I don't know that there is...Because it seemed endless, the possibilities of where we can go with the character.\"</p><p>In November 2019, The Hollywood Reporter announced that a sequel was in development, though this was later disputed by Deadline Hollywood. Phillips responded to these reports, by saying that there were discussions with Warner Bros. for a sequel, but that it was not currently in development. He later clarified that despite ongoing rumors, the then-upcoming Matt Reeves-directed film centered around Batman was not related to Joker. Later, he expressed interest in a potential spin-off film centered around Batman in his Joker's universe, stating: \"What I would like to see someone tackle is what Batman looks like from that Gotham. I'm not saying I'm going to do that.\"</p><p>In May 2021, it was stated that a Joker sequel was in development. Later that month, Phillips had entered negotiations to serve as a screenwriter. In January 2022, Willem Dafoe expressed interest in appearing in the sequel. By June, the sequel was officially confirmed to be in development with Phillips serving as director with a script he co-wrote with Silver. The working title of the project was revealed to be Joker: Folie à Deux. Lady Gaga reportedly was in negotiations to star alongside Phoenix as Harley Quinn and it was also reported that the film would be a movie musical. Phoenix's salary, as a result of the first film's commercial success, increased from $4.5 million to $20 million for the sequel. On August 3, Warner Bros. Pictures announced that the film will be released on October 4, 2024. Gaga confirmed the next day that she would star in it. Shortly after, Beetz was in negotiations to reprise her role as Sophie Dumond in the sequel. She was confirmed on September 1, 2022, alongside Brendan Gleeson. On September 7 and September 13 respectively, Catherine Keener and Jacob Lofland were cast in undisclosed roles. On October 20, Industry actor Harry Lawtey was reported by Deadline Hollywood to have been cast in what was described to be a \"big role\" in the film.</p><p>On December 10, 2022, production began, with Phillips releasing a first look of Phoenix's reprisal as the Joker on his Instagram account.</p><br/>"
  },
  "errorMessage": ""
}