{
  "imDbId": "tt0059742",
  "title": "The Sound of Music",
  "fullTitle": "The Sound of Music (1965)",
  "type": "Movie",
  "year": "1965",
  "items": [
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/10535005/The-Sound-of-Music-review.html",
      "rate": "100",
      "content": "As for Andrews, she is just a joy, conveying enough doubt beneath that brisk, clean exterior to stop her character becoming a prig; her comic timing and the way in which she convinces in her relationships with the children are so understated they can be underrated."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1965/film/reviews/the-sound-of-music-2-1200420913/",
      "rate": "100",
      "content": "The Robert Wise production is a warmly pulsating, captivating drama set to the most imaginative use of the lilting R-H tunes, magnificently mounted and with a brilliant cast headed by Julie Andrews and Christopher Plummer which must strike a respondent chord at the box office."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/sound-music-review-1965-movie-1090228/",
      "rate": "100",
      "content": "The 20th-Fox release will be one of the movies' all-time hits, one of the all-time great pictures. It restores your faith in movies. If you sit quietly and let it take, it may also restore your faith in humanity. It does this with infectious wit, with consistent gaiety, with simple and realistic spirituality, with romance of heartbreak and heartmend. This is set against the most beautiful scenery you have seen in your life. The Sound of Music is quite a picture."
    },
    {
      "publisher": "Empire",
      "author": "Caroline Westbrook",
      "link": "https://www.empireonline.com/movies/reviews/sound-music-review/",
      "rate": "100",
      "content": "One of the greatest screen musicals ever."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/movies/julie-andrews-voice-captivates-sound-music-article-1.2054937",
      "rate": "100",
      "content": "Robert Wise has transformed the delightful Rodgers and Hammerstein musical stage production of \"The Sound of Music\" into a magical film in which Julie Andrews gives an endearing performance in the role of Maria, the governess."
    },
    {
      "publisher": "The Guardian",
      "author": "Xan Brooks",
      "link": "https://www.theguardian.com/film/2007/sep/21/musical",
      "rate": "80",
      "content": "Robert Wise's adaptation of the Rodgers and Hammerstein musical still has a little soul in its bones, with its reactionary nature tempered by Ernest Lehman's supple screenplay, and its elephantine running-time eased by a set of songs that lodge in your system like hookworms."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/the-sound-of-music/review/2000274723/",
      "rate": "50",
      "content": "It's so perfectly contrived and mechanical and fresh as a daisy, it's infuriating."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/1965/03/03/archives/the-sound-of-music-opens-at-rivoli.html",
      "rate": "40",
      "content": "Miss Andrews, with her air of radiant vigor, her appearance of plain-Jane wholesomeness and her ability to make her dialogue as vivid and appealing as she makes her songs, brings a nice sort of Mary Poppins logic and authority to this role, which is always in peril of collapsing under its weight of romantic nonsense and sentiment."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://content.time.com/time/subscriber/article/0,33009,839344,00.html",
      "rate": "40",
      "content": "Though Director Robert Wise (West Side Story) has made capital of the show's virtues, he can do little to disguise its faults. In dialogue, song and story, Music still contains too much sugar, too little spice."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "30",
      "content": "This 1965 hit is the sort of film that reeks of emotional Muzak, the most elemental responses programmed right into the scenario. Every audience sniffle and tear has been taken into account."
    }
  ],
  "errorMessage": ""
}