{
  "imDbId": "tt0059742",
  "title": "The Sound of Music",
  "fullTitle": "The Sound of Music (1965)",
  "type": "Movie",
  "year": "1965",
  "items": [
    {
      "username": "jacobs-greenwood",
      "userUrl": "https://www.imdb.com/user/ur27779876",
      "reviewLink": "https://www.imdb.com/review/rw3596666",
      "warningSpoilers": true,
      "date": "11 December 2016",
      "rate": "10",
      "helpful": "74 out of 75 found this helpful.",
      "title": "Pure cinematic magic, won Best Picture of the Year and rightfully so!",
      "content": "Capitalizing on two \"hot\" properties of the early sixties, director Robert Wise and the infinitely talented Julie Andrews, this film delivers some pure cinematic magic like none before it nor since, especially the sequences which feature the songs \"Do Re Mi\" (#88 on AFI's 100 Top Movie Songs of All Time) through the streets of Salzburg and \"The Lonely Goatherd\", performed with puppets.These, among others, helped it capture the Best Picture Oscar that year over David Lean's Doctor Zhivago (1965), Stanley Kramer's Ship of Fools (1965), A Thousand Clowns (1965), and Darling (1965), which (like Doctor Zhivago (1965), also) features Julie Christie, in her Oscar winning Best Actress performance. Wise, who would later receive the Irving G. Thalberg Award from the Academy, picked up his second Best Director Oscar for this film; Andrews her second consecutive Best Actress nomination (she'd won for her film debut in Mary Poppins (1964)).Written by Howard Lindsay and Russel Crouse (and Maria von Trapp's novel), Ernest Lehman's screenplay tells the story of the Austrian von Trapp family who, after their first public performance as a singing group, fled when Hitler annexed their country (the Anschluss) in March, 1938. The real von Trapp family had performed all over Europe because Maria, with the help of a local priest (fashioned as Max Detweiler, played by Richard Haydn, in the film), had turned the family's hobby into a profession when an Austrian bank crash caused Georg to lose his fortune.Though this musical is almost three hours in length, the plot interspersed with magnificent Rodgers & Hammerstein songs (helping the film to win the Oscar for Best Music, Scoring of Music, Adaptation or Treatment) keep it from feeling overlong.In fact, it's the kind of film, like The Wizard of Oz (1939), that one can watch every year and never tire of it. The title song is #10 on AFI's 100 Top Movie Songs of All Time; \"My Favorite Things\" is #64. And no one can forget (how do you solve a problem like) \"Maria\", sung in part by Marni Nixon (known for dubbing Deborah Kerr, Natalie Wood, and Audrey Hepburn in The King and I (1956), West Side Story (1961), and My Fair Lady (1964), respectively) in one of her only on-screen appearances as Sister Sophia ... or \"Climb Ev'ry Mountain\", \"Edelweiss\" and \"So Long, Farewell\", especially little Kym Karath's \"goodbye\" in the reprise, as the seven year old Gretl. Each of these tunes, and their just right lyrics, move the story along such that one never has cause to look at one's watch to wonder \"when will it end?\". The film's Sound and Editing, as evidenced in the aforementioned \"Do Re Mi\" and \"The Lonely Goatherd\" numbers, also won Academy Awards.Christopher Plummer (whose singing voice was dubbed by Bill Lee) is terrific as the stern aristocrat widower who marries his governess after she, and his children, had helped the Captain to rediscover song, love, and what it means to be a father. The cast of kids is marvelous, the most recognizable of which is Angela Cartwright as Brigitta, who would go on to star in the TV series Lost in Space that same year. Nicholas Hammond, Friedrich, also had a television career which included playing roles in several series, most notably as Spiderman. Heather Menzies's (Louisa) TV career was shorter. Charmian Carr gives a strong performance as the eldest child Liesl who's \"Sixteen going on Seventeen\". Peggy Wood's head Mother Abbess (whose singing voice was dubbed by Margery McKay) earned her a Best Supporting Actress Oscar nomination. Her best line \"Him?!\", after which she immediately excuses Sister Margaretta (Anna Lee), when Maria is telling her why she's returned to the abbey.I also especially like the \"dueling\" Sisters, Margaretta and Berthe (Portia Nelson) who, despite their disparate feelings towards Maria's suitability as a nun, work together to foil the Nazis in the end. Ben Wright plays a credible Herr Zeller. The recognizable Norma Varden is Frau Schmidt, the von Trapp's housekeeper. And to have the great Eleanor Parker in a supporting role as the Baroness, who presumably doesn't sing or perform (she that forgot her harmonica), such ironic and fortunate casting! Also, Maria von Trapp herself appears briefly, uncredited, during the \"I Have Confidence\" number.The film's Color Art Direction-Set Decoration, Cinematography, Costume Design also received Oscar nominations. Plus, besides being added to the National Film Registry in 2001, the film is #55 on AFI's 100 Greatest Movies list and #27 on AFI's 100 Greatest Love Stories list. #41 on AFI's 100 Most Inspiring Movies list. #4 on AFI's 25 Greatest Movie Musicals list.One of the best family movie night film's ever made, make it an annual tradition in yours!"
    },
    {
      "username": "davispittman",
      "userUrl": "https://www.imdb.com/user/ur58619720",
      "reviewLink": "https://www.imdb.com/review/rw3841913",
      "warningSpoilers": false,
      "date": "26 October 2017",
      "rate": "10",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Fantastic family friendly musical classic",
      "content": "The Sound of Music (1965) is an all time classic family musical that has always been one of my favorites. Ever since I was child, I would watch this movie and just love every minute of it. This movie really was destined for greatness from the beginning, anyone at all could have seen that. Between the A list cast, great performances, top notch singing, and the enchanting story.... there's no wonder people still love it to death. Julie Andrews stars as Maria, who is a nun, but not a very good one, and she gets sent to be a governess to the Von Trapp family. The Von Trapp family is a very well to do family in Austria. The father is a former captain and the mother died some time ago. Christopher Plummer plays captain Von Trapp, and he does a great job. Every member of the cast does a great job with their performances, both singing and non. The singing alone in this film is just astounding, every single musical number is just as good, if not better than the previous one. If you do not care for musicals, then I wouldn't really suggest this movie to you. It really is a lot of singing, but it is great singing by talented artists, which is really why it will forever have a place in classic great cinema. 10/10 for The Sound of Music. Enchanting story with lovely entertaining music."
    },
    {
      "username": "brett-76260",
      "userUrl": "https://www.imdb.com/user/ur71629917",
      "reviewLink": "https://www.imdb.com/review/rw4145452",
      "warningSpoilers": false,
      "date": "28 April 2018",
      "rate": "10",
      "helpful": "54 out of 58 found this helpful.",
      "title": "Just a classic that will never get old",
      "content": "Song and dance is definitely not my thing. However I've seen this movie dozens and dozens of times overs the years. It never gets old... if you have never seen it it's well worth your time. They just don't make them like this anymore. Rent it or buy it, a true classic that is perfect from start to finish..."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1026849",
      "warningSpoilers": true,
      "date": "23 February 2005",
      "rate": "10",
      "helpful": "46 out of 54 found this helpful.",
      "title": "Would you even want to solve a problem like Maria? She's wonderful!",
      "content": "Sound of Music is one of the best musicals of all time displaying one of the greatest voices to ever be heard on the silver screen: Julie Andrews. What a wonderful movie that not only I grew up with but still treasure to this day. Sound of Music has everything you could ask for: romance, humor, singing, dancing and a wonderful cast that put their heart and soul into this film. All the songs are recognizable, although I admit that still hearing \"Few Favorite Things\" is strange during Christmas time. But moving on, Sound of Music is a classic film that is still incredible to watch and I always enjoy slipping into my DVD player to this day.Maria, a young nun in an Austrian convent who regularly misses her morning prayers because she enjoys going to the hills to sing the title song. Deciding that Maria needs to learn something about the real world before she can take her vows, the Mother Superior sends her off to be governess for the children of the widowed Captain Von Trapp. Arriving at the Trapp home, Maria discovers that her new boss is cold and aloof, and his seven children virtual automatons-at least, whenever the Captain is around. Otherwise, the kids are holy terrors, as evidenced by the fact that Maria is the latest in a long line of governesses. But Maria soon ingratiates herself with the children, especially oldest daughter Liesl, who is in love with teenaged messenger boy Rolf. As Maria herself begins to fall in love with the Captain, she rushes back to the Abbey so as not to complicate his impending marriage to a glamorous baroness. But the children insist that Maria return, the Baroness steps out of the picture, and Maria and the Captain confirm their love in the song \"Something Good.\" Unhappily, they return home from their honeymoon shortly after the Nazis march into Austria. Already, swastikas have been hung on the Von Trapp ancestral home, and Liesl's boyfriend Rolf has been indoctrinated in the \"glories\" of the Third Reich. The biggest blow occurs when Von Trapp is called back to active duty in the service of the Fuhrer. The Captain wants nothing to do with Nazism, and he begins making plans to take himself and his family out of Austria.Julie Andrews had come off fresh from Mary Poppins, which her character wasn't that far from being the nanny caring for children with a stuffy father. But the thing that made this film so special is that you honestly feel the love between Maria and Von Trapp, what a wonderful love story they had. The film is a bit long, but back in the day they had intermissions and oh, boy do I miss that. Come on, Lord of the Rings could have used one of those lol. Back onto Sound of Music, my favorite song is probably \"Confidence in Me\", such life to it due to Julie's beautiful voice and her dancing along the sidewalk could make anyone want to do the same thing. I love The Sound of Music, my boyfriend who hates musicals and said this was the crown of the worst, I asked him to watch it with me to see if he would give it another chance, I glanced over to see him singing a little to the songs! He finally admitted that the songs are very catchy, so see? You can find any little positive thing to say about this film, The Sound of Music brings you to life and you can't help but fall in love with this spectacular musical.10/10"
    },
    {
      "username": "duffjerroldorg",
      "userUrl": "https://www.imdb.com/user/ur74701968",
      "reviewLink": "https://www.imdb.com/review/rw3683342",
      "warningSpoilers": false,
      "date": "12 April 2017",
      "rate": "10",
      "helpful": "203 out of 209 found this helpful.",
      "title": "We are alive with The Sound Of Music",
      "content": "Let me confess I'm not a Catholic, I don't have children, I can't stand schmaltz and yet I love The Sound Of Music. I've tried to explain this to myself, let alone to others, without ever finding a satisfactory answer. Yesterday I sat to see it again with a group of kids who hadn't seen it before. They all loved it even the ones who loved Transporters. I asked them afterwards why did they loved it so much and a 12 year old boy's reply was: \"It makes you feel alive\" Wow, I thought, Wow! Of course, that's what I felt too and a 12 year old found the perfect words to express my feelings. Julie Andrews is a the center of this little miracle. She is Sister Maria and her wishes, thoughts and fears are recognizable automatically, because they are, in many ways, my same wishes, thoughts and fears. Perfect. Thank you."
    },
    {
      "username": "Poseidon-3",
      "userUrl": "https://www.imdb.com/user/ur0193491",
      "reviewLink": "https://www.imdb.com/review/rw0090905",
      "warningSpoilers": false,
      "date": "29 April 2002",
      "rate": "",
      "helpful": "166 out of 212 found this helpful.",
      "title": "The perfect film musical......",
      "content": "This film is a triumph in all departments. Every aspect, from the cinematography to the acting, the sets to the costumes, the music, choreography, script, is top notch. While the film is family friendly and has a sweet story, it is constantly amazing the way people attack it as saccharine and sugary. This can certainly be said of the stage show, but the movie version has been carefully produced to provide a more well-rounded vision. Ernest Lehman worked wonders with the underdeveloped and unremarkable dialogue of the play. He inserted so many moments of wit, humor, romance and poignancy that are nowhere in sight in the original. the art directors purposefully chose muted settings and colors. Each of the actors bent over backwards to provide a brilliant performance. Andrews is already down in history for the performance of a lifetime (and a voice to match), but Plummer is not to be forgotten. Not only is he regal and handsome, but his decision to play the Captain as a complex, sophisticated man with a sly dose of sarcasm was wonderful. His steely, stern persona is eventually melted down by the irrepressible Andrews to great effect. Every supporting performance is also delivered with the right amount of appeal, humor or menace as called for in the script. However, the one that takes the cake....that amazes each time, is the slinky, catty, toweringly glamorous Parker as Baroness Schraeder. Wisely, her songs were cut, further separating her from all the glee around her, so that she could whip out such zingers as \"Why didn't you tell me....to bring along my harmonica?\" or when she's told that Andrews may not make a great nun, \"If you need anything, I'd be happy to help you.\" The character is given a much more polished and integral position in the film versus the stage and virtually every line of her dialogue (unlike in the play) is a howler. Though Wood was lovely in her role as the Mother Abbess, it was Parker who should have gotten an Oscar nod....and WON! Every expression, every syllable, every glance belies the decades of experience Parker gained as a leading lady during the 40's and 50's. Her clothes by Dorothy Jeakins are awe-inspiring. This type of film-making is GONE. The location photography, the simplicity of story and design, the sheer good-spiritedness of it all...they just can't do this anymore. Thankfully, there's this flawless gem to turn to when one just want to feel good. But saccharine? No..... Compare this to other beloved musicals with their garish colors and sugary story lines (\"Seven Brides...\", \"Singin' in the Rain\", \"...Molly Brown\", \"The Music Man\", to name just a few...) They are all highly enjoyable, but are hardly less sweet than this! Just one word.....Nazis!! Though virtually everyone knows the outcome, there is still genuine suspense at the climax of \"The Sound of Music\". The film has it all."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0090971",
      "warningSpoilers": false,
      "date": "28 October 2000",
      "rate": "",
      "helpful": "83 out of 107 found this helpful.",
      "title": "Hollywood's Last Great Musical",
      "content": "\"The Sound of Music\" is an impressive musical that stands above other films of the genre because of interesting characters, top-notch direction, and a truly inspired screenplay. Julie Andrews (Oscar-nominated) stars as the young nun who leaves the convent to become the governess to a large family. She is instantly at odds with the children's father (Christopher Plummer), but they soon fall in love and get married. However, evil forces lurk overhead as the Nazis invade their homeland of Austria. Somewhat based on a true story, \"The Sound of Music\" is one of those rare musicals that works because there is a sense of fear and drama in the film's final act. This makes the film believable and none of the musical numbers take away from the story or the film's direction. 5 stars out of 5."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2046458",
      "warningSpoilers": false,
      "date": "2 April 2009",
      "rate": "10",
      "helpful": "26 out of 32 found this helpful.",
      "title": "How do you solve a problem like Maria?",
      "content": "I know this movie is long, but it is a timeless musical nonetheless. The thing i loved most was the songs by Rodgers and Hammerstein. They are amazing, and make the movie what it is. Another reason why I love it is the magnificent performance of Julie Andrews as Maria, a young woman who wishes for a better life, I suppose. Maria is pretty, with a beautiful voice, mixed with brashness and sadness, all the qualities that Andrews gives to her performances. The only film she disappoints slightly in is Thoroughly Modern Millie. The choreography is superb, as well as the supporting cast, from the likes of Christopher Plummer and co. i can't pick a favourite scene, but who can forget the opening and the \"Do ah Dear\" sequence? i also thought the children were sweet and the film had a number of clever subplots, like Liesels's secret love. 10/10 for a musical, that should be in the top 250. It was number 2 on the Greatest Musicals, losing out to Grease. Bethany Cox"
    },
    {
      "username": "happipuppi13",
      "userUrl": "https://www.imdb.com/user/ur3329978",
      "reviewLink": "https://www.imdb.com/review/rw3292297",
      "warningSpoilers": true,
      "date": "6 August 2015",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "The Sights & Sounds of The Sound Of Music",
      "content": "*** This review may contain spoilers ***A few days ago I was thinking,\"What Best Picutre winner should I choose for a review?\" Many to choose from of course.The answer came to me when I chose to & replayed this wonderful film since it had been a few years since seeing it.I recall on The Oprah Winfrey Show ,she had Julie Andrews, Christopher Plummer and all 7 of the, now grown, child actors who played the Von Trapp children. It was the first time they'd all been together in one place since 1965 and it was a very touching reunion.Growing up in the 1970s and 1980s, The Sound Of Music was on TV every year and when you're a kid, it usually is the first \"Best Picture\" Oscar winner that you ever see in your life, without even knowing it.When you see it the first time, the moment you see Andrews in the hills and that sweeping camera shot, you know it's going to be something great.Like many kids, it was only natural I'd like songs like \"Do-Re-Mi\", \"My Favorite Things\", \"So Long, Farewell\" and \"The Lonely Goatherd\" (or \"The Yodeling Song\" as some call it) and more. I liked \"Edelweiss\" and \"Climb Every Mountain\" but not until when I was older. It was on every year in our house.Julie Andrews' singing voice is no longer of this caliber but it's great that we have her in this and \"Mary Poppins\" and other movies, where we can marvel at her vocal abilities back then.Plummer turns in a somewhat serious but enjoyable performance. Going from stern and inflexible, then back to the father the children knew when their mother was alive, fair and loving and (of course) singing.Every kid has their own memorable moments as well The family's togetherness and fun is disrupted by the infiltration of the wretched Nazi party. They know they have to escape their own country now or live under the rule of a cruel & heartless dictatorship.That leads to the most exciting part of the movie. The clever departure after the concert, chase through the city and eventual escape over the mountains.The Sound Of Music, as we know, was a phenomenal success when it was released in March of 1965. It deservedly won for Best Picture and it's other categories.That success came about because it's simply a movie that the whole family and even those without families can enjoy. Which is why it's still so highly acclaimed even now .Lastly, because the people behind the scenes, as well as Andrews & Plummer themselves, made sure the film had an equal balance of fun and that of the serious as well. A job and movie, well doneSounds like ten stars, for all time. (END)"
    },
    {
      "username": "littlemanzone",
      "userUrl": "https://www.imdb.com/user/ur64346717",
      "reviewLink": "https://www.imdb.com/review/rw3373611",
      "warningSpoilers": true,
      "date": "17 December 2015",
      "rate": "10",
      "helpful": "45 out of 47 found this helpful.",
      "title": "I couldn't fault a thing! A Masterpiece",
      "content": "I've grown up with every Female generation in my Family Singing these Songs, so it's surprising I've only just got round to watching this now. I had no idea this Movie was so Dark! Starting with the Joyful opening which slowly progresses to an unpredictable Sinister Storyline.This is Top Cinema at it's best!! The Costumes, The Settings, The Actors, The catchy Song writing all get Top Marks from me. I even found myself so engrossed and feeling anxious with sudden urges to shout at the Screen, especially near the End.I couldn't fault a thing! It's such a shame that modern Film makers seen to have lost the ability to write such Masterpieces anymore. A Brilliant Movie!!!"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1220869",
      "warningSpoilers": false,
      "date": "20 November 2005",
      "rate": "10",
      "helpful": "21 out of 27 found this helpful.",
      "title": "One of Our Favorite Things",
      "content": "I was fortunate enough to see The Sound of Music on Broadway with the original cast minus Mary Martin, her part had been taken over by Martha Wright at that point. The production was good, but the thing I like best about The Sound of Music was how well Robert Wise transferred it to the screen. I defy anyone to show any trace of stage origin in this magnificently photographed film from that aerial opening with Julie Andrews singing the title song to the end with the Von Trapp family climbing every mountain.The main difference between the stage production and the screen version is that the role of the Baroness Elsa Schrader played by Eleanor Parker is a singing role. With the casting of Ms. Parker, a talented player but no singer, certain songs out of necessity had to be eliminated. Eleanor is fine in her role, but I do wonder if Robert Wise meant to cast a singer in her part originally. On Broadway the Baroness was played by Marion Marlowe.Julie Andrews who became a Broadway star in My Fair Lady and Camelot and didn't do either role for the screen, gives her greatest screen performance in a Broadway role originally written for someone else. There was some criticism that Mary Martin was too old to be playing Maria in the original play, but she certainly was guaranteed box office on Broadway. Julie Andrews was just right for the part and she's in great voice. I always marvelled listening to her at the perfect diction she was able to maintain hitting those high notes.Christopher Plummer took over the role that Theodore Bikel on Broadway and he too gained a signature role for his screen career. I've always felt that the talented Mr. Plummer has never been given the credit due him. He was a perfect Duke of Wellington in Waterloo and his portrayal of Commodus in The Fall of the Roman Empire is the highlight of that film. I like Christopher Plummer because he's also never taken himself seriously though he takes his art very seriously. I don't think too many other actors today could have played that comic villain in the Tom Hanks/Dan Ackroyd Dragnet movie and done it with such obvious zest and enjoyment.A real old timer got into this film with Peggy Wood playing the Mother Abbess at the Convent where Maria is a postulant. Ms. Wood's Broadway career dates back to 1911 and on stage she introduced songs by such people as Victor Herbert, Jerome Kern, Sigmund Romberg, and Noel Coward. You've got to be real good to get folks like that to write for you. And now her art is preserved in one of the most popular films of all time.The charm of the music and the leads and the kids sometimes obscures the anti-Nazi message that The Sound of Music conveys. The story takes place in Austria before and during the Anschluss. Christopher Plummer makes no secret of disgust for the Nazis and all they stand for. The Sound of Music makes it clear he is very much in a minority in terms of Austria uniting with Germany. Of course the irony is that Anschluss did not quite turn out for the Austrians as they hoped it would.The Sound of Music, it's story, it's music, it's lyrics and it's charm will stay with you and never leave after a hundred viewings."
    },
    {
      "username": "Calysta",
      "userUrl": "https://www.imdb.com/user/ur0390137",
      "reviewLink": "https://www.imdb.com/review/rw0090946",
      "warningSpoilers": false,
      "date": "12 January 2000",
      "rate": "10",
      "helpful": "203 out of 264 found this helpful.",
      "title": "My favourite movie of all time!",
      "content": "Watching my Mother dancing and singing to the songs of \"The Sound of Music\" at the age of five was incredibly disturbing. It was seven years before anyone was able to sit me down in front of the T.V to the musical during the annual telecast in Sydney. Almost to my horror, I was falling in love with the musical. More than two years later, not a single movie has been able to pass it in my favourite movies stakes. I have made judgemental mistakes with great movies. Greats like \"Casablanca\", \"The African Queen\" and \"The Wizard of Oz\" have originally also been frowned upon. \"The Sound of Music\" expanded my horizons on the movie world. I eventually went on to view non-musical classics as a result of this single movie, and now old classic movies have become a genuine passion. Rodgers and Hammerstein wrote their greatest work in the form of their last musical, despite the fact it was \"Carousel\" that was their favourite. Although the changes made from the original stage production have now been evident in the arrival of the excellent musical currently playing in Sydney, much have been for the better. Throughout their career, the duo created immortal musicals, but in story, song and film, \"The Sound of Music\" surpasses \"The King and I\", \"Oklahoma!\", \"Carousel\" and \"South Pacific\" in all aspects. We all know the story. We know of at least one of the immortal songs from the musical, \"The Sound of Music\", \"My Favourite Things\", \"Do-Re-Mi\" or \"Edelweiss\". Julie Andrews was believable and unforgettable as the sweet, outspoken novice nun turned governess, who should have taken out the oscar that year. Christopher Plummer was dashing as the Captain, and the supporting cast was one of the best I have ever seen. Fond memories have been remembered from some of the unforgettable sequences of this film that deservedly made it the best picture of 1965.Yes, there are sugary elements in the movie that cannot be denied. But this movie has never been reliant upon sex, violence or drugs to make it one of the best things to come out of Hollywood. It can be appreciated truly for what it is, pure art, talent and spirit. It is not a real perception of the world nowadays, but for all the joy it brings, who cares?It was the last movie I expected to love as a fourteen year old. It was also the first movie I watched in seven years that could manage to make me shed tears, and view it in loving admiration which cannot be equalled. \"Singin' In the Rain\" is the only other contender to the title of \"The greatest movie ever made\". Whatever its flaws, \"The Sound of Music\" is one of the worlds best loved treasures which keeps bringing generations of viewers to its attention.Rating: 10/10"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3132643",
      "warningSpoilers": false,
      "date": "29 November 2014",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Great Iconic sing-a-long musical",
      "content": "In pre-WWII Salzburg, Austria, the Mother Abbess doesn't know what to do with the flighty Maria (Julie Andrews). How do you solve a problem like Maria? Maria fearfully accepts being the governess to Captain Georg von Trapp (Christopher Plummer)'s seven children. The kids don't like her at first. She is the 12th in a long line of governesses. She eventually wins them over. The Captain is a widower who runs a cold strict household. The Baroness Elsa Schraeder (Eleanor Parker) accompanies him back from Vienna with singing producer Max Detweiler (Richard Haydn). However he starts to fall for the lovely governess and she for him. The jealous Baroness pushes her out of the way and the Captain asks the Baroness to marry him.Everybody is entitled to their opinion but I can't imagine anybody not appreciating the simple joy of this musical. The main objections seem to be the movie's departure from the real story. I don't know how much Nazism these critics want but it is a musical after all. Nobody is watching this for its authenticity. The songs are simply innocent fun. They are endlessly singable and Julie Andrews is the perfect Broadway ingénue with great screen presence. Christopher Plummer provides the compelling leading man. This is probably one of the best romantic musicals."
    },
    {
      "username": "o-31546",
      "userUrl": "https://www.imdb.com/user/ur77361817",
      "reviewLink": "https://www.imdb.com/review/rw3735151",
      "warningSpoilers": true,
      "date": "20 June 2017",
      "rate": "9",
      "helpful": "16 out of 17 found this helpful.",
      "title": "The power of music, the joy of music",
      "content": "The Sound of Music, the sound of freedom.This classic film is filled with glorious songs and has plenty for hopeless romantics to enjoy. The Sound of Music also effectively works in the tension and foreboding of the time period. Everyone in Austria has to make a choice when the Nazis arrive. Even the nuns in the abbey must make a choice.It's worth discussing with older kids why this was such a tense time and why the Von Trapps made the painful decision to flee the country they loved. It is a movie of catching freedom.\"The Sound of Music\" has contributed to the legend which has grown around the true life story of the Trapp family. ------Yidioo"
    },
    {
      "username": "jmbwithcats",
      "userUrl": "https://www.imdb.com/user/ur2533227",
      "reviewLink": "https://www.imdb.com/review/rw3385297",
      "warningSpoilers": false,
      "date": "1 January 2016",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Earns every Oscar",
      "content": "The Sound of Music (1965)For all the liberties made to historical accuracy, I think it goes without saying, a movie is being made, and without certain poetic license, the bird of genius cannot fly, so leeway must be given... and in so doing here, a truly important and beautiful result is made. Captain Von Trapp's (Christopher Plummer) stone intensity as a disciplinarian who has forgotten how to love, who has lost his inner music after the death of his wife, is softened and freed through the inspiring lightness of Maria's (Julie Andrews) enchanting entrance into he and his seven children's life as the house's new Governess... While the leads balance each other, the sweetness of the music is equally balanced by the sobriety of the situation in which they find themselves, during the Nazi occupation of Austria. What intrigues me is that in the song \"16 Going on 17\" the young boy Rolf who appears to be in love with Leisl warns her of being seduced by men, but in the end it is he who is seduced, by the Nazis... and it is so often the case in life that while teaching others we grow cocky and forget that we too are still students, and capable of falling prey to our own folly... We also must understand though, even as the Von Trapp family escapes over the Alps to Freedom (the truth is they fled by train during the day to Italy), that those who helped them may not get off so lightly even though it is unshown in the film... the nuns who would obviously be recognized as having helped them by removing the car's carburetor, the man at the festival would likely be found complicit in helping them escape, and I mention them because it is impossible not to think of those who gave their lives to help so many escape the Nazis tyranny, and now it is our turn to help new refugees escape tyranny... the more that things change, the more they stay the same... I am an emotional person, and connecting emotionally with characters does help enjoyment, but also confirms bias and dilutes objectivity for sure... but ultimately, I believe The Sound of Music earns all five of its Oscars.The Amazon film ends with a one-hour behind the scenes look into the film and the Von Trapp family hosted by Julie Andrews. A perfect way to end the film.And like Maria, like Julie Andrews, my life is truly eased through singing my music, so perhaps as a singer, as a Jew, I relate quite intimately with the story.And it is true as is sung in the movie, and I leave you with that idea now... \"My heart will be blessed with the sound of music. And I'll sing once more.\""
    },
    {
      "username": "gerry-russell-139",
      "userUrl": "https://www.imdb.com/user/ur0450649",
      "reviewLink": "https://www.imdb.com/review/rw0090897",
      "warningSpoilers": false,
      "date": "2 February 2002",
      "rate": "10",
      "helpful": "157 out of 203 found this helpful.",
      "title": "It just gains more and more fans every year",
      "content": "\"The Happiest sound in all the world\"? Quite possibly and easily the most famous musical film in Hollywood history. Most of us grown-ups still love it but at the same time we're also tired of seeing it over and over again (maybe that's why it's not rerun on NBC every single year anymore). Julie Andrews takes her MARY POPPINS success and adds even more to it with her delightful rendition of the role that Mary Martin originated on the Broadway stage in 1959 and ran even farther with it than Martin ever could. In my opinion, and I don't think I'm alone here, Martin was too old for the part (she was in her mid to late 40s in the stage version and Andrews was 30 when the transition came to film came around--a perfect age). As for the rest of the cast, it is just as talented: Christopher Plummer in the role he will be forever remembered for (even though he hated the part) is an achingly true Cap. Von Trapp with those \"hidden talents\" making subtle appearances throughout the film until blatantly bursting out into the open in the film's closing scenes; Richard Haydn makes for a comical and yet sincere \"Uncle\" Max, Peggy Wood is a starchy yet compassionate Reverand Mother and Charmian Carr as Liesl stands out as our perrenial favorite of the seven children. The locales are breathtaking as well (esp. the opening scenes which is probably the most beautiful aerial shot in all of film history and the cunning floral designs of the public Austrian gardens during the DO-RE-MI sequence). So let's all keep watching this most cherished of all musical films each year and never forget it's universal sentiment: to 'climb ev'ry mountain, ford ev'ry stream, follow ev'ry rainbow till you find your dream'."
    },
    {
      "username": "dweck",
      "userUrl": "https://www.imdb.com/user/ur0174106",
      "reviewLink": "https://www.imdb.com/review/rw0090885",
      "warningSpoilers": false,
      "date": "8 December 1998",
      "rate": "",
      "helpful": "118 out of 142 found this helpful.",
      "title": "In My Personal Top-Ten of All Time",
      "content": "Has Julie Andrews ever appeared on film more beautifully than in this film? Has she ever sung with such richness and gusto as is captured here? As a big fan of hers, I can watch this musical over and over and just sigh.Wise and his cinematographer have photographed Andrews in a manner that no other director has--even her husband. Watch the scene where Maria watches the Captain sing Edelweiss with the kids. Wise turns her into a gauzy angel. It is a fantastic moment among hundreds that this movie contains.I am firmly in a camp that says Julie Andrews was completely, utterly, and regrettably robbed when the 1965 Oscars were handed out. She embodied Maria Von Trapp, wholly and with every fiber of her being (just watch the scene in which she races the boys in a segment of \"Do-Re-Mi\"; she runs at the camera with utter abandon here, no holding back. Or consider the shot at the end of this song, where she places her hand atop her head--it's as if even SHE can't believe she's hitting that note).The Julie Christie performance that beat Andrews is now all but forgotton. \"The Sound of Music,\" however, lives on and on.\"The Sound of Music\" is a bit bittersweet for me, given that audiences tastes would soon turn away from big-budget musicals in general and Julie Andrews specifically. But what a legacy it (and she) have left!"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2615486",
      "warningSpoilers": true,
      "date": "22 May 2012",
      "rate": "9",
      "helpful": "14 out of 18 found this helpful.",
      "title": "My advice--Ignore reality and just enjoy.",
      "content": "This review contains LOTS of spoilers. My advice is not to read my review at all, as it will no doubt hinder your enjoyment of this wonderful film! I mean it--DON'T READ ON.....I adored \"The Sound of Music\" when I saw it for the first time when I was 16. I loved the film and was completely infatuated with Julie Andrews. Frankly, this isn't at all surprising as practically EVERYONE was in love with Julie Andrews after they watched the film! What wasn't to like?! The music was AMAZING, the story very romantic and the film uplifting throughout. However, I made a mistake. I loved the film so much that I read up on the real Von Trappe family--and it was little like the wonderful family in the film! The Captain was actually always a pretty nice guy and Frauline Maria wasn't exactly 'practically perfect in every way'! To make things MUCH worse, I traveled to Salzburg, Austria several decades later--and I learned THE TRUTH!!! The wonderful Von Trappe home in the film was actually a composite of about a half dozen different homes in the area! The gazebo was miles from the riverfront which was miles from the interior of the Von Trappe home--and the truth got worse! When we visited the cemetery where the family hid out at the end of the film, we were shocked (and VERY offended) at a memorial in this cemetery for the SS--the same folks that manned the death camps! All in all, this is a case where the truth really, really hurt. And, although I am a history teacher who loves historical accuracy, this is a case where I wish I'd never learned the truth. Heck, at the end of the film, you see the family escaping over the Alps to freedom--and in real life, they just took a train to Italy!! Hrmmph!!"
    },
    {
      "username": "Pedro_H",
      "userUrl": "https://www.imdb.com/user/ur1955998",
      "reviewLink": "https://www.imdb.com/review/rw0091027",
      "warningSpoilers": true,
      "date": "13 May 2003",
      "rate": "8",
      "helpful": "19 out of 23 found this helpful.",
      "title": "The best ever musical about an Austrian folk singing nun",
      "content": "A spirited nun leaves her convent and becomes a governess in pre-war Austria. Here she teaches the six children about love, life and music against the growing threat of Nazism.Your fingers hesitate on the keyboard before making comment on a film that is more a phenomena than a stretch of celluloid. This wasn't just a smash hit in the normal western markets - it also went huge everywhere and has stayed huge. The whole Indian film industry is descended from the template set down here.While this was a well regarded stage musical, this wasn't seen as a natural box office smash (a musical based on the life of a nun!) and was probably thrown to Robert Wise (more an action - than a music - man) because he was known for being able to operate well on a budget (all those B pics!)It was just as well, production was hellish: They had forgotten (didn't know?) how moody the European weather could be (even in Summer) and the genuine Austrian period folk songs didn't shine (new ones were quickly written); and beyond that many of the children had no real film acting experience.The success of the film is nothing but a bag of paradoxes, the must striking being that is was old fashioned even when it was released. Beat based pop music was dominating the sales charts and the sixties were beginning to swing. Hem lines were going up hair lines were going down and James Bond had already introduced casual sex and violence to the screen.This may have been made in 1965 - but it could easily have been made 20 years earlier and is the (off-screen) product of people that probably were coming to the end of their best creative period. Oscar and Hammerstein had already penned most of their famous musicals and must have been amazed that they struck their largest gold reserve so late in the day.As Noel Coward once observed, the one thing that critics overlook is that the public are looking for simple minded entertainment, not messages or meaning. And this is both simple minded and entertaining (if you can live with heavy schmaltz). There are certainly no messages, unless you need to be told that love and music are good and Nazi take-overs are bad!The songs don't so much act as light relief, but provide the film with a life support machine. As drama the whole thing can't get out of second gear - even the Nazi threat doesn't raise the drama level beyond village theatre. I also guess we are supposed to know what these people really represent from other sources?Julie Andrews performance is massively underrated. Here is someone that has to sing, dance and act with children (sometimes all at the same time!) and yet makes it look easy, natural and spontaneous. When has, say, Robert De Niro ever done anything as technically difficult as this?In many ways SOM is bullet proof (can you imagine Mel Brooks/Jerry Zucker doing a spoof?) family entertainment. A plot everyone can follow, charming children, excellent score, pretty scenery, perfect lead and a happy ending - if not for the rest of war torn Europe!As a footnote. Twentieth Century Fox lost all the profits they made on this film on musical follow ups that included Hello Dolly, Star and Dr Dolittle - which makes clear that the whole thing was, indeed, just a giant happy accident and musicals were not what the audience secretly wanted all along."
    },
    {
      "username": "silverscreen888",
      "userUrl": "https://www.imdb.com/user/ur5501912",
      "reviewLink": "https://www.imdb.com/review/rw1148077",
      "warningSpoilers": false,
      "date": "11 August 2005",
      "rate": "8",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Tuneful Score; Honest Emotions; Great Fun and a Flawless Production",
      "content": "The \"Sound of Music\" is set in the mountainous hills and the city of Salzburg, Austria. There is to my eye at least, something about its spacious alpine countryside which dominates and informs the entire production. The air, the light, the music, the styles of dress, the activities--everything is \"elevated\", with hardly anything being sea-level about it. And the film has a very good \"engagement sequence\" at the opening, when we learn about the central ethical character and experience her leaving the abbey where she has served along with her, and begin to care about her purposes. The story-line is simple and relatively direct: A young nun, unsuited to the profession, takes a job as a governess to the children of a difficult client--a captain in the Austrian navy who runs the household like a ship's company of sailors, complete with a bosun's whistle and a lineup of the children in matching uniforms. The body of the piece is then concerned with Maria, the governess, subverting the household and winning over the Captain until he gives up his present lady friend, a Baroness; then when Maria, who has been falling in love with him, goes away and comes back, he has to tell her he is in love with her also. They marry, to the children's delight in a great ceremony in a rebuilt replica of Salzburg's cathedral; but a Nazi Parrty official has words with the Captain. The family, against the Captain's former feeling, then enters the Sazlburg musical festival as the Von Trapp Family singers, something he had earlier opposed; and, winning the contest, they flee and are helped at her old abbey by Maria's Prioress and her friends there. The nuns sabotage the Nazis' cars by stealing parts, and Captain Von Trapp leads his family up over the mountain pass to freedom as the film ends. This happy film is filled with tuneful songs ranging from the ultra-simple \"Eidelweiss\" ballad to \"How Do You Solve a Problem Like Maria\" , \"Do Re Mi\", \"My Favorite Things\", \"The Sound of Music\", \"I Have Confidence\", \"The Lonely Goatherd\", \"Something Good\", \"Sixteen Going on Seventeen\" and the voice-challenging \"Climb Every Mountain\". Robert Wise directed this complex film, which features many sorts of scenes. Everything to me looks clean, bright and, frequently, even Austrian. Ernerst Lehman wrote the screenplay from the Broadway \"book\" by Howard Lindsay and Russell Crouse that borrowed its fictionalized biography from Maria Augusta Trapp's autobiographical work; Richard Rodgers and Oscar Hammerstein II supplied the music and lyrics. Ted McCord provided lucid cinematography, with the production being designed by Boris Leven. Ruby R. Leavitt and Walter M. Scott did the complex set decorations while famous Dorothy Jeakins created the many vivid costumes. In the large cast, Julie Andrews was a charming Maria, though she was not particularly Austrian. Christopher Plummer had some very good moments as the Captain, Eleanor Parker played the Baroness with great skill and Richard Haydn was the Captain's impresario friend, Max. Ben Wright was the Nazu gauleiter, Peggy Wood the Mother Superior, and among the nuns were Anna Lee, voice-dubbing soprano Marni Nixon, Evadne Baker and Portia Nelson., In the cast also were Daniel Truhitte, Norma Varden, Gilchrist Stuart as Franz the butler, with the children Charmian Carr, Nicholas Hammond, Angela Cartwright, Heather Menzies, Duane Chase, Debbie Turner, and Kym Karath. It is a bit difficult for me as a writer to account for the highly-positive qualities of the film, since in my judgment they exceed the sum of the film's parts. The characters and relationships seem real to the viewer, I suggest, because we discover them along with Maria; her personal dilemmas are interesting, and the use of the Nazi Anschluss as a threat, a problem for the Captain, and a dark cloud hanging over the sunlit lives of the folk in the film works very well. The contrast for instance between the nuns' early disagreement over Maria's character and their helping to thwart the Nazis pursuing the family at the film's climax becomes a highly-symbolic movement; and like the growing love between Maria and the Captain and the children's being won over by their new governess, because the movement again is allowed to develop by slow stages, the satire-level comedy with its touch of drama works powerfully on an audience. There is much to be admired in the simplicity and the beautiful imagery of this film; if it is not an artistic masterpiece, it is frequently absorbing, moving and unaffected all at the same time."
    },
    {
      "username": "gbrumburgh",
      "userUrl": "https://www.imdb.com/user/ur1042377",
      "reviewLink": "https://www.imdb.com/review/rw0090987",
      "warningSpoilers": false,
      "date": "31 March 2001",
      "rate": "9",
      "helpful": "145 out of 197 found this helpful.",
      "title": "Sometimes saccharine can be a good substitute.",
      "content": "1965's \"The Sound of Music\" is everything a bad musical should be. Providing more sap than a forest full of Vermont maples, it has coy, silly songs, an inane, innocuous script, and unbelievably sugary characters. So why is it one of my favorite musicals? OK, go ahead. Shoot me at twenty paces. But after all this time, it still remains a guilty pleasure. I find myself going for a tub of rocky road ice cream and Rodgers & Hammerstein's immortal classic whenever the real world gets to be too much. I seem to play it a lot around tax time.And I'm not alone. Why is it still considered the most popular musical of all time? Well, first of all they spared no expense. The extremely well-produced blockbuster has gorgeous, eye-popping scenery. From the first moment Julie Andrews flails her arms and circles around on that beautiful sunny hillside singing the rousing title song, I know I'm being swept away to another world. I'm not in Kansas anymore...or L.A., anyway. The panoramic Salzburg background complements and never intimidates or takes away from the characters or their story (like the other R & H extravaganza \"South Pacific.\") That in itself is an incredible feat.Now about those songs. Almost every one of them is absolute drivel. So what makes them work? Easy. The utter joy and sincerity of the cast who sings the infectious, hummable tunes, which are backed by extremely moving orchestrations and an exceptionally beautiful score. It's hard to resist Maria prancing about, pillow-fighting with a bunch of knee-highs and gushing about her most favorite things. Or the austere Captain Von Trapp (the meticulous Christopher Plummer) turning to butter after hearing his brood sing in perfect harmony for the first time (with no prior lessons even) and joining right in. Or the Mother Superior's soaring number that unknowingly forewarns Maria to head for the hills (I mean, mountains) before the Nazis escort them elsewhere. Or the 16-year-old going on 17 squealing with delight after receiving her first kiss. Or the kids working up a clever little ditty to leave their formal party guests when its time for bed. Or two people declaring their love in a moonlit gazebo. The songs work because they come straight from and aim for the heart, not the head, which is exactly the place the viewer should be coming from when watching this movie. If the songs don't transcend the script (which they didn't prior to the 70s), they certainly transcend the mood.The script is undeniably trite and probably the film's weakest link. But again, the characters play it straight all the way. Not one actor looks embarrassed. Every scene is done with total enthusiasm and total commitment, and the performers who are telling the story are pitch-perfect and picture perfect. And as for the characters. Try and think of anybody better than jubilant, crop-haired Julie Andrews as a postulant nun who has gorgeous pipes, can make play clothes out of curtains, can set up and operate marionette shows at the drop of a hat, and is confident enough to convince a man that a failed nun is ideal marriage material. I certainly can't. Thank heavens for her Oscar-winning \"Mary Poppins\" the year before or we might have gotten Julie LONDON instead! After all, Andrews did lose out on \"My Fair Lady\" the year before. But now certifiably bankable, she proved she could handle this dream role. Andrews is cutely silly, cutely stubborn, cutely astute, cutely shattered and cutely...well, cute. She gives the most wholesomely appealing musical perf since Judy Garland in \"The Wizard of Oz.\" To actually make you forget Mary Martin in the Broadway role takes some doing and she does it effortlessly. Christopher Plummer is all seriousness, handsomely patrician, and quite a catch for anybody...much less a nun. I can't think of anyone more suitable for this role either. As for the Seven Little Foys, I mean the Von Trapp children, they are adorable and perfect in their own ways too, whether they are marching or singing, creating their own individual personalities by film's end.Richard Haydn as Max and Eleanor Parker as the flamboyant, haughty Baroness provide wonderful catty relief. Despite having their musical numbers snatched away from them, they make up for it with droll, sophisticated humor. The elegant, perfectly coiffed Parker is particularly delicious as Maria's chief romantic rival, getting some of the film's best zingers and delivering them with biting understatement. Parker developed a devout cult following after this role. Peggy Wood's Mother Superior is suitably reverent and inspiring.For those who tear \"The Sound of Music\" apart for its shameless, sugar-coated manipulations, well, I can respect that. But to attack it for its political and historical inaccuracies is like attacking \"Peter Pan\" for being a subversive plot that encourages young children to run away from home. It's ludicrous. Despite the fact that it's based on a true story, we're not watching \"The Sound of Music\" for stark realism. Like a sparkling and lavish Ernst Lubitsch operetta, we want a feel-good movie, with feel-good songs, with a feel-good story, and a feel-good ending. Nothing more. If you want a movie that presents a potent depiction of pre-war Austria or anti-Nazi sentiment, rent \"Holocaust\" or \"Schindler's List.\" Here, we want to believe that a group of nuns can tear out an automobile carburetor and save the world! Period.I suppose the reality-based MTV generation cannot truly respect or relate to the relative innocence and pure escapism like \"The Sound of Music.\" If this movie was made today I'm afraid the Von Trapp children would not be dangling out of trees for fear of drive-by shooters. It's a tough new world today, sad to say. The 50s and 60s are looking better all the time.Anyway, for what it's worth, \"The Sound of Music\" is indeed schmaltz, but its QUALITY schmaltz at its very, very best."
    },
    {
      "username": "The_Shawshank_Inception",
      "userUrl": "https://www.imdb.com/user/ur65951064",
      "reviewLink": "https://www.imdb.com/review/rw3670976",
      "warningSpoilers": false,
      "date": "25 March 2017",
      "rate": "10",
      "helpful": "44 out of 50 found this helpful.",
      "title": "Beautiful. Best musical film ever.",
      "content": "Not many films can achieve the flat out beauty that you see in The Sound of Music. The mesmerizing European landscapes and Julie Andrews' voice, not to mention the cute performances by the children, especially in their goodbye song, make this film not only the best musical of all time, but one of the best films of all time.Yes, I did say best musical. Singin in the rain is sewer water compared to this. Not that Singin is a bad musical, but not as good. The Wizard of Oz is learning how to make fire, The Sound of music is inventing the Flying car. This film is timeless, beautiful, inspiring, and uplifting, but I would advise that anyone who watches this would be mature enough, for anyone under the age of 15 will brush this movie aside, saying it is lame so as to maintain their level of coolness. I saw this happen when I asked my little sisters to watch it with me. They rolled their eyes and said the movie was terrible and boring. If only they understood. You have to have an open mind, and forget everything every little kid has said negative about this film. I never wanted to watch this, but some fellow high school seniors RECOMMENDED it to me. Obviously they had open minds, and they didn't care if they looked cool or not. Please watch this movie. It will make you happy, and it is so beautiful, you will almost cry. I had never really liked musicals, and perhaps I still do not overly enjoy them, but this film in all its beauty cut right through that barrier and took me with it to heaven, which is where it should belong, not on this horrible place where people condemn a musical film for being almost three hours. To simply conclude, you will never see a more heart-stopping beautiful movie in your life."
    },
    {
      "username": "HotToastyRag",
      "userUrl": "https://www.imdb.com/user/ur23581966",
      "reviewLink": "https://www.imdb.com/review/rw8224361",
      "warningSpoilers": false,
      "date": "10 June 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Julie breathes life into Maria",
      "content": "There's a running joke at my house: every time I watch The Sound of Music, I remark, \"I liked this movie more than ever this time around!\" My mom laughs at me, since I seem surprised that it's such a good movie. When I was a kid, however, I didn't like it that much, which is why I am always surprised by how wonderful it is when I watch it all grown-up. As a child, I fell asleep during the long running time, and I didn't understand the wartime setting. The only musical number I loved was \"I Have Confidence,\" and I would have been perfectly happy to see that song on a continuous loop for three hours.As an adult, \"I Have Confidence\" is still my favorite song and scene of the film, and I never get tired of appreciating all Julie Andrews put into the physicality and expressive singing. It's very funny that that song is my favorite, since it wasn't included in the original stage musical; but to me, it perfectly showcases Maria's character. She's eager to help, anxious to be liked, headstrong, well-intentioned, enthusiastic, and adorable. Without that song, it might take a longer time to understand why the children love her and why the captain thaws. But in three minutes, before she even rings the doorbell, she's irresistible.It's not a necessity to love Julie's performance, but it adds extra appreciation if you've seen The Sound of Music on the stage. It's incredibly different, not only because her songs were originally written for an alto, and not only because she doesn't twirl on top of the Swiss Alps singing the title song, but because all the infectious energy and great loving nature comes directly from Julie Andrews. It's not exactly written into Maria von Trapp, but Julie put it there.From child to adult, I always loved Eleanor Parker playing the elegant, classy baroness. Her clothes are so beautiful, and she uses a subtle delivery to change a villainous character into a sympathetic one. While I'm sure other actresses would have loved to play the baroness, like Joan Fontaine or Anne Baxter, Eleanor was extremely likable. I can't imagine anyone else convincing the audience that Julie Andrews should return to the nunnery.Thankfully, the story is about Maria and her relationship with the entire von Trapp family. If the main plot focused on the captain, I wouldn't like the movie nearly as much. Every time I watch it, I try to find something in Christopher Plummer's performance to like, but I never do. Peter Finch would have been wonderful, with more pain and less flippancy - and he can sing, too! Another fantastic choice would have been Curd Jurgens, who also sings, and who would have spoken in an authentic accent. And, given his personal background, there would be added emotional drama in the last portion of the film; if he sang goodbye to his country in front of Nazi officers, it would have an entirely different meaning.But with all there is to love about the movie, does anyone (besides me) care about a little botch in the casting department? Robert Wise's imaginative directing turns lackluster (no offense) songs like \"Do-Re-Mi\" into a sightseeing tour-de-force, and the beautiful sets of the von Trapp estate really show the audience what the family is willing to leave behind. Julie Andrews breathes new life into all her songs, whether she's on top of a mountain or merely conducting a puppet show. Even folks who don't like \"The Lonely Goatherd\" love the way it's filmed in the movie, with such attention to detail as the kids \"control\" the puppets. The first half is whimsical, the second half is suspenseful, and each viewing is totally absorbing. Although it faced stiff competition at the 1965 awards season, the Hot Toasty Rag board members agreed with the Academy Awards (a rare occurrence) that it was indeed the best picture of the year."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0090924",
      "warningSpoilers": true,
      "date": "5 July 1999",
      "rate": "10",
      "helpful": "64 out of 100 found this helpful.",
      "title": "A winner on every count, with its score, its performances and its breathtaking scenery...",
      "content": "If \"West Side Story\" was the best musical film of the sixties, then \"The Sound of Music,\" adapted from the long-running Broadway musical play about Maria Von Trapp and her singing family, was certainly the most popular With a story that includes the right amount of family sentiment (the Von Trapp children never quarrel among themselves), religion (in the Hollywood tradition of serene, kind nuns), romance (actually two romances, one adult, one adolescent), and anti-Nazi feeling (Captain Von Trapp refuses to surrender to the Nazi invaders)and with director Robert Wise who is in fact a solid, conscientious craftsman and a fluent story-teller mercifully free of grandiose pretensions, \"The Sound of Music\" is perfect with its sumptuous location photography, immaculate, fluid editing, and splendid tones The film does have a justifiably famous opening: the camera sweeps over the Austrian Alps to catch Julie Andrews, as mischievous, warmhearted Maria, exultantly singing the title song as she rushes through the bright green valley It is an exhilarating moment that the film never really matches again, but there is plenty left in the remaining hours to please the legions of devotees...There are unquestionably some enjoyable songs and musical numbers specially when the eldest Von Trapp daughter (Charmian Carr) meets her shy beau (Daniel Truhitte) in the family garden, he sings \"Sixteen Going on Seventeen\" to her, and they do a charming little dance around the gazebo Maria's music lesson to the children, \"Do-Re-Mi,\" is beautifully staged, set over several days as they amble in and around Salzburg, changing their clothing through camera wizardry And perhaps the best of the songs is the simplest, \"Edelweiss,\" with a tender lyric and poignant melody that make a fitting last song for Rodgers and Hammerstein Another of the film's virtues is Julie Andrew's performance as Maria... She cuts through the thick sentiment with her own sharply honed blade of authority and self-confidence, implying that at least she will get through all the high corn without damaging her self-esteem... It works to balance the tight-lipped stodginess of Christopher Plummer as Captain Von Trapp, the \"adorable\" posturings of the children, and the artificial airs of Eleanor Parker as the haughty baroness..."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6752388",
      "warningSpoilers": false,
      "date": "28 March 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "The Sound of Music",
      "content": "The best musical movie I watched, and I really enjoyed watching it and I liked all the main characters in the film, although the film was 3 hours long, but I felt some scenes very quickly in events, and the songs in the film were very beautiful, when I watched the film I was watching it with high expectations, but the film was able To exceed my expectations of its level."
    }
  ],
  "errorMessage": ""
}