{
  "imDbId": "tt0059742",
  "title": "The Sound of Music",
  "fullTitle": "The Sound of Music (1965)",
  "type": "Movie",
  "year": "1965",
  "language": "en",
  "titleInLanguage": "The Sound of Music (film)",
  "url": "https://en.wikipedia.org/wiki/The_Sound_of_Music_(film)",
  "plotShort": {
    "plainText": "The Sound of Music is a 1965 American musical drama film produced and directed by Robert Wise, and starring Julie Andrews and Christopher Plummer, with Richard Haydn, Peggy Wood, Charmian Carr, and Eleanor Parker. The film is an adaptation of the 1959 stage musical, composed by Richard Rodgers, with lyrics by Oscar Hammerstein II. The film's screenplay was written by Ernest Lehman, adapted from the stage musical's book by Lindsay and Crouse. Based on the 1949 memoir The Story of the Trapp Family Singers by Maria von Trapp, the film is about a young Austrian postulant who, in 1938, is sent to the villa of a retired naval officer and widower to be governess to his seven children.\r\nFilming took place from March to September 1964 in Los Angeles and Salzburg. The Sound of Music was released on March 2, 1965, in the United States, initially as a limited roadshow theatrical release. Although initial critical response to the film was mixed, it was a major commercial success, becoming the number one box office film after four weeks, and the highest-grossing film of 1965. By November 1966, The Sound of Music had become the highest-grossing film of all-time—surpassing Gone with the Wind—and held that distinction for five years. The film was just as popular throughout the world, breaking previous box-office records in twenty-nine countries. Following an initial theatrical release that lasted four and a half years, and two successful re-releases, the film sold 283 million admissions worldwide and earned a total worldwide gross of $286 million.\r\nThe Sound of Music received five Academy Awards, including Best Picture and Best Director, Wise's second pair of both awards, the first being from the 1961 film West Side Story. The film also received two Golden Globe Awards, for Best Motion Picture and Best Actress, the Directors Guild of America Award for Outstanding Directorial Achievement, and the Writers Guild of America Award for Best Written American Musical. In 1998, the American Film Institute (AFI) listed The Sound of Music as the fifty-fifth greatest American film of all time, and the fourth greatest film musical. In 2001, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\".",
    "html": "<p>The Sound of Music is a 1965 American musical drama film produced and directed by Robert Wise, and starring Julie Andrews and Christopher Plummer, with Richard Haydn, Peggy Wood, Charmian Carr, and Eleanor Parker. The film is an adaptation of the 1959 stage musical, composed by Richard Rodgers, with lyrics by Oscar Hammerstein II. The film's screenplay was written by Ernest Lehman, adapted from the stage musical's book by Lindsay and Crouse. Based on the 1949 memoir The Story of the Trapp Family Singers by Maria von Trapp, the film is about a young Austrian postulant who, in 1938, is sent to the villa of a retired naval officer and widower to be governess to his seven children.</p><p>Filming took place from March to September 1964 in Los Angeles and Salzburg. The Sound of Music was released on March 2, 1965, in the United States, initially as a limited roadshow theatrical release. Although initial critical response to the film was mixed, it was a major commercial success, becoming the number one box office film after four weeks, and the highest-grossing film of 1965. By November 1966, The Sound of Music had become the highest-grossing film of all-time—surpassing Gone with the Wind—and held that distinction for five years. The film was just as popular throughout the world, breaking previous box-office records in twenty-nine countries. Following an initial theatrical release that lasted four and a half years, and two successful re-releases, the film sold 283 million admissions worldwide and earned a total worldwide gross of $286 million.</p><p>The Sound of Music received five Academy Awards, including Best Picture and Best Director, Wise's second pair of both awards, the first being from the 1961 film West Side Story. The film also received two Golden Globe Awards, for Best Motion Picture and Best Actress, the Directors Guild of America Award for Outstanding Directorial Achievement, and the Writers Guild of America Award for Best Written American Musical. In 1998, the American Film Institute (AFI) listed The Sound of Music as the fifty-fifth greatest American film of all time, and the fourth greatest film musical. In 2001, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "The Sound of Music is a 1965 American musical drama film produced and directed by Robert Wise, and starring Julie Andrews and Christopher Plummer, with Richard Haydn, Peggy Wood, Charmian Carr, and Eleanor Parker. The film is an adaptation of the 1959 stage musical, composed by Richard Rodgers, with lyrics by Oscar Hammerstein II. The film's screenplay was written by Ernest Lehman, adapted from the stage musical's book by Lindsay and Crouse. Based on the 1949 memoir The Story of the Trapp Family Singers by Maria von Trapp, the film is about a young Austrian postulant who, in 1938, is sent to the villa of a retired naval officer and widower to be governess to his seven children.\r\nFilming took place from March to September 1964 in Los Angeles and Salzburg. The Sound of Music was released on March 2, 1965, in the United States, initially as a limited roadshow theatrical release. Although initial critical response to the film was mixed, it was a major commercial success, becoming the number one box office film after four weeks, and the highest-grossing film of 1965. By November 1966, The Sound of Music had become the highest-grossing film of all-time—surpassing Gone with the Wind—and held that distinction for five years. The film was just as popular throughout the world, breaking previous box-office records in twenty-nine countries. Following an initial theatrical release that lasted four and a half years, and two successful re-releases, the film sold 283 million admissions worldwide and earned a total worldwide gross of $286 million.\r\nThe Sound of Music received five Academy Awards, including Best Picture and Best Director, Wise's second pair of both awards, the first being from the 1961 film West Side Story. The film also received two Golden Globe Awards, for Best Motion Picture and Best Actress, the Directors Guild of America Award for Outstanding Directorial Achievement, and the Writers Guild of America Award for Best Written American Musical. In 1998, the American Film Institute (AFI) listed The Sound of Music as the fifty-fifth greatest American film of all time, and the fourth greatest film musical. In 2001, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nMaria is a free-spirited young Austrian woman studying to become a nun at Nonnberg Abbey in Salzburg in 1938. Her youthful enthusiasm and lack of discipline cause some concern. Mother Abbess sends Maria to the villa of retired naval officer Captain Georg von Trapp to be governess to his seven children—Liesl, Friedrich, Louisa, Kurt, Brigitta, Marta, and Gretl. The Captain has been raising his children alone using strict military discipline following the death of his wife. Although the children misbehave at first, Maria responds with kindness and patience, and soon the children come to trust and respect her.\r\nWhile the Captain is away in Vienna, Maria makes play clothes for the children from drapes that are to be changed. She takes them around Salzburg and the mountains while teaching them how to sing. When the Captain returns to the villa with Baroness Elsa Schraeder, a wealthy socialite, and their mutual friend Max Detweiler, they are greeted by Maria and the children returning from a boat ride on the lake which concludes when their boat overturns. Displeased by his children's clothes and activities and Maria's impassioned appeal that he get closer to his children, the Captain attempts to fire Maria. However, he hears singing coming from inside the house and is astonished to see his children singing for the Baroness. Filled with emotion, the Captain joins his children, singing for the first time in years. The Captain apologizes to Maria and asks her to stay.\r\nImpressed by the children's singing, Max proposes that he enters them in the upcoming Salzburg Festival, but the Captain disapproves of letting his children sing in public. During a grand party at the villa, where guests in formal attire waltz in the ballroom, Maria and the children look on from the garden terrace. When the Captain notices Maria teaching Kurt the traditional Ländler folk dance, he steps in and partners Maria in a graceful performance, culminating in a close embrace. Confused about her feelings, Maria blushes and breaks away. Later, the Baroness, who noticed the Captain's attraction to Maria, hides her jealousy by indirectly convincing Maria that she must return to the abbey.\r\nHowever, Mother Abbess learns that Maria has stayed in seclusion to avoid her feelings for the Captain, so she encourages her to return to the villa to look for her purpose in life. When Maria returns to the villa, she learns about the Captain's engagement to the Baroness and agrees to stay until they find a replacement governess. However, the Baroness learns that the Captain's feelings for Maria haven't changed, so she peacefully calls off the engagement and returns to Vienna while encouraging the Captain to express his feelings for Maria, who marries him.\r\nWhile the couple is on their honeymoon, Max enters the children into the Salzburg Festival against their father's wishes. Having learned that Austria has been annexed by the Third Reich, the couple return to their home, where Captain receives a telegram, ordering him to report to the German Naval base at Bremerhaven to accept a commission in the Kriegsmarine. Strongly opposed to the Nazis, the Captain tells his family they must leave Austria immediately.\r\nThat night, the von Trapp family attempt to flee to Switzerland, but they are stopped by a group of Brownshirts, led by the Gauleiter Hans Zeller, waiting outside the villa. To cover his family's tracks, the Captain maintains they are headed to the Salzburg Festival to perform. Zeller insists on escorting them to the festival, after which his men will accompany the Captain to Bremerhaven.\r\nLater that night at the festival, during their final number, the von Trapp family slips away and seeks shelter at the abbey, where Mother Abbess hides them in the cemetery crypt. Zeller and his men soon arrive and search the abbey, but the family is able to escape using the caretaker's car. When they attempt to pursue, they discover their cars will not start, as two of the nuns have sabotaged their engines. The next morning, after driving to the Swiss border, the von Trapp family make their way on foot across the frontier into Switzerland to safety and freedom.\r\nCast\r\nJulie Andrews as Maria\r\nChristopher Plummer as Captain von Trapp Bill Lee overdubbed Plummer's singing\r\nBill Lee overdubbed Plummer's singing\r\nEleanor Parker as Baroness Elsa von Schraeder\r\nRichard Haydn as Max Detweiler\r\nPeggy Wood as Mother Abbess\r\nCharmian Carr as Liesl von Trapp\r\nHeather Menzies as Louisa von Trapp\r\nNicholas Hammond as Friedrich von Trapp\r\nDuane Chase as Kurt von Trapp\r\nAngela Cartwright as Brigitta von Trapp\r\nDebbie Turner as Marta von Trapp\r\nKym Karath as Gretl von Trapp\r\nAnna Lee as Sister Margaretta\r\nPortia Nelson as Sister Berthe\r\nBen Wright as Herr Zeller\r\nDaniel Truhitte as Rolfe\r\nNorma Varden as Frau Schmidt, housekeeper\r\nGil Stuart as Franz, butler\r\nMarni Nixon as Sister Sophia\r\nEvadne Baker as Sister Bernice\r\nDoris Lloyd as Baroness Ebberfeld\r\nThe real Maria von Trapp has a brief uncredited cameo as a passerby, alongside her children Rosmarie and Werner von Trapp during \"I Have Confidence\".\r\nBackground\r\nThe Sound of Music story is based on Maria von Trapp's memoir, The Story of the Trapp Family Singers, published in 1949 to help promote her family's singing group following the death of her husband Georg in 1947. Hollywood producers expressed interest in purchasing the title only, but Maria refused, wanting her entire story to be told. In 1956, German producer Wolfgang Liebeneiner purchased the film rights for $9,000 (equivalent to $90,000 in 2021), hired George Hurdalek and Herbert Reinecker to write the screenplay, and Franz Grothe to supervise the soundtrack, which consisted of traditional Austrian folk songs. The Trapp Family was released in West Germany on October 9, 1956, and became a major success. Two years later, Liebeneiner directed a sequel, The Trapp Family in America, and the two pictures became the most successful films in West Germany during the post-war years. Their popularity extended throughout Europe and South America.\r\nIn 1956, Paramount Pictures purchased the United States film rights, intending to produce an English-language version with Audrey Hepburn as Maria. The studio eventually dropped its option, but one of its directors, Vincent J. Donehue, proposed the story as a stage musical for Mary Martin. Producers Richard Halliday and Leland Heyward secured the rights and hired playwrights Howard Lindsay and Russel Crouse, who had won the Pulitzer Prize for State of the Union. They approached Richard Rodgers and Oscar Hammerstein II to compose one song for the musical, but the composers felt the two styles—traditional Austrian folk songs and their composition—would not work together. They offered to write a completely new score for the entire production if the producers were willing to wait while they completed work on Flower Drum Song. The producers quickly responded that they would wait as long as necessary. The Sound of Music stage musical opened on November 16, 1959, at the Lunt-Fontanne Theatre in New York City and ran on Broadway for 1,443 performances, winning six Tony Awards, including Best Musical. In June 1960, Twentieth Century-Fox purchased the film adaptation rights to the stage musical for $1.25 million (equivalent to $11,400,000 in 2021) against ten percent of the gross.\r\nProduction\r\nScreenplay and pre-production\r\nIn December 1962, 20th Century Fox president Richard D. Zanuck hired Ernest Lehman to write the screenplay for the film adaptation of the stage musical. Lehman reviewed the original script for the stage musical, rearranged the sequence of songs, and began transforming a work designed for the stage into a film that could use the camera to emphasize action and mood and open the story up to the beautiful locations of Salzburg and the Austrian Alps. The \"Do-Re-Mi\" sequence in the play, for example, was originally a stagnant number; Lehman transformed it into a lively montage showing some of the beautiful sites of Salzburg, as well as showing Maria and the children growing closer over time. Lehman also eliminated two songs, \"How Can Love Survive?\" and \"No Way to Stop It\", sung by the characters of Elsa and Max. In January 1963, he saw the Fox English-dubbed version of the two German films. Not especially impressed, he decided to use the stage musical and Maria's memoir for most of his source material. While Lehman was developing the screenplay, he and Zanuck began looking for a director. Their first choice was Robert Wise, with whom Lehman had worked on the film adaptation of West Side Story, but Wise was busy preparing work for another film, The Sand Pebbles. Other directors were approached and turned down the offer, including Stanley Donen, Vincent J. Donehue, George Roy Hill, and Gene Kelly.\r\nIn January 1963, Lehman invited one of his favorite directors, William Wyler, to travel to New York City with him to see the Broadway musical. After seeing the show, Wyler said he hated it, but after two weeks of Lehman's persuasion, Wyler reluctantly agreed to direct and produce the film. After hiring musical supervisor Roger Edens, Wyler, Lehman, and Edens traveled to Salzburg to scout filming locations. In two weeks they managed to see approximately seventy-five locations—an experience that helped Lehman conceptualize several important sequences. During that trip, Lehman began to have reservations about Wyler's commitment to the project and communicated this to Zanuck, who instructed the writer to finalize the first draft of the screenplay as quickly as possible. Lehman completed the first draft on September 10, 1963, and sent it to Wyler, who had no suggestions or changes to add. At that time, Lehman also secretly gave a copy of the script to the agent of Robert Wise, whom Lehman still wanted as the director. Later that month, Wyler's agent approached Zanuck asking that production on the film be delayed so Wyler could direct The Collector. Zanuck told him to tell Wyler to make the other film, and that they would move ahead on schedule with another director, ending Wyler's participation.\r\nMeanwhile, Wise, whose film The Sand Pebbles had been postponed, read Lehman's first draft, was impressed by what he read, and agreed to direct the film, joining the picture in October 1963, and flew to Salzburg with associate producer Saul Chaplin and members of his production team to scout filming locations, including many that Wyler had identified. When he returned, Wise began working on the script. Wise shared Lehman's vision of the film being centered on the music, and the changes he made were consistent with the writer's approach—mainly reducing the amount of sweetness and sentimentality found in the stage musical. He had reservations about Lehman's opening aerial sequence because West Side Story, whose screenplay Lehman had also written, had used a similar opening sequence, but he was unable to think of a better one and decided to keep Lehman's. Other changes included replacing \"An Ordinary Couple\" with a more romantic number, and a new song for Maria's departure from the abbey—Rodgers provided \"Something Good\" and \"I Have Confidence\", especially for the film. Lehman completed the second draft on December 20, 1963, but additional changes would be made based on input from Maria von Trapp and Christopher Plummer about the character of the Captain. Plummer especially helped change a character lacking substance into a stronger, more forceful complex figure with a wry sense of humor and a darker edge. Lehman completed his final draft on March 20, 1964.\r\nCasting and rehearsals\r\nLehman's first and only choice for Maria was Julie Andrews. When Wise joined the project, he made a list of his choices for the role, which included Andrews as his first choice, Grace Kelly, and Shirley Jones. Wise and Lehman went to Disney Studios to view footage from Mary Poppins, which was not yet released. A few minutes into the film, Wise told Lehman, \"Let's go sign this girl before somebody else sees this film and grabs her!\" Andrews had some reservations—mainly about the amount of sweetness in the theatrical version—but when she learned that her concerns were shared by Wise and Lehman and what their vision was, she signed a contract with Fox to star in The Sound of Music and one other film for $225,000 (equivalent to $1,970,000 in 2021). Wise had a more difficult time casting the role of the Captain. A number of actors were considered for the part, including Bing Crosby, Yul Brynner, Sean Connery, and Richard Burton. Wise had seen Christopher Plummer on Broadway and wanted him for the role, but the stage actor turned down the offer several times. Wise flew to London to meet with Plummer and explained his concept of the film; the actor accepted after being assured that he could work with Lehman to improve the character.\r\nWise also spent considerable time and effort on casting the secondary characters. For the role of Max Detweiler, Wise initially considered Victor Borge, Noël Coward, and Hal Holbrook among others before deciding on Richard Haydn. For the character of Baroness Elsa Schraeder, Wise looked for a \"name\" actress—Andrews and Plummer were not yet widely known to film audiences—and decided on Eleanor Parker. The casting of the children's characters began in November 1963 and involved over two hundred interviews and auditions throughout the United States and England. Some of the child actors interviewed or tested, who were not selected, included Mia Farrow, Patty Duke, Lesley Ann Warren, Geraldine Chaplin, Shelley Fabares, Teri Garr, Kurt Russell, and The Osmonds. Most of the actors selected had some acting, singing, or dancing experience. Charmian Carr, however, was a model who worked part-time in a doctor's office and had no ambition to pursue a career as an actress. After a friend sent her photo to Wise's office, she was asked to interview. Wise later recalled, \"She was so pretty and had such poise and charm that we liked her immediately.\" The last person to be cast was Daniel Truhitte in the role of Rolfe.\r\nRehearsals for the singing and dance sequences began on February 10, 1964. The husband-and-wife team of Marc Breaux and Dee Dee Wood, who had worked with Andrews on Mary Poppins, worked out the choreography with Saul Chaplin on piano—the arrangements could not be altered under Rodgers and Hammerstein's contract. The stage choreography was not used because it was too restrictive. Breaux and Wood worked out all-new choreography better suited for the film that incorporated many of the Salzburg locations and settings. They even choreographed the newly added puppet dance sequence for \"The Lonely Goatherd\". The choreography for the Ländler strictly followed the traditional Austrian folk dance. The musical arranger Irwin Kostal prerecorded the songs with a large orchestra and singers on a stage before the start of filming. In her book, The Sound of Music: The Making of America's Favorite Movie, Julia Antopol Hirsch says that Kostal used seven children and five adults to record the children's voices; the only scene in which the child-actors' singing is heard in the released version of the film is when they sing \"The Sound of Music\" on their own after Maria leaves. Charmian Carr refuted the claim that the voices of the child actors were dubbed in the film and on the soundtrack. Carr contended that all of the children who are in the film sing on the track, but four other children were added to most of the songs to give them a fuller sound; they did not replace them as singers. The voices of some of the adult actors had voice doubles, including those of Peggy Wood and Christopher Plummer.\r\nFilming and post-production\r\nPrincipal photography began on March 26, 1964, at 20th Century Fox studios in Los Angeles, where scenes from Maria's bedroom and the abbey cloister and graveyard were filmed. The company then flew to Salzburg, where filming resumed on April 23 at Mondsee Abbey for the wedding scenes. From April 25 through May 22, scenes were filmed at the Felsenreitschule, Nonnberg Abbey, Mirabell Palace Gardens, Residence Fountain, and various street locations throughout the Altstadt (Old Town) area of the city. Wise faced opposition from city leaders who did not want him staging scenes with swastika banners. They relented after he threatened instead to include old newsreel footage featuring the banners. On days when it rained, a constant challenge for the company, Wise arranged for scenes to be shot at St. Margarethen Chapel and Dürer Studios (Reverend Mother's office). From May 23 to June 7, the company worked at Schloss Leopoldskron and an adjacent property called Bertelsmann for scenes representing the lakeside terrace and gardens of the von Trapp villa. From June 9 to 19, scenes were shot at Frohnburg Palace, which represented the front and back façades of the villa. Karath could not swim and was in danger during the capsizing boat scene. The \"Do-Re-Mi\" picnic scene in the mountains was filmed above the town of Werfen in the Salzach River valley on June 25 and 27. The opening sequence of Maria on her mountain was filmed from June 28 to July 2 at Mehlweg mountain near the town of Marktschellenberg in Bavaria. During filming, Birch trees were added and then removed. The brook she walks through was plastic filled with water which was put there during filming. The final scene of the von Trapp family escaping over the mountains was filmed on the Obersalzberg in the Bavarian Alps.\r\nThe cast and crew flew back to Los Angeles and resumed filming at Fox Studios on July 6 for all remaining scenes, including those in the villa dining room, ballroom, terrace, living room, and gazebo. Following the last two scenes shot in the gazebo—for the songs \"Something Good\" and \"Sixteen Going on Seventeen\"—principal photography concluded on September 1, 1964. A total of eighty-three scenes were filmed in just over five months. Post-production work began on August 25 with three weeks of dialogue dubbing to correct lines that were ruined by various street noises and rain. In October, Christopher Plummer's singing voice was dubbed by veteran Disney playback singer Bill Lee. The film was then edited by Wise and film editor William Reynolds. Once the film was edited, Irwin Kostal, who orchestrated the musical numbers, underscored the film with background music consisting of variations on Rodgers and Hammerstein's original songs to amplify or add nuances to the visual images. When dubbing, editing, and scoring were complete, Wise arranged for two sneak-preview showings—the first one held in Minneapolis on Friday, January 15, 1965 at the Mann Theater, and the second one held the following night in Tulsa. Despite the \"sensational\" responses from the preview audiences, Wise made a few final editing changes before completing the film. According to the original print information for the film, the running time for the theatrical release version was 174 minutes. The film was still in release when the Motion Picture Association of America's film ratings system was implemented in 1968, and was subsequently given a \"G\" rating (\"general audiences\") in 1969.\r\nThe Sound of Music was filmed in Todd-AO by Ted McCord and produced with DeLuxe Color processing. Aerial footage was photographed with an MCS-70 camera. The sound was recorded on a 70 mm six-track using a Westrex recording system. The sets used for the film were based on the storyboards of sketch artist Maurice Zuberano, who accompanied Wise to Austria to scout filming locations in November 1963. Wise met with the artist over ten weeks and explained his objective for each scene—the feeling he wanted to convey and the visual images he wanted to use. When Zuberano was finished, he provided Wise with a complete set of storyboards that illustrated each scene and set—storyboards the director used as guidance during filming. Zuberano's storyboards and location photos were also used by art director Boris Leven to design and construct all of the original interior sets at Fox studios, as well as some external sets in Salzburg. The von Trapp villa, for example, was actually filmed in several locations: the front and back façades of the villa were filmed at Frohnburg Palace, the lakeside terrace and gardens was a set constructed on a property adjacent to Schloss Leopoldskron called Bertelsmann, and the interior was a constructed set at Fox Studios. The gazebo scenes for \"Something Good\" and \"Sixteen Going on Seventeen\" were filmed on a larger reconstructed set at Fox studios, while some shots of the original gazebo were filmed on the grounds at Schloss Leopoldskron in Salzburg.\r\nMusic and soundtrack album\r\nMost of the soundtrack to The Sound of Music was written by Richard Rodgers and Oscar Hammerstein II and arranged and conducted by Irwin Kostal, who also adapted the instrumental underscore passages. Both the lyrics and music for two new songs were written by Rodgers, as Hammerstein died in 1960. The soundtrack album was released by RCA Victor in 1965 and is one of the most successful soundtrack albums in history, having sold over 20 million copies worldwide.\r\nThe album reached the number one position on the Billboard 200 that year in the United States. It remained in the top ten for 109 weeks, from May 1, 1965, to July 16, 1967, and remained on the Billboard 200 chart for 238 weeks. The album was the best-selling album in the United Kingdom in 1965, 1966, and 1968 and the second best-selling of the entire decade, spending a total of 70 weeks at number one on the UK Albums Chart. It also stayed 73 weeks on the Norwegian charts, becoming the seventh best-charting album of all time in that country. In 2015, Billboard named the album the second greatest album of all time.\r\nThe album has been reissued several times, including anniversary editions with additional tracks in 1995, 2000, 2005, 2010, and 2015.\r\nRelease and reception\r\nMarketing\r\nRobert Wise hired Mike Kaplan to direct the publicity campaign for the film. After reading the script, Kaplan decided on the ad line \"The Happiest Sound in All the World\", which would appear on promotional material and artwork. Kaplan also brought in outside agencies to work with the studio's advertising department to develop the promotional artwork, eventually selecting a painting by Howard Terpning of Andrews on an alpine meadow with her carpetbag and guitar case in hand with the children and Plummer in the background. In February 1964, Kaplan began placing ads in the trade papers Daily Variety, Weekly Variety, and The Hollywood Reporter to attract future exhibitor interest in the project. The studio intended the film to have an initial roadshow theatrical release in select large cities in theaters that could accommodate the 70-mm screenings and six-track stereophonic sound. The roadshow concept involved two showings a day with reserved seating and an intermission similar to Broadway musicals. Kaplan identified forty key cities that would likely be included in the roadshow release and developed a promotional strategy targeting the major newspapers of those cities. During the Salzburg production phase, 20th Century Fox organized press junkets for American journalists to interview Wise and his team and the cast members.\r\nCritical response\r\n\"No one is comfortable with an excess of hearts and flowers, but there is no valid reason for hiding honest emotion. This has always been a major element in the theatre, and it's my conviction that anyone who can't, on occasion, be sentimental about children, home or nature is sadly maladjusted.\"\r\nRichard Rodgers\r\nThe film had its opening premiere on March 2, 1965, at the Rivoli Theater in New York City. Initial reviews were mixed. Bosley Crowther, in The New York Times, criticized the film's \"romantic nonsense and sentiment\", the children's \"artificial roles\", and Robert Wise's \"cosy-cum-corny\" direction. Judith Crist, in a biting review in the New York Herald Tribune, dismissed the movie as \"icky sticky\" and designed for \"the five to seven set and their mommies\". In her review for McCall's magazine, Pauline Kael called the film \"the sugar-coated lie people seem to want to eat\", and that audiences have \"turned into emotional and aesthetic imbeciles when we hear ourselves humming the sickly, goody-goody songs.\" Wise later recalled, \"The East Coast, intellectual papers and magazines destroyed us, but the local papers and the trades gave us great reviews\". Indeed, reviewers such as Philip K. Scheuer of the Los Angeles Times described the film as \"three hours of visual and vocal brilliance\", and Variety called it \"a warmly-pulsating, captivating drama set to the most imaginative use of the lilting R-H tunes, magnificently mounted and with a brilliant cast\". The \"wildly mixed film reviews\" reflected the critical response to the stage musical, according to The Oxford Companion to the American Musical. After its Los Angeles premiere on March 10, The Sound of Music opened in 131 theaters in the United States, including a limited number of roadshow events. After four weeks, the film became the number one box office movie in the country and held that position for thirty out of the next forty-three weeks in 1965. The original theatrical release of the film in America lasted four and a half years.\r\nA few months after its United States release, The Sound of Music opened in 261 theaters in other countries, the first American movie to be completely dubbed in a foreign language, both dialogue, and music. The German, French, Italian, and Spanish versions were completely dubbed, the Japanese version had Japanese dialogue with English songs, and other versions were released with foreign subtitles. The film was a popular success in every country it opened, except the two countries where the story originated, Austria and Germany.\r\nIn these two countries, the film had to compete with the much-loved Die Trapp-Familie (1956), which provided the original inspiration for the Broadway musical, and its sequel Die Trapp-Familie in Amerika (1958), both films are still widely popular in German-speaking Europe and considered the authoritative von Trapp story. Austrians took exception to the liberties taken by the filmmakers with regard to the costumes, which did not reflect the traditional style and the replacement of traditional Austrian folk songs with Broadway show tunes. The film's Nazi theme was especially unpopular in Germany, where the Munich branch manager for 20th Century Fox approved the unauthorized cutting of the entire third act of the film following the wedding sequence—the scenes showing Salzburg following the Anschluss. Robert Wise and the studio intervened, the original film was restored, and the branch manager was fired.\r\nThe Sound of Music holds an 84% \"Certified Fresh\" rating on Rotten Tomatoes based on seventy-three reviews. The site's consensus states: \"Unapologetically sweet and maybe even a little corny, The Sound of Music will win over all but the most cynical filmgoers with its classic songs and irresistible warmth.\"\r\nBox office\r\nThe Sound of Music is one of the most commercially successful films of all time. Four weeks after its theatrical release, it became the number one box office movie in the United States, from revenue generated by twenty-five theaters, each screening only ten roadshow performances per week. It held the number one position for thirty of the next forty-three weeks, and ended up the highest-grossing film of 1965. One contributing factor in the film's early commercial success was the repeat business of many filmgoers. In some cities in the United States, the number of tickets sold exceeded the total population. By January 1966, the film had earned $20 million in distributor rentals from just 140 roadshow engagements in the United States and Canada. Worldwide, The Sound of Music broke previous box-office records in twenty-nine countries, including the United Kingdom, where it played for a record-breaking three years at the Dominion Theatre in London and earned £4 million in rentals and grossed £6 million—more than twice as much as any other film had taken in. It was also a major success in the Netherlands, Hong Kong, and Tokyo, where it played for as long as two years at some theaters. It was not a universal success, however, with the film only enjoying modest success in France and it was a flop in Germany. It also initially performed poorly in Italy, but a re-release after the Oscars brought better results. It was number one at the US box office for a further 11 weeks in 1966, for a total of 41 weeks at number one. By November 1966, The Sound of Music had become the highest-grossing film of all time, with over $67.5 million in worldwide rentals ($125 million in gross receipts), surpassing Gone with the Wind, which held that distinction for twenty-four years. It was still in the top ten at the US box office in its 100th week of release.\r\nThe Sound of Music completed its initial four-and-a-half year theatrical release run in the United States on Labor Day 1969, the longest initial run for a film in the US, having earned $68,313,000 in rentals in the United States and Canada. It played for 142 weeks at the Eglinton Theatre in Toronto. It was the first film to gross over $100 million. By December 1970, it had earned $121.5 million in worldwide rentals, which was over four times higher than the film's estimated break-even point of $29.5 million in rentals. The film was re-released in 1973, and increased its North American rentals to $78.4 million. By the end of the 1970s, it was ranked seventh in all-time North American rentals, having earned $79 million. The film's re-release in 1990 increased the total North American admissions to 142,415,400—the third-highest number of tickets sold behind Gone with the Wind and Star Wars—and about 283.3 million admissions worldwide. The Sound of Music eventually earned a total domestic gross of $163,214,076 and a total worldwide gross of $286,214,076. Adjusted for inflation, the film earned about $2.366 billion at 2014 prices—placing it among the top ten highest-grossing films of all time.\r\nAccolades\r\nAmerican Film Institute recognition\r\nThe Sound of Music has been included in numerous top film lists from the American Film Institute.\r\nAFI's 100 Years...100 Movies – No. 55\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) – No. 40\r\nAFI's 100 Years...100 Cheers – No. 41\r\nAFI's 100 Years of Musicals – No. 4\r\nAFI's 100 Years...100 Passions – No. 27\r\nAFI's 100 Years...100 Songs: \"The Sound of Music\" – No. 10 \"My Favorite Things\" – No. 64 \"Do-Re-Mi\" – No. 88\r\n\"The Sound of Music\" – No. 10\r\n\"My Favorite Things\" – No. 64\r\n\"Do-Re-Mi\" – No. 88\r\nTelevision and home media\r\nThe first American television transmission of The Sound of Music was on February 29, 1976, on ABC, which paid $15 million (equivalent to $71,429,825 in 2021) for a one-time only broadcast that became one of the top 20 rated films shown on television to that point with a Nielsen rating of 33.6 and an audience share of 49%. The movie was not shown again until NBC acquired the broadcast rights in June 1977 for $21.5 million for 20 showings over 22 years and telecast the film on February 11, 1979. NBC continued to air the film annually for twenty years. During most of its run on NBC, the film was heavily edited to fit a three-hour time slot—approximately 140 minutes without commercials, which inevitably cut 30 minutes out of the original film.\r\nThe film aired in its uncut form (minus the entr'acte) on April 9, 1995, on NBC. Julie Andrews hosted the four-hour telecast which presented the musical numbers in a letterboxed format. As the film's home video availability cut into its television ratings, NBC let their contract lapse in 2001. That year, the film was broadcast one time on the Fox network, in its heavily edited 140-minute version. Since 2002, the film has aired on ABC on a Sunday night prior to Christmas and has been broadcast on its sister cable network, Freeform, periodically around Easter and other holidays. Most of its more recent runs have been the full version in a four-hour time slot, complete with the entr'acte. ABC first broadcast a high-definition version on December 28, 2008. On December 22, 2013, the annual broadcast had its highest ratings since 2007; the increase in ratings were credited to NBC's broadcast of The Sound of Music Live!—a live television adaptation of the original musical which aired earlier that month.\r\nIn the United Kingdom, the film rights were acquired by the BBC, who paid a corporation record $4.1 million, and it was first aired on BBC One on 25 December 1978 and, as of December 2016, fifteen times since, mostly around Christmas time. As the BBC channels in Britain are not funded by advertising there was no need to cut scenes to fit within a timeslot and the film was screened in the full 174-minute version without breaks. The film was also intended to be part of the BBC's programming during the outbreak of nuclear war.\r\nThe film has been released on VHS, LaserDisc, and DVD numerous times. The first DVD version was released on August 29, 2000, to commemorate the 35th anniversary of the film's release. The film is often included in box sets with other Rodgers & Hammerstein film adaptations. A 40th anniversary DVD, with \"making of\" documentaries and special features, was released on November 15, 2005. The film made its debut issue on Blu-ray Disc on November 2, 2010, for its 45th anniversary. For the Blu-ray release, the original 70 mm negatives were rescanned at 8K resolution, then restored and remastered at 4K resolution for the transfer to Blu-ray, giving the most detailed copy of the film seen thus far. On March 10, 2015, 20th Century Fox Home Entertainment released The Sound of Music 50th Anniversary Ultimate Collector's Edition—a five-disc set featuring thirteen hours of bonus features, including a new documentary, The Sound of a City: Julie Andrews Returns to Salzburg. A March 2015 episode of ABC's 20/20 entitled The Untold Story of the Sound of Music featured a preview of the documentary and interviews by Diane Sawyer.\r\nIn part to the acquisition of 21st Century Fox by Disney, the film was made available on the Disney+ streaming service upon its debut on November 12, 2019.\r\nHistorical accuracy\r\nThe Sound of Music film adaptation, like the stage musical, presents a history of the von Trapp family (a.k.a. the Trapp Family) that is not completely accurate. The musical was based on the West German film The Trapp Family (1956) rather than Maria von Trapp's 1949 memoirs, as director Vincent J. Donehue had seen the film and decided that it would make a good vehicle for Mary Martin. The musical followed the film's plot so closely that the New York Times review of the West German film noticed that it \"strongly suggests 'The Sound of Music,' often scene by scene.\" The West German screenwriters made several significant changes to the family's story that were kept in the musical. Maria had been hired to teach just one child, but the 1956 film made her governess to all seven children.\r\nThe 1965 film adaptation was influenced by other musicals of its era, such as Mary Poppins, the Rodgers and Hammerstein television production of Cinderella, and the stage production of Lerner and Loewe's Camelot (coincidentally all starring Julie Andrews). Screenwriter Ernest Lehman was inspired by the opening of West Side Story and saw the musical as \"a fairy tale that's almost real\". The film incorporated many \"fairy tale\" tropes which included the idyllic imagery (placed in the hills of Salzburg), the European villas, and the cross-class Cinderella-like romance between Maria and Captain Von Trapp. As Maria walks down the aisle to be married, the pageantry is explicitly both Guinevere and Cinderella.\r\nIn keeping with this tone the filmmakers used artistic license to convey the essence and meaning of their story. Georg Ludwig von Trapp was indeed an anti-Nazi opposed to the Anschluss, and lived with his family in a villa in a district of Salzburg called Aigen. Their lifestyle depicted in the film, however, greatly exaggerated their standard of living. The actual family villa, located at Traunstraße 34, Aigen 5026, was large and comfortable but not nearly as grand as the mansion depicted in the film. The house was also not their ancestral home, as depicted in the film. The family had previously lived in homes in Zell Am See and Klosterneuburg after being forced to abandon their actual ancestral home in Pola following World War I. Georg moved the family to the Salzburg villa shortly after the death of his first wife, Agathe Whitehead, in 1922.\r\nGeorg is referred to as \"Captain\" in the film, but he held a noble title of \"Ritter\" (hereditary knight), which had higher social status than a naval officer. Although Austrian nobility was legally abolished in 1919 and the nobiliary particle von was proscribed, both continued to be widely used unofficially as a matter of social courtesy. Georg was offered a position in the German Kriegsmarine, but this occurred before the Anschluss. Nazi Germany was looking to expand its fleet of U-boats, and Corvette Captain von Trapp was the most successful Austro-Hungarian submarine commander of World War I, having sunk 11 Allied merchant ships totaling 47,653 GRT and two Allied warships displacing a total of 12,641 tons. With his family in desperate financial straits, he seriously considered the offer before deciding he could not serve a Nazi regime.\r\nIn the film, Georg is depicted initially as a humorless, emotionally distant father. In reality, third child Maria Franziska von Trapp (called \"Louisa\" in the film) described her father as a doting parent who made handmade gifts for the children in his woodshop and who would often lead family musicales on his violin. She has a different recollection of her stepmother, Maria Augusta Kutschera, whom she described as moody and prone to outbursts of rage. In a 2003 interview, Maria remembered, \" had a terrible temper ... and from one moment to the next, you didn't know what hit her. We were not used to this. But we took it like a thunderstorm that would pass, because the next minute she could be very nice.\"\r\nMaria Kutschera had indeed been a novice at Nonnberg Abbey in Salzburg and had been hired by the von Trapp family. However, she was hired only to be a tutor to young Maria Franziska, who had come down with scarlet fever and needed her lessons at home, not to be a governess for all of the children. Maria and Georg married for practical reasons, rather than love and affection for each other. Georg needed a mother for his children, and Maria needed the security of a husband and family once she decided to leave the abbey. \"I really and truly was not in love,\" Maria wrote in her memoir, \"I liked him but didn't love him. However, I loved the children, so in a way I really married the children. I learned to love him more than I have ever loved before or after.\" They were married in 1927, not in 1938 as depicted in the film, and the couple had been married for over a decade by the time of the Anschluss and had two of their three children together by that time. Maria and Georg enjoyed a happy marriage.\r\nThe von Trapp family lost most of its wealth during the worldwide depression of the early 1930s, when the Austrian national bank folded. In order to survive, the family dismissed the servants and began taking in boarders. They also started singing onstage to earn money, a fact that caused the proud Georg much embarrassment. In the film, the von Trapp family hike over the Alps from Austria to Switzerland to escape the Nazis, which would not have been possible; Salzburg is over two hundred miles from Switzerland. The von Trapp villa, however, was only a few kilometers from the Austria–Germany border, and the final scene shows the family hiking on the Obersalzberg near the German town of Berchtesgaden, within sight of Adolf Hitler's Kehlsteinhaus Eagle's Nest retreat. In reality, the family simply walked to the local train station and boarded a train to Italy. The Trapps were entitled to Italian citizenship since Georg had been born in Zadar, Dalmatia, Austria-Hungary, which had been annexed by Italy after World War I. They were able to emigrate to the United States on their Italian passports.\r\nThe character Max Detweiler, the scheming family music director, is fictional. The von Trapps' family priest, the Reverend Franz Wasner, was their musical director for over twenty years and accompanied them when they left Austria. The character of Friedrich, the second oldest child in the film version, was based on Rupert, the oldest of the real von Trapp children. Liesl, the oldest child in the film, was based on Agathe von Trapp, the second oldest in the real family. The names and ages of the children were changed, in part because the third child, who would be portrayed as \"Louisa\", was also named Maria, and producers thought that it would be confusing to have two characters called Maria in the film. The von Trapp family had no control over how they were depicted in the film and stage musical, having given up the rights to their story to a German producer in the 1950s who then sold the rights to American producers. Robert Wise met with Maria von Trapp and made it clear, according to a memo to Richard Zanuck, that he was not making a \"documentary or realistic movie\" about her family, and that he would make the film with \"complete dramatic freedom\" in order to produce a \"fine and moving film\", one they could all be proud of.\r\nLegacy\r\nAlthough The Sound of Music is set in Salzburg, it was largely ignored in Austria upon release. The film adaptation was a blockbuster worldwide, but it ran for only three days in Salzburg movie theaters, with locals showing \"disdain\" for a film that \"wasn't authentic.\" In 1966, American Express created the first Sound of Music guided tour in Salzburg. Since 1972, Panorama Tours has been the leading Sound of Music bus tour company in the city, taking approximately 50,000 tourists a year to various film locations in Salzburg and the surrounding region. Although the Salzburg tourism industry took advantage of the attention from foreign tourists, residents of the city were apathetic about \"everything that is dubious about tourism.\" The guides on the bus tour \"seem to have little idea of what really happened on the set.\" Even the ticket agent for the Sound of Music Dinner Show tried to dissuade Austrians from attending a performance that was intended for American tourists, saying that it \"does not have anything to do with the real Austria.\" By 2007, The Sound of Music was drawing 300,000 visitors a year to Salzburg, more than the city's self-conception as the birthplace of Wolfgang Amadeus Mozart. A German translation of the musical was performed on the national stage for the first time in 2005 at the Vienna Volksoper, receiving negative reviews from Austrian critics, who called it \"boring\" and referred to \"Edelweiss\" as \"an insult to Austrian musical creation.\" The musical finally premiered in Salzburg in 2011 at the Salzburger Landestheater, but Maria was played in the Salzburg premiere by a Dutch actress who \"grew up with the songs.\" However, most performances in Vienna and Salzburg were sold out, and the musical is now in both companies' repertoire.\r\nA Sing-along Sound of Music revival screening was first shown at the London Lesbian and Gay Film Festival in 1999, leading to a successful run at the Prince Charles Cinema which is ongoing as of 2018. During the screenings, audience members are often dressed as nuns and von Trapp children and are encouraged to sing along to lyrics superimposed on the screen. In July 2000, Sing-along Sound of Music shows opened in Boston and Austin, Texas. Some audience members dressed up as cast members and interacted with the action shown on the screen. The film began a successful run at the Ziegfeld Theatre in New York City in September 2000, with the opening attended by cast members Charmian Carr (Liesl), Daniel Truhitte (Rolfe), and Kym Karath (Gretl). Sing-along Sound of Music screenings have since become an international phenomenon.\r\nIn 2001, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\". The Academy Film Archive preserved The Sound of Music in 2003.",
    "html": "<p>The Sound of Music is a 1965 American musical drama film produced and directed by Robert Wise, and starring Julie Andrews and Christopher Plummer, with Richard Haydn, Peggy Wood, Charmian Carr, and Eleanor Parker. The film is an adaptation of the 1959 stage musical, composed by Richard Rodgers, with lyrics by Oscar Hammerstein II. The film's screenplay was written by Ernest Lehman, adapted from the stage musical's book by Lindsay and Crouse. Based on the 1949 memoir The Story of the Trapp Family Singers by Maria von Trapp, the film is about a young Austrian postulant who, in 1938, is sent to the villa of a retired naval officer and widower to be governess to his seven children.</p><p>Filming took place from March to September 1964 in Los Angeles and Salzburg. The Sound of Music was released on March 2, 1965, in the United States, initially as a limited roadshow theatrical release. Although initial critical response to the film was mixed, it was a major commercial success, becoming the number one box office film after four weeks, and the highest-grossing film of 1965. By November 1966, The Sound of Music had become the highest-grossing film of all-time—surpassing Gone with the Wind—and held that distinction for five years. The film was just as popular throughout the world, breaking previous box-office records in twenty-nine countries. Following an initial theatrical release that lasted four and a half years, and two successful re-releases, the film sold 283 million admissions worldwide and earned a total worldwide gross of $286 million.</p><p>The Sound of Music received five Academy Awards, including Best Picture and Best Director, Wise's second pair of both awards, the first being from the 1961 film West Side Story. The film also received two Golden Globe Awards, for Best Motion Picture and Best Actress, the Directors Guild of America Award for Outstanding Directorial Achievement, and the Writers Guild of America Award for Best Written American Musical. In 1998, the American Film Institute (AFI) listed The Sound of Music as the fifty-fifth greatest American film of all time, and the fourth greatest film musical. In 2001, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>Maria is a free-spirited young Austrian woman studying to become a nun at Nonnberg Abbey in Salzburg in 1938. Her youthful enthusiasm and lack of discipline cause some concern. Mother Abbess sends Maria to the villa of retired naval officer Captain Georg von Trapp to be governess to his seven children—Liesl, Friedrich, Louisa, Kurt, Brigitta, Marta, and Gretl. The Captain has been raising his children alone using strict military discipline following the death of his wife. Although the children misbehave at first, Maria responds with kindness and patience, and soon the children come to trust and respect her.</p><p>While the Captain is away in Vienna, Maria makes play clothes for the children from drapes that are to be changed. She takes them around Salzburg and the mountains while teaching them how to sing. When the Captain returns to the villa with Baroness Elsa Schraeder, a wealthy socialite, and their mutual friend Max Detweiler, they are greeted by Maria and the children returning from a boat ride on the lake which concludes when their boat overturns. Displeased by his children's clothes and activities and Maria's impassioned appeal that he get closer to his children, the Captain attempts to fire Maria. However, he hears singing coming from inside the house and is astonished to see his children singing for the Baroness. Filled with emotion, the Captain joins his children, singing for the first time in years. The Captain apologizes to Maria and asks her to stay.</p><p>Impressed by the children's singing, Max proposes that he enters them in the upcoming Salzburg Festival, but the Captain disapproves of letting his children sing in public. During a grand party at the villa, where guests in formal attire waltz in the ballroom, Maria and the children look on from the garden terrace. When the Captain notices Maria teaching Kurt the traditional Ländler folk dance, he steps in and partners Maria in a graceful performance, culminating in a close embrace. Confused about her feelings, Maria blushes and breaks away. Later, the Baroness, who noticed the Captain's attraction to Maria, hides her jealousy by indirectly convincing Maria that she must return to the abbey.</p><p>However, Mother Abbess learns that Maria has stayed in seclusion to avoid her feelings for the Captain, so she encourages her to return to the villa to look for her purpose in life. When Maria returns to the villa, she learns about the Captain's engagement to the Baroness and agrees to stay until they find a replacement governess. However, the Baroness learns that the Captain's feelings for Maria haven't changed, so she peacefully calls off the engagement and returns to Vienna while encouraging the Captain to express his feelings for Maria, who marries him.</p><p>While the couple is on their honeymoon, Max enters the children into the Salzburg Festival against their father's wishes. Having learned that Austria has been annexed by the Third Reich, the couple return to their home, where Captain receives a telegram, ordering him to report to the German Naval base at Bremerhaven to accept a commission in the Kriegsmarine. Strongly opposed to the Nazis, the Captain tells his family they must leave Austria immediately.</p><p>That night, the von Trapp family attempt to flee to Switzerland, but they are stopped by a group of Brownshirts, led by the Gauleiter Hans Zeller, waiting outside the villa. To cover his family's tracks, the Captain maintains they are headed to the Salzburg Festival to perform. Zeller insists on escorting them to the festival, after which his men will accompany the Captain to Bremerhaven.</p><p>Later that night at the festival, during their final number, the von Trapp family slips away and seeks shelter at the abbey, where Mother Abbess hides them in the cemetery crypt. Zeller and his men soon arrive and search the abbey, but the family is able to escape using the caretaker's car. When they attempt to pursue, they discover their cars will not start, as two of the nuns have sabotaged their engines. The next morning, after driving to the Swiss border, the von Trapp family make their way on foot across the frontier into Switzerland to safety and freedom.</p><br/><h3>Cast</h3><ul><li>Julie Andrews as Maria</li><li>Christopher Plummer as Captain von Trapp Bill Lee overdubbed Plummer's singing</li><li>Bill Lee overdubbed Plummer's singing</li><li>Eleanor Parker as Baroness Elsa von Schraeder</li><li>Richard Haydn as Max Detweiler</li><li>Peggy Wood as Mother Abbess</li><li>Charmian Carr as Liesl von Trapp</li><li>Heather Menzies as Louisa von Trapp</li><li>Nicholas Hammond as Friedrich von Trapp</li><li>Duane Chase as Kurt von Trapp</li><li>Angela Cartwright as Brigitta von Trapp</li><li>Debbie Turner as Marta von Trapp</li><li>Kym Karath as Gretl von Trapp</li><li>Anna Lee as Sister Margaretta</li><li>Portia Nelson as Sister Berthe</li><li>Ben Wright as Herr Zeller</li><li>Daniel Truhitte as Rolfe</li><li>Norma Varden as Frau Schmidt, housekeeper</li><li>Gil Stuart as Franz, butler</li><li>Marni Nixon as Sister Sophia</li><li>Evadne Baker as Sister Bernice</li><li>Doris Lloyd as Baroness Ebberfeld</li></ul><p>The real Maria von Trapp has a brief uncredited cameo as a passerby, alongside her children Rosmarie and Werner von Trapp during \"I Have Confidence\".</p><br/><h3>Background</h3><p>The Sound of Music story is based on Maria von Trapp's memoir, The Story of the Trapp Family Singers, published in 1949 to help promote her family's singing group following the death of her husband Georg in 1947. Hollywood producers expressed interest in purchasing the title only, but Maria refused, wanting her entire story to be told. In 1956, German producer Wolfgang Liebeneiner purchased the film rights for $9,000 (equivalent to $90,000 in 2021), hired George Hurdalek and Herbert Reinecker to write the screenplay, and Franz Grothe to supervise the soundtrack, which consisted of traditional Austrian folk songs. The Trapp Family was released in West Germany on October 9, 1956, and became a major success. Two years later, Liebeneiner directed a sequel, The Trapp Family in America, and the two pictures became the most successful films in West Germany during the post-war years. Their popularity extended throughout Europe and South America.</p><p>In 1956, Paramount Pictures purchased the United States film rights, intending to produce an English-language version with Audrey Hepburn as Maria. The studio eventually dropped its option, but one of its directors, Vincent J. Donehue, proposed the story as a stage musical for Mary Martin. Producers Richard Halliday and Leland Heyward secured the rights and hired playwrights Howard Lindsay and Russel Crouse, who had won the Pulitzer Prize for State of the Union. They approached Richard Rodgers and Oscar Hammerstein II to compose one song for the musical, but the composers felt the two styles—traditional Austrian folk songs and their composition—would not work together. They offered to write a completely new score for the entire production if the producers were willing to wait while they completed work on Flower Drum Song. The producers quickly responded that they would wait as long as necessary. The Sound of Music stage musical opened on November 16, 1959, at the Lunt-Fontanne Theatre in New York City and ran on Broadway for 1,443 performances, winning six Tony Awards, including Best Musical. In June 1960, Twentieth Century-Fox purchased the film adaptation rights to the stage musical for $1.25 million (equivalent to $11,400,000 in 2021) against ten percent of the gross.</p><br/><h3>Production</h3><h4>Screenplay and pre-production</h4><p>In December 1962, 20th Century Fox president Richard D. Zanuck hired Ernest Lehman to write the screenplay for the film adaptation of the stage musical. Lehman reviewed the original script for the stage musical, rearranged the sequence of songs, and began transforming a work designed for the stage into a film that could use the camera to emphasize action and mood and open the story up to the beautiful locations of Salzburg and the Austrian Alps. The \"Do-Re-Mi\" sequence in the play, for example, was originally a stagnant number; Lehman transformed it into a lively montage showing some of the beautiful sites of Salzburg, as well as showing Maria and the children growing closer over time. Lehman also eliminated two songs, \"How Can Love Survive?\" and \"No Way to Stop It\", sung by the characters of Elsa and Max. In January 1963, he saw the Fox English-dubbed version of the two German films. Not especially impressed, he decided to use the stage musical and Maria's memoir for most of his source material. While Lehman was developing the screenplay, he and Zanuck began looking for a director. Their first choice was Robert Wise, with whom Lehman had worked on the film adaptation of West Side Story, but Wise was busy preparing work for another film, The Sand Pebbles. Other directors were approached and turned down the offer, including Stanley Donen, Vincent J. Donehue, George Roy Hill, and Gene Kelly.</p><p>In January 1963, Lehman invited one of his favorite directors, William Wyler, to travel to New York City with him to see the Broadway musical. After seeing the show, Wyler said he hated it, but after two weeks of Lehman's persuasion, Wyler reluctantly agreed to direct and produce the film. After hiring musical supervisor Roger Edens, Wyler, Lehman, and Edens traveled to Salzburg to scout filming locations. In two weeks they managed to see approximately seventy-five locations—an experience that helped Lehman conceptualize several important sequences. During that trip, Lehman began to have reservations about Wyler's commitment to the project and communicated this to Zanuck, who instructed the writer to finalize the first draft of the screenplay as quickly as possible. Lehman completed the first draft on September 10, 1963, and sent it to Wyler, who had no suggestions or changes to add. At that time, Lehman also secretly gave a copy of the script to the agent of Robert Wise, whom Lehman still wanted as the director. Later that month, Wyler's agent approached Zanuck asking that production on the film be delayed so Wyler could direct The Collector. Zanuck told him to tell Wyler to make the other film, and that they would move ahead on schedule with another director, ending Wyler's participation.</p><p>Meanwhile, Wise, whose film The Sand Pebbles had been postponed, read Lehman's first draft, was impressed by what he read, and agreed to direct the film, joining the picture in October 1963, and flew to Salzburg with associate producer Saul Chaplin and members of his production team to scout filming locations, including many that Wyler had identified. When he returned, Wise began working on the script. Wise shared Lehman's vision of the film being centered on the music, and the changes he made were consistent with the writer's approach—mainly reducing the amount of sweetness and sentimentality found in the stage musical. He had reservations about Lehman's opening aerial sequence because West Side Story, whose screenplay Lehman had also written, had used a similar opening sequence, but he was unable to think of a better one and decided to keep Lehman's. Other changes included replacing \"An Ordinary Couple\" with a more romantic number, and a new song for Maria's departure from the abbey—Rodgers provided \"Something Good\" and \"I Have Confidence\", especially for the film. Lehman completed the second draft on December 20, 1963, but additional changes would be made based on input from Maria von Trapp and Christopher Plummer about the character of the Captain. Plummer especially helped change a character lacking substance into a stronger, more forceful complex figure with a wry sense of humor and a darker edge. Lehman completed his final draft on March 20, 1964.</p><h4>Casting and rehearsals</h4><p>Lehman's first and only choice for Maria was Julie Andrews. When Wise joined the project, he made a list of his choices for the role, which included Andrews as his first choice, Grace Kelly, and Shirley Jones. Wise and Lehman went to Disney Studios to view footage from Mary Poppins, which was not yet released. A few minutes into the film, Wise told Lehman, \"Let's go sign this girl before somebody else sees this film and grabs her!\" Andrews had some reservations—mainly about the amount of sweetness in the theatrical version—but when she learned that her concerns were shared by Wise and Lehman and what their vision was, she signed a contract with Fox to star in The Sound of Music and one other film for $225,000 (equivalent to $1,970,000 in 2021). Wise had a more difficult time casting the role of the Captain. A number of actors were considered for the part, including Bing Crosby, Yul Brynner, Sean Connery, and Richard Burton. Wise had seen Christopher Plummer on Broadway and wanted him for the role, but the stage actor turned down the offer several times. Wise flew to London to meet with Plummer and explained his concept of the film; the actor accepted after being assured that he could work with Lehman to improve the character.</p><p>Wise also spent considerable time and effort on casting the secondary characters. For the role of Max Detweiler, Wise initially considered Victor Borge, Noël Coward, and Hal Holbrook among others before deciding on Richard Haydn. For the character of Baroness Elsa Schraeder, Wise looked for a \"name\" actress—Andrews and Plummer were not yet widely known to film audiences—and decided on Eleanor Parker. The casting of the children's characters began in November 1963 and involved over two hundred interviews and auditions throughout the United States and England. Some of the child actors interviewed or tested, who were not selected, included Mia Farrow, Patty Duke, Lesley Ann Warren, Geraldine Chaplin, Shelley Fabares, Teri Garr, Kurt Russell, and The Osmonds. Most of the actors selected had some acting, singing, or dancing experience. Charmian Carr, however, was a model who worked part-time in a doctor's office and had no ambition to pursue a career as an actress. After a friend sent her photo to Wise's office, she was asked to interview. Wise later recalled, \"She was so pretty and had such poise and charm that we liked her immediately.\" The last person to be cast was Daniel Truhitte in the role of Rolfe.</p><p>Rehearsals for the singing and dance sequences began on February 10, 1964. The husband-and-wife team of Marc Breaux and Dee Dee Wood, who had worked with Andrews on Mary Poppins, worked out the choreography with Saul Chaplin on piano—the arrangements could not be altered under Rodgers and Hammerstein's contract. The stage choreography was not used because it was too restrictive. Breaux and Wood worked out all-new choreography better suited for the film that incorporated many of the Salzburg locations and settings. They even choreographed the newly added puppet dance sequence for \"The Lonely Goatherd\". The choreography for the Ländler strictly followed the traditional Austrian folk dance. The musical arranger Irwin Kostal prerecorded the songs with a large orchestra and singers on a stage before the start of filming. In her book, The Sound of Music: The Making of America's Favorite Movie, Julia Antopol Hirsch says that Kostal used seven children and five adults to record the children's voices; the only scene in which the child-actors' singing is heard in the released version of the film is when they sing \"The Sound of Music\" on their own after Maria leaves. Charmian Carr refuted the claim that the voices of the child actors were dubbed in the film and on the soundtrack. Carr contended that all of the children who are in the film sing on the track, but four other children were added to most of the songs to give them a fuller sound; they did not replace them as singers. The voices of some of the adult actors had voice doubles, including those of Peggy Wood and Christopher Plummer.</p><h4>Filming and post-production</h4><p>Principal photography began on March 26, 1964, at 20th Century Fox studios in Los Angeles, where scenes from Maria's bedroom and the abbey cloister and graveyard were filmed. The company then flew to Salzburg, where filming resumed on April 23 at Mondsee Abbey for the wedding scenes. From April 25 through May 22, scenes were filmed at the Felsenreitschule, Nonnberg Abbey, Mirabell Palace Gardens, Residence Fountain, and various street locations throughout the Altstadt (Old Town) area of the city. Wise faced opposition from city leaders who did not want him staging scenes with swastika banners. They relented after he threatened instead to include old newsreel footage featuring the banners. On days when it rained, a constant challenge for the company, Wise arranged for scenes to be shot at St. Margarethen Chapel and Dürer Studios (Reverend Mother's office). From May 23 to June 7, the company worked at Schloss Leopoldskron and an adjacent property called Bertelsmann for scenes representing the lakeside terrace and gardens of the von Trapp villa. From June 9 to 19, scenes were shot at Frohnburg Palace, which represented the front and back façades of the villa. Karath could not swim and was in danger during the capsizing boat scene. The \"Do-Re-Mi\" picnic scene in the mountains was filmed above the town of Werfen in the Salzach River valley on June 25 and 27. The opening sequence of Maria on her mountain was filmed from June 28 to July 2 at Mehlweg mountain near the town of Marktschellenberg in Bavaria. During filming, Birch trees were added and then removed. The brook she walks through was plastic filled with water which was put there during filming. The final scene of the von Trapp family escaping over the mountains was filmed on the Obersalzberg in the Bavarian Alps.</p><p>The cast and crew flew back to Los Angeles and resumed filming at Fox Studios on July 6 for all remaining scenes, including those in the villa dining room, ballroom, terrace, living room, and gazebo. Following the last two scenes shot in the gazebo—for the songs \"Something Good\" and \"Sixteen Going on Seventeen\"—principal photography concluded on September 1, 1964. A total of eighty-three scenes were filmed in just over five months. Post-production work began on August 25 with three weeks of dialogue dubbing to correct lines that were ruined by various street noises and rain. In October, Christopher Plummer's singing voice was dubbed by veteran Disney playback singer Bill Lee. The film was then edited by Wise and film editor William Reynolds. Once the film was edited, Irwin Kostal, who orchestrated the musical numbers, underscored the film with background music consisting of variations on Rodgers and Hammerstein's original songs to amplify or add nuances to the visual images. When dubbing, editing, and scoring were complete, Wise arranged for two sneak-preview showings—the first one held in Minneapolis on Friday, January 15, 1965 at the Mann Theater, and the second one held the following night in Tulsa. Despite the \"sensational\" responses from the preview audiences, Wise made a few final editing changes before completing the film. According to the original print information for the film, the running time for the theatrical release version was 174 minutes. The film was still in release when the Motion Picture Association of America's film ratings system was implemented in 1968, and was subsequently given a \"G\" rating (\"general audiences\") in 1969.</p><p>The Sound of Music was filmed in Todd-AO by Ted McCord and produced with DeLuxe Color processing. Aerial footage was photographed with an MCS-70 camera. The sound was recorded on a 70 mm six-track using a Westrex recording system. The sets used for the film were based on the storyboards of sketch artist Maurice Zuberano, who accompanied Wise to Austria to scout filming locations in November 1963. Wise met with the artist over ten weeks and explained his objective for each scene—the feeling he wanted to convey and the visual images he wanted to use. When Zuberano was finished, he provided Wise with a complete set of storyboards that illustrated each scene and set—storyboards the director used as guidance during filming. Zuberano's storyboards and location photos were also used by art director Boris Leven to design and construct all of the original interior sets at Fox studios, as well as some external sets in Salzburg. The von Trapp villa, for example, was actually filmed in several locations: the front and back façades of the villa were filmed at Frohnburg Palace, the lakeside terrace and gardens was a set constructed on a property adjacent to Schloss Leopoldskron called Bertelsmann, and the interior was a constructed set at Fox Studios. The gazebo scenes for \"Something Good\" and \"Sixteen Going on Seventeen\" were filmed on a larger reconstructed set at Fox studios, while some shots of the original gazebo were filmed on the grounds at Schloss Leopoldskron in Salzburg.</p><h4>Music and soundtrack album</h4><p>Most of the soundtrack to The Sound of Music was written by Richard Rodgers and Oscar Hammerstein II and arranged and conducted by Irwin Kostal, who also adapted the instrumental underscore passages. Both the lyrics and music for two new songs were written by Rodgers, as Hammerstein died in 1960. The soundtrack album was released by RCA Victor in 1965 and is one of the most successful soundtrack albums in history, having sold over 20 million copies worldwide.</p><p>The album reached the number one position on the Billboard 200 that year in the United States. It remained in the top ten for 109 weeks, from May 1, 1965, to July 16, 1967, and remained on the Billboard 200 chart for 238 weeks. The album was the best-selling album in the United Kingdom in 1965, 1966, and 1968 and the second best-selling of the entire decade, spending a total of 70 weeks at number one on the UK Albums Chart. It also stayed 73 weeks on the Norwegian charts, becoming the seventh best-charting album of all time in that country. In 2015, Billboard named the album the second greatest album of all time.</p><p>The album has been reissued several times, including anniversary editions with additional tracks in 1995, 2000, 2005, 2010, and 2015.</p><br/><h3>Release and reception</h3><h4>Marketing</h4><p>Robert Wise hired Mike Kaplan to direct the publicity campaign for the film. After reading the script, Kaplan decided on the ad line \"The Happiest Sound in All the World\", which would appear on promotional material and artwork. Kaplan also brought in outside agencies to work with the studio's advertising department to develop the promotional artwork, eventually selecting a painting by Howard Terpning of Andrews on an alpine meadow with her carpetbag and guitar case in hand with the children and Plummer in the background. In February 1964, Kaplan began placing ads in the trade papers Daily Variety, Weekly Variety, and The Hollywood Reporter to attract future exhibitor interest in the project. The studio intended the film to have an initial roadshow theatrical release in select large cities in theaters that could accommodate the 70-mm screenings and six-track stereophonic sound. The roadshow concept involved two showings a day with reserved seating and an intermission similar to Broadway musicals. Kaplan identified forty key cities that would likely be included in the roadshow release and developed a promotional strategy targeting the major newspapers of those cities. During the Salzburg production phase, 20th Century Fox organized press junkets for American journalists to interview Wise and his team and the cast members.</p><h4>Critical response</h4><blockquote>\"No one is comfortable with an excess of hearts and flowers, but there is no valid reason for hiding honest emotion. This has always been a major element in the theatre, and it's my conviction that anyone who can't, on occasion, be sentimental about children, home or nature is sadly maladjusted.\"</blockquote><p>Richard Rodgers</p><p>The film had its opening premiere on March 2, 1965, at the Rivoli Theater in New York City. Initial reviews were mixed. Bosley Crowther, in The New York Times, criticized the film's \"romantic nonsense and sentiment\", the children's \"artificial roles\", and Robert Wise's \"cosy-cum-corny\" direction. Judith Crist, in a biting review in the New York Herald Tribune, dismissed the movie as \"icky sticky\" and designed for \"the five to seven set and their mommies\". In her review for McCall's magazine, Pauline Kael called the film \"the sugar-coated lie people seem to want to eat\", and that audiences have \"turned into emotional and aesthetic imbeciles when we hear ourselves humming the sickly, goody-goody songs.\" Wise later recalled, \"The East Coast, intellectual papers and magazines destroyed us, but the local papers and the trades gave us great reviews\". Indeed, reviewers such as Philip K. Scheuer of the Los Angeles Times described the film as \"three hours of visual and vocal brilliance\", and Variety called it \"a warmly-pulsating, captivating drama set to the most imaginative use of the lilting R-H tunes, magnificently mounted and with a brilliant cast\". The \"wildly mixed film reviews\" reflected the critical response to the stage musical, according to The Oxford Companion to the American Musical. After its Los Angeles premiere on March 10, The Sound of Music opened in 131 theaters in the United States, including a limited number of roadshow events. After four weeks, the film became the number one box office movie in the country and held that position for thirty out of the next forty-three weeks in 1965. The original theatrical release of the film in America lasted four and a half years.</p><p>A few months after its United States release, The Sound of Music opened in 261 theaters in other countries, the first American movie to be completely dubbed in a foreign language, both dialogue, and music. The German, French, Italian, and Spanish versions were completely dubbed, the Japanese version had Japanese dialogue with English songs, and other versions were released with foreign subtitles. The film was a popular success in every country it opened, except the two countries where the story originated, Austria and Germany.</p><p>In these two countries, the film had to compete with the much-loved Die Trapp-Familie (1956), which provided the original inspiration for the Broadway musical, and its sequel Die Trapp-Familie in Amerika (1958), both films are still widely popular in German-speaking Europe and considered the authoritative von Trapp story. Austrians took exception to the liberties taken by the filmmakers with regard to the costumes, which did not reflect the traditional style and the replacement of traditional Austrian folk songs with Broadway show tunes. The film's Nazi theme was especially unpopular in Germany, where the Munich branch manager for 20th Century Fox approved the unauthorized cutting of the entire third act of the film following the wedding sequence—the scenes showing Salzburg following the Anschluss. Robert Wise and the studio intervened, the original film was restored, and the branch manager was fired.</p><p>The Sound of Music holds an 84% \"Certified Fresh\" rating on Rotten Tomatoes based on seventy-three reviews. The site's consensus states: \"Unapologetically sweet and maybe even a little corny, The Sound of Music will win over all but the most cynical filmgoers with its classic songs and irresistible warmth.\"</p><h4>Box office</h4><p>The Sound of Music is one of the most commercially successful films of all time. Four weeks after its theatrical release, it became the number one box office movie in the United States, from revenue generated by twenty-five theaters, each screening only ten roadshow performances per week. It held the number one position for thirty of the next forty-three weeks, and ended up the highest-grossing film of 1965. One contributing factor in the film's early commercial success was the repeat business of many filmgoers. In some cities in the United States, the number of tickets sold exceeded the total population. By January 1966, the film had earned $20 million in distributor rentals from just 140 roadshow engagements in the United States and Canada. Worldwide, The Sound of Music broke previous box-office records in twenty-nine countries, including the United Kingdom, where it played for a record-breaking three years at the Dominion Theatre in London and earned £4 million in rentals and grossed £6 million—more than twice as much as any other film had taken in. It was also a major success in the Netherlands, Hong Kong, and Tokyo, where it played for as long as two years at some theaters. It was not a universal success, however, with the film only enjoying modest success in France and it was a flop in Germany. It also initially performed poorly in Italy, but a re-release after the Oscars brought better results. It was number one at the US box office for a further 11 weeks in 1966, for a total of 41 weeks at number one. By November 1966, The Sound of Music had become the highest-grossing film of all time, with over $67.5 million in worldwide rentals ($125 million in gross receipts), surpassing Gone with the Wind, which held that distinction for twenty-four years. It was still in the top ten at the US box office in its 100th week of release.</p><p>The Sound of Music completed its initial four-and-a-half year theatrical release run in the United States on Labor Day 1969, the longest initial run for a film in the US, having earned $68,313,000 in rentals in the United States and Canada. It played for 142 weeks at the Eglinton Theatre in Toronto. It was the first film to gross over $100 million. By December 1970, it had earned $121.5 million in worldwide rentals, which was over four times higher than the film's estimated break-even point of $29.5 million in rentals. The film was re-released in 1973, and increased its North American rentals to $78.4 million. By the end of the 1970s, it was ranked seventh in all-time North American rentals, having earned $79 million. The film's re-release in 1990 increased the total North American admissions to 142,415,400—the third-highest number of tickets sold behind Gone with the Wind and Star Wars—and about 283.3 million admissions worldwide. The Sound of Music eventually earned a total domestic gross of $163,214,076 and a total worldwide gross of $286,214,076. Adjusted for inflation, the film earned about $2.366 billion at 2014 prices—placing it among the top ten highest-grossing films of all time.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><style data-mw-deduplicate=\"TemplateStyles:r1038841319\">.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help}</style><span class=\"rt-commentedText tooltip tooltip-dotted\">Ref.</span></th></tr><tr><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td rowspan=\"2\"><span>Robert Wise</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"10\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td><span>Julie Andrews</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Peggy Wood</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Art Direction – Color</span></td><td>Art Direction: <span>Boris Leven</span>; <br> Set Decoration: <span>Walter M. Scott</span> and <span>Ruby R. Levitt</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography – Color</span></td><td><span class=\"mw-redirect\">Ted D. McCord</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design – Color</span></td><td><span>Dorothy Jeakins</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>William H. Reynolds</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Scoring of Music – Adaptation or Treatment</span></td><td><span>Irwin Kostal</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound</span></td><td><span>James Corcoran</span> and <span>Fred Hynes</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>William H. Reynolds</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>British Academy Film Awards</span></td><td><span>Best British Actress</span></td><td rowspan=\"2\">Julie Andrews</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>David di Donatello Awards</span></td><td><span>Best Foreign Actress</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Robert Wise</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td><span>Best Motion Picture – Musical or Comedy</span></td><td><i>The Sound of Music</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\" style=\"text-align:center;\"></td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Motion Picture – Musical or Comedy</span></td><td>Julie Andrews</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress – Motion Picture</span></td><td>Peggy Wood</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Director – Motion Picture</span></td><td>Robert Wise</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Laurel Awards</span></td><td>Top General Entertainment</td><td><i>The Sound of Music</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Top Female Musical Performance</td><td>Julie Andrews</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Board of Review Awards</span></td><td><span>Top Ten Films</span></td><td rowspan=\"2\"><i>The Sound of Music</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>National Film Preservation Board</span></td><td><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td style=\"text-align:center;\"></td></tr><tr><td><span>New York Film Critics Circle Awards</span></td><td><span>Best Actress</span></td><td>Julie Andrews</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd place</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Written American Musical</span></td><td><span>Ernest Lehman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr></tbody></table><h4>American Film Institute recognition</h4><p>The Sound of Music has been included in numerous top film lists from the American Film Institute.</p><ul><li>AFI's 100 Years...100 Movies – No. 55</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) – No. 40</li><li>AFI's 100 Years...100 Cheers – No. 41</li><li>AFI's 100 Years of Musicals – No. 4</li><li>AFI's 100 Years...100 Passions – No. 27</li><li>AFI's 100 Years...100 Songs: \"The Sound of Music\" – No. 10 \"My Favorite Things\" – No. 64 \"Do-Re-Mi\" – No. 88</li><li>\"The Sound of Music\" – No. 10</li><li>\"My Favorite Things\" – No. 64</li><li>\"Do-Re-Mi\" – No. 88</li></ul><h4>Television and home media</h4><p>The first American television transmission of The Sound of Music was on February 29, 1976, on ABC, which paid $15 million (equivalent to $71,429,825 in 2021) for a one-time only broadcast that became one of the top 20 rated films shown on television to that point with a Nielsen rating of 33.6 and an audience share of 49%. The movie was not shown again until NBC acquired the broadcast rights in June 1977 for $21.5 million for 20 showings over 22 years and telecast the film on February 11, 1979. NBC continued to air the film annually for twenty years. During most of its run on NBC, the film was heavily edited to fit a three-hour time slot—approximately 140 minutes without commercials, which inevitably cut 30 minutes out of the original film.</p><p>The film aired in its uncut form (minus the entr'acte) on April 9, 1995, on NBC. Julie Andrews hosted the four-hour telecast which presented the musical numbers in a letterboxed format. As the film's home video availability cut into its television ratings, NBC let their contract lapse in 2001. That year, the film was broadcast one time on the Fox network, in its heavily edited 140-minute version. Since 2002, the film has aired on ABC on a Sunday night prior to Christmas and has been broadcast on its sister cable network, Freeform, periodically around Easter and other holidays. Most of its more recent runs have been the full version in a four-hour time slot, complete with the entr'acte. ABC first broadcast a high-definition version on December 28, 2008. On December 22, 2013, the annual broadcast had its highest ratings since 2007; the increase in ratings were credited to NBC's broadcast of The Sound of Music Live!—a live television adaptation of the original musical which aired earlier that month.</p><p>In the United Kingdom, the film rights were acquired by the BBC, who paid a corporation record $4.1 million, and it was first aired on BBC One on 25 December 1978 and, as of December 2016, fifteen times since, mostly around Christmas time. As the BBC channels in Britain are not funded by advertising there was no need to cut scenes to fit within a timeslot and the film was screened in the full 174-minute version without breaks. The film was also intended to be part of the BBC's programming during the outbreak of nuclear war.</p><p>The film has been released on VHS, LaserDisc, and DVD numerous times. The first DVD version was released on August 29, 2000, to commemorate the 35th anniversary of the film's release. The film is often included in box sets with other Rodgers & Hammerstein film adaptations. A 40th anniversary DVD, with \"making of\" documentaries and special features, was released on November 15, 2005. The film made its debut issue on Blu-ray Disc on November 2, 2010, for its 45th anniversary. For the Blu-ray release, the original 70 mm negatives were rescanned at 8K resolution, then restored and remastered at 4K resolution for the transfer to Blu-ray, giving the most detailed copy of the film seen thus far. On March 10, 2015, 20th Century Fox Home Entertainment released The Sound of Music 50th Anniversary Ultimate Collector's Edition—a five-disc set featuring thirteen hours of bonus features, including a new documentary, The Sound of a City: Julie Andrews Returns to Salzburg. A March 2015 episode of ABC's 20/20 entitled The Untold Story of the Sound of Music featured a preview of the documentary and interviews by Diane Sawyer.</p><p>In part to the acquisition of 21st Century Fox by Disney, the film was made available on the Disney+ streaming service upon its debut on November 12, 2019.</p><br/><h3>Historical accuracy</h3><p>The Sound of Music film adaptation, like the stage musical, presents a history of the von Trapp family (a.k.a. the Trapp Family) that is not completely accurate. The musical was based on the West German film The Trapp Family (1956) rather than Maria von Trapp's 1949 memoirs, as director Vincent J. Donehue had seen the film and decided that it would make a good vehicle for Mary Martin. The musical followed the film's plot so closely that the New York Times review of the West German film noticed that it \"strongly suggests 'The Sound of Music,' often scene by scene.\" The West German screenwriters made several significant changes to the family's story that were kept in the musical. Maria had been hired to teach just one child, but the 1956 film made her governess to all seven children.</p><p>The 1965 film adaptation was influenced by other musicals of its era, such as Mary Poppins, the Rodgers and Hammerstein television production of Cinderella, and the stage production of Lerner and Loewe's Camelot (coincidentally all starring Julie Andrews). Screenwriter Ernest Lehman was inspired by the opening of West Side Story and saw the musical as \"a fairy tale that's almost real\". The film incorporated many \"fairy tale\" tropes which included the idyllic imagery (placed in the hills of Salzburg), the European villas, and the cross-class Cinderella-like romance between Maria and Captain Von Trapp. As Maria walks down the aisle to be married, the pageantry is explicitly both Guinevere and Cinderella.</p><p>In keeping with this tone the filmmakers used artistic license to convey the essence and meaning of their story. Georg Ludwig von Trapp was indeed an anti-Nazi opposed to the Anschluss, and lived with his family in a villa in a district of Salzburg called Aigen. Their lifestyle depicted in the film, however, greatly exaggerated their standard of living. The actual family villa, located at Traunstraße 34, Aigen 5026, was large and comfortable but not nearly as grand as the mansion depicted in the film. The house was also not their ancestral home, as depicted in the film. The family had previously lived in homes in Zell Am See and Klosterneuburg after being forced to abandon their actual ancestral home in Pola following World War I. Georg moved the family to the Salzburg villa shortly after the death of his first wife, Agathe Whitehead, in 1922.</p><p>Georg is referred to as \"Captain\" in the film, but he held a noble title of \"Ritter\" (hereditary knight), which had higher social status than a naval officer. Although Austrian nobility was legally abolished in 1919 and the nobiliary particle von was proscribed, both continued to be widely used unofficially as a matter of social courtesy. Georg was offered a position in the German Kriegsmarine, but this occurred before the Anschluss. Nazi Germany was looking to expand its fleet of U-boats, and Corvette Captain von Trapp was the most successful Austro-Hungarian submarine commander of World War I, having sunk 11 Allied merchant ships totaling 47,653 GRT and two Allied warships displacing a total of 12,641 tons. With his family in desperate financial straits, he seriously considered the offer before deciding he could not serve a Nazi regime.</p><p>In the film, Georg is depicted initially as a humorless, emotionally distant father. In reality, third child Maria Franziska von Trapp (called \"Louisa\" in the film) described her father as a doting parent who made handmade gifts for the children in his woodshop and who would often lead family musicales on his violin. She has a different recollection of her stepmother, Maria Augusta Kutschera, whom she described as moody and prone to outbursts of rage. In a 2003 interview, Maria remembered, \" had a terrible temper ... and from one moment to the next, you didn't know what hit her. We were not used to this. But we took it like a thunderstorm that would pass, because the next minute she could be very nice.\"</p><p>Maria Kutschera had indeed been a novice at Nonnberg Abbey in Salzburg and had been hired by the von Trapp family. However, she was hired only to be a tutor to young Maria Franziska, who had come down with scarlet fever and needed her lessons at home, not to be a governess for all of the children. Maria and Georg married for practical reasons, rather than love and affection for each other. Georg needed a mother for his children, and Maria needed the security of a husband and family once she decided to leave the abbey. \"I really and truly was not in love,\" Maria wrote in her memoir, \"I liked him but didn't love him. However, I loved the children, so in a way I really married the children. I learned to love him more than I have ever loved before or after.\" They were married in 1927, not in 1938 as depicted in the film, and the couple had been married for over a decade by the time of the Anschluss and had two of their three children together by that time. Maria and Georg enjoyed a happy marriage.</p><p>The von Trapp family lost most of its wealth during the worldwide depression of the early 1930s, when the Austrian national bank folded. In order to survive, the family dismissed the servants and began taking in boarders. They also started singing onstage to earn money, a fact that caused the proud Georg much embarrassment. In the film, the von Trapp family hike over the Alps from Austria to Switzerland to escape the Nazis, which would not have been possible; Salzburg is over two hundred miles from Switzerland. The von Trapp villa, however, was only a few kilometers from the Austria–Germany border, and the final scene shows the family hiking on the Obersalzberg near the German town of Berchtesgaden, within sight of Adolf Hitler's Kehlsteinhaus Eagle's Nest retreat. In reality, the family simply walked to the local train station and boarded a train to Italy. The Trapps were entitled to Italian citizenship since Georg had been born in Zadar, Dalmatia, Austria-Hungary, which had been annexed by Italy after World War I. They were able to emigrate to the United States on their Italian passports.</p><p>The character Max Detweiler, the scheming family music director, is fictional. The von Trapps' family priest, the Reverend Franz Wasner, was their musical director for over twenty years and accompanied them when they left Austria. The character of Friedrich, the second oldest child in the film version, was based on Rupert, the oldest of the real von Trapp children. Liesl, the oldest child in the film, was based on Agathe von Trapp, the second oldest in the real family. The names and ages of the children were changed, in part because the third child, who would be portrayed as \"Louisa\", was also named Maria, and producers thought that it would be confusing to have two characters called Maria in the film. The von Trapp family had no control over how they were depicted in the film and stage musical, having given up the rights to their story to a German producer in the 1950s who then sold the rights to American producers. Robert Wise met with Maria von Trapp and made it clear, according to a memo to Richard Zanuck, that he was not making a \"documentary or realistic movie\" about her family, and that he would make the film with \"complete dramatic freedom\" in order to produce a \"fine and moving film\", one they could all be proud of.</p><br/><h3>Legacy</h3><p>Although The Sound of Music is set in Salzburg, it was largely ignored in Austria upon release. The film adaptation was a blockbuster worldwide, but it ran for only three days in Salzburg movie theaters, with locals showing \"disdain\" for a film that \"wasn't authentic.\" In 1966, American Express created the first Sound of Music guided tour in Salzburg. Since 1972, Panorama Tours has been the leading Sound of Music bus tour company in the city, taking approximately 50,000 tourists a year to various film locations in Salzburg and the surrounding region. Although the Salzburg tourism industry took advantage of the attention from foreign tourists, residents of the city were apathetic about \"everything that is dubious about tourism.\" The guides on the bus tour \"seem to have little idea of what really happened on the set.\" Even the ticket agent for the Sound of Music Dinner Show tried to dissuade Austrians from attending a performance that was intended for American tourists, saying that it \"does not have anything to do with the real Austria.\" By 2007, The Sound of Music was drawing 300,000 visitors a year to Salzburg, more than the city's self-conception as the birthplace of Wolfgang Amadeus Mozart. A German translation of the musical was performed on the national stage for the first time in 2005 at the Vienna Volksoper, receiving negative reviews from Austrian critics, who called it \"boring\" and referred to \"Edelweiss\" as \"an insult to Austrian musical creation.\" The musical finally premiered in Salzburg in 2011 at the Salzburger Landestheater, but Maria was played in the Salzburg premiere by a Dutch actress who \"grew up with the songs.\" However, most performances in Vienna and Salzburg were sold out, and the musical is now in both companies' repertoire.</p><p>A Sing-along Sound of Music revival screening was first shown at the London Lesbian and Gay Film Festival in 1999, leading to a successful run at the Prince Charles Cinema which is ongoing as of 2018. During the screenings, audience members are often dressed as nuns and von Trapp children and are encouraged to sing along to lyrics superimposed on the screen. In July 2000, Sing-along Sound of Music shows opened in Boston and Austin, Texas. Some audience members dressed up as cast members and interacted with the action shown on the screen. The film began a successful run at the Ziegfeld Theatre in New York City in September 2000, with the opening attended by cast members Charmian Carr (Liesl), Daniel Truhitte (Rolfe), and Kym Karath (Gretl). Sing-along Sound of Music screenings have since become an international phenomenon.</p><p>In 2001, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\". The Academy Film Archive preserved The Sound of Music in 2003.</p><br/>"
  },
  "errorMessage": ""
}