{
  "imDbId": "tt0051201",
  "title": "Witness for the Prosecution",
  "fullTitle": "Witness for the Prosecution (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/witness-for-the-prosecution/review/2030101640/",
      "rate": "100",
      "content": "Dietrich steals it. WITNESS FOR THE PROSECUTION is a witty, terse adaptation of the Agatha Christie hit play brought to the screen with ingenuity and vitality by Billy Wilder."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://archive.nytimes.com/www.nytimes.com/books/98/12/27/specials/wilder-witness.html",
      "rate": "90",
      "content": "For a courtroom melodrama pegged to a single plot device--a device that, of course, everybody promises not to reveal--the Arthur Hornblow Jr. film production of the Agatha Christie play \"Witness for the Prosecution\" comes off extraordinarily well. This results mainly from Billy Wilder's splendid staging of some splintering courtroom scenes and a first-rate theatrical performance by Charles Laughton in the defense-attorney role."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "",
      "link": "",
      "rate": "88",
      "content": "The courtroom scenes are terrific, with brittle dialogue expertly delivered. And Wilder milks Christie's surprise denouement for all it's worth. [21 Nov 1986, p.92]"
    },
    {
      "publisher": "",
      "author": "IndieWire",
      "link": "https://www.indiewire.com/news/general-news/watch-witness-for-the-prosecution-is-an-unsung-wilder-classic-from-1957-181070/",
      "rate": "83",
      "content": "Billy Wilder’s trademark sardonicism lends welcome bite and wit to this twisting, turning murder mystery from Agatha Christie."
    },
    {
      "publisher": "CineVue",
      "author": "Martyn Conterio",
      "link": "https://cine-vue.com/2018/09/dvd-review-witness-for-the-prosecution.html",
      "rate": "80",
      "content": "While not amongst the greater, more celebrated titles in Billy Wilder’s acclaimed filmography, his big screen adaptation of Agatha Christie’s Witness for the Prosecution boasts a fine, scenery-chewing performance by Charles Laughton, here playing a cantankerous barrister defending a murder suspect."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/witness-prosecution-review/",
      "rate": "80",
      "content": "Marlene Dietrich tries not to give anything away as usual while Agatha Christie's whodunit plot whirs tidily about her expressionless beauty."
    },
    {
      "publisher": "",
      "author": "The Independent",
      "link": "https://www.independent.co.uk/arts-entertainment/films/features/movies-you-might-have-missed-billy-wilder-witness-for-the-prosecution-marlene-dietrich-charles-laughton-a8082031.html",
      "rate": "80",
      "content": "The combination of Christie and Wilder ensures the story is impeccably told and the dialogue is unsurpassable from start to finish."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "75",
      "content": "The artificial plotting is all Christie’s, but the film eventually becomes Wilder’s—thanks to a trick ending that dovetails nicely with a characteristic revelation of compassion behind cruelty. His theatrical mise-en-scene—his proscenium framing—serves the material well, as does Charles Laughton’s bombastic portrayal of the defense attorney."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1956/film/reviews/witness-for-the-prosecution-1200418175/",
      "rate": "70",
      "content": "A courtroom meller played engagingly and building evenly to a surprising and arousing, albeit tricked-up, climax, Witness for the Prosecution has been transferred to the screen (from the Agatha Christie click play) with competence."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "60",
      "content": "Tyrone Power is surprisingly good as the man accused of murdering his mistress, but the swift twists and turns of Ms Christie's plot soon drain Dietrich and Laughton's roles of any dramatic credibility."
    }
  ],
  "errorMessage": ""
}