{
  "imDbId": "tt1895587",
  "title": "Spotlight",
  "fullTitle": "Spotlight (2015)",
  "type": "Movie",
  "year": "2015",
  "items": [
    {
      "publisher": "Hitfix",
      "author": "Gregory Ellwood",
      "link": "https://uproxx.com/entertainment/",
      "rate": "100",
      "content": "Like any creative endeavor a film is the sum of its parts. In the most elementary terms it needs a screenplay as a base, a cast to bring the script to life and a director to orchestrate the pieces into something of considerable impact. Excuse the hyperbole, but Tom McCarthy's Spotlight is an example of when all those pieces fit together almost perfectly."
    },
    {
      "publisher": "Time Out London",
      "author": "Dave Calhoun",
      "link": "",
      "rate": "100",
      "content": "It’s a more subtle, damning film for implicating the media – as much as the church, the courts, the legal profession and other Boston institutions – in the systematic, wider cultural cover-up it describes."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/spotlight-review-michael-keaton-rachel-mcadams-mark-ruffalo/",
      "rate": "95",
      "content": "Spotlight is that rare journalistic procedural that deserves to be mentioned in the same breath as “All the President’s Men,” and while the movie never glamorizes or makes saints of its hard-working newsgatherers, it does stand as a reminder of the power and importance of a free press, particularly in ferreting out local corruption and malfeasance."
    },
    {
      "publisher": "The Playlist",
      "author": "Jessica Kiang",
      "link": "https://www.indiewire.com/2015/09/venice-review-tom-mccarthys-spotlight-with-michael-keaton-rachel-mcadams-mark-ruffalo-liev-schreiber-stanley-tucci-260256/",
      "rate": "91",
      "content": "It's the best film McCarthy has ever made: restrained, intelligent and grown-up, but unfolding with the pacing and rhythm of a thriller."
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "https://variety.com/2015/film/reviews/spotlight-review-michael-keaton-tom-mccarthy-venice-film-festival-1201580933/",
      "rate": "90",
      "content": "Like so many films consumed with the minutiae of daily journalism, Spotlight is a magnificently nerdy process movie — a tour de force of filing-cabinet cinema, made with absolute assurance that we’ll be held by scene after scene of people talking, taking notes, following tips, hounding sources, poring over records, filling out spreadsheets, and having one door after another slammed in their faces."
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/films/2016/04/14/spotlight-review-skin-prickling/",
      "rate": "80",
      "content": "There’s no tidy moral to take away, because a story like this shouldn’t end in comfort. Instead, your skin’s left prickling by its deft deconstruction of the business of secret-keeping, and its perceptive setting out of the courage and diligence it takes to overturn it."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/2015/09/review-how-michael-keaton-saves-spotlight-58573/",
      "rate": "75",
      "content": "The overly earnest movie falls below the rich ambiguities that Keaton brings to the part, resulting in a measured drama so restrained it sometimes underserves the material. Where \"Birdman\" magnified Keaton's talent, Spotlight leans on it."
    },
    {
      "publisher": "Screen Daily",
      "author": "Tim Grierson",
      "link": "",
      "rate": "70",
      "content": "A polished, engrossing procedural, Spotlight offers plenty of old-fashioned pleasures — chiefly, the sight of smart, scrappy muckraking journalists stopping at nothing to uncover systematic corruption."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "",
      "rate": "60",
      "content": "Spotlight never hits the heights of passion, but capably and decently tells an important story."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/news/general-news/spotlight-venice-review-819871/",
      "rate": "40",
      "content": "This material cant help but be interesting, even compelling up to a point, but its prosaic presentation suggests that the story's full potential, encompassing deep, disturbing and enduring pain on all sides of the issue, has only begun to be touched."
    }
  ],
  "errorMessage": ""
}