{
  "imDbId": "tt1895587",
  "title": "Spotlight",
  "fullTitle": "Spotlight (2015)",
  "type": "Movie",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Spotlight (film)",
  "url": "https://en.wikipedia.org/wiki/Spotlight_(film)",
  "plotShort": {
    "plainText": "Spotlight is a 2015 American biographical drama film directed by Tom McCarthy and written by McCarthy and Josh Singer. The film follows The Boston Globe's \"Spotlight\" team, the oldest continuously operating newspaper investigative journalist unit in the United States, and its investigation into cases of widespread and systemic child sex abuse in the Boston area by numerous Catholic priests. Although the plot was original, it is loosely based on a series of stories by the Spotlight team that earned The Globe the 2003 Pulitzer Prize for Public Service. The film features an ensemble cast including Mark Ruffalo, Michael Keaton, Rachel McAdams, John Slattery, and Stanley Tucci, with Brian d'Arcy James, Liev Schreiber, and Billy Crudup in supporting roles.\r\nSpotlight was shown in the Out of Competition section of the 72nd Venice International Film Festival, the Telluride Film Festival and the Special Presentations section of the 2015 Toronto International Film Festival. It was released on November 6, 2015, by Open Road Films and grossed $98 million worldwide. It received widespread critical praise, with critics lauding the performances of the cast, historical accuracy and screenplay; it won numerous guilds' and critics' association awards, and was named one of the best films of 2015 by various publications. Spotlight won the Academy Award for Best Picture, along with Best Original Screenplay, from six total nominations, making it the first Best Picture winner since The Greatest Show on Earth (1952) to win only one other Oscar. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.",
    "html": "<p>Spotlight is a 2015 American biographical drama film directed by Tom McCarthy and written by McCarthy and Josh Singer. The film follows The Boston Globe's \"Spotlight\" team, the oldest continuously operating newspaper investigative journalist unit in the United States, and its investigation into cases of widespread and systemic child sex abuse in the Boston area by numerous Catholic priests. Although the plot was original, it is loosely based on a series of stories by the Spotlight team that earned The Globe the 2003 Pulitzer Prize for Public Service. The film features an ensemble cast including Mark Ruffalo, Michael Keaton, Rachel McAdams, John Slattery, and Stanley Tucci, with Brian d'Arcy James, Liev Schreiber, and Billy Crudup in supporting roles.</p><p>Spotlight was shown in the Out of Competition section of the 72nd Venice International Film Festival, the Telluride Film Festival and the Special Presentations section of the 2015 Toronto International Film Festival. It was released on November 6, 2015, by Open Road Films and grossed $98 million worldwide. It received widespread critical praise, with critics lauding the performances of the cast, historical accuracy and screenplay; it won numerous guilds' and critics' association awards, and was named one of the best films of 2015 by various publications. Spotlight won the Academy Award for Best Picture, along with Best Original Screenplay, from six total nominations, making it the first Best Picture winner since The Greatest Show on Earth (1952) to win only one other Oscar. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.</p>"
  },
  "plotFull": {
    "plainText": "Spotlight is a 2015 American biographical drama film directed by Tom McCarthy and written by McCarthy and Josh Singer. The film follows The Boston Globe's \"Spotlight\" team, the oldest continuously operating newspaper investigative journalist unit in the United States, and its investigation into cases of widespread and systemic child sex abuse in the Boston area by numerous Catholic priests. Although the plot was original, it is loosely based on a series of stories by the Spotlight team that earned The Globe the 2003 Pulitzer Prize for Public Service. The film features an ensemble cast including Mark Ruffalo, Michael Keaton, Rachel McAdams, John Slattery, and Stanley Tucci, with Brian d'Arcy James, Liev Schreiber, and Billy Crudup in supporting roles.\r\nSpotlight was shown in the Out of Competition section of the 72nd Venice International Film Festival, the Telluride Film Festival and the Special Presentations section of the 2015 Toronto International Film Festival. It was released on November 6, 2015, by Open Road Films and grossed $98 million worldwide. It received widespread critical praise, with critics lauding the performances of the cast, historical accuracy and screenplay; it won numerous guilds' and critics' association awards, and was named one of the best films of 2015 by various publications. Spotlight won the Academy Award for Best Picture, along with Best Original Screenplay, from six total nominations, making it the first Best Picture winner since The Greatest Show on Earth (1952) to win only one other Oscar. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.\r\nPlot\r\nIn 1976, at a Boston Police station, two policemen discuss the arrest of Fr. John Geoghan for child molestation. A high-ranking cleric talks to the mother of the children. An assistant district attorney then enters the precinct and tells the policemen not to let the press learn what has happened. The arrest is not publicized and Geoghan is released.\r\nIn 2001, Marty Baron, the new managing editor of The Boston Globe, meets Walter \"Robby\" Robinson, the editor of the newspaper's \"Spotlight\" investigative team. After Baron reads a Globe article about a lawyer, Mitchell Garabedian, charging that Cardinal Bernard Law, the Archbishop of Boston, knew about Geoghan's sexual abuse of children and did nothing to stop it, Baron urges the Spotlight team to investigate. Journalist Michael Rezendes contacts Garabedian, who initially declines to be interviewed. Though he is told not to, Rezendes reveals that he is on the Spotlight team and convinces Garabedian to talk.\r\nInitially believing that they are following the story of one priest who was moved to new assignments several times, the Spotlight team begin to uncover a pattern of sexual abuse by other priests in Massachusetts and an ongoing cover-up by the Boston Archdiocese. Through Phil Saviano, who heads the victims' rights group Survivors Network of those Abused by Priests (SNAP), the team is led to widen their search to thirteen priests. Richard Sipe, a former priest who worked to rehabilitate sexually abusive priests, tells them that his studies suggest that there are approximately 90 abusive priests in Boston (6% of priests). Through their research, the team develops a list of 87 names and begin to find victims to back up their suspicions.\r\nAs the team realizes the sheer scale of the investigation, it begins to take a toll on their lives: reporter Matt Carroll learns one of the priest rehabilitation centers is on the same block as his family's home but cannot tell his children or his neighbors to avoid spoiling the story; reporter Sacha Pfeiffer finds herself unable to attend church with her grandmother; Rezendes pushes to get the story out quickly to prevent further abuse; and Robinson faces pushback from some of his close friends who he learns were complicit in covering up the abuse.\r\nWhen the September 11 attacks occur, the team is forced to de-prioritize the story. They regain momentum when Rezendes learns from Garabedian that there are publicly available documents that confirm Cardinal Law was made aware of the abuse and ignored it. Although Rezendes argues vociferously to run the story immediately, before more victims suffer and rival newspapers publish comparable articles, Robinson steadfastly refuses, arguing the team needs to research further so that the systemic problem can be more fully exposed. After the Globe wins a case to have even more legal documents unsealed that provide the evidence of that larger picture, the Spotlight team finally begins to write the story and plan to publish their findings in early 2002.\r\nAs they are about to go to print, Robinson admits that he learned during the investigation that he was sent a list of 20 sexually abusive priests by lawyer Eric MacLeish in 1993, on which Robinson never followed up. Baron still commends Robinson and the Spotlight team's efforts to expose the crimes now. The story goes to print with a weblink to the documents that expose Law's inaction and a phone number for victims of abusive priests. The next morning, the team is inundated with calls from victims coming forward to tell their stories.\r\nA textual epilogue notes that Law resigned in December 2002 and was eventually promoted to the Basilica di Santa Maria Maggiore in Rome, and presents a list of 105 U.S. communities and 101 others around the world where major scandals involving abuse by priests have taken place.\r\nCast\r\nMark Ruffalo as Michael Rezendes\r\nMichael Keaton as Walter \"Robby\" Robinson\r\nRachel McAdams as Sacha Pfeiffer\r\nBrian d'Arcy James as Matt Carroll\r\nLiev Schreiber as Marty Baron\r\nJohn Slattery as Ben Bradlee Jr.\r\nStanley Tucci as Mitchell Garabedian, an attorney representing victims of sexual abuse\r\nGene Amoroso as Stephen Kurkjian, Boston Globe general investigative reporter\r\nJamey Sheridan as Jim Sullivan, an attorney representing the Church\r\nBilly Crudup as Eric MacLeish, an attorney representing victims of sexual abuse\r\nMaureen Keiller as Eileen McNamara, Boston Globe columnist\r\nRichard Jenkins as Richard Sipe, psychotherapist (telephone voice, uncredited)\r\nPaul Guilfoyle as Peter Conley\r\nLen Cariou as Cardinal Bernard Law, Archbishop of Boston\r\nNeal Huff as Phil Saviano of SNAP\r\nMichael Countryman as Richard Gilman, publisher of the Boston Globe\r\nMichael Cyril Creighton as Joe Crowley\r\nLaurie Heineman as Judge Constance Sweeney\r\nDavid Fraser as John Albano\r\nTim Progosh as Principal Bill Kemeza\r\nJimmy LeBlanc as Patrick McSorley\r\nProduction\r\nWriting\r\nThe film was written by Tom McCarthy and co-writer Josh Singer. When McCarthy was asked how he and his co-author tackled the research and writing process, he said:\r\nAs I said, I passed the first time! That's probably some indication of how intimidating it was. But I think, as always, with any big assignment, once you get over that initial shock and awe of how much material there was to cover, you start digging into the material and become really fascinated by and engaged with it, and we did. And yeah, it was a lot of work, but it was exciting work. It was really interesting work, parsing through details of not just the investigation, but its findings, and trying to determine what was most helpful in telling our story. I think having two brains on it was somewhat helpful too, because we could talk through it a lot. So it wasn't just sitting alone in a room and jotting notes. We were dialoguing a lot about it. That particular collaboration did feel investigative and on some level, seemed to parallel some of the collaboration of the reporters in that investigation. So, I think there was something about our collaboration that made that initial process more palatable on some level.\r\nDevelopment\r\nMcCarthy and Singer completed the script in June 2013. It was on the 2013 Black List of unproduced screenplays. Singer told Creative Screenwriting that one of his goals for the film was to highlight the power of journalism, which he feels has been waning. He explained, \"This story isn't about exposing the Catholic Church. We were not on some mission to rattle people's faith. In fact, Tom came from a Catholic family. The motive was to tell the story accurately while showing the power of the newsroom—something that's largely disappeared today. This story is important. Journalism is important, and there is a deeper message in the story.\"\r\nFilming\r\nPrincipal photography began on September 24, 2014, in Boston, Massachusetts, and continued in October in Hamilton, Ontario. Filming took place at Fenway Park, the then-current Boston Globe offices in Dorchester, Boston, the Boston Public Library, and McMaster University in Hamilton, Ontario. The film's editor Tom McArdle said of the post-production process, \"We edited for eight months. We just wanted to keep refining the film. We cut out five scenes plus some segments of other scenes. Often we would just cut out a line or two to make a scene a little tighter.\" The Boston Police station depicted in the opening scene was filmed in Toronto at the former Toronto Police Service 11 Division station at 209 Mavety Street, and the former Sears building on Islington Avenue in Toronto was converted into a replica of the interior of the old Boston Globe, where the bulk of the filming took place. The brief scene in which Rezendes watches a children's church choir perform \"Silent Night\" was filmed in St. Basil's Church (Toronto), a Roman Catholic church on the University of Toronto campus.\r\nHistorical accuracy\r\nThe visual blog Information is Beautiful deduced that, while taking creative license into account, the film was 76.2% accurate when compared to real-life events, summarizing that \"the only conceits are scenes of power figures warning off the journalists\".\r\nThe film only depicts the events leading up to the publication of the Spotlight team's first article, whereas the team actually continued publishing follow-up reports for nearly two years afterward. As a result, certain events are depicted as having happened earlier than they actually did, including the scene where former priest Ronald H. Paquin freely admits to molesting children and having been molested himself.\r\nWhile Sacha Pfeiffer did indeed write the numerous follow-up reports on Paquin, the interview depicted in the film was a blend of two interviews conducted by her and Steve Kurkjian, both of which took place about a month after the events in the film. After the first story was published, Kurkjian rejoined the Spotlight team (he had been a founding member before becoming the Globe's Washington bureau chief) to assist with further reporting on the abuses. Pfeiffer and Kurkjian have said that the confession was a much more gradual process and Paquin did not just \"blurt it out\" the way he does in the film.\r\nA scene where Matt Carroll discovers one of the priest treatment centers is down the block from where he lives is based on an actual discovery he made during the investigation, with one minor detail changed: Carroll actually lived down the street from John Geoghan, the priest whose case sparked the investigations. This was changed as the filmmakers thought the image of Carroll putting Geoghan's photo on his refrigerator to warn his children would seem unrealistic.\r\nIn a subplot, Eric MacLeish claims he sent a list of 20 priests to the Globe in 1993 but the story was buried in Metro: Robinson later admits he was the editor for Metro at the time and he likely overlooked the case. While the Globe did publish an article about the list of 20 priests, the Spotlight team did not learn this during their investigation. MacLeish himself revealed the article's existence while being interviewed for the screenplay by McCarthy and Singer. This revelation, along with Robinson's response to the filmmakers' inquiry, was incorporated into the screenplay for dramatic purposes.\r\nRelease\r\nThe film \"premiered to sustained applause\" at the Venice Film Festival and the audience \"erupted in laughter\" when the film reported that following the events in the film Cardinal Bernard Law was reassigned to a senior position of honor in Rome. It had a limited release on November 6, 2015, with its U.S. release scheduled for three weeks later on November 25.\r\nHome media\r\nSpotlight was released by Universal Studios Home Entertainment on DVD and Blu-ray in the United States on February 23, 2016.\r\nReception\r\nBox office\r\nSpotlight grossed $45.1 million in the United States and Canada and $53.2 million in other countries for a worldwide total of $98.3 million, against a production budget of $20 million. The Hollywood Reporter calculated the film made a net profit of up to $10 million.\r\nIn the opening weekend of its limited release, the film grossed $295,009 from five theaters ($59,002 average), one of the highest per-screen averages of any release of 2015. The film grossed $4.4 million in the first weekend during its wide release, finishing 8th at the box office.\r\nCritical response\r\nSpotlight received critical acclaim. The review aggregator website Rotten Tomatoes gave the film an approval rating of 97% based on 376 reviews, with an average rating of 8.80/10. The website's summary of the critical consensus is that \"Spotlight gracefully handles the lurid details of its fact-based story while resisting the temptation to lionize its heroes, resulting in a drama that honors the audience as well as its real-life subjects.\" On Metacritic, the film has a score of 93 out of 100, based on 45 critics, indicating \"universal acclaim.\"\r\nVariety's Justin Chang called the film \"a superbly controlled and engrossingly detailed account of the Boston Globe's Pulitzer Prize-winning investigation into the widespread pedophilia scandals and subsequent cover-ups within the Catholic Church.\" Joe Morgenstern of The Wall Street Journal wrote, \"To turn a spotlight fittingly on Spotlight, it's the year's best movie so far, and a rarity among countless dramatizations that claim to be based on actual events.\" Mark Kermode of The Guardian gave it 4 out of 5 stars and praised Ruffalo's performance, writing, \"As for Mark Ruffalo, he's the closest thing this ensemble cast has to a star turn, a long-suppressed outburst of emotion providing one of the film's few grandstanding showstoppers.\" Helen O'Hara of Empire gave the movie 4 out of 5 stars and called it a \"grown-up film about serious people that mercifully escapes any awards-grabbing platitudes\" and \"more thrilling than most action movies.\" Richard Propes of The Independent Critic gave Spotlight 4 out of 4 marks and praised the screenplay and cast: \"Spotlight is a nearly perfect example of what happens when the perfect filmmaker works with the perfect script and acquires the perfect cast and crew to bring a story to life\".\r\nAt the 2015 Toronto International Film Festival, Spotlight finished third in the audience balloting for the People's Choice Award.\r\nComparing Spotlight to The Post, a similar period film about journalists, critic Matt Zoller Seitz of RogerEbert.com expressed perplexity over critics' muted praise for the latter film, writing that in terms of direction, Spotlight \"got praise for doing a tenth of what Steven Spielberg does here\".\r\nTop ten lists\r\nSpotlight was included on many critics' top-ten lists.\r\n1st – Peter Travers, Rolling Stone\r\n1st – Christoper Orr, The Atlantic\r\n1st – Bill Goodykoontz, Arizona Republic\r\n1st – Lou Lumenick, New York Post\r\n1st – Rex Reed, New York Observer\r\n1st – Ty Burr, Boston Globe\r\n1st – Michael Phillips, Chicago Tribune\r\n1st – Stephanie Zacharek, Time\r\n1st – Ann Hornaday, The Washington Post\r\n1st – Kate Erbland, Indiewire\r\n1st – Joe Morgenstern, Wall Street Journal\r\n2nd – Peter Debruge, Variety\r\n2nd – Christy Lemire, RogerEbert.com\r\n3rd – Scott Feinberg, The Hollywood Reporter\r\n3rd – Rene Rodriguez, Miami Herald\r\n3rd – Inkoo Kang, TheWrap\r\n3rd – James Berardinelli, Reelviews\r\n3rd – Richard Lawson, Vanity Fair\r\n3rd – J.R. Jones, Chicago Reader\r\n3rd – A.O. Scott and Stephen Holden, The New York Times\r\n4th – Jake Coyle, Associated Press\r\n4th – Connie Ogle, Miami Herald\r\n4th – Josh Kupecki, Austin Chronicle\r\n5th – Anne Thompson, IndieWire\r\n5th – Kristopher Tapley, Variety\r\n5th – Mick LaSalle, San Francisco Chronicle\r\n6th – David Edelstein, New York Magazine\r\n6th – Joshua Rothkopf, Time Out New York\r\n7th – Justin Chang, Variety\r\n8th – Richard Roeper, Chicago Sun-Times\r\n9th – Alonso Duralde, TheWrap\r\n10th – Alison Willmore, BuzzFeed\r\n10th – Tom Brook, BBC\r\n10th – Kyle Smith, New York Post\r\nTop 10 (listed alphabetically, not ranked) – Stephen Whitty, The Star-Ledger\r\nTop 10 (listed alphabetically, not ranked) – Dana Stevens, Slate.com\r\nTop 10 (listed alphabetically) – Steven Rea, Philadelphia Inquirer\r\nBest of 2015 (listed alphabetically, not ranked) – Kenneth Turan, Los Angeles Times\r\nReactions from the Catholic Church\r\nIn general, the film was positively received by the Catholic community. Before its release, Cardinal Sean O'Malley of the Archdiocese of Boston issued a statement in the archdiocese's official newspaper, stating that the \"media's investigative reporting on the abuse crisis instigated a call for the Church to take responsibility for its failings and to reform itself—to deal with what was shameful and hidden.\" O'Malley had not seen the movie at that time but planned to do so.\r\nOn November 9, 2015, a review in the Catholic News Service called the film a \"generally accurate chronicle\" of the Boston scandal, but objected to some of the portrayals and the film's view of the Church. On the Catholic News Service, auxiliary bishop of Los Angeles Robert Barron said that it is \"not a bad movie\", as it shows how the wider community shares the responsibility for sexual abuse committed by priests, but that the film is wrong to insinuate that the Church has not reformed.\r\nVatican Radio, the official radio service of the Holy See, called it \"honest\" and \"compelling\" and said it helped the U.S. Catholic Church \"to accept fully the sin, to admit it publicly, and to pay all the consequences.\" Luca Pellegrini on the Vatican Radio website wrote that the Globe reporters \"made themselves examples of their most pure vocation, that of finding the facts, verifying sources, and making themselves—for the good of the community and of a city—paladins of the need for justice.\" In February 2016, a Vatican City commission on clerical sex abuse attended a private screening of the film. Following the film's Best Picture win at the Oscars, Vatican newspaper L'Osservatore Romano ran a column assuring that it is \"not an anti-Catholic film\", and Vatican Radio revealed that clerics in Rome have been recommending the film to each other.\r\nCriticism\r\nA January 8, 2016, article in The New York Times cited author David F. Pierre Jr., who said that Spotlight \"is a misrepresentation of how the Church dealt with sexual abuse cases\", asserting that the movie's biggest flaw was its failure to portray psychologists who had assured Church officials that abusive priests could be safely returned to ministry after undergoing therapy treatments. Open Road Films rebutted the detractor, saying he was \"perpetuating a myth in order to distract from real stories of abuse.\"\r\nThe film was attacked by Jack Dunn (played by Gary Galone), the public relations head and a member of the board at Boston College High School, for portraying him as callous and indifferent to the scandal. Dunn says he was immediately aware of the issues involved and worked to respond after viewing the film. Two of the Globe reporters depicted in the film, Walter Robinson and Sacha Pfeiffer, issued a statement in response to Dunn, firmly standing by their recollections of the day, that Dunn did \"his best to frame a story in the most favorable way possible for the institution he is representing. That's what Jack did that day.\" They said Dunn mounted a \"spirited public relations defense of Boston College High School during our first sit-down interview at the school in early 2002,\" the scene in which Dunn is depicted.\r\nOn March 15, 2016, Open Road Films released a statement on how Dunn was portrayed in the film: \"As is the case with most movies based on historical events, Spotlight contains fictionalized dialogue that was attributed to Mr. Dunn for dramatic effect. We acknowledge that Mr. Dunn was not part of the Archdiocesan cover-up. It is clear from his efforts on behalf of the victims at BC High that he and the filmmakers share a deep, mutual concern for victims of abuse.\" Dunn then also released a statement: \"I feel vindicated by the public statement and relieved to have the record set straight on an issue that has caused me and my family tremendous pain. While it will never erase the horrific experience of being falsely portrayed in an Academy Award-winning film, this public statement enables me to move forward with my reputation and integrity intact.\"\r\nAccolades\r\nSpotlight has been critically acclaimed, and has been included in many critics' Top Ten Films of 2015 lists. The film has received over 100 industry and critics awards and nominations. The American Film Institute selected Spotlight as one of the Top Ten Films of the year. The film garnered three Golden Globe Award nominations for Best Motion Picture – Drama, Best Director for McCarthy, and Best Screenplay for McCarthy and Josh Singer. It was nominated for five Independent Spirit Awards, including Best Feature, Best Director, Best Screenplay for Singer, Best Editing for Tom McArdle and Honorary Robert Altman Award for the cast. Rachel McAdams and the ensemble cast received nominations for the Outstanding Performance by a Female Actor in a Supporting Role and the Outstanding Performance by a Cast in a Motion Picture respectively, with the cast winning the latter.\r\nThe New York Film Critics Circle awarded Michael Keaton the Best Actor award, while it won the Best Picture, Best Director, Best Screenplay and Best Ensemble cast at the New York Film Critics Online Awards. Spotlight won the Best Film and Best Screenplay from the Los Angeles Film Critics Association. It received eight nominations from the Broadcast Film Critics Association, including Best Film, Best Director, Best Supporting Actor, Best Supporting Actress, Best Screenplay and Best Score. It won the Best Cast in a Motion Picture at Satellite Awards and was nominated for six other awards including Best Film, Best Director, Best Supporting Actor, Best Supporting Actress and Best Original Screenplay.\r\nAt the Academy Awards, the film received six nominations, including Best Picture, Best Director, Best Supporting Actor for Ruffalo, Best Supporting Actress for McAdams, Best Original Screenplay, and Best Film Editing, winning Best Picture and Best Original Screenplay. It is the first Best Picture winner to win fewer than three Academy Awards since 1952's The Greatest Show on Earth. At the time of its win, the film had made $39.2 million at the North American box office, which made it the second lowest domestically grossing film (adjusted for ticket-price inflation) to win Best Picture within the past four decades (after The Hurt Locker with $17 million).\r\nSpotlight was listed on over 120 critics' and publications' top ten lists.\r\nIt was also voted the 88th greatest film since 2000 in an international critics' poll conducted by BBC. In 2018, IndieWire writers ranked its screenplay the 12th best American screenplay of the 21st century, with Kate Erbland saying that the script \"ticks along so well, not cutting any corners when it comes to the nitty gritty of real-world reporting, while also finding time to develop its characters and tell a banger of a story. It hits the right beats, but it does so in earned ways, rooted in realism\".",
    "html": "<p>Spotlight is a 2015 American biographical drama film directed by Tom McCarthy and written by McCarthy and Josh Singer. The film follows The Boston Globe's \"Spotlight\" team, the oldest continuously operating newspaper investigative journalist unit in the United States, and its investigation into cases of widespread and systemic child sex abuse in the Boston area by numerous Catholic priests. Although the plot was original, it is loosely based on a series of stories by the Spotlight team that earned The Globe the 2003 Pulitzer Prize for Public Service. The film features an ensemble cast including Mark Ruffalo, Michael Keaton, Rachel McAdams, John Slattery, and Stanley Tucci, with Brian d'Arcy James, Liev Schreiber, and Billy Crudup in supporting roles.</p><p>Spotlight was shown in the Out of Competition section of the 72nd Venice International Film Festival, the Telluride Film Festival and the Special Presentations section of the 2015 Toronto International Film Festival. It was released on November 6, 2015, by Open Road Films and grossed $98 million worldwide. It received widespread critical praise, with critics lauding the performances of the cast, historical accuracy and screenplay; it won numerous guilds' and critics' association awards, and was named one of the best films of 2015 by various publications. Spotlight won the Academy Award for Best Picture, along with Best Original Screenplay, from six total nominations, making it the first Best Picture winner since The Greatest Show on Earth (1952) to win only one other Oscar. The film also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.</p><br/><h3>Plot</h3><p>In 1976, at a Boston Police station, two policemen discuss the arrest of Fr. John Geoghan for child molestation. A high-ranking cleric talks to the mother of the children. An assistant district attorney then enters the precinct and tells the policemen not to let the press learn what has happened. The arrest is not publicized and Geoghan is released.</p><p>In 2001, Marty Baron, the new managing editor of The Boston Globe, meets Walter \"Robby\" Robinson, the editor of the newspaper's \"Spotlight\" investigative team. After Baron reads a Globe article about a lawyer, Mitchell Garabedian, charging that Cardinal Bernard Law, the Archbishop of Boston, knew about Geoghan's sexual abuse of children and did nothing to stop it, Baron urges the Spotlight team to investigate. Journalist Michael Rezendes contacts Garabedian, who initially declines to be interviewed. Though he is told not to, Rezendes reveals that he is on the Spotlight team and convinces Garabedian to talk.</p><p>Initially believing that they are following the story of one priest who was moved to new assignments several times, the Spotlight team begin to uncover a pattern of sexual abuse by other priests in Massachusetts and an ongoing cover-up by the Boston Archdiocese. Through Phil Saviano, who heads the victims' rights group Survivors Network of those Abused by Priests (SNAP), the team is led to widen their search to thirteen priests. Richard Sipe, a former priest who worked to rehabilitate sexually abusive priests, tells them that his studies suggest that there are approximately 90 abusive priests in Boston (6% of priests). Through their research, the team develops a list of 87 names and begin to find victims to back up their suspicions.</p><p>As the team realizes the sheer scale of the investigation, it begins to take a toll on their lives: reporter Matt Carroll learns one of the priest rehabilitation centers is on the same block as his family's home but cannot tell his children or his neighbors to avoid spoiling the story; reporter Sacha Pfeiffer finds herself unable to attend church with her grandmother; Rezendes pushes to get the story out quickly to prevent further abuse; and Robinson faces pushback from some of his close friends who he learns were complicit in covering up the abuse.</p><p>When the September 11 attacks occur, the team is forced to de-prioritize the story. They regain momentum when Rezendes learns from Garabedian that there are publicly available documents that confirm Cardinal Law was made aware of the abuse and ignored it. Although Rezendes argues vociferously to run the story immediately, before more victims suffer and rival newspapers publish comparable articles, Robinson steadfastly refuses, arguing the team needs to research further so that the systemic problem can be more fully exposed. After the Globe wins a case to have even more legal documents unsealed that provide the evidence of that larger picture, the Spotlight team finally begins to write the story and plan to publish their findings in early 2002.</p><p>As they are about to go to print, Robinson admits that he learned during the investigation that he was sent a list of 20 sexually abusive priests by lawyer Eric MacLeish in 1993, on which Robinson never followed up. Baron still commends Robinson and the Spotlight team's efforts to expose the crimes now. The story goes to print with a weblink to the documents that expose Law's inaction and a phone number for victims of abusive priests. The next morning, the team is inundated with calls from victims coming forward to tell their stories.</p><p>A textual epilogue notes that Law resigned in December 2002 and was eventually promoted to the Basilica di Santa Maria Maggiore in Rome, and presents a list of 105 U.S. communities and 101 others around the world where major scandals involving abuse by priests have taken place.</p><br/><h3>Cast</h3><ul><li>Mark Ruffalo as Michael Rezendes</li><li>Michael Keaton as Walter \"Robby\" Robinson</li><li>Rachel McAdams as Sacha Pfeiffer</li><li>Brian d'Arcy James as Matt Carroll</li></ul><ul><li>Liev Schreiber as Marty Baron</li><li>John Slattery as Ben Bradlee Jr.</li></ul><ul><li>Stanley Tucci as Mitchell Garabedian, an attorney representing victims of sexual abuse</li><li>Gene Amoroso as Stephen Kurkjian, Boston Globe general investigative reporter</li><li>Jamey Sheridan as Jim Sullivan, an attorney representing the Church</li><li>Billy Crudup as Eric MacLeish, an attorney representing victims of sexual abuse</li><li>Maureen Keiller as Eileen McNamara, Boston Globe columnist</li><li>Richard Jenkins as Richard Sipe, psychotherapist (telephone voice, uncredited)</li><li>Paul Guilfoyle as Peter Conley</li><li>Len Cariou as Cardinal Bernard Law, Archbishop of Boston</li><li>Neal Huff as Phil Saviano of SNAP</li><li>Michael Countryman as Richard Gilman, publisher of the Boston Globe</li><li>Michael Cyril Creighton as Joe Crowley</li><li>Laurie Heineman as Judge Constance Sweeney</li><li>David Fraser as John Albano</li><li>Tim Progosh as Principal Bill Kemeza</li><li>Jimmy LeBlanc as Patrick McSorley</li></ul><br/><h3>Production</h3><h4>Writing</h4><p>The film was written by Tom McCarthy and co-writer Josh Singer. When McCarthy was asked how he and his co-author tackled the research and writing process, he said:</p><blockquote>As I said, I passed the first time! That's probably some indication of how intimidating it was. But I think, as always, with any big assignment, once you get over that initial shock and awe of how much material there was to cover, you start digging into the material and become really fascinated by and engaged with it, and we did. And yeah, it was a lot of work, but it was exciting work. It was really interesting work, parsing through details of not just the investigation, but its findings, and trying to determine what was most helpful in telling our story. I think having two brains on it was somewhat helpful too, because we could talk through it a lot. So it wasn't just sitting alone in a room and jotting notes. We were dialoguing a lot about it. That particular collaboration did feel investigative and on some level, seemed to parallel some of the collaboration of the reporters in that investigation. So, I think there was something about our collaboration that made that initial process more palatable on some level.</blockquote><h4>Development</h4><p>McCarthy and Singer completed the script in June 2013. It was on the 2013 Black List of unproduced screenplays. Singer told Creative Screenwriting that one of his goals for the film was to highlight the power of journalism, which he feels has been waning. He explained, \"This story isn't about exposing the Catholic Church. We were not on some mission to rattle people's faith. In fact, Tom came from a Catholic family. The motive was to tell the story accurately while showing the power of the newsroom—something that's largely disappeared today. This story is important. Journalism is important, and there is a deeper message in the story.\"</p><h4>Filming</h4><p>Principal photography began on September 24, 2014, in Boston, Massachusetts, and continued in October in Hamilton, Ontario. Filming took place at Fenway Park, the then-current Boston Globe offices in Dorchester, Boston, the Boston Public Library, and McMaster University in Hamilton, Ontario. The film's editor Tom McArdle said of the post-production process, \"We edited for eight months. We just wanted to keep refining the film. We cut out five scenes plus some segments of other scenes. Often we would just cut out a line or two to make a scene a little tighter.\" The Boston Police station depicted in the opening scene was filmed in Toronto at the former Toronto Police Service 11 Division station at 209 Mavety Street, and the former Sears building on Islington Avenue in Toronto was converted into a replica of the interior of the old Boston Globe, where the bulk of the filming took place. The brief scene in which Rezendes watches a children's church choir perform \"Silent Night\" was filmed in St. Basil's Church (Toronto), a Roman Catholic church on the University of Toronto campus.</p><h4>Historical accuracy</h4><p>The visual blog Information is Beautiful deduced that, while taking creative license into account, the film was 76.2% accurate when compared to real-life events, summarizing that \"the only conceits are scenes of power figures warning off the journalists\".</p><ul><li>The film only depicts the events leading up to the publication of the Spotlight team's first article, whereas the team actually continued publishing follow-up reports for nearly two years afterward. As a result, certain events are depicted as having happened earlier than they actually did, including the scene where former priest Ronald H. Paquin freely admits to molesting children and having been molested himself.</li><li>While Sacha Pfeiffer did indeed write the numerous follow-up reports on Paquin, the interview depicted in the film was a blend of two interviews conducted by her and Steve Kurkjian, both of which took place about a month after the events in the film. After the first story was published, Kurkjian rejoined the Spotlight team (he had been a founding member before becoming the Globe's Washington bureau chief) to assist with further reporting on the abuses. Pfeiffer and Kurkjian have said that the confession was a much more gradual process and Paquin did not just \"blurt it out\" the way he does in the film.</li><li>A scene where Matt Carroll discovers one of the priest treatment centers is down the block from where he lives is based on an actual discovery he made during the investigation, with one minor detail changed: Carroll actually lived down the street from John Geoghan, the priest whose case sparked the investigations. This was changed as the filmmakers thought the image of Carroll putting Geoghan's photo on his refrigerator to warn his children would seem unrealistic.</li><li>In a subplot, Eric MacLeish claims he sent a list of 20 priests to the Globe in 1993 but the story was buried in Metro: Robinson later admits he was the editor for Metro at the time and he likely overlooked the case. While the Globe did publish an article about the list of 20 priests, the Spotlight team did not learn this during their investigation. MacLeish himself revealed the article's existence while being interviewed for the screenplay by McCarthy and Singer. This revelation, along with Robinson's response to the filmmakers' inquiry, was incorporated into the screenplay for dramatic purposes.</li></ul><br/><h3>Release</h3><p>The film \"premiered to sustained applause\" at the Venice Film Festival and the audience \"erupted in laughter\" when the film reported that following the events in the film Cardinal Bernard Law was reassigned to a senior position of honor in Rome. It had a limited release on November 6, 2015, with its U.S. release scheduled for three weeks later on November 25.</p><h4>Home media</h4><p>Spotlight was released by Universal Studios Home Entertainment on DVD and Blu-ray in the United States on February 23, 2016.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Spotlight grossed $45.1 million in the United States and Canada and $53.2 million in other countries for a worldwide total of $98.3 million, against a production budget of $20 million. The Hollywood Reporter calculated the film made a net profit of up to $10 million.</p><p>In the opening weekend of its limited release, the film grossed $295,009 from five theaters ($59,002 average), one of the highest per-screen averages of any release of 2015. The film grossed $4.4 million in the first weekend during its wide release, finishing 8th at the box office.</p><h4>Critical response</h4><p>Spotlight received critical acclaim. The review aggregator website Rotten Tomatoes gave the film an approval rating of 97% based on 376 reviews, with an average rating of 8.80/10. The website's summary of the critical consensus is that \"Spotlight gracefully handles the lurid details of its fact-based story while resisting the temptation to lionize its heroes, resulting in a drama that honors the audience as well as its real-life subjects.\" On Metacritic, the film has a score of 93 out of 100, based on 45 critics, indicating \"universal acclaim.\"</p><p>Variety's Justin Chang called the film \"a superbly controlled and engrossingly detailed account of the Boston Globe's Pulitzer Prize-winning investigation into the widespread pedophilia scandals and subsequent cover-ups within the Catholic Church.\" Joe Morgenstern of The Wall Street Journal wrote, \"To turn a spotlight fittingly on Spotlight, it's the year's best movie so far, and a rarity among countless dramatizations that claim to be based on actual events.\" Mark Kermode of The Guardian gave it 4 out of 5 stars and praised Ruffalo's performance, writing, \"As for Mark Ruffalo, he's the closest thing this ensemble cast has to a star turn, a long-suppressed outburst of emotion providing one of the film's few grandstanding showstoppers.\" Helen O'Hara of Empire gave the movie 4 out of 5 stars and called it a \"grown-up film about serious people that mercifully escapes any awards-grabbing platitudes\" and \"more thrilling than most action movies.\" Richard Propes of The Independent Critic gave Spotlight 4 out of 4 marks and praised the screenplay and cast: \"Spotlight is a nearly perfect example of what happens when the perfect filmmaker works with the perfect script and acquires the perfect cast and crew to bring a story to life\".</p><p>At the 2015 Toronto International Film Festival, Spotlight finished third in the audience balloting for the People's Choice Award.</p><p>Comparing Spotlight to The Post, a similar period film about journalists, critic Matt Zoller Seitz of RogerEbert.com expressed perplexity over critics' muted praise for the latter film, writing that in terms of direction, Spotlight \"got praise for doing a tenth of what Steven Spielberg does here\".</p><h4>Top ten lists</h4><p>Spotlight was included on many critics' top-ten lists.</p><ul><li>1st – Peter Travers, Rolling Stone</li><li>1st – Christoper Orr, The Atlantic</li><li>1st – Bill Goodykoontz, Arizona Republic</li><li>1st – Lou Lumenick, New York Post</li><li>1st – Rex Reed, New York Observer</li><li>1st – Ty Burr, Boston Globe</li><li>1st – Michael Phillips, Chicago Tribune</li><li>1st – Stephanie Zacharek, Time</li><li>1st – Ann Hornaday, The Washington Post</li><li>1st – Kate Erbland, Indiewire</li><li>1st – Joe Morgenstern, Wall Street Journal</li><li>2nd – Peter Debruge, Variety</li><li>2nd – Christy Lemire, RogerEbert.com</li><li>3rd – Scott Feinberg, The Hollywood Reporter</li><li>3rd – Rene Rodriguez, Miami Herald</li><li>3rd – Inkoo Kang, TheWrap</li><li>3rd – James Berardinelli, Reelviews</li><li>3rd – Richard Lawson, Vanity Fair</li><li>3rd – J.R. Jones, Chicago Reader</li><li>3rd – A.O. Scott and Stephen Holden, The New York Times</li><li>4th – Jake Coyle, Associated Press</li><li>4th – Connie Ogle, Miami Herald</li><li>4th – Josh Kupecki, Austin Chronicle</li><li>5th – Anne Thompson, IndieWire</li><li>5th – Kristopher Tapley, Variety</li><li>5th – Mick LaSalle, San Francisco Chronicle</li><li>6th – David Edelstein, New York Magazine</li><li>6th – Joshua Rothkopf, Time Out New York</li><li>7th – Justin Chang, Variety</li><li>8th – Richard Roeper, Chicago Sun-Times</li><li>9th – Alonso Duralde, TheWrap</li><li>10th – Alison Willmore, BuzzFeed</li><li>10th – Tom Brook, BBC</li><li>10th – Kyle Smith, New York Post</li><li>Top 10 (listed alphabetically, not ranked) – Stephen Whitty, The Star-Ledger</li><li>Top 10 (listed alphabetically, not ranked) – Dana Stevens, Slate.com</li><li>Top 10 (listed alphabetically) – Steven Rea, Philadelphia Inquirer</li><li>Best of 2015 (listed alphabetically, not ranked) – Kenneth Turan, Los Angeles Times</li></ul><h4>Reactions from the Catholic Church</h4><p>In general, the film was positively received by the Catholic community. Before its release, Cardinal Sean O'Malley of the Archdiocese of Boston issued a statement in the archdiocese's official newspaper, stating that the \"media's investigative reporting on the abuse crisis instigated a call for the Church to take responsibility for its failings and to reform itself—to deal with what was shameful and hidden.\" O'Malley had not seen the movie at that time but planned to do so.</p><p>On November 9, 2015, a review in the Catholic News Service called the film a \"generally accurate chronicle\" of the Boston scandal, but objected to some of the portrayals and the film's view of the Church. On the Catholic News Service, auxiliary bishop of Los Angeles Robert Barron said that it is \"not a bad movie\", as it shows how the wider community shares the responsibility for sexual abuse committed by priests, but that the film is wrong to insinuate that the Church has not reformed.</p><p>Vatican Radio, the official radio service of the Holy See, called it \"honest\" and \"compelling\" and said it helped the U.S. Catholic Church \"to accept fully the sin, to admit it publicly, and to pay all the consequences.\" Luca Pellegrini on the Vatican Radio website wrote that the Globe reporters \"made themselves examples of their most pure vocation, that of finding the facts, verifying sources, and making themselves—for the good of the community and of a city—paladins of the need for justice.\" In February 2016, a Vatican City commission on clerical sex abuse attended a private screening of the film. Following the film's Best Picture win at the Oscars, Vatican newspaper L'Osservatore Romano ran a column assuring that it is \"not an anti-Catholic film\", and Vatican Radio revealed that clerics in Rome have been recommending the film to each other.</p><h4>Criticism</h4><p>A January 8, 2016, article in The New York Times cited author David F. Pierre Jr., who said that Spotlight \"is a misrepresentation of how the Church dealt with sexual abuse cases\", asserting that the movie's biggest flaw was its failure to portray psychologists who had assured Church officials that abusive priests could be safely returned to ministry after undergoing therapy treatments. Open Road Films rebutted the detractor, saying he was \"perpetuating a myth in order to distract from real stories of abuse.\"</p><p>The film was attacked by Jack Dunn (played by Gary Galone), the public relations head and a member of the board at Boston College High School, for portraying him as callous and indifferent to the scandal. Dunn says he was immediately aware of the issues involved and worked to respond after viewing the film. Two of the Globe reporters depicted in the film, Walter Robinson and Sacha Pfeiffer, issued a statement in response to Dunn, firmly standing by their recollections of the day, that Dunn did \"his best to frame a story in the most favorable way possible for the institution he is representing. That's what Jack did that day.\" They said Dunn mounted a \"spirited public relations defense of Boston College High School during our first sit-down interview at the school in early 2002,\" the scene in which Dunn is depicted.</p><p>On March 15, 2016, Open Road Films released a statement on how Dunn was portrayed in the film: \"As is the case with most movies based on historical events, Spotlight contains fictionalized dialogue that was attributed to Mr. Dunn for dramatic effect. We acknowledge that Mr. Dunn was not part of the Archdiocesan cover-up. It is clear from his efforts on behalf of the victims at BC High that he and the filmmakers share a deep, mutual concern for victims of abuse.\" Dunn then also released a statement: \"I feel vindicated by the public statement and relieved to have the record set straight on an issue that has caused me and my family tremendous pain. While it will never erase the horrific experience of being falsely portrayed in an Academy Award-winning film, this public statement enables me to move forward with my reputation and integrity intact.\"</p><br/><h3>Accolades</h3><p>Spotlight has been critically acclaimed, and has been included in many critics' Top Ten Films of 2015 lists. The film has received over 100 industry and critics awards and nominations. The American Film Institute selected Spotlight as one of the Top Ten Films of the year. The film garnered three Golden Globe Award nominations for Best Motion Picture – Drama, Best Director for McCarthy, and Best Screenplay for McCarthy and Josh Singer. It was nominated for five Independent Spirit Awards, including Best Feature, Best Director, Best Screenplay for Singer, Best Editing for Tom McArdle and Honorary Robert Altman Award for the cast. Rachel McAdams and the ensemble cast received nominations for the Outstanding Performance by a Female Actor in a Supporting Role and the Outstanding Performance by a Cast in a Motion Picture respectively, with the cast winning the latter.</p><p>The New York Film Critics Circle awarded Michael Keaton the Best Actor award, while it won the Best Picture, Best Director, Best Screenplay and Best Ensemble cast at the New York Film Critics Online Awards. Spotlight won the Best Film and Best Screenplay from the Los Angeles Film Critics Association. It received eight nominations from the Broadcast Film Critics Association, including Best Film, Best Director, Best Supporting Actor, Best Supporting Actress, Best Screenplay and Best Score. It won the Best Cast in a Motion Picture at Satellite Awards and was nominated for six other awards including Best Film, Best Director, Best Supporting Actor, Best Supporting Actress and Best Original Screenplay.</p><p>At the Academy Awards, the film received six nominations, including Best Picture, Best Director, Best Supporting Actor for Ruffalo, Best Supporting Actress for McAdams, Best Original Screenplay, and Best Film Editing, winning Best Picture and Best Original Screenplay. It is the first Best Picture winner to win fewer than three Academy Awards since 1952's The Greatest Show on Earth. At the time of its win, the film had made $39.2 million at the North American box office, which made it the second lowest domestically grossing film (adjusted for ticket-price inflation) to win Best Picture within the past four decades (after The Hurt Locker with $17 million).</p><p>Spotlight was listed on over 120 critics' and publications' top ten lists.</p><p>It was also voted the 88th greatest film since 2000 in an international critics' poll conducted by BBC. In 2018, IndieWire writers ranked its screenplay the 12th best American screenplay of the 21st century, with Kate Erbland saying that the script \"ticks along so well, not cutting any corners when it comes to the nitty gritty of real-world reporting, while also finding time to develop its characters and tell a banger of a story. It hits the right beats, but it does so in earned ways, rooted in realism\".</p><br/>"
  },
  "errorMessage": ""
}