{
  "imDbId": "tt10272386",
  "title": "The Father",
  "fullTitle": "The Father (2020)",
  "type": "Movie",
  "year": "2020",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/father-review-1273990/",
      "rate": "100",
      "content": "The best film about the wages of aging since Amour eight years ago, The Father takes a bracingly insightful, subtle and nuanced look at encroaching dementia and the toll it takes on those in close proximity to the afflicted."
    },
    {
      "publisher": "Film Threat",
      "author": "Alex Saveliev",
      "link": "",
      "rate": "100",
      "content": "The Father is about the suffering of old age, the importance of connection, the sick encroaching of an affliction, and ultimately, death. It doesn’t sugarcoat things, despite its sugarcoated exterior. Like its French counterpart, Michael Haneke’s Amour, it’s not an easy watch, but it’s a necessary one, a film that examines the very essence of our humanity."
    },
    {
      "publisher": "Vanity Fair",
      "author": "Richard Lawson",
      "link": "https://www.vanityfair.com/hollywood/2020/01/anthony-hopkins-the-father-review",
      "rate": "90",
      "content": "The Father is an act of understanding, radical in its toughness and its generous artistry."
    },
    {
      "publisher": "Variety",
      "author": "Owen Gleiberman",
      "link": "https://variety.com/2020/film/reviews/the-father-review-anthony-hopkins-olivia-colman-1203482695/",
      "rate": "90",
      "content": "The Father is a chamber piece, but it has the artistic verve to keep twisting the reality it shows us without becoming a stunt."
    },
    {
      "publisher": "The Film Stage",
      "author": "Matt Cipolla",
      "link": "",
      "rate": "83",
      "content": "For a movie that follows a character’s perspective while remaining aware of his shortcomings, The Father marks a modest and involved debut from Zeller."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/criticism/movies/the-father-review-sundance-1202206812/",
      "rate": "83",
      "content": "The Father exists for no discernible reason other than to render an inexplicably cruel element of the human condition in a recognizable way, and to do so in a way that only good art can."
    },
    {
      "publisher": "The A.V. Club",
      "author": "A.A. Dowd",
      "link": "https://www.avclub.com/anthony-hopkins-delivers-the-most-heartbreaking-perform-1845909578",
      "rate": "83",
      "content": "Hopkins methodically strips away every quality we’ve come to expect from him—the refinement, the silver tongue, the imposing intensity he lent Lecter and Nixon and Titus—until there’s nothing left but frailty and distress. In doing so, he helps convey the full tragedy and horror of dementia: the way it can make someone almost unrecognizable to themselves and their loved ones."
    },
    {
      "publisher": "The Guardian",
      "author": "Benjamin Lee",
      "link": "https://www.theguardian.com/film/2020/jan/27/the-father-review-anthony-hopkins-olivia-colman",
      "rate": "80",
      "content": "It’s a difficult, often quite brutal, viewing experience, as it needs to be given the subject matter, not only because of the fractured storytelling but because of the devastating lead performance from Hopkins."
    },
    {
      "publisher": "Screen Daily",
      "author": "Tim Grierson",
      "link": "https://www.screendaily.com/reviews/the-father-sundance-review/5146593.article",
      "rate": "80",
      "content": "On the whole, The Father incorporates what could have just been a storytelling gimmick and infuses it with such sorrow, grace and even the occasional dark joke that it becomes a profound exploration of how we say goodbye to someone dear to us — even though they have not yet really gone."
    },
    {
      "publisher": "The Playlist",
      "author": "Gregory Ellwood",
      "link": "",
      "rate": "75",
      "content": "Despite the efforts of Hopkins and an outstanding ensemble, Zeller can’t divorce his feature directorial debut from its theatrical origins."
    }
  ],
  "errorMessage": ""
}