{
  "imDbId": "tt10272386",
  "title": "The Father",
  "fullTitle": "The Father (2020)",
  "type": "Movie",
  "year": "2020",
  "items": [
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw7189051",
      "warningSpoilers": false,
      "date": "2 August 2021",
      "rate": "",
      "helpful": "207 out of 219 found this helpful.",
      "title": "A look at dementia from the opposite angle.",
      "content": "This movie was shot in May 2019 just a few months before the COVID-19 pandemic was recognized. The writer-director says he wrote this with Anthony Hopkins, who was 81, in mind. The movie has a number of well established actors but the story's impact depends on Hopkins and he achieves this as very few might be able to do.Usually movies dealing with aging and dementia depict it from the points of view of all the others around, friends, family members, medical personnel. This does the opposite, it depicts it from the point of view of the afflicted person. As such I found myself totally confused after about 20 minutes but eventually understood why it had to be this way. We are seeing what Anthony (character's name) sees and experiences, the confusion as to where he is and his failure to recognize people he knows.In many ways this is a hard movie to watch because we know people who have gone through dementia and its inevitable end, or know people who are in the early stages of it. For that reason my wife chose not to watch this movie.For the subject matter it is a very good movie."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw6811026",
      "warningSpoilers": true,
      "date": "13 April 2021",
      "rate": "9",
      "helpful": "149 out of 158 found this helpful.",
      "title": "\"I don't know what's happening anymore.\"",
      "content": "This movie brings you inside the mind of someone losing their memories and recognition of those around them. In another genre, what happens here could just as well take place in a horror film. The fascinating thing about the story as it unfolds is that as the viewer, there comes a point where you begin to question whether what you're seeing is what the principal character is experiencing, or whether it's a figment of Anthony's (Anthony Hopkins) imagination. The distinction between his reality and the reveries that make up his daily existence sort of blend together in a way that confound the senses. Hopkins is extraordinary in the role, and if this is his last chance to earn an Oscar for Best Actor, then it's a darn good one in a field with some significant competition. Olivia Colman as Anthony's struggling daughter expresses all the concern and frustration that comes with being the primary caregiver for her dementia stricken father, and there are somber moments in the picture when you want to cry along with her over the hopelessness of both his and her situation. As a harbinger of what might happen to anyone as we all approach those senior twilight years, the film can be a depressing experience, only somewhat mitigated by the care and concern that dedicated health care workers are able to provide in an institutional setting. As tender and comforting as the closing scene is, it's one that will break the heart of anyone who's been through a similar experience."
    },
    {
      "username": "waltermwilliams",
      "userUrl": "https://www.imdb.com/user/ur65497206",
      "reviewLink": "https://www.imdb.com/review/rw6805659",
      "warningSpoilers": false,
      "date": "12 April 2021",
      "rate": "10",
      "helpful": "189 out of 200 found this helpful.",
      "title": "So close to perfect and so personal",
      "content": "This is one of the hardest movie reviews I've ever had to write in my life.Mainly because of the films subject matter, Dementia.I've seen my own father succumb to this dreaded disease and it scares the hell out of my, worse than any horror movie I've watched.I sadly remember some of the last words my own father spoke to me were, \"Be a good boy at School today.\" I was 46 at the time.The beauty of \"The Father\" is how Director, Florian Zeller, takes you into this descent of losing your grip on reality through the eyes of the marvellous veteran and Academy Award wining actor, Sir Anthony Hopkins.At times his character Anthony is part Hannibal Lecter and at others a peaceful, but confused ageing Father to Olivia Colmans, Anne.Another Academy Award winner who puts in a highly believable performance as his daughter who's trying to deal with helping a man who refuses to accept assistance from her or carers.Fun Fact: Colman was named Anne is both roles she's been Oscar nominated for.Also great supporting roles form Mark Gatiss, Olivia Williams, Imogen Poots and Rufus Sewell.Overall \"The Father\" has been nominated for 6 Oscars, after already having over 20 wins in other awards and once you've seen this film you'll know why it deserves to win in Hollywood.At 83, Hopkins, is the oldest winner of a Best Male Actor BAFTA and a dark horse to scoop up the big one.This film feels like everything he has learnt in his craft is on display effortlessly for 97 minutes.It's hard to believe this is Zellers' feature film directorial debut, because it's a masterclass in cinema adapted from his own acclaimed play \"Le Pere\" from 2012.The role of Anthony was specifically written for Hopkins.One of the things that got the living legend to agree to this film apart from the top shelf script (adapted by Christopher Hampton) was the inclusion of one of Hopkins favourite pieces of music from Georges Bizet Opera \"The Pearl Fishers\".He's always dreamt of making a movie with this music in it.With lines from Anthony like: \"I feel as if I'm losing all my leaves\" \"The Father\" is so close to perfect I'm giving it 10 stars."
    },
    {
      "username": "neil-476",
      "userUrl": "https://www.imdb.com/user/ur7813355",
      "reviewLink": "https://www.imdb.com/review/rw7079455",
      "warningSpoilers": true,
      "date": "1 July 2021",
      "rate": "9",
      "helpful": "71 out of 79 found this helpful.",
      "title": "Excellent but deeply upsetting",
      "content": "I cannot say what I want to say about this film without spoilers, so please don't read on if you want to find what happens in the film as it unfolds.Anthony lives in a flat in London. His daughter Anne calls in on him every day. She is upset and worried because Anthony has driven away another care worker, and Anne is about to move to Paris in a new relationship. Anne's husband indicates that the flat is Anne's, not Anthony's. Anne seems to be an entirely different person,, but then she is Anne again. Her husband is someone different though. Some conversations are repeated. Anthony initially charms, then verbally attacks, Laura, a potential new care worker who reminds him of his other daughter, Lucy, who never comes to see him.We realise early on that Anthony is in the grip of dementia, and through most of the piece, right up to the end, we are wondering hiw much of what we see is real, and how much is Anthony's disintegrating memory betraying him. Ultimately, we never know and it doesn't matter - despite it being very clear how destructive the impact of Anthony's dementia is on Anne (and possibly her busband - was she married? Was it a factor in the marriage breaking up?), what the film shows us is what it might be like inside the mind of someone whose foothold in the real world is increasingly unreliable.Anthony Hopkins wins a well-deserved 2nd Best Actor Oscar for a portrayal of a character who is initially unlikeable but, by the end, is almost literally a little lost boy. The rest of the cast are also excellent.Florian Zeller directs this adaptation of his own play (the adapted screenplay also won an Oscar). It is wise, sad, accurate and compassionate. If you and your family have never been touched by dementia then you may well marvel at the clever and kind telling of a worthwhile story, brought to life by a crew of supremely gifted artists.My family has been touched by dementia on a number of occasions.At different times, I saw in this film my grandparents, my mother-in-law, my wife, my father, my mother, my brother and myself, and all at times in our lives which could never be called happy. It struck very close to home, and I found it brutal."
    },
    {
      "username": "MOscarbradley",
      "userUrl": "https://www.imdb.com/user/ur1683855",
      "reviewLink": "https://www.imdb.com/review/rw6778864",
      "warningSpoilers": false,
      "date": "4 April 2021",
      "rate": "10",
      "helpful": "71 out of 82 found this helpful.",
      "title": "Hopkins has never been better.",
      "content": "I haven't seen the play on which \"The Father\" is based, (or indeed the other two plays in Florian Zeller's trilogy on the family), but as cinematic adaptations go this is as good as it gets. Taking place almost entirely on a single set, this is an actor's piece of the highest order and its linchpin is a magnificent performance from Anthony Hopkins as \"The Father\" of the title, a man suffering from advanced dementia and perhaps, both in Hopkins's performance and Zeller's treatment of the subject, this will come to be seen as the definitive film on dementia as anyone with personal experience can testify.Everything is seen through Hopkins' eyes. Olivia Coleman, (heartbreakingly good), is his daughter but there are other 'characters' who may or may not exist or rather, if they do exist, who are they or who does Hopkins perceive them to be? A man appears who says he's the daughter's husband but then the daughter has said she does not have a husband. Another woman comes in and says she's his daughter while another man appears and converses with Hopkins. Is he the husband? Is there a husband?I've already said that this is an actor's piece of the first order but it is also a writer's piece with Zeller adapting his own play with Christopher Hampton. It may be mystifying initially for just as characters turn up to confuse us so the film follows no chronological timespans. Events keep repeating themselves if they happen at all until we come to realise we are simply inside Hopkins' dishevelled mind and for Hopkins I think I can safely say that this is a career- best performance. The Oscar givers may ignore it but acting like this deserves more than prizes; it deserves to be seen."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8750114",
      "warningSpoilers": false,
      "date": "22 December 2022",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Hard to watch at times, but essential viewing.",
      "content": "Anthony refuses to accept any help from his daughter Anne, or any family members, Anthony's confusion increases, he's battling dementia.A powerhouse performance from Anthony Hopkins, this film is outstanding in almost every avenue. It came as no surprise that Hopkins was chosen for the part, he delivers a stellar performance, you'll feel Anthony's frustrations, hurt, and now and then you'll chuckle with him.If you know someone with, or have cared for someone that suffers with dementia, you will spot so many of the little signals and quirks here.This film is so incredibly realised, when you see dementia sufferers on the big screen, you normally get the view point of the friend or loved one affected by it, here you see the effect from the sufferer's point of view.There's a degree of originality about this film that sets it apart, it is without a doubt, one of the best films from the last two decades.10/10."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw7270700",
      "warningSpoilers": false,
      "date": "26 August 2021",
      "rate": "8",
      "helpful": "37 out of 42 found this helpful.",
      "title": "Most realistic movie about dementia.",
      "content": "The Father couldn't be more realistic when talking about Alzheimer's disease. I've seen my grandfather walking that path. He was a smart man but once the dementia kicked in he was barely recognizable, which was a hard thing to witness when you knew him as the intellectual he was. The Father just nailed this subject, bringing back so many memories, memories we would rather forget but that you can't. Living with a loved one with this disease isn't easy at all, certainly not when that person sometimes doesn't remember who you are. I didn't knew Anthony Hopkins won an Oscar for his role, but after watching this movie I can only say it's highly deserved. It's probably one of his better performances ever, and that at 83 years old. The Father isn't a movie that will give you a lot of joy, it's sad and scary but certainly worth watching. Nobody wants to have a loved one suffering from dementia, it's a nightmare to live with. I remember my grandfather starting to smoke a cigarette like it was a thing he always did and that whilst he stopped more than forty years ago. I remember him telling me he was going crazy after asking me the same question for the twentieth time in barely an hour. He knew it was all going downhill, he knew he was a burden to everybody, and that must hurt when you are still that little bit lucid to understand that. I watched several movies about dementia but this one is just the most realistic. It's sad but that's life, everybody should watch it so they can be prepared if the disease ever would hit a loved one."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6746261",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "9",
      "helpful": "100 out of 121 found this helpful.",
      "title": "Autumns Arrives & the Leaves Begin to Fall...",
      "content": "... the days get shorter, darkness encroaches, the past begins to fade and confusion reigns. A remarkable piece of cinema, profoundly performed and presented, both touching and terrifying and relevant - your own experience uniquely yours but one you'll never forget... until."
    },
    {
      "username": "Cineanalyst",
      "userUrl": "https://www.imdb.com/user/ur1888886",
      "reviewLink": "https://www.imdb.com/review/rw6953410",
      "warningSpoilers": false,
      "date": "22 May 2021",
      "rate": "8",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Demented Puzzle",
      "content": "Dementia is a terrible disease. It's not something I'm interested in seeing depicted on screen. I've already seen enough of that. \"Amour\" (2012), with it likewise being claustrophobically isolated to an apartment and although it involves a stroke, especially comes to mind. Anticipating it was a depressingly realistic slice-of-life drama, I wasn't enthusiastic about seeing this Awards-winner, \"The Father,\" from a playwright turned first-time movie director. Fortunately and surprisingly, I don't think it's that, and one would be well advised to see it before reading reviews for it, including this one. I'm not familiar with the writer-director's original play that this is an Anglicization of, \"Le Père,\" nor the French film already made of it, \"Floride\" (2015), so I don't know how much of it was always of design or if anything is original here. I mean, \"they don't even speak English there.\" Regardless, that \"The Father\" may come across as what I feared it was--and what others seem to discuss it as--is because we may forget genres when introduced to their entries in unpredictable ways. But, remember, \"The Father\" is a mind-game film, a puzzle picture.Think \"Fight Club,\" \"The Matrix\" (both 1999), \"A Beautiful Mind\" (2001), \"Shutter Island\" (2010), Charlie Kaufman, David Lynch, Christopher Nolan--movies that play games and are puzzles to put together. My go-to essay on this type of movie is \"The Mind-Game Film\" by Thomas Elsaesser. It lists six common motifs among such titles. I've already done this in my review of \"The Machinist\" (2004), but as remembered repetition is especially the name of the game in this case, I'll run through the list again, of which \"The Father,\" with its congruent case of dementia, may be diagnosed as checking every box. 1) the protagonist is involved in events whose meaning or consequences escape him. 2) He's mistaken about the difference between reality and his imagination and so are we. 3) He has imaginary friends. 4) He has an identity crisis--asking \"who am I and what is my reality?\" 5) He's not only unable to distinguish between different worlds, but is also not aware their might be parallel universes, nor are we, until the ultimate reveal. 6) He's persuaded by others that he's deluded, particularly as regards a child and past trauma.The novelty of \"The Father\" is that we know he has dementia, so when the picture is put into his perspective, we know present reality and memories might be mixed up, although it may still be difficult to distinguish. This is further complicated by briefly taking the point of view of the daughter or of the camera sharing subjectivity with no particular character. The greatest trick of all here being that the spectator might not even realize what kind of movie this is. It's all there, though, in its non-linear jigsaw puzzle of reality and illusion, past and present, one's own identity and those of others. Actors playing different roles depending on his confusion. The business with the other daughter. Clever stuff. I also like the allusions on the margins to other arts in painting and music, as well as that this maze of a mind comes from a retired engineer, or was he a dancer, or circus performer. And what wonderful use of its limited setting--as if everything takes place in an ever-changing flat. Despite what that would suggest and that it's an adaptation of a play, this isn't stagy at all. Well edited and photographed, too.The only other movie that comes to mind that deals this smartly with dementia is \"Still Alice\" (2014). In that case, it was reflexively about literature (implicitly \"Alice in Wonderland\") and acting. As there, with actors switching between characters, and back and forth in identity, it's vital that the performances be top notch. Fortunately, then, \"The Father\" stars Anthony Hopkins and Olivia Colman in Oscar-winning and Oscar-nominated roles, respectively, as well as a capable supporting cast. Olivia Williams is especially well cast, including for passing similarities in appearance to Colman. There's too much mental misery and the hardships of aging in the outside world, so don't forget this is a movie."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw6933321",
      "warningSpoilers": false,
      "date": "17 May 2021",
      "rate": "9",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Superb: intriguing, haunting, thought-provoking and moving",
      "content": "After his previous carer leaves the daughter of an octogenarian, Anthony, organises a new carer for him. However, to Anthony everything is confusion: faces change, one day his daughter Anne is moving to Paris, the next day she's not, is this his flat or not? And why doesn't his other daughter visit him anymore?Brilliant. An absorbing, sensitive-yet-jarring look into what a person living with dementia or similar must go through plus what those that love them and care for them must experience. Told in a very intriguing and compelling manner: nothing is signposted, everything unfolds in a layered altered-reality fashion, making you figure things out for yourself.Quite haunting and thought-provoking, as that could be you one day, or someone you love. Incredibly emotional too as you think about this affects his loved ones, the life he's lived and that this is what it now amounts to.Incredible performance by Anthony Hopkins in the lead role. While the plot and direction are fantastic the film needed an excellent performance as Anthony and that's what Hopkins does, absolutely nailing it. He well deserved his Best Actor Oscar.Great supporting cast: Olivia Colman (who got a Best Supporting Actress nomination for her efforts), Rufus Sewell, Olivia Williams, Imogen Poots and Mark Gatiss."
    },
    {
      "username": "sinefilcinephile",
      "userUrl": "https://www.imdb.com/user/ur99671420",
      "reviewLink": "https://www.imdb.com/review/rw6775695",
      "warningSpoilers": false,
      "date": "3 April 2021",
      "rate": "10",
      "helpful": "172 out of 188 found this helpful.",
      "title": "Brilliant...",
      "content": "Give Anthony Hopkins the Oscar on April 26. He gives you the best performance of the decade. An old man with dementia loses his ties to reality. His mind deteriorates, and reality stops making any sense. This movie will haunt you, especially if you have a relative with dementia. Such a heartbreaking movie. ABSOLUTELY the best movie of the year and the best performance of the year by Hopkins."
    },
    {
      "username": "Gordon-11",
      "userUrl": "https://www.imdb.com/user/ur0035842",
      "reviewLink": "https://www.imdb.com/review/rw6781478",
      "warningSpoilers": false,
      "date": "5 April 2021",
      "rate": "",
      "helpful": "37 out of 44 found this helpful.",
      "title": "Expertly crafted",
      "content": "Wow. This story is expertly crafted that I just don't know what is real and what isn't. Amazing acting too."
    },
    {
      "username": "isaacsundaralingam",
      "userUrl": "https://www.imdb.com/user/ur40254989",
      "reviewLink": "https://www.imdb.com/review/rw6779619",
      "warningSpoilers": false,
      "date": "4 April 2021",
      "rate": "10",
      "helpful": "43 out of 49 found this helpful.",
      "title": "Probably the only movie I've seen that discusses aging and dementia in any meaningful capacity",
      "content": "One of my all time favorite movies is Charlie Kaufman's Synecdoche, New York which narrates the ever deteriorating world around a playwright bordering on reality and insanity. And Florian Zeller's The Father is the closest I've seen that captures the insanity of the decaying mind, but told through the apparatus of a very real and universal issue.The movie was unsettling from start to finish... in the best way possible. It's one that shows the unstable world around the aging Anthony, but with the underlying vigilance that what's \"wrong\" is not necessarily the world around him. And the horror of one's rationality clinging on to his very last bit of sanity is shown in the most surprisingly human way possible, and it's what makes The Father one of the finest movies of the year.Special credits to stars Anthony Hopkins and Olivia Colman, who undoubtedly make the movie as every bit emotional and human. And Hopkins' performance in this movie is by far my favorite of the year. Overall, a very intense yet rewarding viewing experience that no one should miss out on. Do yourselves a favor and check it out!!!"
    },
    {
      "username": "lavatch",
      "userUrl": "https://www.imdb.com/user/ur2767381",
      "reviewLink": "https://www.imdb.com/review/rw6970031",
      "warningSpoilers": true,
      "date": "27 May 2021",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "The Long Twilight Struggle",
      "content": "\"The Father\" is a contemporary example of what was formerly called \"Kitchen Sink Drama\"--a gritty slice of life unvarnished and raw. Sir Anthony Hopkins delivers a magisterial performance as a man suffering from dementia and occasionally recognizing that he is a prisoner in his own mind.The central, heartfelt relationship in the film is that of the old man and his daughter Anne. At times, Anthony treats her badly, and the filmmakers deftly deliver the experience of a daughter struggling to cope as she contemplates sending her father to a nursing home.The fragmented way in which the narrative and characterizations shift gives the audience an experience of a crumbling mind. Anthony confuses names and details as he desperately seeks an answer to the question, \"Who am I?\"It wasn't entirely clear if the filmmakers wanted to depict an experience of elder abuse, as the two men who were in the flat as Anne's \"husband\" would berate and even physically assault Anthony. Still, Hopkins is successful in carrying the film by evoking a Shakespearean figure of tragedy. It is quite simply an unforgettable character portrait."
    },
    {
      "username": "searchanddestroy-1",
      "userUrl": "https://www.imdb.com/user/ur17559480",
      "reviewLink": "https://www.imdb.com/review/rw7808424",
      "warningSpoilers": false,
      "date": "28 January 2022",
      "rate": "8",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Fascinating and sad, but painful and tense.",
      "content": "This is the kind of movie that may feel you uncomfortable, it is disturbing but that will make you stuck to the screen. It shows the kind of situation that may concern millions of us, now or in the future, or also in the past, about one of our relatives. Of course Anthony Hopkins gives a more than brilliant performance and the most unusual is to lead the audience in some kind of a maze, the audience who can have the feeling to be tricked. Anyway, I warn some audiences against this beautiful and powerful stage movie, some audiences who could have a father or mother suffering of Alzheimer disease. It could be very painful to watch. But there were many other movies speaking of this. However this one has something special, I have not yet found excatly what. I derseves to be seen again. And again, especially if you lose memory...."
    },
    {
      "username": "bob-the-movie-man",
      "userUrl": "https://www.imdb.com/user/ur49208568",
      "reviewLink": "https://www.imdb.com/review/rw7023359",
      "warningSpoilers": false,
      "date": "12 June 2021",
      "rate": "10",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Dementia twists the strands of Anthony's personal multiverse",
      "content": "Anthony (Anthony Hopkins) is elderly and living in his flat. His daughter Anne (Olivia Colman) keeps dropping by to check he is OK. But is this right? Strange things keep happening to him, from losing his watch to having strange people turn up at the flat. For Anthony is battling against dementia, and reality and fantasy are not quite as distinct as they once were.Positives: I was one of those disappointed that Chadwick Boseman didn't posthumously win the Best Actor Oscar for \"Ma Rainey's Black Bottom\". But, boy oh boy, after seeing this I am fully supportive of the Academy's position. Anthony Hopkins has delivered some astonishingly powerful performances during his career - from the tortured ventriloquist in \"Magic\", to Hannibal Lector to the elderly pope in \"The Two Popes\". But he really excels himself here, tapping both your emotions and your sympathies as the confused and terrified old man.The Oscar- and BAFTA-winning screenplay by Florian Zeller, based on his stage play, is devastating, subtly twisting the knife. It will be particularly telling/upsetting for those who are getting on in years and/or have/had elderly parents affected by dementia. I would personally not have included (being deliberately vague) the \"Williams entry\" scene in the trailer, since it is a jolt of a twist in the film. But there are so many other clever devices in the screenplay that you don't see coming. The ending in particular is brutal on the emotions.The production design (an Oscar nomination for Peter Francis and Cathy Featherstone) is ingenious, as the set subtly and progressively transforms. Almost a 'spot the difference' in movie form.The score by Ludovico Einaudi uses atonal strings to great effect, as Anthony's reality keeps shifting from under him.Negatives: I've nothing here, hence my 10/10 rating. I've seen some reviews that have thought that the movie was too \"stagey\" (which is a criticism I have levelled before at a bunch of \"stage to screen\" adaptations such as \"Fences\" and - more recently - \"One Night in Miami\" and \"Ma Rainey's Black Bottom\"). But I really didn't feel that way about \"The Father\". The claustrophobic nature of the plot was well served I thought by the (largely) single set location.Summary Thoughts on \"The Father\": Dementia is a cruel and heartless disease that robs any affected elderly person of their memories, logic and - ultimately - their dignity. I thought the movie was extremely clever in reflecting this decline, anchored by the astonishing career-best performance from Sir Anthony Hopkins. But this in turns makes this a very hard watch indeed!(For the full graphical review, please check out One Mann's Movies on the web or Facebook. There is also a new onemannsmovies Tiktok channel. Thanks.)"
    },
    {
      "username": "contactmaz",
      "userUrl": "https://www.imdb.com/user/ur57602187",
      "reviewLink": "https://www.imdb.com/review/rw6774008",
      "warningSpoilers": false,
      "date": "3 April 2021",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "Anthony Hopkins at his supreme best...",
      "content": "I started watching the film not knowing what to expect. Then, throughout the film, it was twists and turns, one after the other... so beautifully and elegantly done. Anthony Hopkins was superb, an absolute masterpiece of excellent acting. Just amazing...BTW, the other actors were excellent - Olivia Colman was super, Mark Gatiss, as usual, excellent, the nurse, the carer, the husband... all wonderfully portrayed. Watch it again??? Yes, definitely!Highly recommended - and the final scene was powerful and emotional.!WoW!"
    },
    {
      "username": "wolverton7",
      "userUrl": "https://www.imdb.com/user/ur48172832",
      "reviewLink": "https://www.imdb.com/review/rw6772278",
      "warningSpoilers": true,
      "date": "2 April 2021",
      "rate": "10",
      "helpful": "52 out of 59 found this helpful.",
      "title": "Fear",
      "content": "This is a powerful film.Sir Anthony Hopkins is not in it.There is a man, old then getting older, who finally disappears. He knows that he is gone. With wringing hands, he asks who he is. He is terribly confused and afraid of being abandoned. I wanted to hold him, to kiss away his tears. What could I do to help?In 1965, The Who released an album called \"My Generation.\" The lyrics include \"Hope I die before I get old.\"In this film, Sir Anthony is the epitome of Alzheimer's.In this film, Sir Anthony is extraordinary.I hope Sir Anthony receives the academy award."
    },
    {
      "username": "julieshotmail",
      "userUrl": "https://www.imdb.com/user/ur110936802",
      "reviewLink": "https://www.imdb.com/review/rw7137945",
      "warningSpoilers": false,
      "date": "18 July 2021",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Anthony Hopkins at the top of his game at 82",
      "content": "This movie is mind-blowing. Not only does it give you the perspective of a mind that has devolved into dementia, it creatively immerses you in their moment-to-moment thoughts and experiences through the repeating confusing scenes, changing context, strange faces, disappearing furniture, etc. Now who could convincingly portray an old man who has lost his mind through an acting performance that showcases the opposite of dementia? None other than Sir Anthony Hopkins! Here, we have this veteran actor at 82 years old who could very well be a victim of dementia himself at that ripe old age. Instead, he is firing at all cylinders, giving us this heartwarming performance of a lifetime making us convinced that he really has dementia, but the act of doing so just proves he is at the top of his game with elite-level acting. Who would've thought that after 30 years of his legendary Hannibal Lecter, he would top himself with this one? I look forward to more Anthony Hopkins films to come!"
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw7052428",
      "warningSpoilers": false,
      "date": "21 June 2021",
      "rate": "9",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Towering Performance",
      "content": "Anthony Hopkins gives a towering performance and joined the ranks of multi-Oscar winning actors in this harrowing film.He plays an elderly man suffering from dementia, and the movie is filmed mostly from his point of view, meaning it's a disorienting experience for the viewer, as past runs into present runs into future, different actors play the same characters and then the same actors show up later playing different characters, the apartment in which he lives changes decor and layout. We're never sure whether we're getting an accurate version of events, and the last and devastating scene of the film leaves us wondering if anything that preceded it happened within the world of the movie at all or whether it was all a jumble of memories of events that occurred before the film even starts.The film is expertly written and directed in such a way to make it just frustrating enough for us to feel like we're in the shoes of the main character, but not too frustrating to make the movie overall a turn off. Given its accolades, I was surprised and maybe a touch disappointed that I wasn't more moved by it than I was, save for that last scene, which would have justified Hopkins' Academy Award even if nothing else leading up to it did, though everything leading up to it does as well.Christopher Hampton and Florian Zeller (who also directed) won an Oscar for adapting the screenplay from Zeller's play, and this is one stage-to-screen adaptation that doesn't scream its stage origins. I wasn't surprised it was based on a play, but on the other hand would have accepted that it was written directly for the screen too. Olivia Colman received a Best Supporting Actress nomination for playing Hopkins' daughter, or at least one iteration of her, while the film also copped nominations for Best Picture, Best Production Design (and how wonderful to see work like this nominated in a category that usually favors obvious period or fantasy films), and Best Film Editing (again, a very high-brow choice by the Academy, and richly deserved).Grade: A."
    },
    {
      "username": "alexpn66",
      "userUrl": "https://www.imdb.com/user/ur47196823",
      "reviewLink": "https://www.imdb.com/review/rw6691963",
      "warningSpoilers": true,
      "date": "14 March 2021",
      "rate": "10",
      "helpful": "778 out of 813 found this helpful.",
      "title": "So good I never want to watch it again",
      "content": "The Father might be the saddest film I've ever seen. With a heartbreaking powerhouse of a performance, Anthony Hopkins is at his absolute best. This puts you in the shoes of a man whose mind is deteriorating. I fully recommend that everyone see this movie. As great as it is, it is not one I want to rewatch anytime soon."
    },
    {
      "username": "helio_lamego",
      "userUrl": "https://www.imdb.com/user/ur45950463",
      "reviewLink": "https://www.imdb.com/review/rw6779334",
      "warningSpoilers": true,
      "date": "4 April 2021",
      "rate": "10",
      "helpful": "30 out of 33 found this helpful.",
      "title": "I'm afraid of getting old now",
      "content": "Thank you, Anthony Hopkins, for giving me an eternal fear of forgetting everyone and everything I hold dear.I just cried so much. What a heartbreaking story, backed by amazing cast.I'm just gonna go to my bed and cry, if you don't mind."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw8121411",
      "warningSpoilers": false,
      "date": "6 May 2022",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "The daughter and the (holy) confusion",
      "content": "I remember that there was a bit of an outrage - not about the movie itself, but about the Academy Award Anthony Hopkins was given too. Some felt that Chadwick Bosman was meant to get it. Chadwick Bosman surely deserved an Oscar - but the outrage was way too late and not really helping anyone. Chadwick would have deserved an Oscar for his performance in the \"Get up\" movie (his James Brown personification was ... just awesome and spot on), but everyone who was against the decision, must not have seen the Father. Because Anthony Hopkins is just so good in it, there is no doubt he deserved this Oscar he got.Now I hope you are still with me. Because while I did hightlight the main performance (rightfully so I might add myself), the other \"supporting\" actors (no pun intended) and the story plus the way the movie is edited, help elevate this to a degree that make this a great movie overall. You will be baffled too - where does this go, what is real, what actually happens or rather happened. I think this may be - no actually I would go as far as to say, that this is one of the best depictions of the illness put on film. You are right there with the person who can't remember - or remembers bits and pieces. Sometimes not the right things ... really devestating and painful ... especially for those around the person who is ill. It takes a lot of work and patience to deal with a situation like that.Kudos to everyone involved - and while this is a movie from 2020 apparently, it probably will make my top 10 of 2022, since I just watched it. Yes it is that good, that I can almost say that safely in January!"
    },
    {
      "username": "pedroborges-90881",
      "userUrl": "https://www.imdb.com/user/ur65079747",
      "reviewLink": "https://www.imdb.com/review/rw6772515",
      "warningSpoilers": true,
      "date": "3 April 2021",
      "rate": "9",
      "helpful": "112 out of 127 found this helpful.",
      "title": "The Father Review",
      "content": "Anthony Hopkins gives an amazing performance, one of the best in his career, is hard to decide who deserve more the best actor between him and Chadwick Boseman, i know is controversial, but i would vote for Hopkins.Olivia Colman also gives a great performance, showing all the sadness a person would feel in this situation, but Hopkins is the one who elevated the whole material.The ending scene is very emotional and sad, showing once again how amazing is Hopkins performance, when he cries asking for his mother who is obviously dead a long time ago, this just shows even deeper how much he's lost in the time of his own life, the scene also make us see that a person in his condition can feel like a helpless kid who lived a entire life and now is completely lost and confused, sometimes not even capable to remember who he actually is."
    },
    {
      "username": "sweidman-28016",
      "userUrl": "https://www.imdb.com/user/ur74108860",
      "reviewLink": "https://www.imdb.com/review/rw6217792",
      "warningSpoilers": false,
      "date": "30 October 2020",
      "rate": "9",
      "helpful": "76 out of 105 found this helpful.",
      "title": "Nearly Perfect",
      "content": "\"Why do you keep looking as if there's something wrong? Everything's fine.\"The Father follows a man suffering from memory problems as he refuses all assistance from his daughter as he ages. As he tries to make sense of his changing circumstances, he begins to doubt his loved ones, his own mind and even the fabric of his reality. I honestly don't know where to begin. This is a mind-bender for the ages. Florian Zeller adapted his play into a screenplay along with Christopher Hampton. Naturally, Zeller also directed the film as well. Had he not collaborated on this project, I don't think it would ever be the same. He brought so much to this through his writing and directing. The way he made this confusing for both the viewers and Anthony (Anthony Hopkins' character) only enhances the experience. The first 30 minutes had me questioning everything I was watching. More questions are answered as the film continues but not in the most conventional way. We have to piece everything together. Any when I say everything I mean literally everything. Characters, timelines, location, just everything. It's not till the last moments where absolutely everything comes together in a way that makes sense. The screenplay is strong in the sense of storytelling, though a little bit of clarity would've been nice at a couple parts, but the dialogue is even stronger. The scenes that Anthony Hopkins are in-and it's basically every scene-he has hefty monologues. Every single scene is an award winning scene for both the actors, writing, and directing. Zeller directs the hell out of every scene. He gets the most out of the actors through expression and blocking. I find that those who have worked with stage production, whether it's writing or directing, have a way of knowing how to send a message through the screen. I know the awards shows don't favor stage-to-screen directing as much but I hope Zeller can pull through.Now if Anthony Hopkins doesn't win almost every award for his role, I'm going to be furious. If he doesn't win the Oscar it might go down as one of the biggest snubs in history. The only exception would be if Chadwick Boseman wins and it seems that they are going to campaign him in lead instead of supporting now. Hopkins goes through every emotion possible and takes the viewers with him. And like I said before, every scene he's in jail an award worthy scene. The very last scene had my pillow soaked in tears. The realistic acting and dialogue immersed you into the film and you forget this is acting. The same can be said for Olivia Colman. It's funny how she didn't become a household name until The Favourite. Now there's another chance she will get another Oscar. That is if she can beat Glen Close a second time. We, assuming you don't have severe memory problems, can associate with her character the most. She just wants what's best for her father but struggles to deal with his condition every day. Almost al of her scenes are heavy with emotional dialogue. Emotional doesn't always mean sad or angry, but the emotion put in to make the performance realistic is always evident. The rest of the cast does great as well. They don't have that much screen time, with the exception of Imogen Poots, but they use every minute they have. Speaking of Imogen Poots, I love to see how much she's grown as an actress. Every role keeps getting better and better. If she wasn't in the shadow of Colman, she very well could have a fair shot for awards nominations.It's hard to express words for The Father. It's been over a week since I watched it and I still can't stop thinking about it. Once it finished I considered watching it again. Even though I had three classes the next day, I should've watched it again. Time flies by so fast while watching. What felt like 30 minutes turned out to be an hour. But it's the use of time that's done so well. Both in the sense of runtime and the time in the film, the execution couldn't have been better. When this comes out, whether it's in theaters or online, please, please, please watch The Father!"
    }
  ],
  "errorMessage": ""
}