{
  "imDbId": "tt1305806",
  "title": "The Secret in Their Eyes",
  "fullTitle": "The Secret in Their Eyes (2009)",
  "type": "Movie",
  "year": "2009",
  "items": [
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "",
      "rate": "100",
      "content": "It's powerfully and richly imagined: a genre-busting movie that successfully combines the utmost in romanticism with the utmost in realism."
    },
    {
      "publisher": "Boxoffice Magazine",
      "author": "Pete Hammond",
      "link": "https://www.boxofficepro.com/",
      "rate": "90",
      "content": "Campanella has laced his story with twists and turns worthy of Hitchcock and the framing device of the novel (which forces the protagonist to sort out the whole thing through writing) is ingenious."
    },
    {
      "publisher": "Variety",
      "author": "Jonathan Holland",
      "link": "",
      "rate": "90",
      "content": "A deeply rewarding throwback to the unself-conscious days when cinema still strove to be magical, The Secrets in their Eyes is simply mesmerizing."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "A riveting Argentine thriller spiked with witty dialogue and poignant love stories."
    },
    {
      "publisher": "Miami Herald",
      "author": "Rene Rodriguez",
      "link": "",
      "rate": "88",
      "content": "Although it is structured like a thriller, and its plot dominated by Benjamin's detective work, The Secret in Their Eyes is really a cautionary tale about the consequences of a life of too much apprehension and propriety."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "75",
      "content": "The performances are tender, the script elegant, the cinematography (especially during a virtuoso chase scene in a soccer stadium) artful."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Scott Tobias",
      "link": "https://www.avclub.com/the-secret-in-their-eyes-1798164794",
      "rate": "67",
      "content": "The film sprawls across two decades and 127 minutes, but there isn't a memorable image in it."
    },
    {
      "publisher": "Time Out",
      "author": "Keith Uhlich",
      "link": "https://www.timeout.com/newyork",
      "rate": "60",
      "content": "About as deep as a kiddie pool, which isn't to say it's an unpleasant frolic."
    },
    {
      "publisher": "Boston Globe",
      "author": "Wesley Morris",
      "link": "",
      "rate": "38",
      "content": "The secret here is that the movie is rather tasteless. It has the high, slightly nauseating stink of perfume on garbage."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "20",
      "content": "Campanella, who overconfidently takes his time, outfits the film with ludicrous interrogation scenes, a drunken colleague who provides comic relief and redemptive tragedy, and a climactic flood of memories that plays like a trailer."
    }
  ],
  "errorMessage": ""
}