{
  "imDbId": "tt1305806",
  "title": "The Secret in Their Eyes",
  "fullTitle": "The Secret in Their Eyes (2009)",
  "type": "Movie",
  "year": "2009",
  "items": [
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3422764",
      "warningSpoilers": false,
      "date": "27 February 2016",
      "rate": "10",
      "helpful": "45 out of 48 found this helpful.",
      "title": "A Story of Passion and Commitment",
      "content": "I can't add a lot to what has been written. The direction and cinematography aside (which is magnificent), this is an incredible psychological study, involving a group of the most complex of characters. Esposito finds himself in love with two people: the woman who was once his boss and because of inaction, left him heartbroken, and, secondly, a beautiful young rape/murder victim. Over a twenty-five year period, these forces never leave him. The rapist is his Moby Dick to his Captain Ahab. Since we don't see a lot of what happens in the intervening time, we must wonder how empty and fruitless his life has been until he has his epiphany. Mixed in all this are the politics of Argentina and the vengeance of a horrible man. Also, in the middle is the messed friend, an alcoholic, who can be a true talent, but is submerged in his problems, spending his time in bars. If we look to literature we might consider him the Sydney Carton of this film. When you see what happens to him, you will see why I choose this character as a reference. This is one of the finest films I've ever seen. It has it all."
    },
    {
      "username": "billion_mucks",
      "userUrl": "https://www.imdb.com/user/ur5228267",
      "reviewLink": "https://www.imdb.com/review/rw2114041",
      "warningSpoilers": false,
      "date": "19 August 2009",
      "rate": "8",
      "helpful": "507 out of 549 found this helpful.",
      "title": "Speaking Eyes",
      "content": "\"El Secreto de sus Ojos\" hit me with unspeakable strength. I didn't expect to like it so much, so I owe a review to those in analysis measures before seeing it or those interested in some opinion.First off, Campanella works with flawless effort all of the technical aspects of the film. It even starts with a double exposure effect, mixed with some sad shots of a beautiful Buenos Aires that hints the spectacle ahead of us. One shot especially, from a chopper in a soccer field edited with a crane shot is breathtaking. Nothing to envy from Hollywood upper class.But the main strength of the movie comes from the powerful narrative dominion Director Campanella has over characters, spaces and silences. Many moments are coldly tense, scary and very, very intense. This crossover from genres by Campanella couldn't have been better. Crime stories often fall in common places, this one relies on the fragile psychological state of the audience to draw all of it's intense dialog, acting and scenes.I cannot stop recommending it, Argentina can open it's market with movies such as this. It has many, many memorable moments, it interwines comedy perfectly and it is doubtful you will instantly forget it, as it is so well constructed. See it if you can!"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3864013",
      "warningSpoilers": true,
      "date": "21 November 2017",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "\"How do you live a life full of nothing?\"",
      "content": "This is only the second Argentinian movie I've seen, both within the past week (the other was \"Wild Tales\"), and so far I'm batting a thousand by picking two immensely satisfying films. I was reading some of the negative reviews and I had to laugh, more than one stated that the ending was completely predictable. Yeah right, like anyone could foresee that Morales would kidnap the guy who murdered his wife and keep him a prisoner for twenty five years. Come on, nobody could see that coming.At least not ahead of time. After the fact, when you start putting two and two together, along with the picture's title, one is able to come to grips with the idea that Morales wouldn't let things go the way the corrupt district Judge Romano (Mariano Argento) did, and would relentlessly pursue his side of the case, in the same manner legal counselor Benjamin Esposito (Ricardo Darin) did on his. So much of the story depended on the concept that 'The eyes speak', and in more ways than one. It's what trapped the killer and what gave away the feelings between Esposito and his supervisor Irene Hastings (Soledad Villamil), even though that relationship went unrequited for more than two decades.The scene that really floored me was when Irene and Esposito began interrogating Isidoro Gomez (Javier Godino). I'm not entirely convinced that what Ms. Hastings did was ethical or not, but the way she demeaned Gomez to make him crack was truly inspired. The man would have to have been deranged to expose himself like that in a law office, so you had a pretty good idea right there that the guy wasn't playing with a full deck. The fact that he was released upon executive order is one of those things that makes one see red in any kind of movie, and inspires that much more contempt of the justice system.All the while of course, one wonders why Esposito could never reveal his true feelings and intentions with Ms. Hastings. He came close a couple of times, and it looked like she was willing to reciprocate, but those frustrating moments dissolved into just another distraction. I was ready to give it up for lost until the very last scene when Irene told Benjamin that 'it would be difficult'. It leaves the viewer a bit conflicted because the woman had a husband and family that she was going to compromise, something that she and Esposito had done for the last twenty five years."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2312428",
      "warningSpoilers": false,
      "date": "18 September 2010",
      "rate": "9",
      "helpful": "34 out of 38 found this helpful.",
      "title": "How to Live an Empty Life?",
      "content": "The retired justice officer Benjamín Espósito (Ricardo Darin) decides to write a novel based on the Morales Case of twenty-five years ago and has difficulties to find the right beginning. He visits his former chief Irene Menéndez-Hastings (Soledad Villamil) in the tribunal to show his draft. In the 70's, Benjamín has an unrequited love for his new-hired chief Irene that belongs to an upper-class. Benjamin is assigned to investigate the murder of Liliana Coloto (Carla Quevedo), a beautiful woman recently married with Ricardo Morales (Pablo Rago) that had been brutally raped and murdered. Benjamin and his alcoholic partner Pablo Sandoval (Guillermo Francella) feel touched with the grief of Ricardo and go further in their investigation. Benjamin observes that a man named Isidoro Gómez (Javier Godino) is staring Liliana in many pictures and he becomes the prime-suspect. Meanwhile the tension between Ricardo and Irene increases along the days but Ricardo does not understand the signs of her eyes. Twenty five years later, Ricardo is still haunted by his love for Irene and for the unsatisfactory resolution of the Morales Case.\"El Secreto de Sus Ojos\" is a film awarded with the Oscar of Best Foreign Language Film of the Year with a dramatic story that perfectly entwines crime, thriller and a subtle romance in an adequate pace. The direction of Juan José Campanella is tight and the screenplay is wonderful, unfolding two lead stories – the brutal murder of a young woman and the repressed love of a subaltern for his chief – with many subplots. The acting is top-notch, with excellent dialogs and many funny lines but never vulgar. The cinematography and the camera work are magnificent and there is one specific scene very impressive with the camera approaching to the stadium in the middle of a soccer game between Huracán and Racing. My vote is nine.Title (Brazil): \"O Segredo dos Seus Olhos\" (\"The Secret of Your Eyes\")"
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3416377",
      "warningSpoilers": false,
      "date": "16 February 2016",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "you really don't need another review",
      "content": "Not often I come to an IMDb review page and think what can I possibly add to all the comments that came before? The movie is staggering in its ability to engage and while engaging to constantly fiddle with the expectations of the viewer. It is the rarest of movies, a slow movie that is never boring and one you never want it to end.I want to ask aloud why Hollywood feels the psychotic compulsion to remake every decent foreign film whether it needs remaking or not? I remember that one of the best horror films I have ever seen was about an undead girl in a climate so cold that the thought of living there was scarier than the story (LET ME IN.) It was a foreign film and the Hollywood remake took place in ... Mexico.Some people will never get it.Highly recommended. But you already knew that."
    },
    {
      "username": "jpschapira",
      "userUrl": "https://www.imdb.com/user/ur4751428",
      "reviewLink": "https://www.imdb.com/review/rw2112071",
      "warningSpoilers": false,
      "date": "15 August 2009",
      "rate": "9",
      "helpful": "246 out of 289 found this helpful.",
      "title": "The secret of Juan José",
      "content": "In my country, Juan José Campanella is synonym of 'cinema of the highest order'. The director works in USA and from time to time he brings a new film. We know, dramatically, what we're going to watch: Ricardo Darín in an important role, a lot of sentimentalism, references to the country's past, a love story. And technically, if it's the highest order, there won't be any complaints. When the film ended, the people in the movie theater started clapping.\"El secreto de sus ojos\" tells the story of Benjamín Esposito (Darín) and his need to tell the story of a case that wasn't completely solved 25 years ago and had an important impact in his life. A woman raped and killed and a husband with the surname Morales (Pablo Rago) who went every day to every train station in Buenos Aires to see if he could find the killer. \"You have to see his eyes; they are in a state of pure love\", Benjamín professes in front of Irene Hastings (Soledad Villamil); his boss and the woman he loves.There are things we never forget, Campanella knows well, and that might be the film's most important declaration. We expect from the director a powerful love that grows with the years, as we saw with Darín and Villamil in \"El mismo amor, la misma lluvia\"; we expect characters with inner ghosts, things to hide and things to hold on to; we expect total control over the language of the environment (in \"El mismo amor...\" it was a magazine staff, in \"Luna de Avellaneda\" the neighborhood club), a knowledge of the customs and the way of speaking of characters that makes for day-to-day comedy. In this aspect, the casting of Guillermo Francella as Pablo Sandoval is crucial. Taking the place of the best friend role always in charge of Fernando Blanco, the comedian plays a drunk with a lot of respect for friendship. His change of look, the measurement of his composition and how he enlightens it with comic touches make for one of the year's best performances. That's about everything we can expect. The fact is \"El secreto de sus ojos\" is a very good movie because there are things we don't see coming. The film contains a treatment of a police investigation that hasn't been seen in our cinema for years. In his riskiest picture, Campanella flirts with thriller, mystery and real action (handy-cam included); he acquires true tension and a sequence in a soccer stadium is the best example of it. He understands when silence is required and when the loneliness of the characters –each of them with a rich, mysterious private and inner world- must be seen fully. It's quite embarrassing in fact, because Darín as a director tried to achieve something like that with \"La señal\". Even though it's obvious Campanella took no inspiration from that film, everything that went wrong there can be seen here, improved. And Soledad Villamil is no femme fatale. I take a risk, however, and defy you to tell me if, because of image and makeup resemblance, and disposition of images and voice in off, the movie towards the finish line doesn't take direct inspiration from Chris Nolan's \"The Prestige\". It's quoting it somehow, at least.It's very moving to watch excellent performances from recognized actors. We've seen them on screen so much, we know what they do, we admire them and respect them and, as with Campanella, we tend to know what to expect. However, sometimes they enchant us with every face in every frame, with every word in every conversation. I'm trying to explain to you the feeling of what Villamil and Darín do in this film: it's enchanting and contagious, purely human (as it occurred in \"El mismo amor...\"), but at the same time moving, simply because they're not unprofessional actors that fit in the look of the film, or young actors with expressive faces, or newcomers that take our breath away: they are Ricardo Darín and Soledad Villamil. Campanella has a lot to do with this, because he knows how to make them work together and he made an effort so they would not repeat what they had given us in the other film I've mentioned.The fact that Fernando Castets didn't write the film calls our attention; the script was written by the director and Eduardo Sacheri. It also calls our attention that Campanella himself edited the movie. Is this film-making of the highest order? I believe so, in our country, and speaking of something commercially successful too. It's the only movie seen by many people that can generate interest in revising the director's previous work and, who knows, maybe other national pieces."
    },
    {
      "username": "bicgus1",
      "userUrl": "https://www.imdb.com/user/ur2035667",
      "reviewLink": "https://www.imdb.com/review/rw2122791",
      "warningSpoilers": false,
      "date": "6 September 2009",
      "rate": "9",
      "helpful": "199 out of 224 found this helpful.",
      "title": "Extraordinary Film",
      "content": "Last night I went to watch this flick, and I must say that all in all, I ended up quite surprised because of it's impressive quality. Taking into account that I was already expecting superior film, indeed, it came out to be even more outstanding than I thought, mainly because of the rare combination of noir genre with very precise and measured funny moments and especially an incredibly faithful description of the Argentine system of justice and the characters that compose it. This last element is just perfect. The movie keeps your attention all the time -no decays at all- and the set design is also great, to such extent that it left me wondering what the tricks of the trade employed to achieve such similarity are. Foreign watchers might not fully understand some great details that are mainly local, but anyway they will surely enjoy the thrilling aspects of the film. It would be enough for them to say that almost all this locale's are just true, no matter how incredible they might look."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw2232345",
      "warningSpoilers": false,
      "date": "6 April 2010",
      "rate": "9",
      "helpful": "23 out of 28 found this helpful.",
      "title": "Argentinian passion",
      "content": "The second Argentinian movie to win an Oscar, \"El secreto de sus ojos\" (\"The Secret in Their Eyes\" in English) looks at a Buenos Aires detective's passion in solving a case on the verge of the military junta that was responsible for the Disappeared. As I understand it, a difference between this movie and Juan Jose Campanella's previous ones is that this is more mainstream, so to speak. I actually found it pretty comparable to \"My Wife's Boyfriend\", which Campanella also directed. I certainly recommend both films. To be certain, this one has some of the best lines that I've ever heard. Argentina has clearly shown itself to be a fine country in terms of cinema during this past decade."
    },
    {
      "username": "casch0101",
      "userUrl": "https://www.imdb.com/user/ur1596502",
      "reviewLink": "https://www.imdb.com/review/rw2168419",
      "warningSpoilers": false,
      "date": "4 December 2009",
      "rate": "10",
      "helpful": "140 out of 163 found this helpful.",
      "title": "Absolutely impeccable, great film!",
      "content": "I agree with SanFava. I am a follower of Campanella's and Darin. I have seen all previous three films. However, this one surpasses them all!. This is a great script, top-notch acting by everyone, partly thanks to the excellent casting. Superb cinematography. The film basically explores what \"passion\" is to the human being. A great passion (on various areas) is involved in almost all characters. You have suspense, a clever detective story, some surprising twists, etc. Darin has an \"aura\" (paraphrasing the the title of the film he worked in, \"The Aura\") that illuminates the whole screen. His presence is as powerful in the screen as that of Gene Hackman, Pacino, DeNiro or Hoffman (the top, great ones). I sincerely hope this movie gets his due awards (Oscar included), because it deserves so!)."
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw2219865",
      "warningSpoilers": true,
      "date": "12 March 2010",
      "rate": "8",
      "helpful": "27 out of 34 found this helpful.",
      "title": "The secret of his eyes",
      "content": "A retired investigator, Benjamin Esposito, from a criminal court in Buenos Aires, decides to write about a case that has haunted him since the days he was assigned to cover the crime. In putting his thoughts in paper, he realizes the case is still unresolved. What's more, he is more involved now, than he was back then. For that he must go back and speak to Irene, the district attorney, under whose office he worked. Irene, he realizes, is the woman he has never forgotten in spite of being apart for so many years.The crime in question involved a beautiful newlywed woman found raped and stabbed to death in her apartment. Benjamin and the other investigator, Pablo Sandoval, try to gather as much information about the circumstances that triggered the murder. Both men are hindered by an elusive killer whose only, and possible identity, is a photograph that the investigators find in an album they get from the husband of the victim, Ricardo Morales. The thing that sparked their suspicion is Isidoro Gomez who appears in a couple of pictures almost adoring the dead woman, who obviously, he couldn't have. Benjamin is a self made man. He came from humble origins, in contrast to Irene Menendez Hastings, a girl from money and privilege. In a class conscious society like Argentina, their possible involvement would have been nil. Yet, one can see how Irene gets under Benjamin's skin. Their attraction is mutual, but it will never happen. She, too, is aware of the way he feels, but ultimately, decorum prevails. After all, Irene is about to marry a society man. The pursuit of Isidoro Gomez doesn't go anywhere. Pablo Sandoval's drinking friends crack the code about Isidoro Gomez's love for a soccer team, the Racing of Avellaneda. The suspect, who proves to be a master in the way he can outrun Benjamin and Pablo, is followed to his favorite place, the soccer stadium. When they finally catch up with the suspect, someone well connected with the government of then president Isabel Peron, bails him out. It was clear they had no chance in ever catching the assassin. Benjamin, in frustration leaves his post after his partner Pablo Sandoval is killed, a death that was meant for him.Years later, Benjamin returns to Buenos Aires and goes back to Irene with the notes he has written. Irene, now married with children, realizes whatever they felt about one another, never having said a word, is now stronger than ever. Benjamin gets lucky when he decides to pay a surprise visit to Ricardo Morales, the widower of the slain woman. When Benjamin finds him at a remote place in the country, he is for an unexpected surprise.Juan Jose Campanella is one of Argentina's best directors. Working with Eduardo Sacheri, and his novel, \"La pregunta de sus ojos\", the director struck gold. The film can be a bit disorienting for people without much knowledge of Argentine history that is at the center of the story. Most of the action takes place in the Buenos Aires of 1974, when the corrupt government of Peron's widow Isabel, was in power. One can relate to the way the story of those years work well with what the creators wanted to present. With the presence of Ricardo Darin and Soledad Villamil the director had it made. Both are excellent actors who will enhance any film in which they appear. They both shine as Benjamin and Irene. But it is with the supporting players that Mr. Campanella achieve greatness. Guillermo Francella, who plays Pablo Sandoval does an amazing job. As he proved with \"Rudo y Cursi\", Mr. Francella steals the film from the principals any time he is seen. Pablo Rago, is brilliant in the way he approaches his role as the husband of the assassinated wife and whose life ended on the tragic day she was killed.Felix Monti's atmospheric cinematography works well, capturing that bygone era. So does the fine musical score by Fererico Jusid and Emilio Kauderer. This is another triumph for Juan Jose Campanella."
    },
    {
      "username": "monty_lnct",
      "userUrl": "https://www.imdb.com/user/ur20342873",
      "reviewLink": "https://www.imdb.com/review/rw2191662",
      "warningSpoilers": false,
      "date": "14 January 2010",
      "rate": "9",
      "helpful": "217 out of 262 found this helpful.",
      "title": "this is what we call.............................flawless",
      "content": "One of the most perfect movie i have ever seen.This type of movie come once in a while,and remains with you for a long time.The best thing of the movie is cinematography that makes movie so beautiful.They use camera so well and scenes are shot so beautifully especially soccer match scene.They give a very realistic feel to movie. the scene of the crime is shown very realistic.Great acting by all the actors.all characters are very well portrait by actors.The story of the movie is so emotional and deeply involving and have very well written dialogues. this movie kept me so engaged with all the perfect twists and pace. this movie have everything crime,romance,drama,thriller and have some moments that makes you laugh.Direction of the movie is flawless,this movie is almost perfect in all the departments.I hardly found any mistake in the movie.This movie deserves at least three Oscar nomination this year for screenplay ,cinematography and best movie in foreign language.This movie is a masterpiece and will be remembered among greatest movies ever made(at least by me).I give this movie 10/10"
    },
    {
      "username": "FilmRap",
      "userUrl": "https://www.imdb.com/user/ur22815595",
      "reviewLink": "https://www.imdb.com/review/rw2216414",
      "warningSpoilers": false,
      "date": "5 March 2010",
      "rate": "8",
      "helpful": "42 out of 48 found this helpful.",
      "title": "Deserves the Acclaim It Has Received",
      "content": "When Juan Jose Campanella is not directing episodes of Law and Order, CSI or the like, he periodically returns to Argentina make a movie. In this case he directed and co-wrote the screenplay of The Secret in Their Eyes. Thus far it is the most successful movie in Argentina in the past thirty-five years and now in just few days after we saw it, we will find out if this Academy Award nominated movie for the Best Foreign Film will win an Oscar. It reminds us of the French movie, Tell No One, one of our all time favorites, as it is also a sophisticated detective story with an easy flowing but yet a complicated plot that keeps you thinking and guessing throughout the story. It is in Spanish, of course, with good subtitles. This movie is not only a mystery, crime movie but it is also a subtle romantic film which is has very good comedic moments. There is the use of a narrative technique that allows you to see the story through the imagination and the memory of the main character Benjamin Esposito played by well-known Argentine actor Ricardo Darin. There are skillfully done movements, which go back and forth in time as well as shifting the point of view, which on a few occasions took a few moments for us to orient ourselves. The acting, directing and photography were superb with great realism and therefore it surprised us to learn that the budget was only two million dollars. As required for all good movies of this genre, there is a strong ending, which will hold your interest and encourage further reflection."
    },
    {
      "username": "sanarg",
      "userUrl": "https://www.imdb.com/user/ur6966746",
      "reviewLink": "https://www.imdb.com/review/rw2147760",
      "warningSpoilers": false,
      "date": "26 October 2009",
      "rate": "10",
      "helpful": "347 out of 403 found this helpful.",
      "title": "This is what movies should always be",
      "content": "This is it. A film that you can't get your eyes off until lights are back on... and then it's still difficult to stand up. A thriller, with lovable main characters, that makes you smile and think. A movie about a crime and a love. It has one of best chase scenes I've ever seen, involving what seems to be real complex camera work, something that could've been part of a Lord of the Rings movie maybe (at least that is what it looked like from my seat). Simply amazing. The acting is perfect. The pace is perfect. The ending couldn't be better (and we have seen so many great films that spoil it all at the end!).Just go see it and enjoy what cinema should always be. It's a 10 out of 10."
    },
    {
      "username": "drgrozozo",
      "userUrl": "https://www.imdb.com/user/ur9516925",
      "reviewLink": "https://www.imdb.com/review/rw2200739",
      "warningSpoilers": false,
      "date": "1 February 2010",
      "rate": "10",
      "helpful": "47 out of 54 found this helpful.",
      "title": "In 21st century, eyes still speak",
      "content": "OK, frankly, I didn't expect much of this.I'm not familiar with Argentinian cinema, so this was my first acquaintance with director, writer and actors.Boy, what a surprise this movie made. It's beautifully filmed, it has lovely slow parts where director and actors narrate emotions through silence, this feature is almost vanquished from modern cinema where any frame that doesn't contain action is considered boring.I thoroughly enjoyed directing, but acting left me pining for Spanish classes. Impressive portrayal of characters if self-evident, with Soledad Villamil's performance shining out as an example of true actress. Unfortunately, we Spanish-impaired people can only sense the beauty lying within spoken lines and rhythm of the language that subtitles just cannot convey. As for violence and nudity they are used in glimpses, not more than necessary and in meaningful places, I spent good part of the movie fearing that it must eventually get ruined with some trendy shocker effect. But it doesn't, it flows it's own way beautifully to the end.If one can use small court office and a rape case to tell a love story in such subtle and profound manner it leaves me wandering what Argentinian cinema has for us for the future. I'll jump on digging through it's past right away, and I hope anyone wondering if this movie is worth their time can be swayed to yes side by my humble recommendation."
    },
    {
      "username": "torrelodones49",
      "userUrl": "https://www.imdb.com/user/ur21879094",
      "reviewLink": "https://www.imdb.com/review/rw2132292",
      "warningSpoilers": true,
      "date": "26 September 2009",
      "rate": "10",
      "helpful": "266 out of 289 found this helpful.",
      "title": "A masterpiece",
      "content": "This is quite frankly an astonishing film. One that fills your entire array of senses and sensitivities, and the praise from Argentine reviewers here is 100 percent justified. Ricardo Darín turns in another majestic performance as a Buenos Aires court employee who is fiercely affected by the rape and murder of a young girl in 1974, a tragedy that dominates his life. Overlapping this theme is the powerfully sensual but never physical relationship between Darín and his superior, the investigating judge played by the superb Soledad Villamil. The connection between the two is electric. It's a pity this film cannot easily transcend the language barrier, if it was an English-language film of the same quality it would already be hailed as a masterpiece. The blending of tragedy, love, violence and humour is brilliant, and the comedy dialogue fantastic. One scene where Ricardo Darín is balled out for having searched an old lady's house is priceless in terms of comic timing and delivery. A wonderful performance also from Guillermo Francella as the court clerk with a drinking problem, in fact the secondary acting is all first-class. The camera-work is impressive, especially the swoop down into the football stadium and the closeups, and the script is also superb. Argentina has nominated the film as its candidate for best foreign film at the Oscar's, it deserves to walk it."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw2328717",
      "warningSpoilers": false,
      "date": "24 October 2010",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Secrets revealed",
      "content": "I guess you might see some things coming. But this is not that much about the secrets (at least for me), but the journey of our main protagonist. It is about life and choices you make and how one simple choice does get you into a path you actually do not want to follow. But because it is expected of you (of what your appearance is in other peoples eyes), you keep on walking. Maybe regretting the decision while you are walking, but walking that path nevertheless.That is of course the way I read the movie. You might come up with something completely different. Or some might wait until the inevitable US-Remake hits a cinema near them (in 2012 as IMDb reveals). That this would be remade after winning the academy award for best foreign language picture, does not come as a big surprise to me. That it did win the award on the other hand, was a surprise (for me). Not because of the quality of the movie (as you can see I like it a lot), but because of the nature of the movie. Hats off to the academy for their choice."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw2344683",
      "warningSpoilers": true,
      "date": "27 November 2010",
      "rate": "",
      "helpful": "10 out of 12 found this helpful.",
      "title": "You Eyes, Your Love, Your Passion",
      "content": "This is a truly lovely film that has potential to change lives. I will consider it for my \"list of fours,\" when I report it.You may simply fall into the rather soft world it builds, one in which love can be redeemed as a matter of earnest justice. It is a simple coloring of the by now familiar Spanish-language model of anti-noir. In noir, the on screen characters are buffeted by events and laws in a world designed by the act of us watching. In the Spanish-language model, the on-screen characters imagine a world that bobs and weaves around the world we want to impose on the movie. Sometimes this is called \"magical realism,\" and I suppose that concept makes sense in novels where everything is internal. Here in cinema we see, we live in worlds.As with the best of these films, there is careful structuring. Underlying all this — I'll call it mirroring here — is the effort of a man to change reality. Plot-wise, he needs to recapture a lost love with a colleague. This is mirrored in his need to revisit justice for a violent murder that terminated the most passionate love he knows. He follows his own passion, amidst a speech by his assistant about the inevitability of passion that is mirrored in how the murderer is captured.I'll take a moment away from mirroring to remark that this capture scene is in a packed soccer stadium. It is in a continuous take that seems physically impossible and has the edgiest cinematic tension I know.This is literally two movies spliced together. To begin, we know it as a police procedural, with a love story under. It morphs about halfway into the dual: a love story with a detective story under, and the detective story now is of a different kind.That \"different kind\" has to do with the mirroring of time. The early mystery is who committed the murder and how to catch him. The later mystery about what happened after the in-story watchers let him free. He folds these together by writing the past while we watch him struggle with the future. He literally writes half of the film and his creation may well be fiction. We see him struggling in the first scenes. When his love reads the novel she asks if that is how it was because she wants to know the world she will inhabit. She is pleased, saying that things will be complicated.Even this is mirrored. Where our detective creates a world by narrating it, the bad guy ends up in a limbo where he gets no story, literally.Ted's Evaluation -- 3 of 3: Worth watching."
    },
    {
      "username": "smatson123",
      "userUrl": "https://www.imdb.com/user/ur19574789",
      "reviewLink": "https://www.imdb.com/review/rw2262426",
      "warningSpoilers": true,
      "date": "10 June 2010",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "\"Sus Ojos\" as Literature on the Screen (long)",
      "content": "To get the big picture before beginning this piece, I did a quick sweep of previous reviews and immediately had to ask myself: why does the same film generate such passionate applause on the one hand, and such punishing comments on the other? I suppose it goes back to the question of \"sus ojos\" (your eyes). Those looking for an American style murder mystery or a boy-meets-girl, loses-girl, finds-girl romance may in fact have their eyes closed to some important possibilities. But those willing to see film as a novel have an experience to look forward to an experience that satisfies and enlightens on every level.\"Sus Ojos\" is a multilayered film that, like the work of Dostoevsky, makes us totally vested in the lives of its characters while exploring universal themes that can resonate with all of us. There are two major threads here that are worth close examination: the first is the unrequited passion that the intelligent and humane legal affairs clerk Benjamin Esposito feels for his well-bred supervisor, the beautiful, distant and self possessed Superior Court judge Irene Menendez. Having only completed high school, he has convinced himself he has nothing to offer her. In fact, his life is comparable to the clunky typewriter he has been given, with the defective \"a\" that always pops up as a capital letter: flawed; just not good enough. Esposito is held back by his self-doubt to the extent that, 25 years after the relationship begins, as he tries to start a novel based on an unresolved murder case, the prompt he uses to remove writer's block is \"TEMO\"--I fear. Yet he is not a true coward: he simply, like any blocked writer, doesn't know how to reach his goals--both the completion of the novel and true connection with Irene.The second theme, one that is strategically intertwined with the first, is the murder case itself. Soon into the film it becomes apparent that Esposito's inability to resolve the rape and stabbing of a beautiful, 23-year-old school teacher--that is, to bring the murderer to full justice--represents his de facto impotence in bringing his relationship with Irene into reality. And on an immediate level,too, his obsession with the case makes perfect sense. Empathetic and perceptive to begin with--who else would continue to give support to an alcoholic friend, as Esposito does--he wants to bring justice to the dead girl and some element of resolution to her traumatized husband. Soon we are intrigued by the growing relationships between not only Irene and Esposito, but between Benjamin and his friend, who disparages him to barfly friends; Esposito and the husband, who insists that life in prison is the only acceptable punishment for the murderer; Esposito and the murder suspect; the murder suspect and Irene, revealing a toughness and ingenuity we hadn't seen before; and ultimately, the husband and the killer. And it is when Esposito sees that the final resolution is left to the husband that he is free to move on with his life. A simple act brings the decision to life: he suddenly realizes that by putting his \"defective\" letter A into the word \"TEMO\", he will end up with \"teAmo\"--I love you: the declaration he must make--the action he must take--in order to go forward and leave the past behind.Visual motifs keep the viewer connected and grounded throughout the film but placed to appear to be a natural artifact of the story telling. The most obvious one is the door image, used in promotional posters for the film. The judge's chamber door consistently is kept open or closed, depending on her relationship with those who enter. Esposito, attempting to put the final piece of a 25-year old puzzle into place, must wait for the husband to leave his house and enter a secret door. In the same way, secrets are hidden or revealed throughout the movie by means of doors large and small, obvious or subtle. A second motif is the train image, showing arrivals and departures, journeys and moving on from situations that cannot be resolved. Esposito, his life threatened by associates of the murderer, must take the train to a new town, leaving behind a regretful, running, Irene. The husband tells about murdering the suspect,the roar of a passing train disguising the sound of gunshots. A third, of course, is the eye, seen open and waiting in Esposito in the beginning shots--this is the eye of a person open to experience. The dead girls' eyes must be physically closed by an attending police officer. Esposito feels deep connection to her husband, citing the love for the lost wife seen in his eyes. A fourth is the interplay of columns at the department of justice--seen top down or bottom up--representing the aloof justice system, corruption and bureaucracy of the Argentian course system that prevents justice from taking place.This film has it all under the accomplished hand of director Jose Campanella. Acting is up there:Ricardo Darin as Esposito, Soledad Villamil as Irene, and Pablo Rago as the friend are equally affecting. Then again there are the strong story lines; thematic development; pitch-perfect cinematography (the chase seen through an enormous soccer stadium is as believable as they come); and even touches of humor, developed through perfectly synchronized dialogue. Is there a happy ending? Well, as both Esposito and Irene tell each other at the end--and as we see in the best loved novels--\"it's complicated.\""
    },
    {
      "username": "tjdinvt",
      "userUrl": "https://www.imdb.com/user/ur4799221",
      "reviewLink": "https://www.imdb.com/review/rw2168337",
      "warningSpoilers": false,
      "date": "4 December 2009",
      "rate": "10",
      "helpful": "457 out of 515 found this helpful.",
      "title": "as good as anything out there",
      "content": "Simply put, this is one of the finest films I've ever seen. I don't say that lightly, I don't exaggerate when it comes to talking about movies -- but everything about this one, from the acting to the writing, to the camera work, to the directorial decisions, is grade A. The story deals with deep matters, and it does so one step at a time, with a plot that moves steadily forward, gathering force, substance and intensity, not settling for easy answers or plot points, not cutting corners. The characters are complicated, interesting, believable, flawed, funny, tragic and deeply human.I prefer not to get specific about what happens -- I mostly want to try to get across the quality of this bugger. So I'll say it again: it's one of the best films I've ever seen, as good as anything out there. If there's any justice, a lot of people will see it."
    },
    {
      "username": "somkaviraj",
      "userUrl": "https://www.imdb.com/user/ur19581602",
      "reviewLink": "https://www.imdb.com/review/rw2220658",
      "warningSpoilers": false,
      "date": "14 March 2010",
      "rate": "10",
      "helpful": "193 out of 230 found this helpful.",
      "title": "A Masterpiece...",
      "content": "I am a big movie aficionado and watch a lot of movies. I guess you can say movies are my passion. After watching The Secret in their Eyes, though I confess I had my reservations as the movie was in a foreign language and I felt I won't be able to enjoy much as the real emotions and feelings mostly can't be conveyed in translations. Thus with such thoughts I proceeded to watch the movie. Initially, the plot and the character build up seemed nothing out of the ordinary but then gradually as the movie progressed it held me in rapt attention.Then it was simply impossible to let go, I was entirely swathed in this marvelous and sublime creation. The story line, the direction,the acting, editing, background music etc. simply sublime. This is the kind of movie which mesmerizes you, captivates you and simply won't let go. The human emotions expressed and portrayed are bound to touch the viewer regardless of the region he belongs to. This is the kind of movie which exemplifies that cinema has no boundaries and has an universal appeal. A must see for all movie aficionados and movie well deserving the Oscar.This movie ought to go in Top 250 movies of all times and Hall of fame."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2292801",
      "warningSpoilers": false,
      "date": "9 August 2010",
      "rate": "8",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Splendid film full of emotion , love , intrigue and feeling of joy and sorrow",
      "content": "Perceptible drama with suspense filmed with sensitivity and feeling. The story, set in 1999, is told in flashback way : in June 1974 a Justice Officer , Benjamín Espósito (Ricardo Darin), becomes entangled in the investigation of the crime of an ill-fated wife named Liliana , cruelly raped and killed inside her home in a Buenos Aires neighborhood. Her widowed husband named Ricardo Morales (Pablo Rago), is shocked by the crime ; Espósito promises to find the murderous and bring him to justice. Benjamin is helped by his drunk assistant Pablo Sandoval and a newcomer, the upper class Secretary of Court named Irene Hastings (Soledad Villamil) who is hired at the Criminal Court . Despite the department already having two other suspects Benjamin seeks tips off . Espósito's rivaling partner Romano pins the killing on two immigrant employees so as to get rid of the case , an issue that infuriates Espósito, hitting Romano in a fury. He finds a track while seeing some photos provided by Morales: he comes across a strange young man identified as Isidoro Gomez(Javier Godino) who watch the victim in a rare manner in various pictures. Espósito investigates the whereabouts of Gómez, and learns that he is residing in Buenos Aires, but fails to chase him. Espósito and Sandoval break into Gómez' household in an illegal entrance and take some letters that lead a clue about his liking to Racing Club . The other issue is that Gómez is still at large, and they set out in pursuit . Meanwhile Benjamin Esposito is writing a novel, using the matter as the source material. Benjamin was personally affected by the case as he tracked the killer, hence the reason why the unsatisfactory ending to the case has always bothered him. This sensitive tale contains intrigue , tension , drama, and an enjoyable love story . It's a brilliant and touching film though sometimes is slow moving and tiring but is developed with intelligence and sensibility. In the picture are treated ethic and moral themes narrated with great sense of fairness and ductility . Marvelous relationship between two main starring , they are frankly wonderful . Very good interpretation from Ricardo Darin as impulsive Justice Federal Agent who embittered by unsatisfactory ending to the case will have to face the traumatic truth and special mention an awesome Soledad Villamil as intelligent and wise chief department . It's impossible to escape to spell of the Argentinian movie star Ricardo Darín. Not only is he continually employed but whichever body chooses Argentina's Oscar submission each year has a huge crush. Darin's the star of their 2001 nominee Son of the Bride and this 2009 winner The Secret in Their Eyes and he's also principle cast in their submission titles that weren't nominated from 2002 (Kamchatka), 2005 (El Aura) and 2007 (Xxy) . The motion picture was stunningly directed by Juan Jose Campanela and deservedly prized with Oscar winner for the best foreigner film . He's a good Argentinian writer and director as Television as ¨Law and Order¨, ¨ Winds of water ¨,as cinema as ¨The Avellaneda's moon ¨, ¨Same love same rain¨, ¨Son of the bride¨ again with his fetish actor Ricardo Darin . Rating : Above average , well worth seeing . This a good-feeling movie full of intrigue , drama , tension , and agreeable message . Essential and indispensable watching ."
    },
    {
      "username": "herrick416",
      "userUrl": "https://www.imdb.com/user/ur33943696",
      "reviewLink": "https://www.imdb.com/review/rw7036174",
      "warningSpoilers": false,
      "date": "16 June 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Absolutely chilling and worthy of every moment spent seeing it.",
      "content": "Just like others here there's little left to add to these fine reviews except to mention a particularly terrifying scene -well more an image - that I found absolutely chilling and haven't seen it mentioned yet, one that 1st revealed the monster who committed a truly brutal crime. But beauty and humor quickly replace the chill of that scene, a chill that returns soon after during an impromptu interrogation. You'll know it when you see it and I've given nothing away ...not a spoiler in sight. I'm merely pointing out what stayed with me that I hadn't seen noted by others. See, this is a movie that grabs you right from the start and keeps you through all sorts of tones that change and are just too touching to break down into categories. But I think that only actors of this caliber could pull it off and drag me around through beauty through ugliness back to beauty and my affection or repulsion never wains. Oh dear the American version is a waste of time. I don't know why it was even attempted but this is pure masterpiece and twists to boot. Don't miss it. ."
    },
    {
      "username": "dave-sturm",
      "userUrl": "https://www.imdb.com/user/ur15291134",
      "reviewLink": "https://www.imdb.com/review/rw2256681",
      "warningSpoilers": false,
      "date": "29 May 2010",
      "rate": "10",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Senor Campabella, take a well-deserved bow",
      "content": "It's a thriller. It's a love story. It's a puzzle movie. It's It's an acting tour de force. It's spectacular cinematography.It's a masterpiece.Going in, all I knew is that it was a highly regarded film from Argentina that won an Oscar. I know zip about Argentine cinema, but it's hard to believe a better movie has ever been made there.One thing Americans should know is that this \"foreign film with subtitles\" is in no way, shape or form an \"art movie\" loaded with ambiguity and other hoity toity stuff like that. This movie is the work of a master craftsman director working off a brilliant and intricate thriller script.The narrative unfolds in interspersed scenes involving the same people, but 25 years apart. It's the same actors and characters, but youthful in some scenes and with wrinkles and gray hair in others.The plot turns on the aftermath of a brutal rape and murder of a beautiful young wife. Front and center throughout the movie are Benjamin, the passionate young investigator for whom this particular case is one he cannot set aside, and Irene, his colleague (it was a little unclear to an American what their professional relationship was) who clearly is drawn to his passion and has feelings for him, even though she is engaged to someone else (offscreen).Two shots must be discussed. First, there's THE shot. Anyone who has seen it will know exactly what I mean. It's a one-take (seemingly, but not really — it would be impossible without CGI) tracking shot involving a chase in a packed soccer stadium. The second much-discussed shot is only about a minute long and happens in an elevator, but you will not breathe during that incredibly tense minute.Lots of credit goes to the secondary actors, who portray a law clerk with a drinking problem, the perpetrator of the crime, a hapless intern, a weaselly judge and the devastated husband of the victim.The ending is an elegantly shown series of reveals. The next-to-last sequence totally screws with your mind. I kid you not, it's a shocker and it comes out of nowhere. Then comes the grand finale with Benjamin and Irene in the touching end scene.You will leave the theater simultaneously with a chill down your spine and a lump in your throat."
    },
    {
      "username": "gromit-17",
      "userUrl": "https://www.imdb.com/user/ur0260400",
      "reviewLink": "https://www.imdb.com/review/rw2220085",
      "warningSpoilers": false,
      "date": "12 March 2010",
      "rate": "10",
      "helpful": "31 out of 40 found this helpful.",
      "title": "A well deserving Oscar",
      "content": "This is a wonderful, wonderful movie! Easily the best movie I've seen this year. The German's 'white ribbon' was unwatchable. (one of the worst foreign films Oscar nominees I've seen, over-hyped and so undeserving). French's 'A prophet' is good. But it's like a 'prison break' meets the 'God Father'. I can't say it's too original and some part of it was just not very interesting. But this one is outstanding. It's bitter-sweet and masterfully done. it's one of those movies leave you speechless in silence after the end credits. I highly recommended to everyone who loves movies with a great depth."
    },
    {
      "username": "CarlosFacundoCornejo",
      "userUrl": "https://www.imdb.com/user/ur4576802",
      "reviewLink": "https://www.imdb.com/review/rw2125884",
      "warningSpoilers": true,
      "date": "12 September 2009",
      "rate": "10",
      "helpful": "34 out of 42 found this helpful.",
      "title": "One of the best Argentinian movies ever",
      "content": "As an Argentinian i can affirm it, this is one of the best Argentinian movies ever.Ricardo Darin again makes a big film shot, taking his role on this great thriller movie, that mixes a little bit of fantasy and also true stories, all involved between a complex drama, with real life situations and complications.The story would simply keep you on hold until the last minute, it takes unpredicted twists even in the last half hour.Just a few thriller movies can keep your attention for so long as this movie does, even in Hollywood films is hard to find today a real great thriller that can get your eyes watching the movie all along.Also a great, unexpected, performance of Guillermo Franchella, keeping aside his usual roles as a simply comedian, to take an important play on this thriller-drama story.Truly recommended.Doesn't matter if you knew the Argentinian history of the time (on which the movie is based) or not, you'll truly enjoy it from the beginning to the end."
    }
  ],
  "errorMessage": ""
}