{
  "imDbId": "tt1305806",
  "title": "The Secret in Their Eyes",
  "fullTitle": "The Secret in Their Eyes (2009)",
  "type": "Movie",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "The Secret in Their Eyes",
  "url": "https://en.wikipedia.org/wiki/The_Secret_in_Their_Eyes",
  "plotShort": {
    "plainText": "The Secret in Their Eyes (Spanish: El secreto de sus ojos) is a 2009 Argentine-Spanish crime drama film produced, edited, and directed by Juan José Campanella from a screenplay by Campanella and Eduardo Sacheri, and based on Sacheri's 2005 novel La pregunta de sus ojos. It stars Ricardo Darín, Soledad Villamil, Pablo Rago, Javier Godino, and Guillermo Francella. The film focuses on the relationship between judiciaries Benjamín Espósito (Darín) and Irene Hastings (Villamil) and their investigation into a murder case in 1970s Argentina.\r\nThe film marks the fourth feature-length collaboration between Campanella and Darín, after Same Love, Same Rain (1999), Son of the Bride (2001), and Moon of Avellaneda (2004). It uses a nonlinear narrative and explores the strenuous political and social climate in Argentina throughout the latter 20th century. The film is acclaimed for its feature of a continuous five-minute-long shot that runs through a large stadium in which a football match was being held.\r\nThe Secret in Their Eyes was theatrically released in Argentina on August 13, 2009. It received critical acclaim for its screenplay, thematic content, Campanella's direction, and the performances of the cast. The film grossed over $34 million worldwide, becoming the second highest-grossing Argentian film ever, behind Nazareno Cruz and the Wolf (1975). It received numerous awards and nominations, winning for Best Foreign Language Film at the 82nd Academy Awards and for Best Spanish Language Foreign Film at the 24th Goya Awards.",
    "html": "<p>The Secret in Their Eyes (Spanish: El secreto de sus ojos) is a 2009 Argentine-Spanish crime drama film produced, edited, and directed by Juan José Campanella from a screenplay by Campanella and Eduardo Sacheri, and based on Sacheri's 2005 novel La pregunta de sus ojos. It stars Ricardo Darín, Soledad Villamil, Pablo Rago, Javier Godino, and Guillermo Francella. The film focuses on the relationship between judiciaries Benjamín Espósito (Darín) and Irene Hastings (Villamil) and their investigation into a murder case in 1970s Argentina.</p><p>The film marks the fourth feature-length collaboration between Campanella and Darín, after Same Love, Same Rain (1999), Son of the Bride (2001), and Moon of Avellaneda (2004). It uses a nonlinear narrative and explores the strenuous political and social climate in Argentina throughout the latter 20th century. The film is acclaimed for its feature of a continuous five-minute-long shot that runs through a large stadium in which a football match was being held.</p><p>The Secret in Their Eyes was theatrically released in Argentina on August 13, 2009. It received critical acclaim for its screenplay, thematic content, Campanella's direction, and the performances of the cast. The film grossed over $34 million worldwide, becoming the second highest-grossing Argentian film ever, behind Nazareno Cruz and the Wolf (1975). It received numerous awards and nominations, winning for Best Foreign Language Film at the 82nd Academy Awards and for Best Spanish Language Foreign Film at the 24th Goya Awards.</p>"
  },
  "plotFull": {
    "plainText": "The Secret in Their Eyes (Spanish: El secreto de sus ojos) is a 2009 Argentine-Spanish crime drama film produced, edited, and directed by Juan José Campanella from a screenplay by Campanella and Eduardo Sacheri, and based on Sacheri's 2005 novel La pregunta de sus ojos. It stars Ricardo Darín, Soledad Villamil, Pablo Rago, Javier Godino, and Guillermo Francella. The film focuses on the relationship between judiciaries Benjamín Espósito (Darín) and Irene Hastings (Villamil) and their investigation into a murder case in 1970s Argentina.\r\nThe film marks the fourth feature-length collaboration between Campanella and Darín, after Same Love, Same Rain (1999), Son of the Bride (2001), and Moon of Avellaneda (2004). It uses a nonlinear narrative and explores the strenuous political and social climate in Argentina throughout the latter 20th century. The film is acclaimed for its feature of a continuous five-minute-long shot that runs through a large stadium in which a football match was being held.\r\nThe Secret in Their Eyes was theatrically released in Argentina on August 13, 2009. It received critical acclaim for its screenplay, thematic content, Campanella's direction, and the performances of the cast. The film grossed over $34 million worldwide, becoming the second highest-grossing Argentian film ever, behind Nazareno Cruz and the Wolf (1975). It received numerous awards and nominations, winning for Best Foreign Language Film at the 82nd Academy Awards and for Best Spanish Language Foreign Film at the 24th Goya Awards.\r\nPlot\r\nIn June 1974, judiciary agent Benjamin Espósito investigates the rape and murder of Liliana Colotto de Morales. Espósito promises her husband, Ricardo, he will find the killer and give him a life sentence. Espósito is helped by his alcoholic partner Pablo Sandóval and the new department chief Irene Menéndez-Hastings. Romano, Espósito's rival, accuses a pair of construction workers (one of whom is a Bolivian immigrant) of the murder, which angers Espósito upon discovering that both of them were tortured to obtain a confession.\r\nEspósito finds a lead while looking at old photos of Liliana, which Ricardo gave him: many of them featured a man, identified as Isidoro Gómez, staring at her obsessively. Espósito and Sandóval sneak into Gómez's mother's house in Chivilcoy. During the break-in, they find some letters from Gómez to his mother. Sandóval steals them and Espósito finds out after returning to Buenos Aires. Their \"visit\" only causes them trouble with their higher-ups, and they are unable to find any evidence in the letters. Gómez is still on the loose due to a careless phone call from Ricardo to Gómez's mother, in a desperate quest for his wife's killer. Ultimately, the case is closed.\r\nIn 1975, Espósito finds Ricardo in a train station in Retiro and discovers that he was trying to find Gómez in multiple stations. Espósito convinces Menéndez to reopen the investigation. Meanwhile, while getting drunk in a bar, Sandóval makes a discovery: an acquaintance of his identifies several names on the letters – seemingly without any connection – as footballers of Racing Football Club. After identifying him as a Racing fan, Espósito and Sandóval attend a game between Racing and Huracán, in hopes of finding Gómez.\r\nWhile keeping an eye on the game's attendees in Huracán's stadium, Espósito and Sandóval locate Gómez among the crowd, but a sudden goal causes a hubbub and allows Gómez to flee. A chase ensues and Gómez is caught by the stadium's security guards as he invades the pitch. Espósito and Menéndez then grill him illegally, and Menéndez makes Gómez confess by calling him physically weak, and attacking his masculinity. Gómez is tried and sentenced, but Romano bails him out one month later in order to get revenge on Espósito and hires him as a hitman for the right-wing faction of the Peronist Party. Espósito and Menéndez try to reverse it but are stopped by Romano's intervention. Espósito informs Morales that his wife's killer will never go to prison.\r\nWeeks later, Sandóval gets in a bar fight, causing Espósito to take him to his flat and fetch his wife. They find the door pried open, his pictures flipped over and Sandóval shot dead in his room. Espósito soon concludes that Gómez/Romano sent assassins after him, but Sandóval impersonated him to protect his friend. Fearing for his life, Espósito goes into hiding for 10 years in Jujuy Province with Menéndez's cousins. Espósito returns to Buenos Aires in 1985 to find Gómez missing and Menéndez married with two children.\r\nIn 1999, Espósito tries to make sense out of the case and visits Ricardo, who moved in 1975 to an isolated cottage in a rural area of the Buenos Aires Province. Ricardo loses control when Espósito asks him how he coped with his wife's death and the unfair end of the investigation since Gómez was never seen again after becoming part of Isabel Perón’s security detail. Ricardo tells Espósito that he kidnapped and murdered Gómez years earlier, and Espósito leaves. Moments later, however, he remembers Ricardo not wanting an easy death for Gómez decades ago, and Espósito sneaks back to Ricardo’s house, where he finds Ricardo giving food to Gómez, whom he has kept imprisoned for 25 years in complete isolation, without ever talking to him. Gómez begs Espósito for human contact. Ricardo tells Espósito he promised him \"a life sentence\" as he staggers out.\r\nBack in Buenos Aires, Espósito visits Sandóval's grave for the first time. He then goes to Irene's office, ready to confess his love to her, something she was always expecting. Smiling, she tells him to close the door.\r\nCast\r\nRicardo Darín as Benjamín Espósito, a judiciary employee in charge of solving the rape and murder of Liliana Coloto\r\nSoledad Villamil as Irene Menéndez Hastings, a judge and Espósito's superior, who helps him with his investigation\r\nPablo Rago as Ricardo Morales, Lliliana Coloto's grieving widower\r\nJavier Godino as Isidoro Gómez\r\nGuillermo Francella as Pablo Sandoval, Espósito's alcoholic friend and assistant\r\nMario Alarcón as Judge Fortuna\r\nMariano Argento as Romano\r\nJosé Luis Gioia as Inspector Báez\r\nCarla Quevedo as Liliana Coloto\r\nHistorical and political context\r\nThe setting of the film ties its characters to the political situation in Argentina in two different time periods: 1975 and 1999. The main events transpire in 1975, a year before the start of Argentina's last civil-military dictatorship (1976–1983); the final year of the presidency of Isabel Perón saw great political turmoil, with both leftist violence and state-sponsored terrorist organization, especially at the hands of the Argentine Anticommunist Alliance (usually known as Triple A or AAA), a far-right death squad founded in 1973 and particularly active under Isabel Perón's rule (1974–1976). A military coup in 1976 triggered the so-called \"Dirty War\", which is foreshadowed in the character of Isidoro Gomez and his protection by the government due to his work helping that administration and its judicial system to find (and later kill) left-wing activists and militants or guerrilla members. The dictatorship's National Reorganization Process was a period of more than seven years (1976–1983) marred by widespread human rights violations. The state-sponsored terrorism of the military Junta created a climate of violence whose victims were in the thousands and included left-wing activists and militants, intellectuals and artists, trade unionists, high school and college/university students and journalists, as well as Marxists, Peronist guerrillas or alleged sympathizers of both.\r\nIt is estimated that some 10,000 of the disappeared were guerrillas of the Montoneros (MPM), the oldest guerrilla organization, which began to operate in 1970, and the People's Revolutionary Army (ERP). Although in the period there was leftist violence involved, mostly by Montoneros, most of the victims were unarmed non-combatants, and the guerrillas were exterminated by 1979, while the dictatorship carried out its crimes until the exit from power. After the defeat in the Falklands War, the Junta called for elections in 1983. The National Commission on the Disappearance of Persons originally estimated that around 13,000 individuals were disappeared. Present estimates for the number of people who were killed or disappeared range from 9,089 to over 30,000; The military themselves reported killing 22,000 people in a 1978 communication to Chilean Intelligence, and the Mothers and Grandmothers of the Plaza de Mayo, which are the most important Human-Rights Organisations in Argentina, have always jointly maintained that the number of disappeared is unequivocally 30,000.\r\nSince 1983 Argentina has maintained democracy as its ruling system: in that year Raúl Alfonsín was elected president and soon spoke out against the Argentinian junta's use of torture and death squads who spirited away \"the disappeared\" and killed them, hiding their bodies in unknown locations. In office, Alfonsín set about punishing police and troops who were responsible for unknown thousands of deaths in the so-called \"dirty war\". By 1985 the government had promoted the Trial of the Juntas, which prosecuted and condemned the men who were at the top of the military hierarchies during the country's last dictatorship, stopping short of prosecuting the other militars and civilians who were also responsible for the period's crimes.\r\nThe second period portrayed is 1999, during the last days of Carlos Menem's administration. During this time, the national laws known as the \"Full stop\" law (\"Ley de Punto Final\") and Due Obedience – sanctioned during the 1980s – were still in effect. These legal elements, popularly known as \"the amnesty laws\", had effectively blocked the investigation of thousands of cases of human rights abuses committed during the time of the country's last dictatorship. This period of Argentina's history is shown to stress the predicament in which the character of Ricardo Morales lived, since the impunity that criminals and human rights abusers like Gómez enjoyed at the time prevented Morales to bring the former to justice: the penal system would have convicted Morales for his past actions. At the same time, many former torturers and murderers of the dictatorship – who had previously been friends or partners of Gómez – were free at the time, and would have likely taken revenge on Morales. This fact further explains why Morales isolated and locked himself up with Gómez for so many years.\r\nIn 2003 the political climate changed, and during President Nestor Kirchner's administration, the Full Stop and Due Obedience laws, along with the executive pardons, were declared null and void, first by the Congress and then by the Supreme Court. These changes, promoted by the government in 2005, enabled the judicial power to prosecute and trial all the orchestrators of State-sponsored terrorism, also including politically motivated criminal acts committed between 1975 and 1983. The crimes of that period are still being judged as of 2022.\r\nProduction\r\nFor this joint Argentine/Spanish production, Campanella returned from the United States, where he had directed episodes of the television series House and Law & Order: Special Victims Unit, to film The Secret in Their Eyes. It marked his fourth collaboration with actor-friend Ricardo Darín, who had previously starred in all three of Campanella's Argentine-produced films in the lead role. Frequent collaborator Eduardo Blanco, however, is not featured in the movie; the part of Darín's character's friend is played instead by comedian Guillermo Francella.\r\nIn addition to presenting the appropriate ambiance for Argentina in the mid-1970s, it features a formidable technical achievement in creating a continuous five-minute-long shot (designed by visual effects supervisor Rodrigo S. Tomasso), that encompasses an entire stadium during a live football match. From a standard aerial overview we approach the stadium, dive in, cross the field between the players mid-match and find the protagonist in the crowd, then take a circular move around him and follow him as he shuffles through the stands until he finds the suspect, continuing with a feverish stop-and-go chase on foot through the murky rooms and corridors beneath the stands, finally ending under the lights in the middle of the pitch. The scene was filmed in the stadium of football club Huracán, and took three months of pre-production, three days of shooting and nine months of post-production. Two hundred extras took part in the shooting, and visual effects created a fully packed stadium with nearly fifty thousand fans.\r\nReception\r\nThe Secret in Their Eyes received very positive reviews from critics, not only in Argentina, but also abroad. It holds a 89% approval rating at Rotten Tomatoes, based on 141 reviews, and an average rating of 7.7/10. The website's critical consensus is: \"Unpredictable and rich with symbolism, this Argentine murder mystery lives up to its Oscar with an engrossing plot, Juan Jose Campanella's assured direction, and mesmerizing performances from its cast.\" On the website Metacritic it holds a score of 80 out of 100, based on 36 critical reviews, indicating \"generally favorable reviews\".\r\nAccolades\r\nIt is the second Argentine film, after The Official Story (1985), to win the Academy Award for Best Foreign Language Film, making Argentina the first South American country to win the award twice. In 2016, The Secret in Their Eyes was ranked No. 91 by international critics for the BBC's 100 Greatest Films of the 21st Century.\r\nRemake\r\nIn 2015, American filmmaker Billy Ray wrote and directed a remake of The Secret in Their Eyes, under the same title. The remake starred Julia Roberts, Nicole Kidman, Chiwetel Ejiofor, Dean Norris, Michael Kelly, and Alfred Molina. The film was released by STXfilms on 20 November 2015. It received mixed reception from critics, who praised its performances but compared it unfavorably to the original.",
    "html": "<p>The Secret in Their Eyes (Spanish: El secreto de sus ojos) is a 2009 Argentine-Spanish crime drama film produced, edited, and directed by Juan José Campanella from a screenplay by Campanella and Eduardo Sacheri, and based on Sacheri's 2005 novel La pregunta de sus ojos. It stars Ricardo Darín, Soledad Villamil, Pablo Rago, Javier Godino, and Guillermo Francella. The film focuses on the relationship between judiciaries Benjamín Espósito (Darín) and Irene Hastings (Villamil) and their investigation into a murder case in 1970s Argentina.</p><p>The film marks the fourth feature-length collaboration between Campanella and Darín, after Same Love, Same Rain (1999), Son of the Bride (2001), and Moon of Avellaneda (2004). It uses a nonlinear narrative and explores the strenuous political and social climate in Argentina throughout the latter 20th century. The film is acclaimed for its feature of a continuous five-minute-long shot that runs through a large stadium in which a football match was being held.</p><p>The Secret in Their Eyes was theatrically released in Argentina on August 13, 2009. It received critical acclaim for its screenplay, thematic content, Campanella's direction, and the performances of the cast. The film grossed over $34 million worldwide, becoming the second highest-grossing Argentian film ever, behind Nazareno Cruz and the Wolf (1975). It received numerous awards and nominations, winning for Best Foreign Language Film at the 82nd Academy Awards and for Best Spanish Language Foreign Film at the 24th Goya Awards.</p><br/><h3>Plot</h3><p>In June 1974, judiciary agent Benjamin Espósito investigates the rape and murder of Liliana Colotto de Morales. Espósito promises her husband, Ricardo, he will find the killer and give him a life sentence. Espósito is helped by his alcoholic partner Pablo Sandóval and the new department chief Irene Menéndez-Hastings. Romano, Espósito's rival, accuses a pair of construction workers (one of whom is a Bolivian immigrant) of the murder, which angers Espósito upon discovering that both of them were tortured to obtain a confession.</p><p>Espósito finds a lead while looking at old photos of Liliana, which Ricardo gave him: many of them featured a man, identified as Isidoro Gómez, staring at her obsessively. Espósito and Sandóval sneak into Gómez's mother's house in Chivilcoy. During the break-in, they find some letters from Gómez to his mother. Sandóval steals them and Espósito finds out after returning to Buenos Aires. Their \"visit\" only causes them trouble with their higher-ups, and they are unable to find any evidence in the letters. Gómez is still on the loose due to a careless phone call from Ricardo to Gómez's mother, in a desperate quest for his wife's killer. Ultimately, the case is closed.</p><p>In 1975, Espósito finds Ricardo in a train station in Retiro and discovers that he was trying to find Gómez in multiple stations. Espósito convinces Menéndez to reopen the investigation. Meanwhile, while getting drunk in a bar, Sandóval makes a discovery: an acquaintance of his identifies several names on the letters – seemingly without any connection – as footballers of Racing Football Club. After identifying him as a Racing fan, Espósito and Sandóval attend a game between Racing and Huracán, in hopes of finding Gómez.</p><p>While keeping an eye on the game's attendees in Huracán's stadium, Espósito and Sandóval locate Gómez among the crowd, but a sudden goal causes a hubbub and allows Gómez to flee. A chase ensues and Gómez is caught by the stadium's security guards as he invades the pitch. Espósito and Menéndez then grill him illegally, and Menéndez makes Gómez confess by calling him physically weak, and attacking his masculinity. Gómez is tried and sentenced, but Romano bails him out one month later in order to get revenge on Espósito and hires him as a hitman for the right-wing faction of the Peronist Party. Espósito and Menéndez try to reverse it but are stopped by Romano's intervention. Espósito informs Morales that his wife's killer will never go to prison.</p><p>Weeks later, Sandóval gets in a bar fight, causing Espósito to take him to his flat and fetch his wife. They find the door pried open, his pictures flipped over and Sandóval shot dead in his room. Espósito soon concludes that Gómez/Romano sent assassins after him, but Sandóval impersonated him to protect his friend. Fearing for his life, Espósito goes into hiding for 10 years in Jujuy Province with Menéndez's cousins. Espósito returns to Buenos Aires in 1985 to find Gómez missing and Menéndez married with two children.</p><p>In 1999, Espósito tries to make sense out of the case and visits Ricardo, who moved in 1975 to an isolated cottage in a rural area of the Buenos Aires Province. Ricardo loses control when Espósito asks him how he coped with his wife's death and the unfair end of the investigation since Gómez was never seen again after becoming part of Isabel Perón’s security detail. Ricardo tells Espósito that he kidnapped and murdered Gómez years earlier, and Espósito leaves. Moments later, however, he remembers Ricardo not wanting an easy death for Gómez decades ago, and Espósito sneaks back to Ricardo’s house, where he finds Ricardo giving food to Gómez, whom he has kept imprisoned for 25 years in complete isolation, without ever talking to him. Gómez begs Espósito for human contact. Ricardo tells Espósito he promised him \"a life sentence\" as he staggers out.</p><p>Back in Buenos Aires, Espósito visits Sandóval's grave for the first time. He then goes to Irene's office, ready to confess his love to her, something she was always expecting. Smiling, she tells him to close the door.</p><br/><h3>Cast</h3><ul><li>Ricardo Darín as Benjamín Espósito, a judiciary employee in charge of solving the rape and murder of Liliana Coloto</li><li>Soledad Villamil as Irene Menéndez Hastings, a judge and Espósito's superior, who helps him with his investigation</li><li>Pablo Rago as Ricardo Morales, Lliliana Coloto's grieving widower</li><li>Javier Godino as Isidoro Gómez</li><li>Guillermo Francella as Pablo Sandoval, Espósito's alcoholic friend and assistant</li><li>Mario Alarcón as Judge Fortuna</li><li>Mariano Argento as Romano</li><li>José Luis Gioia as Inspector Báez</li><li>Carla Quevedo as Liliana Coloto</li></ul><br/><h3>Historical and political context</h3><p>The setting of the film ties its characters to the political situation in Argentina in two different time periods: 1975 and 1999. The main events transpire in 1975, a year before the start of Argentina's last civil-military dictatorship (1976–1983); the final year of the presidency of Isabel Perón saw great political turmoil, with both leftist violence and state-sponsored terrorist organization, especially at the hands of the Argentine Anticommunist Alliance (usually known as Triple A or AAA), a far-right death squad founded in 1973 and particularly active under Isabel Perón's rule (1974–1976). A military coup in 1976 triggered the so-called \"Dirty War\", which is foreshadowed in the character of Isidoro Gomez and his protection by the government due to his work helping that administration and its judicial system to find (and later kill) left-wing activists and militants or guerrilla members. The dictatorship's National Reorganization Process was a period of more than seven years (1976–1983) marred by widespread human rights violations. The state-sponsored terrorism of the military Junta created a climate of violence whose victims were in the thousands and included left-wing activists and militants, intellectuals and artists, trade unionists, high school and college/university students and journalists, as well as Marxists, Peronist guerrillas or alleged sympathizers of both.</p><p>It is estimated that some 10,000 of the disappeared were guerrillas of the Montoneros (MPM), the oldest guerrilla organization, which began to operate in 1970, and the People's Revolutionary Army (ERP). Although in the period there was leftist violence involved, mostly by Montoneros, most of the victims were unarmed non-combatants, and the guerrillas were exterminated by 1979, while the dictatorship carried out its crimes until the exit from power. After the defeat in the Falklands War, the Junta called for elections in 1983. The National Commission on the Disappearance of Persons originally estimated that around 13,000 individuals were disappeared. Present estimates for the number of people who were killed or disappeared range from 9,089 to over 30,000; The military themselves reported killing 22,000 people in a 1978 communication to Chilean Intelligence, and the Mothers and Grandmothers of the Plaza de Mayo, which are the most important Human-Rights Organisations in Argentina, have always jointly maintained that the number of disappeared is unequivocally 30,000.</p><p>Since 1983 Argentina has maintained democracy as its ruling system: in that year Raúl Alfonsín was elected president and soon spoke out against the Argentinian junta's use of torture and death squads who spirited away \"the disappeared\" and killed them, hiding their bodies in unknown locations. In office, Alfonsín set about punishing police and troops who were responsible for unknown thousands of deaths in the so-called \"dirty war\". By 1985 the government had promoted the Trial of the Juntas, which prosecuted and condemned the men who were at the top of the military hierarchies during the country's last dictatorship, stopping short of prosecuting the other militars and civilians who were also responsible for the period's crimes.</p><p>The second period portrayed is 1999, during the last days of Carlos Menem's administration. During this time, the national laws known as the \"Full stop\" law (\"Ley de Punto Final\") and Due Obedience – sanctioned during the 1980s – were still in effect. These legal elements, popularly known as \"the amnesty laws\", had effectively blocked the investigation of thousands of cases of human rights abuses committed during the time of the country's last dictatorship. This period of Argentina's history is shown to stress the predicament in which the character of Ricardo Morales lived, since the impunity that criminals and human rights abusers like Gómez enjoyed at the time prevented Morales to bring the former to justice: the penal system would have convicted Morales for his past actions. At the same time, many former torturers and murderers of the dictatorship – who had previously been friends or partners of Gómez – were free at the time, and would have likely taken revenge on Morales. This fact further explains why Morales isolated and locked himself up with Gómez for so many years.</p><p>In 2003 the political climate changed, and during President Nestor Kirchner's administration, the Full Stop and Due Obedience laws, along with the executive pardons, were declared null and void, first by the Congress and then by the Supreme Court. These changes, promoted by the government in 2005, enabled the judicial power to prosecute and trial all the orchestrators of State-sponsored terrorism, also including politically motivated criminal acts committed between 1975 and 1983. The crimes of that period are still being judged as of 2022.</p><br/><h3>Production</h3><p>For this joint Argentine/Spanish production, Campanella returned from the United States, where he had directed episodes of the television series House and Law & Order: Special Victims Unit, to film The Secret in Their Eyes. It marked his fourth collaboration with actor-friend Ricardo Darín, who had previously starred in all three of Campanella's Argentine-produced films in the lead role. Frequent collaborator Eduardo Blanco, however, is not featured in the movie; the part of Darín's character's friend is played instead by comedian Guillermo Francella.</p><p>In addition to presenting the appropriate ambiance for Argentina in the mid-1970s, it features a formidable technical achievement in creating a continuous five-minute-long shot (designed by visual effects supervisor Rodrigo S. Tomasso), that encompasses an entire stadium during a live football match. From a standard aerial overview we approach the stadium, dive in, cross the field between the players mid-match and find the protagonist in the crowd, then take a circular move around him and follow him as he shuffles through the stands until he finds the suspect, continuing with a feverish stop-and-go chase on foot through the murky rooms and corridors beneath the stands, finally ending under the lights in the middle of the pitch. The scene was filmed in the stadium of football club Huracán, and took three months of pre-production, three days of shooting and nine months of post-production. Two hundred extras took part in the shooting, and visual effects created a fully packed stadium with nearly fifty thousand fans.</p><br/><h3>Reception</h3><p>The Secret in Their Eyes received very positive reviews from critics, not only in Argentina, but also abroad. It holds a 89% approval rating at Rotten Tomatoes, based on 141 reviews, and an average rating of 7.7/10. The website's critical consensus is: \"Unpredictable and rich with symbolism, this Argentine murder mystery lives up to its Oscar with an engrossing plot, Juan Jose Campanella's assured direction, and mesmerizing performances from its cast.\" On the website Metacritic it holds a score of 80 out of 100, based on 36 critical reviews, indicating \"generally favorable reviews\".</p><h4>Accolades</h4><p>It is the second Argentine film, after The Official Story (1985), to win the Academy Award for Best Foreign Language Film, making Argentina the first South American country to win the award twice. In 2016, The Secret in Their Eyes was ranked No. 91 by international critics for the BBC's 100 Greatest Films of the 21st Century.</p><br/><h3>Remake</h3><p>In 2015, American filmmaker Billy Ray wrote and directed a remake of The Secret in Their Eyes, under the same title. The remake starred Julia Roberts, Nicole Kidman, Chiwetel Ejiofor, Dean Norris, Michael Kelly, and Alfred Molina. The film was released by STXfilms on 20 November 2015. It received mixed reception from critics, who praised its performances but compared it unfavorably to the original.</p><br/>"
  },
  "errorMessage": ""
}