{
  "imDbId": "tt0047396",
  "title": "Rear Window",
  "fullTitle": "Rear Window (1954)",
  "type": "Movie",
  "year": "1954",
  "items": [
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0052668",
      "warningSpoilers": false,
      "date": "20 June 2001",
      "rate": "",
      "helpful": "165 out of 193 found this helpful.",
      "title": "A Deep & Entertaining Classic",
      "content": "One of Hitchcock's greatest masterpieces, \"Rear Window\" is a deep and entertaining classic with many strengths, and a little bit of everything. A fine suspense story is combined with romantic tension in the main plot, and there are numerous sub-plots, some humorous and some moving, all with many psychological overtones. The main characters are wonderfully portrayed and full of life. The apparently simple setting in an apartment complex is developed into a world filled with intriguing and sometimes unsettling possibilities, and this apparently average neighborhood comes to life with a wealth of lavish visual detail and interesting minor characters. It is the kind of film-making that (like many of Hitchcock's greatest movies) is very flattering to the viewer. The director assumes that his audience will pay close enough attention to appreciate the many subtleties with which he has filled the movie. It rewards both careful attention and repeated viewings, since there is much more here than merely a suspense plot, as good as that story is in itself.For the first 30 minutes or so, we simply get to know the characters. Jimmy Stewart gives one of his best performances as a photographer recuperating from an injury, forced to spend several weeks staring out his apartment window at the minor dramas in the lives of his neighbors. Grace Kelly is ideal in the role of his perfect girlfriend, who can never find a way to break down Stewart's reserve. The study of their relationship would have made a good movie by itself. Almost every action and every word between them is filled with meaning, and what they see in the lives of others is an interesting reflection of the tensions and possibilities in their own present and future. Thelma Ritter is wonderful as a colorful, no-nonsense nurse who constantly sheds some light - sometimes unwanted - on what is happening between them. The action and suspense that occur later serves in large part as a catalyst that resolves some of the important issues between the two.After we get to know the characters and their world, things start to happen, as Stewart becomes engrossed in some of the things he has seen. The ethical and moral concerns of meddling in others' affairs become intertwined with more urgent questions about what may have happened in those other apartments, and from then on the tension builds steadily. It leads up to a riveting climactic sequence filled with suspense, and made even more meaningful by our awareness of its deeper significance to the main characters.There is much more that could be said, but you should see this for yourself. It is a classic that will be enjoyed not only by thriller fans, but by anyone who appreciates carefully crafted movies with a lot of depth."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1230107",
      "warningSpoilers": false,
      "date": "3 December 2005",
      "rate": "10",
      "helpful": "234 out of 296 found this helpful.",
      "title": "Well of course when you've got nothing better to do with a broken leg you will accuse your neighbor of murder!",
      "content": "Finally, I watched \"Rear Window\" by famous Alfred Hitchcock. First off, I saw this movie on the top 250, and it's #14 on top of that! I mean, it's gotta be great or a classic, right? Also, I'm a fan of the Simpsons, and I got the 6th season where Bart breaks his leg and has to watch the kids outside and accuses Flanders of murdering his wife, Maude. I watched it with commentary and the writers said this was taken from the movie \"Rear Window\", I had to see this movie! I know it sounds silly that I was more inspired by a show, but it's a good reference if it's from The Simpsons.\"Rear Window\" is an excellent movie and a great classic that should never be forgotten! After 51 years, this is still a well talked about movie and I can see why. Jimmy Stewart, he's just so great as L.B., I loved his madness and his dark comical role. He doesn't even try, but you can't help but laugh at a lot of his lines, the way he looks, and the way he presents every scene. He didn't have a lot of movement, he is confined to a wheel chair, but he is so effective and perfect. No one could have replaced him as L.B., he's a terrific actor! Grace Kelly, what a beauty! Beauty and talent, what a great combination and she had it. Playing Liza, I loved her character so much. She started out as this extremely feminine lovely woman who is struggling with L.B., because he is having doubts about marrying her, and you can tell she loves him so much and is willing to do anything for him and to make their lives work, despite his adventurous side as a photographer and her being an indoor kitten. When L.B. talks of the murder to Liza, she is doubtful but never dismisses that it could be a possibility, and stays with him into the end. She finally goes into danger and grabs it by the you know what and wins L.B.'s heart.I loved the ending, to me it was just one more good laugh with L.B. and Liza. I won't tell, you'll just have to trust me, it was a brilliant way to breath and smile again after all the suspense and drama. \"Rear Window\" is a true classic and I'm extremely grateful to the reviewers of IMDb who saw this movie and gave it great reviews, and the writers of The Simpsons! If it were not for you guys, I nor other members of my generation would probably not view it! Let's keep this classic alive! 10/10"
    },
    {
      "username": "FlickJunkie-2",
      "userUrl": "https://www.imdb.com/user/ur0556711",
      "reviewLink": "https://www.imdb.com/review/rw0052655",
      "warningSpoilers": false,
      "date": "10 April 2001",
      "rate": "10",
      "helpful": "124 out of 147 found this helpful.",
      "title": "Another Hitchcock masterpiece",
      "content": "Alfred Hitchcock is considered by most to be the master of suspense. I believe he was also a master of understanding human nature. He intuitively understood that human beings are voyeurs by nature, not in the perverted sense, but in the curious sense. We are a species that slows down to look at accident scenes and steals furtive glances at lovers in the park who are oblivious to everything but each other. A major appeal of cinema and television is that they offer us an opportunity for guilt free voyeurism. When we watch a film, aren't we in essence looking through a window and watching people who behave as if they don't realize we are there?Hitchcock realized this and took voyeurism to the next level, allowing us to watch a voyeur as he watched others. While `Rear Window' as a whole is probably not quite at a level with `Vertigo' (which was far more suspenseful and mysterious with a powerful musical score) as a cinematic accomplishment, it is more seductive because it strikes closer to our human obsessions. Hitchcock's mastery is most evident in his subtle use of reaction scenes by the various characters. We watch an event that Jeff (James Stewart) is watching and then Hitchcock immediately cuts to his reaction. This is done repeatedly in various layers even with the other tenants as they interact with one another. For instance, in the scene with Miss Lonelyheart (Judith Evelyn), we see her throw out the man who made a pass at her and then we see her reaction after she slams the door, followed by the reaction of Jeff and Lisa (Grace Kelly). In another scene, Detective Doyle (Wendell Corey) sees Lisa's nightclothes and presumes she will be staying the night. Hitchcock shows the suitcase, then Doyle's reaction, and then he goes to Jeff who points his finger at him and says `Be Careful, Tom'. This elegant scene takes a few seconds and speaks volumes with little dialogue. Such technique gets the viewer fully involved, because if we were there this is exactly what we would be doing, watching the unfolding events and then seeing how others around us responded. In essence, it puts us in the room with them.Hitchcock was a stickler for detail. For instance, he aimed the open windows so they would show subtle reflections of places in the apartment we couldn't see directly. However, there were certain details included or excluded that were inexplicable. Would Thorwold really be scrubbing the walls with the blinds open? Would Lisa be conspicuously waving at Jeff while Stella (Thelma Ritter) was digging up the garden? Moreover, wouldn't Lisa have taken off her high heels before climbing a wall and then a fire escape? This film had numerous small incongruities that are normally absent from Hitchcock films. Though these are picayune criticisms, they are painfully obvious in the film of a director known to be a compulsive perfectionist.The acting is superb in this film. Jimmy Stewart is unabashedly obsessed as the lead character. Photographers have an innate visual perceptiveness and the ability to tell a story with an image and Stewart adopts this mindset perfectly. Grace Kelly has often been accused of being the `Ice Maiden' in her films, yet in this film she is assertive and even reckless. Though cool at times, she is often playful and rambunctious. I always enjoy Thelma Ritter's performances for their honesty and earthiness and this is another example of a character actor at her best. Raymond Burr often doesn't get the recognition he deserves for this role, which is mostly shot at a distance with very few lines. Yet, he imbues Thurwold with a looming nefariousness using predominantly physical acting.This film was rated number 42 on AFI's top 100 of the century sandwiched between `Psycho' (#18) and `Vertigo' (#61). I personally think more highly of `Vertigo' but it is a minor distinction, because I rated them both 10/10. `Rear Window' is a classic, a masterpiece of filmmaking technique from a director who was a true pioneer of suspense."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2084724",
      "warningSpoilers": false,
      "date": "22 June 2009",
      "rate": "10",
      "helpful": "24 out of 29 found this helpful.",
      "title": "Sophisticated Hitchcock, with a wonderful performance from James Stewart!",
      "content": "Rear Window is a one of the more sophisticated Hitchcock films, and I will always consider it a masterpiece. It has tension, suspense, humour, has a strong voyeuristic tone to it and moves along at a good pace. The cinematography was truly excellent, dark in some scenes and beautiful in another. The script is fantastic and genuinely memorable(Thelma Ritter's wisecracks especially), likewise with the story, about a man who is convinced that his neighbour has killed his wife. I have always considered Rear Window's main merit to be the performance of James Stewart, he was perfect as Jeff, the man who is in a wheelchair, due to a broken leg. The other performances go without fault either, especially from the beautiful Grace Kelly as Lisa and Raymond Burr in a chilling performance as \"the villain of the piece,\" Mr Thorwold. The music was expressive and atmospheric courtesy of Franz Waxman, and the climax was possibly the highlight of the film, after Stewart's performance. The 1954 version of Rear Window will always be a classic, not the inferior TV remake with Christopher Reeve. All in all, a must see for those who are fans of Hitchcock. 10/10 Bethany Cox."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0052869",
      "warningSpoilers": false,
      "date": "15 January 2004",
      "rate": "10",
      "helpful": "64 out of 85 found this helpful.",
      "title": "In the mid-fifties, Hitchcock brought remarkable suspense by reverting to the logic of a silent film (with an observer behind the lens as the hero)",
      "content": "Many reviewers and critics have commented on Alfred Hitchcock's theme of the voyeur in Rear Window (the mere thought of a voyeur in a suspense film conjures up images from other classic Hitchcock films), and I felt that voyeuristic bug as well. But I realized something that I hadn't thought of as I watched it for the first time- this is a return for Hitchcock to his skills as a master of silent-film chills. As L.B. Jeffries (Jimmy Stewart in one of his most infamous performances) is in his wheelchair viewing out one perspective to other inhabitants in the apartment, the audience views right along-side him. So, for more or less 50 percent of the film, the only sounds we hear are the sounds of mere realism, as Hitch's camera keeps a close eye on things. As the thrills build in the second hour of the film there is considerably more dialog than the first hour. This could, and occasionally does, present a challenge for the audience member that could either be accepted & payed off or resented- can one sit back and just watch things unfold as in a film from the 20's? Personally, the experience of seeing these events unfold and increase was near electrifying. Along with Stewart's performance, which ranges from amusing to terrified, compelling to frightened (i.e. Hitch's 'everyday man'), there's Grace Kelly as Lisa, who carries her own beauty & inner conflicts, and Raymond Burr as Thorvold, who could have things going a little better with his wife. If we empathize with Jeff, it's because we become as much apart of his mind-set/POV as he already is, and that's the ticket to the film's true success. Not only is there a magnetic kind of skill to which Hitchcock (and cinematographer Robert Burks) presents us with the apartments' supporting and minor characters and how their fates are played out against the enclosed backdrop, but the psychology of Jeff becomes parallel, or against, to the audience's. This is the story of one man's temptation and compulsion to be involved with those he can see (much like movie-goers have with any given film), and how perception of the realities around him become ours. Rear Window may have become dated for some movie-goers, particularly since the theme has been played on by other movies and TV shows (like The Simpsons for example). Yet there is a certain effectiveness to it all, even in the earlier scenes, that holds an edge over imitators. A+"
    },
    {
      "username": "dxia",
      "userUrl": "https://www.imdb.com/user/ur3074289",
      "reviewLink": "https://www.imdb.com/review/rw0052899",
      "warningSpoilers": false,
      "date": "8 April 2004",
      "rate": "10",
      "helpful": "383 out of 437 found this helpful.",
      "title": "Our Obsession with Voyeurism",
      "content": "After viewing 'Rear Window' again, I've come to realize that Alfred Hitchcock was not only a great moviemaker but also a great moviewatcher. In the making of 'Rear Window,' he knew exactly what it is about movies that makes them so captivating. It is the illusion of voyeurism that holds our attention just as it held Hitchcock's. The ability to see without being seen has a spellbinding effect. Why else is it so uncommon to have characters in movies look directly into the camera? It just isn't as fun to watch someone when they know you're there. When we watch movies, we are participating in looking into another world and seeing the images of which we have no right to see and listening to the conversations that we should not hear. 'Rear Window' and Powell's 'Peeping Tom' are some of the best movies that aren't afraid to admit this human trait. We are all voyeurs.When watching 'Rear Window,' it is better to imagine Alfred Hitchcock sitting in that wheelchair rather than Jimmy Stewart. When the camera is using longshots to watch the neighborhood, it is really Hitchcock watching, not Stewart. Hitchcock's love of voyeurism is at the center of this movie, along with his fascination with crime and his adoration of the Madonna ideal.In many of Hitchcock's movies, 'Rear Window,' 'Vertigo,' 'Psycho,' 'The Birds,' etc, the blonde actresses are objects. Notice how rarely they get close with the male leads. In 'Vertigo,' Stewart's character falls in love with the image of Madeleine; in 'Psycho,' we see the voyeur in Hitchcock peeking out of Norman Bates at Marion; and in 'Rear Window,' Jeff would rather stare out of his window than to hold the beautiful Lisa by his side. For Hitchcock, these women are ideals that should be admired rather than touched.However, the story of 'Rear Window' isn't about the image of women, as it is in 'Vertigo.' 'Rear Window' focuses more on seduction of crime, not in committing it but in the act of discovering it. At one point in the story, Jeff's friend convinces him that there was no murder, and Jeff is disappointed, not because someone wasn't dead but because he could no longer indulge into his fantasy that someone was. Think how popular crime shows are on television, and noir films at the movies. People do not want to commit crimes; they want to see other people commit them.'Rear Window' is one of the most retrospective movies I've ever seen. In a span of two hours, it examines some of the most recurrent themes in film. When we watch 'Rear Window,' it is really us watching someone watch someone else. And all the while, Hitchcock is sitting on the balcony and seeing our reaction. It is an act of voyeurism layered on top of itself, and it allows us to examine our own behavior as we are spellbound in Hitchcock's world. The only thing that I feel is missing in the movie is a scene of Jeff using his binoculars and seeing himself in a mirror. Why did Hitchcock leave it out? Maybe because it would have been too obvious what he was doing. Or maybe he was afraid that the audience would see themselves in the reflection of the lens."
    },
    {
      "username": "michaelRokeefe",
      "userUrl": "https://www.imdb.com/user/ur0449021",
      "reviewLink": "https://www.imdb.com/review/rw0052777",
      "warningSpoilers": false,
      "date": "18 June 2000",
      "rate": "9",
      "helpful": "68 out of 96 found this helpful.",
      "title": "Tremendous thriller. Classic Hitchcock.",
      "content": "In '54, I was seven years old and this is one of the first 'grown up' movies I remember seeing. I have seen it at least ten times since and realize seeing something different each time.James Stewart is a photographer in a wheelchair recovering from an accident. He passes the time by watching his neighbors out his apartment window. He thinks that he witnessed a murder and has trouble convincing his girlfriend, Grace Kelly, to help prove a crime was committed.Three scenes that always stuck with me:(1) Stewart fighting off his attacker with flashbulbs (2) the smoldering kiss (3) the glowing cigarette in the dark apartment.Every bit a classic. I think this is THE BEST Hitchcock movie. No offense intended toward PSYCHO, but this movie has the more human aspects of fear and terror. This super cast includes Raymond Burr, Thelma Ritter and Wendell Corey."
    },
    {
      "username": "yocarlosvarelapr",
      "userUrl": "https://www.imdb.com/user/ur83241390",
      "reviewLink": "https://www.imdb.com/review/rw4130958",
      "warningSpoilers": false,
      "date": "15 April 2018",
      "rate": "10",
      "helpful": "227 out of 241 found this helpful.",
      "title": "Rear Window is 64",
      "content": "I must say, no signs of aging. Embedded in its day and yet totally relevant. Perhaps the most entertaining of all of Hitchcock's films. Marriage is the theme and murder is the hook. James Stewart is as perfect as he's ever been. He uses the contradictions of his character to create someone immediately familiar. Thelma Ritter's practicality includes a rant about the destructive effect of intelligence. Grace Kelly enters the scene like a character in a dream. She remains a sort of dream that's why to see her climb the killer's balcony is one of my most cherished film memories. If you haven't seen the film you may think I'm rambling but if you have, you know exactly what I mean, don't you?"
    },
    {
      "username": "DennisLittrell",
      "userUrl": "https://www.imdb.com/user/ur0226855",
      "reviewLink": "https://www.imdb.com/review/rw0052812",
      "warningSpoilers": true,
      "date": "16 August 2002",
      "rate": "8",
      "helpful": "77 out of 105 found this helpful.",
      "title": "Midcentury voyeurism",
      "content": "This is the quintessential Hitchcock flick, easy to understand, addictively interesting, featuring great stars (Grace Kelly and James Stewart), familiar bit players (Thelma Ritter in one of her best roles as Stewart's talkative nurse), and a kind of almost imperceptible satire on the human animal. In this case, Hitchcock has glorious fun displaying a whole range of human behaviors through the device of watching them through a Greenwich Village rear window before the age of air conditioners when everyone had to leave their windows open (and some even slept on the fire escape–I've done that) to cope with the appalling heat and humidity during an eastern seaboard heatwave.James Stewart stars as L.B. Jeffries, an adventurerous photographer who has a broken leg and is confined to his apartment in a cast while it heals. Bored beyond belief, he becomes a voyeur of his neighbors. Meanwhile there is his girlfriend, none other than Grace Kelly playing a \"too perfect\" socialite intent on winning his heart and soul. Trouble is Jeff worries that it won't work out, that they are essentially incompatible, she a socialite, who always goes first class, he a roughing it man of the world comfortable with second class accommodations. Naturally the audience (me!) finds it incredible that he isn't madly in love with her.Raymond Burr (long TV's Perry Mason) in gray hair and specks has an interesting role as Lars Thorwald, seen almost entirely from a distance across the courtyard doing very suspicious things with knives and suitcases and mysterious comings and goings in the middle of the night. Bored voyeurs wonder what is going on. There is some light romantic play between Stewart and Kelly, but it is decidedly secondary to the voyeuristic adventures seen through the rear window: the saga of Miss Lonelyhearts, the ardor of the newlyweds, the angst of the songwriter, the exhibitionism of the dancing beauty, the pampered dog in a basket, and Thorwald and his invalid and then missing wife. Hitchcock's America at midcentury. Each of the little stories within the story has a plot and a resolution: Miss Lonelyhearts finds her man. The songwriter finds somebody who appreciates his work. Dancing beauty's man (looking from a distance a little like Woody Allen in an army uniform) returns. The groom seeks a break from his exhaustive marital duties, etc. Hitchcock's sense of satire has the softest touch, which is why, I think, he is so beloved. In the final scene Grace Kelly, finding her man asleep, puts down the adventure book she is reading (for his benefit) and picks up Harper's Bazaar to check the fashions. One gets the sense of future marital bliss and especially, marital reality.There is some tension and some mystery, but nothing too strenuous for little old ladies from Pasadena, and nothing to offend anybody and nothing too graphic. You can see this with the kids and your maiden aunt and all will find it interesting. See it for Thelma Ritter, the sadonic character actress of many films, most notably this and All About Eve (1950).(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)"
    },
    {
      "username": "dtb",
      "userUrl": "https://www.imdb.com/user/ur0292400",
      "reviewLink": "https://www.imdb.com/review/rw0967307",
      "warningSpoilers": false,
      "date": "24 November 2004",
      "rate": "10",
      "helpful": "148 out of 195 found this helpful.",
      "title": "Reading from Top to Bottom...Hitchcock's Sophisticated Masterpiece",
      "content": "Not only does REAR WINDOW (RW) have Alfred Hitchcock's trademark wit, suspense, and romance (with a touch of friction) in spades, but it's one of his most well-crafted, cleverly-staged movies; in fact, even though RW is based on a Cornell Woolrich story, I can't imagine this story being told as effectively in any medium other than cinema. However, the technical accomplishments (explained most entertainingly in the DVD's documentaries) would be nothing without the engaging characters. James Stewart's neighbors are interesting enough to warrant their own movies, and in addition to providing a wry microcosm of New York City life (the only dated thing about it is the lack of air conditioning), they all reflect possible outcomes for the somewhat stormy romance between laid-up shutterbug Stewart and the luminous Grace Kelly as his upscale fashion maven inamorata. As Brent Spiner said while hosting a showing of RW on TNT, the real perversion of the film is Stewart's reluctance to commit to the irresistible Kelly! In fact, one of the things I like about the movie is the way it shows these two very different people gradually learning to compromise and work together. The piquant final shot shows that a woman can have a happy relationship with a man without submerging her own personality -- refreshing for the 1950s! Great supporting cast, too, including Wendell Corey, Raymond Burr in one of his last bad-guy roles before PERRY MASON, and the scene-stealing Thelma Ritter. Incidentally, the restored special edition RW DVD was put together just in time to include Georgine Darcy (\"Miss Torso\"), then one of the last surviving cast members. Darcy died earlier this year; she will be missed."
    },
    {
      "username": "telegonus",
      "userUrl": "https://www.imdb.com/user/ur1116241",
      "reviewLink": "https://www.imdb.com/review/rw0052656",
      "warningSpoilers": false,
      "date": "8 April 2001",
      "rate": "9",
      "helpful": "119 out of 173 found this helpful.",
      "title": "The Master In Control",
      "content": "Alfred Hitchcock's Rear Window, wittily written by John Michael Hayes, is one of his many films I think of as much of a technical exercise as anything else. It is in this sense like his silent The Lodger, the static, confined Lifeboat, and the cut-less, one set Rope. Considered in this light it is a cold masterpiece, playing more with the audience's thoughts and fears than with its softer, more personal emotions. As such, it is a very cerebral and satisfying piece of work. The plot is deceptively simple: a photographer (James Stewart) is stuck indoors with his leg in a cast during a hot New York summer. His socialite girl-friend (Grace Kelly) is eager to marry him but Stewart has his doubts, since he lives a wandering life and is from a different social class. He spends most of his time idling about and playing with his camera. In time he becomes a voyeur (which he probably already is, to a degree) and begins to observe his neighbors' private lives, as he views them through his lens in the courtyard. He develops attitudes toward each of them, ranging from mild amusement to empathy to sexual interest, depending on who he's looking at. Without realizing it he is really looking at different aspects of either himself or his relationship with Kelly. The courtyard is a kind of mirror of his soul. These people and their predicaments represent different sides of his (and to a lesser extent Miss Kelly's) personality, offering glimpses of potential past, present and future selves; and it is not always a flattering picture. The newlyweds are continually having sex; Miss Torso is a beautiful young woman who entertains many suitors; there is a childless, somewhat pathetic-seeming middle-aged couple who dote over a pet dog; Miss Lonelyhearts is a depressed, aging spinster with no apparent friends; and the young, bachelor song-writer, when he isn't trying to compose songs, is either throwing parties or fits. Then there are the Thorwalds, a squabbling couple across the way. Stewart is at first only slightly interested in them until Mrs. Thorwald disappears and her husband starts going out at night carrying paper parcels that look like they came from a butcher shop. Soon Stewart is, understandably, suspicious. He convinces Kelly that something is amiss, but has trouble with his detective friend. His nurse Stella agrees that something is wrong across the courtyard, and the threesome become amateur detectives. Rear Window is great fun. It's a thriller, a romance, a mystery, and at times a comedy of manners. The actors all give superb, unflashy performances. Hitchcock had been making movies for three decades by the time he undertook this one, and he knew exactly what he was doing; everything happens as it should, on time, with no fuss or bother. The courtyard set is magnificently designed and photographed; it looks both artificial and realistic, and seems almost to change at times, as circumstances dictate. This is, after Dial M For Murder, Hitchcock's first truly 'fifties' film, which is to say it is a far cry from the genteel romances and spy stuff he'd been doing before. There's less use of atmosphere here, as a new, more independent director was emerging, decidedly post-Selznick, often using color. Hitchcock is playing a sort game of cinematic chess, moving people and things around here and there, changing camera angles slyly, never showing his hand. The film lacks only warmth. All sorts of learned books and articles have been written about this picture, some of them quite silly; all at least partly right. This is at times a profound film, but it also aims to entertain, it has a light touch, and it can be scary, it's romantic about couples and cynical about people. There's a little bit of everything in it,--it's a work of art."
    },
    {
      "username": "Aidan McGuinness",
      "userUrl": "https://www.imdb.com/user/ur0839067",
      "reviewLink": "https://www.imdb.com/review/rw0052821",
      "warningSpoilers": false,
      "date": "12 November 2002",
      "rate": "",
      "helpful": "107 out of 145 found this helpful.",
      "title": "Excellent. Sharp, clever, funny, inventive, with great values all round.",
      "content": "Ah it's a movie that's in IMDB's Top 20, and it has good reason to be. For starter's let's look at the simple premise - James Stewart is L. B. Jeffries, a photographer who is currently recovering from an injury on assignment. With his broken leg he's stuck in his apartment, with nothing better to do than spy on his neighbours and be visited by his girlfriend, Lisa Carol Fremont (Grace Kelly), his officer friend Wendell, and his nurse, Stella. Jeffries observes the coming and goings of the various apartments he can observe (from his rear apartment window) and it is one of these - a Raymond Burr - who draws his attention because. could it be that the man has committed some heinous crime? Let's find out.One of the beautiful things about the movie is its superb use of location. The whole movie, bar a couple of brief scenes, is set in the apartment. This would seem claustrophobic but Hitchcock never inhibits us like this - he lets us escape through Jeffries binoculars and camera lenses, and his roving camera swoops down to let us see what the characters see (but never, thankfully, anything more than that - this is how you do suspense!). The set design is wonderful - the apartment is just the right size and is nicely laid out. However the real praise is for all the other apartments visible to Jeffries - an actual habitable set with multiple stories where characters can be observed only as they pass by their own windows (yeah, they don't care much for curtains). There's a sense of individuality gone in to each home, despite the fact we can only see barely elements of each. This is helped by a nice, differing range of characters inhabiting each and going about their daily lives - there's a mini soap-opera contained in the movie, all observed at a distance. Excellent stuff.Acting? It's great here. There's some nice depth to the characters here, with them feeling like actual real people rather than slick one-dimensional tags. Stewart is very proficient in this type of role - he was born to it - and Kelly proves she is more than just a pretty face, managing to effuse her character with both grace (*groan*) and steel. Even supporting characters like Stella are good (she has a wickedly black sense of thinking that's hilarious). What's so incredible is that the characters we observe from a distance in the other apartments (and with whom we never actually interact with) have as much depth as most main characters in movies nowadays. Excellent script and acting in this movie.I've already praised Hitchcock's set location and camera work, so I won't prattle on about him much more. He does a stellar job here and, in my opinion, this is the best piece of work he's done (that I've seen). It's virtually flawless and you're never let down (or bored). Well done. It's a shame he lost out on an Oscar (although he did have tough competition that year with `On the Waterfront').`Rear Window' is a great example of how you can successfully have sharp acting, script, and directing and not feel the need for a slew of swear words and gratuitous violence. Regarded as a classic, and deservedly so. 9.1/10"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0052660",
      "warningSpoilers": true,
      "date": "23 April 2001",
      "rate": "",
      "helpful": "32 out of 47 found this helpful.",
      "title": "Copernican Cinema",
      "content": "Spoilers herein.I just don't like Hitchcock. I admit that he `delivered value' in his day, but as I review his films today, I find them trite, badly dated. The style of acting he used now looks `actorly.' His camera framing is well considered but unimaginative by today's standards. The stories are not engaging (to me).But this film really is a classic. Not because of the acting or the dialog, but because it was so cleverly conceived. And because the execution is so purely cinematic.The first problem a writer/director faces is what stance the camera takes. Is it a fairly static `audience' as if you were watching a play? Is it godlike in always seeing things from the best perspective, though sometimes humanly impossible? Is it a character? Or does it follow a character sometime showing their point of view, sometimes their reaction? Does it act?Do we admit the camera exists -- by introducing jiggle, or showing operator's functions like focusing, developing? Do we dissolve the camera's perspective by juggling time or perspectives? Do we try a `100 simultaneous cameras' approach?Hitchcock usually uses the static theatrical approach -- way too much for modern tastes. He punctuates this by sometimes doing a character focused shot, and sometimes a spectacular-for-the-time godshot -- as in the `Psycho' shower scene.But this film is more purely conceived for the camera. There are no godshots. Nearly all the camerawork is from Jeff's eye, or of Jeff's apartment, with a few notable exceptions. What is novel is why this works -- the set and entire story were composed backwards. That is, instead of having some slice of life that the camera discovers, this reality exists as if it were created by the camera before the action starts. Everything that is required to motivate the world is comprehensible from that apartment -- the entire physics of this world is based on its center.In other words, Hitchcock's achievement here is not how he accommodates the camera to the world, but the world to the camera.Pure genius."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1250678",
      "warningSpoilers": false,
      "date": "30 December 2005",
      "rate": "9",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Enforced Idleness",
      "content": "Alfred Hitchcock's second film with James Stewart is the story of Stewart's enforced idleness due to a broken leg. He's an active man, a news photographer, who constantly pushes himself into dangerous situations to get a picture and got a broken leg incidentally. Idleness for him is sure torture.Fortunately or unfortunately as things turn out he has a Greenwich Village apartment with a Rear Window that allows him to look on the neighbors across the courtyard. It's like watching about 15 different soap operas at once. And with his photographic equipment including a zoom telephoto lens, Stewart gets himself involved with the various soap opera plots.Stewart also has a girl friend in Grace Kelly who is playing a part that is really no stretch for her, a Park Avenue chic and rich woman who's really had quite a life of comfort. Stewart doesn't think she's ready for his kind of life and they have a running quarrel.That is until Stewart puts some conclusions together from observing one of the apartments and he thinks that salesman Raymond Burr has killed his wife. Although he can't convince his detective friend Wendell Corey, he does slowly convince Grace Kelly and Thelma Ritter his nurse of the validity of his conclusions.Everyone here does a creditable job, but I think the best performance comes from Raymond Burr. Burr, who played a lot of villains on the screen, usually plays them tough and mean. Hitchcock did a superb job in getting a performance of a really frightened man. Seeing the story of Burr and his wife through Stewart's eyes, it's the story of two very ordinary people apparently mismatched. Up until the last 15 minutes of Rear Window, we see Burr at a distance like the rest of Stewart's soap operas. When we do see him up close we find a very ordinary, but frightened man. It's his very ordinariness that makes Burr so frightening. The audience sees themselves in him, could we commit murder if sufficiently pushed hard enough?I suppose if James Stewart had a broken leg in 2005 and was laid up that way, he'd be busy on his personal computer and wouldn't have time to be looking across the courtyard. Televisions were still a luxury item in 2005. My grandparents still didn't have one at that date. Today Stewart could get all the afternoon soap opera action he wanted.A remake of Rear Window was done in 1998 with Christopher Reeve. Of course the difference is that Reeve was a paraplegic and dealing with a real and permanent situation on film and in his life. It was a whole new kind of Rear Window.Rear Window has all the elements one expects from Hitchcock, thrilling plot, witty and sophisticated dialog and a wry conclusion to it all. A very enjoyable film."
    },
    {
      "username": "bLuR-7",
      "userUrl": "https://www.imdb.com/user/ur0844285",
      "reviewLink": "https://www.imdb.com/review/rw4060819",
      "warningSpoilers": false,
      "date": "12 February 2018",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "First-rate thriller",
      "content": "Having watched it for the second time recently, I was struck by how razor-sharp the film's script actually was. Sure, it didn't have a big Agatha Christie-type mystery reveal; but the banter and repartee between the main characters was just so well-written. Of course, the film's framing and camerawork is legendary (for good reason) and Grace Kelly has a luminous screen presence. Suspenseful, intriguing, and a film that shows off a master at the peak of his craft."
    },
    {
      "username": "moonspinner55",
      "userUrl": "https://www.imdb.com/user/ur0989035",
      "reviewLink": "https://www.imdb.com/review/rw1205109",
      "warningSpoilers": false,
      "date": "30 October 2005",
      "rate": "8",
      "helpful": "14 out of 21 found this helpful.",
      "title": "A colorful, friendly story...about a murder",
      "content": "Exceptionally likable movie about a desperate killer and his secret murder, yet also one about the bond of friendships and the camaraderie which arises in the face of exciting danger. Photographer James Stewart, laid up with a broken leg, gets to know the neighbors in his housing complex--by watching them all day out his back window (it's a sticky hot summer and everyone has their lashes up). This Alfred Hitchcock thriller gets off on the wrong foot by introducing Stewart's love-interest, Grace Kelly, rather clumsily. Kelly is supposed to look out of place in Stewart's rumpled apartment, with her designer dresses and Park Ave. manner, and we're meant to see that they are possibly an inappropriate match; however, Kelly's character wounds too easily, and the argument that ensues between she and Stewart isn't convincing. Luckily, she's allowed to warm up soon after, and she's wonderful when teamed with Thelma Ritter as Stewart's sharp little nursemaid. Ritter, in one of her best roles, keeps score on all that's going on and soon all three are involved in some mysterious doings happening across the courtyard. Dandy yarn has one of the most satisfying wrap-ups for a Hitchcock picture, and three fine actors who really get into these roles. It's squirrelly and suspenseful, quite amiable and masterfully done. ***1/2 from ****"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0052779",
      "warningSpoilers": true,
      "date": "23 June 2000",
      "rate": "10",
      "helpful": "67 out of 115 found this helpful.",
      "title": "\"Rear Window\" describes Hitchcock at his best...",
      "content": "\"Rear Window\" comes very close to be the perfect Hitchcock film that illustrates nearly all his great abilities...Hitchcock demonstrates in \"Rear Window\" that he is a great voyeur, that he loves to spy on his characters making each viewer into a voyeur, forcing audience to see everything from his hero's point of view... James Stewart is hold up in his Manhattan two rooms apartment with a broken leg... He passes his time spying on his neighbors through back window in an orgy of voyeurism...Speaking of technical challenge, \"Rear Window\" is Hitchcock prototype... Most of the film is shot from one confined set... It is also notably theatrical since it takes place in one room...Hitchcock forces limitations on himself, as he did in \"Lifeboat\" when he shot entirely on a restricted set, in only one boat... And in \"Rope\" (his first Technicolor film) where the single setting for the production had only walls and furniture...Having restricted his movements, Hitchcock is demanded to be ingenious in order to keep curiosity alive... He builds a realistic courtyard of apartments with inhabitants in it, and the restriction becomes a potency and the technique a fascinating example of what he chooses to call \"pure cinema.\"Hitchcock's camera tracks out through the windows... It never goes inside the apartments... We never see close-ups of the characters... We can only see what Stewart sees... We feel like we are watching people through a window instead of in a movie...Hitchcock doesn't use any kind of music... We hear natural sounds, occasional live music played in the surrounding apartment...\"Rear Window\" describes Hitchcock at his best for the way it works on several levels, yet hides its own complexity... Stewart, tied in too by pressure from his high society girl who loves him and wants to marry him... Everything he sees out is related to this problem... He avoids to discuss marriage with her, though he himself does not seem to realize it...All the while, the people in the 31 apartments that he can see live out their little lives The tormented middle-aged bachelor, composer/songwriter; the couple who beats the heat by sleeping on a fire escape; the newlyweds and lovers; the tragic \"Miss Lonelyhearts\" and her fantasies of entertaining gentlemen callers; the hearing-impaired sculptor working day and night; the vivacious and sexy blonde dancer \"Miss Torso\" who does suggestive routines in bikini tops and, most important, the hysterical \"nagging wife\" - lying in bed - and her grouchy fed-up husband, a jewelry salesman...One 'great shot' reveals just how involved Stewart has become in their lives when Miss Lovelyheart - in her romantic dinner for two - raises her glass in a toast to her imaginary lover and Stewart raises his glass as well...The urban backyard setting is the night city terrain of \"Rear Window,\" a night city shattered by the sharp sound of a loud female scream and the sound of breaking glass...Hitchcok presents Stewart who sees (or think he sees) what he is powerless to stop... The insidious salesman strangely attracts Stewart's attention... His Passtime becomes an obsession after he suspects that he has murdered his ailing wife and specially when he notices that she is missing... His ravishing fiancée (Grace Kelly) and his nurse (Thelma Ritter) warn him that voyeurism is a crime and is dangerous... But Stewart persists, eventually he was turned on ... This explain perfectly his specific use of a huge zoom lens to do his peeping as he monitors the murderer's activities... The murderer and his wife became subject of Stewart's parody with the \"too perfect, too talented, too sophisticated,\" Grace Kelly...\"Rear Window\" is visually very strong... Hitchcock designs the film in such a way so that his view is our view... He manipulates our emotions because he knows perfectly his work... He has the film synchronized in his mind... Shooting and editing are, for him, a simple mechanical phase... The creativity has all taken place before...The first shot of \"Rear Window\" is a perfect example of this reality - as his many typical first shots - for the way it visually transmits the whole complex to the audience...Hitchcock is a master at using his camera to create suspense... Like Stewart, we are restricted in movements, paralyzed inside the apartment, immobile, trapped in a room where we are anxious and uncertain... There is no way we can warn the outcome... This is what 'suspense' is all aboutnot surprise... An effect of intense and prolonged expectancy, lacking all help in the state of knowing that we possess but the characters do not... And, of course, all this great suspense is created by only 'visual' means...Stewart gives the performance of his life behaving at ease... He was the perfect Hitchcock character: a voyeur by profession, an unpretentious photo journalist who becomes caught in a terrifying event...When you see the film, feel the menacing 'look' of the murderer staring those evil eyes at you... And don't forget to catch Alfred Hitchcok in his customary cameo appearance, this time repairing a clock... Enjoy!"
    },
    {
      "username": "EUyeshima",
      "userUrl": "https://www.imdb.com/user/ur3608743",
      "reviewLink": "https://www.imdb.com/review/rw1306966",
      "warningSpoilers": false,
      "date": "5 March 2006",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Voyeurism, Murder, Stewart and Kelly Make for a Hitch High",
      "content": "It doesn't have the psychological complexity or panoramic sweep of his later films, but 1954's \"Rear Window\" is arguably his most fun film to watch. An entire Greenwich Village apartment complex and courtyard was built inside a Paramount studio building to create Hitchcock's unforgiving microcosm of lonely souls that stretches the ethical envelope of voyeurism. James Stewart plays L.B. \"Jeff\" Jefferies, an adventure photographer, wheelchair-bound with a week left in his cast for a broken leg. He is itching for some excitement and not even the devoted attention of an impossibly beautiful Grace Kelly as Lisa, a Park Avenue fashion model is enough for him. Stuck in his apartment all day, he sees the comings and goings of his neighbors, all strangers to him, and pieces together their lives and gives them pseudonyms like \"Miss Torso\" and \"Miss Lonelyhearts\". But his attention focuses on a suspicious, white-haired man named Thorwald. Jeff becomes increasingly intrigued by his neighbor's odd behavior and the sudden disappearance of his nagging, bedridden wife. Jeff suspects a murder plot, which seems far-fetched at first, but becomes gradually more evident as his obsession infects Lisa, his masseuse Stella and his detective buddy Tom.Hitchcock was indeed the master of suspense, but the movie is suffused with an unexpectedly light sense of humor that touches rather candidly on sex and relationships thanks to John Michael Hayes' sharp script. Lisa's entanglement with Thorwald is played out well, especially as Jeff looks on helplessly from his apartment. Stewart is wonderfully sly throughout, giving hints of the inner torment he displays later in \"Vertigo\" but still likable even as he tries to reject his glamorous, sheltered girlfriend. Kelly seems merely decorative at first, but she sharpens as her character gains a fearless sense of intrigue that Jeff finds alluring. Thelma Ritter plays a smarter and warmer variation of her typical wisecracker as Stella, while Wendell Corey is his usual nondescript stalwart self as Tom. Raymond Burr, pre-Perry Mason, shows up as Thorwald and lends interesting ambiguity to his menacing character. Robert Burks' probing camera-work makes the perfect complement to Hitchcock's trademark film-making style, and special mention needs to be given to Robert A. Harris's splendid 1998 work in restoring the film's original splendor, even the slow-motion first kiss between Stewart and Kelly. The DVD has a couple of nice extras, an hour-long documentary that focuses on the ethics behind the story and the restoration effort, and a brief interview with screenwriter Hayes. One of Hitchcock's best in an impressive canon of work."
    },
    {
      "username": "mickman91-1",
      "userUrl": "https://www.imdb.com/user/ur10294945",
      "reviewLink": "https://www.imdb.com/review/rw8114479",
      "warningSpoilers": false,
      "date": "4 May 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The most Hitchcockian of all Hitchcock movies.",
      "content": "There is something about Rear Window which for me is the pinnacle of the Hitchcockian energy of suspense and intrigue. The whole film feels like you are sharing in the voyeurism and the mystery and suspense of what is happening. The best Hitchcock film in my opinion, even if Psycho does have more iconic moments/elements."
    },
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw4055683",
      "warningSpoilers": false,
      "date": "7 February 2018",
      "rate": "4",
      "helpful": "27 out of 47 found this helpful.",
      "title": "I spy, with my little eye, the most overrated Alfred Hitchcock thriller.",
      "content": "This is likely to go down as the least popular user-comment in history, but then so be it. I believe in honesty and freedom of speech. Although universally considered as one of the top three (or maybe top five) best thrillers that Alfred Hitchcock made in his lengthy and undeniably brilliant career, I personally feel that \"Rear Window\" is the most overrated movie of all times and I sincerely can't fathom why it's such a cinematic landmark. I reckon that the basic plot idea is utmost intriguing and that it's rather inventive how the cameras film literally everything from within the same secluded living room location, but that about sums up all the film's strengths. The narcistic photographer L.B. Jefferies (James Stewart) sits immobilized in his apartment, bound to both a wheelchair and a humongous plaster cast around his leg ever since he took too much risk during a photo shoot on a racetrack. Purely out of boredom, he begins to watch all his neighbors across the little cement garden. The watching quickly turns into observing with binoculars and then into spying with his most professional & strongest photo lenses. He then thinks he witnesses a middle-aged man murdering his wife in cold blood, but a befriended police inspector, his lovely girlfriend and even his nosy housekeeper have trouble believing him. I was particularly annoyed by the behavior and ignorance of the protagonist. Jeff is supposed to be an intelligent person, so he must understand or at least respect that the police can't just go invading someone's private property and interrogate them about a possibly felony for which there isn't any evidence. The entire film evidently revolves on L.B. Jefferies' arrogant persona, and of course it doesn't help that I never really liked the actor James Stewart. I can appreciate him when his characters aren't omnipresent, like in Hitchcock's \"Rope\" for example, but here he was rapidly getting on my nerves. The other characters, including Grace Kelly who never looked prettier, are downgraded to mere extras. I am also aware that practically every review praises that the powerful impact of \"Rear Window\" lies in the fact that it's a statement on the human towards voyeurism and blah blah, but to me a film has to be entertaining and plausible first and foremost. \"Read Window\" along with \"Vertigo\" and \"The Man Who Knew Too Much\" made me realize that can't get into Hitch's espionage or 'wrong-man-condemned' thrillers, and that I find his more polished thrillers extremely boring, unrealistic and overrated. I'm primarily a horror fanatic, and thus love the nasty Hitchcock films the most, like \"Psycho\", \"Shadow of a Doubt\", \"Rope\" and \"Frenzy\"."
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw5912364",
      "warningSpoilers": false,
      "date": "17 July 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Nosy neighbour.",
      "content": "'Rear Window (1954)' is one of the greatest films of all time, a thriller that does more with its single location than most movies do with their entire world. With restrained yet masterful direction, a witty yet suspenseful script and down-to-earth yet powerhouse performances, the piece solidifies itself as one of the most gripping, edge-of-your-seat and exciting experiences of its kind. That's even more impressive when you consider that its protagonist is wheelchair-bound for its duration and that the only real danger to him comes towards the flick's explosive final third. It's just phenomenal, really. It sucks you in straight away and doesn't let you go until it ends, keeping you watching with bated breath and smiling lips. It's so well-crafted in every aspect that it's difficult to find any flaws with it, however small they may be. It really is one of the most enjoyable pictures... well, ever. I love it. 10/10"
    },
    {
      "username": "PCC0921",
      "userUrl": "https://www.imdb.com/user/ur109135693",
      "reviewLink": "https://www.imdb.com/review/rw8019863",
      "warningSpoilers": false,
      "date": "31 March 2022",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Raymond Burr was born on May 21st, 1917",
      "content": "Voyeurism, the stimulation of the libido and a slick murder mystery are the key instruments used by Hitchcock in Rear Window (1954). However, the most important aspect of this film, that must garner attention, is the incredible sense of timing, in all aspects of this film. Just like the magic he was able to tap into, six years earlier, with Rope (1948), the timing in this film is perfect also. I guarantee something like this could not be duplicated today the way it was then. Today's filmmakers would wind up using computers, CGI effects and every other technological trick available in the 21st century, but all Hitchcock had was a stopwatch. The fact that Hitchcock was able to orchestrate all of this is incredible. Each window is its own movie or play, that has to start and end on time, so the camera can move onto the next window. Each actor had to be ready to say their line, pick up a newspaper or play a song on the piano in the allotted amount of time needed.Another incredible aspect, that clearly represented Hitchcock's greatness, was his ability to exhume emotions from his actors with minimal use of energy. Of course, the actors had a little hand in this themselves. Grace Kelly, with plenty of clothes on, saying appropriate lady-like things, was able to show a sexiness, that is on par with, in today's terms, with Jessica Alba in a bikini. Please don't tell me, that you are not on the edge of your seat, watching Raymond Burr do whatever the heck he is doing throughout the film. You do not want to close your eyes out of fear of what might come next. The stimulation of the libido, seeing the woman as the stronger character, watching people in a voyeuristic way, would not have worked as well as it does, if this wasn't a Hitchcock film. This is why, for my money, Rear Window (1954), is the greatest movie ever made. Oh! Did I mention that Jimmy Stewart was in it? As always, he is awesome.9.9 (A+ MyGrade) = 10 IMDB."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0052893",
      "warningSpoilers": false,
      "date": "8 March 2004",
      "rate": "8",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Hitchock Classic",
      "content": "Rear Window is considered one of Hitchcock's classics, and is probably Jimmy Stewart's most famous Hitchcock Role. Stewart plays an adventure-seeking photographer who is laid up for seven weeks in his apartment with a broken leg. During this time, he has become vicariously involved with his neighbors; looking out his rear windows and following their lives. As the final week of his incapacity begins, he begins to suspect that one of his neighbors has killed his wife, and pretty soon his girlfriend (Grace Kelly) and nurse (Thelma Ritter) realize that he may be right.I seem to get more out of Rear Window the older I get  there are subtleties to the relationship, and to the lives of the other apartment dwellers that I catch as an adult, and didn't when I was younger. One thing that has remained a constant however is the methodical pacing and the slow tension that builds up to outright terror. I get just as tense and nervous during the last ten minutes of the film as a 30 year old as I did when I first saw the film at age 10. It is only as I got older that I realized the helplessness of Stewart's character, and how important that element was to the plot along with its contribution to the uneasiness of the film.I've heard more than once that people have been bored during this film  of course, that is an opinion and cannot be judged, but I find it hard to relate to that, as I believe that even without the elements of suspense, Rear Window still makes a great story and film: Which is just one of the many reasons it remains one of my favorite Hitchcock films to this day.--Shelly"
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0052914",
      "warningSpoilers": true,
      "date": "5 August 2004",
      "rate": "10",
      "helpful": "16 out of 26 found this helpful.",
      "title": "One of my all-time favorites that could justifiably be named Hitchcock's second best (with PSYCHO being number one).",
      "content": "For most of its duration, not a single shot in Alfred Hitchcock's \"Rear Window\" takes place outside the small, lonely apartment of L.B. Jeffries (James Stewart). Every exterior pan originates through the eyes of the injured photographer, whose broken leg has him restrained to a wheelchair, living off of the meals of his caretaker, Stella (Thelma Ritter).When his fiancée, Lisa (Grace Kelly), stands outside the window, we see her  but we're still in the room. The camera does not position itself on the sidewalk, or above the flowerbed next to her, or in the window of another room  it stays put.What Hitchcock does here is nothing short of brilliant  the movie turns us into unconscious voyeurs as we are forced to take on the perspective of the protagonist, and participate in his constant eavesdropping.This technique of isolation and confinement forms a sort of disturbing effect that smothers the viewer on a subconscious level  we can feel it, but can't necessarily put a finger on what, exactly, it is.The movie is also particularly risqué for its time  50 years later it's the sort of film that would probably receive a PG rating (and, in fact, after being restored and re-released in 2000, it did). There is no foul language, no sex, no nudity, no violence (per se), and no drug content. But there are many insinuations  e.g. the mental image Hitchcock forms in his viewers' minds, of the man next door murdering his wife; the innuendo involving Lisa's overnight stay at Jeffries' (and her dress that sparks the interest of a private detective); the newlywed couple next door (\"No comment,\" Jeffries tells Lisa); Miss Torso, the ballerina who lives across the street and the amount of time Jeffries spends watching her dance and change out of clothes. Jeffries has injured his leg after trying to take a daring photograph -- now he doesn't have a television or any other means of entertainment, so he amuses himself by studying the lives of others. Sound familiar? With \"Reality TV\" shows such as \"Survivor,\" \"Big Brother\" and \"Fear Factor,\" America's growing fascination with voyeuristic programming is becoming rather startling. Although the 1987 action picture \"The Running Man\" (and its source manuscript by Stephen King) is often credited with accurately depicting this odd form of entertainment, \"Rear Window\"  to a certain degree  predicted it much earlier. 34 years earlier, to be exact.One night while studying the rooms across the street, Jeffries notices a strange man carrying a briefcase in and out of a darkened room. The man's disabled wife (who demands his constant care) is nowhere to be seen. The next day, she is gone, apparently on a train; but Jeffries notices Thorvald (Raymond Burr), the mysterious man, cleaning a sharp knife in the kitchen sink.Could he have committed murder? Jeffries believes so, and convinces Lisa and Stella, too. They begin to piece together a number of clues  a disheveled flower bed, a purse, fake letters  that lead to one conclusion: Murder. The problem is that no one else believes them.A movie such as \"Rear Window\" would never work nowadays. The main character would entertain himself with technology  not voyeurism. The windows would not be left open for fear of burglary. Police would be more willing to believe such a \"far-fetched\" story, and the private detective probably wouldn't shrug off Jeffries like he does in the film.This is evidenced by the poor remake starring Christopher Reeves, made for television  it didn't make any sense because it was set in this day and age, featuring an outdated concept. It almost seemed silly, and was vastly inferior.But it works in the 1950s, and as a film, \"Rear Window' still holds up beautifully today  despite its dated premise (or, at least, execution), the other elements of the story keep it interesting. We are willing to suspend our disbelief because it is so great. And because \"back then\" the story's progression seems more natural than it ever would today.The performances are flawless  James Stewart is completely convincing as Jeffries, a man controlled by his own impulses. Likewise Hitchcock's typical blonde love interest, Grace Kelly, is marvelous  beautiful and likable, willing to do anything for Jeffries, which includes breaking into Thorvald's room while he's out and about (which results in one of the most nerve-jangling suspense sequences of all time). And Raymond Burr is utterly petrifying as Thorvald, who is almost always seen from a distance, with his odd white hair and continually narrowed eyes that just scream murder.\"Rear Window\" is often considered by most critics to be Alfred Hitchcock's greatest masterpiece. For my money, \"Psycho\" (1960) is his best  but \"Rear Window\" may very well be number two. With a career comprised of some truly amazing motion pictures (\"The 39 Steps,\" \"The Lady Vanishes,\" \"The Man Who Knew Too Much,\" \"Shadow of a Doubt,\" \"Strangers on a Train,\" \"Vertigo,\" etc.), it will always be hard to choose Hitchcock's \"best\" movie  but in terms of narrative, and film-making, and acting, \"Rear Window\" could justifiably be called one of his all-time greatest. And, all considered, that's not a compliment to be taken very lightly."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw3181083",
      "warningSpoilers": false,
      "date": "10 February 2015",
      "rate": "8",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Alfred Hitchcock top-notch suspense/thriller embroils a magazine photographer confined to wheelchair in killing",
      "content": "Alfred Hitchcock awesome intrigue/comedy in which a magazine photographer seeks diversion in watching his neighbors , often with a telephoto lens and binoculars , discovering a possible murder . Thrilling flick with funny moments , nice acting , adequate settings and funny dialogue . The tale is ordinary Hitchcock fare that plays and preys the senses . It involves a bewildered as well as hapless wheelchair bound photographer (James Stewart) because of a broken leg who spies on his neighbours from his apartment window and becomes convinced one of them (Raymond Burr) has committed murder his spouse and dismembered the body . The photographer soon enlists the help of his high society fashion-consultant sweetheart named Lisa Freemont (Grace Kelly), his visiting nurse called Stella (Thelma Ritter) and a Detective (Wendell Corey) to investigate the weird deeds .This agreeable and often hilarious picture from master of suspense has a memorable scene after another and was one of the main Alfred Hitchcock films made for Paramount . In fact , at the time the set was the largest indoor set built at Paramount Studios . The entire picture was shot on one set, which required months of planning and construction . The film was shot quickly on the heels of Dial M for murder (1954), November 27 1953-February 26 1954 . Alfred Hitchcock's movies have become famous for a number of elements and special iconography : vertiginous height , blonde bombshells , voyeurism , long non-dialogue sequences , a matter of mistaken identity etc . This charming as well as inventive mystery movie has these particularities ; furthermore contains a fun intrigue , amusing situations and keeps the action at feverish pitch . The first part of this production is slow and artificial ; however , the rest of this suspense picture takes off at high speed . Interesting and intriguing screenplay adapted by John Michael Hayes based on a story by Cornell Woolrich . Screenwriter John Michael Hayes based Lisa on his own wife, who'd been a professional fashion model when they married . The original story by Cornell Woolrich had no love story and no additional neighbors for L.B. Jeffries to spy on, and those elements were created by Alfred Hitchcock and John Michael Hayes . Alfred Hitchcock's movies were known for featuring famous landmarks and he also was known for making his actors follow the script to the word, and in this movie the characters use their dialogue taken from an engaging as well as fun script . Very good acting by the great James Stewart as as a photographer who soon becomes convinced that one neighbor has killed his wife and Grace Kelly as gorgeous and elegant girlfriend , both of them make a marvelous duo . Grace Kelly made three of her eleven films with Hitchcock; this film, as well as Catch to a thief (1955) and Dial M for murder (1954), but Rear window film was thought of as the best . Excellent support cast such as Thelma Ritter , Wendell Corey , Kathryn Grant , Frank Cady and Raymond Burr . And of course , Hitch cameo , about a half hour into the film, winding the clock in the songwriter's apartment. Colorful and glimmer cinematography in Vistavision by Robert Burks , Alfred's ordinary cameraman , showing nice images from studio . The film negative was considerably damaged as a result of color dye fading as early as the 1960s , nearly all of the yellow image dyes had faded out. Despite fears that the film had been irrevocably damaged, preservation experts were able to restore the film nearly to its original coloration . Rousing as well as atmospheric score by the classic composer Franz Waxman .The motion picture was stunningly directed by maestro of thriller Alfred Hitchcock . The film was unavailable for decades because its rights were bought back by Alfred Hitchcock and left as part of his legacy to his daughter. They've been known for long as the infamous \"Five Lost Hitchcocks\" among film buffs, and were re-released in theatres around 1984 after a 30-year absence. The others are The Man Who Knew Too Much (1956), The rope (1948), trouble with Harry (1955), and Vértigo (1958). This essential and fundamental Hitchcock will keep fascinated and thrilling right up until the edge-of-your-seat climax . And the American Film Institute ranked this as the #48 Greatest Movie of All Time and ranked #3 on the American Film Institute's list of the 10 greatest films in the genre \"Mystery\" in June 2008."
    }
  ],
  "errorMessage": ""
}