{
  "imDbId": "tt0047396",
  "title": "Rear Window",
  "fullTitle": "Rear Window (1954)",
  "type": "Movie",
  "year": "1954",
  "language": "en",
  "titleInLanguage": "Rear Window",
  "url": "https://en.wikipedia.org/wiki/Rear_Window",
  "plotShort": {
    "plainText": "Rear Window is a 1954 American mystery thriller film directed by Alfred Hitchcock and written by John Michael Hayes based on Cornell Woolrich's 1942 short story \"It Had to Be Murder.\" Originally released by Paramount Pictures, the film stars James Stewart, Grace Kelly, Wendell Corey, Thelma Ritter, and Raymond Burr. It was screened at the 1954 Venice Film Festival.\r\nRear Window is considered by many filmgoers, critics, and scholars to be one of Hitchcock's best and one of the greatest films ever made. It received four Academy Award nominations and was ranked number 42 on AFI's 100 Years...100 Movies list and number 48 on the 10th-anniversary edition, and in 1997 was added to the United States National Film Registry in the Library of Congress as being \"culturally, historically, or aesthetically significant.\"",
    "html": "<p>Rear Window is a 1954 American mystery thriller film directed by Alfred Hitchcock and written by John Michael Hayes based on Cornell Woolrich's 1942 short story \"It Had to Be Murder.\" Originally released by Paramount Pictures, the film stars James Stewart, Grace Kelly, Wendell Corey, Thelma Ritter, and Raymond Burr. It was screened at the 1954 Venice Film Festival.</p><p>Rear Window is considered by many filmgoers, critics, and scholars to be one of Hitchcock's best and one of the greatest films ever made. It received four Academy Award nominations and was ranked number 42 on AFI's 100 Years...100 Movies list and number 48 on the 10th-anniversary edition, and in 1997 was added to the United States National Film Registry in the Library of Congress as being \"culturally, historically, or aesthetically significant.\"</p>"
  },
  "plotFull": {
    "plainText": "Rear Window is a 1954 American mystery thriller film directed by Alfred Hitchcock and written by John Michael Hayes based on Cornell Woolrich's 1942 short story \"It Had to Be Murder.\" Originally released by Paramount Pictures, the film stars James Stewart, Grace Kelly, Wendell Corey, Thelma Ritter, and Raymond Burr. It was screened at the 1954 Venice Film Festival.\r\nRear Window is considered by many filmgoers, critics, and scholars to be one of Hitchcock's best and one of the greatest films ever made. It received four Academy Award nominations and was ranked number 42 on AFI's 100 Years...100 Movies list and number 48 on the 10th-anniversary edition, and in 1997 was added to the United States National Film Registry in the Library of Congress as being \"culturally, historically, or aesthetically significant.\"\r\nPlot\r\nWhile recuperating from a broken leg, professional photographer L. B. \"Jeff\" Jefferies is confined to a wheelchair in his apartment in Greenwich Village, Manhattan. His rear window looks out onto a courtyard and other apartments. During an intense heat wave, he watches his neighbors, who keep their windows open to stay cool. They are a lonely woman whom Jeff nicknames \"Miss Lonelyhearts,\" a newlywed couple, a pianist, a pretty dancer nicknamed \"Miss Torso,\" a middle-aged couple whose small dog likes digging in the flower garden, and Lars Thorwald, a traveling costume jewelry salesman with a bedridden wife.\r\nJeff is visited regularly by Lisa Fremont, his socialite girlfriend, and a nurse named Stella. One night after an argument with Lisa, Jeff is alone in his apartment and hears a woman scream, \"Don't!\" and the sound of breaking glass. Later that night, during a thunderstorm, he observes Thorwald making repeated trips carrying a suitcase. Later, after Jeff dozes off, Thorwald leaves his apartment along with a woman. The next morning, Jeff notices that Thorwald's wife is gone, and sees him cleaning a large knife and handsaw. Thorwald also has moving men haul away a large trunk. Jeff becomes convinced that Thorwald has murdered his wife, and shares this with Lisa and Stella, who believe him when they observe Thorwald acting suspiciously. Jeff calls his friend and war buddy Tom Doyle, a New York City Police detective, and asks him to investigate Thorwald. Doyle finds nothing suspicious—apparently, Mrs. Thorwald is upstate.\r\nSoon after, the neighbor's dog is found dead. The distraught owner yells and everyone runs to their windows except Thorwald, who sits quietly in his dark apartment smoking a cigar. Certain that Thorwald killed the dog, Jeff telephones him to lure him away so that Stella and Lisa can investigate. He believes Thorwald buried something in the flower bed and killed the dog because it was digging at it. When Thorwald leaves, Lisa and Stella dig up the flowers, but find nothing.\r\nMuch to Jeff's amazement and admiration, Lisa climbs up the fire escape to Thorwald's apartment and clambers in through an open window. Jeff and Stella get distracted when they see Miss Lonelyhearts take out some pills and write a note, realizing she is going to attempt suicide. They call the police but before they can report it, Miss Lonelyhearts stops, opening the window to listen to the pianist's music. Thorwald returns and confronts Lisa, and Jeff realizes that Thorwald is going to kill her. He calls the police and reports an assault in progress. The police arrive and arrest Lisa when Thorwald indicates that she broke in to his apartment. Jeff sees Lisa coyly pointing to her finger with Mrs. Thorwald's wedding ring on it. Thorwald sees this also and, realizing that she is signaling someone, spots Jeff across the courtyard.\r\nJeff phones Doyle and leaves an urgent message while Stella goes to bail Lisa out of jail. When his phone rings, Jeff assumes it is Doyle, and blurts out that the suspect has left. When no one answers, he suspects that it was Thorwald calling. Thorwald enters Jeff's dark apartment and Jeff sets off a series of camera flashbulbs to temporarily blind him. Thorwald pushes Jeff out the window and Jeff, hanging on, yells for help. Police enter the apartment, Jeff falls, and officers on the ground break his fall. Thorwald confesses to the police that he murdered his wife.\r\nA few days later, normalcy returns to the neighborhood. The couple whose dog was killed have a new puppy, the newlyweds are having their first argument, Miss Torso's boyfriend comes back from the army, Miss Lonelyhearts starts seeing the pianist, and Thorwald's apartment is being refurbished. Jeff rests in his wheelchair, now with casts on both legs. Beside him, Lisa reads a book titled \"Beyond the High Himalayas.\" After seeing that Jeff is sleeping, Lisa happily opens a fashion magazine.\r\nCast\r\nJames Stewart as L. B. \"Jeff\" Jefferies\r\nGrace Kelly as Lisa Carol Fremont\r\nWendell Corey as NYPD Det. Lt. Thomas \"Tom\" J. Doyle\r\nThelma Ritter as Stella\r\nRaymond Burr as Lars Thorwald\r\nJudith Evelyn as Miss Lonelyhearts\r\nRoss Bagdasarian as the songwriter\r\nGeorgine Darcy as Miss Torso\r\nSara Berner and Frank Cady as the couple living above the Thorwalds, with their dog\r\nJesslyn Fax as \"Miss Hearing Aid\"\r\nRand Harper and Havis Davenport as newlyweds\r\nIrene Winston as Mrs. Anna Thorwald\r\nUncredited\r\nHarry Landers as young man guest of Miss Lonelyhearts\r\nRalph Smiles as Carl, the waiter\r\nFred Graham as detective\r\nEddie Parker as detective\r\nAnthony Warde as detective\r\nKathryn Grant as Girl at Songwriter's Party\r\nMarla English as Girl at Songwriter's Party\r\nBess Flowers as Woman at Songwriter's Party with Poodle\r\nBenny Bartlett as Stanley, Miss Torso's returning boyfriend\r\nDick Simmons as Man with Miss Torso\r\nCast notes\r\nDirector Alfred Hitchcock makes his traditional cameo appearance in the songwriter's apartment, where he is seen winding a clock.\r\nProduction\r\nThe film was shot entirely at Paramount Studios, which included an enormous indoor set to replicate a Greenwich Village courtyard. Set designers Hal Pereira and Joseph MacMillan Johnson spent six weeks building the extremely detailed and complex set, which ended up being the largest of its kind at Paramount. One of the unique features of the set was its massive drainage system, constructed to accommodate the rain sequence in the film. They also built the set around a highly nuanced lighting system which was able to create natural-looking lighting effects for both the day and night scenes. Though the address given in the film is 125 W. Ninth Street in New York's Greenwich Village, the set was actually based on a real courtyard located at 125 Christopher Street.\r\nIn addition to the meticulous care and detail put into the set, careful attention was also given to sound, including the use of natural sounds and music that would drift across the courtyard and into Jefferies' apartment. At one point, the voice of Bing Crosby can be heard singing \"To See You Is to Love You,\" originally from the 1952 Paramount film Road to Bali. Also heard on the soundtrack are versions of songs popularized earlier in the decade by Nat King Cole (\"Mona Lisa\", 1950) and Dean Martin (\"That's Amore\", 1952), along with segments from Leonard Bernstein's score for Jerome Robbins' ballet Fancy Free (1944), Richard Rodgers' song \"Lover\" (1932), and \"M'appari tutt'amor\" from Friedrich von Flotow's opera Martha (1844), most borrowed from Paramount's music publisher, Famous Music.\r\nHitchcock used costume designer Edith Head on all of his Paramount films.\r\nAlthough veteran Hollywood composer Franz Waxman is credited with the score for the film, his contributions were limited to the opening and closing titles and the piano tune (\"Lisa\"). This was Waxman's final score for Hitchcock. The director used primarily \"diegetic\" sounds—sounds arising from the normal life of the characters—throughout the film.\r\nRelease\r\nTheatrical\r\nOn August 4, 1954, a \"benefit world premiere\" was held for the film, with United Nations officials and \"prominent members of the social and entertainment worlds\" at the Rivoli Theatre in New York City, with proceeds going to the American–Korean Foundation (an aid organization founded soon after the end of the Korean War. and headed by Milton S. Eisenhower, brother of President Eisenhower).\r\nThe movie had a wide release on September 1, 1954.\r\nHome media\r\nOn September 25, 2012, Universal Studios Home Entertainment released Rear Window for the first time on Blu-ray as part of the \"Alfred Hitchcock: The Masterpiece Collection\". This edition included numerous supplemental features such as an audio commentary from John Fawell, excerpts from Hitchcock's interview with François Truffaut, two theatrical trailers, and an interview with the film's screenwriter John Michael Hayes.\r\nOn May 6, 2014, Universal Pictures Home Entertainment re-released Rear Window on Blu-ray with the same supplemental features.\r\nReception\r\nBox office\r\nDuring its initial theatrical run, Rear Window earned $5.3 million in North American box office rentals.\r\nCritical response\r\nBosley Crowther of The New York Times called the film a \"tense and exciting exercise\" and deemed Hitchcock as a director whose work has a \"maximum of build-up to the punch, a maximum of carefully tricked deception and incidents to divert and amuse.\" Crowther also noted that \"Mr. Hitchcock's film is not 'significant.' What it has to say about people and human nature is superficial and glib, but it does expose many facets of the loneliness of city life, and it tacitly demonstrates the impulse of morbid curiosity. The purpose of it is sensation, and that it generally provides in the colorfulness of its detail and in the flood of menace toward the end.\" Variety called the film \"one of Alfred Hitchcock's better thrillers\" which \"combines technical and artistic skills in a manner that makes this an unusually good piece of murder mystery entertainment.\" The film ranked 5th on Cahiers du Cinéma's Top 10 Films of the Year List in 1955.\r\nTime called it \"just possibly the second-most entertaining picture (after The 39 Steps) ever made by Alfred Hitchcock\" and a film in which there is \"never an instant ... when Director Hitchcock is not in minute and masterly control of his material.\" The reviewer also noted the \"occasional studied lapses of taste and, more important, the eerie sense a Hitchcock audience has of reacting in a manner so carefully foreseen as to seem practically foreordained.\" Harrison's Reports named the film as a \"first-rate thriller\" that is \"strictly an adult entertainment, but it should prove to be a popular one.\" They further added, \"What helps to make the story highly entertaining is the fact that is enhanced by clever dialogue and by delightful touches of comedy and romance that relieve the tension.\"\r\nNearly 30 years after the film's initial release, Roger Ebert reviewed the re-release by Universal Pictures in October 1983, after Hitchcock's estate was settled. He said the film \"develops such a clean, uncluttered line from beginning to end that we're drawn through it (and into it) effortlessly. The experience is not so much like watching a movie, as like ... well, like spying on your neighbors. Hitchcock traps us right from the first ... And because Hitchcock makes us accomplices in Stewart's voyeurism, we're along for the ride. When an enraged man comes bursting through the door to kill Stewart, we can't detach ourselves, because we looked too, and so we share the guilt and in a way we deserve what's coming to him.\" In 1983, reviewing the film Vincent Canby wrote \"Its appeal, which goes beyond that of other, equally masterly Hitchcock works, remains undiminished.\"\r\nThe review aggregator website Rotten Tomatoes reports an approval rating of 98% based on 124 reviews, with an average rating of 9.20/10. The critics' consensus states that \"Hitchcock exerted full potential of suspense in this masterpiece.\" At Metacritic, the film has a weighted average score of a very rare, perfect 100 out of 100 based on 18 critics, indicating \"universal acclaim\". In his 2012 review of the film Killian Fox of The Guardian wrote \"Hitchcock made a career out of indulging our voyeuristic tendencies, and he never excited them more skilfully, or with more gleeful self-awareness, than in Rear Window\".\r\nAwards and honors\r\nAnalysis\r\nIn Laura Mulvey's essay \"Visual Pleasure and Narrative Cinema,\" she identifies what she sees as voyeurism and scopophilia in Hitchcock's movies, with Rear Window used as an example of how she sees cinema as incorporating the patriarchy into the way that pleasure is constructed and signaled to the audience. Additionally, she sees the \"male gaze\" as especially evident in Rear Window in characters such as the dancer \"Miss Torso;\" she is both a spectacle for Jeff to enjoy, as well as for the audience (through his substitution).\r\nIn his book, Alfred Hitchcock's \"Rear Window\", John Belton further addresses the underlying issues of voyeurism which he asserts are evident in the film. He says \"Rear Window's story is 'about' spectacle; it explores the fascination with looking and the attraction of that which is being looked at.\"\r\nIn his 1954 review of the film, François Truffaut suggested \"this parable: The courtyard is the world, the reporter/photographer is the filmmaker, the binoculars stand for the camera and its lenses.\"\r\nVoyeurism\r\nJohn Fawell notes in Dennis Perry's book, Hitchcock and Poe: The Legacy of Delight and Terror, that Hitchcock \"recognized that the darkest aspect of voyeurism . . . is our desire for awful things to happen to people . . . to make ourselves feel better, and to relieve ourselves of the burden of examining our own lives.\" Hitchcock challenges the audience, forcing them to peer through his rear window and become exposed to, as Donald Spoto calls it in his 1976 book The Art of Alfred Hitchcock: Fifty Years of His Motion Pictures, the \"social contagion\" of acting as voyeur.\r\nIn an explicit example of a condemnation of voyeurism, Stella expresses her outrage at Jeffries' voyeuristic habits, saying, \"In the old days, they'd put your eyes out with a red hot poker\" and \"What people ought to do is get outside and look in for a change.\"\r\nOne climactic scene in the film portrays both the positive and negative effects of voyeurism. Driven by curiosity and incessant watching, with Jeff watching from his window, Lisa sneaks into Thorwald's second-floor apartment, looking for clues, and is apprehended by him. Jeff is in obvious anxiety and is overcome with panic as he sees Thorwald walk into the apartment and notice the irregular placement of the purse on the bed. Jeff anxiously jitters in his wheelchair, and grabs his telephoto camera to watch the situation unfold, eventually calling the police because Miss Lonelyhearts is contemplating suicide in the neighboring apartment. Chillingly, Jeff watches Lisa in Thorwald's apartment rather than keeping an eye on the woman about to commit suicide. Thorwald turns off the lights, shutting off Jeff's sole means of communication with and protection of Lisa; Jeff still pays attention to the pitch-black apartment instead of Miss Lonelyhearts. The tension Jeff feels is unbearable and acutely distressing as he realizes that he is responsible for Lisa now that he cannot see her. The police go to the Thorwald apartment, the lights flicker on, and any danger coming toward Lisa is temporarily dismissed. Although Lisa is taken to jail, Jeff is utterly mesmerized by her dauntless actions.\r\nWith further analysis, Jeff's positive evolution understandably would be impossible without voyeurism—or as Robin Wood puts it in his 1989 book Hitchcock's Films Revisited, \"the indulging of morbid curiosity and the consequences of that indulgence.\"\r\nLegacy\r\nOwnership of the copyright in Woolrich's original story was eventually litigated before the Supreme Court of the United States in Stewart v. Abend. The film was copyrighted in 1954 by Patron Inc., a production company set up by Hitchcock and Stewart. As a result, Stewart and Hitchcock's estate became involved in the Supreme Court case, and Sheldon Abend became a producer of the 1998 remake of Rear Window.\r\nIn 1997, Rear Window was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". By this time, the film interested other directors with its theme of voyeurism, and other reworkings of the film soon followed, which included Brian De Palma's 1984 film Body Double and Phillip Noyce's 1993 film Sliver. In 1998 Time Out magazine conducted a poll and Rear Window was voted the 21st greatest film of all time. In the British Film Institute's 2012 Sight & Sound polls of the greatest films ever made, Rear Window was ranked 53rd among critics and 48th among directors. In the 2022 edition of the magazine's Greatest films of all time list the film ranked 38th in the critics poll. In 2017 Empire magazine's readers' poll ranked Rear Window at No. 72 on its list of The 100 Greatest Movies. In 2022, Time Out magazine ranked the film at No. 26 on their list of \"The 100 best thriller films of all time\".\r\nRear Window was restored by the team of Robert A. Harris and James C. Katz for its 1999 limited theatrical re-release (using Technicolor dye-transfer prints for the first time in this title's history) and the Collector's Edition DVD release in 2000.\r\nAmerican Film Institute included the film as number 42 in AFI's 100 Years...100 Movies, number 14 in AFI's 100 Years...100 Thrills, number 48 in AFI's 100 Years...100 Movies (10th Anniversary Edition) and number three in AFI's 10 Top 10 (Mysteries).\r\nRear Window was remade as a TV movie of the same name in 1998, with an updated storyline in which the lead character is paralyzed and lives in a high-tech home filled with assistive technology. Actor Christopher Reeve, himself paralyzed as a result of a 1995 horse-riding accident, was cast in the lead role. The telefilm also starred Daryl Hannah, Robert Forster, Ruben Santiago-Hudson, and Anne Twomey.\r\nDisturbia (2007) is a modern-day retelling, with the protagonist (Shia LaBeouf) under house arrest instead of laid up with a broken leg, and who believes that his neighbor is a serial killer rather than having committed a single murder. On September 5, 2008, the Sheldon Abend Trust sued Steven Spielberg, DreamWorks, Viacom, and Universal Studios, alleging that the producers of Disturbia violated the copyright to the original Woolrich story owned by Abend. On September 21, 2010, the U.S. District Court in Abend v. Spielberg, 748 F.Supp.2d 200 (S.D.N.Y. 2010), ruled that Disturbia did not infringe the original Woolrich story.",
    "html": "<p>Rear Window is a 1954 American mystery thriller film directed by Alfred Hitchcock and written by John Michael Hayes based on Cornell Woolrich's 1942 short story \"It Had to Be Murder.\" Originally released by Paramount Pictures, the film stars James Stewart, Grace Kelly, Wendell Corey, Thelma Ritter, and Raymond Burr. It was screened at the 1954 Venice Film Festival.</p><p>Rear Window is considered by many filmgoers, critics, and scholars to be one of Hitchcock's best and one of the greatest films ever made. It received four Academy Award nominations and was ranked number 42 on AFI's 100 Years...100 Movies list and number 48 on the 10th-anniversary edition, and in 1997 was added to the United States National Film Registry in the Library of Congress as being \"culturally, historically, or aesthetically significant.\"</p><br/><h3>Plot</h3><p>While recuperating from a broken leg, professional photographer L. B. \"Jeff\" Jefferies is confined to a wheelchair in his apartment in Greenwich Village, Manhattan. His rear window looks out onto a courtyard and other apartments. During an intense heat wave, he watches his neighbors, who keep their windows open to stay cool. They are a lonely woman whom Jeff nicknames \"Miss Lonelyhearts,\" a newlywed couple, a pianist, a pretty dancer nicknamed \"Miss Torso,\" a middle-aged couple whose small dog likes digging in the flower garden, and Lars Thorwald, a traveling costume jewelry salesman with a bedridden wife.</p><p>Jeff is visited regularly by Lisa Fremont, his socialite girlfriend, and a nurse named Stella. One night after an argument with Lisa, Jeff is alone in his apartment and hears a woman scream, \"Don't!\" and the sound of breaking glass. Later that night, during a thunderstorm, he observes Thorwald making repeated trips carrying a suitcase. Later, after Jeff dozes off, Thorwald leaves his apartment along with a woman. The next morning, Jeff notices that Thorwald's wife is gone, and sees him cleaning a large knife and handsaw. Thorwald also has moving men haul away a large trunk. Jeff becomes convinced that Thorwald has murdered his wife, and shares this with Lisa and Stella, who believe him when they observe Thorwald acting suspiciously. Jeff calls his friend and war buddy Tom Doyle, a New York City Police detective, and asks him to investigate Thorwald. Doyle finds nothing suspicious—apparently, Mrs. Thorwald is upstate.</p><p>Soon after, the neighbor's dog is found dead. The distraught owner yells and everyone runs to their windows except Thorwald, who sits quietly in his dark apartment smoking a cigar. Certain that Thorwald killed the dog, Jeff telephones him to lure him away so that Stella and Lisa can investigate. He believes Thorwald buried something in the flower bed and killed the dog because it was digging at it. When Thorwald leaves, Lisa and Stella dig up the flowers, but find nothing.</p><p>Much to Jeff's amazement and admiration, Lisa climbs up the fire escape to Thorwald's apartment and clambers in through an open window. Jeff and Stella get distracted when they see Miss Lonelyhearts take out some pills and write a note, realizing she is going to attempt suicide. They call the police but before they can report it, Miss Lonelyhearts stops, opening the window to listen to the pianist's music. Thorwald returns and confronts Lisa, and Jeff realizes that Thorwald is going to kill her. He calls the police and reports an assault in progress. The police arrive and arrest Lisa when Thorwald indicates that she broke in to his apartment. Jeff sees Lisa coyly pointing to her finger with Mrs. Thorwald's wedding ring on it. Thorwald sees this also and, realizing that she is signaling someone, spots Jeff across the courtyard.</p><p>Jeff phones Doyle and leaves an urgent message while Stella goes to bail Lisa out of jail. When his phone rings, Jeff assumes it is Doyle, and blurts out that the suspect has left. When no one answers, he suspects that it was Thorwald calling. Thorwald enters Jeff's dark apartment and Jeff sets off a series of camera flashbulbs to temporarily blind him. Thorwald pushes Jeff out the window and Jeff, hanging on, yells for help. Police enter the apartment, Jeff falls, and officers on the ground break his fall. Thorwald confesses to the police that he murdered his wife.</p><p>A few days later, normalcy returns to the neighborhood. The couple whose dog was killed have a new puppy, the newlyweds are having their first argument, Miss Torso's boyfriend comes back from the army, Miss Lonelyhearts starts seeing the pianist, and Thorwald's apartment is being refurbished. Jeff rests in his wheelchair, now with casts on both legs. Beside him, Lisa reads a book titled \"Beyond the High Himalayas.\" After seeing that Jeff is sleeping, Lisa happily opens a fashion magazine.</p><br/><h3>Cast</h3><ul><li>James Stewart as L. B. \"Jeff\" Jefferies</li><li>Grace Kelly as Lisa Carol Fremont</li><li>Wendell Corey as NYPD Det. Lt. Thomas \"Tom\" J. Doyle</li><li>Thelma Ritter as Stella</li><li>Raymond Burr as Lars Thorwald</li><li>Judith Evelyn as Miss Lonelyhearts</li><li>Ross Bagdasarian as the songwriter</li><li>Georgine Darcy as Miss Torso</li><li>Sara Berner and Frank Cady as the couple living above the Thorwalds, with their dog</li><li>Jesslyn Fax as \"Miss Hearing Aid\"</li><li>Rand Harper and Havis Davenport as newlyweds</li><li>Irene Winston as Mrs. Anna Thorwald</li></ul><p>Uncredited</p><ul><li>Harry Landers as young man guest of Miss Lonelyhearts</li><li>Ralph Smiles as Carl, the waiter</li><li>Fred Graham as detective</li><li>Eddie Parker as detective</li><li>Anthony Warde as detective</li><li>Kathryn Grant as Girl at Songwriter's Party</li><li>Marla English as Girl at Songwriter's Party</li><li>Bess Flowers as Woman at Songwriter's Party with Poodle</li><li>Benny Bartlett as Stanley, Miss Torso's returning boyfriend</li><li>Dick Simmons as Man with Miss Torso</li></ul><p>Cast notes</p><ul><li>Director Alfred Hitchcock makes his traditional cameo appearance in the songwriter's apartment, where he is seen winding a clock.</li></ul><br/><h3>Production</h3><p>The film was shot entirely at Paramount Studios, which included an enormous indoor set to replicate a Greenwich Village courtyard. Set designers Hal Pereira and Joseph MacMillan Johnson spent six weeks building the extremely detailed and complex set, which ended up being the largest of its kind at Paramount. One of the unique features of the set was its massive drainage system, constructed to accommodate the rain sequence in the film. They also built the set around a highly nuanced lighting system which was able to create natural-looking lighting effects for both the day and night scenes. Though the address given in the film is 125 W. Ninth Street in New York's Greenwich Village, the set was actually based on a real courtyard located at 125 Christopher Street.</p><p>In addition to the meticulous care and detail put into the set, careful attention was also given to sound, including the use of natural sounds and music that would drift across the courtyard and into Jefferies' apartment. At one point, the voice of Bing Crosby can be heard singing \"To See You Is to Love You,\" originally from the 1952 Paramount film Road to Bali. Also heard on the soundtrack are versions of songs popularized earlier in the decade by Nat King Cole (\"Mona Lisa\", 1950) and Dean Martin (\"That's Amore\", 1952), along with segments from Leonard Bernstein's score for Jerome Robbins' ballet Fancy Free (1944), Richard Rodgers' song \"Lover\" (1932), and \"M'appari tutt'amor\" from Friedrich von Flotow's opera Martha (1844), most borrowed from Paramount's music publisher, Famous Music.</p><p>Hitchcock used costume designer Edith Head on all of his Paramount films.</p><p>Although veteran Hollywood composer Franz Waxman is credited with the score for the film, his contributions were limited to the opening and closing titles and the piano tune (\"Lisa\"). This was Waxman's final score for Hitchcock. The director used primarily \"diegetic\" sounds—sounds arising from the normal life of the characters—throughout the film.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>On August 4, 1954, a \"benefit world premiere\" was held for the film, with United Nations officials and \"prominent members of the social and entertainment worlds\" at the Rivoli Theatre in New York City, with proceeds going to the American–Korean Foundation (an aid organization founded soon after the end of the Korean War. and headed by Milton S. Eisenhower, brother of President Eisenhower).</p><p>The movie had a wide release on September 1, 1954.</p><h4>Home media</h4><p>On September 25, 2012, Universal Studios Home Entertainment released Rear Window for the first time on Blu-ray as part of the \"Alfred Hitchcock: The Masterpiece Collection\". This edition included numerous supplemental features such as an audio commentary from John Fawell, excerpts from Hitchcock's interview with François Truffaut, two theatrical trailers, and an interview with the film's screenwriter John Michael Hayes.</p><p>On May 6, 2014, Universal Pictures Home Entertainment re-released Rear Window on Blu-ray with the same supplemental features.</p><br/><h3>Reception</h3><h4>Box office</h4><p>During its initial theatrical run, Rear Window earned $5.3 million in North American box office rentals.</p><h4>Critical response</h4><p>Bosley Crowther of The New York Times called the film a \"tense and exciting exercise\" and deemed Hitchcock as a director whose work has a \"maximum of build-up to the punch, a maximum of carefully tricked deception and incidents to divert and amuse.\" Crowther also noted that \"Mr. Hitchcock's film is not 'significant.' What it has to say about people and human nature is superficial and glib, but it does expose many facets of the loneliness of city life, and it tacitly demonstrates the impulse of morbid curiosity. The purpose of it is sensation, and that it generally provides in the colorfulness of its detail and in the flood of menace toward the end.\" Variety called the film \"one of Alfred Hitchcock's better thrillers\" which \"combines technical and artistic skills in a manner that makes this an unusually good piece of murder mystery entertainment.\" The film ranked 5th on Cahiers du Cinéma's Top 10 Films of the Year List in 1955.</p><p>Time called it \"just possibly the second-most entertaining picture (after The 39 Steps) ever made by Alfred Hitchcock\" and a film in which there is \"never an instant ... when Director Hitchcock is not in minute and masterly control of his material.\" The reviewer also noted the \"occasional studied lapses of taste and, more important, the eerie sense a Hitchcock audience has of reacting in a manner so carefully foreseen as to seem practically foreordained.\" Harrison's Reports named the film as a \"first-rate thriller\" that is \"strictly an adult entertainment, but it should prove to be a popular one.\" They further added, \"What helps to make the story highly entertaining is the fact that is enhanced by clever dialogue and by delightful touches of comedy and romance that relieve the tension.\"</p><p>Nearly 30 years after the film's initial release, Roger Ebert reviewed the re-release by Universal Pictures in October 1983, after Hitchcock's estate was settled. He said the film \"develops such a clean, uncluttered line from beginning to end that we're drawn through it (and into it) effortlessly. The experience is not so much like watching a movie, as like ... well, like spying on your neighbors. Hitchcock traps us right from the first ... And because Hitchcock makes us accomplices in Stewart's voyeurism, we're along for the ride. When an enraged man comes bursting through the door to kill Stewart, we can't detach ourselves, because we looked too, and so we share the guilt and in a way we deserve what's coming to him.\" In 1983, reviewing the film Vincent Canby wrote \"Its appeal, which goes beyond that of other, equally masterly Hitchcock works, remains undiminished.\"</p><p>The review aggregator website Rotten Tomatoes reports an approval rating of 98% based on 124 reviews, with an average rating of 9.20/10. The critics' consensus states that \"Hitchcock exerted full potential of suspense in this masterpiece.\" At Metacritic, the film has a weighted average score of a very rare, perfect 100 out of 100 based on 18 critics, indicating \"universal acclaim\". In his 2012 review of the film Killian Fox of The Guardian wrote \"Hitchcock made a career out of indulging our voyeuristic tendencies, and he never excited them more skilfully, or with more gleeful self-awareness, than in Rear Window\".</p><h4>Awards and honors</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Date of ceremony</th><th>Award</th><th>Category</th><th>Subject</th><th>Result</th></tr><tr><td><span>August 22 to September 7, 1954</span></td><td><span>Venice Film Festival</span></td><td><span>Golden Lion</span></td><td><span>Alfred Hitchcock</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>December 20, 1954</span></td><td><span>National Board of Review Awards</span></td><td><span>Best Actress</span></td><td><span>Grace Kelly</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>January 1955</span></td><td rowspan=\"2\"><span>NYFCC Awards</span></td><td><span>Best Actress</span></td><td>Grace Kelly</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Alfred Hitchcock</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">2nd place</td></tr><tr><td><span>February 13, 1955</span></td><td><span class=\"mw-redirect\">DGA Award</span></td><td>Outstanding Achievement in Feature Film</td><td>Alfred Hitchcock</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">February 28, 1955</span></td><td><span class=\"mw-redirect\">Writers Guild of America Awards</span></td><td>Best Written American Drama</td><td><span>John Michael Hayes</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>March 10, 1955</span></td><td><span>BAFTA Award</span></td><td><span>Best Film</span></td><td><i>Rear Window</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>March 30, 1955</span></td><td rowspan=\"4\"><span>Academy Awards</span></td><td><span>Best Director</span></td><td>Alfred Hitchcock</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td>John Michael Hayes</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography – Color</span></td><td><span>Robert Burks</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound – Recording</span></td><td><span>Loren L. Ryder</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"new\">April 21, 1955</span></td><td><span class=\"mw-redirect\">Edgar Allan Poe Awards</span></td><td><span>Best Motion Picture Screenplay</span></td><td>John Michael Hayes</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>November 18, 1997</span></td><td><span>National Film Preservation Board</span></td><td><span>National Film Registry</span></td><td><i>Rear Window</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2002</td><td>Online Film &amp; Television Association Award</td><td>OFTA Film Hall of Fame – Motion Picture</td><td><i>Rear Window</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><h4>Analysis</h4><p>In Laura Mulvey's essay \"Visual Pleasure and Narrative Cinema,\" she identifies what she sees as voyeurism and scopophilia in Hitchcock's movies, with Rear Window used as an example of how she sees cinema as incorporating the patriarchy into the way that pleasure is constructed and signaled to the audience. Additionally, she sees the \"male gaze\" as especially evident in Rear Window in characters such as the dancer \"Miss Torso;\" she is both a spectacle for Jeff to enjoy, as well as for the audience (through his substitution).</p><p>In his book, Alfred Hitchcock's \"Rear Window\", John Belton further addresses the underlying issues of voyeurism which he asserts are evident in the film. He says \"Rear Window's story is 'about' spectacle; it explores the fascination with looking and the attraction of that which is being looked at.\"</p><p>In his 1954 review of the film, François Truffaut suggested \"this parable: The courtyard is the world, the reporter/photographer is the filmmaker, the binoculars stand for the camera and its lenses.\"</p><h4>Voyeurism</h4><p>John Fawell notes in Dennis Perry's book, Hitchcock and Poe: The Legacy of Delight and Terror, that Hitchcock \"recognized that the darkest aspect of voyeurism . . . is our desire for awful things to happen to people . . . to make ourselves feel better, and to relieve ourselves of the burden of examining our own lives.\" Hitchcock challenges the audience, forcing them to peer through his rear window and become exposed to, as Donald Spoto calls it in his 1976 book The Art of Alfred Hitchcock: Fifty Years of His Motion Pictures, the \"social contagion\" of acting as voyeur.</p><p>In an explicit example of a condemnation of voyeurism, Stella expresses her outrage at Jeffries' voyeuristic habits, saying, \"In the old days, they'd put your eyes out with a red hot poker\" and \"What people ought to do is get outside and look in for a change.\"</p><p>One climactic scene in the film portrays both the positive and negative effects of voyeurism. Driven by curiosity and incessant watching, with Jeff watching from his window, Lisa sneaks into Thorwald's second-floor apartment, looking for clues, and is apprehended by him. Jeff is in obvious anxiety and is overcome with panic as he sees Thorwald walk into the apartment and notice the irregular placement of the purse on the bed. Jeff anxiously jitters in his wheelchair, and grabs his telephoto camera to watch the situation unfold, eventually calling the police because Miss Lonelyhearts is contemplating suicide in the neighboring apartment. Chillingly, Jeff watches Lisa in Thorwald's apartment rather than keeping an eye on the woman about to commit suicide. Thorwald turns off the lights, shutting off Jeff's sole means of communication with and protection of Lisa; Jeff still pays attention to the pitch-black apartment instead of Miss Lonelyhearts. The tension Jeff feels is unbearable and acutely distressing as he realizes that he is responsible for Lisa now that he cannot see her. The police go to the Thorwald apartment, the lights flicker on, and any danger coming toward Lisa is temporarily dismissed. Although Lisa is taken to jail, Jeff is utterly mesmerized by her dauntless actions.</p><p>With further analysis, Jeff's positive evolution understandably would be impossible without voyeurism—or as Robin Wood puts it in his 1989 book Hitchcock's Films Revisited, \"the indulging of morbid curiosity and the consequences of that indulgence.\"</p><h4>Legacy</h4><p>Ownership of the copyright in Woolrich's original story was eventually litigated before the Supreme Court of the United States in Stewart v. Abend. The film was copyrighted in 1954 by Patron Inc., a production company set up by Hitchcock and Stewart. As a result, Stewart and Hitchcock's estate became involved in the Supreme Court case, and Sheldon Abend became a producer of the 1998 remake of Rear Window.</p><p>In 1997, Rear Window was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". By this time, the film interested other directors with its theme of voyeurism, and other reworkings of the film soon followed, which included Brian De Palma's 1984 film Body Double and Phillip Noyce's 1993 film Sliver. In 1998 Time Out magazine conducted a poll and Rear Window was voted the 21st greatest film of all time. In the British Film Institute's 2012 Sight & Sound polls of the greatest films ever made, Rear Window was ranked 53rd among critics and 48th among directors. In the 2022 edition of the magazine's Greatest films of all time list the film ranked 38th in the critics poll. In 2017 Empire magazine's readers' poll ranked Rear Window at No. 72 on its list of The 100 Greatest Movies. In 2022, Time Out magazine ranked the film at No. 26 on their list of \"The 100 best thriller films of all time\".</p><p>Rear Window was restored by the team of Robert A. Harris and James C. Katz for its 1999 limited theatrical re-release (using Technicolor dye-transfer prints for the first time in this title's history) and the Collector's Edition DVD release in 2000.</p><p>American Film Institute included the film as number 42 in AFI's 100 Years...100 Movies, number 14 in AFI's 100 Years...100 Thrills, number 48 in AFI's 100 Years...100 Movies (10th Anniversary Edition) and number three in AFI's 10 Top 10 (Mysteries).</p><p>Rear Window was remade as a TV movie of the same name in 1998, with an updated storyline in which the lead character is paralyzed and lives in a high-tech home filled with assistive technology. Actor Christopher Reeve, himself paralyzed as a result of a 1995 horse-riding accident, was cast in the lead role. The telefilm also starred Daryl Hannah, Robert Forster, Ruben Santiago-Hudson, and Anne Twomey.</p><p>Disturbia (2007) is a modern-day retelling, with the protagonist (Shia LaBeouf) under house arrest instead of laid up with a broken leg, and who believes that his neighbor is a serial killer rather than having committed a single murder. On September 5, 2008, the Sheldon Abend Trust sued Steven Spielberg, DreamWorks, Viacom, and Universal Studios, alleging that the producers of Disturbia violated the copyright to the original Woolrich story owned by Abend. On September 21, 2010, the U.S. District Court in Abend v. Spielberg, 748 F.Supp.2d 200 (S.D.N.Y. 2010), ruled that Disturbia did not infringe the original Woolrich story.</p><br/>"
  },
  "errorMessage": ""
}