{
  "imDbId": "tt0382932",
  "title": "Ratatouille",
  "fullTitle": "Ratatouille (2007)",
  "type": "Movie",
  "year": "2007",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "100",
      "content": "Brad Bird and Pixar recapture the charm and winning imagination of classic Disney animation."
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "",
      "rate": "100",
      "content": "Ratatouille is delicious. In this satisfying, souffle-light tale of a plucky French rodent with a passion for cooking, the master chefs at Pixar have blended all the right ingredients -- abundant verbal and visual wit, genius slapstick timing, a soupcon of Gallic sophistication -- to produce a warm and irresistible concoction that's sure to appeal to everyone's inner Julia Child."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/33977/index1.html",
      "rate": "100",
      "content": "Bird clearly knows the great silent clowns: The slapstick he devises is balletic."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Phillips",
      "link": "",
      "rate": "100",
      "content": "Its sense of humor is more sly, more sophisticated and more interesting than most PG-13 or R-rated comedies at the moment. The film may be animated, and largely taken up with rats, but its pulse is gratifyingly human."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Tasha Robinson",
      "link": "https://www.avclub.com/",
      "rate": "91",
      "content": "Bird and his co-writers leave room for quiet moments and gentle morals, but for the most part, they send visual gags and verbal punchlines tearing past at an enjoyably demanding speed, whipping up the film's energy at every turn."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "Ratatouille is as much a feast for the senses as it is food for thought."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/events/film/2007-06-29/495797/",
      "rate": "89",
      "content": "Pixar's animation is simply flawless; colorful, deeply realized, and ably conveying both the chaos of the kitchen, and the sensual allure of food well prepared."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "88",
      "content": "What makes Ratatouille such a hilarious and heartfelt wonder is the way Bird contrives to let it sneak up on you."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "https://ew.com/article/2007/06/29/ratatouille-3/",
      "rate": "75",
      "content": "Ratatouille is a blithe concoction, as well as a miraculously textured piece of animated design."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/movies/r/ratatouille.html",
      "rate": "75",
      "content": "For parents looking to spend time in a theater with their kids or adults who want something lighter and less testosterone-oriented than the usual summer fare, Ratatouille offers a savory main course."
    }
  ],
  "errorMessage": ""
}