{
  "imDbId": "tt0382932",
  "title": "Ratatouille",
  "fullTitle": "Ratatouille (2007)",
  "type": "Movie",
  "year": "2007",
  "items": [
    {
      "username": "cinephile-27690",
      "userUrl": "https://www.imdb.com/user/ur88612516",
      "reviewLink": "https://www.imdb.com/review/rw4446684",
      "warningSpoilers": true,
      "date": "9 November 2018",
      "rate": "10",
      "helpful": "149 out of 155 found this helpful.",
      "title": "\"Not everyone can become a great artist; but a great artist *can* come from *anywhere*\"",
      "content": "That's what the food critic, Anton Ego, says in his review of the movie's restaurant at the end of the movie. That is a good way to sum up Ratatouille.This movie released a few days after my 9th birthday. My Grandma got the DVD and I loved it. I was a kid and animated movies were my jam! I even taped a Disney Channel showing on a record-able VHS. I have seen this numerous times, and I still love it. I just saw it again as a 20 year old and it still puts me in awe.The movie is about Remy, a rat who has an obsession with food, cooking, and the humans who cook food. He meets a chef who can't cook very well, and he uses his talent to secretly help him. But that causes issues with a secret rat in a failing restaurant.I can't think of a single flaw with this movie.The animation is beautiful(I noticed one car that almost looked real at one point)and the story is well told.I know when I love a movie when I feel this thrill in my heart and an excitement along with it.(See my review of Lord of the Rings: The Return of the King) I felt that all throughout this movie, even though I have seen this movie numerous times.This is an animated movie where you don't need to be a kid to enjoy it. (Roger Ebert said this as well.) Anton Ego also says that he will return to the restaurant \"hungry for more.\" Revisiting this as an adult makes me say the same thing about the movie he is in.Edit: Nearly 11 months later, 7/7 people found the review helpful. I appreciate the positive feedback from everyone! If you enjoyed this review, please click on cinephile-27690 and click \"reviews\" on the right for more reviews! Movies are my passion, so let me share it with you!"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1690172",
      "warningSpoilers": false,
      "date": "9 July 2007",
      "rate": "10",
      "helpful": "51 out of 61 found this helpful.",
      "title": "One of Pixar's best",
      "content": "This film is exactly what Pixar needed to steal the thunder from Dreamworks' latest release, SHREK III. In many ways, this is very ironic, as one of Pixar's best films, MONSTERS INC., was overwhelmed when it was released due to the first SHREK's success. I honestly think if SHREK hadn't been such a wonderful movie, people would have noticed that MONSTERS INC. was an exceptional film. Now, Pixar gets some payback with one of their best, RATATOUILLE.Actually, RATATOUILLE is probably Pixar's best film, though I did enjoy TOY STORY II and THE INCREDIBLES. The reason I was so overwhelmed by this story was that it was so highly original and creative--I simply cannot compare the plot to any other film (something you can do with THE INCREDIBLES and TOY STORY II). Plus, after years of making CG movies, the look is taken to a whole new level in this film--it just looks breathtaking.Now I need to point out that RATATOUILLE is not as much a kid's movie as its predecessors. Sure, it can be enjoyed by the kids, but the story line is a tad darker and covers an adult concept (illegitimate birth) and includes a swear word (though not one the really \"bad\" ones, you can be sure). Also, while the rats are kind of cute (and a marketer's dream), most of the rest of the story isn't and there are no catchy kid's tunes. No, instead this film is aimed more at teens and adults in its sensibilities--something that really helped make SHREK a financial gold mine and cursed MONSTERS INC. to be seen (incorrectly) as \"just a kid's movie\".Amazing animation, excellent writing and, the rarest of rare, a completely original and captivating plot make this a winner and film that will be long remembered. I can't wait to see it again."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw4825842",
      "warningSpoilers": false,
      "date": "4 May 2019",
      "rate": "10",
      "helpful": "28 out of 33 found this helpful.",
      "title": "Among the Greatest Animated Features",
      "content": "The absolutely absurd premise of a rat becoming a great French chef is brought to fruition by Pixar. It starts by being amazingly colorful and capturing the world of food. Secondly, it is downright funny but does not insult the intelligence of the viewers. Food becomes the background for everything and as the tiny rodent gains popularity, we are pulling for him. This is such an intelligent film and it works at every level."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6186008",
      "warningSpoilers": false,
      "date": "18 October 2020",
      "rate": "9",
      "helpful": "32 out of 38 found this helpful.",
      "title": "A Feast for the Soul...",
      "content": "Taking great ingredients including but not limited to, an endearing story with meaning and a message, superb and breathtaking animation, brilliantly voiced narration and as cute a rattus rattus you're ever likely to encounter. Combined, refined, formed and baked to perfection, the result, a jaw dropping piece of film that you can perpetually admire, enjoy and savour."
    },
    {
      "username": "PoisonKeyblade",
      "userUrl": "https://www.imdb.com/user/ur7752337",
      "reviewLink": "https://www.imdb.com/review/rw1676403",
      "warningSpoilers": false,
      "date": "17 June 2007",
      "rate": "10",
      "helpful": "399 out of 537 found this helpful.",
      "title": "Best Animated Film in Creation",
      "content": "The combination of Disney and Pixar never ceases to amaze, but with Ratatouille, their newest effort, animated features are brought to new heights with the best one to date. Ratatouille is stunning, surreal while at the same time realistic, and a joy to watch. The writing is, in one word, just amazing, and the voice acting is sensational. The characters are poetic and real, and the rats are some of Disney/Pixar's cutest creations. Ratatouille is written and directed by Brad Bird (The Incredibles), and features stellar voice acting from Peter O'Toole, Patton Oswalt, Ian Holm, Brian Dennehy, Lou Romano, Brad Garrett, and Janeane Garofalo.Remy (voiced by Patton Oswalt) is a little rat who dreams of becoming a chef just like his idol, the human Gusteau (voiced by Brad Garrett). After a mishap, Remy loses his family in the sewers and comes upon a fading restaurant that had previously been owned by Gusteau before his untimely death. He comes upon a lowly garbage boy, Linguini (voiced by Lou Romano), and together they set out to revive the once-legendary restaurant.Ratatouille is filled with loads of surprises and lots of twists and turns. The animation is even more stunning here than in some of the other Disney/Pixar productions, and the breathtaking landscape of Paris, France, really adds a layer of realism to the film. The food looks so real and delicious, and the humans and rats look incredibly realistic. Remy and Linguini are both lovable characters, and the audience is rooting for them the entire way. Surprisingly enough, this movie is the funniest of the Disney/Pixar films, with very subtle and unique humor.As previously stated, the voice acting really makes the film different, and each actor is perfectly suited to his or her role. The best among the bunch happens to be Lou Romano, as he deals with his character extremely well and is incredibly believable. There are times when the acting and animation is so excellent that you forget you are watching an animated film altogether. Brad Garrett is actually tolerable for once, and is excellent in his role as Gusteau, who acts as Remy's conscience for the majority of the film. Some of the funniest scenes in the movie are rooted from Gusteau's chats with Remy and many others come from the relationship between Linguini and Remy. On another note, Patton Oswalt does a magnificent job voicing Remy, and Peter O' Toole is very memorable as Anton Ego, the food critic for 'The Grim Eater'.Overall, you can't ask for a better film than Ratatouille, a new classic from Disney/Pixar that is filled with humor, amazing animation, and, most importantly, lots of heart. Some of the scenes are so poetic and perfect that they just bring tears to your eyes. It may be hard to believe, but Ratatouille is far better than any other animated films you will see this year, or perhaps that you will ever see. It manages to be better than Toy Story, better than Finding Nemo, even better than the fantastic Meet the Robinsons. I saw a pre-screening of the film on Saturday, June 16, but I cannot wait to see it again once it hits theaters everywhere on June 29. See Ratatouilleit is highly original, heartwarming, uplifting, and a very thrilling movie that has to be the best animated feature of the last few decades."
    },
    {
      "username": "willden21",
      "userUrl": "https://www.imdb.com/user/ur2184982",
      "reviewLink": "https://www.imdb.com/review/rw1676404",
      "warningSpoilers": false,
      "date": "17 June 2007",
      "rate": "10",
      "helpful": "293 out of 364 found this helpful.",
      "title": "An Amazing film, made for film lovers, with an artistic/indie appeal",
      "content": "I caught a sneak peak yesterday, and must say, this film is a classic. It is not as flashy as cars, or as action packed as Incredibles, but it is a masterpiece of restraint and heart, that matches the classics from the golden age of the film industry. Pixar has always been groundbreaking for smart and fun animated features, but Ratatouille might just be what puts them over the top as one of the BEST all around film-making teams in history.Ratatouille is a treat for film lovers. It feels like a classic. The animationis absolutely beautiful, especially the scenery of Paris which evoked awes from the audience, as if we were seeing a grandiose fireworks show.The story is oh so classy and universal, especially when you look at it as a parable to yourself and society. Sometimes the story seems familiar, yet it is packed with so much genuine heart and individuality, that it might even be too \"indie\" for most audiences. But those who are patient and willing to open their minds and hearts, even when it may challenge the viewers to rethink their own personal biases, will find within this entertaining, sweet, simple film a remarkable message about challenging societal norms and not letting anything stand in your way of your dreams. When you follow your dreams, you never know what an impact it will have upon you, or those you might encounter on the journey. Just see the film, and be open to its message, and I am sure if you allow it too, it will touch you as well.P.S. : The short in front of the feature is the funniest animated short film pixar has ever done, so even if ratatouille might not be as flashy as many might want it to be, the short film will have everyone in stitches, as it did our entire theater. So just go and see it, and be prepared for a wonderful two hours."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1683558",
      "warningSpoilers": false,
      "date": "29 June 2007",
      "rate": "10",
      "helpful": "21 out of 30 found this helpful.",
      "title": "truly devilish fun and mind-blowingly entertaining as classic cartoon style, but also very successful in storytelling- magnifique!",
      "content": "It's pretty easy to make little rodents charming and fun characters (just ask Disney himself, to a clichéd extent), but it's even harder to make them work in such a way that's original and exciting as comedy in conventional ways for today's audiences. But Brad Bird shouldn't be lumped into the group of today's CGI animators. He doesn't really think in those terms, but rather in how to make things look real, and yet at the same time keeping in full mind that it's a cartoon, not reality. This goes not simply for the rats themselves- the funniest, probably even funnier, that Disney's remotely had to market since the Great Mouse Detective- but the human characters too, who have their own distinct shapes and qualities based on personality and relevance to the story (whether they're good or bad, or maybe even more complex too). He places the designs for the characters right up there with the rest of the atmosphere, and then also adds in just the right way to make that wonderfully formulaic Pixar storyline- you know a lot of what may unfold, though not everything, and you know that you're in excellent hands because of the levels of detail and nuance in the comedy chaos at times. It'll be hard to beat this (to put it in a corny phrase) 'gourmet selection' as the best animated film of the year, and certainly the best that Pixar's done since, um, the last Brad Bird movie! The story is the fish out of water, or in this case rat, where a little rodent named Remy, who is totally immersed in the style of Augustus Gusteau, a famous French chef who dies, and who's position is filled by a lowly garbageman named Linguini. He can't cook, of course, but somehow Remy, separated from his rat family, cooks something up on the spot as a not-quite accident, sending Linguini as the one who supposedly made it. On the fluke, he becomes the new chef at Gusteau's...only, the chef's a rat, literally, hilariously pulling Linguini's hair to make him a cooking puppet (early on this makes for some of the best physical comedy of any Pixar movie). This fluke becomes the start of the usual ball of string unraveled bit by bit, involving an heir to Gusteau's fortune, a love interest in aggressive chef Colette, and Remy's reconnection and estrangement from his huge rat clan and his father. All the while Bird throws in such dangerous and downright devilish comedy for a *G* rated animated movie. And there's morales to be learned too, or sort of taken away, I guess, only this time in the true Disney form instead of Pinocchio and Jiminy Cricket, it's Remy and the, well, illusion of Gusteau's ghost appearing to him as a quasi-conscious.What makes Ratatouille stand out of the pack from the fellow summer far of the moment, particularly 4th of July fare, is how there's such deft to Bird and his team navigating along the lines of making the comedy work to its excessive lengths while always keeping a firm grip on which turn the story will take next (the moments I didn't quite expect- the whole heir angle involving Linguini, and the climactic scenes with the rats preparing the restaurant's dinners, all washed before going to work, and keeping 'under wraps' the health inspector at the same time!). I probably laughed just as much during this film as I would at something much raunchier like Knocked Up or Grindhouse, to give recent examples, but as mentioned there's a riskiness to Bird's style here.One scene I particularly loved is when Remy is training linguini to command the muscle-controlled hair pulling scheme at his home, and there's a build-up to what seems like a knife going to cut into his fingers while he's chopping vegetables (up to this point he's been hopeless in his training), but at this very point where we should expect the worst, which is funny unto itself, it starts to level out and he's sort of under control. Sort of in that he'll still be naturally clumsy enough to spill the wine on his own head. Same goes for little things like the quite silhouetted bit Remy passes by with the lover about to shoot the other and then falling into full embrace, or the actual fellow employees at Gusteau's, one of who has the wildest thumb ever shown in a movie, least of all a 'family' movie, that I can remember (albeit Bird does come out of working on the Simpsons).So many masterstrokes of comedy go on that it's almost neglected to note how exciting a lot of the film is too, the run-around Remy has in the kitchen first time he comes in or the chase through Paris between the crooked head cook Skinner and Remy, and how seamless voice-work and the (now highly expected) advances in Pixar's technical innovations go together. It was a good guessing game who was the voice of Ego (it's O'Toole, but then it could be any given old regal British person), and to pick out that it's Ian Holm or Garofolo voicing some of the other parts, but it's not something that is immediately meant to be stand-out like in other CGI movies where it's being sold mostly on celebrity voice talent. It's almost like a lot of this comes quite naturally to Bird and his team, and yet because it isn't it reverts to becoming all the more remarkable. Ratatouille is simply an exceptionally fun picture, loaded with sight gags and puns and slips of behavior, and never overbearing with any of the usual messages that come pre-packaged for kids in these movies, all the more remarkable as it comes nearer to Pixar reusing previous ones."
    },
    {
      "username": "stalcup",
      "userUrl": "https://www.imdb.com/user/ur15606002",
      "reviewLink": "https://www.imdb.com/review/rw1676446",
      "warningSpoilers": false,
      "date": "17 June 2007",
      "rate": "10",
      "helpful": "580 out of 678 found this helpful.",
      "title": "Incredible",
      "content": "Remember how everyone was talking about Toy Story when it first came out? The incredible visuals, unique style, vividly imagined world? The next time people were talking that way with such enthusiasm about a computer animated movie was Finding Nemo. I'm excited to say that Ratatouille will be the next one to redefine the visual creativity and technical detail of computer animated movies. Honest to goodness, I was awestruck by the animation, and that never happens to me. It is a visual masterpiece of a movie if ever the term applies.The next thing to talk about is the \"genre\" of the movie. As Pixar enthusiasts will tell you, Brad Bird, the director of Ratatouille, also directed The Incredibles, which has the most inspired and creative action sequences from any of the Pixar movies. Ratatouille, while not so straightforward with its action, has almost as much as The Incredibles did, in unique ways. Most memorable is the shotgun scene near the beginning. (You'll know what I'm talking about when you see it). Other than that, this is the expected comedy-with-heart movie from Pixar that so many have grown to love.The voice acting? Spot on. Every voice is distinctive, and it never feels like a celebrity's voice tacked on to a character (Shrek, I'm looking at you), it feels like the characters themselves speaking. You can't ask for more from voice acting.And finally, the script and the story. The entire irony of the story -- a street rat with a passion for fine food -- is beautiful, and a tight, smart, wonderful script flows from this. The pacing of the story is odd and choppy at places, but this is a very forgivable grievance. The only other minor fault is that a few of the dramatic one-liners feel a bit forced. Other than that, this is the most layered, complex, and satisfying script from Pixar since The Incredibles.Overall, I recommend that everyone see this movie when it hits theaters (I was lucky enough to see a pre-release screening). Though not perfect, it is an animated masterpiece in true Pixar form with breathtaking animation and visual design.10/10"
    },
    {
      "username": "ashowen",
      "userUrl": "https://www.imdb.com/user/ur6812302",
      "reviewLink": "https://www.imdb.com/review/rw1676342",
      "warningSpoilers": false,
      "date": "16 June 2007",
      "rate": "10",
      "helpful": "212 out of 273 found this helpful.",
      "title": "Another Disney-Pixar Masterpiece!",
      "content": "This film is fantastic! Pixar has yet another great film to add to their impressive repertoire. Oscar-winning director and screenwriter Brad Bird, who wrote and directed \"The Incredibles\", has produced a film with subtle humor, heart, and very profound truth. The voice actors are so great, and it is especially great to hear Peter O'Toole on the screen. The animation is beautiful and it is all around an excellently made film. Its message is one that holds so much truth for everyone, especially today's youth: it tells people that no, not anyone can do anything, but if you have the talent you don't have to be limited by your surroundings or your upbringing. I think this is refreshing to hear because often, children are lied to when they are told they can do anything, when actually not all of them can. But it offers hope to the ones who may feel limited by their social class. It also exposes the fact that most people try to put up false facades of themselves to hide who they are in order to feel accepted by the social standards we create in our society; it shows characters with this flaw, but ultimately they accept this reality and learn to be true to themselves. This thread, I think, is very common throughout the Pixar films, and they present it very well. \"Ratatouille\" is my new Disney-Pixar favorite! \"Ce film a pleine de joie de vivre!\""
    },
    {
      "username": "DICK STEEL",
      "userUrl": "https://www.imdb.com/user/ur0317399",
      "reviewLink": "https://www.imdb.com/review/rw1709413",
      "warningSpoilers": false,
      "date": "10 August 2007",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "A Nutshell Review: Ratatouille",
      "content": "The Pixar juggernaut continues! I've always been enthralled by the movies that Pixar puts out ever since Toy Story, and through the years, Pixar has built a brand of trust amongst movie goers, with quality storytelling using animation as a tool to tell them, not because it's cool to do things through the medium, but that it adds a certain powerful, believable dimension, with stories rooted to universal themes, yet jazzed up by the structure in which it's told. The Incredibles ranked amongst my favourite so far, but writer-director Brad Bird has topped that with Ratatouille, a story about a rat, and probably the most mature of the Pixar stories to date.One of the rare successful rats in the animated genre is Mickey, but Remy here (voiced by Patton Oswalt) has more character, and with that photo realistic quality to him, will give Mickey a run for his money. It's a class act story about a rat who dreams of being somebody, of wanting to follow that dream in becoming a chef in Paris, and is undeterred by his size, and well, form, even though in any kitchen, the last thing you want is a rat in it. And to realize his dream, he forms a symbiotic friendship with bumbling Linguini (Lou Romano), a garbage boy who just joined the restaurant which Remy's idol, the late renowned chef Gusteau (Brad Garrett), founded.It's a story about the tussle between friendship and family, with the latter providing an added emphasis, and you'll happen to just about find a familiar chord to it. Remember the time when your folks frown upon the friends you keep, and how sometimes, through their good intentions, unwittingly stifle your hopes and desires? Or how family becomes that obstructing stone on the pathway to success, or being taken for granted to provide for greedy, unabashed family and so-called friends? Ratatouille explores these and more, though they're kept veiled and subtle for the narrative to move on, and never provided a dull moment for kids and adults alike.Pixar's animation continues to astound, and provide inspiration to the many 3D animators out there - they have always set new benchmarks for others to follow, and I think they're on top of their game with the excellent animated portrayal of Paris, the kitchen, and of course, the rats, with that touch of photo realistic quality to it all, which does wonders to the food presented. Amongst the food, I like the crusty breads best - you can almost feel the texture, and the rustling sound is just to die for. And the cheese, you can just feel it melt in your mouth. Mmm mmm!The story's adversaries might be familiar - a mean boss Skinner (Ian Holm) and a mightier- than-though food critic Anton Ego (Peter O'Toole), but it's the latter, despite his shorter screen time, that does its best to chill, and it was such an obvious jab with making him English. The comedy's here top notch, not necessarily relying solely on slapstick to bring on the laughs, but possessing many sly moments throughout as you root for little Remy and his escapades, less so for Linguini though, who comes off as that perfect loser in life.Ratatouille is a perfectly delicious offering worthy of that Pixar stamp, and definitely gonna be a crowd pleaser. I'm not sure why the delay in getting it released here, and having to suffer watching poor quality animation along the way. But the wait is well worth it, and I bet everyone will be pleasantly surprised indeed, with all the ingredients coming together for that wonderful presentation, that tastes and looks ju st wonderful. Despite the overkill of trailers, pre-screening warnings to turn off your mobile phones, etc, continue to put your trust in that little rat Remy, and savour what Ratatouille has to offer. No regrets - highly recommended, and another contender for my top movie of the year listing.Ratatouille is preceded by the trailer for the next Pixar movie Wall-E, and a short Pixar featurette titled Lifted, about two aliens and one of their attempts in passing the Alien Abduction course. Stay throughout the animated end credits for a little coda at the end."
    },
    {
      "username": "superfan18",
      "userUrl": "https://www.imdb.com/user/ur8902230",
      "reviewLink": "https://www.imdb.com/review/rw1672697",
      "warningSpoilers": false,
      "date": "11 June 2007",
      "rate": "10",
      "helpful": "447 out of 556 found this helpful.",
      "title": "Excellent movie!",
      "content": "Tonight I went to see Ratatouille during a preview offered to Myspace users in Boston. Overall the movie was GREAT! It was really funny, often in unexpected places, the storyline kept you engaged the entire time and the overall mood was lighthearted and inspiring. A real \"feel-good\" movie. I admit I was a bit skeptical going in, I mean the idea of a rat in a kitchen kind of left me queasy, but I left the theater excited to see it again when it is released. The voice actors are excellent and the animation is amazing. I've been to Paris before and the overall views were very accurate. At times I could tell exactly where in the city the events were taking place. Overall a fabulous movie, I highly recommend it!"
    },
    {
      "username": "mstramba",
      "userUrl": "https://www.imdb.com/user/ur4628154",
      "reviewLink": "https://www.imdb.com/review/rw1676350",
      "warningSpoilers": false,
      "date": "17 June 2007",
      "rate": "10",
      "helpful": "240 out of 296 found this helpful.",
      "title": "Pixar's best yet !",
      "content": "Fantastic ! ... Can't wait to get the DVD ! The technical / animation / lighting ..etc aspects of the film are awesome. Pixar has raised the bar again.The best thing about the movie, is that it showcases Pixar's \"mantra\" , that being story, story ...story. That along with having great characters/animation/dialog, which you just forget ... or never even consider are digital puppets.The humor was great too, the gags / situations character acting all contributing to making situations that \"kids of all ages \" could \"get\".There is on one level the entire story, of Remy and Linguini, but then there are 3 or 4 or more subplots and a number of dramatic scene changes which almost felt like separate chapters of the main story. That all contributed ..for me at least... to keeping the movie very interesting right to the end.While I found a few things predictable, there were also quite a few twists and and unexpected events / scenes, that just kept giving me more new \"stuff\" to enjoy 10 / 10 Mike"
    },
    {
      "username": "cricketbat",
      "userUrl": "https://www.imdb.com/user/ur6201371",
      "reviewLink": "https://www.imdb.com/review/rw4541675",
      "warningSpoilers": false,
      "date": "28 December 2018",
      "rate": "9",
      "helpful": "17 out of 25 found this helpful.",
      "title": "Features one of my favorite animated movie moments of all time",
      "content": "Not only does Ratatouille do a fantastic job of portraying the joy of eating, but it also features one of my favorite animated movie moments of all time (the childhood flashback scene). Yes, the premise is goofy and, yes, rodents are actually pretty disgusting, but that doesn't make me love this movie any less. This is one of the Pixar greats."
    },
    {
      "username": "bobsgrock",
      "userUrl": "https://www.imdb.com/user/ur9972457",
      "reviewLink": "https://www.imdb.com/review/rw1805462",
      "warningSpoilers": false,
      "date": "22 January 2008",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Amazing, spectacular, and perfect.",
      "content": "The greatest test of whether or not a film is truly admirable is how well it holds up years after its release. It has been almost three years since Ratatouille has been released and I have now seen it at least four times, maybe more. I am proud and thrilled to say that it has not lost any of its charm, still looks amazing and holds up better than almost any film I've seen as many times as I've seen this.It's hard to put your finger on, but why exactly is Pixar able to create these astonishingly good films that aren't just entertaining and delightful, although they certainly are that. They are able to tap into the very realms of the human condition, and with this bring to the surface emotions and feelings you come to not expect from an animated film because after all, animated automatically infers a film for children.Of course Ratatouille breaks that mold and I am just so pleased that I got caught up in the world of Remy once again. With their endless budget from Disney, Pixar can create and explore any aspect necessary and writer/director Brad Bird does just that. The story here comprises elements of drama, sadness, family relations, job pressures, as well as a wonderful monologue near the end by a critic for critics. The story is pitch-perfect, always understandable and the foundation for which the film is made.And, since it is Pixar and Disney, the look and feel of the film is so engrossing, it looks better than other animated films made after it. One of the things Pixar does so well is find the middle ground in making elements of the frame look real but not too real, thus still maintaining an animated universe. They did it with the water in Finding Nemo, the cars in Cars, and they do it here with the food, which at times looks so real you want to taste it.I really can't say anything bad about Ratatouille. Even the story elements of how Remy and his human counterpart, Linguini, are able to work together work because this is the animated world which lends itself to more freedoms than our world. The voices are terrific from Patton Oswalt to Ian Holm to the great Peter O'Toole as deathly-thin food critic Anton Ego. There really isn't anything here that doesn't work and Michael Giacchino's score emits the spirit of Paris that sets the background for this story. This is just a great film, perfect in its story, its characters and the wonderful, vibrant world it creates. Years after its release, Ratatouille continues and will continue to impress and immerse viewers in a touching story with beautiful surroundings about the cutest rat in the world becoming a chef in Paris. Only animation, and only Pixar, could make this a film and succeed."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw1693897",
      "warningSpoilers": false,
      "date": "15 July 2007",
      "rate": "",
      "helpful": "15 out of 23 found this helpful.",
      "title": "Hyper Reality",
      "content": "Its easy to see how this story came about. Animators are puppeteers first. So if you asked an animator to come up with a story, naturally you will find two features: one would involve two on-screen characters, one the animator of the other. We have many jokes associated with how imperfectly the on-screen animator (our hero) works his puppet at first. Incidentally, this movie is preceded in the theater by a short: \"Lifting.\" It features a novice \"animator\" of precisely this type, being graded. Notice the infinite panel of switches in that short.Count on Pixar to find yet another way to fold introspection into the form. This is elaborated by the character of a critic. We see him first in a coffin-like office. He's only capable of destruction it seems. Voiced by Peter O'Toole in a stentorian voice-about-theater, he likes what he sees (tastes). Its a great trick you see. Usually this trick is in the form of an on screen audience watching some sort of climactic performance. When they cheer, we do too, as we become folded into the story.In this case, that is handled by a place made for us and occupied by \"the critic.\" So we have a place in the story for the animator and the viewer. What else? We'll need a place for the animation, right? And we have it.It appears first as a book by a now dead, corpulent chef. This book, natch, comes alive. Look how \"Ted's law\" is followed: the distance between the \"real\" world of ourselves and the animated movie is the same as that from the animated movie and the \"living cartoon\" within. Its an explicit fold. And the fact that the inner cartoon has an open, personal feel to it conveys to the personal feel we are intended to have with the Pixar movie.So these three folds: in the story is the story, the animator and the viewer. And the introductory short sets this up too.Having said that, there are a couple noteworthy segments. In terms of the actual craft, Pixar has two areas in which it innovates.One of these in how space is handled. The Pixar guys realized early on that if the three dimensions are going to be modeled anyway, you can zip the camera around in new ways. Early in the game they did this in an overt way. That's been picked up by the summer action films, the best of them, including the Depp pirate business. (Another Disney project benefiting from the eye motion lab.)You can see this throughout the project: there are both all sorts of well managed, unusual perspectives, and a constant overlay of new shots. By this I mean that every shot is just a little different than what you've seen. Just a little canted. A little closer perhaps. A little movement that a physical camera cannot do well.But there are some big production sequences as well. I'm particularly interested in architectural water. Its a unique cinematic challenge. Its not one done well in animation because the mathematics of simply making water look real is daunting. Pixar has done what needs to be done: they have made water hyper-real, dramatic. There's a sequence here that is something like that Pinnochio sequence of 67 years ago with the whale. But its so new and fresh and exciting. Look at the water and see that it has a million tiny agents all seeking to be angry  to do damage but never reaching consensus on just how to attack. This alone is worth the admission.There's another thing that is uniquely Pixar: how characters move. Its a tricky thing, that. As with the water, it is not ever enough that they move realistically. You can make realistic movements by outfitting actors with sensors and translating that to the created beings. It captures nuance. And if you have a particularly skilled source actor, he or she will move not as a real person would, but as an actor would to convey reality. Real isn't real. We need hyperreal in special ways to get- read the reality.The credits of this movie ostentatiously say that \"\"Our Quality Assurance Guarantee: 100% Genuine Animation! No motion capture or any other performance shortcuts were used in the production of this film.\" You can see it. We are entering a new era where both the cameras and the characters can use dramatic motions not possible with human eyes and bodies.Its a challenge for viewers. What do we accept as embodiment? So far, the answer is that the non-natural movements must always be in the service of conveying or seeming natural. But I imagine at the speed this is developing, we may soon see something more.One character note: Colette is voiced by the remarkable Janeane Garofalo. As with our hero, she has that French nose. As the love develops between these two, she becomes decidedly more sexy, both in voice and appearance. Its the appearance that I remark on here. Its all done with postures and a motorcycle. That motorcycle is there in part to allow her to bend forward, and change her lower anatomy. These folks at Pixar are good. Darn good. Glad its Steve Jobs as the creative inspiration instead of that evil other guy.Ted's Evaluation -- 3 of 3: Worth watching."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1696818",
      "warningSpoilers": false,
      "date": "19 July 2007",
      "rate": "10",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Mmm, perfecto!",
      "content": "Another masterpiece from Disney and Pixar, this year they bring us another family classic for generations to come, Ratatouille. My friend and I saw Ratatouille tonite and we just had a blast watching it, this film was such a pleasure and was so funny and cute. I would say that actually this is Pixar's best work, they have come such a long way from Toy Story, it's incredible. But Ratatouille had amazing animation that was so real, makes you wonder if we'll ever need actors in the future, lol. The story is just so charming and a perfect fit for any family to watch, even just to watch this film on your own, I guarantee you will have fun watching it.Remy is a rat with a special gift, a gift of smell, he uses this gift to cook. He's not just any ordinary cook, but an amazing one at that, but when he gets separated from his family, he is haunted by the most famous chef in the world, he ends up in Paris. Where he finds a restaurant that was once grand and has slipped up when it comes to good food. An ordinary garbage boy messes with a stew in the kitchen, when Remy sees this, he helps him out. Linguini, the garbage boy, accepts Remy and together they create masterpieces and bring the restaurant back up. They must keep it a secret how they create these fantastic foods; but that gets so much harder when people try to find out how he's so talented.Ratatouille is such a charming Disney/Pixar film, the animation is great, and the story is just terrific. The actors voices were so great and fit the characters well. If you are looking for a film to see this summer, Ratatouille is definitely a recommendation, it's good to know that Pixar is going to keep giving us these great animation films that I know will be considered classics for a very long time. Ratatouille is delicious, I loved this film.10/10"
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1821988",
      "warningSpoilers": true,
      "date": "17 February 2008",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "\"Not everyone can become a great artist, but a great artist can come from anywhere.\"",
      "content": "When \"Ratatouille\" (2007) was released last summer, I was not too eager to see the animated 106 minutes long film about a rat in a kitchen of a five-star Parisian restaurant. The idea seemed too original and brave for my taste. As film had been shown all over the world, I kept reading and hearing only great reviews for it. Then, my brother who usually does not get exited about any movie, told me that \"Ratatouille\" was absolutely charming, captivating, funny and moving at the same time, and the most charming about it was Remy, a rat, \"little chef\" with huge talent in the fine art of cooking. I saw the movie last weekend and I am happy to agree with my brother completely. \"Ratatouille\" has everything for every viewer to enjoy - technical excellence, amazing colors, highly original images, and the voices that matched the characters perfectly. The film is a clever satire and the moving story that will be interesting for the adults and children alike. Where the movie succeeds admirably - in showing on the screen the process of cooking which can be as inspiring and creative as painting, writing, or composing the music: \"How can I describe it? Good food is like music you can taste, color you can smell. There is excellence all around you. You need only to be aware to stop and savor it.\" Speaking of how the movies sometimes affect our life - after we saw \"Ratatouille\" together with my husband, he demanded that I cooked him a Ratatouille that would take him back to his happy childhood days and rock him to his core just like the one that Remy prepared for a \"grim eater\", the universally feared food critic Anton Ego.Not every year, an animated film is nominated for five Academy awards, and I wish \"Ratatouille\" victories in every category. It deserves them all."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2104120",
      "warningSpoilers": false,
      "date": "31 July 2009",
      "rate": "8",
      "helpful": "16 out of 26 found this helpful.",
      "title": "An unexpected surprise of a film, with a great message.",
      "content": "I really loved Ratatouille, it was original, sweet and lots of fun. While not as laugh-out-loud funny as the two Toy Story films, it is definitely one of the better Pixars, and a complete delight from start to finish. Honestly, the whole family will find it just as delightful as I did, and the film has a great message \"a great cook can come from anywhere\", summed up perfectly by Anton Ego. The story was highly original, if a little slow at the beginning, and deliciously engaging up to the last minute, and the animation was just spellbinding. The script, while not as irreverent as Toy Story, was very entertaining and touching, and I loved the characters- everyone was likable and unique, but what made Remy stand out for me was because he was so adorable, and his voice actor did a delightful job voicing him. The voice cast were very talented, and all did a superb job, especially Peter O'Toole in a marvellous turn as the \"nasty\" food critic Anton Ego. All in all, a brilliant film, that fully succeeded in what it promised to do, to make us want to cook. 8.5/10 Bethany Cox."
    },
    {
      "username": "robcat2075",
      "userUrl": "https://www.imdb.com/user/ur11333584",
      "reviewLink": "https://www.imdb.com/review/rw1676349",
      "warningSpoilers": false,
      "date": "17 June 2007",
      "rate": "9",
      "helpful": "186 out of 287 found this helpful.",
      "title": "A First Rate Film",
      "content": "I just saw \"Ratatouille\" tonight.It's a first class movie. Several thoughts come to mind...-The character performances are so good, I think there's no sort of movie they couldn't make. I've heard Pixar's John Carter of Mars is going to be live action? No! I want them to do it all animated.-\"Cars\" definitely _was_ a lower-value softball they threw to finish out that original Disney-gets-half-of-everything-plus-sequel-rights contract they were in at the time. I remember all the clucking last summer about how Pixar had lost its way.-There were a few moments when they seemed to lose that stylized reality they had established and things looked merely \"real\".-There was one scene in the latter part of the film where I thought \"I can't believe they are doing this tired movie cliché\" but they pulled out of it at the last second and made it something new.-The 2D-ish end credits were great. Stick it out to the very end to see the mo-cap disclaimer!-With this, Brad Bird is certainly one of the animation gods now."
    },
    {
      "username": "fyapar-27303",
      "userUrl": "https://www.imdb.com/user/ur73645347",
      "reviewLink": "https://www.imdb.com/review/rw4963902",
      "warningSpoilers": true,
      "date": "28 June 2019",
      "rate": "10",
      "helpful": "73 out of 83 found this helpful.",
      "title": "Nothing less than the finest movie ever made",
      "content": "In many ways, the work of a critic is easy. We risk very little, yet enjoy a position over those who offer up their work and their selves to our judgment. We thrive on negative criticism, which is fun to write and to read. But the bitter truth we critics must face is that, in the grand scheme of things, the average piece of junk is probably more meaningful than our criticism designating it so...This movie is perfect. This movie is the reason why I write movie reviews. This movie helped me appreciate effort and art. This movie helped me defeat my prejudices against things I don't really know.It is a perfect kids movie, it is a perfect adult movie. Most Pixar movies actually contain very mature messages and this movie's message, \"anyone can cook\" is why we watch movies. Movies are meant to inspire the audience and this movie does a great job. Show this to a kid, they will watch it over and over again. I know because I used to watch this movie every single day.This is not Remy's movie, this is not Linguini's movie, this is definitely not Gusteau's movie. This is Anton Ego's movie. The character development of Anton Ego is phenomenal. We see an arrogant critic become a humble and honest person, and it is what we should become at the end of the day. Most of us start out as arrogant and we do not appreciate effort and talent. However we must learn to give credit where it is due. We see Ego's journey in becoming this modest person, he changes for the better.The final scene is one I cannot praise enough. Seeing Ego complete his arc This movie is an inspiring masterpiece, something we really need in the movie industry today.Maybe I highly rate this movie because of my memories watching it. The scene where he tastes the ratatouille is exactly how I felt re-watching this movie. When I rewatched this movie I experienced something new, an appreciation of kids movies and their messages. This movie changed my whole perception on animated movies. Today, most movies are cash grabs produced with the sole purpose of making profit from tickets and action figures. We need more movies like Ratatouille in this world. In this critic's opinion, this movie is nothing less than the finest movie in history."
    },
    {
      "username": "Tripper27",
      "userUrl": "https://www.imdb.com/user/ur15391782",
      "reviewLink": "https://www.imdb.com/review/rw1675682",
      "warningSpoilers": false,
      "date": "17 June 2007",
      "rate": "10",
      "helpful": "319 out of 398 found this helpful.",
      "title": "A fantastic story that adds to Pixar's stellar reputation",
      "content": "I checked out a sneak preview of Ratatouille last night, and I must say I truly loved this movie. Everything from the animation to the score to the voice acting to the story (and especially the story) was EXCELLENT.I don't know if it appeals to kids as much as other Pixar offerings, but this one upholds their legacy of excellence.Casting Patton Oswalt as Remy was PERFECT. The rest of the voice cast was outstanding as well...including Pixar \"house voice\" John Ratzenberger. See if you can tell which guy he is without foreknowledge (as in, don't read the cast list).Michael Giacchino's score was as perfect for this story as the award-winning one he created for \"The Incredibles\" and the incredible music he has created for most of J.J. Abrams' recent projects, including \"Alias\" and \"Lost\". Even with my 3-year-old son making it really hard to concentrate, and our \"we got to the theater late and had to sit up front\" seats, this movie was fantastic. Everyone should go see it, even if they don't have kids.Brad Bird - you done right by us movie fans again...Ratatouille is great!"
    },
    {
      "username": "DjfunkmasterG",
      "userUrl": "https://www.imdb.com/user/ur2214383",
      "reviewLink": "https://www.imdb.com/review/rw1683526",
      "warningSpoilers": false,
      "date": "29 June 2007",
      "rate": "10",
      "helpful": "17 out of 24 found this helpful.",
      "title": "Masterpiece doesn't describe Ratatouille, there has to be a better word.",
      "content": "Ratatouille, the new Disney/Pixar CGI animation film currently sweeping the cinema circuit around the globe. Pixar known for so many CGI animation classics manages to keep churning out winner after winner, and here with Ratatouille they manage to hit a home run, scratch that... a grand slam.The story is not only funny, but also touching in that it reminds to never forget about the people who helped you get where you are and that family whether related or not is important.The main premise is about a rat named Remy whom has the gift to cook. A connoisseur of fine food, Remy manges to help a bumbling garbage boy with no self confidence become the talk of Paris by using him as his personal mechanism to prepare Paris' finest cuisine. However Remy has a dilemma, now that he has risen to stardom, he also has his family who tries to bring him back to the colony because of their distrust for humans, and once Remy's human robot begins to let the fame and fortune go to his head, it becomes a matter of personal resentment he himself must overcome given he is the main cause of the problem, and also the source of the solution.Out to get Remy is the current head chef of the famous Gusteau's, Gusteau's once Paris' famed 5 star restaurant, has now become a 3 star tourist attraction because a snobbish food critic feels the food served is not even good enough for peasants. Once word of the fine food hits the papers the critic himself has to find out how Gusteau's made this triumphant comeback.Ratatouille has tons of laughs, excitement and mayhem. The jokes are truly and mainly adult oriented with a sprinkle of moral lesson mixed in for the kiddies. Although G-rated Ratatouille does go onto to be a bit racy at times, but really it is having fun poking fun at the French Culture without insulting the legacy.Director brad Bird, best known for his hit The Incredibles manages to bring the element of family and trust front and center while engaging the audience in one of the most entertaining animated films since The Lion King. Ratatouille shines as Pixars greatest achievement from beginning to end, and is worth double the admission price for the story alone.I challenge anyone to say this isn't Pixars finest film yet.9 out of 10."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1783320",
      "warningSpoilers": false,
      "date": "19 December 2007",
      "rate": "8",
      "helpful": "15 out of 27 found this helpful.",
      "title": "Anyone Can Cook",
      "content": "In the country of France, the rat Remy has accurate taste and smell, and he worships the chef Auguste Gusteau. People uses to say that the best food in the world is in Paris, more precisely in Gusteau's, and Remy dreams on becoming a chef. On the same day that his idol dies after reading a bad review of the arrogant critic Anton Ego, Remy gets lost from the clan of his father in the sewers and ends in Paris in front of the famous restaurant. Remy does not resist and goes to the kitchen, improving the soap that is being prepared with ingredients and spices. The clumsy garbage boy Linguini receives the credits for the successful recipe; he is promoted to cook and starts a partnership with the little chef. But the greedy chef Skinner is not happy with the success of Linguini that is jeopardizing his future project for Gusteau's.\"Ratatouille\" is a delightful animation, with a very funny and original story. It is inconceivable to imagine a rat in the fanciest restaurant of Paris; imagine a rat as a prominent chef, having a clan of rats in the kitchen helping him to prepare sophisticated meals for the upper-class of Paris and a harsh critic of restaurants. Only this sequence would be enough to make laugh. But the story has nice characters and good messages about the importance of making a dream come true and creativity in your work, friendship and loyalty. The story has many plot points and the resolution is great. In the end, I loved this animation. My vote is eight.Title (Brazil): \"Ratatouille\""
    },
    {
      "username": "BigWhiskers",
      "userUrl": "https://www.imdb.com/user/ur12278662",
      "reviewLink": "https://www.imdb.com/review/rw1802041",
      "warningSpoilers": true,
      "date": "17 January 2008",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Charming movie and Remy is adorable.",
      "content": "My only regret is that I let this movie slip by without seeing it on the big screen. It's not even playing in those cheap theaters that charge a buck after the movie has been out for a while. I picked up the DVD and watched it 3 times. Remy is adorable and I fell in love with him ,his facial expressions and body language are so sweet, you care what happens to him,there is one scene where he is trapped in a jar and Linguini is going to drop him in the water,you can see the fear in his eyes and how vulnerable he is,it pulls at your heart and you want to just rescue him and take him into your arms. Once the kitchen show gets going though it really rocks.. Linguini is hilarious and Colette a wonderful tough lady chef who falls in love with Linguini. Hijinks in the kitchen as both Remy and Linguini pull off the most hilarious illusion of cooking with Remy pulling his hair to make him do things and Linguini's incredible Jim Caerryesque slapstick bodygags. The supporting cast is equally marvelous with various big stars doing voiceovers like Brian Dennehy ,Peter O'Toole and others adding to it's charm. I'm usually OK with most animated Disney movies that have come out lately but this one really moved me and I'm a 42 y/o man. It was very adult in nature since it appealed more to the older crowd then just kids. I do hope they do a sequel as I would most like to see what happens to Remy next. Bravo Brad Bird and the cast and crew . 10 out of 10"
    },
    {
      "username": "snorlax3111984",
      "userUrl": "https://www.imdb.com/user/ur9483059",
      "reviewLink": "https://www.imdb.com/review/rw1699681",
      "warningSpoilers": false,
      "date": "24 July 2007",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "You Dirty Ratatouille",
      "content": "Today I had the privilege of seeing Pixar's 8 feature-length release, and the current front-runner to receive the 2007 Best Animated Oscar.That film is Ratatouille. It revolves around Remy an adorable little rodent who desires to be a great chef, and Linguine, a bumbling but well-intentioned nerd who helps Remy become a great chief. The movie begins in a French country-side house where Remy and his disapproving rat brethren (\"shutup and eat your garbage\" says Remy's father when Remy complains about wanting high-quality food) are driven away by a miserable elderly French hag. Through his escape from the French hag, Remy lands in a Parisian restaurant created by a famous French chef named Gusteau. Gusteau took his own live after a bad review from a famous food critic named Anton Ego, but Gusteau still appears in Remy's imagination to offer various pieces of advice, such as \"anybody can cook\" and \"stealing is wrong\". Through Gusteau's inspiration and Linguini's bumbling nature, Remy and Linguini become cooks in a partnership that may bring Gusteau's restaurant back to it's former glory. Complicating matters are a feisty female cook, an asshole of a head chef, the reunion between Remy and his disapproving family, and snarling food critic Anton Ego.Do not be afraid of Ratatouille's 110-minute running time, this movie has a far-quicker pace that some 90-minute movies. If you are a kid, you'll love the Looney Tune-esqe slapstick. Through accident, Remy can control Linguini like a puppet by pulling on his hair. It's a real thrill to see Linguini make body motions that are completely against his will. If you are older, you will appreciate the message this movie provides: no dream is too important, if you work hard enough and never stop believing you can achieve anything. This not the first time that message has been told in an animated film, but it's a lesson that's worth repeating. That is not the only thing this movie has to tell us. Like Remy, we as humans must decide whether to go our own way or do what our family tells us. We must also decide whether it's better to be respected doing things that make us miserable or to be disrespected doing things that make us feel happy. Not since Amadeus has such an enjoyable movie asked such serious questions.I left this movie feeling really wonderful and enchanted. Enchanted because I saw the good guys get what they deserve, enchanted because I saw the jerks get what they deserve. I felt enchanted because I witnessed the marvelous performance of Peter O'Toole as the crusty but lovable food critic Anton Ego. The way Peter O'Toole used the word \"Perspective\", I couldn't help but get goosebumps, and I mean that as a high compliment.While I still await The Simpsons Movie with great anticipation, now I highly doubt it will win the Best Animated Feature Oscar, because it'll have to be really good to beat Ratatouille's magic.My grade (out of 4 stars): 4"
    }
  ],
  "errorMessage": ""
}