{
  "imDbId": "tt0025316",
  "title": "It Happened One Night",
  "fullTitle": "It Happened One Night (1934)",
  "type": "Movie",
  "year": "1934",
  "items": [
    {
      "publisher": "The A.V. Club",
      "author": "Mike D'Angelo",
      "link": "https://www.avclub.com/every-romcom-of-the-last-80-years-owes-something-to-it-1798181983",
      "rate": "100",
      "content": "It’s every goddamn romantic comedy you’ve ever seen. They can all be traced back here, virtually without exception, for eight straight decades now. Technically, the film has never been remade, but that’s largely because, in spirit, it has never stopped being remade. Something so perfectly structured can support nearly endless variations. It’s timeless."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2010/oct/28/it-happened-one-night-film-review",
      "rate": "100",
      "content": "As buoyant and elegant as bubbles in a glass of champagne, Frank Capra's sublime 1934 comedy, written by long-time collaborator Robert Riskin, survives triumphantly because of its wit, charm, romantic idealism and its shrewd sketch of married life."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/happened-one-night-review/",
      "rate": "100",
      "content": "A must see."
    },
    {
      "publisher": "The Dissolve",
      "author": "Scott Tobias",
      "link": "",
      "rate": "100",
      "content": "For a low-budget production of the early sound era — 1934, seven years after \"The Jazz Singer\" — It Happened One Night has a wide-open quality that’s miraculous under the circumstances. This comes through in Capra’s technique, like a long tracking shot that follows Ellie’s humiliating trek to a public shower, but it really shows in the film’s ambition to be about more than this one love story."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1934/film/reviews/it-happened-one-night-2-1200410931/",
      "rate": "90",
      "content": "One of those stories that without a particularly strong plot manages to come through in a big way, due to the acting, dialog, situations and direction. In other words, the story has that intangible quality of charm which arises from a smooth blending of the various ingredients. Difficult to analyze, impossible to designedly reproduce. Just a happy accident."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Chris Cabin",
      "link": "",
      "rate": "88",
      "content": "Even now, It Happened One Night carries the unmistakable tenor of a breakout hit, fueled by confidently zippy repartee and manic comic invention that almost none of the innumerable pretenders to the throne of romantic comedy can match."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/it-happened-one-night",
      "rate": "88",
      "content": "Nothing can take away from the strength of Gable and Colbert's performances, the illusion of romance in their interaction, and Capra's deftness in crafting this kind of feel-good narrative. The screwball comedy elements work as effectively as the love story, which is a rarity for romantic comedies."
    },
    {
      "publisher": "",
      "author": "The New York Times",
      "link": "https://www.nytimes.com/reviews/movies?res=940CE2DA1539E33ABC4B51DFB466838F629EDE",
      "rate": "80",
      "content": "It Happened One Night is a good piece of fiction, which, with all its feverish stunts, is blessed with bright dialogue and a good quota of relatively restrained scenes."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/8094021/It-Happened-One-Night-review.html",
      "rate": "80",
      "content": "It Happened One Night is pure delight."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/movies/happened-night-refreshing-light-romance-article-1.2091885",
      "rate": "63",
      "content": "The direction is excellent. Frank Capra never lets his picture lag for a moment. It is never very exciting, but it moves along snappily and it is full of amusing situations."
    }
  ],
  "errorMessage": ""
}