{
  "imDbId": "tt0025316",
  "title": "It Happened One Night",
  "fullTitle": "It Happened One Night (1934)",
  "type": "Movie",
  "year": "1934",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1246535",
      "warningSpoilers": false,
      "date": "24 December 2005",
      "rate": "10",
      "helpful": "131 out of 140 found this helpful.",
      "title": "The Hero As Comedian",
      "content": "In his autobiography, The Name's Above the Title, Frank Capra said that until It Happened One Night drama had four stock characters, the hero, the heroine, the comedian, and the villain.What Capra did and you might notice he followed that in a whole lot of his films, the characters of hero and comedian are combined. Not completely though because Claudette Colbert gets a few laughs herself, especially with that system all her own. But in doing what he did for Clark Gable's character, Capra created a whole new type of screen comedy, the classic screwball comedy and It Happened One Night surely set the mold.Capra's autobiography told the story of the making of It Happened One Night which in itself could be a movie. Capra worked for Columbia Pictures which at that time was a minor studio, along the lines of Republic or Monogram. As Capra tells it he had a vision about this story that Samuel Hopkins Adams wrote and persuaded Harry Cohn to buy it. Capra also had a stroke of good luck. Adolph Zukor at Paramount and Louis B. Mayer at MGM were looking to punish a couple of recalcitrant stars, Claudette Colbert and Clark Gable. The idea was to show these two what it was like to work in a small budget studio without all the perks of Paramount and MGM. In fact the description of Gable arriving to work at Columbia that first day, drunk as a skunk, is priceless. Capra dressed him down good and said that to his credit Gable came to work afterwards and couldn't have been more cooperative.At some point Harry Cohn at Columbia was convinced that maybe Capra had something. He had in fact delivered for Columbia the previous year with Lady for a Day. So the publicity drums were beat.The rest as they say is history. It Happened One Night won the first Oscar grand slam, Best Picture, Best Director, Best Actor, and Best Actress. It won the first Oscars Columbia Pictures ever got and lifted it right into the ranks of the major studios. And it set the standard for screwball comedy.The film could never have gotten off the ground were it not for the chemistry of Gable and Colbert. They're together for most of the film so if it doesn't click between the two of them, you have people walking out in droves. Colbert had already played a wide variety of parts at Paramount, ranging from Poppaea and Cleopatra to comedies with Maurice Chevalier like The Big Pond. Gable had played a whole lot of tough guys on both sides of the law at MGM. It Happened One Night showed he had some real comic talent, a flair MGM exploited in his roles from then on in. Gable and Colbert did only one other film together, Boom Town for MGM. You can't get much more different than those two films. Boom Town had a huge MGM budget, Spencer Tracy and Hedy Lamarr as well, and a lot of special effects involving the oil industry and hazards therein. It's also a great film, but it's not a classic like It Happened One Night."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0012271",
      "warningSpoilers": false,
      "date": "13 September 2001",
      "rate": "",
      "helpful": "68 out of 77 found this helpful.",
      "title": "A Pleasant, Funny Classic",
      "content": "This is a pleasant, funny classic that shows it age only slightly, and that has a lot of scenes you can look forward to each time that you see it. Gable and Colbert each get roles that are nicely suited to them, and are well-remembered for their performances. The supporting cast also rounds out the picture with some good character acting.The cross-country trip on the bus and via other assorted methods is fun to watch, with several nice vignettes that complement the main story line. (The atmosphere on the long bus trip is done especially well.) The plot is of course not meant to be taken too seriously in itself, but it comes in very handy for setting up good characters and comedy.It all comes across as effortlessly entertaining romantic comedy, with some classic scenes and characters you learn to care for in spite of their mistakes."
    },
    {
      "username": "aimless-46",
      "userUrl": "https://www.imdb.com/user/ur2904081",
      "reviewLink": "https://www.imdb.com/review/rw1211770",
      "warningSpoilers": false,
      "date": "8 November 2005",
      "rate": "9",
      "helpful": "27 out of 29 found this helpful.",
      "title": "Clean Sweep",
      "content": "Consider this, \"It Happened One Night\" was made in 1933 which gives it the distinction 70+ years later of being the oldest film still widely viewed by mainstream audiences. And most of the runner-ups for oldest film are 1930's screwball comedies inspired by the success of this seminal film which made a clean sweep of the 1934 Academy Awards. The genre has held up over the years because these are small human stories with themes that are still relevant. The main reason \"It Happened One Night\" worked then and still works today is the accidental pairing of Colbert and Gable, who provide an amazing chemistry under Frank Capra's direction. Columbia Pictures was a small player in the early days of talking pictures and studio head Harry Cohn had difficulty rounding up two major stars to play the leads in this modest budget production. Colbert was not interested in doing another Capra film after a negative experience working for him six years earlier in her silent picture debut. Cohn told Capra: \"That French broad likes money\" and Capra finally got her on board with an offer of $50,000 (double her usual price) and a guarantee that production would only last 28 days. Gable was under contract to MGM but had been making trouble for them so as punishment Louis B. Mayer personally loaned him to Columbia for this film.The film had a lot else going for it; a motivated Capra, a great script that would play well with small town America, and a good ensemble of supporting talent. The story concerns a spoiled young heiress (Colbert) trying to escape the control of her father (nicely played by Walter Connelly). Dodging her father's private detective she takes a Miami to New York bus where she meets a recently fired reporter (Gable) who agrees to help her in exchange for an exclusive story. Cozy quarters and many adventures lead them to change their initial opinions of each other (brainless brat and obnoxious bully) as an undisclosed affection develops. On the eve of their arrival in New York they try to sort out their feelings for each other.While the script is not really successful in convincingly illustrating the process of their falling in love (one minute they are just friends and the next they are in love), Capra is able to sell it with a simple connection process between these two characters which is at work throughout the film. As another reviewer has written: \"Far from lovey-dovey, the dialogue is witty, sharp and occasionally heartless. We may know the outcome, but the road to get there is paved with arguments, anger and misunderstandings. It's also clever, funny and a bit risqué (for 1934)\" . During their three days and nights together Colbert convincingly gives us a character who matures from a spoiled rich girl to a responsible adult, motivated by a desire to improve her companion's opinion of her. Gable shows real star presence, playing a confident, charming, and resourceful gentleman. By the end their sudden love is credible because they have demonstrated that they are both exactly what the other is looking for in a partner.After the Oscar ceremony Capra threw a party where he downed a magnum of champagne and passed out on his front lawn clutching his Best Director Oscar.Then again, what do I know? I'm only a child."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6134450",
      "warningSpoilers": false,
      "date": "29 September 2020",
      "rate": "8",
      "helpful": "15 out of 16 found this helpful.",
      "title": "'The Limb is Mightier than the Thumb'...",
      "content": "Many things don't mix or go together, quite often they repel but when things do gel, when they seamlessly merge and mingle like two dancers combined as one, the end result can often be quite memorable, magical and spectacular. As here, with Claudette Colbert and Clark Gable, where the story is pretty immaterial but the interactions between the pair makes this, to this day, as engaging, charming and funny a conjuring as any you might previously have come across and, quite probably, any you might venture to find in the future."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0012314",
      "warningSpoilers": false,
      "date": "11 December 2003",
      "rate": "8",
      "helpful": "35 out of 39 found this helpful.",
      "title": "A cute romantic comedy that was a pioneer of its genre",
      "content": "It Happened One Night is one of those films that is so classic, and on so many `must-see' lists that I actually assumed that I had seen it at one time or another. It wasn't until I actually looked into the film when I in fact realized I hadn't.The first film to sweep the major categories in an Oscar ceremony, It Happened One Night spins the story of a young spoiled heiress (Colbert) who marries a shallow, yet dashing aviator. She is then swept off by her father who takes her on a cruise; convinced that time away from each other will cure her infatuation. Instead, she escapes by jumping out of the boat and swimming to shore where she begins her journey from Miami to New York, where her husband awaits. The film quickly turns into an `on the road' flick at this point when she meets up with Clark Gable, a down on his luck reporter who offers to help her for the exclusive rights to her story. Mayhem inevitably ensues as one thing after another goes wrong during their adventure.I'm a little hesitant to completely agree with the general assessment that It Happened One Night is a screwball comedy. Of course, there were certain moments that were hilarious and overdone (the scene when Gable and Colbert pose as husband and wife to share a cabin for the night is absolutely rich) but the majority of the remaining film is clever romantic comedy with fairly even performances by the principles. Perhaps there is a sliding scale for screwball comedies, with It Happened One Night being a two and a film that I feel personifies the genre, Bringing up Baby, as a five. Whatever its classification, It Happened One Night is a charming film that backs up its merit as a multiple Oscar winner. It is one of those films that may not be completely profound or deep, but is important nonetheless if anything, for its place in film history.--Shelly"
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2232304",
      "warningSpoilers": false,
      "date": "6 April 2010",
      "rate": "10",
      "helpful": "28 out of 36 found this helpful.",
      "title": "Love Triumphs (and the Wall of Jericho Falls)",
      "content": "In Miami, the spoiled socialite Ellie Andrews (Claudette Colbert) is trapped in the yacht of her controller father, the Wall Street banker Andrews (Walter Connolly), who has just annulled her secret marriage with the snobbish aviator King Westley (Jameson Thomas). Out of the blue, Ellie jumps overboard and swims to the shore. Andrews hires a detective agency to find her and offers a 10,000 dollars reward for any information about his daughter. But Ellie pawns her watch, buys some clothing and a bus ticket to New York to meet her lover. She seats side- by-side with the cynical reporter Peter Warne (Clark Gable). However, when a thief steals her purse with her money in a bus stop and Ellie does not report to the police, Peter recognizes and blackmails Ellie, asking her to travel together with him. He promises to protect her and in return he would write her adventure to meet King Westley. Along their journey, Ellie falls in love for Peter; but when he vanishes from the motel where they are lodged and contacts her father later, she believes he was only interested in the reward. In the end, love triumphs and the wall of Jericho falls. \"It Happened One Night\" is another delightful and charming romantic comedy of Frank Capra. The romance of a cynical reporter with a spoiled young woman is very funny despite being naive and dated, with witty dialogs, and the chemistry between Claudette Colbert and Clark Gable is marvelous. The cinematography in black and white is wonderful with magnificent use of lighting to highlight the lead couple. Last time I saw this classic was on 29 January 2003 and this is the third time that I watch this film, now on DVD from Columbia Distributor, and I highly recommend it as one of the best romantic comedies ever. My vote is ten.Title (Brazil): \"Aconteceu Naquela Noite\" (\"It Happened that Night\")"
    },
    {
      "username": "lugonian",
      "userUrl": "https://www.imdb.com/user/ur0853359",
      "reviewLink": "https://www.imdb.com/review/rw0012309",
      "warningSpoilers": false,
      "date": "22 August 2003",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "The Runaway Heiress",
      "content": "IT HAPPENED ONE NIGHT (Columbia, 1934), directed by Frank Capra, based on a short story \"Night Bus\" by Samuel Hopkins Adams, ranks one of the best known and popular romantic comedies from the 1930s, thanks to the star chemistry of Clark Gable (on loan from Metro-Goldwyn-Mayer) and Claudette Colbert (on loan from Paramount), with fine direction by Frank Capra, witty screenplay by Robert Risken, and for being the very first motion picture to win all five major Academy Awards, including Best Actor (Gable); Best Actress (Colbert); Best Director (Capra); Best Screenplay and Best Picture. This might have been an \"upset\" in 1934, considering other top-rated films and performances of the year, but who would have imagined IT HAPPENED ONE NIGHT to still be as entertaining today as it was back in 1934?This now well-known plot that's been remade twice by Columbia as EVE KNEW HER APPLES (1945) with Ann Miller and William Wright; and YOU CAN'T RUN AWAY FROM IT (1956) with June Allyson and Jack Lemmon, opens in a yacht in Miami where Ellen \"Ellie\" Andrews (Claudette Colbert), spoiled daughter of a millionaire Wall Street banker, Alexander Andrews (Walter Connolly), who disapproves of her recent marriage to aviator King Westley (Jameson Thomas), making arrangements on having it annulled. Following a heated argument with her father, Ellie runs from her state room, jumps overboard and swims to shore. Eluding her father's hired detectives, Ellie, acquiring new clothes, purchases a night bus ticket bound for New York City where she plans to meet Westley. While on board, Ellen encounters Peter Warne (Clark Gable), a hot-headed reporter recently fired by his editor, Joe Gordon (Charles C. Wilson). With both disliking each other immensely, Warne, having discovered the \"spoiled brat's\" identity, becomes her constant traveling companion in order to get an exclusive story and his job back. Hours before reaching New York and taking a rest stop in an auto camp, misunderstandings occur as Ellen awakens to find both Peter and the car gone.A simple story playing like an overlong \"B\" movie, IT HAPPENED ONE NIGHT is a memorable bus trip of so many classic scenes that have been imitated by others but never duplicated. Highlights include the \"Walls of Jericho\" where Peter and Ellen share a room in auto camps where a blanket is tossed over a rope that separates the couple as they sleep for the night; Peter demonstrating to Ellen on how a man undresses, particularly one in which he removes his shirt to no undershirt underneath; Peter's correct method of dunking a dough-nut into a cup of coffee; and the classic hitchhiking scene where Peter fails to attract cars while Ellen comes up with a method all her own.Although IT HAPPENED ONE NIGHT is essentially a Claudette Colbert movie from start to finish (there's no secondary female character, quite rare for its time). Due to the strength of Gable's performance, this has been hailed to be his best comedic role. Gable's character is hot-headed and forceful, living by a moral code. Although he shares a cabin with a married woman, that's all he does. He even tells Colbert's Ellie when she asks if she'll ever see him again, he replies, \"I make it a policy not to run around with married women.\" And when he's hungry, he takes a carrot from a farm rather than going through the method of panhandling. This is Gable, a role model. Director Frank Capra, whose subject matter is usually on people, captures the many extras, especially those on the bus and auto camps, to make them appear as important as leading players. Roscoe Karns is equally memorable, \"believe you me!\" as the gabby bus passenger, Oscar Shapeley from Orange, New Jersey; Ward Bond as the tough talking bus driver; the meek Arthur Hoyt and the nosy/ domineering Blanche Frederici as the auto camp owners; Georgie Breakston the poor boy traveling on the bus with his mother (Claire McDowell); along with other passengers gathered together and singing \"The Man on the Flying Trapeze,\" to a player of a snoring fat and bald man who rests his head on Colbert's shoulder. During it's entire 106 minutes, there's seldom any underscoring. As for the costumes, with the exception of the final 15 minutes, both Gable and Colbert use the same clothing through most of their trip.While Gable and Colbert had challenging roles in their careers, plus their reunion in MGM's large-scale BOOM TOWN (1940), it's amazing how this likable little comedy was the only one to honor them Academy Awards. There's a scene where I feel Gable earned his statuette, the one where he tells Ellen the type of girl he would like to someday marry, saying that those kind of women don't exist anymore. Gable says this with frankness and sincerity. Colbert on the other hand earned hers from that same scene as she she listens and looks on lovingly at Gable with tears flowing down her cheek, coming to realize it happened one night.IT HAPPENED ONE NIGHT not only became a perennial favorite on late night television during the 1960s and 70s, but on cable TV as well, ranging from the Disney Channel (1980s), American Movie Classics (prior to 2001) to Turner Classic Movies, and availability on video cassette and finally DVD. While IT HAPPENED ONE NIGHT has aged in appearance, it's still timely screen entertainment. There'll never be another film like this again. (***1/2)"
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0012322",
      "warningSpoilers": false,
      "date": "12 August 2004",
      "rate": "10",
      "helpful": "63 out of 88 found this helpful.",
      "title": "One of the funniest movies in history",
      "content": "In my college film class we had begun watching \"It happened one night\". I was laughing my head off. But of course my professor stops the movie right when it was getting good. After that, I wanted to see this movie so badly. My father lucky enough had the movie. I watched it and it is one of the funniest movies I have ever seen. Clark Gable is histerical. He really does a great job in the film. I always did prefer the old comedies to today. Do you blame me? If you watch the flick, you will enjoy it. This is one of the first romantic comedies. It'll send all the others to the back of the bus. I would higly recommend this movie. It's a classic.10/10"
    },
    {
      "username": "comix-man",
      "userUrl": "https://www.imdb.com/user/ur0767434",
      "reviewLink": "https://www.imdb.com/review/rw0012290",
      "warningSpoilers": false,
      "date": "23 June 2002",
      "rate": "9",
      "helpful": "119 out of 129 found this helpful.",
      "title": "Introducing... the Screwball Comedy",
      "content": "Frank Capra's idealistic outlook on life is evident in his films. From It Happened One Night to It's a Wonderful Life, Capra has always had a tendency to let the little guy rise above it all and beat the odds. It is no small wonder that Capra enjoyed much of his success during the Depression, when movies were used to truly pull an audience out of the despair of the 1930s into a world where anything can happen, where being a nice person is all you need to succeed. While the fact that the country was in the middle of the Depression was not completely ignored, an overly optimistic view on life was taken to counter the despair of everyday life.There were many points in It Happened One Night where the true state of the country was indicated. Homeless people hitching rides on trains seemed perfectly normal. Rather than regard them with apprehension and pity, you smile and wave at them. Another example is the hostile reaction proprietor Zeke's wife had to the fact that her husband had let Peter and Ellie stay the night with promises of being paid. Upon seeing Peter and Ellie's car missing, they rush to the cottage to see if Peter and Ellie are still there. They cannot afford freeloaders.In another scene, a child's mother has passed out from hunger, because they have no money to buy food. Peter and Ellie have nearly depleted their funds, but decide that the mother and child need money more than they do and give some to them.Despite these instances, the movie was altogether cheerful in its depiction of the world. In the throes of the stock market crash, this movie signaled the birth of the screwball comedy. At a time when the country needed release, they could find that release and laughter in movies like It Happened One Night. Audiences were amused by scenes in the film, such as the segment in which Peter teaches Ellie how to dunk a donut. Or, when forced to share a room, Peter puts a blanket between his and Ellie's beds and calls it the `wall of Jericho,' which is revisited when the walls of Jericho come tumbling down after Peter and Ellie's marriage. Probably the most famous scene in the film is the hitchhiking sequence, which features Peter standing by the roadside trying to thumb a ride unsuccessfully, finally giving up after more than a dozen cars speed by without paying any heed to his attempts. After he gives up, beaten, Ellie simply lifts her skirt above her knee. The first car that passes stops, as we see extreme close-ups of a foot slamming down on the brakes and a hand applying the hand brake.A master in his profession, Capra left his mark on the films he directed. With an almost childlike cheerfulness, he maintains a sense of dignity and class. The viewer is left with a feeling of hope for humankind, even if its only that a person's ideals could be used to make such a film. Capra's films are still regarded as masterpieces. It Happened One Night arguably remains to this day unparalleled in screwball comedies. It was one of many movies made during the Depression, a sometimes sad and even lonely time in our history. It gave its audience a chance to escape and forget their troubles for a few moments in time.9 out of 10 stars"
    },
    {
      "username": "Chrysanthepop",
      "userUrl": "https://www.imdb.com/user/ur3872142",
      "reviewLink": "https://www.imdb.com/review/rw1989909",
      "warningSpoilers": false,
      "date": "14 December 2008",
      "rate": "",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Classic Comedy Starting One Night",
      "content": "Capra's 'It Happened One Night' is a fascinatingly shot romantic comedy. It has the 30's feel but at the same time I am surprised that such skill was used in the making of this movie during the 1930s. The camera-work is brilliant as it brings out both the spatial feel and the crowdiness. the long shots are effective and I liked how the scenes change in a sideways 'flip' mode. There's always something about the driving scenes of old classics that amuse me. Clearly the background was shot separately and then projected on to a screen during the shooting of the film while in the foreground the actors are just seated in a car pretending to drive. While the background scene changes, the viewer keeps tuned to the wonderful dialogue between the actors. Needless to add, the film's got fantastic dialogue.Capra also brilliantly gives us a glimpse of the 30's American society, especially focusing on gender and class status. The difference between the upper class rich people and the common ordinary man is shown by their use of language and their non-verbal behaviour. Yet, in a way the film is also ahead of its time. Ellie isn't just some clichéd damsel of the 30s. She is strong-minded, stubborn and smart (albeit slightly naive). She is one who fights for what she wants rather than giving in easily. Perhaps this is also one quality of hers that attracts Peter but at the same time their funny quarrels also indicate that there is a an equality in gender status (which was something women were struggling with in those days).The characters are very well etched. Peter and Ellie were a lot of fun but I also liked how Alexander Andrews (played excellently by Walter Connolly) was written as the rich father who's got all the money but all he wants for his daughter is her happiness. Clark Gable and Claudette Colbert are great together as they match wits and display warm chemistry.'It Happened One Night' has become an instant favourite, one that I definitely plan to revisit."
    },
    {
      "username": "ackstasis",
      "userUrl": "https://www.imdb.com/user/ur10334028",
      "reviewLink": "https://www.imdb.com/review/rw1741649",
      "warningSpoilers": true,
      "date": "6 October 2007",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "\"I want to see what love looks like when it's triumphant. I haven't had a good laugh in a week.\"",
      "content": "Released in 1934, Frank Capra's 'It Happened One Night' ushered in a new era of Hollywood film-making  the screwball comedy  and made Academy Award history in the process. It became the first film to be awarded the top five awards on the night (Best Picture, Director, Actor, Actress and Screenplay), a feat that remained unequaled until 'One Flew Over the Cuckoo's Nest (1975)' and 'The Silence of the Lambs (1991).' As I watch more of his films, Frank Capra is fast becoming one of my most respected directors, with such classics as 'Mr. Smith Goes to Washington' and 'It's a Wonderful Life' ranking among my favourites of all time. This screwball comedy, however, posed a certain problem, since I've never been a huge fan of the sub-genre. Whilst I had enjoyed such films as 'My Man Godfrey' and 'His Girl Friday,' they hadn't really offered anything other than comedy. This means that they did a good job of making us laugh, but never really inspired any other emotions  which isn't necessarily a handicap, but doesn't appeal to my tastes.Happily, I'm able to announce that 'It Happened One Night' did surpass my expectations, and I found it to be a wonderfully-enjoyable, very touching romantic comedy. The first half had left me feeling a bit uncertain, since it reminded me of just about every other 1930s comedy I'd seen, but then Frank Capra did what Frank Capra does best: he put a lot of heart into the film. After building towards a perfect fairytale ending, Capra suddenly snatches it away, slowly but surely stacking the odds against our hero. However, the director has never been one to leave us with a downbeat ending, and, when love finally prevails, it feels twice as triumphant. Of course, crucial to the film's success are the two lead performers: Claudette Colbert and Clarke Gable, playing characters of completely polar characters. As story runs its course, we slowly watch their relationship transform from completely dislike to acceptance to romance, and it never feels forced or artificial (despite a reportedly tense atmosphere onset).The plot of the film was based on the story, \"The Night Bus,\" by Samuel Hopkins Adams. Ellie Andrews (Colbert) is the arrogant, spoilt heiress of a wealthy father (Walter Connolly). After she marries the rich but unprincipled King Westley (Jameson Thomas) against her father's will, Ellie strikes off to New York to be with the man she loves, and her desperate father launches a state-wide attempt to retrieve her. It is on a night bus that Ellie strikes up a frictional relationship with fired journalist Peter Warne (Gable), whose only initial interest in the stranded girl is a good newspaper story. Probably one of the best \"road movies\" ever made, 'It Happened One Night' also has a few twists in the usual formula which have guaranteed its enduring stature. For example, Ellie's father is revealed not to be an evil overbearing demon, but is, in fact, shown to be a very kind, reasonable and loving man, who is only trying to guarantee the best for his daughter by ensuring that she marries somebody with principles (King Westley later gives up the girl without a fuss, compensated by a tidy sum of money).Much to my surprise, I'd never seen a film starring Clarke Gable before, but he really was a revelation. Never taking any situation too seriously, and delivering every line with confidence and a hint of amusement, Gable is the laid-back every-man that the audience can relate to, a stark contrast to Colbert's conceited and ungrateful upper-class rich girl. My favourite scene took place after the night bus accidentally ran off the road, with the shifty passenger Oscar Shapeley (Roscoe Karns) threatening to reveal Ellie's true identity. Fearing that his exclusive story could leak into other hands, Peter Warne declares himself to be the gangster who kidnapped Ellie, threatens to harm Shapeley's family and then chases him into the night. Interestingly, I followed up my viewing of this film with a 1939 Lux Radio Theater broadcast of the story, introduced by Cecille B. DeMille and once again starring Gable and Colbert. This recording can be found, if you're lucky, as a special feature on the 'It Happened One Night' DVD, and it's well worth a listen."
    },
    {
      "username": "lovable_lil_devil132",
      "userUrl": "https://www.imdb.com/user/ur3892392",
      "reviewLink": "https://www.imdb.com/review/rw1037522",
      "warningSpoilers": false,
      "date": "11 March 2005",
      "rate": "10",
      "helpful": "69 out of 74 found this helpful.",
      "title": "It happened one night...I fell in love with this film!",
      "content": "IHON rightly earns it's place as one of the greatest romantic comedies in film history. A pioneer of the screwball comedy genre, it holds up very well 71 years after it was made.It's a classic tale of the battle of sexes- something that is still so relevant today. We follow the story of spoiled heiress Ellie Andrews (Claudette Colbert), who jumps ship from her father's yacht (literally!) in Florida after an argument with said father (played by Walter Connolly) over her marrying wealthy playboy King Westley (Jameson Thomas) without her father's consent. Ellie is on a mission- to get to New York to King Westley. But how will she do it? That's how Peter Warne (played by a delightfully handsome Clark Gable) comes into the story. Recently fired from his newspaper job, Peter meets Ellie on the Night Bus to New York, and, realizing who she is (Her story is all over the news, after all!), offers to help her get to NY and Westley if she gives him an exclusive story- to win him back his job. And so the fun begins. Colbert and Gable have great chemistry as the mismatched couple thrown together after a series of unusual circumstances. The trip isn't a smooth one- and we are taken on a wild ride with Peter and Ellie, which gives us great scenes such as the doughnut-dunking lesson, Walls Of Jericho and the now-classic hitchhiking scene. The humour is still fresh and fast-paced over 70 years later. Oops, I almost forgot the classic 'no undershirt scene' where Gable sexily gives Colbert a lesson in how a man undresses, to reveal (shock horror!) no undershirt, but a bare chest! This had a bad effect on the sales of men's undershirts, which dropped dramatically after the film's release (One of the first examples of product placement in film). Great supporting characters, particularly the scene-stealing Oscar Shapeley (Roscoe Karns). Of course it has it's faults- all early talkies do. But any faults are outweighed by the great story. Technically, it was well-made for it's time.IHON won 5 Oscars- Best Picture, Best Director (Frank Capra), Best Actress and Best Actor for Colbert and Gable and Best Adaptation. It deserved all of them. Funnily enough, both Colbert and Gable didn’t want any part in the film at first- I bet they changed their viewpoint after the surprise success and the prestigious Academy Awards they gained for it. It's been said that a number of Disney characters like Bugs Bunny, Yosemite Sam and Pepe LePew were inspired by characters in this film. A classic, a must-see, a great movie."
    },
    {
      "username": "emma502",
      "userUrl": "https://www.imdb.com/user/ur2395410",
      "reviewLink": "https://www.imdb.com/review/rw0012303",
      "warningSpoilers": false,
      "date": "7 May 2003",
      "rate": "",
      "helpful": "123 out of 139 found this helpful.",
      "title": "A fantastic Capra film.",
      "content": "It Happened One Night directed by Frank Capra was made and released in 1934 by Columbia Pictures as a small budget film that was not expected to do well at the box office. Yet, after its release the film gained many accolades and won the Academy Award for best picture in 1934. Due to the original small nature of the film, the leading man role was surprisingly filled by Clark Gable who was on loan from another studio. He stared opposite of Claudette Colbert. Capra's film was a combination of many ideals, emotions and social perceptions of the American society of the thirties but it was also a combination of many new and innovative filming techniques and sound advancements. The film unfolds the story in such a attention-grabbing and remarkable way that most of today's cinema use his style and ideals when producing and creating films. Capra used the idea of a moving camera, one that was not fixed upon a box, but on a moveable crane instead. This produced more sweeping shots, more angles for filming and fewer distance shots. It allowed for more movement of the actors as well as a more realistic and real life feeling to the movie. The film also incorporates back projection of images. This is were a scene is filmed previously and played in the background while the actors perform the scene in front of the projection. Back projection is used for car scenes to give the impression that the actors are driving but in reality they are in a sound stage. Capra also incorporated the use of a wipe in his film. The technique of moving left to right and fading in or out to change a scene or show elapsed time took the place of the traditional place cards in silent films and allowed for a more constant stream for the film. The film was also all talk, the new technology of a sound strip on the side of the film was used. The text cards of silent films were completely discarded. Another camera trick by Capra is to show a change in feelings within Clark Gable's character for Claudette Colbert's character by depicting her character in a different light. This happens two times within the film at key moments to the development of their relationship. Claudette Colbert is seen in a close up of softer light to emphasize Clark Gable's character seeing her in a `different light.' In this romantic comedy Capra not only showed new styles and techniques but also addressed social issues of the time. Through comedy he showed the outlandish nature of the rich (King arriving for his own wedding in a helicopter) and the nature of man being the controller in relationships as well as in society. The fighting and struggles between the two main characters showed the man taking care of the woman, the social norms of how men and woman should act around each other in that era. But the fighting and the banter also show a strong-minded and intelligent woman. The two strong-willed main characters balanced each other out.Capra's techniques for showing the social relationship between the rich and working classes as well as a relationship between man and woman in the 1930s captured film makers and film viewers for over 70 years. Films are now compared to his style of camera movement and his style of capturing the American ideals. When movies of today make a similar statement of achieving what one wants they are referred to as Capra-esc. Capra's imagination and style is one that changed the outlook of American films and introduced a new genre to film goers everywhere."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4029620",
      "warningSpoilers": false,
      "date": "11 January 2018",
      "rate": "8",
      "helpful": "9 out of 11 found this helpful.",
      "title": "A gem of a film - certainly not your average romantic drama",
      "content": "Ellie Andrews is the daughter of a Wall Street mogul. Her father is highly protective of her and isn't pleased when she elopes, marrying a man she hardly knows. Ellie runs away from her father sets off across country to get to her husband in New York. On the bus she meets a recently-fired reporter, Peter Warne. The two don't get along but, figuring out who she is, and knowing that her father will have every route into New York covered with private detectives, he offers to help her get to a husband. In exchange he wants an exclusive on her story. The two tag along together, getting through some interesting adventures. Over time they even get to like each other...A gem of a film from legendary director Frank Capra. I was expecting a rather standard romantic drama but It Happened One Night is so much better than that. Warm, and hilariously funny at times, it's certainly not your average romantic comedy. Dialogue is incredibly fresh and snappy and even the romantic side is not straightforward, keeping the schmaltz to a minimum and taking some unpredictable twists and turns.The great direction by Capra and the solid script are aided by wonderful performances from Clark Gable and Claudette Colbert in the lead roles. The chemistry between them is great and their delivery is spot-on.Both Gable and Colbert received Oscars for their performances, as did Capra for Best Director. The movie was the well-deserved 1935 Best Picture Oscar winner."
    },
    {
      "username": "tcchelsey",
      "userUrl": "https://www.imdb.com/user/ur55912145",
      "reviewLink": "https://www.imdb.com/review/rw6587311",
      "warningSpoilers": false,
      "date": "12 February 2021",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "THE MOVIE THAT TURNED HOLLYWOOD UPSIDE DOWN! NO KIDDING!",
      "content": "Hollywood after all is a town of gosh-darn dumb luck, indeed! I worked there for many years and heard a heck of a lot of stories. This is one of them. Two up and coming actors, and an industrious director willing to roll the dice on a not too shabby Depression era story, all somehow came together, and all turned into the parking lot of a low budget studio called Columbia Pictures. They put their heads together, put the egos in the back pocket, thank you, applied a little elbow grease and with a little luck produced one of the most beloved romantic comedies of all time! How's that for a Hollywood happy ending? IT HAPPENED ONE NIGHT put Gable on the map, whose career was slow to start, if not going in the direction he had hoped, and gave a very small studio an undisputed reputation as a can-do organization now open for business! HOORAY! Don't you just love it? The rest is history, of course, but not without saying what an unforgettable story this is and, perhaps, the very first road trip movie ever conceived. It is also, remarkably, a very simple story of young man meets young woman and the adventures that they share together, going at it as best as they can, and let us not forget during the height of the Great Depression. Truly, audiences at the time needed a good laugh and this gem of a film was their answer, which it remains to this day. Also a tip of the hat to a marvelous supporting cast, foremost Walter Connolly as Colbert's frustrated father whose bark is worse than his bite and has one heck of a time in between! Director Frank Capra outdid himself in this one, but when you have a dream and you believe in what you're doing, it just may surprise you in the end. Not to be forgotten, make that cannot be forgotten, because there is a little bit of all of us in this film if you dig deep enough. Surprise!"
    },
    {
      "username": "Spleen",
      "userUrl": "https://www.imdb.com/user/ur0035229",
      "reviewLink": "https://www.imdb.com/review/rw0012253",
      "warningSpoilers": false,
      "date": "28 November 1999",
      "rate": "10",
      "helpful": "52 out of 79 found this helpful.",
      "title": "Travel back in time, to the days when romantic comedies had not yet evolved into chick flicks",
      "content": "I was inspired to think of other films with completely mystifying titles. `The Phantom Menace', obviously. Also: `The Shop Around the Corner' (around the corner from WHERE?), `The Empire Strikes Back' (it doesn't), `The Living Daylights', `True Lies', `Batman Forever', `Species', `The Life and Death of Colonel Blimp' ... if anyone has any more suggestions, please send them to me.In this case, it happens over several nights, and I'm not sure which particular night is being referred to. Probably one of the candidate nights is less unobvious than the rest; so I guess the title isn't COMPLETELY mystifying. But actually, Capra gives us the feeling that everything is up in the air. Everyone knows that the hero and heroine of romantic comedies are bound to get hitched in the end - in most cases it's simply a question of staying awake. But Capra makes us feel the contingency of it all. I, for one, was convinced that right up until the final moment, it could have gone either way. How did Capra manage this? Was it because he was a complete innocent; or was it because he was remarkably sophisticated? I don't suppose it matters: it's results that count.I'm glad to see very little mention among the comments about the sexism of it all. The characters have life; their words have life; and if such art as this could only be produced by a sexist society, it's almost worth creating a sexist society (and then dismantling it), in order to get the art. In modern romances I get the feeling that the writers are wearily writing `feisty' lines for the heroine in an attempt to fool feminists, who, by and large, aren't so easily fooled. Claudette Colbert isn't feisty. When she DOES assert her independence, she means it.(And, of course, when Clark Gable asserts his dominance, HE means it. You don't get sincerity like this these days.)Anyway, the ideology of a film, if there is one, is always beside the point, except inasmuch as the ideology is AESTHETICALLY attractive or unattractive. This is an attractive film. Two real individuals, a real story, some misunderstanding but no tiresome or pointless misunderstanding, constant wit - and, as I expressed amazement at earlier, constant suspense. And if THAT isn't enough to get you to watch it, note that it was released in 1934. The Hayes code didn't come into effect until 1935. Not a moment too late."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw2201002",
      "warningSpoilers": false,
      "date": "2 February 2010",
      "rate": "8",
      "helpful": "7 out of 9 found this helpful.",
      "title": "A Great Romance, Even If Implausible (Aren't They All?)",
      "content": "A spoiled heiress (Claudette Colbert), running away from her family, is helped by a man (Clark Gable) who is actually a reporter looking for a story.In this film \"a pampered socialite tries to get out from under her father's thumb, and falls in love with a roguish reporter\", which, you know, is something that happens when spoiled daughters discover that they want to live like common people and do what common people do (like go to supermarkets).The film was the first to win all five major Academy Awards (Best Picture, Director, Actor, Actress, and Screenplay), a feat that would not be matched until \"One Flew Over the Cuckoo's Nest\" (1975) and later by \"The Silence of the Lambs\" (1991). And it is not really surprising when you see it... besides, it is Clark Gable and Frank Capra.So, this might not be as outright funny as other films, and even as far as screwball comedies go, it sort of lags behind \"The Awful Truth\" with Cary Grant. But Clark Gable has a debonair charm to him... from the very beginning he has that attitude about him that women mysteriously love. I am a little confused about the laid-back approach to marriage and annulment, but this is a romance, and that is not uncommon... if anything, it shows how fickle the socialite is.Overall, a very enjoyable film. Not my favorite of the era, but well worth a watch or two. And heck, if such a film can inspire the creation of Bugs Bunny and entertain Joseph Stalin... can it be so bad?"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw3785038",
      "warningSpoilers": false,
      "date": "20 August 2017",
      "rate": "",
      "helpful": "3 out of 3 found this helpful.",
      "title": "It's Easy to See Why Gable's Career Took Off and Never Looked Back",
      "content": "It Happened One Night (1934) **** (out of 4) Ellie (Claudette Colbert) is a rich, spoiled brat who runs away from her father (Walter Connolly) after he objects to her runaway marriage. Soon she is out on the road trying to get back to New York when she runs across Peter (Clark Gable), a man who recently quit his job at the newspaper. Peter and Ellie can't stand one another but he agrees to help her reach New York in exchange for an exclusive story.Frank Capra ended up winning Best Director and the picture ending up nabbing all the major awards, which was the first time this had ever been done and it wouldn't happen again until ONE FLEW OVER THE CUCKOO'S NEST did it fifty years later. IT HAPPENED ONE NIGHT is a film that has been copies dozens if not hundreds of times over the years so it's easy to look at it and not see anything original but in 1934 this here was original material and it's easy to see why it was a box office hit and walked away with so many Oscars.It's funny to think that Columbia approached this as a \"B\" movie but it shows what a great director can do with a good story and a wonderful cast. There's no question that Capra's magical touch is all over this film and especially when you see the way it is edited and how it goes for its laughs. There are some hilarious moments scattered throughout the film including the now legendary hitchhiking scene but there's another hilarious and more quiet moment dealing with Gable scaring someone who is trying to work his way in on the reward money.What makes this film so memorable is the fact that you get two superb performances from the two lead legends. Colbert was already a star by the time this came out but she's perfect in the role of the brat who slowly begins to realize that she's been seeing the world in the wrong way. The film also offers up fine support from the likes of Connolly and Roscoe Karns. With that said, it's Gable who steals the picture and it's easy to see why his career never looked back after this. His comic timing is simply flawless throughout and the toughness he brings to this \"charming\" character is something most actors wouldn't have been able to pull off. The chemistry between the two leads certainly make the picture.I do think there are some flaws with the picture including it running five or ten-minutes too long. I think the predictable ending could have happened a little quicker but this is just a minor issue in an otherwise terrific film. IT HAPPENED ONE NIGHT is a landmark in Hollywood history and it deserves its reputation."
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw1902181",
      "warningSpoilers": false,
      "date": "30 June 2008",
      "rate": "7",
      "helpful": "16 out of 25 found this helpful.",
      "title": "An entertaining movie but hardly Capra's best.",
      "content": "Sorry to say but this movie is just a bit too overrated. Especially Capra's directing is disappointing, since it's done in such an extremely old fashioned manner for 1934 standards. Surprisingly enough he still won an Oscar for his directing of this movie though.It's definitely an entertaining enough movie to watch. These type of movies were the romantic comedies of the '30's, the sort of Cameron Diaz and Asthon Kutcher flicks of their time, only done with more class and better actors involved. Nevertheless it's just as clichéd and predictable though. Dozens of these type of movies got made in the '30's and quite frankly I just can't see what it is that makes this movie a better one than any of them.It's a boy meets girl story and of course they can't get along at first but slowly begin to like each other better and more. What makes this movie its story more special is its adventurous elements being thrown in. It's a movie that involves lots of traveling and therefor also many different characters, which mainly gives the movie its adventurous feeling, without ever really getting a big adventure.More fireworks was to be expected, especially from Frank Capra's directing. It's just too formulaic and at times even just plain poor. It's way too old fashioned for 1934 and it's one of those typical movies that features long close-ups for the dramatic moments. It's a very static made film, as if it was just a job that had to be done and no real passion was thrown into it.As could be expected, the acting is still great though, from Clark Gable and the much more unknown Claudette Colbert. They were good together and luckily shared some good chemistry, which made the movie all the more fun to watch. This was actually the movie that earned Clark Gable his only Oscar out of his career. Ironicly enough non of the actors really enjoyed starring in this movie and also lots of well known actor turned the script down and Claudette Colbert, who also received an Oscar for her role in this movie, even didn't took the trouble to attend the award ceremony at first, until hearing upon her win.Yes, I know I'm making the movie sound horrible, which it really isn't. It's basically a movie I enjoyed watching but is no way worthy of this currently high rating on here. There are way better genre movies and Capra movies, with a much lower rating on here though. There are better and more interesting Capra movies to watch out there, which does not mean that this movie is an horrible one though.7/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "jem132",
      "userUrl": "https://www.imdb.com/user/ur5037232",
      "reviewLink": "https://www.imdb.com/review/rw1348919",
      "warningSpoilers": true,
      "date": "22 April 2006",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Wonderful Escapism",
      "content": "'It Happened One Night' must have put on a smile on Depression-weary audiences way back in 1934. Over 70 years later the magic still works, due to the terrific combination of Gable, Colbert and director Capra.But it almost didn't happen at all.Both Gable and Colbert tried desperately to get out of doing IHON. In fact, it appeared no-one in Hollywood wanted the parts of Peter Warne and Ellie Andrews. The tiny cash-strapped Columbia Studios was making this film with an untried comedy formula, it looked a certain flop. Pfft. How wrong everyone was. IHON swept the Academy Awards, taking home all of the Major Awards, including Best Actor and Actress Awards for Gable and Colbert. It established the screwball comedy genre, and the careers of it's two stars and director Capra.Why is it so good? Well, it has remained so fresh over the years that the laughs beat out almost every modern romantic comedy. It doesn't have to rely on smut or toilet humour to satisfy the audience, just a classic battle of the sexes we can all relate to. It's witty, the dialogue is snappy and fast-paced and the acting is near perfect. So let's have a closer look at the plot of this gem: Spoiled heiress Ellie Andrews (Colbert) has just defied her father by marrying society aviator King Westley. Her angry father wishes to keep Ellie away from her unsuitable husband and whisks her away on his private yacht. Daddy hasn't counted on Ellie's tenacity and will- fed up with the fact her childish hunger-strike is going nowhere she literally jumps overboard. When back on dry land she tries to make her way back to her husband by bus trip. A series of unfortunate events bring out of work newspaper reporter Peter Warne into her life. Cue the battle of the sexes! She has no money so she must accept his help; he knows who she is and to land the biggest scoop of his career he must deceive her whilst also helping her get back to Westley. But problems arise when the pair inevitably start to fall in love.This film is just the tonic that Depression audiences would have soaked up. The parodying of the rich is sublime, you can't help rooting for Gable who is a fine representative of the underdog. It also has it's risqué elements that I'm surprised got past the Hayes Code that had just been enforced. In particular, Gable's sexy lesson to a shocked yet interested Colbert on how a man undresses and the final 'breaking down the walls of Jericho' scene. When Gable undressed to reveal a bare chest with NO undershirt, sales dropped off dramatically. This would be one of the earliest examples of product placement in film.Some of my favourite scenes: the donut-dunking lesson, the piggy-back ride, Gable and Colbert's mock fight and the justifiably classic Hitchhiking scene. Colbert beats the cocky Gable at his own game by proving that SHE doesn't have to use her thumb to pull a ride. Instead she shows a bit of leg and stops a vehicle, much to the horror of Gable. Great stuff!This film almost single-handedly established the great screwball comedy. Colbert's Ellie is the ultimate screwy dame,paving the way for Lombard and Hepburn in the genre, with Gable's Peter a direct forerunner to the Fredrich March character in the screwball classic 'Nothing Sacred' (1937). This films holds a very important place in motion picture history.Best of all, it's so enjoyable.10/10."
    },
    {
      "username": "gmmax",
      "userUrl": "https://www.imdb.com/user/ur1094400",
      "reviewLink": "https://www.imdb.com/review/rw0012266",
      "warningSpoilers": false,
      "date": "13 May 2001",
      "rate": "10",
      "helpful": "45 out of 53 found this helpful.",
      "title": "This classic never loses its magic! Romance, warmth & humor!",
      "content": "This sweet comedy never loses its appeal. Claudette Colbert is a spoiled young girl who meets a wordly, attractive newspaper reporter (Clark Gable). In the beginning, she treats him like a servant, but he never knuckles under to this behavior. The interaction between these two is very romantic and humorous. It is the classic portrayal of what may be called \"sexual tension.\" He takes care of her - does not take advantage of her - but makes her realize that her wealthy background cannot carry her through as a human being, she has to earn his respect by treating him with respect. There is a scene in which the two of them are forced to hitchhike, and their \"breakfast\" is only a handful of carrots plucked from a garden they were lucky to find. As Gable stands at the edge of the road and Colbert is perched atop a wooden fence, his wisecracking posture is said to be the inspiration for the beloved cartoon character Bugs Bunny. This is a must-see for every one who loves old movies, and entertaining for all."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1495103",
      "warningSpoilers": false,
      "date": "11 October 2006",
      "rate": "8",
      "helpful": "15 out of 27 found this helpful.",
      "title": "Could Have Been Super With Different Ending; Still A Top 'Classic'",
      "content": "The first movie to sweep all the major Academy Awards, this film is still popular today. That's probably so because the dialog between the two stars of the picture - Clark Gable and Claudette Colbert - is just great. Those two make this fun to watch. I enjoyed it, however, much more on the first viewing than subsequent ones. It lost some of its zip after I knew what to expect. The ending, too, was very weak. Over the last 20 minutes, the two stars go their separate ways (until the very end) and the story gets very stupid.The nice romance that had developed between the two seemed to have disintegrated when Gable left one early morning (for good intentions) but didn't tell Colbert. The latter thought Gable ran out on her. Hollywood, in films of the 1930s and 1940s, loved to have romances in which confusion abounded and everything was misinterpreted for the worst....until the happy ending when the truth somehow would surface. That same theme was in here, along with yet another trivialization of marriage, another common theme during the classic era. Colbert says it herself in one line, mentioning she doesn't care for this other guy, but what the heck, might as well get married, what's the difference? Huh?If the scriptwriters here would have just kept the \"road\" part of this film going longer - with Gable and Colbert trading barbs - it would have been super. Gable has the best lines an is the most fun to watch but Colbert can hold her own. She looks really pixie-ish and cute, although most of her closeups are done with a fuzzy lens, another habit of filmmakers of that era had with female stars. One of the film world's most famous scenes is in this movie: the hitch-hiking scene in which the cocky Cable explains the different ways of successful thumbing in order to get a ride....and gets nowhere while Colbert, on her first try, gets a car to stop immediately after she lifts up her skirt! That is still one of the great comedic scenes in movie history.Overall, this is still one of the best comedies of \"The Golden Age,\" even with its faults."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2518668",
      "warningSpoilers": true,
      "date": "14 November 2011",
      "rate": "10",
      "helpful": "8 out of 13 found this helpful.",
      "title": "Watch the original....",
      "content": "Often, I don't bother reviewing films with a bazillion reviews already or films that are classics. After all, what could one more review contribute? However, I have a reason to finally review \"It Happened One Night\". Tonight, I watched a god-awful mess called \"You Can't Run Away From Love\". Why? Well, because it starred Jack Lemmon and I almost always like his films. Sadly, after a few minutes, I realized it was a musical remake of \"It Happened One Night\". And, sadly, it VERY closely followed the original--and that's the problem. Seeing Clark Gable and Claudette Colbert in the original is charming and both fine actors were at the top of their game. Jack Lemmon and June Allyson (especially Allyson) were pretty bad--and it's so apparent when they are parroting Gable and Colbert. It made me appreciate the original so much more! So, if you are bored and have nothing to do, do NOT watch the remake!! Watch \"It Happened One Night\"--even if you've already seen it before! The film is charming, funny and sweet."
    },
    {
      "username": "gazzo-2",
      "userUrl": "https://www.imdb.com/user/ur0447031",
      "reviewLink": "https://www.imdb.com/review/rw0012263",
      "warningSpoilers": false,
      "date": "1 February 2001",
      "rate": "",
      "helpful": "5 out of 6 found this helpful.",
      "title": "It sure did...",
      "content": "Of course I like this-it's a classic. You have to love the bit parts of Alan Hale Sr as the singing driver, Roscoe Karnes as the 'Shapely' guy on the bus(his name and....), the 'brawling couple' stuff, and as always, the 'Walls of Jericho'.I always enjoy the great b & w look, the heart that Capra gives us with the snap, and of course Claudette Colbert, Gable never better.It won a lot of Oscars, it deserved them.**** outta ****"
    },
    {
      "username": "danjakubik",
      "userUrl": "https://www.imdb.com/user/ur2955935",
      "reviewLink": "https://www.imdb.com/review/rw2208620",
      "warningSpoilers": false,
      "date": "16 February 2010",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Natural, charming, witty and very entertaining",
      "content": "\"It Happened One Night\" happens to be my personal most favorite film ever. It was an adapted screenplay (by Robert Riskin), from the short story \"Night Bus\" and was directed by Frank Capra. With a simple story, plot, modest budget and a very short four week production schedule, this film goes a long way. Director Frank Capra obviously knew the story to tell and how to tell it. Some of the best films are made in a surprisingly short amount of time and on a modest budget. This film followed what Capra hoped would be a critical and box office success. The hopes were low for this film, even after securing stars Clark Gable and Claudette Colbert for the lead roles. Columbia Studios was not well respected at the time in Hollywood.\"It Happened One Night\", 1934, had a relatively small budget for it's time: $325,000, of which Claudette Colbert asked for and received $50,000 for her role. A star receiving this much of the total film budget was unheard of during the 1930's. Released during America's Great Economic Depression, the film had excellent timing and proved to be a big critical and audience hit. All the right elements came together. It had a high quality comedic screenplay with believable characters in believable situations. A film where luck and chemistry came together, producing a film that exceeded the expectations of everyone involved, including its' director Frank Capra.The film comes across as light hearted and natural and with excellent timing and pacing. For it's time, this style of film was new. It would be one of the first of a new genre: screwball romantic comedy. Winner of five Academy Awards in all the major categories: Best Picture, Director, Adapted Screenplay, Actor in a Leading Role and Actress in a Leading Role, was a first in Hollywood history. Only two other films have swept the five top Academy Awards: \"One Flew Over The Cuckoo's Nest\", 1975 and \"The Silence of the Lambs\", 1991.Claudette Colbert was quoted as saying: \"I just finished the worst film ever\" on \"It Happened One Night\". She had no idea how well the film would be edited. The film editing here is subtle and sublime. Colbert and Gable achieved that rare and special screen chemistry in the film. Colbert's demand that the film needed to be produced in four weeks, because of her vacation schedule, actually created the lively pace of the film, working in it's favor. \"It Happened One Night\" is a fine example of a quality screenplay, some good luck and a lot of chemistry, all coming together, producing an enduring and enjoyable comedy classic.Clark Gable comes across as completely natural and very entertaining. The fun had while making this film shows partly in Gable's performance. Unfortunately, he would not be cast in a comedic role again, even after the big success of this film. The studio system of the time demanded stars remain type-casted. For Gable, that meant macho romantic leading action man.To me, \"It Happened One Night\" is the best ever romantic comedy film, a gold standard for it's genre. It's lost none of it's charm and naturalness since it's release in 1934. The look of the film dates it, but it still delivers it's original naturalness, charm, wittiness, timing, pacing and entertainment value. Just about a perfectly made film."
    }
  ],
  "errorMessage": ""
}