{
  "imDbId": "tt0025316",
  "title": "It Happened One Night",
  "fullTitle": "It Happened One Night (1934)",
  "type": "Movie",
  "year": "1934",
  "language": "en",
  "titleInLanguage": "It Happened One Night",
  "url": "https://en.wikipedia.org/wiki/It_Happened_One_Night",
  "plotShort": {
    "plainText": "It Happened One Night is a 1934 pre-Code American romantic comedy film with elements of screwball comedy directed and co-produced by Frank Capra, in collaboration with Harry Cohn, in which a pampered socialite (Claudette Colbert) tries to get out from under her father's thumb and falls in love with a roguish reporter (Clark Gable). The screenplay by Robert Riskin is based on the August 1933 short story \"Night Bus\" by Samuel Hopkins Adams, which provided the shooting title. Classified as a \"pre-Code\" production, the film is among the last romantic comedies created before the MPPDA began rigidly enforcing the 1930 Motion Picture Production Code in July 1934. It Happened One Night was released just four months prior to that enforcement.\r\nIt has garnered critical acclaim and is widely hailed one of the greatest films ever made. It Happened One Night is the first of only three films (along with One Flew Over the Cuckoo's Nest and The Silence of the Lambs) to win all five major Academy Awards: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. In 1993, it was selected for preservation in the U.S. National Film Registry by the Library of Congress, being deemed \"culturally, historically, or aesthetically significant\". In 2013, the film underwent an extensive restoration by Sony Pictures.",
    "html": "<p>It Happened One Night is a 1934 pre-Code American romantic comedy film with elements of screwball comedy directed and co-produced by Frank Capra, in collaboration with Harry Cohn, in which a pampered socialite (Claudette Colbert) tries to get out from under her father's thumb and falls in love with a roguish reporter (Clark Gable). The screenplay by Robert Riskin is based on the August 1933 short story \"Night Bus\" by Samuel Hopkins Adams, which provided the shooting title. Classified as a \"pre-Code\" production, the film is among the last romantic comedies created before the MPPDA began rigidly enforcing the 1930 Motion Picture Production Code in July 1934. It Happened One Night was released just four months prior to that enforcement.</p><p>It has garnered critical acclaim and is widely hailed one of the greatest films ever made. It Happened One Night is the first of only three films (along with One Flew Over the Cuckoo's Nest and The Silence of the Lambs) to win all five major Academy Awards: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. In 1993, it was selected for preservation in the U.S. National Film Registry by the Library of Congress, being deemed \"culturally, historically, or aesthetically significant\". In 2013, the film underwent an extensive restoration by Sony Pictures.</p>"
  },
  "plotFull": {
    "plainText": "It Happened One Night is a 1934 pre-Code American romantic comedy film with elements of screwball comedy directed and co-produced by Frank Capra, in collaboration with Harry Cohn, in which a pampered socialite (Claudette Colbert) tries to get out from under her father's thumb and falls in love with a roguish reporter (Clark Gable). The screenplay by Robert Riskin is based on the August 1933 short story \"Night Bus\" by Samuel Hopkins Adams, which provided the shooting title. Classified as a \"pre-Code\" production, the film is among the last romantic comedies created before the MPPDA began rigidly enforcing the 1930 Motion Picture Production Code in July 1934. It Happened One Night was released just four months prior to that enforcement.\r\nIt has garnered critical acclaim and is widely hailed one of the greatest films ever made. It Happened One Night is the first of only three films (along with One Flew Over the Cuckoo's Nest and The Silence of the Lambs) to win all five major Academy Awards: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. In 1993, it was selected for preservation in the U.S. National Film Registry by the Library of Congress, being deemed \"culturally, historically, or aesthetically significant\". In 2013, the film underwent an extensive restoration by Sony Pictures.\r\nPlot\r\nSpoiled heiress Ellen \"Ellie\" Andrews has eloped with pilot and fortune-hunter King Westley against the wishes of her extremely wealthy father, Alexander Andrews, who wants to have the marriage annulled because he knows that Westley is really interested only in Ellie's money. Jumping ship in Florida, Ellie runs away and boards a Greyhound bus to New York City to reunite with her husband. She meets fellow passenger Peter Warne, a newspaper reporter who recently lost his job. Soon, Peter recognizes her and gives her a choice. If she gives him an exclusive on her story, he will help her reunite with Westley. If not, he will tell her father where she is. Ellie agrees to help.\r\nAs they go through several adventures, Ellie loses her initial disdain for Peter and they begin to fall in love. When the bus breaks down and they begin hitchhiking, they fail to secure a ride until Ellie displays a shapely leg to Danker, the next driver. When they stop en route, Danker tries to steal their luggage but Peter chases him down and seizes his Model T. Near the end of their journey, Ellie confesses her love to Peter. The owners of the motel in which they stay notice that Peter's car is gone and then expel Ellie. Believing Peter has deserted her, Ellie telephones her father, who agrees to let her marry Westley. Meanwhile, Peter has obtained money from his editor to marry Ellie but he misses her on the road. Although Ellie has no desire to be with Westley, she believes that Peter has betrayed her for the reward money and so agrees to have a second, formal wedding with Westley.\r\nOn the wedding day, she finally reveals the whole story to her father. When Peter comes to Ellie's home, Andrews offers him the reward money, but Peter insists on being paid only his expenses, a paltry $39.60 for items that he had been forced to sell to buy gasoline. When Andrews presses Peter for an explanation of his odd behavior and demands to know if he loves her, Peter first tries to dodge the questions but then admits that he loves Ellie and storms out. Westley arrives for his wedding via an autogyro, but at the ceremony, Andrews reveals to his daughter Peter's refusal of the reward money and tells her that her car is waiting by the back gate in case she changes her mind. At the last minute, just before she says \"I do\", she decides not to go through with the wedding. Ellie dumps Westley at the altar, bolts for her car, and drives away as the newsreel cameras crank.\r\nA few days later, Andrews is working at his desk when Westley calls to tell him that he will take the financial settlement and not contest the annulment. His executive assistant brings him a telegram from Peter: \"What's holding up the annulment, you slowpoke? The walls of Jericho are toppling!\" That is a reference to a makeshift wall made of a blanket hung over a rope that was tied across the rooms separating the beds they had slept in, in order to give them each privacy while traveling together. With the annulment in hand, Andrews sends the reply, \"Let 'em topple.\"\r\nThe last scene has Peter's battered Model T parked in a motor court in Glen Falls, Michigan. The mom-and-pop owners talk and wonder why, on such a warm night, the newlyweds (he had seen the marriage license) wanted a clothesline, an extra blanket, and the little tin trumpet that he had gotten for them. As they look at the cabin, the toy trumpet sounds a fanfare, the blanket falls to the floor, and the lights in the cabin go out.\r\nCast\r\nClark Gable as Peter Warne, a recently fired newspaper reporter\r\nClaudette Colbert as Ellen \"Ellie\" Andrews, a spoiled heiress of millions\r\nWalter Connolly as Alexander Andrews, Ellie's millionaire father\r\nRoscoe Karns as Oscar Shapeley, an annoying bus passenger who tries to pick up Ellie\r\nJameson Thomas as \"King\" Westley, Ellie's fiancé (or husband); a pilot and fortune-hunter\r\nAlan Hale as Danker, the singing car driver who wants to steal the suitcase\r\nArthur Hoyt as Zeke, a motel owner\r\nBlanche Friderici as Zeke's wife\r\nCharles C. Wilson as Joe Gordon, newspaper editor and Peter's boss\r\nErnie Adams as the Bag Thief\r\nIrving Bacon as Gas Station Attendant\r\nGeorge Breakston as Boy Bus Passenger whose mother collapsed\r\nWard Bond as Bus Driver #1\r\nEddy Chandler as Bus Driver #2\r\nMickey Daniels as a Vendor on bus\r\nBess Flowers as Agnes, Gordon's Secretary\r\nHarry Holman as the Auto Camp Manager at the end of the film\r\nClaire McDowell as the collapsed Mother in the bus\r\nHarry Todd as the Flagman at railroad crossing\r\nMaidel Turner as the Auto Camp Manager's Wife\r\nWallis Clark as Lovington\r\nFrank Yaconelli as Tony\r\nDolores Fuller as child\r\nProduction\r\nCasting\r\nNeither Gable nor Colbert was the first choice to play the lead roles. Miriam Hopkins rejected the part of Ellie. Robert Montgomery and Myrna Loy were then offered the roles, but both turned down the script. Loy later noted that the final story as filmed bore little resemblance to the script that she and Montgomery had been given. Margaret Sullavan also rejected the part. Constance Bennett was willing to accept the role if she could produce the film herself but Columbia Pictures would not agree to that condition. Bette Davis then wanted the role but she was under contract with Warner Brothers and Jack L. Warner refused to lend her. Carole Lombard was unable to accept because Columbia's proposed filming schedule would conflict with her work on Bolero at Paramount. Loretta Young also turned it down.\r\nHarry Cohn suggested Colbert, who initially turned down the role. Her first film, For the Love of Mike (1927), had been directed by Capra and was such a disaster that neither wanted to work with the other again. Later, she agreed to the role only if her salary was doubled to $50,000 and if her scenes were completed in four weeks so that she could take a planned vacation.\r\nAccording to Hollywood legend, Gable was lent to Columbia Pictures, then considered a minor studio, as punishment for refusing a role at his own studio. That tale has been partially refuted by more recent biographies. Metro-Goldwyn-Mayer did not have a project ready for Gable and the studio was paying him his contracted salary of $2,000 per week whether he worked or not. Louis B. Mayer lent him to Columbia for $2,500 per week, hence netting MGM $500 per week while he was gone. Capra, however, insisted that Gable was a reluctant participant in the film.\r\nFilming\r\nFilming began in a tense atmosphere as Gable and Colbert were dissatisfied with the quality of the script. Capra understood their dissatisfaction and let screenwriter Robert Riskin rewrite it. Colbert continued to show her displeasure on the set. She also initially balked at pulling up her skirt to entice a passing driver to provide a ride, complaining that it was unladylike. Upon seeing the chorus girl who was brought in as her body double, an outraged Colbert told the director, \"Get her out of here. I'll do it. That's not my leg!\" Capra claimed that Colbert \"had many little tantrums, motivated by her antipathy toward me,\" however, \"she was wonderful in the part.\" Part of the film was made on Thousand Oaks Boulevard in Thousand Oaks, California.\r\nRestoration\r\nIn 2013 It Happened One Night was digitally restored. A new wet-gate master was produced by Sony Colorworks for scanning at 4K. The images were digitally treated at Prasad Corporation to remove dirt, tears, scratches, and other artifacts. Care was taken to preserve the original look of the film.\r\nReception\r\nAfter filming was done, Colbert complained to her friend, \"I just finished the worst picture in the world\". Columbia appeared to have low expectations for the film and did not mount much of an advertising campaign for it. Initial reviews were generally positive, Mordaunt Hall of The New York Times called it \"a good piece of fiction, which, with all its feverish stunts, is blessed with bright dialogue and a good quota of relatively restrained scenes\". Hall described Colbert's performance as \"engaging and lively\" and Gable as \"excellent\". Variety reported that it was \"without a particularly strong plot\" but \"manages to come through in a big way, due to the acting, dialog, situations and directing\". Film Daily praised it as \"a lively yarn, fast-moving, plenty humorous, racy enough to be tantalizing, and yet perfectly decorous\". The New York Herald Tribune called it \"lively and amusing\". John Mosher of The New Yorker panned it as \"pretty much nonsense and quite dreary\" which was probably the review Capra had in mind when he recalled in his autobiography that \"sophisticated\" critics had dismissed the film. Despite the positive reviews, the film was only moderately successful in its initial run. After it was released to secondary movie houses, ticket sales became brisk, especially in smaller towns where the film's characters and simple romance struck a chord with moviegoers who were not surrounded by luxury. It turned out to be a major box office smash, easily Columbia's biggest hit until the late 1980's. During its initial release, the film earned $1 million in theater rentals from the United States and Canada.\r\nRotten Tomatoes compiled 95 reviews of the film to form a 99% \"Certified Fresh\" score and an average rating of 9.2/10. The consensus reads, \"Capturing its stars and director at their finest, It Happened One Night remains unsurpassed by the countless romantic comedies it has inspired\". The film earned a score of 87 on Metacritic.\r\nIn 1935, after her Academy Award nomination, Colbert decided not to attend the ceremony since she felt she would not win and planned to take a cross-country railroad trip. After she was named the winner, studio chief Harry Cohn sent someone to \"drag her off\" the train, which had not departed, to take her to the ceremony. Colbert arrived wearing a two-piece traveling suit which she had had the Paramount Pictures costume designer, Travis Banton, make for her trip.\r\nAcademy Awards\r\nThe film won all five of the Academy Awards for which it was nominated at the 7th Academy Awards for 1934:\r\nIt Happened One Night was the first film to win the \"Big Five\" Academy Awards (Best Picture, Best Director, Best Actor, Best Actress and Best Writing). As of 2022, only two other films have achieved this feat: One Flew Over the Cuckoo's Nest in 1975 and The Silence of the Lambs in 1991. It Happened One Night was also the last film to win both lead acting Academy Awards until One Flew Over the Cuckoo's Nest in 1975.\r\nOn December 15, 1996, Gable's Oscar was auctioned off to Steven Spielberg for $607,500, who donated the statuette to the Motion Picture Academy. In June of the following year, Colbert's Oscar was offered for auction by Christie's but attracted no bids.\r\nOthers\r\nThe film is recognized by American Film Institute in these lists:\r\n1998: AFI's 100 Years...100 Movies – #35\r\n2000: AFI's 100 Years...100 Laughs – #8\r\n2002: AFI's 100 Years...100 Passions – #38\r\n2005: AFI's 100 Years...100 Movie Quotes: Ellie Andrews: \"Well, I proved once and for all that the limb is mightier than the thumb.\" – Nominated\r\nEllie Andrews: \"Well, I proved once and for all that the limb is mightier than the thumb.\" – Nominated\r\n2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #46\r\n2008: AFI's 10 Top 10: Romantic Comedy – #3\r\nInfluence\r\nIt Happened One Night made an immediate impact on the public. In one scene, Gable undresses for bed, taking off his shirt to reveal that he is bare-chested. An urban legend claims that, as a result, sales of men's undershirts declined noticeably. The movie also prominently features a Greyhound bus in the story, spurring interest in bus travel nationwide.\r\nThe unpublished memoirs of animator Friz Freleng mention that this was one of his favorite films. It Happened One Night has a few interesting parallels with, and may have even inspired certain characteristics of, the cartoon character Bugs Bunny, who made his first appearance six years later, and who Freleng helped develop. In the film, a minor character, Oscar Shapely, continually calls the Gable character \"Doc,\" an imaginary character named \"Bugs Dooley\" is mentioned once in order to frighten Shapely, and there is also a scene in which Gable eats carrots while talking quickly with his mouth full, as Bugs does.\r\nRemakes and adaptations\r\nThe film has inspired a number of remakes, including the musicals Eve Knew Her Apples (1945) starring Ann Miller and You Can't Run Away from It (1956) starring June Allyson and Jack Lemmon, which was directed and produced by Dick Powell.\r\nIt Happened One Night was adapted as a one-hour radio play on the March 20, 1939 broadcast of Lux Radio Theatre, with Colbert and Gable reprising their roles. The screenplay was also adapted as a radio play for the January 28, 1940, broadcast of The Campbell Playhouse, starring Orson Welles (Mr. Andrews), William Powell (Peter Warne) and Miriam Hopkins (Ellie Andrews).\r\nIt Happened One Night has been adapted into numerous Indian films. These include three Hindi adaptations: Chori Chori (1956), Nau Do Gyarah (1957) and Dil Hai Ke Manta Nahin (1991), one Bengali adaptation Chaoa Paoa (1959), two Tamil adaptations: Chandrodayam (1966) and Kadhal Rojavae (2000), and one Kannada adaptation Hudugaata (2007).\r\nIn popular culture\r\nThe 1937 Laurel and Hardy comedy Way Out West parodied the famous hitchhiking scene with Stan Laurel managing to stop a stage coach using the same technique. Mel Brooks's film Spaceballs (1987) parodies the wedding scene. As she walks down the aisle to wed Prince Valium, Princess Vespa (Daphne Zuniga) is told by King Roland (Dick Van Patten) that Lone Starr (Bill Pullman) forsook the reward for the princess's return and only asked to be reimbursed for the cost of the trip.\r\nOther films have used familiar plot points from It Happened One Night. In Bandits (2001), Joe Blake (Bruce Willis) erects a blanket partition between motel room beds out of respect for Kate Wheeler's (Cate Blanchett's) privacy. He remarks that he saw people do the same thing in an old movie. In Sex and the City 2, Carrie and Mr. Big watch the film (specifically the hitchhiking scene) in a hotel; later in the film Carrie uses the idea which she got from the film to get a taxi in the Middle East.\r\nIn \"The Bogman of Letchmoor Heath\", the second episode of the horror/comedy television series She-Wolf of London (1990–1991), lead characters Randi Wallace (Kate Hodge) and Ian Matheson (Neil Dickson) rent a motel room, and, uncomfortable with the lack of privacy afforded, Ian stretches a bed sheet like a curtain between the two beds. Ian makes reference to It Happened One Night but Randi is unfamiliar with the film, remarking that she would rather \"read a book\".\r\nBeginning in January 2014, the comic 9 Chickweed Lane tied a story arc to It Happened One Night when one of the characters, Lt. William O'Malley, is injured during World War II and believes himself to be Peter Warne. As he sneaks through German-occupied France, several plot points run parallel to that of It Happened One Night and he believes his French contact to be Ellen Andrews.",
    "html": "<p>It Happened One Night is a 1934 pre-Code American romantic comedy film with elements of screwball comedy directed and co-produced by Frank Capra, in collaboration with Harry Cohn, in which a pampered socialite (Claudette Colbert) tries to get out from under her father's thumb and falls in love with a roguish reporter (Clark Gable). The screenplay by Robert Riskin is based on the August 1933 short story \"Night Bus\" by Samuel Hopkins Adams, which provided the shooting title. Classified as a \"pre-Code\" production, the film is among the last romantic comedies created before the MPPDA began rigidly enforcing the 1930 Motion Picture Production Code in July 1934. It Happened One Night was released just four months prior to that enforcement.</p><p>It has garnered critical acclaim and is widely hailed one of the greatest films ever made. It Happened One Night is the first of only three films (along with One Flew Over the Cuckoo's Nest and The Silence of the Lambs) to win all five major Academy Awards: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. In 1993, it was selected for preservation in the U.S. National Film Registry by the Library of Congress, being deemed \"culturally, historically, or aesthetically significant\". In 2013, the film underwent an extensive restoration by Sony Pictures.</p><br/><h3>Plot</h3><p>Spoiled heiress Ellen \"Ellie\" Andrews has eloped with pilot and fortune-hunter King Westley against the wishes of her extremely wealthy father, Alexander Andrews, who wants to have the marriage annulled because he knows that Westley is really interested only in Ellie's money. Jumping ship in Florida, Ellie runs away and boards a Greyhound bus to New York City to reunite with her husband. She meets fellow passenger Peter Warne, a newspaper reporter who recently lost his job. Soon, Peter recognizes her and gives her a choice. If she gives him an exclusive on her story, he will help her reunite with Westley. If not, he will tell her father where she is. Ellie agrees to help.</p><p>As they go through several adventures, Ellie loses her initial disdain for Peter and they begin to fall in love. When the bus breaks down and they begin hitchhiking, they fail to secure a ride until Ellie displays a shapely leg to Danker, the next driver. When they stop en route, Danker tries to steal their luggage but Peter chases him down and seizes his Model T. Near the end of their journey, Ellie confesses her love to Peter. The owners of the motel in which they stay notice that Peter's car is gone and then expel Ellie. Believing Peter has deserted her, Ellie telephones her father, who agrees to let her marry Westley. Meanwhile, Peter has obtained money from his editor to marry Ellie but he misses her on the road. Although Ellie has no desire to be with Westley, she believes that Peter has betrayed her for the reward money and so agrees to have a second, formal wedding with Westley.</p><p>On the wedding day, she finally reveals the whole story to her father. When Peter comes to Ellie's home, Andrews offers him the reward money, but Peter insists on being paid only his expenses, a paltry $39.60 for items that he had been forced to sell to buy gasoline. When Andrews presses Peter for an explanation of his odd behavior and demands to know if he loves her, Peter first tries to dodge the questions but then admits that he loves Ellie and storms out. Westley arrives for his wedding via an autogyro, but at the ceremony, Andrews reveals to his daughter Peter's refusal of the reward money and tells her that her car is waiting by the back gate in case she changes her mind. At the last minute, just before she says \"I do\", she decides not to go through with the wedding. Ellie dumps Westley at the altar, bolts for her car, and drives away as the newsreel cameras crank.</p><p>A few days later, Andrews is working at his desk when Westley calls to tell him that he will take the financial settlement and not contest the annulment. His executive assistant brings him a telegram from Peter: \"What's holding up the annulment, you slowpoke? The walls of Jericho are toppling!\" That is a reference to a makeshift wall made of a blanket hung over a rope that was tied across the rooms separating the beds they had slept in, in order to give them each privacy while traveling together. With the annulment in hand, Andrews sends the reply, \"Let 'em topple.\"</p><p>The last scene has Peter's battered Model T parked in a motor court in Glen Falls, Michigan. The mom-and-pop owners talk and wonder why, on such a warm night, the newlyweds (he had seen the marriage license) wanted a clothesline, an extra blanket, and the little tin trumpet that he had gotten for them. As they look at the cabin, the toy trumpet sounds a fanfare, the blanket falls to the floor, and the lights in the cabin go out.</p><br/><h3>Cast</h3><ul><li>Clark Gable as Peter Warne, a recently fired newspaper reporter</li><li>Claudette Colbert as Ellen \"Ellie\" Andrews, a spoiled heiress of millions</li><li>Walter Connolly as Alexander Andrews, Ellie's millionaire father</li><li>Roscoe Karns as Oscar Shapeley, an annoying bus passenger who tries to pick up Ellie</li><li>Jameson Thomas as \"King\" Westley, Ellie's fiancé (or husband); a pilot and fortune-hunter</li><li>Alan Hale as Danker, the singing car driver who wants to steal the suitcase</li><li>Arthur Hoyt as Zeke, a motel owner</li><li>Blanche Friderici as Zeke's wife</li><li>Charles C. Wilson as Joe Gordon, newspaper editor and Peter's boss</li></ul><ul><li>Ernie Adams as the Bag Thief</li><li>Irving Bacon as Gas Station Attendant</li><li>George Breakston as Boy Bus Passenger whose mother collapsed</li><li>Ward Bond as Bus Driver #1</li><li>Eddy Chandler as Bus Driver #2</li><li>Mickey Daniels as a Vendor on bus</li><li>Bess Flowers as Agnes, Gordon's Secretary</li><li>Harry Holman as the Auto Camp Manager at the end of the film</li><li>Claire McDowell as the collapsed Mother in the bus</li><li>Harry Todd as the Flagman at railroad crossing</li><li>Maidel Turner as the Auto Camp Manager's Wife</li><li>Wallis Clark as Lovington</li><li>Frank Yaconelli as Tony</li><li>Dolores Fuller as child</li></ul><br/><h3>Production</h3><h4>Casting</h4><p>Neither Gable nor Colbert was the first choice to play the lead roles. Miriam Hopkins rejected the part of Ellie. Robert Montgomery and Myrna Loy were then offered the roles, but both turned down the script. Loy later noted that the final story as filmed bore little resemblance to the script that she and Montgomery had been given. Margaret Sullavan also rejected the part. Constance Bennett was willing to accept the role if she could produce the film herself but Columbia Pictures would not agree to that condition. Bette Davis then wanted the role but she was under contract with Warner Brothers and Jack L. Warner refused to lend her. Carole Lombard was unable to accept because Columbia's proposed filming schedule would conflict with her work on Bolero at Paramount. Loretta Young also turned it down.</p><p>Harry Cohn suggested Colbert, who initially turned down the role. Her first film, For the Love of Mike (1927), had been directed by Capra and was such a disaster that neither wanted to work with the other again. Later, she agreed to the role only if her salary was doubled to $50,000 and if her scenes were completed in four weeks so that she could take a planned vacation.</p><p>According to Hollywood legend, Gable was lent to Columbia Pictures, then considered a minor studio, as punishment for refusing a role at his own studio. That tale has been partially refuted by more recent biographies. Metro-Goldwyn-Mayer did not have a project ready for Gable and the studio was paying him his contracted salary of $2,000 per week whether he worked or not. Louis B. Mayer lent him to Columbia for $2,500 per week, hence netting MGM $500 per week while he was gone. Capra, however, insisted that Gable was a reluctant participant in the film.</p><h4>Filming</h4><p>Filming began in a tense atmosphere as Gable and Colbert were dissatisfied with the quality of the script. Capra understood their dissatisfaction and let screenwriter Robert Riskin rewrite it. Colbert continued to show her displeasure on the set. She also initially balked at pulling up her skirt to entice a passing driver to provide a ride, complaining that it was unladylike. Upon seeing the chorus girl who was brought in as her body double, an outraged Colbert told the director, \"Get her out of here. I'll do it. That's not my leg!\" Capra claimed that Colbert \"had many little tantrums, motivated by her antipathy toward me,\" however, \"she was wonderful in the part.\" Part of the film was made on Thousand Oaks Boulevard in Thousand Oaks, California.</p><h4>Restoration</h4><p>In 2013 It Happened One Night was digitally restored. A new wet-gate master was produced by Sony Colorworks for scanning at 4K. The images were digitally treated at Prasad Corporation to remove dirt, tears, scratches, and other artifacts. Care was taken to preserve the original look of the film.</p><br/><h3>Reception</h3><p>After filming was done, Colbert complained to her friend, \"I just finished the worst picture in the world\". Columbia appeared to have low expectations for the film and did not mount much of an advertising campaign for it. Initial reviews were generally positive, Mordaunt Hall of The New York Times called it \"a good piece of fiction, which, with all its feverish stunts, is blessed with bright dialogue and a good quota of relatively restrained scenes\". Hall described Colbert's performance as \"engaging and lively\" and Gable as \"excellent\". Variety reported that it was \"without a particularly strong plot\" but \"manages to come through in a big way, due to the acting, dialog, situations and directing\". Film Daily praised it as \"a lively yarn, fast-moving, plenty humorous, racy enough to be tantalizing, and yet perfectly decorous\". The New York Herald Tribune called it \"lively and amusing\". John Mosher of The New Yorker panned it as \"pretty much nonsense and quite dreary\" which was probably the review Capra had in mind when he recalled in his autobiography that \"sophisticated\" critics had dismissed the film. Despite the positive reviews, the film was only moderately successful in its initial run. After it was released to secondary movie houses, ticket sales became brisk, especially in smaller towns where the film's characters and simple romance struck a chord with moviegoers who were not surrounded by luxury. It turned out to be a major box office smash, easily Columbia's biggest hit until the late 1980's. During its initial release, the film earned $1 million in theater rentals from the United States and Canada.</p><p>Rotten Tomatoes compiled 95 reviews of the film to form a 99% \"Certified Fresh\" score and an average rating of 9.2/10. The consensus reads, \"Capturing its stars and director at their finest, It Happened One Night remains unsurpassed by the countless romantic comedies it has inspired\". The film earned a score of 87 on Metacritic.</p><p>In 1935, after her Academy Award nomination, Colbert decided not to attend the ceremony since she felt she would not win and planned to take a cross-country railroad trip. After she was named the winner, studio chief Harry Cohn sent someone to \"drag her off\" the train, which had not departed, to take her to the ceremony. Colbert arrived wearing a two-piece traveling suit which she had had the Paramount Pictures costume designer, Travis Banton, make for her trip.</p><h4>Academy Awards</h4><p>The film won all five of the Academy Awards for which it was nominated at the 7th Academy Awards for 1934:</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Result</th><th>Winner</th></tr><tr><td><span>Outstanding Production</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Frank Capra</span> and <span>Harry Cohn</span> (for <span>Columbia Pictures</span>)</td></tr><tr><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Frank Capra</span></td></tr><tr><td><span>Best Actor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Clark Gable</span></td></tr><tr><td><span>Best Actress</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Claudette Colbert</span></td></tr><tr><td><span>Best Adaptation</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Robert Riskin</span></td></tr></tbody></table><p>It Happened One Night was the first film to win the \"Big Five\" Academy Awards (Best Picture, Best Director, Best Actor, Best Actress and Best Writing). As of 2022, only two other films have achieved this feat: One Flew Over the Cuckoo's Nest in 1975 and The Silence of the Lambs in 1991. It Happened One Night was also the last film to win both lead acting Academy Awards until One Flew Over the Cuckoo's Nest in 1975.</p><p>On December 15, 1996, Gable's Oscar was auctioned off to Steven Spielberg for $607,500, who donated the statuette to the Motion Picture Academy. In June of the following year, Colbert's Oscar was offered for auction by Christie's but attracted no bids.</p><h4>Others</h4><p>The film is recognized by American Film Institute in these lists:</p><ul><li>1998: AFI's 100 Years...100 Movies – #35</li><li>2000: AFI's 100 Years...100 Laughs – #8</li><li>2002: AFI's 100 Years...100 Passions – #38</li><li>2005: AFI's 100 Years...100 Movie Quotes: Ellie Andrews: \"Well, I proved once and for all that the limb is mightier than the thumb.\" – Nominated</li><li>Ellie Andrews: \"Well, I proved once and for all that the limb is mightier than the thumb.\" – Nominated</li><li>2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #46</li><li>2008: AFI's 10 Top 10: Romantic Comedy – #3</li></ul><br/><h3>Influence</h3><p>It Happened One Night made an immediate impact on the public. In one scene, Gable undresses for bed, taking off his shirt to reveal that he is bare-chested. An urban legend claims that, as a result, sales of men's undershirts declined noticeably. The movie also prominently features a Greyhound bus in the story, spurring interest in bus travel nationwide.</p><p>The unpublished memoirs of animator Friz Freleng mention that this was one of his favorite films. It Happened One Night has a few interesting parallels with, and may have even inspired certain characteristics of, the cartoon character Bugs Bunny, who made his first appearance six years later, and who Freleng helped develop. In the film, a minor character, Oscar Shapely, continually calls the Gable character \"Doc,\" an imaginary character named \"Bugs Dooley\" is mentioned once in order to frighten Shapely, and there is also a scene in which Gable eats carrots while talking quickly with his mouth full, as Bugs does.</p><br/><h3>Remakes and adaptations</h3><p>The film has inspired a number of remakes, including the musicals Eve Knew Her Apples (1945) starring Ann Miller and You Can't Run Away from It (1956) starring June Allyson and Jack Lemmon, which was directed and produced by Dick Powell.</p><p>It Happened One Night was adapted as a one-hour radio play on the March 20, 1939 broadcast of Lux Radio Theatre, with Colbert and Gable reprising their roles. The screenplay was also adapted as a radio play for the January 28, 1940, broadcast of The Campbell Playhouse, starring Orson Welles (Mr. Andrews), William Powell (Peter Warne) and Miriam Hopkins (Ellie Andrews).</p><p>It Happened One Night has been adapted into numerous Indian films. These include three Hindi adaptations: Chori Chori (1956), Nau Do Gyarah (1957) and Dil Hai Ke Manta Nahin (1991), one Bengali adaptation Chaoa Paoa (1959), two Tamil adaptations: Chandrodayam (1966) and Kadhal Rojavae (2000), and one Kannada adaptation Hudugaata (2007).</p><br/><h3>In popular culture</h3><p>The 1937 Laurel and Hardy comedy Way Out West parodied the famous hitchhiking scene with Stan Laurel managing to stop a stage coach using the same technique. Mel Brooks's film Spaceballs (1987) parodies the wedding scene. As she walks down the aisle to wed Prince Valium, Princess Vespa (Daphne Zuniga) is told by King Roland (Dick Van Patten) that Lone Starr (Bill Pullman) forsook the reward for the princess's return and only asked to be reimbursed for the cost of the trip.</p><p>Other films have used familiar plot points from It Happened One Night. In Bandits (2001), Joe Blake (Bruce Willis) erects a blanket partition between motel room beds out of respect for Kate Wheeler's (Cate Blanchett's) privacy. He remarks that he saw people do the same thing in an old movie. In Sex and the City 2, Carrie and Mr. Big watch the film (specifically the hitchhiking scene) in a hotel; later in the film Carrie uses the idea which she got from the film to get a taxi in the Middle East.</p><p>In \"The Bogman of Letchmoor Heath\", the second episode of the horror/comedy television series She-Wolf of London (1990–1991), lead characters Randi Wallace (Kate Hodge) and Ian Matheson (Neil Dickson) rent a motel room, and, uncomfortable with the lack of privacy afforded, Ian stretches a bed sheet like a curtain between the two beds. Ian makes reference to It Happened One Night but Randi is unfamiliar with the film, remarking that she would rather \"read a book\".</p><p>Beginning in January 2014, the comic 9 Chickweed Lane tied a story arc to It Happened One Night when one of the characters, Lt. William O'Malley, is injured during World War II and believes himself to be Peter Warne. As he sneaks through German-occupied France, several plot points run parallel to that of It Happened One Night and he believes his French contact to be Ellen Andrews.</p><br/>"
  },
  "errorMessage": ""
}