{
  "imDbId": "tt0015864",
  "title": "The Gold Rush",
  "fullTitle": "The Gold Rush (1925)",
  "type": "Movie",
  "year": "1925",
  "items": [
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1353708",
      "warningSpoilers": false,
      "date": "28 April 2006",
      "rate": "10",
      "helpful": "34 out of 39 found this helpful.",
      "title": "Chaplin's best--what a film!",
      "content": "I've seen both version of this film--the original silent version from 1925 and the re-release by Chaplin in the 1940s. The difference is that the re-release was designed to appeal to a new audience that expected sound from their movies. To do this, title cards were removed--having Chaplin narrate the film. In addition, Chaplin-created music (for the most part--some were classical pieces), sound effects and singing were added to make the movie more palatable to the average viewer. I personally like BOTH versions and the one you watch is up to you if you get a copy of the Warner Brothers release on DVD--it has both plus excellent DVD extras. Otherwise, there have been a lot of public domain versions on video out there--many with terrible quality prints or music or both. The Warner version is the most pristine and beautiful silent print you can find. The version usually shown on Turner Classic movies is the 1942 re-release.I use this film for my American history class when we do our unit on the history of film, though I might, in the future, use it for my Psychology classes as well (I teach both) because Chaplin's genius came from his obsessive-compulsive nature. The movie reportedly had 27 times more film exposed than you actually see in the film and the shoe eating segment was shot after more than 60 takes!! The plot involves Charlie going to Alaska for the Gold Rush at the turn of the century. Along the way, he has a series of misadventures that have been thoroughly discussed in the other reviews here on IMDb. Suffice to say, the supporting acting was excellent and the story kept an excellent pace and had enough slapstick to make it fun to watch (something not true of all full-length slapstick comedies--sometimes, their pacing was negatively affected by the transition from shorts to full-length).This is a gorgeous, well-executed piece of American art and a must for any real cinemaniac. The musical score (arranged by Chaplin), direction, acting and cinematography all are simply perfect--making this, in my opinion, the best full-length silent comedy ever made. This is saying a lot considering how much I love Harold Lloyd and Buster Keaton's films!"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1079508",
      "warningSpoilers": false,
      "date": "13 May 2005",
      "rate": "10",
      "helpful": "38 out of 46 found this helpful.",
      "title": "You just can't beat Charlie Chaplin!",
      "content": "The 1898 Gold Rush to Alaska may have been harsh, but Charlie Chaplin makes it hilarious. As an unnamed prospector, Chaplin goes through a series of gaffes while seeking gold in the Yukon. Most famous of course are the shoe for dinner, the dancing roles, and the cabin teetering on the edge of a cliff. His companion, Big Jim McKay (Mack Swain) at one point is so hungry that he believes Chaplin's character to be a chicken, and before long, a bear enters their cabin. In the midst of it all, the prospector falls in love with dancer Georgia (Georgia Hale).A real triumph for Charlie Chaplin! They must have had a lot of fun filming it!"
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0003673",
      "warningSpoilers": false,
      "date": "6 August 2001",
      "rate": "",
      "helpful": "27 out of 31 found this helpful.",
      "title": "A Worthy Silent Classic",
      "content": "This silent classic has many strong points - it has a lot of humor, interesting characters, a good story and good settings. It's the kind of film that shows how much a master film-maker can communicate in a silent movie. It overdoes the sentimentality on occasion, but other than that it's a fine film.Chaplin himself plays the 'Lone Prospector', and he is joined by several other interesting characters in a frozen north setting that sets up some good adventures and drama. There are some memorable scenes in the prospectors' rickety cabins, plus some other good material.The version of this that is the easiest to find is the one that Chaplin re-edited in the 1940's, adding his own narration and deleting the title cards, which gives it a slightly different feel. (These revisions probably make it a bit easier to follow for those who aren't used to silent films.) You can tell from Chaplin's narration how fond he must have been of \"The Gold Rush\", and he had a lot of good reasons to be pleased with it. There are a couple of his later films that might be even better and more timeless, but this one contains everything that defined Chaplin and his art."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0003667",
      "warningSpoilers": false,
      "date": "15 May 2001",
      "rate": "10",
      "helpful": "59 out of 72 found this helpful.",
      "title": "Charlie Chaplin at his best.",
      "content": "The Gold Rush is one of Chaplin's best films, as well as one of his most famous. It has been said that it is the film that he most wanted to be remembered by, and it's not hard to see why. Chaplin plays the part of the lone prospector, a young miner during the gold rush. After getting caught in a storm, he hurries to the only shelter that he can find, a wood cabin in the middle of the storm. It turns out that it is already inhabited, and by a tough criminal named Black Larson, no less, and the scene in which Charlie and Big Jim, another prospector, insist to Black Larson that they are going to stay is one of the countless memorable scenes in the film. Charlie and Big Jim are left alone and without food when Larson goes off to face the storm looking for food (having drawn the lowest card in another amusing scene), and the scenes in the cabin are some of the best in the entire film. There is, of course, the boot eating scene, memorable not only because of its cleverness and effectiveness, but also because while making the film, Chaplin ate so much boot (which was made out of licorice) before he was satisfied with the take that he had to be taken to the hospital to have his stomach pumped. Another thing that was really well done was the special effects. I am still amazed every time I watch the film at how realistic it looks when there is a long shot from outside showing Charlie hanging from the door of the cabin, which is balanced precariously on the edge of a cliff. Also notice the fast paced and very effective music during this scene, the same song that is played in the best scene of the 1996 film Shine, with Geoffrey Rush. There is also a very noteworthy love element of The Gold Rush, a part of the story that Chaplin generally has much success with in his films. Charlie's amorous interests in Georgia, a dance hall girl, leads to the scene where he performs the famous dance of the dinner rolls, probably the most famous scene in the film, which was also performed very well by Johnny Depp in Benny & Joon. Charlie's relationship with Georgia is also the thing that leads to his presentation of his sympathy for the lower classes, when he meets her on the ship after having become a multi-millionaire. Chaplin's full length films are inherently more famous than his earlier short comedies, and The Gold Rush is one of the best of his full length features. A must see for any Chaplin fan, but The Gold Rush is also a film that anyone who is interested in quality comedy should watch."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0003693",
      "warningSpoilers": false,
      "date": "7 November 2003",
      "rate": "",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Striking Gold Again and Again.",
      "content": "Charles Chaplin's \"The Gold Rush\" is arguably his finest film. He stars as a wimpy prospector who decides to go to the Klondike in the hopes of striking it rich. What he does not realize is that he may find love (in the form of Georgia Hale) instead of money. In the end that may be all right with him. \"The Gold Rush\" shows everything that made Charles Chaplin the great performer, writer and director he was. Quite possibly the finest cinematic icon of the 20th Century, Chaplin showed humanity, love and an undying want to entertain all audiences throughout his stellar cinematic career. The movie is exceptional in every way. Although I am not as well-versed with movies from the 1920s as I am with the decades following it, I would still probably call \"The Gold Rush\" the finest film of that 10-year period. Oh how the cinema misses Charles Chaplin today. 5 stars out of 5."
    },
    {
      "username": "didi-5",
      "userUrl": "https://www.imdb.com/user/ur0137908",
      "reviewLink": "https://www.imdb.com/review/rw1050268",
      "warningSpoilers": false,
      "date": "30 March 2005",
      "rate": "8",
      "helpful": "43 out of 61 found this helpful.",
      "title": "Little Tramp makes good",
      "content": "Charlie Chaplin's silent film (also re-released with a narration in the early 1940s) focuses, as usual, on the Little Tramp, and in this case, his attraction to a chorus girl (Georgia Hale). This is the one where he eats a boot, along with its laces, and manages to make it appear a sumptuous meal; as well as creating a dance with bread rolls.The role of the girl was originally intended for the second Mrs Chaplin, Lita Grey, but her pregnancy ruled her out. Georgia Hale is excellent in her disdain of the unwanted Tramp attentions. Mack Swain appears as Big Jim, who shares a cabin with the Tramp, at one point getting so hungry he imagines his pal as a chicken ready to eat! This film has the spirit of the pioneers and gold-runners, as well as the inimitable spirit of the little hero. As a silent it is one of the best comedies of the time, as a sound film, it is fairly good."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6082352",
      "warningSpoilers": false,
      "date": "10 September 2020",
      "rate": "9",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Silence is Golden...",
      "content": "Then came the dawn, and with it one of the standout scenes in any silent movie as the cabin teeters on the brink. There are so many elements in this film, elements that would be reused and recombined in various presentations over the years and on so many occasions - the gold standard.Endearing and adorable Charlie Chaplin - a genuinely pioneering prospector."
    },
    {
      "username": "Petey-10",
      "userUrl": "https://www.imdb.com/user/ur0222418",
      "reviewLink": "https://www.imdb.com/review/rw0003698",
      "warningSpoilers": false,
      "date": "25 August 2004",
      "rate": "",
      "helpful": "21 out of 29 found this helpful.",
      "title": "Pure gold",
      "content": "Charlie Chaplin is the Lone Prospector who goes to Klondike, Alaska in search of gold.There he meets and falls in love to beautiful Georgia (Georgia Hale).In cold and snowy Alaska he rambles forward looking for gold with his fellow prospector Big Jim McKay (Mack Swain) thinking of her.A genius called Charlie Chaplin made in 1925 this silent movie masterpiece known as The Gold Rush.Now nearly 80 years after the film was made we get to watch this genius in a tramp suit doing his job.And he did it well.Better than probably anybody.He could make us laugh and he could make us cry.Maybe even both of those at the same time.Chaplin realized that every good comedy has a little tragedy. Of course I have to give credits to other actors as well.Mack Swain as Big Jim McKay is not only a big man, he's also big at his acting skills. Georgia Hale is as beautiful of woman as she is a great actress. The Gold Rush is filled with marvelous scenes.The most memorable is the shoe-eating scene.Chaplin on the dance floor is also something to remember.Through the movie you can hear the score Chaplin composed to this movie.It works perfectly.Just like the whole movie.It's pure gold from the beginning till the end."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw5746151",
      "warningSpoilers": false,
      "date": "17 May 2020",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Classic Chaplin movie with unforgettable scenes as the pantomime sequence of eating the shoe",
      "content": "Very good Charles Chaplin in which he proves his excellent skill as an actor and director . The Little tramp searches for gold and romance in the Klondike , Alaska , in the mid-1800s . Along the way he gets mixed up with some burly roles and he falls in love by the charming dancer Georgia , furthermore , he finds in competition with a jealous suitor who has his eyes on Georgia , as well . And while facing off other prospectors and suffering extreme starvation, and anything else.This is his most critically acclaimed movie being a real masterpiece. The picture had success at box office and the general public liked it very much , especially the scenes of the rolls dance , Chaplin tied a dog while dancing on the hall , the old cabin hanging on the cliff , among others . The best denomination of his simple approach to movie form, adept maneuvering of visual pathos . Includes lovely music , unforgettable and classic scenes as Chaplin and his colleague have dinner old shoes and the hilarious dance of the rolls.This was one of the his first longest films to that date . Chaplin formerly had directed short films of 1, 2 , or 3 reels , such as : Our hero, Night at the show , The fireman , The adventurer , The count , The floor walker , The Circus , The cure , The inmigrant , Burlesque on Carmen , 3 Charlies anda phone , Shoulder arms , and several others . Shortly after , he directed long time films as The Gold Rush , The kid , City lights , Modern times, The great dictator , Monsieur Verdoux , Limelight , A king in New York , and his last one , A countess from Hong Kong . Rating : 8/10 . ¨The picture I want to be remembered by¨-Charles Chaplin . Better than average . Well worth watching . Essential and indispensable seeing ."
    },
    {
      "username": "ACitizenCalledKane",
      "userUrl": "https://www.imdb.com/user/ur4306474",
      "reviewLink": "https://www.imdb.com/review/rw0991688",
      "warningSpoilers": false,
      "date": "4 January 2005",
      "rate": "10",
      "helpful": "53 out of 73 found this helpful.",
      "title": "Possibly Chaplin's best film, certainly one of the greatest comedies of all time!",
      "content": "To see Charlie Chaplin's The Gold Rush is to know enjoyment. One cannot help but enjoy a film as well-done as this! Chaplin said that this was the film for which he wanted to be remembered, and I can see why. It is a masterful blend of comedy, drama, and romance, among other genres seamlessly brought together in one extraordinary picture. Like all great movies, The Gold Rush has more than its share of memorable moments, from the Thanksgiving dinner to the dance of the dinner rolls to the cabin teetering on the edge of the mountain. All of these scenes are brilliant because of The Tramp's flawless physical comedy. He was a master of comedic timing, and he was one of the most graceful physical comedians I've ever seen. Don't get me wrong, this picture is not just three fantastic scenes amongst filler. The film moves along at a brisk pace, following the misadventures of our hero, The Lone Prospector (Charlie Chaplin, of course), as he attempts to hit it big by discovering gold in Alaska. Along his journey through the elements, the prospector meets the notorious Black Larsen (Tom Murray), a wanted criminal willing to do anything to get his hands on some gold. Fortunately, our friend also comes across a fellow prospector, Big Jim McKay (Mack Swain), who has finally defied all odds and struck it rich. But the Lone Prospector's adventures take place not only out in the middle of nowhere. When he is forced back to civilization, he falls in love with Georgia (Georgia Hale), the most beautiful girl in town. Of course, it would be all too easy if no one else was interested in this beauty. Jack Cameron (Malcolm Waite), the handsome lady's man who is not content with every other woman in town by his side; he must have Georgia, as well. Competition arises between the disappointed prospector and the ego-maniacal \"lady killer.\" All of this would be too much for any one of us, but the Lone Prospector handles it all with his uncompromising resilience in the face of insurmountable odds to bring us one of the greatest comedies of all time! I will not lie, I am a fan of Charlie Chaplin's movies, but as objective as I can possibly be, this IS one of the great movies...Essential viewing!"
    },
    {
      "username": "lugonian",
      "userUrl": "https://www.imdb.com/user/ur0853359",
      "reviewLink": "https://www.imdb.com/review/rw0003676",
      "warningSpoilers": false,
      "date": "26 January 2002",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Charlie of the Yukon",
      "content": "THE GOLD RUSH (United Artists, 1925), written, directed and starring Charlie Chaplin, may not be the very best of the Chaplin feature comedies of the silent era, but has become the very movie in which Chaplin wanted to be most noted for by future generations. So proud of his achievement, Chaplin reissued this silent film in 1942 with a new music soundtrack which introduced a narration written and spoken by Chaplin himself, eliminating the use of title cards. Then in the summer of 1971, THE GOLD RUSH became the initial movie presented on public broadcasting station's 13-week series of \"The Silent Years,\" as hosted by Orson Welles, from the Paul Killian collection with a new and excellent piano score by William Perry.THE GOLD RUSH, which is set in the turn of the century, opens with The Lone Prospector (Charlie Chaplin) coming to Alaska. A snow storm drives him into the cabin of \"Black\" Lawson (Tom Murray), an outlaw. \"Big Jim\" McKay (Mack Swain), another prospector who has found gold on his claim, is also driven in by the storm and into the same cabin. After much struggle, Larson finds himself having to accept the two men as his guests. Stranded due to the heavy storm, Larson, finds himself chosen to go out for help. While out in the storm, he comes upon a couple of officers looking for him. He gets away by stealing their dog sled, but is later killed in an avalanche. Back to the cabin, Charlie and Larson, almost in near starvation, eventually make a meal out of a large bear. When the snow storm finally subsides, the two men go about their separate ways. Charlie comes to a mining town where he becomes infatuated with Georgia (Georgia Hale), a dance hall girl, causing jealousy from her suitor, Jack Cameron (Malcolm Waite). As for Jim, he has forgotten where his gold claim is, and locates Charlie to help him find it, separating him from Georgia. The results that follow is classic Chaplin.Aside from a large list of supporting players, which consists of frequent Chaplin character actor Henry Bergman as Hank Curtis, \"The Gold Rush\" contains many now classic comedy supplements, including the starving Charlie cooking his boot in hot water, and using his shoelace as spaghetti; Charlie's encounter with Georgia; and the near end finale in which Charlie and Big Jim return to the cabin before setting out to find the claim, in which the cabin gets blown away during the blizzard that forces the cabin to be found the next morning halfway over the edge of a cliff which starts to tilt back and forth as the men make their slightest movement. There are tender moments, too, including Charlie awaiting for Georgia and her other friends to accompany him for New Year's Eve dinner, with tears flowing down his cheek when at the stroke of midnight realizes they are not coming. The most famous sequence of the entire movie is the one where Charlie falls asleep and dreams of himself entertaining his dinner guests by using two forks in two potato rolls as his feet and doing a dance for them.With THE GOLD RUSH being Chaplin's most revived and discussed movie, one must never forget his other artistic achievements that followed, including THE CIRCUS (1928), CITY LIGHTS (1931), MODERN TIMES (1936) and his talkie debut of THE GREAT DICTATOR (1940). Since the advent of home video in the early 1980s, THE GOLD RUSH consists of various editions and different music scores, ranging from the use of piano, organ or orchestra. There are even some editions that have no music track at all, along with some copies running different time lengths, and others eliminating the final closing segment set on the boat in which Charlie and Georgia walk on top of the deck to be interviewed and photographed by the press before the fadeout. The 1942 reissue, being a shorter print with Chaplin's narration, not only was presented occasionally on American Movie Classics, but can also be found on Chaplin's 100th birthday anniversary video edition followed by a 1921 comedy short, PAY DAY. Video or DVD enthusiasts out there certainly will have a major choice to consider as to which copy to have in their collection. But in spite of numerous editions, THE GOLD RUSH is a golden treasure where it had been shown on American Movie Classics (1997-2001) and currently presented on Turner Classic Movies in either format of the shorter 1942 reissue or silent print with the William Perry piano score. While Chaplin is listed in the cast solely as The Lone Prospector, avid lip readers will notice that he is called \"Charlie\" by his supporting players, especially by Georgia. (****)"
    },
    {
      "username": "PhilipJames1980",
      "userUrl": "https://www.imdb.com/user/ur1413169",
      "reviewLink": "https://www.imdb.com/review/rw0003697",
      "warningSpoilers": false,
      "date": "7 June 2004",
      "rate": "10",
      "helpful": "63 out of 86 found this helpful.",
      "title": "Gold is the operative word here.",
      "content": "The Gold Rush is pure gold. It was Charlie Chaplin's third feature-length film, and marked his comeback of sorts following A Woman of Paris (1923), which he had directed to great critical acclaim but which had been unsuccessful at the box office because it lacked his signature character The Little Tramp. This movie should be counted among Chaplin's best and most enduring works; many people name City Lights (which I've also seen) as THE best Chaplin movie, but The Gold Rush is still an excellent showcase for one of movie comedy's immortal geniuses.Having first seen this movie years ago on TV, I saw it again in October 2003 as part of my college's silent-film class, on a poor-quality videotape that often prevented the other students and I from laughing at it because we could barely discern what was happening on the screen. Even so, I was sufficiently intrigued to buy the GR Chaplin Collection DVD, which has a restored silent version of the film that is so good I haven't even bothered to watch the 1942 sound version that's also on the disc.The viewing quality of this restored silent version is excellent, although certain minor details are still hard to see, such as the faces of the cards drawn by the Tramp, Jim McKay and Black Larsen as they try to determine who should go out into the blizzard. On the other hand, in the shot of the cabin teetering on the edge of the cliff, the viewing clarity makes clearly visible the wire used to pull the model cabin farther over the edge!Also, the film seems to skip in the scene when the Tramp dances with Georgia, perhaps due to a transfer problem with the DVD. But these are minor complaints, and certainly the restoration allows for full appreciation of the film.The first half-hour of The Gold Rush is in itself worth the purchase price, as it contains some of the funniest scenes I've ever seen in any movie. Even the throwaway bits, such as the Tramp trying to use a crude hand-drawn compass, are more genuinely funny than the extreme gross-out gags offered by most contemporary comedies. And the shoe-eating scene is so famously funny that even people watching it for the first time may feel that they've seen it already: this is in no way a bad thing, but merely reflects the fact that the best silent films long ago entered into the collective memory of our culture.I don't say this to sound pretentious. I believe that because Chaplin had such influence on the development of movie comedy, that to a certain extent people today may take him for granted. It's hard to approach his work with fresh eyes only because so many people have watched his movies for so many years. For example, before the success of The Kid (1921), Chaplin's first feature film, the movie industry doubted that audiences would accept a film that blended comedy and drama. In The Gold Rush, Chaplin further explored cinema's potential to be comedy and drama simultaneously. Only he could have distilled humor from scenes of starvation and struggles to survive the ravings of a madman.The joy of watching this film today stems from seeing how well Chaplin, as both star and director, finds and maintains the right tone and style for his work, negotiating the fine line between comedy and tragedy. This is most evident in the scene when McKay and Larsen struggle for the shotgun in the cabin and the Tramp tries desperately to escape the muzzle's aim: the sequence is undeniably hilarious, yet even today the Tramp's grim predicament is just as likely to horrify the viewer.One pleasure of silent comedies such as The Gold Rush is that the lack of a soundtrack leaves more to the imagination, in the same manner that old-time radio comedy got laughs from funny sound effects that showed the audience nothing. When Black Larsen sees the Tramp in the cabin, for example, he enters and slams the door, causing the Tramp to spin around in alarm. This is the kind of joke that could only work in a silent movie, because no door-slamming sound effect could be quite as funny as the piano score imitating the noise, as rendered by Neil Brand on the DVD. The second act, in which the Tramp gives up prospecting, returns to town and becomes infatuated with Georgia, was probably inevitable, as Chaplin realized he couldn't sustain the entire film at the cabin. Still, he must have drawn much of his inspiration from that one location, because he returns his characters to the cabin in the film's third act. I don't want to spoil the climax for anyone who hasn't seen it, but I believe that even today it remains one of the most vivid depictions in cinema history of man versus the elements, and Chaplin milked all its potential for comedy and suspense.Mack Swain is hilarious as Jim McKay, creating a memorable comic image with his ridiculously small boots and high-domed fur coat. Chaplin generously gave him some opportunities to be funny on his own in this film, just as he was content to let Jackie Coogan share the spotlight in The Kid. From what I've seen of City Lights and Modern Times, he was not so generous in his later films, seeming to think that he himself was the whole show. The Gold Rush may not be a perfect 10 compared to today's more sophisticated stories and special effects. The ending is cheerfully cynical, improbably reuniting two characters and never revealing Georgia's true feelings for the Tramp.But the bottom line is that The Gold Rush is still funny after almost eighty years, and that's a feat few comedies in any year can ever accomplish. Chaplin, in his ability to extract maximum humor and poignancy from his material, has no equivalent today. What a shame.Rating: 10 (One of the best movies of 1925.)"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0003694",
      "warningSpoilers": true,
      "date": "27 January 2004",
      "rate": "",
      "helpful": "12 out of 19 found this helpful.",
      "title": "Dancing Rolls",
      "content": "Spoilers herein.I consider `City Lights' to be a masterwork, one of the films that every literate person must see. This film is often equally celebrated, but it seems to be a random collection of integrated ideas to me. Some work, most don't.The 1942 rescore and voiceover is much tighter visually but sonicly heavy. If you have a chance with the DVD, see it in the 42 recut with no sound and subtitles.The one skit that works the best is the famous dancing rolls bit. You really must see three versions of this one after another. Look at the original. Then see the Robert Downey Jr version done in 1992, almost 70 years later. Notice how much more comic Downey's is because he uses a different timing and is both doing it and referencing the Chaplin dance. Then see the Johnny Depp version of the year later, which pokes fun at the Downey version and reannotates the original. A work of genius overlain on a masterpiece.Otherwise, there are better silent comedies to see. And better Chaplin.Ted's Evaluation -- 2 of 3: Has some interesting elements."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1193629",
      "warningSpoilers": true,
      "date": "14 October 2005",
      "rate": "10",
      "helpful": "38 out of 66 found this helpful.",
      "title": "The Little Fellow is simply superb!",
      "content": "If any single figure can fairly be said to symbolize the glory years of the silent filmsthe cinema's truly international epochit is Charles Chaplin's indomitable tramp The Little Fellow, as millions came to call him, was at once tatty and debonair, brow-beaten and irrepressibly optimisticand he was, without question, the best-loved international star in all of film history His coat was too small, his pants too large, his mustache patently falseand the resultant silhouette instantly recognizable wherever movies were shown Charlie Chaplin's tramp spoke to all walks of lifeand never more eloquently than in such silent films as \"The Kid,\" and \"The Gold Rush.\" \"The Gold Rush\" is superb It deals with Charlie's adventures to win the affection of a local dance-hall girl, and his hilarious efforts to avoid being eaten by bears and by prospectors who are bigger and hungrier than he The most memorable scene is one in which he dines on an old shoe Chaplin's exquisite grace, turned the boiled shoe into a gourmet feast: he carves it carefully, smacks his lips in anticipation, and then eats it with gusto and appreciation, sucking the nails as if they contained the most juices and twirling the laces around his fork as if they were spaghetti"
    },
    {
      "username": "llltdesq",
      "userUrl": "https://www.imdb.com/user/ur0583640",
      "reviewLink": "https://www.imdb.com/review/rw0003675",
      "warningSpoilers": false,
      "date": "23 November 2001",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "One of the all-time classics!",
      "content": "If anyone doubts that Charlie Chaplin was one of the funniest comedians ever or that silent films did not require acting ability, t you a commend this film, as well as City Lights. Modern Times isn't, strictly speaking, a silent film, although Chaplin had no dialogue there. The Gold Rush, while not Chaplin's best film, does feature his best performance and has so many classic bits, it must be seen. Excellent film. 1942 version redone by Chaplin is a bit better, but either will do. Most highly recommended."
    },
    {
      "username": "chaos-rampant",
      "userUrl": "https://www.imdb.com/user/ur17699578",
      "reviewLink": "https://www.imdb.com/review/rw2496175",
      "warningSpoilers": false,
      "date": "30 September 2011",
      "rate": "",
      "helpful": "8 out of 14 found this helpful.",
      "title": "Blissful ignorance",
      "content": "To be perfectly honest, I wish I could denounce Chaplin more fervently than I find myself able to. Right down to my fundamental worldview, I am a Buster Keaton person, the face a mask that stoically accepts the door slamming shut; so I find it beyond irksome and trite every time the tramp is by some miraculous chain of events restored into happiness. The world as I understand it just doesn't work this way; kings and beggars alike have the same toll to pay. So wishing it did only fosters more pain.This is actually worst than The Kid in this respect. Our lowly hero eventually gets the dream girl, but only after he has allowed himself to be dragged in pursuit of gold. Oh, though filthy rich at that point, when in the end he falls practically in the girl's arms he is again dressed like a tramp - meaning, no doubt, he is still the same person - but where usually the hero sacrifices superficial, worldly pleasures for the deeper calling that fulfills the soul, here he gets both. There is not even the thought of a compromise.Yet I can't help but connect here with one specific aspect of Chaplin's cosmology; the mysterious, elusive fates - seemingly random, but slowly revealed to be guiding purpose - that govern life and toss it about through so many clashing rocks.Nowhere is this sketched more poignantly than in the famous cliffhanger scene. The tramp wakes in the same cabin he was earlier; familiar surroundings from inside, the reality thought to be known, understood, domesticated into order, but from outside we see how this reality hangs in precarious balance above the void. So, every step inside, taken casually, without much thought, is revealed from outside to have terrifying consequences that govern life and death. 'Blissful ignorance', the intertitle aptly describes the situation inside the cabin.It is a powerful cosmologic symbol, what in Eastern philosophy is understood as karma, fate flowing not from some lofty precipice of the gods above but from inside the house of everyday life. With both gold and love, impossible love with the dream girl, as the chimeras that trick the mind.So Chaplin is gifted enough to see the world as it manifests itself to us on some fundamental level, as in the dream sequence in The Kid where we see the devil tricking the soul from inside, but either cannot properly understand – and confuses karma for providential fate - or he does, is terrified, and chooses to soothe us instead with a fairy- tale.So however well-meant, it's a dishonest, patronizing vision of bliss. Once more these forces are finally shown to be the challenging, but eventually benevolent whims of providence. It's all made right again, more than right.Notice how well integrated is this notion inside the film, proof that all else aside Chaplin was a talented film mind; we are so closely made to identify with the point-of-view of the tramp, who is kept in blissful ignorance of the larger soul-defining mechanisms that shape his life, that we come out of the film from our position as viewers buying this fantasy as an important lesson.So instead of coming out of the film realizing that we should seize control of our own footsteps in life that keep our world in balance, or assume responsibility for when it trickles down the hill, just wait and it'll all work out in the end. It is a clever manipulation into blissful ignorance, with the filmmaker playing our strings the same way invisible fates play with the character inside the film.Sure, it is occasionally very funny, inventive. But we're talking here about the more intricate mechanisms that drive a film - and, film aspiring to be a truthful reflection of life, life itself."
    },
    {
      "username": "dataconflossmoor",
      "userUrl": "https://www.imdb.com/user/ur1855181",
      "reviewLink": "https://www.imdb.com/review/rw1599624",
      "warningSpoilers": false,
      "date": "15 February 2007",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Licorice Shoes and Critical Acclaim!!!!!",
      "content": "Just like Orson Wells, Marlon Brando and Katherine Hepburn, Charlie Chaplin is a classic in the movie industry!! The king of silent films is attributed with making slapstick humor one of the stellar accomplishments in the entertainment business!! Slapstick comedy is predicated on a lot of physical humor, often times, slapstick is underrated in terms of the immense amount of talent it actually requires!! Lucille Ball got her start by emulating slapstick icons such as Buster Keaton and Charlie Chaplin, and later, she instilled slapstick stunts in her renowned comedy series \"I Love Lucy\"... The film, \"Gold Rush\" is hilarious in it's exaggeration of calamity!! Charlie Chaplin is tremendous in engaging in a befuddled demeanor about his basic struggle for survival!! \"Gold Rush\" was listed by one movie critic's list as the best film ever!! Why do you suppose this is? I would say that it is mostly on account of the cunningly successful aspects of silliness that are incorporated in the making of this movie!! Another big reason would be the flippant approach slapstick artist Charlie Chaplin orchestrates when encountering one predicament after the other in this film!! These actions are so overdone that they are hysterically funny!! Charlie Chaplin executes all of the necessary acrobatics of chicanery very effectively!! In the case of \"Gold Rush\" Charlie Chaplin is so intense in his ludicrous actions, that he effortlessly makes \"Gold Rush\" a masterpiece!! Take into account that it is 1925, before the film goer was barraged with a bevy of special effects, and you, (being part of the movie audience) will recognize how well put together this movie really is!! The innocuous charisma of a Nicklelodian style film is often times mollified, and is discarded by many people as being cavalier in it's attempt to attain a recognizable prowess as far as being an assertively marvelous flick is concerned!! Nothing could be further from the truth in the case of the film \"Gold Rush\" This film is outstanding!! The licorice shoes were an added whimsical element to making \"Gold Rush\" funny as well!! I strongly recommend that you rent this movie and watch it!! This is without a doubt, an extremely top notch film!! It is not always rated #1 on every critic's list, but, it is always listed as one of the best movies ever made by virtually every movie expert!! The latest review list that AFI came out with \"Gold Rush\" was rated 58th out of the top 100 American films ever made!!"
    },
    {
      "username": "GTDMAC",
      "userUrl": "https://www.imdb.com/user/ur2288329",
      "reviewLink": "https://www.imdb.com/review/rw0003687",
      "warningSpoilers": false,
      "date": "11 March 2003",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Is It Better Than City Lights, though?",
      "content": "The eternal question for many Chaplin fans is is The Gold Rush better than City Lights? There are some who would argue for Modern Times or maybe even The Great Dictator. There are even a few who like Monsieur Verdoux. But to say this film is better than City Lights is definitely inviting controversy. As a statement on social mores and values City Lights is far more indicting. As an important piece of film City Lights shows us many things that had never been done before and perhaps may never be done again on the big screen. But as a sheer enjoyable romp in The Little Tramp's world City Lights falls short. It is buried in social commentary whereas the Gold Rush has some social issues to deal with but nothing much new from previous works until the end where it neatly summarizes what \"Charlot\" has been all about all along. It is that ending which makes the Gold Rush the best of Chaplin's works and the one I will watch just for the sheer joy of seeing the artist in his prime. 10 out of 10."
    },
    {
      "username": "nnnn45089191",
      "userUrl": "https://www.imdb.com/user/ur5949479",
      "reviewLink": "https://www.imdb.com/review/rw1333787",
      "warningSpoilers": false,
      "date": "5 April 2006",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "You don't need sound to make a great film.",
      "content": "Spoiler Alert:\"The Gold Rush\" is perhaps one of the best silent movies I have ever seen.Although it takes a bit to get used to silent movie language you'll be rewarded with a marvelous,funny and poignant movie.Some of the scenes are hilarious and some really touches your heartstrings. Chaplin as performer gives one of his best performances in this movie. There are plenty of great scenes:Chaplin and Mack Swain in the cabin,crazy with hunger and cabin fever,the touching New Year's Eve party and finally the hilarious finale with the cabin out on the edge of a cliff.The later version which was released with added narration and music wasn't as good as the original,but easier for modern audiences to watch."
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw7713756",
      "warningSpoilers": true,
      "date": "2 January 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Chaplin's best",
      "content": "Charlie Chaplin was mostly known for his terrific silent films he made in the 1920s which were hugely popular with audiences. The one he himself said he wanted to be remembered for was The Gold Rush. It's technically a comedy, but its plot is much more complicated than most others in the genre. This doesn't mean it's bad in any way, it's just not what I was expecting from a film where the primary focus is to make people laugh. The story in this is centered around Chaplin's character, who doesn't have an actual name. He's a prospector during the gold rush that took place in Alaska at the end of the 1800s, and he is trying to make a huge sum of money very quickly. A snowstorm arrives, and in the confusion, he ends up in a cabin occupied by Black Larsen, a criminal. Jim (Mack Swain) also shows up in the cabin, and the three men reluctantly agree to live together (for now). Later, the cabin's food supply starts to diminish, so Larsen is sent outside to look for food. A bear strays into the cabin and is killed by Jim and the prospector, providing them with meat. Meanwhile, Larsen, still outside in the blizzard, finds a gold deposit and decides to use it as bait to lure Jim close enough so he can kill him. Larsen attacks Jim with a shovel and is knocked out, and Larsen is later killed by an avalanche. When Jim eventually wakes up, he wanders into a town, but can't actually remember where his gold deposit is. The prospector also shows up at this town and meets a girl named Georgia (Georgia Hale) at a dance hall, to whom he is instantly attracted. Georgia later goes to his house to eat dinner, but shortly after, Jim shows up to make the prospector guide him to the cabin. While Jim and the prospector are sleeping, a snowstorm blows half of the cabin precariously off a cliff, and it teeters back and forth dreadfully. Jim and the prospector manage to escape, and many months later, the prospector unexpededly encounters Georgia while on a boat back to America, and they're united again. Because this is (believe it or not) the 5th most profitable silent film ever, I had little doubt that it was going to be good. Not only that, but Chaplin is in it. Even almost a century later, there's an abundance of funny and fascinating things in this movie, such as when the cabin is about to fall off the cliff and they show the interior of it rotating. I wonder how they did that. There's also the scene where Jim is going insane with hunger and sees Chaplin's character as a giant chicken that he desperately wants to cook. I know it's a guy in a suit, but it's still funny. Films like this prove that physical comedy is something that will always be amusing, no matter how old it gets. I'm sure people many decades from now will still enjoy these timeless movies featuring one of the most iconic actors in history."
    },
    {
      "username": "pyrocitor",
      "userUrl": "https://www.imdb.com/user/ur3728510",
      "reviewLink": "https://www.imdb.com/review/rw2001028",
      "warningSpoilers": false,
      "date": "3 January 2009",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Peerless Chaplin masterpiece; comedic gold",
      "content": "After an unsuccessful attempt at melodrama in A Woman in Paris, a conscious attempt to break away from the silly and simplistic entertainment of his early cinematic career and say something important as a serious artist, Charlie Chaplin was forced to return to just the sort of crowd pleasing comedy he had just unsuccessfully made a bid to deviate from. The crucial difference was, despite his return to his defining genre, Chaplin had not abandoned his newfound sense of cinematic grandeur or determination to accomplish something more worthwhile than throwaway entertainment through film. This rekindled cinematic ambition, combined with inspiration from a series of slides detailing a vast march of Klondike gold prospectors and a gruesome account of an expedition leading to cannibalism, led to The Gold Rush, a picture just as grand, vast and engaging as any of the dramas Chaplin might have initially wanted to emulate. However, it is through Chaplin's commitment to mining the most humane and heart-warming of comedy out of the most unlikely sources that the film is firmly cemented as an abiding classic of the era. When recalled from a contemporary standpoint, the film is often remembered simply as a series of comic setpieces: Chaplin forced to scramble up the near vertical floor of a cabin teetering on the edge of a cliff, Chaplin cooking and eating a shoe to cope with famine, and the timeless dance of the dinner rolls endlessly referenced from sources as varied as 1993's Benny and Joon to the Simpsons. But what is often neglected is the sheer craftsmanship and incredibly dedication Chaplin invested in such sequences - the tension and sheer cinematic prowess demonstrated in the rocking cabin sequence alone are enough to still make it almost impossibly breathtaking and tense even when viewed over 80 years after the fact. Through such sequences, The Gold Rush demonstrates Chaplin's maturation as a filmmaker, from simply a skilled entertainer to a genuinely capable director capable of extracting not only laughs, but gasps of white knuckle fear, and unquenchable tears of fundamentally human pathos. As such, to reduce such a universally laudable film to a series of extended gags would not only be an understatement, but downright unreasonable, as the film pulses with vivid life, emotion and utter credibility, despite its exterior dressings as a simple silly comedy. Through reviving his immortal tramp figure, Chaplin gained a near peerless conduit for not only comedy but social criticism and satire, not only sending up the inhumane atrocities of Klondike prospecting life, but of class struggles and the adherence to them preventing proper human interaction. When the tramp enters a mining town, he is scarcely given any more reprieve than in the winter harshness of the mountain prospecting, so beset is he by the scorn and derision of the upper class villagers, adding conflict to a potentially budding romance and adding an ironic tinge to an otherwise saccharine ending. The film also excels technically to an extent Chaplin had previously not achieved, with subtle but deceptively inventive camera-work perfectly complimenting the flavour of the scene, whether creating a bold, sweeping statement through the iconic long shot of a weary train of prospectors traversing a mountainside, or with tender close-ups extracting every inch of emotion from Chaplin's quivering face. Far from a simple string of gags, The Gold Rush makes its mark as an unassuming cinematic masterpiece, both technically and in terms of emotional storytelling.It goes without saying that Chaplin's skills as a performer only continued to improve with each film, and The Gold Rush is no exception. Demonstrating not only his astonishing physical prowess and ability to meticulously undertake precarious stunts and comic gags, Chaplin also showcases an almost unprecedented sentimental side, with his beloved tramp figure proving an utterly irresistible underdog hero who, when beset by adversity, cannot help but genuinely capture the viewer's heart. Chaplin is also gifted with a highly talented supporting cast to play off of, including the admirably ferocious Mack Swain as a brutish fellow prospector and Georgia Hale, noteworthy for being a laudably ambiguous love interest rather than the one dimensional beauties often showcased in Chaplin's films.Arguably one of the strongest cinematic works produced during the silent era, The Gold Rush is more likely to evoke refreshingly genuine raucous laughter, heartfelt tears and finally leave the viewer with an unquenchable beaming smile on their face than almost any film made before or since. Chaplin's opus is a masterpiece of emotional storytelling on an impressively grand scale as well as a comedic classic, easily meriting the director/star's declaration of it being the singular film out of his entire body of work he would most like to be remembered by. -10/10"
    },
    {
      "username": "Beta_Gallinger",
      "userUrl": "https://www.imdb.com/user/ur15711750",
      "reviewLink": "https://www.imdb.com/review/rw1784348",
      "warningSpoilers": false,
      "date": "21 December 2007",
      "rate": "8",
      "helpful": "2 out of 2 found this helpful.",
      "title": "A comedy still worth watching after over eighty years",
      "content": "I never actually sat down to watch a silent movie from start to finish until earlier this year. Right now, I still haven't seen too many, but recently, for the first full-length silent comedy to see, I chose \"The Gold Rush\", a film written, directed by, and starring Charlie Chaplin, a highly renowned filmmaker of his time, as I was aware of this movie's wide appeal, as well as the wide appeal of much of Chaplin's other work. I wasn't as impressed with it as much as many others have been, but all in all, it was a good experience.Set in the year 1898, during the gold rush of the time (hence the title of the film), Chaplin stars as a silly prospector, one of the many who have bravely come up to face the harsh weather conditions of Alaska, in search for gold! After struggling through a blizzard, he comes across a cabin. From there, much lies ahead for him. He experiences being marooned in the cabin with a fellow prospector named Big Jim McKay, both of them without food, and also falls in love with a woman he meets in Alaska named Georgia, and attempts to win her heart!\"The Gold Rush\" definitely has some very funny and memorable gags. The two isolated prospectors eating a boiled boot, due to the fact they have no real food to eat, is definitely one of them. Gagwise, there are many more highlights in the film. The humour is very visual, with a lot of slapstick, which I usually like, and here is no exception. For the most part during the film, if I wasn't laughing, I think I was usually smiling. This 1925 Chaplin film also has some serious scenes, which works fairly well, and social commentary. I guess there's not much I'm saying, if anything, that hasn't already been said about \"The Gold Rush\". Yes, it was made over eighty years ago, but has aged well."
    },
    {
      "username": "RodrigAndrisan",
      "userUrl": "https://www.imdb.com/user/ur20962118",
      "reviewLink": "https://www.imdb.com/review/rw6732629",
      "warningSpoilers": false,
      "date": "23 March 2021",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Masterpiece!",
      "content": "Soon, in just 4 years, the film will turn 100 years since it was made. And after so long, it's more than current, it's overwhelming. The scene when the two fight with the rifle pointed to Chaplin, the scene when they eat the boot, then when the big guy thinks that Chaplin it's a chicken, when Chaplin is burying the rifle in the snow, then the dance scene when Chaplin's pants fall off, followed by the dog which is tied to the end of the rope with which Chaplin tightens his pants, and more, all are scenes of reference in the history of world cinema, scenes that inspired many other filmmakers from then until today. And they certainly will inspire and from now on. Georgia Hale was very beautiful!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2295180",
      "warningSpoilers": false,
      "date": "14 August 2010",
      "rate": "10",
      "helpful": "3 out of 5 found this helpful.",
      "title": "A golden treasure",
      "content": "I love Charlie Chaplin and I love his films. As much as I love The Tramp(his most touching), City Lights(my personal favourite of his movies), Modern Times(has my favourite soundtrack of all the Charlie Chaplin movies, love Smile), Limelight(a beautiful film) and The Great Dictator(love the speech at the end), The Gold Rush is one of his more light-hearted films.The Gold Rush looks very nice, with lovely cinematography, sets and costumes. The story is simple, but really well-done, fast-paced and involving, while the direction is very fine. The performances are first-rate, Georgia Hale is beautiful and contemptuous but it is Chaplin's performance that holds The Gold Rush together. But I cannot not mention the comedy, there are so many wonderful moments that are well and truly hysterical including the opening sequence, the dance of the bread rolls, Chaplin and his companion hallucinating(the companion hallucinating that Chaplin is a very edible chicken), the way Chaplin ate the shoe leather, Chaplin dancing with the dog tied to his belt and the final scene in the cabin on the cliff.Overall, a golden treasure from a comedy genius. 10/10 Bethany Cox"
    },
    {
      "username": "lukelandry1",
      "userUrl": "https://www.imdb.com/user/ur48834842",
      "reviewLink": "https://www.imdb.com/review/rw2999297",
      "warningSpoilers": false,
      "date": "16 April 2014",
      "rate": "7",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Surprised",
      "content": "I'm just an 18 year old dude in high school that was assigned this movie in a class at my school. When I first saw the genres of this movie I was not looking forward to it at all. It was the first silent movie I was seeing and also the oldest. It had originally seemed like everything I didn't look for in a \"good\" movie. At the conclusion of this movie I knew that my original thought process was entirely wrong. This movie has certainly changed my view on both silent and older films, especially on a comedic standpoint. There was so much about it that was appealing to the viewer. I recommend this movie to all looking to expand their film genres of interest."
    }
  ],
  "errorMessage": ""
}