{
  "imDbId": "tt0208092",
  "title": "Snatch",
  "fullTitle": "Snatch (2000)",
  "type": "Movie",
  "year": "2000",
  "items": [
    {
      "publisher": "Portland Oregonian",
      "author": "Shawn Levy",
      "link": "",
      "rate": "75",
      "content": "The convoluted story is an excuse for comical tricks of the camera, fractures of chronology, acid punch lines and amusingly excessive performances. (In this latter category, Pitt, so deep into his character that you can smell him, wins the day gloriously.)"
    },
    {
      "publisher": "Miami Herald",
      "author": "Rene Rodriguez",
      "link": "",
      "rate": "75",
      "content": "Snatch is admittedly superficial, if not downright disposable. More importantly, though, the movie is also fantastic, cheeky fun."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts?search_area=Movies&amp;channel=Movies",
      "rate": "70",
      "content": "Even if it's not quite as lighter than air as its predecessor, Snatch remains a lethal diversion."
    },
    {
      "publisher": "New York Daily News",
      "author": "Jami Bernard",
      "link": "",
      "rate": "63",
      "content": "The movie was snatched, all right, and Ritchie is the culprit."
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Carrie Rickey",
      "link": "",
      "rate": "63",
      "content": "Since the main reason I go to movies is to engage with characters, I prefer \"The Pledge,\" the film opening today by Madonna's first husband, Sean Penn, rather than this stylish fluff by her second spouse."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "John Patterson",
      "link": "",
      "rate": "60",
      "content": "It all feels rather laddish and belabored, but it will eat up 90 minutes of your time without making you regret the loss."
    },
    {
      "publisher": "The New York Times",
      "author": "A.O. Scott",
      "link": "https://www.nytimes.com/2001/01/19/movies/film-review-man-all-they-wanted-was-to-go-buy-a-trailer.html",
      "rate": "50",
      "content": "Mr. Ritchie seems to be stepping backward when he should be moving ahead."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "40",
      "content": "The problem with all this don't-blink-or-you'll-miss-it dramaturgy is that ultimately everything is sacrificed for effect. When you're dealing, as Ritchie is, with explosions of real violence and viciousness, the hyperslick technique can't accommodate the real pain that comes with the territory, or ought to. What we're left with is a cackling amorality -- not a philosophy of life, just a posture."
    },
    {
      "publisher": "Salon",
      "author": "Stephanie Zacharek",
      "link": "https://www.salon.com/2001/01/23/snatch/",
      "rate": "20",
      "content": "It takes a very clever schoolboy to make a movie as elaborately empty as Guy Ritchie's Snatch."
    },
    {
      "publisher": "Village Voice",
      "author": "Amy Taubin",
      "link": "",
      "rate": "20",
      "content": "For those who care, Madonna has found her match in Guy Ritchie, whose absence of talent when it comes to the film medium is equal to her own."
    }
  ],
  "errorMessage": ""
}