{
  "imDbId": "tt0167404",
  "title": "The Sixth Sense",
  "fullTitle": "The Sixth Sense (1999)",
  "type": "Movie",
  "year": "1999",
  "items": [
    {
      "publisher": "L.A. Weekly",
      "author": "John Patterson",
      "link": "",
      "rate": "80",
      "content": "Writer-director M. Night Shyamalan lets the tension rise slowly, leads you everywhere you don't expect, doesn't rip you off and totally freaks you out -- all without stale effects or gore."
    },
    {
      "publisher": "Film.com",
      "author": "Tom Keogh",
      "link": "",
      "rate": "80",
      "content": "Chalk this film up as an unusually intelligent thriller about that which scares us the most: accepting our accidents of fate."
    },
    {
      "publisher": "Film.com",
      "author": "Peter Brunette",
      "link": "",
      "rate": "80",
      "content": "It's far more loquacious and cerebral than your average run-of-the-mill thriller, but boy, when the relatively infrequent scares do come, they will pull you out of your seat and raise the hair on your arms."
    },
    {
      "publisher": "San Francisco Examiner",
      "author": "Wesley Morris",
      "link": "",
      "rate": "75",
      "content": "Ultimately affecting mix 'n' match weeper."
    },
    {
      "publisher": "Portland Oregonian",
      "author": "Diana Abu-Jaber",
      "link": "",
      "rate": "75",
      "content": "Sometimes verges on silliness."
    },
    {
      "publisher": "Slate",
      "author": "David Edelstein",
      "link": "",
      "rate": "70",
      "content": "Ultimately, it has less in common with \"Blair Witch\" than with such quivering lumps of sentiment as \"Ghost\" and Field of Dreams.\""
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "60",
      "content": "Borderline dull to sit through, The Sixth Sense is actually rather interesting to think about afterward because of the revelation of its ending."
    },
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "50",
      "content": "Complain all you want about Willis's posturing and the rabbit-in-the-hat ending (predicated as it is on a vast plothole), the film is still a rarity, a studio horror movie focused on a child's traumatic stress."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "",
      "link": "",
      "rate": "50",
      "content": "At least tries to disturb us, rather than shock us or gross us out, and that is admirable. But it doesn't pull it off, and the movie is indicative of the trouble Hollywood has these days making that most frightening kind of movie -- the kind that lets the audience frighten itself."
    },
    {
      "publisher": "Salon",
      "author": "Charles Taylor",
      "link": "https://www.salon.com/1999/08/06/sixth/",
      "rate": "30",
      "content": "Because the movie never fully engages us, it never quite manages to allay our queasiness about watching the boy's distress."
    }
  ],
  "errorMessage": ""
}