{
  "imDbId": "tt0167404",
  "title": "The Sixth Sense",
  "fullTitle": "The Sixth Sense (1999)",
  "type": "Movie",
  "year": "1999",
  "items": [
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1516950",
      "warningSpoilers": false,
      "date": "8 November 2006",
      "rate": "9",
      "helpful": "136 out of 152 found this helpful.",
      "title": "Still Very Good Even When You Know The Ending",
      "content": "This was hyped big-time when it came out and, if memory serves me, was a good conversation piece among those who saw it at the theater.I didn't see it for a few years afterward, on tape and now on DVD. It was very good but I didn't find it as \"the greatest movie ever\" as some did. It is an involving story, however, and I've come to appreciate it more with multiple viewings. I've seen it three times, the last one looking for mistakes to disprove the surprise ending....but couldn't find any. The filmmakers covered their tracks. However, a couple of scenes were misleading. Those who have seen this movie know what I'm talking about. For those who haven't, I'm not going to spoil it here.I enjoyed both Bruce Willis and Haley Joel Osment as the two leads. Willis has had many action-packed, profane macho roles in his career but I like him best when he's low key, as he is in here (and in \"Unbreakable,\" to name another fairly-recent movie) The story is slow-paced but it sure is not boring. In a way, it's nice to see a slower-paced film be a big hit, as this was.Osment, meanwhile, is a terrific child actor, as he has proved in other films. He's simply one of the best of his young generation. He and Dakota Fanning are the two best child actors I've seen in many years.This isn't just some supernatural-horror movie. It's a nice human interest story. There is one scene late in the movie in which Osment's mom is having a talk with her young boy in the car. It is an extremely touching scene that brings tears - a great moment in the film."
    },
    {
      "username": "rooprect",
      "userUrl": "https://www.imdb.com/user/ur2904674",
      "reviewLink": "https://www.imdb.com/review/rw3079059",
      "warningSpoilers": false,
      "date": "1 September 2014",
      "rate": "8",
      "helpful": "32 out of 33 found this helpful.",
      "title": "Even if someone spoiled the ending for you, it's still worth seeing",
      "content": "There are over 2000 IMDb reviews for \"The Sixth Sense\" so I don't think I can add anything that hasn't already been said. But in case someone has already spoiled the ending for you (like some dumbbutt did for me and the entire office back in 1999, causing me to avoid this movie for 15 years), never fear... it's still VERY MUCH worth watching.The cool twist is, of course, the main punch of this film. But it's the kind of film you have to watch twice. Once for the story and once for the poetry. So to all my fellow film lovers who happen to have friends & coworkers with big mouths, this film is still a real treat on a poetic & artistic level.M. Night Shyamalan is one of the few directors who deserves the hype and popularity he gets, at least for this film (I haven't seen any of his others but soon will). Everything is meticulously planned, every camera movement, every shadow, every color and every editing cut, almost to the point of obsessive mania. In the DVD extras he and his crew explain why they did everything the way they did; for example they do a lot of long takes because their philosophy was that rapid cuts tend to disrupt the viewer's thought process. So instead of showing a dialogue between two people in a volley of closeup cuts, the scene is done with 1 camera filming them from the side, slowly, almost hypnotically moving between both of them as it gets closer over the course of perhaps 2 minutes.I could go on for ages about such scenes, but you probably get the point. If you enjoy the classic directors known for their careful & deliberate approach to filmmaking, directors like Orson Welles (\"Citizen Kane\"), Otto Preminger (\"The Man with the Golden Arm\"), Kurosawa (\"Seven Samurai\") or even the younger crop of great directors like Steven Soderbergh (\"Traffic\") and Alfonso Cuarón (\"Children of Men\"), you definitely have to check out this movie and other works of Shyamalan."
    },
    {
      "username": "kylopod",
      "userUrl": "https://www.imdb.com/user/ur0556667",
      "reviewLink": "https://www.imdb.com/review/rw1257205",
      "warningSpoilers": true,
      "date": "31 December 2005",
      "rate": "10",
      "helpful": "325 out of 358 found this helpful.",
      "title": "An appropriate spoiler-free review",
      "content": "The surprise ending to \"The Sixth Sense\" has gotten so much attention that it threatens to overshadow the film. I occasionally hear people say things like the following: \"The 'twist' was so obvious that I figured it out in the first five minutes!\" Some of those people may even be telling the truth. There's no way to know. But there's a lot of condescension in such remarks, an implication that anyone who didn't figure it out must be a really dumb sucker. At least in my case I have an excuse. When I first saw this film back in early 2000, I knew nothing about it other than that it was about the relationship between a psychiatrist played by Bruce Willis and a child with some sort of psychic power. I didn't even know what that psychic power was, and an early scene led me to think it was telepathy. In short, I had no idea even what the movie's subject was until about the middle of the film, so I was completely adrift as to solving the movie's mystery.Still, to anyone who did figure the secret out quickly, I have this to say: you may be smarter than I am, but that does not make this a bad movie. Hitchcock went to great lengths to keep the ending to \"Psycho\" from leaking out. Many people who watch that film today figure the twist out (probably because it has been imitated in countless thrillers since then), but the film is still a classic that holds up well today. Surprise endings are, ultimately, just clever contrivances, extra layerings on the cake. They do not constitute the difference between a good movie and a bad movie. A movie must work on its own terms before springing a surprise.Nevertheless, there can be no denying that the twist in \"The Sixth Sense\" is particularly clever. It's no virtue if a twist is impossible to predict. It is just as important that the twist be logical as that it be surprising. Plenty of thrillers feature twists that are arbitrary, where the plot fails to provide enough hints. Even a clever thriller like \"Fight Club\" requires a bit of a stretch to accept the ending. What makes \"The Sixth Sense\" impressive is that it never cheats by suggesting that earlier scenes were imaginary. Everything we see is real, and only our assumptions fool us. If, however, you weren't fooled, all the better: just because you figure out the magician's trick does not make it a bad trick.Consider what appears to be happening in the film. Willis plays a psychiatrist who has received accolades for helping children with problems. We see a romantic evening with him and his wife at home. Then he gets into an ugly, violent confrontation with a former patient. Willis believes he has failed, and he wants to make amends by helping a new child (Haley Joel Osment) who appears to be having the same problems (and perhaps the same abilities) that his former patient once displayed. But just as he thinks he's making progress with Osment, his marriage seems to be falling apart. His wife isn't talking to him, and is beginning to see another man.However these events may be reinterpreted by what is revealed later, the movie is effective because it works on this basic level. In a key scene, Willis asks Osment what he wants most, and Osment answers, \"I don't want to be scared anymore.\" It is not always clear that Osment is really facing a mortal threat. But because the movie establishes that he is undergoing a scary experience, by the time the movie reveals what it is that is frightening him, we have our emotions invested in the character, and the terror is very real to us. This is a step that most horror films neglect, the recognition that the most powerful fear may be the fear of fear itself.When I was a teenager, I assumed that all good horror films had to have an R rating. Even as an adult, I was surprised that a movie as frightening as \"The Sixth Sense\" received only a PG-13. In hindsight, however, most of my favorite horror films, whatever their rating, have relatively little violence. Like all good horror films, \"The Sixth Sense\" allows the suspense to build and does not rely on either excessive violence or cheap scares. The ending adds an additional level of intrigue, but it is not necessary to one's enjoyment during the first viewing. Still, if you have not seen the film by now and remain woefully ignorant of the surprise lurking in its plot, I urge you, before someone ruins it for you, go and watch the movie!"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2457159",
      "warningSpoilers": false,
      "date": "11 July 2011",
      "rate": "10",
      "helpful": "39 out of 49 found this helpful.",
      "title": "Brilliantly crafted and well worth seeing....unless some idiot told you THE secret!",
      "content": "I am making 100% sure I don't in any way reveal the surprise twist in this film--too many have and I think those people are evil. So, if you know THE twist, you'll probably not enjoy the film nearly as much when you first see it. But, if you haven't, it's a heck of an enjoyable film.Haley Joel Osment delivers a truly amazing performance considering his age. He is THE reason the film works as well as it does and I wish the Oscar folks had given him some sort of special award to honor his great work. And, in addition, I can't believe I am saying this, but Bruce Willis and the director, M. Night Shyamalan, were at the top of their game as well. The other huge star here is the writing--and it was superb because it was so original, creative and the story bears many repeated viewings as each one reveals yet another layer of complexity.By the way, while nominated for six Oscars, the movie somehow won none. Instead, the darkly cynical \"American Beauty\" carried off five of the trophies--though I really didn't think this winner was nearly as good a movie. Good, yes...but not great like \"The Sixth Sense\"....provided some moron didn't tell you THE secret."
    },
    {
      "username": "Xophianic",
      "userUrl": "https://www.imdb.com/user/ur0097753",
      "reviewLink": "https://www.imdb.com/review/rw0586928",
      "warningSpoilers": false,
      "date": "3 February 2000",
      "rate": "9",
      "helpful": "47 out of 55 found this helpful.",
      "title": "One of the best films of 1999!",
      "content": "I am embarrassed to admit that the only reason I saw THE SIXTH SENSE when I did was because THE BLAIR WITCH PROJECT was sold out. I hadn't seen BLAIR WITCH yet but I heard great reviews, and of course it was sold out when I went to see it. So my friend and I decided to see THE SIXTH SENSE instead. Not only did it turn out to be a better movie than BLAIR WITCH is, but it turned out to be one of my favorites.THE SIXTH SENSE is about an award-winning child psychologist Dr. Malcolm Crowe (Bruce Willis), who is depressed because one of his former clients committed suicide because Crowe was unable to help him. Cole Sear (Haley Joel Osment) is a child that has social problems frighteningly similar to Crowe's old client, so Crowe decides he will try to help this child in order to find redemption. Cole later reveals that this problem goes well beyond normal social problems. He claims to be able to see the ghosts of dead people, but no one else can.The acting in THE SIXTH SENSE was superb. Olivia Williams does well as Anne Crowe, Willis' depressed wife, and Toni Collette does a great job as Lynn Sear, Osment's loving mother who is very concerned for her child. I think that Bruce Willis is at his very best in this movie, and I happen to be a fan of Willis. But I think that Haley Joel Osment stole the show. He did an amazing job, expressing more combined emotions that most adult actors have to deal with. He is definitely the best child actor I've ever seen, and I am glad that Bruce Willis let him have the spotlight.The plot is very entertaining, though at times you may wonder where it is going. The ending is the best part of the movie, and it completely changes whatever you originally thought of the whole story line. I applaud the advertisers of THE SIXTH SENSE for not leaving a trace of the surprise ending in the previews of the movie (unlike DOUBLE JEOPARDY) and I certainly will not give it away in this comment. But I will say that it will completely surprise most all of you. (I think many that say that they saw it coming are probably lying.)THE SIXTH SENSE is one of my favorite movies, and I think it is surely one of the best films of 1999. I hope it wins many Oscars this year, and I recommend that you go out and buy this movie now."
    },
    {
      "username": "indianajonze",
      "userUrl": "https://www.imdb.com/user/ur0278021",
      "reviewLink": "https://www.imdb.com/review/rw0587002",
      "warningSpoilers": false,
      "date": "23 March 2000",
      "rate": "10",
      "helpful": "354 out of 422 found this helpful.",
      "title": "Brilliant",
      "content": "The Sixth Sense is a brilliant film, plain and simple. It is unique in that it relies on imagination and psychology to scare you and make you think twice about the world around you. The director did a fabulous job constructing the imagery of the film, and I genuinely did not know about the ending until it was revealed. Quite a shock! The Sixth Sense goes in my book as the single greatest psychological horror film I have ever seen. Anyone who bashes it are simply not giving it a chance or don't fully realize the complex dialog and imagery around them. Brilliant"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3312437",
      "warningSpoilers": false,
      "date": "7 September 2015",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "one of the greatest reveals of all time",
      "content": "Child psychologist Malcolm Crowe (Bruce Willis) celebrates an award win with his wife Anna (Olivia Williams). Deranged ex-patient Vincent Grey (Donnie Wahlberg) breaks in and shots Malcolm. Vincent then commits suicide. The next fall, Malcolm is treating distressed Cole Sear (Haley Joel Osment) who lives with his single mom Lynn (Toni Collette). His suffering leaves him an outcast at school. After another episode leaves him in the hospital, he tells Malcolm his secret that he \"sees dead people\".This is one of the best reveals in movie history. It's not simply a shocking twist. Anybody can write a random twist that aims to shock people. This twist is well-planned and constructed from the first moments of the film. Shyamalan lays out not only clues but the right amount of clues. It is a twist that people are unlikely to foresee but then beat themselves for not forseeing it. He gets the perfect balance.The other question is whether this is a good movie without the twist. The great thing is that the intensity does not rely on the twist. HJO has the perfect wise innocence quality. It has great creepiness. It's a traditional ghost story and a well made one. The intensity ramps up as the ghosts reveal themselves. This would be one of the great horrors even without the twist."
    },
    {
      "username": "Steve Steckel",
      "userUrl": "https://www.imdb.com/user/ur0561889",
      "reviewLink": "https://www.imdb.com/review/rw0587369",
      "warningSpoilers": false,
      "date": "25 October 2000",
      "rate": "",
      "helpful": "257 out of 283 found this helpful.",
      "title": "The most careful attention to detail",
      "content": "What makes this film so wonderful to watch is not simply the acting, or the terror it instills, or even the plot itself. It is the way in which the writer/director M. Night Shyamalan takes his vision from the page, and carefully crafts a tale that completely absorbs the viewer. As a result, we are treated to a wealth of emotion: fear, sadness, joy, confusion, and humor, each one a compliment to the other.Haley Joel Osment delivers, plain and simple. By now, so much has been said about the young actor that any more would be repetition. Needless to say, his portrayal of Cole Sear is remarkable. His ability to communicate, through a simple look or gesture, the depths to which his character's soul has been thrust is what truly carries the film. He succeeds at this task beautifully, convincing us while never going over the top; indeed, by the time Cole utters his now-famous line, you not only believe him, you are chilled by the fact that Osment the actor may actually believe it himself.Bruce Willis turns in a stellar performance, complimenting his young co-star while never overshadowing him. It is a tribute to his respect of the material in so much as he fine tunes his delivery to seem reserved, yet not too toned down.The Sixth Sense is more than simply a wondrous two hours. It has, in effect, created a new genre of filmmaking... the film is neither drama, nor horror, nor action. Rather, it is a seamless blending of all three, a film that encompasses the best aspects of each genre, without being limited by the worst. Hollywood has taken notice of this, and one can only expect a series of poor imitations to follow. But at least they'll always have The Sixth Sense to guide the way."
    },
    {
      "username": "Brogan",
      "userUrl": "https://www.imdb.com/user/ur0090091",
      "reviewLink": "https://www.imdb.com/review/rw0587682",
      "warningSpoilers": true,
      "date": "3 August 1999",
      "rate": "",
      "helpful": "55 out of 75 found this helpful.",
      "title": "A surprising masterpiece!",
      "content": "Sometime Bruce Willis can make some bad films, like HUDSON HAWK and MERCURY RISING. And other times he can make some films that change the film industry and blow the audiences away (i.e. DIE HARD triology, 12 MONKEYS, and PULP FICTION). Now Willis' new film, THE 6th SENSE falls in the latter catageory, as a surprising masterpiece that will leave images stuck in your mind for quite sometime. Willis plays Malcolm Crowe, a child psychologist, who is quite good at his job, he has a loving wife named Anna (played by the beautiful Olivia Williams), and he just got awarded by the mayor of Philadelpia for his excellent work. Then one night, Malcolm gets a terrifying unexpected visit from one of his former patients. The visit is so terrifying, that it haunts Malcolm later on. Months later, Malcolm's job is going downhill, and his marriage is falling apart. Then his life is changed around when he meets Cole, a eight year old boy who is considered a \"freak\" by everybody but his mom. Cole is usually alone, scared, and has cuts and bruses on his body. The doctors and social workers think the injuries come from his mom, Lynn Sear (Toni Collette). But Lynn loves Cole too much that she wouldn't even think of harming him. The truth is that the injuries that Cole has are from other people, people that Cole only sees, people that are dead. Cole sees dead people walking around with the living, and only Cole sees these ghostly figures. Malcolm tries to help Cole with his unique gift, and to also find out what these ghostly figures want with him. When I saw the trailers for this movie, it looked like a o.k. movie. Acutally, the preview didn't have any effect on me at all, as for seeing this film. But when I saw this film, I was blown away on how excellent this was! This is a highly entertaining film that is scary, sad, funny, and even touching. The plot is brilliant, it has intellegence, and shows the personalities of the characters well enough that you feel like that you know them after the movie is over. The acting is also great, Willis does a good job as the doctor trying to help poor Cole. Toni Collette is also great as the suffering mom who's very worried and protective over Cole. Oliva Williams is good as well as the suffering wife of the doctor who feels that she's losing her husband more and more everyday. But the real surprise is Haley Joel Osment, who plays the little boy, Cole. For a child actor he's excellent! He shows potential to becomming a great actor in years to come. He's the next promising child actor that will hopefully do well like Elija Wood and Anna Panquin. Overall, THE 6th SENSE took me by surprised, and I ended up loving this film. I would have to place this film as one of the best films of the year, as well as for the summer films. And for a PG13 rated film, it's quite scary! This is one film that no one should miss!!! ***** (out of five)"
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw8183603",
      "warningSpoilers": false,
      "date": "28 May 2022",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Unforgettable ghost story",
      "content": "A horror movie with an inventive premise, a sensitive marital drama, and a psychological puzzler; \"The Sixth Sense\" combines all of these into a deeply affecting movie. Haley Joel Osment (in a justifiably star-making turn) personifies child trauma, and his pain is absolutely heartbreaking. But this is also peak Bruce Willis working with a clockwork script and expert direction. The performances in this film are exceptional.Over the years I've made the mistake of reducing \"The Sixth Sense\" down to its twist ending (which, to be fair, is electrifying) but that is a gross underestimation on my part. There is far more to it than that, and it holds up admirably after so many years."
    },
    {
      "username": "NpMoviez",
      "userUrl": "https://www.imdb.com/user/ur69508929",
      "reviewLink": "https://www.imdb.com/review/rw5060463",
      "warningSpoilers": true,
      "date": "15 August 2019",
      "rate": "10",
      "helpful": "24 out of 29 found this helpful.",
      "title": "The reason why everyone loved Shyamalan back then!!",
      "content": "Shyamalan at his very best! I said it, I don't care what people think. Many people claim Unbreakable to be his best film till date, but for me, as much as I love Unbreakable, The Sixth Sense will always remain as the best Shyamalan had to offer.Good : It's his masterpiece. Shyamalan has never been better. What does it not have? Emotions, drama, character development, storytelling, great writing + directing, all of it. Willis does a really good job. It is perhaps the first time I saw him in a role like this, one of the best examples of casting against type. The arc of the child played by Osment and that of Willis have been given full justice. Seeing them help each other overcome their problems and fears in the way they did was very good. There are some emotional moments which hit the right notes, all because we have known the characters very well. We get a happy ending for the kid, and while expecting something similar for Willis, we get the infamous twist. The first time I watched it, I was blown away. It feels kind of obvious having it watched so many times now, but man was it incredible! Bruce was dead all the time. This made me analyze some parts. Bruce died with the bullet on his abdomen, and in a scene where he is getting out of a flower shop seeing his wife with another guy, he is clutching the exact place where he was hit. And in every scene after he was shot, his interactions with his wife feel and are obviously him talking to her, but her talking to herself. For a first few views, it is unnoticeable. And, it doesn't even feel that way. Also, Willis is not interacting with physical object. What I thought of a plot hole in the first few viewings were actually genius writing and directing. And I would also like to talk about the horror aspect. It's something I call genuine horror. There are creepy stuff going on and you don't know what is actually happening. It's not a horror movie but has got the elements perfectly. And of all the emotional parts, the final moments after the twist hit perfectly. I wonder why this wasn't an Oscar worthy film.Bad : Not necessarily bad about the film. But Shyamalan was called the next Spielberg after this film. His next great film was Unbreakable, followed by Split. Split was good, but nowhere near the former two, which was leaps and bounds better than Signs and Glass. And besides these, I don't even want to name the rest of his disasters. I still think he can make real good films, but comparing most of his films, I sadly feel that he was no Spielberg but just a one hit wonder.Conclusion : It's the greatest Shyamalam film ever. Unbreakable is a close second. Those who think Shyamalan didn't have any potential must watch this. It is just that Shyamalan must have stayed this way. Also, any thriller fans out there? Watch this immediately, if you haven't watched it.Rating.Score : absolute 10/10Grade : A+"
    },
    {
      "username": "undersky",
      "userUrl": "https://www.imdb.com/user/ur23762506",
      "reviewLink": "https://www.imdb.com/review/rw2359046",
      "warningSpoilers": true,
      "date": "27 December 2010",
      "rate": "8",
      "helpful": "899 out of 935 found this helpful.",
      "title": "A movie with a gentle but long-lasting impression.",
      "content": "The Sixth Sense enjoys being playful with our imagination. What your eyes see is not exactly what it is. What your mind paints is not exactly what there is. In the world of The Sixth Sense logic is your worst enemy.There are obvious (and sometimes less obvious) hints right in front of you but you don't grasp them because of your preconceptions and premises. I once read a novel called 'Somewhere carnal over 40 winks' which used similar techniques found in this movie, but in writing. I'm sure you will enjoy this book as much as I did, if you like to be intellectually surprised.If you haven't seen this movie, don't read reviews and don't talk to your friends who have already seen it. The movie is very much susceptible to spoilers. It is suffice to say that the ending is just shockingly delightful.I don't consider this movie heavily philosophical or thought-provoking. Having said that, it is one of the movies I love to watch again and again."
    },
    {
      "username": "WCS02",
      "userUrl": "https://www.imdb.com/user/ur0175872",
      "reviewLink": "https://www.imdb.com/review/rw0587793",
      "warningSpoilers": true,
      "date": "6 August 1999",
      "rate": "8",
      "helpful": "104 out of 148 found this helpful.",
      "title": "Wanna See Dead People?",
      "content": "\"I see Dead People!\" Sixth Sense is well worth the ticket price. It's a tight story and the acting is outstanding. There are a couple of good scares, rendered more effective because I dropped my guard. My sixth sense says such was the Writer/Director's express intention. :-)It's a ghost story yet doesn't rely on special effects and computerization to chill your bones as the Haunting tried to do. The scares come from the sliver of possibility \"what is happening may be true.\" Well that, and the dropping your guard thing.Everyone in the cast is outstanding. Bruce Willis is at his best since Die Hard and The Last Boy Scout. His patient is 33 years junior to him ( played by Haley Joel Osment) is outstanding. Truly. I was mesmerized by his ability to get into this \"sixth sense\" possessed character. Malcolm and Cole helping each other resolve their problems occurs with good chemistry, and is believable, despite the heights you have to take your mind to believe the story's premise. I am sooo tempted to give clues on when to grip the one you're with or arms rests a little more tightly; but alas, cannot in good conscience (or for fear of hate mail!) And out of respect for M. Night Shyamalan for a very good script and story thesis.Summing: if you're \"only\" looking for the Chill Factor, take in Blair Witch over this one for those final 10 minutes. The reality factor is stronger, both despite and because of the low budget factors. But if you want to see one of the best Hollywood manufactured horror films in a long time, give Sixth Sense a chance. I enjoyed it."
    },
    {
      "username": "jayp-5",
      "userUrl": "https://www.imdb.com/user/ur0507115",
      "reviewLink": "https://www.imdb.com/review/rw0588401",
      "warningSpoilers": false,
      "date": "4 December 1999",
      "rate": "",
      "helpful": "453 out of 495 found this helpful.",
      "title": "A movie that will not be outclassed in its genre for years to come",
      "content": "When I first saw The Sixth Sense, I didn't know what to expect. I guess I was looking forward to a good scary horror flick. I was very surprised. I found that the purpose for this movie was far greater than just trying to scare the audience. I found this movie was showing not only the emotions of fear, but also faith, commitment, sadness of loss, and love. The end was so surprising, I had to see it again. The second time I watched it, I did it from a totally different perspective (this is a very rare quality for any movie), and I enjoyed it just as much, or maybe even more. I also, as many viewers have, tried to detect fallacies in the story. I couldn't find one. In addition, for those that appreciate great soundtracks, the music only helps to heighten the experience of the movie. I believe that a great movie is one that helps the viewer perceive life and the world differently. The Sixth Sense is one of those extraordinary movies that does that to me. This movie reflects on some difficult subjects that will make the viewer walk away asking eternal questions. Questions about death, about letting go, about eternal love and commitment, about the love between parent and child, and between husband and wife. Maybe I read too much into this very wonderful film, but I believe it will be difficult to find a movie that has touched on these subjects so poignantly and so well for years to come."
    },
    {
      "username": "finding-something",
      "userUrl": "https://www.imdb.com/user/ur7021939",
      "reviewLink": "https://www.imdb.com/review/rw1321984",
      "warningSpoilers": false,
      "date": "22 March 2006",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "A Masterpiece",
      "content": "A perfect balance. Sad, but not self-pitying. Triumphant, but not cheesy. Frightening, but never grotesque. Shocking, but not gimmicky. Touching without being cheap. Visually it is stunning. There are some truly amazing shots, the attention to color is appreciated. Haley Joel Osment as Cole is extraordinary. What a promising career ahead of him. Bruce Willis, as a workaholic child psychologist, ought to be extremely proud of this, as it may be some of his best work. Tender, brooding, regretful, determined. Perfect. Toni Collette, is really phenomenal. I think she gets overlooked, but with any less talented actress, the film would have certainly suffered.I watched this film again recently, absolutely certain I would have lost some of the awe I had for it since last watching it on the big screen seven years ago. I was pleasantly surprised. It was just as moving, eerie, and beautiful. An obvious top five film of all time for me. Quite the freshman effort from Mr. Shayamalan."
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1012462",
      "warningSpoilers": true,
      "date": "2 February 2005",
      "rate": "10",
      "helpful": "20 out of 29 found this helpful.",
      "title": "It's all in the ending",
      "content": "Cole (Haley Joel Osment) is a young boy troubled by an affliction, he can see the dead all around him, for much of the time and he is labelled a freak by everyone except his mother. Haley Joel Osment puts in such a fine performance in this role, it is hard to believe he is a child.Malcolm Crowe (Bruce Willis) is a highly acclaimed child psychologist, who's relationship with his wife is in trouble and his ability in his profession is diminished as a result. A different role for Willis, but he proves he doesn't have to be all action all of the time, with his remarkable performance.Crowe becomes Cole's therapist, and is faced with personal demons from a previous patient of his, a very similar patient to Cole, and Crowe has to figure out how to help him, however horrific the truth is.M. Night Shyamalan both wrote and directed this movie, and he helps provide an Ora that is extremely tense and spine chilling throughout.All in all the movie was very good in every way and would have scored 7 or 8 as a supernatural thriller, but then came the ending, well it's more of a revelation. It is simply wonderful, and you will want to see the film again, to find out exactly how they hid it from you, and the fact is they hid it well and didn't cheat in the slightest.10/10"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2544757",
      "warningSpoilers": false,
      "date": "6 January 2012",
      "rate": "10",
      "helpful": "18 out of 27 found this helpful.",
      "title": "Shyamalan's best film and the only film of his I consider a masterpiece",
      "content": "I have to say I am not a fan generally of M Night Shyamalan's films, but I absolutely loved The Sixth Sense. It is a beautifully made film with an afterlife that is anything but angels and harps, and the score has lots of subtlety and atmosphere to it. The script is chilling, intelligent and poignant and the story complete with a knockout twist ending(easily the best and only wholly believable ending of Shyamalan's movies) is simplicity at its finest. Shyamalan's direction is wonderfully controlled, which is exactly what the story needed. Haley Joel Osment gives perhaps his best performance here, though he's superb in AI too, while Toni Collette plays the troubled mum very convincingly and Bruce Willis is suitably quiet and reflective. Overall, a wonderful film and Shyamalan's best by a mile in my opinion. 10/10 Bethany Cox"
    },
    {
      "username": "Spirit-2",
      "userUrl": "https://www.imdb.com/user/ur0011817",
      "reviewLink": "https://www.imdb.com/review/rw0588417",
      "warningSpoilers": false,
      "date": "10 December 1999",
      "rate": "10",
      "helpful": "297 out of 348 found this helpful.",
      "title": "Incredible",
      "content": "The Sixth Sense is one of those films that rarely happens these days. In other words, I knew so little about it before sitting in the cinema that it wasn't ruined before it started.I don't want to ramble on about it so I'll just say... absolute perfection. An incredible story that had me and my friends gripped from start to finish. The twist in the tale was totally unexpected as well.After it finished we sat through the whole of the credits and talked about how fabulous it was. If only more films were like this. I can't remember the last time we did that!Congratulations to all involved in this masterpiece."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw0588703",
      "warningSpoilers": false,
      "date": "24 June 2004",
      "rate": "",
      "helpful": "16 out of 24 found this helpful.",
      "title": "A Film For Thinking People",
      "content": "A child psychologist, played by Bruce Willis, tries to help a troubled boy, played by Haley Joel Osment, who says he sees ghosts. This film could easily have been one of those dreadful fright night horror flicks played for cheap shocks, aimed at a juvenile mind. Instead, the film maker chose to tell a story of fragile human feelings, and hidden assumptions. \"The Sixth Sense\" thus appeals to a more mature audience.This film is carefully constructed, and deliberately slow, so that we can absorb the excellent cinematography, and have a chance to find clues that will help us avoid preconceived ideas. But our assumptions are hard to overcome, and most of us are headed for a surprise ending, an outcome which is made possible as a result of superb film editing.And the acting is well above average. I would not have cast Willis in the role of the fatherly psychologist, but he is more convincing than I would have predicted. Osment's performance is as good as I have ever seen for a child actor. And Toni Collette is totally convincing as the boy's mother. Both Osment and Collette deserved their Oscar nominations.This film may, or may not, have a subtext. I found what could be one, but then I may have been reading too much into the story. Sensitive, thought provoking, and well crafted, \"The Sixth Sense\" is one of the better films of the last ten years."
    },
    {
      "username": "keval",
      "userUrl": "https://www.imdb.com/user/ur0585868",
      "reviewLink": "https://www.imdb.com/review/rw0586945",
      "warningSpoilers": false,
      "date": "14 February 2000",
      "rate": "",
      "helpful": "98 out of 128 found this helpful.",
      "title": "Death, Lfe, Fear and Hope",
      "content": "Review: The Sixth Sense, Director: M. Night ShyamalamAs a film which has undoubtedly caught the eye of the film going world, it was difficult to avoid the surrounding hype and publicity. Luckily most of the people I had spoken to who had seen the film did not spoil the 'twist' at the end, which, although is rather a laboured point by now in reviews, certainly adds to the \"Oh, I see now\" factor.The story revolves around a child psychologist played characteristically by Bruce Willis. I say characteristically, because although his portrayal is quite real, and at times touching, there always seems to be an unnerving 'Die Hard'-ness to his speech, lending the dialogue some comical qualities. Having said that, his overall attempts at revealing the vulnerable and disturbed psyche of his character achieve good results. As the psychologist, he is plagued by a particular event in his professional life which he perceives as his personal failure, and sets out to redeem himself by righting the wrong and wiping his failure from his conscience. This opportunity presents itself to him in the form of Cole Sear, played devastatingly well by Hayley Joel Osment. Cole has a problem, he sees dead people. To the outside world he is seen as a loner, a problem child, and has become increasingly isolated. Hence the need for a child psychologist. Once we have been introduced to these two central players, we are taken on a journey of discovery, as both of these characters in the space of the film will learn a great deal about each other, themselves and human nature.It is this particular point which the film attempts to address so strongly - human communication. That when this breaks down, an inevitable cycle of interpersonal destruction takes course, sometimes irreversible. This is framed within the context of a superbly told ghost story. The sheer truthfulness and honesty with which the concept of fear is expressed by all the characters, is breathtaking. Cole's' experience of the walking dead, appearing out of nowhere, Malcolm's fear of a deteriorating marriage, and Cole's' mother's fear relating to her own existential angst. All of these are played against the backdrop of the often difficult but finally warm relationship between Cole and Malcolm. Eventually, and against the odds, each character displays courage and bravery as they face up to their existential and supernatural fears.There are one or two niggling problems plot wise, but in a film where the overall atmosphere created is one which encompasses death, fear, and finally hope, it is impossible not to overlook incongruencies. Superb direction, acting and ambience lead me to think that M. Night Shyamalan has really succeeded in telling a chillingly touching story about the triumph of the human spirit.February 14, 2000 Harshad C. Keval"
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3603421",
      "warningSpoilers": true,
      "date": "21 December 2016",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "A thoughtful ghost story that became a Hollywood blockbuster",
      "content": "My latest outing to the local multiplex was to see this, the second biggest horror film of 1999 after THE BLAIR WITCH PROJECT. Unfortunately for me, the film had already been ruined partially by trailers, which give away all the key moments of the film. I for one could do without them, as I spent most of the time waiting for the kid to say \"I see dead people\", \"...all the time\" and \"she's standing by my window\". Seeing as these are the best moments of the film, a lot of the impact was softened.Saying that, THE SIXTH SENSE is still an expertly-crafted, entertaining film with some great acting (something lacking in a lot of recent blockbusters), and I'm glad that it's enjoying huge success at the moment - hopefully horror film-makers will turn their minds to something a bit more insightful and psychological rather than the latest gore fest. This is an extremely slow-moving film with no action in it whatsoever, no screaming girls being chased by maniacs, just important dialogue and realistic people in real situations. There are plenty of reasons to watch the film for. When we eventually start seeing the 'ghosts' that Cole himself sees, there is ample opportunity for some chills, and the ghosts themselves are really quite frightening - both in their behaviour, and of course their gory looks. These spooks are of the kind THE HAUNTING remake could have done with.The acting is of the highest calibre, with a relatively unknown cast headed by that great action star, Bruce Willis. Willis turns in his most sombre, thoughtful performance ever, and surprised many people who didn't realise he could actually act. In fact I would say that this the best I've ever seen him - his character is sympathetic, and Willis really does excel himself in portraying a believable, faded and disheartened man. Toni Collette also puts in a good role as the frustrated mother of Cole, and even though she doesn't play a likable character and has a relatively supporting role in the proceedings, she remains a totally believable and understandable character, and the same can be said of Olivia Williams. However, it's Haley Joel Osment who really shines as the star of the piece, and his acting is spot on, conveying a boy totally in fear of his own unnatural abilities, and who labels himself a 'freak'. Thankfully, Osment doesn't get too many opportunities to do 'cute' scenes, which I was grateful for.Aside from the many genuine chills at Cole's revelations that he can see dead people, there are a few too many 'jump' scenes for my liking, where somebody brushes past the camera and somebody screams. A variation on the cat in the cupboard, really. However what seems to be initially an average film is suddenly boosted by the now famous twist in the tale, which really changes your entire perception of the film and makes you think about how clever it was long after the images have faded from the screen. This ending was brilliant, one of the best I've seen, and I should probably watch the film again now that I know the outcome, in order to spot all the clues, as it were. THE SIXTH SENSE may not be the greatest horror film ever, but it's one of the best we've had in a long time."
    },
    {
      "username": "ironhorse_iv",
      "userUrl": "https://www.imdb.com/user/ur34049683",
      "reviewLink": "https://www.imdb.com/review/rw3622714",
      "warningSpoilers": true,
      "date": "19 January 2017",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Have some common sense. Go get the Sixth Sense. It's a horror masterpiece!",
      "content": "According to director/writer M. Night Shyamalan, the idea of making a horror movie about children seeing ghost; first came to him, while watching an old 1990's Nickelodeon show called 'Are You Afraid of the Dark: titled, 'Tale of the Dream Girl\" (1994), directed by David Winning. Hoping to capitalize on that success, he wrote and pitch a similar idea to studios as a kid movie, until rewrites made the script's subject matter, more mature and harder to sell. That's until, the most unlikeable of sources, came to him, looking to buy it, which was Walt Disney Studios. It seem that then-president of production, David Vogel read Shyamalan's spec script and instantly loved it. Without obtaining corporate approval, Vogel bought the rights, despite the high price tag of $3 million and the stipulation that Shyamalan could direct the film. While, Disney later dismissed Vogel from his position at the studio, and apparently show little confidence in the film value, by selling the production rights to Spyglass Entertainment, while retaining a few distribution rights and 12.5% of the film's box office receipt. They still greenlit the project and gave their share. Lucky for them, the film was the biggest jackpot gamble win of all time, becoming one of biggest box-office hits of the 1990s. The reasons, why everybody loves it, are very clear. The film's chilly astrosphere, acting, and unexpected twist ending are some of the best moments, cinema can give you. It was a very memorable movie from a then-unknown director. The story of redemption was also great, with 'Six Sense' telling the story of a once-prideful disheartened child psychologist, Malcolm Crowe (Bruce Willis), dedicated himself, by trying to cure a 9 year old boy, Cole Sear (Haley Joel Osment) from being traumatic by the spirits of the dead. Without spoiling the movie, too much, after watching this film the first time through without spoilers, it is almost impossible to watch it again without seeing obvious foreshadowing, during the second watch. Still, this movie has a lot of rewatch value. I love how the movie has a Hitchcockism/Kubrickism feel to it, as there was a lot of carefully devised storytelling, going on here with the visuals without using too much dialogue. Some great examples are, how the color red was prominent whenever the worlds of the living and the dead came together, follow by visible cold breathing and shivers. Wonderful use of foreshadowing. Added to the tension that is already brought by the wonderful make up effects, sound mixing and haunting soundtrack by composer, James Newton Howard. Another brilliant example of visuals using as foreshadowing, is how everybody's clothes seem heavy wore, their normal hair seem a bit grey/white, and how they barely interact with their surroundings. I like how the filmmaker were very careful, not to spoil the clues of the true state of any of the characters, too much. They were even worry that Cole's iconic, and highly quoted, revealed at the hospital might have spoil the movie for everybody. Lucky for them, most of the audience still, didn't see the twist coming. Another magnificent thing, Shyamalan does well is using reflecting surfaces such as glasses, mirrors, windows, and other reflecting surfaces for a slew of dramatic and thematic reasons. You really get to see, good examples of that, whenever, Malcolm is looking at his depressed wife, Anna (Olivia Williams). Nevertheless, perhaps the best shot in the film, at least for me, was the extreme close-up of the bright silver door knob in the 3rd act with a distorted image of Cole. It was both scary and clear transparent to a positive change. It's great to see, a horror movie, that doesn't end with a downer. Another great use by the director, was the idea of using long take to establish important character relations. We see this, compositional strategy, during the first official meeting between Cole and Malcolm. Not only, does it build a special bond between the two leads, but it gives the impression that Cole's mother, Lynn (Toni Collette) and Malcolm were perhaps are at the end of a conversation about him. Almost tricking the audience. Nevertheless, if they did talk, the dialogue would had been cheesy. As much, as I love, everybody acting, particular Osment. Some of the lines, they were given to say, were a bit silly. A good example of this, was any of the scenes with Lynn and Cole. Seeing them, argue and later, embrace in the car about a Bumble-bee Pen felt a little odd and humorous. It wasn't as intimacy as it should be for me. Still, Toni Collette has said that she was so moved by the emotional resonance of the story while filming, she did not even realize it was a horror film until after its release. Anyway, I think the scenes with Malcolm and Anna, had a more emotional impact on me, than any of the scenes with the Sears interacting with each other. Overall: While, the dialogue writing isn't the best and can be highly spoof by later films. Not even, the awful director cameo by M. Night can hurt this movie. Regardless of what you know, think of M. Night Shyamalan's work since this film. His first horror movie is often viewed as one of the best, and I have to agree. It's worth checking out."
    },
    {
      "username": "Joanna Kelly",
      "userUrl": "https://www.imdb.com/user/ur0516800",
      "reviewLink": "https://www.imdb.com/review/rw0588376",
      "warningSpoilers": false,
      "date": "26 November 1999",
      "rate": "9",
      "helpful": "288 out of 344 found this helpful.",
      "title": "You'll be knocked for six",
      "content": "This is an incredibly powerful film. Awash with emotion but never stooping to sentimentality this is the story of one frightened little boy you will never forget. All your worst childhood nightmares: the noises in the attic, the intruder in your house, that cold breath that makes your hair stand on end are here and then some.Bruce Willis gives one of the best performances of his career as the child psychologist trying to get himself back on track after a violent encounter with a former patient and it would be a crime if Haley Joel Osment were overlooked at coming awards ceremonies for his powerful performance here. It has been a long time since a child actor displayed such maturity in a role. Cole's innocent little face hidden behind his absent father's large-framed spectacles betrays a child coming to terms with a terrifying secret in the only way he can.You don't need to go and see this film again to realise why the end is such a surprise but you will rush out to watch it again purely because it's an almost perfect example of it's genre.Laugh, cry, jump a mile out of your seat, sigh with relief - but not too early... We did!"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6430901",
      "warningSpoilers": false,
      "date": "1 January 2021",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "The Sixth Sense",
      "content": "One of the best psychological horror films that I have seen, the film's story was excellent and interesting, the embarrassment in the film was good, the script and the acting were the best bad in the film, especially the child's acting, which was very impressive, the body of his character with distinction, I could not guess the toast of the end and was dazzled by the great end"
    },
    {
      "username": "Sterling52",
      "userUrl": "https://www.imdb.com/user/ur10266228",
      "reviewLink": "https://www.imdb.com/review/rw1939554",
      "warningSpoilers": false,
      "date": "1 September 2008",
      "rate": "9",
      "helpful": "24 out of 32 found this helpful.",
      "title": "I'm not one to watch a movie twice...",
      "content": "...but I had to watch this one again, right afterward, because I needed to go back and watch for clues. Honestly, and I won't give away the 'ah ha!' moment, but I knew that he was... well, you know, what he was. What I didn't get was how that was possible, or how the interaction with the others that I saw... so I had to go back and watch the movie AGAIN, just to make sure there were no errors in the filming of it. Sure enough, I found none that I could call an error, and was totally blown away with how this was filmed. I am a writer, and I also adapt novels for scripts, and when something like this comes along, that something that just totally grabs me and says, \"This is something special... this is not the ordinary...\" well, I am impressed. I aspire to write something that can really AH HA! someone in this way. I recommend the movie, highly."
    }
  ],
  "errorMessage": ""
}