{
  "imDbId": "tt5074352",
  "title": "Dangal",
  "fullTitle": "Dangal (2016)",
  "type": "Movie",
  "year": "2016",
  "items": [
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw4080935",
      "warningSpoilers": true,
      "date": "4 March 2018",
      "rate": "7",
      "helpful": "9 out of 9 found this helpful.",
      "title": "\"You have to fight in a way that people remember you.\"",
      "content": "Most of the reviewers for this film here on IMDb appear to be folks of Indian background; nothing wrong with that but with most of them offering glowing praise and a '10 rating, it's difficult to get a true perspective on the movie. I thought it was OK, though not a '10' rated film by any means. The picture utilizes a tried and true sports movie formula depicting a rigorous training schedule, a demanding coach and notable accomplishments along the way before the principal character encounters some roadblocks on the way to a Commonwealth Games gold medal. There's also the idea of success achieved by defying conventional thinking, in the way Geeta Phogat (Fatima Sana Shaikh) and her sister Babita (Sanya Malhotra) rise to prominence in the traditionally male sport of wrestling. That's perhaps the film's best takeaway, as the girls in question endured a lot of physical and mental anguish to achieve their goals, thereby serving as role models for other young women to follow.I couldn't help thinking however, that if the setting for this film was present day America, the father (Aamir Khan) might never have gotten past the first month of training his daughters because someone would have turned him in for child abuse. Cutting the girls' hair and restricting their diet would have gotten someone to notice, and Mahavir slapping his young nephew Omkar for some slight was totally uncalled for. It might not have appeared so bad if the man had lightened up his approach from time to time but his expression was always so grim it looked like he was mad at the world. One could say that his style eventually paid off in the end, but the emotional toll on his daughters, especially Geeta, could have been avoided with a more 'fatherly' approach. The one American film this most reminded me of was 1984's \"The Karate Kid\", but without a bully opponent and with national prestige at stake in the tournament matches. The film makers for that earlier movie put together a compelling and entertaining story in just about two hours, The additional forty minutes of screen time in \"Dangal\" is padded by repetitious scenes of training activity in the early part of the story that aren't all that necessary, while others are characteristically set to a musical accompaniment that seems to be a trademark of Hindi films. I did like the realism involved in staging the wrestling matches throughout the story, and the climactic final match was filled with suspense. With seconds to go, one will recall Mahavir's earlier explanation of the point scoring system, fully hoping that Geeta would somehow manage a five point take-down to insure a victory. The fact that this movie was based on the real life story of Mahavir Phogat and his wrestling daughters make it all the more fascinating."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6226151",
      "warningSpoilers": false,
      "date": "1 November 2020",
      "rate": "9",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Wrestle With Your Emotions...",
      "content": "Let this incredibly sincere biopic wrestle with your emotions, let it grab you around the waist and smash you through a glass ceiling like no other, let it hold you in its arms and flip you around until your head is spinning. A truly inspirational story of a family, of Geeta Phogat and her sister Babita Kumari, of their father Mahavir Singh Phogat, of the incredible journey, adventure and experience they undertake in order to achieve something spectacular and profound. With breathtaking performances all round, this is one film that will leave you in awe of the incredible things people can achieve in the most challenging of circumstances - an absolutely astonishing piece of film making."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw3604469",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "10",
      "helpful": "134 out of 185 found this helpful.",
      "title": "Awesome film n wonderful performance by Aamir. Disney n Aamir did a miracle with this film.",
      "content": "I saw this with my family in a theatre. Awesome experience. Aamir's acting, effort n most importantly his passion is what makes his cinema so damn unique. First thing Dangal has going for it is Aamir khan. Aamir khan gave arguably the best performance of his career playing Phogat. He is the best actor in bollywood. Period. He shocked me by his transformation. I myself being a gym trainer knows the effort which goes in such kinda transformation. Without Aamir I don't think this movie could have achieved what it has. The child actors were good too. The music was good. The direction by Tiwari was the best of 2016. This movie was never boring and full credit shud go to the director. The cinematography gave you a feeling as if what you are watching is real. Overall you don't have to like wrestling or know wrestling to appreciate this movie. Its a wonderful movie. The movie is written very well. Superb screenplay n crispy editing."
    },
    {
      "username": "gskrocks",
      "userUrl": "https://www.imdb.com/user/ur13607461",
      "reviewLink": "https://www.imdb.com/review/rw3603730",
      "warningSpoilers": false,
      "date": "21 December 2016",
      "rate": "9",
      "helpful": "167 out of 224 found this helpful.",
      "title": "Aamir is back with a stellar performance of a decade !",
      "content": "DANGAL is a masterpiece. A terrific film that stays in your heart and remains etched in your memory much after the screening has concluded. A brilliant film that restores your faith in Hindi cinema. Actually, it won't be erroneous to state that DANGAL is the finest film to come out of the Hindi film industry in a long, long time and mark my words, it will be remembered as a classic in times to come. It blends drama, emotions, sportsmanship and patriotism extraordinarily the icing on the cake being Aamir Khan's towering act. This rich-in-merits film has a major advantage too -- the holidays ahead Christmas and New Year -- which will ensure a glorious run at the ticket counters. A must, must watch!"
    },
    {
      "username": "ridinbal",
      "userUrl": "https://www.imdb.com/user/ur46163901",
      "reviewLink": "https://www.imdb.com/review/rw3604504",
      "warningSpoilers": false,
      "date": "22 December 2016",
      "rate": "9",
      "helpful": "79 out of 114 found this helpful.",
      "title": "Movie of the year. Its much better than sultan in terms of everything and script here worked out well",
      "content": "\"Direction was superb and Aamir's performance was excellent. A compelling narrative based on true story with a powerful message for women\" My rating- 4.5/5 (Movie of the year and don't miss this flick) Positives- 1.)Direction and screenplay- Direction and screenplay didn't bore us and we were glued to the seats as it was so engaging and entertaining.2.)Aamir khan , Zaira (young Geeta), Fathima (geeta) , suhani (young babitha), sanya(babitha) and fathima (mother)- Everyone's performance was excellent. Amir's hardwork and dedication for this role can be seen through his performance. He once again proved to be Mr perfectionist. All girls who acted as daughters were very good and they portrayed their roles without any problems.3.)Songs and bg score- Special mention for title song. Title song was great and suited the movie well. Hats off to Pritam and he once again proved that he is the best music director of bollywood.4.) Cinematography and edits- Cinematographer captured wrestling scenes very well and edits of certain scenes were good.5.)Strong message for women Negatives- (NO NEGATIVES) Is it a must watch? Yes!!! and watch it in theaters to get the feel.Overall- This is the best Christmas treat for everyone from dangal team. This has Aamir Khan's best performance till date. And the major one is that it has strong message for women. Yes its a must watch movie and don't miss this flick!! My rating- 4.5/5 (Movie of the year and don't miss this movie) For more reviews go to- ridinbal movie reviews. Ridin bal movie reviews has all language movie reviews(Malayalam,English,Telugu,Kannada,Tamil,Arabic,Hindi,Iranian)"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5504574",
      "warningSpoilers": false,
      "date": "23 February 2020",
      "rate": "",
      "helpful": "43 out of 64 found this helpful.",
      "title": "the best indian movie in the history",
      "content": "If I would I've seen this movie in 2016, it certainly would have been in my list of best movies. If you're going to this movie thinking Aamir will be flexing and showcasing his acting prowess then well and good but the girls are the highlight of the movie, hands down. SCRIPT - Major props to bringing out a story which is inspiring and one which India needs right now. The story is kept grounded in reality. No over-the-top gimmicks. The songs blend in very well with the premise. None of the scenes linger on for a long period of time. There was a very natural flow to the story which helped engage the audience for 2 hours and 41 minutes. Even movies like Mary Kom or Bhaag Milkha Bhaag started to drag by the end but hats off to Piyush Gupta and Shreyas Jain. I have said this that dialogue shouldn't seem like dialogue unless it is a musical or a re-imagining of a play. The dialogue in this movie is a lesson as to how dialogue should be used. Little nods and grunts and expressions serve more than an explanatory conversation. I am not a fan of narration and I wasn't really liking it here either. It was fine for the light-hearted scenes but the serious scenes required silence but I can give it a pass. The only scene which felt a bit off is where Mahavir gets locked up in a room before the final fight. If it didn't happen in reality then it was really unnecessary. DIRECTION - Chillar Party was a movie with some serious message but was a little preachy and Bhootnath Returns went full preachy. Nitesh Tiwari toned down that preaching to a very natural level in this movie. Every single topic that has happened or still happens in a family was touched upon. Beginning from the sleaziness of men to child-marriage to the sacrifice parents make, everything was utilised to the advantage of the movie. None of that brought the movie to a halt. The first half of the movie had a good amount of comedy and that gelled into the second half with ease. The thing that many might not notice that there are no pay-off scenes except for the last scene. If the audience reaches a peak before the ending then the pay-off wouldn't have a solid effect, if used multiple times. Pay-off scenes are those scenes where the characters are shown to be doing things in extra slow-motion to have an orgasmic effect on the audience and the director cleverly used it at the end in order to give proper tribute to the art and the character. FIGHT CHOREOGRAPHY - This section needed a category of it's own and quite deservedly. I saw Mary Kom, Sultan and Saala Khadoos which had extensive fight scenes and all of the movies had extremely lack-lustre fight scenes. The camera moved too much in order to cover up the actor/actresses' incapability to fight. In comparison to all those movies, here the camera just followed the fighters. No wide-shots of the fight from the audience's perspective because that allows the stunt double to come in. All the fights had the actresses in the scene and hats off to all of them for their dedication. ACTING - Like I said before, the best performance among some amazing performances was of the newcomer Fatima Sana Shaikh. That said, it will really be unjust to name one performance as the best performance because everyone was amazing in this movie. Aamir Khan, Sakshi Tanwar, Sanya Malhotra, Aparshakti Khurana,Zaira Wasim, Suhani Bhatnagar,Ritwik Shore and Girish Kulkarni gave amazing performances. As Aamir had put on so much weight, that altered his physicality a lot which enhanced his performance to another level. Sakshi Tanwar should be doing more movies. She gave a very subdued and nuanced performance. Sanya Malhotra as the grown up Babita had very few scenes but her eyes spoke when she didn't have any dialogue. Zaira Wasim and Sulhani Bhatnagar were awesome, just awesome. I was in awe how they are able to emote so much at their age. Ritwik Shore and Aparshakti Khurana together made Omkar a memorable character. I think they had some of the best scenes in the entire movie. I wanted to kill Girish Kulkarni after Ugly and after this I still want to kill him and that's a compliment. The side actors who formed the audience and little roles like the Dangal organiser and the guy who had sleazy theatre also gave substance to the movie. FINAL VERDICT - I am sure everyone has seen this movie by now and if you haven't then please do. It's a complete movie and it is very rare to see a complete movie, without gimmicks nowadays. I loved how they had such eye for detail because they gave that damaged effect to Aamir's ear. Many wouldn't notice it but it's great to that they did to provide authenticity to the character and the movie. It's a 10/10 for me and one of the best movies of 2016."
    },
    {
      "username": "dineshprakash",
      "userUrl": "https://www.imdb.com/user/ur34087008",
      "reviewLink": "https://www.imdb.com/review/rw3604502",
      "warningSpoilers": false,
      "date": "22 December 2016",
      "rate": "10",
      "helpful": "85 out of 132 found this helpful.",
      "title": "Ultimate triumph",
      "content": "Director Mr. Nitesh Tiwari work is so brilliant that after few minutes, you just forget that you are watching film. You simply start witnessing the journey of Phogat's family. Makers are so confident that they have even given credit for story idea to Divya Rao, which reflects their honesty. She is not in writing team but gets her due credit. There are four writers, Director himself, Piyush Gupta, Shreyas Jain and Nikhil Mehrotra and their work is fantastic. Screenplay is seamless and very balanced with much needed freshness. Film starts with glimpse of Mahavir Singh Phogat's passion for wrestling, while watching and challenging another district level arrogant winner, while commentary comes over on them which is fresh. When that person gets defeated he says 'Tumne district level pehlawan ko haraya hai' Then Mahavir Singh replies ' Tension mat le, tum national level champion se hare ho'. Words may be a bit different but meaning was same. Which gives strong idea that what level of dialogues you are going to listen and they have maintained the graph. Dialogues just nourish your senses, inducing correct emotions. A simple scene where protagonist massages feet of his sleeping daughter, clearly reflects that he is just not a ruthless coach but a caring father too. Girls curse their father in front of their friend who is getting married, then that girl emotional words about her feeling towards their caring father is very cute, emotional and enough to make girls realize that what they are taking for granted. Best part of this film is it's continues ascending graph in every aspect. First half is cute, funny with subtle dose of emotions. Second half takes this graph to the horizon. Full of emotions, either it is of defeat, victory or relations. Another major plus point is the way they have shown wrestling. I dint know a bit of it but I enjoyed all wrestling matches like it was my favorite game and that is major chunk of film. Hats off to the team behind wresting choreography .Though you have basic idea of film happenings but still they kept you engrossed by presentation. Climax comes with a very strong message that one can train you but only you have to implement the techniques, which makes you true winner and enriches self confident. Performance makes you thunderstruck. Words can not justify or compliment, Amir Khan's performance as Mahavir Singh Phogat. Zaira Waseem as younger Geeta is brilliant. She is so good that when Fatima Sana Sheikh takes over as grown up Geeta, you miss younger one but soon Fatima proves that she has taken the graph far ahead. Same happens with younger Babita played by Suhani Bhatnagar and grown up by Sanya Malhotra. Skashi Tanwar as wife of Mahavir Singh is very good. Girish Kulkarni , who had played coach is superb, you do hate his character but love his performance. Actor, who played younger cousin of Geeta and even grown up one, both actors are cute and endearing. Kudos to casting director Mukesh Chhabra and team. Music by Pritam and lyrics by Amitabh Bhattacharya, are integral part of this film. Without any formulated track you just enjoy every song and your eyes get mois in one too."
    },
    {
      "username": "umashankarpati1997",
      "userUrl": "https://www.imdb.com/user/ur55029940",
      "reviewLink": "https://www.imdb.com/review/rw3604553",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "9",
      "helpful": "95 out of 139 found this helpful.",
      "title": "This is AAMIR KHAN's by far the best one.Finest casting and terrific acting by all.",
      "content": "Aamir Khan shines in the role of Mahavir Singh Phogat. He is so outstanding in his performance that this could be considered as one of his best works ever. The opening scene of the film is just a glimpse of Phogat's passion for the sport – wrestling. The first half of Dangal works exactly like a skilled wrestler – invariably sure of its moves. The film's second half is all about victory. Mahavir's transformation from the once upset father of a baby girl to the most triumphant one to Geeta's string of losses before she finally wins a gold during Common Wealth Games to desi akhara being replaced by wrestling mat – every moment works in contrast to what you had watched earlier. But not even once does the film loses its focus.A word here about Mukesh Chhabra's casting: he has done a tremendous job of the casting. Nitesh Tiwari's direction is amazingly terrific. AmitabhBhattacharya's lyrics are great. Pritam's music is in terrific sync with the mood of the drama. 'Dangal dangal' is a very inspiring song and will soon become a rage. 'Dhaakad' and 'Haanikarak' are also very well-tuned. The 'Gilehariyaan' song has terrific charm of a different kind. Amitabh Bhattacharya's lyrics are great. The song writer may pick up some awards for his lyrics. Bosco- Caesar's choreography is very real. Pritam's background music deserves distinction marks. The actors who play the young Geeta and Babita (Zaira Wasim, Suhani Bhatnagar) do a competent job of maintaining the audiences attention. And both Shaikh and Malhotra carry it forward, especially when they spend a lot of the second half on the mat, learning how to lose, and, above all, to win. Since it encapsulates the historic win of the phogats who bought India glory so it is bound to inspire women. Dialogues are absolute gems. Without being overtly long, they are so effective that they invariably touch the heart before reaching the ears. On the whole, Dangal is not just a movie; it is an experience to be cherished. The film is destined to be one of the biggest blockbusters of Indian cinema.As it content oriented so The movie is both for the single screens as well as for the multiplexes and people of all age can watch.so this movie is a must watch. So I Rate it 10 stars out of 10 because I was thinking movie deserves it.I usually don't rate any movie 10 but This movie \"HatsOff\". Don't Expect a better story than this.Finest piece.Dangal hai yeh."
    },
    {
      "username": "faisalfaves",
      "userUrl": "https://www.imdb.com/user/ur48691639",
      "reviewLink": "https://www.imdb.com/review/rw3604685",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "10",
      "helpful": "69 out of 107 found this helpful.",
      "title": "Very Strong - A Must Watch 10/10",
      "content": "Story: 9/10 A Very True inspiring story of former wrestler champion Mahavir Singh Phogat whose dream is to win a gold medal for India in wrestling. But he fails to achieve that, then He avow that his son will do it. However, he got disappointed when his wife gives birth to four daughters.Music: 9/10 Amazing, Very touching background. Greatly Synced Title track will give you goosebumpsDirection: 9/10 Nitesh Tiwari achieved what he wanted, Got a new name, One of the best directors of Bollywood.Acting: Aamir Khan: 10/10 This time as a father, He will amaze you in every scene. His acting skills are deeply great. Whenever I watch Aamir's movies, I feel his acting. He loves acting and entertaining the world since He came to the Film Industry.Fatima Sana Shaikh: 9/10 Sometimes I still watch Chachi 420, because I love Kamal Hassan. And Fatima Sana Shaikh was the little girl in Chachi 420. Seriously I have seen her after Chachi 420. And after Dangal she will go so far.Aamir Khan and the two lead actress are the best cast roles in a long time, but overall cast done an amazing job.Dangal is humorous and Inspirational Journey."
    },
    {
      "username": "lykansdonnie",
      "userUrl": "https://www.imdb.com/user/ur33993415",
      "reviewLink": "https://www.imdb.com/review/rw4601857",
      "warningSpoilers": false,
      "date": "23 January 2019",
      "rate": "10",
      "helpful": "60 out of 76 found this helpful.",
      "title": "Omg what a great movie.",
      "content": "I watched this because my son wrestles and I didnt know it was a inspirational but also a tear jerker. Never heard of this movie until our wrestling community here in Ohio talked about it. Definitely one to watch!!"
    },
    {
      "username": "KeremUlucay",
      "userUrl": "https://www.imdb.com/user/ur91218613",
      "reviewLink": "https://www.imdb.com/review/rw4601363",
      "warningSpoilers": false,
      "date": "23 January 2019",
      "rate": "8",
      "helpful": "9 out of 12 found this helpful.",
      "title": "MOTIVATIONAL",
      "content": "Dangal has Indian box office record of all time and it deserves it. It is the best biopic Bollywood can make. It has every quality Hollywood biopics have. Cast did an amazing job. Preparing this project as an actor is hard. Aamir Khan's transformation proves that. They brilliantly show us their characters' moods and reactions about every event they have been through. Also, Dangal has great descriptions about public and important social messages. I really respect that. I think it is almost a masterpiece but it miss that by a step. Best thing this movie have is showing us great character motivations and relationships. They made it nicely. Worst thing this movie have is telling wrestling's technical details so superficial. It shows something about that but it doesn't explain."
    },
    {
      "username": "anupapu8",
      "userUrl": "https://www.imdb.com/user/ur26240657",
      "reviewLink": "https://www.imdb.com/review/rw3604795",
      "warningSpoilers": true,
      "date": "23 December 2016",
      "rate": "9",
      "helpful": "9 out of 12 found this helpful.",
      "title": "This Years Best along with PINK",
      "content": "DANGAL - its such a good thing that both PINK and DANGAL , two top movies of this year are women centric. Its such an improvement for Bollywood which doesn't make movies on women because such movies doesn't make money , which is a wrong fact , PINK made almost 300% profit. You just need to make a good movie and it will make you money. And by saying women centric m serious, the character of Mahavir Phogat is not the real hero of the movie , rather its his daughter Geeta Phogat who is in the center of the movie. For understanding what MAhavir Phogat has achieved in his life , we must know the fact that Hariyana is one of the worst state in India for girls. A very low sex ratio and a very low Literacy rate for women. And in such scenario what Mahavir Phogat has achieved is tremendous. That said , one thing is clear that we cant expect anything out of the box which we always get from AMIR's movies like 3 idiot , PK and TALAASH , because its a biopic , so they have to show what actually happened , which is not exactly bad things , in fact what this movie shows is an out of the box real life story. First i would like to mention two things which i don't liked. 1st - The way the wrestling coach of NATIONAL SPORTS ACADEMY has been shown as one sided villain also who is kind of incapable to train , was wrong. 2nd - there was an unnecessary twist in the end which seems unconvincing. Apart from these two things , everything else is either good or great in the movie. The movie tackle through different themes. Sometimes it tackles them one by one , and sometimes simultaneously. But the good thing is that it tackles them convincingly. For example when we see Mahavir training his daughters rigorously , there comes a thought that, what kind of dad he is. He just stole the childhood of her daughters to fulfill his own dreams. But after some scenes on the wedding of Mahavir's daughters' friend both the daughters complaining about Mahavir her friend (who is getting married) reply that she hoped that she would had get such father as Mahavir who thinks about their daughters and wants them to achieve something and not like his own father who force her to marry at the age of just 14 to an unknown person. That particular scene convince the audience that what Mahavir is doing is not wrong as compared to the society where they are living. Another theme which movie showed very convincingly was how free a girl feel when she goes out of his family for the first time. Almost 1 hour of the movie contains wrestling matches. And those matches were done extremely well on technical level , and hook you like you were watching a real match. I mean as compared to this the matches show in SULTAN were just nothing. Among the performances ZAIRA WASIM (also the lead actor of Amir's next SECRET SUPERSTAR) playing Young GEETA was delight to watch. The scene where she request her father to not cut her hair and she will do anything he wants was heartbreaking. And she does her fighting scenes very well considering the fact that the director in an interview has mentioned that ZAIRA was actually the weakest among all the four girls before they start their training. But when it comes to fight scenes , FATIMA SANA SHEIK as the older Geeta was best. She fights like a real fighter and her hard work is visible on the screen. On her dramatic acting front she was awesome too. Both the actresses who played young and old Babita were good too , but got less screen time as compared to Geeta's character. Aparshakti Khurana(brother of Ayushman Khurana) as the nephew of Mahavir has an impeccable timing of comedy , and surly will make you laugh many time. But for Amir Khan , what to say , he blends so nicely , that he became MAHAVIR , and the actor Amir is nowhere visible anywhere. He just makes me wonder why cant other actors (yes pointing at SRK and SALLU) stop-showing their persona and blend into characters in their movies . Around the whole movie there were so many whistle blowing happening , that i was not able to here the dialogues many times. But just before climax , the NATIONAL ANTHEM runs in common wealth games after GEETA PHOGAT won her gold medal(i hope that's not a spoiler) and the whole theater stands in respect of NATIONAL ANTHEM you just cant help and get OVERWHELMED. 9.4/10 by ANuP APu KuMaR"
    },
    {
      "username": "carlvan1977",
      "userUrl": "https://www.imdb.com/user/ur86220066",
      "reviewLink": "https://www.imdb.com/review/rw4695479",
      "warningSpoilers": false,
      "date": "3 March 2019",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "OMG!!!",
      "content": "What just happened?A better karate kid? Amazing movie.Reminds me of what Hollywood use to be."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw7258158",
      "warningSpoilers": false,
      "date": "22 August 2021",
      "rate": "9",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Another great film from Aamir Khan.",
      "content": "\"Dangal\" is the highest grossing Indian film of all time and among the highest grossing non-Chinese films in China. Why? I assume it's because in both countries, women's roles are very traditional and the film celerates women stepping outside the normal female roles and succeeding...a great message of empowerment.The story is about a frustrated man. Mahavir (Aamir Khan) was an Indian national wrestling champion but his father insisted he give up the sport and get a job. As a result, he never had a chance to compete internationally.Mahavir comes up with the idea of him and his wife having a son....and he could teach the son to be a great champion wrestler. But he ends up having daughters. Instead of abandoning the idea, Mahavir decides he'll teach his daughters and make them champions....even though women generally don't compete in the sport in India. So, he has his daughters wrestle boys....and they win.Eventually, his oldest, Geeta, becomes the Indian women's champion and is sent to the national training center. Things do not go well there and Geeta experiences loss for the first time. What will Geeta do? And, what of Mahavir's plans for producing a champion?Aamir Khan has an incredible record and has produced some of India's best films. While I wouldn't say this film is quite as good as his \"3 Idiots\" or \"Like Stars on Earth\", it is an extraordinary film...and I can see why it did so well at the box office. Well made from start to finish and a most enjoyable story.By the way, I was shocked at what Khan went through in order to make this movie. His weight loss, gain and muscle mass is incredible. I was especially shocked when I saw him take off his shirt early in the film...the guy was ripped!"
    },
    {
      "username": "SAMTHEBESTEST",
      "userUrl": "https://www.imdb.com/user/ur50463365",
      "reviewLink": "https://www.imdb.com/review/rw3604433",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "8",
      "helpful": "16 out of 27 found this helpful.",
      "title": "Another Classic from Aamir but this time a Tribute to Mr. Phogat",
      "content": "DANGAL REVIEW :- \"Dear Sam, remember the day 23 Dec 2016 when you watched Best Film ever made on Wrestling.\" This is what my heart said to me after the very first sec i finished watching Dangal. Without wasting time let me elaborate my views about Film. Acting - Aamir Khan does excellent Job, not the Best of the year but surely in top 5. Never saw Fatima before but she was the Best among star cast. Sakshi Tanwar, Sanya Malhotra got limited screen space and gave their Best. Supporting Starcast is good too.Writing - Excellent ! I Don't except better story/writing than this for any Wrestling based film (It was expected due to Biopic Thing).Screenplay - Notable ! It really keeps you hook from the first frame to the last, especially in last 30 minutes.Music - Good but not the Best. Reason is, expectations from Pritam are always high. Not a single Filmy Song, every song is situational so Video Songs looks better than Audio. Background Score is Awesome, helps film in emotional scenes.Cinematography - Average ! Its good actually but Nothing impressive except those Fight sequences. Some scenes are pacy and some are Slow, overall Average. Direction - Nitesh Tiwari at his Best. He has succeeded in Whatever he wanted to present to audience. He is The real master behind this Classic, with any other director it would have become typical Filmy movie but Nitesh kept it strictly as an Art Film which is needful for Biopic like this. In some scenes he loses it, few scenes are too filmy but receives Claps and Whistles so i must say he wanted to keep it Classy but forcefully added some Massy scenes. Will meet him soon and thank him for giving us Classic Called Dangal.Final Words - Dangal is not a Commercial film like PK and 3 Idiots i mean some Massy elements and comedy is missing which is needed for high Repeat Value so i believe this film won't get that High level success which these films got. It is less in Quality compared to Epic Taare Zameen par and less Commercially compared to PK, it misses the Masterpiece Tag just because of few scenes and minuses but it is another 'Classic' by genius called Aamir Khan. He gave 2 years for the film and it worths. Film has many Goosebumps and Emotional moments which you will remember even after leaving theater. It worths your money, it is Best Film of the year among all High Budget Film released so far, i recommend don't miss this film. And last thing don't even think to compare it with Sultan cause it will be like comparing Sachin Tendulkar with Murali Vijay. 8/10* stars by me. And last but not the Least 'A Grand Salute' to the 'Mahavir Phogat and his Family'. True Heroes like him needs to be recognised for their Hardwork in our Country."
    },
    {
      "username": "paulsmithson-192-243826",
      "userUrl": "https://www.imdb.com/user/ur57283446",
      "reviewLink": "https://www.imdb.com/review/rw3604769",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "10",
      "helpful": "25 out of 41 found this helpful.",
      "title": "Had me on the edge of my seat and in tears",
      "content": "It's conceivable that a wrestling movie might have you on the edge of your seat, but who'd have thought it would bring tears to your eyes. Dangal does both in large doses. Right from the opening scenes through to the awesome climax, this is one movie that will keep you glued to the screen. I can't remember the last 3 hour movie (nearly) where absolutely nobody took a toilet break apart from in the intermission.Everything about the movie is superb from the cinematography through to the script writing. The movie is superbly directed and there are so many stellar acting performances that it would be unfair to single anyone out.One thing about sports movies is that the action can often seem staged, but the fight sequences in this movie are superbly done and brilliantly filmed.Everyone knows an AK movie is going to be great, and this definitely doesn't disappoint.A must watch."
    },
    {
      "username": "hsm2310",
      "userUrl": "https://www.imdb.com/user/ur11260345",
      "reviewLink": "https://www.imdb.com/review/rw3604974",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "9",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Dangal is very special. Ultimate mix of technical film making and popular cinema",
      "content": "Dangal (9/10) is the kind of film for which the 70mm medium exists. It has universal appeal, is technically brilliant and more than anything else it is a film that skillfully balances popular sentiments and realism. It is going to reach tens of millions of people without having compromised the quality of storytelling.An extraordinary story of some extraordinary people who not only conquered their fears but also a society which had the negativity to kill their dreams even before they were born.If Chak De was a fine example of exemplary editing in a sports film and Pan Singh Tomar was an exceptional sports film with great depth and realism, Dangal would forever be remembered as one of the best Indian sports film for the sheer reach it will have. Wrestling is a fast paced technical sport. To make the whole thing look as authentic as it has looked in the film, it would have required some meticulous planning and extensive training and they have done it really well.The fact that you feel the frustration that Mahavir Singh Phogat feels in the final scene and you along with the whole audience begins to clap after each of Geeta's winning bout as if there was a live game at display shows how supremely engaging the film is. One negative, though not significant enough to harm the film is that it has over dramatazied the narrative at the cost of slight misrepresentation of the facts.Only if the majority of Indian film makers could realize that it is not impossible to make good cinema with popular appeal, we would start getting more than just a couple of Hindi films every year worth watching. Now is a good time to list Top Films from India in the Sports/Drama genre: 1)Paan SIngh Tomar 2)Dangal 3)Chak De India 4)Iqbal 5)Jo Jeeta Wohi Sikander 6)Lagaan 7)Bhaag Milkha Bhaag"
    },
    {
      "username": "maulin5",
      "userUrl": "https://www.imdb.com/user/ur55607018",
      "reviewLink": "https://www.imdb.com/review/rw3605137",
      "warningSpoilers": false,
      "date": "24 December 2016",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Bhed Ki Haahakaar Ke Badle Sher Ki Ek Dahaad Hai Pyaare- Dangal!",
      "content": "Aamir Khan is back after 'pk' as a wrestler who wants his daughter to win the Gold for the nation. It is a biopic of Mahavir Phogat. And believe me, it's a must watch biopic to get inspiration. To achieve something you have to let go the rest of the things.A simple story with great performances make this film a worthy watch. Aamir Khan is as usual fantastic. But, the girls are true heroes of this film. Fatimah who plays Geeta is a sure shot winner. She looks exactly as per her character and delivers great impact as a wrestler. Younger girls of Geeta and Babita are also very fine. Sakshi has a small role, but she plays it safely. Aparshakti Khurana is doing a voice over here and plays a role of the girls' cousin brother. He is funny and entertains the audiences for sure. Girish Kulkarni is also there, who delivered a classy performance in Ugly. So, the star cast and their performances are the biggest point of Dangal.Direction and writing by Nitesh Tiwari are worthy enough for viewers as they don't get bored in any situation. Except one, after interval song, that is like something slow paced. Everyone has to applause him as he gives justice to Phogat's family and doesn't add any extra material which we often see in Bollywood movies. He has delivered the frame as it is, so the middle class viewer can easily be able to connect with the film. What I like the most in the film apart from the performances is Music. Pritam has given it with the lyrics of Amitabh Bhatacharya. Both were amazing in Ae Dil Hai Mushkil. This time also they are killing the stereotypes. I loved all the songs. I'm downloading it. Hanikarak Bapu and Dhakad are pitch perfect. They have some English words as well as some pure Hindi words in them which make them enjoyable. But the best song is by far the Title track in the voice of Daler Mehndi. Full marks to the music department!Yes, it is very emotional film. Those who get the connection easily with films, may cry during some scenes. Even I'm one of them, too. It is better than Sultan, because it's a pure wrestling movie with a family background. Sultan was like a love story with a background of wrestling till interval and then box fighting post interval. I wish, Dangal may cross the record of Sultan at Box Office.On the whole, just go and enjoy the perfect film with your entire family as many time as you can. Btw, I will go for the second time for sure. So, 2016 has ended with a perfect film. Jai Hind!"
    },
    {
      "username": "nairtejas",
      "userUrl": "https://www.imdb.com/user/ur34967775",
      "reviewLink": "https://www.imdb.com/review/rw3605473",
      "warningSpoilers": false,
      "date": "24 December 2016",
      "rate": "9",
      "helpful": "8 out of 12 found this helpful.",
      "title": "A \"DanGIRL\" Triumph. ♦ Grade A-",
      "content": "Majority of sports films have lots of things in common between them. This one here tries hard and succeeds in being in the minority.Mahavir Phogat (Aamir Khan) is a home-grown National-level wrestling champion who hopes to see his unborn son(s) make India proud by winning gold at the international level. Blame his X chromosomes, but he and his wife give birth to not one, not two, but four daughters, much to Mahavir's disappointment. He surprisingly stops trying for a fifth child and packs up his dreams. However, as the kids grow up and show signs of aggressiveness, he realizes that even though their gender orientation is different from his, they may be good contenders for the game of wrestling. Convinced that his two eldest daughters, young Geeta (Zaira Wasim) and Babita (Suhani Bhatnagar), may help him take his passion forward, he begins training them - pure Ludhiana-style. The story then follows Mahavir's strict native coaching as the girls grow up (Fatima Sana Shaikh and Sanya Malhotra) and try to climb the ladder, albeit while facing a series of stereotypes, hurdles, and rampant demoralization from the society.As a viewer who is still in awe with the film, I will only talk about one specific (and the most important) sequence, which occurs towards the end of the first half. Without giving any spoilers - in order to prove that she doesn't need more of her father's guidance, Geeta gets into the pit to fight against the man who helped create her. The two-minute montage that Tiwari and cinematographer Sethu get absolutely, perfectly right, all with Aamir and Shaikh's emotive reactions, is the most poignant scene seen in any Bollywood film this year. There is so much in that short sequence that defines the powers of human vanity, egotism, and haughtiness - all blended with humanity's most vital feelings - it will make you cry. That particular sequence is what got me, and I am going to break order by recommending this film right in the third paragraph itself. Go watch it in your nearest theater now.Five minutes is all it will take you to get hooked into the otherwise long film (at 160 stimulating minutes). Delightful sequences that will lay out what is to be expected as you move forward with Mahavir and his daughters' story. The cause of women empowerment is loud and clear as Tiwari and his allies etch a story about the usual stereotypes that surround when it comes to \"women in sports\". The male gaze also makes an appearance here as Mahavir gives zero care to the world and moves ahead with his talented daughters in an attempt to shift mountains. How a father does what he does, regardless of his approach, but still thinks of his girls' upbringing and a bright future is what Dangal essentially talks about. It tries to smash and subdue the voices that sway in the air about inequality, and oppression of women and their rights. As far as the narrative is concerned, it's a triumph, because it sheds light on both sides of the coin. Mahavir's wife is worried about her daughters' food-making skills, but she is cajoled that people are not living in caves anymore. Of course, the narrative is formulaic, as Tiwari uses the usual elements (think Chak De! India (2007), Sultan (2016)) to ignite chatter about the much-talked-about cause, patriotism, the decrepit sports authority of India, and other related things. The ability to shed light into how it is the government which is to be blamed for sportspeople not winning medals should be lauded, but let's not give the film the hat of a pioneer. Other films in the genre think of it as water under the bridge.The young girls do a very good job at enacting kids who are growing up and who love pani-puri, yet are forbidden by their father. Their determination in portraying their characters is terrific. Same with Fatima Sana Shaikh who is well- directed, yet her character is written with some traces of bad Bollywood in it. She steals the show, nonetheless. Sakshi Tanwar and Aparshakti Khurrana support the main cast very well, with the latter providing comic relief.Aamir Khan justifies his role, and makes it obvious why he is showered with certain adjectives and nouns. After Talaash (2012) and Dhoom 3 (2013), his authority as a game-changer in Bollywood was beginning to diminish, but this one here surely has the strength to resurrect him as the man. His fitness regime for the portrayal (can be watched on YouTube) reassures that he may still be in the game.Dangal is a film that makes the right use of background music, slow motion capturing and editing, and other film factors. It keeps its audience at the edge of their seats throughout the film, yet stays relevant, and never bores. Thumping songs will get you higher and make you marvel at the cinematic excellence as it unfolds layer by layer. Overall, there aren't enough sentences to describe the lists of things that this film achieves. It rhetorically asks if women aren't better than men. Then it proves that it's all about equality, making feminists cower at the backseat. What took them years and years to start, this film here did it in less than three hours.BOTTOM LINE: Nitesh Tiwari's \"Dangal\" is surprisingly brilliant for a sports drama. It is a film that is not only about sports or the spirit of winning, but about a father's quest to make his children understand what passion can do, and how one can set an example. Other than learning some good wrestling strategy, Dangal is a triumph that will appeal to everyone. Go for it!Can be watched with a typical Indian family? YES"
    },
    {
      "username": "Filmaholic_Khan",
      "userUrl": "https://www.imdb.com/user/ur40037966",
      "reviewLink": "https://www.imdb.com/review/rw3605157",
      "warningSpoilers": false,
      "date": "24 December 2016",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "High Level of Detail makes Dangal Stand Out! Inspirational True Story",
      "content": "Nitesh Tiwari, Amir Khan and the team has put an extra-ordinary effort to make such an intelligent blend of Inspiration, Emotions and Humor that standing ovation at the end is irresistible. Dangal has a very unfamiliar high level of detail which is too good for Bollywood. High detailing make actors live the character, which doesn't go unnoticed and Dangal proves this point. Each actor wasn't just playing the character, they were truly living it. It was the Phogat family viewers saw on screen instead of the actors. That makes Dangal stand out. Acting is brilliant by both the lead and supporting actors. Mr. Perfectionist was great like always. No words to describe his level of commitment. Special mentions are the debutantes Fatima Sana Shaikh, Sanya Malhotra and Zaira Waseem. All the wrestling scenes are perfect and viewers can't mistake them for actors. The way these girls portrayed the characters of the wrestlers Geeta and Babita is commendable and worthy of every award. Story was based on a true story and the director stuck to it with some slight additions to make the movie more emotional and enjoyable which is good for Bollywood audience. But as a critic I must say there was a little bit of over dramatization in the end. Also I want to mention that AK and Nitesh didn't include any usual romantic crap and dance sequences which must be appreciated. Casting could have been better. Fatima is too cute for Geeta's character and this matters a lot while making a Biography. But she minimized this shortcoming by her flawless performance. Movie is 2hr40mins long but its well crafted so its enjoyable. ____________________________________________________________________ _________________________________________________ Its a must watch movie and Amir Khan keeps on setting standards for other producers of Bollywood which makes us hope for a better future of movies in India."
    },
    {
      "username": "khalid-71691",
      "userUrl": "https://www.imdb.com/user/ur64314674",
      "reviewLink": "https://www.imdb.com/review/rw3604975",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "",
      "helpful": "78 out of 121 found this helpful.",
      "title": "The best biopic ever",
      "content": "Umm where to start? First of Aamir sir has done it again. He really has a good taste in selecting movies. Not only the acting even the fighting scenes were quite real to me & reel Geeta and Babita were just too awesome. There is certain moments where you're gonna laugh out loud, get anger, get emotional and obviously feel proud the most that's what the movie brings out of itself. I hope this movie brings joy to all family and a chance to look at all daughter's of their's potential.Should you go for it? Hell yesSongs are smartly enough and pretty amazing.Ps. I wished the movie to be a bit longer."
    },
    {
      "username": "binducherungath",
      "userUrl": "https://www.imdb.com/user/ur51472121",
      "reviewLink": "https://www.imdb.com/review/rw3604784",
      "warningSpoilers": true,
      "date": "23 December 2016",
      "rate": "10",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Dangal, a sports biopic, is a powerful, inspirational and incredible story of women empowerment.",
      "content": "Dangal (means a Wrestling Competition), a biopic on Phogat Sisters Geeta and Babita and their father Mahavir Singh Phogat, by Nitesh Tiwari is a triumph over odds. Geeta made history by being the first Indian female wrestler to win the Gold medal (55kg) and Babita won Silver medal (51 Kg) in 2010 Commonwealth games. Offlate, Bollywood has certainly made a few very good sports biopics viz. Chake de, Bhag Milkha Bhag, Mary Kom, M.S. Dhoni etc. Most of them have done justice to the players and their lives. It is true that films about real heroes can become predictable. The story telling needs to be authentic too without misconstruing the essence. And that is where Dangal scores like anything. It is unadulterated, and remains true to the core. Dangal focuses on a father and his perseverance, persistence and eccentricities to fulfill his dream of fetching gold for the country through daughters. Under the umbrella of this main plot, the film tries to create awareness about so many pertinent issues. The film not only talks about the fight which one has to do in the real Dangal but also about the fight which one has to do against the mindset of people viz. certain games and sports defined as a taboo for girls by the society, the thought that girls are born just to get married, raise children and do household chores etc. The fight is also against the scarcity of resources, the lack of infrastructure support for the sports people especially sports like wrestling. One can instantly connect with the father who has deleted 'impossible' from his dictionary. One can also very well connect with the girls who just want to enjoy the bliss of being children and dressing up like girls, find their father to be overbearing, and their transformation to achieve what their father dreamt for them. The end is indeed predictable since we all know about Phogat sisters and their achievement but Dangal brings to us their journey which is simply incredible, inspiring and awesome. The best part of the film is its tone which is kept very much real, authentic and light. There are moments of humour too.Mahavir Singh Phogat (Aamir Khan) is a National Level Wrestling Champion who had to make a choice in his life and leave wrestling. But his passion and love for the sport never died. He used to enjoy all the fights in the local Dangal and always felt nostalgic of his wrestling days looking at the medals and certificates he had won. He is hopeful of living his dream through his to-be-born son. He gets disappointed every time when his wife Daya Shobha Kaur (Sakshi Tanwar) delivers a baby girl instead of a boy. He is definitely unlike those fathers who disown their girl children. Mahavir loved his girls but was just disillusioned about how to fulfill his dream of fetching gold for the country without having a son. But the day he realizes that his girls Geeta (Zaira Wasim -young Geeta), and Babita (Suhani Bhatnagar - Young Babita), have the potential to be wrestlers, he decides to go against the societal norms, fights all odds to train his girls. This is where the incredible journey of Phogat sisters begins. Aamir Khan as Mahavir Singh Phogat is terrific. It is one of his best performances, which would be remembered for ever, be it in terms of his physical transformation, his dictatorial approach with girls, his determination, never-to-quit attitude, being a possibilist as a path finder; he excels in every frame.Sakshi as Mahavir's wife Daya Shobha Kaur has given such a powerful and natural performance. She has fewer dialogues, but she speaks through her eyes and facial expressions. She plays perfect bridge between her unyielding husband and daughters.Phogat sisters are real discoveries be it the younger versions of Geeta and Babita (Zaira Wasim and Suhani Bhatnagar) or their grown up versions (Fatima Sana Shaikh and Sanya Malhotra). They are so much convincing. Zaira and Suhani are adorable. Fatima and Sanya are also very good. They have played their roles with so much of conviction.Another character which needs special mention is that of Omkar, nephew of Mahavir Singh Phogat. Ritwik Sahore (Ferrari Ki Sawari fame) has played his role very well. Aparshakti Khurrana (brother of Ayushman Khurana) plays the role of grown up nephew, he has less screen time, but he has made his presence felt. He narrates the story in typical Haryanvi accent. His scenes generate humour.Girish Kulkarni as coach in National Sports Academy has done justice to his role.The songs go with the flow of the film. Pritam's music clubbed with lyrics by Amitabh Bhattacharya is great. The lyrics are in absolute sync with the story. Dangal would certainly touch your hearts. I failed miserably in letting the tears come out of my eyes at many occasions, be it father- daughter relationship, their triumph over all odds, attitude to remain positive even amidst challenges. Felt like jumping out of chair and cheer their every victory on and off Dangal. Got goosebumps when the National Anthem is played along with the tricolor in the air. Many scenes have stayed with me.Dangal, a sports biopic, is a powerful, inspirational and incredible story of women empowerment. It not only talks about the fight Mahavir Phogat and his daughters Geeta and Babita had to do in the real Dangal but also about the fight which they had to do against the mindset of the people, patriarchic society, scarcity of resources etc. A must watch film."
    },
    {
      "username": "oazam",
      "userUrl": "https://www.imdb.com/user/ur67892098",
      "reviewLink": "https://www.imdb.com/review/rw3604532",
      "warningSpoilers": false,
      "date": "23 December 2016",
      "rate": "8",
      "helpful": "7 out of 10 found this helpful.",
      "title": "2 years later, Aamir Khan yet again succeeds with this Sports-drama. Pritam's music is a bronze medal",
      "content": "Honestly I was a bit determinant after watching Sultan thinking that this film could be a remake but honestly after watching this movie, it was a lot different. This movie just melted my heart with the fantastic writing, direction, performances, and editing. Nitesh Tiwari brought 2 average films which were Bhoothnath Returns and Chillar Party. But for this film, he deserves a bow for the amount of hard work he managed to put for this film.The performances in the movie were absolutely phenomenal. Aamir Khan is back to becoming nuanced and self confident Khan we always admired. His fat to fit video really created a lot of inspiration for me and my friends and that increased our eager level in watching this movie. Sakshi Tanwar is a pretty decent actress. Her role was absolutely strong and withheld but her dialogues in certain places were quite awkward and almost out-of-place.The girls who played Geeta and Babita just kept me to the edge of my seat. What amazement these girls did and how they used their empowerment to pull of a male-sport with such ease.The screenplay and direction was something I really loved just like how Haryana was shot and how the wrestling scenes were shot.After Ae Dil Hai Mushkil, I managed to enjoy Priam's music but the songs in Dangal were average and I wouldn't consider them at loop-listening soundtracks. Not many songs really stand out as such.Honestly, I enjoyed this movie much more than Sultan based on its true story and fantastic direction. Overall, this movie is a masterpiece with beautiful direction, performances, and acting. This motion picture really touched my heart. Leave your house and grab your tickets, this is definitely a cinema watching movie.In any society, it is very important to understand the meaning of women rights. No matter how boyish something could be, women are considered human beings. Girls have the right to do anything ranging from being a police officer to a taxi driver. These are typical jobs that mostly men pull off but women can also pull these jobs off but much quicker. Try to understand that men and women are the same professional wise."
    },
    {
      "username": "ctowyi",
      "userUrl": "https://www.imdb.com/user/ur44546721",
      "reviewLink": "https://www.imdb.com/review/rw3613161",
      "warningSpoilers": false,
      "date": "5 January 2017",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "A Powder Keg of a Monster-tainer",
      "content": "If I had seen Dangal last year, it would have easily blazed into my Top 30 list. Being a sport genre film, you will know what will transpire in the final climatic scene from a mile away, but it does hit all the usual tropes and emotional beats with verve and aplomb. The good ones in this genre know how to make the arduous learning journey resemble inspirational life lessons and will also make you feel vested in the story. This is not just a good one, it is a great one. Dangal is a biographical sports drama film directed by Nitesh Tiwari. It stars Aamir Khan as Mahavir Singh Phogat, who taught wrestling to his daughters Geeta Phogat and Babita Kumari. The former is India's first female wrestler to win at the 2010 Commonwealth Games, where she won the gold medal (55 kg). Her sister Babita Kumari won the silver (51 kg). I have seen inspirational life-affirming stories like this but what makes Dangal stands out from the multitude is that it got all the basics right. The film never sermonises the age old themes like sexism, gender inequality and patriotism, instead it hits the usual repertoire of greatest hits with a deft balance. There was never any need to hammer some of the ideas into your consciousness like nails to a wall. It trusts us to understand the issues because so many predecessors have already done so. It just presents them in a refreshing way to make them come up smelling like roses. For example, in a scene where the sisters lament their father for forcing them to learn wrestling, their friend who is a young bride-to-be shares with them how she wishes she has a father like theirs. In that simple monologue, a light is shone on the plight of the female gender in India. The film also got another aspect right - it manages to explain the sport with superb clarity, so much so that it almost feels like a wrestling 101 manual. It is never boring or preachy, and when the climax rolls in like the tide, you will smile gleefully because it has succeeded in actually making you feel smart. Talking about the climax, my wifey turned to me and whispered how the final bout would be won. I concurred and added that it will be underscored in extreme slow-mo. Of course, both of us were right. But the thing to remember is that even if we could guess it, it is always the mechanics behind we couldn't see. By then we were so vested in the story we were welcoming the final scene with opened arms and warm streaming tears. Dangal is also buoyed by convincing fight choreography and the wrestling sequences are well shot and without quick edits which are cheat-codes. You will believe the principals are wrestlers first and actors second. Fatima Sana Shaikh (Geeta) and Sanya Malhotra (Babita) are truly commendable in their roles. Even all the peripheral parts are well portrayed. That leaves Aamir Khan, who went over and above himself to turn in a superb performance and to think that he put on 38% body fat to play the role really made me want to salute him. But when I learned that he later went back to a lean mean fighting machine to play a much younger man in the initial part of the film, I wanted to bow down in front of the master. This is one powder keg of a movie with loads of great humour and infectious music. It doesn't matter that it is familiar because it feels like a great home-cooked meal and the Yoda-esque training lessons mirror what life throws at you. This one will definitely make you appreciate the sport that has been demonised and trivialised by WWF."
    },
    {
      "username": "Gordon-11",
      "userUrl": "https://www.imdb.com/user/ur0035842",
      "reviewLink": "https://www.imdb.com/review/rw4014450",
      "warningSpoilers": false,
      "date": "26 December 2017",
      "rate": "",
      "helpful": "2 out of 2 found this helpful.",
      "title": "A touching journey",
      "content": "This film tells the story of a father who hopes to have sons to pass on his wrestling dreams. He suddenly realises that he can pass the dreams to his daughters, and begins to train his daughters to wrestle.It is particularly refreshing to see a film about equality and women's rights in a traditionally patriarchal society. The plot is obligatorily touching, and mixes humorous moments in it as well. The scene about the daughters forgetting the mother made me laugh. It is a remarkable journey of a dedicated father and his two daughters."
    }
  ],
  "errorMessage": ""
}