{
  "imDbId": "tt0469494",
  "title": "There Will Be Blood",
  "fullTitle": "There Will Be Blood (2007)",
  "type": "Movie",
  "year": "2007",
  "items": [
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw1840254",
      "warningSpoilers": false,
      "date": "15 March 2008",
      "rate": "10",
      "helpful": "669 out of 817 found this helpful.",
      "title": "The Truth Hurts",
      "content": "People did not like this movie for a simple reason: too negative. I can understand that this movie is so depressing in so may ways. What it shows that Big Fish eats Litte Fish and none of us want to think about that anymore than most of us experience it in our daily life. It shows the battle between the evangelicals and the corporate business man. Or maybe even the battle between evangelicals of today and the non-religious people or atheists of today. Even worse is that this movie shows that religious people, priests are or can be as bad as a corrupt oil man. Maybe why people did not like this movie is because it might have offended them. Especially Paul Dano playing the priest. Both Daniel Day Lewis and Paul Dano are wrong and too extreme on their opinions. People are able to accept this. What people cannot accept is though that these same extremities and same misguided opinions from both characters are very much true in that they are heavily believed still today. Not all Christains are like Paul Dano's character and not all business man are like Daniel Day Lewis's character but many are like them. That is the world we live in.Now is their any alternative or positive side? The answer is yes and that is H.W. the son of Daniel Plainview(Daniel Day Lewis). He epitomizes hope. He shows that despite being deaf and having a father who uses him as a ploy for better business he can still break free of the chains that he is being tied down by. What separates H.W. from the residents and evangelists of Little Boston? The difference is that he and his father are educated and they are not. That is how Daniel Plainview is able to manipulate and cheat them the Sunday family, even Eli Sunday(Paul Dano) the priest and preacher of Little Boston. From what H.W. sees and experiences he sees that much of what is around him is just wrong. He uses his experience that he had gained as a kid to break free of the corruption and chaos that could have taken over him. That is one aspect of the education I'am talking about: our experiences and understanding of what is happening around us. Now to get to the technical aspects of There Will Be Blood. It is just truly spectacular in every way. First off the acting was amazing. Daniel Day Lewis gave arguably the best performance of his career playing Daniel Plaiview or ever since movies began to be made. He freaked me out and probably shocked many people. His thirst for power and money was at such a high level that it made me wonder about what people are really capable of. The deceiving, the greed, the thirst for power and the every man for himself attitude actually looked more real than ever to me. Without Daniel Day Lewis I don't think this movie could have achieved what it has. Paul Dano gave a great performance as Eli Sunday though people tend to disagree. I think he gave a great portrayal of an extremist evangelical priest of how he himself had his own thirst for power and how he was more blasphemous then respectful and gracious to god then how you would expect a priest to be. How could people not be shocked by these two characters, I was myself.Why was the music for this movie not liked. I thought this was among the top five musical scores I have ever heard. The music perfectly gave you the feeling of the corruption and deception setting into the movie. It perfectly intertwined with the rest of the movie as the movie itself was ever growingly becoming more and more chaotic and surreal. Probably too shocking though.Paul Thomas Anderson I believe gave the best directing job of the year. He was able to show the oil fields and its processes, the rise of an oil man, the way everyone can be bought even a priest and the hope that H.W. represented. This movie was never boring and it was as stunning of a directing job as Daniel Day Lewis gave as a performance for his role in this movie. The intensity of this movie was as high as a movie could possibly be and some of the credit for this has to go to the director. The cinematography and the music seemed to intertwine perfectly like the rest of the movie. It gave the sense of the time period and as said before the greed, deception, etc. The cinematography did not just give you a negative feeling but a feeling as if what you are watching is real.You should not like this movie just because of the great technical achievements as you should not for any movie but for what it says and how it says it. I'm not even sure if you should enjoy this movie in general but you should not be blinded by your opinions. I applaud you whoever out there who can somewhat understand this movie and get past the lying and deceiving we do to ourselves. This movie really shows the humanity of human beings. Why is this rated-R?It has so many intense scenes that if you get inside this movie it is truly haunting. Now maybe this movie was too powerful for many people, it was probably even shocking for realists. Maybe though its not that surprising that so many people don't like this movie because the truth hurts. Not the truth about corruption or about people but the truth about ourselves."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2580474",
      "warningSpoilers": false,
      "date": "13 March 2012",
      "rate": "9",
      "helpful": "38 out of 46 found this helpful.",
      "title": "Excellent, gutsy filmmaking",
      "content": "This is a compelling family drama charting one man's rise and fall as he ruthless exploits oil in the American west. It has everything you could want from a great Hollywood movie: subtlety, excellent acting, a thoughtful and intelligent script and quite wonderful cinematography.It's a film in which the oil is a supporting character in itself, and the series of unfortunate deaths and accidents that beleaguer our leading man reminded me of Emile Zola's excellent novel, Germinal. Daniel Day-Lewis gives another assured performance here, living and breathing rather than merely acting his role, and watching his growing feud with the slimy preacher is the stuff of great cinema. All in all a wonderful, epic film, old fashioned in the best possible sense."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2133941",
      "warningSpoilers": true,
      "date": "29 September 2009",
      "rate": "10",
      "helpful": "129 out of 173 found this helpful.",
      "title": "There Will be Praise",
      "content": "The world of cinema has seen and marveled a plethora of phenomenal performers, who over the years have entranced billions of viewers globally with their guile, grandeur, subtlety, eloquence and idiosyncrasy, but I dare say that none of their performances can match Daniel Day-Lewis' portrayal of Daniel Plainview in There Will Be Blood, for sheer ruthlessness, panache, eloquence and cheek. Being the chameleon that he truly is, Daniel Day-Lewis incredibly musters up all his prodigious talent as an actor to conjure up his misanthropic alter ego, Daniel Plainview, whose perpetually smirked face bolstered by his malice filled eyes makes him one of the strongest and the most fascinating characters ever caricatured on the silver screen. Daniel Day-Lewis is at the top of his game and virtually unstoppable as Daniel Plainview, a portrayal that not only resuscitated him as an actor, but also established him as someone who wouldn't leave a single stone unturned to bring his character to life and perhaps it is this very attribute that has helped him in his endeavor to be the absolute best at what he does. Paul Dano is absolutely brilliant as Eli Sunday and has complimented Daniel Day-Lewis in every sense of the word in spite of the fact that he barely had a week to prepare contrary to Daniel Day-Lewis, who had a whole year to prepare. Eli Sunday is ambitious, enigmatic, placid, pesky and pusillanimous and despite being highly contrasting to Daniel Plainview, ironically has many similarities to him, especially the uncanny demeanor that helped them both to inveigle others. It is the chemistry and the ever growing tension between them that makes the movie haunting and spectacular. There Will Be Blood is a morbid tale of greed, betrayal and obsession adorned by some great performances, visually stunning cinematography and masterful direction. Plainview owns a mine with potential silver deposits and his assiduity finally pays off when he discovers a silver ore. He sells it to acquire a crew to help him with the subsequent diggings in the mine. After the mine runs out of silver, oil is discovered in it and hence begins Plainview's journey of insatiable greed and morbid obsession. In order to acquire more oilfields and to strike out further deals easily, he adopts a young boy and names him as H.W. to help build a facade of a benevolent family man for himself. It almost takes him a decade to establish himself as a minor oilman, but this moderate success further intensifies his avarice. Subsequently, a young man named Paul Sunday (Paul Dano) visits Plainview's camp and offers to sell information about his family's ranch, which he claims to have an ocean of oil underneath it. Plainview and H.W. travel to the Sunday Ranch pretending to be on quail hunting while hiding their ulterior motive of verifying Paul's claim. Being as perspicacious as he was, it didn't take him long to find the vestiges of oil in the cracks formed due to the recent earthquake. He tries to inveigle the Sunday patriarch (who almost cried with rapture on hearing the offer) to sell him the land at a moderate price (which he calls quail price and not oil price), but is stymied by owner's ambitious son, Eli Sunday (also played by Paul Dano), who asks him to pay an additional ten thousand dollars towards the building of the Church of Third Revelation. Plainview reluctantly pays him five thousand dollars as advance and promises to pay the remaining amount once the drilling starts. Plainview assembles his crew at the Sunday Ranch and builds the first derrick. He also buys almost all of the land surrounding the Sunday Ranch so he will have not only those drilling rights but also the right to build a pipeline to the ocean to circumvent the railroads and their shipping costs. Eli wants to bless the derrick before drilling begins but Plainview rebuffs him. Using the money given by Plainview, Eli builds his church projecting himself as a preacher, faith healer and prophet. Soon the church has many followers, most of whom are Plainview's workers. Eli's increasing influence on the people and his display of false divinity starts pestering Plainview, who is further flummoxed by congregation's frequent gatherings (the daily prayers prevented the workers from taking desired rest, thereby decreasing their efficiency). Plainview beseeches Eli to make them less frequent, but Eli dismisses him with disdain. Plainview's ruthless ego is badly jolted by Eli's stubbornness and he brutally assaults him and even threatens to kill him when Eli asks him for the remaining money. Eli returns home all covered with mud after Plainview's assault and takes out his frustration on his myopic father, blaming him for acquiescing to Plainview's naked ambition. H.W. is deafened during an oil rig incident and starts behaving as a brat. Disconcerted by the change in the mannerisms of his son, he sends him away. Eli soon gets his revenge when a fellow named Bandy forces Plainview to get baptized at the Church of the Third Revelation (as a penance for a murder that Plainview committed and of which only Bandy knew). While baptizing him, Eli humiliates him by repeatedly slapping him and calling him a sinner for abandoning his hapless child. This incident further intensifies the hatred in Plainview and sets the tone for a deeply haunting finale when they meet many years later. P.T Anderson once again proves his mettle as a director and manages to pack a punch with this poignant and a deeply disturbing masterpiece. The movie incredibly succeeds on every level and entertains immensely, while still delivering a strong message. It was undoubtedly the best picture of 2007 and one of the best of the decade. In fact, it was very remiss of the academy to keep up with its long earned notoriety and prefer a relatively mediocre 'No Country for Old Man' over this truly haunting masterpiece. P.S. 10/10"
    },
    {
      "username": "breezey-120-833995",
      "userUrl": "https://www.imdb.com/user/ur55517503",
      "reviewLink": "https://www.imdb.com/review/rw7817140",
      "warningSpoilers": false,
      "date": "31 January 2022",
      "rate": "7",
      "helpful": "74 out of 88 found this helpful.",
      "title": "Phenomenal acting, not personally gripped by the story",
      "content": "It has been a while since I watched a film where the acting and casting is so damn convincing - I have to start this review by saying that.The plot is definitely off the beaten track anf the writing very very much a breath of fresh air.Unfortunately this is a film that can come down to tastes quite a bit when the reviews come round, and although I can't necessarily critique it specifically, there is something about it that I just couldn't get gripped by, and the ending didn't truly satisfy me (though the end scene itself is probably the high point of the movie. Confusing review, I know)This is not a negative review by any means, but 8-10 are reserved for films that truly get you talking, or have a huge emotional impact in my opinionAs a recommendation, this film is a definite yes. I believe that I am on the side of people who this genre doesn't appeal to much at all, but as a piece of film and a showcase of acting, it is utterly utterly great."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2381281",
      "warningSpoilers": false,
      "date": "6 February 2011",
      "rate": "10",
      "helpful": "39 out of 56 found this helpful.",
      "title": "One of the best of the last decade",
      "content": "There Will be Blood! What a fine film! In fact I would go as far to say it is one of the best of the last decade. Visually, it is stunning, I loved the skillful cinematography and shots and the scenery was amazing. Jonny Greenwood's music is atmospheric and haunting as well, the script is lyrical, hysterical and sometimes even baffling, the story is excellent and thematically rich and the pace is fine, quite slow but deliberately so.There Will be Blood is brilliantly directed by Paul Thomas Anderson and the characters are intriguing. In fact to me the character of Daniel Plainview makes the movie. Magnificently portrayed by Daniel Day Lewis, he is quite complex- while monstrous and cold-hearted, because of his love for his adopted son I wouldn't necessarily call him completely evil either. Paul Dano also does a fine job as Eli Sunday.Overall, a truly fine film and one of the best of the last decade in my view. 10/10 Bethany Cox"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1859326",
      "warningSpoilers": false,
      "date": "17 April 2008",
      "rate": "9",
      "helpful": "23 out of 31 found this helpful.",
      "title": "Daniel Day-Lewis does a great job playing a maniacal and, shall I say, oily character",
      "content": "I had heard about what a great movie \"There Will Be Blood\" is. A friend of my family said that she didn't really like the movie, but described a certain sound in it.Well, now that I've seen the movie, there are a few things that I can say about it. First, Daniel Day-Lewis does a great job playing the completely maniacal, amoral, self-aggrandizing oil magnate Daniel Plainview. Second, Plainview's speech about how he'll bring all the modern amenities to the small town; that brings to mind the fact that the whole American west now does have all those things...they put all these things in the middle of the desert, prompting everyone to use a lot of water, resulting in water shortages. Third, the subject of petroleum calls to mind present-day international politics. Finally, I would say that Daniel Day-Lewis and Paul Dano each individually are better than the movie as a whole (not to diminish the film).Probably the most intense scene is the final segment: there's what Plainview does to his son and then to Paul Sunday (or is it Eli?). All in all, it not only adds up to a very good movie, but Paul Thomas Anderson (\"Boogie Nights\" and \"Magnolia\") is showing himself to be a very good director."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2402457",
      "warningSpoilers": false,
      "date": "22 March 2011",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "The most flamboyant portrayal of materialism and its alienating effect ...",
      "content": "It's about expansion, it's about capitalism, and whatever that caused the demise of the Wild West myth. \"There Will be Blood\" looks, smell, feels like a Western but this is an Anti-Western more than anything There's so much to say about this movie but it left me speechless at the end, Daniel Day-Lewis was hypnotic, giving a performance that reminded me of Orson Welles in \"Citizen Kane\", and Humphrey Bogart in \"The Treasure of the Sierra Madre\" ... He's definitely one of the greatest actors of his generation, especially in this performance that probably best defines the alienating effect of materialism. The 40's had Charles Foster Kane, the 80's had Gordon Gekko and the 2000's have Daniel Planview.Indeed, \"There Will be Blood\" is not your typical 'soul corrupted by money and/or power' drama, as I said, it's all about materialism, ending with a pocket filled by gold and a heart made of the same stone you've been working on all your life, it's trusting anything that has a specific color, a specific smell, working on a land to find a greasy black liquid gushing from its womb, and never, never trusting or giving any credit to \"nothingness\" or \"abstraction\".Daniel Plainview considers these abstractions with the most profound disdain. Nothing is free, nothing comes from nothing, nothing is unsubstantial. If one claims to be your brother, he has to prove it, if one should make a deal with you, he should talk business and not about education ... not because it's personal, not because it has nothing to do with business, BUT because it is NOTHING and nothingness irritates Plainview as if the only thing he could believe on had to be material. The rest is nothing, feelings are nothing, believing is nothing, these so strong and noble words for us, well, Plainview doesn't give a damn about them...And more than anything, above all these abstractions, there is religion, God is Daniel Plainview's archenemy this is the ultimate masquerade for him, the cancer that gangrenes the progress, an evil that transforms people into sheep, almost like animals, the biggest hypocrisy of all Plainview, the capitalist, almost shares the same opinion than Marx who thought religion was people's opium. And because Plainview despises this hypocrisy, he tries to exorcise his hatred by using religion to achieve his plans, exploiting it, like he exploited his adopted son. No feelings, no sentiments, everything should serve a palpable purpose. The end justifies the means.And ultimately, he gets rich at the end, he's a respected and feared tycoon, as the purest and most implacable illustration of the American dream. But is he happy? no! because power, prosperity, those are still empty words ... he believes in material, in things, in stuff he drinks like the iconic 'milk-shake' metaphor that still resonates in my mind as one of the most memorable hymns to greed and pragmatism. Plainview is greedy, but not evil, evil is still too abstract a word; because it implies the use of one own conscience while Plainview's conscience was dedicated to one goal: getting bigger, possession, expansion, territoriality.And are we to blame him? Let's not forget the bleak cinematography at the beginning of the film where we could feel, the stink of the oil, the hardness of the rocks and the land as an incontrollable enemy ... let's not forget that Plainview spent half of his life stuck alone into dark holes made of land, stone, metal, oil, and raw matter, so close he could almost feel them, so close it became a part of him ...\"There Will Be Blood\" is the quintessential film about materialism and its alienating power, when all that matters is matter!"
    },
    {
      "username": "LeonLouisRicci",
      "userUrl": "https://www.imdb.com/user/ur33374263",
      "reviewLink": "https://www.imdb.com/review/rw2956581",
      "warningSpoilers": false,
      "date": "7 February 2014",
      "rate": "8",
      "helpful": "18 out of 24 found this helpful.",
      "title": "Industrialism is a Filthy Business",
      "content": "Industrialism and Capitalism can be a Dirty, Ugly Thing just like Sucking Oil from the Earth. Like a Vampire the Insatiable Oil Tycoons have not a Scintilla of Conscience about Humanity at the Price of Their Grandeur and Survival as Larger than Life Demi-Gods.This is an Ugly Film with a Lead Character that Exudes Ugliness. There is a Human Being with a Soul there in Daniel Plainview (Daniel Day-Lewis) that can be Witnessed on Occasion with His Infant Son and even up to and Including the Pivotal Tragedy of a Rig Accident. After that though, He is Completely Corrupted by Greed and Steroidal Ambition. He is now as Handicapped as His Son. The Film isn't any Fun and it is a Hard and Filthy Story about a Hard and Filthy Industrialist. An Almost Demonic Persona that Thinks He is Owed all He can Get because He gets His Hands Dirty.It is a Mesmerizing, Haunting Movie that is a Reflection of a Time when Simple Folks, like Sheep Herders and Ranchers are Easily Hoodwinked by Smooth Talking Money Men and Equally Silver Tongued Evangelist. It's the Second Birth of the Nation, the Beginning of the Twentieth Century.There are No Heroes Here and no one to Root for, it just Holds up a Soiled Mirror to Our Past as it Shines a Light on Our Present. Like the Blood of Our Veins, Oil is Still the Life of Our Nation. Director Paul Thomas Anderson Hardly Manages to Hide the Fact that this Commodity, in 2007, is Still a Source for much of Today's Suffering. It is not a Pretty Picture and Neither is This."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1808799",
      "warningSpoilers": true,
      "date": "27 January 2008",
      "rate": "10",
      "helpful": "63 out of 100 found this helpful.",
      "title": "Truly a piece of work",
      "content": "A few months ago I saw the trailer to There Will Be Blood, at first I was a little put off, it looked very strange and a typical drawn out drama. But then a little later, I saw a different trailer that was much better and looked more interesting. So now it had all this hype and is now nominated for 7 Oscars, including best picture, finally it came to theaters in my home town and my mom and I just saw it. Now, I'm just going to get a complaint out, I think this movie was still a little drawn out, it kind of took on a Kubrick type of feel with the first twenty minutes that had no dialog. But that was the only thing that threw me off. While I'm not as in love with this movie as much as everyone else is, There Will be Blood is going to be a sure classic down the line. The direction, the acting, the script, the sets, everything about this film was done beautifully and shows the utter greed and madness that can turn men into monsters.Daniel Plainview is an oil man, he's in the business with his son, H.W., and he goes around buying land very cheaply, and makes thousands and thousands of dollars when he strikes oil. But when he comes a town called Little Boston led by the tip of a boy named Paul, he buys the land promising the church that he will donate five thousand dollars to it. Eli, the leader of the church, claims he is a prophet and goes to the extreme to prove so with his followers. When Daniel's team is draining oil, his son is blasted away from an explosion of oil and looses his hearing, Daniel at this point just goes mad and meets a man who claims to be his brother, but he later finds out that this man lied to him. He abandons his son and is loosing all sanity, but when the church comes back to him, he claims he is saved. Years later though, he goes from business man to monster and is going to \"drink Eli's milk shake\", you'll see what I mean when you see the film.There Will Be Blood is a film of utter perfection, the reason why I'm rating it so high is because it is a perfectly made film. There's nothing wrong with it, when I said it's a little drawn out, it's just my opinion. But Daniel Day Lewis pulls in a flawless performance and became Daniel Plainview, especially the end, he pulled in such a chilling side and didn't over do the dialog, which I'm sure any other actor would have done. But one performance I am particularly impressed with is Paul Dano's as Eli/Paul, Eli really got to me and was incredible during his sermons, he held his own up to Lewis. He's come a long way since the silent rebel in Litte Miss Sunshine. There Will Be Blood is a GOOD movie, I mean good in the highest regards, because how many of us can say when a film is just utterly good? Not too often. There Will Be Blood is going to be a good contender this year for the Oscars, but we'll just have to see who'll take the best picture award, because we have some good films that are competing.10/10"
    },
    {
      "username": "lamoreauxba",
      "userUrl": "https://www.imdb.com/user/ur23916871",
      "reviewLink": "https://www.imdb.com/review/rw2367716",
      "warningSpoilers": false,
      "date": "11 January 2011",
      "rate": "10",
      "helpful": "165 out of 237 found this helpful.",
      "title": "One of my top five of all time, For Film viewers not movie goers",
      "content": "There Will Be Blood. Chilling, Sublime, perfect.First I must say the Soundtrack is amazingly disturbing and sets the tone of the film from the first scene. Many forget the amount of mood that sound sets. The film held me enraptured from first to last second.The story is perfectly displayed. Ever thing is laid out before the viewer in an intentional pace. The film is for viewers with imagination and foresight who can see through the shams of modern movie plot and into the realm of literature.The acting is simply stunning. Daniel Day Lewis can portray lines with a single expression and does in this film.I'm sure many will not enjoy this movie and all I have to say to them is go watch Transformers 2 again."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2165822",
      "warningSpoilers": true,
      "date": "29 November 2009",
      "rate": "7",
      "helpful": "66 out of 115 found this helpful.",
      "title": "Technically Perfect, but Boring and Without Emotion",
      "content": "In 1898, the lonely mining explorer Daniel Plainview (Daniel Day-Lewis) finds silver nuggets in the shaft and a couple of years later her is in drilling business. When the young man Paul Sunday (Paul Dano) sells the information that there is oil in the lands of his family in Little Boston, California, Daniel travels with his son H. W. and buys the ranches in the area. He finds oil and brings prosperity to the locals and increases his fortune. Along the years, Daniel builds an empire but H. W. loses his audition; he meets a man that tells that he is his step brother; he faces the opposition of the preacher Eli Sunday (Paul Dano) from the Church of Third Revelation. The powerful Daniel destroys his competitors but becomes lonely and insane in the end of the 20's.The overrated \"There Will Be Blood\" is technically perfect, with awesome performance of Daniel Day-Lewis. Unfortunately the rise of the oil man Daniel Plainview is too long, boring and without emotion. This character is not well developed in the beginning, and during the first fifteen minutes there are no dialogs. The other characters come and go without any development. It would be better off watching the fantastic \"Giant\" again instead. My vote is seven.Title (Brazil): \"Sangue Negro\" (\"Black Blood\")"
    },
    {
      "username": "Hancock_the_Superb",
      "userUrl": "https://www.imdb.com/user/ur1835386",
      "reviewLink": "https://www.imdb.com/review/rw1813398",
      "warningSpoilers": true,
      "date": "3 February 2008",
      "rate": "6",
      "helpful": "150 out of 250 found this helpful.",
      "title": "Disappointing and empty film, with an amazing central performance",
      "content": "Daniel Plainview (Daniel Day-Lewis) is an ambitious, slimy oil tycoon who begins building up an empire in the southwest using his considerable charm, his adoptive son H.W. (Dillon Freasier/Russell Harvard), and ruthless business acumen. He descends on the town of Little Boston, California, building a huge oil derrick and enriching the town. He clashes with Eli Sunday (Paul Dano), the fanatical young preacher, develops a strained relationship with his son (who is deafened in an accident), and solidifies his empire - but at the same time begins to unravel as a person.\"There Will Be Blood\" has received mountains of acclaim, as one of the best films not only of the year, but of the decade - and by some, of all time. It's easy to see why, as the film has a great deal going for it: an interesting-on-paper story, impressive direction and cinematography, and most of all, an amazing performance by Daniel Day-Lewis. But at the heart of TWBB is an emptiness, which not even the greatest performance can assuage, and that is the character of Daniel Plainview.The film begins promisingly, with a brilliant fifteen-minute opening scene devoid of dialogue, as Plainview and his associates dig out their first oil well. The introduction to Plainview as a slippery, manipulative man is well-done, and the first two hours or so are gripping. I sat engrossed, comfortable in knowing that all of the build-up would lead somewhere great. Unfortunately, towards the end, I realized that the opposite was true; the film wasn't leading anywhere, and indeed my enjoyment of it largely ended with a painfully contrived and ridiculous anti-climax.The movie has a number of problems in narrative structure. It doesn't have much in the way of a traditional storyline. This is not inherently a bad thing, but the detached nature of the film makes it hard to care about what goes on. The only fully developed thread is the troubled relationship between Plainview and his son H.W., whom the former views as prop to manipulate his competitors and showcase his success. And even this is dropped like a potato at the end of the film. There is also the digressive nonsense of Plainview's \"brother\" (Kevin J. O'Conner) which adds nothing to the film.Another flaw is the movie's lack of context. Though it is set in the early 1900's - a turbulent time when the US government led by Theodore Roosevelt, William Taft, and Woodrow Wilson were tearing down business monopolies - there is no political or historical context beyond super-titles and a few brief mentions of Standard Oil. As the film was essentially a character study, I wasn't expecting an in-depth examination of politics and history, but a few illusions to the time period beyond \"1911\" flashing on the screen would have helped. The attacks on the hypocrisy of religion and big business are socialist primer material (unsurprising given the source is an Upton Sinclair novel) and bring nothing new to the table.The basic problem of the film is in its lead, Daniel Plainview. Not in Daniel Day-Lewis, mind you, who gives one of the greatest performances in recent memory, but in the character itself. Plainview would be an interesting supporting character or villain, a slimy, manipulative man who thoroughly hates everyone besides himself. But there really isn't any depth to Plainview, and thus the film has a hollow center. He doesn't develop over the course of the story; he remains the same character throughout, a bitter, greedy misanthrope, and after awhile he becomes little more than a caricature of an evil businessman.The main reason to see this film is Daniel Day-Lewis. While I wasn't particularly enamored of his turn as Bill the Butcher, Day-Lewis's amazing turn as Plainview almost overcomes the script's shortcomings. Day-Lewis is a fascinating premise, and the brilliance of his performance conversely accentuates the weakness of his character. If it were in aide of something better, Plainview would be the most memorable character in the last twenty years of cinema. As it stands, it's still a remarkable achievement, and if Day-Lewis doesn't win an Oscar there is no justice.Other than Day-Lewis, the cast is non-descript. Paul Dano has received acclaim for his performance as Eli Sunday, but the role requires little more than elementary ham acting. The film's climax in particular illustrate the weakness of his performance. There are a few names in the supporting cast (Ciaran Hinds, Kevin J. O'Connor), but they remain in the background throughout. Cinematography, music and direction by Paul Thomas Anderson are all fabulous, with memorable set-pieces such as the oil explosion and the aforementioned beginning stand-out, but they do little more than cover up the weakness at the heart of the film.\"There Will Be Blood\" looks like it should be a great film, but it is a deeply flawed movie with a weak central character. Nonetheless, it's worth a look, and if nothing else Day-Lewis should make it interesting.6/10"
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw1799657",
      "warningSpoilers": true,
      "date": "13 January 2008",
      "rate": "10",
      "helpful": "36 out of 61 found this helpful.",
      "title": "One of the most memorable characters of 2007 in one of the year's best films",
      "content": "Wunderkind Paul Thomas Anderson's new film calls to mind Orson Welles' Citizen Kane in its themes and subject, and, shockingly, it's a good enough film to sit side by side with the one most often dubbed the greatest movie ever. Daniel Day-Lewis plays Daniel Plainview, an oil prospector who will do anything to be a success in the business. Much like Citizen Kane, There Will Be Blood depicts how the lust for money will eventually alienate every human being around you, and eventually make you completely isolated from the world. Unlike Citizen Kane, Daniel Plainview doesn't just grow apart from the world, he also becomes insane. There is a lot of metaphorical subtext lining the film's bottom, especially concerning the relationship between fundamentalist Christianity and big business. It's all very interesting to ponder. I don't know if I think the film is one of the most intellectually stimulating movies I've ever seen. For the record, I don't think Citizen Kane is, either. The message \"money corrupts\", while probably true, isn't especially insightful. What both films have in spades is a director with incredible talent who can envelop their audience in the rapturous experience of pure cinema. The desolate, desert setting sucks you in deeply and never lets you go. Every gravelly word spoken by Day-Lewis is anticipated with both glee and dread. It could have went on for three more hours, and only my bladder would have given notice. My only small grumble is Paul Dano in the final scene. He's good throughout, don't get me wrong, but that final sequence takes place over a decade after the last time we saw Eli Sunday. Daniel Plainview has aged, his son (as a child wonderfully played by the wide-eyed Dillon Freasier) has aged. Why is nothing done to Paul Dano to make him look older? At least give him a mustache! I think there must have been a reason for it, but I can't for the life of me imagine what that would be. Otherwise, an amazing experience."
    },
    {
      "username": "sddavis63",
      "userUrl": "https://www.imdb.com/user/ur0650255",
      "reviewLink": "https://www.imdb.com/review/rw1979342",
      "warningSpoilers": false,
      "date": "22 November 2008",
      "rate": "2",
      "helpful": "42 out of 72 found this helpful.",
      "title": "A Rather Excruciating Two And A Half Hours",
      "content": "I think the last significant movie I saw that featured Daniel Day-Lewis in a significant role was \"Gangs of New York.\" I was reminded of that movie somewhat. My reaction to \"Gangs\" was that it was dreadfully dull, although it did have a smattering of action here and there and at least I could see by the end that there was a point to the whole thing. Its high rating notwithstanding, I have to pin \"There Will Be Blood\" with the same dreadfully dull tag. The difference between this and \"Gangs\" is that there was precious little action to be found here, long stretches of nothingness (about ten minutes passes by at the start of the movie with no dialogue at all) and in the end I really couldn't see what the point of this was. Some parts of this movie are well done. The portrayal of the Old West was totally believable, the look at early oil drilling was interesting, the performances from Day-Lewis as silver miner turned oilman Daniel Plainview and Paul Dano as the charismatic preacher Eli Sunday were good and the final confrontation between Plainview and his \"son\" (Russell Harvard) was very emotional. Overall, though, to me the story didn't seem to flow all that well. It just completely failed to capture my attention, and trying to keep focused on a movie that is just plain uninteresting for two and a half hours is excruciating. For whatever reason I also found the musical score by Jonny Greenwood to be at times inappropriate in that it often just didn't seem to fit the mood of what I was seeing on the screen. Clearly I'm in the minority on this, but I just didn't find this to be a good movie at all, and I frankly can't go any higher than a 2/10 for it."
    },
    {
      "username": "baumer",
      "userUrl": "https://www.imdb.com/user/ur0355122",
      "reviewLink": "https://www.imdb.com/review/rw1944154",
      "warningSpoilers": true,
      "date": "11 September 2008",
      "rate": "3",
      "helpful": "26 out of 41 found this helpful.",
      "title": "There will be boredom",
      "content": "I have seen some very bad films, most of them horror or \"movies\" that are spoofs of other films. I thought Meet The Spartans was the worst movie I have ever seen, and even though it is, because it is not a film in a true sense of the word, I have to go ahead and say that There Will Be Blood is perhaps worse than it. Because this is a real film, with a real theme and real actors and a director and so on, TWBB should be in the category of one of the worst films ever made.Reading through some of the glowing reviews here, you'd think this film reinvented the wheel. They praise the acting, the directing, the cinematography. While I'll agree that Daniel Day Lewis was quite good, it does not make up for the rest of this turd. I'm still waiting for something to happen. I know there was something about a bowling alley and milkshakes, but other than that, I'm still waiting for blood. Keep waiting.Literally, I could not wait for this to end. My wife and I were looking at one another in the theater throwing our hands up in amazement every 30 minutes or so (2 1/2 hr. film) when the film's plot still hadn't gone anywhere. There's some stabs at religion, oil tycoons and imposters, but when you keep waiting for the plot to pick up and looking at your watch every few minutes, the film is in trouble.All this film can boast about is Daniel Day Lewis. He is a fantastic actor, but his over acted and misguided interpretation of this maniac is good but not enough to carry the film. This has to be one of the most misleading titles in the history of film. I remember snickers when sitting through the trailer of Blood For Chocolate. What the hell did that mean? But at least There Will Be Blood whets your appetite. I'm here for blood. Where is it? A drop...anything? Sadly, no.I sometimes think the masses are sheep. How else do explain the insane IMDb rating for this film. Powerful? Brilliant? Classic? This sounds like something to describe Titanic or the Godfather, not this charlatan of a film. If you suffer from insomnia, watch this, it is a definite cure.3/10"
    },
    {
      "username": "Movie_Muse_Reviews",
      "userUrl": "https://www.imdb.com/user/ur2496397",
      "reviewLink": "https://www.imdb.com/review/rw1800209",
      "warningSpoilers": false,
      "date": "14 January 2008",
      "rate": "10",
      "helpful": "100 out of 188 found this helpful.",
      "title": "Brilliant and chilling, \"Blood\" will leave you speechless",
      "content": "Words don't describe Paul Thomas Anderson's latest epic film project, and he doesn't let them dominate the story either. A significant chunk of \"There Will Be Blood\" has no dialogue and the ability for it to stay so captivating is only a testament to Anderson's incredible ability to tell stories about people through images that says more than about what's happening.Anderson's weapon in this film is no secret. It isn't often Daniel Day-Lewis's name shows up on a marquee these days, especially when it's not tied to something that is sure to be good. This latest choice of his, however, is better than good and so is he. His character, Daniel Plainview, a self-proclaimed \"oilman,\" is deeply complex and troubled. The way that Day- Lewis plays the lighter parts and seamlessly transitions to the darker parts is chillingly believable. Plainview is not only interesting, but he's embraceable, despicable, amusing and frightening all throughout the film.The only truly supporting cast is his son and a self-proclaimed prophet that he comes into complications with played by Paul Dano (Little Miss Sunshine). Dano's performance is unfortunately shadowed by Day-Lewis and it does feel like he was too young to be cast, but the 23-year-old is highly impressive and will perhaps be a marquee name in the near future.\"Blood\" is otherwise the strength of Anderson and his crew. The original score by Jonny Greenwood, who is mostly known for his guitar skills in Hollywood, brings something abstract that simultaneously fits the film's generally quiet demeanor using a variety of percussion sounds and few musical notes. While some films prefer soaring John Williams themes, Greenwood's theme for \"Blood\" is one dissonant chord and a sound effect that can be best described as a more painful version of the THX sound system effect. It's harsh, but so is the film. Anderson makes every moment count whether it's when there's music or where he puts the camera.To best describe the film in terms of people familiar with Anderson's work, it's his first film that truly translates to the interests of all dramatic film-lovers. It is distinctly his film, yet viewers will be able to grasp it much more easily than the abstract and obscure multiple storyline nature of \"Boogie Nights\" and \"Magnolia.\" For people new to his work, be prepared to feel some discomfort, but if you pay attention to the way the story is told, then you'll find the mastery of \"Blood.\""
    },
    {
      "username": "Gordon-11",
      "userUrl": "https://www.imdb.com/user/ur0035842",
      "reviewLink": "https://www.imdb.com/review/rw1825943",
      "warningSpoilers": false,
      "date": "24 February 2008",
      "rate": "",
      "helpful": "59 out of 110 found this helpful.",
      "title": "Not as legendary as people claim",
      "content": "This film is about a oil businessman who stops at nothing to gain power and wealth. His morals deteriorate with his increasing wealth.At the moment \"There Will Be Blood\" is the top 23th film on IMDb. People hail Daniel Day Lewis as the best living actor, and this is his best performance. According to the posters in the local cinema, Daniel Day Lewis has got over 50 best actor nominations for this role alone. As a result, I have very high expectations on this film.Daniel Day Lewis is definitely great as Daniel, but I find it rather unfair that Paul Dano does not get any attention. Paul Dano is excellent as a religious leader, and he constantly impressed me with his passionate speeches. The other characters, I am afraid, are not as memorable.As for the plot, it is good in outlining how Daniel's morals decline deeper and deeper. However, I think it does not portray the consequences of his declining morals enough. It would be great to see the moral repercussions of his dirty deeds, and the emotional impact of such acts on others. The current plot only displays how he becomes increasingly corrupted, and I find this less than satisfying.The beginning speechless introduction is far too long, and the ending is far too abrupt and fast. It is disappointing that it does not portray more of Daniel and his son's relationship between his son coming back and his marriage. I would also liked to see more of his son's reaction and emotions after being told the truth. The initial 30 minutes can easily be shortened to make way for interaction between Daniel and his son. Actually the whole film can be shortened, and the pace quickened, without affecting the story.I think \"There Will Be Blood\" is not as legendary as people claim."
    },
    {
      "username": "gregeichelberger",
      "userUrl": "https://www.imdb.com/user/ur17651340",
      "reviewLink": "https://www.imdb.com/review/rw1796524",
      "warningSpoilers": true,
      "date": "8 January 2008",
      "rate": "4",
      "helpful": "525 out of 1,007 found this helpful.",
      "title": "'Blood' and oil do not mix",
      "content": "With all of the hype surrounding Daniel Day-Lewis' performance (he was, in fact, given a Best Actor nod from the San Diego Film Critics Society, for whatever that is worth) in the P.T. Anderson-directed tale of early American oil speculation, \"There Will Be Blood,\" I can only relate my extreme disappointment.This would have made an interesting 90-minute movie, but, unfortunately, it runs over 140-minutes, most of which is smeared with plasma and petroleum to the extent every character is sullied and unrecognizable as a human being.Perhaps Anderson wanted it that way, after all, it's really only Day-Lewis¹ character (the lubricious Daniel Plainview) that even comes close to developing; the others are simply there to keep him company and accept his violent tirades.Yes, times were tough in the early hardscrabble years of the American West, but this guy makes Jonas Cord (\"The Carpetbaggers\") look like Mother Theresa.We first meet Plainview in 1898 mining for silver in Arizona. After a nasty fall in which he breaks his ankle, he discovers oil in the shaft. After a few years, he has a crew and a few successful wells.One day, a fellow worker ­ there with his infant son (for some reason) ­is killed and Plainview adopts the boy, H. W. (Dillion Freasier) for no other reason than to have a cute face to show while he cons the public (see \"Paper Moon\").These are some of the movie's best scenes, with Plainview - and H.W. in tow - visiting backwoods bergs and convincing a gullible populace into signing away land rights for a fraction of what they were worth. Plainview, with a sinister soft-spoken demeanor plays psychological games until the rubes are all but ready to GIVE him the oil rights in perpetuity. Several years later, a visitor tells Plainview about a ranch in California that is soaking in oil, so Pop and son head out there, under the pretense of hunting quail. There they meet the Sunday family, addled dad, Abel (David Willis), a few non-descript females and an Evangelist son, Eli (Paul Dano, \"Little Miss Sunshine\").Plainview and Eli do not hit it off at all, and this is the conflict that sets up the second act. It doesn't take much to finagle Abel out of the Sunday Ranch, as well as the surrounding property, but several tragedies cause many in the town ­ especially the young preacher ­ to wonder if they made the right move in letting Plainview into their midst.When H.W. is rendered deaf in an explosion and disastrous fire, we wonder if the whole enterprise is worth it.Up until this point, I was willing to go along with this film as not only a historical drama relating the days of the early oil industry, as well as a chronicle of rural religious fervor, sort of \"Oklahoma Crude\" meets \"The Apostle.\"The problem is, the picture does not continue to walk that thin line. We are now subjected to scene after scene of Plainview¹s descent into madness and murder ­ but with little or no motivation for either.For example, he beats Eli severely and mocks his church; meets a man who claims he¹s his brother; abandons H.W. and generally spirals out of control.He's business savvy, however, and plans to build a pipeline to transport his vast oil reserves to the coast (thus eliminating the cost of railroad shipping). To do this, though, he has to build through a local hermit's (Hans Howes, \"Seabiscuit\") land.The only way to accomplish this is to humble himself before Eli and the congregation and be baptized, obviously a fate worse than death to Plainview who seems to have no morals, whatsoever.Now that he¹s joined the church and gotten his pipeline built, does he enjoy even one iota of his success? Absolutely not.In one of Day-Lewis' many monologues, he gives us his motivation for being such a bastard, \"I do not just want to succeed, I do not want anyone else to succeed.\"Still, that does not explain his psychotic, murderous frenzy, and the longer the film goes on, the less cohesive it became.I can accept his tirades early on, and even a bit of his unmotivated violence near the middle of the film, but Anderson pushes things to the extreme limit. He's even admitted that he watched \"Treasure of the Sierra Madre\" before beginning to film \"Blood\" - yet he still did not learn anything about coherent film-making.Friends, this is by far one of the most depressing and oppressive films of the year. In fact, it makes \"No Country For Old Men\" look like \"Mary Poppins.\" Then, at the conclusion, after watching more than two-plus hours of this evil, hateful man succeed over and over again, we're treated to another brutal, pointless murder -­ this one coming out of nowhere.Like \"The Last King of Scotland,\" in which Forrest Whittaker won the Best Actor award, this is another performance-driven, but deeply-flawed motion picture.Day-Lewis will certainly be nominated for this, and he may actually win, but that does not mean one will enjoy the experience of watching that performance."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw2187115",
      "warningSpoilers": false,
      "date": "6 January 2010",
      "rate": "5",
      "helpful": "27 out of 47 found this helpful.",
      "title": "Perhaps Too Art House For Its Own Good",
      "content": "I was looking forward to seeing this when it was released in the cinemas , a story of single minded obsession with some great reviews from Daniel Day Lewis performance . Only problem was when I checked the local listings of the local Odeon cinemas it wasn't being screened . Nor was it being screened at the Edinburgh film house which left me puzzled . I did find out that it screened at the Edinburgh Cameo but had finished its run before I got a chance to see it . I was puzzled that film that received much critical acclaim didn't get a wider release but after seeing it on Sky movies I'm somewhat surprised it got so much acclaim in the first place There's a term invented by the American film critic David Bordwell called \" intensified continuity \" which in its simplest term is \" MTV style directing \" . Scorsese did this with GOODFELLAS and CASINO , Oliver Stone with all of his 90s work and Francis Ford Coppolla with Dracula . Bordwell does make a point that shot length seems to be increasing in the late noughties compared to the 1990s . Interestingly NO COUNTRY FOR OLD MEN which came out the same year as this had a similar , long , rather slow , old fashioned feel to it . But at least NO COUNTRY was a plot driven thriller where as THERE WILL BE BLOOD is character driven which means it can be painfully tedious at some points The cinematography is good and Lewis certainly isn't bad as Plainview , but the problem is in the cinematic storytelling . The film starts with long sequences with no dialogue and these scenes drags on . There's also a problem with trying to figure out what the message is . You could understand if there's a sympathetic Marxist slant on the fundamental flaws of capitalism but then Plainview's nemesis is shown to be a preacher who isn't exactly portrayed in a good light . Moral ambiguity or moral equivalence ? A thinly disguised attack on George W Bush ? I doubt it , more likely it's just an art-house hit that received more praise than it possibly deserved .There's not much wrong with it per se . As I said it's a film that is shot and framed well with good cinematography and good performances . However for audience members like myself whose main interest in watching cinema is narrative it's a film that I'm in no hurry to rewatch"
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw1827260",
      "warningSpoilers": false,
      "date": "25 February 2008",
      "rate": "",
      "helpful": "29 out of 52 found this helpful.",
      "title": "Original but Flawed Work",
      "content": "There Will Be Blood (2007) *** 1/2 (out of 4) Ambitious film about an oil man (Daniel Day-Lewis) who will stop at nothing to find the black gold. I must be honest and say I don't know what the whole point of this film was or if it was just trying to show evilness in the world but this 158-minute film kept my interest throughout. I think the film drags somewhat right before the final act but outside of that this is a very good epic that certainly has the look and feel of epics from decades ago. The visual style of the film is the most impressive thing as Anderson's camera takes us on quite a journey and also shows off some amazing locations. Another great thing is how we see how oil was produced back in the day and all the small details on the screen make for a very impressive history lesson. I also loved the first fifteen or twenty minutes of the film, which are done without dialogue. We see Day-Lewis' rise and how he got started within these opening scenes and even though there isn't a line of dialogue spoken we still learn everything we need to know about him. A lot has been said about the performance from Daniel Day-Lewis and while it is a great one I wouldn't call it the best of his career. I think he played this same type of character in Martin Scorsese's Gangs of New York and I think he was a lot better there but that's certainly not a slam against his performance here because he's great here as well. That snake quality the actor brings to this role is quite memorable and even when he's doing something good or worthwhile, you can still see that evilness in his eyes. The supporting cast were mostly good but they are miles behind Day-Lewis and I think this hurt in several scenes including the ones with the preacher (Paul Dano). Dano is pretty good in the role but the part needed someone a lot stronger who could match wits with Day-Lewis."
    },
    {
      "username": "Robert_duder",
      "userUrl": "https://www.imdb.com/user/ur1697212",
      "reviewLink": "https://www.imdb.com/review/rw1815380",
      "warningSpoilers": true,
      "date": "6 February 2008",
      "rate": "4",
      "helpful": "64 out of 123 found this helpful.",
      "title": "I'm jumping OFF this band wagon in confusion and surprise?! There 'Will' Be a lot of things...entertainment wasn't one of them",
      "content": "I can say that 'usually' I am pretty on par with what the general public think of a movie although I have been known to stray my own way with certain films but I am still blown away in reading all the reviews for this film which would have someone believe that this is one of the best films of the year...an opinion shared overwhelmingly with the Academy who has bestowed numerous Oscar nominations on this film so let me be the first to say that perhaps my opinion is not right this time. However, it is my opinion and I was blown away by how truly outrageously BORING and misrepresented this movie is. I don't consider myself unintelligent by any means. I think I can certainly enjoy a great intellectual, artistic picture, and I DO love a great historical epic but I had seen the previews for this film and they represent it completely different than what the film is. There Will Be Blood should have been titled by its origin of work which was \"Oil\" because that is the only thing this film is about. I get the title...its rags to riches, pulling himself from the very bottom through turbulence and trials and ends with him losing his mind basically but my god it takes him a long time to get there and everything in the middle is as boring as the sand around him.Daniel Day-Lewis is very good. I take nothing from his performance as Oil man Daniel Plainview who starts from nothing and ultimately creates an empire at no expense including his own sanity in the end. Considering his character arc covers many years and many different situations, he does a terrific job. Its just the fact that there isn't any real plot or point to the three hour film to help support him. He definitely is the focus of the film despite a small supporting cast. The only other stand out performance is that of Paul Dano, a very gifted actor coming from an awesome role in Little Miss Sunshine. His over the top, bursting performance as religious fanatic and 'healer' Eli Sunday is really something. Its comical in this dark and disturbing way. However the previews of this film imply some sort of great battle of wits between Sunday and Plainview which never happens. Instead Eli Sunday is like an annoying little bug which Plainview swats repeatedly. Dillon Freasier also does a decent job as young H.W. Plainview, who is learning the business from his father until an accident takes his hearing. Its a subtle and quiet performance but he does well.So you have these good performances, why did I dislike this movie? It is truly uneventful. I mean watching the Oil fields and the events surrounding drilling and making money is very captivating...for 30 maybe 40 minutes...but NOTHING else happens. Its the same for three hours! And then when all is said and done we have this emotional blow out between father and son after years of being apart and then the end of the film is so downright stupid and ludicrous, it just literally made me shake my head. In some ways it was the perfect ending to a film that was just a waste. I DO believe the film makers purposely mislead the general public to believe that this film is about this bloody battle between and Oil Driller and a preacher when it has nothing at all to do with that. I can't agree with anyone on this and seeing the words \"astounding, gory, disturbing\" in people's reviews make me say \"What the hell were you all watching?\" I literally had to fight to keep my eyes open. But to each their own...that's the beauty of art but for me this Academy Awards is shaping out to be a big disappointment. 4/10"
    },
    {
      "username": "merklekranz",
      "userUrl": "https://www.imdb.com/user/ur13371508",
      "reviewLink": "https://www.imdb.com/review/rw1892643",
      "warningSpoilers": false,
      "date": "14 June 2008",
      "rate": "5",
      "helpful": "13 out of 20 found this helpful.",
      "title": "First the music..then the film itself ..will grate on you....",
      "content": "Watch it if you must for the Oscar performance, but do not expect to be entertained. The downward spiral of Daniel Day Lewis's character is paralleled by the movie itself. A buildup of hatred towards the self made millionaire leads nowhere. There is absolutely no payoff for the audience, and after enduring the overlong film, there is a severe letdown with the ending. Those who tout the Oscar performance and fine photography are deluding themselves into thinking there is more here than there actually is. It turns out, \"There Will Be Blood\" , like so many other self-indulgent films, is mistakenly worshiped by a few, while the majority simply shake their heads in disbelief at all the hype. - MERK"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1927354",
      "warningSpoilers": true,
      "date": "10 August 2008",
      "rate": "",
      "helpful": "17 out of 29 found this helpful.",
      "title": "A marvellous character study of ambition gone sour and endless greed",
      "content": "As a struggling silver miner, Daniel Plainview scrapes together a living until he stumbles upon a more profitable route for this talents - oil drilling. Starting small with one crew and one pitch, the film follows the growth of Plainview's business as he starts to expand. When he learns of oil-rich land out west in California, he and his young son head out there to capture the land and the rights to drill in the area. It is here that he meets the aspiring preacher Eli Sunday, who is interested in what the oil profits can do for his church. As with many of his recent ventures, this new location is a success although, with every victory and crushed competitor, Plainview's drive and ambition grows and consumes all around him.I had heard so much hype and praise for this film on its release that I decided to wait a while before going to see it; after all then someone is saying that it \"rewrites cinema\" (or words to that effect) then it is hard to come to it as an individual without feeling the pressure to praise it and love it so as to not stand out from the crowd. Recently I watched it and was pleased by how easily I was drawn into it but also how quickly the three hour running time flew past. From the very start the story-telling begins and through simple scenes we come to understand the drive and sacrifice made by Plainview to even have a foot on the ladder. It is to the film's credit that it does not paint him as unworthy of the success he will find this way and the viewer is not able to hate him for his intrepid spirit and hard work. It goes without saying that the film follows the logical extension of his drive to succeed and that the next two-thirds of the film presents a much harsher and unpleasant side to this ambition.It is a subject I have often wondered about because the CEO of where I work is in his sixties but is still working and active, making hundreds of thousands each day with shares movements and deals - what makes him keep going when he could clearly just pack it in, buy an island and sit on it. Well, whatever it is, it is probably the same motivation that got him to the position he is in. I am not in any way aligning the two men, but with There Will Be Blood, this is very much the crux of the film as it is a character piece looking at Plainview in this regard. The way it does it is with patience and intelligence so that it is never a matter of one act that pushes him too far, or one moment that flicks a switch within him but rather that it is simple, logical and totally natural for this character. I do think that the conclusion perhaps could have been better but otherwise it is a faultless piece of work.Visually the film is striking. Not for any one image or moment of style though, but for the endlessly eye-catching framing of shots or positioning of the camera. The canvas of the western is of course present but we are never staring at it and somehow, even as two characters greet each other by a pipe being buried against a wide horizon, we are still focused on the tiny characters. A lot of this has to do with an utterly convincing performance from Daniel Day Lewis - it has been said loads but I cannot help but repeat how good it is. Again, it is not down to one moment that can be used as a clip for the Oscars but rather a complete immersion in the character so that he is able to convince whether as a man starting out or a man who is at the end of his life. No matter how impressive the visuals, you never take your eyes of him. To me he is the whole film and the support cast do struggle by being in his shadow to a certain extent, but mostly they all still work. Dano is probably the secondary most important character in the piece and he does pretty well with it although he doesn't really seem to age across the film, which I found distracting and detracting from his work.Along with the visual structure, the use of music is impressive, never forcing its way over the action and only ever being part of what is happening - it is the Academy's loss that they \"couldn't\" recognise the score because the absence of this film makes them look daft. Indeed, in hindsight, so does the dominance at the awards of No Country For Old Men and it should have been more of an even split because they are both very good and very thoughtful films - although for me There Will Be Blood has it over the Cohen's here. OK it is not as entertaining or as accessible a film as that thriller but it is much more engaging and interesting in what it does. From script through acting, filming, scoring and total delivery, it is a magnificent film."
    },
    {
      "username": "edwagreen",
      "userUrl": "https://www.imdb.com/user/ur2542703",
      "reviewLink": "https://www.imdb.com/review/rw1854673",
      "warningSpoilers": true,
      "date": "9 April 2008",
      "rate": "5",
      "helpful": "17 out of 29 found this helpful.",
      "title": "There Will Be Blood- The Blood Sure Clots in the Last 20 Minutes **",
      "content": "I have never seen a film to deteriorate in the last 20 minutes in the way that \"There Will Be Blood\" does.The film has a great plot- a man who becomes very wealthy from oil drilling, and the apparent abandoning of his son who is deafened by the blast of oil being discovered.I thought that this would be the basic story line, the relationship between father and son through the years. Instead, we see the horrible relationship between Lewis and the town pastor.This film is certainly an anti-religious one. At the end, we see the human frailties possessed by the pastor. The two had a fight by film's end in a manner that reminded me of Max Bialystock and Leo Blum fighting in 1967's \"The Producers.\" The ending is simply awful.Before the last 20 minutes, Lewis gives a restrained but powerful performance as the wealthy oil driller who is really insane.A the time of the horrible ending, Lewis announces to his valet that he is finished. He should have been so 20 minutes sooner."
    },
    {
      "username": "tranquilbuddha",
      "userUrl": "https://www.imdb.com/user/ur0560506",
      "reviewLink": "https://www.imdb.com/review/rw1787814",
      "warningSpoilers": false,
      "date": "27 December 2007",
      "rate": "",
      "helpful": "389 out of 641 found this helpful.",
      "title": "Stunning",
      "content": "This film raises the game for everyone out there. I have loved all of Paul Thomas Anderson's work, including his greatly underrated Punch-Drunk Love, but this is a huge leap from any of the previous movies into a realm, as others have said, inhabited by classics such as Treasure of the Sierra Madre - and then some. Every element of this film is astonishing, from the opening twenty minutes, which feature virtually no dialog, to Jonny Greenwood's score, which I have heard criticized as too imposing but which seems just about perfect to me (and brings to mind the non-Blue Danube elements of 2001 at its most experimental). Daniel Day-Lewis' performance is in a league of its own: his voice, his mannerisms, his physical movement, his stunted emotions, are flesh and blood, and hauntingly so, in a way that even Tommy Lee Jones in In The Valley of Elah (which I thought was a pretty staggering performance) can't quite attain. I will watch this film again and again simply to see something so raw and so moving and so gut-wrenching. This is why I love movies; this is what made me want to make movies when I was fourteen years old."
    }
  ],
  "errorMessage": ""
}