{
  "imDbId": "tt1130884",
  "title": "Shutter Island",
  "fullTitle": "Shutter Island (2010)",
  "type": "Movie",
  "year": "2010",
  "items": [
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw2303434",
      "warningSpoilers": true,
      "date": "30 August 2010",
      "rate": "10",
      "helpful": "89 out of 97 found this helpful.",
      "title": "\"Men like you are my specialty, you know?\"",
      "content": "There are a number of films I've seen more than once, and if they're good (the only reason really, to watch them again), they become a richer experience and one gains a greater appreciation of them. \"Shutter Island\" might be the only picture that on subsequent viewings, becomes a DIFFERENT film from the one originally seen. I say this because the first time around, there's no way to take the character of Teddy Daniels (Leonardo DiCaprio) other than at face value. He's a detective investigating a missing person case on an island. Not your normal island, but one that's home to an institution for the criminally insane. Every interaction he has with a character in the picture is one between himself, Detective Daniels, and that character. As we come to learn, all that changes when Dr. Cawley (Ben Kingsley) reveals the twist near the end of the story, at which point, one is left either totally disillusioned or utterly blown away.What's unique and brilliant about the writing here is evident upon a second viewing. What we now know to be true about Teddy Daniels becomes even more evident. We're able to understand that in Teddy's first meeting with Naehring (Max von Sydow), Naehring is actually speaking to Laeddis. Yet those references to Laeddis/Daniels' 'defense mechanisms' could have been offered and taken either way. George Noyce (Jackie Earle Haley) was speaking to Laeddis as he had no reason not to. The vision of Rachel Solando in the cave was warning Teddy that he had no friends, and that there was no way off the island. This was a way for the viewer to understand that in some small way, Teddy/Laeddis was conversing with himself, sometimes with clarity and other times delusionally. The Warden (Ted Levine) is clearly speaking directly to Laeddis when he picks up Teddy after his night in the cave. This is all so masterfully done that even watching the picture multiple times, it's amazing to pick up on the nuance that went into developing the story.Now I have to admit, the first time I saw the picture and it became apparent that Teddy Daniels was Laeddis, I wanted to blow it off as one of those cheap constructs that film makers are prone to indulge in just to play with the viewer's head. But somehow, this was different. This was a study, a grand two day experiment if you will, designed to force Laeddis to come to terms with himself and what he had done to become confined to an institution. The way the whole story evolves is fascinating to watch, almost like watching the making of the movie instead of the movie itself. I've seen \"Shutter Island\" three times now in the space of about a month, and I know with certainty that I'll be watching it again. There's not many films I can say that about, but this one just begs it, almost like a patient requiring your uninterrupted attention."
    },
    {
      "username": "jackgdemoss",
      "userUrl": "https://www.imdb.com/user/ur87808462",
      "reviewLink": "https://www.imdb.com/review/rw5010692",
      "warningSpoilers": false,
      "date": "22 July 2019",
      "rate": "9",
      "helpful": "238 out of 251 found this helpful.",
      "title": "One of the most memorable plot twists of this decade",
      "content": "I originally saw this film when it came out but couldn't remember it well enough to give it a rating or write a review, so a rewatch was in order. I viewed the film through the lens of already knowing the plot twist, which made it a whole different experience. The ending will be remembered throughout film history as one that showed just how viciously a well written script can flip an audience over. This really is a film you should see twice."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5504404",
      "warningSpoilers": false,
      "date": "23 February 2020",
      "rate": "",
      "helpful": "93 out of 108 found this helpful.",
      "title": "love this movie highly recommend.",
      "content": "Visually beautiful, wonderfully acted, and relentlessly gripping, Shutter Island is a brilliantly unrestrained psychological thriller that keeps its audience riveted throughout its entire duration."
    },
    {
      "username": "ruhsa",
      "userUrl": "https://www.imdb.com/user/ur65838181",
      "reviewLink": "https://www.imdb.com/review/rw3813630",
      "warningSpoilers": true,
      "date": "24 September 2017",
      "rate": "10",
      "helpful": "285 out of 304 found this helpful.",
      "title": "The movie is perfect psycho drama",
      "content": "Shutter Island is the story of Teddy Daniels, A U.S. federal marshal sent to the island with his partner Chuck Aule to search for the disappearance of a patient. Each scene provides a turn against their leads and compels them to look for more whilst searching in places we couldn't comprehend, including their minds. Leonardo DiCaprio and Mark Ruffalo feed off each other and supply great performances for their characters as expected, but some of the other characters whose names are riveted on the posters or marquees are sensational as well. The two that stuck out to me most were Ben Kingsley (Dr. Cawley) and Michelle Williams (Dolores, Teddy's wife), each of whom brought so much dramatics and new questions to the movie, developing plot twists and controversy. I don't think this film would be the same without them.This is also a film I would recommend seeing a second time. In fact, it is even better the second time. All those pieces of that puzzle you didn't catch the first time, you will the second. You see, we as the audience are first put in the shoes of Teddy. The second? Well, without giving too much away, lets just say you are put in someones else's shoes entirely during the second viewing.Shutter Island. A film that will make you question your own sanity. A film that will leave you breathless. A film that has re-ignited the thriller genre. A film that will leave you, and the main character, searching for answers."
    },
    {
      "username": "napierslogs",
      "userUrl": "https://www.imdb.com/user/ur1977084",
      "reviewLink": "https://www.imdb.com/review/rw2253461",
      "warningSpoilers": false,
      "date": "22 May 2010",
      "rate": "9",
      "helpful": "212 out of 257 found this helpful.",
      "title": "Shutter Island is at the top of its genre",
      "content": "Martin Scorsese has done it again. He pays attention to every detail in this film, making \"Shutter Island\" one of the best suspense thrillers of all time.Visually intriguing, simplistic and absolutely phenomenal. The story is kept simplistic enough so it doesn't get absurd, but allows for an ending which you probably won't see coming. The film doesn't go for cheap thrills, so although you will be on the edge of your seat you won't get needlessly scared.The film uses everything at its disposal from breathtaking scenery, to detailed laid-out shots, and to actors at their finest to completely engross you in the film. I loved every minute of it and highly recommend it to everyone. Even if you're not a usual fan of the genre, this film has so much more to it."
    },
    {
      "username": "NpMoviez",
      "userUrl": "https://www.imdb.com/user/ur69508929",
      "reviewLink": "https://www.imdb.com/review/rw4258956",
      "warningSpoilers": false,
      "date": "29 July 2018",
      "rate": "10",
      "helpful": "242 out of 282 found this helpful.",
      "title": "Movie of the decade.",
      "content": "It is one of the best movies made by director Martin Scorsese. It is perhaps the best movie starring Leonardo DiCaprio. Honestly speaking, it is one of the greatest films of the decade. DiCaprio featured in two movies in 2010, the other one being \"Inception\". Both were excellent. To this day, they are some of the best cinematic experience I have ever had. That being said, I found \"Shutter Island\" to be much more superior, as \"Inception\" feels a little bit of a mumbo jumbo many times.Good. \"Shutter Island\" is simply a masterpiece. The beginning of the movie suggests a very basic plot of a detective story, possibly a thriller. As the movie progresses, the plot becomes bigger and bigger with more and more complexity added to it. The way this happens is incredible. The pacing is really good. That is what makes the movie so interesting. And, even though the movie gets more complex, it is not difficult to keep up with the major plot points. And, the final twist is one of the best plot twists I have ever seen. I did not expect it at all. And, like the main character portrayed by DiCaprio, we are not ready to believe what is being told until a lot of reveals finally convince us. There are a lot of many things that might seem to be pointless before the final twist which are totally relevant with the story that is actually being told. The character of Edward Daniels is superbly written. We get to know where the character is coming from and we can get behind the character - yet another excellent thing about this movie. There are some dream sequences that seems like a filler, but is a major indication to the reveal. There are quite many \"illusions\" which feel very real, but carry no real meaning in the end. There are many additional things which may seem like a diversion from the story being told, but are actually enhancing it. Some dialogues between the main character and an imprisoned character get a very different interpretation after it's all set and done. So much of a complex story, yet no giant inconsistencies at all. It's just superbly written and directed and acted. It's totally different from \"Memento\" (2000) but still, has a lot of similarities. We get into the main character's head and we just get his interpretations, different types though. Towards the end, we don't want to step fully outside his head, but when we finally do, it's mind blowing. The ending moments were conceived by many to be confusing. But, if you keep up with the entire story, it's meaning is quite obvious. The movie is dark and psychologically engrossing. Yet it does have a short lived and very brief happy moment with the tiny plotline involving Dr. Cawley's motives. That's all I can say without getting into complete spoilers. Leonardo DiCaprio, Mark Ruffalo and Ben Kingsly have given some of the great performances till date. I don't have anything that bugged me. So no mixed or bad aspects of the film.Conclusion. On the whole, for me, it's the movie of the decade. The decade is almost over, and still I have not got any movie in the league of \"Shutter Island\". It's a very engaging and thrilling movie. It's one of those films I consider to be an all time great.Rating. Score : absolute 10/10 Grade : A+"
    },
    {
      "username": "Tania_Chesala_R",
      "userUrl": "https://www.imdb.com/user/ur9200651",
      "reviewLink": "https://www.imdb.com/review/rw2213941",
      "warningSpoilers": true,
      "date": "27 February 2010",
      "rate": "8",
      "helpful": "940 out of 984 found this helpful.",
      "title": "Don't be side tracked by the obvious twist.......there is more than one",
      "content": "I know there is already a spoiler warning up top but I am going to warn you again. Don't read this because I am going to give everything away.I had this movie all wrong I will admit at the start I didn't get it and I was angry but after having a chat with my friend who went with me we both gasped when we realised what happened. The twist wasn't that he was the inpatient (seriously I think everyone saw that coming from a mile away!) the twist was the intervention actually worked. He was cured, he deliberately made it look like he relapsed because he did not want to live with the memory of what happened to his family. He blamed himself for ignoring that his wife was clearly unstable. The line \"would you rather die as a good man or live as a monster\" Depicted he wanted to die as a good man (lobotomized) then live with the memory of what happened. Also the symbolism of fire and water tells you when he is hallucinating (fire) and when he is lucid (water trickling through.) The delusion he concocts to save himself from accepting the truth is that his wife died in a fire. All the people he talks to surrounded by fire is a hallucination – the woman in the cave, the patient in the cell, the scarred faced man who he thinks killed his wife, the car blowing up – all a delusion. The water symbolizes reality trying to break through. He is afraid of water – ( and rightly so!His kids were drowned, they all died in front of the lake.) Also at the start he says he gets 'sea sick' – he is mortally afraid of water. He has to swim to get to the lighthouse.To truly get the best affect of this movie you have to see it more than once. (I have only seen this once but I promise you I will see it again)I think John Anderson from the Wall Street Journal got it right when he says the film - \"requires multiple viewings to be fully realized as a work of art. Its process is more important than its story, its structure more important than the almost perfunctory plot twists it perpetrates. It's a thriller, a crime story and a tortured psychological parable about collective guilt.\""
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2455465",
      "warningSpoilers": true,
      "date": "8 July 2011",
      "rate": "9",
      "helpful": "40 out of 51 found this helpful.",
      "title": "I know it's convoluted and slow, but stick with this one...really.",
      "content": "2010 was very good to Leonardo DiCaprio. Shedding his pretty little boy image, he played in two very gritty and similar films, \"Shutter Island\" and \"Inception\". I saw them both and enjoyed them both. And, to buck the tide, I'd have to say I actually liked \"Shutter Island\" a little more...really. Now do NOT just rush out to rent this one, as I can't see this film appealing to everyone. It IS confusing. The plot can feel a bit tiresome and slow. But, if you are very patient, it all comes together perfectly--with the last 15 minutes totally enthralling me. I think part of it is because I am a retired psychotherapist and psychology teacher--and the film is a great psychological drama. And, the story actually is consistent psychologically and is actually plausible.Now I could recap the plot, but currently there are something like a bazillion reviews on IMDb for this film. Instead, let's talk about what I liked. First and foremost, the writing was simply great--very intelligent and well-crafted. It really makes you think and doesn't underestimate the audience's intelligence. Second, the acting is really good. DiCaprio was excellent, but having Ben Kingsley and Max Von Sydow REALLY made this a wonderful picture. Watch this one...it's currently on premium cable. And, it's also a film that bear re-watching as there are many layers to the film you won't notice the first time."
    },
    {
      "username": "dvc5159",
      "userUrl": "https://www.imdb.com/user/ur3798706",
      "reviewLink": "https://www.imdb.com/review/rw2237493",
      "warningSpoilers": true,
      "date": "16 April 2010",
      "rate": "8",
      "helpful": "233 out of 315 found this helpful.",
      "title": "I can't look away...",
      "content": "Finally, a horror/thriller that actually, genuinely scares the crap out of you. Not because it has fancy villains in masks or sadistic buckets of gore throughout. No, it scares you because it messes with your mind. Most will hate this movie, they don't like their brains being tampered with. I loved it. It's what we needed after all those gory R-rated and sometimes lame-duck PG-13 horror crap-fests.The horror/thriller genre has been raped lately, with gore and scantily clad- women replacing the noir and terror that Alfred Hitchcock perfected in the '50s and '60's. Here director Martin Scorsese delivers in full blast, crafting a thriller in his own unique vision. The atmosphere throughout the movie is tense and unsettling. Slow as it may be, but it is crucial to the movie and it's genuinely gripping. Your attention WILL not be lost. The scenery is beautiful and finely done with no excessive lighting, grain or darkness. The editing by Thelma Schoonmaker is fluid and pitch-perfect, and never makes the film lose focus. The movie is based on a book by Dennis Lehane and is packed with twists and turns that will leave you breathless and uneasy. The movie cranks the breathlessness and uneasiness up to the power of 5. The music is also perfectly suited with the scenes. There is sometimes no music during suspenseful moments, and sometimes the music makes the scene even more disturbing and memorable. Alfred Hitchcock's noirish thriller style is back with a vengeance, here to teach today's moviegoers the REAL meaning of suspense and horror.All the actors in the movie are in top-form. Once again, you can't go wrong with a Leonardo DiCaprio/Martin Scorsese collaboration. As the protagonist, we the audience are thrust into his shoes and we are about as confused and scared as his character is, we feel what he feels. It becomes a psychological trip that poses many, many questions about oneself, that to discuss them here would spoil the entire movie. There are some flashbacks in the movie, but all of them are important clues to DiCaprio's character. DiCaprio gives a stunning performance, once again tempting the Academy to give him another Best Actor nomination. DiCaprio gives a vivid portrayal of a vulnerable, haunted and ultimately terrified man. Apart from DiCaprio there's really not much I can say about the supporting cast, because they are all also terrific. Ben Kingsley; Mark Ruffalo; Michelle Williams; Max Von Sydow; Jackie Earle Haley; Emily Mortimer; Patricia Clarkson; Ted Levine; Elias Koteas; John Carroll Lynch. All of them.In short, this is a psychological and frightening masterpiece that will make you scared, will make you think, and will make you seek psychological help. This is one of the best films of the year. See it, go in with an open mind and prepare to be blown away.Overall value: 9/10."
    },
    {
      "username": "davidmvining",
      "userUrl": "https://www.imdb.com/user/ur110212703",
      "reviewLink": "https://www.imdb.com/review/rw6757160",
      "warningSpoilers": true,
      "date": "29 March 2021",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "One of Scorsese's best",
      "content": "This movie's ending is a case study in how to read movies. If you consider what was said before, what was done before, and the basics of the character's journey, there is literally only one way to read the movie's final moments. Everything up to that moment builds to the finale is designed to feed a specific end point, and it helps the movie as a whole that everything up to that point is incredibly well done. Scorsese had one early foray into big budget filmmaking with New York, New York, which wasn't really any kind of success, but his turn into big budget filmmaking with another two decades of experience under his belt has been far more successful as he is able to still coax quality performances from his actors while working with more traditionally narrative based scripts (this time based on a novel by Dennis Lehane) and much more intricate and larger production design.Off the coast of Massachusetts lays Shutter Island, an old Civil War fort that has been repurposed into a mental hospital for the criminally insane. A mystery pops up when one of their patients has disappeared from her cell and two US Marshals arrive on the ferry. These are Teddy Daniels (Leonardo DiCaprio) and Chuck Aule (Mark Ruffalo). The movie begins with ominous tones from the soundtrack as the ferry emerges from the fog, and Teddy is having trouble with sea sickness. Getting on the island, everything feels off from the get go. The guards are watching them too closely. They're required to give up their firearms. They're not allowed to see any of the hospital personnel files. There's a German doctor of high position less than a decade after the end of World War II. The guards don't even seem interested in looking for the lost patient. Patients and personnel all seem coached and artificial, and behind it all is Dr. Cawley (Ben Kinglsey).Nothing about the story of Rachel Solando disappearing from her cell makes any sense, up to and including the need to send for US Marshals and to hamstring them from any kind of real investigation at the same time. How could she have gotten by so many orderlies? How could she vanish for so long without her shoes? How could she wander the grounds without shoes at all considering the rough terrain of the island? The staff, in particular Dr. Cawley, are obviously hiding something from Teddy, and Teddy's going to figure it out.He and Chuck are not long term partners, Chuck having met Teddy for the first time on the boat, so Teddy tells Chuck his real reason for taking the case. He's heard things about Shutter Island, stemming from stories he's heard about the man who lit the fire in the apartment building he was living in that killed his wife. He's there, but there have also been tales of sick experiments being run on the patients, particularly in Ward C built from the actual fort while the rest of the hospital was made of the troops' barracks. Teddy's going to get to the bottom of this and blow the whole thing up to the world.It's a paranoia infested plot that involves anti-communist agents, young and innocent socialists, and a power mad doctor, and it's all in Teddy's mind.The main strength of this movie really is Teddy's descent into madness and how it's masked for so long as a him getting closer to the truth. That manifests in particular through memories and dreams. Teddy was a soldier in World War II and helped liberate Dachau, and he's consumed by the memory of the commandant killing himself poorly and dying in a pool of his own blood as well as the piles of bodies in the ice and snow and his part in the quick execution of the SS guards. He also has dreams of his departed wife in their apartment. There's a mysterious presence of water, and her back is hollowed out and ashy from fire as she crumbles in his arms.As the story progresses and Teddy becomes convinced that Dr. Cawley is feeding him drugs in the food, water, and even cigarettes, the visions become more pronounced in his waking life. His wife and a little girl appear before him, and he talks to them directly without anyone else seeing them. However, because the movie is told really strictly from Teddy's point of view we don't have any other information until later that the exact opposite is happening, that he's in withdrawal from the drugs that he had been on before a couple of days before.The reveal at the end in the much talked about lighthouse is a gut punch. The true nature of Teddy's sickness, the true history of his wife and how she died, it's all inexorably tied to what we've seen before, and the audience wants to reject that reality as much as Teddy does. It's horrible what Teddy went through, and his insistence on living in a fantasy world of Nazi experiments suddenly makes so much more sense.Now, the reading of the ending. There's really only one interpretation of Teddy's final choice. If we have all this talk of running from the past, of having a choice of becoming a monster or staying a good man, what possible explanation could there be other than Teddy is completely self-aware when he says the fateful words that lead to the final surgery? If not, then the rest of the movie was just a series of random events that don't mean anything, but if those events do mean something then the ending means that Teddy is making his choice in full command of his facilities. He's faced with the truth of his actions, of his past, and of his wife, and he can't take it. He can either descend back into madness or he can remove himself from that completely, and he chooses removal.This is such a natural follow up to The Departed for Scorsese. Both are about identity, about making choices of who we are, but Shutter Island is firmly within the psychological horror genre while The Departed was a crime movie. There's so much to chew on for the audience on these questions of who we choose to be based on what came before us.On top of all that, this movie is gorgeous to simply look at. Up until this point, this is Scorsese's best looking movie (Silence, I think, ends up even prettier). The deep blues and greens of the island, the storm, and the dark corridors of Ward C along with the bright red of the old barracks all provide this wonderfully rich color palette that is wonderfully pleasing to the eye. Lensed by Robert Richardson who had worked with Scorsese on Bringing Out the Dead and The Aviator (where color had been rather precisely designed to recreate color photography from different eras of Hollywood's history), the movie just looks fantastic.DiCaprio gives a very good performance as Teddy, steadily losing his mind as he goes deeper into the mysteries of the island. Ben Kinglsey balances right between professional, menacing, and caring in ways that make perfect sense within their contexts but add up to a man frustrated in his quest to help a sick man. Michelle Williams is wounded and also rather terrifying as Teddy's wife, Dolores. There are very small parts from Elias Koteas as Andrew Laeddis, the man Teddy's trying to find, and by Jackie Earle Haley as George Noyce, a patient who'd received a beating. I suppose the only weak link is Mark Ruffalo as Chuck. He's fine as the clueless US Marshal in over his head early, but he feels kind of empty late in the film when his true nature appears.Still, this movie is great, and it's one of Scorsese's best. Intelligently written by Laeta Kalogridis, beautifully photographed by Robert Richardson, and scored by a variety of classical music arranged by long-time Scorsese collaborator Robbie Richardson of The Band, Scorsese's Shutter Island shows the advantages of a master of the craft given a large budget to fully tell a story that appeals to him."
    },
    {
      "username": "TheDeadMayTasteBad",
      "userUrl": "https://www.imdb.com/user/ur4620781",
      "reviewLink": "https://www.imdb.com/review/rw2211895",
      "warningSpoilers": false,
      "date": "23 February 2010",
      "rate": "9",
      "helpful": "716 out of 880 found this helpful.",
      "title": "All it Takes is One Line of Dialogue to Make an Impact...",
      "content": "There is one line of dialogue, right at the end of Shutter Island before the credits roll, that elevates the emotion of the film and makes it much more powerful. For those of you, like me, who read and enjoyed the novel before seeing the film and felt that the trailers and advertisements for this film were leading you to believe there wouldn't be any narrative surprises in store, think again! Scorsese's film features that one brief piece of dialogue at the films conclusion that results in an entirely different perception of the final act. The rest of the film, however, is very faithful to Dennis Lehane's already great story.Shutter Island represents exactly what one should hope for when seeing a novel being interpreted to film. While it certainly does the source material justice, it also adds small changes that make for a distinctive experience. Even if you've read the novel multiple times, you'll feel like you're reading the book for the first time again while watching. Scorsese perfectly recreates the menacing atmosphere of the island on film. Every location is foreboding and drenched with hints of unseen danger in dark corners. The lighthouse, the caves, the civil war fort housing \"the most dangerous patients,\" and the island itself--every locale seems large yet claustrophobic and isolated at the same time.I often experience claustrophobia myself and there are certain films that really capitalize on that personal fear and make it more relevant and eerie to me. Neil Marshall's The Descent was one such picture, and this is another. An confined island is a terrific horror location and it comes with its own type of fear. The utter desperation to escape from a persistent and confined nightmare is something Teddy (Dicaprio) is receiving in high doses, and so does the audience.As with Scorsese and DiCaprio's previous collaborations, this is a movie that must be seen. Here they explore the horror/thriller genre with gravitas, with no small part played by Laeta Kalogridis in supplying the screenplay. While most modern pictures of its kind lack character or any real sense of suspense, Shutter Island doesn't go for cheap gags. I concur with Ebert when he says one of the key elements to this film is that it releases its tension through suspense instead of mindless action sequences. That's not to knock a well-deserved frenetic scene of violence every once in awhile--it works to the advantage of some films like Evil Dead II and Planet Terror--but had Teddy and Chuck gone running and gunning through the facility's faculty, the mood this movie keeps in check so well would have been lost.However, that mood isn't sacrificed and \"spooky\" is punched up to full force. A considerable amount of that spooky is generated by a \"best of\" collection of actors that have mastered the art of creepy: Ben Kingsley, Jackie Earle Haley, Ted Levine, and Max Von Sydow just to name a few. Had Tom Noonan been thrown in the cast as well, my \"Top Five People I Would Not Want to Be Left in the Dark with, Especially in a Room with No Doors or Windows\" list would have been completely exhausted. On that note, is it just me or has Sydow mysteriously not aged since The Exorcist? Was there a secret pact made between Lucifer and Father Merrin? Whether he sold his soul or not, he's quite ominous in every single scene he is present in. All of this great talent in front of the camera doesn't mean anything though if you don't have a faithful orchestrator behind it. Luckily you have Scorsese leading the lens and he points the movie in the right direction, even if this isn't among his very best works. His style works amazingly with suspense laden projects and at times he even seems to channel Hitchcock and Kubrick, though there's always something distinctively Scorsese about the presentation. I found the editing in the opening scene, with Chuck and Teddy approaching Shutter Island, to be very odd and frantic, though I think the audience will know why Scorsese displayed the scene the way he did after completing the film.With a body of work so impressive, Shutter Island is among captivating company. The good news is that Shutter Island carves out a place of its own in his resume. While no Goodfellas or Raging Bull or Taxi Driver, I have no problem placing Shutter side by side The Last Temptation of Christ and Bringing Out the Dead. The cinematography is bright and gorgeous. Scorsese doesn't rely on the over-grainy, ugly presentation that most modern horror or suspense-riddled thrillers rely on. He uses lush, bright color during daytime and dream sequences to flush out a distinct feeling of terror.Shutter Island isn't just a pretty face, its also got a great story to boot and this is why I've been anticipating the film for so long. As mentioned earlier, I've been exposed and digested the source material myself before seeing the movie. I was worried the trailers for the film were giving away too much through their spots on television and on the silver screen, but Scorsese has added enough to the film for the story to feel fresh even for those \"in the know.\" You are transferred in the films paranoia and phobia once the camera pans through the mental facilities open doors. Lehane is one of the luckiest authors on the planet to have his work adapted to the big screen by talents such as Eastwood and Scorsese, but his work is brilliant and deserving of such treatment.At the risk of spoiling plot points for potential viewers who have not read the book, I'll leave a Related Recommendations section concealed in \"Spoiler\" tags. Discussing this story at any length can be quite revealing."
    },
    {
      "username": "Ch4ndler_B1ng",
      "userUrl": "https://www.imdb.com/user/ur89818312",
      "reviewLink": "https://www.imdb.com/review/rw5537713",
      "warningSpoilers": true,
      "date": "9 March 2020",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Best Film of the Decade...",
      "content": "68% on Rotten Tomatoes, really?This movie has multiple meanings but at times it is hard to explain the meaning because you can't find the words to describe it. So I'm going to try and keep it easy to understand.At the beginning we see our main character, Teddy Daniels a.k.a. Andrew Laeddis (as we find out towards the end) throwing up on a ferry saying it's because he is seasick, but now I get it. He is throwing up because he so horrified by his past, his wife killing his three children by drowning them and him shooting her in the stomach that he gets sick every now and then. Ben Kingsley's character says that Dr Sheehan is overseas, which we find out is actually Andrew's psychiatrist for Shutter Island. His disguise name is Chuck Aule and he tries to play the part as Daniel's buddy in this new situation.Close to the introduction of the film, we see the cops handling rifles when Daniels gets out from the ferry, this is because he is a dangerous patient and we have no idea when he is just going to get mad and kill somebody. He has had a short temper ever since the death of his wife and his three children. When you first watch the movie, you don't realise why the cops could be handling the rifles when Teddy is around, that is the genius of Scorsese. Second time around, you notice something odd about the way people act around Andrew, they're scared of him, they try to act civil around him but the freak out!The one scene where Teddy and Chuck are interviewing patients and he comes across that one female that seems fine, he asks her, \"Have you ever seen a patient called Andrew Laeddis?\" she answers back, frightened, \"Nope, never heard of him\" and runs out crying, that is because she is legitimately afraid of him.And if you pay real close attention the name that Teddy gives his wife, Rachael Solando and the detective name he gives himself Teddy Daniels spells out the real names of the two. R A C H A E L S O L A N D O D O L O R E S C H A N E L T E D D Y D A N I E L S A N D R E W L A E D D I SDefinitely check this movie out, my favourite film of the 2010's and by far one of my favourite psychological thrillers. Grade: A+"
    },
    {
      "username": "stednitzrules250",
      "userUrl": "https://www.imdb.com/user/ur21227228",
      "reviewLink": "https://www.imdb.com/review/rw2210881",
      "warningSpoilers": false,
      "date": "21 February 2010",
      "rate": "10",
      "helpful": "1,073 out of 1,258 found this helpful.",
      "title": "No one likes to be messed with.",
      "content": "Shutter Island. A film that will divide the film community. A film that will leave many upset, and hating it. A film that has already completely split the critics. A movie that messes with you. And no one likes to be messed with. And that is exactly where it exceeds. Think I'm contradicting myself? Shutter Island is one of the most well crafted psychological thrillers to come by since Silence Of The Lambs. And it is no coincidence both were brilliantly written novels. Shutter Island is adapted by a book written by Dennis Lehane (wrote gone baby, gone and mystic river). It is a book filled with twists and turns, that will leave the reader dizzy. And, that is what it's film counterpart does to the fullest. Martin Scorsese helms the director chair, in a movie where he is more free than any before. This is Scorsese at his most unrestrained. Marty takes what he has learned from the great films of the past and puts it into his. The master of suspense Alfred Hitchcock's influence is everywhere you look in this film. And it is no wonder, considering Scorsese even showed one of his greatest works to the crew: Vertigo. And many of those ideas are present in Shutter Island; the cliff scenes scream Hitchcock. This is a film that creeps and crawls, and is filled with dark corners. And it is all heightened by the coming storm that looms over the island. This is classic film noir. The story follows Teddy, a federal Marshall, and his partner Chuck (Played by DiCaprio and Ruffulo). They go to this mysterious island enveloped in fog to investigate an escape. From these opening scenes, Marty has set up a dark and creepy premise. Almost the whole movie incorporates this story as Teddy desperately tries to find the truths he seeks. Teddy is shown as a scared man; a man of war and violence as portrayed in various flashbacks. These will go on to be increasingly important as the story progresses. We follow Teddy on his quest, through every dark corridor and perilous confrontations. Slowly, we are given pieces to the puzzle, but the audience does not even realize it. For we, like Teddy, are blind. For the moment at least. It is because of this that the thrilling conclusion will leave many blindsided. But, you see, that is where this thriller becomes something more. We as the audience are put in Teddy's shoes, and we feel all the things he feels. It is a complete assault on the senses, and it works beautifully. This is a film you must watch carefully. That is another thing that sets this apart, it is a horror film that makes you actually think. In this day and age, I'm not surprised some found it terrible esp. after their brains have been turned to mush by these new gore filled horror films. Scorsese's ultimate goal here is to wake you up. And trust me, you probably wont like it. This is also a film I would recommend seeing a second time. In fact, it is even better the second time. All those pieces of that puzzle you didn't catch the first time, you will the second. You see, we as the audience are first put in the shoes of Teddy. The second? Well, without giving too much away, lets just say you are put in someones else's shoes entirely during the second viewing. Shutter Island. A film that will make you question your own sanity. A film that will leave you breathless. A film that has re-ignited the thriller genre. A film that will leave you, and the main character, searching for answers. 10 out of 10 -CLS"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2291294",
      "warningSpoilers": false,
      "date": "6 August 2010",
      "rate": "9",
      "helpful": "20 out of 29 found this helpful.",
      "title": "Atmospheric and clever- really makes you think deep",
      "content": "I like Martin Scorsesse a lot, and I was interested in seeing Shutter Island. It had a truly intriguing concept and my 17-year old sister was raving about how brilliant the film was. Shutter Island is not Scorsesse's best, but it was atmospheric, clever, incredibly thought-provoking and somewhat disturbing too.I do agree it is too long and that it drags in places, that Shutter Island is still very impressive and gripping. The cinematography is great, dark, expressionistic and Gothic. Same with the scenery which is both picturesque and bleak, while the direction is superb, almost operatic and imaginative. The screenplay is intelligent and the plot gripping and clever, however Shutter Island is one of those films that if you miss a line of dialogue or a plot point you are in danger of missing something important. I also liked the music- admittedly the repeated bass motif which has a knock-on-the-door effect makes us think immediately that something out of the ordinary is going to happen but I have to admit it was haunting, while the Mahler chamber music piece along with the more gut-wrenching images at Dacchau was put to effective use, though coming from a classical music enthusiast I never knew Mahler wrote chamber music.The acting is very good, Leonardo DiCaprio and Ben Kingsley are both excellent, and Mark Ruffalo was surprisingly good too. Max Von Sydow is also good, and although I wasn't sure about Michelle Williams at first she was suitably eerie and haunting. Finally the ending, some have said it was clever, others were underwhelmed by it. For me, I found it very clever and it was actually the part of the film that made me think about most. Of course it leaves questions rather than answers, but I think that was the point, it is ambiguous and open to interpretation and I certainly would have never thought of that. There could also be the possibility that there is no right or wrong answer, we are left to wonder for ourselves whether he was sane or not, and I think that was a reason for why the film ended inconclusively- I for one asked myself what did happen to Ted? Overall, very gripping and clever, with an ending that really makes you think. It is not what I consider a perfect film, but the direction and acting makes up for any misgivings. Plus it is probably a film you need to see more than once to completely understand or appreciate it. 9/10 Bethany Cox"
    },
    {
      "username": "Irishchatter",
      "userUrl": "https://www.imdb.com/user/ur23577930",
      "reviewLink": "https://www.imdb.com/review/rw3383115",
      "warningSpoilers": true,
      "date": "29 December 2015",
      "rate": "9",
      "helpful": "12 out of 16 found this helpful.",
      "title": "A fantastic film with DiCapro",
      "content": "I thought this film was fantastic, i wouldn't call it scary or easily frightening, I would call it a mystery thriller masterpiece. As usual with Leonardo DiCapro, he was always excellent at playing the right roles. Gee, he had to play two characters - Ted and Andrew which could make you confused to which one is he really acting as. That must be really challenging but i say Leonardo is well able to do any role at the same time!I liked the fact this was based on a mental asylum on an island because it just gives you the curious feeling of what will happen next. You really don't to skip a minute or two to not see the full movie since you just gotta find out what really is going on. Although be warned, you will just get one jump-scare. Its the scene where Andrew shot his wife after she killed their three children and you wouldn't have expected it since it was so fast!This is a really great masterpiece of DiCapro's work, I give this movie 9/10 :)"
    },
    {
      "username": "talkymeat",
      "userUrl": "https://www.imdb.com/user/ur20878175",
      "reviewLink": "https://www.imdb.com/review/rw2249945",
      "warningSpoilers": true,
      "date": "14 May 2010",
      "rate": "10",
      "helpful": "37 out of 50 found this helpful.",
      "title": "A Dark Brooding Masterpiece.",
      "content": "Shutter Island centers around two U.S. Marshalls who must search for a missing patient on said island, which has a large complex specifically designed for harboring the most violent and disturbed mental patients. Agent Teddy Daniels and his partner must try to understand the mysteries of Shutter Island while attempting to unearth a plot that may go all the way up to the men who run it.Shutter Island is a very unique and interesting movie. The acting, directing, and the script are all excellent as can be expected in a Scorsese movie. But the quality that sets this apart from most of his previous works is the tone and genre. Scorsese does an amazing job of creating a haunting and dark tone that fits such a suspenseful movie very well.The twist is also very good, even though it was given away by the trailers. At the end of the movie it is revealed that Leonardo DiCaprio is a patient on Shutter Island and everything that has happened has been an attempt to allow him to live out his delusion of a missing patient and two U.S. Marshalls investigating a secret plot. This idea is a bit far fetched, but that is easily forgivable when you consider how well it was interwoven into the plot.Upon watching it a second time I noticed all the subtle hints that were placed throughout the movie. That is another quality of Shutter Island that I admire; it's re-watchability. After you know what Leonardo DiCaprio is, it makes the second viewing an entirely different and highly enjoyable experience. You can find all the things you missed the first time and understand all the things that seemed vague and confusing when you didn't know where it was going. The only real gripe I have would be that Scorsese never really captures true emotion here. The scenes that are supposed to resonate don't really pull you in like they should, specifically the scene by the lake with his wife and kids. Not to say that you don't care about the characters just that it misses the mark somewhat in the drama department. Shutter Island is a very underrated movie and ranks with some of Scorsese's best. His trip into suspense/mystery actually works very well and he captures a tone that I've never seen before. Somewhere between horror and suspense he finds a gray area that gives Shutter Island a feeling all it's own. Certainly worth watching and re-watching again and again."
    },
    {
      "username": "slothhead54",
      "userUrl": "https://www.imdb.com/user/ur22864481",
      "reviewLink": "https://www.imdb.com/review/rw2208699",
      "warningSpoilers": false,
      "date": "17 February 2010",
      "rate": "9",
      "helpful": "519 out of 737 found this helpful.",
      "title": "Of all the movies in theatres to see, this is worth your time",
      "content": "I just saw Shutter Island this evening, just prior to its American release. I have to say this film was full of intrigue. Prior to viewing this film I had built a preconceived notion of what this thriller was going to be like because I was fooled yet again by good marketing when watching the trailer. This is probably not the movie for your average film-goer who wants an easy plot line to follow and little thought required. This movie does challenge the viewer physchologically and definitely holds your attention all the way through. For someone who was never much of a Leonardo fan, his performance is brilliant, so much range to his character. In fact all of the acting in this film is excellent. The directing is probably the best quality to this film. I always enjoy watching a film that is as unpredicatable as this film and where the director has turned the plot line on to his viewer."
    },
    {
      "username": "bain0038",
      "userUrl": "https://www.imdb.com/user/ur1943056",
      "reviewLink": "https://www.imdb.com/review/rw2209546",
      "warningSpoilers": false,
      "date": "19 February 2010",
      "rate": "10",
      "helpful": "376 out of 557 found this helpful.",
      "title": "Don't miss this one - review from a skeptic.",
      "content": "From the look of the trailer, Martin Scorsese's \"Shutter Island\" looks more like a horror film This is a dangerous place where isolation rules under fascist control. A U.S Marshall is sent to an asylum to investigate a missing patient but discovers so much more. A demon? A ghost? Something more? Is this going to be as disappointing as I think it is?I was skeptical walking into the theater, wondering if this twist could hold water. The film starts with Teddy Daniels and his new partner, Chuck, standing on a ferry. They talk about their assignment. What's suspect here is that there is no additional development. We are bam, smack right into the story without so much as an opening montage. All that we see is the men smoking a couple cigarettes. Though this is what begins as momentous development. As our hero smokes we that this isn't the glorified top lit smoking of a beauty or that of a sophisticated and confident gangster. We see that this is a harsher character with poor posture, someone who doesn't sleep well, someone with a deep past They are greeted at the gate by guards whose attitudes' seem immediately suspect. Soon we meet Dr Crawley, a seemingly complex and modern man who runs the asylum. However, he soon turns uncooperative with the investigation. Inmates and staff are hiding something but what? Everyone here seems off. Evidence and clues begin to appear but not before our hero seems riddled by psychosis himself. \"You act like all this madness is contagious.\" Daniels says to the guard. Is it? Soon we begin to wonder, too, but not before he uncovers the tip of the iceberg and it's not only painfully intimate with his own past but also a mass conspiracy. The Nazis had concentration camps and the Americans have Shutter Island.Though, it doesn't stop here, but to say anything else would do the story injustice Kingsley is in his finest role in years. Similarly, DiCaprio reaches new levels. Amongst others Elias Koteas, Ted Levine, Michelle Williams, all play small but wonderful roles. Robert Richardson captures a world all of its own.While Scorsese is a master of film I'd say that his specialty has been more character than story. This is a fresh balance of both. It's a mix of noir and thriller. It's only sort of a horror movie and could be compared to \"The Shining\" but it makes it look like it's a one trick pony. All this praise being said it's not for everyone. The story is complex. It takes some attention. At times it's a bit bleak and dire. Of course it all makes a little less sense when you actually think about it but then again that's film. There are a couple of moments where the story gets lost within itself. Things become a bit too complicated. At this point you might begin to lose faith in its viscosity, but don't worry because the story has you right where its put you."
    },
    {
      "username": "IamtheRegalTreatment",
      "userUrl": "https://www.imdb.com/user/ur2130094",
      "reviewLink": "https://www.imdb.com/review/rw2209541",
      "warningSpoilers": false,
      "date": "19 February 2010",
      "rate": "9",
      "helpful": "203 out of 334 found this helpful.",
      "title": "Counting down the days until I can add this to my DVD collection...",
      "content": "Similar to my rating for this film, you can argue that 9 out of 10 people who watch this movie, it will not be their first Scorsese film. Most of us know the genius that he is and coming into this showing we should expect brilliance, and gladly he delivers a captivating storyline driven by great acting. Unfortunately with the release of Shutter Island was also a press release that Taxi Driver may be remade, so that news made me hesitant to care, but I'm glad I was wrong.Shutter Island is the story of Teddy Daniels, A U.S. federal marshall sent to the island with his partner Chuck Aule to search for the disappearance of a patient. Each scene provides a turn against their leads and compels them to look for more whilst searching in places we couldn't comprehend, including their minds. Leonardo DiCaprio and Mark Ruffalo feed off each other and supply great performances for their characters as expected, but some of the other characters whose names are riveted on the posters or marquees are sensational as well. The two that stuck out to me most were Ben Kingsley (Dr. Cawley) and Michelle Williams (Dolores, Teddy's wife), each of whom brought so much dramatics and new questions to the movie, developing plot twists and controversy. I don't think this film would be the same without them.Even to begin explaining details of the plot and how everything comes to fruition causes me to feel migraines alike the ones Teddy gets in the movie, therefore I won't ruin anything for you now. Take my honest word that if you enjoyed any Scorsese movie in the past or have enjoyed movies that include surrealism, Shutter Island combines the two into an intense thriller that boggles the mind and possibly even \"corrode it, rusts it\". Also, if you are hesitant to watch this film because the trailer perceives it as a horror film with a lot of \"jumpy\" scenes, ignore that. I had the same feeling entering it, and there was only one towards the very end, but it was worth the shock. You will miss so much detail trying to cover your eyes for a few minutes sporadically throughout that it's not worth it. Take the risk of jumping out of your seat for once, because it was the best scare I could ask for.9/10. Not Martin's best work, but come on, could you make a better movie than him?"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2303355",
      "warningSpoilers": false,
      "date": "30 August 2010",
      "rate": "8",
      "helpful": "9 out of 13 found this helpful.",
      "title": "OK, Play with My Mind!",
      "content": "I was told on several occasions to skip this film. While I felt it took a long way to get to the point, I found it intriguing and engaging. I've really grown to like DeCaprio and find him to be an interesting actor. One reviewer did criticize him for hanging around the dark side a bit much, but that could be said about Nicholson and a host of others. This is one of those mind puzzles that force one to guess a good deal. Because of the pace, I eventually figured it out. Nevertheless, it is told in a very interesting way. With \"Inception\" capturing the box office recently, this seems a mild effort to explore the subconscious. It is multi-layered and complex. It throws curves and red herrings, but I never felt toyed with. This is certainly worth a shot."
    },
    {
      "username": "Rainey-Dawn",
      "userUrl": "https://www.imdb.com/user/ur35635716",
      "reviewLink": "https://www.imdb.com/review/rw7391864",
      "warningSpoilers": false,
      "date": "29 September 2021",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Mystery Fans Must See!",
      "content": "This is by far one of the best mystery-thrillers ever written! Twists and turns that will shock and a story that will keep you on the edge of your seat - a must watch!U. S. Marshal Teddy Daniels investigates an asylum for the criminally insane, he is looking for a missing patient. When the missing patient is found, Daniels finds he has other mysteries to uncover.10/10."
    },
    {
      "username": "blackmambamark",
      "userUrl": "https://www.imdb.com/user/ur8400419",
      "reviewLink": "https://www.imdb.com/review/rw2208608",
      "warningSpoilers": true,
      "date": "16 February 2010",
      "rate": "8",
      "helpful": "127 out of 218 found this helpful.",
      "title": "Once again, Scorsese has helped redefine a genre'",
      "content": "Sure everyone knows the typical Scorsese film. Normally there is a mob present, or in most cases, a tough brute who loves to flash the \"F\" bomb in almost every sentence. But what about a thriller? I mean sure, we have seen it in \"Cape Fear\", probably one of my personal favorite remakes. But what about a top notch mind bending thriller that really makes you think. Something the likes of which we have never seen Mr. Scorsese do. But given his previous works of art, its really hard to doubt that he cannot pull this off.Grasping the concept of this movie is a no brainer. There is a mystery on this island filled with crazy people, but you can tell that there is a lot more under the surface. Yeah, it doesn't sound that original........but my oh my, you just wait until Scorsese begins to pick at your brain. Not since \"Taxi Driver\" have i seen Scorsese really make a valiant attempt at a character study of someone going insane. In \"Taxi Driver\", its like your in the back seat......watching as Robert Deniro slowing progresses into his insanity. With Shutter Island, its like your inside the mind of Dicaprio, and everything is starting to crumble. Scorsese really does a fantastic job of toying with your mind. You cannot help but second guess everything your thinking, but then again, i think that was the ultimate goal.......and yes, that was hint towards the end, which i think will raise a lot of debate. Now i always hear the phrase \"Twist and Turns\" when someone describes a decent thriller. Then i see the movie, and i say to myself........\"That was a Twist and Turn? It felt more like a road bump.\" But in this case, Scorsese really does re-define the term. Because in this film, you really have a hard time judging what is actually real, and what is not.......and what you think is happening, is actually not happening at all..........that is a twist and turn people. Not you finally figuring out who the masked killer is at the end.......okay, im sorry that all thriller movies are not like a Scooby Doo episode. And since we are on the subject of crappy thrillers......i am so glad that Scorsese chose not to use elevated music in some of scenes. For example, someone jump out of a dark corner......in most cases, the music is raised and the audience jumps.......but in this movie, Scorsese doesn't add any music at all......he just uses the fear of an eerie set to make your skin crawl. Much like an old Hitchcock movie. However, there is music in this, and let me tell you, it is so very fitting. You can tell Scorsese has been down this path before, so he sort of used the same style that he did in \"Cape Fear\", with Benard Herman's deep, dark, and haunting tones that just pull you in more and more. Honestly, there is not one bad aspect of this movie. The acting, the directing, the score, the cinematography.....all pieced together with one hell of a script.Bottom Line........people, this is what a thriller is suppose to be. Especially a psychological thriller. I thank god for directors like Scorsese.....because this movie really isn't his type of film. My guess is he saw enough crap in this genre' and had enough.......so he threw his hat into the ring and gave a rebirth to the classic Hithcock type thriller.......not only that, i really think that he redefined it in a way. Now i know that it is really early in the year, but i can easily see this movie staying in my top 10 of this year. Absolutely fantastic film, best i have seen so far."
    },
    {
      "username": "lesleyharris30",
      "userUrl": "https://www.imdb.com/user/ur23055365",
      "reviewLink": "https://www.imdb.com/review/rw2838481",
      "warningSpoilers": false,
      "date": "25 July 2013",
      "rate": "9",
      "helpful": "9 out of 13 found this helpful.",
      "title": "Shocking and Brilliant,",
      "content": "Shutter Island is an absolute breathtaking movie with a tremendous storyline that will keep you interested all the way through and a brilliant cast that all follow through with their performances in an overall terrific film once again from the great Martin Scorsese.The movie sounded pretty plain to me,I thought it would be an average thriller that I would enjoy but it would be pretty forgettable,but it totally wasn't,the movie had me curious and also confused,and the twist was one of the greatest,most surprising and most shocking twists i've ever seen in a movie,I literally never suspected it,not even once,and when it did happen I still didn't believe it.Shutter Island is a must see for all fans of Leonardo DiCaprio,Martin Scorsese,thriller and mystery.Teddy Daniels (Leonardo DiCaprio),a US Marshall,sets out with his partner to a mental institution in a quiet island to investigate where a missing patient could have gone.But there's something suspicious about the island that they didn't bargain for."
    },
    {
      "username": "ComedyFan2010",
      "userUrl": "https://www.imdb.com/user/ur23138767",
      "reviewLink": "https://www.imdb.com/review/rw4200258",
      "warningSpoilers": false,
      "date": "12 June 2018",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Wonderful movie",
      "content": "I guess when looking at the names of director and the cast one knows that it can't go wrong. And it didn't. I loved this movie through it's 138 minutes and it didn't even seem that long.Now I can't say if the big twist towards the end was very well hidden. Unfortunately I heard it before I watched it. Which is not surprising considering that I waited almost 10 years to do so. So when watching there were moments where I would think \"Now here people should have guessed it\". Especially in the second half of the movie. But this could just be me knowing it and seeing the clues more clearly, just as people who rewatched it did. But regardless, even though I knew the ending I really enjoyed the movie so somebody who guessed it at the very beginning but still was questioning it would as well.The cinematography is great. So much film noir in it. It is a movie that gives one this suspense that keeps one watching. The cast is all great. Including the small parts of guards and mental patients. And the main characters gave so much character to the movie. I won't list all their names because I literally would list all of them. If anyone of them would played by a different actor it wouldn't be the same.And I loved the ending. I am not talking about the twist that I already discussed but the very ending. The final quote that makes us understand the ending better. I loved it. This actually took me by surprise and I think it couldn't have ended better. It gives the movie and DiCaprio's character so much more depth."
    },
    {
      "username": "Screen_Blitz",
      "userUrl": "https://www.imdb.com/user/ur24623283",
      "reviewLink": "https://www.imdb.com/review/rw3385174",
      "warningSpoilers": false,
      "date": "31 December 2015",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Twisted, somber, but hugely entertaining Scorcese thriller",
      "content": "Martin Scorcese has laid many cinematic landmarks in crime genre, and as a result, has earned a spot as one of the most influential directors to ever step foot in Hollywood. He has been met with much critical acclaim with his gritty portrayal of the gangster life in his film such as Taxi Driver, Goodfellas, Casino, Gangs of New York, and The Departed. Teaming up with his frequent collaborator Leonardo Dicaprio, Scorcese takes a more dark and surreal direction in this psychological thriller set with plenty of twists and turns. Leonardo Dicaprio plays U.S Marshal Teddy Daniels, who travels across seas to investigate a mysterious and deserted island along with his partner Chucke Aule (played by Mark Ruffalo). There lies a hospital run by Dr. Cawley (played by Ben Kingsley) and Dr. Neahring (played by Max Von Sydow) holding mentally insane prisoners, where Daniels and Aule are in search of a patient named Rachel who has mysteriously disappeared. Going further into their investigation, the two quickly turn the dark and sinister secrets behind the wretched prison of a hospital, soon to the point where Daniels deteriorating of his mental state and his identity all together. Mixing elements of neo noir and elements of pure horror, this film conveys a dark and surreal plot that unfolds to something truly shocking and well crafted in a unique way. The psychological elements conveyed throughout the story go very deep in ways that may remind those who seen films like 'Seven' or 'The Sixth Sense' as these both deal with individuals who are psychological damaged. This film paces steadily through one spine- chilling thrill after another, and as the story progresses, the tone gets more and more eerie; building up an astonishing plot twist at the end that is likely to leave you startled. Like David Fincher's 'Seven', this film never lightens up in tone, giving you the feeling of hopelessness throughout its run time, yet it's still entertaining. The plot doesn't go without its flaws however. The film has its moments where gets overly convoluted to the point I could leave you scratching your head. Ultimately, the plot picks up not to soon before it reaches its grim climax.Leonardo Dicaprio has been one of my favorite actors for as long I can remember, an actors always shows off powerful performances, yet has never landed an Oscar for his works. His performance as the main character Teddy Daniels is terrific. He is very charismatic throughout, especially when his character go through some spine-chilling changes. Mark Ruffalo who plays his partner also deserves some applause for his performance, playing his role very solid and willfully. Ruffalo is who I believe is an underrated actor and hope garners an Oscar one day (as well as Dicaprio). Shutter Island is a twisted, but stunning piece of entertainment by Martin Scorcese, complete with a terrific screenplay, powerful performances, and a strong narrative that grabs your attention. This is much different than the typical Scorcese fare. Nonetheless, it is astonishingly entertaining."
    }
  ],
  "errorMessage": ""
}