{
  "imDbId": "tt1130884",
  "title": "Shutter Island",
  "fullTitle": "Shutter Island (2010)",
  "type": "Movie",
  "year": "2010",
  "language": "en",
  "titleInLanguage": "Shutter Island (film)",
  "url": "https://en.wikipedia.org/wiki/Shutter_Island_(film)",
  "plotShort": {
    "plainText": "Shutter Island is a 2010 American neo-noir psychological thriller film directed by Martin Scorsese and adapted by Laeta Kalogridis, based on the 2003 novel of the same name by Dennis Lehane. Leonardo DiCaprio stars as Deputy U.S. Marshal Edward \"Teddy\" Daniels, who is investigating a psychiatric facility on Shutter Island after one of the patients goes missing. Mark Ruffalo plays his partner and fellow deputy marshal, Ben Kingsley plays the facility's lead psychiatrist, Max von Sydow plays a German doctor, and Michelle Williams plays Daniels' wife.\r\nReleased on February 19, 2010, Shutter Island received generally positive reviews from critics, was chosen by the National Board of Review as one of the top ten films of 2010, and grossed $299 million worldwide. The film is noted for its soundtrack, which prominently used classical music, such as that of Gustav Mahler, Krzysztof Penderecki, György Ligeti, John Cage, Ingram Marshall, and Max Richter.",
    "html": "<p>Shutter Island is a 2010 American neo-noir psychological thriller film directed by Martin Scorsese and adapted by Laeta Kalogridis, based on the 2003 novel of the same name by Dennis Lehane. Leonardo DiCaprio stars as Deputy U.S. Marshal Edward \"Teddy\" Daniels, who is investigating a psychiatric facility on Shutter Island after one of the patients goes missing. Mark Ruffalo plays his partner and fellow deputy marshal, Ben Kingsley plays the facility's lead psychiatrist, Max von Sydow plays a German doctor, and Michelle Williams plays Daniels' wife.</p><p>Released on February 19, 2010, Shutter Island received generally positive reviews from critics, was chosen by the National Board of Review as one of the top ten films of 2010, and grossed $299 million worldwide. The film is noted for its soundtrack, which prominently used classical music, such as that of Gustav Mahler, Krzysztof Penderecki, György Ligeti, John Cage, Ingram Marshall, and Max Richter.</p>"
  },
  "plotFull": {
    "plainText": "Shutter Island is a 2010 American neo-noir psychological thriller film directed by Martin Scorsese and adapted by Laeta Kalogridis, based on the 2003 novel of the same name by Dennis Lehane. Leonardo DiCaprio stars as Deputy U.S. Marshal Edward \"Teddy\" Daniels, who is investigating a psychiatric facility on Shutter Island after one of the patients goes missing. Mark Ruffalo plays his partner and fellow deputy marshal, Ben Kingsley plays the facility's lead psychiatrist, Max von Sydow plays a German doctor, and Michelle Williams plays Daniels' wife.\r\nReleased on February 19, 2010, Shutter Island received generally positive reviews from critics, was chosen by the National Board of Review as one of the top ten films of 2010, and grossed $299 million worldwide. The film is noted for its soundtrack, which prominently used classical music, such as that of Gustav Mahler, Krzysztof Penderecki, György Ligeti, John Cage, Ingram Marshall, and Max Richter.\r\nPlot\r\nIn 1954, U.S. Marshal Edward \"Teddy\" Daniels and his new partner Chuck Aule travel to Ashecliffe Hospital for the criminally insane on Shutter Island, Boston Harbor to investigate the disappearance of Rachel Solando, a patient of the hospital who had previously drowned her three children.\r\nThe staff, led by psychiatrist Dr. John Cawley, appear uncooperative. The marshals learn that Dr. Lester Sheehan, who was treating Solando, had left the island on vacation immediately after Solando disappeared. Teddy experiences migraine headaches, flashbacks of his experiences as a U.S. Army soldier during the liberation of Dachau, and also vivid dreams of his wife Dolores, who was killed in a fire set by arsonist Andrew Laeddis. Teddy explains to Chuck that he took the case to find Laeddis, believing he is on the island. Solando suddenly resurfaces and believes Teddy is her husband. Teddy later breaks into the restricted Ward C to find Laeddis where he meets patient George Noyce who appears to know him well. He tells Teddy that the doctors are experimenting on patients, some of whom are taken to a lighthouse to be lobotomized. He warns Teddy that everyone is deceiving him and tells him not to trust Chuck.\r\nTeddy regroups with Chuck and they climb the cliffs toward the lighthouse but become separated. Believing he saw Chuck's body on the rocks below, Teddy climbs down but finds only a cave where a woman claiming to be the real Solando is hiding. She states that she is a former psychiatrist who discovered clandestine experiments to develop mind control but was forcibly committed. She says that Cawley and Dr. Naehring will use Teddy's war trauma to feign a psychotic break, allowing them to have him also committed. Teddy returns to the hospital and is greeted by Cawley. When Teddy asks about Chuck's whereabouts, Cawley firmly insists that Teddy does not have a partner and that he arrived on the island alone.\r\nConvinced Chuck was taken to the lighthouse, Teddy heads there but runs into Naehring, who attempts to sedate him. Teddy overpowers him and breaks into the lighthouse, only to discover Cawley waiting for him. Teddy confronts Cawley and reveals his encounter with Solando, saying he believes Cawley is experimenting on him. Cawley denies that Solando ever existed, and insists that Teddy has not been drugged, explaining the tremors as withdrawals from Chlorpromazine, a neuroleptic medication that Teddy has been taking for two years. Chuck arrives and reveals he is in fact, Dr. Sheehan. Cawley explains that \"Teddy\" is Andrew Laeddis, a U.S. Marshal incarcerated at Ashecliffe for murdering his manic depressive wife after she drowned their three children. Andrew did not seek treatment for Dolores when she burned down their apartment and instead moved his family to a lake house, where Dolores carried out the killings. Cawley explains that Andrew's delusion is a result of his guilt, that his migraines and hallucinations are withdrawal symptoms, and that he had created the alternate persona of Edward Daniels, also a Marshal, who acted violently and espoused conspiracy theories about the facility. The \"investigation\" is an elaborate role-play to regain his true persona. Overwhelmed by his sudden recall, Andrew faints.\r\nAwakening later, Andrew calmly recounts the truth, satisfying the doctors that he is lucid. Cawley notes that they had achieved this state nine months before, but that Andrew had quickly regressed. He warns that this will be Andrew's last chance and if he lapses again he will be lobotomized due to his very violent conduct towards other patients such as Noyce, and towards the guards. Sometime later, Andrew relaxes on the hospital grounds with Sheehan. Appearing delusional, Andrew again refers to Sheehan as \"Chuck\" and says they must leave the island. Sheehan signals to Cawley, who orders that Andrew be lobotomized. Andrew then asks Sheehan if it would be worse \"to live as a monster, or to die as a good man?\" A stunned Sheehan calls Andrew \"Teddy\" but the latter does not respond and leaves peacefully with the orderlies for his operation.\r\nCast\r\nLeonardo DiCaprio as Edward \"Teddy\" Daniels, who is later revealed to be Andrew Laeddis, a US Marshall who shot his wife two years previously.\r\nMark Ruffalo as Chuck Aule, who is later revealed to be Dr. Lester Sheehan, Teddy's primary psychiatrist.\r\nBen Kingsley as Dr. John Cawley, a senior psychiatrist at the hospital, who also treats Teddy.\r\nMax von Sydow as Dr. Naehring, a psychiatrist at the hospital helping in the role-play with Teddy.\r\nMichelle Williams as Dolores, Teddy's manic-depressive wife, who set fire to their apartment and later drowned their three children.\r\nEmily Mortimer as Rachel 1, who admits to drowning her children and thinks Teddy is her husband, but is later revealed to be a nurse helping in the role-play.\r\nPatricia Clarkson as Rachel 2, who Teddy meets in a cave, and who presents herself as the real Rachel and affirms his conspiracies about the hospital, but who is later revealed as a figment of his imagination.\r\nJackie Earle Haley as George Noyce, a patient in Ward C who is later revealed to have been violently beaten by Teddy two weeks earlier.\r\nTed Levine as Warden, who later tells Teddy that he is the most violent man on the island.\r\nJohn Carroll Lynch as Deputy Warden McPherson.\r\nJoseph Sikora as Glen Miga.\r\nElias Koteas as Laeddis, the fictional arsonist that Teddy invented who he believes killed Dolores.\r\nRobin Bartlett as Bridget Kearns.\r\nChristopher Denham as Peter Breene.\r\nCurtiss Cook as Trey Washington.\r\nProduction\r\nThe rights to Dennis Lehane's novel Shutter Island were first optioned to Columbia Pictures in 2003. Columbia did not act on the option, and it lapsed back to Lehane, who sold it to Phoenix Pictures. Phoenix hired Laeta Kalogridis, and together they developed the film for a year. Director Martin Scorsese and actor Leonardo DiCaprio were both attracted to the project. Production began on March 6, 2008.\r\nLehane's inspiration for the hospital and island setting was Long Island in Boston Harbor, which he had visited during the blizzard of 1978 as a child with his uncle and family.\r\nShutter Island was mainly filmed in Massachusetts, with Taunton being the location for the World War II flashback scenes. Old industrial buildings in Taunton's Whittenton Mills Complex replicated the Dachau concentration camp. The old Medfield State Hospital in Medfield, Massachusetts, was another key location. Cawley's office scenes were the second floor of the chapel during the late evening. Lights were shone through the windows to make it look like it was daytime. The crew painted the hospital's brick walls to look like plywood. This served the dual purpose of acting as scenery and blocking the set from view of a local road. The crew wanted to film at the old Worcester State Hospital, but demolition of surrounding buildings made it impossible. The stone lodge, next to Leach Pond, at Borderland State Park in Easton, Massachusetts, was used for the cabin scene. The film used Peddocks Island as a setting for the story's island. East Point, in Nahant, Massachusetts, was the location for the lighthouse scenes. The scenes where Teddy and Chuck are caught in the hurricane were filmed at the Wilson Mountain Reservation in Dedham, Massachusetts. Filming ended on July 2, 2008.\r\nMusic\r\nShutter Island: Music from the Motion Picture was released on February 2, 2010, by Rhino Records. The film does not have an original score. Instead, Scorsese's longtime collaborator Robbie Robertson created an ensemble of previously recorded material to use in the film.\r\nAccording to a statement on Paramount's website: \"The collection of modern classical music was hand-selected by Robertson, who is proud of its scope and sound. 'This may be the most outrageous and beautiful soundtrack I've ever heard.'.\"\r\nA full track listing of the album is below. All the musical works are featured in the final film.\r\nGenre\r\nShutter Island is a period piece with nods to different films in the film noir and horror genres, paying particular homage to Alfred Hitchcock's works. Scorsese stated in an interview that the main reference to Teddy Daniels was Dana Andrews's character in Laura, and that he was also influenced by several very low-budget 1940s zombie movies made by Val Lewton. The main frame of the plot resembles that of William Peter Blatty's The Ninth Configuration, as well as The Cabinet of Dr. Caligari. La Croix noted that Shutter Island was a \"complex and puzzling\" work that borrowed from genres as diverse as detective, fantasy, and the psychological thriller.\r\nThere have been differing opinions over the ending of the film, in which Laeddis asks Dr. Sheehan, \"which would be worse – to live as a monster, or to die as a good man?\", a line that does not appear in the book. Professor James Gilligan of New York University was Scorsese's psychiatric adviser, and he said that Laeddis's last words mean: \"I feel too guilty to go on living. I'm not going to actually commit suicide, but I'm going to vicariously commit suicide by handing myself over to these people who're going to lobotomize me.\" Dennis Lehane, however, said, \"Personally, I think he has a momentary flash.… It's just one moment of sanity mixed in the midst of all the other delusions.\"\r\nRelease\r\nThe film was originally scheduled to be released by Paramount Pictures in the United States and Canada on October 2, 2009. Paramount later announced it was going to push back the release date to February 19, 2010. Reports attribute the pushback to Paramount not having \"the financing in 2009 to spend the $50 to $60 million necessary to market a big awards pic like this\", to DiCaprio's unavailability to promote the film internationally, and to Paramount's hope that the economy might rebound enough by February 2010 that a film geared toward adult audiences would be more viable financially.\r\nThe film premiered at the 60th Berlin International Film Festival as part of the competition screening on February 13, 2010. Spanish distributor Manga Films distributed the film in Spain after winning a bidding war that reportedly reached the $6 million to $8 million range.\r\nThe film also premiered at the Toronto International Film Festival (TIFF) in 2010 and the 62nd Cannes Film Festival in 2009.\r\nReception\r\nCritical response\r\nRotten Tomatoes gives the film an approval rating of 68% based on 263 reviews, with an average rating of 6.7/10. The site's critical consensus reads, \"It may not rank with Scorsese's best work, but Shutter Island's gleefully unapologetic genre thrills represent the director at his most unrestrained.\" On Metacritic, the film received a weighted average score of 63 out of 100, based on 37 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film an average \"C+\" grade, on an A+ to F scale.\r\nLawrence Toppman of The Charlotte Observer gave the film 4/4 stars, claiming, \"After four decades, Martin Scorsese has earned the right to deliver a simple treatment of a simple theme with flair.\" Writing for The Wall Street Journal, John Anderson highly praised the film, suggesting it \"requires multiple viewings to be fully realized as a work of art. Its process is more important than its story, its structure more important than the almost perfunctory plot twists it perpetrates. It's a thriller, a crime story and a tortured psychological parable about collective guilt.\" Awarding the film 3+1⁄2 stars out of 4, Roger Ebert of the Chicago Sun-Times wrote, \"the movie is about: atmosphere, ominous portents, the erosion of Teddy's confidence and even his identity. It's all done with flawless directorial command. Scorsese has fear to evoke, and he does it with many notes.\"\r\nThe Orlando Sentinel's Roger Moore, who gave the film 2+1⁄2 stars out of 4, wrote, \"It's not bad, but as Scorsese, America's greatest living filmmaker and film history buff should know, even Hitchcock came up short on occasion. See for yourself.\" Dana Stevens of Slate described the film \"an aesthetically and at times intellectually exciting puzzle, but it's never emotionally involving\". The Washington Post film critic Ann Hornaday negatively described the film as being \"weird\". A. O. Scott of The New York Times wrote in his review that \"Something TERRIBLE is afoot. Sadly, that something turns out to be the movie itself.\"\r\nKeith Uhlich of Time Out New York named Shutter Island the fifth-best film of 2010.\r\nBox office\r\nShutter Island was released alongside The Ghost Writer, and with $41 million finished first at the box office and gave Scorsese his best box office opening to-date. The film remained at #1 in its second weekend, with $22.2 million. Eventually, it grossed worldwide $294,805,697 and became Scorsese's second highest-grossing film worldwide. It is Scorsese's fifth movie to debut at the box office at #1 following Taxi Driver, Goodfellas, Cape Fear, and The Departed.\r\nHome media\r\nShutter Island was released on DVD and Blu-ray on June 8, 2010, in the US and on August 2, 2010, in the UK. The UK release featured two editions—a standard edition and a limited steel-case edition. For the tenth anniversary, Paramount Pictures released on February 11, 2020, a 4K steelbook + Blu-ray.\r\nOther media\r\nUnproduced TV series\r\nIn August 2014, Paramount Television and HBO were reported to be brainstorming a TV series called Ashecliffe, which would serve as an origin story for the film.\r\nVideo game\r\nA video game based on the film was released for PC. A Nintendo DS version was planned, but cancelled.",
    "html": "<p>Shutter Island is a 2010 American neo-noir psychological thriller film directed by Martin Scorsese and adapted by Laeta Kalogridis, based on the 2003 novel of the same name by Dennis Lehane. Leonardo DiCaprio stars as Deputy U.S. Marshal Edward \"Teddy\" Daniels, who is investigating a psychiatric facility on Shutter Island after one of the patients goes missing. Mark Ruffalo plays his partner and fellow deputy marshal, Ben Kingsley plays the facility's lead psychiatrist, Max von Sydow plays a German doctor, and Michelle Williams plays Daniels' wife.</p><p>Released on February 19, 2010, Shutter Island received generally positive reviews from critics, was chosen by the National Board of Review as one of the top ten films of 2010, and grossed $299 million worldwide. The film is noted for its soundtrack, which prominently used classical music, such as that of Gustav Mahler, Krzysztof Penderecki, György Ligeti, John Cage, Ingram Marshall, and Max Richter.</p><br/><h3>Plot</h3><p>In 1954, U.S. Marshal Edward \"Teddy\" Daniels and his new partner Chuck Aule travel to Ashecliffe Hospital for the criminally insane on Shutter Island, Boston Harbor to investigate the disappearance of Rachel Solando, a patient of the hospital who had previously drowned her three children.</p><p>The staff, led by psychiatrist Dr. John Cawley, appear uncooperative. The marshals learn that Dr. Lester Sheehan, who was treating Solando, had left the island on vacation immediately after Solando disappeared. Teddy experiences migraine headaches, flashbacks of his experiences as a U.S. Army soldier during the liberation of Dachau, and also vivid dreams of his wife Dolores, who was killed in a fire set by arsonist Andrew Laeddis. Teddy explains to Chuck that he took the case to find Laeddis, believing he is on the island. Solando suddenly resurfaces and believes Teddy is her husband. Teddy later breaks into the restricted Ward C to find Laeddis where he meets patient George Noyce who appears to know him well. He tells Teddy that the doctors are experimenting on patients, some of whom are taken to a lighthouse to be lobotomized. He warns Teddy that everyone is deceiving him and tells him not to trust Chuck.</p><p>Teddy regroups with Chuck and they climb the cliffs toward the lighthouse but become separated. Believing he saw Chuck's body on the rocks below, Teddy climbs down but finds only a cave where a woman claiming to be the real Solando is hiding. She states that she is a former psychiatrist who discovered clandestine experiments to develop mind control but was forcibly committed. She says that Cawley and Dr. Naehring will use Teddy's war trauma to feign a psychotic break, allowing them to have him also committed. Teddy returns to the hospital and is greeted by Cawley. When Teddy asks about Chuck's whereabouts, Cawley firmly insists that Teddy does not have a partner and that he arrived on the island alone.</p><p>Convinced Chuck was taken to the lighthouse, Teddy heads there but runs into Naehring, who attempts to sedate him. Teddy overpowers him and breaks into the lighthouse, only to discover Cawley waiting for him. Teddy confronts Cawley and reveals his encounter with Solando, saying he believes Cawley is experimenting on him. Cawley denies that Solando ever existed, and insists that Teddy has not been drugged, explaining the tremors as withdrawals from Chlorpromazine, a neuroleptic medication that Teddy has been taking for two years. Chuck arrives and reveals he is in fact, Dr. Sheehan. Cawley explains that \"Teddy\" is Andrew Laeddis, a U.S. Marshal incarcerated at Ashecliffe for murdering his manic depressive wife after she drowned their three children. Andrew did not seek treatment for Dolores when she burned down their apartment and instead moved his family to a lake house, where Dolores carried out the killings. Cawley explains that Andrew's delusion is a result of his guilt, that his migraines and hallucinations are withdrawal symptoms, and that he had created the alternate persona of Edward Daniels, also a Marshal, who acted violently and espoused conspiracy theories about the facility. The \"investigation\" is an elaborate role-play to regain his true persona. Overwhelmed by his sudden recall, Andrew faints.</p><p>Awakening later, Andrew calmly recounts the truth, satisfying the doctors that he is lucid. Cawley notes that they had achieved this state nine months before, but that Andrew had quickly regressed. He warns that this will be Andrew's last chance and if he lapses again he will be lobotomized due to his very violent conduct towards other patients such as Noyce, and towards the guards. Sometime later, Andrew relaxes on the hospital grounds with Sheehan. Appearing delusional, Andrew again refers to Sheehan as \"Chuck\" and says they must leave the island. Sheehan signals to Cawley, who orders that Andrew be lobotomized. Andrew then asks Sheehan if it would be worse \"to live as a monster, or to die as a good man?\" A stunned Sheehan calls Andrew \"Teddy\" but the latter does not respond and leaves peacefully with the orderlies for his operation.</p><br/><h3>Cast</h3><ul><li>Leonardo DiCaprio as Edward \"Teddy\" Daniels, who is later revealed to be Andrew Laeddis, a US Marshall who shot his wife two years previously.</li><li>Mark Ruffalo as Chuck Aule, who is later revealed to be Dr. Lester Sheehan, Teddy's primary psychiatrist.</li><li>Ben Kingsley as Dr. John Cawley, a senior psychiatrist at the hospital, who also treats Teddy.</li><li>Max von Sydow as Dr. Naehring, a psychiatrist at the hospital helping in the role-play with Teddy.</li><li>Michelle Williams as Dolores, Teddy's manic-depressive wife, who set fire to their apartment and later drowned their three children.</li><li>Emily Mortimer as Rachel 1, who admits to drowning her children and thinks Teddy is her husband, but is later revealed to be a nurse helping in the role-play.</li><li>Patricia Clarkson as Rachel 2, who Teddy meets in a cave, and who presents herself as the real Rachel and affirms his conspiracies about the hospital, but who is later revealed as a figment of his imagination.</li><li>Jackie Earle Haley as George Noyce, a patient in Ward C who is later revealed to have been violently beaten by Teddy two weeks earlier.</li><li>Ted Levine as Warden, who later tells Teddy that he is the most violent man on the island.</li><li>John Carroll Lynch as Deputy Warden McPherson.</li><li>Joseph Sikora as Glen Miga.</li><li>Elias Koteas as Laeddis, the fictional arsonist that Teddy invented who he believes killed Dolores.</li><li>Robin Bartlett as Bridget Kearns.</li><li>Christopher Denham as Peter Breene.</li><li>Curtiss Cook as Trey Washington.</li></ul><br/><h3>Production</h3><p>The rights to Dennis Lehane's novel Shutter Island were first optioned to Columbia Pictures in 2003. Columbia did not act on the option, and it lapsed back to Lehane, who sold it to Phoenix Pictures. Phoenix hired Laeta Kalogridis, and together they developed the film for a year. Director Martin Scorsese and actor Leonardo DiCaprio were both attracted to the project. Production began on March 6, 2008.</p><p>Lehane's inspiration for the hospital and island setting was Long Island in Boston Harbor, which he had visited during the blizzard of 1978 as a child with his uncle and family.</p><p>Shutter Island was mainly filmed in Massachusetts, with Taunton being the location for the World War II flashback scenes. Old industrial buildings in Taunton's Whittenton Mills Complex replicated the Dachau concentration camp. The old Medfield State Hospital in Medfield, Massachusetts, was another key location. Cawley's office scenes were the second floor of the chapel during the late evening. Lights were shone through the windows to make it look like it was daytime. The crew painted the hospital's brick walls to look like plywood. This served the dual purpose of acting as scenery and blocking the set from view of a local road. The crew wanted to film at the old Worcester State Hospital, but demolition of surrounding buildings made it impossible. The stone lodge, next to Leach Pond, at Borderland State Park in Easton, Massachusetts, was used for the cabin scene. The film used Peddocks Island as a setting for the story's island. East Point, in Nahant, Massachusetts, was the location for the lighthouse scenes. The scenes where Teddy and Chuck are caught in the hurricane were filmed at the Wilson Mountain Reservation in Dedham, Massachusetts. Filming ended on July 2, 2008.</p><br/><h3>Music</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Shutter Island: Music from the Motion Picture</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">various artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">February 2, 2010</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span class=\"mw-redirect\">Film soundtrack</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">116</span>:<span class=\"s\">41</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span class=\"mw-redirect\">Rhino Records</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\"><span>Robbie Robertson</span><br><span class=\"mw-redirect\">John Powell</span></td></tr></tbody></table><p>Shutter Island: Music from the Motion Picture was released on February 2, 2010, by Rhino Records. The film does not have an original score. Instead, Scorsese's longtime collaborator Robbie Robertson created an ensemble of previously recorded material to use in the film.</p><p>According to a statement on Paramount's website: \"The collection of modern classical music was hand-selected by Robertson, who is proud of its scope and sound. 'This may be the most outrageous and beautiful soundtrack I've ever heard.'.\"</p><p>A full track listing of the album is below. All the musical works are featured in the final film.</p><br/><h3>Genre</h3><p>Shutter Island is a period piece with nods to different films in the film noir and horror genres, paying particular homage to Alfred Hitchcock's works. Scorsese stated in an interview that the main reference to Teddy Daniels was Dana Andrews's character in Laura, and that he was also influenced by several very low-budget 1940s zombie movies made by Val Lewton. The main frame of the plot resembles that of William Peter Blatty's The Ninth Configuration, as well as The Cabinet of Dr. Caligari. La Croix noted that Shutter Island was a \"complex and puzzling\" work that borrowed from genres as diverse as detective, fantasy, and the psychological thriller.</p><p>There have been differing opinions over the ending of the film, in which Laeddis asks Dr. Sheehan, \"which would be worse – to live as a monster, or to die as a good man?\", a line that does not appear in the book. Professor James Gilligan of New York University was Scorsese's psychiatric adviser, and he said that Laeddis's last words mean: \"I feel too guilty to go on living. I'm not going to actually commit suicide, but I'm going to vicariously commit suicide by handing myself over to these people who're going to lobotomize me.\" Dennis Lehane, however, said, \"Personally, I think he has a momentary flash.… It's just one moment of sanity mixed in the midst of all the other delusions.\"</p><br/><h3>Release</h3><p>The film was originally scheduled to be released by Paramount Pictures in the United States and Canada on October 2, 2009. Paramount later announced it was going to push back the release date to February 19, 2010. Reports attribute the pushback to Paramount not having \"the financing in 2009 to spend the $50 to $60 million necessary to market a big awards pic like this\", to DiCaprio's unavailability to promote the film internationally, and to Paramount's hope that the economy might rebound enough by February 2010 that a film geared toward adult audiences would be more viable financially.</p><p>The film premiered at the 60th Berlin International Film Festival as part of the competition screening on February 13, 2010. Spanish distributor Manga Films distributed the film in Spain after winning a bidding war that reportedly reached the $6 million to $8 million range.</p><p>The film also premiered at the Toronto International Film Festival (TIFF) in 2010 and the 62nd Cannes Film Festival in 2009.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Rotten Tomatoes gives the film an approval rating of 68% based on 263 reviews, with an average rating of 6.7/10. The site's critical consensus reads, \"It may not rank with Scorsese's best work, but Shutter Island's gleefully unapologetic genre thrills represent the director at his most unrestrained.\" On Metacritic, the film received a weighted average score of 63 out of 100, based on 37 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film an average \"C+\" grade, on an A+ to F scale.</p><p>Lawrence Toppman of The Charlotte Observer gave the film 4/4 stars, claiming, \"After four decades, Martin Scorsese has earned the right to deliver a simple treatment of a simple theme with flair.\" Writing for The Wall Street Journal, John Anderson highly praised the film, suggesting it \"requires multiple viewings to be fully realized as a work of art. Its process is more important than its story, its structure more important than the almost perfunctory plot twists it perpetrates. It's a thriller, a crime story and a tortured psychological parable about collective guilt.\" Awarding the film 3+1⁄2 stars out of 4, Roger Ebert of the Chicago Sun-Times wrote, \"the movie is about: atmosphere, ominous portents, the erosion of Teddy's confidence and even his identity. It's all done with flawless directorial command. Scorsese has fear to evoke, and he does it with many notes.\"</p><p>The Orlando Sentinel's Roger Moore, who gave the film 2+1⁄2 stars out of 4, wrote, \"It's not bad, but as Scorsese, America's greatest living filmmaker and film history buff should know, even Hitchcock came up short on occasion. See for yourself.\" Dana Stevens of Slate described the film \"an aesthetically and at times intellectually exciting puzzle, but it's never emotionally involving\". The Washington Post film critic Ann Hornaday negatively described the film as being \"weird\". A. O. Scott of The New York Times wrote in his review that \"Something TERRIBLE is afoot. Sadly, that something turns out to be the movie itself.\"</p><p>Keith Uhlich of Time Out New York named Shutter Island the fifth-best film of 2010.</p><h4>Box office</h4><p>Shutter Island was released alongside The Ghost Writer, and with $41 million finished first at the box office and gave Scorsese his best box office opening to-date. The film remained at #1 in its second weekend, with $22.2 million. Eventually, it grossed worldwide $294,805,697 and became Scorsese's second highest-grossing film worldwide. It is Scorsese's fifth movie to debut at the box office at #1 following Taxi Driver, Goodfellas, Cape Fear, and The Departed.</p><h4>Home media</h4><p>Shutter Island was released on DVD and Blu-ray on June 8, 2010, in the US and on August 2, 2010, in the UK. The UK release featured two editions—a standard edition and a limited steel-case edition. For the tenth anniversary, Paramount Pictures released on February 11, 2020, a 4K steelbook + Blu-ray.</p><br/><h3>Other media</h3><h4>Unproduced TV series</h4><p>In August 2014, Paramount Television and HBO were reported to be brainstorming a TV series called Ashecliffe, which would serve as an origin story for the film.</p><h4>Video game</h4><p>A video game based on the film was released for PC. A Nintendo DS version was planned, but cancelled.</p><br/>"
  },
  "errorMessage": ""
}