{
  "imDbId": "tt0477348",
  "title": "No Country for Old Men",
  "fullTitle": "No Country for Old Men (2007)",
  "type": "Movie",
  "year": "2007",
  "items": [
    {
      "username": "chaswe-28402",
      "userUrl": "https://www.imdb.com/user/ur67278807",
      "reviewLink": "https://www.imdb.com/review/rw4078243",
      "warningSpoilers": false,
      "date": "1 March 2018",
      "rate": "10",
      "helpful": "1,441 out of 1,576 found this helpful.",
      "title": "Marvellous Ending",
      "content": "The message of this film is that there is no symmetry to life. What goes around does not come around. The fall of the coin has no bearing on the way the cookie crumbles. There is no right or wrong to the fates of men. No justice. Opportunities seized may lead on to fortune, but they could just as well lead on to dusty death. Only children expect things to be fair. As things once were they need no longer be. Now that IMDb has decided to list reviews by date there is a slightly increased possibility that this effort will be read by someone. Performance reviews are absolutely not read by me for helpfulness, but for interest and entertainment."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2190489",
      "warningSpoilers": true,
      "date": "12 January 2010",
      "rate": "9",
      "helpful": "69 out of 78 found this helpful.",
      "title": "How Much Violence Can You Handle?",
      "content": "This film grabs you and doesn't let go. There is so much tension and so much pain and so much death. I can think of a more despicable villain in my movie viewing past. This is a stretch for me because I am really tired of gratuitous violence. The scenes here are so graphic and fast paced, deaths of innocents and perhaps, the deserving. I guess I should read the book for some insights. The grim reaper is around the corner and he has an air compressor not a scythe. I'm curious to see what other things Bardem has done. He is certainly a presence. Of all the scenes that will stay with me, the one at the hole in the wall gas station when the first coin is flipped is the most intense. There has been so much commentary. All I can say is it was like watching an accident; you can't take your eyes off it."
    },
    {
      "username": "FLASHP01NT",
      "userUrl": "https://www.imdb.com/user/ur65505616",
      "reviewLink": "https://www.imdb.com/review/rw6078775",
      "warningSpoilers": true,
      "date": "9 September 2020",
      "rate": "8",
      "helpful": "353 out of 394 found this helpful.",
      "title": "No Country For Old Men - Explanation - Spoilers",
      "content": "The meaning of Sheriff Bell's dream was that he was ashamed of himself because his fear of death prevented him from doing his duty. In other words: Ed knew the criminal was in the motel room, but his fear of death prevented him from doing his job, which, in this case, was to die honorably in the line of duty.He interprets this moral failure as a desecration of the legacy of his father.This is contrast with the moral failure of Anton: Anton killed the woman who refused to play his coin game, which forced him to assume the moral responsibility for murdering her. This incident is immediately followed with Anton's car accident, which represents him being punished by God and forced to rely on the charity of others for survival. This is why Anton demands the kid take the money in exchange for the shirt - because he recognizes that he's being punished (i.e. he recognizes the charitable symbol and that he doesn't deserve charity) which is an indirect admission of guilt."
    },
    {
      "username": "Sonic_Ocean",
      "userUrl": "https://www.imdb.com/user/ur23990121",
      "reviewLink": "https://www.imdb.com/review/rw2816532",
      "warningSpoilers": true,
      "date": "20 June 2013",
      "rate": "10",
      "helpful": "214 out of 250 found this helpful.",
      "title": "A Look into an Abyss",
      "content": "I expect a film like 'No Country for Old Men' to be polarizing for some, especially if they're expecting a big finale with the good guy and the bad guy drawing their guns in the end to settle the score. 'No Country for Old Men' is a film that dabbles more in existentialism, despite all the crime that occurs. Basically, what I'm saying is that the film adapted from the novel is very unconventional not only for its genre, but also in its approach to storytelling. What the Coen brothers do best is combining altogether different elements and creating something with its own unique character. While there are subtle throwbacks to the old wild west, the story takes place in modern society where technology has advanced, society has advanced and unfortunately crime has too.What are Anton Chigurh's true motives? Does he have a philosophical doctrine that we the audience are unaware of or are just unable to comprehend? What Anton does is create a lot of questions that arise from his actions and his interactions with the other characters. To watch a character as odd as him is fascinating and I cannot give enough credit to Javier Bardem in portraying such a character that is so enigmatic and just his presence alone is able to evoke so much mystery. Even though Anton is very incomprehensive, it is all made up for by being able to be somehow captivated by him.How every character deals with Anton is interesting, to say the least and as the film progresses, the feeling of despondency increases gradually. The lack of heroes is what gives this film its sense of hopelessness and that feeling of hopelessness is basically set in stone from the first few shots coupled with Tommy Lee Jone's epic voice-over narration in introducing the story. It is the perfect introduction to what we will witness in the story and what it all means for a sheriff like him in comprehending these events. As the events occur, we the audience reflect on these situations just as much as Sheriff Ed Tom Bell. Tommy Lee Jones' performance in this role is impressive and is injected with a great sense of humanity. I commend his portrayal as Bell, in that he is the character who carries the weight of the story.The acting is a huge fragment in bringing this film to life, but what also does that is how the visuals are executed and it is definitely utilized to a great effect. From its majestic shots to its beautiful lighting and color tones, the Coen brothers set a mood that permeates the whole film. Its barren settings really add a feeling of desolation that is at the same time hypnotic and surreal. While the film can be suspenseful and its suspense is definitely executed perfectly, the film still somehow manages to maintain an air of mystique. The non-existence of a soundtrack really gives the film a feeling of loneliness, all the while adding an even greater sense of sterility to its already barren wasteland.I can go on and on about the great acting, its memorable shots and its great script, but what makes 'No Country' a great film is that it manages to be truly idiosyncratic in its execution just like how the Coen Brothers' other great films are. Even if a film like this leaves me more questions than answers, if it still manages to captivate me to a point that I'm willing to return to it, then that shows that it doesn't matter if I don't have any answers to my questions. There are only a few films that are able to pull this off naturally and 'No Country for Old Men' is definitely one of those special films that can do just that."
    },
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw1910220",
      "warningSpoilers": false,
      "date": "13 July 2008",
      "rate": "9",
      "helpful": "217 out of 305 found this helpful.",
      "title": "Some Interesting Characters",
      "content": "While on a hunting trip, a sportsman (Josh Brolin) finds dead men and a stash of cash in the remote back country of West Texas, the result of a drug deal gone wrong. The greedy hunter takes the cash, but soon discovers that the resourceful criminal responsible for the drug deal, an outlaw named Anton Chigurh (Javier Bardem), has a way of tracking the loot. The hunter thus finds that he is the hunted. Meanwhile, an aging Texas sheriff named Ed Tom Bell (Tommy Lee Jones) is after both the sportsman and Chigurh. The story is set in the early 1980s.To some extent, this film is a character study of Sheriff Bell, an honest lawman who is wise, observant, grounded in reality, and has a long memory. \"No Country For Old Men\" is really his story. He doesn't know quite what to make of the drug war that has crossed over from Mexico into Texas; it's something new (for the 1980s); and it makes a land that has always been hostile to settlers even more hostile and dangerous.The film's premise is quite simple, and the story is straightforward with minimal twists. A lot of time and care are taken with procedural actions: loading a gun, dressing a bloody wound, constructing a pole to retrieve a package from an air vent, for example. Dialogue is minimal; there's lots of silence.Overall casting and acting are impressive. I especially liked the performance of Tommy Lee Jones who seemed a natural choice for the role of Sheriff. Javier Bardem and Josh Brolin are also well cast. Several minor roles are extremely well performed, like the store owner who is asked to call a coin toss, and the rotund lady who, with a dour face, defies Chigurh's requests in a characteristic Texas twang.The film's color cinematography is quite good; there are lots of sweeping, wide-angle outdoor shots. I really enjoyed the geographic setting, with that whistling West Texas wind, the silence, and the stunning vistas. It's a landscape that is starkly beautiful. Yet, despite its beauty and wilderness traits, it can quickly turn hostile and unforgiving for anyone unprepared for its hidden risks.\"No Country For Old Men\" is a fine film. I'd describe it as a chase story -- character study combo, with elements of noir, especially in the visuals. Violence may be a tad much for some viewers. But given the subject matter, it is entirely appropriate."
    },
    {
      "username": "Hey_Sweden",
      "userUrl": "https://www.imdb.com/user/ur28159509",
      "reviewLink": "https://www.imdb.com/review/rw2750827",
      "warningSpoilers": false,
      "date": "9 February 2013",
      "rate": "8",
      "helpful": "22 out of 28 found this helpful.",
      "title": "What's the most money you ever lost on a coin toss?",
      "content": "Opinions do look to be sharply divided on this typically interesting effort for the Coen brothers. Some hail it a masterpiece, others don't see the appeal at all. While this viewer doesn't quite fit into the former camp, he will say that it's one of the more unconventional examples of crime fiction that one is likely to see. It's much more of a character piece than anything, with some grisly scenes of violence here and there. Based on the novel by Cormac McCarthy, it centres around three characters, one being a poor hunter named Llewelyn Moss (Josh Brolin), who one day stumbles into the aftermath of some drug deal gone horribly wrong. He finds $2 million on the scene and impulsively decides to keep the money for himself, while a mysterious, creepy, sadistic stranger named Anton Chigurh (Javier Bardem) tracks him down, porting a unique pressurized air weapon. Somewhat involved is a weary Texas sheriff, Ed Tom Bell (Tommy Lee Jones), who's unsettled by what he sees as the changing times. Now, granted, what's going to test the patience of some of the viewers are some of the monologues; this isn't for people who want a straightforward story and who are turned off by philosophical musings. One can hardly fail to notice how low key most of this narrative is; even in the more intense scenes there's never really a sense of urgency. On the plus side, what we do get are some excellent character moments from the solid star trio of Brolin, Bardem, and Jones. The supporting cast is equally impressive - Woody Harrelson, Kelly Macdonald, Garret Dillahunt, Tess Harper, Barry Corbin, Stephen Root, and Beth Grant. The Coens work with some of their reliable prior collaborators such as composer Carter Burwell and cinematographer Roger Deakins. All things considered, \"No Country for Old Men\" may not be to all tastes, and does require some patience on the part of the viewer. It also doesn't resolve itself in the way one might expect for this genre, and might prove to be less than satisfactory in this regard for some of those watching. There's one fantastic confrontation near the end, but the film closes, curiously enough, after a monologue by Bell about a dream he's had. How much or how little all of this works will be up to the individual viewer. In any event, the actors are all fantastic, especially Bardem, and they make the journey worthwhile. Eight out of 10."
    },
    {
      "username": "Robert_duder",
      "userUrl": "https://www.imdb.com/user/ur1697212",
      "reviewLink": "https://www.imdb.com/review/rw1817317",
      "warningSpoilers": true,
      "date": "10 February 2008",
      "rate": "7",
      "helpful": "41 out of 56 found this helpful.",
      "title": "Over-analyzed and over appreciated, it starts out being one thing and then goes off into another world",
      "content": "People who watch these critical darlings really amuse me. They use words like \"hauntingly flawed\" or \"beautiful and haunting\" or \"stayed with me for days.\" No Country For Old Men, at least the first hour and a half is main stream, well done, captivating, gory drama, thriller, action western and then the last half hour takes the film into this queer, nonsensical, blathering of artistic garbage that only someone who pretends to understand would care about. I do understand where they are trying to go with the film...the moral is...times have changed. Was that so hard to say? Instead they create an entire character, use a first class actor to portray him who does little to nothing in the entire film because artistically he's \"washed up and tired of the world.\" It doesn't come across like that at all. The infamous Coen Brothers drop this interesting thriller/drama on you with this in depth creation of a serial killer who is just completely hell bent and disturbing and then they toss the entire story away on a disgustingly stupid and boring ending never giving closure to anything that they set up prior. I almost wonder if they did it on purpose as some sort of a cruel joke. I mean it feels like they got to a certain point in the film where they should have ended it but decided, 'no let's tack another 45 minutes on it but just ram whatever we come up with on to it.' As one IMDb reviewer pointed out...it feels tacked on and like a completely different movie. Josh Brolin is really terrific as country man Llewelyn Moss. As we quickly discover Moss is not as country and as stupid as he might come across. In fact he's quick witted, honest, and a fast study. He turns out to be a formidable opponent to a killer who has never had a formidable opponent. Brolin is terrific in the role. A worthy hero whose character is demeaned by its ending. Javier Bardem...well if anyone actually deserves Oscar nomination for this film it might be him. Bardem plays steely cold, brutal and ruthless killer for hire and for fun Anton Chigurh. He is a strange and interesting character who we learn and know little to nothing about. He seems to like games, and he seems to be brilliant and subversive. His straight expressions and monotoned voice make him downright disturbing. The wasted actor on the pointless character I mentioned is the amazing Tommy Lee Jones who doesn't get to be very amazing as the tired, worn out old Sheriff Ed Tom Bell. Jones is a phenomenal actor but he's almost useless in this role. He stumbles around a crime scene or two intelligently pointing out facts and then spewing wisdom about how things have changed and then doing nothing else. Very unfortunate.When it comes down to the very clever cat and mouse game between Brolin and Bardem, the film is brilliant. Bloody, and riveting and the story is starting to unfold but everything goes by the wayside. The key here is that so much of the story is unknown to us. An entire bloody battle over drugs has transpired and we know little to nothing about it. We only know this insane serial killer enters the picture and wants the money found and kept by Brolin's character.*******SPOILERALERT**********This is one time I can't help but spoil the film because I need to rant about it. The film goes down hill when, outside of the viewers sight, they cheaply kill off the main character of Llewelyn Moss, by Mexicans who also want the money. We don't see the kill...there is never any show down of any kind between Brolin's Moss and Bardem's Chigurh, and after that death the film literally just goes to pieces. However, outside of the horribly misplaced and mis-made ending, No Country For Old Men will likely impress you. It is shot in such a style that it feels like an old Western...the long, single shots and the gritty sand swept desert. Still fatal flaws make this one a poor choice by the Academy. 7/10"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1760958",
      "warningSpoilers": true,
      "date": "9 November 2007",
      "rate": "10",
      "helpful": "790 out of 1,299 found this helpful.",
      "title": "You need to call it. I can't call it for you. It wouldn't be fair.",
      "content": "No Country for Old Men is as exceptional a mix of two creative talents- the Coen brothers, Joel and Ethan Coen, and author Cormac McCarthy (recent winner of the Pulitzer for The Road, his own masterpiece) as one could imagine, as they converge on a story that in lessor hands would be just a B movie. The story concerns an average Joe out hunting one day in Texas who comes across a bunch of dead bodies, heroin, and a satchel with 2 million in cash. He takes it, but without knowing that a true embodiment of a psychopath (Javier Bardem) is on his trail, and as he evades him it becomes more and more clear the fatalism that lies in store, as a weathered sheriff (Tommy Lee Jones) is also on the trail with perpetulally sad eyes looking on from his stolid demeanor. More than this, it's also about as good a morality play as one could ask for, because it plays and tools and makes very serious questions about what is moral, or what isn't, or what is so ambiguous that it's all up to the toss of a coin or a chance ride out of town. There are a few interpretations to Bardem's character Anton that could be taken, but one thing is certain- he's less a symbol than a real presence, a \"ghost\" as Jones's sheriff calls him that can come around at the drop of a pin, usually in the dark, and strike the utmost fear (or confusion if you're a clerk) in the hearts of men and women. You'll never look at a coin toss the same way again. Or an air-gun. Or fixing a bullet wound in a leg. Or a hunt at a motel. Or even the aftermath of a car crash.But at the same time it's the purest time of cinema, recalling Hitchcock and Leone and Welles's Touch of Evil and the best of noir and westerns. There are so many exceptional shots and lighting, so much depth to the perception of the characters through the mis-en-scene, so much tension, that through this it's all up to the actors to make or break the near-perfection that is the McCarthy source. Bardem embodies Anton like no other could- you can't look at his eyes, often steel-cold and horrifically professional (to what professional who can say), which occasional tear- and it's obviously worthy of an Oscar. And Josh Brolin and Tommy Lee Jones are also fantastic; we see Brolin often in the midst of an action scene, a moment of 'save-your-life' going on, and one can finally see an actor of his caliber completely breaking out in a role that doesn't require him to ever totally \"emote\". Jones, on the other hand, gives a compassionate turn in a film that's about the struggles of desperate men in a land without law and order. He's gone through so much that it comes out completely in his voice and eyes, sorrowful but holding back, and he reaches a level of connection with the character that makes the Fugitive look like simpleton TV. Kelly McDonald, who plays Lleland's wife, is also excellent when called upon, especially in a crucial scene later in the film.It's gut-wrenching, bleak, violent, super-tense (I clenched many a knuckle during some scenes), surprisingly funny in a darkly comic manner not seen by the Coens in many years, and artistically fashioned to a beat that is meditative (watch the opening moments with Jones's voice-over), simple, and doomed. It's beautiful and terribly tragic, for McCarthy fans it finally strikes at what is truest to his material- even if you haven't read the book itself the Road will give an indication of the mood and atmosphere at hand- and at the moment I can't think of any other film that would be the best pick of the year- maybe one of the best films I've ever seen."
    },
    {
      "username": "motta80-2",
      "userUrl": "https://www.imdb.com/user/ur0480585",
      "reviewLink": "https://www.imdb.com/review/rw1656782",
      "warningSpoilers": true,
      "date": "16 May 2007",
      "rate": "10",
      "helpful": "1,124 out of 1,621 found this helpful.",
      "title": "Coens firing on all cylinders. Brilliant.",
      "content": "If this doesn't end my year in the top two films of the year then we are in for one hell of an awesome year of movies.The new film from two of the best filmmakers working today No Country For Old Men shows the talents of the Coen Brothers on top form. After a couple of disappointments (Intolerable Cruelty had flashes of Coen genius but felt more of a Coen imitation than the real thing; Ladykillers had the odd funny moment but was the blandest film the brothers ever made, and there's just no excusing Marlon Wayans!) they knock this violent western drama out of the park.More in the vein of their superb early mostly-serious efforts Blood Simple and Miller's Crossing (my personal favourite of the Coen back catalogue) No Country For Old Men is a slow-moving, character-driven masterpiece about uncompromising and uncompromised characters. It is very violent and bloody and not always for the squeamish.Shot through with moments of humour these come, as in life, from real situations and observations so don't be fooled into thinking this will be the serious film with goofy-characters Coens of Fargo. No Country For Old Men is a tough, gritty story.The unrelenting pace may take its time but you are gripped every moment. This is a thriller that genuinely thrills.Javier Bardem gives the best performance of his career. And, yes, I have seen The Sea Inside and he in superb in that but here he is simply extraordinary. It is a portrayal of unrelenting evil, of true derangement, of a human being with no shreds of humanity that ranks at the very top of studied film psychopaths. And I say film not movie because this is not a clichéd character. This is not a character whose lunacy you enjoy over popcorn. This is one of the most frightening performances ever committed to celluloid. I felt truly nervous of what was going to happen every time he walked on screen.Josh Brolin essentially carries the bulk of the movie and he is excellent in a role that challenges him. I have never seen him perform to this level and if Bardem didn't steal the film you'd be talking about Brolin all the way home. As it is this gives him a showcase for his talents that should see him get a lot more attention.Tommy Lee Jones is used sparingly but to great effect. Sounding more like Michael Parks than ever before his scenes pepper the movie with a wearied view on a world he doesn't really like or understand to great effect.I did find Stephen Root a little distracting as i have never seen him in a serious role before and he just looks amusing but he is in very little.Roger Deakins' cinematography is breathtaking as usual and the Coens' script is superbly crafted. There are moments, almost asides from the main plot, that would be superfluous in most scripts and excised in most studio films but which work perfectly in the overall context of the movie as only the Coens can achieve. One scene featuring Bardem in a gas station is up there with the best scenes i have ever seen on film.I have not gone into the plot here because I saw this film having not read Cormac McCarthy novel and knowing little other than the basic log-line - a man out hunting comes upon a scene of dead bodies, guns, drugs and money on the Mexican border and comes to the attention of both those behind the scene and a local world-wearied sheriff - and i think that's the way to see this film.Go in knowing as little as you can but knowing at least this: this is a serious, violent, slow-paced character piece from the Coens. This is not a Fargo. If you are squeamish don't see it. If you have a short-attention span don't see it. If you only love the Coens for their fantastic comedies like O Brother and Big Lebowski and the comedy/thriller Fargo don't see it. But if you want to see an intelligent, superbly acted, powerful, beautiful cinematic treat that will remind you of the true power of cinema see it, see it, see it. It's a masterpiece. Bravo Ethan and Joel."
    },
    {
      "username": "DonFishies",
      "userUrl": "https://www.imdb.com/user/ur1622466",
      "reviewLink": "https://www.imdb.com/review/rw1770421",
      "warningSpoilers": false,
      "date": "26 November 2007",
      "rate": "8",
      "helpful": "643 out of 1,057 found this helpful.",
      "title": "A hauntingly flawed unconventional masterpiece",
      "content": "Days after seeing it, I am still haunted by No Country for Old Men. There is just something so effectual and uncompromising about it, that mere words will only begin to skim the surface of the cinematic excellence on display.At its most simplistic, the film is a game of cat and mouse. The mouse here is Llewelyn Moss (Josh Brolin), a hunter who stumbles upon two million in cash after a drug deal gone wrong, and takes it thinking nothing of it. He tries to cover his tracks, but ends up letting the group looking for the money, figure out his identity. The cat is Anton Chigurh (Javier Bardem), a hit-man hired to find Moss and the money. But Chigurh is unconventional at best; he also happens to be bordering on mentally insane. And another man, a law man this time, Sheriff Bell (Tommy Lee Jones), is on the trail of both men as they criss-cross around Texas.Right up until its dénouement, the film is simply brilliant. Taut and thrilling, it blows right through the majority of its two hour runtime with ease. Even during moments of slowing down, the film stays right on track and never feels like it has run its course. It engages even when it appears that nothing is happening. The Coen Brothers truly crafted what appears at first glance to be a masterpiece, even if it is their first real shot at something that is not indelibly and inarguably their own. Even without reading Cormac McCarthy's novel, I know that the Coens have done it justice, even with their bitterly twisted and dark sense of humour scattered throughout the film.But all of that comes to a standstill as the film concludes. The last twenty or so minutes feel like hours as the film wraps itself up, and it almost feels like these scenes belong to another movie entirely (one that borders on being pretentious and monotonous). I realize now that McCarthy's novel probably ends the same way, but it does not help provide closure to the fact that the movie is so break-neck paced right up until this happens. Its brilliance is shattered by what looks to be a series of tattered events thrown together to provide closure for all of the characters, alive or dead, and for its audience. It speaks volumes to the film's title, but it just does not feel satisfying compared to the rest of what we saw. Even with its enigmatic devices at play, I still cannot come to terms with how the film closes. It does haunt, and in a way, it may prove to be a significantly stronger ending as time rolls on. But as it stands now, it just feels weak.What is also a bit of a surprise, and only seems to appear as the film concludes, is the music. It is not so obvious at first, but the majority of the film is audibly shown with just the sounds the characters make and no background music to speak of. This element is brilliantly used, as it helps intensify every situation and makes the film downright terrifying in some cases. It just helps truly make the film come together, and only helps establish the quick pacing even more so. It was definitely a surprise, and one that will probably help the lasting impact of the film become even stronger.The lush and bloodsoaked visuals also help to define the film. Despite the film taking place mainly in deserted areas, or the desert itself, the camera manages to capture just the right essence of what the writing and acting is conveying. The isolation and the terror almost become characters themselves through these visuals, and are sure to be recognized as the award season rolls in.The film's acting is also very well done. Brolin anchors the film and even when it is just the audience reacting to his attempts at saving his life, he manages to deliver the best performance of his career. He breathes life into Moss, and truly brings a sense of pathos to the character. We feel for him and his greedy mistake, and as he develops into a man unwilling to go down without a fight, he only manages to up the ante for himself countlessly. Jones, as the law man stuck on the fringe of every event, also does very well for himself. Most of his work is simply delivering dialogue, but it is delivered in such a fashionable sense that you feel like he is speaking to the bigger picture of things, and not just himself. I would have liked a bit more development in his character, but what little there is helps his performance greatly.Supporting turns from Woody Harrelson and Kelly Macdonald are also done well, but are overshadowed by the main cast by both Brolin and Jones.And even more of an overcast is Bardem as the ruthless Chigurh. He absolutely nails this character down to his very bones. If anyone is merely toying with the idea of seeing the film, it should be specifically for Bardem. His performance is calculating and plagued with petrifying silence. When he chooses to talk, his words sound like they are being given by the essence of evil. This is a man with a plan, but it is one that only belongs to him. His enigmatic presence is developed throughout the film, and never once does it feel particularly appropriate to understand where this menace comes from. Watching him on screen is a jolt to the heart, and will go down as one of the best performances of the decade. His terrible hair only helps to make his character that more scary and formidable.No Country for Old Men is one of the best pictures of the year, even if it is flawed. Its brilliance and lasting impact with leave you haunted.8.5/10."
    },
    {
      "username": "Danusha_Goska",
      "userUrl": "https://www.imdb.com/user/ur2366009",
      "reviewLink": "https://www.imdb.com/review/rw1781573",
      "warningSpoilers": true,
      "date": "16 December 2007",
      "rate": "1",
      "helpful": "1,244 out of 2,198 found this helpful.",
      "title": "Despicable Snuff Film with Pseudo-Intellectual Pretensions",
      "content": "\"No Country for Old Men\" is for the kind of film fan who remarks, \"Gee, wasn't that murder a clever mise-en-scene?\" and who asks, \"What kind of lens do you think they used in that strangulation shot?\" The skeleton of \"No Country for Old Men\" is a cheap, 78-minute, gun-monster-chase B movie. Javier Bardem plays Anton Chigurh, the monster. He is Frankenstein; he is Max Cady from \"Cape Fear;\" he is from your childhood nightmares. He may be death personified.One of many completely implausible scenes: an arresting officer, defying any logic, turns his back on Chigurh. Chigurh, displaying the supple sinuosity of a Cirque du Soleil contortionist, or an orangutan, slips out of his handcuffs. This is done out of camera view, because for Bardem it would be impossible; thus the scene's implausibility. Chigurh then, in real time, strangles the young police officer to death on camera. This is an extended sequence. This is the payoff for \"No Country for Old Men\": watching one human being kill other human beings, in scene after scene after scene, using various weapons, including a captive bolt pistol usually used on livestock. Guess Chigurh couldn't get hold of a Texas chainsaw. This is a slasher flick for the pretentious.Early on, there are well-done, if standard, chase scenes. A man outruns a car: not believable, but fun to watch. A pit bull chases this fleeing man down a whitewater river. The man reloads his gun at the very last moment (of course) and shoots the pit bull dead just as it is about to sink its teeth into the man. Later, in a hotel, a beeping transponder informs the killer where his prey hides. Your pulse may race and you may think that this is all leading up to something interesting. You will be disappointed.Tommy Lee Jones, whose ear lobes appear to be metastasizing as he ages, wanders aimlessly through the film as Sheriff Ed Tom Bell, delivering cornpone, homespun, cowboy poet ruminations that are more or less opaque in meaning. No doubt the film's fans are even now feverishly compiling a companion volume that decodes Bell's dreams and conveys their depth.Woody Harrelson, late the bartender of the TV sitcom \"Cheers,\" shows up for a completely pointless half-hour role that yanks the viewer right out of the movie. \"What is Woody Harrelson doing here?\" Some years back, some bored English majors decided that conventional narrative structure was not intellectual enuf, and decided to play games with narrative. \"No Country for Old Men\" plays these sorts of games. The viewer is invited to invest time getting to know characters who are eliminated from the plot in ways that convey no meaning and are not moving. The narrative flow is truncated and yet the movie keeps going; viewers ask themselves why the movie is continuing -- sometimes out loud, even in a movie theater -- this is supposed to be a deep, intellectual experience. It is not. It is merely annoying.Other than bratty English major head games, pretty much the entire substance of \"No Country for Old Men\" is a series of murders and tortures committed by Chigurh, who may symbolize your high school's worst bully  a bully so terrifying exactly because he targeted English majors. His victims are often courteous; their likability makes watching them be humiliated and then murdered an uncomfortable, and, given the film's structure, ultimately pointless exercise. Not only are the Coen Brothers torturing their characters, they also torment their ticket-buying audiences.Chigurh's nice victims are often poor, rural, Southern, whites, the kind of people often not featured as positive, lead characters in Hollywood entertainments. They are often villains  witness films like \"Deliverance.\" Here they are murder victims. Chigurh is associated with Mexicans, part of a rising \"dismal tide,\" as one Anglo character puts it. No matter how you feel about immigration, you may find this association of Mexicans with a rising tide of evil to be offensive.The film's boosters insist that the movie offers three deep and shocking lessons: life doesn't always follow a neat narrative structure; evil often triumphs; and the old days were more peaceful and, nowadays, things are getting really bad. In truth, everyone walking in to the theater already knows the first two \"lessons.\" No one needs the Coen brothers to inform him that life doesn't always follow a neat narrative structure, or that evil often triumphs. We expect filmmakers, and all artists, to offer us a more substantial thesis. As for the third \"lesson,\" that the old days were more peaceful and things are getting really bad today -- have the Coens, or Cormac McCarthy, heard of Attila the Hun, or any number of other less-than-peaceful and courteous personages from our common human past? One might well be dubious about \"No Country\"'s \"lessons.\" Visit internet discussion boards devoted to this movie, and you will find fans asking, not \"What is fate?\" or \"What is the role of a good man in a bad world?\" but questions like, \"If Hannibal Lector and Anton Chigurh were locked in a room, who would come out alive?\" Given such reflections, one is safe in concluding that the appeal of this film is its emphasis on graphic violence, rather than on any more advanced intellectual or artistic merit."
    },
    {
      "username": "poe426",
      "userUrl": "https://www.imdb.com/user/ur1530907",
      "reviewLink": "https://www.imdb.com/review/rw1794907",
      "warningSpoilers": true,
      "date": "6 January 2008",
      "rate": "6",
      "helpful": "22 out of 32 found this helpful.",
      "title": "The operation was a success...",
      "content": "One of Hitchcock's tenets of good Cinema was that the filmmaker must never cheat the moviegoer; must never leave the audience wanting. NO COUNTRY FOR OLD MEN does just that, repeatedly. While the technical aspects are topnotch all around, the telling of the story leaves more than just a little to be desired. Resolution? Yeah, right. Wonky Woody Harrelson's 'baccer-chewin' cowpoke stands out like a sore thumb in such close proximity as it is to so many so much better, and Brolin literally falls by the wayside in one of the lamest twists I do believe I've ever witnessed in a major motion pitcher. (Hitchcockian only in the PSYCHO sense, it's one of the major reasons I rate this one no higher than a six on the scale of one to ten.) Tommy Lee Jones is great, but being sidelined as he is makes his performance little more than incidental."
    },
    {
      "username": "littlemartinarocena",
      "userUrl": "https://www.imdb.com/user/ur12449122",
      "reviewLink": "https://www.imdb.com/review/rw1833532",
      "warningSpoilers": false,
      "date": "4 March 2008",
      "rate": "10",
      "helpful": "281 out of 445 found this helpful.",
      "title": "Tangible Fear As Art",
      "content": "I don't remember being so scared in a movie theater since \"Don't Look Now\" Here the Coen Brothers take everything a step further with exhilarating ease. The terror was genuine and not because we were rooting for Josh Brolin or anybody in particular. The terror was personal, Joel and Ethan Coen made that terror visceral and tangible. It has to do with our own nightmares. Josh Brolin was a perfect piece of casting because in a way he doesn't have many personal colors. He's one of the bunch, one of us and we could put ourselves in his shoes. That is the art of film narrative expressed in a way that we've never experienced before. I heard people old enough to have seen Hitchcock's \"Psycho\" in the theaters and what glued them to the screen was their own fear. Well, that's what I've experienced here. Javier Bardem is superb, considering that he's the reason for the fear. He carries a human/inhuman kind of strength and we know he'll get us, sooner or later and if we consider the ending of the film, he might still do. Worthy Oscar winners, all of it and all of them."
    },
    {
      "username": "howardeisman",
      "userUrl": "https://www.imdb.com/user/ur14462724",
      "reviewLink": "https://www.imdb.com/review/rw1786468",
      "warningSpoilers": true,
      "date": "25 December 2007",
      "rate": "5",
      "helpful": "154 out of 238 found this helpful.",
      "title": "Ruined by it's last half hour",
      "content": "This was an exciting chase/suspense/character movie until about the half way mark. At that point, too much was going on, all of it similar and all of it almost beyond comprehension. There seemed to an endless supply of Mexican drug runners be to killed. Where they came from, with whom they were affiliated, what they were trying to do, were all insufficiently explicated-if at all. The end of the movie is, IMHO, just a disintegration-as if all the money or film stock ran out. Some attempt is made to present the point that this film is an existential exercise showing what I would call nickle and dime existentialism.Yeah, yeah, we're all going to die. evil exists, life is a coin toss. This philosophizing didn't help."
    },
    {
      "username": "Craig_McPherson",
      "userUrl": "https://www.imdb.com/user/ur1075696",
      "reviewLink": "https://www.imdb.com/review/rw1765317",
      "warningSpoilers": false,
      "date": "17 November 2007",
      "rate": "10",
      "helpful": "555 out of 949 found this helpful.",
      "title": "Expect the Unexpected as the Coen's deliver a pneumatic jolt to the head",
      "content": "There's very little \"good\" in No Country for Old Men beyond the mesmerizing acting and viciously dark screenplay. Instead, the unholy trinity of temptation, cynicism and pure, dark, evil take center stage in this modern western directed by brothers Joel and Ethan Coen.Based on the 2003 novel by Cormac McCarthy, the movie unfolds in the dusty Texas borderlands as hunter Llewelyn Moss (Josh Brolin) stumbles upon the remnants of a desert drug deal gone bad, complete with a case containing two million dollars. Succumbing to temptation, Moss makes off with the money setting in motion a chain of events that leaves a trail of blood spattered carnage across the State as he is pursued by the ruthless, coin tossing hit man Anton Chigurh (Javier Bardem) among whose killing weapons of choice is a pneumatic air gun.Bearing little in common with pretty much any previous Coen film with the possible exception of Blood Simple, No Country for Old Men is a dark, bleak, ode to the baser elements of the human soul, and a spit in the eye to the noble ones as well.With a structural trademark hinging upon breaking the conventional norms of predictability, No Country is a movie that will unsettle you at successive turns - in the way deaths are dealt out; by its palpable tension that can almost be cut with a knife, and its periodic deviations from the narrative norm  the latter likely the only Coen brothers \"quirk\" for which their movies are renown.Switching back and forth between the game of cat and mouse being played out by Moss and Chigurh and the investigation of unfolding events by cynical aging Texas Sheriff Ed Bell (Tommy Lee Jones), the Coens weave a web of dangled threads that one can't help but expect will be neatly tied together at story's end, only to tie them up in ways that buck the storytelling norm and manage to be both unsatisfying and true to their nature at the same time.Unforgettable among this tableau is Bardem's Chigurh. The Spanish actor who has also appeared in Love in the Time of Cholera and Goya's Ghosts evokes the most amazing presence of a ruthless killer with his own twisted adherence to a bizarre code of ethics that nothing short of witnessing his performance can do it justice.Sadly, however, justice is one of the few items in abundance in this movie. And yet, as unhappy as I am that the Coen's screenplay defiantly refuses to cater to the audience's inherent desire for satisfaction, I grudgingly have to admire them for opting for the unpredictable.Consider the movie akin to one big coin toss  will it be heads or tales? Call it - you've been calling it your entire life."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3089081",
      "warningSpoilers": false,
      "date": "19 September 2014",
      "rate": "8",
      "helpful": "16 out of 24 found this helpful.",
      "title": "Such great compelling characters",
      "content": "Sheriff Ed Tom Bell (Tommy Lee Jones) laments the bygone peaceful times of his father and grandfather. Anton Chigurh (Javier Bardem) is a weird killer with a compressed air pistol. Llewelyn Moss (Josh Brolin) comes across a drug deal gone wrong in the desert. The bad guys killed each other leaving the drugs behind. Llewelyn recovers a suitcase full of cash. He doesn't even tell his wife Carla Jean Moss (Kelly Macdonald) at first. He returns to the desert that night, and is shot by the criminals. They have his car and he expects them to come after him. He sends his wife away while he tries to hide the $2 million. Chigurh is brought in to track down the money and promptly kills the drug criminals who hired him. Sheriff Bell and deputy Wendell (Garret Dillahunt) investigates. The cartel hires Carson Wells (Woody Harrelson) to stop Chigurh and get back the money.Javier Bardem creates a memorable villain. The Coen brothers have brilliant eyes for such uniqueness. They are also great movie makers. Their movies are always well put together. Every scene is something interesting. And the actors are in great hands with such well-drawn compelling characters. The brothers have done it again."
    },
    {
      "username": "fwomp",
      "userUrl": "https://www.imdb.com/user/ur7704831",
      "reviewLink": "https://www.imdb.com/review/rw1792808",
      "warningSpoilers": false,
      "date": "3 January 2008",
      "rate": "10",
      "helpful": "194 out of 346 found this helpful.",
      "title": "You Don't Get Perfection Like This Very Often",
      "content": "If you're a Coen brothers fan, you're gonna be extremely delighted with NO COUNTRY FOR OLD MEN. This is Ethan and Joel at the pinnacle of their directing careers, something that should not be missed by anyone interested in film or entertainment. Forget FARGO. Push aside THE BIG LEBOWSKI. Move over O' BROTHER WHERE ART THOU. No Country is leaps and bounds beyond those. In fact, it reigns supreme as 2007's best film.I don't always agree with movie critics but this time they got it right. It is the first time that Associated Press reviewers David Germain and Christy Lemire have both selected the same film as their #1 pick. With more award nominations than you could shake a stick at (including four Golden Globes, three Screen Actors Guilds, probably a gaggle of Oscars and many, many, many others), No Country will undeniably have directors, actors and screenwriters jumping up on stage come awards ceremony time.Equal parts thriller, western, crime-drama, and action, No Country weaves a tapestry of excellence throughout its length.The first note of excellence must be directed at Spanish actor Javier Bardem. Probably not very well known to most American audiences, Javier has cemented himself as the leader in portraying a psychopathic killer and (dare I say it!) has surpassed that of Anthony Hopkins in his SILENCE OF THE LAMBS Hannibal Lecter role (something that I thought would never happen). Ruthless, unforgiving, sociopathic, and in desperate need of a new hair style, Anton Chigurh (Bardem) is flawless. Every time he showed up on-screen I felt a chill run through my bones (\"Call it\"). Absolutely perfect.The next note of excellence must go to Josh Brolin and Tommy Lee Jones. Llewelyn Moss (Brolin, PLANET TERROR) is the lucky/unlucky soft-spoken Texas cowpoke/hunter who stumbles across a veritable fortune in drug money only to be relentlessly pursued by killer Anton. Mr. Moss' gradual decline in health (mainly due to wounds inflicted on him by Anton) is painful to watch up until the very end. Sheriff Bell (Tommy Lee Jones) is the opposite of Anton Chigurh. He doesn't understand all of the death and destruction laid at his feet. He longs for a time when murders were easy to track and solve, not these new-fangled deaths where bullets aren't used (air-guns do just fine) and there seems to be no rhyme or reason to their patterns.The fourth (perhaps this should've been first) note of excellence goes to the Coen brothers for their perfect adaptation of Cormac McCarthy's novel by the same name. Many lines of dialogue were lifted verbatim from the novel itself, including the ending monologue by Tommy Lee. It's noteworthy to mention here that the Coen brothers not only directed but wrote the screenplay, too.The final note has to go Cinematographer Roger Deakins (he's worked with the Coen brothers on many occasions and also did the exemplary JARHEAD work). Every scene was so well thought-out and so convincingly filmed that viewers are carried freakishly easy through this incredible story.It's difficult to do justice to this film with one short review, simply because there are so many great elements to it. The casting was spectacular  with Woody Harrelson (NORTH COUNTRY) and Kelly Macdonald (THE GIRL IN THE CAFÉ) pulling in exceptional supporting roles  as was Carter Burwell's haunting original musical score and Mary Zophres impeccable costume designs.If you missed this film at your local cineplex, you may have gypped yourself from experiencing this amazing cinematic event. Now you've gotta wait for the DVD to be released and then ...it's your call."
    },
    {
      "username": "majikstl",
      "userUrl": "https://www.imdb.com/user/ur0650655",
      "reviewLink": "https://www.imdb.com/review/rw1830091",
      "warningSpoilers": true,
      "date": "29 February 2008",
      "rate": "3",
      "helpful": "59 out of 95 found this helpful.",
      "title": "No answers to key questions",
      "content": "When some movies are over, everything is tied up in a neat little package; for better or worse, someone worked really hard to make sure there were no unanswered questions. Other movies aren't so considerate. Others may be messy, but the good ones leave you asking key questions about the philosophy of the story. They may make you wonder \"What would I do in that situation?\" \"Was the hero really a hero?\" \"Do I agree with the film's moral?\" etc. These films draw you into the story, to the point where the ending is really the beginning of the film's lasting power. Sometimes messy is good.Bad ones, however, leave you questioning the story itself: \"Why did he do that?\" \"What happened to so-and-so?\" \"Did that make any sense?\" \"What did I miss?\" Such films make you see the holes in the plot, not the story that surrounds them. When the film is a huge critical or commercial success, the pertinent question may well be \"So, what's the big deal?\" NO COUNTRY FOR OLD MEN is a \"so-what's-the-big-deal\" type of movie. It is undoubtedly THE film of 2007, an Oscar-winning, critic's choice, top ten darling. Yet, for the most part, it is an utterly conventional modern day western; so predictable that Charles Bronson could be resurrected from the grave and plopped down into the middle of it without missing a beat. It is adequately directed and decently acted, but otherwise -- for the first two-thirds -- it is largely without distinction. Perhaps, because the filmmakers work so hard to seem unconventional in the last third, the defenders think they see something unique in the whole.The set up is routinely plotted: A poor, but relatively honest young man, while hunting in the west Texas desert, stumbles on a drug deal gone bad. While callously rooting around amidst the dead bodies, he helps himself to over two million dollars in illicit cash. He takes off and is soon pursued by a relentless, but relatively insane mob assassin -- and they are both -- sorta -- pursued by an honest, but relatively ineffectual local marshal. Leaving a predictable trail of dead bodies along the way, the film seems to be promising a confrontation where any two or more of the protagonists should face each other in a traditional showdown.At least, that is how the writing/directing team of Joel and Ethan Coen set things up. It could be argued that Coen brothers are playing around with the audience, mischievously creating expectations that they have no intentions of meeting. But in side-stepping the obvious tried and true plot twists and dramatic confrontations that such a climax normally would offer, the Coens don't really replace them with anything better. The last third of NO COUNTRY is shocking and challenging only because it is so vapid and devoid of drama. Characters die off-camera with only the vaguest explanation, while other characters' fates are left an obtuse mystery. The finale peters out into three separate and pointless conclusions: the thief dies, the killer apparently gets away and the policeman quits, never to cross each other's paths. And the audience isn't given much reason to care about any of them.The anemic narrative wouldn't matter so much, I suppose, if the film were instead a incisive or compelling study of one or more of the characters. Though the actors give decent enough performances, they can't flesh out the characters beyond ciphers. Josh Brolin as Llewelyn Moss, the hunter turned thief, is a solid presence, a modern day twist on the iconic figure of the strong, silent and resourceful cowboy. But beyond the good-boy-gone-bad tradition of the western, the film gives Llewelyn little backstory and no particular depth beyond being both foolish and yet smarter than one would expect. Ed Tom Bell, the gruff, world-weary, retirement-bound, small-town sheriff, is played by Tommy Lee Jones as a safe and comfortable stereotype; only denied by the uninspired script either the traditional age-cultivated wisdom or the opportunity to be even vaguely heroic. He spends most of the film wistfully longing for the good old days.Javier Bardem's much praised work as the tiresomely inscrutable and indestructible hit-man Anton Chigurh is largely a one-note performance -- Oscar win notwithstanding. His persistence, in lieu of any personality, has been inexplicable interpreted as having mythic dimensions as the embodiment of cruel fate or death incarnate. Only desperation to find meaning in the slight story justifies such heavy-handed symbolism. Lumbering through the film with all the emotional complexity of a slasher movie serial killer, Chigurh is little more than a lazy gimmick; with his over-sized weapons (one requires he lug around a 30-pound tank of compressed air!) and arbitrary flip-a-coin sadism, he is a ludicrous character who survives only due to the manipulations of a generously contrived script.But, it is no wonder the film focuses on Chigurh, who like Coens' films, embodies a cold, dispassionate emptiness. It is not that they don't do compassion (let alone passion) well, they don't even try. In their best effort, BLOOD SIMPLE, the chill of their drama is counteracted with a coy air of satire. Even FARGO is unpleasantly empty as far as emotional depth. You can tell a lot about filmmakers by how they treat even their minor and incidental characters; most characters in Coen films are disposable plot devices. It is no wonder a key character is killed off screen; the Coens don't care about his fate and assume we shouldn't either.NO COUNTRY FOR OLD MEN builds to one of the least satisfying conclusions of all time. The film is ultimately riddled with gaps in logic and figure-it-out-for-yourself ambiguities; things that the audience may not need to see, but have a right to expect to experience as part of the drama. NO COUNTRY isn't just weak film-making, it is an act of bad faith. The final question facing the viewer might well be \"Is that it?\""
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw1827278",
      "warningSpoilers": false,
      "date": "25 February 2008",
      "rate": "",
      "helpful": "37 out of 64 found this helpful.",
      "title": "Great Till the End",
      "content": "No Country for Old Men (2007) *** 1/2 (out of 4) A hunter (Josh Brolin) comes across a group of trucks with dead bodies everywhere and discovers $2 million in cash, which he takes. Soon a psychotic killer (Javier Bardem) is after him while a local sheriff (Tommy Lee Jones) tries to figure out what's going on. I'll start off by saying that I'm not a big fan of the Coen brothers. With that out of the way, this is certainly the best movie I've seen from them but it goes downhill very quickly in the final thirty-minutes, which are quite horrid to be honest. However, everything before that is masterfully done with a beautiful craft that makes this familiar story come off very original, dark and at times funny. I really enjoyed the slow pace that the film carries but I'm not sure if that's how I should describe it. The movie has plenty of graphic violence and action and what makes it so shocking is that it usually comes out of no where or happens when you don't expect it. The pace of the film is slow but this helps when the violence breaks out. The performances are all terrific with Bardem stealing the show as the psychotic killer. Whenever he's on screen you can't take your eyes off of him and his silent performance speaks more than any words could. I was also very impressed with Brolin who I'm usually hit and miss on. Woody Harrelson has a few nice scenes and Tommy Lee Jones is the old Tommy Lee Jones we all love. The film was a lot of fun until the conclusion, which I thought was quite awful."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2494823",
      "warningSpoilers": false,
      "date": "27 September 2011",
      "rate": "9",
      "helpful": "29 out of 49 found this helpful.",
      "title": "A masterpiece, albeit a flawed one",
      "content": "No Country for Old Men is not necessarily the Coen Brothers' best movie, I consider Barton Fink, Fargo, Miller's Crossing and The Big Lebowski better. However it is a great movie, I'd go as far to say it is my definition of a flawed masterpiece(the only other movie I've given that definition to is The Magnificent Ambersons). So why do I call it a flawed masterpiece rather than a masterpiece full stop? Well actually right up to the last twenty minutes, the film was the latter rather than the former. If the last twenty minutes had not felt like a completely different movie, it would've stayed like that. As is the case with all the Coen Brothers' movies, No Country for Old Men is very well made with impressive cinematography, editing and settings. The story is compelling, the direction superb and the script most of the time taut, funny, thrilling and exciting. Josh Brolin and Tommy Lee Jones are excellent in this film, but if I have to give an award to best performance of the film, it would be Javier Bardem in a villainous role that is menacing and chillingly effective. Overall, a great movie but due to the final twenty minutes it just loses out to that extra something. 9/10 Bethany Cox"
    },
    {
      "username": "ProfRevDrFilmReligionHistory",
      "userUrl": "https://www.imdb.com/user/ur20173820",
      "reviewLink": "https://www.imdb.com/review/rw3689560",
      "warningSpoilers": false,
      "date": "20 April 2017",
      "rate": "9",
      "helpful": "43 out of 53 found this helpful.",
      "title": "Welcome to NihilismLand",
      "content": "No Country for Old Men won four Academy Awards in 2007, including Best Picture and Best Director(s). Despite the critical acclaim, the Coen Brother's adaptation of Cormac McCarthy's novel was probably a bit of a head-scratcher to many people.The film's narrative begins in familiar fashion, introducing you to the main characters and setting up the plot using recognized, established filmic devices. Llewelyn Moss stumbles upon a suitcase filled with cash and wants to keep it for himself. Anton Chigurh is the sociopath who will stop at nothing to get the cash back. Ed Bell is the Sheriff tasked with bringing Chigurh to justice and, it is presumed, keeping Moss and his wife, Carla Jean, from danger. In addition, there's a corporate backer, a hired gun, and a Mexican gang who are also after the cash (i.e., the McGuffin). So much for the usual narrative elements.When the film continues far beyond the point that the expected narrative structure breaks down, viewers are left to grasp at what the film is actually about. What, if anything, is this film trying to say?I propose that the film is, among other things, a meditation on the impotence of human and divine systems of justice in light of unflinching, unrelenting, random, radical evil. There are a number of elements in the film that indicate such a meditation, but one need not look much further than the meditations of Sheriff Bell, whose words begin and end the film. Consider:\"There was this boy I sent to the 'lectric chair at Huntsville Hill here a while back. My arrest and my testimony. He killt a fourteen-year-old girl. Papers said it was a crime of passion but he told me there wasn't any passion to it. Told me that he'd been planning to kill somebody for about as long as he could remember. Said that if they turned him out he'd do it again. Said he knew he was going to hell. 'Be there in about fifteen minutes'. I don't know what to make of that. I sure don't. The crime you see now, it's hard to even take its measure.\" With these words, the film's \"story line\" unfolds, with Sheriff Bell trying, and failing, to be effective.At the end of the film, the retired Sheriff Bell describes a dream to his wife:\"It was like {my father and I} was both back in older times and I was on horseback going' through the mountains of a night. Going' through this pass in the mountains. It was cold and there was snow on the ground and he rode past me and kept on going'. Never said nothing' going' by. He just rode on past... and he had his blanket wrapped around him and his head down and when he rode past I seen he was carryin' fire in a horn the way people used to do and I could see the horn from the light inside of it. 'Bout the color of the moon. And in the dream I knew that he was going' on ahead and he was fixin' to make a fire somewhere out there in all that dark and all that cold, and I knew that whenever I got there he would be there. And then I woke up.\" The film is nihilistic in both structure and content. If you would like to force a less despairing ending, Bell's dream could be interpreted as a ray of hope: a light shines in the darkness! On the other hand, it is a dream that he wakes up from.I don't know what to make of that. I sure don't. But that doesn't mean I can't try."
    },
    {
      "username": "wisewebwoman",
      "userUrl": "https://www.imdb.com/user/ur0509769",
      "reviewLink": "https://www.imdb.com/review/rw1807916",
      "warningSpoilers": true,
      "date": "26 January 2008",
      "rate": "1",
      "helpful": "155 out of 291 found this helpful.",
      "title": "Gallons and gallons of blood",
      "content": "Not to mention bloated dead bodies of dogs and humans and a \"man who wouldn't die\".\"No Country for Old Men\" has Javier Bardem playing Anton Chigurh, a monstrous motive-less killer (unless you count the money, but how does he know about it?) He slides in and out of scenes, you are always chilled but like the clichéd train-wreck victims you see reeling on the side of the road, he never engages you, you never speculate on what made him this way, he is simply a nerveless, passionless cypher.Actually the clichés were too many to count in this truly, truly disappointing effort from the Coen brothers. A police officer turns his back on the monster and is promptly dispatched and of course the monster manages to squeeze bloodily out of his own handcuffs. H'mm. The instrument used to kill by Chigurh is some kind of stun gun with an oxygen tank. Surely to God he could get hands on a gun with a silencer and not have to lug this tank around like some deranged Fred Munster? There is so much blood, the only conclusion I could make was that this was the whole point, raise the barf meter with everyone, show acres of gratuitous violence to draw in the desirable adbash demographic and forget any kind of plot. A slasher film for the pseudo-sophisticated.The movie grabs you early and you think, as you survey a field full of fallen felons (they were involved in a drug heist) discovered by an officer played by Josh Brolin, that this movie is going to unwind a great mystery. You settle in for the denouement.Poor you. You are sidetracked by an absolutely meaningless sub-plot involving Woody Harrelson (another grisly ending) and by Tommy Lee Jones who was left without any relevant script and wanders cynically in and out of scenes, delivering tired old witticisms as a sheriff. We can count the ways and days of tired old cynical sheriffs. I was waiting for \"life is just a box of chocolates and Chigurh the hardboiled candy\". It would have improved things.I was baffled as to the narrative. Was there one? Why didn't I get it? Was this movie, in spite of the barrels of blood, too deep for me? I was asking myself these questions long before it was over.Was this movie reaching for pretension or was it truly in the stratum of the intellectual elite? Coin toss answer.For me, it seemed fitting that there was no ending to this. No plot should equal a no ending. The beast didn't die and went on his stumbling way. All the good guys died, apart from aforementioned slow-drawl sheriff, who is now retired.Zero artistic merit, zero plot. I gave it a 1 to bring down the over-rating. I still like Tommy, Josh gave a great perforance but I'm going to be really leery of future Coen efforts."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw2923246",
      "warningSpoilers": false,
      "date": "16 December 2013",
      "rate": "10",
      "helpful": "11 out of 16 found this helpful.",
      "title": "The Coen Brothers strike again",
      "content": "Joel and Ethan Coen know how to tell a story -- sometimes its meaning is obscure, sometimes it's in your face, but it's always fascinating.In the obscure category is \"No Country for Old Men,\" from 2007, starring Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harrelson, and Barry Corbin.What I'm going to write next will mystify many. In a funny way, this film reminded me of Psycho. Here's why - in Psycho, we're led to believe that it's a story about a woman who steals money from her employer. Then she stops at the Bates Motel, and the story changes.Same deal here. This starts off as a story of a man who steals money he finds at a drug deal gone wrong, and we believe we're watching him trying to escape the man chasing him. Turns out the movie isn't really about that.In Texas in 1980, Llewelyn Moss (Josh Brolin) discovers the scene of a drug deal gone terribly wrong - the ground is peppered with dead bodies. Also laying around unattended is 2 million dollars, which Moss takes.As a result, a man named Anton Chigurh (Javier Bardem) is after him. Chigurh kills just about anybody who crosses his path. Moss is on the run, and Chigurh is close behind every step of the way.The sheriff, Tom Bell (Tommy Lee Jones), has become discouraged by the evil in the world and his helplessness in the face of it. Nevertheless, he tries to beat Chigurh to Moss, all the while realizing the job has just about burned him out. It is, in fact, no country for old men.The film is symbolic of evil in human form (Chigurh) coming up against a decent man (Moss) and how it brings about his ruin. Moss' ego and arrogance make him think he can overcome Chigurh's pure evil. His innate goodness compels him to return with water for the one dying drug dealer at the scene, putting Chigurh on his trail when he finds his truck. Temptation, as in the Garden of Eden, can lead to ruin.All the men involved in the story -- Chigurh, Moss, Bell, and an old man whom Bell visits, Ellis - are all fatalists. Moral weakness allows the gods to wreak havoc. Llewellyn brings his fate on himself, and the fate can't be stopped. And so much that happens seems to happen by chance, as the result of a coin toss -- for someone like Bell, looking for meaning, there is no meaning to be found.The Coen Brothers take the western genre and turn it on its boots - we don't witness some of the deaths, and we don't witness the classic good versus evil fight. With Sheriff Bell's retirement, it seems that we are to conclude that evil wins. But the Coen Brothers leave us with hope, as long as we don't depend on mankind for it. Like Bell's dream about his father going ahead and starting a fire for him, the hope is outside of ourselves and our world. As we've seen in court cases, there is no getting of justice in this world. At the end of his dream, Bell says, \"I woke up,\" as we all must.A remarkable film by remarkable filmmakers, demanding multiple viewings."
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw3350549",
      "warningSpoilers": true,
      "date": "7 November 2015",
      "rate": "8",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Gritty edge-of-seat from start to finish",
      "content": "\"No Country for Old Men\" is the Coen Bros' adaptation of the Cormac McCarthy novel from almost 10 years ago. This film won 4 Academy Awards, including Best Picture, and while I have doubts to say this is my favorite film of the year and not \"There Will Be Blood\", there is no denying that \"No Country for Old Men\" is among the finest the year 2007 had to offer. The movie runs for slightly over 2 hours, with credits, and takes us into the world of Llewelyn Moss who finds a huge amount of money. For almost the entire movie, he is on the run from contract killer Anton Chigurh (Javier Bardem, Oscar winner) with Tommy Lee Jones playing Ed Tom Bell, a sheriff who, on the other hand, is trying to help Moss and catch Chigurh. Woody Harrelson and Kelly McDonald play important characters too.It has always been the Coens' strength to include characters in their movies who may be minor, but are still very memorable. Their recent movie \"Inside Llewyn Davis\", my favorite from the brothers, is a great example of that, but this film here is as well. Garret Dilahunt playing a sheriff's assistant was as fun to watch as Kathy Lamkin's one-minute, one-scene character: \"We can't give out no information.\" This scene actually gave out a nice piece of information on Chigurh. I don't think he let her live because there was somebody else when we hear the noise of somebody flushing the toilet. He is not scared of attracting attention in other scenes by killing several people in the same location. I think he was impressed by how much of a professional the woman was, even in the face of such a dangerous man like him, so she did not even have to go through his coin toss procedure. Actually, Chigurh and women is a chapter interesting enough to write a full article about on its own. For example, he offered Carla Jean the chance to live at the end, even if he promised Llewelyn otherwise. And then there is that \"You married into it.\" scene of course.In general, this film is packed with tense, brilliantly atmospheric material from start to finish, be it the dog chase scene, the scene when we see Chigurh turn out the lights in the hallway as he knew Moss would see him, the scene with Chigurh and Bell almost facing each other or the final monologue by Tommy Lee Jones' character. I have heard about interpretations Chigurh and Bell are actually the same person. There are some indicators that it may be true, especially the face-off I just mentioned, but who knows. In general, my personal perception is still that it is not the case. That's entirely subjective though. In any case, the Coen's created one of the most memorable villains in film history here (with the help of McCarthy, of course). The way they used Chigurh's coin as a depiction of luck and fate was simply brilliant and it's very telling that, while Chigurh was always in charge with human enemies following him (he killed most of these), he picked the wrong side of the coin in the end apparently when something completely unexpected happens. But this is what luck and fate is all about. You cannot influence it. Great last scene with Bardem's character for sure. I am truly curious what happens to him next. This scene also makes for a nice parallel with Moss' scene earlier when he pays a lot of money for the jacket (being the somewhat good guy) and Chigurh gets the shirt for free (being the bad guy). Life's not fair. Neither is this movie. But it's very outstanding and a great achievement of filmmaking. Highly recommended."
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw2999861",
      "warningSpoilers": true,
      "date": "17 April 2014",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Makes an indelible mark. Not to be soon forgotten.",
      "content": "It doesn't tend to come up when I think of crime movies, but \"No Country for Old Men\" is a great one. It's got that slow and methodical predator-stalking-his-prey tempo, and the movie's populated with some great characters. Anton Chigurh is surely one of the creepiest bad guys I've ever laid eyes on (the cattle gun is novel, and the sound of that shotgun!); Bardem ratchets the creepiness of that guy to unbelievable heights. Conversely, Brolin's outlaw has got to be one of the dumbest. He proves himself a wily criminal, but drug money always has someone coming for it. Not bright.But even in a movie full of well-drawn characters, Tommy Lee Jones is still the highlight for me. He vividly brings to life the sardonic world-weary lawman and I found myself looking forward to his next scene and hearing his dialogue. Dude's just got that gift. Harrelson's equally gifted here. But I was also floored on a technical level. There's great atmosphere; those arid deserts are not a place I want to find myself lost in (that howling wind is its own brand of unnerving). But just how much of this movie played out with no score. The sound design here is amazing; more often than not, it's just he background noise of a ticking clock, beeping transponder or footsteps providing us with any sound at all. It's haunting, really.7/10"
    }
  ],
  "errorMessage": ""
}