{
  "imDbId": "tt0407887",
  "title": "The Departed",
  "fullTitle": "The Departed (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "100",
      "content": "A new American crime classic from the legendary Martin Scorsese, whose talent shines here on its highest beams."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "https://www.hollywoodreporter.com/movies/movie-news/departed-2006-review-935692/",
      "rate": "100",
      "content": "A ferociously entertaining film."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "100",
      "content": "The Departed is Scorsese's most purely enjoyable movie in years. But it's not for the faint of heart. It's rude, bleak, violent and defiantly un-PC. But if you doubt that it's also OK to laugh throughout this rat's nest of paranoia, deceit and bloodshed, keep your eyes on the final frames. Scorsese's parting shot is an uncharacteristic, but well-earned, wink."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/movies/d/departed.html",
      "rate": "100",
      "content": "The original film was gritty and entertaining (\"Infernal Affairs\"); the new version is a masterpiece - the best effort Scorsese has brought to the screen since \"Goodfellas.\""
    },
    {
      "publisher": "Premiere",
      "author": "Glenn Kenny",
      "link": "",
      "rate": "100",
      "content": "A triumphant revisiting of territory in which Scorsese is an unchallenged master -- the crime drama."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "91",
      "content": "The very title The Departed suggests a James Joycean take on Irish-Catholic sentiment when, of course, this story is anything but: It's Scorsesean, and he's in full bloom."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "https://variety.com/2006/film/awards/the-departed-2-1200512992/",
      "rate": "90",
      "content": "This reworking of a popular Hong Kong picture pulses with energy, tangy dialogue and crackling performances from a fine cast."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "",
      "rate": "80",
      "content": "The movie works smashingly, especially if you haven't seen its Hong Kong counterpart and haven't a clue what's coming. But for all its snap, crackle, and pop, it's nowhere near as galvanic emotionally."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Back to the streets and with a stellar cast, Martin Scorsese proves once again that he's the master of urban storytelling -- and of thrillingly violent filmmaking."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "60",
      "content": "Neither a debacle nor a bore, The Departed works but only up to a point, and never emotionally--even if the director does contrive to supply his version of a happy ending."
    }
  ],
  "errorMessage": ""
}