{
  "imDbId": "tt0407887",
  "title": "The Departed",
  "fullTitle": "The Departed (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2170460",
      "warningSpoilers": false,
      "date": "7 December 2009",
      "rate": "10",
      "helpful": "57 out of 70 found this helpful.",
      "title": "Moles And Rats",
      "content": "When The Departed finally gained for Martin Scorsese a Best Director Oscar it was felt it might have been for the work of a lifetime. It's not my favorite Scorsese film, that honor belongs to Casino for me. But it certainly was the Best Film of that year as well, rivaled in my humble opinion by Blood Diamond.Instead of an Italian atmosphere for The Departed, Scorsese decided to use the Boston Irish who are the dominant group of that city in everything including crime. The film is simple enough, the police want to take down organized crime kingpin Jack Nicholson who plays a character named Frank Costello. That was Scorsese's little joke because the real Frank Costello was one of the Mafia overlords back in the day, although his real name was an Italian one.Nicholson's character is based on Whitey Bulger who was the real life organized crime chieftain of the Boston area. He came from a really interesting family because a brother of his William Bulger had a long political career that culminated in that Bulger being elected President of the Massachusetts State Senate. I didn't add the word distinguished because scandal crept around that man all his life.Getting this man won't be easy because he has a full bag of tricks. One of them being that years ago he put a young man played by Matt Damon through the Boston Police Academy, concealing a juvenile record and Damon moved gradually up the ranks and got to work in the Boston PD Internal Affairs Division. A great spot for a mole to keep an eye on pending investigations.But the Boston PD has put one of their own undercover in the person of Leonardo DiCaprio whose family knows Nicholson from the neighborhood. At that point the whole film becomes a cat and mouse game on both sides with each having their informants on the other side. There are no dummies on either side, the police aren't keystone cops and the criminals as shrewd and brutal as they come. Scorsese probably had a lot of help in having both Matt Damon and Mark Wahlberg in the cast. Both of these players are well known for their Boston roots and they fit really well into their parts. Mark Wahlberg for his role as one of the task force trying to take Nicholson down got an Oscar nomination for Best Supporting Actor. He lost to Alan Arkin for Little Miss Sunshine. Wahlberg was the only one who came up short at Oscar time. The Departed won additional Oscars for Best Adapted Screenplay and Best Film Editing to go with the Best Picture And Best Director Oscars for Scorsese. Leonardo DiCaprio had a career year, he might have been nominated himself if he wasn't up for Best Actor in Blood Diamond.The real Whitey Bulger is 80 years old now and in real life he was as full of tricks as Nicholson's character is in the film. If you think you know how this film ends, I guarantee you will be wrong. Nicholson's character has survived in many ways, that's all I can say.Scorsese has a nice feel for Boston's atmosphere, as good as what he had for Goodfellas in New York and Casino in Las Vegas. He assembled a great cast of people who all got a crack at working with one of the best film directors of all time. The cast didn't let Martin down at Oscar time and they won't let you down when you see it on the big screen or the small."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3490372",
      "warningSpoilers": true,
      "date": "19 June 2016",
      "rate": "10",
      "helpful": "43 out of 56 found this helpful.",
      "title": "One of Scorsese's very best movies",
      "content": "Martin Scorsese returns to familiar territory with this story of the lives of cops and gangsters living in America. However, a few things are different this time around – it's Irish gangsters rather than Italian, and for the first time in his life, Scorsese is shooting a remake, of the Hong Kong film INFERNAL AFFAIRS. I haven't yet watched the original film but I'm pleased to say that THE DEPARTED is an example of the director at the top of his game and I'm completely satisfied that he finally won his best director Oscar for his efforts here.To say too much would be to spoil the experience. Cinematography is spot on and the ensemble cast fantastic – headlined by DiCaprio, playing it on the edge as the undercover cop, and Damon as the hateful cool cucumber, a con on the inside. Jack Nicholson plays it OVER the edge as a past-his-prime gangster; gradually losing his marbles in a world of violence, while Ray Winstone's heavy is another weighty performance from this underrated star. Kudos to newcomer Vera Farmiga for holding her own among the established talent and Martin Sheen for taking a small role and running away with it. Mark Wahlberg also deserves mention for his Oscar-nominated supporting role as a foul-mouthed cop, the best of his career.The plot twists and turns and is chock-full of Scorsese's trademark violence, with bloody shootings and beatings taking place throughout. The story is complex, forcing the viewer to give the film their full attention, so the 2 ½ hours just fly by as you're watching it. Things culminate in what I think is a very effective, brutal, shocking, sudden climax, which some people have criticised as being too rushed and too violent, but which I think is perfectly realistic, an example of how a house of cards can come tumbling down so suddenly. A perfect ending to a perfect film – and a must for all fans of twisty thrillers and gangster flicks."
    },
    {
      "username": "damianphelps",
      "userUrl": "https://www.imdb.com/user/ur29500838",
      "reviewLink": "https://www.imdb.com/review/rw6148980",
      "warningSpoilers": false,
      "date": "5 October 2020",
      "rate": "8",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Scorsese Does it Again",
      "content": "I think I would enjoy a Scorsese movie about making butter!He's a genius and we are all lucky to have him.Its a good story (a remake) that is largely swept to great heights by the performances of the cast.There are over 2000 review for this movie so I don't think I need to add much.Its really great entertainment that won't let you down.Enjoy!"
    },
    {
      "username": "James_Denton",
      "userUrl": "https://www.imdb.com/user/ur86987045",
      "reviewLink": "https://www.imdb.com/review/rw6303620",
      "warningSpoilers": false,
      "date": "23 November 2020",
      "rate": "10",
      "helpful": "29 out of 37 found this helpful.",
      "title": "10 out of 10 and WOW does this film deserve it! Absolutely Brilliant!!",
      "content": "Blood Diamond (2006) was the film which turned me into a fan of Leonardo DiCaprio, and he must have been on a roll that year as The Departed (2006) was not only made that year, but is just as good as Blood Diamond with again phenomenal acting from almost all.The good and the bad: The film is 14 years old at the point of writing this, and is still as good as the day it was released first saw it.The acting is phenomenal with the award (in my opinion) going to Leonardo DiCaprio .One of the beauties about this film is: Just as you think you've grasped what is going on it throws another twist in.The only let down for me (and it is minor irritation) was Matt Damon, whom I'm not a fan of or his acting.With all the great reviews it should do without saying that The Departed (2006) is outstanding! A fantastic great story, with twists and turns and that will keep you guessing to the end - and even then you will mostly have guessed wrongly.The film has it all... suspense, thrills and tense moments... the brilliance of the The Departed (2006) cannot be overstated. A must watch!So this is one of those rare moments where 10 out of 10 is deserved.Recommended."
    },
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1511201",
      "warningSpoilers": false,
      "date": "31 October 2006",
      "rate": "10",
      "helpful": "206 out of 318 found this helpful.",
      "title": "Scorsese's best since Goodfellas!",
      "content": "He has made good musicals (New York, New York), surreal comedies (After Hours), satires (The King of Comedy) and biopics (The Aviator), but Martin Scorsese has never done better than the times he's dealt with life on the streets and gangsters. Mean Streets, Goodfellas and Casino (and, to some degree, Taxi Driver) are proof of that. It doesn't seem strange, then, that his finest film in over a decade (Goodfellas was released in 1990) sees him return to that familiar ground. With a few changes.The Departed, based on Hong Kong thriller Infernal Affairs (2002), is Scorsese's first gangster film not to feature Italian-American criminals. In fact, this film is set in Boston, where the Irish rule. One of these \"godfathers\" is Frank Costello (Jack Nicholson), the man the State Police want the most. After years of investigation, they're finally getting close, thanks to undercover agent Billy Costigan (Leonardo Di Caprio). Because of his family (all Irish, all bad), becoming a member of Costello's crew isn't that difficult. Now all Costigan has to do is report to his superiors, Queenan (Martin Sheen) and Dignam (Mark Wahlberg), who will pass on the information to Ellerby's (Alec Baldwin) Special Investigations Unit. What they don't know is that Colin Sullivan (Matt Damon), the most promising element of said unit, has been on Costello's payroll since he was 12. Soon enough, both cops and crooks become aware of the situation, beginning a manhunt that's gonna make the already fragile Billy even more nervous and Costello increasingly crazier.By moving from Hong Kong to Boston, Scorsese and screenwriter William Monahan have made the first step in ensuring this film will be quite different from its Chinese inspiration. Another significant factor is the running time: a mere 97 minutes for Infernal Affairs, 150 for The Departed. This is due to new characters (Dignam and Costello's henchman Mr French, played by Ray Winstone, were missing in the original) and subplots, such as the one concerning Madolyn (Vera Farmiga), a psychiatrist who gets emotionally involved with both of the moles. But the most crucial difference is in the depiction of the underworld: whereas IA was stylish without being excessive, Scorsese's vision comprises very colorful language (some insults are so creative one might expect Joe Pesci to show up) and, of course, buckets of blood, the last part of the movie proving to be particularly shocking. None of the scenes ever reach the gross-out level of Casino's head-in-the-vice scene, but in pure Scorsese tradition it remains unflinchingly violent (also notable is the music, perfectly setting the mood, scene after scene, alongside Thelma Schoonmaker's impeccable editing).Amidst these brutal surroundings, the director handles a spot-on cast: Baldwin, Sheen and Wahlberg (the latter finally back on form) make good use of their little screen time, Damon fine-tunes the edgier side he showed in The Talented Mr Ripley and the Bourne movies, and Nicholson, playing the villain again at last, delivers another OTT but classy turn (original choice Robert De Niro would probably have played the part with more calm and subtlety). A special mention is needed for Di Caprio: working with Scorsese for the third consecutive time, he has finally found a way to shake off his Titanic image, thanks to a vulnerable, gripping (and arguably career-best) performance.With its clever plot, excellent acting and expert direction, The Departed is without doubt the year's best film so far. If this really is going to be his last gangster film (he has said so), as well as his last studio-endorsed picture, Scorsese can be proud, given the masterpiece he has given us. If only they gave him the Oscar in return..."
    },
    {
      "username": "Billy_Costigan",
      "userUrl": "https://www.imdb.com/user/ur5321100",
      "reviewLink": "https://www.imdb.com/review/rw2014673",
      "warningSpoilers": false,
      "date": "28 January 2009",
      "rate": "",
      "helpful": "240 out of 333 found this helpful.",
      "title": "Lies, Betrayal, Sacrifice. What will you believe?",
      "content": "First off, this is an American stylized remake of the Hong Kong hit, Infernal Affairs. I have to give credit to that, a good film. I have seen both Infernal Affairs and The Departed. I personally prefer The Departed, and I think because of one thing: Martin Scorsese. This is the master behind such greats as Taxi Diver, Raging Bull, Goodfellas, and he's at it again. The film has an all star cast with Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg, Martin Sheen, and Alec Baldwin.The Direction was amazing. (maybe one of the reasons why he won the Oscar for it) I loved how some of the scenes were shot and set up. Especially regarding the Chinatown, and police interrogation scenes, among many others. The film is perfectly set up with intense, suspense scenes while adding in amounts humor at times. It works really well. The script is top notch. (Also Oscar winning) Realistic strong dialogue from scene to scene.Another thing I liked more in The Departed, as opposed to Infernal Affairs, was the acting. DiCaprio really seemed to earn a lot of respect from this role. Here, he takes on the tough guy persona so well. Sure it was known he was a good actor from his Oscar nominated performances in What's Eating Gilbert Grape and The Aviator, but he really takes it to another level here. I can't see anyone else as the character, he fits so perfectly with it. Matt Damon and Mark Wahlberg, being Massachusetts natives, also give solid performances, with their natural accents. Nicholson works well in his role, as well. Everyone was extremely solid and everything seemed so real.Set in Boston, The Departed takes in all the Boston like atmosphere. Beautifully shot scenes of the Massachusetts Golden Dome State Capital building is just one part of the landscape. The Dropkick Murphys song \"I'm Shipping up to Boston\" really fits, great use of songs. Scorsese usually works music into his films really well.\"Cops or Criminals. When you're facing a loaded gun what's the difference?\" This quote really represents the film.\" Matt Damon plays a state officer in the Police, working for the crime boss of the area, Frank Costello (Nicholson). While Damon's character can be described as a \"bad guy,\" he is really misunderstood. As a kid, he is sort of mentored into crime business by Costello while Costello becomes the father figure Damon's character never had. Leonardo DiCaprio plays a young guy, coming from a bad, crime ridden family. He's decides to become a police officer to get away from the crime life he's been surrounded by. Taking all this into account, Captain Queenen (Sheen) and Seargent Dignam (Wahlberg) decide to send DiCaprio's character undercover to find out more about the criminal underworld and Costello. With his family's crime record, he fit's perfectly into the situation. Now you have a highly ranked officer working for bad guy, and an undercover cop in the criminal underworld working for the State Police. From here it's an all out suspenseful thrill ride. Who's who? Who's working for who? Who can you trust? Paranoia threatens everyone. Lies. Betrayal. Sacrifice. How far will you take it? At the heart of this film is character development. We really feel for the characters. We feel like we know them. It's really amazing part of this story and film. Tremendous story telling here.This is one of the most entertaining and suspenseful crime/drama's I have seen in a while. While Infernal Affairs, came first, I think The Departed expands on it in so many ways. Really solid crime/drama. Check both out when you get a chance. It's really worth it. 9/10"
    },
    {
      "username": "Alwood",
      "userUrl": "https://www.imdb.com/user/ur0163443",
      "reviewLink": "https://www.imdb.com/review/rw1488938",
      "warningSpoilers": false,
      "date": "3 October 2006",
      "rate": "10",
      "helpful": "882 out of 1,350 found this helpful.",
      "title": "Martin Scorsese Hits the Streets Again!",
      "content": "Please don't make negative comments like some of the aforementioned people have been doing if you haven't seen the film yet! I have seen it, at a press screening last week. Not only is it the best film of the year so far, it marks a return to form for Martin Scorsese, and ranks with the likes of GOODFELLAS as being one of the best in his canon of films.I'm a fan of the Hong Kong film, INFERNAL AFFAIRS, upon which this is based. While THE DEPARTED keeps the basic structure of the original, it is very much its own movie, so much so that the screenwriter, William Monahan, didn't even watch the original film while adapting its screenplay, thus enabling him to infuse the script with his, and Scorsese's, respective visions.All the actors are first-rate (yes, even Leo, for all you DiCaprio bashers out there), and turn in some of their best performances to date. THE DEPARTED is sure to garner a host of Oscar nods, if not wins, including (hopefully) Scorsese's long-overdue statuette for Best Director. Plus, with actors like Martin Sheen and Alec Baldwin playing supporting roles, that says a lot about the quality of the film they signed up for! THE DEPARTED is tough stuff, not for the faint-of-heart. That said, it is a must-see for adult viewers who long for intelligent, gritty stories to grace our movie screens once again."
    },
    {
      "username": "General_Turgidson",
      "userUrl": "https://www.imdb.com/user/ur1719528",
      "reviewLink": "https://www.imdb.com/review/rw1488926",
      "warningSpoilers": false,
      "date": "2 October 2006",
      "rate": "10",
      "helpful": "938 out of 1,332 found this helpful.",
      "title": "Superb acting on top of brilliant storytelling",
      "content": "Now I know that 'The Departed' is based off of the Hong Kong movie 'WuJianDao', but Scorsese really grabs hold of a great story and brings it to the American Screen. My father grew up in Boston and when we walked out of the theater he couldn't stop talking about how authentic the environment and attitude was. Then there's the acting in which the lead actors (Nicholson, DiCaprio, Damon) not only give stunningly entertaining performances, but you become engulfed in each one's perspective and dilemmas. The smaller roles that of (Baldwin, Walberg, Sheen) are supporting roles that remind me of Jesus Quintana from 'The Big Lebowski', by this I mean that their screen time is limited but they make lasting impressions that you cherish each and every scene they are in, Alec Baldwin especially. The story itself starts off with the basic intro of the players and the setting, but you'll find yourself slowing following each and every plot twist and rooting back and forth for the good guys and for the bad guys. If you're a Scorsese fan, which I am, I think you will appreciate this film. You can clearly see the Scorsese touch ranging from the cinematography and of course the music, it's great to hear \"Gimme Shelter\" again, but \"Comfortably Numb\" played in so well. It's another gangster flick from Scorsese, yet this one stands alone because feels so fresh and most would agree Scorsese does gangster films the best; so why not let him. Oscar worthy, the acting I certainly hope; this is DiCaprio's best role since 'The Aviator' which was his best role since 'Gangs of New York', am I seeing a pattern here. But my lasting impression wasn't concerned with the politics of the golden statue; my lasting impression was that I had sat through 2 and half hours of brilliant and especially entertaining storytelling. Thank you Mr. Scorsese."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw1623284",
      "warningSpoilers": true,
      "date": "23 March 2007",
      "rate": "7",
      "helpful": "47 out of 79 found this helpful.",
      "title": "Scorsese Should Have Made His Own Movie",
      "content": "I had massive expectations for THE DEPARTED , a violent mob drama directed by Martin Scorsese the greatest film maker in the world today . After seeing it I did have a slight of feeling of something I have experienced throughout my life - Disappointment ***** SPOILERS ******The film starts in typical Scorsese style of a sweeping framing sequence with a musical soundtrack by The Rolling Stones similar to the work he did in GOODFELLAS . Unfortunately the director doesn't sustain this and whilst never becoming mediocre we don't see much in the way of what cinematic beauty Scorsese is capable of and in several scenes most notably in the death of Queennan the original film INFERNAL AFFAIRS did it far more better THE DEPARTED suffers from a very uneven screenplay courtesy of William Monahan . When it's bad it's woeful but when it's good it's great . It should be pointed out however that when it's good it's entirely down to Siu Fia Mak's original script and if you've seen INFERNAL AFFAIRS you'll notice how tight the storytelling was and how loose and cluttered Monahan's adaptation is in comparison . Did we really need a romantic subplot ? And there seems a lack of thought put into Costello . He's spent years as a crime boss so how come it appears it's only now that the Boston police department have come up with the bright idea of putting several moles into Costello's crew ? Are we to seriously believe that Costello is being protected for < Plot revelation that I won't give away > , and just because a tough gangster likes opera that doesn't make him multi layered , it just makes him clichéd and unconvincing . Most ridiculous scene is where Costello meets his police mole in the cinema . If it's a clandestine meeting then why does Costello draw attention to himself by grunting and pulling out his penis ? Possibly the most stupid sequence I've ever seen in a Scorsese film There's been many other criticisms of this movie , a movie that seems to have split the critics right down the middle . One is the cast . I do think DiCaprio is a much better actor than what he's given credit for but I was never entirely convinced when he has to dish out violence . Someone a little less pretty should have been cast while you're left with the impression that Deniro and Pesci were first choices for Costello rather than Nicholson . Damon does merely okay as Sullivan while Ray Winstone as French is somewhat distracting because he's a widely regarded actor and household name in Britain and seeing him attempt an American accent is something of a shock to the system . The one performance I wasn't keen on was Mark Wahlberg as Dignam down to the fact he plays one of those fast talking foul mouthed cops that we've seen in far too many films and HBO series. Perhaps I'm being somewhat harsh to the cast in general and Wahlberg in particular because the dialog in Monahan's screenplay contains far too much swearing . Yeah I know swearing exists in real life but it's almost like it's included in every line just so the audience know that it's a hard hitting adult drama . I think everyone knew that when we saw the name Scorsese in the title . No need to over egg the pudding or include a fist fight every few minutes otherwise someone might think they're watching a Tarintino movie As for the good points ... well if you've liked most of this great auteur's movies then you'll certainly like THE DEPARTED , just not as much as you've liked Scorses's previous output . If you have loved most of Scorsese's films then you'll be slightly disappointed . It's not helped by the fact that this is the first movie directed by Scorsese to pick up the Oscar for best film where as master works like TAXI DRIVER , RAGING BULL and GOODFELLAS didn't"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1516492",
      "warningSpoilers": false,
      "date": "7 November 2006",
      "rate": "",
      "helpful": "46 out of 80 found this helpful.",
      "title": "Enjoyable thriller but there are failings and missed targets across the running time",
      "content": "The war between the police and the organised crime in Boston has reached new heights. Both Oliver Queenan and target #1 Frank Costello have placed a mole into each other's organisations. Billy Costigan is selected to infiltrate Costello's ranks thanks to a family background of criminals and working men, meanwhile Colin Sullivan has been groomed since youth to come up inside the ranks of the BPD. As Costigan makes progress it becomes clear to his police superiors that they too have a rat feeding information outwards. With only Frank knowing Sullivan's identity and Queenan and Dignam knowing Costigan's, a race begins with the first one to expose the other winning.Having enjoyed the original film, I was quite looking forward to this film and not really worried that Hollywood would mess it up. In a way it does deliver but it is hard to ignore the problems and failings in the film and if I didn't realise how IMDb put together their top 250 list, I would be amazed that the film is running so high up it. The original was a tight cop thriller which I remember thinking owed much to American cinema in style and tone, so surely America can only do it better? Well, if not better then this is certainly bigger, with stars oozing out of every pore, a big director and a long running time. In regards the latter, the film should be commended for moving slickly through the 150 minutes and not feeling as long as it is. The fact that it is cool, engaging and quite exciting will be enough for most audiences and indeed the sheer volume of positive votes on this site shows it has struck something of a chord, but this is not to say it is a classic and those putting it alongside Goodfellas are simply out of their trees.The script here tries to give more room for growth to the characters, to explore their feelings outside of the tension and fear of their situation. Unfortunately this produces many scenes that are a bit dull and unconvincing as they attempt to deepen the material. Specifically I am talking about the thread involving the girlfriend, her scenes add little and the dialogue in the session scenes is obvious and, as a Sopranos viewer, I was surprised by this. A secondary downside of this (although not totally to blame) is that it is not as gripping and claustrophobic as I would have liked. Yes it is thrilling at times but I wanted it to be consistent like a real cat'n'mouse game with the noose tightening palatably around each character's neck as they raced to hang the other first. The ending is also a little less effective than it should be because, added to the original's strong ending is an extra scene that doesn't have a strong foundation and is not as good as it should have been.Ironically for such a starry affair, some of the performances are a bit weak, and I'm thinking specifically of Damon. He never seems like the flipped version of Costigan and I never really got the feeling of him being trapped, panicked and hunted in the same way as his opposite number was. Conversely then DiCaprio is pretty strong and is convincing as he loses himself into Costello's gang of murderers. He works well alongside a scene-stealing Nicholson. At times he threatens to completely tip over into ham but for the most part he is just larger than life and provides a lot of energy to the film. This energy is harnessed well by director Scorsese who directs with this usual eye for a setup and also an enjoyable soundtrack. The use of sudden stops in the music and quick cuts is perhaps a bit much to get used to but it is strangely effective. The support cast is impressive in depth but they are not all that well used. Walhberg has all the best lines but it seems like he has wandered in from another movie at times and, funny as he was, he is never the developed and involved character that he needed to be for the way the narrative required. Baldwin is the same although he is more restrained and fits better, while Sheen is a nice touch of class. The woman playing the girlfriend is as weak as her material and although she did have an important part in the story, she adds very little beyond the writing on the page.Overall though, this is a strong and professional film and it is a shame that it isn't as good as I wanted. The attempts to paint detailed and complex characters makes it interesting but not as convincing as it needed to be  with Damon in particular left out there with little to work with in comparison to DiCaprio. The moments of slick tension and action are very good though and the only downside was that it made me wish for more of the same and that Scorsese had focused on keeping it tight and taut in the same way that the superior original had."
    },
    {
      "username": "JohnDeSando",
      "userUrl": "https://www.imdb.com/user/ur1391596",
      "reviewLink": "https://www.imdb.com/review/rw1489715",
      "warningSpoilers": true,
      "date": "4 October 2006",
      "rate": "",
      "helpful": "203 out of 391 found this helpful.",
      "title": "Never will be \"departed\" from the pantheon of premiere American directors.",
      "content": "\"The heaven sets spies upon us, will not have Our contract celebrated.\" Shakespeare, The Winter's taleIt's not Taxi Driver or even Goodfellas, but Martin Scorsese's Departed is one of the year's best films and one of his best, after his 2 or 3 indisputable classics such as Raging Bull. The director has assembled a first-rate cast, who, right down to Jack Nicholson as mobster kingpin Frank Costello, are having a great time nudging each other's performances toward excellence through collaboration.Remade from a 2002 Hong Kong smash called Infernal Affairs, The Departed tells of moles within the Boston State Police Department and the South Boston Irish-American mob. When the director opens the film with Costello's brief narration and the Stones' Gimme Shelter for background music, we're in for a whole lot of no shelter for anyone and uncommon acting for everyone. The set up is just complex enough to act as a metaphor for the nasty workings of the United Nations, Iraqi Assembly, and US Congress. Billy Costigan (Leonardo DiCaprio) willingly serves as a mole in the South Boston Irish-American mob for the State Police, while Colin Sullivan (Matt Damon) does the same in the State Police for the mob.Amongst the intertwining machinations of cell phones and lies is a triangle with those two operatives and a psychologist Madolyn (Vera Farmiga), as well played by the three as could be hoped for in such a trumped-up situation that provides little sexual payoff for audience voyeurs and many scratched heads for those who enjoy well-structured plots. This triangle is the only disappointment in a film layered expertly to show how intertwined crime and punishment can be in a world last laid bare by Clint Eastwood's Oscar-winning Mystic River (2003).Cinematographer Michael Ballhaus and production designer Kristie Zea are winning collaborators with the director for a look that is authentic (I worked in South Boston for 3 years), crisp, and dark. But in the end the film belongs to the actors, chief among them DiCaprio as a young Scorsese acolyte showing the master's handiwork after 3 films with him. And Matt Damon has never been better in his hometown, as has fellow South Bostonian Mark Wahlberg in his role as a detective with a barbed tongue and equally sharp intuition.Welcome back, Martin S. The Departed may not win you an Oscar, but it does guarantee you never will be \"departed\" from the pantheon of premiere American directors."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw6228899",
      "warningSpoilers": false,
      "date": "2 November 2020",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Masterful",
      "content": "Amazing performances, action, script, production, and directing. Exactly what I expected from this amazing director."
    },
    {
      "username": "Jay_Exiomo",
      "userUrl": "https://www.imdb.com/user/ur6447592",
      "reviewLink": "https://www.imdb.com/review/rw1489475",
      "warningSpoilers": true,
      "date": "4 October 2006",
      "rate": "10",
      "helpful": "163 out of 291 found this helpful.",
      "title": "A masterpiece right up Scorsese's alley",
      "content": "Director Martin Scorsese's \"The Departed\", a gangster flick based from the Hong Kong thriller \"Internal Affairs\", goes without saying as perhaps his best work since \"Goodfellas.\" Working on a genre that's right up his territory, Scorsese is back on top of his game and recreates a new dimension to the genre. This crime thriller treads the same theme as much of its director's previous films does. It's about two young men, the people around them, and the complications brought about by their characters' ambiguity.Set in Boston, the Massachusetts State Police sends young cop Billy Costigan (Leonardo DiCaprio) to go undercover and infiltrate an Irish mob syndicate where he quickly earns the trust of leader Frank Costello (Jack Nicholson). Meanwhile, Costello's informant Collin Sullivan (Matt Damon) works for the police department's Special Investigation Unit. Soon, stakes are raised when both the police and the mob realize there's a traitor among them, and that both Billy and Collin are both in danger of losing their cover and even their lives.Nicholson, yet again playing another villain, owns every scene he's in with his portrayal of Costello, providing a paradoxical attraction to his menacing character. DiCaprio, increasingly maturing as an actor since becoming Scorsese's \"muse\", fits right in as the streetwise cop, while Damon brings his usual authoritatively calm demeanor to the part. They are complemented by the ensemble performances of Martin Sheen, Alec Baldwin, Mark Wahlberg and Vera Farmiga.Scriptwriter William Monahan (\"Kingdom of Heaven\") retains much of the structure of \"Internal Affairs\" but adds depth to its characters and an acerbic quality to its witty dialog. The cinematography by Michael Ballhaus is brooding and morbid, capturing the character of its Boston setting while Howard Shore's score is as good as a soundtrack can be.At its core, \"The Departed\" is a well-crafted, well-written, and well-acted film noir. In an age where style usually triumphs over the narrative quality, \"The Departed\" is one of the best films I have seen so far in recent memory."
    },
    {
      "username": "SoncoChairman",
      "userUrl": "https://www.imdb.com/user/ur2230827",
      "reviewLink": "https://www.imdb.com/review/rw1488082",
      "warningSpoilers": false,
      "date": "29 September 2006",
      "rate": "10",
      "helpful": "656 out of 1,145 found this helpful.",
      "title": "Fantastic Bro",
      "content": "Excellent. A great, great movie. I saw it last night at a special screening and must say it was a tour de force. Even though Boston is not really a gritty town Scorsese was able to capture a darker side of the city. Coming from that area, I am always concerned when actors put on the local accent as it tends to be distracting rather than supportive. However, with local pros like Damon and Wahlberg they were able to really grab hold of it and not go overboard... most of the time. The true stand out performance has to go to DiCaprio. He has really come into his since hooking up with Scorsese, having scored a number of original performances all of which have expanded his range. He really snagged onto a deep and tragic character and created something that will hopefully be recognized come awards season. One of my favorite aspects was the friendly hostility the characters had for each other. It is a specific trademark that I have never noticed in any other city. In Boston, when you are really close with someone (or not really) it is, more or less, a requirement to bust their balls and shoot cruel insults back and forth in rhythmic banter. That detail was extensively realized in THE DEPARTED and I doubt anybody who was raised outside of the metro Boston area, or at least visited at some point, would find it nearly as hilarious as those who were. As for Scorsese's direction, I think he scored big with this one. While many have criticized that his movies have become more commercial I believe that he has just evolved. There were some classic Scorsese moments here, my favorite being a scene where DiCaprio is alone and packing his things in his apartment. Beautifully cut and stylistically directed. Is it his best effort? No. But it still is truly mesmerizing. He has created something truly special from a city that is highly underrated."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw1514483",
      "warningSpoilers": false,
      "date": "5 November 2006",
      "rate": "",
      "helpful": "36 out of 66 found this helpful.",
      "title": "A Truculent Pancake",
      "content": "What a shame. Scorcese, the old one, lived in a world that worked differently than the world of most folks. His world has no God, no laws, no fate, no environment. His world is a world of characters who exude the world. If there are apparent laws, it is because of the force of people creating the space they project into. He works in this way because its his heritage, an Italian legacy both in culture and film. And because it works. A filmmaker's job is to define a world in a film, ideally in the first few moments of a film. There are all sorts of ways to do this and the way we digest what we see has a lot to do with how it is served in this way.One way, the way the old Scorcese used, was to invest wholly in bodies. Focus the camera completely on people, a few very, very strong people, and grow the world and a whole world system  usually based on simple ethics  around it. It means you have the latitude to develop some loud, apparently full characters, but it also carries disadvantages: we never can fold his movies into our lives. We can never overlap our world into his, because his doesn't exist.He knows these limits. He's spoken of them privately, and in his last two films you could see him trying to outgrow the limits of the old Scorcese. With \"Gangs\" he reached far into space, defining places, a city, underground havens, mobs, the flow of rumors through society. He reached to groups. His camera flew, not as expertly as DePalma's but wildly compared to old filmmaker's which was tethered to single bodies. \"Gangs\" overreached and ran out of money, time and the patience of his patrons, so it was wrapped up with some explosive characters.\"Aviator\" showed us a new man. I hailed him as the best new filmmaker of that year. He drifted into the world, away from characters. He designated a watcher in Blanchett, something he has never done before, and he let he bring her tools of folded narrative to bear. It was film worth watching, his first one in my opinion.And now we have the old fellow backsliding into his easy manner, his cheat. His way of delivering apparent power with no power. Yes, it is well put together. Yes, it has serious actors doing their bit without worrying about how it fits in the symphony. There is no grand design, just speechifying. Yes, the use of music is perhaps the most competent you will ever find.But it is empty. Again. We lost a filmmaker this year.Ted's Evaluation -- 2 of 3: Has some interesting elements."
    },
    {
      "username": "Balidorf",
      "userUrl": "https://www.imdb.com/user/ur2141297",
      "reviewLink": "https://www.imdb.com/review/rw1493956",
      "warningSpoilers": false,
      "date": "9 October 2006",
      "rate": "9",
      "helpful": "554 out of 968 found this helpful.",
      "title": "Whatever I say does not do this film justice",
      "content": "The DepartedThe screenplay: Top NotchThe performances: all-star cast delivering all-star performancesThe music: perfectThe Directing: Martin Scorsese at his finest and that is saying something.Once again Scorsese delivers a film that meets or exceeds the expectations of its audience in nearly every way. There are moments of incredible tension, violence, and drama, moments where characters reveal their vulnerabilities and weakness. Comedic moments and moments of sadness and through it all a multi layered and brilliant story is told by an American film maker who once again proves Harvey Keitel correct when he said, \"Maybe he (Scorsese) got what he deserves--exclusion from the mediocre.\" This film is Scorsese's finest work since Raging Bull, but it is not simply about Martin Scorsese or the amazing screen play by William Monahan, it is more than an amazing score, and great cinematography. While many of the accolades for this film belong to those behind the scenes people who envisioned and directed this film. One would be remiss to not point out the great performances of an all-star cast, many of whom deliver the finest performances of long and storied careers. Martin Sheen, Alec Baldwin, Jack Nicholson, Leonardo DiCaprio and Matt Damon deliver incredible performances. However the performance that stood out for me was Wahlberg, Mark Wahlberg's Sgt. Dignam stole every scene he was in, and he shared screen time with each of the afore mentioned actors. He gets to deliver some of the best lines, and with every scene he leaves the audience wanting more, and anticipating his next scene.Since The Academy has had its collective heads stuck for so long, mentioning a Scorsese picture and Oscar in the same sentence seems to be a waste of time. That being said I can not say if he will finally win the Oscar that he has deserved for so long, as his major competition (Flags of our Fathers) has yet to be released, I will say that I expect to see Wahlberg nominated for best supporting, and Leo and Damon will be pitted against one another once more, this time for best actor, Monahan will be nominated for writing, and of course Scorsese will be nominated for director. Also, it goes without saying a best picture nomination will be in order for The Departed.That was the long version; the short version is if you like a movie with incredible performances, direction, music and visuals. If you like a layered story that is not formulaic, in short if you appreciate film making and story telling at its finest then see this film. Even with the glowing reviews of myself and others, and the high expectations they will undoubtedly bring I assure you that you will not be disappointed."
    },
    {
      "username": "grumpy-3",
      "userUrl": "https://www.imdb.com/user/ur0077225",
      "reviewLink": "https://www.imdb.com/review/rw1603603",
      "warningSpoilers": true,
      "date": "19 February 2007",
      "rate": "1",
      "helpful": "90 out of 169 found this helpful.",
      "title": "major let down",
      "content": "what a let down, after all the fuss and rave reviews, the film is not a patch on the honk kong original. scorcese takes two and half hours to tell a very simple story that in the original had you tensed up all the way. here what we get is banal dialogue,(goodfellas again) implausible plot turns, (i'm trying to remember if infernal affairs plot was as ludicrous, take the fact that di caprio goes to see the police shrink, in the police building, what no ones sees him. the basic premise and point of the movie is when and how they are going to discover,each, it takes ages to get to this point, by which time i was bored silly with nicholsons way over the top performance, di caprio looked and sounded like he was about to cry any moment, but worst of all was that the film had no energy, it just sagged, this is now the third film from sorcese that looks tired, it started with gangs of new york, then aviator and now this, by this going, his next film will positively crawl to the end. overrated, overblown and forgetfull"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2183948",
      "warningSpoilers": false,
      "date": "1 January 2010",
      "rate": "9",
      "helpful": "12 out of 19 found this helpful.",
      "title": "Whom Do You Trust?",
      "content": "Wow, this was exhausting. We have a cast of characters, each of which has a dangerous side. They are woven into a complex network of crime and honor. Some are spies; some are mobsters; some are weak; and some are strong. The one thing that fills the screen is no one knows when it's coming. There is so much danger out there and it could be around any corner. The performances are great, particular by Jack Nicholson and Mark Walberg. These are a couple of crazies who seem to enjoy the most insane, continuous process of interaction among crooks and police. They are suspicious and ruthless and absolutely great. The down side is having a hell of a lot of sympathy for anyone. Leonardo DeCaprio's character is probably the most sympathetic but we know the fine line he is walking and that disturbs us. There is so much graphic violence and disrespect for humanity that it's at times hard to like it. Still, it never stops, right up to it's dramatic finish."
    },
    {
      "username": "TheMovieDiorama",
      "userUrl": "https://www.imdb.com/user/ur67902729",
      "reviewLink": "https://www.imdb.com/review/rw4114028",
      "warningSpoilers": false,
      "date": "2 April 2018",
      "rate": "7",
      "helpful": "24 out of 42 found this helpful.",
      "title": "The Departed is Scorsese's most overrated film.",
      "content": "Now now, before you go and comment, dislike and lambast my opinion, hear me out. This is by no means a bad film, in fact it's better than good. Yet, a ludicrous amount of film aficionados deem this as one the best films from the last decade. I'm afraid I strongly disagree. An amateur Boston cop infiltrates an American Irish gang by following the chief mobster. On the flipside, a criminal from the gang infiltrates the police department and reports the status of the investigation back to the head honcho. It's a vintage crime story that thematically conveys the power of trust. Scorsese is back to what he does best, crafting intricate mafia crime thrillers fuelled by rich character development. The arcs of the leading individuals are fully realised and are played out like a methodical game of chess. Motives are shrouded in mystery, minds are tainted by corrupted ideologies. Scorsese brings in an A-list cast comprising of Damon, DiCaprio and the ever reliable Nicholson who essentially chews up every scene like he is devouring a piece of tender chicken. Monahan's screenplay consistently brings out the gritty Boston upbringing of these characters. It's a harsh environment that lures you into this convoluted world filled with rats and tyranny. Wahlberg's sarcastic banter was a much required element to what is a tough exterior. My reasoning for not rating this excruciatingly high is the narrative structure. There are no surprises in this, it's a \"thriller\" that doesn't excite me. Purposefully indicating who the informants are in both parties at the beginning means a large duration of the film becomes predictably unexciting. It's only at its conclusion that it mistakingly tries to be enthralling by shooting people in the head (literally!). Lazily underwhelming, especially after 140 minutes of character development. The Boston accents also came across extremely heavily from certain actors, particularly Farmiga as she exclaims \"harrrrrdest!\". A well constructed crime drama that unfortunately is weighted down by a mechanical narrative."
    },
    {
      "username": "adrossan",
      "userUrl": "https://www.imdb.com/user/ur12659803",
      "reviewLink": "https://www.imdb.com/review/rw1500704",
      "warningSpoilers": true,
      "date": "18 October 2006",
      "rate": "1",
      "helpful": "347 out of 649 found this helpful.",
      "title": "Save your money",
      "content": "Well, due to all the hype I went to see this one with great expectations, although I must admit without having seen the parent film Infernal Affairs. What a let down ! Setting the scene is great, and time taken to achieve this is well spent, but for me the film started to drag, with expectation and patience well run out by the time the plot strands began coming together. Yes, Jack Nicholson is a great actor, but no he didn't convince me in the role, even though most of the good lines and deliveries were his. But Boston Irish ? Everyone, including the deliverer of the line \"I'm Irish & can live with something wrong the rest of my life....\" failed to convince me of Irish lineage. The accents, the faces, the attitudes were all wrong for souls in torment over doing what they believe they have to do, a basic for Irish/Catholic guilt and angst. The film would have been much stronger with unknowns in several key positions, and for me once the disparate strands were established the rest of the film was very predictable and I wasn't kept guessing - crucial if we are to suspend disbelief and have pressure and tension build in the viewer.DeCaprio fails to convince as a tough guy, despite the convincing scars. He stills comes across as an adolescent fuming after his pocket money's been withheld. Matt Damon looks like an awkward schoolboy, and was even less convincing than DeCaprio about being a cop. Mark Wahlberg sounded like he'd been taught to swear the week before, Martin Sheen was as hard bitten as a kitten and there were so many operational goofs the film became a comedy. A Federal agent running a State operation against his own informer? What a waste of time and budget monies. Only two people knowing about an undercover operation? BULL! Keep sending an undercover back after his nerve's gone ? Garbage ! Permanently deleting a full record (on a State Police computer no less!) without possibility of recovery ? Unbelievable - even children know data can be restored, and the system will keep a record of who deleted the information. For me, the film became a joke and I couldn't wait for the end to arrive so I could leave. By the time the end plays arrived and new players were falling like flies, the audience was laughing out loud at the inanity. Once again, Hollywood takes a good story and ruins it with poor crafting, no matter how well filmed. Very bad casting, a rushed and unfulfilling ending, far too much gore, not enough character substance, one dimensional players and an insult to the viewers intelligence."
    },
    {
      "username": "dbborroughs",
      "userUrl": "https://www.imdb.com/user/ur3079504",
      "reviewLink": "https://www.imdb.com/review/rw1512439",
      "warningSpoilers": false,
      "date": "2 November 2006",
      "rate": "7",
      "helpful": "17 out of 29 found this helpful.",
      "title": "Good, but very familiar story of cops and robbers",
      "content": "Remake of Infernal Affairs is not the second coming of the gangster film that some proclaimed it. It is a very good, if decidedly over long tale of cops battling robbers with moles on each side trying to remain hidden.The plot is simple, a cop is sent undercover in the mob at the same time a crook works his way into the police force. Complicating matters is the fact that the bosses on both sides quickly realize that a rat is among and they begin the search to ferret out the mole.The original Infernal Affairs is one of the better Hong Kong Films of the last ten years. Its a well told tale with some nice stylish twists. If the original has any flaws its that the film falls in love with itself in the second half and becomes a bit too showoffy. Thats not the case here, here the story has been refashioned and rethought into a gritty tale of Irish cops and robbers in Boston. Its different enough to discourage comparisons, which is a good thing in these days of shot for shot remakes.Martin Scorsese has fashioned a really good film. The cast is mostly excellent, with only Jack Nicholson ruining things with an occasional lapse into stereotypical \"Jackisms\". Leonardo DiCaprio has at last arrived as an actor and turns in an excellent performance as the cop gone deep undercover. His performance is sure to garner an Oscar nomination.I really liked this film but I didn't love it. The film carries a sense of having been down this road before, not because its a remake, as I said it different enough to rebuke comparison, rather its because it takes the gangster films of the past thirty years and compresses them together and has a very familiar feel. It reminded me of several other films about the Irish mobs, State of Grace in particular, so it didn't strike me as ground breaking the way The Godfather or Goodfellas did upon first seeing them.My one real complaint with the film is that it takes too log to get where its going. Yes its tense and it keeps you on the edge of your seat but when it was over I felt as though I had been watching it for twice its length. A good movie should fly by and make you lose track of time. I was checking my watch through out much of the second half of this movie.Definitely worth seeing, but I'm not sure you're going to love it, so much as you're going to like it.7 out of 10."
    },
    {
      "username": "Movie_Buff_Brad",
      "userUrl": "https://www.imdb.com/user/ur6898220",
      "reviewLink": "https://www.imdb.com/review/rw1519375",
      "warningSpoilers": false,
      "date": "11 November 2006",
      "rate": "9",
      "helpful": "396 out of 673 found this helpful.",
      "title": "Brilliant",
      "content": "Before seeing this, I knew I was in for a treat, given that it's a Scorsese movie, but The Departed was even better than I expected.The acting is outstanding. Leonardo DiCaprio gives what is quite possibly the best performance of his career. Even the people who hate him admit he did a good job. It's turned some haters into fans and my brother who despises him even says he was great. Matt Damon and Jack Nicholson give their best performances since The Talented Mr. Ripley and As Good As It Gets. Mark Wahlberg almost steals the show with the best lines. Ray Winstone, Alec Baldwin, and Martin Sheen are good, too.Definitely one of the best films of the 00's. And easily one of the best remakes of all time. It's intense, funny, exciting, suspenseful, superbly acted, violent, has great characters, and has one of the most shocking scenes I've ever seen. And there's not a boring moment in it's two and a half hour running time. The film will most likely be nominated for picture, director and adapted screenplay, and in my opinion, it deserves all three of them. DiCaprio and Wahlberg also deserve nominations.See this as soon as you can."
    },
    {
      "username": "AfricanBro",
      "userUrl": "https://www.imdb.com/user/ur120413622",
      "reviewLink": "https://www.imdb.com/review/rw7712696",
      "warningSpoilers": false,
      "date": "1 January 2022",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Need more like this",
      "content": "I've watched these gangster or gangster-esque movies before; goodfellas, the godfather, training day, se7en, this one (the departed) etcetera etcetera but I was too young to appreciate them or remember so watching them again now and all I can think of is why don't they make movies like this anymore. I mean they try to.Usually when I see a cast lineup this good now first thought is \"I hope I don't get disappointed\", but in this movie the plot is just as good as the characters playing in it. And the end... often when a movie or series is full of twists and turns towards the end it's either too dramatic or just there to make up for a mediocre movie but it's perfect in this, watching this I can't think of a much better way to end it.Great actors, great directors and great writers came together in this. It's a simple cat and mouse, cops vs gangsters thriller and it's enticing without being too complicated. What I love most is the viewer knows everything that's going on and you're just waiting to see which character in the movie is gonna figure it out first. More often than not the writers always keep a trump card in the script and you only figure it when the characters involved do which is exciting, but it's nice to see a simple thriller that keeps you at the edge of your seat like this one."
    },
    {
      "username": "jackgdemoss",
      "userUrl": "https://www.imdb.com/user/ur87808462",
      "reviewLink": "https://www.imdb.com/review/rw4973019",
      "warningSpoilers": false,
      "date": "2 July 2019",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Twist endings and Leo, name a better duo",
      "content": "Nicholson, Damon, and Dicaprio make for an absolute powerhouse trio in this classic film. I have had this on my watch list for quite some time, and although it wasn't as rock solid as I was expecting, it's ending was right up my alley. Aside from the phenomenal acting and the satisfying conclusion, I was only impressed with the simplicity of which a complex double-rat story was told. I never felt lost trying to keep track of who worked for who and who was spying on who, because the filmmakers laid it out so clearly for me."
    },
    {
      "username": "everyones-a-critic",
      "userUrl": "https://www.imdb.com/user/ur3234013",
      "reviewLink": "https://www.imdb.com/review/rw1694872",
      "warningSpoilers": true,
      "date": "16 July 2007",
      "rate": "1",
      "helpful": "98 out of 163 found this helpful.",
      "title": "Self-indulgent, Overrated & Bloated",
      "content": "Before starting I must confess to watching this film never having seen the original and without realizing there was one. After reading some of the comments here I will pick up internal affairs and watch it. Having discovered the film is a remake of a superior foreign film this explains a lot (though probably not all) of what makes this such a bad film.But I am happy to take the film stand alone on its own merits, of which there are few. For Scorsese to stoop to this debacle after masterpieces like Mean Streets and Goodfellas is shocking. The fact that this won so many awards is beyond me.Let's review the completely unbelievable plot points: - Gangster Nicholson allows former cop (who he knows is a former cop) DiCaprio become his right hand man seemingly moments after joining his gang.Nicholson discovers there is a mole in the organization. And can't work out that it's DiCaprio, his latest recruit. Ludicrous. This appears to be a gang of less than ten people. Give me a break.The whole film falls apart right there - if you can't believe the main premise then it's failed. But let's go on.DiCaprio is the only gangster not to give his ID number to his boss, but he is still above suspicion.Rotten Cop Damon gets away with blasting his boss Nicholson - and there is no investigation? Nobody ever subpoenas cell phone records (a very easy thing to do) Damon and DiCaprio just happen to be dating the same girl.Said girl is given incriminating tape of Damon by DiCaprio. Nothing is ever done with this tape though. Was this cut out to trim the film under three hours? Said girl agrees to go for a coffee with her patient DiCaprio. This doesn't happen in real life. Psychiatrists do not date their patients. Not even Frasier did that and that was supposed to be comedy.Police records are completely erasable by one person with no backup and no trace remaining. Nonsense.The final scenes at the building are ludicrous. Characters only briefly touched upon at the beginning of the film are suddenly players in the big game to the point where they will commit cop murders. I'm not sure I understood why it needed to be on the roof anyway. From what I understand this was in the original film but there was a reason for it. Poorly executed.Jack Nicholson is Boston Irish. Maybe he is of Irish descent in reality - but he sure can't play it well.Err, the State Police in central Boston? No - that's BPD's turf. They at least have to work with BPD.Gangsters throw a captain of the State Police off a building and there are no fingerprints or other evidence available later.And now for the pointless time wasters: Obviously Scorsese is big enough and powerful enough that he can dictate cuts (or lack thereof) to the studio at this point. Unfortunately this leads to a self indulgent two and a half hour (felt like four hours) film and convoluted story telling The whole plot with the girl psychiatrist. What is this for? It serves absolutely *no* purpose in the film other than to make it longer and less believable. Even her pregnancy is left hanging. I really get the feeling they filmed a lot more but had to quickly cut to get the length down. This is why studios have editors. Let them do their jobs and cut the drivel from films and make them entertaining.The whole setup in police academy. That's half an hour right there that should have been cut out of the film.The stupid porno/hooker stuff with Nicholson. Pointless, plot irrelevant and simply unnecessary. Goodfellas managed to be a great film without that. Although there was one light moment when Jack implied he can't raise the titanic any more. Art imitates life I guess.The OTT language. I'll believe it from gangsters but special investigators tend to be a bit more pro.The sex scene was just sillyNow let's throw in some bad casting/bad directing decisions: - Having Matt Damon and Leonardo DiCaprio play the leading roles, both cops with crew cuts. They are both good actors but something should have been done to differentiate between the two in terms of physical appearance. These guys look too much alike in the opening sequences - waaay to confusing. This is solved later when DiCaprio starts to look more ragged.Whatever happened to the FBI angle? Why bother with it if it is unused? Too many stars. They all demand face time which makes the film drag. It would have been better with some unknowns.The whole secret cell phone deal was used how many times? Repetition plagued this film all the way through.OK - so you get it. The film has a plot full of holes and drags on for hours. It promises so much and delivers so little, which is why it deserves so few marks from me.The one star, if I must give one, is for Alec Baldwin who is hilarious as one of the senior cops and steals every scene he is in. In a cast of stars that's a pretty neat trick."
    }
  ],
  "errorMessage": ""
}