{
  "imDbId": "tt0407887",
  "title": "The Departed",
  "fullTitle": "The Departed (2006)",
  "type": "Movie",
  "year": "2006",
  "language": "en",
  "titleInLanguage": "The Departed",
  "url": "https://en.wikipedia.org/wiki/The_Departed",
  "plotShort": {
    "plainText": "The Departed is a 2006 American crime thriller film directed by Martin Scorsese and written by William Monahan. It is both a remake of the 2002 Hong Kong film Infernal Affairs and also loosely based on the real-life Boston Winter Hill Gang; the character Colin Sullivan is based on the corrupt FBI agent John Connolly, while the character Frank Costello is based on Irish-American gangster and crime boss Whitey Bulger. The film stars Leonardo DiCaprio, Matt Damon, Jack Nicholson, and Mark Wahlberg, with Martin Sheen, Ray Winstone, Vera Farmiga, Alec Baldwin, Anthony Anderson and James Badge Dale in supporting roles.\r\nThe film takes place in Boston and the surrounding metro area, primarily in the city’s South End neighborhood. Irish Mob boss Frank Costello (Nicholson) plants Colin Sullivan (Damon) as a spy within the Massachusetts State Police; simultaneously, the police assign undercover state trooper Billy Costigan (DiCaprio) to infiltrate Costello's mob crew. When both sides realize the situation, Sullivan and Costigan each attempt to discover the other's identity before they are found out.\r\nThe Departed was a critical and commercial success, receiving acclaim for its direction, performances (particularly of DiCaprio, Nicholson, and Wahlberg), screenplay, and editing, with minor criticism for its plot holes. It won several accolades, including four Oscars at the 79th Academy Awards: for Best Picture, Best Director, Best Adapted Screenplay, and Best Film Editing. It became Scorsese's first and, to date, only personal Oscar win; Wahlberg was also nominated for Best Supporting Actor. The film also received six nominations at the 64th Golden Globe Awards, six nominations at the 60th British Academy Film Awards, and two nominations at the 13th Screen Actors Guild Awards. DiCaprio was nominated for Golden Globe Award for Best Actor – Motion Picture Drama (also nominated that year in the same category for Blood Diamond), BAFTA Award for Best Actor in a Leading Role and Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role for his performance.",
    "html": "<p>The Departed is a 2006 American crime thriller film directed by Martin Scorsese and written by William Monahan. It is both a remake of the 2002 Hong Kong film Infernal Affairs and also loosely based on the real-life Boston Winter Hill Gang; the character Colin Sullivan is based on the corrupt FBI agent John Connolly, while the character Frank Costello is based on Irish-American gangster and crime boss Whitey Bulger. The film stars Leonardo DiCaprio, Matt Damon, Jack Nicholson, and Mark Wahlberg, with Martin Sheen, Ray Winstone, Vera Farmiga, Alec Baldwin, Anthony Anderson and James Badge Dale in supporting roles.</p><p>The film takes place in Boston and the surrounding metro area, primarily in the city’s South End neighborhood. Irish Mob boss Frank Costello (Nicholson) plants Colin Sullivan (Damon) as a spy within the Massachusetts State Police; simultaneously, the police assign undercover state trooper Billy Costigan (DiCaprio) to infiltrate Costello's mob crew. When both sides realize the situation, Sullivan and Costigan each attempt to discover the other's identity before they are found out.</p><p>The Departed was a critical and commercial success, receiving acclaim for its direction, performances (particularly of DiCaprio, Nicholson, and Wahlberg), screenplay, and editing, with minor criticism for its plot holes. It won several accolades, including four Oscars at the 79th Academy Awards: for Best Picture, Best Director, Best Adapted Screenplay, and Best Film Editing. It became Scorsese's first and, to date, only personal Oscar win; Wahlberg was also nominated for Best Supporting Actor. The film also received six nominations at the 64th Golden Globe Awards, six nominations at the 60th British Academy Film Awards, and two nominations at the 13th Screen Actors Guild Awards. DiCaprio was nominated for Golden Globe Award for Best Actor – Motion Picture Drama (also nominated that year in the same category for Blood Diamond), BAFTA Award for Best Actor in a Leading Role and Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role for his performance.</p>"
  },
  "plotFull": {
    "plainText": "The Departed is a 2006 American crime thriller film directed by Martin Scorsese and written by William Monahan. It is both a remake of the 2002 Hong Kong film Infernal Affairs and also loosely based on the real-life Boston Winter Hill Gang; the character Colin Sullivan is based on the corrupt FBI agent John Connolly, while the character Frank Costello is based on Irish-American gangster and crime boss Whitey Bulger. The film stars Leonardo DiCaprio, Matt Damon, Jack Nicholson, and Mark Wahlberg, with Martin Sheen, Ray Winstone, Vera Farmiga, Alec Baldwin, Anthony Anderson and James Badge Dale in supporting roles.\r\nThe film takes place in Boston and the surrounding metro area, primarily in the city’s South End neighborhood. Irish Mob boss Frank Costello (Nicholson) plants Colin Sullivan (Damon) as a spy within the Massachusetts State Police; simultaneously, the police assign undercover state trooper Billy Costigan (DiCaprio) to infiltrate Costello's mob crew. When both sides realize the situation, Sullivan and Costigan each attempt to discover the other's identity before they are found out.\r\nThe Departed was a critical and commercial success, receiving acclaim for its direction, performances (particularly of DiCaprio, Nicholson, and Wahlberg), screenplay, and editing, with minor criticism for its plot holes. It won several accolades, including four Oscars at the 79th Academy Awards: for Best Picture, Best Director, Best Adapted Screenplay, and Best Film Editing. It became Scorsese's first and, to date, only personal Oscar win; Wahlberg was also nominated for Best Supporting Actor. The film also received six nominations at the 64th Golden Globe Awards, six nominations at the 60th British Academy Film Awards, and two nominations at the 13th Screen Actors Guild Awards. DiCaprio was nominated for Golden Globe Award for Best Actor – Motion Picture Drama (also nominated that year in the same category for Blood Diamond), BAFTA Award for Best Actor in a Leading Role and Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role for his performance.\r\nPlot\r\nIn South Boston, Irish Mob boss Frank Costello introduces himself to a young Colin Sullivan. Twenty years later, Sullivan has been groomed as a spy inside the Massachusetts State Police (MSP) and joins the Special Investigations Unit (SIU), which is building a case against Costello. Another new officer, Billy Costigan Jr., is recruited by Captain Queenan and Staff Sergeant Dignam to go undercover and infiltrate Costello's crew. Costigan is selected due to his family ties to organized crime, with his deceased uncle Jackie having been connected with Costello's outfit. Ellerby informs Special Investigations that the identities of undercovers will be only known to Queenan and Dignam to prevent leaks.\r\nCostigan commits a series of crimes in an effort to draw the attention of Costello and his enforcer Arnold French, who later recruit Costigan into the organization due to their affection for his uncle. Over the next year, Costigan becomes increasingly involved in the operation. Due to the stress of having to maintain his cover, his emotional and mental state declines, and he threatens to quit, but Queenan and Dignam convince him to continue. Costigan's only other contact in the MSP is his police-appointed psychiatrist, Madolyn Madden, who is also Sullivan's girlfriend. Costigan and Madolyn later have an affair.\r\nCostigan tells the MSP that Costello's crew is selling stolen computer microprocessors to a Hong Kong Triad. The MSP sets up a sting, but Sullivan tips off Costello, allowing everyone to escape. The MSP and Costello realize there is a mole in their ranks and task Sullivan to find them. Meanwhile, Costigan learns that Costello is a protected FBI informant. Costigan shares his discovery with Queenan and Dignam while warning them that Costello is aware of a spy in his ranks.\r\nLate one night, Costigan follows Costello into an adult theater and witnesses him giving Sullivan an envelope containing information of his crew for Sullivan to cross reference with police records. Queenan instructs Costigan to get a visual ID of Sullivan but he is unable to get a good look at his face. When Sullivan realizes that he is being followed, he mistakenly stabs a restaurant worker and flees. Later, Sullivan tries to cross-reference Costigan's picture, captured by nearby security footage, against police officer databases but cannot identify him. Queenan advises Sullivan to follow Costello to find the MSP mole. Costigan calls Queenan and sets up a meeting but Sullivan has Queenan followed, lying to the other officers that Queenan may be the spy. Sullivan also calls in Costello's gang to the meeting location.\r\nWhen Costello's men arrive, Queenan helps Costigan escape before being thrown from the building's roof to his death. This causes a firefight between SIU agents and Costello's men. Angered by Queenan's murder, Dignam attacks Sullivan and is suspended by Ellerby. Timothy Delahunt, one of Costello's henchmen who was injured in the gunfight with the police, tells Costigan that he knows he is the rat, but succumbs to his wounds before he can alert the others. A news report reveals that Delahunt was an undercover officer for the Boston Police Department, but Costello suspects the police department made up the claim so he would stop looking for the mole. Sullivan looks through Queenan's belongings and learns that Costello is a FBI informant after reading Queenan's notebook. Deciding to turn on him, Sullivan directs the MSP to tail Costello to a cocaine drop-off, where a gunfight erupts, killing most of Costello's crew. Sullivan confronts a wounded Costello, who admits to being an FBI informant. They exchange gunfire, and Sullivan kills him.\r\nHis assignment finished, Costigan goes to Sullivan to reveal his undercover status, still unaware of the other's true identity. After Sullivan goes to another room, Costigan notices the same envelope from the theater on his desk. Costigan ascertains that Sullivan was Costello's mole, and escapes. Shortly after, Sullivan returns to find Costigan gone, and realizes that he now knows his true identity. He erases Costigan's records from police computers. Costigan visits Madolyn and hands her an envelope, instructing her to open it if something happens to him. Later, she opens a package Costigan sent to Sullivan and listens to tapes Costello made of himself with Sullivan, causing her to leave Sullivan. In order to retrieve his records, Costigan arranges to meet Sullivan on the rooftop where Queenan was killed, then arrests him. Costigan calls Trooper Brown, a friend from the police academy, to substantiate his identity, but Brown pulls a gun on Costigan when he arrives, unsure who is telling the truth.\r\nCostigan says that he has evidence tying Sullivan to Costello, and Brown lets him go down the elevator. Upon reaching the lobby, Costigan and Brown are killed by Trooper Barrigan, a friend of Sullivan's who reveals himself to be another spy working for Costello. Sullivan shoots Barrigan dead, allowing him to out Barrigan as the mole while removing suspicion from himself. When Sullivan arrives home from attending Costigan's funeral, Dignam is waiting for him. Dignam shoots him in the head and leaves.\r\nCast\r\nLeonardo DiCaprio as Trooper William \"Billy\" Costigan Jr.\r\nMatt Damon as Staff Sergeant Colin Sullivan\r\nJack Nicholson as Frank Costello\r\nMark Wahlberg as Staff Sergeant Sean Dignam\r\nMartin Sheen as Captain Oliver \"Charlie\" Queenan\r\nRay Winstone as Arnold \"Frenchie\" French\r\nVera Farmiga as Dr. Madolyn Madden\r\nAlec Baldwin as Captain George Ellerby\r\nAnthony Anderson as Trooper Brown\r\nKevin Corrigan as Sean Costigan\r\nJames Badge Dale as Trooper Barrigan\r\nDavid O'Hara as Patrick \"Fitzy\" Fitzgibbons\r\nMark Rolston as Timothy Delahunt\r\nRobert Wahlberg as FBI Special Agent Frank Lazio\r\nKristen Dalton as Gwen\r\nAmanda Lynch as Carmen\r\nShay Duffin as Phil\r\nProduction\r\nIn January 2003, Warner Bros., producer Brad Grey, and actor/producer Brad Pitt bought the rights to remake the Hong Kong film Infernal Affairs (2002) from Media Asia for $1.75 million. William Monahan was secured as a screenwriter, and later Martin Scorsese, who admired Monahan's script, came on board as director.\r\nIn March 2004, United Press International announced that Scorsese would be remaking Infernal Affairs and setting it in Boston, and that Leonardo DiCaprio and Brad Pitt were slated to star. Pitt, tentatively scheduled to play Sullivan, later declined to play the role, saying a younger actor should play the part; he decided to produce the film instead. Scorsese's associate Kenneth Lonergan suggested Matt Damon, who grew up in Boston, for the part of Sullivan, and Scorsese asked Jack Nicholson to play Costello. Robert De Niro was approached to play Queenan, but De Niro declined in order to direct The Good Shepherd instead. Scorsese would later say that De Niro turned down the role as he was not interested. Ray Liotta was approached for a role in the film, but declined due to a commitment to another project.\r\nNicholson wanted the film to have \"something a little more\" than the usual gangster film, and screenwriter Monahan came up with the idea of basing the Costello character on Irish-American gangster Whitey Bulger. This gave the screenplay an element of realism—and an element of dangerous uncertainty, because of the wide-ranging carte blanche the FBI gave Bulger in exchange for revealing information about fellow gangsters. A technical consultant on the film was Tom Duffy, who had served three decades on the Boston Police Department, particularly as an undercover detective investigating the Irish mob.\r\nThe Departed was officially greenlit by Warner Bros. in early 2005 and began shooting in the spring of 2005. Some of the film was shot on location in Boston. For budgetary and logistical reasons many scenes, in particular interiors, were shot in locations and sets in New York City, which had tax incentives for filmmakers that Boston at the time did not.\r\nThemes and motifs\r\nFilm critic Stanley Kauffmann said that for The Departed, Scorsese \"was apparently concerned with the idea of identity, one of the ancient themes of drama, and how it affects one's actions, emotions, self-knowledge, even dreams.\" Kauffmann, however, did not find the theme conveyed with particular effectiveness in the film. Film critic Roger Ebert compared Costigan and Sullivan's seeking of approval from those they are deceiving to Stockholm syndrome. Ebert also noted the themes of Catholic guilt.\r\nIn the final scene, a rat is seen on Sullivan's window ledge. Scorsese acknowledges that while it is not meant to be taken literally, it somewhat symbolizes the \"quest for the rat\" in the film and the strong sense of distrust among the characters, much like post-9/11 U.S. The window view behind the rat is a nod to gangster films like Little Caesar (1931), Scarface (1932), and White Heat (1949).\r\nThroughout the film, Scorsese uses an \"X\" motif to foreshadow death in a manner similar to Howard Hawks' film Scarface (1932). Examples include shots of cross-beam supports in an airport walkway when Costigan is phoning Sgt. Dignam, the lighted \"X\" on the wall in Sullivan's office when he assures Costello over the phone that Costigan is not the rat, the taped windows of the building Queenan enters before being thrown to his death, behind Costigan's head in the elevator before he is shot, and the carpeted hallway floor when Sullivan returns to his apartment before being shot by Dignam at the film's end.\r\nRelease\r\nThe Departed grossed $132.4 million in the United States and Canada and $159 million in other territories for a total gross of $291.5 million, against a production budget of $90 million.\r\nThe film grossed $26.9 million in its opening weekend, becoming the fourth Scorsese film to debut at number one. In the following three weeks the film grossed $19 million, $13.5 million and $9.8 million, finishing second at the box office each time, before grossing $7.7 million and dropping to 5th in its fifth week.\r\nReception\r\nOn review aggregator Rotten Tomatoes, the film holds a 91% approval rating based on 284 reviews, with an average rating of 8.3/10. The website's critics consensus reads, \"Featuring outstanding work from an excellent cast, The Departed is a thoroughly engrossing gangster drama with the gritty authenticity and soupy morality we have come to expect from Martin Scorsese.\" Metacritic, which uses a weighted average, assigned the film a score of 85 out of 100 based on 39 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.\r\nEntertainment Weekly ranked it on its end-of-the-decade \"Best of\" list, saying: \"If they're lucky, directors make one classic film in their career. Martin Scorsese has one per decade (Taxi Driver in the '70s, Raging Bull in the '80s, Goodfellas in the '90s). His 2006 Irish Mafia masterpiece kept the streak alive.\"\r\nRoger Ebert gave the film four stars out of four, praising Scorsese for thematically differentiating his film from the original. Online critic James Berardinelli awarded the film four stars out of four, praising it as \"an American epic tragedy.\" He went on to claim that the film deserves to be ranked alongside Scorsese's past successes, including Taxi Driver, Raging Bull and Goodfellas.\r\nAndrew Lau, the co-director of Infernal Affairs, who was interviewed by Hong Kong newspaper Apple Daily, said: \"Of course I think the version I made is better, but the Hollywood version is pretty good too. made the Hollywood version more attuned to American culture.\" Andy Lau, one of the main actors in Infernal Affairs, when asked how the movie compares to the original, said: \"The Departed was too long and it felt as if Hollywood had combined all three Infernal Affairs movies together.\" Although Lau said the script of the remake had some \"golden quotes\", he also felt it had a bit too much profanity. He ultimately rated The Departed eight out of ten and said that the Hollywood remake is worth a view, though according to Lau's spokeswoman Alice Tam, he felt that the combination of the two female characters into one in The Departed was not as good as the original storyline.\r\nA few critics were disappointed in the film, including J. Hoberman of the Village Voice, who wrote: \"Infernal Affairs was surprisingly cool and effectively restrained for HK action, but Scorsese raises the temperature with every ultraviolent interaction. The surplus of belligerence and slur reach near-Tarantinian levels—appropriate as he's staking a claim to QT's turf.\"\r\nTop ten lists\r\nThe film appeared on many critics' top ten lists of the best films of 2006. Carrie Rickey of The Philadelphia Inquirer, Joe Morgenstern of The Wall Street Journal, Ruthe Stein of the San Francisco Chronicle, and Steven Rea of The Philadelphia Inquirer named it one of the top ten films of 2006. Richard Roeper of the Chicago Sun-Times named it the best film of the 2000s.\r\nAccolades\r\nAt the 64th Golden Globe Awards on January 15, 2007, The Departed won one award for Best Director (Martin Scorsese), while being nominated for five other awards including Best Picture, Best Actor (Leonardo DiCaprio), Best Supporting Actor (Jack Nicholson, Mark Wahlberg), and Best Screenplay (William Monahan).\r\nAt the 79th Academy Awards on February 25, 2007, The Departed won four Academy Awards: Best Picture (Graham King), Best Director (Martin Scorsese), Best Film Editing (Thelma Schoonmaker), and Best Adapted Screenplay Writing (William Monahan). Mark Wahlberg was also nominated for the Best Supporting Actor award for his performance, but he lost to Alan Arkin for his role in Little Miss Sunshine.\r\nThe film marked the first time Scorsese won an Oscar after five previous losses. Many felt that he deserved it years earlier for prior efforts. Some felt he deserved it for his prior nominations and the win was described as a \"Lifetime Achievement Award for a lesser film\". Scorsese himself joked that he won because: \"This is the first movie I've done with a plot.\"\r\nAt the 11th Satellite Awards on December 18, 2006, The Departed won awards for Best Ensemble, Motion Picture, Best Motion Picture, Drama, Best Screenplay – Adapted (William Monahan), and Best Actor in a Supporting Role (Leonardo DiCaprio). In 2008, it was nominated for the American Film Institute Top 10 Gangster Films list\r\nHome media\r\nThe Departed was released by Warner Home Video on DVD in 2007. The film is available in a single-disc full screen (1.33:1), single-disc widescreen (2.40:1) edition, and 2-disc special edition. The second disc contains deleted scenes; a feature about the influence of New York's Little Italy on Scorsese; a Turner Classic Movies profile; and a 21-minute documentary titled Stranger Than Fiction: The True Story of Whitey Bulger, Southie and The Departed about the crimes that influenced Scorsese in creating the film, including the story of James \"Whitey\" Bulger, upon whom Jack Nicholson's character is based.\r\nMusic\r\nSoundtrack\r\nScore\r\nThe film score for The Departed was written by Howard Shore and performed by guitarists Sharon Isbin, G. E. Smith, Larry Saltzman and Marc Ribot. The score was recorded in Shore's own studio in New York State. The album, The Departed: Original Score, was released December 5, 2006 by New Line, and produced by Jason Cienkus.\r\nScorsese described the music as \"a very dangerous and lethal tango\" and cited the guitar-based score of Murder by Contract and the zither in The Third Man as inspiration.\r\nCancelled sequel\r\nAlthough many of the key characters in the film are dead by the end, there was a script written for a sequel. This was ultimately shelved due to the expense and Scorsese's lack of interest in creating a sequel.",
    "html": "<p>The Departed is a 2006 American crime thriller film directed by Martin Scorsese and written by William Monahan. It is both a remake of the 2002 Hong Kong film Infernal Affairs and also loosely based on the real-life Boston Winter Hill Gang; the character Colin Sullivan is based on the corrupt FBI agent John Connolly, while the character Frank Costello is based on Irish-American gangster and crime boss Whitey Bulger. The film stars Leonardo DiCaprio, Matt Damon, Jack Nicholson, and Mark Wahlberg, with Martin Sheen, Ray Winstone, Vera Farmiga, Alec Baldwin, Anthony Anderson and James Badge Dale in supporting roles.</p><p>The film takes place in Boston and the surrounding metro area, primarily in the city’s South End neighborhood. Irish Mob boss Frank Costello (Nicholson) plants Colin Sullivan (Damon) as a spy within the Massachusetts State Police; simultaneously, the police assign undercover state trooper Billy Costigan (DiCaprio) to infiltrate Costello's mob crew. When both sides realize the situation, Sullivan and Costigan each attempt to discover the other's identity before they are found out.</p><p>The Departed was a critical and commercial success, receiving acclaim for its direction, performances (particularly of DiCaprio, Nicholson, and Wahlberg), screenplay, and editing, with minor criticism for its plot holes. It won several accolades, including four Oscars at the 79th Academy Awards: for Best Picture, Best Director, Best Adapted Screenplay, and Best Film Editing. It became Scorsese's first and, to date, only personal Oscar win; Wahlberg was also nominated for Best Supporting Actor. The film also received six nominations at the 64th Golden Globe Awards, six nominations at the 60th British Academy Film Awards, and two nominations at the 13th Screen Actors Guild Awards. DiCaprio was nominated for Golden Globe Award for Best Actor – Motion Picture Drama (also nominated that year in the same category for Blood Diamond), BAFTA Award for Best Actor in a Leading Role and Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role for his performance.</p><br/><h3>Plot</h3><p>In South Boston, Irish Mob boss Frank Costello introduces himself to a young Colin Sullivan. Twenty years later, Sullivan has been groomed as a spy inside the Massachusetts State Police (MSP) and joins the Special Investigations Unit (SIU), which is building a case against Costello. Another new officer, Billy Costigan Jr., is recruited by Captain Queenan and Staff Sergeant Dignam to go undercover and infiltrate Costello's crew. Costigan is selected due to his family ties to organized crime, with his deceased uncle Jackie having been connected with Costello's outfit. Ellerby informs Special Investigations that the identities of undercovers will be only known to Queenan and Dignam to prevent leaks.</p><p>Costigan commits a series of crimes in an effort to draw the attention of Costello and his enforcer Arnold French, who later recruit Costigan into the organization due to their affection for his uncle. Over the next year, Costigan becomes increasingly involved in the operation. Due to the stress of having to maintain his cover, his emotional and mental state declines, and he threatens to quit, but Queenan and Dignam convince him to continue. Costigan's only other contact in the MSP is his police-appointed psychiatrist, Madolyn Madden, who is also Sullivan's girlfriend. Costigan and Madolyn later have an affair.</p><p>Costigan tells the MSP that Costello's crew is selling stolen computer microprocessors to a Hong Kong Triad. The MSP sets up a sting, but Sullivan tips off Costello, allowing everyone to escape. The MSP and Costello realize there is a mole in their ranks and task Sullivan to find them. Meanwhile, Costigan learns that Costello is a protected FBI informant. Costigan shares his discovery with Queenan and Dignam while warning them that Costello is aware of a spy in his ranks.</p><p>Late one night, Costigan follows Costello into an adult theater and witnesses him giving Sullivan an envelope containing information of his crew for Sullivan to cross reference with police records. Queenan instructs Costigan to get a visual ID of Sullivan but he is unable to get a good look at his face. When Sullivan realizes that he is being followed, he mistakenly stabs a restaurant worker and flees. Later, Sullivan tries to cross-reference Costigan's picture, captured by nearby security footage, against police officer databases but cannot identify him. Queenan advises Sullivan to follow Costello to find the MSP mole. Costigan calls Queenan and sets up a meeting but Sullivan has Queenan followed, lying to the other officers that Queenan may be the spy. Sullivan also calls in Costello's gang to the meeting location.</p><p>When Costello's men arrive, Queenan helps Costigan escape before being thrown from the building's roof to his death. This causes a firefight between SIU agents and Costello's men. Angered by Queenan's murder, Dignam attacks Sullivan and is suspended by Ellerby. Timothy Delahunt, one of Costello's henchmen who was injured in the gunfight with the police, tells Costigan that he knows he is the rat, but succumbs to his wounds before he can alert the others. A news report reveals that Delahunt was an undercover officer for the Boston Police Department, but Costello suspects the police department made up the claim so he would stop looking for the mole. Sullivan looks through Queenan's belongings and learns that Costello is a FBI informant after reading Queenan's notebook. Deciding to turn on him, Sullivan directs the MSP to tail Costello to a cocaine drop-off, where a gunfight erupts, killing most of Costello's crew. Sullivan confronts a wounded Costello, who admits to being an FBI informant. They exchange gunfire, and Sullivan kills him.</p><p>His assignment finished, Costigan goes to Sullivan to reveal his undercover status, still unaware of the other's true identity. After Sullivan goes to another room, Costigan notices the same envelope from the theater on his desk. Costigan ascertains that Sullivan was Costello's mole, and escapes. Shortly after, Sullivan returns to find Costigan gone, and realizes that he now knows his true identity. He erases Costigan's records from police computers. Costigan visits Madolyn and hands her an envelope, instructing her to open it if something happens to him. Later, she opens a package Costigan sent to Sullivan and listens to tapes Costello made of himself with Sullivan, causing her to leave Sullivan. In order to retrieve his records, Costigan arranges to meet Sullivan on the rooftop where Queenan was killed, then arrests him. Costigan calls Trooper Brown, a friend from the police academy, to substantiate his identity, but Brown pulls a gun on Costigan when he arrives, unsure who is telling the truth.</p><p>Costigan says that he has evidence tying Sullivan to Costello, and Brown lets him go down the elevator. Upon reaching the lobby, Costigan and Brown are killed by Trooper Barrigan, a friend of Sullivan's who reveals himself to be another spy working for Costello. Sullivan shoots Barrigan dead, allowing him to out Barrigan as the mole while removing suspicion from himself. When Sullivan arrives home from attending Costigan's funeral, Dignam is waiting for him. Dignam shoots him in the head and leaves.</p><br/><h3>Cast</h3><ul><li>Leonardo DiCaprio as Trooper William \"Billy\" Costigan Jr.</li><li>Matt Damon as Staff Sergeant Colin Sullivan</li><li>Jack Nicholson as Frank Costello</li><li>Mark Wahlberg as Staff Sergeant Sean Dignam</li><li>Martin Sheen as Captain Oliver \"Charlie\" Queenan</li><li>Ray Winstone as Arnold \"Frenchie\" French</li><li>Vera Farmiga as Dr. Madolyn Madden</li><li>Alec Baldwin as Captain George Ellerby</li><li>Anthony Anderson as Trooper Brown</li><li>Kevin Corrigan as Sean Costigan</li><li>James Badge Dale as Trooper Barrigan</li><li>David O'Hara as Patrick \"Fitzy\" Fitzgibbons</li><li>Mark Rolston as Timothy Delahunt</li><li>Robert Wahlberg as FBI Special Agent Frank Lazio</li><li>Kristen Dalton as Gwen</li><li>Amanda Lynch as Carmen</li><li>Shay Duffin as Phil</li></ul><br/><h3>Production</h3><p>In January 2003, Warner Bros., producer Brad Grey, and actor/producer Brad Pitt bought the rights to remake the Hong Kong film Infernal Affairs (2002) from Media Asia for $1.75 million. William Monahan was secured as a screenwriter, and later Martin Scorsese, who admired Monahan's script, came on board as director.</p><p>In March 2004, United Press International announced that Scorsese would be remaking Infernal Affairs and setting it in Boston, and that Leonardo DiCaprio and Brad Pitt were slated to star. Pitt, tentatively scheduled to play Sullivan, later declined to play the role, saying a younger actor should play the part; he decided to produce the film instead. Scorsese's associate Kenneth Lonergan suggested Matt Damon, who grew up in Boston, for the part of Sullivan, and Scorsese asked Jack Nicholson to play Costello. Robert De Niro was approached to play Queenan, but De Niro declined in order to direct The Good Shepherd instead. Scorsese would later say that De Niro turned down the role as he was not interested. Ray Liotta was approached for a role in the film, but declined due to a commitment to another project.</p><p>Nicholson wanted the film to have \"something a little more\" than the usual gangster film, and screenwriter Monahan came up with the idea of basing the Costello character on Irish-American gangster Whitey Bulger. This gave the screenplay an element of realism—and an element of dangerous uncertainty, because of the wide-ranging carte blanche the FBI gave Bulger in exchange for revealing information about fellow gangsters. A technical consultant on the film was Tom Duffy, who had served three decades on the Boston Police Department, particularly as an undercover detective investigating the Irish mob.</p><p>The Departed was officially greenlit by Warner Bros. in early 2005 and began shooting in the spring of 2005. Some of the film was shot on location in Boston. For budgetary and logistical reasons many scenes, in particular interiors, were shot in locations and sets in New York City, which had tax incentives for filmmakers that Boston at the time did not.</p><br/><h3>Themes and motifs</h3><p>Film critic Stanley Kauffmann said that for The Departed, Scorsese \"was apparently concerned with the idea of identity, one of the ancient themes of drama, and how it affects one's actions, emotions, self-knowledge, even dreams.\" Kauffmann, however, did not find the theme conveyed with particular effectiveness in the film. Film critic Roger Ebert compared Costigan and Sullivan's seeking of approval from those they are deceiving to Stockholm syndrome. Ebert also noted the themes of Catholic guilt.</p><p>In the final scene, a rat is seen on Sullivan's window ledge. Scorsese acknowledges that while it is not meant to be taken literally, it somewhat symbolizes the \"quest for the rat\" in the film and the strong sense of distrust among the characters, much like post-9/11 U.S. The window view behind the rat is a nod to gangster films like Little Caesar (1931), Scarface (1932), and White Heat (1949).</p><p>Throughout the film, Scorsese uses an \"X\" motif to foreshadow death in a manner similar to Howard Hawks' film Scarface (1932). Examples include shots of cross-beam supports in an airport walkway when Costigan is phoning Sgt. Dignam, the lighted \"X\" on the wall in Sullivan's office when he assures Costello over the phone that Costigan is not the rat, the taped windows of the building Queenan enters before being thrown to his death, behind Costigan's head in the elevator before he is shot, and the carpeted hallway floor when Sullivan returns to his apartment before being shot by Dignam at the film's end.</p><br/><h3>Release</h3><p>The Departed grossed $132.4 million in the United States and Canada and $159 million in other territories for a total gross of $291.5 million, against a production budget of $90 million.</p><p>The film grossed $26.9 million in its opening weekend, becoming the fourth Scorsese film to debut at number one. In the following three weeks the film grossed $19 million, $13.5 million and $9.8 million, finishing second at the box office each time, before grossing $7.7 million and dropping to 5th in its fifth week.</p><br/><h3>Reception</h3><p>On review aggregator Rotten Tomatoes, the film holds a 91% approval rating based on 284 reviews, with an average rating of 8.3/10. The website's critics consensus reads, \"Featuring outstanding work from an excellent cast, The Departed is a thoroughly engrossing gangster drama with the gritty authenticity and soupy morality we have come to expect from Martin Scorsese.\" Metacritic, which uses a weighted average, assigned the film a score of 85 out of 100 based on 39 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.</p><p>Entertainment Weekly ranked it on its end-of-the-decade \"Best of\" list, saying: \"If they're lucky, directors make one classic film in their career. Martin Scorsese has one per decade (Taxi Driver in the '70s, Raging Bull in the '80s, Goodfellas in the '90s). His 2006 Irish Mafia masterpiece kept the streak alive.\"</p><p>Roger Ebert gave the film four stars out of four, praising Scorsese for thematically differentiating his film from the original. Online critic James Berardinelli awarded the film four stars out of four, praising it as \"an American epic tragedy.\" He went on to claim that the film deserves to be ranked alongside Scorsese's past successes, including Taxi Driver, Raging Bull and Goodfellas.</p><p>Andrew Lau, the co-director of Infernal Affairs, who was interviewed by Hong Kong newspaper Apple Daily, said: \"Of course I think the version I made is better, but the Hollywood version is pretty good too. made the Hollywood version more attuned to American culture.\" Andy Lau, one of the main actors in Infernal Affairs, when asked how the movie compares to the original, said: \"The Departed was too long and it felt as if Hollywood had combined all three Infernal Affairs movies together.\" Although Lau said the script of the remake had some \"golden quotes\", he also felt it had a bit too much profanity. He ultimately rated The Departed eight out of ten and said that the Hollywood remake is worth a view, though according to Lau's spokeswoman Alice Tam, he felt that the combination of the two female characters into one in The Departed was not as good as the original storyline.</p><p>A few critics were disappointed in the film, including J. Hoberman of the Village Voice, who wrote: \"Infernal Affairs was surprisingly cool and effectively restrained for HK action, but Scorsese raises the temperature with every ultraviolent interaction. The surplus of belligerence and slur reach near-Tarantinian levels—appropriate as he's staking a claim to QT's turf.\"</p><h4>Top ten lists</h4><p>The film appeared on many critics' top ten lists of the best films of 2006. Carrie Rickey of The Philadelphia Inquirer, Joe Morgenstern of The Wall Street Journal, Ruthe Stein of the San Francisco Chronicle, and Steven Rea of The Philadelphia Inquirer named it one of the top ten films of 2006. Richard Roeper of the Chicago Sun-Times named it the best film of the 2000s.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>1st – <span>Richard Roeper</span>, <i><span class=\"mw-redirect\">Ebert and Roeper</span></i></li><li>1st – Peter Travers, <i><span>Rolling Stone</span></i></li><li>1st – Rene Rodriguez, <i><span class=\"mw-redirect\">The Miami Herald</span></i></li><li>1st – Scott Tobias, <i><span>The A.V. Club</span></i></li><li>1st – Joshua Rothkopf, <i><span class=\"mw-redirect\">Time Out New York</span></i></li><li>1st – Philip Martin, <i><span>Arkansas Democrat-Gazette</span></i></li><li>1st – James Berardinelli, ReelViews</li><li>2nd – Chris Kaltenbach, <i><span>The Baltimore Sun</span></i></li><li>2nd – Adam Kempenaar, <i><span>Filmspotting</span></i></li><li>2nd – Keith Phipps, <i>The A.V. Club</i></li><li>2nd – <span>Kyle Smith</span>, <i><span>New York Post</span></i></li><li>2nd – Mike Russell, <i><span>The Oregonian</span></i></li><li>2nd – Richard James Havis, <i><span>The Hollywood Reporter</span></i></li><li>2nd – <span>Richard Schickel</span>, <i><span>TIME</span></i></li><li>3rd – Frank Scheck, <i>The Hollywood Reporter</i></li><li>4th – Glenn Kenny, <i><span class=\"mw-redirect\">Premiere</span></i></li><li>4th – Marc Savlov, <i><span>The Austin Chronicle</span></i></li><li>4th – Michael Wilmington, <i><span>Chicago Tribune</span></i></li></ul></td><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>4th – <span>Roger Ebert</span>, <i>Chicago Sun-Times</i></li><li>5th – <i><span>Empire</span></i></li><li>5th – <span>David Ansen</span>, <i><span>Newsweek</span></i></li><li>5th – Kevin Crust, <i><span>Los Angeles Times</span></i></li><li>5th – <span>Lisa Schwarzbaum</span>, <i><span>Entertainment Weekly</span></i></li><li>5th – <span>Stephen Hunter</span>, <i><span>The Washington Post</span></i></li><li>6th – Ann Hornaday, <i>The Washington Post</i></li><li>6th – Jack Mathews, <i><span class=\"mw-redirect\">Daily News</span></i></li><li>6th – Nathan Rabin, <i>The A.V. Club</i></li><li>6th – Ty Burr, <i><span>The Boston Globe</span></i></li><li>7th – Nathan Lee, <i><span>The Village Voice</span></i></li><li>7th – Noel Murray, <i>The A.V. Club</i></li><li>7th – Peter Hartlaub, <i>San Francisco Chronicle</i></li><li>8th – <span>Michael Sragow</span>, <i>The Baltimore Sun</i></li><li>9th – Claudia Puig, <i><span>USA Today</span></i></li><li>9th – Desson Thomson, <i>The Washington Post</i></li><li>9th – Lou Lumenick, <i>New York Post</i></li><li>9th – Michael Rechtshaffen, <i>The Hollywood Reporter</i></li></ul><p> </p></td></tr></tbody></table><h4>Accolades</h4><p>At the 64th Golden Globe Awards on January 15, 2007, The Departed won one award for Best Director (Martin Scorsese), while being nominated for five other awards including Best Picture, Best Actor (Leonardo DiCaprio), Best Supporting Actor (Jack Nicholson, Mark Wahlberg), and Best Screenplay (William Monahan).</p><p>At the 79th Academy Awards on February 25, 2007, The Departed won four Academy Awards: Best Picture (Graham King), Best Director (Martin Scorsese), Best Film Editing (Thelma Schoonmaker), and Best Adapted Screenplay Writing (William Monahan). Mark Wahlberg was also nominated for the Best Supporting Actor award for his performance, but he lost to Alan Arkin for his role in Little Miss Sunshine.</p><p>The film marked the first time Scorsese won an Oscar after five previous losses. Many felt that he deserved it years earlier for prior efforts. Some felt he deserved it for his prior nominations and the win was described as a \"Lifetime Achievement Award for a lesser film\". Scorsese himself joked that he won because: \"This is the first movie I've done with a plot.\"</p><p>At the 11th Satellite Awards on December 18, 2006, The Departed won awards for Best Ensemble, Motion Picture, Best Motion Picture, Drama, Best Screenplay – Adapted (William Monahan), and Best Actor in a Supporting Role (Leonardo DiCaprio). In 2008, it was nominated for the American Film Institute Top 10 Gangster Films list</p><br/><h3>Home media</h3><p>The Departed was released by Warner Home Video on DVD in 2007. The film is available in a single-disc full screen (1.33:1), single-disc widescreen (2.40:1) edition, and 2-disc special edition. The second disc contains deleted scenes; a feature about the influence of New York's Little Italy on Scorsese; a Turner Classic Movies profile; and a 21-minute documentary titled Stranger Than Fiction: The True Story of Whitey Bulger, Southie and The Departed about the crimes that influenced Scorsese in creating the film, including the story of James \"Whitey\" Bulger, upon whom Jack Nicholson's character is based.</p><br/><h3>Music</h3><h4>Soundtrack</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">The Departed: Music from the Motion Picture</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">Various Artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">November 7, 2006</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Rock</span>, <span>country</span>, <span>pop</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Warner Sunset</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">Jason Cienkus</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Track Listing</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Artist(s)</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>Comfortably Numb</span>\"</td><td><span>Roger Waters</span> <span style=\"font-size:85%;\">(Feat. <span>Van Morrison</span> &amp; <span>The Band</span>)</span></td><td class=\"tracklist-length\">7:59</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"<span>Sail On, Sailor</span>\"</td><td><span>The Beach Boys</span></td><td class=\"tracklist-length\">3:18</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"<span>Let It Loose</span>\"</td><td><span>The Rolling Stones</span></td><td class=\"tracklist-length\">5:18</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Sweet Dreams\"</td><td><span>Roy Buchanan</span></td><td class=\"tracklist-length\">3:32</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span>One Way Out</span>\"</td><td><span>The Allman Brothers Band</span></td><td class=\"tracklist-length\">4:57</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"<span>Baby Blue</span>\"</td><td><span>Badfinger</span></td><td class=\"tracklist-length\">3:36</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"<span>I'm Shipping Up to Boston</span>\"</td><td><span>Dropkick Murphys</span></td><td class=\"tracklist-length\">2:34</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"<span class=\"mw-redirect\">Nobody but Me</span>\"</td><td><span>The Human Beinz</span></td><td class=\"tracklist-length\">2:18</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"<span class=\"mw-redirect\">Tweedle Dee</span>\"</td><td><span>LaVern Baker</span></td><td class=\"tracklist-length\">3:10</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"<span class=\"mw-redirect\">Sweet Dreams (of You)</span>\"</td><td><span>Patsy Cline</span></td><td class=\"tracklist-length\">2:34</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"The Departed Tango\"</td><td><span>Howard Shore</span>, <span>Marc Ribot</span></td><td class=\"tracklist-length\">3:32</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Beacon Hill\"</td><td>Howard Shore, <span>Sharon Isbin</span></td><td class=\"tracklist-length\">2:33</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"<span>Gimme Shelter</span>\"</td><td>The Rolling Stones</td><td class=\"tracklist-length\">3:18</td></tr></tbody></table><h4>Score</h4><p>The film score for The Departed was written by Howard Shore and performed by guitarists Sharon Isbin, G. E. Smith, Larry Saltzman and Marc Ribot. The score was recorded in Shore's own studio in New York State. The album, The Departed: Original Score, was released December 5, 2006 by New Line, and produced by Jason Cienkus.</p><p>Scorsese described the music as \"a very dangerous and lethal tango\" and cited the guitar-based score of Murder by Contract and the zither in The Third Man as inspiration.</p><br/><h3>Cancelled sequel</h3><p>Although many of the key characters in the film are dead by the end, there was a script written for a sequel. This was ultimately shelved due to the expense and Scorsese's lack of interest in creating a sequel.</p><br/>"
  },
  "errorMessage": ""
}