{
  "imDbId": "tt0079470",
  "title": "Life of Brian",
  "fullTitle": "Life of Brian (1979)",
  "type": "Movie",
  "year": "1979",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "It has been said that a Monty Python movie is only successful if it offends everyone in the audience at least once. By that measuring stick as well as nearly any other, The Life of Brian is an unqualified triumph. It makes us confront our foibles and laugh at them."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Astringently funny masterpiece."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "90",
      "content": "The more things change, the more we have to laugh if we are to have a prayer of remaining sane, and the Pythons are the best possible step in that direction."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "88",
      "content": "\"No God and no religion can survive ridicule,\" wrote Mark Twain, but for once the sage of Hannibal was wrong."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "While it may lack the sheer comic anarchy of their other work, Life of Brian may be probably the funniest collective efforts concocted by the British comedy troupe \"Monty Python's Flying Circus,\" is their most sustained effort. (Review of Original Release)"
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1978/film/reviews/life-of-brian-1200424475/",
      "rate": "80",
      "content": "Just as wacky and imaginative as their earlier film outings. (Review of Original Release)"
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Carrie Rickey",
      "link": "https://www.inquirer.com/entertainment/?id=57841&amp;reviewId=8284",
      "rate": "75",
      "content": "Blessed are the Pythons for making holy wit of the Holy Writ."
    },
    {
      "publisher": "The New Yorker",
      "author": "Anthony Lane",
      "link": "",
      "rate": "70",
      "content": "For all its scruffiness, the lurching strike-rate of its gags, and the unmistakable smell of amateur dramatics given off by its repertory of rotating players with their stick-on Ted Nugent beards, Life of Brian jitters with good will. [3 May 2004, p. 110]"
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "70",
      "content": "Monty Python's Life of Brian, re-released on its 25th anniversary as an antidote to \"The Passion of the Christ,\" is a single-joke satire of organized religion, including Hollywood's."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "30",
      "content": "Sluggish, repetitive, and strangely timorous, with little of the zap and imagination of the Pythons' television work."
    }
  ],
  "errorMessage": ""
}