{
  "imDbId": "tt0079470",
  "title": "Life of Brian",
  "fullTitle": "Life of Brian (1979)",
  "type": "Movie",
  "year": "1979",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2922899",
      "warningSpoilers": false,
      "date": "16 December 2013",
      "rate": "10",
      "helpful": "235 out of 255 found this helpful.",
      "title": "One of the most intelligent comedies ever made",
      "content": "Personally, I believe this to be one of the most intelligent comedies ever made. It might not appear that way at first because the film does have its share of simple slapstick and \"naughty\" moments, but generally, the topics the Pythons tackle here are very serious - albeit dealt with in a way that makes this a true contender for the funniest film of all time. A firework of hilarious sketches, timeless quotes and clever comments on the human condition, this film was deemed too dangerous for the masses and therefore, until recently, banned in several countries (normally, this only used to happen to the so called \"Video Nasties\").This film never once makes fun of Jesus (Christ) - but it DOES take the mickey out of blind, fanatic followers of any political movement or religion.An outstanding achievement and endlessly re-watchable. My vote: 10 out of 10Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2240266",
      "warningSpoilers": false,
      "date": "24 April 2010",
      "rate": "10",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Utterly hilarious from start to finish!",
      "content": "Life of Brian may have caused controversy on release, but this has always been my personal favourite of the Monty Python movies. Why? Because it is hilarious! True, the story isn't the best component of the film, but everything else works wonders. It is essentially an irreverent and inspired send up of religious epics, and is helped brilliantly by gags and a script that is so joyfully juvenile, if extremely rude, and quotable. Quotes such as \"He's not the Messiah. He is a very naughty boy\" and \"Welease Wodewick\" had me literally peeing my pants. The sets are realistic and all of the Pythons who here take several pot shots at their favourite targets, especially Terry Jones, Graham Chapman and Michael Palin are on top form. Overall, irreverent and hilarious, a must see! 10/10 Bethany Cox"
    },
    {
      "username": "filmbuff-05706",
      "userUrl": "https://www.imdb.com/user/ur119773892",
      "reviewLink": "https://www.imdb.com/review/rw7929187",
      "warningSpoilers": true,
      "date": "7 March 2022",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "I'm A Christian And This Is My Favorite Comedy Of All Time.",
      "content": "Monty Python's The Life of Brian is notorious for offending many Christians- especially at the time of it's release 43 years ago- despite many of these protesters being non-viewers. However, I'm a Christian and this is my favorite comedy movie. (Admittedly, my love for Bible-themed movies plays a factor in that.)The plot follows Brian, a man who was born next to Jesus on the same night. As Brian gets older, HE is mistaken for The Messiah, which results in unwanted followers and accidental crucifixion.While the film is clearly a satire on the Christian faith, and religion in general, there is actually less to be offended by then one might think. For one thing, this movie is not necessarily an attack on Jesus or His message. In fact, this movie is not really about Christ Himself.He only appears twice in the film, once at the Nativity (the wisemen mistake Brian for Jesus and almost give him their gifts), and later in The Sermon on the Mount, where people far from Him mishear what He is teaching:\"Blessed are the cheesemakers? What's so special about the cheesemakers?\"\"Well, obviously it's not meant to be taken literally, it refers to any manufacturers of dairy products.\"The movie's intention is not necessarily to attack faith or make religious people change their mind, the message is to avoid BLIND faith. This is shown in a couple of well done scenes.First, there is a scene where Brian, at his house, tells his followers that they are individuals. The crowd ironically agrees and says: \"Yes, we are all individuals!\" \"You have to think for yourselves!\" \"Yes, we have to think for ourselves!\"In another scene, Brian can't convince his followers that he isn't The Messiah, so he gives up and says that he is, to which they all excitedly bow to him. Brian then shouts: \"Now, F off!\" to which one person replies: \"How should we F off, oh lord?\"These scenes, while silly, do a great job of showing the movie's aforementioned message. While the Python crew are atheists, they don't seem to be making a movie saying: \"Be an atheist, religion is blind.\" It's really saying: \"Don't just believe because the crowd does.\" If you think through your faith and still believe, that's great, but make sure your personal faith truly is your own.Apart from the message, the movie is of course very funny, and has many moments that have me laughing quite loud. Some jokes are quite offensive, but work within the context.For example, early in the movie, Brian badmouths a Roman, and his mother sets him aside and admits that he is half-Roman. \"Do you mean you were raped?\" He asks, shocked. His mother then responds: \"Well, at first yes.\"It's the most messed up joke I've ever heard in a movie, but The Python crew manages to make it work within it's context- though of course no movie would have that kind of humor now.The movie's opening credits also have a song that parodies the opening of a James Bond film, singing about how Brian grew up into a man. This includes this hilarious line:\"And his voice dropped down low, and things started to grow, on young Brian and show, he was certainly no...no girl named Brian! Not a girl named Brian!\"Speaking of songs, the movie concludes with perhaps the most famous song in Monty Python, Always Look On The Bright Side of Life. I just watched the movie for the 3rd time, and I played that song twice- it's that catchy. And it makes for one of the best endings in cinema history.It's really hard to discuss why Life of Brian is such a great movie without getting into these spoilers. There are many funny and thought-provoking moments- this review barely scratches the surface. Hopefully, however, I have exemplified why this is the best comedy movie I have ever seen. It's one of the silliest yet provocative movies ever produced.While some may find this film offensive (though this movie is targeting you if that's the case), Life of Brian makes for a great comedy with great laughs, a great story, and an interesting message on top of that. And that's more than enough to call this the best comedy movie I have ever seen."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1190677",
      "warningSpoilers": false,
      "date": "10 October 2005",
      "rate": "10",
      "helpful": "112 out of 166 found this helpful.",
      "title": "Ave Monty Python!",
      "content": "This is, in my opinion, the best religious movie ever made. Monty Python's Flying Circus knows how to do everything hilariously. Focusing on Brian Cohen (Graham Chapman), who gets mistaken for the messiah in Judea in 33 AD, the movie pokes fun at everything: Romans, Jews, imperialism, even extraterrestrials. With sardonic lines almost every minute, they play religious fundamentalism for what it is: silly. I don't even know which scene was my favorite; every part was so funny. You'll never forget the song at the end. This is comedy in its greatest form, and it makes sense that it would come from the guys who brought us the \"parrot sketch\". Absolutely a hoot."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3603607",
      "warningSpoilers": false,
      "date": "21 December 2016",
      "rate": "10",
      "helpful": "20 out of 26 found this helpful.",
      "title": "A Comment on Our Gullibility",
      "content": "This is such a fine movie. It involves a guy who was born just down the street in Bethlehem. The Magi go to him first and then realize they are confused and leave. He tries to lead a normal life, but word gets out that he is the Messiah. He does everything he can to get this off his back, but a group of followers begin interpreting his words as great wisdom and godliness. It gets so bad that when they are sent to check out \"the other Guy\" they ultimately find his pronouncement (actually non-pronouncements) to be much more impressive. There is a hilarious scene where he tries to make a statement about the Romans, but his Latin is so bad he is force to write it over and over on the walls, like an American schoolboy. The final scene is incredible. If you've never heard the song or seen the images, check it out. I would imaging there are some people who find this movie blasphemous. I consider it one of the greatest parodies ever produced."
    },
    {
      "username": "alice liddell",
      "userUrl": "https://www.imdb.com/user/ur0394470",
      "reviewLink": "https://www.imdb.com/review/rw0168657",
      "warningSpoilers": false,
      "date": "13 October 1999",
      "rate": "10",
      "helpful": "199 out of 281 found this helpful.",
      "title": "Still one of the funniest films of all time.",
      "content": "It's impossible for me to be objective about this film. I know every scene and line by heart. Not because I'm one of those ghastly Python nerds, whose anal obsessiveness sucks the whole spirit out of everything they did, and actually misses the joke, which is on them; they are the perfect subjects for a Python lampoon. No. I only know LIFE OF BRIAN so intimately because I've seen it so often, it's still one of the funniest comedies I've ever seen, and persists in being hilarious despite familiarity, which, as in so much Python did, is the reverse of what comedy is 'supposed' to be made of (i.e. surprise).Also, nostalgia value. MONTY PYTHON were my first heroes, before I even reached double figures. I gobbled up every programme, film and record in a space of a couple of short years, so they are bound up with a period of my life when I was very happy and hopeful, so I go all misty-eyed when I see it. Bizarrely, we were first encouraged to watch BRIAN by our Latin teacher, who felt it was very insightful about Roman society.But no-one watches PYTHON anymore, except that dorkish clique. My brother, only a couple of years my junior, is as mystified now by my reaction to it as my parents were then. But surely BRIAN is a comic masterpiece in itself, accessible to anyone who found the very male, elitist, academic bias of the programme somewhat alienating?How can I implore you to watch this? It's got a straight narrative, with some of the greatest set-pieces and dialogue of any film ever. It's not a great FILM comedy - Terry Jones is no Gilliam - but the style suits the humour perfectly, allowing it to breathe, and sometimes pulling off an extraordinarily evocative shot, such as when Brian and his mother are walking from Jesus' sermon, and squabbling about petty things like big noses, and the camera pulls back to a vast Judean wasteland, with a massive Roman statue being wheeled, and a set of crucifixes being planted: a marvellous encapsulation of a period in history.This is the film's true triumph - it's a magnificent deconstruction of historical distortion. By paralleling the life of Christ with that of an ordinary little man, Python reclaim history from symbol and myth. It brings the body back into history. Its resolute rejection of divinity leads to a bleak, ironic conclusion (listen to 'Always Look On The Bright Side Of Life' carefully, and in context: it's NOT comforting) - the story of Jesus without redemption is ghastly.The intelligence behind the juvenile gags is astonishing - the film is a learned commentary on power, totalitarianism, repression, language, gender, the writing of history, the politics of subversion, the complicity of the repressed. Myth is thrown to the wind - the film succeeds where Reg and his revolutionaries fail, by revealing a whole series of repressive apparatum (sic?). No-one is spared - the film is unashamedly destructive, but the film's satire is not arid or narrow; there are many rich parallels with our own time, as the extraordinary reaction from the religious on the film's release showed.But BRIAN is not just an attack on religion, but on all who would seek to write selective histories for their own interests, suppressing others' voices. The silliest jokes are also the most profound - in one scene, the kidnappers enter Pilate's palace through a tiled floor. They emerge through a modesty-concealing leaf painted on this floor. This is snickering schoolboy humour, and very very funny, but is also a comment on the phallocentricity of imperialism. Jokes like these are why BRIAN will always remain vital - it turns you into a ludicrous, ill-informed amateur historian.The acting is an astonishing feat of multiple performances, but Graham Chapman, always my favorite Python, holds the chaos together, ironically as the Kafkaesque hero who races towards the abyss, an anti-Jesus to love and identify with. If I've made the film sound like hard work, than I'm an idiot. The seriousness is only there if you want it. Like Alice in Wonderland, or Buster Keaton, PYTHON seem to be full of metaphors that encapsulate the pains of life, but are also damnably entertaining. It's strange that men as supposedly 'surreal' and 'out there' as the Pythons should speak such good sense. Only BRINGING UP BABY, THE PALM BEACH STORY, and MONTY PYTHON AND THE HOLY GRAIL, are funnier than this. Treasure it."
    },
    {
      "username": "the_barnacle",
      "userUrl": "https://www.imdb.com/user/ur96934780",
      "reviewLink": "https://www.imdb.com/review/rw4735693",
      "warningSpoilers": false,
      "date": "21 March 2019",
      "rate": "10",
      "helpful": "34 out of 37 found this helpful.",
      "title": "'Do you find it wisible...when I say the name...Biggus...Dickus?'",
      "content": "Famous lines from Michael Palin as Pontius Pilate...and also my favourite lines from this wondrous film. This is not a piece of criticism, just an exhibition of love. For those of you who believe that Holy Grail is better - I'm sorry to inform you that you're wrong. Life of Brian has such good consistent humour that really can't be beaten. The variety and range of characters the Pythons play is sublime. The chemistry they have with each of other is what makes the film work so well. I won't ramble on anymore because most of what I want to say has already been said!Afterthought: Well, what is myrrh anyway?"
    },
    {
      "username": "TBJCSKCNRRQTreviews",
      "userUrl": "https://www.imdb.com/user/ur2093818",
      "reviewLink": "https://www.imdb.com/review/rw0168803",
      "warningSpoilers": false,
      "date": "29 June 2004",
      "rate": "8",
      "helpful": "92 out of 147 found this helpful.",
      "title": "Still funny, after 25 years",
      "content": "When a film is still funny 25 years after it's made, and doesn't feel particularly aged, even a quarter of a century later, then you know that you've struck gold. The famous Monty Python crew once again take a well-known subject and make a lot of fun of it. This time, the subject is religion, or, more specifically, Christianity. Everyone who knows at least a little about Christianity, which is pretty much anyone from the western world, will probably be able to laugh at something in this movie. Unless, of course, you are very Christian yourself, in that case you will probably feel that the film is blasphemous(I don't personally think so, since it makes fun of the followers and the general stupidity of people and organizations back in 30-something A.D., rather than Jesus and his teachings). The plot is about as incoherent as the usual Monty Python team film, though it should be noted that, like Monty Python and the Holy Grail, it is an actual film, and not a series of sketches, like, for example, the Meaning of Life. It's about as paced as they usually are, most of the scenes contain a lot of jokes, and then they move on to the next scene, after about five minutes of jokes and sight gags. This is, unfortunately, the problem with their films; if you don't like the jokes, the film might seem extremely slow to you; of course, one could argue that Monty Python mainly make movies for the jokes sake, but they could do better on the pacing, for the sake of viewers who don't like all those repeated jokes. That's not to say that I don't like them, I laugh at them most of the time, heck, I laughed so hard that I almost got stomach ache from it at one particular instant. But, I guess that a lot of people won't like them for this way of making movies. Oh well. You can't please everyone. The humor is great, it's standard Python wacky, crazy humor, so every Python fan should enjoy it. People who don't like Monty Python should give this a chance too, if they have at least a little humor, and they aren't Christian extremists. Christian \"believers\" can probably laugh at it too, like I said, it's not the religion itself, it's more the brainwashed followers that the film makes fun of. All in all, a great film for fans of the Python crew, and people who have a sense of humor about religion(a dark sense of humor, that is). I recommend it to fans of Monty Python, people who enjoy dark humor and people who can laugh a little at the less intelligent parts of Christianity. I fall into all three categories, and I loved it. 8/10"
    },
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw5740718",
      "warningSpoilers": false,
      "date": "16 May 2020",
      "rate": "8",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Razor sharp, and still holds up",
      "content": "Marvelous satire of religion and its followers - how the message is distorted, how factions invariably form and fight one another, and how blind worship quickly replaces reason (and even kindness). After the Sermon on the Mount is delivered to a crowd who mostly can't hear Jesus and squabble among themselves, one guy walks off commenting \"What Jesus fails to appreciate is that it's the meek who are the problem,\" in shades of the conservative view in 1979 and today. Mostly it's just good, sacrilegious fun, sometimes venturing into territory that's now frowned upon (like making fun of a speech impediment), but overall very creative and intelligent. Here's another funny bit:Brian: Look, you've got it all wrong! You don't need to follow me! You don't need to follow anybody! You've got to think for yourselves! You're all individuals! Crowd, as one: Yes! We're all individuals! Brian: You're all different! Crowd, as one: Yes, we're all different!"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0168800",
      "warningSpoilers": false,
      "date": "21 June 2004",
      "rate": "10",
      "helpful": "82 out of 133 found this helpful.",
      "title": "Not necessarily laugh-out-loud every minute, but it's satirical edge and wit is as clever as the technical side of the film",
      "content": "Monty Python's follow-up to their cult smash Holy Grail was Life of Brian, a film that takes on (if not always with the utmost seriousness, then usually with a mix of silliness and slight intellectualism) the believers in religions, the zealous nature that belief brings out in people. I first saw the film in the theater upon its re-release last month, and I found it very funny, though not with the kind of belly laughs that I had on my first reaction to Holy Grail. It's not without it's scenes that stick out as some of Python's finest (the Stoning, Pilate's scenes, the Spaceship sequence), even as sometimes it goes a little too broad for comfort (part of the colisseum).Yet, the great strengths that lie in Life of Brian are that 1) the writers and performers (Chapman, Cleese, Gilliam, Jones, Idle, Palin) bring their irreverent strengths to a fine point with the script and multiple roles. Even when a scene doesn't get the laughs it could've or should've, it turns out to be a scene brimming with a cleverness that could only exist in the \"Python-esque\" universe. 2) the director (Jones) and designer/animator (Gilliam) lay the groundwork for this realistic atmosphere of 33 A.D. and bring out what is the best in the acting, Pythons or otherwise (famous British comedian Spike Milligan has a role of note). Held over from the sets of Franco Zeferelli's Christ film, the Pythons use all these locations and settings and little details to spring out their wild, brilliant gags. The look of the film enriches the comedic elements, and the result is (arguably, of course) the troupe's best film. Not for all tastes by the way (Monty Python in general for me took some while to warm up to, but paid off once it worked). Grade: A"
    },
    {
      "username": "j30bell",
      "userUrl": "https://www.imdb.com/user/ur3245202",
      "reviewLink": "https://www.imdb.com/review/rw0981721",
      "warningSpoilers": false,
      "date": "20 December 2004",
      "rate": "9",
      "helpful": "205 out of 275 found this helpful.",
      "title": "A Masterwork of British Comedy",
      "content": "In Life of Brian, Python created what John Cleese called simply \"our masterpiece\". As a piece of writing, it is the most impressive of the three feature length Python movies. The scenes remain episodic, but there is a much more coherent narrative than in the earlier Holy Grail  I loved HG too, but for different reasons. The characters (well about one or two of the characters) have acquired some subtle shading, which is rare in comedy and, alas, rare in British comedy in particular. The plight of Chapman's Brian is one that I really cared about (although his death is also extremely funny, upbeat and one of the truly iconic moments in British cinema).The story must be fairly well known. Brian is born at the same time as Jesus with whom he leads a kind of parallel life, thus allowing the team to lampoon and satirise everything from religious zealotry and mob hysteria to 1950s biblical/sword & sandals epic cinema. It does this by marrying historic situations with more modern attitudes; thus we have revolutionary Stan who wants to be Loretta and have the right to have babies, the old man who can't understand why he's being stoned for saying simply \"that piece of halibut was good enough for Jehovah!\" the gruff centurion correcting Brian's Latin grammar while he's trying to daub anti-Roman slogans on a wall and the gentle centurion asking each of a line of the condemned \"crucifixion? Good\" while ticking them off on his clipboard. Interspersed with this is slapstick, pantomime women (I'm not sure there are any real women in Python, which is probably its greatest failing) and a small amount of the trademark Python surrealism (the spaceship, the \"prophet\" talking about the sons misplacing the things owned by their fathers who had placed them down only just a moment ago etc). In short, something for everyone  except, perhaps, committed Christians.A lot of attention has been paid to whether LoB is blasphemous. The Pythons claim not and I'm not sufficiently religious to care very much. On the surface, I disagree. There are also occasional sideswipes at ancient Jewish custom  although, to be fair, only stoning which, if you'll pardon the pun, might be considered a fair target. Jesus is not criticised, but the film's central message seems to be; be in the right place at the right time and even a man called Brian can become God. Almost the last line is from Eric Idle saying; \"you come from nothing and go back to nothing\" which doesn't suggest that the man on the mount at the beginning is a divinity, no matter whether he's talking sense or not.Most importantly though, LoB is refreshingly satirical. There always was an element of this in Python (mediaeval Christian philosophy lampooned in the Holy Grail for example \"this new learning amazes me Sir Bedevere, explain again how sheeps' bladders may be employed to prevent earthquakes so, if she weighs the same as a duck, she must be made of wood, and therefore - a witch\". I guess LoB attracted attention because the satire had never been so bold or obvious before. This is also what makes LoB such an incredibly funny film to watch; but put it this way  despite what Rowan Atkinson may have once said  I'd be very surprised if the Python's weren't expecting the Spanish Inquisition.That shouldn't put you off, though. Unless your faith is too weak to survive Python's gentle humanism, watch this movie  you'll probably love it."
    },
    {
      "username": "Gazzer-2",
      "userUrl": "https://www.imdb.com/user/ur0125608",
      "reviewLink": "https://www.imdb.com/review/rw0168723",
      "warningSpoilers": false,
      "date": "1 April 2002",
      "rate": "8",
      "helpful": "380 out of 493 found this helpful.",
      "title": "I Think God Has A Sense Of Humor, Don't You?",
      "content": "And in the 1979th year of Our Lord, God took in a screening of Monty Python's \"Life Of Brian,\" and thought it was funny. He did NOT think the film was blasphemous or offensive in any way. Yea, God did admire it's incredibly clever pokes at religion and at religious fanatics, for God Himself knew the virtue of being able to laugh at one's self. He also knew before He even walked into the theater that the title character, Brian, was NOT Jesus Christ, but merely a man who was born at the same time as Christ---right next door, in fact---and became mistaken for a messiah. God settled into His seat, with popcorn in one hand and diet soda in another, and had a rollicking good time.He recommended \"Life Of Brian\" to His Son, Jesus, who went to see it the following week. He, too, thought it was a hilarious film, and immediately sang the praises of the Monty Python troupe---John Cleese, Graham Chapman, Eric Idle, Terry Jones, Terry Gilliam & Michael Palin---for creating such a wonderful spoof. And He recommended the film to His friends. Have an open mind, He told them, and have fun. But God and His Son were quite puzzled why so many people in the Bible Belt community were so upset by \"Life Of Brian\"---especially the ones who hadn't even bothered to SEE the frigging film for fear of being damned for all time. And They both shook their heads in dismay. It's only a movie, They thought, and a very funny, harmless one at that. Get a life!But God gave Monty Python's \"Life Of Brian\" the power to overcome such ridiculous adversity, and today, well over two decades later, the film is rightfully regarded as a comedy classic, and one of the Python's finest works. It's *still* not a film for everybody, but does it have to be? If you're in tune with the Python's style of zany comedy, you'll enjoy \"Life Of Brian.\"And praise be to Saint George Harrison, late of The Beatles, for lending the Pythons a hand in making this wonderful movie. :-)"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw6686454",
      "warningSpoilers": false,
      "date": "12 March 2021",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Timeless classic",
      "content": "It is tough for me to rewatch certain movies that left quite an impact on my younger self. Not because the movies dissapoint (though there are some of those too, looking at you Krull), but because I am so used to the German dub of those movies, that it is tough to watch the original audio. It is even tougher to describe what that feels like if you haven't gone through something similar.And yet still and even though those dubs were some of the best ones around - I haven't watched a dubbed movie in a while so I can't and don't want to compare to nowadays .... the original movie audio delivers too. Sometimes it even has completely different jokes, that I have to wrap my head around first.But this movie that plays around the time Jesus was born (and has as little of him in it) is timeless ... the jokes about everything and anything, still hit home. About correctness, about shaming, about rage ... about so many social things that it feels as if it was shot just yesterday ... and all that while having a ration of jokes a minute that will make you crack up. Yes it also is silly as can be ... but the truths in it ... priceless and ageless! Really one for the ages ..."
    },
    {
      "username": "framptonhollis",
      "userUrl": "https://www.imdb.com/user/ur59554469",
      "reviewLink": "https://www.imdb.com/review/rw3610496",
      "warningSpoilers": false,
      "date": "1 January 2017",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "one of the funniest films of all time",
      "content": "Monty Python...do I even need to say more?They were obviously some of the funniest people on the planet-British or otherwise, and this can clearly be expressed in their filmography, which also includes the beloved comedy classic \"Monty Python and the Holy Grail\". Personally, it's somewhat difficult for em to come up with which of their films is the finest and funniest-but I think it just might be \"Life of Brian\".While the group has always had a satirical edge, \"Life of Brian\" is easily their most satirical work, as it mocks countless things in an extremely creative and entertaining fashion. The film is quite controversial due to it concerning religion, and injecting humor into subjects such as Jesus Christ's crucifixion, but it is more than just a film that mocks only religion. There are jokes throughout that satirize everything from political correctness to science fiction. It's a funny movie, and its targets are seemingly endless.This is an inventive classic of comedy, filled with memorable and famous moments from start to finish."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2978887",
      "warningSpoilers": false,
      "date": "13 March 2014",
      "rate": "9",
      "helpful": "11 out of 16 found this helpful.",
      "title": "Brian the mistaken Messiah",
      "content": "Brian Cohen (Graham Chapman) was born next to baby Jesus being mistaken for the Messiah by the three wise men. He has a loud Jewish mother (Terry Jones). He spends his life around the biblical events eventually joining a Jewish resistance group. On the run from the Romans, he is mistaken for the Messiah by a crowd leading to his crucification.There are three things I love about this movie. The first is the hilarious Jewish mother by Terry Jones. Every time he says something, I have to laugh. The first half of the movie is a bit hit and miss. There are some really funny skits. Around midway, Brian is mistaken for the Messiah and I think this is where the best comedy is. It's a light hearted skewering of church doctrine. They are literally killing it with kindness as the fanatical followers declare everything divine. Of course, I love the finale song. Who doesn't love 'Always Look on the Bright Side Of Life'?"
    },
    {
      "username": "ThomasDrufke",
      "userUrl": "https://www.imdb.com/user/ur39517558",
      "reviewLink": "https://www.imdb.com/review/rw5078250",
      "warningSpoilers": false,
      "date": "24 August 2019",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Still Holds Up",
      "content": "I don't think I was of the right age to appreciate Monty Python and the Holy Grail when I first watched it. It takes a certain kind of mindset to be ready for the extravagant humor that these guys bring, and boy was I ready this time for Life of Brian. Insane, irreverent, and offensive humor are just sprinkles on top of this wonderfully ridiculous adventure comedy. Heck, this is a spoof of a biblical film with a spaceship that pops in for about 30 seconds, a stoning scene that just keeps getting funnier and funnier, and a joke about male genitalia that somehow holds up 40 something years later. This is one of the funniest films of all time.9.5/10"
    },
    {
      "username": "zac-04879",
      "userUrl": "https://www.imdb.com/user/ur132809519",
      "reviewLink": "https://www.imdb.com/review/rw7977675",
      "warningSpoilers": false,
      "date": "17 March 2022",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "...Hahaha... What?...",
      "content": "Nobody's gonna doubt that this religious satire will slap controversy across the face with its blasphemy, but for while it's not cancelled, Monty Python's Life of Brian is absolutely hilarious. Alike how you can say violent, psychological or deep-rooted thriller kinds of movies are not for the faint-hearted, you can undoubtedly say this laughably offensive comedy is not for the highly religious audiences.Life of Brian is a total parody; the three wise men who originally visit to praise Jesus, instead end up confusingly approaching the stable next to Jesus to praise Brian Cohen, who ends up being falsely believed of being the Messiah. Just from the film's premise, you can guess it's going to offend people who are strong in religion, and you'd be correct. This movie is absolutely nuts.The date is depicted in an absolutely ridiculous fashion; the people use many profanities and are just stupid! Like a spoof comedy, the absolute insanity is what would never happen in real life, which makes it a comedy that entertains and keeps us appealed just with its humour. Again, it's offensive and will cause controversy, but nearly every scene is wackily memorable.If you liked this review, check out the full review and other reviews at aussieboyreviews."
    },
    {
      "username": "JerBear-2",
      "userUrl": "https://www.imdb.com/user/ur0140203",
      "reviewLink": "https://www.imdb.com/review/rw0168636",
      "warningSpoilers": false,
      "date": "30 May 1999",
      "rate": "10",
      "helpful": "111 out of 177 found this helpful.",
      "title": "One of the top 10 of all time",
      "content": "True, my tastes are eclectic. This movie is so incredibly clever and thought provoking that it's not surprising that it raised so many hackles. Plus, it's as fast paced and funny as a Marx Brothers movie without the musical breaks. You can watch it 20 times and you'll still sing at the end. Undoubtedly one of the top 10!!"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3482388",
      "warningSpoilers": true,
      "date": "5 June 2016",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "He's not the Messiah; he's a very naughty boy!",
      "content": "Brian is an ordinary Judean who just happened to be born at the same time as Christ (leading to some confusion among the wise men). He grows up with a dislike of the Roman occupiers and falls in with a terrorist group known as the Judean People's Front. It isn't long before this gets him into trouble with the Romans and they plan to crucify him. He manages to escape, with the help of a passing spaceship, but soon has other problems. After posing as a street side preacher he picks up a group of followers who believe that he is the Messiah!These days it is hard to see why this film was considered controversial; it is clear from the opening scene that Brian is not Jesus under another name. It is however very funny; a series of hilarious and eminently quotable scenes that combine to make a great film. The Monty Python team are on top form, each of them playing a number of roles. Graham Chapman stands out as he plays the eponymous Brian; an ordinary man caught up in extraordinary events. The jokes are all pretty funny but if one doesn't particularly amuse you another will be along shortly. The film feels fresh and relevant today; in fact some of the satire could have easily have been written in the present day as we see rebel groups who hate each other more than their official enemy and people are executed for supposed blasphemy where the accusers won't repeat what was allegedly said as they would be considered blasphemous too. If you are a fan of laugh out loud comedy then this film is a must it is hilarious from start to finish."
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw1790842",
      "warningSpoilers": false,
      "date": "31 December 2007",
      "rate": "6",
      "helpful": "47 out of 101 found this helpful.",
      "title": "Don't crucify me, but I don't think it's that great.",
      "content": "What I am about to write might upset some people. Hell, many comedy fans would even say that I was being blasphemous, but here goes...Life Of Brian isn't THAT funny!There, I've said iteven after multiple viewings, I still find the Life of Brian, Monty Python's tale of an ordinary man who is mistaken for the Messiah, to be rather disappointing as far as belly laughs are concerned.Sure, it's a very quotable film, the sets and cinematography look great, and it certainly has a lot of valid things to say about the stupidity of religion and it's followers (who are, let's face it, often pretty stupid!), but I honestly feel that much of the movie's comedy just doesn't work, and actually feels rather laboured. I mean, is a speech impediment really THAT hilarious?I'm not saying that I am not amused by any of the Python's silliness: there are definitely laughs to be had, particularly at some of the more absurd moments (after all, who can keep a straight face at the phrase 'wolf's nipples'?), but, with the complete adoration that Life of Brian receives from it's fans (particularly from students), anyone would think it was the second coming.5.5 out of 10, rounded up to 6 for IMDb."
    },
    {
      "username": "riggo-73503",
      "userUrl": "https://www.imdb.com/user/ur64376466",
      "reviewLink": "https://www.imdb.com/review/rw5867817",
      "warningSpoilers": false,
      "date": "29 June 2020",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Brilliant even years later",
      "content": "Funny in a time where you could be funny... a lament to good ol daysBest monty film because the ending is better than the grail"
    },
    {
      "username": "ptpenry",
      "userUrl": "https://www.imdb.com/user/ur1595093",
      "reviewLink": "https://www.imdb.com/review/rw0168717",
      "warningSpoilers": false,
      "date": "11 February 2002",
      "rate": "10",
      "helpful": "212 out of 281 found this helpful.",
      "title": "Stunningly funny",
      "content": "One of my fave films of all time, this film has so many laugh-out-loud jokes and ridiculous thought processes that it would probably be unfair to pick out just a few. Tough - I'm going to: John Cleese as the legionnary Latin teacher rebuking Brian not for daring to use graffiti on the Roman fort but for using the wrong tense, Michael Palin trying to find his place in life as an ex-leper, Terry Jones as Brian's mother trying to protect him from myrrh - let's face it, we've all wondered what myrrh is ! The bit that always makes me laugh without fail is something that isn't always noticed - when Michael Palin is having a go at the guards; \"Do you find it risible when I say the name of my friend Biggus Diccus ?\" if you look carefully you'll see that Palin is trying really hard not to laugh.Puerile, silly but also very very clever. This film doesn't criticise religion or Jesus in any way ( what was wrong with the people who tried to ban it ? ) - it's just asking what it could have been like in a society that was expecting the Messiah to show up at any moment, and covering it in a massive coating of comedy.This film is an absolute classic - 10 out of 10."
    },
    {
      "username": "TheAll-SeeingI",
      "userUrl": "https://www.imdb.com/user/ur56946300",
      "reviewLink": "https://www.imdb.com/review/rw5314850",
      "warningSpoilers": false,
      "date": "11 December 2019",
      "rate": "10",
      "helpful": "9 out of 13 found this helpful.",
      "title": "A Massive Achievement in Satire",
      "content": "Because it so loudly cuts against the trappings of today's \"cancel culture,\" 1979's \"Monty Python's Life of Brian\" arguably now stands as the comedy troupe's most distinguished masterpiece. Filmed in Tunisia while repurposing sets from \"Jesus of Nazareth (1977),\" this film is perched among the top branches of our very greatest satires. There's no doubt its brilliant fingerprints are all over more modern day parodies and spoofs, from the culturally eviscerating \"South Park: Bigger, Longer & Uncut (1999),\" to fellow religious farce \"Sausage Party (2016),\" to recent and raunch-heavy music industry satire \"Stadium Anthems (2018).\"And the film almost didn't happen. Beatle George Harrison had to dole out millions to save it after the studio pulled out over fears of backlash. Good on ya, George, because what resulted is nothing short of a landmark achievement in comedy. While \"Life of Brian\" has all the elite DNA of typical Python, it elevates beyond its siblings with an ending for the ages, as the crucifixion itself is repurposed as musical comedy of gleefully poor taste. A choir of convicts nailed into wooden slabs breaks out in song with \"Always Look On The Bright Side of Life,\" cementing the scene as a culturally understood reference point throughout Britain, and in much the same way that \"this goes to eleven\" from \"This Is Spinal Tap (1984)\" is established nomenclature in the States.Sadly, this movie couldn't be made today, as the use of superficially insensitive comedic material to lambaste ignorance has somehow become verboten. What a shame, that. Fortunately, \"Monty Python's Life of Brian\" wasn't a stage production, and instead remains immortalized on film for the weathering of all shifts in the cultural winds. - (Was this review of use to you? If so, let me know by clicking \"Helpful.\" Cheers!) - WATCHED IT? THEN WATCHLIST: \"Sausage Party (2016),\" \"Stadium Anthems (2018),\" \"South Park: Bigger, Longer & Uncut (1999)\""
    },
    {
      "username": "pstancer",
      "userUrl": "https://www.imdb.com/user/ur1857515",
      "reviewLink": "https://www.imdb.com/review/rw0998867",
      "warningSpoilers": false,
      "date": "14 January 2005",
      "rate": "10",
      "helpful": "125 out of 186 found this helpful.",
      "title": "Classic seamless comedy.",
      "content": "This film is by far the best of the Python outings. It ranks as one of my favorite films of all time, which unlike 'The Holy Grail', hasn't dated with time but improves with repeated viewing.The Pythons supposed take on Christianity, which caused outrage when it was first released (mostly by people who hadn't seen it), is actually a take on cults, both religious and political, and the people who follow them.Brian, our hapless hero, is confused, horny, and constantly mistaken for the Messiah; who just happened to be born in the manger next to him. Brian just wants to be left alone, and to pursue his love for Judith, a member of the People's Front of Judea. Judith just wants the Romans to go home; but only after they've left the sanitation, the medicine, education, irrigation, roads, public order, etc., etc. ... oh and don't forget the wine! Will Brian's love for Judith go unrequited? Will only the cheese makers be blessed, or does this refer to all manufacturers of dairy products? And just what have the Romans ever done for us? It's subtle; it's anarchic; and it's possibly still banned in Norway. This is classic seamless comedy at its best. 10/10."
    },
    {
      "username": "VikingBurialService",
      "userUrl": "https://www.imdb.com/user/ur149675499",
      "reviewLink": "https://www.imdb.com/review/rw7881507",
      "warningSpoilers": true,
      "date": "20 February 2022",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Fantastic Surreal Comedy",
      "content": "Fantastic; IMO better than the Holy Grail. Just like that movie most of the comedy is based on surreal circumstances and irrational behavior, and they way the present it and act unexpectedly is what causes the laughs. This movie seemed to hove more of a complete plot than Holy Grail did. There's no cut-off ending, and they call back to old elements in a more natural way. Overall, top tier comedy movie."
    }
  ],
  "errorMessage": ""
}