{
  "imDbId": "tt1049413",
  "title": "Up",
  "fullTitle": "Up (2009)",
  "type": "Movie",
  "year": "2009",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Michael Rechtshaffen",
      "link": "",
      "rate": "100",
      "content": "Winsome, touching and arguably the funniest Pixar effort ever, the gorgeously rendered, high-flying adventure is a tidy 90-minute distillation of all the signature touches that came before it."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "100",
      "content": "A captivating odd-couple adventure that becomes funnier and more exciting as it flies along."
    },
    {
      "publisher": "Village Voice",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The first 10 minutes of Up are flawless; the final 80 minutes, close enough. (Though, note this: Do not see Up in 3-D. It's inessential to the tale and altogether distracting.)"
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "https://ew.com/article/2009/05/27/up-8/",
      "rate": "100",
      "content": "A lovely, thoughtful, and yes, uplifting adventure."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "100",
      "content": "Extending the patented Pixar mix of humor and heart, Up is the studio's most deeply emotional and affecting work."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "This is another masterwork from Pixar, which is leading the charge in modern animation."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/56929/",
      "rate": "90",
      "content": "By all means, see Up in its 3-D incarnation: The cliff drops are vertiginous, and the scores of balloons--bunched into the shape of one giant balloon--are as pluckable as grapes."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "Scott Foundas",
      "link": "",
      "rate": "90",
      "content": "Up emerges as a gentle hymn to adventure of both the soaring, storybook variety and the smaller, less obvious kind -- the perilous, unpredictable and richly rewarding journey of ordinary, everyday life."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/2009-05-29/up/",
      "rate": "89",
      "content": "We will be comparing Up with classics like \"The Wizard of Oz\" for years to come."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/up",
      "rate": "75",
      "content": "Up is not as transcendent as last year's \"WALL-E,\" and doesn't rank near the top of Pixar's pantheon of great features, but it's a solid (and in some ways innovative) fantasy adventure that mixes comedy, action, and drama into a satisfying whole."
    }
  ],
  "errorMessage": ""
}