{
  "imDbId": "tt1049413",
  "title": "Up",
  "fullTitle": "Up (2009)",
  "type": "Movie",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Up (2009 film)",
  "url": "https://en.wikipedia.org/wiki/Up_(2009_film)",
  "plotShort": {
    "plainText": "Up is a 2009 American computer-animated film produced by Pixar Animation Studios and released by Walt Disney Pictures. The film was directed by Pete Docter, co-directed by Bob Peterson (in his feature directorial debut), and produced by Jonas Rivera. Docter and Peterson also wrote the film's screenplay and story, with Tom McCarthy co-writing the latter. The film stars the voices of Ed Asner, Christopher Plummer, Jordan Nagai, and Bob Peterson. The film centers on Carl Fredricksen (Asner), an elderly widower who travels to South America with wilderness explorer Russell (Nagai) in order to fulfill a promise that Carl made to his late wife Ellie. Along the way, they meet a talking dog named Dug (Peterson) and encounter a giant bird named Kevin, who is being hunted by the explorer Charles Muntz (Plummer), whom Carl had idolized in childhood.\r\nOriginally titled Heliums, Docter conceived the outline for Up in 2004 based on fantasies of escaping from life when it became too irritating. He and eleven other Pixar artists spent three days in Venezuela for research and inspiration. The designs of the characters were caricatured and stylized considerably, and animators were challenged with creating realistic cloth. Composer Michael Giacchino composed the film's score. It was Pixar's first film to be presented in 3D format.\r\nUp debuted at the 62nd Cannes Film Festival on May 13, 2009, and was released in the United States on May 29. The film received critical acclaim for its screenplay, animation, characters, themes, narrative, humor, Asner's vocal performance, Giacchino's musical score, and the opening sequence. Organizations like the National Board of Review and American Film Institute named Up as one of the top ten films of 2009. It earned $735.1 million worldwide, finishing its theatrical run as the sixth-highest-grossing film of 2009. Up was nominated for five awards at the 82nd Academy Awards, winning two, and received numerous other accolades. Among these, it became the second animated film in history to receive a nomination for the Academy Award for Best Picture, ultimately losing to The Hurt Locker. A short-form series, Dug Days, premiered on Disney+ on September 1, 2021.",
    "html": "<p>Up is a 2009 American computer-animated film produced by Pixar Animation Studios and released by Walt Disney Pictures. The film was directed by Pete Docter, co-directed by Bob Peterson (in his feature directorial debut), and produced by Jonas Rivera. Docter and Peterson also wrote the film's screenplay and story, with Tom McCarthy co-writing the latter. The film stars the voices of Ed Asner, Christopher Plummer, Jordan Nagai, and Bob Peterson. The film centers on Carl Fredricksen (Asner), an elderly widower who travels to South America with wilderness explorer Russell (Nagai) in order to fulfill a promise that Carl made to his late wife Ellie. Along the way, they meet a talking dog named Dug (Peterson) and encounter a giant bird named Kevin, who is being hunted by the explorer Charles Muntz (Plummer), whom Carl had idolized in childhood.</p><p>Originally titled Heliums, Docter conceived the outline for Up in 2004 based on fantasies of escaping from life when it became too irritating. He and eleven other Pixar artists spent three days in Venezuela for research and inspiration. The designs of the characters were caricatured and stylized considerably, and animators were challenged with creating realistic cloth. Composer Michael Giacchino composed the film's score. It was Pixar's first film to be presented in 3D format.</p><p>Up debuted at the 62nd Cannes Film Festival on May 13, 2009, and was released in the United States on May 29. The film received critical acclaim for its screenplay, animation, characters, themes, narrative, humor, Asner's vocal performance, Giacchino's musical score, and the opening sequence. Organizations like the National Board of Review and American Film Institute named Up as one of the top ten films of 2009. It earned $735.1 million worldwide, finishing its theatrical run as the sixth-highest-grossing film of 2009. Up was nominated for five awards at the 82nd Academy Awards, winning two, and received numerous other accolades. Among these, it became the second animated film in history to receive a nomination for the Academy Award for Best Picture, ultimately losing to The Hurt Locker. A short-form series, Dug Days, premiered on Disney+ on September 1, 2021.</p>"
  },
  "plotFull": {
    "plainText": "Up is a 2009 American computer-animated film produced by Pixar Animation Studios and released by Walt Disney Pictures. The film was directed by Pete Docter, co-directed by Bob Peterson (in his feature directorial debut), and produced by Jonas Rivera. Docter and Peterson also wrote the film's screenplay and story, with Tom McCarthy co-writing the latter. The film stars the voices of Ed Asner, Christopher Plummer, Jordan Nagai, and Bob Peterson. The film centers on Carl Fredricksen (Asner), an elderly widower who travels to South America with wilderness explorer Russell (Nagai) in order to fulfill a promise that Carl made to his late wife Ellie. Along the way, they meet a talking dog named Dug (Peterson) and encounter a giant bird named Kevin, who is being hunted by the explorer Charles Muntz (Plummer), whom Carl had idolized in childhood.\r\nOriginally titled Heliums, Docter conceived the outline for Up in 2004 based on fantasies of escaping from life when it became too irritating. He and eleven other Pixar artists spent three days in Venezuela for research and inspiration. The designs of the characters were caricatured and stylized considerably, and animators were challenged with creating realistic cloth. Composer Michael Giacchino composed the film's score. It was Pixar's first film to be presented in 3D format.\r\nUp debuted at the 62nd Cannes Film Festival on May 13, 2009, and was released in the United States on May 29. The film received critical acclaim for its screenplay, animation, characters, themes, narrative, humor, Asner's vocal performance, Giacchino's musical score, and the opening sequence. Organizations like the National Board of Review and American Film Institute named Up as one of the top ten films of 2009. It earned $735.1 million worldwide, finishing its theatrical run as the sixth-highest-grossing film of 2009. Up was nominated for five awards at the 82nd Academy Awards, winning two, and received numerous other accolades. Among these, it became the second animated film in history to receive a nomination for the Academy Award for Best Picture, ultimately losing to The Hurt Locker. A short-form series, Dug Days, premiered on Disney+ on September 1, 2021.\r\nPlot\r\nAs a young boy, 10-year-old Carl Fredricksen idolizes explorer Charles Muntz. After he is accused of presenting a fake giant bird skeleton from Paradise Falls in South America, Muntz returns to the falls intent on clearing his name by capturing a living specimen. Carl meets fellow Muntz fan Ellie, who confides her desire to move her \"clubhouse\" — an abandoned house in the neighborhood — to a cliff overlooking Paradise Falls. The two later marry and live in the rebuilt house, with Carl working as a balloon salesman and Ellie a tour guide at the zoo. Ellie suffers a miscarriage, and the couple decide to refocus and begin saving for a trip to Paradise Falls. However, they are constantly forced to spend their savings on more urgent needs. Years pass and Carl decides to arrange the trip as a surprise for Ellie. On the day that Carl plans to tell Ellie, she falls ill and is hospitalized, dying soon after.\r\nSome time later, Carl, now retired and in his late 70s, stubbornly holds out in the house while the neighborhood around him is replaced by skyscrapers. After Carl injures a construction worker during a mishap, the court deems him a public menace, ordering his relocation to an assisted living facility. However, Carl resolves to keep Ellie's promise, turning his house into a makeshift airship using helium balloons and flying to Paradise Falls. Russell, an eight-year-old \"Wilderness Explorer\" who keeps visiting Carl in an effort to earn his final merit badge for assisting the elderly, becomes an accidental stowaway. Before Carl can land and send Russell home, they encounter a storm that propels the house to South America.\r\nThe house lands on a mesa opposite Paradise Falls. Carl and Russell harness themselves to the still-buoyant house and begin to walk it across the mesa, hoping to reach the falls before the balloons deflate. Russell encounters a giant, colorful flightless bird, whom he names Kevin. They then meet Dug, a Golden Retriever who wears a special collar with a device that translates his thoughts into English; he joins them on their trek despite Carl's objections.\r\nA pack of fierce dogs wearing the collars take Carl, Russell, and Dug to their master, the now elderly Charles Muntz. He invites them aboard his dirigible the Spirit of Adventure and talks about his hunt for the bird. Carl realizes Muntz's obsession with catching the bird has driven him mad, to the point of killing innocent travelers whom he suspected of seeking the bird for themselves. When Russell notes the skeleton's resemblance to Kevin, Muntz sees them as thieves and becomes hostile. The dogs pursue Carl, Russell, and Dug until Kevin saves them. One of the pursuing dogs bites Kevin's leg as she flees, injuring her to the point where she can't stand on her own. They reach safety from the dogs. Russell urges Carl to help Kevin get home and reunite her with her chicks, and he agrees, but then Muntz (who tracks the group down through Dug's collar) captures her. He starts a fire beneath Carl's house, forcing him to choose whether to rescue it or Kevin; Carl chooses his home.\r\nAt the falls, Carl looks through Ellie's childhood scrapbook and discovers that she filled in the blank pages with photos of their marriage, accompanying a note written from her hospital bed, thanking him for the \"adventure\" and encouraging him to have a new one. Reinvigorated, he goes outside, only to see Russell set out after Kevin using a leaf blower and some balloons to fly. Carl lightens his house by throwing out furniture and keepsakes, allowing it to fly again. Muntz captures Russell, but Carl and Dug board the dirigible and free both him and Kevin. When Muntz pursues them to the tethered house, Carl lures Kevin back to the airship using a piece of chocolate. Muntz leaps after them, but his leg catches on balloon strings, and he falls to his death. The house descends out of sight, at which point Carl decides to let it go and live on the dirigible with Russell and the pack of dogs.\r\nCarl and Russell reunite Kevin with her chicks before returning home in Muntz's airship. Russell receives his \"Assisting the Elderly\" badge, and Carl presents Russell with a grape soda bottle cap that Ellie gave to Carl when they first met, which he now dubs \"The Ellie Badge\". Meanwhile, unbeknownst to Carl, the house lands on the cliff beside Paradise Falls, fulfilling his promise to Ellie.\r\nVoice cast\r\nEd Asner as Carl Fredricksen, an elderly widower and retired balloon salesman. Docter and Rivera noted Asner's television alter ego, Lou Grant, had been helpful in writing for Carl because it guided them in balancing likable and unlikable aspects of the curmudgeonly character. The appearance of Carl was designed to resemble Spencer Tracy as he appeared in his final film, Guess Who's Coming to Dinner. When they met Asner and presented him with a model of his character, he joked, \"I don't look anything like that.\" They tailored his dialogue for him, with short sentences and more consonants, which \"cemented the notion that Carl, post-Ellie, is a disgruntled bear that's been poked awake during hibernation\".\r\nJordan Nagai as Russell, an eight-year-old \"Wilderness Explorer\". Throughout most of the film, he makes several comments to Carl that suggest that Russell's father and mother are separated or divorced.\r\nChristopher Plummer as Charles Muntz, an elderly explorer and Carl's childhood idol, whose long search for the \"Monster of Paradise Falls\" has driven him murderously insane. The name of his airship, the Spirit of Adventure, may have been inspired by Charles Lindbergh's airplane, Spirit of St. Louis. In various interviews, Pete Docter has mentioned Howard Hughes and real-life adventurers Charles Lindbergh and Percy Fawcett as inspirations for Muntz. Reviewers have noted his resemblance to Kirk Douglas.\r\nBob Peterson as Dug, a talking Golden Retriever. Peterson knew he would voice Dug when he wrote his line \"I have just met you, and I love you.\", which was based on what a child told him when he was a camp counselor in the 1980s. The DVD release of the film features a short called Dug's Special Mission, which follows Dug just before his first meeting with Carl and Russell. Dug previously appeared in Ratatouille as a shadow on a wall that barks at Remy.\r\nAdditionally, Up features Delroy Lindo, Jerome Ranft, and Peterson as Muntz's dogs Beta, Gamma, and Alpha, respectively. John Ratzenberger played construction foreman Tom, and David Kaye the newsreel announcer. Pete Docter's daughter Elie and Jeremy Leary voiced younger versions of Ellie and Carl, respectively. Other cast members include Mickie T. McGowan as police officer Edith, Danny Mann as construction worker Steve, Don Fullilove and Jess Harnell as Shady Oaks nurses George and A.J., Josh Cooley as Muntz's dog Omega, and Docter as campmaster Strauch.\r\nProduction\r\nDevelopment\r\nOriginally titled Heliums, Up was conceived in 2004 by director Pete Docter. He developed the fantasy of a flying house on the idea of escaping from life when it becomes too irritating, which stemmed from his difficulty with social situations growing up. When Bob Peterson had to leave the project for three months to work on Ratatouille as a co-director which had been struggling with story problems, actor and writer Tom McCarthy stepped in to work with Docter on the story while Peterson was gone, and came up with the character Russell. Docter selected an old man for the main character after drawing a picture of a grumpy old man with smiling balloons. The two men thought an old man was a good idea for a protagonist because they felt their experiences and the way they affect their view of the world was a rich source of humor. Docter was not concerned about an elderly protagonist, stating that children would relate to Carl the way they relate to their grandparents.\r\nEarly concepts differed from the final film. The initial version featured a floating city on an alien planet populated with muppet-like creatures, with two brothers vying to inherit their father's kingdom, and when the brothers fell to Earth, they encountered a tall bird who helped them understand each other. But the story just didn't seem to work properly, and Docter and Peterson realized that the most intriguing element was the isolation of the floating city. Yet the people living there would consist of a whole community, and were therefore not really isolated. So the whole city was stripped down to a single flying house with just a single occupant, where balloons replaced the magic which kept the floating city up. After that they got the idea to use an old person, and found the contrast between the elderly grumpy man and the happy balloons in Docter's drawing appealing, inspiring them to work out his backstory. The next concept introduced many of the elements that eventually made their way into the film, but had Carl and Russell landing the house on a Soviet-era spy airship camouflaged as a giant cloud rather than on a tepui. This concept was rewritten due to its similarity to another idea Pixar was developing. Another idea Docter added, then removed, was magic fountain-of-youth eggs laid by the bird, in order to explain the age discrepancy between Muntz and Carl, but they decided this subplot was too distracting, and people would forgive the minor inconsistency. Also, the biggest single influence on Up early on was The Station Agent, by Tom McCarthy.\r\nDocter noted the film reflects his friendships with Disney veterans Frank Thomas, Ollie Johnston, and Joe Grant (who all died before the film's release and thus the film was dedicated to them). Grant gave the script his approval as well as some advice before his death in 2005. Docter recalled Grant would remind him the audience needed an \"emotional bedrock\" because of how wacky the adventure would become; here it is Carl mourning for his wife. Docter felt Grant's personality influenced Carl's deceased wife Ellie more than the grouchy main character, and Carl was primarily based on Spencer Tracy, Walter Matthau, James Whitmore, and their own grandparents, because there was \"something sweet about these grumpy old guys\". Docter and Jonas Rivera noted Carl's charming nature in spite of his grumpiness derives from the elderly \"hav this charm and almost this 'old man license' to say things that other people couldn't get away with ... It's like how we would go to eat with Joe Grant and he would call the waitresses 'honey'. I wish I could call a waitress 'honey'.\"\r\nDocter revealed the filmmakers' first story outline had Carl \"just want to join his wife up in the sky. It was almost a kind of strange suicide mission or something. And obviously that's. Once he gets airborne, then what? So we had to have some goal for him to achieve that he had not yet gotten.\" As a result, they added the plot of going to South America. The location was chosen due to both Docter's love of tropical locations, but also in wanting a location Carl could be stuck with a kid due to the inability to leave him with an authority such as a police officer or social worker. They implemented a child character as a way to help Carl stop being \"stuck in his ways\".\r\nDug was created by Docter and Peterson for a different project that never materialized, and brought him over to Up. Docter felt it would be refreshing to show what a dog thinks, rather than what people assume it thinks. Knowledge of canine communication, body language and pack behaviors for the artists and animators to portray such thoughts came from consultant Dr. Ian Dunbar, veterinarian, dog behaviorist, and trainer. The idea for Alpha's voice derived from thinking about what would happen if someone broke a record player and it always played at a high pitch. The talking dog collars were invented to give Carl someone to talk with in the absence of human companions as Dug and Kevin were added to the story at an earlier stage than Russell. The presence of Russell, as well as that of the construction workers, helped make the story feel less \"episodic\".\r\nDocter auditioned 400 boys in a nationwide casting call for the part of Russell. Nagai, who is Japanese American, showed up to an audition with his brother, who was actually the one auditioning. Docter realized Nagai behaved and spoke non-stop like Russell and chose him for the part. Nagai was eight years old when cast. Docter encouraged Nagai to act physically as well as vocally when recording the role, lifting him upside down and tickling him for the scene where Russell encounters Kevin. East Asian Americans have positively noted Pixar's first casting of an East Asian lead character, in contrast to the common practice of casting non-East Asians in East Asian parts, particularly in the role of an \"all-American\" boy without any stereotypes typically seen with East Asian characters, such as martial arts.\r\nCarl's relationship with Russell reflects how \"he's not really ready for the whirlwind that a kid is, as few of us are\". Docter added he saw Up as a \"coming of age\" tale and an \"unfinished love story\", with Carl still dealing with the loss of his wife. He cited inspiration from Casablanca and A Christmas Carol, which are both \"resurrection\" stories about men who lose something, and regain purpose during their journey. Docter and Rivera cited inspirations from the Muppets, Hayao Miyazaki, Dumbo, and Peter Pan. They also saw parallels to The Wizard of Oz and tried to make Up not feel too similar. There is a scene where Carl and Russell haul the floating house through the jungle. A Pixar employee compared the scene to Fitzcarraldo, and Docter watched that film and The Mission for further inspiration.\r\nCharles Muntz comes from Howard Hughes and Errol Flynn. In the DVD extra \"The Many Endings of Muntz\", Docter and his team talked about their struggle to figure out the character's ultimate fate. They considered having him redeem himself or survive unrepentant, but eventually decided that, \"as almost a representation of Carl's old self, Muntz has to die.\"\r\nOverall, the budget was approximately $175 million.\r\nAnimation\r\nDocter made Venezuela the film's setting after Ralph Eggleston gave him a video of the tepui mountains of Canaima National Park; tepuis were previously featured in another Disney film, Dinosaur. In 2004, Docter and eleven other Pixar artists spent three days reaching Monte Roraima by airplane, by jeep, and by helicopter. They also spent three nights there painting and sketching, and encountering ants, mosquitoes, scorpions, frogs, and snakes. They then flew to Matawi Tepui and climbed to Angel Falls. Docter felt \"we couldn't use. Reality is so far out, if we put it in the movie you wouldn't believe it.\" The film's creatures were also challenging to design because they had to fit in the surreal environment of the tepuis, but also they had to be realistic because those mountains exist in real life. The filmmakers then visited the Sacramento Zoo to observe a Himalayan monal for Kevin's animation. The animators designed Russell as an Asian-American, and modeled Russell after similar looking Peter Sohn, a Pixar storyboard artist who is Korean-American. The Pixar employees frequently sketch each other during meetings, and a drawing of Sohn became the model for Russell.\r\nWhile the studio usually designs their characters to be caricatured, Carl was even more so, being only at least three heads high. He was not given elderly features such as liver spots or hair in his ears to keep him appealing, yet giving him wrinkles, pockmarks on his nose, a hearing aid, and a cane to make him appear elderly. Docter wanted to push a stylized feel, particularly the way Carl's head is proportioned: he has a squarish appearance to symbolize his containment within his house, while Russell is rounded like a balloon. The challenge on Up was making these stylized characters feel natural, although Docter remarked the effect came across better than animating the realistic humans from Toy Story, who suffered from the \"uncanny valley\". Cartoonists Al Hirschfeld, Hank Ketcham, and George Booth influenced the human designs. Simulating realistic cloth on caricatured humans was harder than creating the 10,000 balloons flying the house. New programs were made to simulate the cloth and for Kevin's iridescent feathers. To animate old people, Pixar animators would study their own parents or grandparents and also watched footage of the Senior Olympics. The directors had various rules for Carl's movements: he could not turn his head more than 15–20 degrees without turning his torso as well, nor could he raise his arms high. However, they also wanted him to grow more flexible near the end of the film, transforming into an \"action hero\".\r\nA technical director calculated that to make Carl's house fly, he would require 23 million balloons, but Docter realized that such a high number made the balloons look like small dots. Instead, the balloons created were made to be twice Carl's size. There are 10,297 balloons for shots of the house just flying, 20,622 balloons for the lift-off sequence, and a varying number in other scenes.\r\nMusic\r\nUp is the third Pixar film to be scored by Michael Giacchino, after The Incredibles and Ratatouille. What Pete Docter wanted most importantly out of the music was the emotion, so Giacchino wrote a character theme-based score that producer Jonas Rivera thought enhanced the story. At the beginning of the movie, when young Carl is in the movie theater watching a newsreel about Muntz, the first piece of music heard is \"Muntz's Theme\", which starts out as a celebratory theme, and echoes through the film when Muntz reappears 70 years later. \"Ellie's Theme\" is first heard when she is introduced as a little kid and plays several times during the film in different versions; for instance, during the sequence where Carl lifts his house with the balloons, the theme is changed from a simple piano melody to a full orchestral arrangement. Giacchino has compared the film to opera since each character has a unique theme that changes during a particular moment in the story.\r\nThe score was released as a digital download on May 26, 2009, three days before the film opened in theaters. It won the Academy Award for Best Original Score, the Grammy Award for Best Score Soundtrack Album, the Golden Globe Award for Best Original Score, and the 2010 BAFTA Award for Best Film Music. It is the first score for a Pixar film to win the Oscar (Randy Newman also won for Monsters, Inc. and Toy Story 3, but in the category of Best Original Song).\r\nRelease\r\nThe 96-minute Up debuted at the 62nd Cannes Film Festival on May 13, 2009, the first animated film to do so, followed by a premiere on May 16, at the El Capitan Theatre in Los Angeles. Up was originally scheduled for general release on June 12, but it was moved up to May 29. The film was also released in 3D format, a first for a Pixar film. Despite Pixar's track record, Target Corporation and Walmart stocked few Up items, while its regular collaborator Thinkway Toys did not produce merchandise, claiming the film's story was unusual and would be hard to promote. Disney acknowledged not every Pixar film would have to become a franchise. In Colombia, unexpected publicity for the film was generated due to the uncanny similarity of Carl with Colombian ex-president Julio César Turbay Ayala. Docter intended for audiences to take a specific point from the film, saying:\r\nBasically, the message of the film is that the real adventure of life is the relationship we have with other people, and it's so easy to lose sight of the things we have and the people that are around us until they are gone. More often than not, I don't really realize how lucky I was to have known someone until they're either moved or passed away. So, if you can kind of wake up a little bit and go, \"Wow, I've got some really cool stuff around me every day\", then that's what the movie's about.\r\nWalt Disney Studios Home Entertainment released Up on Blu-ray and DVD on November 10, 2009. Physical copies contain two short films Partly Cloudy and Dug's Special Mission, audio commentary, a documentary Adventure is Out There, an unseen and alternate take The Many Endings of Muntz, and a digital copy. Blu-ray bonus features exclusively include a Cine-Explore, Global Guardian Badge and Geography games, and eight documentaries. On iTunes, it was later accompanied by a short film as an extra, George and A.J., which was also released on YouTube. In 2020, Up was released on 4K Ultra HD Blu-ray.\r\nReception\r\nBox office\r\nUp earned $293 million in the United States and Canada and $442.1 million in other countries, for a worldwide total of $735.1 million. It was the sixth-highest-grossing film of 2009.\r\nIn the United States and Canada, exit polling showed extensive family attraction across a variety of audiences; 53% were female and 57% were under 17. The film was released with Drag Me to Hell on May 29, 2009. Up earned $21.4 million on its first day. The film debuted earning $68.2 million from 3,766 theaters (1,530 in 3D). It would hold the record for having the highest opening weekend for a 3D film until it was surpassed by James Cameron's Avatar later that year. Its earnings dropped by 37 percent to $44.3 million the second weekend, and another 31% to $30.5 million the third weekend; this was the slowest decline for a Pixar animated film since Finding Nemo. Up completed its theatrical run in the United States and Canada on December 5, 2009.\r\nCritical response\r\nUp has an approval rating of 98% based on 298 professional reviews on the review aggregator website Rotten Tomatoes, with an average rating of 8.7/10. Its critical consensus reads, \"An exciting, funny, and poignant adventure, Up offers an impeccably crafted story told with wit and arranged with depth, as well as yet another visual Pixar treat.\" Metacritic (which uses a weighted average) assigned Up a score of 88 out of 100 based on 37 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale.\r\nFilm critic Roger Ebert gave the film four out of four stars and called it \"a wonderful film\". The Hollywood Reporter lauded the film as \"Winsome, touching and arguably the funniest Pixar effort ever, this gorgeously rendered, high-flying adventure is a tidy 90-minute distillation of all the signature touches that came before it.\" Although the San Francisco Chronicle noted that the film \"contains many boring stretches of mindless freneticism and bland character interaction,\" it also declared that there are scenes in Up of \"such beauty, economy and poetic wisdom that they belong in any anthology of great movie moments ... to watch Up with any attention is to be moved and astonished by the economy with which specific visuals are invested with emotion throughout. ... \" Variety enthused that \"Up is an exceptionally refined picture; unlike so many animated films, it's not all about sensory bombardment and volume ... Unsurprisingly, no one puts a foot wrong here. Vocal performances ... exude a warm enthusiasm, and tech specifications could not be better. Michael Giacchino's full-bodied, traditional score is superlative ...\" The Globe and Mail stated that Up is \"the kind of movie that leaves you asking 'How do people come up with this stuff?'\" along with an overall positive review on the film, despite it being predictable.\r\nThe character of Carl Fredricksen has received mostly positive reception. Bill Capodagli, author of Innovate the Pixar Way, praised Carl for his ability to be a jerk and likable at the same time. Wall Street Journal editor Joe Morgenstern described Carl as gruff, comparing him to Buster Keaton, but adds that this begins to wear thin as the movie progresses. He has been compared with Spencer Tracy, an influence on the character, by The Washington Post editor Ann Hornaday and Empire editor Ian Freer, who describes him as similar to a \"Guess Who's Coming to Dinner-era\" Tracy. Entertainment Weekly editor Lisa Schwarzbaum described his appearance as a cross between Tracy and an eccentric out of a George Booth cartoon. Time editor Richard Corliss also makes the comparison, calling him a \"trash compacted version\" of Tracy. He has also been compared to Walter Matthau, another inspiration for the character's design, by LA Weekly editor Scott Foundas, suggesting that actor Ed Asner was channeling him while performing the role of Carl. Variety editor Todd McCarthy described Carl as a combination of both Tracy and Matthau.\r\nThe relationship between Carl and his wife Ellie has been praised in several media outlets. In his book Disney, Pixar, and the Hidden Message of Children's Films, author M. Keith Booker described the love between Carl and Ellie as touching. While also describing the scene of the two of them aging as a \"masterpiece of its own kind\", he was not sure how much children would appreciate the scene, commenting that his son was squirming in his seat during the scene. Reelviews editor James Berardinelli praised their relationship, stating that it brought a tear to his eye in a way no animated film has done, including anything by famed anime director Hayao Miyazaki. Ann Hornaday praised the prologue, describing it as \"worthy of Chaplin in its heartbreaking poignancy.\" Chicago Tribune editor Michael Phillips praised the scene, describing it as an emotional and cinematic powerhouse, and that he also was nearly moved to tears. However, Salon editor Stephanie Zacharek criticized the love between Carl and Ellie, describing their marriage as resembling a dental adhesive commercial more than a real relationship.\r\nEdward Asner was praised in several media outlets for his portrayal of Carl. San Francisco Chronicle editor Mick LaSalle praised Asner as a great choice due to having a grumpiness to his voice that is not truly grumpy, but rather coming from a protective stance. Entertainment Weekly editor Lisa Schwarzbaum praised Asner's acting, stating that he has a \"Lou Grant authority\" to his voice. Time editor Richard Corliss stated that Asner had the \"gruffness and deadpan comic timing to bring Carl to life.\" The Boston Globe editor Ty Burr concurred with this, stating that his Lou Grant-like voice had not diminished with time. USA Today editor Claudia Puig praised Asner's delivery, describing it as superb.\r\nThe formulation of Russell as an Asian-American character, along with the casting of an Asian-American in the role was met positively as well. Both Nagai and the film were awarded by the East West Players for the depiction of Russell. EWP lauded Pixar for the creation of the character, stating, \"We are proud to honor a very progressive film company like Pixar who cast an Asian-American character alongside an elderly one to play the leads in a feature film.\" The character is noted as Pixar's first lead Asian character, and was further positively received within the added context of historical non-Asian castings for Asian roles in entertainment. Asian-American organizations and entertainment websites, such as media watchdog Media Action Network for Asian Americans (MANAA), Racebending.com, and Angry Asian Man praised the character and Pixar for its diverse character depictions, noting the general lack of Asian-American lead characters and Asian actors cast in entertainment. In an interview with NPR in 2013, Angry Asian Man's Phil Yu reflected on the character's lack of typical Asian stereotyping, stating, \"You know, he just happens to be Asian and he's, you know, really adorable character. But that kid could've been of any ethnicity but they made the effort to make him Asian—just a little color, you know, and it's really wonderful when that kind of thing happens where they don't have to play that up and make it like a thing or a joke, which happens a lot.\"\r\nUp was included on a number of best-of lists. It appeared on professional rankings from Empire based on retrospective appraisal, as one of the greatest films of the twenty-first century. Several publications have listed it as one of the best animated films, including: Entertainment Weekly (2009), IGN (2010), Time (2011), Insider, USA Today (both 2018), Rolling Stone (2019), Esquire (2020), Parade, Time Out New York, and Empire (all 2021). In December 2021, the film's screenplay was listed number 33 on the Writers Guild of America's \"101 Greatest Screenplays of the 21st Century (So Far)\".\r\nAccolades\r\nAt the 82nd Academy Awards, Up received nominations for Best Picture, Best Original Screenplay, and Best Sound Editing; and won Best Animated Feature and Best Original Score. The film's other nominations include nine Annie Awards (winning two), four British Academy Film Awards (winning two), four Critics' Choice Awards (winning two), and two Golden Globe Awards (winning both). It was named one of the ten best films of 2009 by the National Board of Review (where it also won Best Animated Film) and the American Film Institute.\r\nOther media\r\nIn 2009, an adventure video game, Up, was released for multiple platforms. Kinect Rush: A Disney–Pixar Adventure (2012) features characters and worlds from five of Pixar's films, including Up. In the world-building video game Disney Magic Kingdoms, Carl Fredricksen, Russell, Kevin, Dug, and Charles Muntz appear as playable characters to unlock for a limited time, along with attractions based on Carl's house and Paradise Falls, with the characters involved in new story lines that serve as a continuation of the events of the film.\r\nA streaming microseries of short films following Up, Dug Days, was released on Disney+ on September 1, 2021. It is set some time after the events of the film and focuses on Dug and Carl as they reside in suburbia.\r\nA new short film, Carl's Date, was announced on March 28, 2023. Originally set to be streamed on Disney+, it is set to be released theatrically with the upcoming animated film, Elemental, on June 16, 2023.",
    "html": "<p>Up is a 2009 American computer-animated film produced by Pixar Animation Studios and released by Walt Disney Pictures. The film was directed by Pete Docter, co-directed by Bob Peterson (in his feature directorial debut), and produced by Jonas Rivera. Docter and Peterson also wrote the film's screenplay and story, with Tom McCarthy co-writing the latter. The film stars the voices of Ed Asner, Christopher Plummer, Jordan Nagai, and Bob Peterson. The film centers on Carl Fredricksen (Asner), an elderly widower who travels to South America with wilderness explorer Russell (Nagai) in order to fulfill a promise that Carl made to his late wife Ellie. Along the way, they meet a talking dog named Dug (Peterson) and encounter a giant bird named Kevin, who is being hunted by the explorer Charles Muntz (Plummer), whom Carl had idolized in childhood.</p><p>Originally titled Heliums, Docter conceived the outline for Up in 2004 based on fantasies of escaping from life when it became too irritating. He and eleven other Pixar artists spent three days in Venezuela for research and inspiration. The designs of the characters were caricatured and stylized considerably, and animators were challenged with creating realistic cloth. Composer Michael Giacchino composed the film's score. It was Pixar's first film to be presented in 3D format.</p><p>Up debuted at the 62nd Cannes Film Festival on May 13, 2009, and was released in the United States on May 29. The film received critical acclaim for its screenplay, animation, characters, themes, narrative, humor, Asner's vocal performance, Giacchino's musical score, and the opening sequence. Organizations like the National Board of Review and American Film Institute named Up as one of the top ten films of 2009. It earned $735.1 million worldwide, finishing its theatrical run as the sixth-highest-grossing film of 2009. Up was nominated for five awards at the 82nd Academy Awards, winning two, and received numerous other accolades. Among these, it became the second animated film in history to receive a nomination for the Academy Award for Best Picture, ultimately losing to The Hurt Locker. A short-form series, Dug Days, premiered on Disney+ on September 1, 2021.</p><br/><h3>Plot</h3><p>As a young boy, 10-year-old Carl Fredricksen idolizes explorer Charles Muntz. After he is accused of presenting a fake giant bird skeleton from Paradise Falls in South America, Muntz returns to the falls intent on clearing his name by capturing a living specimen. Carl meets fellow Muntz fan Ellie, who confides her desire to move her \"clubhouse\" — an abandoned house in the neighborhood — to a cliff overlooking Paradise Falls. The two later marry and live in the rebuilt house, with Carl working as a balloon salesman and Ellie a tour guide at the zoo. Ellie suffers a miscarriage, and the couple decide to refocus and begin saving for a trip to Paradise Falls. However, they are constantly forced to spend their savings on more urgent needs. Years pass and Carl decides to arrange the trip as a surprise for Ellie. On the day that Carl plans to tell Ellie, she falls ill and is hospitalized, dying soon after.</p><p>Some time later, Carl, now retired and in his late 70s, stubbornly holds out in the house while the neighborhood around him is replaced by skyscrapers. After Carl injures a construction worker during a mishap, the court deems him a public menace, ordering his relocation to an assisted living facility. However, Carl resolves to keep Ellie's promise, turning his house into a makeshift airship using helium balloons and flying to Paradise Falls. Russell, an eight-year-old \"Wilderness Explorer\" who keeps visiting Carl in an effort to earn his final merit badge for assisting the elderly, becomes an accidental stowaway. Before Carl can land and send Russell home, they encounter a storm that propels the house to South America.</p><p>The house lands on a mesa opposite Paradise Falls. Carl and Russell harness themselves to the still-buoyant house and begin to walk it across the mesa, hoping to reach the falls before the balloons deflate. Russell encounters a giant, colorful flightless bird, whom he names Kevin. They then meet Dug, a Golden Retriever who wears a special collar with a device that translates his thoughts into English; he joins them on their trek despite Carl's objections.</p><p>A pack of fierce dogs wearing the collars take Carl, Russell, and Dug to their master, the now elderly Charles Muntz. He invites them aboard his dirigible the Spirit of Adventure and talks about his hunt for the bird. Carl realizes Muntz's obsession with catching the bird has driven him mad, to the point of killing innocent travelers whom he suspected of seeking the bird for themselves. When Russell notes the skeleton's resemblance to Kevin, Muntz sees them as thieves and becomes hostile. The dogs pursue Carl, Russell, and Dug until Kevin saves them. One of the pursuing dogs bites Kevin's leg as she flees, injuring her to the point where she can't stand on her own. They reach safety from the dogs. Russell urges Carl to help Kevin get home and reunite her with her chicks, and he agrees, but then Muntz (who tracks the group down through Dug's collar) captures her. He starts a fire beneath Carl's house, forcing him to choose whether to rescue it or Kevin; Carl chooses his home.</p><p>At the falls, Carl looks through Ellie's childhood scrapbook and discovers that she filled in the blank pages with photos of their marriage, accompanying a note written from her hospital bed, thanking him for the \"adventure\" and encouraging him to have a new one. Reinvigorated, he goes outside, only to see Russell set out after Kevin using a leaf blower and some balloons to fly. Carl lightens his house by throwing out furniture and keepsakes, allowing it to fly again. Muntz captures Russell, but Carl and Dug board the dirigible and free both him and Kevin. When Muntz pursues them to the tethered house, Carl lures Kevin back to the airship using a piece of chocolate. Muntz leaps after them, but his leg catches on balloon strings, and he falls to his death. The house descends out of sight, at which point Carl decides to let it go and live on the dirigible with Russell and the pack of dogs.</p><p>Carl and Russell reunite Kevin with her chicks before returning home in Muntz's airship. Russell receives his \"Assisting the Elderly\" badge, and Carl presents Russell with a grape soda bottle cap that Ellie gave to Carl when they first met, which he now dubs \"The Ellie Badge\". Meanwhile, unbeknownst to Carl, the house lands on the cliff beside Paradise Falls, fulfilling his promise to Ellie.</p><br/><h3>Voice cast</h3><ul><li>Ed Asner as Carl Fredricksen, an elderly widower and retired balloon salesman. Docter and Rivera noted Asner's television alter ego, Lou Grant, had been helpful in writing for Carl because it guided them in balancing likable and unlikable aspects of the curmudgeonly character. The appearance of Carl was designed to resemble Spencer Tracy as he appeared in his final film, Guess Who's Coming to Dinner. When they met Asner and presented him with a model of his character, he joked, \"I don't look anything like that.\" They tailored his dialogue for him, with short sentences and more consonants, which \"cemented the notion that Carl, post-Ellie, is a disgruntled bear that's been poked awake during hibernation\".</li><li>Jordan Nagai as Russell, an eight-year-old \"Wilderness Explorer\". Throughout most of the film, he makes several comments to Carl that suggest that Russell's father and mother are separated or divorced.</li><li>Christopher Plummer as Charles Muntz, an elderly explorer and Carl's childhood idol, whose long search for the \"Monster of Paradise Falls\" has driven him murderously insane. The name of his airship, the Spirit of Adventure, may have been inspired by Charles Lindbergh's airplane, Spirit of St. Louis. In various interviews, Pete Docter has mentioned Howard Hughes and real-life adventurers Charles Lindbergh and Percy Fawcett as inspirations for Muntz. Reviewers have noted his resemblance to Kirk Douglas.</li><li>Bob Peterson as Dug, a talking Golden Retriever. Peterson knew he would voice Dug when he wrote his line \"I have just met you, and I love you.\", which was based on what a child told him when he was a camp counselor in the 1980s. The DVD release of the film features a short called Dug's Special Mission, which follows Dug just before his first meeting with Carl and Russell. Dug previously appeared in Ratatouille as a shadow on a wall that barks at Remy.</li></ul><p>Additionally, Up features Delroy Lindo, Jerome Ranft, and Peterson as Muntz's dogs Beta, Gamma, and Alpha, respectively. John Ratzenberger played construction foreman Tom, and David Kaye the newsreel announcer. Pete Docter's daughter Elie and Jeremy Leary voiced younger versions of Ellie and Carl, respectively. Other cast members include Mickie T. McGowan as police officer Edith, Danny Mann as construction worker Steve, Don Fullilove and Jess Harnell as Shady Oaks nurses George and A.J., Josh Cooley as Muntz's dog Omega, and Docter as campmaster Strauch.</p><br/><h3>Production</h3><h4>Development</h4><p>Originally titled Heliums, Up was conceived in 2004 by director Pete Docter. He developed the fantasy of a flying house on the idea of escaping from life when it becomes too irritating, which stemmed from his difficulty with social situations growing up. When Bob Peterson had to leave the project for three months to work on Ratatouille as a co-director which had been struggling with story problems, actor and writer Tom McCarthy stepped in to work with Docter on the story while Peterson was gone, and came up with the character Russell. Docter selected an old man for the main character after drawing a picture of a grumpy old man with smiling balloons. The two men thought an old man was a good idea for a protagonist because they felt their experiences and the way they affect their view of the world was a rich source of humor. Docter was not concerned about an elderly protagonist, stating that children would relate to Carl the way they relate to their grandparents.</p><p>Early concepts differed from the final film. The initial version featured a floating city on an alien planet populated with muppet-like creatures, with two brothers vying to inherit their father's kingdom, and when the brothers fell to Earth, they encountered a tall bird who helped them understand each other. But the story just didn't seem to work properly, and Docter and Peterson realized that the most intriguing element was the isolation of the floating city. Yet the people living there would consist of a whole community, and were therefore not really isolated. So the whole city was stripped down to a single flying house with just a single occupant, where balloons replaced the magic which kept the floating city up. After that they got the idea to use an old person, and found the contrast between the elderly grumpy man and the happy balloons in Docter's drawing appealing, inspiring them to work out his backstory. The next concept introduced many of the elements that eventually made their way into the film, but had Carl and Russell landing the house on a Soviet-era spy airship camouflaged as a giant cloud rather than on a tepui. This concept was rewritten due to its similarity to another idea Pixar was developing. Another idea Docter added, then removed, was magic fountain-of-youth eggs laid by the bird, in order to explain the age discrepancy between Muntz and Carl, but they decided this subplot was too distracting, and people would forgive the minor inconsistency. Also, the biggest single influence on Up early on was The Station Agent, by Tom McCarthy.</p><p>Docter noted the film reflects his friendships with Disney veterans Frank Thomas, Ollie Johnston, and Joe Grant (who all died before the film's release and thus the film was dedicated to them). Grant gave the script his approval as well as some advice before his death in 2005. Docter recalled Grant would remind him the audience needed an \"emotional bedrock\" because of how wacky the adventure would become; here it is Carl mourning for his wife. Docter felt Grant's personality influenced Carl's deceased wife Ellie more than the grouchy main character, and Carl was primarily based on Spencer Tracy, Walter Matthau, James Whitmore, and their own grandparents, because there was \"something sweet about these grumpy old guys\". Docter and Jonas Rivera noted Carl's charming nature in spite of his grumpiness derives from the elderly \"hav this charm and almost this 'old man license' to say things that other people couldn't get away with ... It's like how we would go to eat with Joe Grant and he would call the waitresses 'honey'. I wish I could call a waitress 'honey'.\"</p><p>Docter revealed the filmmakers' first story outline had Carl \"just want to join his wife up in the sky. It was almost a kind of strange suicide mission or something. And obviously that's. Once he gets airborne, then what? So we had to have some goal for him to achieve that he had not yet gotten.\" As a result, they added the plot of going to South America. The location was chosen due to both Docter's love of tropical locations, but also in wanting a location Carl could be stuck with a kid due to the inability to leave him with an authority such as a police officer or social worker. They implemented a child character as a way to help Carl stop being \"stuck in his ways\".</p><p>Dug was created by Docter and Peterson for a different project that never materialized, and brought him over to Up. Docter felt it would be refreshing to show what a dog thinks, rather than what people assume it thinks. Knowledge of canine communication, body language and pack behaviors for the artists and animators to portray such thoughts came from consultant Dr. Ian Dunbar, veterinarian, dog behaviorist, and trainer. The idea for Alpha's voice derived from thinking about what would happen if someone broke a record player and it always played at a high pitch. The talking dog collars were invented to give Carl someone to talk with in the absence of human companions as Dug and Kevin were added to the story at an earlier stage than Russell. The presence of Russell, as well as that of the construction workers, helped make the story feel less \"episodic\".</p><p>Docter auditioned 400 boys in a nationwide casting call for the part of Russell. Nagai, who is Japanese American, showed up to an audition with his brother, who was actually the one auditioning. Docter realized Nagai behaved and spoke non-stop like Russell and chose him for the part. Nagai was eight years old when cast. Docter encouraged Nagai to act physically as well as vocally when recording the role, lifting him upside down and tickling him for the scene where Russell encounters Kevin. East Asian Americans have positively noted Pixar's first casting of an East Asian lead character, in contrast to the common practice of casting non-East Asians in East Asian parts, particularly in the role of an \"all-American\" boy without any stereotypes typically seen with East Asian characters, such as martial arts.</p><p>Carl's relationship with Russell reflects how \"he's not really ready for the whirlwind that a kid is, as few of us are\". Docter added he saw Up as a \"coming of age\" tale and an \"unfinished love story\", with Carl still dealing with the loss of his wife. He cited inspiration from Casablanca and A Christmas Carol, which are both \"resurrection\" stories about men who lose something, and regain purpose during their journey. Docter and Rivera cited inspirations from the Muppets, Hayao Miyazaki, Dumbo, and Peter Pan. They also saw parallels to The Wizard of Oz and tried to make Up not feel too similar. There is a scene where Carl and Russell haul the floating house through the jungle. A Pixar employee compared the scene to Fitzcarraldo, and Docter watched that film and The Mission for further inspiration.</p><p>Charles Muntz comes from Howard Hughes and Errol Flynn. In the DVD extra \"The Many Endings of Muntz\", Docter and his team talked about their struggle to figure out the character's ultimate fate. They considered having him redeem himself or survive unrepentant, but eventually decided that, \"as almost a representation of Carl's old self, Muntz has to die.\"</p><p>Overall, the budget was approximately $175 million.</p><h4>Animation</h4><p>Docter made Venezuela the film's setting after Ralph Eggleston gave him a video of the tepui mountains of Canaima National Park; tepuis were previously featured in another Disney film, Dinosaur. In 2004, Docter and eleven other Pixar artists spent three days reaching Monte Roraima by airplane, by jeep, and by helicopter. They also spent three nights there painting and sketching, and encountering ants, mosquitoes, scorpions, frogs, and snakes. They then flew to Matawi Tepui and climbed to Angel Falls. Docter felt \"we couldn't use. Reality is so far out, if we put it in the movie you wouldn't believe it.\" The film's creatures were also challenging to design because they had to fit in the surreal environment of the tepuis, but also they had to be realistic because those mountains exist in real life. The filmmakers then visited the Sacramento Zoo to observe a Himalayan monal for Kevin's animation. The animators designed Russell as an Asian-American, and modeled Russell after similar looking Peter Sohn, a Pixar storyboard artist who is Korean-American. The Pixar employees frequently sketch each other during meetings, and a drawing of Sohn became the model for Russell.</p><p>While the studio usually designs their characters to be caricatured, Carl was even more so, being only at least three heads high. He was not given elderly features such as liver spots or hair in his ears to keep him appealing, yet giving him wrinkles, pockmarks on his nose, a hearing aid, and a cane to make him appear elderly. Docter wanted to push a stylized feel, particularly the way Carl's head is proportioned: he has a squarish appearance to symbolize his containment within his house, while Russell is rounded like a balloon. The challenge on Up was making these stylized characters feel natural, although Docter remarked the effect came across better than animating the realistic humans from Toy Story, who suffered from the \"uncanny valley\". Cartoonists Al Hirschfeld, Hank Ketcham, and George Booth influenced the human designs. Simulating realistic cloth on caricatured humans was harder than creating the 10,000 balloons flying the house. New programs were made to simulate the cloth and for Kevin's iridescent feathers. To animate old people, Pixar animators would study their own parents or grandparents and also watched footage of the Senior Olympics. The directors had various rules for Carl's movements: he could not turn his head more than 15–20 degrees without turning his torso as well, nor could he raise his arms high. However, they also wanted him to grow more flexible near the end of the film, transforming into an \"action hero\".</p><p>A technical director calculated that to make Carl's house fly, he would require 23 million balloons, but Docter realized that such a high number made the balloons look like small dots. Instead, the balloons created were made to be twice Carl's size. There are 10,297 balloons for shots of the house just flying, 20,622 balloons for the lift-off sequence, and a varying number in other scenes.</p><br/><h3>Music</h3><p>Up is the third Pixar film to be scored by Michael Giacchino, after The Incredibles and Ratatouille. What Pete Docter wanted most importantly out of the music was the emotion, so Giacchino wrote a character theme-based score that producer Jonas Rivera thought enhanced the story. At the beginning of the movie, when young Carl is in the movie theater watching a newsreel about Muntz, the first piece of music heard is \"Muntz's Theme\", which starts out as a celebratory theme, and echoes through the film when Muntz reappears 70 years later. \"Ellie's Theme\" is first heard when she is introduced as a little kid and plays several times during the film in different versions; for instance, during the sequence where Carl lifts his house with the balloons, the theme is changed from a simple piano melody to a full orchestral arrangement. Giacchino has compared the film to opera since each character has a unique theme that changes during a particular moment in the story.</p><p>The score was released as a digital download on May 26, 2009, three days before the film opened in theaters. It won the Academy Award for Best Original Score, the Grammy Award for Best Score Soundtrack Album, the Golden Globe Award for Best Original Score, and the 2010 BAFTA Award for Best Film Music. It is the first score for a Pixar film to win the Oscar (Randy Newman also won for Monsters, Inc. and Toy Story 3, but in the category of Best Original Song).</p><br/><h3>Release</h3><p>The 96-minute Up debuted at the 62nd Cannes Film Festival on May 13, 2009, the first animated film to do so, followed by a premiere on May 16, at the El Capitan Theatre in Los Angeles. Up was originally scheduled for general release on June 12, but it was moved up to May 29. The film was also released in 3D format, a first for a Pixar film. Despite Pixar's track record, Target Corporation and Walmart stocked few Up items, while its regular collaborator Thinkway Toys did not produce merchandise, claiming the film's story was unusual and would be hard to promote. Disney acknowledged not every Pixar film would have to become a franchise. In Colombia, unexpected publicity for the film was generated due to the uncanny similarity of Carl with Colombian ex-president Julio César Turbay Ayala. Docter intended for audiences to take a specific point from the film, saying:</p><blockquote>Basically, the message of the film is that the real adventure of life is the relationship we have with other people, and it's so easy to lose sight of the things we have and the people that are around us until they are gone. More often than not, I don't really realize how lucky I was to have known someone until they're either moved or passed away. So, if you can kind of wake up a little bit and go, \"Wow, I've got some really cool stuff around me every day\", then that's what the movie's about.</blockquote><p>Walt Disney Studios Home Entertainment released Up on Blu-ray and DVD on November 10, 2009. Physical copies contain two short films Partly Cloudy and Dug's Special Mission, audio commentary, a documentary Adventure is Out There, an unseen and alternate take The Many Endings of Muntz, and a digital copy. Blu-ray bonus features exclusively include a Cine-Explore, Global Guardian Badge and Geography games, and eight documentaries. On iTunes, it was later accompanied by a short film as an extra, George and A.J., which was also released on YouTube. In 2020, Up was released on 4K Ultra HD Blu-ray.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Up earned $293 million in the United States and Canada and $442.1 million in other countries, for a worldwide total of $735.1 million. It was the sixth-highest-grossing film of 2009.</p><p>In the United States and Canada, exit polling showed extensive family attraction across a variety of audiences; 53% were female and 57% were under 17. The film was released with Drag Me to Hell on May 29, 2009. Up earned $21.4 million on its first day. The film debuted earning $68.2 million from 3,766 theaters (1,530 in 3D). It would hold the record for having the highest opening weekend for a 3D film until it was surpassed by James Cameron's Avatar later that year. Its earnings dropped by 37 percent to $44.3 million the second weekend, and another 31% to $30.5 million the third weekend; this was the slowest decline for a Pixar animated film since Finding Nemo. Up completed its theatrical run in the United States and Canada on December 5, 2009.</p><h4>Critical response</h4><p>Up has an approval rating of 98% based on 298 professional reviews on the review aggregator website Rotten Tomatoes, with an average rating of 8.7/10. Its critical consensus reads, \"An exciting, funny, and poignant adventure, Up offers an impeccably crafted story told with wit and arranged with depth, as well as yet another visual Pixar treat.\" Metacritic (which uses a weighted average) assigned Up a score of 88 out of 100 based on 37 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film a rare average grade of \"A+\" on an A+ to F scale.</p><p>Film critic Roger Ebert gave the film four out of four stars and called it \"a wonderful film\". The Hollywood Reporter lauded the film as \"Winsome, touching and arguably the funniest Pixar effort ever, this gorgeously rendered, high-flying adventure is a tidy 90-minute distillation of all the signature touches that came before it.\" Although the San Francisco Chronicle noted that the film \"contains many boring stretches of mindless freneticism and bland character interaction,\" it also declared that there are scenes in Up of \"such beauty, economy and poetic wisdom that they belong in any anthology of great movie moments ... to watch Up with any attention is to be moved and astonished by the economy with which specific visuals are invested with emotion throughout. ... \" Variety enthused that \"Up is an exceptionally refined picture; unlike so many animated films, it's not all about sensory bombardment and volume ... Unsurprisingly, no one puts a foot wrong here. Vocal performances ... exude a warm enthusiasm, and tech specifications could not be better. Michael Giacchino's full-bodied, traditional score is superlative ...\" The Globe and Mail stated that Up is \"the kind of movie that leaves you asking 'How do people come up with this stuff?'\" along with an overall positive review on the film, despite it being predictable.</p><p>The character of Carl Fredricksen has received mostly positive reception. Bill Capodagli, author of Innovate the Pixar Way, praised Carl for his ability to be a jerk and likable at the same time. Wall Street Journal editor Joe Morgenstern described Carl as gruff, comparing him to Buster Keaton, but adds that this begins to wear thin as the movie progresses. He has been compared with Spencer Tracy, an influence on the character, by The Washington Post editor Ann Hornaday and Empire editor Ian Freer, who describes him as similar to a \"Guess Who's Coming to Dinner-era\" Tracy. Entertainment Weekly editor Lisa Schwarzbaum described his appearance as a cross between Tracy and an eccentric out of a George Booth cartoon. Time editor Richard Corliss also makes the comparison, calling him a \"trash compacted version\" of Tracy. He has also been compared to Walter Matthau, another inspiration for the character's design, by LA Weekly editor Scott Foundas, suggesting that actor Ed Asner was channeling him while performing the role of Carl. Variety editor Todd McCarthy described Carl as a combination of both Tracy and Matthau.</p><p>The relationship between Carl and his wife Ellie has been praised in several media outlets. In his book Disney, Pixar, and the Hidden Message of Children's Films, author M. Keith Booker described the love between Carl and Ellie as touching. While also describing the scene of the two of them aging as a \"masterpiece of its own kind\", he was not sure how much children would appreciate the scene, commenting that his son was squirming in his seat during the scene. Reelviews editor James Berardinelli praised their relationship, stating that it brought a tear to his eye in a way no animated film has done, including anything by famed anime director Hayao Miyazaki. Ann Hornaday praised the prologue, describing it as \"worthy of Chaplin in its heartbreaking poignancy.\" Chicago Tribune editor Michael Phillips praised the scene, describing it as an emotional and cinematic powerhouse, and that he also was nearly moved to tears. However, Salon editor Stephanie Zacharek criticized the love between Carl and Ellie, describing their marriage as resembling a dental adhesive commercial more than a real relationship.</p><p>Edward Asner was praised in several media outlets for his portrayal of Carl. San Francisco Chronicle editor Mick LaSalle praised Asner as a great choice due to having a grumpiness to his voice that is not truly grumpy, but rather coming from a protective stance. Entertainment Weekly editor Lisa Schwarzbaum praised Asner's acting, stating that he has a \"Lou Grant authority\" to his voice. Time editor Richard Corliss stated that Asner had the \"gruffness and deadpan comic timing to bring Carl to life.\" The Boston Globe editor Ty Burr concurred with this, stating that his Lou Grant-like voice had not diminished with time. USA Today editor Claudia Puig praised Asner's delivery, describing it as superb.</p><p>The formulation of Russell as an Asian-American character, along with the casting of an Asian-American in the role was met positively as well. Both Nagai and the film were awarded by the East West Players for the depiction of Russell. EWP lauded Pixar for the creation of the character, stating, \"We are proud to honor a very progressive film company like Pixar who cast an Asian-American character alongside an elderly one to play the leads in a feature film.\" The character is noted as Pixar's first lead Asian character, and was further positively received within the added context of historical non-Asian castings for Asian roles in entertainment. Asian-American organizations and entertainment websites, such as media watchdog Media Action Network for Asian Americans (MANAA), Racebending.com, and Angry Asian Man praised the character and Pixar for its diverse character depictions, noting the general lack of Asian-American lead characters and Asian actors cast in entertainment. In an interview with NPR in 2013, Angry Asian Man's Phil Yu reflected on the character's lack of typical Asian stereotyping, stating, \"You know, he just happens to be Asian and he's, you know, really adorable character. But that kid could've been of any ethnicity but they made the effort to make him Asian—just a little color, you know, and it's really wonderful when that kind of thing happens where they don't have to play that up and make it like a thing or a joke, which happens a lot.\"</p><p>Up was included on a number of best-of lists. It appeared on professional rankings from Empire based on retrospective appraisal, as one of the greatest films of the twenty-first century. Several publications have listed it as one of the best animated films, including: Entertainment Weekly (2009), IGN (2010), Time (2011), Insider, USA Today (both 2018), Rolling Stone (2019), Esquire (2020), Parade, Time Out New York, and Empire (all 2021). In December 2021, the film's screenplay was listed number 33 on the Writers Guild of America's \"101 Greatest Screenplays of the 21st Century (So Far)\".</p><h4>Accolades</h4><p>At the 82nd Academy Awards, Up received nominations for Best Picture, Best Original Screenplay, and Best Sound Editing; and won Best Animated Feature and Best Original Score. The film's other nominations include nine Annie Awards (winning two), four British Academy Film Awards (winning two), four Critics' Choice Awards (winning two), and two Golden Globe Awards (winning both). It was named one of the ten best films of 2009 by the National Board of Review (where it also won Best Animated Film) and the American Film Institute.</p><br/><h3>Other media</h3><p>In 2009, an adventure video game, Up, was released for multiple platforms. Kinect Rush: A Disney–Pixar Adventure (2012) features characters and worlds from five of Pixar's films, including Up. In the world-building video game Disney Magic Kingdoms, Carl Fredricksen, Russell, Kevin, Dug, and Charles Muntz appear as playable characters to unlock for a limited time, along with attractions based on Carl's house and Paradise Falls, with the characters involved in new story lines that serve as a continuation of the events of the film.</p><p>A streaming microseries of short films following Up, Dug Days, was released on Disney+ on September 1, 2021. It is set some time after the events of the film and focuses on Dug and Carl as they reside in suburbia.</p><p>A new short film, Carl's Date, was announced on March 28, 2023. Originally set to be streamed on Disney+, it is set to be released theatrically with the upcoming animated film, Elemental, on June 16, 2023.</p><br/>"
  },
  "errorMessage": ""
}