{
  "imDbId": "tt0050976",
  "title": "The Seventh Seal",
  "fullTitle": "The Seventh Seal (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-the-seventh-seal-1957",
      "rate": "100",
      "content": "The directness of The Seventh Seal is its strength: This is an uncompromising film, regarding good and evil with the same simplicity and faith as its hero."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2007/jul/20/worldcinema.drama1",
      "rate": "100",
      "content": "Ingmar Bergman's dark masterpiece effortlessly sees off the revisionists and the satirists; it is a radical work of art that reaches back to scripture, to Cervantes and to Shakespeare to create a new dramatic idiom of its own."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/1958/10/14/archives/seventh-seal-swedish-allegory-has-premiere-at-paris.html",
      "rate": "100",
      "content": "A piercing and powerful contemplation of the passage of man upon this earth. Essentially intellectual, yet emotionally stimulating, too, it is as tough—and rewarding—a screen challenge as the moviegoer has had to face this year."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/seventh-seal-review/",
      "rate": "100",
      "content": "Dark but beautiful."
    },
    {
      "publisher": "",
      "author": "BBC",
      "link": "https://www.bbc.co.uk/films/2007/07/16/the_seventh_seal_2007_review.shtml",
      "rate": "100",
      "content": "Full of haunting, iconic images and a touch of hopeful humanity, The Seventh Seal is cinema at its most artful, a philosophical meditation on the meaning(lessness) of this mortal coil."
    },
    {
      "publisher": "Time Out",
      "author": "Joshua Rothkopf",
      "link": "",
      "rate": "100",
      "content": "Prepare to fawn at Bergman’s most metaphysically profound film; you may even laugh."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/the-seventh-seal/review/2030010915/",
      "rate": "100",
      "content": "What's most important here is that THE SEVENTH SEAL, for all its downbeat aspects, is so gripping as to be entertaining in an enlightening way. Less austere and more visually striking than some of Bergman's later films."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Zack Handlen",
      "link": "https://www.avclub.com/the-seventh-seal-1798218170",
      "rate": "91",
      "content": "There’s a lot going on in Ingmar Bergman’s The Seventh Seal, with its striking imagery, bawdy humor, and grim suffering; it’s a humane film about the inhumane inevitability of death. I’m still not much of a cinephile (this is my second Bergman film, and I only watched The Virgin Spring so I could compare it in an essay to The Last House On The Left), but I’m coming to realize that the difference between a good movie and a great one are those moments of intense personal connection where it seems like the filmmaker is reaching out to you through the screen and whispering (or yelling, or cajoling, or demanding, or pleading) in your ear. As if there is no real distance between you and the director, time has changed nothing, and the moment remains as pure as it was on the day it was filmed."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Eric Henderson",
      "link": "",
      "rate": "50",
      "content": "The Seventh Seal, assisted by cinematographer Gunnar Fischer’s richly overexposed images, operates as though it contains the undiluted essence of life’s fueling dialectic formula. Occasionally it does, most notably in the terrifying arrival of the self-flagellants to a weak-willed village. But the road-trippers in Bergman’s follow-up, Wild Strawberries, achieve a far greater grace and clarity with only a fraction of the heavy lifting."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "40",
      "content": "The film in fact consists of a series of dull speeches spun on simple themes; Bergman barely tries to make the material function dramatically."
    }
  ],
  "errorMessage": ""
}