{
  "imDbId": "tt0050976",
  "title": "The Seventh Seal",
  "fullTitle": "The Seventh Seal (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "username": "howard.schumann",
      "userUrl": "https://www.imdb.com/user/ur0491610",
      "reviewLink": "https://www.imdb.com/review/rw0062665",
      "warningSpoilers": true,
      "date": "26 May 2003",
      "rate": "",
      "helpful": "229 out of 276 found this helpful.",
      "title": "A masterpiece",
      "content": "In the magnificent 1957 classic The Seventh Seal by Ingmar Bergman, Antonius Block (Max Von Sydow), a knight returning home from the Crusades with his squire Jöns (Gunnar Bjönstrand) meets Death (Benkt Ekerot) on a lonely beach and challenges him to a game of chess. If he wins, he lives. While the game goes on, he gets a reprieve. It is the 14th century and suffering and pain abound. Penitents flog themselves, seminarians rob the dead, people go mad from fear, and witches are burned at the stake. It is the time of the Black Plague and Death has his hands full. As in the Greek legend of Kronos and medieval folklore, Bergman depicts Death as the Grim Reaper, a man clothed from head to foot in a black habit and hood. In The Seventh Seal, however, Death is not frightening or sinister, just an old man performing his job with a wry detachment.The film opens and closes with the passage from Revelation from which it takes its title: `When he broke open the seventh seal, there was silence in heaven for about half an hour' (Rev 8:1). Bergman's message, however, is more about the silence of God on earth than in heaven. Block is tormented by the fact that God will not outwardly reveal himself. He says to a priest during confession, `I want God to stretch out his hand to me, reveal himself and speak to me. But he remains silent, I call out to Him in the dark but no one seems to be there\". But Block still senses the God within him and is tormented. \"Why can't I kill God within me?\" he asks. \"Why does he live on inside me, mocking and tormenting me till I have no rest, even though I curse him and try to tear him from my heart' Block asks Death if he knows anything but he knows nothing. He even asks a woman being taken to the stake if he can see the Devil so that he can ask him about God but all she says is to look into her eyes. The Seventh Seal is not all heavy \"significance\", however. It has a good story with believable characters, wonderful performances, lots of comic relief and moves easily from drama to comedy as in the great Shakespearean plays. We meet an actor named Jof (Nils Poppe), his wife Mia (Bibi Andersson), and their infant son Mikael. Block looks with envy on the simple love of this family for their child. Both Jof and Block see visions of the spiritual world but Jof's visions are life affirming whereas Block sees only reflections of darkness. The film has unforgettable images such as a hawk floating in a cloudless sky, two horses standing in the surf, Jof's vision of the Virgin Mary caring for her child, and a frightening procession of plague-infected flagellants. Perhaps too melodramatic for modern viewers (it has been parodied), The Seventh Seal still touches a universal longing deep within us. Some view the film as a complete denial of God, but it seems that God does show his face -- only Block and his squire cannot see it. It is there in the wild strawberries, the fun of watching a troupe of players perform, the innocence of the little boy, the eyes of the young lovers, and the haunting visions of Jof. The film ends on a note of affirmation including one of the most memorable scenes in the history of cinema, the Danse Macabre, the Totentanz -- a string of silhouetted figures dancing in a line with arms outstretched as they are about to enter the unknown. In the magnificence of his vision and the timeless beauty of his art, Bergman has answered the question about God's existence simply in the act of posing it."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0062653",
      "warningSpoilers": false,
      "date": "25 July 2002",
      "rate": "10",
      "helpful": "134 out of 175 found this helpful.",
      "title": "The Quintessential Bergman Picture",
      "content": "One thing that can be certain after watching the Seventh Seal, outside of being thankful for living in this century, is that Bergman knows his film-making- and imagery. He uses subliminal and not so subliminal techniques to convey a dying, frightened world, where making a living is almost impossible and the debate of god's control over life is discussed like un-rhyming yet fascinating poetry. The result is beautiful cinema, capturing the always foreboding fear and allure of the almighty and for the waiting death, appropriately staged in post-crusades, mid dark age Europe. Max Von Sydow gives an excellent showing as the opponent of Death (in a clever and meticulous chess game), yet the character of Death, played by Bengt Ekerot with chilling conviction, steals the show, if only for the alluring quality of the character. Even if the story veers it veers in good and interesting territory, focusing on people who convey Bergman's point and or style. I can't reveal what the bottom line point is (many newcomers to Bergman's work won't either, especially if you're not in the mood for soul searching), but one thing is for certain, an allegory on life and death is shown perfectly in the second to last shot of the reaper and his minions following in a dance across the field. This is one of the most pure of cinema's masterpieces and certainly Bergman's best cine. A++"
    },
    {
      "username": "Cowman",
      "userUrl": "https://www.imdb.com/user/ur0100872",
      "reviewLink": "https://www.imdb.com/review/rw0062684",
      "warningSpoilers": false,
      "date": "5 May 2004",
      "rate": "",
      "helpful": "247 out of 303 found this helpful.",
      "title": "Chilling, audacious, and awe-inspiring. An undisputed masterpiece.",
      "content": "The mysteries of religion and death have long been a popular focus among artists of all media, including film. And while many films question these mysteries, they seldom provide any real insight into the world of the unknown. In Ingmar Bergman's THE SEVENTH SEAL, these mysteries are not only questioned; they are dissected, splayed, and scrutinized.THE SEVENTH SEAL could very well serve as sort of a manifesto for existentialism. Its deep acuity and haunting imagery is powerful enough to jar even passive viewers out of their complacency and force them to examine their own reality. The delicately crafted story centers around a 14th century knight named Antonius Block and his ongoing game of chess with a shadowy, hooded figure: Death. Bergman uses this allegory not just to personify death, but to illustrate the lengths man will go to in order to avoid it. In the end, however, Death is a much better player than any of us, and though he may humor some of his opponents by letting them think that they have the advantage, the end result is inevitable: Death always wins. No matter how skillfully we plan our moves or how determined we are to win, we can never beat Death.In Antonius's search for answers, he encounters a variety of very unique characters, each with their own outlook on life, death, faith, fear and love. Their commentary on such matters is often dryly funny and always brilliant, continuously and effectively challenging our perceptions of the world around us. For me, the dialogue was definitely the high point of the film, as it was extremely thought-provoking and carefully constructed throughout. Almost every line spoken is, in one way or another, daunting and unforgettable. Jöns's description of love as \"the blackest of all plagues\" is a quote that will forever be engraved in my mind.THE SEVENTH SEAL truly is a remarkable accomplishment in the world of cinema. It is a deep, mesmerizing, and darkly beautiful work of art. More importantly, THE SEVENTH SEAL is one of those rare movies that doesn't just entertain, but also has the power to change the way one thinks."
    },
    {
      "username": "ACitizenCalledKane",
      "userUrl": "https://www.imdb.com/user/ur4306474",
      "reviewLink": "https://www.imdb.com/review/rw0989799",
      "warningSpoilers": false,
      "date": "1 January 2005",
      "rate": "10",
      "helpful": "271 out of 320 found this helpful.",
      "title": "Ingmar Bergman questions the meaning of life, death, faith, and the existence of God in this masterpiece of world cinema...",
      "content": "Antonius Block - \"Who are you?\" Death - \"I am Death.\" Antonius Block - \"Have you come for me?\" Death - \"I have long walked by your side.\" Antonius Block - \"So I have noticed.\"The Seventh Seal, considered by some to be Ingmar Bergman's greatest achievement, is the desperate prayer of a sensitive, introspective, and insightful young man confused by the horrors of the world around him. Ingmar Bergman's films are often very deep, full of symbolism, philosophy, spirituality, emotion, and thought. The Seventh Seal is classic Bergman. Expressing his fear of life with no meaning, death with no understanding, and faith with no validity, Ingmar Bergman takes us deep into the well of his mind.As the Black Plague ravages the world, a Antonius Block and his squire, Jons (Max Von Sydow and Gunnar Bjornstrand, respectively), return from fighting in the Crusades. They find their homeland devastated by the plague, their countrymen mad with fear, and their cause lost. Antonius Block is confronted by Death (Bengt Ekerot). Block challenges Death to a game of chess to provide him time to seek answers to the questions that plague his mind as Death has plagued his country. Death accepts, knowing that Block cannot escape his fate, and the two begin their game. As the story continues, Block and Jons meet with several testaments to the agony that the Black Death has brought upon their land. They find a young girl who is to be burned at the stake for having been with the Devil. They find madness in the eyes of all they meet, as everyone is convinced that God is angry and is punishing the world with the plague. They also find a small group of travelling actors, who appear to be the only souls to have remained sane in the midst of all of the death and fear. Block and Jons move across the countryside in the hopes of finding safety in Block's castle, but Death is always around the corner, biding his time.Brilliantly conceived, and stunningly executed, Bergman's vision is brought to the screen through Gunnar Fischer's powerful cinematography creating images that will likely remain with you for the rest of your life. Strong performances from everyone involved bring humanity to the film. Max Von Sydow's brave and conflicted Antonius Block matching wits with Bengt Ekerot's sinister, omnipotent Death is a microcosm of the forces at work in this breath-taking interpretation of the mortal struggle.A masterpiece!"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw5661416",
      "warningSpoilers": false,
      "date": "21 April 2020",
      "rate": "10",
      "helpful": "25 out of 31 found this helpful.",
      "title": "The Curse of Existence...",
      "content": "An abstraction of your fears, conjured progressively through years, walks beside you every day, may cause some to halt, then pray; it's a demon that's passed on, through generations come and gone, as fixed and certain as the tide, nowhere for you to run, or hide; is there a game that you can play, that extends your time and stay, with instructions and some rules, that don't leave you, as the fool; can the clock that's counting down, tick half as fast before you frown, and gaze with stoical askance, as you begin, your macabre dance.Signed, sealed and delivered as many times as you may care for, but the curse of existence is never knowing how the story really ends, or why it was started in the first instance."
    },
    {
      "username": "RWiggum",
      "userUrl": "https://www.imdb.com/user/ur0420183",
      "reviewLink": "https://www.imdb.com/review/rw0062659",
      "warningSpoilers": true,
      "date": "24 January 2003",
      "rate": "10",
      "helpful": "306 out of 357 found this helpful.",
      "title": "Grim, but not entirely hopeless",
      "content": "Middle Ages: Antonius Blok, a Swedish knight, returns from the Crusades only to find his country dying of the plague, religious fundamentalists taking over and Death himself wanting him to come along. Antonius challenges Death to a game of chess and is meanwhile driven to desperation because of the absence of God. This description sounds like a very serious, philosophical and dour film, and actually it is serious, philosophical and dour; but there is also a little warmth, hope and humor, maybe not for Antonius, but for the viewer.When Blok and Death interrupt their game of chess (due to the plague, Death is very busy), he meets two actors, Jof and Mia, with their little son, the most human characters of the film, and I don't think it's a coincidence that there names sound very much like Joseph and Mary. These people may be a little dim, but they are good at heart and you can see the happiness in Antonius' eyes when he is together with them for the first time. But the main aspect of Ingmar Bergman's arguably best film are Antonius Blok's grim encounters, as the young girl about to be burnt at the stake, as a scapegoat for the plague. And the haunting image of a huge crowd of flagellants interrupting a play of Jof and Mia and trying to convince the crowd thery are doomed; hardly any other film is that direct in asking controversial and essential questions about God, religion and mankind as The Seventh Seal.Another reason for the impact this almost 50-year-old film has still today is the acting: Max von Sydow's face always seems to reflect what Antonius Blok is thinking, Nils Poppe's performance as the naive actor and caring father is priceless and Bengt Ekerot's Death became a part of film history and survived all its spoofs (the best one being in Woody Allen's tremendously funny \"Love and Death\"). But the best performance is done by Gunnar Björnstrand as Antonios Blok's misogynist squire, dryly commenting all their encounters even in the face of death.The Seventh Seal is not subtle in raising it's questions, that's for sure. But it makes you think about these questions nevertheless. It's disturbing and grim most of the time, but at the end it gives you the hope that it might become better."
    },
    {
      "username": "elvircorhodzic",
      "userUrl": "https://www.imdb.com/user/ur65733095",
      "reviewLink": "https://www.imdb.com/review/rw3618088",
      "warningSpoilers": false,
      "date": "12 January 2017",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "\"I want knowledge! Not faith, not assumptions, but knowledge.\"",
      "content": "THE SEVENTH SEAL is a film that presents a dramatic fantasy game between meaning of life and fear of death. A knight and his squire have returned to their country after a ten-year crusade. Deadly disease ravaged country. Knight faces Death. He calls Death on the multi-day game of chess...The story has touched serious philosophical and religious topics. However, the story is full of intrigue, dark humor and hope. The protagonists are distracted between the vicious disease, self-pity and torture. It is interesting to see a deeply disillusioned knight, a cynical squire who hates women, a cheating wife, evil priests, a mute girl and seemingly healthy and happy family on the same road. The truth is all around them. The main protagonist used to persistently ask questions to which only he has a valid response. This film reveals some controversial issues. Is deadly disease greater threat to man or the man is the greatest enemy to himself? Mr. Bergman has painted realistic effects of fear, horror, cynicism, surprises, love and health on human faces.Max von Sydow as Antonius Block, the knight is a more serious version of Don Quixote. Gunnar Björnstrand Jöns, the squire is a character who never changes his mood. He always has some sort of cynical jokes or words of contempt for each occurrence. Bengt Ekerot is Death in the true sense of that word. Nils Poppe as Jof is a juggler who has strange predictions. Fortunately, no one believes him. Bibi Andersson as Mia, Jof's wife is a beautiful and cheerful woman who does not fit into the landscape.Life is a hard journey. The rare moments of happiness are a sort of salvation. The end of the film emphasizes the transience of life and the power of death which no one can escape. Of course, only in the eyes of one of the protagonists."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0062686",
      "warningSpoilers": false,
      "date": "12 July 2004",
      "rate": "",
      "helpful": "135 out of 194 found this helpful.",
      "title": "One of the most extraordinary movies ever made. I cannot recommend 'The Seventh Seal' highly enough.",
      "content": "'The Seventh Seal' is universally regarded as a masterpiece. It's one of those classics like 'Citizen Kane', 'Rear Window' or 'The Godfather' that has subtlety entered popular culture, so even if you haven't actually seen it you recognize references to it in other movies, TV, magazines and everyday conversation. The thing is like the aforementioned and 'Rashomon' and 'Sunset Blvd' it isn't regarded as a masterpiece for nothing, it really is one. I think anybody who loves movies will be totally knocked out by 'The Seventh Seal'. It's still one of the most extraordinary movies ever made. Visually it's stunning, the acting is first rate, and the end result is mesmerizing. Once seen never forgotten is a cliche, but it's the perfect description for this amazing film. Max von Sydow brilliantly plays Antonius Block, a knight returning from the Crusades who challenges Death (Bengt Ekerot) to a chess match. He is accompanied on his journey home by his cynical squire Jons (Gunnar Bjornstrand). Jons is my favourite character in the movie, and as good as von Sydow is Bjornstrand's performance is even better. I also was very taken by the traveling actors who become part of Block's entourage, Jof (Nils Poppe) and his wife Mia (Bibi Andersson), and confess to developing quite a crush on Mia. I cannot recommend 'The Seventh Seal' highly enough. Don't be put off by Bergman's highbrow reputation, this is a movie that can be appreciated by anybody, especially by old school horror fans. While it isn't strictly a horror movie itself anyone who admires the James Whale and Val Lewton classics of the 1930s and 1940s will find much to enjoy here."
    },
    {
      "username": "bsinc",
      "userUrl": "https://www.imdb.com/user/ur1364019",
      "reviewLink": "https://www.imdb.com/review/rw1167038",
      "warningSpoilers": false,
      "date": "6 September 2005",
      "rate": "6",
      "helpful": "123 out of 170 found this helpful.",
      "title": "Didn't like it but will definitely see it again in the distant future",
      "content": "First of all, I have taken the time to read some posts on this movie before writing my review because I was searching for lots of answers. Didn't get many though, the popular thing fans like to say (and please, no pun intended) is that it just takes time to understand and appreciate this movie. To this I quickly reply that my perception of \"Det Sjunde Inseglet\" was that it is a rather dull, if not eventless, movie. It has some really nice moments (and for some reason I really liked the concept of a man playing chess with death itself) but in the end almost nothing is resolved except from the main protagonist who, at the brink of his death, discovers that it's love that makes people want to live ,very roughly put, I apologize, but even this revelation was hidden from the writer of this comment. And this is what bothered me the most, I couldn't read (for the lack of a better word) any of these important details, the movie very coldly rolled in front of my eyes and I just didn't get it! Now the easiest and dumbest thing to say is that this is all the fault of the director for not having a more universal way of film-making, rather the viewer has to decipher such information if he wants to fully appreciate his movies. I've just realized that I could say the same for Kubrick's visionary movies, I didn't like most, scratch that, none of them the first time around, they grew on me after a second viewing. And I dig Kubrick, a lot!!!I was also surprised with the admiration the cinematography received, it did not impact me whatsoever (and I am more so a visual that a sensual movie buff and love this kind of stuff). All in all, as Antonius Block, I am searching for answers, important ones. It bothers me a lot that I don't appreciate this movie, and I ask anyone to help me resolve my problem. What am I missing? What don't I get? What should I know about \"The Seventh Seal\", its meaning, its importance, its making, its director...?Thank you for your time"
    },
    {
      "username": "jhclues",
      "userUrl": "https://www.imdb.com/user/ur0785249",
      "reviewLink": "https://www.imdb.com/review/rw0062620",
      "warningSpoilers": false,
      "date": "4 November 2000",
      "rate": "10",
      "helpful": "94 out of 132 found this helpful.",
      "title": "Compelling Drama From Ingmar Bergman",
      "content": "A compelling contemplation of death and the nature of Man's existence, Ingmar Bergman's `The Seventh Seal' is uncompromising, riveting drama that is every bit as striking conceptually as it is philosophically. In the Fourteenth Century a knight, Antonius Block (Max von Sydow), and his squire, Jons (Gunnar Bjornstrand), have returned after ten years away at the Crusades to their native Sweden, and are beginning their journey home. For Block, it is a pensive time; he is troubled by what he perceives as God's silence, and thirsts for knowledge and some meaning to his life, as well as a resolution of faith, which has deserted him. Jons, meanwhile, is a study in jaded indifference, who believes in nothing beyond the present and whatever his senses and current circumstances dictate. Shortly after their arrival on the coast of Sweden, Death (Bengt Ekerot) comes for Block. But Block strikes a bargain with him, challenging him to a game of chess, to be played as they continue on with their journey. As long as Block prevails, they will go on; if he wins, he will be released. And though Block knows what the outcome must inevitably be, he welcomes Death's acceptance of his challenge, for the game affords him perhaps enough time to fulfill his quest, while adding purpose to what promises to be an arduous trek through a land being ravaged by the Black Plague. Von Sydow brings a commanding presence to the screen as Block, his very countenance bespeaking strength and poise. His subtle, stoic approach to this enigmatic character is captivating, and lends a depth and dignity that makes Block truly memorable. By contrast, Jons' strength seems born of his indifference; he takes things as they come, and is governed by a somewhat fatalistic philosophy. Bjornstrand, a gifted, eloquent actor (and veteran of numerous Bergman films), invests an earthy, gritty quality to Jons that plays effectively opposite von Sydow's more ethereal portrayal of Block. It is significant that in the closing scene the final speech, in the presence of Death, is accorded to Jons; for it elevates the character to a station equal to, if not surpassing, that of the protagonist, Block. The supporting cast includes Nils Poppe (Jof), Bibi Andersson (Mia), Inga Gill (Lisa), Gunnel Lindblom (Girl), Anders Ek (The Monk), Ake Fridell (Plog) and Erik Strandmark (Skat). Written and directed by Bergman, `The Seventh Seal' is a thought provoking, earnest meditation on faith and mortality that is filled with stunning metaphoric and visual images that will forever be indelibly inscribed in your memory. One scene in particular, in which the players link hands and, silhouetted against a twilight sky are led by Death in a dance across the crest of a distant hill, is breathtaking in it's simplicity. It stands (as does this entire film) as an example of why Ingmar Bergman is one of the greatest directors in the history of the cinema. I rate this one 10/10."
    },
    {
      "username": "CinemaClown",
      "userUrl": "https://www.imdb.com/user/ur20018357",
      "reviewLink": "https://www.imdb.com/review/rw6030517",
      "warningSpoilers": false,
      "date": "27 August 2020",
      "rate": "",
      "helpful": "8 out of 9 found this helpful.",
      "title": "An Allegorical Take On Life, Death, Religion, Faith & Existential Angst",
      "content": "Painting a grim portrait of the western world plagued by the Black Death, threading together several norms of the medieval era into a single setting, and addressing its themes by observing them through contemporary lens, The Seventh Seal is a fable of life, death, religion, faith & existential angst that, despite the allegorical treatment, makes sure its narrative remains somewhat accessible.Written & directed by Ingmar Bergman, one of the first things that stands out about this sermon is the dark & deathlike atmosphere the plot comes drenched in. Add to that, the whole premise of playing chess against the Grim Reaper with one's life on the line sounds interesting on paper. The story however piles on more subplots and digs deeper into the philosophical & spiritual elements that only slow down the ride.The crisp black n white cinematography is captivating throughout. Characters of all moods are present in the picture. The period details may not be appropriate but the gloomy aura is finely captured. And comfortably steering the film past the finish line are the sturdy performances, led by Max von Sydow who plays a knight locked in a game with Death itself, latter personified by Bengt Ekerot. And the scenes between the two are easy standouts.Overall, The Seventh Seal is actually easier to navigate than what I was expecting, and the parallels viewers can draw between the medieval pandemic and one we're dealing with currently makes the journey rather intriguing. Nonetheless, the relaxed pace & numbing speeches still made it a frustrating sit for me and failed to strike an emotional chord. As is the case with previous Bergman entries, I do get its legacy & repute but don't feel any personal love for it."
    },
    {
      "username": "Captain_Couth",
      "userUrl": "https://www.imdb.com/user/ur0361658",
      "reviewLink": "https://www.imdb.com/review/rw0062677",
      "warningSpoilers": false,
      "date": "19 November 2003",
      "rate": "10",
      "helpful": "89 out of 134 found this helpful.",
      "title": "Top ten favorites. The Seventh Seal.",
      "content": "Seventh Seal (1957) is one of my favorite movies. I have to rank it up there with A Touch of Zen, Seven Samurai and Battleship Potemkin. If there ever was such a thing as a perfect film, this one would have to be a nominee. I've never seen such a picture (and I probably never will) that was so moving, well shot, written, acted and directed. The chess game between the knight and death is an all-time classic. Words cannot describe how great this film is. There will never be another one like it. Truly amazing piece of celluloid.A knight and his squire are returning home from the crusades. For the past few years he's been in the middle east fighting for Christ. On his trip home he notices a familiar face, one that he has seen many times on the battlefield. It is death and it wants him to come with him to his new home. The knight strikes a bargain with death, they'll play a game of chess if he can defeat death then he'll spare his life as well as the squire's. Death is amused by this unusual challenge and accepts it. But as long as the game is on the life will continue to live. So he uses this time to look back at life and realizes how precious it is. Along the way he meets a young couple, they're from a performing troupe. They have a baby and are content with life. The husband has visions and can see interesting things like the Virgin Mary and little Jesus. He can also see the darkness that lies ahead as Black Death ravages the countryside. Will the knight defeat Death? Can the couple weather the storm of chaos that lies ahead? To find out you'll have to watch The Seventh Seal, one of the finest films ever made.If Bergman never made another film this one would have made him a legendary film maker. But he continued to make even more classic cinema. This one however is his finest work.My highest recommendation possible."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2666810",
      "warningSpoilers": false,
      "date": "31 August 2012",
      "rate": "10",
      "helpful": "21 out of 30 found this helpful.",
      "title": "Fully deserves its rep as a masterpiece",
      "content": "This is one amazing film, and in my view Ingmar Bergman's best. Visually, The Seventh looks wonderful, the bleak scenery adds much to the mood, the cinematography is beautifully composed and skillful and the lighting is atmospheric. It also has many memorable images like with the flagellates, the hawk flying in the cloudless sky, Jof's vision of the Virgin Mary and the milk and strawberries in the dusk. Bergman's direction is superb, Erik Nordgren's score is resolutely haunting and the dialogue is some of the most thought-provoking I've heard with some nice bawdy humour with especially the squire that doesn't feel misplaced. The story is like an allegory and meditation of life, death, love and fear(amongst other things), and it is dealt with in a very intelligent and careful manner. Again there are some timeless scenes like the ending, the scene of the girl about to be burnt, Death being challenged to a game of chess and with the jester. The acting is also exemplary, Max Von Sydow gives one of cinema's finest performances, stoic yet always commanding with a face that speaks volumes about what he's thinking. Bengt Ekerot evokes chills as Death, while Gunner Bjornstrand is suitably dry as the squire. All in all, a really amazing film, fully deserving of its reputation. 10/10 Bethany Cox"
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0062636",
      "warningSpoilers": false,
      "date": "11 October 2001",
      "rate": "",
      "helpful": "53 out of 79 found this helpful.",
      "title": "Filled With Memorable Images",
      "content": "This classic is filled with a lot of memorable images - from the opening scenes on the seashore to the effective concluding shots, creative thoughts are combined with some fine camera work. There are several significant or interesting questions raised by the characters - from the imagery of the \"Seventh Seal\" in Revelation, to their simple but important concerns about eternity - but it is the way that the visuals play off of the ideas that make the movie so worthwhile.The recreation of the medieval world is convincing and effective, with a lot of detail to set off a varied assortment of characters with different personalities and perspectives. The characters are not necessarily very deep, but most are interesting, and are worth caring about. The ways that they deal with their discouraging situation make you wonder what it would have been like to live in their world. It's also a movie that in some respects is even better to watch over again, after you already know what has happened and can then pick up even more of the detail and imagery.No doubt the somber tone and slow pace will always keep it from being widely popular, and it's not perfect, but it's satisfying in a different way, and deserves its reputation as a classic."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw1467987",
      "warningSpoilers": false,
      "date": "5 September 2006",
      "rate": "6",
      "helpful": "33 out of 49 found this helpful.",
      "title": "Death never takes a holiday...",
      "content": "While I'm not going overboard in extolling the virtues of THE SEVENTH SEAL, I do think it has some striking imagery and had the potential to be the ultimate work of art Ingmar Bergman was obviously striving for. But do I think he achieved it? No...for the simple reason that it leaves us unenlightened on the subject with no new knowledge.Bergman really has no answers to the age old questions we all have about life and death and what happens in the hereafter. And giving Death a human face seems to me the wrong decision on Bergman's part. He should have kept him a hooded spectre and nothing more--faceless and unknown within the shadows of his hood. Humanizing him doesn't work, at least not for me.A cruel streak runs through some of the more boisterous moments, such as when one of the actors is put through some hazing by a sadistic man who later gets his comeuppance. Everyone laughs and applauds as the man is humiliated beyond the endurance of this spectator for the sake of bawdy humor which seems forced and contrived, as does much of the clowning by the group of actors.But there are so many good things about the richly photographed film, that I don't want to give this review an entirely negative impression. But the truth is it offers no new insights into the age old questions of life and death. It's all presented as an allegory with religious symbols (flagellation, the cross, the witch burning) and we suspect that among the many utterances we hear from The Devil will be something to ponder and think about. But no. There's only the hopelessness that Death offers when the plague is rampant over the land and is something which cannot be avoided by man, no matter how clever he thinks he is. The chess game that the Black Knight proposes is a ruse that the Devil sees through from the start. And we suspect near the end that he knows the young couple with the infant have escaped since he says that he knows all that is happening, even behind his back. The young couple will be doomed too, eventually. Death will consume all.But Max van Sydow is excellent as The Knight questioning his reason for being and his reason for dying. The B&W cinematography evokes the Middle Ages with striking scenes that stay in the mind afterwards and the film, while bleak and disturbing, is always riveting to watch.It's a very engrossing film, but there are many weaknesses. I don't consider it the masterpiece that so many others label it."
    },
    {
      "username": "JoeKarlosi",
      "userUrl": "https://www.imdb.com/user/ur3441650",
      "reviewLink": "https://www.imdb.com/review/rw2019881",
      "warningSpoilers": false,
      "date": "8 February 2009",
      "rate": "5",
      "helpful": "68 out of 105 found this helpful.",
      "title": "The Seventh Seal (1957) **",
      "content": "Let me make this pretty quick -- a friend brought this Ingmar Bergman \"classic\" to the house last night (on Blu-ray), and it was my first experience with this acclaimed filmmaker. All I can say is, I was immediately struck by the cinematography, and I started getting interested in the idea of a knight (Max Von Sydow) playing chess with \"Death\" himself, as a means of deciding the fate of his own soul.... but that's as far as it went.From then on, nothing made much sense and the noble core idea of the film (presumably about questioning death, and the existence of God) seemed to go out the window, as we spend our time with secondary characters I just could not become interested in. I wanted to focus more on Max von Sydow's troubled crusader and his crisis of faith, especially since I myself am presently going through some personal bouts of despair in my personal life with my own crosses to bear... but he was only sparingly used, and I just could not follow any type of coherent storyline to this thing, for all its pretty picture style. There was no story, just images... and it's not that this approach never works for me in other films, but it didn't connect for me this time. I can't say that this is going to be my last visitation with Bergman, but this is not a promising start, considering this is allegedly one of his greatest works, if not THE greatest. Apologies to Woody Allen. Okay, let the slings and arrows fly. ** out of ****"
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw3101551",
      "warningSpoilers": true,
      "date": "9 October 2014",
      "rate": "3",
      "helpful": "83 out of 141 found this helpful.",
      "title": "Death takes knight, checkmate.",
      "content": "I suppose one has to view the reputed great classics of cinema to sort of test one's critical faculties against established standards and coming to this iconic film I was certainly aware of some of its famous imagery, in particular that of the soldier playing chess with Death, but nothing more than this. It does make for an arresting start to the film but after that I found it rather heavy going I must say.Once said soldier Max Van Sydow treks after the family of travelling performers, I struggled to make sense of the narrative as the film follows a picaresque trail of incidents such as as the backstage seduction of a fellow-performer's wife, the humiliation of the travelling husband at an inn and the death by fire of a young female witch. Where exactly are they all headed? Well, with Death silently and unobtrusively along for the ride, I think I get the inference; nobody lives forever.Mind you, I guess in all of it there's lots of stuff I'm still missing about faith, relationships, class, superstition and the human spirit, the meaning of life in short, but I'm afraid much of its symbolism passed me by. It is well shot in black and white and language-barrier notwithstanding appears to be well played with the actors certainly giving life to their individual characters, Van Sydow in particular, but I found the bitty, episodic development of the story as mystifying and unsatisfying as the higher allegorical meaning striven for.In fact the only really memorable scene for me was the chess match, which of course I knew about already, so really there was no need for me to watch the rest of it and I'm kind of sorry I did.Not my cup of tea, I'm afraid."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1102591",
      "warningSpoilers": false,
      "date": "13 June 2005",
      "rate": "9",
      "helpful": "16 out of 24 found this helpful.",
      "title": "Really weird but worth seeing for the experience",
      "content": "This is a strange movie--period! However, it is also one of the most parodied films and for that reason alone it is worth seeing! Now, on to explain the part that is parodied: A man is returning from war in the time of the Reformation and the plague is about the countryside. The man meets the Angel of Death and is told it is him time to die. The man asks if he can first challenge him in a game of chess--if the man wins, then his life will be spared. The Grim Reaper, not wanting to be a spoilsport, agrees and they play a game that starts and stops again and again. This exact same contest has been used in Bill and Ted's Bogus Journey, the cartoon series The Grim Adventures of Billy and Mandy, and an experimental film De Düva: The Dove (starring Madeline Kahn among others). In the Bill and Ted movie, they did not play chess but a series of games including Battleship and Twister! In The Dove, it was a badminton game! I can't remember what the game was in the cartoon series, but instead of their deaths, the children played the Grim Reaper over the soul of their pet hamster! Isn't is weird how this art film has appeared again and again and in the silliest of places! Give it a try to see the FIRST death-match and because it is a good film--with excellent performances all around--from Max Von Sydow to all the supporting players. Also, do not give up on the film too quick--I did and only saw it all years later when my sister-in-law convinced me to give it another try!"
    },
    {
      "username": "johnmbale",
      "userUrl": "https://www.imdb.com/user/ur4830672",
      "reviewLink": "https://www.imdb.com/review/rw1349857",
      "warningSpoilers": false,
      "date": "23 April 2006",
      "rate": "10",
      "helpful": "80 out of 112 found this helpful.",
      "title": "Bergman's Brilliance Abounds",
      "content": "What makes The Seventh Seal - an apocryphal and uncompromising fable of medieval Sweden - one of the masterpieces of Cinema ? Ingmar Bergman creates a believable world of dark happenings, wherein Death can play chess with a Knight, witches burn at the stake, with flagellants, and plague ever present. Through superb black and white images, each carefully composed for maximum effect, sets and costumes, his fine actors seem to truly inhabit this frightening world. Max von Sydow, Gunnar Bjornstrand, and Bengt Ekerot lead a marvelous cast. But its not all doom and gloom, as the Knight tries to determine in his quest, the meaning of life, and if God exists at all. There are moments of sheer happiness and peace, such as the sequence of the milk and strawberries at dusk, and a number of bawdy comic moments throughout the film. Which balances the darker side. It is unforgettable and I still remember seeing it on its first release, being stunned by the quality of the photography, and the performances. A restored version on DVD is recommended. Bergman is one of the great film makers of our time. Seldom today do we see such precise and considered images on the screen. Not to be missed."
    },
    {
      "username": "snazel",
      "userUrl": "https://www.imdb.com/user/ur1546574",
      "reviewLink": "https://www.imdb.com/review/rw0062639",
      "warningSpoilers": true,
      "date": "15 February 2002",
      "rate": "8",
      "helpful": "106 out of 145 found this helpful.",
      "title": "A Very Personal Rejection of a Religious Childhood",
      "content": "The story of Antonius Block is the story of an agnostic who has begun to doubt. Is life really meaningless? Is the only true ethic of life, to simply enjoy the moment? If God is there, why does he not answer? Why does he leave men with kind hearts and noble aspirations to fumble in the dark dying of the plague with no answers? Perhaps, Antonius reasons, the answers only come from Death.No wonder then, that as Death approaches him, he cajoles the spirit to play a game with him. His intentions are to win, but most importantly, to find answers. The little I know of Bergman's youth, the Paladin (Antonius Block) seems to symbolize Bergman's last struggles with his strict religious instruction as a child. Antonius' struggles, Antonius' angst, Antonius' withering agnosticism is a reflection of where Bergman was philosophically at this early stage in his life and career.The climax of the film is of course the final 'duel' with Death. Antonius attempts to cheat death and in the end, death cheats him. This is an especially crushing defeat for Antonius, because the answers Death gives him, about the knowledge within Death itself, is Antonius' worst fears come true.It struck me, that in the final moments, when each character faces there own mortality right in front of them, that the strongest and purest reaction of them all, is the one from the squire, the atheist voice in the film. I think if you are an atheist, this film is going to please you, because clearly the sanest characters in this film are either indifferent or deny God's existence entirely.Whether it was intentional or not, I think Seventh Seal is a very personal film. Bergman deconstructs his father's teachings to us openly. There's nothing sublime here; this is a clear rejection of religion and the notion that death somehow provides 'answers'. The only answers, according to this film, lie in life and not death. A message Bergman delivers to us in striking fashion. A message Bergman knows directly contradicts what he was taught as a child.I think this is why later in life, Bergman disowned this film. I think he saw too clearly, how much of a very personal statement it was and how in some cases it was a vindictive film against his parents. It's why I believe, Bergman, couldn't stand to watch it later in life, after he had reconciled with his parents.While Bergman disowned it, for the rest of us, we can admire it. For us, the Seventh Seal is simple genius. A dark, but beautiful film, that is pure and meaningful, because it is so very personal. I confess, I am a layman and I know little of Bergman's work and indeed have only seen this film once. But, I loved this film. It struck a very personal reaction in me, however uninformed that reaction might be. That reaction, pure and simple is that this movie is a very personal statement about life, God and death."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3606451",
      "warningSpoilers": true,
      "date": "26 December 2016",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "\"I live now in a world of phantoms, a prisoner of my own dreams.\"",
      "content": "On the Criterion Collection interview with Ingmar Bergman, he relates that he wrote the chess scene over his own fear of dying. This would have been an immensely interesting idea to explore, but after he mentions it, the interview is practically over. That left me rather frustrated.The film itself may also leave one rather frustrated, as it explores the principal character agonizing over God's unwillingness to show His face and answer his existential questions about the meaning of life and the certainty of death. When Death (Bengt Ekerot) makes his entrance to claim him a victim, Antonius Block (Max von Sydow) challenges the Grim Reaper to a game of chess, the winner to exact his own reward. The Knight must quickly readjust his game plan after he unwittingly reveals his strategy to the black clad harvester of souls.The film is set during the time of the Black Plague, following a 'worthless' crusade of ten years that the Knight and his Squire Jons (Gunnar Bjornstrand) participated in. All around them are wanderers half crazed with fear at the thought of the Plague approaching. All the time Death appropriates his victims, he claims to know nothing and hold no secrets. Fearing his own demise, Block (Bergman?) disrupts the chess board, intent on prolonging his existence in a world full of uncertainty.\"The Seventh Seal\" is Bergman's stunning allegory of man's search for meaning, but what I've come to understand after many years is that each person must come to terms with himself from within. Attempting to extract answers from a single source is bound to end in disappointment, trapped if you will in a Knight's world of phantoms and dreams more like nightmares. This is the kind of film that presents more questions than answers, as I'm sure Bergman understood and intended."
    },
    {
      "username": "GiraffeDoor",
      "userUrl": "https://www.imdb.com/user/ur98906416",
      "reviewLink": "https://www.imdb.com/review/rw4878102",
      "warningSpoilers": false,
      "date": "21 May 2019",
      "rate": "3",
      "helpful": "21 out of 33 found this helpful.",
      "title": "I keep an open mind often enough. I'm calling this one out as superficial.",
      "content": "For a movie in which a knight literally plays chess with death, this is pretty bland.Nothing happens but a bunch of bland characters just chatting.I don't care if it explores the theme of death or antithesis or something. A subtext is not the same thing as substance. In summary, despite its reputation for being nuanced, ambitious cinema, I feel that amidst its ambition it is lacking in various signifant aspects such as pacing and chatacterization and that it doesn't have as much nuance as it thinks it does."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0975358",
      "warningSpoilers": true,
      "date": "9 December 2004",
      "rate": "8",
      "helpful": "41 out of 66 found this helpful.",
      "title": "Intelligent and accessible with incredible imagery",
      "content": "'I live now in a world of ghosts, a prisoner in my dreams', a line spoken by Antonius Block (Max Von Sydow) in 'The Seventh Seal' is also a good descriptor of this critically lauded film. Directed by Ingmar Bergman, the film explores, through an allegorical fashion, human relationships and the struggle with ones own psyche. Block is a knight on his way home from the Crusades who becomes increasingly disillusioned while surveying his country, which has been ravaged by the Black Plague. Along the way he avers that he doesn't care about anyone, and questions the existence of a God who could allow these things to happen. In the beginning of the film he meets Death, who informs him that it is his time. Block manages to push off Death for a little while by distracting him with a chess game while he travels home; encountering several different characters, but Death is always following close behind until the inevitable end of the game. Bergman's style is not straight forward, rather quite symbolic and philosophical. The imagery at times is astounding, and I still (a month after seeing the film for the first time) see the image of 'the dance with Death' in my head when I think of the film. However, what I discovered was that this film carries with it a lot of intellectual and philosophical baggage that is not necessarily warranted. Nothing is really spelled out in this film, but it was much more easily 'accessible' than I thought it would be; I assumed I would have to put on my 'Affected Art House' hat on to watch it and nothing could be farther from the truth. Steeped in beautiful irony, the film, while having the pervasive specter of Death hanging over it, really celebrates life through its characters and their unusual circumstances. It is truly unfortunate that the powerful image of man playing chess with Death has become such a cliché, and oft repeated in some ridiculous manner or another. Bergman directed a thought-provoking and beautiful film with 'The Seventh Seal', and I personally look forward to seeing it again, this time not to grasp the story, but to marvel at the incredible images. I would recommend this film to anyone, but I especially highly recommend it to those who consider themselves students of film  it will give you a lot to chew on. 8/10--Shelly"
    },
    {
      "username": "kenjha",
      "userUrl": "https://www.imdb.com/user/ur2590596",
      "reviewLink": "https://www.imdb.com/review/rw2187712",
      "warningSpoilers": false,
      "date": "7 January 2010",
      "rate": "5",
      "helpful": "20 out of 32 found this helpful.",
      "title": "Everything but the Kitchen Sink",
      "content": "It is said that one can't avoid death and taxes. In this much praised allegorical film, a man tries to avoid death. Perhaps a film about a man avoiding taxes would have been more amusing. This film is episodic rather than having a narrative flow. It seems Bergman made a checklist of all the important themes and made sure he touched each one: love, marriage, infidelity, family, society, crime, punishment, and, of course, god and death. It is populated with Bergman regulars, including von Sydow as a knight who spews platitudes every time he opens his mouth. The cinematography is impressive. Otherwise, it's tough going for those who are not Bible scholars."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0062644",
      "warningSpoilers": true,
      "date": "30 April 2002",
      "rate": "",
      "helpful": "23 out of 44 found this helpful.",
      "title": "Folded Narrative Folding",
      "content": "Spoilers herein.Bergman is much loved because of his sheer passion, its intimate rawness and the ability to present it visually. He was able to sustain that uncomfortable ability for decades, but this film also has something else -- unique in his work -- a particularly complex narrative architecture.Ordinary stories are just there, with no recognition of being told: but those are remarkably uninteresting. Nearly everything worth reading, hearing or seeing has some sort of the recognition of telling, often by putting the telling explicitly in the story as in `Hamlet.' Sometimes it gets turned on its head when the telling element becomes the focus, as in `Rosencrantz and Guildenstern.'But here that notion of one fold in space becomes seven. The story we see is: a game, a collection of visions, a mural, a book of the Bible, a performance by players, an obsessive religious ritual, and the movie itself (the seventh seal). Each encapsulates the other. We have seven characters that advocate or represent each of these, apart from the `crusade' of real life.This is so complex and so finely woven it changed the entire world. Everything that came after sees it as perhaps an unwelcome spectral visitor, perhaps a template (see `Ninth Gate'), perhaps as a stack of parts from which one borrows. But everyone sees it and is changed.My favorite working filmmaker is Greenaway. He says of this, that when he saw it, he knew he had to be a filmmaker. I believe most of us who actually see this will be similarly changed. Bergman was never able to weave as fine a narrative lace again."
    }
  ],
  "errorMessage": ""
}