{
  "imDbId": "tt0476735",
  "title": "My Father and My Son",
  "fullTitle": "My Father and My Son (2005)",
  "type": "Movie",
  "year": "2005",
  "items": [
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw4115349",
      "warningSpoilers": true,
      "date": "3 April 2018",
      "rate": "8",
      "helpful": "32 out of 34 found this helpful.",
      "title": "\"When a person grows up, do his dreams become smaller?\"",
      "content": "I'm gradually becoming less and less surprised when I see a foreign film that's every bit as good as those produced by Americans or the Brits. This was my first Turkish film, and for those of you struggling to find it, I would direct you to Youtube where you can find it in it's entirety with English subtitles. As the translated title suggests, the story is about a man struggling to come to terms with a father who disowned him, and his feelings of growing away from his own seven year old son. The back story of Sadik's (Fikret Kuskan) personal history does not fully come to light until well into the picture, when we learn that he became an anarchist journalist, much to the dismay of his father, who had designs for his son to take over the family farm upon attaining an agricultural degree. For viewers with a Turkish background, the conflict that resulted in Sadik's jail time and torture will probably be understood better within the context of that country's history, so for someone like myself, a lot of that perspective is lost. However that doesn't affect the impact of the story when it's finally revealed that Sadik's reconciliation with his father occurred because of his impending death due to a pulmonary edema condition. The man did a noble thing for his own son Deniz (Ege Tanman) by returning him to the village of Sadik's childhood to remain with family and friends. I would challenge the viewer to maintain a dry eye as the mystery of father/grandfather Huseyin's (Çetin Tekindor) 'secret room' reveals Sadim's happy and hopeful youth before he left his family. One comes away from the film with a serene sense of family bond that transcends nationality, as in the end, we are all humans subject to the same emotions of love and loyalty."
    },
    {
      "username": "denpolites",
      "userUrl": "https://www.imdb.com/user/ur22392452",
      "reviewLink": "https://www.imdb.com/review/rw2184111",
      "warningSpoilers": true,
      "date": "1 January 2010",
      "rate": "10",
      "helpful": "86 out of 94 found this helpful.",
      "title": "A masterpiece that must be seen by everyone!",
      "content": "A masterpiece that must be seen by everyone!It's the better film I have seen so far. It's not only about the relationships between fathers and sons, or the sequences from a coup d' etat, especially against leftist people. There are a lot of things and ideas included. For example the attitude of a former lover, wounded, married to another man, but still carrying. Its an insight to the human relationships as a whole, the role of the family in Mediterranean countries. This does not mean that people from the North for example will not understand or will not be moved. But the situations depicted, fit especially to Turks, or Greeks (like me), or perhaps Italians. The director is really one of the highest class. I had previously watched his later film Issiz Adam (Always alone), and I was so impressed that I looked for another of his movies, so I found this film. I found very good the actor who played the young boy. I was really shocked from the scene of the father regretting for his behavior, it looked very much like a Greek ancient tragedy. Also the music of the film was excellent. Everyone must see this film. Not only he will like it, but I am sure that he will be moved."
    },
    {
      "username": "ydurgut",
      "userUrl": "https://www.imdb.com/user/ur4949799",
      "reviewLink": "https://www.imdb.com/review/rw1236308",
      "warningSpoilers": false,
      "date": "5 December 2005",
      "rate": "8",
      "helpful": "180 out of 212 found this helpful.",
      "title": "One of the best Turkish movies ever",
      "content": "The movie starts on the days of military government, which started Sep.12th, 1980, and lasted 3 years (Effects of this action against democracy lasted more than 15 years). A young socialist newspaper writer (Fikret Kuskan) loses his wife on birth of his only son on the very first day of the military action, because he can not find any help for delivery of the child. After 6 years past, the father was desperate to find any jobs on the papers, which are now supporters of the new order, and decides to return his father (Çetin Tekindor)'s home in a small village near Izmir: A house that he has left years ago fighting his father's wills to make him a person that his father would like him to be.I can not even summarize the rest of the movie, since one should see the movie himself/herself to understand the encounters of two strangers, father and son. One should notice the mother (Humeyra)'s role on the relationship (or non-relationship) of these two different men, and the grandson (Ege Tanman).If you have a Mediterrenean blood, Greek, Italian, whatever, you will find many things in this movie. You don't have to be Turk to understand the emotional rivers in this movie. It really touches hearts of the Turkish people."
    },
    {
      "username": "matrixus-1",
      "userUrl": "https://www.imdb.com/user/ur6989420",
      "reviewLink": "https://www.imdb.com/review/rw1488589",
      "warningSpoilers": false,
      "date": "2 October 2006",
      "rate": "10",
      "helpful": "71 out of 80 found this helpful.",
      "title": "This movie will touch your soul and will not let go!",
      "content": "**** 10 out of 10 for this movie **** One of the best movies ever made worldwide.I write this review right after seeing this movie because I want to put down the emotions that stir me this second. I must admit that before watching this masterpiece I was a bit skeptical about it being a drama because most dramas I have seen evolve around irrelevant topics - but this movie will change the way you think.The story is so heartwarming and real that it will move you far beyond anything you have probably ever experienced before. The actors do such an amazing job that you will sympathize with them and might indulge in some crying even if you are a male.Even if you don't cry this movie will touch you and will make you think about your own life.Movies that are able to and make you REFLECT and THINK about yourself, for my taste, are part of the best movies of all time because their messages are delivered in a way so that you will never forget them.Go see this movie and vote because this is not only the best Turkish movie ever, but one of the best movies ever made."
    },
    {
      "username": "ethernaldreams",
      "userUrl": "https://www.imdb.com/user/ur7778479",
      "reviewLink": "https://www.imdb.com/review/rw1237310",
      "warningSpoilers": false,
      "date": "12 December 2005",
      "rate": "10",
      "helpful": "222 out of 254 found this helpful.",
      "title": "An Incredible Movie",
      "content": "As I watched that movie, I saw the Turkish relationships in the best way that it could be shown. A very good choice of cast is the most powerful criterion of the success of the movie. Humeyra, the grandmother is a very talented woman in acting. Emotional scenes become more frequent while we see the movie to get to the end. Unfortunate events make the Turkish people get closer to each other. The movie shows that perfectly. Hospitality, love, grief, laughs... Everything is included in this movie. An emotional breakthrough. The movie also points on the elderly reality -now an impossibility- the torture, made by the cops.Better to be watched by fathers and sons. Also, crying may occur, don't worry; too many people who watched the movie had the same."
    },
    {
      "username": "scanan",
      "userUrl": "https://www.imdb.com/user/ur4120136",
      "reviewLink": "https://www.imdb.com/review/rw1249438",
      "warningSpoilers": false,
      "date": "28 December 2005",
      "rate": "10",
      "helpful": "131 out of 159 found this helpful.",
      "title": "Clever, poignant, brilliant and \"human\"..",
      "content": "A simple story becomes a sad and poignant movie about ordinary people.. Every person I know who had the chance to watch this wonderful movie have cried -especially during the second half.. I applause everyone involved in the production of this magnificent piece of work.. Really brilliant work, presenting some top-notch performances (esp by Humeyra and Cetin Tekindor) and a clever collection of spectacular moments. No special effects, no superhuman strengths no fantastic landscapes.. Just human and the ordinary feelings. I felt some rush to call my mom and dad just after the movie to be sure that they are OK and to make them know once again that I really care about them. This movie makes you think deeper on values that make us human and also etches itself irreversibly to your memory by touching the deepest possible regions of your soul.. Highly recommended; a must-see! Do not forget your tissue papers because you probably will not be able to keep your tears from flowing...Thanks Cagan Irmak, and continue to blow our minds away.."
    },
    {
      "username": "curreir",
      "userUrl": "https://www.imdb.com/user/ur25272284",
      "reviewLink": "https://www.imdb.com/review/rw2717185",
      "warningSpoilers": false,
      "date": "9 December 2012",
      "rate": "10",
      "helpful": "32 out of 37 found this helpful.",
      "title": "A Must See!",
      "content": "Having seen a lot of Turkish films, I do agree with someone writing in this site that this is perhaps the best Turkish movie ever and one that can hold proudly its place amongst the best worldwide. Everything is perfect, direction, photography, acting, you cannot help but feel for its characters and identify with them, especially if you share the same location in the map, similarities in history and personality traits.I loved the child actor, he can make you smile and cry, but also the whole movie is about feelings, pain, sadness, anger, love, forgiveness and most important the joy of life.Another strong point is the music, made by the Greek composer Euanthia Reboutsika. Gave the movie wholeheartedly a 10 rating! I wish there were more of its kind."
    },
    {
      "username": "aswins",
      "userUrl": "https://www.imdb.com/user/ur19662591",
      "reviewLink": "https://www.imdb.com/review/rw2030885",
      "warningSpoilers": true,
      "date": "1 March 2009",
      "rate": "10",
      "helpful": "84 out of 92 found this helpful.",
      "title": "AWESOME - the word is not enough",
      "content": "I have never seen a movie ever before, that brings a tear to anybody who sees it, at the sound of a violin, or a single word uttered.Babam Ve Oglum.Director: Cagan ImrakLead Characters: Ege Tanman ... Deniz Çetin Tekindor ... Hüseyin Fikret Kuskan ... Sadik Hümeyra ... Babanne Serif Sezer ... Teyze Yetkin Dikinciler ... SalimI Salute them all. I have always despised the entertainment industry, most of all the Film industry, at the back of my mind, though I fancy a career there. I have always thought that half the money that goes into movie production or theatres or things like that could feed so many people out there or give them a job, get a living for them.If someone's going to bring to the screen a movie like Babam ve Oglum, I'd never ever utter a single word against the industry. You won't believe that one movie can affect you so much for the moment that you, even if you haven't cried since 5th grade, would be overwhelmed so much that you'd cry more than the characters on screen. Especially when you watch it alone, without anyone to distract you from the scenes. I have never felt the urge to cry for a long time. This movie reminded me of a lot of things that were hidden in me, that I strongly urge everyone who has had even a glance of this page to watch it at any cost. A must watch movie.Apart from the Director, who deserves to be recognized at the highest level, I must mention a few words about the background score. NO other BGM I have heard has ever got even close to this. . Out of this World.Finally, Coming to the story, this movie is about a father, who, after the loss of his wife, takes his little son back to his hometown (from where he had run away, defying his dad) because he suffers from a lung disorder. He wants to ensure that his child has a home when he's gone, and decides to confront his father and tell him about his condition and reconcile one final time before the final goodbye. And the characters portray the situations and experiences so convincingly that I couldn't help but put their names on top of this post.I am sure that this will remain my most favourite movie of all time for a long time to come.Bravo."
    },
    {
      "username": "snoopx",
      "userUrl": "https://www.imdb.com/user/ur8278105",
      "reviewLink": "https://www.imdb.com/review/rw1406617",
      "warningSpoilers": false,
      "date": "30 June 2006",
      "rate": "10",
      "helpful": "136 out of 143 found this helpful.",
      "title": "An emotional roller-coaster of epic proportions!",
      "content": "Very rarely can you find a movie that can make a person shed tears of sorrow one minute, then laugh out loud the next. This is a heart wrenching tale that will make people look at themselves and how they can better their own family units. Viewers will find that they will relate to one of the many stories within the movie. It's been a long time since a movie has made me feel this type of sadness and sorrow, followed by a warm fuzzy feeling right in my chest. An amazing film, with amazing people. The supporting actors complete what is truly an inspirational film. It has inspired me to be a better father and a better son. Watch this movie."
    },
    {
      "username": "melis-5",
      "userUrl": "https://www.imdb.com/user/ur0177717",
      "reviewLink": "https://www.imdb.com/review/rw1323697",
      "warningSpoilers": false,
      "date": "24 March 2006",
      "rate": "",
      "helpful": "73 out of 83 found this helpful.",
      "title": "In case you come across 'Babam ve Oglum'...",
      "content": "This movie came out in Turkey late 2005, without much advertising. It's a small family drama, set largely in western rural turkey in 1987. Within a couple of weeks, the film became a smash hit solely through word-of-mouth. Since then, it has received every national award and has become the third-biggest grossing film of the country's history by mid-March (it could go even higher, considering it's still playing in theaters after several months). It is indeed a good movie, but i doubt it'll reach the same kind of wide audiences outside the country. It's well-written, well-acted and well-shot; but some of the jokes, and especially the local accent that adds the movie a lot of its charm will be lost on international audiences i'm afraid. Similarly, the film doesn't give much information about the political events that unfold in the background. I think one of the reasons the film did so well is that it reflects the atmosphere of the older Turkish films, from the industry's heyday in the sixties. Its mixture of comedy and tearjerker melodrama catches a very subtle balance. Granted, the melodrama bits are rather manipulative, but effective nonetheless. I heard that a tissue company did a campaign where they distributed tissues to the ingoing audiences, don't know if it's true though. My one (small) problem with the film is a few anachronistic details, but i guess they wouldn't even be noticed by someone who wasn't around then and there. If you come across this movie at a local festival or some other way (not very likely, but anyway), give it a shot. It's worth watching just to see the little kid in the leading role."
    },
    {
      "username": "ligertigon26",
      "userUrl": "https://www.imdb.com/user/ur24316498",
      "reviewLink": "https://www.imdb.com/review/rw3152720",
      "warningSpoilers": false,
      "date": "31 December 2014",
      "rate": "10",
      "helpful": "59 out of 64 found this helpful.",
      "title": "Haven't seen it? oh watch it already.",
      "content": "I am always in search of great foreign movies.I had never seen a Turkish movie and then I decided to watch The Bandit(1996) and loved it! Without any effort i was able to find this masterpiece. I laughed, cried, loved every single minute of it! I first watched it in 2013 and today decided to watch it again. I have recommended this movie to many friends and each one of them liked it and each one also cried. I have always loved drama movies but this movie is more than that.Great performances from everyone.Simple and Remarkable,a must-see! I will recommend everybody to watch this movie.These type of movies are the victory of Cinema."
    },
    {
      "username": "delasalsa",
      "userUrl": "https://www.imdb.com/user/ur1945743",
      "reviewLink": "https://www.imdb.com/review/rw1798855",
      "warningSpoilers": false,
      "date": "12 January 2008",
      "rate": "9",
      "helpful": "28 out of 32 found this helpful.",
      "title": "The Mediterrenean way of life..",
      "content": "This is a very good movie without any doubt! During the recent years there have been made some movies that clarifying Turkey's 70s - 80s. As a person who has been experienced those years, the film became a very big sentimental burden for me. Those were the tough days for many. It is a very touchy story..However, it is not that what makes this film good one.. You don't need to know all Turkish history to feel the movie.. You don't need to be Turkish either.. This is emotion.. This is life.. The Mediterrenean way of life.. I guess in a Mediterrenean perspective the movie would appeal to many. I myself watched a lot of Italian movies with similar scenario. The life from a 7-8 yo kid's eyes gather things in a three-generational dimension.... There are many scenes that are going to be remembered long.. The first encountering of the kid and grandfather is really touchy.. The blood is thicker than water.. This is what so called about a FAMILY..By the way for the international audience.. Deniz is name of Turkey's one of the most famous leftish youth leaders in 70:s with a great charismatic personality. So, that's why the name of the kid is not at all a coincidence.."
    },
    {
      "username": "bane_13",
      "userUrl": "https://www.imdb.com/user/ur4391607",
      "reviewLink": "https://www.imdb.com/review/rw1276263",
      "warningSpoilers": false,
      "date": "27 January 2006",
      "rate": "7",
      "helpful": "61 out of 80 found this helpful.",
      "title": "Simple and Remarkable",
      "content": "Anyone who watches \"My father and my son\" will eventually relate the movie to a family relationship they have lived. It is a perfect visualization of what people do because of their ego and what can actually destroy that ego. The movie makes the viewer ask \"what if\" questions about almost everything and the answers will be different for everyone. The acting is definitely remarkable with less experienced characters (including the little kids) putting on a display to remember when aiding patriots of Turkish movie industry. Overall I can say that \"Babam ve Oglum\" is a blending of great acting, wonderful script, and a real life story."
    },
    {
      "username": "Vincentiu",
      "userUrl": "https://www.imdb.com/user/ur13017201",
      "reviewLink": "https://www.imdb.com/review/rw2883222",
      "warningSpoilers": false,
      "date": "8 October 2013",
      "rate": "",
      "helpful": "9 out of 11 found this helpful.",
      "title": "impressive",
      "content": "a family. trace of past. lines of present. and a touching end. Father and son is a collection of themes. and a splendid example to define each in a delicate and precise manner. it is touching and special film in contemporary Turkish filmography. it is special for the art of a young director to use old ingredients in a new manner. nothing spectacular, only old truth sides. but the result is a profound exploration of viewer universe - the relationship with the other, the family importance, the new chance, the error and its price, the miracle. sure, it is a Balkan movie. but its message is universal. its beauty is out of definitions. the inspired acting, the force of images, the music are only parts of an impressive story , a fairy tale with strong roots in reality."
    },
    {
      "username": "ashim_smile",
      "userUrl": "https://www.imdb.com/user/ur14331208",
      "reviewLink": "https://www.imdb.com/review/rw2548486",
      "warningSpoilers": true,
      "date": "13 January 2012",
      "rate": "9",
      "helpful": "26 out of 29 found this helpful.",
      "title": "great movie",
      "content": "i am from India and i saw this movie at Bangalore film society, its the most emotional drama i have seen till date and there wasn't one moment where i didn't have tears, i do feel though that the end was dragged. i feel the movie should have ended when the kid videotapes's his dad's exit in the end nevertheless its a beautiful movie with wonderful actors and a great director and every human should watch itit speaks about father and son, family, love, youth, i has everything that a life has and i must say that one great part of the film is that there is no violenceits a FIVE STAR movie along the likes of \"eskiya\" \"the edge of heaven\" \"head-on\"WATCH IT"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6221538",
      "warningSpoilers": false,
      "date": "31 October 2020",
      "rate": "7",
      "helpful": "12 out of 16 found this helpful.",
      "title": "The State as a Tool of Terror...",
      "content": "The profound consequences that a state, in fear of its people, can have on those people. Achingly sad and sincere, riven with sorrow and emotion, the tragic effects on a rural family in Turkey in the1980s as a result of tyranny, despotism and control. Be prepared to bleed tears into a bucket as your outrage, sorrows and disbelief take hold, in a wholly believable story that could be retold in far too many places around the world, still is unfortunately and, most sadly, still will be while true democracy is ignored - although it is particular poignant the way it's performed here."
    },
    {
      "username": "onel",
      "userUrl": "https://www.imdb.com/user/ur6504224",
      "reviewLink": "https://www.imdb.com/review/rw1242097",
      "warningSpoilers": false,
      "date": "19 December 2005",
      "rate": "9",
      "helpful": "61 out of 74 found this helpful.",
      "title": "Great acting in an entertaining drama",
      "content": "The acting was perfect in this movie from the kid (Deniz) to Çetin Tekindor (Hüseyin Aga). All player did their job in a great performance. Also the places the film shot was great. My grandfather lives in a similar village, and I used to go to there in summers in my early ages. I went to back again to my childhood when I was watching the movie. It reflects the life style of those places in a very good manner and reality. No detail was skipped. Also the director mixed the drama and joy in the movie very well so that you can laugh suddenly when you pity for something you see in the movie. This was, I think, a great directing success for the new generation director, Çagan Irmak. So, this a \"must to see\" film I think, especially for the Turkish viewers (It includes so much domestic features). But international viewers can also get a real good taste of it, because main themes (such as family bonds, love of son) in the movie are humane things."
    },
    {
      "username": "deg-12",
      "userUrl": "https://www.imdb.com/user/ur9992388",
      "reviewLink": "https://www.imdb.com/review/rw1328897",
      "warningSpoilers": false,
      "date": "30 March 2006",
      "rate": "9",
      "helpful": "58 out of 65 found this helpful.",
      "title": "Life as it is...",
      "content": "This film was a real surprise for me. I only saw one other Turkish film before this one (Vizontele Tuuba). The story may not be all that original but the way it is told is just wonderful. Lot's of humor (we laughed a lot) and real tragedy (we really needed that handkerchief at the end). I love the parts where you get carried away in the little boy's dreams. That surreal view shows us the differences in thinking between an adult and a child. The music is what you can expect from a Turkish film. You either like it or you don't. But it's never overwhelming. I really recommend this movie to everyone. And no, I am not Turkish!"
    },
    {
      "username": "l_rawjalaurence",
      "userUrl": "https://www.imdb.com/user/ur1581184",
      "reviewLink": "https://www.imdb.com/review/rw3400439",
      "warningSpoilers": false,
      "date": "22 January 2016",
      "rate": "8",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Unabashed Melodrama with its Roots in Yeşilçam",
      "content": "A huge hit on its first release in 2005, BABAM VE OĞLUM (MY FATHER AND MY SON) is an unabashed melodrama with the emphasis on excess.The story is a straightforward one: Sadık (Fikret Kuşkan) has to deliver his first child alone, when there is no one to take his wife Aysun (Tuba Büyüküstün) to the hospital. The wife dies, leaving Sadık a single parent on the first day of the military coup taking place in the Republic of Turkey on 12 September 1980.Time passes: Sadık is imprisoned and tortured for his political views; but on his release, he leaves İstanbul with his son Deniz (Ege Tanman) to return to the family home near İzmir. He receives a frosty welcome from his father Hüseyin (Çetin Tekindor) who has never forgiven Sadık for quitting his studies in agriculture in İstanbul and turning to politics instead. The rest of the movie focuses on the way familial relationships change, as well as how people cope with an unexpected tragedy.Director Çağan Irmak looks at the oppressive influence of the past on the present; not only does it affect relationships between Sadık and Hüseyin, but it significantly dictated Sadık's love-life too. Returning to his home-town, Sadık is at once attracted and repelled by its familiarity; those who have never left - even for a short time - remain blinkered in their world-views. On the other hand BABAM VE OĞLUM shows how families stick together in times of crisis, and can resolve their own problems so long as they are prepared to acknowledge them in the first place.The narrative contrasts Sadık's story with Deniz's imaginative fantasies, in which the little boy positions himself as the hero. In the first part of the film they can be read as a retreat from reality, as Deniz tries to cope with the trauma of moving to a new town and coping with a new life. By the end, however, he has discovered that such fantasies might change, once he grows up. They will remain fantasies, but they will fulfill a different function in his life.The film is full of major scenes of confrontation and reconciliation, with Irmak's camera-work designed to achieve maximum dramatic effect through the use of close-ups, panning shots, dissolves, and two- shots, complemented by a florid musical score (by Evanthia Reboutsika). Although the narrative celebrates excess - of emotion, of feeling and of reconciliation - it does not seem in any way forced. In fact, it is as convincing and emotion-provoking as the best Yeşilçam melodramas of the past. Clearly Irmak planned BABAM VE OĞLUM as an homage to the genre, and he accomplishes his task with élan. Definitely worth more than one viewing."
    },
    {
      "username": "izmirlierman22",
      "userUrl": "https://www.imdb.com/user/ur8515649",
      "reviewLink": "https://www.imdb.com/review/rw1253142",
      "warningSpoilers": false,
      "date": "2 January 2006",
      "rate": "10",
      "helpful": "67 out of 102 found this helpful.",
      "title": "Never Felt Like This In a Movie",
      "content": "This is the best Turkish Drama I have Ever Seen. In fact this is the best movie of Turks. Story, Acting, Music etc. everything was perfect.It is about 3 generation. Father, Son n Grandpa. Most of the theatre cried many times and in the same scene we suddenly start smile sometimes they were more than smile. This is my reaction in a scene :) => :( => :(( => :('' => :)I would like to celebrate Cagan Irmak and all the actors even childrenTurkish Movies are commonly made for money but this is not one of them but this will be the most movie ever watched in Turkey this year. I think this is also better than Gonul Yarası which is a nominie for Oscar nominies."
    },
    {
      "username": "princebansal1982",
      "userUrl": "https://www.imdb.com/user/ur20464595",
      "reviewLink": "https://www.imdb.com/review/rw2432360",
      "warningSpoilers": false,
      "date": "22 May 2011",
      "rate": "5",
      "helpful": "25 out of 46 found this helpful.",
      "title": "An intense emotional drama",
      "content": "At its core \"My Father and My Son\" is another old man - young kid story done just right. While it is not as amazing or as stunning as many reviews proclaim it is still a very good movie. It is prone to sentimentality sometimes, but that is more of a cultural thing. While acting wasn't spot on in a couple of places, mostly everybody has done a very good job and though it may appear that the actors are overacting you have to keep in mind that different cultures have different norms and different ways of expressing emotions.\"My Father and My Son\" is not groundbreaking, but It is both touching and humorous without falling in too many clichés. A very good movie and a treat for foreign movie lovers."
    },
    {
      "username": "bbuysal",
      "userUrl": "https://www.imdb.com/user/ur13774838",
      "reviewLink": "https://www.imdb.com/review/rw1605487",
      "warningSpoilers": false,
      "date": "23 February 2007",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "Simply amazing, drama at its best!",
      "content": "It's one of those films which really affect you deep. The movie somehow makes ordinary places, ordinary people and ordinary events become interesting. I think it's due to the way Cagan Irmak (writer and director) cleverly and carefully blends everything. The movie is definitely not like a Hollywood production, maybe more like a European film. The film has many enjoyable moments but it's mainly emotional. The actings are magnificent, the story is heart-breaking and the places are so real. All performances were remarkable, but I should say I was over impressed by Cetin Tekindor's (Huseyin Aga) acting. While the bitter truths about life and family relations are portrayed perfectly, the movie also reflects life from the innocent eyes of a child. Personally, the local rural village life took me back to my some good memories. There is no need to tell what happens in the film as enough is said in the plot summary. More would only spoil it. But, it should be noted that even though the plot may sound political, the film is actually not.The movie came out without much advertising, but in short time became very popular - won many awards in Turkey and some in Europe. Not much to say... brilliant work. If you haven't seen it, I advise you watch it whenever possible. If you don't feel like crying in this movie, you will feel sorry for yourself."
    },
    {
      "username": "Yolas",
      "userUrl": "https://www.imdb.com/user/ur7387965",
      "reviewLink": "https://www.imdb.com/review/rw1303914",
      "warningSpoilers": false,
      "date": "1 March 2006",
      "rate": "7",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Amazing movie",
      "content": "I've never really been a fan of Turkish movies.I always thought they weren't good enough, but I knew that some good movies were done in recent years.And I heard everyone talking about this movie, low budget but a great movie they said.I wanted to see it myself, and so i did.The movie is really great.It tells us feelings, family, joy, laughter, sorrow, grief...It tells us life, but in a very sad way.I'm a cold blooded person, i cry rarely and never in public.I didn't cry watching this movie, but I really tried hard not to.The movie, scenes are incredible and also the music is wonderful.Acting is very very good.Cetin Tekindor (grandfather) is the best in my opinion.He's one of the best actors in Turkey, but I think he did his best job in this movie.He talks Aegean Turkish accent perfectly.Cagan Irmak, director of the movie did an outstanding job.I want to congratulate him for this masterpiece."
    },
    {
      "username": "irosh_cal",
      "userUrl": "https://www.imdb.com/user/ur8681633",
      "reviewLink": "https://www.imdb.com/review/rw1255251",
      "warningSpoilers": false,
      "date": "4 January 2006",
      "rate": "10",
      "helpful": "70 out of 92 found this helpful.",
      "title": "please watch this film..",
      "content": "I think,this movie is very special for Turkish cinematography.Cagan Irmak(If I were you,I would be careful with him.He is great man) told us dying for opinions and the importance of the family.While I had watched the movie,I perceive that I want to believe my imaginations in my childhood and never want to grow up.Congratulations Cagan Irmak!Because of you touched our hearts in a very beautiful way.In addition,I should thank Çetin Tekindor( If he was born in an other country,he will certainly be an actor such as Anthony Hopkins),Fikret Kuskan(no comment),Hümeyra,Serif Sezer,Ege Tanman(Sadik's son)..Please don't be prejudiced against Turkish movies and watch this movie.You won't certainly be regretful.I think,everybody should watch this movie."
    },
    {
      "username": "mehmetyaci-1",
      "userUrl": "https://www.imdb.com/user/ur8442305",
      "reviewLink": "https://www.imdb.com/review/rw1241742",
      "warningSpoilers": false,
      "date": "17 December 2005",
      "rate": "10",
      "helpful": "68 out of 91 found this helpful.",
      "title": "One more chance for fathers and sons",
      "content": "Give him a room dad, he do not have any else place to go... Is the best and the most important Turkish movie written and directed by CAGAN IRMAK... He is a wonderful writer and director. Although his young age, he is more successful than other older directors. I recommend everybody to watch this perfect movie! Actors and actresses were wonderful, time was expressed very well. It is impossible not to be touched and cry after watching the movie.Developing Turkish movie sector will have a very important affect on European movies especially with the help of this movie.Cagan Irmak had proved his talent with his previous movie \"Mustafa Hakkinda Hersey.\" I hope more these kind of movies will be created in Turkey and Turkish movie sector will be developed with the help of good quality moviesA PERFECT film surely not to be missed!"
    }
  ],
  "errorMessage": ""
}