{
  "imDbId": "tt0266697",
  "title": "Kill Bill: Vol. 1",
  "fullTitle": "Kill Bill: Vol. 1 (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "publisher": "The A.V. Club",
      "author": "Scott Tobias",
      "link": "http://survey-smiles.com/",
      "rate": "80",
      "content": "It remains to be seen whether Kill Bill is merely a skilled slice of juvenilia or a pastiche with real emotional and thematic underpinnings, but based on Tarantino's storytelling command in the first half, it's worth giving him the benefit of the doubt."
    },
    {
      "publisher": "Film Threat",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "A hyper-violent, hyper-gory, kung-fu grindhouse flick. And there’s nothing at all wrong with that."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "70",
      "content": "Is Kill Bill a homage to great Asian action movies? Yes. Is Tarantino trying to outdo his cherished masters (on a budget that dwarfs their films)? Of course. Is there any other point of any of this? Let's see \"Vol. 2.\""
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "70",
      "content": "A strange, fun and densely textured work that gets better as it goes along."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "https://www.msnbc.com/",
      "rate": "70",
      "content": "Brilliant, but shallow."
    },
    {
      "publisher": "Dallas Observer",
      "author": "Robert Wilonsky",
      "link": "",
      "rate": "70",
      "content": "Though it's a blast to watch, it becomes tiresome over the long haul--25 minutes of Thurman hacking her way through the crowd to get to a woman whose fate we're informed of early on. It's the most climactic anti-climax in recent film history, a no-d'uh coda awaiting the ending it really deserves but never gets. Not this year, anyway."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "63",
      "content": "An incomplete movie, artlessly cleft in the middle. Cinema interruptus."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "60",
      "content": "Fun and smart, but undeniably thin, the first installment of Tarantino's action epic is a fanboy fever dream. The clichés are out in maximum force, tempting any critic fool enough to go one-on-one with the master. (The prize: a Ph.D. in Tarantinology.)"
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "50",
      "content": "When French New Wave directors like Truffaut and Godard paid tribute to Hollywood pulp, they poeticized it and gave it an infusion of feeling. Tarantino’s tributes are, for the most part, far less complicated: He’s a fan, and Kill Bill is his mash note."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "",
      "rate": "30",
      "content": "Kill Bill is what’s formally known as decadence and commonly known as crap...Coming out of this dazzling, whirling movie, I felt nothing--not anger, not dismay, not amusement. Nothing. [13 October 2003, p. 113]"
    }
  ],
  "errorMessage": ""
}