{
  "imDbId": "tt0266697",
  "title": "Kill Bill: Vol. 1",
  "fullTitle": "Kill Bill: Vol. 1 (2003)",
  "type": "Movie",
  "year": "2003",
  "language": "en",
  "titleInLanguage": "Kill Bill: Volume 1",
  "url": "https://en.wikipedia.org/wiki/Kill_Bill:_Volume_1",
  "plotShort": {
    "plainText": "Kill Bill: Volume 1 is a 2003 American martial arts film written and directed by Quentin Tarantino. It stars Uma Thurman as the Bride, a former assassin who swears revenge on her ex-teammates (Lucy Liu, Michael Madsen, Daryl Hannah, and Vivica A. Fox) and their leader, Bill (David Carradine), after they leave her for dead. Her journey takes her to Tokyo, where she battles the yakuza.\r\nTarantino conceived Kill Bill as an homage to the 1973 film Lady Snowblood, grindhouse cinema, martial arts films, samurai cinema, blaxploitation and spaghetti Westerns. It features an anime sequence by Production I.G. Volume 1 is the first of two Kill Bill films made in a single production. They were planned as a single release, which Tarantino split into two films to avoid having to cut scenes. Volume 2 was released six months later.\r\nKill Bill was theatrically released in the United States on October 10, 2003. It received positive reviews and grossed over $180 million worldwide on a $30 million budget, achieving the highest-grossing opening weekend of a Tarantino film to that point.",
    "html": "<p>Kill Bill: Volume 1 is a 2003 American martial arts film written and directed by Quentin Tarantino. It stars Uma Thurman as the Bride, a former assassin who swears revenge on her ex-teammates (Lucy Liu, Michael Madsen, Daryl Hannah, and Vivica A. Fox) and their leader, Bill (David Carradine), after they leave her for dead. Her journey takes her to Tokyo, where she battles the yakuza.</p><p>Tarantino conceived Kill Bill as an homage to the 1973 film Lady Snowblood, grindhouse cinema, martial arts films, samurai cinema, blaxploitation and spaghetti Westerns. It features an anime sequence by Production I.G. Volume 1 is the first of two Kill Bill films made in a single production. They were planned as a single release, which Tarantino split into two films to avoid having to cut scenes. Volume 2 was released six months later.</p><p>Kill Bill was theatrically released in the United States on October 10, 2003. It received positive reviews and grossed over $180 million worldwide on a $30 million budget, achieving the highest-grossing opening weekend of a Tarantino film to that point.</p>"
  },
  "plotFull": {
    "plainText": "Kill Bill: Volume 1 is a 2003 American martial arts film written and directed by Quentin Tarantino. It stars Uma Thurman as the Bride, a former assassin who swears revenge on her ex-teammates (Lucy Liu, Michael Madsen, Daryl Hannah, and Vivica A. Fox) and their leader, Bill (David Carradine), after they leave her for dead. Her journey takes her to Tokyo, where she battles the yakuza.\r\nTarantino conceived Kill Bill as an homage to the 1973 film Lady Snowblood, grindhouse cinema, martial arts films, samurai cinema, blaxploitation and spaghetti Westerns. It features an anime sequence by Production I.G. Volume 1 is the first of two Kill Bill films made in a single production. They were planned as a single release, which Tarantino split into two films to avoid having to cut scenes. Volume 2 was released six months later.\r\nKill Bill was theatrically released in the United States on October 10, 2003. It received positive reviews and grossed over $180 million worldwide on a $30 million budget, achieving the highest-grossing opening weekend of a Tarantino film to that point.\r\nPlot\r\nIn 1999, the Bride, a former member of the Deadly Viper assassination squad, is rehearsing her marriage at a chapel in El Paso, Texas. The Deadly Vipers, led by Bill, attack the chapel, shooting everyone. As the Bride lies wounded, she tells Bill he is the father of her unborn child, just as he shoots her in the head.\r\nThe Bride falls into a coma. In the hospital, Elle Driver, one of the Deadly Vipers, prepares to assassinate her via lethal injection. Bill aborts the mission, considering it dishonorable to kill her while she is defenseless. The Bride awakens after four years and is horrified to discover she is no longer pregnant. She kills a man who intends to rape her and a hospital worker who has been selling her body while she was comatose. She takes the hospital worker's truck and teaches herself to walk again, vowing to kill Bill and the other Deadly Vipers.\r\nThe Bride goes to the home of the former Deadly Viper, Vernita Green, who now leads a normal suburban life. She and the Bride engage in a knife fight, which is interrupted when Vernita's young daughter arrives home. When Vernita tries to shoot the Bride with a pistol hidden in a box of cereal, the Bride throws a knife into her chest, killing her.\r\nThe Bride goes to Okinawa to obtain a sword from the legendary swordsmith Hattori Hanzō, who has sworn never to forge a sword again. After learning that her target is Bill, his former student, he crafts his finest sword for her. The Bride travels to Tokyo to find another Deadly Viper, O-Ren Ishii, now the leader of the Tokyo yakuza. After witnessing the yakuza murder her parents when she was a child, O-Ren took vengeance on the yakuza boss and replaced him after training as an elite assassin.\r\nThe Bride tracks O-Ren Ishii to a restaurant. She amputates the arm of her assistant, Sofie Fatale, defeats O-Ren's squad of elite fighters, the Crazy 88, and kills her bodyguard, the schoolgirl Gogo Yubari. O-Ren and the Bride duel in the restaurant's Japanese garden, and the Bride kills O-Ren by slicing off the top of her head. She tortures Sofie for information about the other Deadly Vipers, and leaves her alive as a threat. Bill finds Sofie and asks her if the Bride knows that her daughter is alive.\r\nCast\r\nUma Thurman as the Bride (code name Black Mamba), a former member of the Deadly Viper Assassination Squad, described as \"the deadliest woman in the world\". She seeks revenge on the Deadly Vipers after they try to kill her in a wedding chapel.\r\nLucy Liu as O-Ren Ishii (code name Cottonmouth), a former Deadly Viper who has become the leader of the Japanese Yakuza. She and the Bride once had a close friendship. She is the Bride's first target.\r\nDavid Carradine as Bill (code name Snake Charmer), the former leader of the Deadly Vipers, the Bride's former lover, and the father of her daughter. He is the final target of the Bride's revenge. He is an unseen character until Volume 2.\r\nVivica A. Fox as Vernita Green (code name Copperhead), a former Deadly Viper and now a mother and homemaker, living under the name Jeannie Bell. She is the Bride's second target.\r\nMichael Madsen as Budd (code name Sidewinder), a former Deadly Viper and Bill's brother, now working as a strip club bouncer and living in a trailer. He is the Bride's third target.\r\nDaryl Hannah as Elle Driver (code name California Mountain Snake), a former Deadly Viper and the Bride's fourth target. She is also Bill's new lover. Driver is based on Madeline (Christina Lindberg) in They Call Her One Eye.\r\nJulie Dreyfus as Sofie Fatale, O-Ren's lawyer, confidante, and second lieutenant. She is also a former protégée of Bill's, and was present at the wedding chapel massacre.\r\nSonny Chiba as Hattori Hanzō, a wise sushi chef and long-retired master swordsmith who agrees to craft a sword just for the Bride.\r\nChiaki Kuriyama as Gogo Yubari, O-Ren's sadistic Japanese schoolgirl bodyguard.\r\nGordon Liu as Johnny Mo, head of O-Ren's personal army, the Crazy 88.\r\nMichael Parks as Ranger Earl McGraw, a Texas Ranger who investigates the wedding chapel massacre. Parks originated McGraw in the Robert Rodriguez film From Dusk till Dawn, which Tarantino wrote and acted in. He would go on to reprise the role in both segments of the Rodriguez/Tarantino collaboration Grindhouse. Parks also appeared in Volume 2 as a separate character, Esteban Vihaio.\r\nMichael Bowen as Buck, an orderly at the hospital who has been raping the Bride while she lay comatose.\r\nJun Kunimura as Boss Tanaka, a Yakuza whom O-Ren executes after he ridicules her ethnicity and gender.\r\nKenji Ohba as Shiro, Hattori Hanzo's employee.\r\nKazuki Kitamura as Boss Koji, a Yakuza working for O-Ren. He also appeared as Bodyguard #2 in O-Ren's army, the Crazy 88.\r\nJames Parks as Ranger Edgar McGraw, a Texas Ranger and son of Earl McGraw.\r\nJonathan Loughran as Buck's trucker client, killed by the Bride after he attempts to rape her.\r\nYuki Kazamatsuri as the Proprietress of the House of Blue Leaves.\r\nSakichi Sato as \"Charlie Brown\", a House of Blue Leaves employee who is mocked by the Crazy 88, as he wears a kimono similar to the shirt worn by the Peanuts character.\r\nAmbrosia Kelley as Nakia \"Nikki\" Bell, Vernita's four-year-old daughter. She witnesses the Bride killing her mother, and the Bride suggests that if she still \"feel raw about it\" when she gets older, she should come find The Bride and confront her (presumably after learning about her mother's past as an assassin and her role in the wedding chapel massacre)\r\nThe 5.6.7.8's (Sachiko Fuji, Yoshiko Yamaguchi and Ronnie Yoshiko Fujiyama) as themselves, performing at the House of Blue Leaves.\r\nYōji Tanaka as Crazy 88 #3\r\nIssey Takahashi as Crazy 88 #4\r\nJuri Manase as Crazy 88 #6\r\nAkaji Maro as Boss Ozawah\r\nAi Maeda as O-Ren (anime sequence) (voice)\r\nNaomi Kusumi as Boss Matsumoto (anime sequence) (voice)\r\nHikaru Midorikawa as Pretty Riki (anime sequence) (voice)\r\nProduction\r\nWriting\r\nQuentin Tarantino and Thurman conceived the Bride character during the production of Tarantino's 1994 film Pulp Fiction; Kill Bill credits the story to \"Q & U\". Tarantino spent a year and a half writing the script while he was living in New York City in 2000 and 2001, spending time with Thurman and her newborn daughter Maya. Reuniting with the more mature Thurman, now a mother, influenced the way Tarantino wrote the Bride character; he did not come to the realization that the Bride's child could still be alive until the end of the writing process.\r\nHe originally wrote Bill for Warren Beatty, but as the character developed and the role required greater screen time and martial arts training, he rewrote it for David Carradine. Tarantino also considered Bruce Willis for the role of Bill. Tarantino decided to cast Daryl Hannah as Elle Driver after seeing her performance in the television film First Target. The physical similarities between Thurman and Hannah inspired how he wrote the rivalry between the characters. Michelle Yeoh met with Tarantino for a role in the film.\r\nAn early draft included a chapter set after the confrontation with Vernita in which the Bride has a gunfight with Gogo Yubari's vengeful sister Yuki. It was cut because it would have made the film overlong and added $1 million to the budget. Another draft featured a scene in which the Bride's car is blown up by Elle.\r\nFilming\r\nWhen Thurman became pregnant as shooting was ready to begin, Tarantino delayed the production, saying: \"If Josef Von Sternberg is getting ready to make Morocco and Marlene Dietrich gets pregnant, he waits for Dietrich!\" Although the scenes are presented out of chronological order, the film was shot in sequence. The choreographer Yuen Woo-Ping, whose previous credits include The Matrix, was the film's martial arts advisor. The anime sequence, covering O-Ren Ishii's backstory, was directed by Kazuto Nakazawa and produced by Production I.G, which had produced films including Ghost in the Shell and Blood: The Last Vampire. The combined production lasted 155 days and had a budget of $55 million.\r\nAccording to Tarantino, the most difficult part of making the film was \"trying to take myself to a different place as a filmmaker and throw my hat in the ring with other great action directors\", as opposed to the dialogue scenes he was known for. The House of Blue Leaves sequence, in which the Bride battles dozens of yakuza soldiers, took eight weeks to film, six weeks over schedule. Tarantino wanted to create \"one of the greatest, most exciting sequences in the history of cinema\". The crew eschewed computer-generated imagery in favor of practical effects used in 1970s Chinese cinema, particularly by the director Chang Cheh, including the use of fire extinguishers and condoms to create spurts and explosions of blood. Tarantino told his crew: \"Let's pretend we're little kids and we're making a Super 8 movie in our back yard, and you don't have all this shit. How would you achieve this effect? Ingenuity is important here!\"\r\nCar crash\r\nNear the end of filming, Thurman was injured in a crash while filming the scene in which she drives to Bill. According to Thurman, she was uncomfortable driving the car and asked a stunt driver to do it; Tarantino assured her that the car and road were safe. She lost control of the car and hit a tree, suffering a concussion and damage to her knees.\r\nAccording to Thurman, Miramax would only give her the crash footage if she signed a document \"releasing them of any consequences of future pain and suffering\". Tarantino was apologetic, but his and Thurman's relationship became bitter for years afterwards. Thurman said that after the car crash she \"went from being a creative contributor and performer to being like a broken tool\". Miramax released the footage in 2018 after Thurman went to police following the accusations of sexual abuse by Weinstein.\r\nEditing\r\nKill Bill was planned and filmed as a single film. After editing began, the producer, Harvey Weinstein, who was known for pressuring filmmakers to shorten their films, suggested that Tarantino split the film in two. This meant Tarantino did not have to cut scenes, such as the anime sequence. Tarantino told IGN: \"I'm talking about scenes that are some of the best scenes in the movie, but in this hurdling pace where you're trying to tell only one story, that would have been the stuff that would have had to go. But to me, that's kind of what the movie was, are these little detours and these little grace notes.\" The decision to split the film was announced in July 2003.\r\nMusic\r\nAs with Tarantino's previous films, Kill Bill features a diverse soundtrack; genres include country music and Spaghetti Western scores by Ennio Morricone. Bernard Herrmann's theme from the film Twisted Nerve is whistled by the menacing Elle Driver in the hospital scene. A brief, 15-second excerpt from the opening of the Ironside theme music by Quincy Jones is used as the Bride's revenge motif, which flares up with a red-tinged flashback whenever she is in the company of her next target. Instrumental tracks from Japanese guitarist Tomoyasu Hotei figure prominently, and after the success of Kill Bill they were frequently used in American TV commercials and at sporting events. As the Bride enters \"The House of Blue Leaves\", Japanese rock group the 5,6,7,8's perform \"I Walk Like Jayne Mansfield,\" \"I'm Blue (The Gong-Gong Song)\" and \"Woo Hoo\". The connection to Lady Snowblood is further established by the use of \"The Flower of Carnage\" the closing theme from that film. James Last's \"The Lonely Shepherd\" by pan flute virtuoso Gheorghe Zamfir plays over the closing credits. The theme from The Green Hornet plays when the Bride is flying to and arriving in Japan.\r\nInfluences\r\nKill Bill was inspired by grindhouse films that played in cheap US theaters in the 1970s, including martial arts films, samurai cinema, blaxploitation films, and spaghetti westerns. It pays homage to the Shaw Brothers Studio, known for its martial arts films, with the inclusion of the ShawScope logo in its opening titles and the \"crashing zoom\", a fast zoom usually ending in a close-up commonly used in Shaw Brothers films. The Kinji Fukasaku Battles Without Honor and Humanity series main soundtrack theme, particularly its reinterpretation in the 2000 film, was utilized heavily in the film.\r\nThe Bride's yellow tracksuit, helmet and motorcycle resemble those used by Bruce Lee in the 1972 martial arts film Game of Death. The animated sequence pays homage to violent anime films such as Golgo 13: The Professional (1983) and Wicked City (1987)\r\nThe Guardian wrote that Kill Bill's plot shares similarities with the 1973 Japanese film Lady Snowblood, in which a woman kills off the gang who murdered her family, and observed that like how Lady Snowblood used stills and illustration for \"parts of the narrative that were too expensive to film\", Kill Bill similarly used \"Japanese-style animation to break up the narrative\". The plot also resembles the 1968 French film The Bride Wore Black, in which a bride seeks revenge on five gang members and strikes them off a list as she kills them.\r\nRelease\r\nTheatrical release\r\nKill Bill: Volume 1 was released in theaters on October 10, 2003. It was the first Tarantino film in six years, following Jackie Brown in 1997. In the United States and Canada, Volume 1 was released in 3,102 theaters and grossed $22 million on its opening weekend. Paul Dergarabedian, president of Exhibitor Relations, said Volume 1's opening weekend gross was significant for a \"very genre specific and very violent\" film that in the United States was restricted to theatergoers 17 years old and up. It ranked first at the box office, beating School of Rock (in its second weekend) and Intolerable Cruelty (in its first). Volume 1 had the widest theatrical release and highest-grossing opening weekend of a Tarantino film to date; Jackie Brown and Pulp Fiction (1994) had each grossed $9.3 million on their opening weekends. According to the studio, exit polls showed that 90% of the audience was interested in seeing the second Kill Bill after seeing the first.\r\nOutside the United States and Canada, Kill Bill: Volume 1 was released in 20 territories. The film outperformed its main competitor Intolerable Cruelty in Norway, Denmark and Finland, though it ranked second in Italy. Volume 1 had a record opening in Japan, though expectations were higher due to the film being partially set there and because of its homages to Japanese martial arts cinema. It had \"a muted entry\" in the United Kingdom and Germany due to its 18 certificate, but \"experienced acceptable drops\" after its opening weekend in the two territories. By November 2, 2003, it had made $31 million in the 20 territories. It grossed a total of $70 million in the United States and Canada and $110.9 million in other territories for a worldwide total of $180.9 million.\r\nHome media\r\nIn the United States, Volume 1 was released on DVD and VHS on April 13, 2004, the week Volume 2 was released in theaters. In a December 2005 interview, Tarantino addressed the lack of a special edition DVD for Kill Bill by stating \"I've been holding off because I've been working on it for so long that I just wanted a year off from Kill Bill and then I'll do the big supplementary DVD package.\" After one week of release, the film's DVD sales had surpassed its $70 million US box office gross.\r\nThe United States does not have a DVD boxed set of Kill Bill, though box sets of the two separate volumes are available in other countries, such as France, Japan and the United Kingdom. Upon the DVD release of Volume 2 in the US, however, Best Buy did offer an exclusive box set slipcase to house the two individual releases together. Volume 1, along with Volume 2, was released in High Definition on Blu-ray on September 9, 2008, in the United States. As of March 2012, Volume 1 sold 141,456 Blu-ray units in the US, grossing $1,477,791.\r\nReception\r\nOn review aggregator Rotten Tomatoes, Kill Bill: Volume 1 has a score of 85% based on reviews from 238 critics; the average rating is 7.70/10. Its consensus reads: \"Kill Bill is admittedly little more than a stylish revenge thriller – albeit one that benefits from a wildly inventive surfeit of style.\" At Metacritic, which assigns a weighted average score 69 out of 100 based on 43 reviews from mainstream critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.\r\nA. O. Scott of The New York Times wrote:\r\nWhile being so relentlessly exposed to a filmmaker's idiosyncratic turn-ons can be tedious and off-putting, the undeniable passion that drives Kill Bill is fascinating, even, strange to say it, endearing. Mr. Tarantino is an irrepressible showoff, recklessly flaunting his formal skills as a choreographer of high-concept violence, but he is also an unabashed cinephile, and the sincerity of his enthusiasm gives this messy, uneven spectacle an odd, feverish integrity.\r\nManohla Dargis of the Los Angeles Times called Kill Bill: Volume 1 a \"blood-soaked valentine to movies. ... It's apparent that Tarantino is striving for more than an off-the-rack mash note or a pastiche of golden oldies. It is, rather, his homage to movies shot in celluloid and wide, wide, wide, wide screen — an ode to the time right before movies were radically secularized.\" She also recognized Tarantino's technical talent, but thought the film's appeal was too limited to popular culture references, calling its story \"the least interesting part of the whole equation\". Roger Ebert of the Chicago Sun-Times gave it 4 out of 4, describing Tarantino as \"effortlessly and brilliantly in command of his technique\". He wrote: \"The movie is not about anything at all except the skill and humor of its making. It's kind of brilliant.\"\r\nCultural historian Maud Lavin states that the Bride's embodiment of revenge taps into viewers' personal fantasies of committing violence. For audiences, particularly women viewers, the character provides a complex site for identification with one's own aggression.\r\nAccolades\r\nUma Thurman received a Golden Globe Best Actress nomination in 2004. She was also nominated in 2004 for a BAFTA Award for Best Actress in a Leading Role, in addition with four other BAFTA nominations. Kill Bill: Volume 1 was placed in Empire Magazine's list of the 500 Greatest Films of All Time at number 325 and the Bride was also ranked number 66 in Empire magazine's \"100 Greatest Movie Characters\". Neither Kill Bill movie received any Academy Awards (Oscars) nominations.\r\nSequel\r\nA sequel, Kill Bill: Volume 2, was released in April 2004. It continues the Bride's quest to kill Bill and the remaining members of the Deadly Viper Assassination Squad. Volume 2 was also a critical and commercial success, earning over $150 million.\r\nLegacy\r\nKill Buljo is a 2007 Norwegian parody of Kill Bill set in Finnmark, Norway, and portrays Jompa Tormann's hunt for Tampa and Papa Buljo. The film satirizes stereotypes of Norway's Sami population. According to the Norwegian newspaper Dagbladet, Tarantino approved of the parody. The Pussy Wagon vehicle from Kill Bill: Volume 1 made a cameo in the 2010 music video for Lady Gaga's song \"Telephone\" at Tarantino's behest.",
    "html": "<p>Kill Bill: Volume 1 is a 2003 American martial arts film written and directed by Quentin Tarantino. It stars Uma Thurman as the Bride, a former assassin who swears revenge on her ex-teammates (Lucy Liu, Michael Madsen, Daryl Hannah, and Vivica A. Fox) and their leader, Bill (David Carradine), after they leave her for dead. Her journey takes her to Tokyo, where she battles the yakuza.</p><p>Tarantino conceived Kill Bill as an homage to the 1973 film Lady Snowblood, grindhouse cinema, martial arts films, samurai cinema, blaxploitation and spaghetti Westerns. It features an anime sequence by Production I.G. Volume 1 is the first of two Kill Bill films made in a single production. They were planned as a single release, which Tarantino split into two films to avoid having to cut scenes. Volume 2 was released six months later.</p><p>Kill Bill was theatrically released in the United States on October 10, 2003. It received positive reviews and grossed over $180 million worldwide on a $30 million budget, achieving the highest-grossing opening weekend of a Tarantino film to that point.</p><br/><h3>Plot</h3><p>In 1999, the Bride, a former member of the Deadly Viper assassination squad, is rehearsing her marriage at a chapel in El Paso, Texas. The Deadly Vipers, led by Bill, attack the chapel, shooting everyone. As the Bride lies wounded, she tells Bill he is the father of her unborn child, just as he shoots her in the head.</p><p>The Bride falls into a coma. In the hospital, Elle Driver, one of the Deadly Vipers, prepares to assassinate her via lethal injection. Bill aborts the mission, considering it dishonorable to kill her while she is defenseless. The Bride awakens after four years and is horrified to discover she is no longer pregnant. She kills a man who intends to rape her and a hospital worker who has been selling her body while she was comatose. She takes the hospital worker's truck and teaches herself to walk again, vowing to kill Bill and the other Deadly Vipers.</p><p>The Bride goes to the home of the former Deadly Viper, Vernita Green, who now leads a normal suburban life. She and the Bride engage in a knife fight, which is interrupted when Vernita's young daughter arrives home. When Vernita tries to shoot the Bride with a pistol hidden in a box of cereal, the Bride throws a knife into her chest, killing her.</p><p>The Bride goes to Okinawa to obtain a sword from the legendary swordsmith Hattori Hanzō, who has sworn never to forge a sword again. After learning that her target is Bill, his former student, he crafts his finest sword for her. The Bride travels to Tokyo to find another Deadly Viper, O-Ren Ishii, now the leader of the Tokyo yakuza. After witnessing the yakuza murder her parents when she was a child, O-Ren took vengeance on the yakuza boss and replaced him after training as an elite assassin.</p><p>The Bride tracks O-Ren Ishii to a restaurant. She amputates the arm of her assistant, Sofie Fatale, defeats O-Ren's squad of elite fighters, the Crazy 88, and kills her bodyguard, the schoolgirl Gogo Yubari. O-Ren and the Bride duel in the restaurant's Japanese garden, and the Bride kills O-Ren by slicing off the top of her head. She tortures Sofie for information about the other Deadly Vipers, and leaves her alive as a threat. Bill finds Sofie and asks her if the Bride knows that her daughter is alive.</p><br/><h3>Cast</h3><ul><li>Uma Thurman as the Bride (code name Black Mamba), a former member of the Deadly Viper Assassination Squad, described as \"the deadliest woman in the world\". She seeks revenge on the Deadly Vipers after they try to kill her in a wedding chapel.</li><li>Lucy Liu as O-Ren Ishii (code name Cottonmouth), a former Deadly Viper who has become the leader of the Japanese Yakuza. She and the Bride once had a close friendship. She is the Bride's first target.</li><li>David Carradine as Bill (code name Snake Charmer), the former leader of the Deadly Vipers, the Bride's former lover, and the father of her daughter. He is the final target of the Bride's revenge. He is an unseen character until Volume 2.</li><li>Vivica A. Fox as Vernita Green (code name Copperhead), a former Deadly Viper and now a mother and homemaker, living under the name Jeannie Bell. She is the Bride's second target.</li><li>Michael Madsen as Budd (code name Sidewinder), a former Deadly Viper and Bill's brother, now working as a strip club bouncer and living in a trailer. He is the Bride's third target.</li><li>Daryl Hannah as Elle Driver (code name California Mountain Snake), a former Deadly Viper and the Bride's fourth target. She is also Bill's new lover. Driver is based on Madeline (Christina Lindberg) in They Call Her One Eye.</li><li>Julie Dreyfus as Sofie Fatale, O-Ren's lawyer, confidante, and second lieutenant. She is also a former protégée of Bill's, and was present at the wedding chapel massacre.</li><li>Sonny Chiba as Hattori Hanzō, a wise sushi chef and long-retired master swordsmith who agrees to craft a sword just for the Bride.</li><li>Chiaki Kuriyama as Gogo Yubari, O-Ren's sadistic Japanese schoolgirl bodyguard.</li><li>Gordon Liu as Johnny Mo, head of O-Ren's personal army, the Crazy 88.</li><li>Michael Parks as Ranger Earl McGraw, a Texas Ranger who investigates the wedding chapel massacre. Parks originated McGraw in the Robert Rodriguez film From Dusk till Dawn, which Tarantino wrote and acted in. He would go on to reprise the role in both segments of the Rodriguez/Tarantino collaboration Grindhouse. Parks also appeared in Volume 2 as a separate character, Esteban Vihaio.</li><li>Michael Bowen as Buck, an orderly at the hospital who has been raping the Bride while she lay comatose.</li><li>Jun Kunimura as Boss Tanaka, a Yakuza whom O-Ren executes after he ridicules her ethnicity and gender.</li><li>Kenji Ohba as Shiro, Hattori Hanzo's employee.</li><li>Kazuki Kitamura as Boss Koji, a Yakuza working for O-Ren. He also appeared as Bodyguard #2 in O-Ren's army, the Crazy 88.</li><li>James Parks as Ranger Edgar McGraw, a Texas Ranger and son of Earl McGraw.</li><li>Jonathan Loughran as Buck's trucker client, killed by the Bride after he attempts to rape her.</li><li>Yuki Kazamatsuri as the Proprietress of the House of Blue Leaves.</li><li>Sakichi Sato as \"Charlie Brown\", a House of Blue Leaves employee who is mocked by the Crazy 88, as he wears a kimono similar to the shirt worn by the Peanuts character.</li><li>Ambrosia Kelley as Nakia \"Nikki\" Bell, Vernita's four-year-old daughter. She witnesses the Bride killing her mother, and the Bride suggests that if she still \"feel raw about it\" when she gets older, she should come find The Bride and confront her (presumably after learning about her mother's past as an assassin and her role in the wedding chapel massacre)</li><li>The 5.6.7.8's (Sachiko Fuji, Yoshiko Yamaguchi and Ronnie Yoshiko Fujiyama) as themselves, performing at the House of Blue Leaves.</li><li>Yōji Tanaka as Crazy 88 #3</li><li>Issey Takahashi as Crazy 88 #4</li><li>Juri Manase as Crazy 88 #6</li><li>Akaji Maro as Boss Ozawah</li><li>Ai Maeda as O-Ren (anime sequence) (voice)</li><li>Naomi Kusumi as Boss Matsumoto (anime sequence) (voice)</li><li>Hikaru Midorikawa as Pretty Riki (anime sequence) (voice)</li></ul><br/><h3>Production</h3><h4>Writing</h4><p>Quentin Tarantino and Thurman conceived the Bride character during the production of Tarantino's 1994 film Pulp Fiction; Kill Bill credits the story to \"Q & U\". Tarantino spent a year and a half writing the script while he was living in New York City in 2000 and 2001, spending time with Thurman and her newborn daughter Maya. Reuniting with the more mature Thurman, now a mother, influenced the way Tarantino wrote the Bride character; he did not come to the realization that the Bride's child could still be alive until the end of the writing process.</p><p>He originally wrote Bill for Warren Beatty, but as the character developed and the role required greater screen time and martial arts training, he rewrote it for David Carradine. Tarantino also considered Bruce Willis for the role of Bill. Tarantino decided to cast Daryl Hannah as Elle Driver after seeing her performance in the television film First Target. The physical similarities between Thurman and Hannah inspired how he wrote the rivalry between the characters. Michelle Yeoh met with Tarantino for a role in the film.</p><p>An early draft included a chapter set after the confrontation with Vernita in which the Bride has a gunfight with Gogo Yubari's vengeful sister Yuki. It was cut because it would have made the film overlong and added $1 million to the budget. Another draft featured a scene in which the Bride's car is blown up by Elle.</p><h4>Filming</h4><p>When Thurman became pregnant as shooting was ready to begin, Tarantino delayed the production, saying: \"If Josef Von Sternberg is getting ready to make Morocco and Marlene Dietrich gets pregnant, he waits for Dietrich!\" Although the scenes are presented out of chronological order, the film was shot in sequence. The choreographer Yuen Woo-Ping, whose previous credits include The Matrix, was the film's martial arts advisor. The anime sequence, covering O-Ren Ishii's backstory, was directed by Kazuto Nakazawa and produced by Production I.G, which had produced films including Ghost in the Shell and Blood: The Last Vampire. The combined production lasted 155 days and had a budget of $55 million.</p><p>According to Tarantino, the most difficult part of making the film was \"trying to take myself to a different place as a filmmaker and throw my hat in the ring with other great action directors\", as opposed to the dialogue scenes he was known for. The House of Blue Leaves sequence, in which the Bride battles dozens of yakuza soldiers, took eight weeks to film, six weeks over schedule. Tarantino wanted to create \"one of the greatest, most exciting sequences in the history of cinema\". The crew eschewed computer-generated imagery in favor of practical effects used in 1970s Chinese cinema, particularly by the director Chang Cheh, including the use of fire extinguishers and condoms to create spurts and explosions of blood. Tarantino told his crew: \"Let's pretend we're little kids and we're making a Super 8 movie in our back yard, and you don't have all this shit. How would you achieve this effect? Ingenuity is important here!\"</p><h4>Car crash</h4><p>Near the end of filming, Thurman was injured in a crash while filming the scene in which she drives to Bill. According to Thurman, she was uncomfortable driving the car and asked a stunt driver to do it; Tarantino assured her that the car and road were safe. She lost control of the car and hit a tree, suffering a concussion and damage to her knees.</p><p>According to Thurman, Miramax would only give her the crash footage if she signed a document \"releasing them of any consequences of future pain and suffering\". Tarantino was apologetic, but his and Thurman's relationship became bitter for years afterwards. Thurman said that after the car crash she \"went from being a creative contributor and performer to being like a broken tool\". Miramax released the footage in 2018 after Thurman went to police following the accusations of sexual abuse by Weinstein.</p><h4>Editing</h4><p>Kill Bill was planned and filmed as a single film. After editing began, the producer, Harvey Weinstein, who was known for pressuring filmmakers to shorten their films, suggested that Tarantino split the film in two. This meant Tarantino did not have to cut scenes, such as the anime sequence. Tarantino told IGN: \"I'm talking about scenes that are some of the best scenes in the movie, but in this hurdling pace where you're trying to tell only one story, that would have been the stuff that would have had to go. But to me, that's kind of what the movie was, are these little detours and these little grace notes.\" The decision to split the film was announced in July 2003.</p><h4>Music</h4><p>As with Tarantino's previous films, Kill Bill features a diverse soundtrack; genres include country music and Spaghetti Western scores by Ennio Morricone. Bernard Herrmann's theme from the film Twisted Nerve is whistled by the menacing Elle Driver in the hospital scene. A brief, 15-second excerpt from the opening of the Ironside theme music by Quincy Jones is used as the Bride's revenge motif, which flares up with a red-tinged flashback whenever she is in the company of her next target. Instrumental tracks from Japanese guitarist Tomoyasu Hotei figure prominently, and after the success of Kill Bill they were frequently used in American TV commercials and at sporting events. As the Bride enters \"The House of Blue Leaves\", Japanese rock group the 5,6,7,8's perform \"I Walk Like Jayne Mansfield,\" \"I'm Blue (The Gong-Gong Song)\" and \"Woo Hoo\". The connection to Lady Snowblood is further established by the use of \"The Flower of Carnage\" the closing theme from that film. James Last's \"The Lonely Shepherd\" by pan flute virtuoso Gheorghe Zamfir plays over the closing credits. The theme from The Green Hornet plays when the Bride is flying to and arriving in Japan.</p><br/><h3>Influences</h3><p>Kill Bill was inspired by grindhouse films that played in cheap US theaters in the 1970s, including martial arts films, samurai cinema, blaxploitation films, and spaghetti westerns. It pays homage to the Shaw Brothers Studio, known for its martial arts films, with the inclusion of the ShawScope logo in its opening titles and the \"crashing zoom\", a fast zoom usually ending in a close-up commonly used in Shaw Brothers films. The Kinji Fukasaku Battles Without Honor and Humanity series main soundtrack theme, particularly its reinterpretation in the 2000 film, was utilized heavily in the film.</p><p>The Bride's yellow tracksuit, helmet and motorcycle resemble those used by Bruce Lee in the 1972 martial arts film Game of Death. The animated sequence pays homage to violent anime films such as Golgo 13: The Professional (1983) and Wicked City (1987)</p><p>The Guardian wrote that Kill Bill's plot shares similarities with the 1973 Japanese film Lady Snowblood, in which a woman kills off the gang who murdered her family, and observed that like how Lady Snowblood used stills and illustration for \"parts of the narrative that were too expensive to film\", Kill Bill similarly used \"Japanese-style animation to break up the narrative\". The plot also resembles the 1968 French film The Bride Wore Black, in which a bride seeks revenge on five gang members and strikes them off a list as she kills them.</p><br/><h3>Release</h3><h4>Theatrical release</h4><p>Kill Bill: Volume 1 was released in theaters on October 10, 2003. It was the first Tarantino film in six years, following Jackie Brown in 1997. In the United States and Canada, Volume 1 was released in 3,102 theaters and grossed $22 million on its opening weekend. Paul Dergarabedian, president of Exhibitor Relations, said Volume 1's opening weekend gross was significant for a \"very genre specific and very violent\" film that in the United States was restricted to theatergoers 17 years old and up. It ranked first at the box office, beating School of Rock (in its second weekend) and Intolerable Cruelty (in its first). Volume 1 had the widest theatrical release and highest-grossing opening weekend of a Tarantino film to date; Jackie Brown and Pulp Fiction (1994) had each grossed $9.3 million on their opening weekends. According to the studio, exit polls showed that 90% of the audience was interested in seeing the second Kill Bill after seeing the first.</p><p>Outside the United States and Canada, Kill Bill: Volume 1 was released in 20 territories. The film outperformed its main competitor Intolerable Cruelty in Norway, Denmark and Finland, though it ranked second in Italy. Volume 1 had a record opening in Japan, though expectations were higher due to the film being partially set there and because of its homages to Japanese martial arts cinema. It had \"a muted entry\" in the United Kingdom and Germany due to its 18 certificate, but \"experienced acceptable drops\" after its opening weekend in the two territories. By November 2, 2003, it had made $31 million in the 20 territories. It grossed a total of $70 million in the United States and Canada and $110.9 million in other territories for a worldwide total of $180.9 million.</p><h4>Home media</h4><p>In the United States, Volume 1 was released on DVD and VHS on April 13, 2004, the week Volume 2 was released in theaters. In a December 2005 interview, Tarantino addressed the lack of a special edition DVD for Kill Bill by stating \"I've been holding off because I've been working on it for so long that I just wanted a year off from Kill Bill and then I'll do the big supplementary DVD package.\" After one week of release, the film's DVD sales had surpassed its $70 million US box office gross.</p><p>The United States does not have a DVD boxed set of Kill Bill, though box sets of the two separate volumes are available in other countries, such as France, Japan and the United Kingdom. Upon the DVD release of Volume 2 in the US, however, Best Buy did offer an exclusive box set slipcase to house the two individual releases together. Volume 1, along with Volume 2, was released in High Definition on Blu-ray on September 9, 2008, in the United States. As of March 2012, Volume 1 sold 141,456 Blu-ray units in the US, grossing $1,477,791.</p><br/><h3>Reception</h3><p>On review aggregator Rotten Tomatoes, Kill Bill: Volume 1 has a score of 85% based on reviews from 238 critics; the average rating is 7.70/10. Its consensus reads: \"Kill Bill is admittedly little more than a stylish revenge thriller – albeit one that benefits from a wildly inventive surfeit of style.\" At Metacritic, which assigns a weighted average score 69 out of 100 based on 43 reviews from mainstream critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.</p><p>A. O. Scott of The New York Times wrote:</p><blockquote>While being so relentlessly exposed to a filmmaker's idiosyncratic turn-ons can be tedious and off-putting, the undeniable passion that drives Kill Bill is fascinating, even, strange to say it, endearing. Mr. Tarantino is an irrepressible showoff, recklessly flaunting his formal skills as a choreographer of high-concept violence, but he is also an unabashed cinephile, and the sincerity of his enthusiasm gives this messy, uneven spectacle an odd, feverish integrity.</blockquote><p>Manohla Dargis of the Los Angeles Times called Kill Bill: Volume 1 a \"blood-soaked valentine to movies. ... It's apparent that Tarantino is striving for more than an off-the-rack mash note or a pastiche of golden oldies. It is, rather, his homage to movies shot in celluloid and wide, wide, wide, wide screen — an ode to the time right before movies were radically secularized.\" She also recognized Tarantino's technical talent, but thought the film's appeal was too limited to popular culture references, calling its story \"the least interesting part of the whole equation\". Roger Ebert of the Chicago Sun-Times gave it 4 out of 4, describing Tarantino as \"effortlessly and brilliantly in command of his technique\". He wrote: \"The movie is not about anything at all except the skill and humor of its making. It's kind of brilliant.\"</p><p>Cultural historian Maud Lavin states that the Bride's embodiment of revenge taps into viewers' personal fantasies of committing violence. For audiences, particularly women viewers, the character provides a complex site for identification with one's own aggression.</p><h4>Accolades</h4><p>Uma Thurman received a Golden Globe Best Actress nomination in 2004. She was also nominated in 2004 for a BAFTA Award for Best Actress in a Leading Role, in addition with four other BAFTA nominations. Kill Bill: Volume 1 was placed in Empire Magazine's list of the 500 Greatest Films of All Time at number 325 and the Bride was also ranked number 66 in Empire magazine's \"100 Greatest Movie Characters\". Neither Kill Bill movie received any Academy Awards (Oscars) nominations.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center;\"><th colspan=\"4\" style=\"background:#B0C4DE;\">Awards</th></tr><tr style=\"text-align:center;\"><th style=\"background:#ccc;\">Award</th><th style=\"background:#ccc;\">Category</th><th style=\"background:#ccc;\">Recipient(s)</th><th style=\"background:#ccc;\">Outcome</th></tr><tr><td rowspan=\"6\"><span>57th British Academy Film Awards</span></td></tr><tr><td><span>Best Actress</span></td><td><span>Uma Thurman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td><span>Sally Menke</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Film Music</span></td><td><span>RZA</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Michael Minkler</span>, <span>Myron Nettinga</span>, <span>Wylie Stateman</span>, and Mark Ulano</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Visual Effects</span></td><td>Tommy Tom, Kia Kwan, Tam Wai, Kit Leung, Jaco Wong, and Hin Leung</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>9th Empire Awards</span></td></tr><tr><td><span>Best Film</span></td><td><i>Kill Bill: Volume 1</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td>Uma Thurman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Quentin Tarantino</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Sony Ericsson Scene of the Year</td><td>The House of the Blue Leaves</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>61st Golden Globe Awards</span></td><td><span class=\"mw-redirect\">Best Actress – Motion Picture Drama</span></td><td>Uma Thurman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>2004 MTV Movie Awards</span></td><td><span class=\"mw-redirect\">Best Female Performance</span></td><td>Uma Thurman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Villain</span></td><td><span>Lucy Liu</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Fight</span></td><td>Uma Thurman vs. <span>Chiaki Kuriyama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">2003 Satellite Awards</span></td></tr><tr><td><span>Best Art Direction/Production Design</span></td><td><i>Kill Bill: Volume 1</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Quentin Tarantino and Uma Thurman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><i>Kill Bill: Volume 1</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Visual Effects</span></td><td><i>Kill Bill: Volume 1</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"8\"><span>30th Saturn Awards</span></td></tr><tr><td><span>Best Action/Adventure Film</span></td><td><i>Kill Bill: Volume 1</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td>Uma Thurman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Sonny Chiba</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Lucy Liu</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Quentin Tarantino</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Quentin Tarantino</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Genre Face of the Future</td><td><span>Chiaki Kuriyama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Sequel</h3><p>A sequel, Kill Bill: Volume 2, was released in April 2004. It continues the Bride's quest to kill Bill and the remaining members of the Deadly Viper Assassination Squad. Volume 2 was also a critical and commercial success, earning over $150 million.</p><br/><h3>Legacy</h3><p>Kill Buljo is a 2007 Norwegian parody of Kill Bill set in Finnmark, Norway, and portrays Jompa Tormann's hunt for Tampa and Papa Buljo. The film satirizes stereotypes of Norway's Sami population. According to the Norwegian newspaper Dagbladet, Tarantino approved of the parody. The Pussy Wagon vehicle from Kill Bill: Volume 1 made a cameo in the 2010 music video for Lady Gaga's song \"Telephone\" at Tarantino's behest.</p><br/>"
  },
  "errorMessage": ""
}