{
  "imDbId": "tt1291584",
  "title": "Warrior",
  "fullTitle": "Warrior (2011)",
  "type": "Movie",
  "year": "2011",
  "items": [
    {
      "publisher": "Empire",
      "author": "Dan Jolin",
      "link": "",
      "rate": "100",
      "content": "It hardly rewrites the rulebook, but Warrior is a powerful, moving and brilliant sports-pic-cum-family drama. Like \"The Fighter,\" but with kicking."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/warrior-film-review-220959/",
      "rate": "90",
      "content": "It's a long movie that feels short: It grabs you in early scenes, intense though low-key before all hell breaks loose, then keeps you riveted to its mostly male characters."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/warrior",
      "rate": "88",
      "content": "O'Connor gives the film a dark, moody look, which is the best choice for so many roiling emotions. This is not a traditional stand-up-and-cheer fight movie; the undercurrents are too strong and deep."
    },
    {
      "publisher": "Variety",
      "author": "Joe Leydon",
      "link": "https://variety.com/2011/film/reviews/warrior-1117945782/",
      "rate": "80",
      "content": "An improbably effective and affecting mix of raw emotions and exciting smackdowns."
    },
    {
      "publisher": "",
      "author": "Boxoffice Magazine",
      "link": "https://www.boxofficepro.com/",
      "rate": "80",
      "content": "Though Warrior excels at the big stuff-fighting sequences and rousing crowds and victories that all but force audiences to stand up and cheer - the film is at its very best in the small moments, the little looks."
    },
    {
      "publisher": "Village Voice",
      "author": "Nick Pinkerton",
      "link": "",
      "rate": "80",
      "content": "Old line-gargler Nolte remains an effortlessly moving presence, while Hardy and Edgerton embody their archetypes and handle the physical demands."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "https://ew.com/article/2011/09/14/warrior-movie-review/",
      "rate": "75",
      "content": "Mostly, Warrior is a showcase for its up-and-coming stars. Edgerton, from last year's \"Animal Kingdom,\" and Hardy, who stole scenes as the identity forger in \"Inception.\""
    },
    {
      "publisher": "Slant Magazine",
      "author": "Nick Schager",
      "link": "",
      "rate": "75",
      "content": "O'Conner continues to exhibit a deft knack for melding interpersonal drama with athletic competition in ways that, despite his tales' clichés, earn their melodramatic manipulations through genuine empathy for characters' plights."
    },
    {
      "publisher": "Orlando Sentinel",
      "author": "Roger Moore",
      "link": "",
      "rate": "75",
      "content": "Warrior is a straight genre picture, a fight movie of the old school. But it's a mixed martial arts tale, and as such, it's the best MMA movie ever."
    },
    {
      "publisher": "Time Out",
      "author": "Keith Uhlich",
      "link": "",
      "rate": "60",
      "content": "Yet it still works like gangbusters - tears will be stifled by the end of the sibling vs. sibling finale - and most of the credit should go to Hardy, Nolte and Edgerton."
    }
  ],
  "errorMessage": ""
}