{
  "imDbId": "tt1291584",
  "title": "Warrior",
  "fullTitle": "Warrior (2011)",
  "type": "Movie",
  "year": "2011",
  "items": [
    {
      "username": "ansharora-12638",
      "userUrl": "https://www.imdb.com/user/ur68630637",
      "reviewLink": "https://www.imdb.com/review/rw6031580",
      "warningSpoilers": false,
      "date": "27 August 2020",
      "rate": "9",
      "helpful": "33 out of 34 found this helpful.",
      "title": "Joel and Tom are magical.",
      "content": "At first, I thought, \"man, should have shown a little more backstory, why so much hate among the family and whatever\". But then I understood, that would have made it just another family drama movie, which it cannot be. This movie is about the raw unsaid emotion of a family that always remains there. No matter what.Joel was perfect in the role as a passionate, loving and fierce boxer and family man. Hardy was also great in the little convulated army-disgraced man who just wanted to do right by his fallen comrade. Nick Nolte did most of the magic with his eyes. And the last 20 minutes of the movie can make any grown man AND woman cry.Cheers."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3849375",
      "warningSpoilers": true,
      "date": "4 November 2017",
      "rate": "10",
      "helpful": "38 out of 43 found this helpful.",
      "title": "\"The devil you know is better than the devil you don't.\"",
      "content": "There aren't many fight movies I'd rate as high as a '10', and by fight movies I'm talking about boxing as the subject. \"Rocky\" and \"Million Dollar Baby\" are the only two I can think of off hand. But this movie transcends the genre and is so much more than a film about a pair of brothers reaching for the gold ring in the arena of mixed martial arts. There's a lot of human drama on display, and the three principals in the story pull off some of the most incredible performances one is likely to see in a film like this.I was taken aback a bit by the number of other reviewers on this board who admitted to shedding a tear over parts of the story line. Some of the scenes affected me the same way and it's a little difficult to explain why, but the characters are so anguished and real that one can relate to them on some visceral level. I was especially heartened to see how the students of Sparta High School got behind their physics teacher, Brendan Conlon (Joel Edgerton) during the War at the Shore. That just showed a whole lot of loyalty and civic pride for the school to turn out the way they did.The entire backdrop to the fight story of course is the anguished and disrupted home life of Paddy Conlon (Nick Nolte), an alcoholic on the mend approaching a thousand days of sobriety, but with the inability to connect with the sons who abandoned him. I was a little surprised that the resolution to the story didn't involve Nolte's character engaging more purposefully with either Brendan or Tommy (Tom Hardy). It's left open ended, just as Tommy's status with the military is left open ended, though if you follow your instincts, the outcomes wouldn't necessarily be rewarding.As for the fight scenes, I'd have to go on record stating that this movie has the best edited action in the ring I've ever seen. Though the pace is often relentless, none of it looks staged or phony, a credit to all the players involved and the principal photographer. Regarding the outcome of the final match, well before ring time one's brain scrambles trying to guess the outcome, as this is one film and one battle where you don't want either brother to lose, and you can't imagine the twist that will make the final verdict worthwhile. I won't spoil it here either, you'll just have to see and judge it for yourself."
    },
    {
      "username": "Vuraxis",
      "userUrl": "https://www.imdb.com/user/ur87974234",
      "reviewLink": "https://www.imdb.com/review/rw5398926",
      "warningSpoilers": false,
      "date": "11 January 2020",
      "rate": "9",
      "helpful": "150 out of 166 found this helpful.",
      "title": "Oh my god",
      "content": "I'm hard to break when it comes to emotions. I've seen a lot of the best emotional films. Schindler's List, Forrest Gump, Grave of the Fireflies, Requiem for a Dream, The Green Mile, It's a Wonderful Life, and most recently I Lost my Body. But this is the one that finally cracked me, and for the first time in my life, I've cried to a movie. I don't even like sports, but the sheer intensity and stress I felt in the fight scenes is overwhelming.Dear god this is a masterpiece."
    },
    {
      "username": "severindringel",
      "userUrl": "https://www.imdb.com/user/ur118679533",
      "reviewLink": "https://www.imdb.com/review/rw7168972",
      "warningSpoilers": false,
      "date": "27 July 2021",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "A powerful masterpiece about desperate men",
      "content": "Tom Hardy and Joel Edgerton feud as estranged brothers at the Pentagon. Nick Nolte plays a rehabilitating father with deep-seated demons. From these dynamics emerges a family drama that on the surface dances to the usual Rocky schema - but again, not at all. Warrior is, in fact, a very special sports film. Not just because of its specific sport (MMA is unlikely to play a role on the big screen anytime soon), but the storytelling of how director Gavin O'Connor manages to weave together the emotional facets of this masculine world.For both Tom Hardy and especially Joel Edgerton, this film was their big breakthrough. Since then, Hollywood has been hot on their heels for almost everything. After seeing this flick, one has to honestly say that this is totally fine. Although I don't think too much of Edgerton's rather stoic and monotonous acting, he fits the role of Brendan perfectly. A \"reasonable\" family man with clear principles, but who has never lost his passion for fighting from his younger years. Even more on the nail, however, is Hardy's embodiment of his character Tommy. Although he is actually sullen and taciturn for the entire 130 minutes of running time (just a typical Hardy), you always have the feeling that there is so much more to this loveless-looking person. When you learn more about his background in the second half of the film, the other character traits clearly come into play. In that respect, Hardy was of course given the more interesting and diverse character, but his rousing performance never really makes you dislike this fundamentally unlikable person after all. The acting masterpiece of the film, however, goes to the account of a gentleman who had long been considered an icon in Hollywood at that time: Nick Nolte. After he had disappeared into oblivion for some time before, Nolte returns here in absolute top form. The role of the recovering alcoholic is tailor-made for Nolte. He plays everything from totally grumpy and distant to empathetic and highly emotional, and in the final part he provides one of the most memorable individual scenes in recent memory, at least in my opinion. You understand this man, want to hug him for his crumbling relationship with his sons, but can still understand why they want to avoid him.At first glance, the film's unwinding seems generic and genre-oriented. However, if you venture beneath the surface and get involved with the not-uncomplex plot, you are completely caught off guard and left wondering. If I weren't a cold hearted person when it comes to crying at movies, I probably would have shed enough water for ten. Warrior gives you so much more than just half-naked men beating the crap out of each other in a pointless martial art. It's about passion, revenge and reconciliation. These elements are conveyed by O'Connor and the cast in such an incredibly authentic and profound way that you almost can't believe that the declared genre of this film is \"sports movie\". Rather, it is a breathtaking roller coaster of emotions with a lot of heart with an admittedly slightly exaggerated ending."
    },
    {
      "username": "CANpatbuck3664",
      "userUrl": "https://www.imdb.com/user/ur63857399",
      "reviewLink": "https://www.imdb.com/review/rw3408673",
      "warningSpoilers": true,
      "date": "4 February 2016",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "The Excellent MMA Fights Aren't The Primary Reason To Watch This Movie, The Powerful Acting Is",
      "content": "I'm a little late getting this review up, the movie has been out since 2011. I'm putting up this review so far past it's release because this might be the best movie I've seen that's come out in this decade.I still remember walking into the theatre being open but having low expectations, with no idea such a skillfully made and emotionally gripping movie lay ahead.*Minor Spoilers Ahead* The movie starts out in Pittsburgh, Pennsylvania with Paddy Conlon (Nick Nolte) returning to his home after attending a meeting at his church (listening to Moby Dick on a tape which comes up later). To his surprise, on his porch is his son Tommy Riordan (Tom Hardy). He's surprised to see Tommy but Tommy has been drinking and is not pleasant company. We learn that Tommy and his mother ran away from Paddy leaving his other son Brendan with him. Paddy was an abusive alcoholic and Tommy's mother feared for her life. She eventually died because she was very sick when they fled. Paddy will not drink however as he is in recovery and is clearly upset upon hearing this news. He reveals that he had a private investigator look up Tommy and his mother and that he was very sorry about what happened. Tommy leaves basically calling him a piece of $%!* but tells him that he will be in town for the foreseeable future. He begins to start training at a local gym when news of the Sparta MMA tournament reaches him. It's a winner take all tournament where the prize is $5,000,000.We are then introduced to Brendan (Joel Edgerton). He works as a substitute high school science teacher. Brendan is well liked by his students but cannot make ends meet. His wife Tess (Jennifer Morrison) works two jobs and they are trying to overcome a mountain of hospital bills after their one daughter was gravely ill. He also has a second job, Tess thinks he bounces at a strip club but really he participates in unlicensed MMA fights. Although Tommy was a champion wrestler in his high school days, Brendan fought in the UFC. He did not have a particularly successful career though. After winning a fight he was expected to lose, he comes home with a nasty shiner leading Tess to try and insist he quit bouncing. Unfortunately news of these fights breaks out as well and Brendan is put on suspension for his outside the classroom activities. With no other way to pay the bills, Brendan turns to these fights full time along with training with top MMA trainer Frank Campana (Frank Grillo) who is a former friend.If you walked into this movie knowing nothing about the finer plot points, I think you would just assume it would be your average boxing movie plot with MMA. This is not the case. I want to start with the actual fighting within the movie. Although I can't imagine its 100% completely realistic, it's pretty grounded and pretty violent. There's some bone crushing strikes, some pretty complex manoeuvres and some surprising outcomes. The scenes are well filmed and stand up against any boxing movie easy. I would echo other reviewers in saying that the MMA fights are treated seriously and not as a gimmick or a joke like an inferior movie would.On a whole, the plot of Warrior isn't daring or new. It does follow certain plot points that most sports movies do. Normally this would be an instant problem but Warrior moves past that issue by dealing with many heavy themes. The one that always hits me hard is dealing with intense pain caused by those you love the most. This movie shows this pain in a brutally honest manner and it leaves me welling up every time I watch Warrior. Tommy and Brendan have every reason to hate their father and honestly due to the horrific acts he put them through, I'm not sure he deserves their forgiveness. You see how much Paddy's actions have changed their lives, how Paddy yearns for another chance and how both men carry their emotional baggage with them not just in the ring but in their lives everyday. It's hard to watch them struggle but it's one of the reasons that Warrior is so excellent. Other key themes are forgiveness, overcoming addiction and how important family can be. It's for these reasons and more that Warrior is able to overcome using familiar story elements and build upon them so well.The other big reason to watch this movie is the absolutely amazing trio of lead performances. I see this as the breakout performance for Tom Hardy as opposed to Bronson. As a character, Tommy is unstoppable but he's also being suffocated by his emotional and physical trauma. You feel his pain every moment Tom is on screen, it's an involving acting job. Joel Edgerton is just as good playing Brendan. Brendan is more a classic underdog but he's so easy to root for. Joel plays off the rest of the cast really well and he nails every scene with any member of the cast. Nick Nolte received an Oscar nomination for his work and you can see why. He has the most complicated part, being a former alcoholic begging for forgiveness. Nick is probably channelling some of his personal life and it comes through in a gripping performance. I would also note that Jennifer and Frank are excellent in their respective roles too.Warrior often gets compared alongside The Fighter (another boxing movie with Mark Wahlberg, Christian Bale, and Melissa Leo). The Fighter got the accolades but to me Warrior is the far better movie. It's an excellent sports movie but it's strength is being a layered and superb drama. It's in my top 10 favourite films and I would recommend it whether you watch MMA or not. You can appreciate it either way."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2853125",
      "warningSpoilers": false,
      "date": "18 August 2013",
      "rate": "8",
      "helpful": "19 out of 23 found this helpful.",
      "title": "breakout performances",
      "content": "Tommy (Tom Hardy) becomes an internet sensation as a MMA fighter. He is estranged from his father Paddy Conlon (Nick Nolte) who is a recovering alcoholic. His older brother Brendan Conlon (Joel Edgerton) is a teacher struggling to make ends meet for his wife Tess (Jennifer Morrison) and their two girls.Joel Edgerton and Tom Hardy have already done some good work but this movie really showcases their talents with these staring roles. They truly inhabit their roles. They play brothers in a broken down family. They get into the world of Mixed Maritial Arts, and end up facing each other. The action is good. The fighting is fine. But it's the acting and the brotherhood/family dysfunction that is the real stand out. It represent a true validation of not only their physical attributes but their acting abilities."
    },
    {
      "username": "neji107",
      "userUrl": "https://www.imdb.com/user/ur19703765",
      "reviewLink": "https://www.imdb.com/review/rw2467442",
      "warningSpoilers": false,
      "date": "31 July 2011",
      "rate": "9",
      "helpful": "308 out of 387 found this helpful.",
      "title": "Emotions on par with The Fighter, one of the top combat sport movies since Rocky, one of the best of 2011",
      "content": "Every so often you'll come across a combat sport movie that manages to find just the right balance of drama and action – that is, more drama than action. When fights are justified with backstories full of crushing emotion, they become all the more intense and gratifying. Warrior brings to the table the world of mixed martial arts, where punches, kicks, holds, and everything else goes. The inception of new international tournament \"Sparta\" puts on a collision course Paddy (Nick Nolte), Brendan (Joel Edgerton), and Tom Conlon (Tom Hardy), all part of an estranged family torn apart in the past by abuse, favoritism, and abandonment. Tom resurfaces in society to enlist the help of his formerly alcoholic father Paddy to train him for the tournament, while at the same time Brendan revisits his UFC training in hopes to win the $5 million purse for his struggling family. The two underdogs face some of the toughest MMA fighters on the planet, but the true struggle appears to lie within them. Paddy battles for forgiveness against the resentment of his sons, Tom fights to prove to himself that he is strong, and Brendan struggles to come to terms with his older family while trying to support one of his own.The fantastic thing here is two protagonists entering the same tournament. Each brother has his own respectable reasons for fighting, a fact that is sure to divide the audience when it comes time to choose which one to root for. The story truly is gut-wrenchingly powerful and presented in an engaging fashion. Little by little through the film's dialogue, we are allowed a glimpse into the past hardships of the Conlon family, and the characters' motivations for retaining such hatred are revealed gradually. Through the incredible acting talents of Tom Hardy, Joel Edgerton, and Nick Nolte, this confused and passionate chemistry really comes alive. All three actors put up some of the most convincing and heartbreaking performances of their careers; and seeing as how The Fighter garnered so many Oscar nominations, I can't see why Warrior will not do the same. My only beef with the movie is its clichéd climax and rather bleak inconclusive ending, though it still does good to the emotional schism the movie intended to create. Warrior is one of those sports films with a magical mixture of emotional and physical battle. It's a wonderful story showing how sometimes the world's strongest forces are insignificant in comparison to the troubles of a scarred family. Warrior is without a doubt worth a visit to the theater. One of the best of 2011! And whether you're an MMA fan or not, the adrenaline-pumping fights will have you up and cheering and applauding.9/10"
    },
    {
      "username": "Keith_545",
      "userUrl": "https://www.imdb.com/user/ur23534752",
      "reviewLink": "https://www.imdb.com/review/rw2601795",
      "warningSpoilers": true,
      "date": "24 April 2012",
      "rate": "10",
      "helpful": "605 out of 631 found this helpful.",
      "title": "A different interpretation of the ending.",
      "content": "Please don't read this if you don't want the ending given away.I've noticed a lot of people complaining that the ending spoils the film and is clichéd because the underdog and not the better fighter wins.I'm not suggesting that my interpretation is the right one but my view is somewhat different than the one some people hold. It is perfectly logical to point out that Brendan had hard fights to get to the final and that he would probably have been exhausted and that Tommy has had a much easier route.However, the point is that he made that route easier because of his rage. Tommy is only the more destructive force because of that. His demons are driving him on because he is lost. He cannot or will not reach out to connect with his father or brother. The point is that the dam is broken when he sees his father in the hotel room raging against Ahab. This is deeply symbolic. I think you are meant to draw the connection with Ahab who was driven by his own rage with the rage of the father which destroyed his family to the rage which Tommy now feels. Even though he is drunk it is no coincidence that his father refers to Tommy as Ahab and bellows at him to stop the ship. At the point that Tommy takes him in his arms and holds him he begins the healing process but loses what makes him such a formidable fighter. Thus he is simply unable to blow his brother away in the way that he has done to every other opponent.The other crucial point (and you would have to be a younger brother to fully get this one) is that Tommy doesn't really want to beat his brother at that point. He needs to know that his brother loves him and perhaps that he regrets not reaching out to him when they were younger. The fact that he taps out only at the point when Brendan says he loves him is significant as is the fact that he breaks down in the corner before the final round. Had he still been carrying his rage he would surely rather have been rendered unconscious than submit.In other words, for me it was the perfect ending and the more you think about the film the more profound it seems.All in my view of course. Which could be a load of old rubbish."
    },
    {
      "username": "MrSelfPaid",
      "userUrl": "https://www.imdb.com/user/ur31239994",
      "reviewLink": "https://www.imdb.com/review/rw5990940",
      "warningSpoilers": false,
      "date": "14 August 2020",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "One of the few movies that made me shed a few tears.",
      "content": "Watching this movie from my perspective, made me shed a few tears. For someone like me who has a younger brother that I always look after, I reacted to every scene as if it was parallel to my life.Great performances all around and one of the few movies that made me felt a range of emotions.See it."
    },
    {
      "username": "jon.h.ochiai",
      "userUrl": "https://www.imdb.com/user/ur1016453",
      "reviewLink": "https://www.imdb.com/review/rw2497983",
      "warningSpoilers": false,
      "date": "3 October 2011",
      "rate": "10",
      "helpful": "130 out of 184 found this helpful.",
      "title": "What You Fight For",
      "content": "\"Warrior\" may be one of the best movies of the year that no one sees. That in itself is puzzling. Mixed martial arts and UFC are in the cultural mainstream; in fact MMA is more popular than professional boxing. Director and writer Gavin O'Connor did the amazing \"Miracle\" a few years back about the 1980 U.S. Olympic Hockey Team. So he has the touch for inspirational sports stories. In \"Warrior\" estranged brothers Brendan Conlon (Joel Edgerton) and Tommy Conlon (Tom Hardy) fight each other in the finals of the winner take all mixed martial arts tournament Sparta in Atlantic City. \"Warrior\" is an inspired story of family, honor, and redemption. I applauded at the end of the movie along with the rest of the audience.\"Warrior\" is a paradox of styles as inspired by its leads. Tommy (Hardy) is the AWOL Marine war hero from Afghanistan. He literally tore off a submerged tank door, saving those inside. Tommy plows through opponents with sheer rage and power. He is explosive technique. We witness this as he savagely dismantles world middle weight contender \"Mad Dog\" Grimes (cocky Erik Apple) with kicks, punches, and throws in an impromptu sparring session. Tommy mysteriously appears at his Dad's door step in Pittsburgh. He blames Paddy (powerful and sublime Nick Nolte) for the death of his mother. Brendan (Edgerton) is the high school physics teacher and former UFC fighter. He and his wife Tess (strong Jennifer Morrison) work several jobs to pay their upside down mortgage. Brendan gets an entry into Sparta to save his family home. He is smart and willing to take punishment to leverage his opponent's mistakes—getting a tap out. Brendan like Tommy has no love for their recovered drunk Dad (Nolte).At the narrative arc Brendan says to Tommy, \"I love you!\" And neither will back down. I think O'Connor and writers Anthony Tambakis and Cliff Dorfman at times overstate the family dysfunction. \"Warrior\" could have been leaner, as strange as that sounds. The mixed martial arts fighting are world class and many of the fighters are MMA stars. Former professional wrestling champion Kurt Angle is fierce and dominating as Russian champ Koba. His match with Brendan is vicious and amazing. \"Warrior\" authentically gets the brutality and precision of mixed martial arts. Hardy and Edgerton are awesome. I read that Hardy trained intensely gaining 30 pounds of muscle. He broke ribs and fingers. Edgerton tore his knee out during the shoot.\"Warrior\" has a gritty atmosphere that is all about character and adversity. O'Connor seamlessly captures this in the simple camera shots and intimate dialog. He generates amazing performances. Edgerton is the delicate balance of compassion and focus. His Brendan is a good and decent man. Hardy has an electrifying enigmatic presence. He provokes a painful sadness and rage in Tommy, for whom honor and family are everything. Nick Nolte poignantly plays their broken father, who is pivotal in the redemption of his sons. Ultimately, \"Warrior\" is about forgiveness and love. It is one of the year's best."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2498197",
      "warningSpoilers": false,
      "date": "4 October 2011",
      "rate": "10",
      "helpful": "33 out of 49 found this helpful.",
      "title": "One of the best of the year",
      "content": "I love movies of all kinds regardless of their age. 2011 so far has been a very hit-and-miss year, luckily alongside Drive and The Tree of Life(though both won't appeal to all) Warrior is among my favourites of this year.Warrior is a well made and directed movie, with lighting that consistently fits with the mood and cinematography that is skillful and intelligently used. The dialogue was thought-provoking and written with vigour and heart, the fight scenes are incredible feeling both authentic(you can smell the sweat and feel the tears) and harrowing and the story for me was absorbing and hit me hard emotionally.The characters are fully credible too, and the wonderful performances help. Tom Hardy is outstanding in one of his best performances to date, and Joel Edgarton is every bit his equal, but Nick Nolte is a sheer delight and comes close to stealing the film on several occasions. The climax was very exciting, and while the film's end is rather inconclusive, everything else is so good you don't care so much.In conclusion, fantastic film and one of the best of the year. 10/10 Bethany Cox"
    },
    {
      "username": "Floated2",
      "userUrl": "https://www.imdb.com/user/ur19892892",
      "reviewLink": "https://www.imdb.com/review/rw6381079",
      "warningSpoilers": false,
      "date": "19 December 2020",
      "rate": "9",
      "helpful": "10 out of 12 found this helpful.",
      "title": "More than just a fighting film",
      "content": "Quite a compelling and interesting story unfolded with the main topic of mma fighting in \"Warrior\". Lead by a great cast and great acting from its leads, this film is quite a step above simply a fighting film. There is more depth than expected as it has a great buildup to its characters- and they seem like real people rather than just one dimensional caricatures.What makes Warrior work is not only the acting but the drama is quite compelling, touching and emotional given. Very good writing. The backstory for both leads of Joel Edgerton and Tom Hardy are quite good and as the film goes, we see things unfolding for the best. Nick Nolte is also really well in his role.Warrior can be enjoyed by more than just fight fans as the story goes deeper them simply fighting. Although the film is quite long in runtime, the pacing gives the film enough where it moves very smoothly. Nothing feels quite out of order or seems to drag.The ending was somewhat disappointing but it's understandable. Perhaps they could have went in another direction but other than that, Warrior is one of the better \"fighting\" \"sports\" films in recent memory."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3062522",
      "warningSpoilers": false,
      "date": "5 August 2014",
      "rate": "9",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Fighting",
      "content": "A movie called Warrior, well you know where this is heading. Even if there is also a philosophical side to the title (a more spiritual one so to speak). Tom Hardy got a lot of recognition for this, but Nick Nolte and our other main character are as good in this. We have two people who will engage each other, having a common issue. It's not a spoiler to write it, you'll find out soon enough (or guess it), but I'll let you do that for yourself.We established this is very nicely acted, but it's the story that matters. The past that is still haunting the present and holds some people down, so they're not able to continue to explore the \"future\". Shackles can be metaphorical too. And in this case it seems almost impossible to get rid of them. A drama that also has some fine action scenes in it ... More than worth a look"
    },
    {
      "username": "mattyt_tmf",
      "userUrl": "https://www.imdb.com/user/ur90030178",
      "reviewLink": "https://www.imdb.com/review/rw5090653",
      "warningSpoilers": true,
      "date": "31 August 2019",
      "rate": "10",
      "helpful": "26 out of 29 found this helpful.",
      "title": "One of the most heart-breaking, emotional films I have ever seen.",
      "content": "It's really hard to start with this movie. It basically covers two estranged brothers - One who has embraced a quiet, family life; the other, dedicated his time to the United States military. Through a series of events, they come in contact with each other again during a MMA tournament. Tom Hardy and Joel Edgerton capture the hearts of the fans with their emotional, tear-wrenching performances, with Nick Nolte as their father delivering the most emotional performance of them all. With the film being a MMA movie, it's strange to think that drama would be so prevalent but essentially it is the backbone of the story.The addition of The National's 'About Today' cements the final scene as a definite tear-jerker."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw3654061",
      "warningSpoilers": false,
      "date": "4 March 2017",
      "rate": "8",
      "helpful": "8 out of 10 found this helpful.",
      "title": "A New Fight Movie For A New Fight Generation",
      "content": "Over the years, the sport of boxing has provided film-goers with undeniably great films like \"Rocky\", \"The Champ\", \"Million Dollar Baby\", and \"The Fighter\". In today's culture, though, boxing has largely been replaced by mixed martial arts as the fight game of choice. This was never more apparent than in the early 2010s when this film was released. While \"Warrior\" is by no means a perfect film, it easily does enough to speak to this new culture of combat films.For a very basic overview, \"Warrior\" tells the story of two fighting brothers and their father. Brendan Conlon (Joel Edgerton) is a high school physics teacher moonlighting in MMA for the money to save his family from home foreclosure. Tommy Conlon (Tom Hardy) is a former Marine and former high school wrestling champion appearing seemingly out of nowhere to get back into the fight game. Their commonality? Father Paddy (Nick Nolte), who is equal parts resented and grudgingly respected by the brothers. When a winner-take-all MMA tournament is constructed, both men have the opportunity to financially take care of themselves and settled some past/personal scores.What's interesting about this film is how one gets the sense that it was initially constructed to piggyback on the peak of UFC popularity, but then sort of \"lucked into\" a lot of factors that really transcend the material. I say this because the MMA themes and fighting scenes here are superbly done. Director/writer Gavin O'Connor really understands the themes inherent in MMA and uses them all very effectively here. Backing up that material is a human drama story about a broken family, which also contains all the elements of great filmmaking.To be honest, the only reason I limit my ranking to 8/10 stars (and not higher) is because the film needed far more of that family drama. With an expanded focus on those angles, it could have been an all-time classic. As it stands, \"Warrior\" does just enough hit the right notes. I just wish it would have held them longer, so to speak.What really helps is that the casting here is about as perfect as a film can get. Hardy is legitimately physically imposing as the hulking, brooding Tommy, Edgerton is eminently believe as the teacher-turned-fighter, and Nolte often steals the show in the scenes he's in. With scripted material that often is only just under the surface-level of past/family/personal issues, the actors here sell it all simply by sheer performance power.Overall, I consider \"Warrior\" to be a solid sports drama that compares favorably to others of its kind. While it lacks the depth of character to be a \"Rocky\" or \"Million Dollar Baby\", it certainly takes many of those films' themes and grafts them onto a new culture (MMA) that will appeal to audiences having grown up watching such events."
    },
    {
      "username": "BrnzReviews",
      "userUrl": "https://www.imdb.com/user/ur102393358",
      "reviewLink": "https://www.imdb.com/review/rw7115189",
      "warningSpoilers": false,
      "date": "12 July 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A Great Take On Rivalry, Family & Pride!",
      "content": "Being a huge MMA fan i knew this movie was going to be good, I'm also a massive fan of Tom Hardy too so it's a win win. The movie was great, story held up and really felt engaging the entire way through, i liked the way the movie was made where we switch between each character, it really helps the character development get underway and this movie excells in that aspect, along with being one of the best fighter movies I've seen in this day and age.I really felt entertained and believe this is definitely one of Hardy's best peformances although i did enjoy Joel Edgertons job as Brendan Conlon, even though it was a first of his I've seen i thought it was a very charismatic take on a true story, so inspiring.Highly recommend!"
    },
    {
      "username": "nyharlemeve",
      "userUrl": "https://www.imdb.com/user/ur27873037",
      "reviewLink": "https://www.imdb.com/review/rw2486656",
      "warningSpoilers": false,
      "date": "10 September 2011",
      "rate": "",
      "helpful": "354 out of 451 found this helpful.",
      "title": "A wonderfully, well written story",
      "content": "This movie is truly, truly OUTSTANDING! I am in complete shock over the performances in this film. Nick Nolte, as usual, gives a gritty, gut wrenching, emotional performance that left me buckling at the knees. One of my all time favorite movies of Mr. Nolte was Rich Man, Poor Man, absolutely a god given talent! The performances of Mr. Hardy and Mr. Edgeron were academy award winning, I would love to see more of them by far! I cried throughout the movie, and when it was over, I could not wait to tell everyone about it. A terrific ensemble cast and movie that certainly should be up for Best Picture!! A definitive Oscar nod for Nick Nolte, and if it were up to me, Mr. Hardy and Mr. Edgeron would walk away with one as well! If you have not seen this movie, drop what you are doing, run to your nearest theater. This movie is truly what being a performer is all about! My hat is off to you all!!!"
    },
    {
      "username": "nyUconn",
      "userUrl": "https://www.imdb.com/user/ur26563834",
      "reviewLink": "https://www.imdb.com/review/rw2492432",
      "warningSpoilers": false,
      "date": "22 September 2011",
      "rate": "10",
      "helpful": "286 out of 371 found this helpful.",
      "title": "FANTASTIC MOVIE...can't believe it hasn't gotten more attention. 10/10",
      "content": "Grab your popcorn, buy your soda..and get ready for a great movie.From start to finish, this movie will have you hooked. There is no weak spot in this movie. The acting is amazing. The story is great. The music is catchy. You will get emotionally invested throughout this story.This movie will make you FEEL something. This movie will ENTERTAIN you.This film has great drama, action, and story. I walked out of the movie being so impressed, and in shock how this hadn't gotten more attention or done better at the box office.This movie is a MUST SEE. And I'm pretty picky. Enjoy."
    },
    {
      "username": "siderite",
      "userUrl": "https://www.imdb.com/user/ur3146136",
      "reviewLink": "https://www.imdb.com/review/rw2659639",
      "warningSpoilers": false,
      "date": "16 August 2012",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Emotional, long, but very good sports drama",
      "content": "Who will win the fight? Bane or the guy who fought The Thing? Seriously now, the acting in this movie was way above the genre of this film. I know it was a sports fighting movie and I expected things on par with van Damme Asian tournament films. Boy, was I wrong!The first thing to note about the movie is that it is long. It spans two hours and twenty minutes. The first half sets up the characters and how their dysfunctional family got them to where they are. I expected the second half to be filled with fighting action and it was, but only half. The makers of the film realised it was more important to show the mindset and state of spirit of the characters, let them develop rather than show only fights. And so they got a beautiful film.Bottom line: for this genre, the movie is clearly amongst the best. It doesn't uselessly inspire the audience to take up fighting or hate or love one of the characters. Much better, they give us two characters to love and the decision, up to the final fight, is the viewer's: how would you like this fight to end? That question, that situation in which you get to think and choose for yourself is almost unprecedented in a sports movie and more appropriate to more philosophical high brow films and makes the end result irrelevant. Good job!"
    },
    {
      "username": "h-28658",
      "userUrl": "https://www.imdb.com/user/ur114712021",
      "reviewLink": "https://www.imdb.com/review/rw5757909",
      "warningSpoilers": false,
      "date": "21 May 2020",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "One of the most underrated film out there.",
      "content": "As one brothers fights for his family the other fights for his country. Another great underdog story."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw2563195",
      "warningSpoilers": false,
      "date": "9 February 2012",
      "rate": "6",
      "helpful": "90 out of 181 found this helpful.",
      "title": "Clichéd sports movie with some good points",
      "content": "A very cliché sports story, with so many corny moments that you'll have seen in six dozen other films that it becomes ludicrous long before its end. Yet, in some ways, it's pretty well done, and it nearly overcomes those clichés. Joel Edgerton and Tom Hardy play two brothers who parted ways way back when they were teenagers. Hardy went away with his mother and later joined the Marines after she passed away. Now he has returned to his father (Nick Nolte), a former drunk who drove his family apart. Edgerton didn't like his father much, either, but chose not to go with his brother and mother because he was in love with the woman he would eventually marry (Jennifer Morrison). Both brothers are skilled fighters and have their eyes set on the big prize in a mixed martial arts tournament. The film somewhat succeeds because it's very low-key. Most of the time, it's hard to notice how melodramatic and predictable the story is. The performances help, too (Joel Edgerton was my favorite of the three big characters). After a while, though, we get stuff like a wife who refuses to watch the fight impatiently pacing behind her cell phone, on a table in the foreground, waiting for a call to tell her her husband has won a match. And Hardy's story is beyond ridiculous - he gets invited to the tournament after beating up a trained MMA champion in a local gym - never mind that Hardy, at best, was just a trained wrestler many years ago in high school. Being in the Marines does not give you superpowers. That's just the start of the ridiculousness that ends up, obviously, with the two brothers fighting in the ring (with Edgerton's wife, at this point, of course watching from ringside). I should probably call Gavin O'Connor one of the best directors of the year, because, as over-the-top as all this stuff is (and, believe me, I barely scratched the surface - the movie runs for 2 hours and 20 minutes), it generally doesn't feel that way. If one doesn't look too closely at it, I could imagine it seeming great. But it's not."
    },
    {
      "username": "filmreviewer123",
      "userUrl": "https://www.imdb.com/user/ur118984145",
      "reviewLink": "https://www.imdb.com/review/rw6205980",
      "warningSpoilers": false,
      "date": "25 October 2020",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "10/10 I can't get over how good this film was.",
      "content": "I absolutely loved this film, defo one to watch. So much emotion and tension, there wasn't one weak moment of this film. I can't wait to watch it again."
    },
    {
      "username": "pgregory_photo",
      "userUrl": "https://www.imdb.com/user/ur104514493",
      "reviewLink": "https://www.imdb.com/review/rw6037089",
      "warningSpoilers": false,
      "date": "29 August 2020",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "What a movie ignore the title it's deceiving and the fact it has MMA in this movie is so much more",
      "content": "I remember when this movie came out and I didn't bother with it as it sounded like a action MMA testeroned filled hour plus I didn't want to waste. If that's your kind of movie you won't like this, but if you like films like Rocky, the fighter, films that martial arts are apart of the main theme. You will love this.Nick Nolte has always been one of my favourite actors, and Joel Edgerton, Tom Hardy also hasn't disappointed in anything I've seen him in. The title doesn't do this film justice tbh it's why I passed it by previously it's sounds lame asf. Ignore the title and the MMA theme it's about family and the struggles that are contained within throw in life's upside downs and the sometimes unfortunate places We find ourselves and people it molds is into, and how our past and present can make us desperate for connection but also makes us avoid and destroy it.I enjoyed this film I can relate to a lot of the struggles the characters were going through, it's a hidden gem. It's deserves a place on the self with the before mentioned great movies. It's not an action flick or about being a warrior but about being human and fighting the human condition"
    },
    {
      "username": "cervantese",
      "userUrl": "https://www.imdb.com/user/ur27893218",
      "reviewLink": "https://www.imdb.com/review/rw2484275",
      "warningSpoilers": false,
      "date": "1 September 2011",
      "rate": "10",
      "helpful": "196 out of 261 found this helpful.",
      "title": "Loved IT!",
      "content": "I had the pleasure of watching this movie last night. I went since its a \"guy\" movie my husband was the one excited about it more than I was. I must say I was more than impressed with the leading men in this film. It has been a long time since a movie has had me on the edge of my seat, biting my nails as this movie did during the fighting scenes. If you are looking for great acting, family drama, awesome fighting scenes than this is the movie for you. After we left the theater we couldn't stop talking about it. I will definitely go see it again when it comes out. We really enjoyed it! Nick Nolte was amazing, and even my husband I think cried in a few scenes, (last time that happened was during Marley and Me) so I must say this movie is a MUST SEE!"
    },
    {
      "username": "andrewchristianjr",
      "userUrl": "https://www.imdb.com/user/ur79190944",
      "reviewLink": "https://www.imdb.com/review/rw5581782",
      "warningSpoilers": false,
      "date": "27 March 2020",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "MORE THAN ACTION AND FIGHTING.",
      "content": "To this day this is one of my favorite movies. It's not because of the action and fighting. It is so much more than that. It is one of the few movies I have seen that take you on a complete emotional rollercoaster. Yes Testosterone filled but also touching and family based."
    }
  ],
  "errorMessage": ""
}