{
  "imDbId": "tt1291584",
  "title": "Warrior",
  "fullTitle": "Warrior (2011)",
  "type": "Movie",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "Warrior (2011 film)",
  "url": "https://en.wikipedia.org/wiki/Warrior_(2011_film)",
  "plotShort": {
    "plainText": "Warrior is a 2011 American sports action film directed by Gavin O'Connor. It stars Tom Hardy and Joel Edgerton as two estranged brothers whose entrance into a mixed martial arts tournament makes them come to terms with their lives and each other. Nick Nolte, Jennifer Morrison, Frank Grillo, and Bryan Callen appear in supporting roles. Real-life MMA and combat sports figures like Kurt Angle, Nate Marquardt, Anthony Johnson, Roan Carneiro, Yves Edwards, Amir Perets, and Dan Caldwell make appearances.\r\nThe film was theatrically released in the United States on September 9, 2011, by Lionsgate. Although not commercially successful, the film received positive reviews from critics, with Nolte receiving an Academy Award nomination for Best Supporting Actor.",
    "html": "<p>Warrior is a 2011 American sports action film directed by Gavin O'Connor. It stars Tom Hardy and Joel Edgerton as two estranged brothers whose entrance into a mixed martial arts tournament makes them come to terms with their lives and each other. Nick Nolte, Jennifer Morrison, Frank Grillo, and Bryan Callen appear in supporting roles. Real-life MMA and combat sports figures like Kurt Angle, Nate Marquardt, Anthony Johnson, Roan Carneiro, Yves Edwards, Amir Perets, and Dan Caldwell make appearances.</p><p>The film was theatrically released in the United States on September 9, 2011, by Lionsgate. Although not commercially successful, the film received positive reviews from critics, with Nolte receiving an Academy Award nomination for Best Supporting Actor.</p>"
  },
  "plotFull": {
    "plainText": "Warrior is a 2011 American sports action film directed by Gavin O'Connor. It stars Tom Hardy and Joel Edgerton as two estranged brothers whose entrance into a mixed martial arts tournament makes them come to terms with their lives and each other. Nick Nolte, Jennifer Morrison, Frank Grillo, and Bryan Callen appear in supporting roles. Real-life MMA and combat sports figures like Kurt Angle, Nate Marquardt, Anthony Johnson, Roan Carneiro, Yves Edwards, Amir Perets, and Dan Caldwell make appearances.\r\nThe film was theatrically released in the United States on September 9, 2011, by Lionsgate. Although not commercially successful, the film received positive reviews from critics, with Nolte receiving an Academy Award nomination for Best Supporting Actor.\r\nPlot\r\nA melancholy U.S. Marine Thomas \"Tommy\" Riordan visits his father, Paddy Conlon, a recovering alcoholic who has returned to his Catholic faith in Pittsburgh, Pennsylvania. As a child, Tommy had to run away from Paddy with his dying mother due to Paddy being an abusive alcoholic, and has never forgiven him. Paddy tries to convince him that he has changed, but to no avail. The next day, Tommy enters a gym where he quickly knocks out Pete \"Mad Dog\" Grimes, one of the world's best middleweight fighter; a video of the fight goes viral on the Internet. Learning about a winner-takes-all mixed martial arts tournament called Sparta, whose winner will receive $5 million, Tommy asks Paddy to help him train for the tournament, but only under the condition that Paddy does not try to reconcile their relationship. Tommy pledges to win and then donate the entire $5 million purse to Pilar, the widow of one of his friends in the corps.\r\nTommy's older brother Brendan, a high school physics teacher and former MMA fighter, is struggling to provide for his wife, Tess, and their two daughters. He had to mortgage his house in Philadelphia to pay for his younger daughter's open heart surgery, and is now in danger of losing it. To increase his income, Brendan starts battling amateur fighters for money. He is suspended without pay after details of his secret life spread around the school. Paddy meets Brendan in his driveway to try to reconcile with him, albeit unsuccessfully, and to tell him that Tommy is back in town. Brendan seeks the training of old friend Frank Campana and begins competing in smaller venue fights. After the fighter Frank planned to enter into the Sparta tournament is injured, Brendan convinces Frank to enter him as a replacement.\r\nWhen the brothers separately enter the tournament, it is revealed that Tommy is angry at Brendan for bailing out on him and instead staying behind for Tess when Tommy and their mother left Paddy; Tommy was left to care for their mother when she became terminally ill. Brendan claims that he was helplessly in love with Tess and that he has forgiven his father for the wrong he has done, but Tommy is unconvinced and walks away.\r\nMeanwhile, the video of Tommy beating Grimes attracts the attention of a Marine, who tells the press that Tommy saved his life in Iraq, by ripping off the back hatch of a drowning tank. Although Tommy becomes a national hero, his military records reveal that he deserted after his unit was killed in a friendly fire bombing. He reveals to have pledged to give his winnings to Pilar, the widow of one of his fallen friends, Manny. The military police will take him into custody but will wait until after the tournament is over.\r\nOver two nights, Brendan and Tommy have contrasting fortunes: Tommy quickly and brutally knocks out opponents, doesn't say or talk much, while Brendan is outmatched physically but uses Brazilian Jiu-Jitsu to force grappling submissions. In the semifinals, Brendan is matched up with undefeated Russian wrestler Koba, who dominates him in two rounds. In round three, Brendan swings for the fences, making the bout a back and forth battle. In the closing moments of the final round, Koba takes Brendan's back from the clinch and Brendan goes for a rolling kneebar. As Koba attempts to escape the position, Brendan quickly reverses and readjusts the kneebar, narrowly winning by submission. Tommy is matched up with Madd Dog Grimes, knocking him unconscious almost immediately, which the commentators claim to be one of the fastest knockouts in MMA history.\r\nThe night before the final day, Paddy attempts to talk to Tommy about his actions in Iraq. Tommy angrily dismisses his father, letting out all his pent up emotions. Paddy relapses and starts drinking again. Seeing his father in pain, Tommy calms and comforts him, thus resurrecting the relationship with him.\r\nTommy and Brendan's relationship is revealed to the world when they are the tournament's last remaining fighters. Brendan shows desire to reconcile, but Tommy, still in pain, shows no interest in doing so. Tommy wins the first two rounds, but Brendan eventually dislocates Tommy's shoulder with an omoplata arm-lock. Brendan wants to tell the referee about Tommy's dislocated shoulder and end the fight, but his coach suggests otherwise. As the fourth round starts, Brendan insists Tommy give up as Tommy only has use of one arm. Tommy continues to fight, Brendan unloads a barrage of strikes trying to win. Tommy asks Brendan to continue hitting him as the fourth round ends. At the start of Round 5, Brendan realizes he has to force him to submit, and he traps Tommy in a rear naked choke. As they struggle on the canvas, Brendan apologizes to Tommy and tells him that he loves him. Tommy submits after hearing the words. Brendan and Campana tactfully avoid the referees and the doctors checking in on Tommy. The reconciled brothers exit the ring as their father walks away into the background smiling.\r\nCast\r\nTom Hardy as Thomas \"Tommy\" Riordan Conlon\r\nJoel Edgerton as Brendan Conlon\r\nNick Nolte as Paddy Conlon\r\nJennifer Morrison as Tess Conlon\r\nFrank Grillo as Frank Campana\r\nKevin Dunn as Principal Joe Zito\r\nVanessa Martinez as Pilar Fernandez\r\nNoah Emmerich as Dan Taylor\r\nLaura Chinn as K.C.\r\nCapri Thomas as Emily Conlon\r\nLexi Cowan as Rosie Conlon\r\nDenzel Whitaker as Stephon\r\nCarlos Miranda as Tito\r\nNick Lehane as Nash\r\nCharlie Smith as Leo\r\nMaximiliano Hernández as Colt Boyd\r\nFernando Chien as Ian Fenroy\r\nKurt Angle as Koba\r\nErik Apple as Pete \"Mad Dog\" Grimes\r\nNate Marquardt as Karl \"The Dane\" Kruller\r\nAnthony Johnson as Orlando \"Midnight\" Le\r\nRoan Carneiro as Marcos Santos\r\nYves Edwards as Houston Greggs\r\nGavin O'Connor as J.J. Riley\r\nJake McLaughlin as Mark Bradford\r\nAmir Perets as Yosi Haas\r\nDan Caldwell as himself\r\nBryan Callen as himself\r\nRashad Evans as himself\r\nThemes\r\nDescribed by critics as \"heartbreaking and emotionally satisfying\", \"really gripping\", \"an unapologetic powerhouse of emotional conflict\" and self-described as a \"rousing ode to redemption, reconciliation and the power of the human spirit\", Warrior has received the most praise for the emotional approach it takes to the themes of forgiveness and \"the enduring bonds of family\" that it explores. In their review, Common Sense Media cites unconditional love as a major theme, further explaining that \"some weighty issues\" such as estrangement and alcoholism are also dealt with.\r\nProduction\r\nMogul Minds Studios, (now 31st Street Studios), located in Pittsburgh, was used during the filming, as well as the University of Pittsburgh's Petersen Events Center and the Twin Hi-Way Drive-In. North Hills Senior High School was also used for some scenes. Boardwalk Hall in Atlantic City was used for the exterior scenes of the main fight venue, along with scenes filmed on the boardwalk and beach.\r\nHardy went through a demanding training routine for gaining muscle during the film's pre-production, gaining around 28 pounds (13 kg) of muscle (a physique which he also used to portray Bane in The Dark Knight Rises).\r\nRelease\r\nThe film was released in the United States on September 9, 2011.\r\nMarketing\r\nThe Men of Warrior book was released on July 19, 2011. Lionsgate's \"We Are All Warriors\" project to support the release of Warrior by highlighting everyday heroes was launched August 1, 2011.\r\nHome media\r\nWarrior was released on DVD and Blu-ray in the United States on December 20, 2011. The Blu-ray release includes a DVD copy of the movie, as well as a downloadable digital copy. With the exception of the Blu-ray including an additional Feature Length Enhanced Viewing Mode, extras are similar between both releases.\r\nReception\r\nBox office\r\nWarrior debuted in third place in its first week at the U.S. box office with $5.2 million behind Contagion and The Help. It dropped down to #8 the following weekend. Overall, the film made $13.7 million in United States and Canada, and $9.6 million in foreign countries for a worldwide total of $23.3 million.\r\nCritical response\r\nOn Rotten Tomatoes the film has an approval rating of 84% based on 195 reviews, with an average score of 7.3/10. The site's critical consensus reads: \"Warrior relies on many of the clichés that critics of the genre love to mock — and it transcends them with gripping action, powerful acting, and heart.\" On Metacritic the film has a weighted average score of 71 out of 100, based on reviews from 35 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.\r\nBruce Diones of The New Yorker highly praised the actors' performances, especially Tom Hardy's, as \"convincingly real\" and \"sensational.\" He further complimented the film as \"cathartic\" and \"winning,\" and said that the film as a whole \"achieves a surprising compassion and honesty.\" Simon Miraudo from Quickflix praised the character development of brothers Tommy Riordan and Brendan Conlon: \"When they speak to each other for the first time in the film – amazingly, only once before they actually meet in the ring – we understand their relationship completely.\" He called the film as a whole \"beautiful\" in spite of how violent it is, and gave it 4 out of 5 stars. Common Sense Media's Sandie Angulo Chen called the film \"a touching family drama wrapped in an intense 'David vs. Goliath'-style fight.\" Meanwhile, Roger Ebert gave the film 3 out of 4 stars, declaring that \"this is a rare fight movie in which we don't want to see either fighter lose,\" while praising Gavin O'Connor's direction and Nick Nolte's performance. Peter Travers of Rolling Stone was also complimentary towards O'Connor, stating that he \"comes out swinging in this flawed but fiercely moving family drama,\" while A.O. Scott of The New York Times credited the film for being \"appropriately blunt, powerful and relentless,\" also praising the \"skillfully staged\" fight scenes.\r\nAndrew Pulver of The Guardian rated the film 2 out of 5 stars stating, \"This mixed-martial-arts fight movie has received bafflingly high praise considering its lunkhead plot and rudimentary characters\".\r\nKirk Honeycutt of The Hollywood Reporter stated, \"For an \"entertainment,\" Warrior accomplishes a lot. The family drama resonates strongly with a resolution that, in retrospect, seems like the only way the brothers could have rediscovered blood ties.\"\r\nSome critics, including Philip French from the UK magazine The Observer, have noted similarities to other sports drama films such as Rocky (1976), The Wrestler (2008), and The Fighter (2010).\r\nSoundtrack\r\nWarrior: Original Score is the soundtrack album for the film, composed and produced by Mark Isham. It was released by Lakeshore Records on September 13, 2011. The song \"About Today\" by the indie rock band The National was also featured on the soundtrack and also in the film during the final fight scene. The composition entitled \"Listen to the Beethoven\" incorporates elements of the final movement of Ludwig van Beethoven's ninth symphony, which is featured prominently throughout the film.\r\nAdaptations\r\nThe film had an Indian adaptation titled Brothers (2015) starring Akshay Kumar and Sidharth Malhotra in lead roles.\r\nA film with the same title and similar plot was made in 2015 in Russia.",
    "html": "<p>Warrior is a 2011 American sports action film directed by Gavin O'Connor. It stars Tom Hardy and Joel Edgerton as two estranged brothers whose entrance into a mixed martial arts tournament makes them come to terms with their lives and each other. Nick Nolte, Jennifer Morrison, Frank Grillo, and Bryan Callen appear in supporting roles. Real-life MMA and combat sports figures like Kurt Angle, Nate Marquardt, Anthony Johnson, Roan Carneiro, Yves Edwards, Amir Perets, and Dan Caldwell make appearances.</p><p>The film was theatrically released in the United States on September 9, 2011, by Lionsgate. Although not commercially successful, the film received positive reviews from critics, with Nolte receiving an Academy Award nomination for Best Supporting Actor.</p><br/><h3>Plot</h3><p>A melancholy U.S. Marine Thomas \"Tommy\" Riordan visits his father, Paddy Conlon, a recovering alcoholic who has returned to his Catholic faith in Pittsburgh, Pennsylvania. As a child, Tommy had to run away from Paddy with his dying mother due to Paddy being an abusive alcoholic, and has never forgiven him. Paddy tries to convince him that he has changed, but to no avail. The next day, Tommy enters a gym where he quickly knocks out Pete \"Mad Dog\" Grimes, one of the world's best middleweight fighter; a video of the fight goes viral on the Internet. Learning about a winner-takes-all mixed martial arts tournament called Sparta, whose winner will receive $5 million, Tommy asks Paddy to help him train for the tournament, but only under the condition that Paddy does not try to reconcile their relationship. Tommy pledges to win and then donate the entire $5 million purse to Pilar, the widow of one of his friends in the corps.</p><p>Tommy's older brother Brendan, a high school physics teacher and former MMA fighter, is struggling to provide for his wife, Tess, and their two daughters. He had to mortgage his house in Philadelphia to pay for his younger daughter's open heart surgery, and is now in danger of losing it. To increase his income, Brendan starts battling amateur fighters for money. He is suspended without pay after details of his secret life spread around the school. Paddy meets Brendan in his driveway to try to reconcile with him, albeit unsuccessfully, and to tell him that Tommy is back in town. Brendan seeks the training of old friend Frank Campana and begins competing in smaller venue fights. After the fighter Frank planned to enter into the Sparta tournament is injured, Brendan convinces Frank to enter him as a replacement.</p><p>When the brothers separately enter the tournament, it is revealed that Tommy is angry at Brendan for bailing out on him and instead staying behind for Tess when Tommy and their mother left Paddy; Tommy was left to care for their mother when she became terminally ill. Brendan claims that he was helplessly in love with Tess and that he has forgiven his father for the wrong he has done, but Tommy is unconvinced and walks away.</p><p>Meanwhile, the video of Tommy beating Grimes attracts the attention of a Marine, who tells the press that Tommy saved his life in Iraq, by ripping off the back hatch of a drowning tank. Although Tommy becomes a national hero, his military records reveal that he deserted after his unit was killed in a friendly fire bombing. He reveals to have pledged to give his winnings to Pilar, the widow of one of his fallen friends, Manny. The military police will take him into custody but will wait until after the tournament is over.</p><p>Over two nights, Brendan and Tommy have contrasting fortunes: Tommy quickly and brutally knocks out opponents, doesn't say or talk much, while Brendan is outmatched physically but uses Brazilian Jiu-Jitsu to force grappling submissions. In the semifinals, Brendan is matched up with undefeated Russian wrestler Koba, who dominates him in two rounds. In round three, Brendan swings for the fences, making the bout a back and forth battle. In the closing moments of the final round, Koba takes Brendan's back from the clinch and Brendan goes for a rolling kneebar. As Koba attempts to escape the position, Brendan quickly reverses and readjusts the kneebar, narrowly winning by submission. Tommy is matched up with Madd Dog Grimes, knocking him unconscious almost immediately, which the commentators claim to be one of the fastest knockouts in MMA history.</p><p>The night before the final day, Paddy attempts to talk to Tommy about his actions in Iraq. Tommy angrily dismisses his father, letting out all his pent up emotions. Paddy relapses and starts drinking again. Seeing his father in pain, Tommy calms and comforts him, thus resurrecting the relationship with him.</p><p>Tommy and Brendan's relationship is revealed to the world when they are the tournament's last remaining fighters. Brendan shows desire to reconcile, but Tommy, still in pain, shows no interest in doing so. Tommy wins the first two rounds, but Brendan eventually dislocates Tommy's shoulder with an omoplata arm-lock. Brendan wants to tell the referee about Tommy's dislocated shoulder and end the fight, but his coach suggests otherwise. As the fourth round starts, Brendan insists Tommy give up as Tommy only has use of one arm. Tommy continues to fight, Brendan unloads a barrage of strikes trying to win. Tommy asks Brendan to continue hitting him as the fourth round ends. At the start of Round 5, Brendan realizes he has to force him to submit, and he traps Tommy in a rear naked choke. As they struggle on the canvas, Brendan apologizes to Tommy and tells him that he loves him. Tommy submits after hearing the words. Brendan and Campana tactfully avoid the referees and the doctors checking in on Tommy. The reconciled brothers exit the ring as their father walks away into the background smiling.</p><br/><h3>Cast</h3><ul><li>Tom Hardy as Thomas \"Tommy\" Riordan Conlon</li><li>Joel Edgerton as Brendan Conlon</li><li>Nick Nolte as Paddy Conlon</li><li>Jennifer Morrison as Tess Conlon</li><li>Frank Grillo as Frank Campana</li><li>Kevin Dunn as Principal Joe Zito</li><li>Vanessa Martinez as Pilar Fernandez</li><li>Noah Emmerich as Dan Taylor</li><li>Laura Chinn as K.C.</li><li>Capri Thomas as Emily Conlon</li><li>Lexi Cowan as Rosie Conlon</li><li>Denzel Whitaker as Stephon</li><li>Carlos Miranda as Tito</li><li>Nick Lehane as Nash</li><li>Charlie Smith as Leo</li><li>Maximiliano Hernández as Colt Boyd</li><li>Fernando Chien as Ian Fenroy</li><li>Kurt Angle as Koba</li><li>Erik Apple as Pete \"Mad Dog\" Grimes</li><li>Nate Marquardt as Karl \"The Dane\" Kruller</li><li>Anthony Johnson as Orlando \"Midnight\" Le</li><li>Roan Carneiro as Marcos Santos</li><li>Yves Edwards as Houston Greggs</li><li>Gavin O'Connor as J.J. Riley</li><li>Jake McLaughlin as Mark Bradford</li><li>Amir Perets as Yosi Haas</li><li>Dan Caldwell as himself</li><li>Bryan Callen as himself</li><li>Rashad Evans as himself</li></ul><br/><h3>Themes</h3><p>Described by critics as \"heartbreaking and emotionally satisfying\", \"really gripping\", \"an unapologetic powerhouse of emotional conflict\" and self-described as a \"rousing ode to redemption, reconciliation and the power of the human spirit\", Warrior has received the most praise for the emotional approach it takes to the themes of forgiveness and \"the enduring bonds of family\" that it explores. In their review, Common Sense Media cites unconditional love as a major theme, further explaining that \"some weighty issues\" such as estrangement and alcoholism are also dealt with.</p><br/><h3>Production</h3><p>Mogul Minds Studios, (now 31st Street Studios), located in Pittsburgh, was used during the filming, as well as the University of Pittsburgh's Petersen Events Center and the Twin Hi-Way Drive-In. North Hills Senior High School was also used for some scenes. Boardwalk Hall in Atlantic City was used for the exterior scenes of the main fight venue, along with scenes filmed on the boardwalk and beach.</p><p>Hardy went through a demanding training routine for gaining muscle during the film's pre-production, gaining around 28 pounds (13 kg) of muscle (a physique which he also used to portray Bane in The Dark Knight Rises).</p><br/><h3>Release</h3><p>The film was released in the United States on September 9, 2011.</p><h4>Marketing</h4><p>The Men of Warrior book was released on July 19, 2011. Lionsgate's \"We Are All Warriors\" project to support the release of Warrior by highlighting everyday heroes was launched August 1, 2011.</p><br/><h3>Home media</h3><p>Warrior was released on DVD and Blu-ray in the United States on December 20, 2011. The Blu-ray release includes a DVD copy of the movie, as well as a downloadable digital copy. With the exception of the Blu-ray including an additional Feature Length Enhanced Viewing Mode, extras are similar between both releases.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Warrior debuted in third place in its first week at the U.S. box office with $5.2 million behind Contagion and The Help. It dropped down to #8 the following weekend. Overall, the film made $13.7 million in United States and Canada, and $9.6 million in foreign countries for a worldwide total of $23.3 million.</p><h4>Critical response</h4><p>On Rotten Tomatoes the film has an approval rating of 84% based on 195 reviews, with an average score of 7.3/10. The site's critical consensus reads: \"Warrior relies on many of the clichés that critics of the genre love to mock — and it transcends them with gripping action, powerful acting, and heart.\" On Metacritic the film has a weighted average score of 71 out of 100, based on reviews from 35 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.</p><p>Bruce Diones of The New Yorker highly praised the actors' performances, especially Tom Hardy's, as \"convincingly real\" and \"sensational.\" He further complimented the film as \"cathartic\" and \"winning,\" and said that the film as a whole \"achieves a surprising compassion and honesty.\" Simon Miraudo from Quickflix praised the character development of brothers Tommy Riordan and Brendan Conlon: \"When they speak to each other for the first time in the film – amazingly, only once before they actually meet in the ring – we understand their relationship completely.\" He called the film as a whole \"beautiful\" in spite of how violent it is, and gave it 4 out of 5 stars. Common Sense Media's Sandie Angulo Chen called the film \"a touching family drama wrapped in an intense 'David vs. Goliath'-style fight.\" Meanwhile, Roger Ebert gave the film 3 out of 4 stars, declaring that \"this is a rare fight movie in which we don't want to see either fighter lose,\" while praising Gavin O'Connor's direction and Nick Nolte's performance. Peter Travers of Rolling Stone was also complimentary towards O'Connor, stating that he \"comes out swinging in this flawed but fiercely moving family drama,\" while A.O. Scott of The New York Times credited the film for being \"appropriately blunt, powerful and relentless,\" also praising the \"skillfully staged\" fight scenes.</p><p>Andrew Pulver of The Guardian rated the film 2 out of 5 stars stating, \"This mixed-martial-arts fight movie has received bafflingly high praise considering its lunkhead plot and rudimentary characters\".</p><p>Kirk Honeycutt of The Hollywood Reporter stated, \"For an \"entertainment,\" Warrior accomplishes a lot. The family drama resonates strongly with a resolution that, in retrospect, seems like the only way the brothers could have rediscovered blood ties.\"</p><p>Some critics, including Philip French from the UK magazine The Observer, have noted similarities to other sports drama films such as Rocky (1976), The Wrestler (2008), and The Fighter (2010).</p><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>does not <span>cite</span> any <span>sources</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this section</span> by <span>adding citations to reliable sources</span>. Unsourced material may be challenged and <span>removed</span>.</span>  <span class=\"date-container\"><i>(<span class=\"date\">October 2015</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Warrior: Original Score</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Mark Isham</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">September 11, 2011</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Film score</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span class=\"mw-redirect\">Lakeshore</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">Mark Isham</td></tr></tbody></table><p>Warrior: Original Score is the soundtrack album for the film, composed and produced by Mark Isham. It was released by Lakeshore Records on September 13, 2011. The song \"About Today\" by the indie rock band The National was also featured on the soundtrack and also in the film during the final fight scene. The composition entitled \"Listen to the Beethoven\" incorporates elements of the final movement of Ludwig van Beethoven's ninth symphony, which is featured prominently throughout the film.</p><br/><h3>Adaptations</h3><p>The film had an Indian adaptation titled Brothers (2015) starring Akshay Kumar and Sidharth Malhotra in lead roles.</p><p>A film with the same title and similar plot was made in 2015 in Russia.</p><br/>"
  },
  "errorMessage": ""
}