{
  "imDbId": "tt3011894",
  "title": "Wild Tales",
  "fullTitle": "Wild Tales (2014)",
  "type": "Movie",
  "year": "2014",
  "items": [
    {
      "username": "Her-Excellency",
      "userUrl": "https://www.imdb.com/user/ur67432377",
      "reviewLink": "https://www.imdb.com/review/rw5738280",
      "warningSpoilers": false,
      "date": "15 May 2020",
      "rate": "9",
      "helpful": "122 out of 124 found this helpful.",
      "title": "I love, Love, LOVE this film.",
      "content": "Not only is the acting fantastic, but every single one of the stories paints a picture of each of us at our most gloriously, base, human-like moments.If aliens exist, THIS is the film they should watch to learn more about us than any amount of probing might ever give away. :)Great first watch. Excellent re-watch. Highly recommend."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4059368",
      "warningSpoilers": false,
      "date": "11 February 2018",
      "rate": "8",
      "helpful": "89 out of 100 found this helpful.",
      "title": "The Edge Of Reason",
      "content": "Hilarious and very, very black comedy consisting of six episodes about people who get driven to the edge of reason (and a little beyond). The acting and writing in this gem from Argentina are superb, and the beautifully photographed segments keep you thrilled and unable to guess just what crazy turn they will take next. A wonderful joy of a film for film lovers with a rather twisted sense of humor. 8 stars out of 10.In case you're interested in more underrated film gems, here's some of my favorites:imdb.com/list/ls070242495"
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw4245905",
      "warningSpoilers": false,
      "date": "20 July 2018",
      "rate": "10",
      "helpful": "48 out of 52 found this helpful.",
      "title": "Brilliant",
      "content": "Perhaps the best omnibus dark comedy ever made. This movie is funny, it explores some of the darker parts of humanity but it does so with so much wit and intelligence. It was a great hit in South America, and understandably so. Despite dark and cynical take on the human condition, the movie is lighthearted and highly watchable, and uncompromisingly original."
    },
    {
      "username": "ahegde3149",
      "userUrl": "https://www.imdb.com/user/ur49780230",
      "reviewLink": "https://www.imdb.com/review/rw3242569",
      "warningSpoilers": false,
      "date": "21 May 2015",
      "rate": "8",
      "helpful": "68 out of 75 found this helpful.",
      "title": "Big things have small beginnings",
      "content": "Never watched any Argentine/Spanish film before. Actually, the number of foreign language (ie. other than English and Hindi) films I have watched till date is not even two digit. Still, this movie was mind-blowing!! Wild Tales, is a package of 6 short films which are dark and explosive comedies. All of them has the theme of revenge strikingly common and each one of them is unique and funny in its own way. Each one of them puts forth wild yet realistic situations. The first short story is the shortest of them and is shown pre-credits.Its story of a psych who is not even seen on the screen who makes revenge plan which ends on a bang giving us an overly wild ending. The second film slightly more dark and longer, will make you think before deciding what is right and what is wrong. Third one even longer, is my favorite alongside the fourth. Its violent and brutally hilarious with explosive ending(literally). The fourth one sheds light on realistic situation of a common man troubled by the abusive government system. Another explosion in the climax(again literally)! The fifth slightly less on humor quotient but portrays the human characteristic of greed perfectly. Its darker and has a shocking finale! Th last one, longest and wildest of them all will take you to one of the craziest weddings you have ever seen. Beneath its madness it subtly touches upon the issues of trust and betrayals in human relations.Besides the common notion of revenge and letting oneself lose control in rage, all these tales also focus on how tiniest of our actions can lead to monstrous consequences. The comedy is satirical and dark still its outright hilarious in many scenes. There are many actors (each story has different cast), can't highlight anyone as most of them have done a good job. Director Damian Szifron executes all the ridiculous madness and explosive twists with sheer brilliance leaving dazed at the end of each story. The soundtrack is also quirky and beautiful.The two hours fly away like a breeze. Even if you don't understand the language you will be so invested that after sometime you won't even realize that you are watching a Non- English film. Highly enjoyable!RATING: [4/5]"
    },
    {
      "username": "ferguson-6",
      "userUrl": "https://www.imdb.com/user/ur0806494",
      "reviewLink": "https://www.imdb.com/review/rw3200561",
      "warningSpoilers": false,
      "date": "12 March 2015",
      "rate": "8",
      "helpful": "34 out of 41 found this helpful.",
      "title": "Rage and Revenge, Guilty Laughter",
      "content": "Greetings again from the darkness. Do you often get accused of having a slightly demented sense of humor? Do you have secret crazy thoughts of seeking revenge on those who have wronged you? If so, writer/director Damian Szifron has a collection of short stories just for you!Nominated for Best Foreign Language Oscar, Argentina's entry is just now opening in the Dallas market where I live. To say Wild Tales is a wild ride would be quite an understatement. There are six short stories blended together, and while you may not recognize the theme immediately, it doesn't take long before rage and retribution jump to the forefront in these seemingly typical slices of everyday life.The best short stories make a quick grab for attention, and manage to convey character and setting from the beginning. The writing is crucial and can easily collapse in the hands of a less-proficient short story writer. But when it works, it's fascinating to watch, and Mr. Szifron has a real talent for making us laugh in the midst of truly awful situations.Not to give away any details, but the six stories involve: a remarkable \"coincidence\" on a flight, an unwelcome customer at a local diner, a close-quarters brawl at a bridge, the frustration of dealing with \"the system\", misguided parental instincts in protecting their kid, and the most wheels-off wedding reception ever filmed.If you are ever searching for an example of a dark comedy, this one will provide clarity. The seemingly unrelated stories are woven together through payback, though the price is often pretty high. Mr. Szifron's stories remind us that life is not fair, but when it's happening to someone else, we can still laugh about it."
    },
    {
      "username": "patrickfile",
      "userUrl": "https://www.imdb.com/user/ur30283290",
      "reviewLink": "https://www.imdb.com/review/rw3076504",
      "warningSpoilers": false,
      "date": "25 August 2014",
      "rate": "10",
      "helpful": "501 out of 556 found this helpful.",
      "title": "Too much fun and human darkness for one day.",
      "content": "Watched last night at the theater with my girlfriend.It's a compilations of 6 tales, but they don't have the same type of lenght, humor or darkness. Each one is unique.1) Airplane tale: fantastic, hilarating and surrealistic story to open the series.2) Coffee shop tale: shorter, but dark and makes you wonder what's \"freedom\" for some people.3) Road tale: excellent. A really LOT of violence and a little bit of humor makes this one of the best tales in the movie.4) Human limit tale: a man that's having a couple of really bad days explode when he runs out of patiente. Great acting.5) Accident tale: 90% darkness. And the fact that could be a very possible story makes it even darker. Shocking finale.6) Wedding tale: almost impossible to qualify. Hilarious for the most part, but at the end, it will make you wonder to whom you are spending your whole life with.Seeing this compilation in a theater for the price of one, its a damn good deal if you ask me.Go watch it."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3388254",
      "warningSpoilers": false,
      "date": "5 January 2016",
      "rate": "8",
      "helpful": "22 out of 27 found this helpful.",
      "title": "six good stories",
      "content": "These are six wild tales. (1) Various strangers board a plane and find they all know Gabriel Pasternak. (2) An arrogant man walks into a desolate diner. The waitress recognizes him as the loan shark who drove her father to commit suicide. The cook pushes her to put rat poison in the food. (3) A city guy in a nice car gets into an escalating fight with a brute in an old rundown car on a desert highway. (4) A demolition expert gets his car towed. He tries to fight the system which spiral out of control. (5) A young man is in a hit-and-run which kills a pregnant woman. His family hires the gardener to take the criminal charge in exchange for a large payout. (6) At her wedding party, Romina uncovers her groom Ariel had cheated on her. This sends her on a downward spiral.I rarely like all the vignettes in an anthology. Number 3 is my favorite. It goes down a rabbit hole and keeps going and going. It's relentless and fun. Number 5 is probably my least favorite. I would recommend Fargo season 2 TV show for a hit-and-run story. Number 1 is like a Twilight Zone episode. I'm not sure about Number 6 until the final scene. I love the way it ends and closes the movie in grand fashion."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw3279823",
      "warningSpoilers": false,
      "date": "19 July 2015",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "animals of the human world",
      "content": "Damián Szifron's \"Relatos salvajes\" (\"Wild Tales\" in English) features a couple of stories focusing on people who want revenge and use violence to achieve their ends. The best vignette is the one starring Ricardo Darín as a man intent on not paying his parking tickets.I previously saw Darín in the Oscar-winning \"Secrets in Their Eyes\", set on the verge of Argentina's Dirty War. That one and this one suggest to me that Argentina has a vibrant film industry, and I would like very much to see more movies from there, a pronounced advancement from the Dirty War (the Kirchner and Fernandez presidencies probably helped). The hilarious satire that is \"Wild Tales\" deserves every award that it's won. I highly recommend it."
    },
    {
      "username": "twilliams76",
      "userUrl": "https://www.imdb.com/user/ur0618701",
      "reviewLink": "https://www.imdb.com/review/rw3203208",
      "warningSpoilers": false,
      "date": "17 March 2015",
      "rate": "8",
      "helpful": "47 out of 53 found this helpful.",
      "title": "Wildly thrilling. Wildly fun. Wildly original.",
      "content": "This Argentine film that found itself nominated for the 2014 Best Foreign Language Film Academy Award comes to us from director Damián Szifrón who has crafted a feature film comprised of a series of 6 vignettes/small stories about human beings from all walks of (Argentine) life who are all tested and taken to their limits ... until they finally lose control. While mostly disastrous the film is also WILDly thrilling and wholly original in its daring cheekiness ... as the film is a bitter dark comedy (with tinges of brutal drama).It is a film about a myriad group of people on a plane; a young waitress who still finds herself grieving over a family tragedy of the past; an encounter between two men from different social classes on a desolate highway; a man growing tired of the rat race of life in which we are all destined to lose; the aftermath of a horrible automobile accident; and a wedding reception like none you've ever seen before. All feature one or two characters taken to the edge ...It is how each of them handles their various situations that give us our WILD stories. Fascinatingly grim at times, the film almost always miraculously produces laughter and grins. Much of the laughter might be heavily muffled as one chuckles under his/her breath as others around them fail to see the director's (WILDly) wicked sense of humor come into play in some of the film's intense situations; but the dark tone pervades the entire film.While the film is most definitely tragic in many instances, Wild Tales is a comedy of errors about human nature and who we are. Some can watch this and most-likely not pick up even a hint of humor; but it is there ... and it is fantastically facetious.Wildly thrilling. Wildly fun. Wildly original. It is courageously wild."
    },
    {
      "username": "Blue-Grotto",
      "userUrl": "https://www.imdb.com/user/ur54207336",
      "reviewLink": "https://www.imdb.com/review/rw3103427",
      "warningSpoilers": false,
      "date": "12 October 2014",
      "rate": "10",
      "helpful": "104 out of 133 found this helpful.",
      "title": "Time does not heal all wounds.",
      "content": "Time does not heal all wounds. One thing leads to another in six outrageous, hilarious and extreme stories of revenge. A jilted and emotionally volatile bride wreaks havoc at her wedding with an equally unstable new husband, a towing company hauls away one too many times the vehicle belonging an explosive expert, and two macho drivers – one in an Audi and the other in a pile of junk – go head to head with explosive road rage, among other delicious and fiery adventures. The utmost fantasies fulfilled, the extremes of emotions, and the riot of laughter that engulfed me from all sides, I cannot remember having such a good time watching a film. The director, who answered questions at the 2014 Toronto International Film Festival, said the film is about the pleasure of losing control and giving in to unrestrained passions. Is it ever!"
    },
    {
      "username": "abisio",
      "userUrl": "https://www.imdb.com/user/ur0879559",
      "reviewLink": "https://www.imdb.com/review/rw3095726",
      "warningSpoilers": false,
      "date": "29 September 2014",
      "rate": "10",
      "helpful": "124 out of 161 found this helpful.",
      "title": "Very dark, very funny, extremely realistic",
      "content": "Wild Tales (Relatos Salvajes) is perhaps the darkest and funniest movie I saw in years; but is it really a comedy ?. No it is not. Six tales about human that are obviously related to the Argentinian reality (abusive government, corruption, people indifference) but certainly can be applied to many other countries in the world; USA included.Telling about each tale will cut the impact and somewhat surprise of each one. Let's just say that the outcome of each tale is sometimes predictable; but driven by logic not clichés.As always happens; some histories are better than others; but even that will be different for different viewers.In brief; an excellent movie that deserves to be seen by people with a brain and a will to think."
    },
    {
      "username": "maurice_yacowar",
      "userUrl": "https://www.imdb.com/user/ur40243436",
      "reviewLink": "https://www.imdb.com/review/rw3156322",
      "warningSpoilers": true,
      "date": "3 January 2015",
      "rate": "10",
      "helpful": "44 out of 54 found this helpful.",
      "title": "Six stories of frustration leading to joyous revenge",
      "content": "The Spanish title is more apt: Savage Tales. Six short stories show various ways in which savagery persists in the highest levels of civilization. The titles appear against a montage of wild animals. The twist is that here the savagery is celebrated not rued. Where civilization was supposed to free us from savagery, as in the American Western, here the savagery liberates the characters from their civilization. As director Damian Szifron told the Palm Springs festival audience, \"The theme is the pleasure of losing control. Releasing the beast.\"In each story a modern frustration wells up until the character erupts. All the stories involve a furious revenge, with a broadening range of characters. To convey the tensions in modern life, ordinary sounds are amplified, like the luggage wheels in the opening shot. In the pre-credit tale, the pilot turns out to be a lifelong failure who has collected the various teachers, friends, psychiatrist, who have thwarted him, on a flight he will crash into his parents. In a diner the waitress recognizes a customer as the smalltown gangster who drove her father into bankruptcy and suicide. Now running for mayor, he is rude and abusive. As her anger and conscience struggle the cook takes over and kills him. She's content to return to the security and comfort of jail.An Audi driver rages at a redneck who blocks his way. When the rich guy stops to fix a flat tire his nemesis stops and assaults him. The road rage turns into class warfare. Ironically, when they're found burned alive their clutch suggests it was a crime passionel.When an explosives expert gets his car towed for an unjustified parking ticket his angry campaign for justice blows up his marriage, job, career and even shared custody of his daughter. When he blows up the tower's yard he becomes a local hero, Mr Dynamite. In jail his wife and daughter bring him a birthday cake and all the inmates and guards celebrate his day. His last act is blowing out the candles. Terrorism works.A spoiled teenager's fatal hit and run accident leads to a steadily expanding chain of corruption as his wealthy father tries to get the family groundskeeper to take the rap for him. As the bribery balloons no-one is innocent. Even the humble groundskeeper raises his demands. When the father decides not to pay to save his spoiled son, his lawyer says it would be dishonourable for him to renege on his bribery of the the public prosecutor. When the boy decides to confess the greedy renegotiate their scheme. As the fall guy is led away an angry citizen kills him. Amid all the bribes and false honour the poor worker pays the price.In the climax, a rich Jewish family's wedding, the bride explodes after the groom admits he had sex with a colleague who's a guest. The demure bride turns into a vengeful virago wreaking massive destruction, reducing the groom to tears, the ceremony to chaos, and her rival to a bloodied mess. When the newlyweds reconnect — making passionate love amid the ruins of the cake — their union feels more honest than the initial smiles and formality. Now their union expresses more passion than manners. The chaotic wedding is more honest than the ceremonial ritual was. The anthology structure hearkens back to Italian neorealism, where separate short stories provided a wide-ranging survey of social issues. Apt for a celebration of the unruly, the film is exuberantly comic but with a black undercurrent. As its initial frustrations are so common, the film provides its audience with a greater catharsis than most comedies or tragedies. We're left calm of mind, frustrations spent."
    },
    {
      "username": "nairtejas",
      "userUrl": "https://www.imdb.com/user/ur34967775",
      "reviewLink": "https://www.imdb.com/review/rw3222654",
      "warningSpoilers": false,
      "date": "18 April 2015",
      "rate": "9",
      "helpful": "19 out of 23 found this helpful.",
      "title": "So Brilliant Even The Opening Credits Is A Masterpiece. ♦ 85%",
      "content": "This is my first Argentine movie and I am blown away.With an amazing opening sequence, Wild Tales is a collection of six short, unrelated live action tales that depict human nature in its purest form. The stories speak volumes about the types of lives we all live. A conversation at the beginning turns into a startling revelation at the end of the first short, which is as great as the remaining five. However, the final short is slightly dull compared to what the first five have to offer.Black comedy is the perfect genre this would fall in because the short tales are about ordinary people finding themselves in ordinary situations. The only factor that distinguishes it from the rest is that it goes ahead turning the ordinary into something wicked and super. It is a mix of drama and quirkiness that we all are accustomed to. And the best part is that the stories are to the point.Definitely the film is for people who have an eye for humor and cinematic art. You will love and cherish this and yearn to re-watch it. Excellent photography, backed by good writing and appropriate music. The score is so supportive, one awaits it in the screenplay. With some great performances and direction, Wild Tales is an appealing drama which will appeal even if you do not understand Spanish. BOTTOM LINE: Wild Tales is a masterpiece and once you watch it, you will be asking your friends to watch it just so you can discuss it with them. 9/10 - brilliant!Can be watched with a typical Indian family? YES"
    },
    {
      "username": "sanarg",
      "userUrl": "https://www.imdb.com/user/ur6966746",
      "reviewLink": "https://www.imdb.com/review/rw3075478",
      "warningSpoilers": false,
      "date": "25 August 2014",
      "rate": "8",
      "helpful": "217 out of 252 found this helpful.",
      "title": "Clever, dark and funny",
      "content": "The movie is actually 6 short films, all related by brutal violence motivated by different situations. Family. Society. Government. It works very well like that, lasting over 120 minutes that go by quickly. It feels very fluid. Szifrón's eye is very precise. You can tell everything was very well thought. I wouldn't say this is a philosophical film, but it is clever entertainment, that makes you think if this wild tales are actually that wild... Even though this stories are taken to the extreme, everything feels somehow possible when you look back. Darkly humorous. Watch it."
    },
    {
      "username": "WilliamCKH",
      "userUrl": "https://www.imdb.com/user/ur1981684",
      "reviewLink": "https://www.imdb.com/review/rw3192164",
      "warningSpoilers": false,
      "date": "26 February 2015",
      "rate": "10",
      "helpful": "38 out of 44 found this helpful.",
      "title": "What a Ride",
      "content": "I had an idea from the opening credits that Damian Szifron's WILD TALES, was going to be fun. Images of animals with the actors' names as counterpart, preparing the audience for the animalistic behavior about to come.The film is comprised of six separate vignettes, short stories, if you will. These vignettes all begin innocently enough, passengers boarding a plane, a man driving through the desert, a restaurant on a stormy night, a wedding, everyday slices of modern day life. Something occurs to break the routine, the main character responds, then the scene escalates, and escalates, and when you think you've reached the peak, it escalates even more, and finally in the end reaches a perfect balance of comedy and tragedy. The tales are all perfectly relatable and escalate logically and realistically, nothing comes out from left field. All the characters, each flawed in so many ways, remind us so much of ourselves, both at our best and at our worst... and make us laugh and feel in recognition.Great Movie."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3353524",
      "warningSpoilers": false,
      "date": "12 November 2015",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Excellent assortment of edgy, original and enthralling short stories",
      "content": "Excellent assortment of edgy, original and enthralling short stories.Six short stories, all written and directed by Damián Szifrón. The stories are not connected at all and cover various subjects and characters. However, they are all incredibly interesting and engaging. Some have a great moral to them, some have great twists and some are just about a good, succinct story.It is actually quite amazing how much character depth and plot development Szifrón crams into each 15-20 minute story. The sharp, edgy plots and solid direction are aided by a cast that doesn't put a foot wrong.Goes to show you don't need 90+ minutes to tell a good tale. For the same time you can get six!"
    },
    {
      "username": "paul-allaer",
      "userUrl": "https://www.imdb.com/user/ur48675674",
      "reviewLink": "https://www.imdb.com/review/rw3207103",
      "warningSpoilers": false,
      "date": "23 March 2015",
      "rate": "9",
      "helpful": "19 out of 24 found this helpful.",
      "title": "4.5 stars... Revenge, Argentine style.",
      "content": "\"Wild Tales\" (2014 release from Argentina; 122 min.) is a collection of 6 seemingly unrelated tales which all bear the same theme: revenge. The opening (pre-movie credits) tale is a classic: a woman strikes up a conversation with another airplane passenger and they find out that by complete coincidence (or not?) they are both acquainted with the same person. Then it emerges that several other passengers also know that person... No worries, I'm not going to spoil anything. This first (and short) story sets the mood for the movie perfectly, as we get five more vignettes that are all one better than the other. I can't decide which is my favorite, to be honest.Couple of comments: this is the latest movie from Argentine writer-director Damian Szifron, and what a beauty he delivers with this movie. When I say \"beauty\", I certainly don't mean it in a sugary way, as in fact Szifron's film can be seen as a brutal assessment of the human condition. Check out the tale of the driver who gets tangled up with a 'left lane bandit' only then to suffer a flat tire and suffer the consequences... Or, even worse (should I say better?), check out the tale of the frustrated guy whose car gets towed without reason (according to the guy, of course), and wants to file a complaint... (this story reminded me of that Michael Douglas film \"Falling Down\"). The movie is also a blistering indictment of Argentina's judicial system (check out the story where a well-off family's son kills a pregnant woman in a hit-and-run). The very last story (about a wedding reception that goes horribly wrong) is also the longest (close to 30 min.), and capsules the movie's spirit perfectly. It is no wonder that \"Wild Tales\" was a nominee for Best Foreign Language Movies at this year's Oscars. I've now seen 4 of the 5 nominated films and honestly they are all worthy in their own right, and then some.\"Wild Tales\" opened this weekend at my local art-house theater here in Cincinnati and I couldn't wait to see it. The early evening screening where I saw this at was attended okay but not super, which is a shame. I had high expectations for \"Wild Tales\" and they were met, and then some. If you are in the mood for a top-notch foreign movie that is MILES away from your standard Hollywood fare, you cannot go wrong with this. \"Wild Tales\" is HIGHLY RECOMMENDED!"
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw3240388",
      "warningSpoilers": false,
      "date": "17 May 2015",
      "rate": "7",
      "helpful": "16 out of 21 found this helpful.",
      "title": "Six Black Comedies",
      "content": "\"Relatos Salvajes\" is a black comedy film divided in six segments. (1) \"Pasternak\": one model and a music critic in a plane find that they have a common acquaintance called Pasternak. Soon they discover that every passenger and crew on board know Pasternak. Cosmic coincidence? (2) \"The Rats\": a waitress of a diner recognizes her client as the loan shark that caused a tragedy in her family. The cook suggests mixing rat poison in his food, but she refuses. But the cook decides to proceed in her plan. When his son arrives, the waitress tries to fix the situation.(3) \"The Strongest\": Two drivers on a lone highway have an argument with tragic consequences. (4) \"Little Bomb\": The demolition engineer has his car towed by a truck for parking in a wrong place and he has an argument with the employee of the towing company. This event destroys his private and professional life, and he plots revenge against the corrupt towing company and the City Hall.(5) \"The Proposal\": The reckless hit-and-run son of a wealthy family hits and kills a pregnant woman. He wakes up his parents and his father calls the lawyer. They propose to pay the groundkeeper to take the blame. Soon the father discovers that he is victim of extortion of his lawyer and the detective in charge of the investigation. What will be his decision?(6) \"Until Death Do Us Apart\": During the wedding party, the wife discovers that her husband has cheated her with one of the guests and decides to payback. \"Relatos Salvajes\" is an insane and funny comedy, with great critic to the corruption of the public services in Argentina (but could be in most of the South American countries); to the corrupt elite and police; to the lack of justice. It is hard to choose the best segment. My vote is seven.Title (Brazil): \"Relatos Selvagens\" (\"Wild Reports\")"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3257747",
      "warningSpoilers": false,
      "date": "14 June 2015",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Wild Tales indeed",
      "content": "I went in this completely unprepared (as I like to do in general) having not read a single thing. I recognized one of the actors on the poster and have generally watched a couple of Spanish language movies that knew how to hit the spot (if that makes sense to you). What I mean is: They know how to make a good movie. And while some might argue that in this case \"movie\" would be an understatement, the whole thing is crazy and every bit of it is great to watch.The beginning alone will or might catch you off-guard. It starts off slow, but once you get the drift of it (no pun intended) you know what this will be about. And it still is able to surprise you. What is not to love here? Well if you are not in the mood or generally don't like that darker touch of humor, you obviously won't be amused or entertained for that matter. For everyone else: Cherish and dig in! Already one of my favorites of this year"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3861295",
      "warningSpoilers": true,
      "date": "18 November 2017",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "\"Can't you see that I love you?\"",
      "content": "If you consider the word 'salvajes' in the Spanish language version of this title, \"Relatos Salvajes\", it closely resembles the word 'savage' in English, doesn't it? That's what came to my mind, as the six unconnected stories in this movie could just as well have been titled \"Savage Tales\". They are all positioned at some level for a savage outcome, and some of them are ironically hilarious in the execution, especially the wedding story between Romina and Ariel that closes things out.Another common element to be found in the offing is that familiar bugaboo about unintended consequences. The two tales of catastrophic road rage bear that theme out in cataclysmic fashion. The third story about the two drivers escalating into a violent confrontation ending in a fiery finale is so over the top that you wouldn't even consider the investigating sheriff's comment about a crime of passion. But it's there and lends a twisted component to the gruesome tale, one that will double you over with it's demented logic.The hit and run segment was another one of those unintended consequence stories that was visited in the end upon the hapless gardener who thought he was going to come out of it set for life. It's interesting to consider what might have happened to all the other parties involved after this story went black. All those scheming money grubbers were going to wind up with nothing in my interpretation, with their golden goose cooked. But I'm sure they would still try to squeeze Mauricio with his fat bank account. The unbridled greed in the story is enough to make you wince.And what can you say about the wedding story? The way it played out and the way it ended were so diametrically opposed to each other that you can only wind up shaking your head. But I guess that's what made it so viscerally entertaining. My summary quote is a line from the song that played out over the closing of that story, another fitting but ironic tribute to a masterful tale of love gone wrong and traveling full circle.This is the only film I've ever seen from the young Argentinian director Damian Szifron, but if his other output is even half as creative, he's got a huge future ahead. His credits page on IMDb points to primarily TV work, but if \"Wild Tales\" is any indication, we'll be seeing and hearing a lot more about him in the years to come."
    },
    {
      "username": "BeneCumb",
      "userUrl": "https://www.imdb.com/user/ur32764997",
      "reviewLink": "https://www.imdb.com/review/rw3699989",
      "warningSpoilers": false,
      "date": "4 May 2017",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Wildly crazy, witty, entertaining...",
      "content": "I was recommended to watch Relatos salvajes some time ago, but was busy with some series and postponed it, plus I had no clear idea what it was about and how was it structured. But when the 1st tale was approaching its climax, it became evident that many catchy moments would be waiting me... Some parts are less realistic than others, but definitely not airy-fairy, and smart dialogues with distinct performances paved the way for lots of giggling, moments with black humour, and some grisly recognition how easily a rampage can occur... \"El más fuerte\" and \"Bombita\" are the tales I enjoyed most, they seem most sustained and elaborate, the final one - \"Hasta que la muerte nos separe\" - gave me mixed feelings and I found that its pace was somewhat uneven, rounding up the all bunch in less interesting manner, but still, after some delay time and considering the film comes from Argentina, I have decided to give 9 points - the film in question is highly recommended to all fond of dissimilar productions and approaches."
    },
    {
      "username": "bombersflyup",
      "userUrl": "https://www.imdb.com/user/ur25775215",
      "reviewLink": "https://www.imdb.com/review/rw4824607",
      "warningSpoilers": true,
      "date": "3 May 2019",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Simon: What Violence?",
      "content": "Wild Tales is an exceptionally written foreign film, realistic and funny. It's realistic, in the sense that it's human nature taken to the extreme, pushed to the point of just losing it!The question remains though, is it a film? When you have six unrelated stories without any plot or character continuity. I asked myself, would I watch this if it were a television series if it maintained this level of quality and the answer is assuredly yes, but it's highly unlikely that it could maintain it, as much as I'm surprised I liked each segment here. The third segment with the two blokes fighting and the final wedding segment my favourites, the ending adds the heart. Erica Rivas and Ricardo Darin give the most memorable performances."
    },
    {
      "username": "romanvartanov2014",
      "userUrl": "https://www.imdb.com/user/ur57862703",
      "reviewLink": "https://www.imdb.com/review/rw3173208",
      "warningSpoilers": false,
      "date": "30 January 2015",
      "rate": "10",
      "helpful": "187 out of 223 found this helpful.",
      "title": "What a wonderful idea!",
      "content": "I went to see this movie hoping to get a brake from Hollywood production. And I did. It was amazing, one of the best movies I've seen on big screen in 2 or 3 years.Plot consists of different stories which all have one thing in common: they are about revenge. Every single story starts rather boring. At the very beginning I was thinking \"What's so wild about it? It is just lame\" and by the end of the intro I was like \"Holy God! No, they did not just twist it like that! OMG!\"And it gets better. A true masterpiece. I am from Russia so for me it was rather interesting and surprising that Latin America is so similar to Russia. The views, the behaviour of the people, the insanity - all like at home.You won't regret seeing this movie. Don't take your kid or your grandmother though."
    },
    {
      "username": "Mmpelit",
      "userUrl": "https://www.imdb.com/user/ur27911737",
      "reviewLink": "https://www.imdb.com/review/rw3628159",
      "warningSpoilers": true,
      "date": "27 January 2017",
      "rate": "9",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Wow, Anger is really a powerful emotion!",
      "content": "Great movie telling stories I would label centering around anger. I realized how powerful anger emotion is and how quickly it can ruin your life for good.1) Airplane: It was developed beautifully and gratz to the pilot for determination.2) Restaurant: The douche bag of a guy basically kills the girls father, girl thinks about confronting him and the chef lady thinks confronting him is not enough at all. 3) Car: Need to be careful about road rage, you don't know who is the guy in the other car. I think this goes for any rage. I think I can conclude that we shouldn't rage.4) Tow away: Really good criticism of government and it's fines. There should be a better method to determine which fine is just. Also I agree that most government workers are really annoying, they don't enjoy their job at all and the mind set \"I am just trying to do my job\" is absolutely true.5) Hit and run: Really good visualization of what money can make people do. Basically if you have enough money, you carry a get out jail card with you. The twist in the end was really awesome, poor gardener.6) Wedding: This was my favorite story by far. It shows that how things can escalate quickly out of hand. Also it is easy to make bad decisions while under so much pressure like a wedding ceremony. I must say bride was really good and very nice acting. But I doubt that make up sex will solve their problem...Awesome movie, really effected me while being entertaining."
    },
    {
      "username": "z-moses-z",
      "userUrl": "https://www.imdb.com/user/ur30690224",
      "reviewLink": "https://www.imdb.com/review/rw3357421",
      "warningSpoilers": false,
      "date": "19 November 2015",
      "rate": "10",
      "helpful": "29 out of 33 found this helpful.",
      "title": "This is Cinema !",
      "content": "i always thought that the real art is missing these days, the cinema is going on the wrong side, this movie was the hope, that there is still genius artist who can makes such a beautiful story, with excellence in direction and perfection in casting, this is the best movie i ever watched so far, it is black comedy and it is REAL, it is like what you think you DO, what you imagine COMES REAL, it is HUMAN, for those who really loves the art of cinema, MUST MUST MUST watch this movie, you will enjoy it from the beginning to the cast list, it is a THEATER in a cinema movie, 10/10 and we will wait a lot to see such a quality movie like this one."
    }
  ],
  "errorMessage": ""
}