{
  "imDbId": "tt0102926",
  "title": "The Silence of the Lambs",
  "fullTitle": "The Silence of the Lambs (1991)",
  "type": "Movie",
  "year": "1991",
  "items": [
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "A mesmerizing thriller that will grip audiences from first scene to last."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The interplay between Starling and Lector as they share an indefinable, dark understanding gives the film its unforgettable and unsettling power. [14 February 1991, Daily Notebook, p.E1]"
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "100",
      "content": "The superbly crafted suspense thriller\u0085slams you like a sudden blast of bone-chilling, pulse-pounding terror."
    },
    {
      "publisher": "USA Today",
      "author": "Susan Wloszczyna",
      "link": "",
      "rate": "100",
      "content": "A movie with this kind of haunting power comes along only once every decade or so. [20 February 1991, Life, p.11D]"
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/?MI=34802",
      "rate": "90",
      "content": "Hopkins plays the cannibalistic doctor with a quiet, controlled erudition, lacing his performance with moments of black humor. His Lecter is a sort of satanic Sherlock Holmes whose spasms of violence are all the more terrifying because they erupt from beneath such an intelligent and refined mask."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "90",
      "content": "A smart, restrained entertainment, it doesn't splash around in blood and hysteria. It doesn't have to."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "88",
      "content": "It has been a good long while since I have felt the presence of Evil so manifestly demonstrated as in the first appearance of Anthony Hopkins in The Silence of the Lambs."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "70",
      "content": "An accomplished, effective, grisly, and exceptionally sick slasher film that I can't with any conscience recommend, because the purposes to which it places its considerable ingenuity are ultimately rather foul."
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "70",
      "content": "Demme's pacing is tight throughout, marred only by some low-angle close-ups of the cannibal that are right out of old Vincent Price thrillers. [Feb 18, 1991]"
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "50",
      "content": "Billed as one of the most frightening, depraved films ever made. Would that it were so. Instead, this is a case of much ado about nothing. [15 February 1991, Friday, p.C]"
    }
  ],
  "errorMessage": ""
}