{
  "imDbId": "tt0102926",
  "title": "The Silence of the Lambs",
  "fullTitle": "The Silence of the Lambs (1991)",
  "type": "Movie",
  "year": "1991",
  "items": [
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1198894",
      "warningSpoilers": false,
      "date": "22 October 2005",
      "rate": "10",
      "helpful": "433 out of 510 found this helpful.",
      "title": "Dr.Lecter, I'd like to see you again...",
      "content": "The Silence of the Lambs runs two hours.Anthony Hopkins appears for little more than sixteen minutes, yet during those minutes he hasn't bored you for a second, not even after the tenth or eleventh viewing. Such is the power of his performance, it's absolutely impossible to forget him.His character, Dr.Hannibal\"The Cannibal\" Lecter, is a brutal killer with revolting methods and habits, but he's also very intelligent, charismatic and with good taste(you can interpret that as you like).A clichè by now, but who cares? He still is one of the key elements in this wonderful thriller, which sees Jodie Foster's Clarice Starling asking for Lecter's help to catch another killer.The result is a dangerous yet fascinating relationship between the young, unexperienced FBI-agent and the convicted,but basically omnipotent, psychiatrist.He's a step ahead of everyone all the time, and makes sure everyone notices, with his witty, unforgettable one-liners.If there had to be only one reason to worship this movie, then it would have to be the chemistry between the two leading actors.Never before has a non-sexual man/woman connection been more thrilling.Never before has a film's ending been more unsettling and brilliant and left us asking for more.Best watched with a nice Chianti...P.S. dear film-buffs, have the lambs stopped screaming?"
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw7217963",
      "warningSpoilers": false,
      "date": "11 August 2021",
      "rate": "10",
      "helpful": "49 out of 59 found this helpful.",
      "title": "Rare to experience a dark n twisted thriller aided by top notch performances, tight script n direction.",
      "content": "I first saw this in the early 90s on a vhs and i still remember how two very old ladies were petrified n blabbering about the movie to my dad and one thing which stayed with me after that conversation was the praising of Hopkins acting by the two grumbling old geezers.I revisited it in the early 2k on a dvd which I own and was in awe by Hopkins mesmerizing performance.Revisited it the third time today but this time with my kids as they are 18 now but my wife is still not agreeable.Everything has been said about this first class thriller n there seems to be nothing left but i jus wanna contribute a lil by praising the performance of Hopkins.In the entire movie, it is Hopkins' screen presence n footage which keeps u glued.His character is charismatic but very dangerous that u don't wanna be rude with him.Some scenes are far fetched but like i said it is the mesmerizing performance by Anthony Hopkins which is the highlight."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0299323",
      "warningSpoilers": false,
      "date": "21 July 2000",
      "rate": "",
      "helpful": "282 out of 373 found this helpful.",
      "title": "In a Class by Itself",
      "content": "Brilliant Best Picture of 1991 that never gets old. \"The Silence of the Lambs\" deals with a young FBI cadet (Oscar-winner Jodie Foster) who is sent to interview a captured madman (Oscar-winner Anthony Hopkins in one of the greatest performances ever on the screen) to find out about a serial killer (Ted Levine) who is stripping the skin from his female victims after they die. The FBI has had no luck with the case and agent Scott Glenn tries to throw a curve-ball to Hopkins by sending Foster. Hopkins is a former doctor of Levine and holds the clues to capturing the unknown criminal. Needless to say the film takes many twists and turns, creating a suspenseful thriller that has no equal. At the heart of \"The Silence of the Lambs\" are the confrontations between Hopkins and Foster. They play a complicated chess match of words which results in some of the greatest footage ever captured for the cinema. Hopkins dominates in spite of the fact he has approximately 17 minutes of time in the film. This is a film that will wrap itself around you and you will likely never be able to shake some of the key elements you have seen in this amazing masterpiece. 5 stars out of 5."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1575333",
      "warningSpoilers": false,
      "date": "17 January 2007",
      "rate": "10",
      "helpful": "229 out of 310 found this helpful.",
      "title": "A Story And A Character That You Can't Forget",
      "content": "I'll never forget my first viewing of this movie at the theater and will always look back fondly on it for one reason: helping me quit smoking cigarettes.I read the book first, was fascinated by it, and couldn't wait for the film to come out. That was the day I picked to quit smoking and I knew this movie would take my mind off that matter. I was expecting an intense movie and I got it. Little did I realize how well-received this film would be and how it propelled Anthony Hopkins to super-stardom.Although entertaining, this is not always a fun movie to watch, especially with the scenes with Ted Levine who plays the killer, \"Buffalo Bill.\" \"Bill\" and his kidnapped young woman are sick and profane people, respectively, and their scenes are very unpleasant. This movie is not for the squeamish with those and other scenes involving the infamous Dr. Hannibal Lecter (Hopkins). There also is some extreme crudeness in the jail/dungeon where Lecter and other inmates are held.Jodie Foster is excellent as the FBI agent \"Clarice Starling\" and Scott Glenn is low-key and effective as \"Jack Crawford.\" A major part of the film is psychological more than violent as Lecter constantly taunts \"Clarice,\" while she tries her best to manipulate him to help with a case. The by-play between the two is a game in itself.Hopkins, however, is the actor people remember best from this movie. His portrayal of the refined-yet-cannibalistic serial killer-doctor is one viewers will never forget. I've enjoyed watching him in the sequels, too. The looks on his face, his fascinating vocabulary with intelligent sarcasm and frankness, never ceases to entertain.\"Silence Of The Lambs\" has turned into a modern-day \"classic.\" If by some odd chance you have never seen this movie, be warned it is a dark, difficult story to watch at times....but it will get your mind off other things."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0299732",
      "warningSpoilers": false,
      "date": "28 August 2004",
      "rate": "10",
      "helpful": "454 out of 660 found this helpful.",
      "title": "\"The Godfather\" of all thrillers",
      "content": "I've seen way too many thrillers. You name it: \"Identity\", \"Seven\", \"The Usual Suspects\", etc., etc., etc. I remember my friend being so obsessed with \"Silence of the Lambs\", that it drove me crazy. And I hated the movie naturally and refused to see it. But everyone told me that I have to see this, so I let my guard down. And had an open mind, and I'm glad I did. My friend was right, this is a great movie. It is so well acted, I couldn't even describe. I loved \"Silence of the Lambs\" and would recommend it to anyone. It's creepy and exciting. Trust me, you'll love it.10/10"
    },
    {
      "username": "Sargebri",
      "userUrl": "https://www.imdb.com/user/ur1791470",
      "reviewLink": "https://www.imdb.com/review/rw0299664",
      "warningSpoilers": false,
      "date": "12 July 2003",
      "rate": "",
      "helpful": "190 out of 272 found this helpful.",
      "title": "A Grand Thriller",
      "content": "This is definitely a film that proves you don't need tons of blood and gore to have a good suspense film. Anthony Hopkins performance as the deranged genius Lecter earned him a well deserved Academy Award and the same was true of Jodie Foster's performance as Clarice Starling. This film should go down in history as one of the greatest suspense films in the history of cinema."
    },
    {
      "username": "pooch-8",
      "userUrl": "https://www.imdb.com/user/ur0197287",
      "reviewLink": "https://www.imdb.com/review/rw0299417",
      "warningSpoilers": false,
      "date": "12 January 1999",
      "rate": "",
      "helpful": "146 out of 216 found this helpful.",
      "title": "Perfectly executed dramatic thriller",
      "content": "The Silence of the Lambs, having accomplished the rare feat of winning all five of the major Academy Award categories, is a remarkable achievement in filmmaking. Gruesome, pulpish material was transformed by dedicated participants on all levels of production, and a film that would have failed in the hands of many others wound up becoming a modern masterpiece. Taut direction and a superb screenplay might be the best arguments for the film's power, but the flashiest are certainly delivered in the bravura performances of Hopkins and Foster. Their interplay -- and remember, they only share a handful of scenes together -- is nothing short of riveting."
    },
    {
      "username": "wellthatswhatithinkanyway",
      "userUrl": "https://www.imdb.com/user/ur0345596",
      "reviewLink": "https://www.imdb.com/review/rw1217840",
      "warningSpoilers": false,
      "date": "16 November 2005",
      "rate": "10",
      "helpful": "113 out of 184 found this helpful.",
      "title": "A truly remarkable film",
      "content": "STAR RATING: ***** The Works **** Just Misses the Mark *** That Little Bit In Between ** Lagging Behind * The Pits Rookie FBI agent Clarice Starling (Jodie Foster) is assigned to get into the mind of notorious incarcerated serial killer Dr Hannibal 'the Cannibal' Lecter (Anthony Hopkins) to get his evaluation on the elusive Buffalo Bill, a serial killer who's been abducting and killing young women. When a prominent senator's daughter is kidnapped, it becomes a race against time to find her before she is killed and all the while Lecter is playing mind-games with Starling as well as any help he can provide...The first of Thomas Harris's Hannibal novels to be adapted for the screen, only to be followed some years later with some very lacklustre (but inevitable!) follow-ups, despite it's age this remains one of the most effective chillers of modern times. Despite the mainstream appeal of the film, the grainy lighting and laid-back budget give it an art-house feel that sets it apart from other such films that were as successful. The film manages some effectively disturbing scenes that make it a not altogether pleasant viewing experience.Performances wise, in a very early role, a young Foster shows her promise for future roles, with a gripping portrayal of naivety and vulnerability here that is very compelling and convincing, even though there are some plausibility problems with someone as junior as her being assigned to do something like that. Hopkins too is brilliant as Lecter, playing a dangerous man behind bars who's ability to get inside your head and see the things you don't want him to see makes him no less dangerous, if not more so, than if he was on the outside. He's certainly received the most acclaim for his role over the years, but in my humble opinion, he's actually over-shadowed (though only slightly!) by Ted Levine as Buffalo Bill, a truly extraordinary psychopath with an unsettling sexuality disorder that is probably one of the nastiest things ever to be seen in such a mainstream film. As supporting FBI agent Crawford, Scott Glenn is impressive but sort of just faded into DTV land after this film.It's easily one of the most popular films ever made, so it's likely a lot of you are familiar with it already, but with reviews on the so-inferior follow-up films Red Dragon and Hannibal, I thought it only right that I'd finally give this first film a mention. Truly remarkable. *****"
    },
    {
      "username": "Scudder-3",
      "userUrl": "https://www.imdb.com/user/ur0251361",
      "reviewLink": "https://www.imdb.com/review/rw0299483",
      "warningSpoilers": false,
      "date": "19 February 1999",
      "rate": "",
      "helpful": "479 out of 582 found this helpful.",
      "title": "Absolutely Brilliant.",
      "content": "Sweeping all five major Academy Awards (\"Oscars\" for Best Movie, Director, Actor, Actress, Screenplay) is quite an accomplishment. Doing it nearly a year after a film was released is a miracle considering the notoriously short attention span of Oscar voters. It is a powerful example of how great a movie can be when superb writers, directors, actors, and others work at the top of their craft.`Silence of the Lambs' is the story of a young FBI trainee Clarice Starling (Jodie Foster) who is summoned to help find one serial killer called `Buffalo Bill.' by interviewing another. Foster's performance is absolutely brilliant. While Anthony Hopkins receives most of the (well-deserved) praise for his chilling portrayal of incarcerated serial killer `Hannibal the Cannibal' Lector', it is Foster's performance that holds the movie together. The fear she shows just behind her eyes makes Clarice's outward courage all the more interesting and vulnerable. This is the perfect way to play the part because it explains Lector's interest in Clarice. Her only bargaining chip in getting Lector's help is to let him `feed' on her innermost secrets and fears in exchange for his brilliant insights into the psychotic mind. The title of the movie comes from these exchanges and is very poignant.Director Jonathan Demme is masterful. There is one scene late in the movie that I will not spoil. It is one of the most simply brilliant scenes ever staged in a movie. I don't know if all the credit goes to Demme or the writers, but there is a moment in the film where the suspense builds beautifully to a what seems to be a common movie scene. However, through skillful timing of the direction, the audiences assumptions are used against them and when the truth is revealed (hint: it involves a doorbell) it is shocking and induced a collective gasp from the audience I saw it with at the theatre. It set the stage for an edge-of-your seat climax.Do not miss this movie.The movie is incredibly suspenseful and an absolute must see."
    },
    {
      "username": "BaronBl00d",
      "userUrl": "https://www.imdb.com/user/ur0166205",
      "reviewLink": "https://www.imdb.com/review/rw0299316",
      "warningSpoilers": false,
      "date": "19 June 2000",
      "rate": "",
      "helpful": "94 out of 152 found this helpful.",
      "title": "Class Act",
      "content": "With Silence of the Lambs comes some much needed recognition for the horror genre. It is a first-rate production all around. It boasts a witty and suspenseful script based on the Thomas Harris novel, full of great lines. It has marvelous direction from Demme. Demme creates suspense very well throughout and uses some great directorial shots such as the twin frames of Clarice ringing a doorbell and the FBI men breaking into a home. The two lead actors won oscars for their performances...each deserved. Foster is very good in her role, but it is Anthony Hopkins that literally lights up the screen with his complex portrayal of a complex serial killer. Hopkins does the seemingly impossible. He frightens you with his outrageousness and yet illicts some pity/compassion(albeit not a lot) for his situation. He says his lines with reservedness when needed and brashness when needed. The rest of the cast is also quite good with Anthony Heald a standout as a unethical, petty doctor in charge of Hopkins. Of course the story of the other killer is very very chilling as well. A quality film in all aspects!"
    },
    {
      "username": "FrenchEddieFelson",
      "userUrl": "https://www.imdb.com/user/ur3257585",
      "reviewLink": "https://www.imdb.com/review/rw5051316",
      "warningSpoilers": false,
      "date": "10 August 2019",
      "rate": "9",
      "helpful": "36 out of 51 found this helpful.",
      "title": "A thrilling must see",
      "content": "I just saw, for the second or third time, this cinematographic masterpiece, during an « UGC culte » evening, in Paris. The list of the Big Five Academy Award winners is short. There are currently three of them, in nine decades: It Happened One Night (1934), One Flew Over the Cuckoo's Nest (1975) and ... The Silence of the Lambs (1991). This is not really surprising, this film being excellent, endowed with a script skillfully elaborated by Thomas Harris, with an irreproachable casting including Anthony Hopkins, Jodie Foster and Scott Glenn. In addition, the director Jonathan Demme delivers a work obviously enjoying an admirable preparatory work.Without unduly spoiling the script, if you have not seen it yet, by the greatest fluke: a psychopath known as the Buffalo Bill sows terror in the Middle West by kidnapping and murdering young pulpy women, after partially or completely skinning them. Clarice Starling, a young FBI agent, is in charge of interviewing Hannibal Lecter, a well-known former psychiatrist who has also the characteristic of a truly intelligent psychopath focused on cannibalism. Hannibal Lecter is able to provide Clarice Starling with providential information about Buffalo Bill . But he agrees to help her only in exchange for information about the young woman's private life. Between them is established a link of fascination and repulsion.As a synthesis: a thrilling must see. 9/10 of 10"
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw1204949",
      "warningSpoilers": false,
      "date": "30 October 2005",
      "rate": "8",
      "helpful": "102 out of 198 found this helpful.",
      "title": "Very Effective Thriller But Ultimately Overrated",
      "content": "It's impossible to comment on SILENCE OF THE LAMBS as being a mere film . Its release was a watershed in popular culture and has influenced a myriad of imitations that are far too numerous to mention . Much of this success is down to director Jonathan Demme who has made the film so effective by coming up with the strikingly simple idea of filming everything in dim lighting which gives SILENCE a moody and brooding atmosphere that was absent from movies in the previous decade . Ironically enough this is as typical of 90s film making as MANHUNTER was of 80s movies . Howard Shore's score also helps the proceedings and Jodie Foster gives a sublime nuanced performance as vulnerable heroine Clarice Starling . Watch the scenes closely when Clarice is in the company of men , don't you get the feeling she has a phobia about the male of the species . Is she a victim of sexual abuse in her childhood ? A lesbian ? We never find out but Foster's performance is multi layered and it's a pity this aspect is never explored in HANNIBAL which sadly deletes this aspect to Clarice Sadly SILENCE was released with a tidal wave of hype which the film doesn't live up to . Who can forget the stories that upon seeing this at the cinema certain audience members wanted armed escorts back to their cars ! I'm sorry but despite being a good thriller it's not that good and I fail to see how people were turned into quivering jellies unable to sleep with the lights off . I'm also afraid to say that much of the awards heaped upon the film aren't that well deserved either . Foster deserved the Oscar as did the film and possibly Demme too but did Ted Tally for his adapted screenplay ? All he seems to have done is to copy the best bits of Harris's novel wholesale into the screenplay without making an effort to improve anything . and i'll probably be accused of sacrilege but the more times I see this film the more times I ask myself how did Hopkins win the Oscar for Best Actor ? I don't even think Hopkins should have qualified for the Best Actor category since the role isn't on screen long enough and his performance is slightly hammy . Hannibal as played by Hopkins resembles something along the lines of a paedophile rather than a serial killer who has maimed , murdered and munched on adults . Despite having some reservations of Brian Cox as Hannibal in MANHUNTER you do believe his burly presence does have the physical strength to overpower his victims , not so Hopkins I know it's very difficult , perhaps even impossible , but the best way to enjoy this movie is to erase from your mind the fact that it's one of only three movies to have picked up the Oscar in all five main categories , the fact that it made headlines about being the most terrifying film committed to celluloid , and the fact that it stands as the 28th best movie ever on this website . It is a very good thriller but one that is ultimately disappointing after hearing of the hype surrounding it"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2458788",
      "warningSpoilers": false,
      "date": "15 July 2011",
      "rate": "10",
      "helpful": "22 out of 37 found this helpful.",
      "title": "Truly enthralling film and not one to forget",
      "content": "I have seen some great movies, old or new. The Silence of the Lambs is an amazing one, while not my personal favourite of the year of 1991 it was a well deserved Best Picture win in my opinion.Jonathan Demme's direction is superb, the film is shot in a ceaselessly atmospheric manner and Demme never lets the suspense drop. The story from start to finish is enthralling, and the script is tense and thought-provoking.The Silence of the Lambs is wonderfully acted as well. Jodie Foster is the one who holds the film together and her performance here is one of her most excellent, and I mustn't forget Ted Levine who is very chillingly effective as Buffolo Bill. Anthony Hopkins however steals the film, it is his perhaps most iconic character and he proves that although he is in only a portion of the film his performance lives long in the memory.All in all, amazing. 10/10 Bethany Cox"
    },
    {
      "username": "LeonLouisRicci",
      "userUrl": "https://www.imdb.com/user/ur33374263",
      "reviewLink": "https://www.imdb.com/review/rw2791332",
      "warningSpoilers": false,
      "date": "2 May 2013",
      "rate": "7",
      "helpful": "17 out of 28 found this helpful.",
      "title": "Some Careless Stitching",
      "content": "Heaps of praise have been given to this multiple Oscar winner by Critics and Fans alike. It is sometimes disturbing, sometimes terrifying, and sometimes the Characters are engaging. Sometimes.The Film is inconsistent in both style and substance. There are way too many close ups. After a few, the intended uneasiness is lost. Most of the sets are attractively unappealing and does give the sense of a forbidden place. A striking performance from Hopkins but some of his cryptic inclusions using anagrams are uninteresting and at worst confusing and make no or little sense of irony. Jodie Foster seems forcing it, especially when asked to reveal some secret recalling the title of the Book and Movie. There are also some less than brilliantly enticing lectures from Hannibal about coveting and a scribbled note that is laughably sophomoric and we're off to catch the truly creepy Buffalo Bill.Overall it adds up to be less than it seems. Some clever stuff but it is carelessly sewed together and with some tugging starts to unravel. Overrated, but influential, with some disturbing and dank scenes that make this a bumpy, irritating, and not quite completely satisfying ride to the Dark Side."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3476006",
      "warningSpoilers": true,
      "date": "25 May 2016",
      "rate": "10",
      "helpful": "46 out of 86 found this helpful.",
      "title": "Classic psychological, suspense brilliant - masterpiece best horror thriller ever made!",
      "content": "The Silence of the Lambs (1991) is a classic psychological suspense brilliant masterpiece well acted and the best thriller ever made! This was my first film I saw on VHS as a teenager and I absolutely loved it. Right after seeing this flick, I heard about Hannibal (2001) Ridley Scot film a sequel to this psychological thriller flick, I rushed buying it right away. Saddly I was disappointed with Ridley Scott Hannibal.\"Silence of the Lambs \" is a classic and I think people would agree. It is my number 1 favorite thriller ever made, mostly I have enjoyed Jodie Foster as FBI recruit Clarice Starling's. Jodie did a brilliant acting performance I have seen. I love this film to death I absolutely love everything about this film. Since the first time I saw her in Silence I went to seeing her in a movie theater 2002 Panic Room, it was her first film I saw in movie theater since than I love Jodie Foster but Silence will be her best film she ever made. I was disappointed with the sequel Hannibal, no Jodie Foster in it, no brilliant masterful Clarice. Julianne Moore was incompetent for me, she couldn't catch Hannibal. Clarice Starling character was based on Gillian Anderson's FBI Agent Dana Scully and I think The X-Files inspired this film. I am even convinced that The Lone Gunman three geeks were also based on this film. You have a nice shootout on the end with Clarice and Buffalo Bill and Clarice get's her man, spoils her plans saves the hostage and saves the day.The Silence of the Lambs is the 1991 thriller that was the feature film adaptation of the novel of the same name by Thomas Harris and marked the first appearance of Anthony Hopkins as Dr. Hannibal Lecter. (Oscar-winner Anthony Hopkins in one of the greatest performances ever on the screen) Dr.Hannibal \"The Cannibal\" Lecter, is a brutal killer with revolting methods and habits, but he's also very intelligent, charismatic and with good taste (you can interpret that as you like). He is scary and his the same time awesome including brilliant, you can't out smart him. Director Jonathan Demme is masterful directing this flick you have to be brilliant you have to keep thinking to solve the murder mystery. Scott Glenn acts beautiful as Jack Crawford. This flick got five major Academy Awards (\"Oscars\" for Best Movie, Director, Actor, Actress, Screenplay) it is no wonder why.Plot: FBI recruit Clarice Starling (Jodie Foster) is asked by the Bureau to elicit Lecter's help in tracking down a notorious serial killer who has kidnapped a US Senator's daughter. Directed by Jonathan Demme (The Manchurian Candidate), the film would receive five Academy Awards, including Best Picture, Best Actor for Hopkins and Best Actress for Foster and Best Screenplay. Hopkins would reprise his role as Lecter in two more films: Hannibal (2001) and Red Dragon (2002).Real life killer Ed Gein was the inspiration for Buffalo Bill as well as the inspiration for Norman Bates from Psycho and Leatherface from the Texas Chainsaw Massacre movies. And the director Jonathan Demme was a film student of Roger Corman who makes a cameo in the movie. Roger Corman taught not only him, but I think other filmmakers such as Martin Scorsese, James Cameron, Joe Dante, Francis Ford Coppola, and many others. Ted Levine did a pretty solid job as a serial killer Buffalo Bill. This film is fun, intense, very well fast paced goes quickly around for those two hours.The Silence of the Lambs is a 1991 American horror-thriller film directed by Jonathan Demme and starring Jodie Foster, Anthony Hopkins, and Scott Glenn. The film is based on Thomas Harris' 1988 novel of the same name, his second to feature Hannibal Lecter, a brilliant psychiatrist and cannibalistic serial killer.In the film, Clarice Starling, a young U.S. FBI trainee, seeks the advice of the imprisoned Dr. Lecter to apprehend another serial killer, known only as \"Buffalo Bill\".This movie is a perfect 10 out of 10, it takes the vision of one of the most imaginative directors on Earth (Jonathan Demme) with a brilliant cast including Thomas Harris novel that was adapted from it. I even saw the Documentary how they were shooting this film on YouTube. I think I do have that documentary film in my Blu-ray special features. Watch this film you want be disappointed at all.The movie is incredibly suspenseful and an absolute must see for fans."
    },
    {
      "username": "ACollegeStudent",
      "userUrl": "https://www.imdb.com/user/ur118665987",
      "reviewLink": "https://www.imdb.com/review/rw8753095",
      "warningSpoilers": true,
      "date": "23 December 2022",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Lecter carried this hard",
      "content": "Rating: 7.8Fine movie with a poignant and dark ending. The presentation was fine, there was a big emphasis on the eyes of men and how they see Clarice as a woman. The metaphors and motifs around lambs = innocents, Clarice taking up an FBI job to silence the death of innocents. Moths representing the transformation of Bill who wants to be a woman, were well placed. Some things didn't make sense such as how Hannibal got that pen to escape, Hannibal's fascination with Clarice was never explained or even implied (though Hannibal's character is apparently explained outside the movie to cover this issue). It got slow in places and I didn't find Clarice's character interesting she was a little too perceptive like being able to brute-force a specific phrase from an anagram twice. There are millions of phrases an anagram could form it's just ridiculous. The ending was an ironic equivalent exchange Hannibal helped kill Bill but as a result Clarice indirectly helped free Hannibal Very good can't call it great."
    },
    {
      "username": "pmtelefon",
      "userUrl": "https://www.imdb.com/user/ur6587670",
      "reviewLink": "https://www.imdb.com/review/rw4826566",
      "warningSpoilers": true,
      "date": "4 May 2019",
      "rate": "5",
      "helpful": "23 out of 44 found this helpful.",
      "title": "Top ten most overrated movies of all time.",
      "content": "Overrated doesn't mean bad. It just means that something is not as good as people say it is. \"The Silence of the Lambs\" isn't a bad movie. It's an okay movie. The best part of the movie is the music. It gives the movie a creepy vibe. The rest of the movie isn't so hot. This is the kind of movie that while you are watching it you think it's really good. But when it's over and you begin to think about what you just watched, you realize that it's pretty dumb. Hannibal Lector escapes by wearing a dead guy's face. Silly. Oh by the way, how did Lector steal the pen? They don't tell you because it would have been impossible for him to steal it. Now after all these years (and years of CSI type tv shows) the little gross out elements that \"The Silence of the Lambs\" has seem awfully tame. It's an okay, and I guess somewhat mandatory, watch."
    },
    {
      "username": "crisp_morning_2004",
      "userUrl": "https://www.imdb.com/user/ur11547708",
      "reviewLink": "https://www.imdb.com/review/rw1444764",
      "warningSpoilers": true,
      "date": "11 August 2006",
      "rate": "10",
      "helpful": "92 out of 145 found this helpful.",
      "title": "A gripping film that well deserved its Oscars",
      "content": "It is a creepy and taken-by-storm experience with the film, background music is darker than the film itself and too ominous, plot is brilliantly constructed, conversations are thought-provocative, to crown the whole, Jodie Foster and Anthony Hopkin are the cream. They take ownership of Clarice and Hannibal respectively, transforming them into the most unforgettable screen images.The psychological path of Hannibal is hard to trace. He is so odd a mixture of intelligence, cruelty, insanity, grace and charisma. In the depth, fledgling FBI trainee Clarice is no match of him. She is still naive yet very ambitious. On the trail of the serial killer Buffalo Bill, she's sent to interview him, a psychiatrist-turned-cannibal. Hannibal is willing to provide clues to finding the killer but only in return for personal information about Clarice herself. He calls it Quid Pro Quo. In those mind games, the two dance backward and forward between cannibal and FBI agent, mentor and student, psychiatrist and patient, father and daughter. It is Clarice who breathes life into the multidimensional sophisticated psychopath and Hannibal who nudges the aspiring student FBI agent and helps her achieve her first success in a world of Y chromosome where her guru Crawford uses her, embarrasses her, excludes her; Doctor Chilton regards her no more than a simple-minded woman and tries to flirt with her. Frankly speaking, though no lack of other impressive scenes, it's really the nerves fights between Hannibal and Clarice that carries the film.Some of the horrible scenes involve Buffalo Bill who, a transvestite, skins his victims, especially woman victims. But the most terrifying one is Clarice's single-handed trace in Buffalo Bill's gruesome den, which also has become another irony to the self-important testosterone-dominated world. Crawford's misjudgment and stubbornness makes him out of the right track, a special anti-terror deployment resulting in vain. But Clarice, though excluded from the business which she should be on, still holds onto her intuition and through on-the-spot investigation finds the serial killer at last. She has to take on him herself. (Demme uses \"deceptive cutting\" there to enhance the tension.) It is definitely a life-or-death fight, especially when Clarice is in the dark, groping her way in absolute terror. I have no doubt everyone holds the breath when the film rolls to that part.A gripping film that well deserved its Oscars"
    },
    {
      "username": "SusieSalmonLikeTheFish",
      "userUrl": "https://www.imdb.com/user/ur53732923",
      "reviewLink": "https://www.imdb.com/review/rw3621814",
      "warningSpoilers": true,
      "date": "17 January 2017",
      "rate": "4",
      "helpful": "24 out of 46 found this helpful.",
      "title": "Why?",
      "content": "Look, \"overrated\" doesn't necessarily mean bad. I liked this film when it first came out, and I found it very entertaining. But the extremely high amount of praise that this film gets, makes no sense to me at all. The supposedly menacing and creepy Hannibal Lecter, who ate his victims and is now locked away from society, sounds totally ridiculous with his cheesy one-liners about cannibalism and killing. Jodie Foster, who plays our main protagonist (an elite FBI agent in training) looks and sounds about thirteen years old, and the entire time I was watching, she kept reminding me of an actress from a television after-school special playing dress-up and pretending to be a cop. The pace of this film was rather dull as well, unnecessarily long with hammy characters that seem like they belong in a Troma movie rather than anything highly rated. It still blows my mind that a brilliant film like \"The Killing Fields\" has never been selected for national preservation, but this corny crime thriller was. Honestly I've seen low-budget slashers better than this thing... so why the high reputation and constant fans saying \"oh god, this film is awesome! Hannibal is soooo sexy!\" and all that? To each their own, everybody likes different things, but with this one, which currently has an 8.6/10 overall rating on IMDb, how did that even happen? Was this one of those \"right place at the right time\" kind of things where it hits a generation by doing something innovative for the time, thus becoming popular? Or is there seriously something here I'm missing? I've watched it several times and I don't find it complex or overly intriguing in any way whatsoever. And I really like Foster and Hopkins as actors, from Hopkins' role as the grieving father in Audrey-Rose, to Foster as the dying little girl on a Nova Scotia vacation in Echoes of a Summer, but in this film it tries to put them together in some sort of tragic love story, which really plays out strangely. I kept cringing at Foster's character's pretentiousness and show-off attitude and Hannibal Lecter's pointless riddles and games, which are interesting at first but quickly become boring and stupid."
    },
    {
      "username": "notoriousCASK",
      "userUrl": "https://www.imdb.com/user/ur31221670",
      "reviewLink": "https://www.imdb.com/review/rw3769659",
      "warningSpoilers": false,
      "date": "1 August 2017",
      "rate": "10",
      "helpful": "64 out of 105 found this helpful.",
      "title": "One of the Greatest Thrillers of all Time.",
      "content": "The Silence of the Lambs is a masterpiece you cannot miss, it's a masterwork of suspense that blends the elements of horror, crime and psychology into one tight and smooth story. It's only the third film in history to win Academy Awards in all the top five categories: Best Picture, Best Actor, Best Actress, Best Director, and Adapted Screenplay and that imply something about its technical quality as a film. It features expertise level of craftsmanship in all departments of filmmaking, and takes a huge bonus from the exquisite performances put in by its stellar cast. After all these years The Silence of the Lambs remains in a league of its own and is a perfect exemplification of just how great a movie can become when all the right elements come together and work in perfect harmony to form a complete whole.Based on the novel of the same name, Jodie Foster stars as Clarice Starling, a top student at the FBI's training academy. FBI agent Jack Crawford (Scott Glenn) wants Clarice to interview Dr. Hannibal Lecter (Anthony Hopkins), a genius psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism. Crawford believes that Lecter may have insight into a case of a serial killer called Buffalo Bill (Ted Levine), that murders and skins his victims and that Starling as an attractive young woman, may be just the bait to make him help with the case.The direction by Jonathan Demme is marvelous, as the film introduces its chilling sense of dread and has the audience on the edge of their seats, from the moment Howard Shore's ominous score hits the screen till the end of the film, especially during the climax with a lot of perfectly crafted suspenseful and nail-biting moments. The editing is perfect as the pace is methodical from start to finish, and each and every sequence is relevant to the story. The cinematography by Tak Fujimoto is fantastic as it fully succeeds into creating a very dark and brooding atmosphere that captivates as well as terrorize the audience, while also exhibiting excellent camera work that makes heavy use of close-ups which increase the creepiness and tension along with displaying an optimal color palette and minimal lightning from start to finish, which further enhances the darker ambience the story was aiming for. Moreover, the production design team has done a magnificent work as every set piece is meticulously crafted, richly detailed and very well-lit. The script by Ted Tally, also packs a very well structured and tight plot, every character has a well-defined arc, all the themes are smartly addressed, the attention to detail is quite impressive, and the complete story and narrative are perfect.The performances are incredible. Jodie Foster as Clarice is absolutely brilliant and gives an impeccable performance as a woman who is desperately trying to forget her painful past and yet at the same time tries to prove her worth in a male dominant world. Anthony Hopkins as the genius psychiatrist and cannibalistic serial killer Hannibal Lecter is the perfect amalgamation of charisma, high intelligence and destructive violence, and gives a bone-chilling and memorable performance that will stand the passage of time as one of the absolute best. The small amount of screen time that Hopkins is given is a definitive testament to his acting capabilities, as with such an elegant and minimal performance, he solidifies himself as one of the most iconic villains of all time. Due to the charisma and electrifying chemistry between the two actors every scene they share becomes an instant classic.In conclusion, the Silence of the Lambs is one of the greatest films ever made and a masterwork of brilliant direction, smart screenplay, splendid camerawork, tight editing, marvelous score and exquisite performances, that cemented the legacy of both Anthony Hopkins and Jodie Foster by engraving their iconic characters into the annals of cinema. The film absolutely deserves all the accolades and recognition it gets, for both its contributions to cinema and the immense impact it had on pop culture. Jonathan Demme's magnum opus is an outstanding achievement in genre filmmaking that has inspired and influenced countless thrillers since its release, and is not only the quintessential suspense and psychological horror film but also an ingenious observation of humanity's dark and violent nature and a masterpiece that every film lover must see."
    },
    {
      "username": "george.schmidt",
      "userUrl": "https://www.imdb.com/user/ur0937743",
      "reviewLink": "https://www.imdb.com/review/rw0299646",
      "warningSpoilers": true,
      "date": "22 April 2003",
      "rate": "",
      "helpful": "31 out of 70 found this helpful.",
      "title": "Best served chilled with a nice Chianti",
      "content": "THE SILENCE OF THE LAMBS (1991) **** Jodie Foster, Anthony Hopkins, Scott Glenn, Ted Levine, Anthony Heald, Brooke Smith, Diane Baker (Cameos: Roger Corman, producer Kenneth Utt, singer Chris Isaak) Terrifying masterpiece of modern-day horror and the first film since 1975's \"One Flew Over The Cuckoo's Nest\" to win all 5 major Oscars (Picture, Director: Jonathan Demme, Actress Foster, Actor Hopkins, and Screenplay Adaptation by Ted Tally of the best-seller by Thomas Harris): novice FBI agent Clarice Starling (a stalwart Foster) begins her career in a manhunt for a serial killer known as \"Buffalo Bill\", a transsexual wanna-be whose grisly crimes leads to her only source of his trail: imprisoned psychiatrist Hannibal \"The Cannibal\" Lecter (Hopkins in one chilling and modulated perf) whose mindgames with the rookie agent has her on her toes and running out of time. Exciting, suspenseful and supremely scary with some truly eye-widening moments of the unexpected. Best line: Lecter at film's end: \"I'm having an old friend for dinner.\""
    },
    {
      "username": "Clothahump",
      "userUrl": "https://www.imdb.com/user/ur0163212",
      "reviewLink": "https://www.imdb.com/review/rw0299491",
      "warningSpoilers": false,
      "date": "20 March 1999",
      "rate": "10",
      "helpful": "15 out of 24 found this helpful.",
      "title": "Suspenseful doesn't come close!",
      "content": "Great job by Foster and Hopkins. Hannibal's part could have been fleshed out a little more, though (sorry, couldn't resist that one). The book described him in more detail and made him even more reprehensible; the movie could have spent five minutes more and done the same."
    },
    {
      "username": "ThunderKing6",
      "userUrl": "https://www.imdb.com/user/ur71305899",
      "reviewLink": "https://www.imdb.com/review/rw6142698",
      "warningSpoilers": false,
      "date": "2 October 2020",
      "rate": "5",
      "helpful": "15 out of 30 found this helpful.",
      "title": "overhyped 90s movie",
      "content": "It was not bad. Mainly an over hyped.The pacing felt like a distorted quilt.The whole movie was saturated with grainy character development. I was unsure of the direction this movie wanted to take. Felt all over the place.The jail scene and the ending are the only parts worth watching.Main character was subpar. Not bad and not outstanding either. I didn't care for her past. It's the usual only the main character goes through trauma and flash backs as they try to solve a problem.Hopkins did very well but this whole movie is still overrated. It's an award-winner that's undeserving of so much hype. The Silence of the Lamb is just like the DC Joker movie. It won awards but the movie was lackluster.Verdict: Odin What have you done?"
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3013712",
      "warningSpoilers": false,
      "date": "11 May 2014",
      "rate": "10",
      "helpful": "16 out of 35 found this helpful.",
      "title": "The granddaddy of all serial killer flicks",
      "content": "THE SILENCE OF THE LAMBS is, quite simply, a breathtaking movie. It's the granddaddy of all serial killer flicks, a film that even the almost-as-good SE7EN can only aspire to, a movie that gets into the mind and soul of a serial killer like few others. It inspired a huge sub-genre of similar movies that came out during the 1990s and 2000s, and it's up there with Hitchcock's PSYCHO as one of the most gripping looks at the subject matter of all time.Where to begin? There's a pitch-perfect Jodie Foster, gradually leading us into the depths of the storyline as the naive FBI agent, and the oft-overlooked Ted Levine who excels as the supremely skin-crawling Buffalo Bill. Of course, the film is dominated by Anthony Hopkins, giving the best and most memorable performance of his career in just 16 minutes of screen time. Hopkins chills you to the bone in this, and Jonathan Demme's direction is a perfect match for his talents.The storyline is engaging, ably mixing the criminal investigation strands with scenes involving the killers themselves. There are gory and monstrous set-pieces which make your flesh crawl while watching, yet it's all rather restrained and intellectual, a surprise given the subject matter. Most importantly, it's never less than gripping and completely frightening. A true masterpiece of a movie."
    },
    {
      "username": "ruffinelli_ro",
      "userUrl": "https://www.imdb.com/user/ur20682472",
      "reviewLink": "https://www.imdb.com/review/rw2039058",
      "warningSpoilers": true,
      "date": "17 March 2009",
      "rate": "6",
      "helpful": "133 out of 277 found this helpful.",
      "title": "Not that great..",
      "content": "It is really difficult for me to understand what it is about this film that everyone loves. I have seen many thrillers and I can honestly say that this one is not even in my Top 20. Although I think Hopkins did a terrific job in Lecter's shoes, his 30 minutes on screen just were not enough. This was supposed to be a horror film but I think it barely managed to create the suspense atmosphere and it certainly did not scare me or made me feel uncomfortable at all. Perhaps I expected more since I have been hearing all the fuzz about this movie since I was a little kid. So I watched this film several times and I am still not enjoying it that much."
    }
  ],
  "errorMessage": ""
}