{
  "imDbId": "tt0102926",
  "title": "The Silence of the Lambs",
  "fullTitle": "The Silence of the Lambs (1991)",
  "type": "Movie",
  "year": "1991",
  "language": "en",
  "titleInLanguage": "The Silence of the Lambs (film)",
  "url": "https://en.wikipedia.org/wiki/The_Silence_of_the_Lambs_(film)",
  "plotShort": {
    "plainText": "The Silence of the Lambs is a 1991 American psychological horror film directed by Jonathan Demme and written by Ted Tally, adapted from Thomas Harris's 1988 novel. It stars Jodie Foster as Clarice Starling, a young FBI trainee who is hunting a serial killer named \"Buffalo Bill\" (Ted Levine), who skins his female victims. To catch him, she seeks the advice of the imprisoned Dr. Hannibal Lecter (Anthony Hopkins), a brilliant psychiatrist and cannibalistic serial killer. The film also features performances from Scott Glenn, Anthony Heald, and Kasi Lemmons.\r\nThe Silence of the Lambs was released on February 14, 1991, and grossed $272.7 million worldwide on a $19 million budget, becoming the fifth-highest-grossing film of 1991 worldwide. It premiered at the 41st Berlin International Film Festival, where it competed for the Golden Bear, while Demme received the Silver Bear for Best Director. It became the third and most recent film (the other two being 1934's It Happened One Night and 1975's One Flew Over the Cuckoo's Nest) to win Academy Awards in all the major five categories: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. It is the only horror film to win Best Picture.\r\nThe Silence of the Lambs is regularly cited by critics, film directors, and audiences as one of the greatest and most influential films. In 2018, Empire ranked it 48th on their list of the 500 greatest movies of all time. The American Film Institute ranked it the fifth-greatest and most influential thriller film, while Starling and Lecter were ranked among the greatest film heroines and villains. The film is considered \"culturally, historically, or aesthetically\" significant by the U.S. Library of Congress and was selected for preservation in the National Film Registry in 2011. A sequel, Hannibal, was released in 2001, followed by two prequel films, Red Dragon (2002) and Hannibal Rising (2007).",
    "html": "<p>The Silence of the Lambs is a 1991 American psychological horror film directed by Jonathan Demme and written by Ted Tally, adapted from Thomas Harris's 1988 novel. It stars Jodie Foster as Clarice Starling, a young FBI trainee who is hunting a serial killer named \"Buffalo Bill\" (Ted Levine), who skins his female victims. To catch him, she seeks the advice of the imprisoned Dr. Hannibal Lecter (Anthony Hopkins), a brilliant psychiatrist and cannibalistic serial killer. The film also features performances from Scott Glenn, Anthony Heald, and Kasi Lemmons.</p><p>The Silence of the Lambs was released on February 14, 1991, and grossed $272.7 million worldwide on a $19 million budget, becoming the fifth-highest-grossing film of 1991 worldwide. It premiered at the 41st Berlin International Film Festival, where it competed for the Golden Bear, while Demme received the Silver Bear for Best Director. It became the third and most recent film (the other two being 1934's It Happened One Night and 1975's One Flew Over the Cuckoo's Nest) to win Academy Awards in all the major five categories: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. It is the only horror film to win Best Picture.</p><p>The Silence of the Lambs is regularly cited by critics, film directors, and audiences as one of the greatest and most influential films. In 2018, Empire ranked it 48th on their list of the 500 greatest movies of all time. The American Film Institute ranked it the fifth-greatest and most influential thriller film, while Starling and Lecter were ranked among the greatest film heroines and villains. The film is considered \"culturally, historically, or aesthetically\" significant by the U.S. Library of Congress and was selected for preservation in the National Film Registry in 2011. A sequel, Hannibal, was released in 2001, followed by two prequel films, Red Dragon (2002) and Hannibal Rising (2007).</p>"
  },
  "plotFull": {
    "plainText": "The Silence of the Lambs is a 1991 American psychological horror film directed by Jonathan Demme and written by Ted Tally, adapted from Thomas Harris's 1988 novel. It stars Jodie Foster as Clarice Starling, a young FBI trainee who is hunting a serial killer named \"Buffalo Bill\" (Ted Levine), who skins his female victims. To catch him, she seeks the advice of the imprisoned Dr. Hannibal Lecter (Anthony Hopkins), a brilliant psychiatrist and cannibalistic serial killer. The film also features performances from Scott Glenn, Anthony Heald, and Kasi Lemmons.\r\nThe Silence of the Lambs was released on February 14, 1991, and grossed $272.7 million worldwide on a $19 million budget, becoming the fifth-highest-grossing film of 1991 worldwide. It premiered at the 41st Berlin International Film Festival, where it competed for the Golden Bear, while Demme received the Silver Bear for Best Director. It became the third and most recent film (the other two being 1934's It Happened One Night and 1975's One Flew Over the Cuckoo's Nest) to win Academy Awards in all the major five categories: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. It is the only horror film to win Best Picture.\r\nThe Silence of the Lambs is regularly cited by critics, film directors, and audiences as one of the greatest and most influential films. In 2018, Empire ranked it 48th on their list of the 500 greatest movies of all time. The American Film Institute ranked it the fifth-greatest and most influential thriller film, while Starling and Lecter were ranked among the greatest film heroines and villains. The film is considered \"culturally, historically, or aesthetically\" significant by the U.S. Library of Congress and was selected for preservation in the National Film Registry in 2011. A sequel, Hannibal, was released in 2001, followed by two prequel films, Red Dragon (2002) and Hannibal Rising (2007).\r\nPlot\r\nClarice Starling, an FBI trainee, is pulled from her regimen at the Quantico FBI Academy by her boss, Jack Crawford. He assigns her to interview Hannibal Lecter, an incarcerated former psychiatrist and cannibalistic serial killer, on the pretense of persuading Lecter to answer a questionnaire about himself for the Bureau's psychological profiles, but secretly hoping to gain his insights about a psychopath serial killer nicknamed \"Buffalo Bill,\" who kills young women and removes their skin from their bodies.\r\nAt the Baltimore State Hospital for the Criminally Insane, Dr. Frederick Chilton escorts Starling to Lecter's cell. Although initially pleasant and courteous, Lecter grows impatient with Starling's interviewing and rebuffs her, deducing Crawford's true motive and refusing to help. As she is leaving, another prisoner, Miggs, flicks semen at her as he masturbates, angering Lecter. He calls Starling back and tells her to seek out an old patient of his, which leads her to a storage facility where she discovers a jar containing a man's severed head. She returns to Lecter, who says the man is linked to Buffalo Bill, and offers to profile the suspect on the condition that he is transferred away from Chilton, whom he detests. Meanwhile, another victim is found with a death's head moth lodged in her throat.\r\nIn Tennessee, Buffalo Bill abducts Catherine Martin, the daughter of a U.S. senator. Crawford authorizes Starling to offer Lecter a fake deal, promising a prison transfer if he provides information that helps them capture Buffalo Bill in time to rescue Catherine. Instead, Lecter demands a quid pro quo from Starling, offering clues in exchange for her personal information. Starling tells Lecter about her father's murder when she was a child. Chilton eavesdrops on their conversation and exposes Starling's deceit to Lecter before offering him a new deal. Lecter agrees and is flown to Memphis, where he meets Senator Martin, giving her accurate information on Buffalo Bill's appearance but falsely states his name is \"Louis Friend.\"\r\nStarling figures out that the name is an anagram of \"iron sulfide\"—fool's gold. She visits Lecter, now imprisoned in a cell in Tennessee, and requests the truth. Lecter says all the information she needs is in the Buffalo Bill case file, then insists on continuing their quid pro quo. She recounts a traumatic childhood incident of hearing spring lambs being slaughtered. Lecter speculates that Starling hopes that saving Catherine will end the recurring nightmares she has of lambs screaming, and gains satisfaction from this shared revelation. Lecter returns the case files to Starling as Chilton arrives and has the police escort her out. Later that evening, Lecter kills his guards, escapes from his cell, and disappears.\r\nStarling analyzes Lecter's file annotations and figures out that Buffalo Bill knew his first victim, Frederika Bimmel. Starling travels to Bimmel's Ohio hometown and discovers that she and Buffalo Bill were both tailors. At Bimmel's home, Starling finds dress patterns identical to the patches of skin removed from the victim and phones Crawford to tell him that Buffalo Bill is making a \"suit\" with human skin. Crawford is already en route to make an arrest, having cross-referenced Lecter's notes with hospital archives and finding a man named Jame Gumb, who believes he is transsexual but was deemed too violent to apply for a sex-change operation. Crawford and an FBI Hostage Rescue Team storm Gumb's address in Illinois, finding the house empty. Meanwhile, Starling follows a lead from one of Bimmel's friends, which takes her to the house of one of her former clients. At the house, she meets \"Jack Gordon,\" but realizes he is Gumb after spotting a death's head moth flying loose. She pursues him into a cavernous basement and finds Catherine trapped in a dry well. In a dark room, Gumb stalks Starling with night-vision goggles, but reveals himself by cocking his revolver. Starling reacts quickly and shoots Gumb dead.\r\nAt the FBI Academy graduation party, Starling receives a phone call from Lecter, who is at a Bimini airport. He assures her that he has no intention of pursuing her and requests that she return the favor, which she says she cannot. Lecter subsequently hangs up the phone because he is \"having an old friend for dinner\". He trails a newly-arrived Chilton into the crowd.\r\nCast\r\nJodie Foster as Clarice Starling Masha Skorobogatov as young Clarice\r\nMasha Skorobogatov as young Clarice\r\nAnthony Hopkins as Dr. Hannibal Lecter\r\nScott Glenn as Jack Crawford\r\nTed Levine as Jame \"Buffalo Bill\" Gumb\r\nAnthony Heald as Dr. Frederick Chilton\r\nBrooke Smith as Catherine Martin\r\nDiane Baker as U.S. Senator Ruth Martin\r\nKasi Lemmons as Ardelia Mapp\r\nFrankie Faison as Barney Matthews\r\nTracey Walter as Lamar\r\nCharles Napier as Lt. Bill Boyle\r\nStuart Rudin as Miggs\r\nDanny Darst as Sgt. Tate\r\nAlex Coleman as Sgt. Jim Pembry\r\nDan Butler as Roden\r\nPaul Lazar as Pilcher\r\nRon Vawter as Paul Krendler\r\nRoger Corman as FBI Director Hayden Burke\r\nGeorge A. Romero as a jailer\r\nChris Isaak as SWAT Commander\r\nHarry Northup as Mr. Bimmel\r\nBrent Hinkley as Officer Murray\r\nCynthia Ettinger as Officer Jacobs\r\nLauren Roselli as Stacy Hubka\r\nDaniel Von Bargen as SWAT Negotiator\r\nDarla as the dog, Precious\r\nAnalysis\r\nIn the years following its release, The Silence of the Lambs was subject to much film criticism regarding its themes of human sexuality and sexual politics. Throughout the film, Clarice Starling's gender is emphasized as a distinguishing feature, as she is a minority amongst her numerous male peers, though film scholar Barry Forshaw notes that \"any feminist agenda is never bluntly formulated verbally.\"\r\nSome gay male critics and feminists felt that the film's portrayal of Buffalo Bill negatively associated the LGBT community with deviance, psychopathy, and violence. Despite this, Bill's sexual orientation is never explicitly stated in the film, and Lecter expressly states Bill is \"not really transsexual.\" Demme responded that Buffalo Bill \"wasn't a gay character. He was a tormented man who hated himself and wished he was a woman because that would have made him as far away from himself as he possibly could be.\" Demme added that he \"came to realize that there is a tremendous absence of positive gay characters in movies\".\r\nIn a 1992 interview with Playboy magazine, the feminist and women's rights advocate Betty Friedan stated: \"I thought it was absolutely outrageous that The Silence of the Lambs won four Oscars. I'm not saying that the movie shouldn't have been shown. I'm not denying the movie was an artistic triumph, but it was about the evisceration, the skinning alive of women. That is what I find offensive. Not the Playboy centerfold.\"\r\nProduction\r\nDevelopment\r\nThe Silence of the Lambs is based on the 1988 novel by Thomas Harris. It was the second film to feature the character Hannibal Lecter; the first, Manhunter (1986), was also adapted from a Harris novel. Prior to the release of the Silence of the Lambs novel, Orion Pictures partnered with Gene Hackman to adapt it for film. With Hackman set to direct and possibly star in as FBI agent Jack Crawford, negotiations were made to split the $500,000 cost of rights between Hackman and the studio. The producers also had to acquire the rights to the Lecter character, which were owned by Manhunter producer Dino De Laurentiis. Owing to the financial failure of Manhunter, De Laurentiis lent the rights to Orion for free.\r\nIn November 1987, Ted Tally was brought on to write the adaptation; Tally had crossed paths with Harris many times, with his interest in adapting The Silence of the Lambs originating from receiving an advance copy of the book from Harris. When Tally was about halfway through with the first draft, Hackman withdrew from the project and financing fell through. However, Orion co-founder Mike Medavoy encouraged Tally to keep writing as the studio took care of financing and searched for a replacement director. Orion sought director Jonathan Demme to helm the project. With the screenplay not yet completed, Demme signed on after reading the novel. From there, the project developed quickly; Tally said: \" read my first draft not long after it was finished, and we met. Then I was just startled by the speed of things. We met in May 1989 and were shooting in November. I don't remember any big revisions.\"\r\nCasting\r\nJodie Foster was interested in playing FBI agent Clarice Starling immediately after reading the novel. However, despite having just won an Academy Award for her performance in The Accused (1988), Demme was not initially convinced that she was right for the role. Having just collaborated on Married to the Mob (1988), Demme's first choice for the role of Starling was Michelle Pfeiffer, who turned it down, later saying, \"It was a difficult decision, but I got nervous about the subject matter.\" He then approached Meg Ryan, who also turned it down for its gruesome themes. The studio was skeptical about Laura Dern as a bankable choice, so Foster was ultimately awarded the role due to her passion for the character.\r\nFor the role of Lecter, Demme originally approached Sean Connery. After Connery turned it down, Anthony Hopkins was offered the role based on his performance in The Elephant Man (1980). When Hopkins's agent told him that a script was on his way titled The Silence of the Lambs, Hopkins responded, \"Is it a children's story?\" Hopkins called his agent back after reading the first 10 pages and said, \"This is the best part I've ever read.\" He accepted the role after having dinner with Demme.\r\nOther actors considered for the role included Al Pacino, Robert De Niro, Dustin Hoffman, Derek Jacobi and Daniel Day-Lewis. Forest Whitaker has stated that he also auditioned for the role. The mask Hopkins wore became an iconic symbol of the film. It was created by Ed Cubberly, of Frenchtown, New Jersey, who had made masks for NHL goalkeepers.\r\nHopkins developed his portrayal of Lecter by drawing inspiration from the HAL 9000 computer as voiced by Douglas Rain in 2001: A Space Odyssey, as well as the vocal patterns of writer Truman Capote. In a 2001 interview with GQ, Hopkins clarified that he did not base Lecter's vocal cadence on Katharine Hepburn, as some people had believed. He also revealed that the decision to play Lecter as still and unblinking was not influenced by Charles Manson, as some had speculated. Hopkins admitted to being intimidated by Foster, who had just won an Academy Award, and initially felt scared to talk to her.\r\nGene Hackman was cast to play Jack Crawford, the Agent-in-Charge of the Behavioral Science Unit of the FBI in Quantico, Virginia, but he found the script too violent. Scott Glenn was then cast in the role. In preparation for the role, Glenn met with John E. Douglas. Douglas gave Glenn a tour of the Quantico facility and also played for him an audio tape containing various recordings that serial killers Lawrence Bittaker and Roy Norris had made of themselves raping and torturing a 16-year-old girl. According to Douglas, Glenn wept as he listened to the recordings, and even changed his liberal stance on the death penalty.\r\nFilming\r\nPrincipal photography on The Silence of the Lambs began on November 15, 1989, and wrapped on March 1, 1990. Filming primarily took place in and around Pittsburgh, Pennsylvania, with some scenes shot in nearby northern West Virginia. The Victorian home in Perryopolis, Pennsylvania, used as Buffalo Bill's home in the film went up for sale in August 2015 for $300,000. The home sat on the market for nearly a year, before finally selling for $195,000. The exterior of the Western Center near Canonsburg, Pennsylvania, served as the setting for Baltimore State Hospital for the Criminally Insane. A scene set in the FBI Director's office was filmed in the office of United States Secretary of Labor Elizabeth Dole in Washington, D.C. In what was a rare act of cooperation at the time, the FBI allowed scenes to be filmed at the FBI Academy in Quantico; some FBI staff members even acted in bit parts.\r\nThe design for the basement and pit used by Buffalo Bill was inspired by the real-life kidnappings and murders performed by Gary M. Heidnik.\r\nMusic\r\nThe musical score for The Silence of the Lambs was composed by Howard Shore, who would also collaborate with Demme on Philadelphia. Recorded in Munich during the latter half of the summer of 1990, the score was performed by the Munich Symphony Orchestra. \"I tried to write in a way that goes right into the fabric of the movie,\" explained Shore on his approach. \"I tried to make the music just fit in. When you watch the movie you are not aware of the music. You get your feelings from all elements simultaneously, lighting, cinematography, costumes, acting, music. Jonathan Demme was very specific about the music.\" The music editor was Suzana Peric. A soundtrack album was released by MCA Records on February 5, 1991. Music from the film was later used in the trailers for its 2001 sequel, Hannibal.\r\nIn addition to Shore's score, recordings of popular music are used prominently in the film. This includes British post-punk music, such as the song \"Hip Priest\" by The Fall which can be heard playing during the climactic scene in which Starling enters Buffalo Bill's house. The song \"Goodbye Horses\" by Q Lazzarus became a cult hit after it was featured in an iconic scene with Buffalo Bill applying makeup and speaking to himself in the mirror.\r\nRelease\r\nBox office\r\nThe Silence of the Lambs was released on February 14, 1991, grossing almost $14 million from 1,497 theaters over the 4-day Presidents' Day weekend, placing at number one at the US box office. It remained at number one for five weeks.\r\nThe film opened at the Odeon Leicester Square in London in June 1991 and grossed £290,936 in its opening week, which distributor Rank claimed was a world record opening week from one theatre. The following week, it expanded to 281 screens and grossed £4,260,472 for the week, a UK record.\r\nThe film grossed $131 million in the United States and Canada with a total worldwide gross of $273 million. It was the fourth-highest grossing film of 1991 in North America and the fifth-highest-grossing film worldwide.\r\nCritical response\r\nThe Silence of the Lambs was a sleeper hit that gradually gained widespread success and critical acclaim. Foster, Hopkins, and Levine garnered much acclaim for their performances. Review aggregator Rotten Tomatoes reports that 95% of 149 film critics have given the film a positive review, with an average rating of 8.80/10. The website's critical consensus reads: \"Director Jonathan Demme's smart, taut thriller teeters on the edge between psychological study and all-out horror, and benefits greatly from stellar performances by Anthony Hopkins and Jodie Foster.\" Metacritic, another review aggregator, assigned the film a weighted average score of 85 out of 100, based on 19 reviews from mainstream critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.\r\nRoger Ebert of the Chicago Sun-Times, specifically mentioned the \"terrifying qualities\" of Hannibal Lecter. Ebert later added the film to his list of The Great Movies, recognizing the film as a \"horror masterpiece\" alongside such classics as Nosferatu, Psycho, and Halloween. However, the film is also notable for being one of two multi-Academy Award winners (the other being Unforgiven) to get a bad review from Ebert's colleague, Gene Siskel. Writing for Chicago Tribune, Siskel said, \"Foster's character, who is appealing, is dwarfed by the monsters she is after. I'd rather see her work on another case.\"\r\nAccolades\r\nThe film won the Big Five Academy Awards: Best Picture, Best Director (Demme), Best Actor (Hopkins), Best Actress (Foster), and Best Adapted Screenplay (Ted Tally), making it only the third film in history to accomplish that feat. It was also nominated for Best Sound (Tom Fleischman and Christopher Newman) and Best Film Editing, but lost to Terminator 2: Judgment Day and JFK, respectively.\r\nOther awards include Best Film by the National Board of Review of Motion Pictures, CHI Awards and PEO Awards. Demme won the Silver Bear for Best Director at the 41st Berlin International Film Festival and was nominated for the Golden Globe Award for Best Director. The film was nominated for the Grand Prix of the Belgian Film Critics Association. It was also nominated for the British Academy Film Award for Best Film. Screenwriter Ted Tally received an Edgar Award for Best Motion Picture Screenplay. The film was awarded Best Horror Film of the Year during the 2nd Horror Hall of Fame telecast, with Vincent Price presenting the award to the film's executive producer Gary Goetzman.\r\nIn 1998, the film was listed as one of the 100 greatest films in the past 100 years by the American Film Institute. In 2006, at the Key Art Awards, the original poster for The Silence of the Lambs was named best film poster \"of the past 35 years\". The Silence of the Lambs placed seventh on Bravo's The 100 Scariest Movie Moments for Lecter's escape scene. The American Film Institute named Hannibal Lecter (as portrayed by Hopkins) the number one film villain of all time and Clarice Starling (as portrayed by Foster) the sixth-greatest film hero of all time. In 2011, ABC aired a prime-time special, Best in Film: The Greatest Movies of Our Time, that counted down the best films chosen by fans based on results of a poll conducted by ABC and People magazine. The Silence of the Lambs was selected as the best suspense/thriller and Dr. Hannibal Lecter was selected as the fourth-greatest film character.\r\nThe film and its characters have appeared in the following AFI \"100 Years\" lists:\r\nAFI's 100 Years...100 Movies – #65\r\nAFI's 100 Years...100 Thrills – #5\r\nAFI's 100 Years...100 Heroes & Villains: Clarice Starling – #6 Hero Hannibal Lecter – #1 Villain Buffalo Bill - Nominated Villain\r\nClarice Starling – #6 Hero\r\nHannibal Lecter – #1 Villain\r\nBuffalo Bill - Nominated Villain\r\nAFI's 100 Years...100 Movie Quotes: \"A census taker once tried to test me. I ate his liver with some fava beans and a nice Chianti.\" – #21\r\n\"A census taker once tried to test me. I ate his liver with some fava beans and a nice Chianti.\" – #21\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) – #74\r\nIn 2015, Entertainment Weekly's 25th anniversary year, it included The Silence of the Lambs in its list of the 25 best movies made since the magazine's beginning.\r\nHome media\r\nThe film was released on VHS in October 1991 by Orion Home Video. It was the most rented video in the United States upon release. It was released on DVD on March 6, 2001 by MGM Home Entertainment in both Widescreen (1.85:1) and Full Screen (1.33:1) versions. The Criterion Collection, which had released the film on LaserDisc in 1994, released a DVD special edition in 1998, and later a Blu-Ray edition in 2018.\r\nSequels\r\nA sequel, Hannibal, was released in 2001, followed by two prequel films, Red Dragon (2002) and Hannibal Rising (2007) and a Hannibal TV series (2013-2015).\r\nLegacy\r\nAccording to The Guardian, before The Silence of the Lambs, serial killers in film had been \"claw-handed bogeymen with melty faces and rubber masks. By contrast, Lecter was highly intelligent with impeccable manners,\" and played by an actor with \"impeccable credentials\".\r\nWhen The Silence of the Lambs was re-released in the United Kingdom in 2017, the British Board of Film Classification reclassified it from an 18 to a 15 certificate. The film's co-producer Ed Saxon said audiences had become desensitized and that the film had become less shocking. However, the BBFC's Craig Lapper felt that audiences had instead become used to procedural crime dramas with serial killers as dramatic tropes, and suggested that The Silence of the Lambs had created interest in these themes.",
    "html": "<p>The Silence of the Lambs is a 1991 American psychological horror film directed by Jonathan Demme and written by Ted Tally, adapted from Thomas Harris's 1988 novel. It stars Jodie Foster as Clarice Starling, a young FBI trainee who is hunting a serial killer named \"Buffalo Bill\" (Ted Levine), who skins his female victims. To catch him, she seeks the advice of the imprisoned Dr. Hannibal Lecter (Anthony Hopkins), a brilliant psychiatrist and cannibalistic serial killer. The film also features performances from Scott Glenn, Anthony Heald, and Kasi Lemmons.</p><p>The Silence of the Lambs was released on February 14, 1991, and grossed $272.7 million worldwide on a $19 million budget, becoming the fifth-highest-grossing film of 1991 worldwide. It premiered at the 41st Berlin International Film Festival, where it competed for the Golden Bear, while Demme received the Silver Bear for Best Director. It became the third and most recent film (the other two being 1934's It Happened One Night and 1975's One Flew Over the Cuckoo's Nest) to win Academy Awards in all the major five categories: Best Picture, Best Director, Best Actor, Best Actress, and Best Adapted Screenplay. It is the only horror film to win Best Picture.</p><p>The Silence of the Lambs is regularly cited by critics, film directors, and audiences as one of the greatest and most influential films. In 2018, Empire ranked it 48th on their list of the 500 greatest movies of all time. The American Film Institute ranked it the fifth-greatest and most influential thriller film, while Starling and Lecter were ranked among the greatest film heroines and villains. The film is considered \"culturally, historically, or aesthetically\" significant by the U.S. Library of Congress and was selected for preservation in the National Film Registry in 2011. A sequel, Hannibal, was released in 2001, followed by two prequel films, Red Dragon (2002) and Hannibal Rising (2007).</p><br/><h3>Plot</h3><p>Clarice Starling, an FBI trainee, is pulled from her regimen at the Quantico FBI Academy by her boss, Jack Crawford. He assigns her to interview Hannibal Lecter, an incarcerated former psychiatrist and cannibalistic serial killer, on the pretense of persuading Lecter to answer a questionnaire about himself for the Bureau's psychological profiles, but secretly hoping to gain his insights about a psychopath serial killer nicknamed \"Buffalo Bill,\" who kills young women and removes their skin from their bodies.</p><p>At the Baltimore State Hospital for the Criminally Insane, Dr. Frederick Chilton escorts Starling to Lecter's cell. Although initially pleasant and courteous, Lecter grows impatient with Starling's interviewing and rebuffs her, deducing Crawford's true motive and refusing to help. As she is leaving, another prisoner, Miggs, flicks semen at her as he masturbates, angering Lecter. He calls Starling back and tells her to seek out an old patient of his, which leads her to a storage facility where she discovers a jar containing a man's severed head. She returns to Lecter, who says the man is linked to Buffalo Bill, and offers to profile the suspect on the condition that he is transferred away from Chilton, whom he detests. Meanwhile, another victim is found with a death's head moth lodged in her throat.</p><p>In Tennessee, Buffalo Bill abducts Catherine Martin, the daughter of a U.S. senator. Crawford authorizes Starling to offer Lecter a fake deal, promising a prison transfer if he provides information that helps them capture Buffalo Bill in time to rescue Catherine. Instead, Lecter demands a quid pro quo from Starling, offering clues in exchange for her personal information. Starling tells Lecter about her father's murder when she was a child. Chilton eavesdrops on their conversation and exposes Starling's deceit to Lecter before offering him a new deal. Lecter agrees and is flown to Memphis, where he meets Senator Martin, giving her accurate information on Buffalo Bill's appearance but falsely states his name is \"Louis Friend.\"</p><p>Starling figures out that the name is an anagram of \"iron sulfide\"—fool's gold. She visits Lecter, now imprisoned in a cell in Tennessee, and requests the truth. Lecter says all the information she needs is in the Buffalo Bill case file, then insists on continuing their quid pro quo. She recounts a traumatic childhood incident of hearing spring lambs being slaughtered. Lecter speculates that Starling hopes that saving Catherine will end the recurring nightmares she has of lambs screaming, and gains satisfaction from this shared revelation. Lecter returns the case files to Starling as Chilton arrives and has the police escort her out. Later that evening, Lecter kills his guards, escapes from his cell, and disappears.</p><p>Starling analyzes Lecter's file annotations and figures out that Buffalo Bill knew his first victim, Frederika Bimmel. Starling travels to Bimmel's Ohio hometown and discovers that she and Buffalo Bill were both tailors. At Bimmel's home, Starling finds dress patterns identical to the patches of skin removed from the victim and phones Crawford to tell him that Buffalo Bill is making a \"suit\" with human skin. Crawford is already en route to make an arrest, having cross-referenced Lecter's notes with hospital archives and finding a man named Jame Gumb, who believes he is transsexual but was deemed too violent to apply for a sex-change operation. Crawford and an FBI Hostage Rescue Team storm Gumb's address in Illinois, finding the house empty. Meanwhile, Starling follows a lead from one of Bimmel's friends, which takes her to the house of one of her former clients. At the house, she meets \"Jack Gordon,\" but realizes he is Gumb after spotting a death's head moth flying loose. She pursues him into a cavernous basement and finds Catherine trapped in a dry well. In a dark room, Gumb stalks Starling with night-vision goggles, but reveals himself by cocking his revolver. Starling reacts quickly and shoots Gumb dead.</p><p>At the FBI Academy graduation party, Starling receives a phone call from Lecter, who is at a Bimini airport. He assures her that he has no intention of pursuing her and requests that she return the favor, which she says she cannot. Lecter subsequently hangs up the phone because he is \"having an old friend for dinner\". He trails a newly-arrived Chilton into the crowd.</p><br/><h3>Cast</h3><ul><li>Jodie Foster as Clarice Starling Masha Skorobogatov as young Clarice</li><li>Masha Skorobogatov as young Clarice</li><li>Anthony Hopkins as Dr. Hannibal Lecter</li><li>Scott Glenn as Jack Crawford</li><li>Ted Levine as Jame \"Buffalo Bill\" Gumb</li><li>Anthony Heald as Dr. Frederick Chilton</li><li>Brooke Smith as Catherine Martin</li><li>Diane Baker as U.S. Senator Ruth Martin</li><li>Kasi Lemmons as Ardelia Mapp</li><li>Frankie Faison as Barney Matthews</li><li>Tracey Walter as Lamar</li><li>Charles Napier as Lt. Bill Boyle</li><li>Stuart Rudin as Miggs</li><li>Danny Darst as Sgt. Tate</li><li>Alex Coleman as Sgt. Jim Pembry</li><li>Dan Butler as Roden</li><li>Paul Lazar as Pilcher</li><li>Ron Vawter as Paul Krendler</li><li>Roger Corman as FBI Director Hayden Burke</li><li>George A. Romero as a jailer</li><li>Chris Isaak as SWAT Commander</li><li>Harry Northup as Mr. Bimmel</li><li>Brent Hinkley as Officer Murray</li><li>Cynthia Ettinger as Officer Jacobs</li><li>Lauren Roselli as Stacy Hubka</li><li>Daniel Von Bargen as SWAT Negotiator</li><li>Darla as the dog, Precious</li></ul><br/><h3>Analysis</h3><p>In the years following its release, The Silence of the Lambs was subject to much film criticism regarding its themes of human sexuality and sexual politics. Throughout the film, Clarice Starling's gender is emphasized as a distinguishing feature, as she is a minority amongst her numerous male peers, though film scholar Barry Forshaw notes that \"any feminist agenda is never bluntly formulated verbally.\"</p><p>Some gay male critics and feminists felt that the film's portrayal of Buffalo Bill negatively associated the LGBT community with deviance, psychopathy, and violence. Despite this, Bill's sexual orientation is never explicitly stated in the film, and Lecter expressly states Bill is \"not really transsexual.\" Demme responded that Buffalo Bill \"wasn't a gay character. He was a tormented man who hated himself and wished he was a woman because that would have made him as far away from himself as he possibly could be.\" Demme added that he \"came to realize that there is a tremendous absence of positive gay characters in movies\".</p><p>In a 1992 interview with Playboy magazine, the feminist and women's rights advocate Betty Friedan stated: \"I thought it was absolutely outrageous that The Silence of the Lambs won four Oscars. I'm not saying that the movie shouldn't have been shown. I'm not denying the movie was an artistic triumph, but it was about the evisceration, the skinning alive of women. That is what I find offensive. Not the Playboy centerfold.\"</p><br/><h3>Production</h3><h4>Development</h4><p>The Silence of the Lambs is based on the 1988 novel by Thomas Harris. It was the second film to feature the character Hannibal Lecter; the first, Manhunter (1986), was also adapted from a Harris novel. Prior to the release of the Silence of the Lambs novel, Orion Pictures partnered with Gene Hackman to adapt it for film. With Hackman set to direct and possibly star in as FBI agent Jack Crawford, negotiations were made to split the $500,000 cost of rights between Hackman and the studio. The producers also had to acquire the rights to the Lecter character, which were owned by Manhunter producer Dino De Laurentiis. Owing to the financial failure of Manhunter, De Laurentiis lent the rights to Orion for free.</p><p>In November 1987, Ted Tally was brought on to write the adaptation; Tally had crossed paths with Harris many times, with his interest in adapting The Silence of the Lambs originating from receiving an advance copy of the book from Harris. When Tally was about halfway through with the first draft, Hackman withdrew from the project and financing fell through. However, Orion co-founder Mike Medavoy encouraged Tally to keep writing as the studio took care of financing and searched for a replacement director. Orion sought director Jonathan Demme to helm the project. With the screenplay not yet completed, Demme signed on after reading the novel. From there, the project developed quickly; Tally said: \" read my first draft not long after it was finished, and we met. Then I was just startled by the speed of things. We met in May 1989 and were shooting in November. I don't remember any big revisions.\"</p><h4>Casting</h4><p>Jodie Foster was interested in playing FBI agent Clarice Starling immediately after reading the novel. However, despite having just won an Academy Award for her performance in The Accused (1988), Demme was not initially convinced that she was right for the role. Having just collaborated on Married to the Mob (1988), Demme's first choice for the role of Starling was Michelle Pfeiffer, who turned it down, later saying, \"It was a difficult decision, but I got nervous about the subject matter.\" He then approached Meg Ryan, who also turned it down for its gruesome themes. The studio was skeptical about Laura Dern as a bankable choice, so Foster was ultimately awarded the role due to her passion for the character.</p><p>For the role of Lecter, Demme originally approached Sean Connery. After Connery turned it down, Anthony Hopkins was offered the role based on his performance in The Elephant Man (1980). When Hopkins's agent told him that a script was on his way titled The Silence of the Lambs, Hopkins responded, \"Is it a children's story?\" Hopkins called his agent back after reading the first 10 pages and said, \"This is the best part I've ever read.\" He accepted the role after having dinner with Demme.</p><p>Other actors considered for the role included Al Pacino, Robert De Niro, Dustin Hoffman, Derek Jacobi and Daniel Day-Lewis. Forest Whitaker has stated that he also auditioned for the role. The mask Hopkins wore became an iconic symbol of the film. It was created by Ed Cubberly, of Frenchtown, New Jersey, who had made masks for NHL goalkeepers.</p><p>Hopkins developed his portrayal of Lecter by drawing inspiration from the HAL 9000 computer as voiced by Douglas Rain in 2001: A Space Odyssey, as well as the vocal patterns of writer Truman Capote. In a 2001 interview with GQ, Hopkins clarified that he did not base Lecter's vocal cadence on Katharine Hepburn, as some people had believed. He also revealed that the decision to play Lecter as still and unblinking was not influenced by Charles Manson, as some had speculated. Hopkins admitted to being intimidated by Foster, who had just won an Academy Award, and initially felt scared to talk to her.</p><p>Gene Hackman was cast to play Jack Crawford, the Agent-in-Charge of the Behavioral Science Unit of the FBI in Quantico, Virginia, but he found the script too violent. Scott Glenn was then cast in the role. In preparation for the role, Glenn met with John E. Douglas. Douglas gave Glenn a tour of the Quantico facility and also played for him an audio tape containing various recordings that serial killers Lawrence Bittaker and Roy Norris had made of themselves raping and torturing a 16-year-old girl. According to Douglas, Glenn wept as he listened to the recordings, and even changed his liberal stance on the death penalty.</p><h4>Filming</h4><p>Principal photography on The Silence of the Lambs began on November 15, 1989, and wrapped on March 1, 1990. Filming primarily took place in and around Pittsburgh, Pennsylvania, with some scenes shot in nearby northern West Virginia. The Victorian home in Perryopolis, Pennsylvania, used as Buffalo Bill's home in the film went up for sale in August 2015 for $300,000. The home sat on the market for nearly a year, before finally selling for $195,000. The exterior of the Western Center near Canonsburg, Pennsylvania, served as the setting for Baltimore State Hospital for the Criminally Insane. A scene set in the FBI Director's office was filmed in the office of United States Secretary of Labor Elizabeth Dole in Washington, D.C. In what was a rare act of cooperation at the time, the FBI allowed scenes to be filmed at the FBI Academy in Quantico; some FBI staff members even acted in bit parts.</p><p>The design for the basement and pit used by Buffalo Bill was inspired by the real-life kidnappings and murders performed by Gary M. Heidnik.</p><h4>Music</h4><p>The musical score for The Silence of the Lambs was composed by Howard Shore, who would also collaborate with Demme on Philadelphia. Recorded in Munich during the latter half of the summer of 1990, the score was performed by the Munich Symphony Orchestra. \"I tried to write in a way that goes right into the fabric of the movie,\" explained Shore on his approach. \"I tried to make the music just fit in. When you watch the movie you are not aware of the music. You get your feelings from all elements simultaneously, lighting, cinematography, costumes, acting, music. Jonathan Demme was very specific about the music.\" The music editor was Suzana Peric. A soundtrack album was released by MCA Records on February 5, 1991. Music from the film was later used in the trailers for its 2001 sequel, Hannibal.</p><p>In addition to Shore's score, recordings of popular music are used prominently in the film. This includes British post-punk music, such as the song \"Hip Priest\" by The Fall which can be heard playing during the climactic scene in which Starling enters Buffalo Bill's house. The song \"Goodbye Horses\" by Q Lazzarus became a cult hit after it was featured in an iconic scene with Buffalo Bill applying makeup and speaking to himself in the mirror.</p><br/><h3>Release</h3><h4>Box office</h4><p>The Silence of the Lambs was released on February 14, 1991, grossing almost $14 million from 1,497 theaters over the 4-day Presidents' Day weekend, placing at number one at the US box office. It remained at number one for five weeks.</p><p>The film opened at the Odeon Leicester Square in London in June 1991 and grossed £290,936 in its opening week, which distributor Rank claimed was a world record opening week from one theatre. The following week, it expanded to 281 screens and grossed £4,260,472 for the week, a UK record.</p><p>The film grossed $131 million in the United States and Canada with a total worldwide gross of $273 million. It was the fourth-highest grossing film of 1991 in North America and the fifth-highest-grossing film worldwide.</p><h4>Critical response</h4><p>The Silence of the Lambs was a sleeper hit that gradually gained widespread success and critical acclaim. Foster, Hopkins, and Levine garnered much acclaim for their performances. Review aggregator Rotten Tomatoes reports that 95% of 149 film critics have given the film a positive review, with an average rating of 8.80/10. The website's critical consensus reads: \"Director Jonathan Demme's smart, taut thriller teeters on the edge between psychological study and all-out horror, and benefits greatly from stellar performances by Anthony Hopkins and Jodie Foster.\" Metacritic, another review aggregator, assigned the film a weighted average score of 85 out of 100, based on 19 reviews from mainstream critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.</p><p>Roger Ebert of the Chicago Sun-Times, specifically mentioned the \"terrifying qualities\" of Hannibal Lecter. Ebert later added the film to his list of The Great Movies, recognizing the film as a \"horror masterpiece\" alongside such classics as Nosferatu, Psycho, and Halloween. However, the film is also notable for being one of two multi-Academy Award winners (the other being Unforgiven) to get a bad review from Ebert's colleague, Gene Siskel. Writing for Chicago Tribune, Siskel said, \"Foster's character, who is appealing, is dwarfed by the monsters she is after. I'd rather see her work on another case.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"2\">Academy Awards record</th></tr><tr><td><b>Best Picture</b>, <span>Edward Saxon</span>, Kenneth Utt, Ronald M. Bozman</td></tr><tr><td><b>Best Director</b>, <span>Jonathan Demme</span></td></tr><tr><td><b>Best Actor</b>, <span>Anthony Hopkins</span></td></tr><tr><td><b>Best Actress</b>, <span>Jodie Foster</span></td></tr><tr><td><b>Best Adapted Screenplay</b>, <span>Ted Tally</span></td></tr><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"2\">Golden Globe Awards record</th></tr><tr><td><b>Best Actress</b>, Jodie Foster</td></tr><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"2\">British Academy Film Awards record</th></tr><tr><td><b>Best Actor</b>, Anthony Hopkins</td></tr><tr><td><b>Best Actress</b>, Jodie Foster</td></tr></tbody></table><p>The film won the Big Five Academy Awards: Best Picture, Best Director (Demme), Best Actor (Hopkins), Best Actress (Foster), and Best Adapted Screenplay (Ted Tally), making it only the third film in history to accomplish that feat. It was also nominated for Best Sound (Tom Fleischman and Christopher Newman) and Best Film Editing, but lost to Terminator 2: Judgment Day and JFK, respectively.</p><p>Other awards include Best Film by the National Board of Review of Motion Pictures, CHI Awards and PEO Awards. Demme won the Silver Bear for Best Director at the 41st Berlin International Film Festival and was nominated for the Golden Globe Award for Best Director. The film was nominated for the Grand Prix of the Belgian Film Critics Association. It was also nominated for the British Academy Film Award for Best Film. Screenwriter Ted Tally received an Edgar Award for Best Motion Picture Screenplay. The film was awarded Best Horror Film of the Year during the 2nd Horror Hall of Fame telecast, with Vincent Price presenting the award to the film's executive producer Gary Goetzman.</p><p>In 1998, the film was listed as one of the 100 greatest films in the past 100 years by the American Film Institute. In 2006, at the Key Art Awards, the original poster for The Silence of the Lambs was named best film poster \"of the past 35 years\". The Silence of the Lambs placed seventh on Bravo's The 100 Scariest Movie Moments for Lecter's escape scene. The American Film Institute named Hannibal Lecter (as portrayed by Hopkins) the number one film villain of all time and Clarice Starling (as portrayed by Foster) the sixth-greatest film hero of all time. In 2011, ABC aired a prime-time special, Best in Film: The Greatest Movies of Our Time, that counted down the best films chosen by fans based on results of a poll conducted by ABC and People magazine. The Silence of the Lambs was selected as the best suspense/thriller and Dr. Hannibal Lecter was selected as the fourth-greatest film character.</p><p>The film and its characters have appeared in the following AFI \"100 Years\" lists:</p><ul><li>AFI's 100 Years...100 Movies – #65</li><li>AFI's 100 Years...100 Thrills – #5</li><li>AFI's 100 Years...100 Heroes & Villains: Clarice Starling – #6 Hero Hannibal Lecter – #1 Villain Buffalo Bill - Nominated Villain</li><li>Clarice Starling – #6 Hero</li><li>Hannibal Lecter – #1 Villain</li><li>Buffalo Bill - Nominated Villain</li><li>AFI's 100 Years...100 Movie Quotes: \"A census taker once tried to test me. I ate his liver with some fava beans and a nice Chianti.\" – #21</li><li>\"A census taker once tried to test me. I ate his liver with some fava beans and a nice Chianti.\" – #21</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) – #74</li></ul><p>In 2015, Entertainment Weekly's 25th anniversary year, it included The Silence of the Lambs in its list of the 25 best movies made since the magazine's beginning.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Organization</th><th scope=\"col\">Award</th><th scope=\"col\">Nominee</th><th scope=\"col\">Result</th><th scope=\"col\">Ref.</th></tr><tr><th scope=\"row\" rowspan=\"7\"><span>1991</span></th><th scope=\"row\" rowspan=\"7\"><span>Academy Awards</span></th><td><span>Best Picture</span></td><td><span>Edward Saxon</span>, <span>Kenneth Utt</span>, <span>Ron Bozman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td><span>Best Director</span></td><td><span>Jonathan Demme</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Anthony Hopkins</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress</span></td><td><span>Jodie Foster</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td><span>Ted Tally</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Craig McKay</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Sound</span></td><td><span>Tom Fleischman</span>, <span>Christopher Newman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"5\"><span>1991</span></th><th scope=\"row\" rowspan=\"5\"><span>Golden Globe Awards</span></th><td><span>Best Actress in a Motion Picture – Drama</span></td><td><span>Jodie Foster</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\"></td></tr><tr><td><span>Best Actor – Motion Picture Drama</span></td><td><span>Anthony Hopkins</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td><span>Jonathan Demme</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Motion Picture – Drama</span></td><td><span>Kenneth Utt</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td><span>Ted Tally</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"9\"><span>1991</span></th><th scope=\"row\" rowspan=\"9\"><span>British Academy Film Awards</span></th><td><span>Best Actor in a Leading Role</span></td><td><span>Anthony Hopkins</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"9\"></td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td><span>Jodie Foster</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td><span>Ted Tally</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Tak Fujimoto</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Direction</span></td><td><span>Jonathan Demme</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td><span>Craig McKay</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film</span></td><td><span>Ron Bozman</span>, <span>Edward Saxon</span>, <span>Kenneth Utt</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Film Music</span></td><td><span>Howard Shore</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Skip Lievsay</span>, <span>Christopher Newman</span>, <span>Tom Fleischman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>Home media</h4><p>The film was released on VHS in October 1991 by Orion Home Video. It was the most rented video in the United States upon release. It was released on DVD on March 6, 2001 by MGM Home Entertainment in both Widescreen (1.85:1) and Full Screen (1.33:1) versions. The Criterion Collection, which had released the film on LaserDisc in 1994, released a DVD special edition in 1998, and later a Blu-Ray edition in 2018.</p><br/><h3>Sequels</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs expansion</b>. You can help by <span class=\"external text\">adding to it</span>.  <span class=\"date-container\"><i>(<span class=\"date\">March 2023</span>)</i></span></div></td></tr></tbody></table><p>A sequel, Hannibal, was released in 2001, followed by two prequel films, Red Dragon (2002) and Hannibal Rising (2007) and a Hannibal TV series (2013-2015).</p><br/><h3>Legacy</h3><p>According to The Guardian, before The Silence of the Lambs, serial killers in film had been \"claw-handed bogeymen with melty faces and rubber masks. By contrast, Lecter was highly intelligent with impeccable manners,\" and played by an actor with \"impeccable credentials\".</p><p>When The Silence of the Lambs was re-released in the United Kingdom in 2017, the British Board of Film Classification reclassified it from an 18 to a 15 certificate. The film's co-producer Ed Saxon said audiences had become desensitized and that the film had become less shocking. However, the BBFC's Craig Lapper felt that audiences had instead become used to procedural crime dramas with serial killers as dramatic tropes, and suggested that The Silence of the Lambs had created interest in these themes.</p><br/>"
  },
  "errorMessage": ""
}