{
  "imDbId": "tt0071562",
  "title": "The Godfather Part II",
  "fullTitle": "The Godfather Part II (1974)",
  "type": "Movie",
  "year": "1974",
  "items": [
    {
      "publisher": "Empire",
      "author": "Kim Newman",
      "link": "",
      "rate": "100",
      "content": "And with supporting roles from the likes of Diane Keaton, Robert Duvall and Lee Strasberg, to say nothing of Roger Corman and Harry Dean Stanton in bit parts, this is nothing short of magisterial."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "As the beginning of Part II echoes the opening of \"The Godfather,\" so too does the end. Because of the manner in which circumstances are handled and considering the people involved, the impact here is more forceful. The tragic flaw has accomplished its poisonous, inevitable designs. Coppola punctuates both movies with a gut-twisting exclamation point."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/?MI=28618",
      "rate": "100",
      "content": "Cinematographer Willis superbly captures the turn-of-the-century period, applying a seriographic tint to flashback scenes for a softer, richer look than the sharp image of the ongoing contemporary story."
    },
    {
      "publisher": "Time Out London",
      "author": "Tom Huddleston",
      "link": "",
      "rate": "100",
      "content": "This is quite simply one of the saddest movies ever made, a tale of loss, grief and absolute loneliness, an unflinching stare into the darkest moral abyss."
    },
    {
      "publisher": "Total Film",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "The plotting is elliptical and the sweep intoxicates, but the contrast between De Niro’s meditative Vito and Pacino’s soul-starved eyes brings piercing focus to Coppola’s resonating study of corrupting power."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1974/film/reviews/the-godfather-part-ii-3-1200423302/",
      "rate": "90",
      "content": "Al Pacino again is outstanding as Michael Corleone, successor to crime family leadership."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/godfather-part-ii-thrs-1974-757543/",
      "rate": "90",
      "content": "It is neither a very happy or driving picture. But it is intellectually daring and marks an important breakthrough in the growing up of the Hollywood film."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "75",
      "content": "Coppola is unable to draw all this together and make it work on the level of simple, absorbing narrative. The stunning text of \"The Godfather\" is replaced in Part II with prologues, epilogues, footnotes, and good intentions."
    },
    {
      "publisher": "Chicago Reader",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Three hours and 20 minutes of Al Pacino suffering openly, Robert Duvall suffering silently, Diane Keaton suffering noisily, and (every so often) Robert De Niro suffering good-naturedly is almost too much, but Francis Ford Coppola pulls it off in grand style."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "40",
      "content": "The only remarkable thing about Francis Ford Coppola's The Godfather, Part II is the insistent manner in which it recalls how much better his original film was...Even if Part II were a lot more cohesive, revealing, and exciting than it is, it probably would have run the risk of appearing to be the self-parody it now seems."
    }
  ],
  "errorMessage": ""
}