{
  "imDbId": "tt0071562",
  "title": "The Godfather Part II",
  "fullTitle": "The Godfather Part II (1974)",
  "type": "Movie",
  "year": "1974",
  "items": [
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0135607",
      "warningSpoilers": true,
      "date": "10 March 2001",
      "rate": "10",
      "helpful": "250 out of 294 found this helpful.",
      "title": "Breathtaking in its scope and tragic grandeur...",
      "content": "Coppola's masterpiece is rivaled only by \"The Godfather, Part II\" in which the 1940s setting of the first movie is extended backwards and forwards to reveal the corrupting effect of power...The film, breathtaking in its scope and tragic grandeur, shows two parallel stories extending two different time periods: the early career of young Vito Corleone seen first around the turn of the 20th century in Sicily, and then in 1917, building his criminal underworld in the Italian ghettos of New York City, post World War I, plus that of his son, Michael (Al Pacino) desperately trying to keep his family together...Al Pacino's performance is quiet and solemn... He is cold and ruthless, with a whole contrast from the idealistic innocent war hero we initially met at the beginning of the first film... Here he's a calculating and frightening force, seeking to expand casinos into Pre-Revolutionary Cuba and consolidating an empire surrounded by perfidy and treason, maintaining total confidence in his ability to control the situation whether testifying before enraging Senators or trying to outface his worst enemies...The film's haunting final shot of a lonely, isolated paranoid Michael in his empty compound, is an unforgettable movie scene, a tragic portrait of a lonely and fully damned person, emotionally empty and finished, far from a waspish wife, more distant from a faithful lawyer...De Niro's rise, from an orphan child by a family feud back in Italy to a hood in New York and his position as a respected Don, provides a welcome break from Pacino's relentless attitude... Since the people he kills seem to deserve it, Vito comes off better than Michael does, and it was wise of Coppola to shuffle the two stories together despite lengthy flashbacks and the disturbance of continuity...The entire cast contributes greatly to the success of the film: Lee Strasberg, a fascinating mixture of lust and ruthlessness; G. D. Spradlin, absolutely right as the sinister and corrupt Nevada Senator; Michael V. Gazzo, unforgettable as the troubled gray-haired informer; Gastone Moschin, excellent as the blackmailer in white suit; John Cazale, marvelously timid as the vague, confused, and hesitant Fredo; Diane Keaton, clearly irrational as the long-suffering wife Kay; Talia Shire, too extravagant as the lousy mother; Troy Donahue too ambitious as the fortune-hunting suitor; and Robert Duvall excels as the confidant, and retainer to the all-powerful Corleone family...Coppola's motion picture is not just a mere supply with new characters and events from the original, it's a far more complex and intimate movie than its predecessor... It is not really a sequel... It's just more... It cleverly shifts in time between two distinct narratives with extreme realistic violence and criminal mentality of gangsters..."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0135487",
      "warningSpoilers": true,
      "date": "13 October 2001",
      "rate": "",
      "helpful": "115 out of 142 found this helpful.",
      "title": "The Greatest Sequel During the Cinema's History",
      "content": "\"The Godfather, Part II\" is excellent just like its predecessor. While the first is arguably the greatest film ever made, the second installment is easily the best sequel produced hands down. The film is split between the stories of Michael Corleone (Al Pacino, Oscar-nominated) and a young Vito Corleone (Robert De Niro, in his star-making, first Oscar-winning performance). In the 1950s, Michael is trying to expand his crime empire to locales such as Las Vegas, Hollywood, and even turbulent Cuba. However, there are numerous problems as older brother Fredo (John Cazale) may have double-crossed the family. Also two prominent crime bosses pose a considerable threat as well (Lee Strasberg and Michael V. Gazzo, both Oscar-nominated). Younger sister Connie (Oscar nominee Talia Shire) is still reeling from her husband's murder and her father's death at the conclusion of the original film. Michael is also distancing himself from his wife (Diane Keaton) and some of his most trusted friends (Robert Duvall). While all this is occurring we get glimpses into the early life of Michael's father (De Niro). We learn that his parents and older brother have been killed in early-1900s Sicily and that he has immigrated to New York. Vito pays his dues and learns the tricks of the trade, buying his time, before deciding to create his own small empire which would of course grow and become what we saw in the original. It would seem that the film would be confusing by jumping back and forth between Michael and his father, but that is not so. Coppola gives you just enough information to keep the audience intrigued through each segment. The film is very well-made and runs very smoothly even though it lasts over 200 minutes. Many think that this installment is the best of the series. Even though I still think that the original is the best, I cannot totally disagree with this assertion as this is the definitive sequel. 5 stars out of 5."
    },
    {
      "username": "umunir-36959",
      "userUrl": "https://www.imdb.com/user/ur92260614",
      "reviewLink": "https://www.imdb.com/review/rw5049900",
      "warningSpoilers": false,
      "date": "9 August 2019",
      "rate": "10",
      "helpful": "119 out of 135 found this helpful.",
      "title": "A masterpiece that can never be beaten...",
      "content": "One of the all time greats. Or probably the alone greatest thing ever made in the history of cinematography. This movie is both \"prequel\" and \"sequel\" of the first godfather movie. I have never watched anything like this in my entire life. This movie has explained the life of underworld people in a great way. It also shows how vengeance eradicates happiness from your life. People don't even care about their family in greed of power. It's a masterpiece that can never be written off even after centuries. Even if you are not into these kind of movies, I will suggest to watch it for atleast once in your life or you'll be deprived of one of the greatest things to watch that have been ever made."
    },
    {
      "username": "DanB-4",
      "userUrl": "https://www.imdb.com/user/ur0200644",
      "reviewLink": "https://www.imdb.com/review/rw0135526",
      "warningSpoilers": false,
      "date": "7 May 1999",
      "rate": "10",
      "helpful": "507 out of 617 found this helpful.",
      "title": "The Greatest Film Ever Made",
      "content": "The original Godfather is a brilliant work. It is in a sense a voyeuristic delight, allowing us to see the mafia from the inside - we become part of the family. It single-handedly change the world's view of organized crime, and created a cast of sympathetic characters, none of whom have a shred of common morality. It was the highest grossing movie of its time and Brando created a cultural icon whose influence resonates as strong today as it did in 1972.As extraordinary an achievement as this is, Part II is even better. It easily receives my nod as the best picture ever made. I have seen it at least 20 times, and each time its 200 minutes fly by.The movie uses flashbacks to brilliantly weave two tales. The main story is the reign of Michael Corleone as the world's most powerful criminal. Now reaping the benefits of legalized gambling in Las Vegas, Michael is an evident billionaire with an iron fist on a world of treachery. Behind this, Director Francis Ford Coppola spins the tale of the rise of Michael's father, Vito, to the center of the New York mafia. It is these scenes that make the film a work of art. Without spoiling, I will simply say the Robert DeNiro as the young Vito is the best acting performance of all time, a role for which he won a richly deserved Oscar.The screenplay is full of delicious little underworld nuggets (\"Keep your friends close .....\", \"I don't want to kill everyone, just my enemies\"), while it blows a dense, twisted plot past you at a dizzying and merciless pace. The cinematography is depressing and atmospheric. The score continues in the eerie role of its predecessor, foretelling death and evil.All of this makes the movie great and infinitely watchable. But it's what's deeper inside this film ... what it is really about ... that is its true genius.The Godfather Part II is not really a movie about the mafia, it is a movie about a man's life long struggle. Michael controls a vast empire that is constantly slipping out of his hands. He grows increasingly distrustful and paranoid, and even shows signs that he hates his own life. Michael almost seems to resent the fact that he is a natural born crime lord, a man who puts the family business ahead of everything.The great Don Michael Corleone can never come to terms with one simple fact.... his father's empire was built on love and respect, Michael's empire is built on fear and violent treachery.See this movie. It's three-and-a-half hours very well spent."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5505352",
      "warningSpoilers": false,
      "date": "23 February 2020",
      "rate": "",
      "helpful": "62 out of 74 found this helpful.",
      "title": "Best gangster dramas of all time arguably",
      "content": "\"The Godfather: Part II\" is a very suspenseful drama with a very exciting story, with great acting and great special effects. I would definitely recommend you watch this movie...but first watch the original classic from 1972 \"The Godfather\" . The movie may not be as good as the first movie but is still an amazing sequel."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0135692",
      "warningSpoilers": true,
      "date": "23 August 2003",
      "rate": "10",
      "helpful": "108 out of 137 found this helpful.",
      "title": "Terrific continuation of the \"Godfather\" series; to call it a \"sequel\" almost seems insulting...",
      "content": "This sequel is just as terrific as the first film, if not more so. I hesitate to call it a sequel, as \"sequel\" is quite simply the wrong word I am looking for. A film like \"The Matrix Reloaded\" is a sequel - \"The Godfather Part II\" is something more. It's just too good to be called a sequel.The film won six Oscars in 1974, including Best Picture and Best Supporting Actor (Robert De Niro). It deserved every one. It involves the viewer from the start and never lets up. Particular aspects I enjoy in this film are the flashbacks to Don Vito Corleone as a child immigrating to New York City after social problems in his homeland, Sicily. I like the intertwining of Michael Corleone (Al Pacino), his son, in present day, dealing with his crime inheritance, and Vito (Robert De Niro), his father, years ago. I like how, as Michael comes to terms with his family legacy, the film shows us Vito coming to terms with his future. The day he shoots that man in a gritty apartment complex is a turning point in his life. Every actor is in top form here. Al Pacino has gradually made the move from a man who denies his future to a man who is accepting it. His character is the spotlight of this film, much more so than in the first film (though both center around his decisions).Robert De Niro is particularly wonderful and convincing as a young Vito Corleone, who was of course played by the constantly-spoofed Marlon Brando in the original. De Niro takes an iron grip on his character and completely engulfs himself; this was, in 1974, the sign of an actor who would go places. Indeed, he did.Coppola's magical sense of direction is at work here, as is the script by Coppola and Mario Puzo (whose novels the series is based upon). The original was a wonderful film, but the sequel presents more of a challenge. Flashbacks are often intercut in the middle of other films are awkward times, but in \"The Godfather Part II,\" Coppola uses them at precisely the right moments, managing to careen in and out of scenes and time periods with free abandon.It takes a great kind of skill to master something like this, much less a sequel to one of the most beloved films of all time. \"The Godfather\" was an instant classic upon its release in 1972. Coppola had two years to plan for his continuation of the film. People told him it wouldn't work, he would never beat the original, and he would never pull it off. But he showed them all. \"The Godfather Part II\" may well be the best sequel I have ever seen in my entire lifetime. I wish they were all this good. To call it a \"sequel\" almost seems insulting."
    },
    {
      "username": "jzappa",
      "userUrl": "https://www.imdb.com/user/ur8625456",
      "reviewLink": "https://www.imdb.com/review/rw2027120",
      "warningSpoilers": false,
      "date": "22 February 2009",
      "rate": "10",
      "helpful": "33 out of 40 found this helpful.",
      "title": "\"Michael, I Never Wanted This For You.\"",
      "content": "Nino Rota's musical score plays an even greater role in this equal but different successor than it did in the predecessor. Yearning, lamenting, stimulating bygone ages, see how infectiously Nino Rota's music affects our sentiments for the savage events on screen. It is the pulse of the films. One cannot imagine them without their Nino Rota music. Against all our realistic deduction, it guides us to how to feel about the films, and condition us to understand the characters within their own world. Throughout the Corleone family's many criminal actions, we understand that one doesn't have to be a monster in order to live with having done them.In what is both a dual expansion of its predecessor and a masterpiece of juxtaposition in itself, we see Michael Corleone forfeit his remaining shreds of morality and become an empty shell, insecure and merciless. As his father quietly knew in his latter days would be so, Michael has lost sight of those values that made Don Corleone better than he had to be and has become a new godfather every bit as evil as he has to be. The score, with its tonal harmony, its honeyed and emotional aesthetics, is sad, and music can often evoke emotion more surely and subtly than story. Consider several operas with ridiculous stories and lyrics yet contain arias that literally move us to tears.The devolution of Michael Corleone is adjacent with flashbacks to the youth and young manhood of his father, Vito, played with paternal, home-loving subtlety by Robert De Niro. These scenes, in Sicily and old New York at the turn of the century, follow the conventional pattern of a young man on the rise and show the Mafia code being burned into the Corleone blood. No false romanticism conceals the necessity of murder to do business. We don't look at Vito as a victim of his environment, but a product of the depiction of the resorts to which the Italian culture had turned, initially to both protect their homeland and protect their livelihood as immigrants who came to America to be paid less than the blacks.The film opens in 1901 Corleone, Sicily, at the funeral procession for young Vito's father, who had been killed by the local Mafia chieftain, Don Ciccio, over an insult. During the procession, Vito's older brother is also murdered because he swore to avenge his father. Vito's mother goes to Ciccio to beg for the life of young Vito. When he refuses, she sacrifices herself to allow Vito to escape. They scour the town for him, warning the sleeping townsfolk against harboring the boy. With the aid of a few of the townspeople, Vito finds his way by ship to Ellis Island, where an immigration agent, mishearing Vito's hometown of Corleone as his name, registers him as Vito Corleone. From this very opening, and the events that gradually follow, we see that Vito's damnable early experiences have enhanced his sense of family, and his experience of revenge as a necessity was passed on to Vito's sons.The life of young Vito helps to explain the forming of the adult Don Corleone. As his unplanned successor Michael, his youngest child, transforms, we hark back to why, when his true desire is to make the Corleone family completely legitimate, he feels that he must play the game by its old rules. His wife says, \"You once told me: 'In five years, the Corleone family will be completely legitimate.' That was seven years ago.\" What we have are two all-too-real narratives, two superb lead performances and lasting images. There is even a parallel between two elderly dons: Revenge must be had.I admire the way Coppola and Puzo require us to think along with Michael as he feels out fragile deliberations involving Miami boss Hyman Roth, his older brother Fredo, and the death of Sonny in the previous film. Who is against him? Why? Michael drifts several explanations past several key players, misleading them all, or nearly. It's like a game of blindfolded chess. He has to envision the moves without seeing them. Coppola shows Michael breaking under the burden. We recall that he was a war hero, a successful college student, forging an honest life. Ultimately Michael has no one by whom to swear but his aging mother. Michael's desolation in that scene of dialogue informs the film's closing shot.So this six-time Oscar-winning three-and-a-half-hour gangster epic is ultimately a dreary experience, a mourning for what could've been. It is a contrast with the earlier film, in which Don Corleone is seen defending old values against modern hungers. Young Vito was a murderer, too, as we more fully understand in the Sicily and New York scenes of Part II. But he was wise and diplomatic. Murder was personal. As Hyman Roth says, \"It had nothing to do with business.\" The crucial difference between the father and son is that Vito is cognizant of and comprehending the needs, feelings, problems, and views of others, and Michael grows in the very opposite direction. Whereas the first movie was a taut ensemble piece, this second part is a more leisurely film that closely studies only these two characters, neither of whom share scenes with each other. Everyone else is periphery.It must be seen as a piece with the consummate mastership of The Godfather. When the characters in a film truly take on a simulated environmental existence for us, it becomes a film that everyone who cherishes movies to any extent should see at least once."
    },
    {
      "username": "OriginalMovieBuff21",
      "userUrl": "https://www.imdb.com/user/ur3341647",
      "reviewLink": "https://www.imdb.com/review/rw0135744",
      "warningSpoilers": false,
      "date": "12 September 2004",
      "rate": "10",
      "helpful": "151 out of 200 found this helpful.",
      "title": "One of the greatest sequels ever made",
      "content": "After seeing The Godfather and improving it as one of my favorite films, I wanted to get more into The Godfather so I rented this. Words can't describe how great this sequel was. The acting once again was amazing and the story and how the movie went on just never got me bored. Everything in this movie was clearly beautiful. The ending by far was my favorite when there all sitting at the table talking. There were so many great scenes like Vito when he was younger, Fredo at the lake, and many many more. You have to see this movie because it's just brilliant filmaking. It's not better than it's first film but still an extremely worth sequel.10/10"
    },
    {
      "username": "AgustinCesaratti",
      "userUrl": "https://www.imdb.com/user/ur104509847",
      "reviewLink": "https://www.imdb.com/review/rw5167777",
      "warningSpoilers": false,
      "date": "6 October 2019",
      "rate": "10",
      "helpful": "51 out of 61 found this helpful.",
      "title": "One of the greatest films ever made.",
      "content": "To say that this film is a sequel is a sin. Al Pacino and Robert de Niro win the Oscar for this film, Robert de Niro's performance as Vito Corleone is perfect, every scene in which this one is perfect. Al Pacino as always perfect and unlike the first film, he is much better.PROS:EVERYTHING. The script, the direction, the cast, the performance, everything in this film is perfect and its 3 hours are worth it.CONS:NOTHING. This movie is perfect."
    },
    {
      "username": "taimur74",
      "userUrl": "https://www.imdb.com/user/ur1170042",
      "reviewLink": "https://www.imdb.com/review/rw0135458",
      "warningSpoilers": false,
      "date": "9 May 2001",
      "rate": "10",
      "helpful": "552 out of 677 found this helpful.",
      "title": "To call it a sequel is a travesty",
      "content": "This movie is way to be good to be labelled a sequel to The Godfather . Rather it is more of a companion piece to the original and the two perfectly compliment each other . IT is both a sequel and prequel showing the rise of the young vito and moral decline of Micheal . Both characters are brought to life with uncanny ability by Robert DeNiro and Al Pacino . To say that these two are good actors is like saying that a nuclear bomb makes a loud noise and in this movie they prove why they are at the top of their respective crafts .Al Pacino is the standout in the ensemble cast and its amazing how his eyes have changed from the first part . They are now cold , ruthless and unemotional and betray the price which Micheal Corleone has paid for power .Watch this movie and learn why it is the greatest gangster film of all time."
    },
    {
      "username": "galileo3",
      "userUrl": "https://www.imdb.com/user/ur8564485",
      "reviewLink": "https://www.imdb.com/review/rw1251667",
      "warningSpoilers": false,
      "date": "31 December 2005",
      "rate": "10",
      "helpful": "197 out of 264 found this helpful.",
      "title": "\"The Godfather Part II is the greatest sequel ever made, one of the greatest films of all time and possibly finer than its superb predecessor *****\"",
      "content": "The Godfather Part II (1974)Number 1 - 1974Top 3 - 1970s\"My father taught me many things. Keep your friends close but keep your enemies closer\"\"The Godfather Part II is truly a masterpiece. Timeless, Classic, Beautiful and endlessly watchable\"The second part of Francis Ford Coppola's Epic and violent Gangster Trilogy, follows the reign of Don Michael Corleone as the head of the Corleone family. As well the film shows us the early years of Vito Corleone (Marlon Brando) played flawlessly by Academy Award Winner Robert De Niro, and how he created his empire of money, gambling and respect. Beautifully directed by Francis Ford Coppola, Godfather Part II exceeds every expectation with outstanding performances from Academy Award winners Al Pacino,Diane Keaton, Robert Duvall and Robert De Niro. The second part of this unforgettable trilogy is one of the finest films ever made. This is cinematic art. A treasure of film history. The finest sequel ever made. A faultless, flawless gripping drama; Coppola's second part of his crime saga is in my opinion one of the top 5 films of all time and perhaps towering over the first part. \"As close to perfection as movies get\"\"Pacino at his best\"-10/10-"
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw1901866",
      "warningSpoilers": false,
      "date": "30 June 2008",
      "rate": "10",
      "helpful": "117 out of 155 found this helpful.",
      "title": "An Insult To Call It A Sequel",
      "content": "To me and probably to many other people The Godfather Part II is more of a continuation than sequel to The Godfather. Just look at the IMDb rating and you'll see I'm not the only one who feels this way. To me it as good as the first.The acting may have been better than the acting in the original. Robert De Niro gave a perfect subtle performance as Vito Corleone. His portrayal was powerful and breathtaking. When I think De Niro I definitely do not think subtle and smooth but that is exactly what he was in here. It is definitely one of his top three performances in his career. The depth in his portrayal was able to justify the Vito Corleone that Marlon Brando portrayed in the first. Al Pacino gave a very strong performance playing Michael Corleone. In here we get to see more of the tough decisions that have to be made and the consequences of certain actions. Al Pacino perfectly displayed the amount of thought and struggle that goes into and comes out of every action you make; the way it affects relationships, family, power and influence. Diane Keaton was not really given a lot of room to act in the first but in here she is very good. She did not play the stereotypical wife who always stands behind her husband but rather the woman with a mind of her own who is willing to go after what she feels she deserves. Robert Duvall again to me was the glue to the movie. Just having him in there kind of makes you feel safe. John Cazale also had more of an impact in here than in the first playing the half-witted brother always needing to be bailed out. A lot of these characters sound so familiar and stereotypical but in The Godfather Part II every character is played out with such extraordinary depth. Everyone from Talia Shire who gave a fine performance to Lee Strasberg all the way down to the kid who played young Vito Corleone were perfect. Part II seems to me to be more of a character study than the original.The directing once again is perfect. Francis Ford Coppola know or at least knew how to make a movie. The first to Godfather movie are done so precisely and perfectly that nothing really sticks out because they are so perfect throughout. Coppola just lets his actors play everything out as he should with type of cast he has here. Not to many movies can maintain such a consistent flow over 3 hours let alone even an hour and 45 minutes.The writing may not have been quite as good as the first in terms of quoting but the storyline was perfect. Seeing the decisions made by new mob boss Michael Corleone was common sense but flashing back on Vito Corleone's life was genius. The storyline to me could not have been better and Coppola and Puzo do a great job with it all the way.Like the first the cinematography was amazing but it had a slightly different tone to it. The first had more of a majestic, mythical look to it. In Part II you feel the modern times creeping in and the Corleones having to adjust to it. Part II has more of a corrupt and evil twist to it but I guess the end signifies that. The music obviously the same as the first was perfect and just fit so greatly with the rest of the movie.The first to movies of The Godfather series are really like the same movie. They are not the same though, they are actually very different but the greatness of them both and the continuation of the storyline from the first to the second really create a strong band between each other. To me it is only a sequel in that it was the second movie of a great series. No let downs, no disappointments just a continuation of of the greatness from the first one."
    },
    {
      "username": "JoshtheGiant",
      "userUrl": "https://www.imdb.com/user/ur7484735",
      "reviewLink": "https://www.imdb.com/review/rw1193984",
      "warningSpoilers": false,
      "date": "15 October 2005",
      "rate": "10",
      "helpful": "171 out of 244 found this helpful.",
      "title": "A Masterpiece",
      "content": "The Godfather Part Two is possibly the best film ever made, every part of this film is amazing, it is even better than the original, I was very surprised by this. The story is amazing, everything makes perfect sense. The Oscar winning screenplay is amazing, the dialogue is some of the most original, and realistic ever putt on screen, the characters are flawless, and it's in every way perfectly written. The acting is just as fantastic, I can't believe Al Pacino lost the Oscar, and for once Robert De Niro was even better, he was truly amazing, and interestingly he fails to say a single word in English. The direction is also amazing, Francis Ford Coppola even does a better job than he did in The Godfather, and Apocalypse Now. The visual effects are so much better than the amazing one's in the original Godfather. One of the best films ever, a must see. Flawless."
    },
    {
      "username": "BrandtSponseller",
      "userUrl": "https://www.imdb.com/user/ur0139258",
      "reviewLink": "https://www.imdb.com/review/rw1077513",
      "warningSpoilers": false,
      "date": "10 May 2005",
      "rate": "9",
      "helpful": "198 out of 305 found this helpful.",
      "title": "Excellent, but could be in the dictionary under \"sprawl\"",
      "content": "Series note: It is almost unthinkable to watch this film without having seen The Godfather (1972) first. This is a direct continuation of that story.The good news is that The Godfather Part II has many amazing qualities, including fantastic performances from a superb cast, sublime, unprecedented visuals that no one else has been able to capture since, and very engaging stories. The bad news is that this should have easily been a 10, but overall, it is so sprawling and unfocused that I can't possibly give it more than a 9, which it only earns because the assets transcend what's basically a mess overall. Because it should have been a 10, and most other reviews will tell you about the positive points at length, I may pick on more things in my review than you would think I would for a 9, but rest assured that even with the flaws, The Godfather Part II is still essential viewing.Director/co-writer Francis Ford Coppola cleverly begins the film with parallels to The Godfather. We see Michael Corleone (Al Pacino) \"in the role\" of his father, Vito (Marlon Brando), from the first film, accepting prostrating guests while a party is going on outside. Like the first film, the party consumes a lot of time while we get to know some of the principal characters. Perhaps during this segment, perhaps a bit after, we realize that maybe the beginning wasn't so clever after all, because the structure of The Godfather Part II parallels The Godfather from a broad perspective, as if Coppola and co-writer Mario Puzo used the first film as something of a template to create this one.After the party is over, there is an attempted hit on Michael, and we quickly learn that not everything is rosy in the Corleone's mafia world. Michael believes that someone on the \"inside\" was involved with the hit. This launches a complicated sequence of events that has Michael, who is now living in Nevada, traveling to Miami, Cuba, New York, and so on. He accuses different people of involvement in the attempted hit depending on whom he is talking to. This may have all been part of a grand scheme to set up the responsible parties, but one of the flaws of the film is that Coppola doesn't convey Michael's underlying thoughts about this very well, not even later, and not through his actions. Rather than feeling like a clever set-up, it starts to feel like slightly muddled writing.During the middle section of the film, which goes on for hours, we also have a hint of a problem that plagued The Godfather--a bloated cast. There are bit too many characters who aren't well enough presented or explained. You may need to keep a scorecard.Coppola and Puzo also treat us to many extended \"flashback\" segments, and I mean way back, to Vito as a boy and young man, played by Robert De Niro. For my money, these were the best scenes of the film, although maybe that's a bit of my bias creeping in, as I'm a huge De Niro fan.But let's talk about the main plague of the film--sprawl. This is maybe first evident in the flashbacks. As good as they are, they go on far too long, and happen far too frequently, to sustain the momentum of either the Michael story or the Vito-as-a-youngster story. It begins to feel like we're toggling back and forth between two films, which is the track that should have been taken. The prequel, at least, would have been a solid 10.There's also a lot of sprawl in the Michael Corleone segments. Coppola appears to have been suffering from what I'd now call \"J.K. Rowling Syndrome\". That happens when an artist becomes successful enough that they can fire or ignore their editor(s). Instead of taking good advice about where to trim fat, the artist decides to just leave much of it in, and they now have the clout to override any dissenting and more sensible opinions. The Michael Corleone story has a lot of fat, including much of the Cuba material (for example, sitting around the table with the President, laboriously passing around a solid gold telephone), the Senate hearings (which go on far too long to make and provide the dramatic points), and so on.The film begins to feel more like a couple seasons of a television show that Coppola tried to cram into a 3 and a half hour film, or worse, a collection of deleted scenes. The scenes, except for the fat that needed to be trimmed, are excellent in isolation. But by the time the climax rolls around, the whole has more of an arbitrary feeling--this is especially clear in the dénouement, which seems to just end.I've barely left myself room to talk about the good points. The first one, which most people mention, is the acting. There isn't a bad performance in the film, but Pacino, De Niro, and some relatively minor characters, like those played by Diane Keaton, Talia Shire and John Cazale, really stand out.The second outstanding point, similar to the first film, is the beautiful visuals. Although all of the cinematography and production design is great, what really impressed me were some of the darkly lit scenes. Characters and features of sets emerge from pitch-blackness, and everything is rich, deep shades of burgundy, brown, and orange. Amazingly, nothing gets lost in these scenes. It must be incredibly difficult to achieve without making the shots too dark, because I can't remember another film since that has been able to capture the same look. The flashback scenes are also in similar, but lighter, colors, creating an appropriate sepia-tone feel.Although the broad perspective problems are unfortunate, a closer focus on most segments of the film provides exemplary artistry. Given that, and the film's importance culturally, The Godfather Part II is a must-see."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2993743",
      "warningSpoilers": false,
      "date": "7 April 2014",
      "rate": "8",
      "helpful": "39 out of 58 found this helpful.",
      "title": "Good, but not as good as the first",
      "content": "A lot of people seem to consider THE GODFATHER PART II to be the best film ever made, a film that's even better than it's already excellent predecessor. Unfortunately, I have to disagree. While this movie is very good, and as well made as the original, I think the original has the edge.The reason for that is the script, which was just better, and more involved, the first time around. Here, there are dual narratives, one of which follows the traditional sequel route of showing that happened to the Corleone family after the events of the first movie, while the second is a prequel revealing how Vito Corleone became the mafia boss he ended up as.While I love Robert De Niro and I enjoyed the flashback scenes, I felt this whole sequence was slightly unnecessary. From the material given, the viewer can already guess how the De Niro character rose through the ranks and the events we witness feel a little bit superfluous. Sure, the pair of assassination scenes are excellent, but the rest just feels obvious and expected.Meanwhile, the Pacino narrative also has its problems, although cast and director aren't at fault; Coppola reunites many of his principals here and to excellent effect. However, there isn't nearly as much incident in the narrative and the whole story feels a little dragged out, a little over-emphasised. In the first film, the Pacino character had three or four major plot points to deal with, whereas this time the events are limited; for example, the entire film focuses on the situation with Roth, whereas in THE GODFATHER that would have just taken up half an hour or so. Therefore the ending, when it comes, is admittedly powerful, but not as effective in comparison to the genuinely amazing things we saw in the first film. It's been done before, and apart from a little more depth and character focus, we can't take much more away from this sequel. So it's very good, but not quite up there to the level of the first."
    },
    {
      "username": "Bill-247",
      "userUrl": "https://www.imdb.com/user/ur0167590",
      "reviewLink": "https://www.imdb.com/review/rw0135590",
      "warningSpoilers": false,
      "date": "6 December 1998",
      "rate": "",
      "helpful": "126 out of 173 found this helpful.",
      "title": "A Hollywood Masterpiece!!!!",
      "content": "Francis Coppola and Mario Puzo continue their epic saga into the lives of the infamous Corleone family, which is headed by Michael Corleone (Al Pacino). It is a film which does better than its predessor, \"The Godfather\". The film flip-flops graciously and beautifully between Michael's struggle over the family business and the life of young Vito Corleone (Robert De Niro, in a brilliant, Oscar-winning performance) in his rise to power as well. Robert Duvall, Diane Keaton, Lee Strassberg, and John Cazale give excellent supporting performances. Carmine Coppola's and Nino Rota's score is a masterpiece of music. The movie is expertly filmed and the cinematography is superb."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2343316",
      "warningSpoilers": false,
      "date": "24 November 2010",
      "rate": "10",
      "helpful": "23 out of 33 found this helpful.",
      "title": "One of the best sequels ever made",
      "content": "I do have to agree that calling Godfather Part II a sequel is rather insulting. It is one of those rare sequels that almost outdoes the first, and considering how amazing the first Godfather was that says a lot. The Godfather Part II is longer, but in some ways it is also richer. People may say like with the first it is slow and takes a while to unfold. Of course, but I think that was deliberate. Both this and the first Godfather have an elegiac quality to them that makes them even more compelling.For one thing, the film is very well made. The cinematography is simply gorgeous, whether it is dark or autumnal or picturesque, and the settings are wondrous. The music once again is outstanding, it is haunting and sticks in your head for a very long time. Then there is a brilliantly written screenplay that is intelligent and thoughtful, masterly direction from Francis Ford Coppola and a fabulously constructed story. The film does have some wonderful scenes-: the scenes where Vito flees Sicily has the grandeur of a silent movie, while the scenes in Cuba actually avoid being clumsy and confusing and the climax is extremely chilling. Not to mention the Pop Goes the Weasel scene, which was very funny.The acting is superb once again. Vito is brilliantly portrayed by Robert DeNiro in one of his better performances. I was also taken with Robert Duvall as loyal Tom, John Cazale and Diane Keaton. But the picture belongs to Al Pacino. He was great carrying the first Godfather movie, but he is even better here. He is simply phenomenal, and to be honest I think he should have won that Oscar. Overall, an amazing film and one of the best sequels ever to be conceived. 10/10 Bethany Cox"
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw4057930",
      "warningSpoilers": false,
      "date": "9 February 2018",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "It doesn't hold a candle to the original but yet is one of the finest sequels of all time.",
      "content": "It's baggy, wholly unnecessary and doesn't hold a candle to the original but yet is also an example of one of the finest sequels of all time and a phenomenal piece of film-making regardless of its few flaws. The 'Godfather: Part II (1974)' is an oddity in more ways than one, since it simply shouldn't work but totally does. There's almost no way you could believe that the piece powers past the three-hour mark, which it does thanks mainly to its unneeded and honestly less interesting flashback plots seemingly disconnected from the main story. There's not a moment in the foremost narrative I'd suggest cutting even for a second, and even those flashback bits are breathlessly entertaining (in a much more instantly gratifying way than the slow-burning main narrative.) Every second of the picture adds up to an experience that seems sweepingly massive yet strangely intimate, an effortlessly engaging examination of the fall of an empire and the nostalgic sadness at the heart of a man whose soul is slowly turning to stone. 8/10."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2774910",
      "warningSpoilers": false,
      "date": "30 March 2013",
      "rate": "10",
      "helpful": "26 out of 39 found this helpful.",
      "title": "My review of this film is pretty unimportant.",
      "content": "\"The Godfather: Part II\" is seen, by many, as the greatest sequel in movie history and one of the best films of all time. Some even think it's better than \"The Godfather\". As for me, who am I to argue?! The film IS great--and deserved the Best Picture Award and its placement at #3 on IMDb's Top 100 list! And, since there are over 500 reviews for it on the site, I can't think of why I am even bothering to review it. After all, what's one more review that sings its praises?! The acting, writing, direction and entire production is perfect. What more can you say? If you do see the film (and you MUST), try to watch the version that combines the first two films into one--and adds additional story to make it one huge and perfect epic. You simply can't be a film buff without seeing this picture."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6497233",
      "warningSpoilers": false,
      "date": "18 January 2021",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "The Godfather Part 2",
      "content": "The best sequel ever and one of the best films I have seen, a great story with great writing characters carefully written and masterfully illustrated by the actors. Robert De Niro embodies the ingenuity of Vito Corleone, Al Pacino played the role of Michael greatly and continued on the same level in the first film, the only negative that affected me the film was slightly less than the level of the first part is the length of the film was long and I felt some bored in some shots I am watching the film, the film is one of the 10 best films I have ever seen, and my rating for the film is 9.5 and I highly recommend watching it."
    },
    {
      "username": "Sylviastel",
      "userUrl": "https://www.imdb.com/user/ur0033913",
      "reviewLink": "https://www.imdb.com/review/rw0135641",
      "warningSpoilers": false,
      "date": "14 October 2002",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Poor Fredo! We still miss John Cazale!",
      "content": "The Godfather Part II has excellent writing, plotting, editing is even brilliant, acting, and overall quality to watch over again and again. You can never get sick of watching this film. I miss John Cazale. He was truly a gifted actor and I miss him. He played my favorite Corleone brother. Sure Alfredo was never brilliant or vicious but he was sweet, gentle, and warm most of the time. He had a conscience and I despise Michael for killing his own brother. I think he killed him out of jealousy. Alfredo spent more time with Michael's son, Anthony, than he did and he resented him for it. Alfredo could have been spared. Four years after Godfather Part II, John Cazale died of cancer after filming the Deer Hunter. He never won an Oscar or made too many films but he made every role memorable. Rest in Peace, John. I miss you."
    },
    {
      "username": "newfiesailor",
      "userUrl": "https://www.imdb.com/user/ur7343974",
      "reviewLink": "https://www.imdb.com/review/rw1352914",
      "warningSpoilers": true,
      "date": "27 April 2006",
      "rate": "9",
      "helpful": "27 out of 36 found this helpful.",
      "title": "As good as the original...",
      "content": "Sequel to the original Godfather is slower moving than the original but maybe better. The first was fresh material and Brando's presence was a huge plus. But this one digs into the blood and guts of the two main characters, provoking more thought, as well as introducing us to one of the most prolific actors today.Michael's descent into darkness is terrible to behold. Tragedy surrounds him as he struggles to maintain his empire but alienates himself in the process. Hey, it's not easy holding a crime empire together. I think this film sets out to make Michael a tragic figure but how do you feel sympathy for a guy who murders family members? It's a cold world obviously, and takes a strong man to stay on top. Very interesting final scene, grim and stark, as Michael sits contemplating on a chair watching the dead leaves blow around him.Pacino's performance is magnificent. Some great scenes, especially when Michael realizes Fredo betrayed him. That simple movement of covering his forehead in shock and despair conveys so much. Michael becomes a three dimensional character in this film as opposed to the first. Pacino just nails the part.The secondary story is the rise of Michael's father, Vito Corleone and we watch the birth of a star. DeNiro even surpasses Pacino in his part, if that is possible. The calculating Vito as he calmly stalks Don Fanucci from the rooftops is classic film. DeNiro plays the role of Death himself: knife thin, pale yet slick and immaculate in appearance. How many other hit men in the movies borrowed DeNiro's look? What the Godfather does, unlike so many other films of it's generation is convey thought in simple movements. Watch DeNiro as he pales visibly, staring at an old Italian remedy of his sick baby. We know right then that Vito Corleone will do whatever it takes to protect and save his family. Watch him as Don Fanucci boards his car and leans on him. By DeNiro's expression, we know Fanucci is already a dead man. That's unsurpassed acting.The sets are beautiful to behold and this is probably the best cinematography I have seen in any movie. Early 1900's New York, in the Italian neighborhood is unreal. Watch the pedestrians and background movement while the focus of the scene is occurring. That's sheer magic. Once again, watch Hyman Roth in Cuba lie on the couch, shirtless and a gentle wind moving the drapes. We can practically feel the heat and hear and smell the city of Havana. It made me think how much care and calculation was put into this movie.Some weak points: Lee Strasberg as Hyman Roth was not on par with the other actors. Gazzo as Pentangeli just grated on my nerves, especially in the first hour. I was hoping he would get whacked so he would not appear in the rest of the film. The rest of the cast is great as usual, especially Duvall and Kirby. Not much to complain about.The second Godfather, tries to do what the first does, a study of Vito vs. Michael. They both have different motivations for ruling their empire. Whereas Vito tries to do whatever it takes to rise from poverty and provide for his family out of love, Michael rules out of ruthlessness and a need to succeed to maintain his empire. You can see where the results have taken both.One of the greatest films of all time."
    },
    {
      "username": "sarabagi",
      "userUrl": "https://www.imdb.com/user/ur100389096",
      "reviewLink": "https://www.imdb.com/review/rw4721414",
      "warningSpoilers": false,
      "date": "13 March 2019",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "A must for everyone",
      "content": "A must watch for everybody. The backstory of the godfather... cant decided if part 1 or 2 is better... both beyond amazing!!"
    },
    {
      "username": "Movie-ManDan",
      "userUrl": "https://www.imdb.com/user/ur31261952",
      "reviewLink": "https://www.imdb.com/review/rw3135534",
      "warningSpoilers": true,
      "date": "4 December 2014",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Better Than The Original? Maybe. Unbelievable Ride? HELL YEAH!!",
      "content": "The Godfather Part II is said by many to be the best sequel ever. I personally think that is arguable, since it arguably surpasses its proceeder and checking out the Lord of the Rings sequels and the Empire Strikes Back. Say this is the best sequel ever and I will not disagree. Say this is better than the first and I will agree. Honestly, I keep changing my mind about which instalment is better every time I watch them. This last time I watched them, the first one seemed better to me. The time before, this one was the superior picture. I don't care which is better, as long as I have 200 minutes of no interruptions while watching this.With the success of The Godfather in 1972, it was only natural for there to be a sequel. The Godfather Part II acts as both a sequel and a prequel, with the sequel being written by Coppola and Puzo and the prequel being taken from the novel. When Pacino broke out in the first movie, he topped it one year later with Serpico. His performance in this tops Serpico and everything else he's ever done. Unfortunately, he lost his sure Oscar win to Art Carney. Yes, Carney was worthy, but put him in the same category as Al Pacino for perhaps the best role ever and he becomes very unworthy. The people at the Academy probably thought Pacino would just get better and they could give him an award later. That would not come until 1993 when he won for a role in Scent of a Woman that was inferior to all that he did in the 70s. At least the Academy got the Best Picture win right. That was a given. Pacino's rival/friend/co- star, Robert De Niro took home the win for Best Supporting Actor, beating out their acting teacher, Lee Strasberg. De Niro became the first Oscar winner to not say a word of English. I don't know what it was about his portrayal, but there was some sort of magic contained with utter brilliance. Strasberg and Michael Gazzo where also fantastic, but both did not possess an unknown magic that few can bring to the table.The prequel follows a child Vito Corleone who's family is poor. He witnesses his family begin murdered by Corleone's most powerful mob boss. He heads to America and grows up on the streets there too. Years later, an adult Vito (De Niro) rises to the top of New York's underworld and is determined to avenge his family's death. Revenge stories like this have been done to death, but almost none have been executed this good. The sequel takes place a few years after the first with Michael (Pacino) as the Don. After he successfully dodges an assassination attempt, ordered by Hyman Roth (Strasberg), Michael's fears about loyalty, betrayal and murder lead him to a severe paranoid state making him a deadly madman.If there was one flaw this had, it would be that the antagonist in the sequel isn't much of a threat; we know Michael can destroy him and all he has. One reason the first one worked so well was because the family was losing and audience did not know how the family would regain power. That masterstroke isn't quite achieved in this. So maybe the first one is better.Both stories are less complex than the original, but both together make one hefty team. Al Pacino outdoes Marlon Brando and himself in one of the top five greatest roles of the screen. He leads an all-star cast in what is arguably better acting than the first. With most of this being arguably better than the first, Coppola's direction surpasses the first. The cinematography, sets and camera tricks beat out all the first had, which were great.4/4"
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1332298",
      "warningSpoilers": false,
      "date": "3 April 2006",
      "rate": "9",
      "helpful": "24 out of 39 found this helpful.",
      "title": "Not Far Behind The First Film",
      "content": "This isn't quite as powerful as the first Godfather, done two years earlier, but it isn't far behind. It's another magnificently filmed effort, wonderfully acted and a hard film to stop once you've put it in your tape or DVD player.What makes this a notch below the first Godfather is the absence of Marlon Brando and a little too much disjointedness with flashbacks. Also missing from this film was the volatile James Caan. He was shown in a flashback scene near the end, and that was it.One thing was just as good if not better than the first film, and that was the cinematography. The browns, blacks, greens and yellows are just great treats for the eyes. I especially love the Italian houses and scenery. Why this was not even nominated for an Academy Award in cinematography is mind-boggling.The story centers around the brutal vengeance of youngest brother Michael (Al Pacino). It also gives a good demonstration of how the gangster lifestyle may look attractive on the outside but really is an unhappy one despite the wealth.There are some excellent supporting performances in this film, too. I especially would cite the roles played by Michael Gazzo and Lee Strassburg."
    }
  ],
  "errorMessage": ""
}