{
  "imDbId": "tt0071562",
  "title": "The Godfather Part II",
  "fullTitle": "The Godfather Part II (1974)",
  "type": "Movie",
  "year": "1974",
  "language": "en",
  "titleInLanguage": "The Godfather Part II",
  "url": "https://en.wikipedia.org/wiki/The_Godfather_Part_II",
  "plotShort": {
    "plainText": "The Godfather Part II is a 1974 American epic crime film produced and directed by Francis Ford Coppola. The film is partially based on the 1969 novel The Godfather by Mario Puzo, who co-wrote the screenplay with Coppola, and it is both a sequel and a prequel to the 1972 film The Godfather, presenting parallel dramas: one picks up the 1958 story of Michael Corleone (Al Pacino), the new Don of the Corleone family, protecting the family business in the aftermath of an attempt on his life; the prequel covers the journey of his father, Vito Corleone (Robert De Niro), from his Sicilian childhood to the founding of his family enterprise in New York City. The ensemble cast also features Robert Duvall, Diane Keaton, Talia Shire, Morgana King, John Cazale, Mariana Hill, and Lee Strasberg.\r\nFollowing the success of the first film, Paramount Pictures began developing a follow-up, with many of the cast and crew returning. Coppola, who was given more creative control, had wanted to make both a sequel and a prequel to The Godfather that would tell the story of the rise of Vito and the fall of Michael. Principal photography began in October 1973 and wrapped up in June 1974. The Godfather Part II premiered in New York City on December 12, 1974, and was released in the United States on December 20, 1974, receiving divided reviews from critics; its reputation, however, improved rapidly, and it soon became the subject of critical re-appraisal. It grossed $48 million in the United States and Canada and up to $93 million worldwide on a $13 million budget. The film was nominated for eleven Academy Awards, and became the first sequel to win Best Picture. Its six Oscar wins also included Best Director for Coppola, Best Supporting Actor for De Niro and Best Adapted Screenplay for Coppola and Puzo. Pacino won Best Actor at the BAFTAs and was nominated at the Oscars.\r\nLike its predecessor, Part II remains a highly influential film, especially in the gangster genre. It is considered to be one of the greatest films of all time, as well as the rare example of a sequel that may be superior to its predecessor. In 1997, the American Film Institute ranked it as the 32nd-greatest film in American film history and it retained this position 10 years later. It was selected for preservation in the U.S. National Film Registry of the Library of Congress in 1993, being deemed \"culturally, historically, or aesthetically significant\". The Godfather Part III, the final installment in the trilogy, was released in 1990.",
    "html": "<p>The Godfather Part II is a 1974 American epic crime film produced and directed by Francis Ford Coppola. The film is partially based on the 1969 novel The Godfather by Mario Puzo, who co-wrote the screenplay with Coppola, and it is both a sequel and a prequel to the 1972 film The Godfather, presenting parallel dramas: one picks up the 1958 story of Michael Corleone (Al Pacino), the new Don of the Corleone family, protecting the family business in the aftermath of an attempt on his life; the prequel covers the journey of his father, Vito Corleone (Robert De Niro), from his Sicilian childhood to the founding of his family enterprise in New York City. The ensemble cast also features Robert Duvall, Diane Keaton, Talia Shire, Morgana King, John Cazale, Mariana Hill, and Lee Strasberg.</p><p>Following the success of the first film, Paramount Pictures began developing a follow-up, with many of the cast and crew returning. Coppola, who was given more creative control, had wanted to make both a sequel and a prequel to The Godfather that would tell the story of the rise of Vito and the fall of Michael. Principal photography began in October 1973 and wrapped up in June 1974. The Godfather Part II premiered in New York City on December 12, 1974, and was released in the United States on December 20, 1974, receiving divided reviews from critics; its reputation, however, improved rapidly, and it soon became the subject of critical re-appraisal. It grossed $48 million in the United States and Canada and up to $93 million worldwide on a $13 million budget. The film was nominated for eleven Academy Awards, and became the first sequel to win Best Picture. Its six Oscar wins also included Best Director for Coppola, Best Supporting Actor for De Niro and Best Adapted Screenplay for Coppola and Puzo. Pacino won Best Actor at the BAFTAs and was nominated at the Oscars.</p><p>Like its predecessor, Part II remains a highly influential film, especially in the gangster genre. It is considered to be one of the greatest films of all time, as well as the rare example of a sequel that may be superior to its predecessor. In 1997, the American Film Institute ranked it as the 32nd-greatest film in American film history and it retained this position 10 years later. It was selected for preservation in the U.S. National Film Registry of the Library of Congress in 1993, being deemed \"culturally, historically, or aesthetically significant\". The Godfather Part III, the final installment in the trilogy, was released in 1990.</p>"
  },
  "plotFull": {
    "plainText": "The Godfather Part II is a 1974 American epic crime film produced and directed by Francis Ford Coppola. The film is partially based on the 1969 novel The Godfather by Mario Puzo, who co-wrote the screenplay with Coppola, and it is both a sequel and a prequel to the 1972 film The Godfather, presenting parallel dramas: one picks up the 1958 story of Michael Corleone (Al Pacino), the new Don of the Corleone family, protecting the family business in the aftermath of an attempt on his life; the prequel covers the journey of his father, Vito Corleone (Robert De Niro), from his Sicilian childhood to the founding of his family enterprise in New York City. The ensemble cast also features Robert Duvall, Diane Keaton, Talia Shire, Morgana King, John Cazale, Mariana Hill, and Lee Strasberg.\r\nFollowing the success of the first film, Paramount Pictures began developing a follow-up, with many of the cast and crew returning. Coppola, who was given more creative control, had wanted to make both a sequel and a prequel to The Godfather that would tell the story of the rise of Vito and the fall of Michael. Principal photography began in October 1973 and wrapped up in June 1974. The Godfather Part II premiered in New York City on December 12, 1974, and was released in the United States on December 20, 1974, receiving divided reviews from critics; its reputation, however, improved rapidly, and it soon became the subject of critical re-appraisal. It grossed $48 million in the United States and Canada and up to $93 million worldwide on a $13 million budget. The film was nominated for eleven Academy Awards, and became the first sequel to win Best Picture. Its six Oscar wins also included Best Director for Coppola, Best Supporting Actor for De Niro and Best Adapted Screenplay for Coppola and Puzo. Pacino won Best Actor at the BAFTAs and was nominated at the Oscars.\r\nLike its predecessor, Part II remains a highly influential film, especially in the gangster genre. It is considered to be one of the greatest films of all time, as well as the rare example of a sequel that may be superior to its predecessor. In 1997, the American Film Institute ranked it as the 32nd-greatest film in American film history and it retained this position 10 years later. It was selected for preservation in the U.S. National Film Registry of the Library of Congress in 1993, being deemed \"culturally, historically, or aesthetically significant\". The Godfather Part III, the final installment in the trilogy, was released in 1990.\r\nPlot\r\nThe film interweaves between events some time after The Godfather and the early life of Vito Corleone.\r\nVito\r\nIn 1901, nine-year-old Vito Andolini flees his country after his whole family is killed in Corleone, Sicily when his father insults local Mafia chieftain Don Ciccio. Vito escapes to New York City and is registered on arrival as \"Vito Corleone\". In 1917, Vito lives in New York with his wife, Carmela, and their infant son, Sonny. He loses his job due to the interference of Don Fanucci, a local Black Hand extortionist. His neighbor Peter Clemenza asks Vito to hide a bag of guns; as thanks, Clemenza enlists Vito's help in stealing a rug, which he gives to Carmela.\r\nThe Corleones have three more children: sons Fredo and Michael, and daughter Connie. Meanwhile, Vito, Clemenza, and new partner Salvatore Tessio make income by stealing goods and reselling them door-to-door. This enterprise attracts the attention of Fanucci, who extorts them. Vito convinces his skeptical partners that he will talk Fanucci into accepting a smaller payment. During a neighborhood festa, Vito pays an incredulous Fanucci a much smaller amount and is offered a job as an enforcer. Vito later kills Fanucci in his apartment. Vito becomes a formidable and well-respected community member by helping locals in exchange for \"favors\".\r\nIn 1923, Vito and his family visit Sicily, during which he and his business partner Don Tommasino visit Don Ciccio, ostensibly to ask for Ciccio's blessing on their olive oil business. Ciccio asks for the name of Vito's father; Vito reveals his identity and stabs Ciccio to death, avenging his family.\r\nMichael\r\nIn 1958, during his son's First Communion party at Lake Tahoe, Michael has a series of meetings in his role as the don of the Corleone crime family. Frank Pentangeli, a Corleone capo, is dismayed that Michael refuses to help defend his Bronx territory against the Rosato brothers, who work for Hyman Roth, a Jewish Mob boss and long-standing Corleone business partner. Senator Pat Geary expects a bribe in exchange for helping Michael obtain casino gaming licenses and insults Italians generally and the Corleones specifically. Michael predicts that Geary will aid him with the licenses but will not be paid. That night, a failed assassination attempt at his home prompts Michael to suddenly depart after confiding in consigliere Tom Hagen that he suspects a traitor within the family.\r\nMichael suspects Roth planned the assassination, but falsely tells Roth he suspects Pentangeli. In New York City, under Michael's instructions, Pentangeli attempts to make peace with the Rosatos, but they try to kill him. The attempt fails when a police officer enters the bar where the Rosatos are trying to kill Pentangeli, resulting in the Rosatos fleeing and a brief street shootout where Corleone soldier Willie Cicci is wounded.\r\nIn Nevada, Tom Hagen is called to a Carson City brothel run by Michael's older brother Fredo, where Geary has been implicated in the death of a prostitute. Unaware that Michael arranged the \"problem,\" Geary accepts Tom's offer to take care of it in return for Geary's political support.\r\nA sickly Roth, Michael, and several of their partners travel to Havana to discuss their future Cuban business prospects under the cooperative government of Fulgencio Batista. Michael becomes reluctant to continue operating in Cuba given the ongoing Cuban Revolution. On New Year's Eve, Fredo pretends not to know Johnny Ola, Roth's right-hand man, but later inadvertently reveals they know each other, leading Michael to realize that Fredo is the traitor. Michael orders hits on Ola and Roth; his enforcer strangles Ola with a coat hanger but is killed by Cuban soldiers as he tries to smother Roth. Batista abdicates due to rebel advances. During the ensuing chaos, Michael, Fredo, and Roth separately escape Cuba. Back home, Michael is told that his wife Kay has miscarried.\r\nIn Washington, D.C., a Senate committee on organized crime is investigating the Corleone family, but Geary staunchly defends them. Pentangeli agrees to testify against Michael, who he believes had betrayed him to the Rosatos, and is placed under witness protection. On returning to Nevada, Fredo tells Michael that he did not know that Roth had intended to kill him, but that he resents being regarded as stupid by the family and feels that he should have taken over the family after their father's death. Michael disowns Fredo, but gives orders that he is not to be harmed while their mother is alive. Michael sends for Pentangeli's brother from Sicily, and Pentangeli, after seeing his brother in the hearing room, retracts his previous statement indicting Michael in organized crime; the hearing dissolves in an uproar. Kay reveals to Michael that she actually had an abortion, not a miscarriage, and that she intends to leave him and take their children. Outraged, Michael strikes Kay, banishes her from the family, and takes sole custody of the children.\r\nCarmela dies some time later, and Michael hurries to wrap up loose ends. At the funeral, Michael appears to forgive Fredo at Connie's behest, but exchanges a glance with Corleone enforcer Al Neri suggesting that Fredo is to be killed. Kay visits her children; as she is saying goodbye, Michael arrives and closes the door on her. Roth is forced to return to the United States after being refused asylum and entry to Israel. On Michael's orders, Roth is assassinated by Corleone caporegime Rocco Lampone during an interview at the Miami International Airport; Lampone is killed in turn by a federal agent while attempting to flee the scene. At Pentangeli's compound, Hagen visits and the two discuss how failed plotters against the Roman emperor often committed suicide in return for clemency for their families; Pentangeli is later found dead in his bathtub, having slit his wrists. At the family compound, Michael has Connie retrieve his son as he was joining Fredo and Neri for a fishing excursion on the lake. Michael then watches from his den as Neri shoots Fredo dead.\r\nMichael reminisces about Vito's 50th birthday party on December 7, 1941 (occurring on the same day that the Japanese bomb Pearl Harbor). While the family waits to surprise Vito, Michael announces that he has dropped out of college and joined the Marines, angering Sonny and surprising Hagen; Fredo is the only member of the family to support his decision. Vito is heard opening the door and everyone leaves the room to welcome him, while Michael sits alone.\r\nIn present day, Michael sits alone at the family compound, looking out over the lake.\r\nCast\r\nAl Pacino as Michael Corleone\r\nRobert Duvall as Tom Hagen\r\nDiane Keaton as Kay Adams-Corleone\r\nRobert De Niro as Vito Corleone Oreste Baldini as young Vito Corleone\r\nOreste Baldini as young Vito Corleone\r\nJohn Cazale as Fredo Corleone\r\nTalia Shire as Connie Corleone\r\nLee Strasberg as Hyman Roth\r\nMichael V. Gazzo as Frank Pentangeli\r\nG. D. Spradlin as Senator Pat Geary\r\nRichard Bright as Al Neri\r\nGastone Moschin as Don Fanucci\r\nTom Rosqui as Rocco Lampone\r\nBruno Kirby as young Peter Clemenza\r\nFrank Sivero as Genco Abbandando\r\nMorgana King as Mama Carmela Corleone Francesca De Sapio as young Carmela Corleone\r\nFrancesca De Sapio as young Carmela Corleone\r\nMarianna Hill as Deanna Corleone\r\nLeopoldo Trieste as Signor Roberto\r\nDominic Chianese as Johnny Ola\r\nAmerigo Tot as Michael's bodyguard\r\nTroy Donahue as Merle Johnson\r\nJoe Spinell as Willi Cicci\r\nAbe Vigoda as Salvatore Tessio John Aprea as young Tessio\r\nJohn Aprea as young Tessio\r\nHarry Dean Stanton as an F.B.I. agent\r\nDanny Aiello as Tony Rosato\r\nProduction\r\nDevelopment\r\nPuzo started writing a script for a sequel in December 1971, before The Godfather was even released; its initial title was The Death of Michael Corleone. Coppola's idea for the sequel would be to \"juxtapose the ascension of the family under Vito Corleone with the decline of the family under his son Michael ... I had always wanted to write a screenplay that told the story of a father and a son at the same age. They were both in their thirties and I would integrate the two stories ... In order not to merely make Godfather I over again, I gave Godfather II this double structure by extending the story in both the past and in the present.\" Coppola met with Martin Scorsese about directing the film, but Paramount refused. Coppola also, in his director's commentary on The Godfather Part II, mentioned that the scenes depicting the Senate committee interrogation of Michael Corleone and Frank Pentangeli are based on the Joseph Valachi federal hearings and that Pentangeli is a Valachi-like figure.\r\nProduction, however, nearly ended before it began when Pacino's lawyers told Coppola that he had grave misgivings with the script and was not coming. Coppola spent an entire night rewriting it before giving it to Pacino for his review. Pacino approved it and the production went forward. The film's original budget was $6 million but costs increased to over $11 million, with Variety's review claiming it was over $15 million.\r\nCasting\r\nSeveral actors from the first film did not return for the sequel. Marlon Brando initially agreed to return for the birthday flashback sequence, but the actor, feeling mistreated by the board at Paramount, failed to show up for the single day's shooting. Coppola then rewrote the scene that same day. Richard S. Castellano, who portrayed Peter Clemenza in the first film, also declined to return, as he and the producers could not reach an agreement on his demands that he be allowed to write the character's dialogue in the film, though this claim was disputed by Castellano's widow in a 1991 letter to People magazine. The part in the plot originally intended for the latter-day Clemenza was then filled by the character of Frank Pentangeli, played by Michael V. Gazzo.\r\nCoppola offered James Cagney a part in the film, but he refused. James Caan agreed to reprise the role of Sonny in the birthday flashback sequence, demanding he be paid the same amount he received for the entire previous film for the single scene in Part II, which he received. Among the actors depicting Senators in the hearing committee are film producer/director Roger Corman, writer/producer William Bowers, producer Phil Feldman, and actor Peter Donat.\r\nFilming\r\nThe Godfather Part II was shot between October 1, 1973 and June 19, 1974. The scenes that took place in Cuba were shot in Santo Domingo, Dominican Republic. Charles Bluhdorn, whose Gulf+Western conglomerate owned Paramount, felt strongly about developing the Dominican Republic as a movie-making site. Forza d'Agrò was the Sicilian town featured in the film.\r\nUnlike with the first film, Coppola was given near-complete control over production. In his commentary, he said this resulted in a shoot that ran very smoothly despite multiple locations and two narratives running parallel within one film. Coppola discusses his decision to make this the first major U.S. motion picture to use \"Part II\" in its title in the director's commentary on the DVD edition of the film released in 2002. Paramount was initially opposed because they believed the audience would not be interested in an addition to a story they had already seen. But the director prevailed, and the film's success began the common practice of numbered sequels.\r\nOnly three weeks prior to the release, film critics and journalists pronounced Part II a disaster. The cross-cutting between Vito and Michael's parallel stories were judged too frequent, not allowing enough time to leave a lasting impression on the audience. Coppola and the editors returned to the cutting room to change the film's narrative structure, but could not complete the work in time, leaving the final scenes poorly timed at the opening.\r\nIt was the last major American motion picture to have release prints made with Technicolor's dye imbibition process until the late 1990s.\r\nMusic\r\nRelease\r\nTheatrical\r\nThe Godfather Part II premiered in New York City on December 12, 1974, and was released in the United States on December 20, 1974.\r\nHome media\r\nCoppola created The Godfather Saga expressly for American television in a 1975 release that combined The Godfather and The Godfather Part II with unused footage from those two films in a chronological telling that toned down the violent, sexual, and profane material for its NBC debut on November 18, 1977. In 1991, Paramount released the Godfather Epic VHS box set, which also told the story of the first two films in chronological order, again with additional scenes, but not redacted for broadcast sensibilities. Coppola returned to the film again in 1992 when he updated that release with footage from The Godfather Part III and more unreleased material. This home viewing release, under the title The Godfather Trilogy 1901–1980, had a total run time of 583 minutes (9 hours, 43 minutes), not including the set's bonus documentary by Jeff Werner on the making of the films, \"The Godfather Family: A Look Inside\".\r\nThe Godfather DVD Collection was released on October 9, 2001 in a package that contained all three films—each with a commentary track by Coppola—and a bonus disc that featured a 73-minute documentary from 1991 entitled The Godfather Family: A Look Inside and other miscellany about the film: the additional scenes originally contained in The Godfather Saga; Francis Coppola's Notebook (a look inside a notebook the director kept with him at all times during the production of the film); rehearsal footage; a promotional featurette from 1971; and video segments on Gordon Willis's cinematography, Nino Rota's and Carmine Coppola's music, the director, the locations and Mario Puzo's screenplays. The DVD also held a Corleone family tree, a \"Godfather\" timeline, and footage of the Academy Award acceptance speeches.\r\nThe restoration was confirmed by Francis Ford Coppola during a question-and-answer session for The Godfather Part III, when he said that he had just seen the new transfer and it was \"terrific\".\r\nRestoration\r\nAfter a careful restoration by Robert A. Harris of Film Preserve, the first two Godfather films were released on DVD and Blu-ray on September 23, 2008, under the title The Godfather: The Coppola Restoration. The Blu-ray Disc box set (four discs) includes high-definition extra features on the restoration and film. They are included on Disc 5 of the DVD box set (five discs).\r\nOther extras are ported over from Paramount's 2001 DVD release. There are slight differences between the repurposed extras on the DVD and Blu-ray Disc sets, with the HD box having more content.\r\nVideo game\r\nA video game based on the film was released for Windows, PlayStation 3 and Xbox 360 in April 2009 by Electronic Arts. It received negative reviews and sold poorly, leading Electronic Arts to cancel plans for a game based on The Godfather Part III.\r\nReception\r\nBox office\r\nAlthough The Godfather Part II did not surpass the original film commercially, it grossed $47.5 million in the United States and Canada. and was Paramount Pictures' highest-grossing film of 1974, and the seventh-highest-grossing picture in the United States. According to its international distributor, the film had grossed $45.3 million internationally by 1994, for a worldwide total of $93 million.\r\nCritical response\r\nInitial critical reception of The Godfather Part II was divided, with some dismissing the work and others declaring it superior to the first film. While its cinematography and acting were immediately acclaimed, many criticized it as overly slow-paced and convoluted. Vincent Canby of The New York Times viewed the film as \"stitched together from leftover parts. It talks. It moves in fits and starts but it has no mind of its own ... The plot defies any rational synopsis.\" Stanley Kauffmann of The New Republic accused the story of featuring \"gaps and distentions\".\r\nA mildly positive Roger Ebert awarded three out of four and wrote that the flashbacks \"give Coppola the greatest difficulty in maintaining his pace and narrative force. The story of Michael, told chronologically and without the other material, would have had really substantial impact, but Coppola prevents our complete involvement by breaking the tension.\" Though praising Pacino's performance and lauding Coppola as \"a master of mood, atmosphere, and period\", Ebert considered the chronological shifts of its narrative \"a structural weakness from which the film never recovers\". Gene Siskel gave the film three-and-a-half out of four, writing that it was at times \"as beautiful, as harrowing, and as exciting as the original. In fact, The Godfather, Part II may be the second best gangster movie ever made. But it's not the same. Sequels can never be the same. It's like being forced to go to a funeral the second time—the tears just don't flow as easily.\"\r\nCritical re-assessment\r\nThe film quickly became the subject of a critical re-evaluation. Whether considered separately or with its predecessor as one work, The Godfather Part II is now widely regarded as one of the greatest films in world cinema. Many critics compare it favorably with the original – although it is rarely ranked higher on lists of \"greatest\" films. On Rotten Tomatoes, it holds a 96% approval rating based on 123 reviews, with an average rating of 9.70/10. The consensus reads, \"Drawing on strong performances by Al Pacino and Robert De Niro, Francis Ford Coppola's continuation of Mario Puzo's Mafia saga set new standards for sequels that have yet to be matched or broken.\" Metacritic, which uses a weighted average, assigned the film a score of 90 out of 100 based on 18 critics, indicating \"universal acclaim\".\r\nEbert retrospectively awarded it a full four stars in a second review and inducted the film into his Great Movies section, noting he \"would not change a word\" of his original review but praising the work as \"grippingly written, directed with confidence and artistry, photographed by Gordon Willis ... in rich, warm tones.\" Michael Sragow's conclusion in his 2002 essay, selected for the National Film Registry web site, is that \"lthough The Godfather and The Godfather Part II depict an American family's moral defeat, as a mammoth, pioneering work of art it remains a national creative triumph.\" In his 2014 review of the film, Peter Bradshaw of The Guardian wrote \"Francis Coppola's breathtakingly ambitious prequel-sequel to his first Godfather movie is as gripping as ever. It is even better than the first film, and has the greatest single final scene in Hollywood history, a real coup de cinéma.\"\r\nThe Godfather Part II was featured on Sight & Sound's Director's list of the ten greatest films of all time in 1992 (ranked at No. 9) and 2002 (where it was ranked at No. 2. The critics ranked it at No. 4) On the 2012 list by the same magazine the film was ranked at No. 31 by critics and at No. 30 by directors. In 2006, Writers Guild of America ranked the film's screenplay (Written by Mario Puzo and Francis Ford Coppla) the 10th greatest ever. It ranked No. 7 on Entertainment Weekly's list of the \"100 Greatest Movies of All Time\", and #1 on TV Guide's 1999 list of the \"50 Greatest Movies of All Time on TV and Video\". The Village Voice ranked The Godfather Part II at No. 31 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. In January 2002, the film (along with The Godfather) made the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics.\r\nIn 2017, it ranked No. 12 on Empire magazine's reader's poll of The 100 Greatest Movies. In a earlier poll held by the same magazine in 2008, it was voted 19th on the list of 'The 500 Greatest Movies of All Time'. In 2015, it was tenth in the BBC's list of the 100 greatest American films.\r\nMany believe Pacino's performance in The Godfather Part II is his finest acting work, and the Academy of Motion Picture Arts and Sciences was criticized for awarding the Academy Award for Best Actor that year to Art Carney for his role in Harry and Tonto. It is now regarded as one of the greatest performances in film history. In 2006, Premiere issued its list of \"The 100 Greatest Performances of all Time\", putting Pacino's performance at #20. Later in 2009, Total Film issued \"The 150 Greatest Performances of All Time\", ranking Pacino's performance fourth place.\r\nThe Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.\r\nAccolades\r\nThis film is the first sequel to win the Academy Award for Best Picture. The Godfather and The Godfather Part II remain the only original/sequel combination both to win Best Picture. Along with The Lord of the Rings, The Godfather Trilogy shares the distinction that all of its installments were nominated for Best Picture; additionally, The Godfather Part II and The Lord of the Rings: The Return of the King are the only sequels to win Best Picture.\r\nAmerican Film Institute recognition\r\n1998: AFI's 100 Years...100 Movies – #32\r\n2003: AFI's 100 Years...100 Heroes & Villains: Michael Corleone – #11 Villain\r\nMichael Corleone – #11 Villain\r\n2005: AFI's 100 Years...100 Movie Quotes: \"Keep your friends close, but your enemies closer.\" – #58 \"I know it was you, Fredo. You broke my heart. You broke my heart.\" – Nominated \"Michael, we're bigger than U.S. Steel.\" – Nominated\r\n\"Keep your friends close, but your enemies closer.\" – #58\r\n\"I know it was you, Fredo. You broke my heart. You broke my heart.\" – Nominated\r\n\"Michael, we're bigger than U.S. Steel.\" – Nominated\r\n2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #32\r\n2008: AFI's 10 Top 10 – #3 Gangster Film and Nominated Epic Film",
    "html": "<p>The Godfather Part II is a 1974 American epic crime film produced and directed by Francis Ford Coppola. The film is partially based on the 1969 novel The Godfather by Mario Puzo, who co-wrote the screenplay with Coppola, and it is both a sequel and a prequel to the 1972 film The Godfather, presenting parallel dramas: one picks up the 1958 story of Michael Corleone (Al Pacino), the new Don of the Corleone family, protecting the family business in the aftermath of an attempt on his life; the prequel covers the journey of his father, Vito Corleone (Robert De Niro), from his Sicilian childhood to the founding of his family enterprise in New York City. The ensemble cast also features Robert Duvall, Diane Keaton, Talia Shire, Morgana King, John Cazale, Mariana Hill, and Lee Strasberg.</p><p>Following the success of the first film, Paramount Pictures began developing a follow-up, with many of the cast and crew returning. Coppola, who was given more creative control, had wanted to make both a sequel and a prequel to The Godfather that would tell the story of the rise of Vito and the fall of Michael. Principal photography began in October 1973 and wrapped up in June 1974. The Godfather Part II premiered in New York City on December 12, 1974, and was released in the United States on December 20, 1974, receiving divided reviews from critics; its reputation, however, improved rapidly, and it soon became the subject of critical re-appraisal. It grossed $48 million in the United States and Canada and up to $93 million worldwide on a $13 million budget. The film was nominated for eleven Academy Awards, and became the first sequel to win Best Picture. Its six Oscar wins also included Best Director for Coppola, Best Supporting Actor for De Niro and Best Adapted Screenplay for Coppola and Puzo. Pacino won Best Actor at the BAFTAs and was nominated at the Oscars.</p><p>Like its predecessor, Part II remains a highly influential film, especially in the gangster genre. It is considered to be one of the greatest films of all time, as well as the rare example of a sequel that may be superior to its predecessor. In 1997, the American Film Institute ranked it as the 32nd-greatest film in American film history and it retained this position 10 years later. It was selected for preservation in the U.S. National Film Registry of the Library of Congress in 1993, being deemed \"culturally, historically, or aesthetically significant\". The Godfather Part III, the final installment in the trilogy, was released in 1990.</p><br/><h3>Plot</h3><p>The film interweaves between events some time after The Godfather and the early life of Vito Corleone.</p><h4>Vito</h4><p>In 1901, nine-year-old Vito Andolini flees his country after his whole family is killed in Corleone, Sicily when his father insults local Mafia chieftain Don Ciccio. Vito escapes to New York City and is registered on arrival as \"Vito Corleone\". In 1917, Vito lives in New York with his wife, Carmela, and their infant son, Sonny. He loses his job due to the interference of Don Fanucci, a local Black Hand extortionist. His neighbor Peter Clemenza asks Vito to hide a bag of guns; as thanks, Clemenza enlists Vito's help in stealing a rug, which he gives to Carmela.</p><p>The Corleones have three more children: sons Fredo and Michael, and daughter Connie. Meanwhile, Vito, Clemenza, and new partner Salvatore Tessio make income by stealing goods and reselling them door-to-door. This enterprise attracts the attention of Fanucci, who extorts them. Vito convinces his skeptical partners that he will talk Fanucci into accepting a smaller payment. During a neighborhood festa, Vito pays an incredulous Fanucci a much smaller amount and is offered a job as an enforcer. Vito later kills Fanucci in his apartment. Vito becomes a formidable and well-respected community member by helping locals in exchange for \"favors\".</p><p>In 1923, Vito and his family visit Sicily, during which he and his business partner Don Tommasino visit Don Ciccio, ostensibly to ask for Ciccio's blessing on their olive oil business. Ciccio asks for the name of Vito's father; Vito reveals his identity and stabs Ciccio to death, avenging his family.</p><h4>Michael</h4><p>In 1958, during his son's First Communion party at Lake Tahoe, Michael has a series of meetings in his role as the don of the Corleone crime family. Frank Pentangeli, a Corleone capo, is dismayed that Michael refuses to help defend his Bronx territory against the Rosato brothers, who work for Hyman Roth, a Jewish Mob boss and long-standing Corleone business partner. Senator Pat Geary expects a bribe in exchange for helping Michael obtain casino gaming licenses and insults Italians generally and the Corleones specifically. Michael predicts that Geary will aid him with the licenses but will not be paid. That night, a failed assassination attempt at his home prompts Michael to suddenly depart after confiding in consigliere Tom Hagen that he suspects a traitor within the family.</p><p>Michael suspects Roth planned the assassination, but falsely tells Roth he suspects Pentangeli. In New York City, under Michael's instructions, Pentangeli attempts to make peace with the Rosatos, but they try to kill him. The attempt fails when a police officer enters the bar where the Rosatos are trying to kill Pentangeli, resulting in the Rosatos fleeing and a brief street shootout where Corleone soldier Willie Cicci is wounded.</p><p>In Nevada, Tom Hagen is called to a Carson City brothel run by Michael's older brother Fredo, where Geary has been implicated in the death of a prostitute. Unaware that Michael arranged the \"problem,\" Geary accepts Tom's offer to take care of it in return for Geary's political support.</p><p>A sickly Roth, Michael, and several of their partners travel to Havana to discuss their future Cuban business prospects under the cooperative government of Fulgencio Batista. Michael becomes reluctant to continue operating in Cuba given the ongoing Cuban Revolution. On New Year's Eve, Fredo pretends not to know Johnny Ola, Roth's right-hand man, but later inadvertently reveals they know each other, leading Michael to realize that Fredo is the traitor. Michael orders hits on Ola and Roth; his enforcer strangles Ola with a coat hanger but is killed by Cuban soldiers as he tries to smother Roth. Batista abdicates due to rebel advances. During the ensuing chaos, Michael, Fredo, and Roth separately escape Cuba. Back home, Michael is told that his wife Kay has miscarried.</p><p>In Washington, D.C., a Senate committee on organized crime is investigating the Corleone family, but Geary staunchly defends them. Pentangeli agrees to testify against Michael, who he believes had betrayed him to the Rosatos, and is placed under witness protection. On returning to Nevada, Fredo tells Michael that he did not know that Roth had intended to kill him, but that he resents being regarded as stupid by the family and feels that he should have taken over the family after their father's death. Michael disowns Fredo, but gives orders that he is not to be harmed while their mother is alive. Michael sends for Pentangeli's brother from Sicily, and Pentangeli, after seeing his brother in the hearing room, retracts his previous statement indicting Michael in organized crime; the hearing dissolves in an uproar. Kay reveals to Michael that she actually had an abortion, not a miscarriage, and that she intends to leave him and take their children. Outraged, Michael strikes Kay, banishes her from the family, and takes sole custody of the children.</p><p>Carmela dies some time later, and Michael hurries to wrap up loose ends. At the funeral, Michael appears to forgive Fredo at Connie's behest, but exchanges a glance with Corleone enforcer Al Neri suggesting that Fredo is to be killed. Kay visits her children; as she is saying goodbye, Michael arrives and closes the door on her. Roth is forced to return to the United States after being refused asylum and entry to Israel. On Michael's orders, Roth is assassinated by Corleone caporegime Rocco Lampone during an interview at the Miami International Airport; Lampone is killed in turn by a federal agent while attempting to flee the scene. At Pentangeli's compound, Hagen visits and the two discuss how failed plotters against the Roman emperor often committed suicide in return for clemency for their families; Pentangeli is later found dead in his bathtub, having slit his wrists. At the family compound, Michael has Connie retrieve his son as he was joining Fredo and Neri for a fishing excursion on the lake. Michael then watches from his den as Neri shoots Fredo dead.</p><p>Michael reminisces about Vito's 50th birthday party on December 7, 1941 (occurring on the same day that the Japanese bomb Pearl Harbor). While the family waits to surprise Vito, Michael announces that he has dropped out of college and joined the Marines, angering Sonny and surprising Hagen; Fredo is the only member of the family to support his decision. Vito is heard opening the door and everyone leaves the room to welcome him, while Michael sits alone.</p><p>In present day, Michael sits alone at the family compound, looking out over the lake.</p><br/><h3>Cast</h3><ul><li>Al Pacino as Michael Corleone</li><li>Robert Duvall as Tom Hagen</li><li>Diane Keaton as Kay Adams-Corleone</li><li>Robert De Niro as Vito Corleone Oreste Baldini as young Vito Corleone</li><li>Oreste Baldini as young Vito Corleone</li><li>John Cazale as Fredo Corleone</li><li>Talia Shire as Connie Corleone</li><li>Lee Strasberg as Hyman Roth</li><li>Michael V. Gazzo as Frank Pentangeli</li><li>G. D. Spradlin as Senator Pat Geary</li><li>Richard Bright as Al Neri</li><li>Gastone Moschin as Don Fanucci</li><li>Tom Rosqui as Rocco Lampone</li><li>Bruno Kirby as young Peter Clemenza</li><li>Frank Sivero as Genco Abbandando</li><li>Morgana King as Mama Carmela Corleone Francesca De Sapio as young Carmela Corleone</li><li>Francesca De Sapio as young Carmela Corleone</li><li>Marianna Hill as Deanna Corleone</li><li>Leopoldo Trieste as Signor Roberto</li><li>Dominic Chianese as Johnny Ola</li><li>Amerigo Tot as Michael's bodyguard</li><li>Troy Donahue as Merle Johnson</li><li>Joe Spinell as Willi Cicci</li><li>Abe Vigoda as Salvatore Tessio John Aprea as young Tessio</li><li>John Aprea as young Tessio</li><li>Harry Dean Stanton as an F.B.I. agent</li><li>Danny Aiello as Tony Rosato</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Puzo started writing a script for a sequel in December 1971, before The Godfather was even released; its initial title was The Death of Michael Corleone. Coppola's idea for the sequel would be to \"juxtapose the ascension of the family under Vito Corleone with the decline of the family under his son Michael ... I had always wanted to write a screenplay that told the story of a father and a son at the same age. They were both in their thirties and I would integrate the two stories ... In order not to merely make Godfather I over again, I gave Godfather II this double structure by extending the story in both the past and in the present.\" Coppola met with Martin Scorsese about directing the film, but Paramount refused. Coppola also, in his director's commentary on The Godfather Part II, mentioned that the scenes depicting the Senate committee interrogation of Michael Corleone and Frank Pentangeli are based on the Joseph Valachi federal hearings and that Pentangeli is a Valachi-like figure.</p><p>Production, however, nearly ended before it began when Pacino's lawyers told Coppola that he had grave misgivings with the script and was not coming. Coppola spent an entire night rewriting it before giving it to Pacino for his review. Pacino approved it and the production went forward. The film's original budget was $6 million but costs increased to over $11 million, with Variety's review claiming it was over $15 million.</p><h4>Casting</h4><p>Several actors from the first film did not return for the sequel. Marlon Brando initially agreed to return for the birthday flashback sequence, but the actor, feeling mistreated by the board at Paramount, failed to show up for the single day's shooting. Coppola then rewrote the scene that same day. Richard S. Castellano, who portrayed Peter Clemenza in the first film, also declined to return, as he and the producers could not reach an agreement on his demands that he be allowed to write the character's dialogue in the film, though this claim was disputed by Castellano's widow in a 1991 letter to People magazine. The part in the plot originally intended for the latter-day Clemenza was then filled by the character of Frank Pentangeli, played by Michael V. Gazzo.</p><p>Coppola offered James Cagney a part in the film, but he refused. James Caan agreed to reprise the role of Sonny in the birthday flashback sequence, demanding he be paid the same amount he received for the entire previous film for the single scene in Part II, which he received. Among the actors depicting Senators in the hearing committee are film producer/director Roger Corman, writer/producer William Bowers, producer Phil Feldman, and actor Peter Donat.</p><h4>Filming</h4><p>The Godfather Part II was shot between October 1, 1973 and June 19, 1974. The scenes that took place in Cuba were shot in Santo Domingo, Dominican Republic. Charles Bluhdorn, whose Gulf+Western conglomerate owned Paramount, felt strongly about developing the Dominican Republic as a movie-making site. Forza d'Agrò was the Sicilian town featured in the film.</p><p>Unlike with the first film, Coppola was given near-complete control over production. In his commentary, he said this resulted in a shoot that ran very smoothly despite multiple locations and two narratives running parallel within one film. Coppola discusses his decision to make this the first major U.S. motion picture to use \"Part II\" in its title in the director's commentary on the DVD edition of the film released in 2002. Paramount was initially opposed because they believed the audience would not be interested in an addition to a story they had already seen. But the director prevailed, and the film's success began the common practice of numbered sequels.</p><p>Only three weeks prior to the release, film critics and journalists pronounced Part II a disaster. The cross-cutting between Vito and Michael's parallel stories were judged too frequent, not allowing enough time to leave a lasting impression on the audience. Coppola and the editors returned to the cutting room to change the film's narrative structure, but could not complete the work in time, leaving the final scenes poorly timed at the opening.</p><p>It was the last major American motion picture to have release prints made with Technicolor's dye imbibition process until the late 1990s.</p><h4>Music</h4><br/><h3>Release</h3><h4>Theatrical</h4><p>The Godfather Part II premiered in New York City on December 12, 1974, and was released in the United States on December 20, 1974.</p><h4>Home media</h4><p>Coppola created The Godfather Saga expressly for American television in a 1975 release that combined The Godfather and The Godfather Part II with unused footage from those two films in a chronological telling that toned down the violent, sexual, and profane material for its NBC debut on November 18, 1977. In 1991, Paramount released the Godfather Epic VHS box set, which also told the story of the first two films in chronological order, again with additional scenes, but not redacted for broadcast sensibilities. Coppola returned to the film again in 1992 when he updated that release with footage from The Godfather Part III and more unreleased material. This home viewing release, under the title The Godfather Trilogy 1901–1980, had a total run time of 583 minutes (9 hours, 43 minutes), not including the set's bonus documentary by Jeff Werner on the making of the films, \"The Godfather Family: A Look Inside\".</p><p>The Godfather DVD Collection was released on October 9, 2001 in a package that contained all three films—each with a commentary track by Coppola—and a bonus disc that featured a 73-minute documentary from 1991 entitled The Godfather Family: A Look Inside and other miscellany about the film: the additional scenes originally contained in The Godfather Saga; Francis Coppola's Notebook (a look inside a notebook the director kept with him at all times during the production of the film); rehearsal footage; a promotional featurette from 1971; and video segments on Gordon Willis's cinematography, Nino Rota's and Carmine Coppola's music, the director, the locations and Mario Puzo's screenplays. The DVD also held a Corleone family tree, a \"Godfather\" timeline, and footage of the Academy Award acceptance speeches.</p><p>The restoration was confirmed by Francis Ford Coppola during a question-and-answer session for The Godfather Part III, when he said that he had just seen the new transfer and it was \"terrific\".</p><h4>Restoration</h4><p>After a careful restoration by Robert A. Harris of Film Preserve, the first two Godfather films were released on DVD and Blu-ray on September 23, 2008, under the title The Godfather: The Coppola Restoration. The Blu-ray Disc box set (four discs) includes high-definition extra features on the restoration and film. They are included on Disc 5 of the DVD box set (five discs).</p><p>Other extras are ported over from Paramount's 2001 DVD release. There are slight differences between the repurposed extras on the DVD and Blu-ray Disc sets, with the HD box having more content.</p><h4>Video game</h4><p>A video game based on the film was released for Windows, PlayStation 3 and Xbox 360 in April 2009 by Electronic Arts. It received negative reviews and sold poorly, leading Electronic Arts to cancel plans for a game based on The Godfather Part III.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Although The Godfather Part II did not surpass the original film commercially, it grossed $47.5 million in the United States and Canada. and was Paramount Pictures' highest-grossing film of 1974, and the seventh-highest-grossing picture in the United States. According to its international distributor, the film had grossed $45.3 million internationally by 1994, for a worldwide total of $93 million.</p><h4>Critical response</h4><p>Initial critical reception of The Godfather Part II was divided, with some dismissing the work and others declaring it superior to the first film. While its cinematography and acting were immediately acclaimed, many criticized it as overly slow-paced and convoluted. Vincent Canby of The New York Times viewed the film as \"stitched together from leftover parts. It talks. It moves in fits and starts but it has no mind of its own ... The plot defies any rational synopsis.\" Stanley Kauffmann of The New Republic accused the story of featuring \"gaps and distentions\".</p><p>A mildly positive Roger Ebert awarded three out of four and wrote that the flashbacks \"give Coppola the greatest difficulty in maintaining his pace and narrative force. The story of Michael, told chronologically and without the other material, would have had really substantial impact, but Coppola prevents our complete involvement by breaking the tension.\" Though praising Pacino's performance and lauding Coppola as \"a master of mood, atmosphere, and period\", Ebert considered the chronological shifts of its narrative \"a structural weakness from which the film never recovers\". Gene Siskel gave the film three-and-a-half out of four, writing that it was at times \"as beautiful, as harrowing, and as exciting as the original. In fact, The Godfather, Part II may be the second best gangster movie ever made. But it's not the same. Sequels can never be the same. It's like being forced to go to a funeral the second time—the tears just don't flow as easily.\"</p><h4>Critical re-assessment</h4><p>The film quickly became the subject of a critical re-evaluation. Whether considered separately or with its predecessor as one work, The Godfather Part II is now widely regarded as one of the greatest films in world cinema. Many critics compare it favorably with the original – although it is rarely ranked higher on lists of \"greatest\" films. On Rotten Tomatoes, it holds a 96% approval rating based on 123 reviews, with an average rating of 9.70/10. The consensus reads, \"Drawing on strong performances by Al Pacino and Robert De Niro, Francis Ford Coppola's continuation of Mario Puzo's Mafia saga set new standards for sequels that have yet to be matched or broken.\" Metacritic, which uses a weighted average, assigned the film a score of 90 out of 100 based on 18 critics, indicating \"universal acclaim\".</p><p>Ebert retrospectively awarded it a full four stars in a second review and inducted the film into his Great Movies section, noting he \"would not change a word\" of his original review but praising the work as \"grippingly written, directed with confidence and artistry, photographed by Gordon Willis ... in rich, warm tones.\" Michael Sragow's conclusion in his 2002 essay, selected for the National Film Registry web site, is that \"lthough The Godfather and The Godfather Part II depict an American family's moral defeat, as a mammoth, pioneering work of art it remains a national creative triumph.\" In his 2014 review of the film, Peter Bradshaw of The Guardian wrote \"Francis Coppola's breathtakingly ambitious prequel-sequel to his first Godfather movie is as gripping as ever. It is even better than the first film, and has the greatest single final scene in Hollywood history, a real coup de cinéma.\"</p><p>The Godfather Part II was featured on Sight & Sound's Director's list of the ten greatest films of all time in 1992 (ranked at No. 9) and 2002 (where it was ranked at No. 2. The critics ranked it at No. 4) On the 2012 list by the same magazine the film was ranked at No. 31 by critics and at No. 30 by directors. In 2006, Writers Guild of America ranked the film's screenplay (Written by Mario Puzo and Francis Ford Coppla) the 10th greatest ever. It ranked No. 7 on Entertainment Weekly's list of the \"100 Greatest Movies of All Time\", and #1 on TV Guide's 1999 list of the \"50 Greatest Movies of All Time on TV and Video\". The Village Voice ranked The Godfather Part II at No. 31 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. In January 2002, the film (along with The Godfather) made the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics.</p><p>In 2017, it ranked No. 12 on Empire magazine's reader's poll of The 100 Greatest Movies. In a earlier poll held by the same magazine in 2008, it was voted 19th on the list of 'The 500 Greatest Movies of All Time'. In 2015, it was tenth in the BBC's list of the 100 greatest American films.</p><p>Many believe Pacino's performance in The Godfather Part II is his finest acting work, and the Academy of Motion Picture Arts and Sciences was criticized for awarding the Academy Award for Best Actor that year to Art Carney for his role in Harry and Tonto. It is now regarded as one of the greatest performances in film history. In 2006, Premiere issued its list of \"The 100 Greatest Performances of all Time\", putting Pacino's performance at #20. Later in 2009, Total Film issued \"The 150 Greatest Performances of All Time\", ranking Pacino's performance fourth place.</p><p>The Japanese filmmaker Akira Kurosawa cited this movie as one of his 100 favorite films.</p><h4>Accolades</h4><p>This film is the first sequel to win the Academy Award for Best Picture. The Godfather and The Godfather Part II remain the only original/sequel combination both to win Best Picture. Along with The Lord of the Rings, The Godfather Trilogy shares the distinction that all of its installments were nominated for Best Picture; additionally, The Godfather Part II and The Lord of the Rings: The Return of the King are the only sequels to win Best Picture.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th></tr><tr><td rowspan=\"11\"><span>47th Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Francis Ford Coppola</span>, <span>Gray Frederickson</span> and <span>Fred Roos</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Al Pacino</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Best Supporting Actor</span></td><td><span>Robert De Niro</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Michael V. Gazzo</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Lee Strasberg</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Talia Shire</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Adapted Screenplay</span></td><td>Francis Ford Coppola and <span>Mario Puzo</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td><span>Dean Tavoularis</span>, <span>Angelo P. Graham</span> and <span>George R. Nelson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Theadora Van Runkle</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Dramatic Score</span></td><td><span>Nino Rota</span> and <span>Carmine Coppola</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>29th British Academy Film Awards</span></td><td><span>Best Actor</span></td><td>Al Pacino<small> (Also for <i><span>Dog Day Afternoon</span></i>)</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Most Promising Newcomer to Leading Film Roles</span></td><td>Robert De Niro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Film Music</span></td><td>Nino Rota</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Peter Zinner</span>, <span>Barry Malkin</span>, and <span>Richard Marks</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>27th Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>32nd Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Motion Picture Actor – Drama</span></td><td>Al Pacino</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Most Promising Newcomer – Male</span></td><td>Lee Strasberg</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Francis Ford Coppola and Mario Puzo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Score</span></td><td>Nino Rota</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>9th National Society of Film Critics Awards</span></td><td><span>Best Director</span></td><td>Francis Ford Coppla</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>27th Writers Guild of America Awards</span></td><td><span>Best Drama Adapted from Another Medium</span></td><td>Francis Ford Coppola and Mario Puzo</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><h4>American Film Institute recognition</h4><ul><li>1998: AFI's 100 Years...100 Movies – #32</li><li>2003: AFI's 100 Years...100 Heroes & Villains: Michael Corleone – #11 Villain</li><li>Michael Corleone – #11 Villain</li><li>2005: AFI's 100 Years...100 Movie Quotes: \"Keep your friends close, but your enemies closer.\" – #58 \"I know it was you, Fredo. You broke my heart. You broke my heart.\" – Nominated \"Michael, we're bigger than U.S. Steel.\" – Nominated</li><li>\"Keep your friends close, but your enemies closer.\" – #58</li><li>\"I know it was you, Fredo. You broke my heart. You broke my heart.\" – Nominated</li><li>\"Michael, we're bigger than U.S. Steel.\" – Nominated</li><li>2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #32</li><li>2008: AFI's 10 Top 10 – #3 Gangster Film and Nominated Epic Film</li></ul><br/>"
  },
  "errorMessage": ""
}