{
  "imDbId": "tt3170832",
  "title": "Room",
  "fullTitle": "Room (2015)",
  "type": "Movie",
  "year": "2015",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Chris Nashawaty",
      "link": "https://ew.com/article/2015/10/08/room-ew-review/",
      "rate": "100",
      "content": "Room is more than the title of one of the year’s most powerful movies — it’s a state of mind that’s unbearably tense and as claustrophobic as a straitjacket"
    },
    {
      "publisher": "Hitfix",
      "author": "Gregory Ellwood",
      "link": "https://uproxx.com/entertainment/",
      "rate": "91",
      "content": "Room is simply a movie about mother and son trying to adapt to the outside world after years of forced captivity. And the surprise is how succinctly it captures this drastic life change from the perspective of five-year-old."
    },
    {
      "publisher": "IndieWire",
      "author": "Eric Kohn",
      "link": "https://www.indiewire.com/criticism/culture/telluride-review-brie-larson-is-a-revelation-alongside-stunning-newcomer-jacob-tremblay-in-room-58523/",
      "rate": "91",
      "content": "Director Lenny Abrahamson seamlessly translates Donoghue's work into cinematic terms with his relentlessly compelling adaptation. However, the drama owes just as much to its two stars, Brie Larson and newcomer Jacob Tremblay, whose textured performances turn outrageous circumstances into a tense and surprisingly credible survival tale."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Elise Nakhnikian",
      "link": "",
      "rate": "88",
      "content": "The film, never sensational or saccharine, is a tough but tender tribute to the creative power of maternal love."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2016/jan/14/room-review-brie-larson-shines-in-a-dark-dungeon",
      "rate": "80",
      "content": "There are some plausibility issues in Room, but this is a disturbing and absorbing film, shrewdly acted, particularly by Larson. It lets the audience in; it does not just let the nightmare stun them into submission. You make a real emotional engagement."
    },
    {
      "publisher": "Time Out",
      "author": "David Ehrlich",
      "link": "",
      "rate": "80",
      "content": "If Abrahamson were as gifted with a camera as he was with his cast (he inspires subtlety even from the tiny Tremblay), Room could have been truly worthy of the astonishing performances that provide its foundation."
    },
    {
      "publisher": "Variety",
      "author": "Justin Chang",
      "link": "https://variety.com/2015/film/festivals/telluride-film-review-brie-larson-in-room-1201584736/",
      "rate": "80",
      "content": "It’s a testament to the story’s underlying integrity that, even when deprived of some of the elements that made Emma Donoghue’s 2010 book so gripping, director Lenny Abrahamson’s inevitably telescoped but beautifully handled adaptation retains considerable emotional impact."
    },
    {
      "publisher": "The Playlist",
      "author": "Rodrigo Perez",
      "link": "https://www.indiewire.com/criticism/culture/telluride-review-lenny-abrahamsons-room-starring-brie-larson-jacob-tremblay-260178/",
      "rate": "75",
      "content": "Room has unforgettable, must-witness performances, and its soulful mother and son narrative is one of the most touching dynamics you’ll see in theaters this year."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Todd McCarthy",
      "link": "https://www.hollywoodreporter.com/news/general-news/room-telluride-review-820547/",
      "rate": "70",
      "content": "Overall, it’s a decent shot at a tall target, but real credit is due the lead actors, with Larson expanding beyond the already considerable range she’s previously shown with an exceedingly dimensional performance in a role that calls for running the gamut, and Tremblay always convincing without ever becoming cloying."
    },
    {
      "publisher": "The Telegraph",
      "author": "Tim Robey",
      "link": "https://www.telegraph.co.uk/films/2016/04/14/room-review-less-powerful-than-the-book/",
      "rate": "60",
      "content": "It ought to be a triumph. Somehow, though, it lacks the flooding emotional force Donoghue gave it on the page."
    }
  ],
  "errorMessage": ""
}