{
  "imDbId": "tt3170832",
  "title": "Room",
  "fullTitle": "Room (2015)",
  "type": "Movie",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Room (2015 film)",
  "url": "https://en.wikipedia.org/wiki/Room_(2015_film)",
  "plotShort": {
    "plainText": "Room is a 2015 drama film directed by Lenny Abrahamson and written by Emma Donoghue, based on her 2010 novel of the same name. It stars Brie Larson as a young woman who has been held captive for seven years and whose five-year-old son (Jacob Tremblay) was born in captivity. Their escape allows the boy to experience the outside world for the first time. The film also stars Joan Allen, Sean Bridgers, Tom McCamus and William H. Macy.\r\nThe film was a co-production of Canada, Ireland, the United Kingdom, and the United States and was shot in Toronto, with the eponymous set built at Pinewood Toronto Studios. The crew designed each part of the set of the room to be removable to provide access for the crew. Larson researched trauma and nutrition for her part.\r\nRoom premiered at the 42nd Telluride Film Festival on September 4, 2015, and later screened at the 2015 Toronto International Film Festival, where it won the People's Choice Award. The film was theatrically released in Canada on October 23, 2015 by Elevation Pictures and in the United Kingdom and Ireland on January 15, 2016 by StudioCanal. It began a limited theatrical run in the United States on October 16, 2015 and the wide expansion so far on January 22, 2016, by A24. The film was acclaimed by critics, who particularly praised the performances of Larson and Tremblay and the storytelling, and grossed $36.3 million on a $13 million budget.\r\nCited as one of the best films of the year, Room received numerous awards and nominations. At the 88th Academy Awards, Room received four nominations, including Best Picture. It also won nine Canadian Screen Awards, including Best Motion Picture, and seven Irish Film & Television Awards, including Best Film. Larson won the Academy Award, Golden Globe Award and the BAFTA Award for Best Actress.",
    "html": "<p>Room is a 2015 drama film directed by Lenny Abrahamson and written by Emma Donoghue, based on her 2010 novel of the same name. It stars Brie Larson as a young woman who has been held captive for seven years and whose five-year-old son (Jacob Tremblay) was born in captivity. Their escape allows the boy to experience the outside world for the first time. The film also stars Joan Allen, Sean Bridgers, Tom McCamus and William H. Macy.</p><p>The film was a co-production of Canada, Ireland, the United Kingdom, and the United States and was shot in Toronto, with the eponymous set built at Pinewood Toronto Studios. The crew designed each part of the set of the room to be removable to provide access for the crew. Larson researched trauma and nutrition for her part.</p><p>Room premiered at the 42nd Telluride Film Festival on September 4, 2015, and later screened at the 2015 Toronto International Film Festival, where it won the People's Choice Award. The film was theatrically released in Canada on October 23, 2015 by Elevation Pictures and in the United Kingdom and Ireland on January 15, 2016 by StudioCanal. It began a limited theatrical run in the United States on October 16, 2015 and the wide expansion so far on January 22, 2016, by A24. The film was acclaimed by critics, who particularly praised the performances of Larson and Tremblay and the storytelling, and grossed $36.3 million on a $13 million budget.</p><p>Cited as one of the best films of the year, Room received numerous awards and nominations. At the 88th Academy Awards, Room received four nominations, including Best Picture. It also won nine Canadian Screen Awards, including Best Motion Picture, and seven Irish Film & Television Awards, including Best Film. Larson won the Academy Award, Golden Globe Award and the BAFTA Award for Best Actress.</p>"
  },
  "plotFull": {
    "plainText": "Room is a 2015 drama film directed by Lenny Abrahamson and written by Emma Donoghue, based on her 2010 novel of the same name. It stars Brie Larson as a young woman who has been held captive for seven years and whose five-year-old son (Jacob Tremblay) was born in captivity. Their escape allows the boy to experience the outside world for the first time. The film also stars Joan Allen, Sean Bridgers, Tom McCamus and William H. Macy.\r\nThe film was a co-production of Canada, Ireland, the United Kingdom, and the United States and was shot in Toronto, with the eponymous set built at Pinewood Toronto Studios. The crew designed each part of the set of the room to be removable to provide access for the crew. Larson researched trauma and nutrition for her part.\r\nRoom premiered at the 42nd Telluride Film Festival on September 4, 2015, and later screened at the 2015 Toronto International Film Festival, where it won the People's Choice Award. The film was theatrically released in Canada on October 23, 2015 by Elevation Pictures and in the United Kingdom and Ireland on January 15, 2016 by StudioCanal. It began a limited theatrical run in the United States on October 16, 2015 and the wide expansion so far on January 22, 2016, by A24. The film was acclaimed by critics, who particularly praised the performances of Larson and Tremblay and the storytelling, and grossed $36.3 million on a $13 million budget.\r\nCited as one of the best films of the year, Room received numerous awards and nominations. At the 88th Academy Awards, Room received four nominations, including Best Picture. It also won nine Canadian Screen Awards, including Best Motion Picture, and seven Irish Film & Television Awards, including Best Film. Larson won the Academy Award, Golden Globe Award and the BAFTA Award for Best Actress.\r\nPlot\r\nIn Akron, Ohio, 24-year-old Joy Newsome and her five-year-old son Jack live in a squalid shed they call \"Room\". They share a bed, toilet, bathtub, television, and rudimentary kitchen; the only window is a skylight. They are captives of a man they call \"Old Nick\", Jack's biological father, who abducted Joy seven years prior and routinely rapes her while Jack sleeps in the closet. She tries to stay optimistic for her son but suffers from malnutrition and depression. She allows Jack to believe that only Room and its contents are real, and that the rest of the world exists only on television.\r\nOld Nick tells Joy that he has lost his job and may not be able to afford their supplies in the future. That night, Jack is overcome with curiosity and ventures out of the closet while Old Nick is asleep in bed with his mother. Joy is horrified when she awakens and sees their interaction, slapping Old Nick away. As punishment, he cuts their heat and power. Joy decides to tell Jack about the outside world; he reacts with disbelief and incomprehension, but also curiosity. She has Jack fake a fever, hoping that Old Nick will take him to a hospital where he can alert the authorities, but Old Nick says he will return the following day with antibiotics.\r\nJoy plans to help Jack escape Room by telling Old Nick that Jack has died from his illness. She wraps Jack in a carpet and has him play dead, telling him to run to the first person he sees for help. Falling for the ruse, Old Nick places Jack in the back of his pickup truck and drives through a residential neighborhood. Although stunned by his first exposure to the outside world, Jack jumps from the truck and attracts the attention of a passerby. Old Nick attempts to drag Jack back to his truck, but fails in the process. He drops Jack and flees the scene. The police arrive and rescue Jack. The police discover Joy as well, and take her and Jack to a hospital. Old Nick is found and arrested.\r\nReunited with her family, Joy learns that her parents have divorced and that her mother has a new partner, Leo. She returns with Jack to her childhood home where her mother and Leo live. Her father cannot accept Jack as his grandchild and leaves. Jack struggles to adjust to life in the larger world, speaking only to his mother and expressing a desire to return to Room. Joy struggles with anger and depression, lashing out at her mother and becoming worried about Jack's lack of interaction with \"real\" things.\r\nAt the suggestion of the family's lawyer as a way to earn money, Joy agrees to a television interview, but becomes upset when the interviewer questions her decision to keep the newborn Jack instead of asking her captor to take him to a hospital, so he could have a chance at a normal life. Overwhelmed, she subsequently attempts suicide after which Jack finds her unconscious in the bathroom, and she is admitted to a hospital.\r\nJack misses his mother but begins to settle into his new life. He bonds with his new family, meets Leo's dog, Seamus, and makes friends with a boy his age. Believing his long hair will give Joy the strength she needs to recover, Jack has his grandmother cut it for him so he can send it to her. Joy returns home and apologizes for her suicide attempt, thanking Jack for saving her life again. Joy and Jack begin to embrace life and do many activities that they enjoy. At Jack's request, they visit Room one last time, escorted by police. Jack is confused; he feels it has shrunk and that it is a different place with the door open. He and Joy say their goodbyes to Room and leave.\r\nCast\r\nBrie Larson as Joy \"Ma\" Newsome\r\nJacob Tremblay as Jack Newsome\r\nJoan Allen as Nancy Newsome\r\nWilliam H. Macy as Robert Newsome\r\nSean Bridgers as Old Nick\r\nTom McCamus as Leo\r\nAmanda Brugel as Officer Parker\r\nJoe Pingue as Officer Tom Grabowski\r\nCas Anvar as Dr. Mittal\r\nWendy Crewson as Talk Show Hostess\r\nRodrigo Fernandez-Stoll as Reporter #2\r\nProduction\r\nDevelopment\r\nEmma Donoghue, who also wrote the novel on which the film is based, wrote the screenplay for the film before the novel was published in 2010. She explained she felt sure the book could be made into a film because of its structured storyline, and received many offers from filmmakers after it was published, which she rejected for creative reasons. Director Lenny Abrahamson read the novel and sent Donoghue a 10-page fan letter telling her it should be a film, without knowing a screenplay already existed. Donoghue felt the letter demonstrated an understanding of her work and advocated for him as director.\r\nIn 2012, Abrahamson and Donoghue spent one week at her house in London, Ontario as they revised the screenplay. She served as executive producer and was included in major filmmaking decisions. Abrahamson credited Donoghue with securing funding from Canada, where she is a citizen. She also suggested shooting in Toronto because it could resemble the United States. Canadian producer David Gross helped persuade his Irish co-producers to shoot in Canada rather than the U.S., saying they could have a longer schedule and more money in Canada.\r\nCasting\r\nEmma Watson, Rooney Mara, Shailene Woodley and Mia Wasikowska were considered for the role of Joy. Brie Larson was cast after an associate of Abrahamson suggested he see her performance in Short Term 12 (2013). Larson consulted with a trauma expert and nutritionist for the role, went on a restrictive diet, and avoided sunlight. She said she saw Room less as a crime story and more of \"a story of love and freedom and perseverance and what it feels like to grow up and become your own person\".\r\nThe filmmakers considered dozens of child actors for Jack before casting seven-year-old Jacob Tremblay from Vancouver. Tremblay said his role was not hard \"because I was playing a happy child\" unaware of the sinister nature of Room. As he was too young to read the whole screenplay, each scene was explained to him one by one. Tremblay wore a wig made from human hair. According to Joan Allen, who played Nancy, Larson and Tremblay met for over three weeks to build a \"very tight, obviously critical, close relationship\", before the Room scenes were shot over five weeks. Allen arrived in Toronto later and met Tremblay, with Allen noting, however, that \"we didn't want him to become too familiar with me because that's not what the story is.\"\r\nIn preparation for her own role, Allen did not consult real mothers of kidnapped children, but said she reflected on her own experiences \"in a mall when my daughter was little and I look around and within a flash she's not there\". Canadian actor Tom McCamus auditioned for the part of Old Nick before being cast as Leo. The actors improvised some lines, with Donoghue saying they created \"speech patterns more natural-sounding than I could have written, and produced some brilliant new lines that ended up in the film.\"\r\nFilming\r\nAbrahamson used only one Room set, wanting to create an authentic experience for Tremblay. The set, built on a soundstage at Pinewood Toronto Studios, was 11 ft × 11 ft (3.4 m × 3.4 m). Montreal production designer Ethan Tobman set out with the idea \"that every square inch of Room needed to have a backstory\". To fit the crew and equipment into the small space, he made each piece of the set removable. However, as Abrahamson and cinematographer Danny Cohen wanted the camera to always shoot scenes from inside Room, the lens was always positioned within the set even if the rest of the camera was outside. There were as many as eight cameramen at a time inside the Room set with Larson and Tremblay. The actors also made the props decorating the set.\r\nBecause the scenes set outside Room were filmed after the scenes inside, the crew was initially eager to leave the cramped space, expecting that the rest of the film would be easy. However, they had difficulty adjusting to the cold weather, traffic and crowds in Toronto. Cohen remarked that upon returning to the Room set for the final scene, the set appeared smaller to the crew. Toronto also doubles for Akron, where the exterior scenes are set.\r\nCohen used a Panavision Primos lens on a Red Epic Dragon camera, saying \"The Primos and using Kino Flos, which is more akin to fluorescent lighting, gave Room a certain texture, a certain look.\" Principal photography began on November 10, 2014 and wrapped on December 15, 2014.\r\nPost-production\r\nEditor Nathan Nugent served as second-unit director. He described his editing of Room as simplistic, keeping the acting intact, while working in Dublin for five months. However, Tremblay's part was filmed in numerous takes so Tremblay could give variations of his performances of specific lines, so Abrahamson and Nugent had to assemble and splice the different takes in the editing process.\r\nRelease\r\nPrior to production, A24 acquired U.S. distribution rights to the film. Room had its world premiere on September 4, 2015, at the 42nd Telluride Film Festival. It went on to screen in the Special Presentations section at the 2015 Toronto International Film Festival. and at the London Film Festival, on October 11, 2015. The film began a limited release on October 15, 2015. Room was released in the United Kingdom and Ireland on January 15, 2016, by StudioCanal. It went into wide release on January 22, 2016.\r\nThe film was released by Lionsgate on DVD and Blu-ray in the United States on March 1, 2016. It was released on DVD and Blu-ray in the United Kingdom and Ireland in May 2016.\r\nReception\r\nBox office\r\nAfter its U.S. release on October 16, 2015, Room played in a peak of 198 theaters from December 11 to 13, and grossed $5,166,724 before its Academy Award nominations were announced, making it one of the lowest-grossing Best Picture nominees in years. Initial box office under-performance came as a surprise to Canada's Elevation Pictures, since winning the People's Choice Award at the Toronto International Film Festival was usually a predictor of financial success. However, the nominations gave the film a boost at the box office, and after opening in the Republic of Ireland on 15 January, it initially made €200,000 at 50 theatres.\r\nA month after its release in Ireland, it had grossed more than €1 million nationwide. On 24 April, Room completed its run having grossed an estimated $14.7 million in North America and $20.7 million in other territories, for a worldwide total of $36.3 million on a $13 million budget.\r\nCritical response\r\nRoom received critical acclaim. Review aggregation website Rotten Tomatoes gives the film a rating of 93%, based on 319 reviews, with an average rating of 8.5/10. The site's critical consensus states, \"Led by incredible work from Brie Larson and Jacob Tremblay, Room makes for an unforgettably harrowing—and undeniably rewarding—experience.\" Metacritic gives the film a weighted average score of 86 out of 100, based on reviews from 43 critics, indicating \"universal acclaim\".\r\nTodd McCarthy from The Hollywood Reporter wrote, \"Overall, it's a decent shot at a tall target, but real credit is due the lead actors, with Larson expanding beyond the already considerable range she's previously shown with an exceedingly dimensional performance in a role that calls for running the gamut, and Tremblay always convincing without ever becoming cloying.\" Eric Kohn of IndieWire stated, \"Brie Larson and newcomer Jacob Tremblay... textured performances turn outrageous circumstances into a tense and surprisingly credible survival tale.\" Richard Roeper of the Chicago Sun-Times called the film \"the most impressive piece of filmmaking I've seen in 2015, and one of the best movies of the decade\". Rex Reed said Room is \"so powerful and unforgettable that it must be seen\" but \"too grim and heartbreaking for some viewers\".\r\nThe central performances of Brie Larson and Jacob Tremblay have received critical acclaim. Joe Morgenstern of The Wall Street Journal said \"this drama is as big as all outdoors in scope; poetic and profound in its exploration of the senses; blessed with two transcendent performances, by Brie Larson and Jacob Tremblay; and as elegantly wrought as any film that has come our way in a very long while.\" Peter Travers of Rolling Stone wrote, \"All you need to know is that the performances of Larson and Tremblay will blow you away. Tremblay is a child actor incapable of a false move. And Larson, so good in Short Term 12, is magnificent, finding a way into Joy's bruised psyche that tears at your heart.\"\r\nThe film received positive reviews in its countries of origin, with Barry Hertz of Canada's The Globe and Mail writing \"Room is a film of tiny little miracles,\" finding it uplifting, praising Larson's performance and referring to Tremblay as \"a wide-eyed wonder who is always genuine\". Chris Knight for the National Post called Tremblay \"preternaturally talented\", and said Room \"works on a tiny canvas, but in doing so it emphasizes that great things can be accomplished in tight spaces\". Liz Braun of the Toronto Sun said Jack's narration made the Room scenes \"joyful\" as well as claustrophobic, and that Larson and Tremblay's performances are \"completely engaging\". Linda Barnard of the Toronto Star called Room \"equally tender and chilling\", In Ireland, Donald Clarke of The Irish Times gave the film five stars, calling it \"harrowing\", and concluded, \"We are left with a film that manages a degree of optimism in the most unpromising circumstances. It is a substantial achievement.\" Daniel Anderson, writing for the Irish Examiner, called Room \"an utterly unique tale which has seen the filmmaker deservedly thrust onto the world stage\", but also \"bleak\" and \"difficult to recommend\".\r\nDissenting, Kyle Smith of the New York Post wrote \"The script ... doesn't illuminate what kind of internal damage might be wrought by being held prisoner for seven years: On-screen it simply looks like Joy has a case of the sads.\" Matthew Lickona of the San Diego Reader also called it \"a cowardly movie about brave people\".\r\nAccolades\r\nRoom has received many awards and nominations. Brie Larson's performance in particular has been singled out for awards, being chosen as Best Actress by the National Board of Review, the Chicago Film Critics, various other film critic organizations, the Academy Awards, the Critics' Choice Award, the Screen Actors Guild,BAFTA and the Golden Globe Award.Emma Donoghue's screenplay and Jacob Tremblay's performance have also received awards' attention. The film received four nominations for the 88th Academy Awards. Room was named one of the best films of 2015 by over 50 critics and publications.\r\nThe film also won nine Canadian Screen Awards, including Best Motion Picture, Best Direction for Abrahamson, Best Adapted Screenplay for Donoghue, Best Actor in a Leading Role for Tremblay, and Best Actress in a Leading Role for Larson. It won seven awards at the 13th Irish Film & Television Awards, including Best Film, Director for Abrahamson, script for Donoghue and International Actress for Larson.",
    "html": "<p>Room is a 2015 drama film directed by Lenny Abrahamson and written by Emma Donoghue, based on her 2010 novel of the same name. It stars Brie Larson as a young woman who has been held captive for seven years and whose five-year-old son (Jacob Tremblay) was born in captivity. Their escape allows the boy to experience the outside world for the first time. The film also stars Joan Allen, Sean Bridgers, Tom McCamus and William H. Macy.</p><p>The film was a co-production of Canada, Ireland, the United Kingdom, and the United States and was shot in Toronto, with the eponymous set built at Pinewood Toronto Studios. The crew designed each part of the set of the room to be removable to provide access for the crew. Larson researched trauma and nutrition for her part.</p><p>Room premiered at the 42nd Telluride Film Festival on September 4, 2015, and later screened at the 2015 Toronto International Film Festival, where it won the People's Choice Award. The film was theatrically released in Canada on October 23, 2015 by Elevation Pictures and in the United Kingdom and Ireland on January 15, 2016 by StudioCanal. It began a limited theatrical run in the United States on October 16, 2015 and the wide expansion so far on January 22, 2016, by A24. The film was acclaimed by critics, who particularly praised the performances of Larson and Tremblay and the storytelling, and grossed $36.3 million on a $13 million budget.</p><p>Cited as one of the best films of the year, Room received numerous awards and nominations. At the 88th Academy Awards, Room received four nominations, including Best Picture. It also won nine Canadian Screen Awards, including Best Motion Picture, and seven Irish Film & Television Awards, including Best Film. Larson won the Academy Award, Golden Globe Award and the BAFTA Award for Best Actress.</p><br/><h3>Plot</h3><p>In Akron, Ohio, 24-year-old Joy Newsome and her five-year-old son Jack live in a squalid shed they call \"Room\". They share a bed, toilet, bathtub, television, and rudimentary kitchen; the only window is a skylight. They are captives of a man they call \"Old Nick\", Jack's biological father, who abducted Joy seven years prior and routinely rapes her while Jack sleeps in the closet. She tries to stay optimistic for her son but suffers from malnutrition and depression. She allows Jack to believe that only Room and its contents are real, and that the rest of the world exists only on television.</p><p>Old Nick tells Joy that he has lost his job and may not be able to afford their supplies in the future. That night, Jack is overcome with curiosity and ventures out of the closet while Old Nick is asleep in bed with his mother. Joy is horrified when she awakens and sees their interaction, slapping Old Nick away. As punishment, he cuts their heat and power. Joy decides to tell Jack about the outside world; he reacts with disbelief and incomprehension, but also curiosity. She has Jack fake a fever, hoping that Old Nick will take him to a hospital where he can alert the authorities, but Old Nick says he will return the following day with antibiotics.</p><p>Joy plans to help Jack escape Room by telling Old Nick that Jack has died from his illness. She wraps Jack in a carpet and has him play dead, telling him to run to the first person he sees for help. Falling for the ruse, Old Nick places Jack in the back of his pickup truck and drives through a residential neighborhood. Although stunned by his first exposure to the outside world, Jack jumps from the truck and attracts the attention of a passerby. Old Nick attempts to drag Jack back to his truck, but fails in the process. He drops Jack and flees the scene. The police arrive and rescue Jack. The police discover Joy as well, and take her and Jack to a hospital. Old Nick is found and arrested.</p><p>Reunited with her family, Joy learns that her parents have divorced and that her mother has a new partner, Leo. She returns with Jack to her childhood home where her mother and Leo live. Her father cannot accept Jack as his grandchild and leaves. Jack struggles to adjust to life in the larger world, speaking only to his mother and expressing a desire to return to Room. Joy struggles with anger and depression, lashing out at her mother and becoming worried about Jack's lack of interaction with \"real\" things.</p><p>At the suggestion of the family's lawyer as a way to earn money, Joy agrees to a television interview, but becomes upset when the interviewer questions her decision to keep the newborn Jack instead of asking her captor to take him to a hospital, so he could have a chance at a normal life. Overwhelmed, she subsequently attempts suicide after which Jack finds her unconscious in the bathroom, and she is admitted to a hospital.</p><p>Jack misses his mother but begins to settle into his new life. He bonds with his new family, meets Leo's dog, Seamus, and makes friends with a boy his age. Believing his long hair will give Joy the strength she needs to recover, Jack has his grandmother cut it for him so he can send it to her. Joy returns home and apologizes for her suicide attempt, thanking Jack for saving her life again. Joy and Jack begin to embrace life and do many activities that they enjoy. At Jack's request, they visit Room one last time, escorted by police. Jack is confused; he feels it has shrunk and that it is a different place with the door open. He and Joy say their goodbyes to Room and leave.</p><br/><h3>Cast</h3><ul><li>Brie Larson as Joy \"Ma\" Newsome</li><li>Jacob Tremblay as Jack Newsome</li><li>Joan Allen as Nancy Newsome</li><li>William H. Macy as Robert Newsome</li><li>Sean Bridgers as Old Nick</li><li>Tom McCamus as Leo</li><li>Amanda Brugel as Officer Parker</li><li>Joe Pingue as Officer Tom Grabowski</li><li>Cas Anvar as Dr. Mittal</li><li>Wendy Crewson as Talk Show Hostess</li><li>Rodrigo Fernandez-Stoll as Reporter #2</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Emma Donoghue, who also wrote the novel on which the film is based, wrote the screenplay for the film before the novel was published in 2010. She explained she felt sure the book could be made into a film because of its structured storyline, and received many offers from filmmakers after it was published, which she rejected for creative reasons. Director Lenny Abrahamson read the novel and sent Donoghue a 10-page fan letter telling her it should be a film, without knowing a screenplay already existed. Donoghue felt the letter demonstrated an understanding of her work and advocated for him as director.</p><p>In 2012, Abrahamson and Donoghue spent one week at her house in London, Ontario as they revised the screenplay. She served as executive producer and was included in major filmmaking decisions. Abrahamson credited Donoghue with securing funding from Canada, where she is a citizen. She also suggested shooting in Toronto because it could resemble the United States. Canadian producer David Gross helped persuade his Irish co-producers to shoot in Canada rather than the U.S., saying they could have a longer schedule and more money in Canada.</p><h4>Casting</h4><p>Emma Watson, Rooney Mara, Shailene Woodley and Mia Wasikowska were considered for the role of Joy. Brie Larson was cast after an associate of Abrahamson suggested he see her performance in Short Term 12 (2013). Larson consulted with a trauma expert and nutritionist for the role, went on a restrictive diet, and avoided sunlight. She said she saw Room less as a crime story and more of \"a story of love and freedom and perseverance and what it feels like to grow up and become your own person\".</p><p>The filmmakers considered dozens of child actors for Jack before casting seven-year-old Jacob Tremblay from Vancouver. Tremblay said his role was not hard \"because I was playing a happy child\" unaware of the sinister nature of Room. As he was too young to read the whole screenplay, each scene was explained to him one by one. Tremblay wore a wig made from human hair. According to Joan Allen, who played Nancy, Larson and Tremblay met for over three weeks to build a \"very tight, obviously critical, close relationship\", before the Room scenes were shot over five weeks. Allen arrived in Toronto later and met Tremblay, with Allen noting, however, that \"we didn't want him to become too familiar with me because that's not what the story is.\"</p><p>In preparation for her own role, Allen did not consult real mothers of kidnapped children, but said she reflected on her own experiences \"in a mall when my daughter was little and I look around and within a flash she's not there\". Canadian actor Tom McCamus auditioned for the part of Old Nick before being cast as Leo. The actors improvised some lines, with Donoghue saying they created \"speech patterns more natural-sounding than I could have written, and produced some brilliant new lines that ended up in the film.\"</p><h4>Filming</h4><p>Abrahamson used only one Room set, wanting to create an authentic experience for Tremblay. The set, built on a soundstage at Pinewood Toronto Studios, was 11 ft × 11 ft (3.4 m × 3.4 m). Montreal production designer Ethan Tobman set out with the idea \"that every square inch of Room needed to have a backstory\". To fit the crew and equipment into the small space, he made each piece of the set removable. However, as Abrahamson and cinematographer Danny Cohen wanted the camera to always shoot scenes from inside Room, the lens was always positioned within the set even if the rest of the camera was outside. There were as many as eight cameramen at a time inside the Room set with Larson and Tremblay. The actors also made the props decorating the set.</p><p>Because the scenes set outside Room were filmed after the scenes inside, the crew was initially eager to leave the cramped space, expecting that the rest of the film would be easy. However, they had difficulty adjusting to the cold weather, traffic and crowds in Toronto. Cohen remarked that upon returning to the Room set for the final scene, the set appeared smaller to the crew. Toronto also doubles for Akron, where the exterior scenes are set.</p><p>Cohen used a Panavision Primos lens on a Red Epic Dragon camera, saying \"The Primos and using Kino Flos, which is more akin to fluorescent lighting, gave Room a certain texture, a certain look.\" Principal photography began on November 10, 2014 and wrapped on December 15, 2014.</p><h4>Post-production</h4><p>Editor Nathan Nugent served as second-unit director. He described his editing of Room as simplistic, keeping the acting intact, while working in Dublin for five months. However, Tremblay's part was filmed in numerous takes so Tremblay could give variations of his performances of specific lines, so Abrahamson and Nugent had to assemble and splice the different takes in the editing process.</p><br/><h3>Release</h3><p>Prior to production, A24 acquired U.S. distribution rights to the film. Room had its world premiere on September 4, 2015, at the 42nd Telluride Film Festival. It went on to screen in the Special Presentations section at the 2015 Toronto International Film Festival. and at the London Film Festival, on October 11, 2015. The film began a limited release on October 15, 2015. Room was released in the United Kingdom and Ireland on January 15, 2016, by StudioCanal. It went into wide release on January 22, 2016.</p><p>The film was released by Lionsgate on DVD and Blu-ray in the United States on March 1, 2016. It was released on DVD and Blu-ray in the United Kingdom and Ireland in May 2016.</p><br/><h3>Reception</h3><h4>Box office</h4><p>After its U.S. release on October 16, 2015, Room played in a peak of 198 theaters from December 11 to 13, and grossed $5,166,724 before its Academy Award nominations were announced, making it one of the lowest-grossing Best Picture nominees in years. Initial box office under-performance came as a surprise to Canada's Elevation Pictures, since winning the People's Choice Award at the Toronto International Film Festival was usually a predictor of financial success. However, the nominations gave the film a boost at the box office, and after opening in the Republic of Ireland on 15 January, it initially made €200,000 at 50 theatres.</p><p>A month after its release in Ireland, it had grossed more than €1 million nationwide. On 24 April, Room completed its run having grossed an estimated $14.7 million in North America and $20.7 million in other territories, for a worldwide total of $36.3 million on a $13 million budget.</p><h4>Critical response</h4><p>Room received critical acclaim. Review aggregation website Rotten Tomatoes gives the film a rating of 93%, based on 319 reviews, with an average rating of 8.5/10. The site's critical consensus states, \"Led by incredible work from Brie Larson and Jacob Tremblay, Room makes for an unforgettably harrowing—and undeniably rewarding—experience.\" Metacritic gives the film a weighted average score of 86 out of 100, based on reviews from 43 critics, indicating \"universal acclaim\".</p><p>Todd McCarthy from The Hollywood Reporter wrote, \"Overall, it's a decent shot at a tall target, but real credit is due the lead actors, with Larson expanding beyond the already considerable range she's previously shown with an exceedingly dimensional performance in a role that calls for running the gamut, and Tremblay always convincing without ever becoming cloying.\" Eric Kohn of IndieWire stated, \"Brie Larson and newcomer Jacob Tremblay... textured performances turn outrageous circumstances into a tense and surprisingly credible survival tale.\" Richard Roeper of the Chicago Sun-Times called the film \"the most impressive piece of filmmaking I've seen in 2015, and one of the best movies of the decade\". Rex Reed said Room is \"so powerful and unforgettable that it must be seen\" but \"too grim and heartbreaking for some viewers\".</p><p>The central performances of Brie Larson and Jacob Tremblay have received critical acclaim. Joe Morgenstern of The Wall Street Journal said \"this drama is as big as all outdoors in scope; poetic and profound in its exploration of the senses; blessed with two transcendent performances, by Brie Larson and Jacob Tremblay; and as elegantly wrought as any film that has come our way in a very long while.\" Peter Travers of Rolling Stone wrote, \"All you need to know is that the performances of Larson and Tremblay will blow you away. Tremblay is a child actor incapable of a false move. And Larson, so good in Short Term 12, is magnificent, finding a way into Joy's bruised psyche that tears at your heart.\"</p><p>The film received positive reviews in its countries of origin, with Barry Hertz of Canada's The Globe and Mail writing \"Room is a film of tiny little miracles,\" finding it uplifting, praising Larson's performance and referring to Tremblay as \"a wide-eyed wonder who is always genuine\". Chris Knight for the National Post called Tremblay \"preternaturally talented\", and said Room \"works on a tiny canvas, but in doing so it emphasizes that great things can be accomplished in tight spaces\". Liz Braun of the Toronto Sun said Jack's narration made the Room scenes \"joyful\" as well as claustrophobic, and that Larson and Tremblay's performances are \"completely engaging\". Linda Barnard of the Toronto Star called Room \"equally tender and chilling\", In Ireland, Donald Clarke of The Irish Times gave the film five stars, calling it \"harrowing\", and concluded, \"We are left with a film that manages a degree of optimism in the most unpromising circumstances. It is a substantial achievement.\" Daniel Anderson, writing for the Irish Examiner, called Room \"an utterly unique tale which has seen the filmmaker deservedly thrust onto the world stage\", but also \"bleak\" and \"difficult to recommend\".</p><p>Dissenting, Kyle Smith of the New York Post wrote \"The script ... doesn't illuminate what kind of internal damage might be wrought by being held prisoner for seven years: On-screen it simply looks like Joy has a case of the sads.\" Matthew Lickona of the San Diego Reader also called it \"a cowardly movie about brave people\".</p><h4>Accolades</h4><p>Room has received many awards and nominations. Brie Larson's performance in particular has been singled out for awards, being chosen as Best Actress by the National Board of Review, the Chicago Film Critics, various other film critic organizations, the Academy Awards, the Critics' Choice Award, the Screen Actors Guild,BAFTA and the Golden Globe Award.Emma Donoghue's screenplay and Jacob Tremblay's performance have also received awards' attention. The film received four nominations for the 88th Academy Awards. Room was named one of the best films of 2015 by over 50 critics and publications.</p><p>The film also won nine Canadian Screen Awards, including Best Motion Picture, Best Direction for Abrahamson, Best Adapted Screenplay for Donoghue, Best Actor in a Leading Role for Tremblay, and Best Actress in a Leading Role for Larson. It won seven awards at the 13th Irish Film & Television Awards, including Best Film, Director for Abrahamson, script for Donoghue and International Actress for Larson.</p><br/>"
  },
  "errorMessage": ""
}