{
  "imDbId": "tt1745960",
  "title": "Top Gun: Maverick",
  "fullTitle": "Top Gun: Maverick (2022)",
  "type": "Movie",
  "year": "2022",
  "items": [
    {
      "publisher": "The Playlist",
      "author": "Rodrigo Perez",
      "link": "",
      "rate": "100",
      "content": "As much as “Top Gun: Maverick” whips from a technical, visceral, thrill-making, supersonic-level, the entire endeavor and every little moment of introspection, suffering and determination is all the more accentuated, strengthened and fist-pumpingly good because you care so damn much about the story, the people and their very human concerns."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Todd Gilchrist",
      "link": "https://www.avclub.com/top-gun-maverick-review-tom-cruise-joe-kosinski-miles-t-1848896756",
      "rate": "91",
      "content": "Joe Kosinski (Tron: Legacy) matches his well-established architectural precision with suitably nostalgic but never pandering emotionality, while Cruise commands the screen in a performance that leverages his multimillion-dollar star wattage to brighten the entire film."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/criticism/movies/top-gun-maverick-review-1234723766/",
      "rate": "91",
      "content": "Stainless where the original was musty, neutered where the original was soft-core (there isn’t a single gratuitous shower scene in this sequel, let alone three of them), and structured like an immaculate pop song where the original moved like freeform jazz, “Maverick” sounds like a major regression from an age where summer movies didn’t always play safe. But let’s not forget that Cruise is the only guy whose summer movies still vehemently refuse to do that."
    },
    {
      "publisher": "Consequence",
      "author": "Liz Shannon Miller",
      "link": "https://consequence.net/2022/05/top-gun-maverick-review-tom-cruise/",
      "rate": "83",
      "content": "In a lot of ways, Top Gun: Maverick is the platonic ideal of a film sequel, constantly in dialogue with the original project, and committed to growing and expanding upon that source material."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Leah Greenblatt",
      "link": "https://ew.com/movies/movie-reviews/top-gun-maverick-tom-cruise/",
      "rate": "83",
      "content": "Director Joseph Kosinski (TRON: Legacy) revels in the sonic-boom rush of their many flight scenes, sending his jets swooping and spinning in impossible, equilibrium-rattling arcs. On the ground, too, his camera caresses every object in its view, almost as if he's making a rippling ad for America itself."
    },
    {
      "publisher": "Screen Rant",
      "author": "Ben Kendrick",
      "link": "",
      "rate": "80",
      "content": "Top Gun: Maverick is a rare sequel that is not only better than the original but retroactively makes Top Gun's story altogether deeper."
    },
    {
      "publisher": "CNET",
      "author": "Richard Trenholm",
      "link": "https://www.cnet.com/culture/entertainment/top-gun-maverick-review-smash-hit-tom-cruise-sequel-streaming-date/",
      "rate": "76",
      "content": "Top Gun 2 reboots the original film's heart-pounding aerial action, infectiously cheesy character drama and don't-think-about-it-too-much military fetishism in a winning spectacle of cinematic escapism."
    },
    {
      "publisher": "IGN",
      "author": "Matt Donato",
      "link": "",
      "rate": "70",
      "content": "Top Gun: Maverick is an out-of-bounds blast of afterburner fumes and thrillseeker highs that's sure to please audiences looking for a classic summer blockbuster."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Jake Cole",
      "link": "",
      "rate": "63",
      "content": "The film fully surrenders to the grandiose fun that’s marked the best of Tom Cruise’s recent star vehicles and reaffirms Joseph Kosinski as a blockbuster craftsman par excellence."
    },
    {
      "publisher": "NME",
      "author": "Mark Beaumont",
      "link": "https://www.nme.com/reviews/film-reviews/top-gun-maverick-review-tom-cruise-miles-teller-3224047",
      "rate": "60",
      "content": "Top Gun: Maverick does exactly what its intended audience wants it to do – pile on the airborne thrills and steely military heroics without knotting things up with too much moralising or complex character development."
    }
  ],
  "errorMessage": ""
}