{
  "imDbId": "tt1745960",
  "title": "Top Gun: Maverick",
  "fullTitle": "Top Gun: Maverick (2022)",
  "type": "Movie",
  "year": "2022",
  "items": [
    {
      "username": "Top_Dawg_Critic",
      "userUrl": "https://www.imdb.com/user/ur64798417",
      "reviewLink": "https://www.imdb.com/review/rw8168012",
      "warningSpoilers": true,
      "date": "23 May 2022",
      "rate": "10",
      "helpful": "2,637 out of 2,973 found this helpful.",
      "title": "The truly epic blockbuster we needed.",
      "content": "Wow. The first Top Gun is a classic, and as we all know, sequels/remakes rarely beat the original, especially 36 years later e.g. The Matrix Resurrections. Well, this film just broke that theory.Aside from the adrenaline-pumping edge or your seat action, this story also had heart. It successfully overachieves, and surpasses its predecessor on every level.The directing by novice Joseph Kosinski was outstanding, especially considering this was his fourth ever full length feature film. All the stunts, visuals and V/SFX were breathtaking, and the camera work perfection, that you'll feel you're in the cockpit of the jet. The soundtrack and score was amazing. The 131 min runtime literally flew by with its spot-on pacing. I actually wanted to see more. Casting and performances by all were also perfection, and once again Tom Cruise reminds us why he is still one of the top actors in the industry.There's nothing I can critique or wish was better, as this gem was perfect in every way. Absolutely stunning, action-packed with a compelling and emotional story, as well as being a visual masterpiece. And the fact the dog fights were real and not CGI (actors had to train to fly the jets), just makes this film that much more magnificent. I'll be definitely seeing this again and adding the DVD to my collection. It's a rare perfect 10/10 must see from me."
    },
    {
      "username": "scottedwards-87359",
      "userUrl": "https://www.imdb.com/user/ur82936063",
      "reviewLink": "https://www.imdb.com/review/rw8177338",
      "warningSpoilers": true,
      "date": "26 May 2022",
      "rate": "10",
      "helpful": "5,119 out of 5,383 found this helpful.",
      "title": "This is slightly different to the other reviews, please stay with me here.",
      "content": "If you were a late teen or in your early twenties in the mid 1980's the world was very different. No computers, no mobile phones, no internet, no DVD's. We had cars though, and bikes, and we loved them, and we loved films too. The original Top Gun captured this moment in time perfectly, and gave us a thrilling ride like we had never seen before. The humour, the games, the bikes, the aircraft and my word, those flying scenes. We went back to the cinema to see it again and again, and spent the following decades quoting the movie. As time went on, it remained like a static snapshot in time to perfectly represent that magical point in our lives for so many of us.Now, 36 years later, we are a generation that has lost our parents, we've had our own children who have moved on themselves, and we now approach the end of our own careers and our young selves are gone forever.This film is the missing bookend to that whole generation. The original was there for the start of our young adult lives, and this new film now marks the end. It's magnificent.I'm 55, but yesterday, just for one last night, I was 19 again. Thank you."
    },
    {
      "username": "GusherPop",
      "userUrl": "https://www.imdb.com/user/ur59184301",
      "reviewLink": "https://www.imdb.com/review/rw8173679",
      "warningSpoilers": false,
      "date": "25 May 2022",
      "rate": "10",
      "helpful": "1,139 out of 1,340 found this helpful.",
      "title": "Best Sequel yet",
      "content": "In one of the more memorable lines in the original Top Gun, Maverick gets chewed out by a superior who tells him, \"Son, your ego's writing checks your body can't cash.\" Sometimes I wonder if Tom Cruise took that putdown as a personal challenge. No movie star seems to work harder or push himself further than Cruise these days. Ridiculously entertaining Top Gun: Maverick. Cruise was in his early 20s when he first played Pete \"Maverick\" Mitchell, the cocky young Navy pilot with the aviator sunglasses, the Kawasaki motorcycle and the need for speed. In the sequel, he's as arrogant and insubordinate as ever: Now a Navy test pilot in his late 50s, Maverick still knows how to tick off his superiors, as we see in an exciting opening sequence where he pushes a new plane beyond its limits. Partly as punishment, he's ordered to return to TOPGUN, the elite pilot-training school, and train its best and brightest for an impossibly dangerous new mission. And so the three screenwriters of Top Gun: Maverick - including Cruise's regular Mission: Impossible writer-director, Christopher McQuarrie - have taken the threads of the original and spun them into an intergenerational male weepie, a dad movie of truly epic proportions. They're tapping into nostalgia for the original, while aiming for new levels of emotional grandeur. To that end, the soundtrack features a Lady Gaga song, \"Hold My Hand.\" It's nowhere near as iconic a chart topper as the original movie's \"Take My Breath Away,\" but tugs at your heartstrings nonetheless. The action sequences are much more thrilling and immersive than in the original. You feel like you're really in the cockpit with these pilots, and that's because you are: The actors underwent intense flight training and flew actual planes during shooting. In that respect, Top Gun: Maverick feels like a throwback to a lost era of practical moviemaking, before computer-generated visual effects took over Hollywood. You start to understand why Cruise, the creative force behind the movie, was so driven to make it: In telling a story where older and younger pilots butt heads, and state-of-the-art F-18s duke it out with rusty old F-14s, he's trying to show us that there's room for the old and the new to coexist. He's also advancing a case for the enduring appeal of the movies and their power to transport us with viscerally gripping action and big, sweeping emotions."
    },
    {
      "username": "dtucker86",
      "userUrl": "https://www.imdb.com/user/ur1346534",
      "reviewLink": "https://www.imdb.com/review/rw8178255",
      "warningSpoilers": true,
      "date": "27 May 2022",
      "rate": "10",
      "helpful": "920 out of 1,080 found this helpful.",
      "title": "This is why we go to the movies",
      "content": "This is one sequel that looked like it would never get made. It was stuck in development \"hell\" for years and years. Then it was delayed by COVID and other issues. Its almost as if we were not meant to see a sequel to Top Gun. But now it is here and the question is, was it worth the wait? The answer is a resounding yes. This is the only sequel I have ever seen that i liked BETTER then the original. EVERYTHING about this film rocks! Tom Cruise is sixty this year but he can still do the job! He is awesome as Maverick capturing emotions and giving a performance that he hasn't given since A Few Good Men. You see Maverick's innate cockiness (something all fighter pilots have I'm sure) but you also see his vulnerability and his pain especially the scenes where he talks about his dead wingman's son and how he can't bear the thought of him dying as well. Jennifer Connally and Miles Teller give great performances as well playing Maverick's love interest and Goose's son. Yes you 1980's music lovers we get to hear Kenny Loggin's Danger Zone at the beginning it is wonderful nostalgia. Oh and I should also mention the aieral sequences are the best and most intense in movie history you are on the edge of your seat the whole time. To wrap it all up I wanted to mention the touching scene where Maverick goes to see his old Top Gun classmate \"Iceman\" who is now an Admiral and dying of throat cancer. Val Kilmer looks so bad because he has had throat cancer and can no longer speak well. The scene is so sad but they have a joke at the end where he asks Maverick who the best pilot is? Go see this movie by all means!"
    },
    {
      "username": "lovefalloutkindagamer",
      "userUrl": "https://www.imdb.com/user/ur83295852",
      "reviewLink": "https://www.imdb.com/review/rw8177954",
      "warningSpoilers": false,
      "date": "26 May 2022",
      "rate": "10",
      "helpful": "1,769 out of 1,956 found this helpful.",
      "title": "Let me just say...",
      "content": "I was reluctantly dragged into the theater, thinking that they didn't need to make a Top Gun 2 and that the first one was where that story needed to end.I could write a couple paragraphs to summarize my feelings after walking out of the theater, but I'm going to leave it with just one sentence.I was wrong."
    },
    {
      "username": "alexglimbergwindh",
      "userUrl": "https://www.imdb.com/user/ur66018024",
      "reviewLink": "https://www.imdb.com/review/rw8189765",
      "warningSpoilers": false,
      "date": "30 May 2022",
      "rate": "10",
      "helpful": "1,001 out of 1,153 found this helpful.",
      "title": "The real cinema experience!",
      "content": "If there's any movie that deserves to be seen in the theaters with big screens and booming speakers. It's :Top Gun Maverick.One of my best experiences in years!"
    },
    {
      "username": "r96sk",
      "userUrl": "https://www.imdb.com/user/ur49400835",
      "reviewLink": "https://www.imdb.com/review/rw8174934",
      "warningSpoilers": false,
      "date": "25 May 2022",
      "rate": "9",
      "helpful": "616 out of 774 found this helpful.",
      "title": "What an excellent sequel",
      "content": "What an excellent sequel - I, in fact, like it more than its predecessor.'Top Gun: Maverick' is fantastic, simply put. I was expecting it to be good, but it's actually much more enjoyable than I had anticipated. The callbacks to the original are expertly done, the new characters are strong/well cast, it has plenty of meaning, music is fab and the action is outstanding - the aerial stuff is sensational.The story is superb, with each high stake coming across as intended - parts even gave me slight goosebumps, which is a surprise given I'm not someone who has a connection to the 1986 film. It's all super neatly put together, I honestly came close to giving it a higher rating.Tom Cruise is brilliant as he reprises the role of Maverick, while Miles Teller comes in and gives a top performance. Jennifer Connelly is another positive, though her role does kinda feel a tiny bit forced in order to have a love interest; given Kelly McGillis' (unexplained) absence.Monica Barbaro stands out most from the fresh faces, though I actually did enjoy watching them all - which is something I thought the film may struggle with, adding new people, but it's done nicely; sure Jon Hamm and Glen Powell are a little cliché, though overall I approve.A great watch - I'd highly recommend it, though naturally would suggest watching the previous film first if you haven't already."
    },
    {
      "username": "DarkVulcan29",
      "userUrl": "https://www.imdb.com/user/ur4593705",
      "reviewLink": "https://www.imdb.com/review/rw8178881",
      "warningSpoilers": false,
      "date": "27 May 2022",
      "rate": "10",
      "helpful": "617 out of 786 found this helpful.",
      "title": "Flying High",
      "content": "Top Gun (1986) made Tom Cruise a star, and now 36 years later he jumps back in role of Pete Mitchell AKA Maverick almost like he never left.Maverick never seems let his age slow him down, and still is cocky has ever, and is ordered to train a bunch of young pilots for a deadly mission, but sees a little bit of himself in them, and must get them working together has a team.Tom Cruise is great has Maverick, who is coming to terms with the past. Miles Teller and Glen Powell are also great, and not to mention Jennifer Connelly. But the flying scenes are what makes this movie, you feel like your flying with them. Feels has real has ever. A terrific sequel 36 years worth the wait."
    },
    {
      "username": "cruise01",
      "userUrl": "https://www.imdb.com/user/ur57691865",
      "reviewLink": "https://www.imdb.com/review/rw8186445",
      "warningSpoilers": false,
      "date": "29 May 2022",
      "rate": "10",
      "helpful": "380 out of 502 found this helpful.",
      "title": "Tom Cruise really knows how a blockbuster film is made.",
      "content": "5 out of 5 stars.Top Gun Maverick is an awesome action film that lives up to the original film and way superior as well. It is one awesome thrill ride that will have the audiences gasping for air with its exhilarating aerial combat scenes.The plot is great. It continues with Maverick (Tom Cruise) being assigned to train new pilots before they go off on a challenging mission. Rooster (Miles Teller) is among the recruits which Maverick tries to reconnect after the incident with his father in the previous film.The plot tries to build an emotional powerhouse as Maverick are neck to neck about the past. And Maverick trying to get these pilots prepared for there first combat.The script is great and fast moving. Director Joseph Kosinski nails making a blockbuster film. Making the action sequences cinematic. And big and loud. Majority of the action scenes are practical and realistic which makes it better. The climatic sequence with the pilots on the mission was awesome and thrilling. Definitely worth seeing this film on the biggest screen with great sound quality.The cast ensemble is great. Tom Cruise nails making a big action film. Cant wait to see what he does with his next films. Miles Teller also was good. Jennifer Connelly playing Mavericks past love interest. The new additions were all great as well. The music score was awesome.The opening sequence gives you the chills with its similiarities to the first.Top Gun Maverick is one of the best films this year. Amazing action sequences that is cinematic and big. And big film that deserves to be seen in theatres."
    },
    {
      "username": "DVR_Brale",
      "userUrl": "https://www.imdb.com/user/ur30431619",
      "reviewLink": "https://www.imdb.com/review/rw8205469",
      "warningSpoilers": false,
      "date": "4 June 2022",
      "rate": "10",
      "helpful": "475 out of 605 found this helpful.",
      "title": "A perfect gift to all Top Gun fans",
      "content": "There are so many references to the original that I was brought to childhood when I had first seen it.The best cinematic experience of my life and a perfect gift to all Top Gun fans."
    },
    {
      "username": "thesar-2",
      "userUrl": "https://www.imdb.com/user/ur17825945",
      "reviewLink": "https://www.imdb.com/review/rw8184290",
      "warningSpoilers": false,
      "date": "29 May 2022",
      "rate": "9",
      "helpful": "374 out of 503 found this helpful.",
      "title": "This Topped and Outgunned the Original",
      "content": "See? This is why I LOVE Tom Cruise Post-Mid-1992. Aside from the RARE misfire, cough, cough, The Mummy, when Tom Cruise wants a movie to be better than perfect, he pushes it past Mach 10.The first half of this adventure made me feel this is the perfect and worthy sequel to the original. AND THEN...the second half kicked in thoroughly SURPASSING the original by a landslide. Now, it certainly will not have the impact on the 2020s as the original did for the 1980s - that's lightning that can't be caught twice. But, rest assured: this simultaneously saluted the 1986 classic and then told it to hold its beer.Maverick never changed. And just went he was about to use up his seemingly endless supply of luck, he got recruited back into the \"Top Gun\" division to get the elite ready for a, dare I?, almost Impossible Mission. Oh, and there's a ton of drama and obligatory dick-measuring thrown in.What matters most is: the setup for the film takes place perfectly in the first act giving us clear direction (something the original lacked,) and gave us goals with character building to anticipate and cheer on. When the climax began, it's WAS exactly what I wanted, until it went on another 15 minutes to make the movie SOAR beyond my expectations.While the acting was superb from the Veterans, it wasn't all that great from the fresh new recruits. That was to be expected. Much like their characters in the movie, they're learning to be the best. And they may someday.The movie's music is not as great as the original, but the movie used it sparingly, correctly and with some great new tracks. The original knew it had a killer soundtrack and overdid it. This one showed the restraint it needed.If you loved the first one, there's virtually no way you wouldn't love this even more. It's absolutely perfect for those who were there buying tickets for the original and it's also great for newbies so they can learn to appreciate the classics and understand: with age comes experience and that should never be mocked. It should be learned from and used to progress.And to Top it all off, all of the practical stunts and aerial shots made 10x more sense and easier to follow this time around. I just rewatched the original last night for only the second time (the first being on home video in 2015) and my head was literally spinning to follow the action in the sky. Here, they make sure no one is left in the dust.I can't recommend this movie enough and to see it in theatres, preferably a Dolby-certified one. Don't wait for Paramount+ to pick this up (like I normally would.) Go see this now on the big screen as it should be seen and don't miss out like I did with the original in 1986.***Final Thoughts: I *just* made my Top Ten Tom Cruise movie list, time to update it:1. A Few Good Men 2. Mission: Impossible - Fallout 3. Edge of Tomorrow 4. Mission: Impossible - Rogue Nation 5. Mission: Impossible - Ghost Protocol 6. Top Gun: Maverick 7. Collateral 8. Jerry Maguire 9. Knight and Day 10. Mission: Impossible IIIHonorable Mentions:11. Top Gun 12. Oblivion 13. The Firm 14. Interview with the Vampire 15. Rain Man 16. Vanilla Sky."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw8190055",
      "warningSpoilers": false,
      "date": "30 May 2022",
      "rate": "10",
      "helpful": "345 out of 477 found this helpful.",
      "title": "Talk to me Goose",
      "content": "It makes more than sense to have seen the first Maverick movie. I am writing this with that in mind. Actually I would even argue that the rating also had something to do with it. Watching it on the big screen also helps a lot of course. My summary line is actually a quote from the movie. Not just the first one, but one that is being said here too. And you will get the full impact of that sentence, of those words, if you know what they mean and why they are said.There are quite a few connections to the first movie, but there is also nods to real life. Especially with Val Kilmer in mind. And all is serving the story - even the real life struggle Kilmer has, that gets woven into the character Iceman. So there are two of the big stars of the first one name checked - what about Kelly McGillis though? Well don't hold your breath (it is being taken away, sorry for the pun)! She is not returning. Now you could be mad at the movie for that - or you could salute it for bringing \"back\" a character that was only name checked in the first movie - and being played by the wonderful Jennifer Connely.Now is she as beautiful as ever? Yes. But she is also close to the age of Tom Cruise that some other names could have been. Of course do not overthink the age thing, because you'd find that her real age would have been inappropriate during the time of the first movie ... just saying. Again: do not overthink it at all.Those things out of the way, we get introduced to a whole bunch of new characters. There probably is not as much ... well male on male energy here as there was in the first one. Even in the dialog - you just feel it. Don't give me that look (and yes I know it is the only one you've got - especially when I bring the puns)! There is more than a coherent story - and the movie takes its time to tell it. There is plenty of action too.There is also technical talk that I didn't totally understand. But it is not necessary to get the movie or enjoy it. And then there is the ending - and what a perfect ending this has. So much so, that I decided it deserves the 10 rating I finally gave it. It may copy many things from the first movie (call it homage), especially the intro but also some story beats, but it still stands ... or rather flies on its own! Just buckle your seatbelt, because you may get dizzy.First time watching I could spot the music cues from the first one, but there were also some fresh elements to it. If I didn't know Lady Gaga was at least partly (big parts if I understood correctly) responsible for the soundtrack, I wouldn't have guessed myself to be honest. As it is, one of the biggest highlights in cinemas this year - the waiting was worth it. If you feel the need .. the need for speed - your need will be satisfied here (or rather in cinemas). Even being able to predict story points will not take away anything from the experience you can have with this. Enjoy."
    },
    {
      "username": "Achyut_Prashast_Singh",
      "userUrl": "https://www.imdb.com/user/ur46915265",
      "reviewLink": "https://www.imdb.com/review/rw8182413",
      "warningSpoilers": false,
      "date": "28 May 2022",
      "rate": "10",
      "helpful": "280 out of 387 found this helpful.",
      "title": "The most feel-good action movie in recent times.",
      "content": "Having loved Top Gun, I clearly wasn't going to miss Top Gun: Maverick, and also being a fan of Tom Cruise, I knew the best place to watch it would be the big screen. I totally enjoyed the film as I watched it with a helping of popcorn. There were moments where I felt excited, emotional and even laughed along with the other viewers. It delivers light, simple and sweet entertainment in a delicious mix of action, drama, some romance and humor in a delightful manner.Tom Cruise shines in his performance where he is required to display a good range of emotions and has a good chemistry with Jennifer Connelly, while also impressing us in the action sequences as he always does. Speak of which, the action is very beautifully executed as well as filmed. Every time the jets turned, I felt like my head moved along in the same direction. This effect is repeated multiple times and ends up immersing the viewer into the thrill of the action. It's very clean and neatly done, and never violent at all. The film has no adult content, due to which you can watch it with your families.The music and score are terrific, and the cinematography is another major plus. Some might find the initial few acts a little slow, but the action sequences completely steal the show, especially in the lengthy and spellbinding final act. The editing is top notch, as the film never feels long or stretched. I was actually surprised how short it felt, and in a good way. Top Gun: Maverick is a very feel-good action movie with realistic action and emotions to deliver an experience of a lifetime. If you enjoyed Top Gun, chances are you will find yourself loving this film even more, for Cruise once again proves he's the man to look for when quality action is what viewers crave. Must watch on the big screen. Period."
    },
    {
      "username": "ferguson-6",
      "userUrl": "https://www.imdb.com/user/ur0806494",
      "reviewLink": "https://www.imdb.com/review/rw8172523",
      "warningSpoilers": true,
      "date": "24 May 2022",
      "rate": "8",
      "helpful": "291 out of 411 found this helpful.",
      "title": "we get what we hoped for",
      "content": "Greetings again from the darkness. Heavy on melodrama. Heavy on cockiness. Heavy on fighter jets. Heavy on nostalgia. Check. Everything that we want and expect in the long-awaited sequel to the 1986 film is present. It's a movie spectacle featuring one of the few remaining bonafide movie stars front and center, as well as breathtaking action sequences that beg to be experienced on the largest screen possible and with the highest quality audio available. Jim Cash and Jack Epps Jr are credited for the characters, while the new screenplay involved collaboration from Ehren Kruger, Eric Warren Singer, Christopher McQuarrie, Peter Craig, and Justin Marks. The original film's director, Tony Scott, passed away in 2012 at age 68, and Joseph Kosinski (OBLIVION, 2013, also starring Tom Cruise) takes the helm.Callbacks to the original are plentiful, and we get our first in the opening title card - the same one used in 1986 to explain the \"Top Gun\" training center. Of course, there is one reason we are here, and that's Tom Cruise. He was only 24 years old in the original, and now lives and exudes the swagger of Pete \"Maverick\" Mitchell. When the film opens, Maverick is an extreme test pilot pushing himself and an experimental aircraft to Mach 10, and yes, this goes against the wishes and order of the program's Rear Admiral in charge played by a curmudgeonly Ed Harris. It's a shame that Harris only has a couple of brief scenes, but he is the one that informs Maverick of his new orders to return to Top Gun immediately. His new commanding officer is Beau \"Cyclone\" Simpson (Jon Hamm), who is none too happy about Maverick being back. However, the order came directly from Maverick's old nemesis/friend, Tom \"Iceman\" Kazansky (Val Kilmer), now a highly decorated Admiral in failing health.Maverick is disappointed to learn that he has been brought in, not to fly, but to teach a group of Top Gun graduates how to execute an extraordinarily dangerous mission involving extended high speeds at a low altitude, dropping bombs on the uranium enhancement plant protected by a mountain range, and then immediately elevating to a nearly impossible level to avoid a crash - all while being targeted by the enemies radar and defense system. The enemy goes unnamed so that the movie can remain timeless and avoid any type of political backlash. Plus, this film is about thrills and action, not a political statement.Being back means Maverick crosses paths with Penny Benjamin (Jennifer Connelly), who was mentioned briefly in the first film as an Admiral's daughter. She now owns the local bar, has a daughter, races sailboats, and still carries a bit of a torch for Maverick, although she's quick to bust his chops whenever possible. However, it's the pilots he's charged with training that cause the biggest issue for Maverick. One of them is Bradley \"Rooster\" Bradshaw. Rooster is the son of \"Goose\" (played in the original by Anthony Edwards), who flew with Maverick as his Radio Intercept Officer (RIO) and died in an ejection mishap. Rooster holds Maverick responsible and Maverick is still haunted by his friend's death. Goose is seen in photos and via flashbacks, and Rooster emulates his dad at the bar's piano. The conflict between Rooster and Maverick adds complications to the mission - and a bit of melodrama to the entire film.The newbies (and the Navy) consider Maverick a relic of a bygone era, so of course, 'instructor' Maverick takes to the sky to strut his pilot stuff. In addition to Rooster, the standouts in the new group include Phoenix (Monica Barbaro), Bob (Lewis Pullman), and Hangman (Glen Powell), the latter of whom, along with Rooster, tries to recreate that symbiotic relationship we originally saw with Iceman vs Maverick. Teller and Powell are both solid, but this aspect never really clicks like the Rooster vs Maverick piece.We can't help but notice that the dramatic elements seem to be more of a focus this time around. The biggest impact comes from the scene where Mavericks visits Admiral Kazansky (Iceman) at his home. Despite his well-known physical limitations, Val Kilmer delivers a memorable performance, and the two actors seem to relish this opportunity. The situation is handled with grace, and we are appreciative of Cruise standing firm in his demand for Kilmer to appear in the film. As for the love story between Penny and Maverick, it had to be a bit frustrating for Ms. Connelly to work so hard on an underwritten role, while Jon Hamm's constant furrowed brow and barking leaves him coming across as little more than jealous of Maverick.Obviously it's the fighter jets and aerial sequences that folks will come for, and spectacular and exhilarating are the best words I can find to describe what we see. I was fortunate to see his in IMAX, and if you have one near you, it's certainly the preferred viewing format. Thanks to the Navy and the training and equipment received by the cast, there is an authentic feel that's almost throwback in this day and age of CGI. We sense the speed and gravity pulls, even if we are never in peril. The aircraft carrier sequences are mind-boggling, though it's jets in the air that provide the energy jolt.Wise-cracking and heartstring-tugging moments fill the screen, and you can relax knowing Kenny Loggins' \"Danger Zone\" is back, while Berlin is thankfully not. Sand volleyball has been replaced by some semblance of shirtless and sweaty beach football as a team-builder, and yes, we get the patented Tom Cruise sprints - three times: on a treadmill, during beach football, and in a forest. The familiar sounds of Harold Faltermeyer's original score are back, this time enhanced by Hans Zimmer and an ending song by Lady Gaga. Those from the original who are absent this time are the great Tom Skerritt, James Tolkan, Kelly McGillis, and Meg Ryan (whose character is mentioned as having passed away). Producer Jerry Bruckheimer is back, though his partner on the original, Don Simpson, died in 1996 at age 52. Deserving of kudos are cinematographer Claudio Miranda, film editor Eddie Hamilton, and those involved with sound, visual effects, and music. For those feeling the need for speed, this sequel delivers; just embrace the cliches and familiarity, and predictability.Only in theaters (as it should be) Friday May 27, 2022."
    },
    {
      "username": "rockingruby",
      "userUrl": "https://www.imdb.com/user/ur80875364",
      "reviewLink": "https://www.imdb.com/review/rw8185617",
      "warningSpoilers": true,
      "date": "29 May 2022",
      "rate": "9",
      "helpful": "356 out of 474 found this helpful.",
      "title": "Take note Hollywood this is how to do a blockbuster film.",
      "content": "I appreciate the first film but never been a massive fan of it so I was not expecting much from the sequel. I was surprised how good this movie was, it's terrific. Also was great to see no woke nonsense and strong characters, thank you Tom Cruise."
    },
    {
      "username": "Stoshie",
      "userUrl": "https://www.imdb.com/user/ur4933808",
      "reviewLink": "https://www.imdb.com/review/rw8248584",
      "warningSpoilers": false,
      "date": "18 June 2022",
      "rate": "7",
      "helpful": "461 out of 625 found this helpful.",
      "title": "Great Flight Sequences, Cliche-Ridden Plot",
      "content": "I don't share everyone's unbridled enthusiasm for this film. It is indeed a great popcorn flick, with outstanding aerial photography and maneuvers. But 10 stars? There are few, if any, movies that are perfect, and deserve that kind of rating.The problem with the film is the plot. It is so filled with age-worn cliches that one could easily tell what was coming from beginning to end. I mean, you had to know who was going to save the day at the end, and you had to know what was going to happen when Maverick jumped out of Penny's window. Those are just two examples of the many obvious plot points that you could see coming a mile away. I could list them all, but it would take up too much space here. Basically the entire plot was entirely predictable.The opening scene, especially, was straight out of Hollywood Screenplay Writing 101. I mean, seriously, how many times have we seen that subplot? Countless.There were no characters in the movie, either. They were all caricatures, stereotypes. No depth to any of them. They had their standard roles to play, and that was it.Did I enjoy the film? Sure, it was fun. Especially on a big theater screen with a loud sound system. Did I take anything away from the film? Did it make me think about anything after it was over? Nah. Will I see it again? Nah.I will give Tom Cruise credit for including Val Kilmer in the cast. Considering his health problems, that was a nice touch.So, yeah, enjoy the film. Sit back with your bag of popcorn and enjoy the g-forces. But don't pretend it is anything other than just another summer blockbuster."
    },
    {
      "username": "nihal-38544",
      "userUrl": "https://www.imdb.com/user/ur93656484",
      "reviewLink": "https://www.imdb.com/review/rw8173474",
      "warningSpoilers": false,
      "date": "25 May 2022",
      "rate": "9",
      "helpful": "582 out of 717 found this helpful.",
      "title": "TOM CRUISE YOU LEGEND!",
      "content": "This is one of the best theatrical experiences I've had and I'm so happy someone has taken the practical route rather than throwing everyone into a green screen. I watched the first one many times and I can't believe this just topped it by a huge margin. Tom Cruise will be written as the most passionate filmmaker in history. I mean to put a whole cast in a bunch of f-18 jets and act in a jet as well as film yourself is a huge deal. If this movie does not cross a billion then there is something wrong with taste that people have these days. So called marvel fans. This is what you call a cinematic experience. Not some cropped cgi scenes."
    },
    {
      "username": "851222",
      "userUrl": "https://www.imdb.com/user/ur4405474",
      "reviewLink": "https://www.imdb.com/review/rw8197359",
      "warningSpoilers": false,
      "date": "2 June 2022",
      "rate": "10",
      "helpful": "201 out of 284 found this helpful.",
      "title": "Amazing entertainment",
      "content": "Greetings from Lithuania.I wasn't the biggest fan of first \"Top Gun\" movie. I saw it like 5 years ago so for me it wasn't nostalic or anything. It was just OK movie and nothing more.Today i saw \"Top Gun: Maverick\" (2022) in cinema. And it blew me away. This movie was incredible. It literally put a smile on my face. Action scenes in the air were the best i ever saw of this type of action. Directing by Joseph Kosinski was perfect. Music was on spot. Cinematography was gorgeous. I loved how actually calm and quite this movie was, until it wasn't and transition between scenes, acts, calm and action was perfect. Acting was great. This is a movie making as good as it gets. Was it predictable? Yes. But at the same time i was excited and glued to the screen during its whole 2 hours run time.Overall, \"Top Gun: Maverick\" is a Hollywood blockbuster done right. Its a Hollywood action adventure movie in every possible way, yet this time its done incredibly good. What a terrific sequel."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8192822",
      "warningSpoilers": false,
      "date": "31 May 2022",
      "rate": "10",
      "helpful": "202 out of 286 found this helpful.",
      "title": "Holy cow such a great IMAX experience!",
      "content": "Tom Cruise is still an ultimate being at 59 years old it's outstanding! Top Gun: Maverick deserves so much for how practical everything is. Great the IMDb rating is 8.7 hope it stays high, should even get awards. The music hit the spot, cinematography is beautiful, the story flow well, and the acting is incredible so much so that even though Val Kilmer has mouth cancer in real life he has a small part in the film. I like how the main characters trained for a near impossible mission that all was built up quite well."
    },
    {
      "username": "trimblair",
      "userUrl": "https://www.imdb.com/user/ur10067675",
      "reviewLink": "https://www.imdb.com/review/rw8177919",
      "warningSpoilers": false,
      "date": "26 May 2022",
      "rate": "10",
      "helpful": "242 out of 341 found this helpful.",
      "title": "Best movie of 2022!",
      "content": "Wow! As a retired combat veteran who has flown jets, I LOVED THIS MOVIE! It had massive heart, great action and wonderful Cameos. The flying scenes were the best I've seen. Nobody left the theater for 90 minutes!"
    },
    {
      "username": "pucciarello",
      "userUrl": "https://www.imdb.com/user/ur82692553",
      "reviewLink": "https://www.imdb.com/review/rw8183145",
      "warningSpoilers": false,
      "date": "28 May 2022",
      "rate": "9",
      "helpful": "609 out of 713 found this helpful.",
      "title": "Paid for the whole seat, but only used the edge",
      "content": "I'll preface my review by first stating that I had mediocre expectations coming in. It's very hard to make a successful sequel to an older classic movie, but I was immediately entertained from beginning to end. I won't give any spoilers, but I'll list my biggest takeaways from the movie.1. The flying scenes were incredible and had me on the edge of my seat.2. Tom cruise and miles teller were awesome.3. I want to quit my job and become a fighter pilot now.This movie is definitely worth paying for imax tickets and I suggest you get a big water bottle cause you will be sweating profusely as Maverick cuts through the sky like butter."
    },
    {
      "username": "damianphelps",
      "userUrl": "https://www.imdb.com/user/ur29500838",
      "reviewLink": "https://www.imdb.com/review/rw8680202",
      "warningSpoilers": false,
      "date": "17 November 2022",
      "rate": "7",
      "helpful": "50 out of 68 found this helpful.",
      "title": "Top Gun: The Force Awakens",
      "content": "Firstly before my small complaint I will point out that I do like the movie.Now the complaint. This movie uses the exact same formula as Star Wars: The Force Awakens, it remakes the original film almost scene for scene and adds a few new bits. Both films treating the audience with a little bit of contempt whilst cashing in on the nostalgia market.Having said that, its a fun movie. Teller, as Goose 2.0, works particularly well. It was also great to see Kilmer, despite his current health concerns (he could have been a dynamo for the film if well).Its fun, loud and obnoxious which is what a Top Gun movie should be :)"
    },
    {
      "username": "DoNotComeToTheCinemaDepressed",
      "userUrl": "https://www.imdb.com/user/ur114907932",
      "reviewLink": "https://www.imdb.com/review/rw8173363",
      "warningSpoilers": false,
      "date": "25 May 2022",
      "rate": "10",
      "helpful": "270 out of 392 found this helpful.",
      "title": "A CONTENDER FOR MOVIE OF THE YEAR. WHAT AN EXPERIENCE! 🎥🍿🛫",
      "content": "Just Saw This In IMAX and guys what an experience it was.Components of this Movie-1. Firstly what a cast! EVERY SINGLE CHARACTER seemed like they were having a Great Time Acting in this movie. INCLUDING the serious minded Admirals. Great Performances all around.2. Every Scene flows so well. The time flew by.3. Many of the Jokes Landed Strongly throughout the Movie with the audience I was with. Especially the \"You Told Me Not to Think\" Scene. 😂🤣4. The Visuals of the Fighter Jet Scenes were Astonishing. They looked so good.5. The Story was good enough, on top of that, the suspense was built up throughout towards the Actual Mission. With The Training Missions and Different Conundrums the Team Faced.Overall, What A Movie and Going Further, What an Experience it was."
    },
    {
      "username": "Horror_Flick_Fanatic",
      "userUrl": "https://www.imdb.com/user/ur27582881",
      "reviewLink": "https://www.imdb.com/review/rw8482010",
      "warningSpoilers": false,
      "date": "24 August 2022",
      "rate": "6",
      "helpful": "311 out of 464 found this helpful.",
      "title": "Not bad, but waayy overrated.",
      "content": "Based on the scores, I was expecting a much better film. But I now get it., its the nostalgia for the first film that fuels the scores for this film.Here is my take and why I think its an \"okay\" film, just not a great one. There really isn't a whole lot of meat and potatoes to this story. It's largely a copy pasta in large chunks from the older film but with newer, younger faces. Maverick is charged with training a squadron of top gun fighter pilots to destroy an enemy uranium enrichment plant that is about to come online and operational. But it seems the producers want to maximize the profits for this film and not offend anyone in the real world. So this enemy doesn't have a name or a geographical location. The enemy has 5th generation fighter jets and some James Bond evil villian sized SAM batteries around the mountain's summit. It is a snow covered terrain so that rules out many enemies in warmer climates.Then there is the lone aircraft carrier delivering these jet fighters to the enemies doorstep. Well, by now most people know that wouldn't be the case. Carriers are heavily guarded and their presence would trigger the attention of any adversary. No way could four F18 sneak in under radar to blow up this plant unless we accept the enemy isn't aware of a huge freakin carrier of their shores. So there is nothing resembling a realistic scenario and that kept me from enjoying the story too much.The romantic relationship in the film has no chemistry. I just didn't feel any chemistry between Penny and Maverick. That's a first because you do have two very good looking actors and I always thought Tom Cruise to be great action actor. So no chemistry between Cruise and Jennifer Connelly is a bitter pill to swallow.What I did like about it was the cinematography and some of the action sequences with the dog fighting. But I didn't think the dog fighting were any better than the original film. In fact, the original film might have had better scenes. This film just has a lot of choppy editing to imply action.I think its a 6/10, but not a chance it's a 9/10. Maybe if they added a Tom Clancy inspired screenplay to the film I might have given it a 9. Maybe a team of seals to do recon before having the jets engage and with the aircraft carrier companied by a battlegroup flotilla. Aircraft Carriers just don't end up secretly off the shore of adversarial country completely alone, not in the real world."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8253750",
      "warningSpoilers": false,
      "date": "19 June 2022",
      "rate": "10",
      "helpful": "106 out of 160 found this helpful.",
      "title": "I did not expect that.",
      "content": "Wow!I have just walked out of the cinema, and feel absolutely buzzing, a two hour thrill ride, what a spectacular movie this was.I so often feel disappointed by hyped up films, but this deserves all the hype, and then some.Top Gun is a classic, one of those films we've all seen, and many love. When I first heard about a follow up, I dreaded it, so many films have diabolical follow ups, almost damaging the original, definitely not the case here though, this is a great movie.All involved were outstanding, Tom Cruise, clearly a perfectionist, and that side of him is evident here, I cannot find a single fault.Visually amazing, great music, great story, superb acting.Nailed it! 10/10."
    }
  ],
  "errorMessage": ""
}