{
  "imDbId": "tt1745960",
  "title": "Top Gun: Maverick",
  "fullTitle": "Top Gun: Maverick (2022)",
  "type": "Movie",
  "year": "2022",
  "language": "en",
  "titleInLanguage": "Top Gun: Maverick",
  "url": "https://en.wikipedia.org/wiki/Top_Gun:_Maverick",
  "plotShort": {
    "plainText": "Top Gun: Maverick is a 2022 American action drama film directed by Joseph Kosinski and written by Ehren Kruger, Eric Warren Singer, and Christopher McQuarrie from stories by Peter Craig and Justin Marks. The film is a sequel to the 1986 film Top Gun. Tom Cruise reprises his starring role as the naval aviator Maverick. It is based on the characters of the original film created by Jim Cash and Jack Epps Jr. The film also stars Miles Teller, Jennifer Connelly, Jon Hamm, Glen Powell, Lewis Pullman, Ed Harris, and Val Kilmer, who reprises his role as Iceman. In the film, Maverick confronts his past while training a group of younger Top Gun graduates, including the son of his deceased best friend, for a dangerous mission.\r\nDevelopment of a Top Gun sequel was announced in 2010 by Paramount Pictures. Tom Cruise, along with producer Jerry Bruckheimer and director Tony Scott, were asked to return. Craig wrote a draft of the screenplay in 2012, but the project stalled when Scott died later that year. The film was later dedicated to Scott's memory. Production resumed in 2017 after Kosinski was hired to direct. Principal photography, which involved the use of IMAX-certified 6K full-frame cameras, took place from May 2018 to April 2019 in California, Washington, and Maryland. The film was initially scheduled to be released on July 12, 2019, but it was delayed several times due to its complex action sequences and the COVID-19 pandemic. During the pandemic, several streaming companies attempted to purchase the streaming rights to the film from Paramount, but all offers were declined on the orders of Cruise, who insisted the film be released exclusively in theaters.\r\nTop Gun: Maverick premiered at CinemaCon on April 28, 2022, and was theatrically released by Paramount Pictures in the United States on May 27, 2022. The film was acclaimed by critics, with many calling it better than its predecessor. It won Best Film from the National Board of Review and was also named one of the top ten films of 2022 by the American Film Institute. Top Gun: Maverick was nominated for six awards at the 95th Academy Awards (including Best Picture), winning Best Sound, and received numerous other accolades. The film grossed $1.496 billion worldwide, making it the second-highest-grossing film of 2022 and the highest-grossing film of Cruise's career.",
    "html": "<p>Top Gun: Maverick is a 2022 American action drama film directed by Joseph Kosinski and written by Ehren Kruger, Eric Warren Singer, and Christopher McQuarrie from stories by Peter Craig and Justin Marks. The film is a sequel to the 1986 film Top Gun. Tom Cruise reprises his starring role as the naval aviator Maverick. It is based on the characters of the original film created by Jim Cash and Jack Epps Jr. The film also stars Miles Teller, Jennifer Connelly, Jon Hamm, Glen Powell, Lewis Pullman, Ed Harris, and Val Kilmer, who reprises his role as Iceman. In the film, Maverick confronts his past while training a group of younger Top Gun graduates, including the son of his deceased best friend, for a dangerous mission.</p><p>Development of a Top Gun sequel was announced in 2010 by Paramount Pictures. Tom Cruise, along with producer Jerry Bruckheimer and director Tony Scott, were asked to return. Craig wrote a draft of the screenplay in 2012, but the project stalled when Scott died later that year. The film was later dedicated to Scott's memory. Production resumed in 2017 after Kosinski was hired to direct. Principal photography, which involved the use of IMAX-certified 6K full-frame cameras, took place from May 2018 to April 2019 in California, Washington, and Maryland. The film was initially scheduled to be released on July 12, 2019, but it was delayed several times due to its complex action sequences and the COVID-19 pandemic. During the pandemic, several streaming companies attempted to purchase the streaming rights to the film from Paramount, but all offers were declined on the orders of Cruise, who insisted the film be released exclusively in theaters.</p><p>Top Gun: Maverick premiered at CinemaCon on April 28, 2022, and was theatrically released by Paramount Pictures in the United States on May 27, 2022. The film was acclaimed by critics, with many calling it better than its predecessor. It won Best Film from the National Board of Review and was also named one of the top ten films of 2022 by the American Film Institute. Top Gun: Maverick was nominated for six awards at the 95th Academy Awards (including Best Picture), winning Best Sound, and received numerous other accolades. The film grossed $1.496 billion worldwide, making it the second-highest-grossing film of 2022 and the highest-grossing film of Cruise's career.</p>"
  },
  "plotFull": {
    "plainText": "Top Gun: Maverick is a 2022 American action drama film directed by Joseph Kosinski and written by Ehren Kruger, Eric Warren Singer, and Christopher McQuarrie from stories by Peter Craig and Justin Marks. The film is a sequel to the 1986 film Top Gun. Tom Cruise reprises his starring role as the naval aviator Maverick. It is based on the characters of the original film created by Jim Cash and Jack Epps Jr. The film also stars Miles Teller, Jennifer Connelly, Jon Hamm, Glen Powell, Lewis Pullman, Ed Harris, and Val Kilmer, who reprises his role as Iceman. In the film, Maverick confronts his past while training a group of younger Top Gun graduates, including the son of his deceased best friend, for a dangerous mission.\r\nDevelopment of a Top Gun sequel was announced in 2010 by Paramount Pictures. Tom Cruise, along with producer Jerry Bruckheimer and director Tony Scott, were asked to return. Craig wrote a draft of the screenplay in 2012, but the project stalled when Scott died later that year. The film was later dedicated to Scott's memory. Production resumed in 2017 after Kosinski was hired to direct. Principal photography, which involved the use of IMAX-certified 6K full-frame cameras, took place from May 2018 to April 2019 in California, Washington, and Maryland. The film was initially scheduled to be released on July 12, 2019, but it was delayed several times due to its complex action sequences and the COVID-19 pandemic. During the pandemic, several streaming companies attempted to purchase the streaming rights to the film from Paramount, but all offers were declined on the orders of Cruise, who insisted the film be released exclusively in theaters.\r\nTop Gun: Maverick premiered at CinemaCon on April 28, 2022, and was theatrically released by Paramount Pictures in the United States on May 27, 2022. The film was acclaimed by critics, with many calling it better than its predecessor. It won Best Film from the National Board of Review and was also named one of the top ten films of 2022 by the American Film Institute. Top Gun: Maverick was nominated for six awards at the 95th Academy Awards (including Best Picture), winning Best Sound, and received numerous other accolades. The film grossed $1.496 billion worldwide, making it the second-highest-grossing film of 2022 and the highest-grossing film of Cruise's career.\r\nPlot\r\nMore than 30 years after graduating from Top Gun, United States Navy Captain Pete \"Maverick\" Mitchell is a test pilot. Despite many achievements, repeated insubordination has kept him from flag rank; his friend and former Top Gun rival, Admiral Tom \"Iceman\" Kazansky, now Commander of the U.S. Pacific Fleet, often protects Maverick. Rear Admiral Chester \"Hammer\" Cain plans to cancel Maverick's hypersonic \"Darkstar\" scramjet program in favor of funding drones. To save the program, Maverick unilaterally changes the target speed for that day's test from Mach 9 to the final contract specification of Mach 10. However, the prototype is destroyed when he cannot resist pushing beyond Mach 10. Iceman again saves Maverick's career by assigning him to the Top Gun school at NAS North Island for his next assignment, but Cain tells Maverick that the era of crewed fighter aircraft will soon be over.\r\nThe Navy has been tasked with destroying an unsanctioned uranium enrichment plant, located in an underground bunker at the end of a canyon, before it becomes operational. It is defended by surface-to-air missiles (SAMs), GPS jammers, and fifth-generation Su-57 fighters as well as older F-14 Tomcats. Maverick devises a plan employing two pairs of F/A-18E/F Super Hornets armed with laser-guided bombs, but instead of participating in the strike, he is to train an elite group of Top Gun graduates assembled by Air Boss Vice Admiral Beau \"Cyclone\" Simpson.\r\nMaverick dogfights his skeptical students and prevails in every contest, winning their respect. Lieutenants Jake \"Hangman\" Seresin and Bradley \"Rooster\" Bradshaw—son of Maverick's deceased best friend and RIO Nick \"Goose\" Bradshaw—clash: Rooster dislikes Hangman's cavalier attitude, while Hangman criticizes Rooster's cautious flying. Maverick reunites with former girlfriend Penny Benjamin, to whom he reveals that he promised Rooster's dying mother that Rooster would not become a pilot. Rooster, unaware of the promise, angrily resents Maverick for dropping his Naval Academy application—impeding his military career—and blames him for his father's death. Maverick is reluctant to further interfere with Rooster's career, but the alternative is to send him on the extremely dangerous mission. He tells his doubts to Iceman, who has terminal throat cancer. Iceman advises that \"It's time to let go\" and reassures him that both the Navy and Rooster need Maverick.\r\nAfter Iceman dies, Cyclone removes Maverick as instructor following a training incident in which an F/A-18F is lost. Cyclone relaxes the mission parameters, so they are easier to execute but make escape much more difficult. During Cyclone's announcement, Maverick makes an unauthorized flight through the course with his preferred parameters, proving that it can be done. Cyclone reluctantly appoints Maverick as team leader.\r\nMaverick flies the lead F/A-18E, accompanied by a buddy lazing F/A-18F flown by Lieutenant Natasha \"Phoenix\" Trace and WSO Lieutenant Robert \"Bob\" Floyd. Rooster leads the second strike pair, which includes Lieutenant Reuben \"Payback\" Fitch and WSO Lieutenant Mickey \"Fanboy\" Garcia. The four jets launch from an aircraft carrier, and Tomahawk cruise missiles destroy the nearby air base as they approach. The teams destroy the plant, but the SAMs open fire during their escape, as anticipated. Rooster runs out of countermeasures, and Maverick sacrifices his plane to protect him. Believing Maverick to be dead, the others are ordered back to the carrier, but Rooster returns to find that Maverick ejected and is being targeted by an Mi-24 attack helicopter. After destroying the gunship, Rooster is shot down by a SAM and ejects. The two rendezvous and steal an F-14 from the damaged air base. Maverick and Rooster destroy two intercepting Su-57s, but a third attacks as they run out of ammunition and countermeasures. Hangman unexpectedly arrives in time to shoot it down, and the planes return safely.\r\nLater, Rooster helps Maverick work on his P-51 Mustang. Rooster looks at a photo of their mission's success, pinned alongside a photo of his late father and a young Maverick, as Penny and Maverick fly off in the P-51.\r\nCast\r\nTom Cruise as Captain Pete \"Maverick\" Mitchell: A test pilot and flight instructor, training a group of Top Gun graduates for a specialized mission\r\nMiles Teller as Lieutenant Bradley \"Rooster\" Bradshaw: An F/A-18E pilot in the mission training group. He is the son of Maverick's late RIO and best friend, LTJG Nick \"Goose\", and Carole Bradshaw. Rooster was previously portrayed by twins Aaron and Adam Weis in Top Gun in uncredited roles.\r\nJennifer Connelly as Penelope \"Penny\" Benjamin: Maverick's rekindled love interest, who is a single mother, a bar owner, and the daughter of an admiral\r\nJon Hamm as Vice Admiral Beau \"Cyclone\" Simpson: The commander of Naval Air Forces\r\nGlen Powell as LT Jake \"Hangman\" Seresin: An F/A-18E pilot and mission candidate\r\nLewis Pullman as LT Robert \"Bob\" Floyd: Phoenix's F/A-18F WSO and mission candidate\r\nEd Harris as Rear Admiral Chester \"Hammer\" Cain: Maverick's superior and head of the Darkstar program\r\nVal Kilmer as Admiral Tom \"Iceman\" Kazansky: The commander of U.S. Pacific Fleet, close friend and former rival of Maverick\r\nMonica Barbaro as LT Natasha \"Phoenix\" Trace: An F/A-18F pilot and mission candidate\r\nCharles Parnell as RADM Solomon \"Warlock\" Bates: The commander of the Naval Aviation Warfighting Development Center and an acquaintance of Maverick's\r\nJay Ellis as LT Reuben \"Payback\" Fitch: An F/A-18F pilot and mission candidate\r\nDanny Ramirez as LT Mickey \"Fanboy\" Garcia: Payback's F/A-18F WSO and mission candidate\r\nGreg Tarzan Davis as LT Javy \"Coyote\" Machado: An F/A-18E pilot and mission candidate\r\nBashir Salahuddin as Chief Warrant Officer Four Bernie \"Hondo\" Coleman: A friend of Maverick's\r\nManny Jacinto as LT Billy \"Fritz\" Avalone: An F/A-18E pilot and mission candidate\r\nRaymond Lee as LT Logan \"Yale\" Lee: An F/A-18F pilot and mission candidate\r\nJake Picking as LT Brigham \"Harvard\" Lennox: Yale's F/A-18F WSO and mission candidate\r\nJack Schumacher as LT Neil \"Omaha\" Vikander: An F/A-18F pilot and mission candidate\r\nKara Wang as LT Callie \"Halo\" Bassett: Omaha's F/A-18F WSO and mission candidate\r\nLyliana Wray as Amelia Benjamin: Penny's daughter\r\nJean Louisa Kelly as Sarah Kazansky: Iceman's wife\r\nJames Handy as Jimmy: An old bartender at Penny's bar\r\nChido Nwokocha as Mission Controller\r\nChelsea Harris as Admiral's Aide\r\nAnthony Edwards, Meg Ryan, as well as Aaron and Adam Weis appear as the Bradshaw family in archive footage from Top Gun, along with Kelly McGillis as Charlotte \"Charlie\" Blackwood.\r\nProduction\r\nDevelopment\r\nIn 1990, during the promotion of Born on the Fourth of July (1989), Tom Cruise dismissed the notion of a sequel to Top Gun (1986) as \"irresponsible\". Paramount Pictures began development on the film in 2010 after making offers to Jerry Bruckheimer and Tony Scott to create a sequel to Top Gun with Tom Cruise reprising his role. When asked about his idea for a new Top Gun film, Scott replied, \"This world fascinated me, because it's so different from what it was originally. But I don't want to do a remake. I don't want to do a reinvention. I want to do a new movie.\" It was reported that the film would focus on the end of the dogfighting era, the role of drones in modern aerial warfare, and would see Cruise's character, Maverick, fly an F/A-18E Super Hornet. Following Scott's suicide in 2012, the sequel's future became uncertain, but producer Jerry Bruckheimer remained committed to the project, especially given interest expressed by Cruise and Kilmer.\r\nCruise revealed in June 2017 that the sequel would be titled Top Gun: Maverick, noting that he did not want a number in the title. He added that the film is \"going to be a competition film, similar to the first one\", but clarified it as \"a progression for Maverick\". By July 2017, Joseph Kosinski was announced as the director, after previously collaborating with Cruise on Oblivion (2013). Kosinski met with Cruise on the set of Mission: Impossible – Fallout (2018), providing a lookbook, a poster, and a title, Top Gun: Maverick, prior to his hiring. Cruise then contacted Jim Gianopulos and requested to make the film.\r\nOn June 19, 2019, at CineEurope in Barcelona, attendees were able to watch for the first time some early footage of the film from a special Paramount presentation. During the presentation the President of International Theatrical Distribution Mark Viane and co-president of Worldwide Marketing and Distribution Mary Daily appeared in flight clothes, as a part of the promotion. In 2019, China's Tencent invested 12.5% of the film but later pulled out of the project at the end of that year over concerns that the film's themes could anger the Chinese government.\r\nWriting\r\nBy mid-2010, Christopher McQuarrie received an offer to write the sequel's screenplay, which was rumored to have Cruise's character Maverick in a smaller role. The following year, Ashley Edward Miller and Zack Stentz were credited as screenwriters on the project. The studio would later move onto Peter Craig to draft a new script under Scott's direction in March 2012. However, the project was unexpectedly stalled due to Scott's suicide in August of that year. In March 2014, Bruckheimer said the filmmakers were taking a new approach, which involved pilots being rendered obsolete by drones.\r\nIn September 2014, the sequel was officially revived with Justin Marks entering negotiations to write the screenplay. Marks claimed that the sequel to Top Gun was his \"dream project\" and that the first film was \"an iconic film in his memory\" which inspired him to pursue his film career. He researched the Joint Strike Fighter, the F-35, for the film's script to give an insight of \"how Top Gun would be represented in the current period\".\r\n\"Maverick in that film was in his early twenties and now he's in his fifties. It had to be a different journey, but it was important it was a journey for a man at a different part of his life. We think of Top Gun as an action film, but I think of it as a drama. It has some incredible action scenes in it, but there is a drama at the center of it.\"\r\n— Kosinski, on the new script of Top Gun: Maverick\r\nPrior to his death, Scott had apparently finalized the script and began scouting locations. He and Cruise had toured Naval Air Station Fallon, Nevada, a week prior for research purposes. The Hollywood Reporter stated the Top Gun sequel was one of three directing projects in \"advanced development\".\r\nDuring scripting discussions in Paris in 2017, where Cruise was shooting for Mission: Impossible – Fallout, Kosinski pitched two ideas to Cruise. The first, about the emotional core of the film, focused on the severed relationship between Maverick and Goose's son, set against a dangerous combat mission. The second focused on Maverick's current place in the Navy as part of the \"Darkstar\" program and the secrecy surrounding it. With Kosinski in place as director, Only the Brave (2017) screenwriter Eric Warren Singer boarded the film to rewrite the script by August 2017. In October 2018, McQuarrie, a frequent collaborator of Cruise, was brought in for rewrites during production. McQuarrie opted to mostly ignore the first film during the writing process and even flew with the Blue Angels in preparation. By January 2020, final screenplay credits were given to Ehren Kruger, Singer, and McQuarrie, while story credit was attributed to Craig and Marks.\r\nCasting\r\nCruise's involvement in Top Gun: Maverick was first announced in January 2016. He was paid between $12–14 million for his performance, which was revised to over $100 million after his share of the film's box office gross. Val Kilmer, now cancer-free, had campaigned on his Facebook page to reprise his role in the film. By June 2018, TheWrap reported that he would appear in the film. While Bruckheimer and the filmmakers wanted to bring Kilmer back, Cruise was the one who insisted the most in allowing Kilmer to reprise his role. A trailer released in March 2022, featured a photograph of Kilmer wearing a uniform of a four-star admiral. In July 2018, Miles Teller was cast in the role of Goose's son, against Nicholas Hoult and Glen Powell. Later that month, Jennifer Connelly joined the film's cast to play a single mother running a bar near the naval base.\r\nIn August 2018, Powell joined the cast of the film in a pilot trainee role that was enlarged for him, having impressed Cruise, Bruckheimer, and executives at Paramount and Skydance Media, with his auditions. He was cast as the arrogant \"Hangman\", who was originally named \"Slayer\" when he read the script. Powell was initially unimpressed by the prospect of taking the role, feeling the character was a unidimensional \"dick garnish\" and a \"Navy Draco Malfoy\" with no payoff nor reason to exist other than adding conflict to \"Rooster\"'s character arc. However, Cruise, Bruckheimer, Kosinski and McQuarrie managed to convince him that he could shape his performance to make \"Hangman\" a more well-rounded character, with Cruise himself suggesting Powell that not all body languages work in global markets to ensure he could play \"Hangman\" in a way audiences would emotionally connect with the character. In the same month, Monica Barbaro, Thomasin McKenzie, Charles Parnell, Jay Ellis, Bashir Salahuddin, Danny Ramirez, Ed Harris, Jon Hamm, and Lewis Pullman joined the cast of the film with Barbaro, Pullman, Ellis, and Ramirez portraying aviator trainees, while McKenzie was planned to portray the daughter of Connelly's character.\r\nHamm signed onto the film before he was even given an official offer or script. In September 2018, Manny Jacinto joined the cast. In October 2018, Kara Wang, Jack Schumacher, Greg Tarzan Davis, Jake Picking, Raymond Lee, Jean Louisa Kelly and Lyliana Wray joined the cast; Wray replaced McKenzie who dropped out of the film after signing onto Lost Girls (2020). In November 2018, Chelsea Harris joined the cast. Kelly McGillis, Meg Ryan and Aaron and Adam Weis, who each appeared in the original film, were not asked to appear in the sequel.\r\nAccording to an interview with Vanity Fair, Lewis Hamilton was offered a fighter pilot role since he has a close friendship with Cruise but turned down the offer due to his Formula One commitments.\r\nFilming\r\nTo create the illusion that the actors were piloting the jets during flying scenes, the producers paid the Navy $11,374 per flight hour for F/A-18E (single seat) and F/A-18F (dual seat) Super Hornets and pilots to fly them. For external shots real Navy pilots flew the E version. For shots of the actors in flight, the F version was used with the actual pilot in the front seat. One F/A-18F was rigged with special cameras to film an actor in the back seat. Cruise designed a unique three-month \"boot camp\" to train the actors with flying roles to get them used to aerobatics and high g-forces, as well as build the spatial awareness they would need to operate the camera equipment. Some of the training was required by the Navy for passengers in tactical jets, including underwater evacuation. Barbaro said the cast endured aerobatics riding in the Extra 300L flown by Chuck Coleman, including right before flights in the F/A-18F, to ensure their bodies had the required tolerance. She also praised the female pilots she had worked with during the filming process, and commented that while the \"military aviation community progressive, there's no way that doesn't still exist in little moments here and there. It's par for the course for women in historically male-dominated spaces. So I was glad we kept that in.\" The actors also had to learn lighting, cinematography, and editing to properly run the cameras, because, as Bruckheimer put it, \"when they're up in the jet they have to direct themselves essentially.\"\r\nPreliminary production on the film officially started on May 30, 2018, in San Diego. The crew filmed aerial shots at Naval Air Station Fallon. During late August a 15-person film crew from Paramount and Bruckheimer Films was aboard the Norfolk-based aircraft carrier USS Abraham Lincoln to shoot flight deck operations. In mid-February 2019, Cruise and the production crew were sighted on board USS Theodore Roosevelt at NAS North Island. In March, filming in the Cascade Mountains was completed at Naval Air Station Whidbey Island in Oak Harbor, Washington, where routes were scouted by helicopter and the L-39 before filming the F/A-18s. On June 19, 2019, Miles Teller revealed in an interview that he had finished filming two days earlier. Principal photography was scheduled until April 15, 2019, in San Diego, Lemoore, China Lake, Chico, and Lake Tahoe in California; Seattle; and Patuxent River, Maryland. The low-pass scene with Ed Harris filmed at China Lake included flying a Blue Angels plane at less than 50 ft (15 m) around 450 kn (830 km/h), which on the 20th and last pass resulted in roofing from the guard shack flying off held only by romex cable. The post-production and editing works were supervised by Kosinski, at his home during the COVID-19 pandemic lockdown.\r\nThe film was shot in IMAX format using IMAX-certified Sony Venice 6K full frame cameras. Kosinski explained that the team spent more than a year with Navy forces to use the IMAX cameras inside the cockpit, with four cameras facing toward the actors and two facing forward, in addition to cameras mounted all over the exteriors of the aircraft. He explained that \"the audience should feel the authenticity, strain, speed and gravitational forces, something that cannot be achieved through soundstage or visual effects, which needed a tremendous amount of effort and work.\" NAVAIR engineers utilized wind tunnel testing and computer modeling to properly rig cameras to the aircraft to withstand the speeds and g-forces sustained during maneuvering and carrier landings while maintaining safety in the event of ejection. The crew shot the aerial footage outside the F/A-18s with gimbal-stabilized cameras on three different platforms: a nose-mounted rig on one of two modified Aero L-39 Albatros that could film at 350 kn (648 km/h) and 3 g, nose- and tail-mounted cameras on an Embraer Phenom 300, and a nose-mounted rig on an Airbus AS350 helicopter. More than 800 hours of aerial footage was shot for the film, exceeding the combined footage shot for the films in the Lord of The Rings trilogy.\r\nThe old military bar was constructed in the beach side in Los Angeles. The steel structure was assembled off-site for visual inspection, then dismantled and re-built on set.\r\nAircraft\r\nFor most of the planes including the F/A-18E/F, the production crew acquired 20 working aircraft from all over the country. Hindle said that Kosinski had made specifications for every detail during design, including the helmets, suits, props, and several others.\r\nDarkstar\r\nThe fictional \"Darkstar\" aircraft was designed with the assistance of engineers from Lockheed Martin and its Skunk Works division. A full-scale mockup of the aircraft was built and filmed at China Lake. Kosinski said \"The reason we approached Skunk Works is because I wanted to make the most realistic hypersonic aircraft we possibly could. In fact, as you saw, we built it full-scale in cooperation with them. But the reason it looks so real is because it was the engineers from Skunk Works who helped us design it. So those are the same people who are working on real aircraft who helped us design Darkstar for this film.\" Lockheed explicitly denied that Darkstar is related to the uncrewed Lockheed Martin SR-72, which the company has never confirmed as existing.\r\nF-14\r\nProduction designer Jeremy Hindle said that using a F-14 Tomcat (which is featured in the first film) would have been difficult as \"There are no F-14s that fly because they and all the engines have been taken out of them.\" He explained that they were not able to use the active F-14 Tomcats present in Iran, the only other country that acquired the aircraft, due to sanctions. The U.S. scuttled or disabled its vast fleet of F-14s once they were retired to prevent the illicit export of spare parts.\r\nWith help from the Navy, the production team secured one F-14A from the San Diego Air & Space Museum in California. Hindle described further challenges, including dismantling and shipping the plane's components, and making the aircraft as functional as possible, though still without engines.\r\nPost-production\r\nIn an interview with aviation YouTuber C.W. Lemoine, one of the VFX artists on the special effects team, Fred Lyn, stated that the use of CGI was extensive in the film with the F-14 and Su-57 visualized entirely by computer. Lyn also said that the F/A-18 scenes predominantly involved a single jet, which was then put through CGI to create the dogfight training scenes that depicted multiple jets. The four-jet strike force at the end of the film was also created through CGI from a single F/A-18.\r\nSkywalker Sound worked on sound design and temp mixing for the film. They were tasked with creating aviation sound effects, working closely with GE Aviation, a jet engine manufacturer out of Cincinnati. With final sound editing and mixing handled by London-based Soundbyte Studios and Twickenham Film Studios, which the mix was completed in Dolby Atmos and IMAX during the middle of the pandemic. Recording mixers Chris Burdon and Mark Taylor worked in two theaters with different audio configurations to complete the mixes, which took place from June–July 2020.\r\nFollowing his treatment and operation for throat cancer, Val Kilmer lost his ability to speak effectively. In 2021, he worked with Sonantic, a UK-based software company that specializes in voice synthesis, to digitally recreate his voice using AI technology and archived audio recordings of his voice. The collaboration with Sonantic led to a successful vocal model program that Kilmer could apply in future projects. For Top Gun: Maverick, however, this technology was not used. Director Joseph Kosinski clarified in an interview that they used Kilmer's actual voice, digitally altering it to enhance clarity.\r\nFootage from the original film was used in a scene where Maverick watches Rooster playing \"Great Balls of Fire\" on the piano, invoking memories of Goose's family and death. The footage was used as a flashback, to help explain the characters' relationship and to deepen the emotional conflicts involved. This was not planned in the original script; Kosinski introduced the idea in the film editing phase.\r\nMusic\r\nTop Gun composer Harold Faltermeyer reprised his role, being joined by Lady Gaga, OneRepublic, and Hans Zimmer. The soundtrack was produced by Lorne Balfe. The soundtrack was released on May 27, 2022, through Interscope Records and Paramount Music. It was promoted by two singles, \"Hold My Hand\" by Lady Gaga and \"I Ain't Worried\" by OneRepublic. From the first film, the score also incorporates elements of the original \"Top Gun Anthem\", and the song \"Danger Zone\", composed by Giorgio Moroder and sung by Kenny Loggins.\r\nMarketing\r\nThe film's first teaser trailer premiered during a surprise appearance by Cruise at the 2019 San Diego Comic Con on July 18, 2019. The first trailer received high praise from fans, with many lauding the return of the series and some comparing it to Star Wars: The Rise of Skywalker. The Hollywood Reporter wrote that some fans noticed that the flag of the Republic of China (the flag used by the government of the Republic of China based on the island of Taiwan) and the Flag of Japan were missing from the flight jacket of Cruise's character and accused Paramount of removing it to appease China-based co-financier Tencent Pictures. However, the Republic of China and Japanese flags were later restored, as Tencent would end up pulling out of the production, leading to them being uncredited in the final film. The second trailer was released in December 2019, and a new Snapchat filter for the film was introduced by Paramount, to engage \"young-generation audiences\".\r\nIn February 2020, toy manufacturer Matchbox (owned by Mattel) announced that they were releasing a series of Top Gun die-cast models and products, including the F-14 Tomcat, F/A-18E/F Super Hornet, and the P-51 Mustang, as well as role play items. They were scheduled for public release on June 1, 2020, despite the delayed theatrical release. In June 2020, plastic model manufacturer Revell released a series of 1/48 scale Top Gun plastic models, including an F-14A Tomcat and an F/A-18E Super Hornet based upon the aircraft in the movie. These are versions of previous Revell offerings with modified decals and markings. In July 2020, Hasbro announced a Top Gun-themed Transformers toy, \"Maverick\", which was released later in the year. Hasbro later re-released the toy as a Walmart exclusive to tie into the film's final release date.\r\nOn August 26, 2021, the first 13 minutes of the film were previewed at CinemaCon along with a new trailer with Tom Cruise marking his presence virtually at the event. In January 2022, CBS Sports released a new clip from the film, coinciding with the AFC Championship Game between the Kansas City Chiefs and the Cincinnati Bengals. In February 2022, the final trailer of the film tied to Porsche was aired before Super Bowl LVI. In April 2022, Project ACES, the developers of the Ace Combat series, announced the release of an aircraft collaboration DLC for Ace Combat 7: Skies Unknown with Top Gun: Maverick, released on May 26, one day before the film's release. A free expansion based on Top Gun Maverick was also released for Microsoft Flight Simulator on the same day, containing the F/A-18E/F Superhornet and fictional \"Darkstar\" planes as playable aircraft. An interactive website was also launched on the same month. On May 23, Cruise collaborated with The Late Late Show host James Corden for recreating a fighter sequence as a part of promotions.\r\nA three-week promotional tour was conducted in Mexico City, Tokyo, Cannes, London, San Diego and Los Angeles. Event Cinemas announced Top Gun: Maverick Collector Combo, featuring a medium large salt-popcorn with refreshments in a collector cup, being marketed with stills featuring Cruise. Other marketing deals were arranged with Applebee's restaurant chains and Vudu.\r\nRelease\r\nTheatrical\r\nTop Gun: Maverick was released theatrically by Paramount Pictures in the United States on May 27, 2022, with advance screenings starting the day before. It was originally scheduled to be released on July 12, 2019, but was delayed to June 26, 2020, in order to shoot several complex action sequences. By March 2020, Paramount moved the film up two days early on June 24, 2020, and it was then moved to December 23 due to the ongoing COVID-19 pandemic declared by the World Health Organization. On July 23, 2020, the film was delayed again to July 2, 2021, due in part to scheduling conflicts with Cruise, as well as the recent delays of Mulan and Tenet due to the rise of COVID-19 cases, and was further delayed to November 19, 2021, before finalizing the May 2022 release date.\r\nThe film had its world premiere at CinemaCon on April 28, 2022 which was followed by a global premiere hosted at the San Diego Civic Theatre in San Diego, on May 4, which was also streamed live through YouTube. It also screened at the Cannes Film Festival on May 18 in an Official Selection Screening, where it received a five-minute standing ovation from the audience. The Cannes premiere included a tribute to Cruise and his career. The following day it had its UK premiere at the Royal Film Performance at London's Odeon Luxe Leicester Square in aid of the Film & TV Charity. The film was the last Royal Film Performance of Queen Elizabeth II's reign as she died later that same year. ScreenX theaters and AMC Theatres held Early Access Event screenings at limited locations across the United States on May 24, 2022.\r\nHome media\r\nApple TV+ attempted to purchase the distribution rights to Top Gun: Maverick, but Paramount declined to sell them. When asked at the film's CinemaCon premiere about Apple and other streaming companies attempting to purchase the distribution rights, Bruckheimer said that the film had always had a big-screen destination. At the film's premiere at Cannes, Cruise also denied that the film was going to streaming. Despite the model that most films debut on streaming 45 days after their theatrical releases, Paramount decided to keep Top Gun: Maverick in theaters for an extended run due to Cruise's insistence and the successive week-to-week box office results of the film. The film was released digitally in standard definition, high definition and UHD on August 23, 2022, followed by the Ultra HD Blu-ray, Blu-ray, and DVD releases on November 1, 2022, in the United States and October 31, 2022, in the United Kingdom. It includes the expanded aspect ratio of 1.90:1 in select sequences as seen in IMAX screenings, four featurettes on the making of the film, Cruise discussing his career at the 75th Cannes Film Festival and two music videos of the songs featured in the film.\r\nParamount+ and SkyShowtime (under the joint venture between both Paramount Global and Sky Group) made Top Gun: Maverick available to stream on December 22, 2022 as part of a customer's subscription to either service. In the United States, Top Gun: Maverick became the most-watched film to debut on Paramount+.\r\nReception\r\nBox office\r\nTop Gun: Maverick grossed $718.7 million in the United States and Canada, and $777 million in other territories, for a worldwide total of $1.496 billion. The film became the highest-grossing film of Cruise's career on June 17, 2022, after crossing $800 million worldwide. On June 26, the film crossed $1 billion, becoming the second film to do so during the pandemic era. It is the second-highest-grossing film released in 2022 (behind Avatar: The Way of Water). Sonny Bunch, writing for The Washington Post, argued that the film's financial success along with that of Spider-Man: No Way Home demonstrates that securing a theatrical release in China is not mandatory for a Hollywood film to be profitable. Deadline Hollywood calculated the film's net profit as $391.1 million, accounting for production budgets, marketing, talent participations, and other costs; box office grosses and home media revenues placed it second on their list of 2022's \"Most Valuable Blockbusters\".\r\nIn the United States and Canada, Top Gun: Maverick was the highest-grossing film released in 2022. It grossed $126.7 million in its opening three-day weekend and $160.5 million over the four-day Memorial Day weekend, finishing first at the box office and nearly doubling Cruise's previous career-best. The film also had the largest Memorial Day four-day opening weekend. In its second weekend, it grossed $90 million; the 29% drop was the smallest-ever for a film that had an opening of over $100 million, surpassing Shrek 2 (33% drop in its second weekend from a $108 million debut in May 2004). The film was dethroned by newcomer Jurassic World Dominion in its third weekend, though still grossed $51.9 million. The film remained in the top five at the box office throughout its first ten weeks of release. The film finally dropped out of the top five at the box office in its 11th weekend, finishing sixth with $7 million. In its 12th weekend the film was re-released in over 400 theaters and made $7.1 million, returning to second place. In its 15th weekend, the film made $6 million (and a total of $7.9 million over the four-day Labor Day frame), returning to the top of the box office. Box office analysts attributed the film's longevity at the box office to positive critical reviews and word of mouth.\r\nOutside the US and Canada, the film grossed $124 million from 62 markets in its opening weekend. It was Cruise's biggest opening ever in 32 of those markets and Paramount's best opening for a live-action film in 18 of them. The largest markets in its opening weekend were the United Kingdom ($19.4 million), France ($11.7 million), Australia ($10.7 million), Japan ($9.7 million), and Germany ($6.5 million). The film had the best debut of Cruise's career in the Middle East ($6.3 million), Brazil ($5.3 million), the Netherlands ($2.4 million), Sweden ($2.2 million), Belgium ($1.7 million), New Zealand ($1.4 million), Poland ($1.2 million), Argentina ($1.2 million), Finland ($1.1 million), and Portugal ($770,000). IMAX accounted for $10.4 million of its opening weekend outside the US and Canada. The following weekend, it made $85.8 million, a mere 16% drop that included $18.5 million from IMAX screenings. As of September 18, 2022, the top markets are the United Kingdom ($102 million), Japan ($93.6 million), South Korea ($67.2 million), Australia ($64.3 million), and France ($58.2 million).\r\nCritical response\r\nOn the review aggregator website Rotten Tomatoes, 96% of 469 critics' reviews are positive, with an average rating of 8.20/10. The website's consensus reads: \"Top Gun: Maverick pulls off a feat even trickier than a 4G inverted dive, delivering a long-belated sequel that surpasses its predecessor in wildly entertaining style.\" Metacritic, which uses a weighted average, assigned the film a score of 78 out of 100, based on 63 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film a rare \"A+\" grade on an A+ to F scale, while PostTrak reported 96% of audience members gave it a positive score, with 84% saying they would definitely recommend it.\r\nPete Hammond of Deadline Hollywood called the sequel better than the original movie. The New York Times-based critic A. O. Scott called it a \"thin, over-strenuous and sometimes very enjoyable movie\" and \"an earnest statement of the thesis that movies can and should be great.\" Peter Bradshaw wrote in The Guardian that \"Cruise presides over some surprising differences from his first outing as the navy pilot hotshot in a film that's missing the homoerotic tensions of the 80s original.\" Alonso Duralde of TheWrap wrote that the movie \"counts as a worthy sequel in that it succeeds and fails in many of the same ways as the original.\"\r\nEntertainment.ie's Brian Lloyd's 4-star review said the film \"exceeds with flying colours\" and \"exists in a world that is all of its own making. There are golden sunsets, perfectly crisp white t-shirts, exquisitely coiffed hair, and long-held flames of romance that make it all impossible to resist.\" Clarrise Loughery, chief editor of The Independent, wrote that the film is \"as thrilling as blockbusters get. It's the kind of edge-of-your-seat, fist-pumping spectacular that can unite an entire room full of strangers sitting in the dark and leave them with a wistful tear in their eye.\" Richard Brody of The New Yorker wrote, \"The new film, less of a sequel than a renovation, infuses the 1986 drama of airborne combat with today's politics.\" Tomris Laffly of RogerEbert.com wrote, \"Equally worthy of that big screen is the emotional strokes of Maverick that pack an unexpected punch.\"\r\nTatsam Mukherjee of Firstpost wrote that the film reminded him of James Mangold's Ford v Ferrari (2019), ruminating on the classic predicament of whether man makes machine or the other way round. He added, \"At the forefront of this clash is a man named Tom Cruise, who wants nothing less than our jaws on the floor. Proving that no amount of multiverse films or superstar cameos will replace the blood, sweat and adrenaline of an actor legitimately trying to push the boundaries of filmmaking. We can be rest assured that if it's a Tom Cruise film, he will not let us down.\" Chris Bumbray of JoBlo.com called the film \"a thrill ride of the highest order\" and wrote, \"If you're a fan of the original, this will blow you away – but even if you don't love the 1986 classic (blasphemy), this has a lot to offer.\" Marshall Shaffer of Slant Magazine named the film's climatic battle sequence as one of the best movie scenes of 2022.\r\nOn August 3, 2022, filmmaker Quentin Tarantino called Top Gun: Maverick \"fantastic\", as the film, alongside Steven Spielberg's West Side Story, \"provided a true cinematic spectacle, the kind that I'd almost thought that I wasn't going to see anymore.\" As a long-time admirer of the original Top Gun director, the late Tony Scott, he added: \"There was just this lovely, lovely aspect because I love both Tony Scott's cinema so much, and I love Tony so much that that's as close as we're ever going to get to seeing one more Tony Scott movie ... The respect and the love of Tony was in every frame. It was almost in every decision. It was consciously right there, but in this really cool way that was really respectful.\" Ridley Scott, Tony's older brother and whom Cruise worked with in the 1985 film Legend, was given a private screening for Maverick. Bruckheimer stated, \"One of the most heartwarming things I experienced is when we showed the movie to Tony’s brother, Ridley. He was laudatory in his praise for the film and the kind of care that Tom took to honor Tony throughout the movie. That was foremost in everybody's mind.\"\r\nRole of the U.S. military\r\nThe film was actively supported and influenced by the United States Department of Defense and the United States Navy to present the U.S. military in a positive light. The Navy's cooperation in the film was explained to be motivated by the goals of recruitment, retention, and showcasing military excellence. The U.S. Air Force also ran recruitment ads before the film's screenings. Further, the plot involves attacking an unidentified foreign country without declaring war or questioning the necessity. This led some critics, scholars and journalists to criticize the film as propaganda in varying measures. Some comments declared the film to be worse in this regard than its predecessor. Several sources published quid pro quo agreements outlining how the U.S. Department of Defense could influence Paramount in crafting the film, which was also described as \"mutual exploitation\".\r\nAccolades\r\nAt the 95th Academy Awards, Top Gun: Maverick received nominations for Best Picture, Best Adapted Screenplay, Best Original Song, Best Film Editing, and Best Visual Effects; and won Best Sound. The film's other nominations include four British Academy Film Awards, six Critics' Choice Movie Awards (winning one), and two Golden Globe Awards. It received two National Board of Review Awards and was named one of the ten best films of 2022 by the American Film Institute.\r\nLawsuit\r\nIn June 2022, the family of Israeli author Ehud Yonay, who wrote the California magazine article \"Top Guns\" in May 1983 that inspired the first film, sued Paramount for copyright infringement over the release of Top Gun: Maverick and sought damages as well as an injunction against the film's distribution. Jerry Bruckheimer produced the original film, whose screenplay was written by Jim Cash (died 2000) and Jack Epps Jr.; all three men participated in the sequel. According to the lawsuit, Paramount had obtained exclusive film rights to Yonay's article but ignored the 35-year copyright law, wherein the rights reverted to Yonay's widow Shosh and son Yuval in January 2020 after the writer's death in 2012.\r\nThe lawsuit claims that Maverick contains elements similar to the original article and that Paramount continued with the filming, even after receiving notice of the copyright's termination. The film distributor considers most of the sequel to have been complete before then and denies that Maverick is derived from Yonay's article.\r\nFuture\r\nIn May 2022, Teller revealed that he had been pitching a sequel, which would be tentatively titled Top Gun: Rooster and centered around his character, to Paramount Pictures. By July of the same year, he stated that he has been having ongoing discussions with Cruise regarding a sequel.",
    "html": "<p>Top Gun: Maverick is a 2022 American action drama film directed by Joseph Kosinski and written by Ehren Kruger, Eric Warren Singer, and Christopher McQuarrie from stories by Peter Craig and Justin Marks. The film is a sequel to the 1986 film Top Gun. Tom Cruise reprises his starring role as the naval aviator Maverick. It is based on the characters of the original film created by Jim Cash and Jack Epps Jr. The film also stars Miles Teller, Jennifer Connelly, Jon Hamm, Glen Powell, Lewis Pullman, Ed Harris, and Val Kilmer, who reprises his role as Iceman. In the film, Maverick confronts his past while training a group of younger Top Gun graduates, including the son of his deceased best friend, for a dangerous mission.</p><p>Development of a Top Gun sequel was announced in 2010 by Paramount Pictures. Tom Cruise, along with producer Jerry Bruckheimer and director Tony Scott, were asked to return. Craig wrote a draft of the screenplay in 2012, but the project stalled when Scott died later that year. The film was later dedicated to Scott's memory. Production resumed in 2017 after Kosinski was hired to direct. Principal photography, which involved the use of IMAX-certified 6K full-frame cameras, took place from May 2018 to April 2019 in California, Washington, and Maryland. The film was initially scheduled to be released on July 12, 2019, but it was delayed several times due to its complex action sequences and the COVID-19 pandemic. During the pandemic, several streaming companies attempted to purchase the streaming rights to the film from Paramount, but all offers were declined on the orders of Cruise, who insisted the film be released exclusively in theaters.</p><p>Top Gun: Maverick premiered at CinemaCon on April 28, 2022, and was theatrically released by Paramount Pictures in the United States on May 27, 2022. The film was acclaimed by critics, with many calling it better than its predecessor. It won Best Film from the National Board of Review and was also named one of the top ten films of 2022 by the American Film Institute. Top Gun: Maverick was nominated for six awards at the 95th Academy Awards (including Best Picture), winning Best Sound, and received numerous other accolades. The film grossed $1.496 billion worldwide, making it the second-highest-grossing film of 2022 and the highest-grossing film of Cruise's career.</p><br/><h3>Plot</h3><p>More than 30 years after graduating from Top Gun, United States Navy Captain Pete \"Maverick\" Mitchell is a test pilot. Despite many achievements, repeated insubordination has kept him from flag rank; his friend and former Top Gun rival, Admiral Tom \"Iceman\" Kazansky, now Commander of the U.S. Pacific Fleet, often protects Maverick. Rear Admiral Chester \"Hammer\" Cain plans to cancel Maverick's hypersonic \"Darkstar\" scramjet program in favor of funding drones. To save the program, Maverick unilaterally changes the target speed for that day's test from Mach 9 to the final contract specification of Mach 10. However, the prototype is destroyed when he cannot resist pushing beyond Mach 10. Iceman again saves Maverick's career by assigning him to the Top Gun school at NAS North Island for his next assignment, but Cain tells Maverick that the era of crewed fighter aircraft will soon be over.</p><p>The Navy has been tasked with destroying an unsanctioned uranium enrichment plant, located in an underground bunker at the end of a canyon, before it becomes operational. It is defended by surface-to-air missiles (SAMs), GPS jammers, and fifth-generation Su-57 fighters as well as older F-14 Tomcats. Maverick devises a plan employing two pairs of F/A-18E/F Super Hornets armed with laser-guided bombs, but instead of participating in the strike, he is to train an elite group of Top Gun graduates assembled by Air Boss Vice Admiral Beau \"Cyclone\" Simpson.</p><p>Maverick dogfights his skeptical students and prevails in every contest, winning their respect. Lieutenants Jake \"Hangman\" Seresin and Bradley \"Rooster\" Bradshaw—son of Maverick's deceased best friend and RIO Nick \"Goose\" Bradshaw—clash: Rooster dislikes Hangman's cavalier attitude, while Hangman criticizes Rooster's cautious flying. Maverick reunites with former girlfriend Penny Benjamin, to whom he reveals that he promised Rooster's dying mother that Rooster would not become a pilot. Rooster, unaware of the promise, angrily resents Maverick for dropping his Naval Academy application—impeding his military career—and blames him for his father's death. Maverick is reluctant to further interfere with Rooster's career, but the alternative is to send him on the extremely dangerous mission. He tells his doubts to Iceman, who has terminal throat cancer. Iceman advises that \"It's time to let go\" and reassures him that both the Navy and Rooster need Maverick.</p><p>After Iceman dies, Cyclone removes Maverick as instructor following a training incident in which an F/A-18F is lost. Cyclone relaxes the mission parameters, so they are easier to execute but make escape much more difficult. During Cyclone's announcement, Maverick makes an unauthorized flight through the course with his preferred parameters, proving that it can be done. Cyclone reluctantly appoints Maverick as team leader.</p><p>Maverick flies the lead F/A-18E, accompanied by a buddy lazing F/A-18F flown by Lieutenant Natasha \"Phoenix\" Trace and WSO Lieutenant Robert \"Bob\" Floyd. Rooster leads the second strike pair, which includes Lieutenant Reuben \"Payback\" Fitch and WSO Lieutenant Mickey \"Fanboy\" Garcia. The four jets launch from an aircraft carrier, and Tomahawk cruise missiles destroy the nearby air base as they approach. The teams destroy the plant, but the SAMs open fire during their escape, as anticipated. Rooster runs out of countermeasures, and Maverick sacrifices his plane to protect him. Believing Maverick to be dead, the others are ordered back to the carrier, but Rooster returns to find that Maverick ejected and is being targeted by an Mi-24 attack helicopter. After destroying the gunship, Rooster is shot down by a SAM and ejects. The two rendezvous and steal an F-14 from the damaged air base. Maverick and Rooster destroy two intercepting Su-57s, but a third attacks as they run out of ammunition and countermeasures. Hangman unexpectedly arrives in time to shoot it down, and the planes return safely.</p><p>Later, Rooster helps Maverick work on his P-51 Mustang. Rooster looks at a photo of their mission's success, pinned alongside a photo of his late father and a young Maverick, as Penny and Maverick fly off in the P-51.</p><br/><h3>Cast</h3><ul><li>Tom Cruise as Captain Pete \"Maverick\" Mitchell: A test pilot and flight instructor, training a group of Top Gun graduates for a specialized mission</li><li>Miles Teller as Lieutenant Bradley \"Rooster\" Bradshaw: An F/A-18E pilot in the mission training group. He is the son of Maverick's late RIO and best friend, LTJG Nick \"Goose\", and Carole Bradshaw. Rooster was previously portrayed by twins Aaron and Adam Weis in Top Gun in uncredited roles.</li><li>Jennifer Connelly as Penelope \"Penny\" Benjamin: Maverick's rekindled love interest, who is a single mother, a bar owner, and the daughter of an admiral</li><li>Jon Hamm as Vice Admiral Beau \"Cyclone\" Simpson: The commander of Naval Air Forces</li><li>Glen Powell as LT Jake \"Hangman\" Seresin: An F/A-18E pilot and mission candidate</li><li>Lewis Pullman as LT Robert \"Bob\" Floyd: Phoenix's F/A-18F WSO and mission candidate</li><li>Ed Harris as Rear Admiral Chester \"Hammer\" Cain: Maverick's superior and head of the Darkstar program</li><li>Val Kilmer as Admiral Tom \"Iceman\" Kazansky: The commander of U.S. Pacific Fleet, close friend and former rival of Maverick</li><li>Monica Barbaro as LT Natasha \"Phoenix\" Trace: An F/A-18F pilot and mission candidate</li><li>Charles Parnell as RADM Solomon \"Warlock\" Bates: The commander of the Naval Aviation Warfighting Development Center and an acquaintance of Maverick's</li><li>Jay Ellis as LT Reuben \"Payback\" Fitch: An F/A-18F pilot and mission candidate</li><li>Danny Ramirez as LT Mickey \"Fanboy\" Garcia: Payback's F/A-18F WSO and mission candidate</li><li>Greg Tarzan Davis as LT Javy \"Coyote\" Machado: An F/A-18E pilot and mission candidate</li><li>Bashir Salahuddin as Chief Warrant Officer Four Bernie \"Hondo\" Coleman: A friend of Maverick's</li><li>Manny Jacinto as LT Billy \"Fritz\" Avalone: An F/A-18E pilot and mission candidate</li><li>Raymond Lee as LT Logan \"Yale\" Lee: An F/A-18F pilot and mission candidate</li><li>Jake Picking as LT Brigham \"Harvard\" Lennox: Yale's F/A-18F WSO and mission candidate</li><li>Jack Schumacher as LT Neil \"Omaha\" Vikander: An F/A-18F pilot and mission candidate</li><li>Kara Wang as LT Callie \"Halo\" Bassett: Omaha's F/A-18F WSO and mission candidate</li><li>Lyliana Wray as Amelia Benjamin: Penny's daughter</li><li>Jean Louisa Kelly as Sarah Kazansky: Iceman's wife</li><li>James Handy as Jimmy: An old bartender at Penny's bar</li><li>Chido Nwokocha as Mission Controller</li><li>Chelsea Harris as Admiral's Aide</li></ul><p>Anthony Edwards, Meg Ryan, as well as Aaron and Adam Weis appear as the Bradshaw family in archive footage from Top Gun, along with Kelly McGillis as Charlotte \"Charlie\" Blackwood.</p><br/><h3>Production</h3><h4>Development</h4><p>In 1990, during the promotion of Born on the Fourth of July (1989), Tom Cruise dismissed the notion of a sequel to Top Gun (1986) as \"irresponsible\". Paramount Pictures began development on the film in 2010 after making offers to Jerry Bruckheimer and Tony Scott to create a sequel to Top Gun with Tom Cruise reprising his role. When asked about his idea for a new Top Gun film, Scott replied, \"This world fascinated me, because it's so different from what it was originally. But I don't want to do a remake. I don't want to do a reinvention. I want to do a new movie.\" It was reported that the film would focus on the end of the dogfighting era, the role of drones in modern aerial warfare, and would see Cruise's character, Maverick, fly an F/A-18E Super Hornet. Following Scott's suicide in 2012, the sequel's future became uncertain, but producer Jerry Bruckheimer remained committed to the project, especially given interest expressed by Cruise and Kilmer.</p><p>Cruise revealed in June 2017 that the sequel would be titled Top Gun: Maverick, noting that he did not want a number in the title. He added that the film is \"going to be a competition film, similar to the first one\", but clarified it as \"a progression for Maverick\". By July 2017, Joseph Kosinski was announced as the director, after previously collaborating with Cruise on Oblivion (2013). Kosinski met with Cruise on the set of Mission: Impossible – Fallout (2018), providing a lookbook, a poster, and a title, Top Gun: Maverick, prior to his hiring. Cruise then contacted Jim Gianopulos and requested to make the film.</p><p>On June 19, 2019, at CineEurope in Barcelona, attendees were able to watch for the first time some early footage of the film from a special Paramount presentation. During the presentation the President of International Theatrical Distribution Mark Viane and co-president of Worldwide Marketing and Distribution Mary Daily appeared in flight clothes, as a part of the promotion. In 2019, China's Tencent invested 12.5% of the film but later pulled out of the project at the end of that year over concerns that the film's themes could anger the Chinese government.</p><h4>Writing</h4><p>By mid-2010, Christopher McQuarrie received an offer to write the sequel's screenplay, which was rumored to have Cruise's character Maverick in a smaller role. The following year, Ashley Edward Miller and Zack Stentz were credited as screenwriters on the project. The studio would later move onto Peter Craig to draft a new script under Scott's direction in March 2012. However, the project was unexpectedly stalled due to Scott's suicide in August of that year. In March 2014, Bruckheimer said the filmmakers were taking a new approach, which involved pilots being rendered obsolete by drones.</p><p>In September 2014, the sequel was officially revived with Justin Marks entering negotiations to write the screenplay. Marks claimed that the sequel to Top Gun was his \"dream project\" and that the first film was \"an iconic film in his memory\" which inspired him to pursue his film career. He researched the Joint Strike Fighter, the F-35, for the film's script to give an insight of \"how Top Gun would be represented in the current period\".</p><blockquote>\"Maverick in that film was in his early twenties and now he's in his fifties. It had to be a different journey, but it was important it was a journey for a man at a different part of his life. We think of Top Gun as an action film, but I think of it as a drama. It has some incredible action scenes in it, but there is a drama at the center of it.\"</blockquote><p>— Kosinski, on the new script of Top Gun: Maverick</p><p>Prior to his death, Scott had apparently finalized the script and began scouting locations. He and Cruise had toured Naval Air Station Fallon, Nevada, a week prior for research purposes. The Hollywood Reporter stated the Top Gun sequel was one of three directing projects in \"advanced development\".</p><p>During scripting discussions in Paris in 2017, where Cruise was shooting for Mission: Impossible – Fallout, Kosinski pitched two ideas to Cruise. The first, about the emotional core of the film, focused on the severed relationship between Maverick and Goose's son, set against a dangerous combat mission. The second focused on Maverick's current place in the Navy as part of the \"Darkstar\" program and the secrecy surrounding it. With Kosinski in place as director, Only the Brave (2017) screenwriter Eric Warren Singer boarded the film to rewrite the script by August 2017. In October 2018, McQuarrie, a frequent collaborator of Cruise, was brought in for rewrites during production. McQuarrie opted to mostly ignore the first film during the writing process and even flew with the Blue Angels in preparation. By January 2020, final screenplay credits were given to Ehren Kruger, Singer, and McQuarrie, while story credit was attributed to Craig and Marks.</p><h4>Casting</h4><p>Cruise's involvement in Top Gun: Maverick was first announced in January 2016. He was paid between $12–14 million for his performance, which was revised to over $100 million after his share of the film's box office gross. Val Kilmer, now cancer-free, had campaigned on his Facebook page to reprise his role in the film. By June 2018, TheWrap reported that he would appear in the film. While Bruckheimer and the filmmakers wanted to bring Kilmer back, Cruise was the one who insisted the most in allowing Kilmer to reprise his role. A trailer released in March 2022, featured a photograph of Kilmer wearing a uniform of a four-star admiral. In July 2018, Miles Teller was cast in the role of Goose's son, against Nicholas Hoult and Glen Powell. Later that month, Jennifer Connelly joined the film's cast to play a single mother running a bar near the naval base.</p><p>In August 2018, Powell joined the cast of the film in a pilot trainee role that was enlarged for him, having impressed Cruise, Bruckheimer, and executives at Paramount and Skydance Media, with his auditions. He was cast as the arrogant \"Hangman\", who was originally named \"Slayer\" when he read the script. Powell was initially unimpressed by the prospect of taking the role, feeling the character was a unidimensional \"dick garnish\" and a \"Navy Draco Malfoy\" with no payoff nor reason to exist other than adding conflict to \"Rooster\"'s character arc. However, Cruise, Bruckheimer, Kosinski and McQuarrie managed to convince him that he could shape his performance to make \"Hangman\" a more well-rounded character, with Cruise himself suggesting Powell that not all body languages work in global markets to ensure he could play \"Hangman\" in a way audiences would emotionally connect with the character. In the same month, Monica Barbaro, Thomasin McKenzie, Charles Parnell, Jay Ellis, Bashir Salahuddin, Danny Ramirez, Ed Harris, Jon Hamm, and Lewis Pullman joined the cast of the film with Barbaro, Pullman, Ellis, and Ramirez portraying aviator trainees, while McKenzie was planned to portray the daughter of Connelly's character.</p><p>Hamm signed onto the film before he was even given an official offer or script. In September 2018, Manny Jacinto joined the cast. In October 2018, Kara Wang, Jack Schumacher, Greg Tarzan Davis, Jake Picking, Raymond Lee, Jean Louisa Kelly and Lyliana Wray joined the cast; Wray replaced McKenzie who dropped out of the film after signing onto Lost Girls (2020). In November 2018, Chelsea Harris joined the cast. Kelly McGillis, Meg Ryan and Aaron and Adam Weis, who each appeared in the original film, were not asked to appear in the sequel.</p><p>According to an interview with Vanity Fair, Lewis Hamilton was offered a fighter pilot role since he has a close friendship with Cruise but turned down the offer due to his Formula One commitments.</p><h4>Filming</h4><p>To create the illusion that the actors were piloting the jets during flying scenes, the producers paid the Navy $11,374 per flight hour for F/A-18E (single seat) and F/A-18F (dual seat) Super Hornets and pilots to fly them. For external shots real Navy pilots flew the E version. For shots of the actors in flight, the F version was used with the actual pilot in the front seat. One F/A-18F was rigged with special cameras to film an actor in the back seat. Cruise designed a unique three-month \"boot camp\" to train the actors with flying roles to get them used to aerobatics and high g-forces, as well as build the spatial awareness they would need to operate the camera equipment. Some of the training was required by the Navy for passengers in tactical jets, including underwater evacuation. Barbaro said the cast endured aerobatics riding in the Extra 300L flown by Chuck Coleman, including right before flights in the F/A-18F, to ensure their bodies had the required tolerance. She also praised the female pilots she had worked with during the filming process, and commented that while the \"military aviation community progressive, there's no way that doesn't still exist in little moments here and there. It's par for the course for women in historically male-dominated spaces. So I was glad we kept that in.\" The actors also had to learn lighting, cinematography, and editing to properly run the cameras, because, as Bruckheimer put it, \"when they're up in the jet they have to direct themselves essentially.\"</p><p>Preliminary production on the film officially started on May 30, 2018, in San Diego. The crew filmed aerial shots at Naval Air Station Fallon. During late August a 15-person film crew from Paramount and Bruckheimer Films was aboard the Norfolk-based aircraft carrier USS Abraham Lincoln to shoot flight deck operations. In mid-February 2019, Cruise and the production crew were sighted on board USS Theodore Roosevelt at NAS North Island. In March, filming in the Cascade Mountains was completed at Naval Air Station Whidbey Island in Oak Harbor, Washington, where routes were scouted by helicopter and the L-39 before filming the F/A-18s. On June 19, 2019, Miles Teller revealed in an interview that he had finished filming two days earlier. Principal photography was scheduled until April 15, 2019, in San Diego, Lemoore, China Lake, Chico, and Lake Tahoe in California; Seattle; and Patuxent River, Maryland. The low-pass scene with Ed Harris filmed at China Lake included flying a Blue Angels plane at less than 50 ft (15 m) around 450 kn (830 km/h), which on the 20th and last pass resulted in roofing from the guard shack flying off held only by romex cable. The post-production and editing works were supervised by Kosinski, at his home during the COVID-19 pandemic lockdown.</p><p>The film was shot in IMAX format using IMAX-certified Sony Venice 6K full frame cameras. Kosinski explained that the team spent more than a year with Navy forces to use the IMAX cameras inside the cockpit, with four cameras facing toward the actors and two facing forward, in addition to cameras mounted all over the exteriors of the aircraft. He explained that \"the audience should feel the authenticity, strain, speed and gravitational forces, something that cannot be achieved through soundstage or visual effects, which needed a tremendous amount of effort and work.\" NAVAIR engineers utilized wind tunnel testing and computer modeling to properly rig cameras to the aircraft to withstand the speeds and g-forces sustained during maneuvering and carrier landings while maintaining safety in the event of ejection. The crew shot the aerial footage outside the F/A-18s with gimbal-stabilized cameras on three different platforms: a nose-mounted rig on one of two modified Aero L-39 Albatros that could film at 350 kn (648 km/h) and 3 g, nose- and tail-mounted cameras on an Embraer Phenom 300, and a nose-mounted rig on an Airbus AS350 helicopter. More than 800 hours of aerial footage was shot for the film, exceeding the combined footage shot for the films in the Lord of The Rings trilogy.</p><p>The old military bar was constructed in the beach side in Los Angeles. The steel structure was assembled off-site for visual inspection, then dismantled and re-built on set.</p><h4>Aircraft</h4><p>For most of the planes including the F/A-18E/F, the production crew acquired 20 working aircraft from all over the country. Hindle said that Kosinski had made specifications for every detail during design, including the helmets, suits, props, and several others.</p><h4>Darkstar</h4><p>The fictional \"Darkstar\" aircraft was designed with the assistance of engineers from Lockheed Martin and its Skunk Works division. A full-scale mockup of the aircraft was built and filmed at China Lake. Kosinski said \"The reason we approached Skunk Works is because I wanted to make the most realistic hypersonic aircraft we possibly could. In fact, as you saw, we built it full-scale in cooperation with them. But the reason it looks so real is because it was the engineers from Skunk Works who helped us design it. So those are the same people who are working on real aircraft who helped us design Darkstar for this film.\" Lockheed explicitly denied that Darkstar is related to the uncrewed Lockheed Martin SR-72, which the company has never confirmed as existing.</p><h4>F-14</h4><p>Production designer Jeremy Hindle said that using a F-14 Tomcat (which is featured in the first film) would have been difficult as \"There are no F-14s that fly because they and all the engines have been taken out of them.\" He explained that they were not able to use the active F-14 Tomcats present in Iran, the only other country that acquired the aircraft, due to sanctions. The U.S. scuttled or disabled its vast fleet of F-14s once they were retired to prevent the illicit export of spare parts.</p><p>With help from the Navy, the production team secured one F-14A from the San Diego Air & Space Museum in California. Hindle described further challenges, including dismantling and shipping the plane's components, and making the aircraft as functional as possible, though still without engines.</p><h4>Post-production</h4><p>In an interview with aviation YouTuber C.W. Lemoine, one of the VFX artists on the special effects team, Fred Lyn, stated that the use of CGI was extensive in the film with the F-14 and Su-57 visualized entirely by computer. Lyn also said that the F/A-18 scenes predominantly involved a single jet, which was then put through CGI to create the dogfight training scenes that depicted multiple jets. The four-jet strike force at the end of the film was also created through CGI from a single F/A-18.</p><p>Skywalker Sound worked on sound design and temp mixing for the film. They were tasked with creating aviation sound effects, working closely with GE Aviation, a jet engine manufacturer out of Cincinnati. With final sound editing and mixing handled by London-based Soundbyte Studios and Twickenham Film Studios, which the mix was completed in Dolby Atmos and IMAX during the middle of the pandemic. Recording mixers Chris Burdon and Mark Taylor worked in two theaters with different audio configurations to complete the mixes, which took place from June–July 2020.</p><p>Following his treatment and operation for throat cancer, Val Kilmer lost his ability to speak effectively. In 2021, he worked with Sonantic, a UK-based software company that specializes in voice synthesis, to digitally recreate his voice using AI technology and archived audio recordings of his voice. The collaboration with Sonantic led to a successful vocal model program that Kilmer could apply in future projects. For Top Gun: Maverick, however, this technology was not used. Director Joseph Kosinski clarified in an interview that they used Kilmer's actual voice, digitally altering it to enhance clarity.</p><p>Footage from the original film was used in a scene where Maverick watches Rooster playing \"Great Balls of Fire\" on the piano, invoking memories of Goose's family and death. The footage was used as a flashback, to help explain the characters' relationship and to deepen the emotional conflicts involved. This was not planned in the original script; Kosinski introduced the idea in the film editing phase.</p><br/><h3>Music</h3><p>Top Gun composer Harold Faltermeyer reprised his role, being joined by Lady Gaga, OneRepublic, and Hans Zimmer. The soundtrack was produced by Lorne Balfe. The soundtrack was released on May 27, 2022, through Interscope Records and Paramount Music. It was promoted by two singles, \"Hold My Hand\" by Lady Gaga and \"I Ain't Worried\" by OneRepublic. From the first film, the score also incorporates elements of the original \"Top Gun Anthem\", and the song \"Danger Zone\", composed by Giorgio Moroder and sung by Kenny Loggins.</p><br/><h3>Marketing</h3><p>The film's first teaser trailer premiered during a surprise appearance by Cruise at the 2019 San Diego Comic Con on July 18, 2019. The first trailer received high praise from fans, with many lauding the return of the series and some comparing it to Star Wars: The Rise of Skywalker. The Hollywood Reporter wrote that some fans noticed that the flag of the Republic of China (the flag used by the government of the Republic of China based on the island of Taiwan) and the Flag of Japan were missing from the flight jacket of Cruise's character and accused Paramount of removing it to appease China-based co-financier Tencent Pictures. However, the Republic of China and Japanese flags were later restored, as Tencent would end up pulling out of the production, leading to them being uncredited in the final film. The second trailer was released in December 2019, and a new Snapchat filter for the film was introduced by Paramount, to engage \"young-generation audiences\".</p><p>In February 2020, toy manufacturer Matchbox (owned by Mattel) announced that they were releasing a series of Top Gun die-cast models and products, including the F-14 Tomcat, F/A-18E/F Super Hornet, and the P-51 Mustang, as well as role play items. They were scheduled for public release on June 1, 2020, despite the delayed theatrical release. In June 2020, plastic model manufacturer Revell released a series of 1/48 scale Top Gun plastic models, including an F-14A Tomcat and an F/A-18E Super Hornet based upon the aircraft in the movie. These are versions of previous Revell offerings with modified decals and markings. In July 2020, Hasbro announced a Top Gun-themed Transformers toy, \"Maverick\", which was released later in the year. Hasbro later re-released the toy as a Walmart exclusive to tie into the film's final release date.</p><p>On August 26, 2021, the first 13 minutes of the film were previewed at CinemaCon along with a new trailer with Tom Cruise marking his presence virtually at the event. In January 2022, CBS Sports released a new clip from the film, coinciding with the AFC Championship Game between the Kansas City Chiefs and the Cincinnati Bengals. In February 2022, the final trailer of the film tied to Porsche was aired before Super Bowl LVI. In April 2022, Project ACES, the developers of the Ace Combat series, announced the release of an aircraft collaboration DLC for Ace Combat 7: Skies Unknown with Top Gun: Maverick, released on May 26, one day before the film's release. A free expansion based on Top Gun Maverick was also released for Microsoft Flight Simulator on the same day, containing the F/A-18E/F Superhornet and fictional \"Darkstar\" planes as playable aircraft. An interactive website was also launched on the same month. On May 23, Cruise collaborated with The Late Late Show host James Corden for recreating a fighter sequence as a part of promotions.</p><p>A three-week promotional tour was conducted in Mexico City, Tokyo, Cannes, London, San Diego and Los Angeles. Event Cinemas announced Top Gun: Maverick Collector Combo, featuring a medium large salt-popcorn with refreshments in a collector cup, being marketed with stills featuring Cruise. Other marketing deals were arranged with Applebee's restaurant chains and Vudu.</p><br/><h3>Release</h3><h4>Theatrical</h4><p>Top Gun: Maverick was released theatrically by Paramount Pictures in the United States on May 27, 2022, with advance screenings starting the day before. It was originally scheduled to be released on July 12, 2019, but was delayed to June 26, 2020, in order to shoot several complex action sequences. By March 2020, Paramount moved the film up two days early on June 24, 2020, and it was then moved to December 23 due to the ongoing COVID-19 pandemic declared by the World Health Organization. On July 23, 2020, the film was delayed again to July 2, 2021, due in part to scheduling conflicts with Cruise, as well as the recent delays of Mulan and Tenet due to the rise of COVID-19 cases, and was further delayed to November 19, 2021, before finalizing the May 2022 release date.</p><p>The film had its world premiere at CinemaCon on April 28, 2022 which was followed by a global premiere hosted at the San Diego Civic Theatre in San Diego, on May 4, which was also streamed live through YouTube. It also screened at the Cannes Film Festival on May 18 in an Official Selection Screening, where it received a five-minute standing ovation from the audience. The Cannes premiere included a tribute to Cruise and his career. The following day it had its UK premiere at the Royal Film Performance at London's Odeon Luxe Leicester Square in aid of the Film & TV Charity. The film was the last Royal Film Performance of Queen Elizabeth II's reign as she died later that same year. ScreenX theaters and AMC Theatres held Early Access Event screenings at limited locations across the United States on May 24, 2022.</p><h4>Home media</h4><p>Apple TV+ attempted to purchase the distribution rights to Top Gun: Maverick, but Paramount declined to sell them. When asked at the film's CinemaCon premiere about Apple and other streaming companies attempting to purchase the distribution rights, Bruckheimer said that the film had always had a big-screen destination. At the film's premiere at Cannes, Cruise also denied that the film was going to streaming. Despite the model that most films debut on streaming 45 days after their theatrical releases, Paramount decided to keep Top Gun: Maverick in theaters for an extended run due to Cruise's insistence and the successive week-to-week box office results of the film. The film was released digitally in standard definition, high definition and UHD on August 23, 2022, followed by the Ultra HD Blu-ray, Blu-ray, and DVD releases on November 1, 2022, in the United States and October 31, 2022, in the United Kingdom. It includes the expanded aspect ratio of 1.90:1 in select sequences as seen in IMAX screenings, four featurettes on the making of the film, Cruise discussing his career at the 75th Cannes Film Festival and two music videos of the songs featured in the film.</p><p>Paramount+ and SkyShowtime (under the joint venture between both Paramount Global and Sky Group) made Top Gun: Maverick available to stream on December 22, 2022 as part of a customer's subscription to either service. In the United States, Top Gun: Maverick became the most-watched film to debut on Paramount+.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Top Gun: Maverick grossed $718.7 million in the United States and Canada, and $777 million in other territories, for a worldwide total of $1.496 billion. The film became the highest-grossing film of Cruise's career on June 17, 2022, after crossing $800 million worldwide. On June 26, the film crossed $1 billion, becoming the second film to do so during the pandemic era. It is the second-highest-grossing film released in 2022 (behind Avatar: The Way of Water). Sonny Bunch, writing for The Washington Post, argued that the film's financial success along with that of Spider-Man: No Way Home demonstrates that securing a theatrical release in China is not mandatory for a Hollywood film to be profitable. Deadline Hollywood calculated the film's net profit as $391.1 million, accounting for production budgets, marketing, talent participations, and other costs; box office grosses and home media revenues placed it second on their list of 2022's \"Most Valuable Blockbusters\".</p><p>In the United States and Canada, Top Gun: Maverick was the highest-grossing film released in 2022. It grossed $126.7 million in its opening three-day weekend and $160.5 million over the four-day Memorial Day weekend, finishing first at the box office and nearly doubling Cruise's previous career-best. The film also had the largest Memorial Day four-day opening weekend. In its second weekend, it grossed $90 million; the 29% drop was the smallest-ever for a film that had an opening of over $100 million, surpassing Shrek 2 (33% drop in its second weekend from a $108 million debut in May 2004). The film was dethroned by newcomer Jurassic World Dominion in its third weekend, though still grossed $51.9 million. The film remained in the top five at the box office throughout its first ten weeks of release. The film finally dropped out of the top five at the box office in its 11th weekend, finishing sixth with $7 million. In its 12th weekend the film was re-released in over 400 theaters and made $7.1 million, returning to second place. In its 15th weekend, the film made $6 million (and a total of $7.9 million over the four-day Labor Day frame), returning to the top of the box office. Box office analysts attributed the film's longevity at the box office to positive critical reviews and word of mouth.</p><p>Outside the US and Canada, the film grossed $124 million from 62 markets in its opening weekend. It was Cruise's biggest opening ever in 32 of those markets and Paramount's best opening for a live-action film in 18 of them. The largest markets in its opening weekend were the United Kingdom ($19.4 million), France ($11.7 million), Australia ($10.7 million), Japan ($9.7 million), and Germany ($6.5 million). The film had the best debut of Cruise's career in the Middle East ($6.3 million), Brazil ($5.3 million), the Netherlands ($2.4 million), Sweden ($2.2 million), Belgium ($1.7 million), New Zealand ($1.4 million), Poland ($1.2 million), Argentina ($1.2 million), Finland ($1.1 million), and Portugal ($770,000). IMAX accounted for $10.4 million of its opening weekend outside the US and Canada. The following weekend, it made $85.8 million, a mere 16% drop that included $18.5 million from IMAX screenings. As of September 18, 2022, the top markets are the United Kingdom ($102 million), Japan ($93.6 million), South Korea ($67.2 million), Australia ($64.3 million), and France ($58.2 million).</p><h4>Critical response</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section may <b>lend <span>undue weight</span> to certain ideas, incidents, or controversies</b>. The specific problem is: The section is rather lengthy (<span class=\"mw-redirect\">WP:PROPORTION</span>) and it's dubious if it's balanced. Less would likely be more.<span class=\"hide-when-compact\"> Please <span class=\"external text\">help improve it</span> by rewriting it in a <b><span>balanced fashion</span></b> that contextualizes different points of view.</span>  <span class=\"date-container\"><i>(<span class=\"date\">October 2022</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>On the review aggregator website Rotten Tomatoes, 96% of 469 critics' reviews are positive, with an average rating of 8.20/10. The website's consensus reads: \"Top Gun: Maverick pulls off a feat even trickier than a 4G inverted dive, delivering a long-belated sequel that surpasses its predecessor in wildly entertaining style.\" Metacritic, which uses a weighted average, assigned the film a score of 78 out of 100, based on 63 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film a rare \"A+\" grade on an A+ to F scale, while PostTrak reported 96% of audience members gave it a positive score, with 84% saying they would definitely recommend it.</p><p>Pete Hammond of Deadline Hollywood called the sequel better than the original movie. The New York Times-based critic A. O. Scott called it a \"thin, over-strenuous and sometimes very enjoyable movie\" and \"an earnest statement of the thesis that movies can and should be great.\" Peter Bradshaw wrote in The Guardian that \"Cruise presides over some surprising differences from his first outing as the navy pilot hotshot in a film that's missing the homoerotic tensions of the 80s original.\" Alonso Duralde of TheWrap wrote that the movie \"counts as a worthy sequel in that it succeeds and fails in many of the same ways as the original.\"</p><p>Entertainment.ie's Brian Lloyd's 4-star review said the film \"exceeds with flying colours\" and \"exists in a world that is all of its own making. There are golden sunsets, perfectly crisp white t-shirts, exquisitely coiffed hair, and long-held flames of romance that make it all impossible to resist.\" Clarrise Loughery, chief editor of The Independent, wrote that the film is \"as thrilling as blockbusters get. It's the kind of edge-of-your-seat, fist-pumping spectacular that can unite an entire room full of strangers sitting in the dark and leave them with a wistful tear in their eye.\" Richard Brody of The New Yorker wrote, \"The new film, less of a sequel than a renovation, infuses the 1986 drama of airborne combat with today's politics.\" Tomris Laffly of RogerEbert.com wrote, \"Equally worthy of that big screen is the emotional strokes of Maverick that pack an unexpected punch.\"</p><p>Tatsam Mukherjee of Firstpost wrote that the film reminded him of James Mangold's Ford v Ferrari (2019), ruminating on the classic predicament of whether man makes machine or the other way round. He added, \"At the forefront of this clash is a man named Tom Cruise, who wants nothing less than our jaws on the floor. Proving that no amount of multiverse films or superstar cameos will replace the blood, sweat and adrenaline of an actor legitimately trying to push the boundaries of filmmaking. We can be rest assured that if it's a Tom Cruise film, he will not let us down.\" Chris Bumbray of JoBlo.com called the film \"a thrill ride of the highest order\" and wrote, \"If you're a fan of the original, this will blow you away – but even if you don't love the 1986 classic (blasphemy), this has a lot to offer.\" Marshall Shaffer of Slant Magazine named the film's climatic battle sequence as one of the best movie scenes of 2022.</p><p>On August 3, 2022, filmmaker Quentin Tarantino called Top Gun: Maverick \"fantastic\", as the film, alongside Steven Spielberg's West Side Story, \"provided a true cinematic spectacle, the kind that I'd almost thought that I wasn't going to see anymore.\" As a long-time admirer of the original Top Gun director, the late Tony Scott, he added: \"There was just this lovely, lovely aspect because I love both Tony Scott's cinema so much, and I love Tony so much that that's as close as we're ever going to get to seeing one more Tony Scott movie ... The respect and the love of Tony was in every frame. It was almost in every decision. It was consciously right there, but in this really cool way that was really respectful.\" Ridley Scott, Tony's older brother and whom Cruise worked with in the 1985 film Legend, was given a private screening for Maverick. Bruckheimer stated, \"One of the most heartwarming things I experienced is when we showed the movie to Tony’s brother, Ridley. He was laudatory in his praise for the film and the kind of care that Tom took to honor Tony throughout the movie. That was foremost in everybody's mind.\"</p><h4>Role of the U.S. military</h4><p>The film was actively supported and influenced by the United States Department of Defense and the United States Navy to present the U.S. military in a positive light. The Navy's cooperation in the film was explained to be motivated by the goals of recruitment, retention, and showcasing military excellence. The U.S. Air Force also ran recruitment ads before the film's screenings. Further, the plot involves attacking an unidentified foreign country without declaring war or questioning the necessity. This led some critics, scholars and journalists to criticize the film as propaganda in varying measures. Some comments declared the film to be worse in this regard than its predecessor. Several sources published quid pro quo agreements outlining how the U.S. Department of Defense could influence Paramount in crafting the film, which was also described as \"mutual exploitation\".</p><h4>Accolades</h4><p>At the 95th Academy Awards, Top Gun: Maverick received nominations for Best Picture, Best Adapted Screenplay, Best Original Song, Best Film Editing, and Best Visual Effects; and won Best Sound. The film's other nominations include four British Academy Film Awards, six Critics' Choice Movie Awards (winning one), and two Golden Globe Awards. It received two National Board of Review Awards and was named one of the ten best films of 2022 by the American Film Institute.</p><br/><h3>Lawsuit</h3><p>In June 2022, the family of Israeli author Ehud Yonay, who wrote the California magazine article \"Top Guns\" in May 1983 that inspired the first film, sued Paramount for copyright infringement over the release of Top Gun: Maverick and sought damages as well as an injunction against the film's distribution. Jerry Bruckheimer produced the original film, whose screenplay was written by Jim Cash (died 2000) and Jack Epps Jr.; all three men participated in the sequel. According to the lawsuit, Paramount had obtained exclusive film rights to Yonay's article but ignored the 35-year copyright law, wherein the rights reverted to Yonay's widow Shosh and son Yuval in January 2020 after the writer's death in 2012.</p><p>The lawsuit claims that Maverick contains elements similar to the original article and that Paramount continued with the filming, even after receiving notice of the copyright's termination. The film distributor considers most of the sequel to have been complete before then and denies that Maverick is derived from Yonay's article.</p><br/><h3>Future</h3><p>In May 2022, Teller revealed that he had been pitching a sequel, which would be tentatively titled Top Gun: Rooster and centered around his character, to Paramount Pictures. By July of the same year, he stated that he has been having ongoing discussions with Cruise regarding a sequel.</p><br/>"
  },
  "errorMessage": ""
}