{
  "imDbId": "tt0097165",
  "title": "Dead Poets Society",
  "fullTitle": "Dead Poets Society (1989)",
  "type": "Movie",
  "year": "1989",
  "items": [
    {
      "username": "fjhuerta-2",
      "userUrl": "https://www.imdb.com/user/ur0508954",
      "reviewLink": "https://www.imdb.com/review/rw0268463",
      "warningSpoilers": false,
      "date": "22 August 2001",
      "rate": "10",
      "helpful": "1,014 out of 1,063 found this helpful.",
      "title": "A powerful antidote to conformism",
      "content": "There are certain films that get under your skin, never to come out. They change your life, subtly altering your perceptions of reality, almost always for the better.Dead Poets Society is one of those few films.I saw the movie back when I was in High School. I had a teacher who told us that we really needed to watch it; in fact, it was our \"homework\" for the day. We didn't need to bring back a report, or talk about it in class. All he asked from us was to watch it, make up our own mind about it, and that was it. As you can imagine, many friends of mine didn't watch it at all; I did. And yes, I feel I changed a bit from there on.Back when you are young, you never really stop to think what in the world you are doing with your life. You simply live for the day, hope your grades will be enough to pass, and that's it. Long term thinking involves maybe flirting with a girl. Nothing more. What this film showed me was that we have the responsability and the joy of being alive in this planet. That we are dust, and we will go back to it, so we have precious little time to make a difference. That we have a moral obligation to \"seize the day, and make our lives extraordinary\" (my favorite quote in all movie history). That the world, basically is ours. That the only limitations are within ourselves, and that we owe it to us to fight, to rebel against conformity, to change what we hate and keep what we love. That living in this world is a beautiful responsability, and that only cowards dare not to change it for the better.The fact that the cast was basically my age, and was passing through the same dilemmas and situations I was facing made it all so much more powerful.So here I sit, 12 years from that day. I still don't think I have seized the day completely. But I keep on trying; I always will. I wonder how many people were transformed by this gem of a movie; I hope many.10 out of 10. A definitive masterpiece."
    },
    {
      "username": "CMTiago",
      "userUrl": "https://www.imdb.com/user/ur44841124",
      "reviewLink": "https://www.imdb.com/review/rw3067775",
      "warningSpoilers": false,
      "date": "12 August 2014",
      "rate": "9",
      "helpful": "107 out of 115 found this helpful.",
      "title": "Thank You Captain",
      "content": "It was with a sad reason that I re watched Dead Poets Society, as we lose yet another talent and an all round good person in Robin Williams. This being my favorite Williams film, I took it upon myself to honor his memory by remembering his best body of work, in my opinion. Mr. Keating is the teacher that I wish I had, and granted this might be a mixed opinion within the film's context, but the matter of the fact is that he was no ordinary teacher, and that's something you don't see very often.The thing about this film is that it doesn't shorten its importance to Williams's performance. The supporting cast is one that balances the film like no other. Every one of those students that revived the DPS is, in one way or another, influenced by Mr. Keating, be that positively or, unfortunately, negatively. The story being an Oscar winning screenplay, is one that I think mostly resonates with younger people, and with this movie being part of my 10th grade Portuguese course, I, personally, embraced its essence and of course its driving message of seizing the day.As I've seen here on IMDb, this movie might not gather nearly uncontested praise, but it is very much highly regarded today as it was 25 years ago. The final scene still gives me chills to this day, and in the midst of our sad goodbye to Mr. Williams I just wanna say Thank You My Captain. It was a pleasure learning to become my own motivated person. May we all Carpe DiemRating: 9/10"
    },
    {
      "username": "fred-kolb",
      "userUrl": "https://www.imdb.com/user/ur14704372",
      "reviewLink": "https://www.imdb.com/review/rw1977086",
      "warningSpoilers": false,
      "date": "17 November 2008",
      "rate": "10",
      "helpful": "161 out of 173 found this helpful.",
      "title": "Seize the Day- One of the Greatest Movies Ever!",
      "content": "Dead Poets Scoiety. I suppose if you were in High School sometime between 1990-2008, one of your teachers thought I'd be a good idea to watch this movie and I still remember my reaction and the ones of our fellow classmates: Yeah, probably a boring movie that will try to make the school look better and encourage us to do our homework and study for our tests. I couldn't have been more wrong. This movie definitely changed my way of thinking to a certain extent and there are very few films who have moved and touched me like this one.The movie plays in 1959 and centers around a private academy somewhere in New England. The curriculum is extremely difficult and the teachers have no humor and are very strict. The new English teacher though, Mr John Keating (Robin Williams), who graduated from the very same school, uses unorthodox, but quite effective methods to teach the students about literature, and poetry. During their first lesson, he tells them that they can either call him Mr. Keating or \"Oh Captain, my Captain\", based on a quote by Walt Whitman. He encourages them to come out of themselves, use their energy to make their lives worth living and beautiful - Carpe Diem, Seize the Day! The plot also centers around two students: Neil (Robert Sean Leonard), who is funny and popular, but fails to gain his fathers pride, because of his wish to become an actor, and Todd (Ethan Hawke), who is very shy and unsure of himself, and is inspired by Keating to use his imagination and eventually we find out that he is very talented when it comes to poetry. After they find out about a club Keating was a member of while he was a student, the Dead Poets Society, which was forbidden by the school, they decide to reestablish it, what ultimately gets them into a lot of trouble.There are several key factors, that make this movie as brilliant as it is. First of all there is the acting. Robin Williams, who I really like as a Comedian, really proves that he is a great actor, who can get deep into a character and play him with such passion and energy that you will forget he's an actor. Keating, whose teaching methods are indeed unusual and will probably make you laugh a couple of times, is a very interesting role, the teacher we all would have wanted, but not because he doesn't give homework or makes up very easy, open-book tests. No, because Keating shows us that we have to come out of ourselves, make the best of our lives and especially that there is a poet in everyone of us. Then there is the terribly under-appreciated Robert Sean Leonard, who also gives a very moving performance as a student, who is kept back by his father, and therefore fails to make his dreams come true. In my opinion he is very underused as an actor, and should have gotten a lot more leading roles. As for Ethan Hawke, he definitely was the best choice for the character he plays. We can literally feel his fear and shyness when he stands in front of the class and gets no word out, because he's so embarrassed.Peter Weir, who is probably most known for his recent movie \"Master and Commander\" shows what a great director he is with this film and it definitely deserved the Oscar for Best Original Screenplay, and the nominations for Best Picture, Director and Leading Actor for Robin Williams.Some of you may have heard about Roger Ebert absolutely negative review of this movie and that \"he wanted to throw up at the end of the film\". I can understand why people might not like the ending (I won't put any spoilers), but I think it just adds to the the beauty and drama of this film, a film that should definitely be on the IMDb Top 250 Movies. This is a movie, you must have seen!!"
    },
    {
      "username": "roghache",
      "userUrl": "https://www.imdb.com/user/ur9414155",
      "reviewLink": "https://www.imdb.com/review/rw1305272",
      "warningSpoilers": false,
      "date": "3 March 2006",
      "rate": "10",
      "helpful": "177 out of 210 found this helpful.",
      "title": "A masterful tribute to teaching at its best",
      "content": "Dead Poets Society is, to use a cliché, a cinematic masterpiece. I can watch it over and over, absorbing more nuances of meaning every time. As a former teacher myself (albeit of science), I view it as a tribute to the profession at its best...teaching not merely the subject but also the person, and having a lifelong impact on students' lives.The setting is Weldon Academy, a very traditional New England boys' prep school in 1959. If I can find one flaw with the movie...and there certainly aren't many...it's the underlying premise that seems to worship free thought and implies that ALL tradition is of necessity undesirable and thus to be avoided. Frankly, compared to modern classrooms which are bastions of free expression, I found the Weldon students' respectful treatment of their teachers rather refreshing. (But perhaps that's just the ex-teacher in me coming out!) Some of Weldon's ideals, generally referred to in mocking tones, are actually qualities to which parents rightfully DO hope their offspring will aspire.Robin Williams plays Mr. Keating, the English teacher we all wish we'd had. He brings warmth, passion, and an endearing quiet humor to the role as he fosters individualism in a school environment of total conformity, endeavoring to teach these young men both the beauty of the English language and the importance of living life to the full, of \"seizing the day\". How many of us mentally revolted at the dissection of poetry when we were in school? Many a viewer will both chortle and rejoice when Mr. Keating has his class rip out the methodical, emotionless \"Introduction to Poetry\" from the time honored Pritchard textbook! The \"Dead Poets Society\", and the boys on which Mr. Keating has such a profound impact, include an interesting mix of characters...Neil Perry (the passionate young man at odds with his father's clearly defined expectations for his son's life), Todd Anderson (the classic shy adolescent, through whose eyes we view the unfolding drama), Charlie Dalton (the quintessential rebel), Knox Overstreet (the teen with whom most viewers can identify, deep in the throes of first love), and Richard Cameron (the mindless conformist).Ethan Hawke gives a moving performance as Todd, the younger brother of a former Weldon valedictorian and my personal favorite, who undergoes a character transformation as the plot unfolds. In a sense, this movie is really Todd's story. As another reviewer has wisely pointed out, his best scenes are sometimes when he has no dialogue at all. Your heart will ache for him. The sub-plot of young Overstreet's romance with a girl from a nearby school may not be brilliant, but it provides some light, entertaining relief from the main drama. Needless to say, Mr. Keating's unorthodox approach meets with obstacles...from his fellow teachers, from the school's ultra traditional Headmaster, from Neil's overbearing father and the other parents, who are depicted as a conservative, status conscious lot. His encouragement of adolescent individualism leads to dramatic consequences for one student in particular, triggering a dramatic scenario that engulfs most of his classmates. I don't want to give the plot away, but Dead Poets Society has the most powerful ending I've experienced in the cinematic world. I could watch it over and over, and tears would either come to my eyes or virtually stream down my cheeks every time.It's an intelligent film, both gripping to watch and thought provoking afterward. Engaging plot, memorable characters, meaningful theme, wonderfully done scenes and atmosphere...Dead Poets Society has it all. A special tip of my hat to the cinematography; clearly, it should have won an Oscar for the final scene alone.This is a must-see movie, especially if you're a high school student who hates English. It might just change your view of the subject, even if your actual teacher doesn't quite measure up to Mr. Keating. And for everyone...not only \"Carpe Diem\", but a certain phrase from a Walt Whitman poem will take on incredible meaning and be remembered forever."
    },
    {
      "username": "Sethtro",
      "userUrl": "https://www.imdb.com/user/ur74360795",
      "reviewLink": "https://www.imdb.com/review/rw5830868",
      "warningSpoilers": false,
      "date": "17 June 2020",
      "rate": "9",
      "helpful": "68 out of 74 found this helpful.",
      "title": "The 9/10 movie I'll never watch again.",
      "content": "Personal Rating: 9/10This movie shattered me. There's the expression that something \"tugs at your heartstrings,\" well this movie ripped mine out.I'll be honest, I could find things to critique about this film, the instance of a scene that was used twice and felt sloppy perhaps; but this movie never claimed to be perfect, just to be emotionally moving, and that it certainly is. This review is written by a boy who also finds himself on the edge of adolescence and adulthood, does that mean I'm biased, absolutely, but everyone who watches this film is, everyone can relate. Your feelings I can assure you will be the same as mine when the credits start rolling, rolling like the tears down your cheeks.This movie makes you think. Conformity is easy, conformity is comfortable, conformity gets you good grades, trust me you're listening right now to a past perfect GPA teacher's pet. The thing conformity doesn't give you though, is a life, one worth living. For something to be beautiful it must also have a side of danger, and that's what freedom of thought is, as is mentioned in the movie \"we must constantly look at things in a different way,\" and that's beautiful! Yes, it means at times we don't agree, yes it means you might give this movie a 4/10 but I'll be damned if that changes my opinion of it.The themes this movie explores such as, never letting a moment slip by where you don't think for yourself, where you don't seize an opportunity, it does so beautifully. Robin Williams was not acting he was believing, everything in this movie comes across as genuine, a slice of reality, a harsh but beautiful one at that.Will I watch this movie again, I don't think so. But please, please watch it just once, you won't ever regret it.Carpe Diem."
    },
    {
      "username": "ijtfalcon",
      "userUrl": "https://www.imdb.com/user/ur1015714",
      "reviewLink": "https://www.imdb.com/review/rw0268611",
      "warningSpoilers": true,
      "date": "20 January 2003",
      "rate": "10",
      "helpful": "150 out of 174 found this helpful.",
      "title": "Excellent",
      "content": "I have no need to summarize this movie seeing as how most people tend to do that anyway so, therefore, any addition of such would simply be frivilous. However, I am somewhat disappointed to see how people tend to misinterprate this film by proclaiming that the movie's message of carpe deium is derailed by the fact that those who apply it end up losing. This could not be further from the truth. In the beginning, when the young men are first introduced to this idea of sucking the marrow out of life it is applied by the students when its results prove to be fun and joyous. The point really driven home by the movie though is to stand up for one's beliefs throughout all of life no matter how hard it may prove. Now, while the character of Neil, does try to do what he feels he must without regard to his father, in the end, he doesn't stand up at all, but simply accepts his father's authority. Some may not like it but his story serves to prove just how important it is to stand one's ground no matter how hard it may be. It's not only his character, but in fact every character in the film that does not fully understand Mr. Keating's message until the very end by finally doing what they feel is right now matter how much the opposing forces deny this basic truth. I urge everyone to give this movie a chance and to see it for what it really is. It may just change your life."
    },
    {
      "username": "ssssgelojun",
      "userUrl": "https://www.imdb.com/user/ur114692853",
      "reviewLink": "https://www.imdb.com/review/rw5786161",
      "warningSpoilers": true,
      "date": "30 May 2020",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "dead poets society",
      "content": "At the end of the movie, Neil's dream of pursuing drama is hopeless and his life is hopeless. In the white night, Neil chose to die brilliantly.Neil's parents went to the school to press charges. The university blamed Keating entirely and put pressure on students to sign documents proving that Keating had \"misled students\" and \"abused teacher influence\" . Eventually, Keating got kicked out of the school.Before he left, Keating went back to the classroom to get something. He was replaced by President Nolan, who had expelled him.At the last moment before Keating leaves the classroom, Todd, who has always been shy and timid, stands up from his seat, blushes, jumps onto the desk and intones:O Captain! My Captain! Oh, captain! My captain!President Nolan angrily warned \"Sit down!\"Overstreet also stood at the desk.O Captain! My Captain!Pitts stood at the desk. Meeks stands at the desk. One by one, one by one.Let the headmaster shout \"How dare you! \"Out of this school! \"Sit Down!\"One by one, one by one.Standing one by one, it is clear that a bottle of torch, flourish.Keating tears, these once hesitated confused face, now are showing perseverance, courage, fearlessness. Burst out the light of life.Keating whispered \"thank you.\"May you shine forever. Do not extinguish, do not dim, always holding the torch, efforts to shine, efforts to do the rain in the sun."
    },
    {
      "username": "pompaj",
      "userUrl": "https://www.imdb.com/user/ur0747060",
      "reviewLink": "https://www.imdb.com/review/rw0268560",
      "warningSpoilers": false,
      "date": "17 July 2000",
      "rate": "",
      "helpful": "110 out of 140 found this helpful.",
      "title": "A terrific film",
      "content": "There's so much good about this movie. The first time I saw it I watched it solely for plot and I loved it. Now I've seen it again and watched Peter Weir's filming and timing which is also great. Robin Williams is a terrific actor when he's serious. He proved it in Good Will Hunting but he proved it first here. If you liked that movie and your liking it had something to do with Williams than you will like this one. The plot is about a number of students who are taught by Williams about life. They are taught how to enjoy themselves. This ends up causing great controversy among the heads of the school. The students are terrific and even the dialogue is great. This is a movie that I can't imagine anyone not liking. It is good in every way."
    },
    {
      "username": "blissfulmitch",
      "userUrl": "https://www.imdb.com/user/ur3651639",
      "reviewLink": "https://www.imdb.com/review/rw1013669",
      "warningSpoilers": false,
      "date": "4 February 2005",
      "rate": "10",
      "helpful": "353 out of 393 found this helpful.",
      "title": "Carpe Diem, because the days don't stand still",
      "content": "First of all, this is movie is my all-time favorite, out of all the hundreds of films I have seen. However, every time I mention this film, I have to answer most people's quizzical looks with \"It's a beautiful little 80s film that stayed in the 80s.\" After seeing it for the 24th time since I first saw it 5 years ago, on my 13th birthday, I can gladly say that this movie went far and beyond the 80s, and the power and inspiration of the message can be felt every day.Dead Poets Society is a most underrated film by a most underrated director whose inspiring, uplifting and moral tales firmly grounded in reality are not nearly as appreciated as they should be. Here, we see one of his very personal and cradled projects, and he shows the visual style and concentration on characters in which he is so affluent. His control of the camera and the characters are very strong and very smooth. The cinematography is near perfect, with every shot, along with the editing, seamless. Also very compelling are the color-tones in every scene, perfectly matching the mood and events of the scene. Could you say this is art? Absolutely.Then we have the performances. Robin Williams continues in stride as one who has to-date remained the most touching, heart-wrenching, awe-inspiring comedians with inarguable acting talent (he still remains my most favorite performer on the film screen). His Professor John Keating is a man who embodies every professor who you thought was cool and respectable, every person who taught or enlightened you in something out of the ordinary. In fact - dare I say it? - he teaches something EXTRAORDINARY! We have the tragically underrated Robert Sean Leonard in his role as the free-thinking catalyst student Neil. Why is this man not a household name/Hollywood heavyweight? His roles are always full of inspiration, energy, and tragic emotion that never fail to move an audience. His role in this movie is fresh, unhindered, and never pretentious as the cautionary tale of the movie. And then we have Ethan Hawke in one of his earliest roles as the point-of-view character. The entire supporting cast is very strong, also, providing the foundation and serve as the various emotional ties that further involve us in the story. Josh Charles's role as Knox Overstreet is a role that almost all guys can relate to wholeheartedly. And of course, all the actors who are in that Dead Poets Society do a fine job.And lastly, the story. I won't summarize it since it's been summarized many times here, but I will say that it is one of the best coming of age stories for not only adolescents, but anyone. I have personally heard from nine-to-fivers who were inspired by this movie to change the situations of their jobs, careers, relationships for the better. I first saw this movie when I was 13, and immediately stamped, crowned and elevated this movie as my all-time favorite. Now that I am 18 and living on my own, with very different concerns than back then, I turn back to this movie over and over again, to find inspiration, solace and of course, entertainment. It is still my all-time favorite, and it still inspires me to seize the day and make my life extraordinary."
    },
    {
      "username": "connie-baldini-427-561037",
      "userUrl": "https://www.imdb.com/user/ur35148446",
      "reviewLink": "https://www.imdb.com/review/rw3067567",
      "warningSpoilers": false,
      "date": "12 August 2014",
      "rate": "10",
      "helpful": "51 out of 57 found this helpful.",
      "title": "Make Your Lives Extraordinary",
      "content": "So today is August 12th and news has broken of Robin Williams' untimely death. I just felt compelled to review my favourite movie of his. On a rainy day back in 1980- something, my mother sat my brother, sister and me down and put on the movie, Dead Poets Society. Little did I know what a profound impact that movie, and its characters would have on me. The film is bursting with quotable material, and my siblings and I quote it to this day: O Captain My Captain, Carpe Diem, Seize the Day, and of course, Make Your Lives Extraordinary. It's not until we grow older that we can look back on a teacher like John Keating and see what he really meant to us, the chances he made us take, the way he made us feel alive. I look back now on Robin Williams' performance and see one of the most flawless performances of all time. When you watch the movie, it's hard to think of hammy, manic Robin Williams giving such a nuanced and subtle performance. It's almost as though Sean Maguire in Good Will Hunting is who John Keating became. And funny how his most subtle performances may be the ones he's most remembered for. When I heard the news of Robin's death, I was taken back to this film and really felt how integral this movie actually was to my childhood. I think it was the first time my 10 year old self was truly \"moved\" in the way that adults can be moved by art. All I can say is watch this movie. You won't be sorry."
    },
    {
      "username": "anthonydapiii",
      "userUrl": "https://www.imdb.com/user/ur117424303",
      "reviewLink": "https://www.imdb.com/review/rw5722021",
      "warningSpoilers": false,
      "date": "9 May 2020",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Deserving 10/10",
      "content": "A rare 10/10 and it's deserving of such. This movie had a profound impact on me....and no better person to play it then the great Robin Williams.He acted with such emotion and intensity and vigour in each scene. It is RARE to feel like I'm inside the film, but in this case I felt like Robin Williams was constantly talking to me in this film.Alongside him, the rest of the cast did a great job.This movie was more than just acting. It represented how a person should live and enjoy life. Thank you for such a gem."
    },
    {
      "username": "imseeg",
      "userUrl": "https://www.imdb.com/user/ur84924605",
      "reviewLink": "https://www.imdb.com/review/rw5834244",
      "warningSpoilers": false,
      "date": "18 June 2020",
      "rate": "9",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Still stands strong after 30 years. Classic drama with touching acting performances and warmhearted direction by Peter Weir.",
      "content": "A wonderfully, touching uplifting portrait of teenagers coming of age, learning how to think for themselves and experiencing how to live LIFE to the FULLEST, inspired by an unconventional, loving English teacher played brilliantly by Robin Williams, which is one of his best roles of his entire career.Dramas dont come any better than this one. BUT it isnt a drama for the first hour, because it starts out as an uplifting, vivacious portrait of teenagers at a strict boarding school, where everybody is suffocated by RULES and more rules, UNTIL that special day teacher Robin Williams starts teaching.This movie can be seen by young and old, but I guess especially young people would really be impressed by it, because this movie, like no other, depicts with suffocating reality, the pressures kids can be burdened with when they have to OBEY their parents' will and wishes and when their own creativity and passions are stifled with ruthless restrictions and punishments by their parents and their \"teachers\"...Right now I still have goosebumps merely thinking about this movie. It's so profoundly, impressive and touching and uplifting. One of the best dramas ever! Yes, EVER!"
    },
    {
      "username": "liamkellybusiness",
      "userUrl": "https://www.imdb.com/user/ur96932036",
      "reviewLink": "https://www.imdb.com/review/rw5832311",
      "warningSpoilers": false,
      "date": "17 June 2020",
      "rate": "9",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Anti-conformity at its most inspiring.",
      "content": "Do not go where society tells you to. Find the things you love and pursue them with every fibre of your being until the day you die. That's the message I took from Dead Poets Society. Weird, inspiring and heartbreaking, DPS is a one of a kind film and one of the reasons Robin Williams is so renowned worldwide as not just a comedian, but a remarkable actor as well. After watching this movie you'll want to change the world. Amazing!"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw3760724",
      "warningSpoilers": false,
      "date": "22 July 2017",
      "rate": "9",
      "helpful": "20 out of 30 found this helpful.",
      "title": "Always question authority",
      "content": "The conformist 50s get a look in Dead Poet's Society. Seen through the eyes of several prep school kids it's only that several of them really grasp what Robin Williams is trying to teach them that we see hope for the future.Williams is one of those rare teachers whose unorthodox methods make him stand out. There will always two or three for me in every level of learning that I had who stuck with me. The kids at Welton Prep actually enjoy his poetry class, they even found a little private club the Dead Poet's Society and will quote Byron, Browning, and the Bard back and forth to each other.The difference between Williams and someone like Norman Lloyd the headmaster at Welton Prep is that Lloyd sees himself as training the future membership of the establishment and he's giving them the lessons they need to get by, Williams says that his function to tell the youth to question authority. Always ask why this is so. Progress is only made by those who ask questions.The film is mainly the story of two students in his class Robert Sean Leonard and Ethan Hawke. Leonard is a shy kid and Hawke is a popular one. But Hawke is not from a wealthy family. His father Kurtwood Smith has made many sacrifices to get him into that prep school. Hawke wants to be an actor and Williams says follow your dream. Their clash sets in motion the dramatic events of the climax.Dead Poet's Society won an Oscar for Best Original Screenplay and was nominated for Best Picture, Best Director as well. Williams got a nomination for Best Actor. Dead Poet's Society maybe set in the 50s, but it expresses a universal theme about always question the status quo until you get a satisfying answer.Progress never happens any other way."
    },
    {
      "username": "chic1224",
      "userUrl": "https://www.imdb.com/user/ur0644784",
      "reviewLink": "https://www.imdb.com/review/rw0268548",
      "warningSpoilers": false,
      "date": "28 March 2000",
      "rate": "10",
      "helpful": "209 out of 258 found this helpful.",
      "title": "Poetry on the screen",
      "content": "Not only will this movie touch your heart and bring tears, it will inspire you to be a better teacher to others and to follow your dreams no matter what the boundaries may be. It is truly poetry on the screen... a great story and a touching social commentary on humanity and life's greatest challenges. If you haven't seen it yet, rent it now. It has taken my love of poetry to an entirely new level!"
    },
    {
      "username": "natalia1818",
      "userUrl": "https://www.imdb.com/user/ur1505926",
      "reviewLink": "https://www.imdb.com/review/rw0989058",
      "warningSpoilers": false,
      "date": "31 December 2004",
      "rate": "10",
      "helpful": "150 out of 202 found this helpful.",
      "title": "Pure excellence...",
      "content": "I watched this movie today for about 15-th time. I'm never bored with it. A few hours ago I felt lonely and depressed.I decided to watch it without the scenes that evoke sadness.And even though I watched it so many times before I found it restorative and heart lifting. There are many good films.Also there are probably many better than this one;cause it's not flawless. But if you believe that a movie can change your life, I have no doubts that this one can influence you as no other. If you have not watched it yet, WHAT ARE YOU WAITING FOR? Go to the video rentals and buy it.Yes, don't rent it but buy it.It's a movie that you will watch many times.Perhaps it will even save you..As it had saved me.."
    },
    {
      "username": "BluebirdSeventeen",
      "userUrl": "https://www.imdb.com/user/ur50819177",
      "reviewLink": "https://www.imdb.com/review/rw3074494",
      "warningSpoilers": true,
      "date": "24 August 2014",
      "rate": "9",
      "helpful": "35 out of 40 found this helpful.",
      "title": "Includes a short inspired poem. Your verse.",
      "content": "Swim against the stream What this film did for me? I found myself 'standing up on that desk' to remind myself that I should be constantly viewing the world with new perspective. A magical film, and despite it being made in 1989, still completely and maybe even more relevant to today's society. In a world of mass conformity, largely created by social media and smart phone technology, especially among the young and teenagers, it is ever more important to be inspired by and pursue what this film teaches us. We need to find our own voice among the crowd. Make your life extraordinary. It renews, inspires and restores a feeling of passion for words, poems, literature and life! Passion for learning and excelling / expressing ourselves. Keeping your eyes open, looking backwards and forwards, never down. Life is not 1 dimensional. Life is about expression; expressing those many layers and dimensions which make up the fabric of life. This film completely encompasses that sentiment. Striving to find your own voice. Finding words and meanings to best depict the inner workings of your life and mind. \"We read and write poetry because we are members of the human race. And the human race is filled with passion. And medicine, law, business, engineering, these are noble pursuits and necessary to sustain life. But poetry, beauty, romance, love, these are what we stay alive for.\"You can learn a lot from this movie. In society/ schools nowadays we are constantly being bombarded - told how to do things, why, and what they mean. we are filling up our brains with junk yet we have a world of knowledge, quite literally, right at our fingertips. Yet have we lost a sense of curiosity? Have we stopped asking why?My favourite scene was the one in the dormitory room, when the boys are playing, jumping across beds and desks, chasing each other round the room, round and round in circles. I think the directing and camera work is fantastic here, with the camera positioned in the middle of the room shooting upwards and following the boys in a rather dizzying way - it completely encompasses the ultimate freedom and spirit of the film. Powerful directing. Magical visuals- autumnal lake scenes and old New England buildings. Dead poets society made me both laugh and cry a lot. Almost a therapeutically good movie. It will stay with me for a long time to come. Robin Williams was wonderful too. RIP.10 out of 10 and I want to watch it again already. Remember you are here - that life exists, and identity; that the powerful play goes on and you may contribute a verse. That the powerful play *goes on* and you may contribute a verse. What will your verse be?Oh, one extra thing. Here is my inspired 5 min poem:Your verse? Quick fast tick tock, Skim swipe tick tock, Glowing face tick tock, Head down tick tock, Marching stomp tick tock.Each day tick tock Faced with a question tick tock, Your verse tick tock, Two roads tick tock, Diverging Follow your path tick tock, Open your eyes tick tock, Face the world tick tock, Seize the day tick tock, ListenOne day tick tock, Lie with the daffodils. Food for the worms. Forever, Tick. Tock. Thank you for reading my short verse. Post a reply in the message boards if you too felt inspired. (Oh also I'm not claiming to be Tennyson here....just an enjoyable way to spend a Sunday morning reflecting on this wonderful film I watched last night. Think of those boys at the front of the class before you choose tear it apart! :-) )"
    },
    {
      "username": "BlueRoseNya",
      "userUrl": "https://www.imdb.com/user/ur27689757",
      "reviewLink": "https://www.imdb.com/review/rw3086746",
      "warningSpoilers": false,
      "date": "15 September 2014",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Words and ideas can change the world",
      "content": "Dead Poets Society was one of my favourite movies when I was about 12 years old. It was a long time ago since I'd last seen it and I kinda expected it to have lost something over the years. Not true at all. The story's message still very much applies today and always will: make something of your life, enjoy it as much as you can.When you watch this beautifully acted, directed and well shot film, you can't help but be genuinely be seized by emotion. Several scenes are stunning, yet it never gets sentimental and stays sincere throughout the whole film.Because he was such a fantastic emotional actor, Robin Williams was the perfect choice to play John Keating, an original English teacher who wants his students to think for themselves, not only about poetry but also about life itself. If there'd be a John Keating in every school, the world might just become a little more interesting. Definitely a must-see classic."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2280574",
      "warningSpoilers": true,
      "date": "17 July 2010",
      "rate": "",
      "helpful": "30 out of 51 found this helpful.",
      "title": "Walt Whitman Weeps",
      "content": "\"Whenever you find yourself on the side of the majority, it's time to pause and reflect.\" - Mark Twain The \"teaching genre\". Typically these films deify heroic teachers whose classrooms are havens at odds with the conformity or mediocrity that plagues the rest of the institution. In this regard, these films merely take familiar stories about admirable loners and nonconformists and place them in an educational setting in which the school milieu is fairly incidental.Films like \"Stand and Deliver\", \"Dead Poets Society\", \"Mr Holland's Opus\", \"To Sir, with Love\", \"Dangerous Minds\", \"Coach Carter\", \"Mona Lisa Smile\", \"Music of the Heart\", \"Blackboard Jungle\", \"School of Rock\", \"Little Man Tate\", \"Dangerous Minds\", \"Freedom Writers\", \"Pay It Forward\" etc etc all follow the same narrative progression, the inspirational white/black teacher moving to a school where he/she is forced to deal with various problems (racial tensions, student apathy, learning difficulties and institutional barriers), all of which he/she solves by delivering inspirational messages in offbeat ways.Very few \"teaching films\" deviate from this formula. Some of the best that do are perhaps Frederick Wiseman's \"High School\", \"High School 2\" and \"State Legislature\", Laurent Cantet's \"The Class\", Nick Ray's \"Bigger Than Life\", Olivier's \"Term of Trial\", 2002's \"To Be and To Have\", and \"The Prime of Mrs Jean Brodie\", with Maggie Smith. For the most part, though, cinema has failed to produce many interesting \"teaching movies\".And so \"Dead Poets\" is another mushy \"teacher flick\" which advocates \"independence\" and \"non conformity\" by sticking to a very generic and clichéd movie formula. Here, the maverick teacher is played by Robin Williams, a wacky guy who inspires his band of students to \"seize the day\" and \"chase their dreams\".The film was directed by Peter Weir, and so it has a certain classiness which, at first glance, seems to differentiate it from the pack; it's low-key at times, well acted and beautifully shot. It's only during \"Poet's\" last half hour that we realise how much we've been conned. And so as Weir's plot draws toward a typical \"I am Spartacus!\" ending (you'll know it when you see it), we begin to grasp how goofy the picture really is, the film populated by one dimensional adults, villainous kids, ridiculously stuck-up parents and a plot which reduces the art of poetry to a couple selectively chosen one liners, all designed to illicit \"rebelliousness\" and \"non conformity\".So serious is the film in its message, that it even has one kid commit suicide because he is unable to break free of his father's wishes. In other words, conformity literally kills, physically as well as spiritually. This is a worthwhile message, but the film is so conventionally manipulative in its final half, that all power quickly fizzles out.For a film which pretends to profess a love for poetry, you might even call this flick anti-poetry. Early in the film, Robin Williams draws a graph on a blackboard which he says is used to \"measure the worth of a poem\". On one axis of the graph is a poem's \"importance\" or \"depth\", on the other axis of the graph its \"perfection\" or \"technique\", the implication being that a work of art which succeeds on both axes, or very highly on one, is discernibly \"better\" than others. Williams then erases this graph and orders his pupils to tear it out of their textbooks. You cannot measure the objective worth of art, he says, only what that art means to you personally.Later, one kid who spends hours and hours toiling over his poems, discarding them all because he doesn't think them any good, is put in front of the classroom and told to \"let go\" and \"just say what comes into your head\". Suddenly he becomes like all the other students in the film, able to magically and whimsically create great poetry. What the film is advocating is not some kind of objectively great poetry, which artists strive for and toil to create, but misusing poetry as a metaphor for a kind of whimsical freedom of expression; nothing matters other than your own subjective feelings and opinions. Nothing matters, other than you conforming to your desires, embracing your right to free speech and impulsively doing and saying what you want at any particular moment. This isn't poetry, this isn't artistic expression, it's just a kind of self-obsessed, narcissistic, rash impulsiveness.Now look at all the things the students in the film use poetry to achieve. It's all sex, girls, dancing or throwing things away. Very simple, egotistical, hedonistic or impulsive things. Children and people with bipolar disorder have been shown to act with more impulsivity than other people. Artists, of course, are themselves often described as being childish (or possessing a child's imagination) and are more prone to being bipolar. What the film is unconsciously doing is tapping into the whole \"artist as free\" and \"art as childish impulsiveness\" cliché, without marrying it to anything truly substantial.The limits of this approach are best observed in the film's final scenes. The young artists are given the chance to save their teacher, but instead choose to save themselves. They've never been taught, through poetry or art, to really stand up for anything of value external to themselves. Only later, when their teacher is kicked out of school, do they impulsively stand on their desks and show him support. But of course now it's a wasted gesture.Significantly, the one kid who \"stands up\" in defence of his teacher is the one kid who was serious about poetry and seemed sceptical of William's character. His act of \"standing up\" is the only true act of rebellion in the film, the artist putting himself on the line, standing up for something worthwhile. Weir completely misses the implications of this. 7.9/10 Generic. Worth one viewing. See \"If\" and \"The Magdalene Sisters\"."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6136736",
      "warningSpoilers": false,
      "date": "30 September 2020",
      "rate": "9",
      "helpful": "12 out of 18 found this helpful.",
      "title": "We are Scarred by the Circumstance...",
      "content": "... in which we are born and moulded without recourse or consultation - as we get older, others may influence and change our direction, sow new seeds, broaden horizons, gouge new scars. We may even become better for it but occasionally we may not and more often than not, we won't even know how we got there.There's little to like about a wealthy boys only establishment, without ethnic or demographic diversity, run by white middle aged and older men, chained to their dogma and traditions. If, however, you can take hold of the universal message Robin Williams so elegantly and poetically espouses, then maybe, if you're fortunate enough to be washed onto the shore of a similarly inspirational mentor, tutor, teacher or friend, no matter where you are on your journey, just maybe, just maybe, they'll raise enough of a breeze to change your direction. If that new direction takes you away from the rocky coastline of cavernous dogma, and continues to do so for the rest of your days, then the world, your world, will be a far better place for it, regardless of your demography, ethnicity, history or where on the planet your journey begins or continues. Start raising your sails today, sail today."
    },
    {
      "username": "slightlymad22",
      "userUrl": "https://www.imdb.com/user/ur4465293",
      "reviewLink": "https://www.imdb.com/review/rw3163508",
      "warningSpoilers": false,
      "date": "16 January 2015",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Oh Captain, My Captain. It Is One Of Robin Williams Best",
      "content": "After recently watching \"Mrs Doubtfire\" And then \"Old Dogs\" a movie from the latter part of the late Robin Williams's career. I decided to revisit some of his earlier dramatic work. And one phrase came tonight \"Oh Captain, my Captain\". so I immediately settled on 1988's \"Dead Poets Society\".I also forgot about this brilliant quote. \"Carpe diem. Seize the day, boys. Make your lives extraordinary\" I don't know if it was the tagline for the movie, but it certainly should have been.Plot In A Paragraph: Todd Anderson (Ethan Hawke) has been sent to the school where his popular older brother was valedictorian. His room-mate, Neil Parry (Robert Sean Leonard), although very bright and popular, is under the thumb of his controlling father (Kurtwood Smith) The two, along with their other friends, meet Professor Keating (A brilliant Robin Williams in one of his serious moods) their new English teacher, who tells them of the Dead Poets Society, and encourages them to seize the day, and make their lives extraordinary.For an actor well known for his comedic roles, Robin Williams is in fact, a very effective dramatic actor. Kurtwood Smith is his usual reliable self as Mr Perry, the dominating father, and all of the \"boys\" do well in their roles. Ethan Hawke is especially good, likewise Josh Charles, Robert Sean Leonard and Gale Henson.Some may find it boring, and it is slow in parts, but Williams's performance more than papers over the few cracks. Touching, Tragic and humorous in places. The final \"Oh Captain, my Captain\" is spine tinglingly good!! And if be lying if I didn't say I welled up a bit. It really is a very good movie. One that deserves to be seen."
    },
    {
      "username": "ackstasis",
      "userUrl": "https://www.imdb.com/user/ur10334028",
      "reviewLink": "https://www.imdb.com/review/rw1790365",
      "warningSpoilers": false,
      "date": "30 December 2007",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "\"Sucking all the marrow out of life doesn't mean choking on the bone.\"",
      "content": "Australian director Peter Weir's third picture in Hollywood, 'Dead Poets Society (1989),' doesn't really explore any territory that has not been covered before. For most of the film, we can pretty much predict exactly where Tom Schulman's screenplay is heading, and so there are few surprises to set it apart from other movies of its kind. However, despite his film's hint of unoriginality, Weir hardly puts a foot wrong, and 'Dead Poets Society' proves a thoughtful, funny, haunting and inspirational drama that'll certainly stay with you once you've seen it. Accompanying a cast of bright, young actors {some of whom you'll recognise from their later successes, including Ethan Hawke and Robert Sean Leonard} is comedy veteran Robin Williams, whose warmth and passion forms the emotional core of the story.The prestigious Welton Academy prep school (\"Tradition, Honor, Discipline and Excellence\"), as they're four-pillar motto suggests, has a long-standing history of success and high reputation. The young male students of the college are expected, at all times, to respect rules and authority, and to continually strive for greater and greater academic achievements. Into the school comes former student, now English teacher, John Keating (Williams), whose unorthodox approach to lessons, and vigorous passion towards literature and poetry, inspires many of his impressionable young students, and severely ruffles the feathers of Welton Academy's management. Keating's rousing motto of \"carpe diem\" (a Latin phrase meaning \"pluck/seize the day,\" borrowed from Horace's \"Odes 1.11\") inspires the young boys to make the most of every opportunity, and to look within themselves to discover the correct path for their lives.The film proved quite successful at the 1990 Academy Awards, acquiring an Oscar for Best Original Screenplay, and nominations for Best Actor (Robin Williams), Best Director (Weir's second nomination in that category) and Best Picture. Perhaps because of the preparatory school setting and the cast of young actors, 'Dead Poets Society' seems as though it would be most effective with young teenage boys, who will relish the film's opposition towards conformity and strict authority. Nevertheless, the film also boasts a more important moral from which we can all take something: always seize the opportunities that are presented to you, and make every day of your life count."
    },
    {
      "username": "kbmoshea",
      "userUrl": "https://www.imdb.com/user/ur0558890",
      "reviewLink": "https://www.imdb.com/review/rw0268453",
      "warningSpoilers": false,
      "date": "17 June 2001",
      "rate": "10",
      "helpful": "104 out of 141 found this helpful.",
      "title": "extraordinary",
      "content": "Dead Poets Society is a thoroughly moving, and inspiring film from Peter Weir, who is definitely one of the most under rated directors around. This movie is in the same vein as \"A Separate Peace\", in the sense of setting, and in the general coming of age story line. The basic message is to \"suck the marrow out of life\", as the passage for the society reads, or to live every moment to the fullest. It is inspiring and uplifting for the first hour and 15 minutes or so, before changing stride altogether to a somewhat depressing but remarkable conclusion. This is a must see."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw3218357",
      "warningSpoilers": false,
      "date": "11 April 2015",
      "rate": "7",
      "helpful": "7 out of 10 found this helpful.",
      "title": "A Story of Inspiration",
      "content": "English teacher John Keating (Robin Williams) inspires his students to discover their love for poetry and seize the day.This is a story about what one teacher (or a mentor of any kind) can do to inspire the youth, whether it be for good or evil. Those viewing this film will generally see it as a force for good, a call to \"seize the day\". And that is probably the correct interpretation.But interestingly, the call for non-conformity leads to its own kind of conformity. And one could argue that Keating's power is not much different than that of a politician or cult leader. Had he chosen to use it differently, he could have been a very dangerous force in these young men's lives. In fact, we see not everyone who followed his path was better because of it."
    },
    {
      "username": "what3v3r",
      "userUrl": "https://www.imdb.com/user/ur4060420",
      "reviewLink": "https://www.imdb.com/review/rw1179886",
      "warningSpoilers": true,
      "date": "25 September 2005",
      "rate": "9",
      "helpful": "15 out of 20 found this helpful.",
      "title": "A celebration of Individualism !",
      "content": "In a sense, this movie was indeed the celebration of Dead Poets the world over! Dead Poets Society! I am guessing a large number of you, like me, were expecting a bunch of spooky irregular events at the mutter of that name. Certainly wasn't to be, it is an inspirational odyssey which will make you pounce upon time and reclaim your life. Carpe Diem and the spirit that John Keating (played by Robin Williams) stands for could easily be misinterpreted by the turn of events in the movie, especially Neils poignant death. To do so is to completely miss the point. The spirit of Carpe Diem lies in the painstaking eventualities which one will have to brave to follow the lead of passion and fervour. Robin Williams plays a professor of poetry, John Keating at the prestigious Welton School, with a management making sufficient hay with the schools continual academic shine. His particularly unorthodox methods of teaching soon make one realize that poetry is not something to do with rhyming words or fantasy lands, but that poetry is in effect a direct means to ones disposition in life, a disposition which would ring success in all avenues. His students soon change their very outlook towards life indulging in activities much to the displeasure of the academically unbending deans of the school. Harvesting discontent against Keating, the deans soon latch on to the one opportunity(or mis-opportunity I must say) that comes their way in the form of Neils death to see the removal of Keating from the school and the teaching profession. The last few minutes celebrate every individualistic spirit to let you segue into a illusive reality. A young Ethan Hawke playing an even younger student redeems his professors every drop of sweat with \"Oh Captain! My Captain!\" . Watch the movie and you will see why! At least for half an hour after I watched this movie, I managed to drive mans favorite cliché \"Life Sucks!\" into oblivion. I suppose the students at Welton were not the only ones Professor John Keating inspired."
    }
  ],
  "errorMessage": ""
}