{
  "imDbId": "tt0097165",
  "title": "Dead Poets Society",
  "fullTitle": "Dead Poets Society (1989)",
  "type": "Movie",
  "year": "1989",
  "language": "en",
  "titleInLanguage": "Dead Poets Society",
  "url": "https://en.wikipedia.org/wiki/Dead_Poets_Society",
  "plotShort": {
    "plainText": "Dead Poets Society is a 1989 American drama film directed by Peter Weir and written by Tom Schulman. The film, starring Robin Williams, is set in 1959 at the fictional elite conservative boarding school Welton Academy, and tells the story of an English teacher who inspires his students through his teaching of poetry.\r\nDead Poets Society was released in the United States on June 2, 1989. The film was a commercial success and received numerous accolades, including Academy Award nominations for Best Picture, Best Director, and Best Actor for Williams. The film won the BAFTA Award for Best Film, the César Award for Best Foreign Film and the David di Donatello Award for Best Foreign Film. Schulman received the Academy Award for Best Original Screenplay for his work.",
    "html": "<p>Dead Poets Society is a 1989 American drama film directed by Peter Weir and written by Tom Schulman. The film, starring Robin Williams, is set in 1959 at the fictional elite conservative boarding school Welton Academy, and tells the story of an English teacher who inspires his students through his teaching of poetry.</p><p>Dead Poets Society was released in the United States on June 2, 1989. The film was a commercial success and received numerous accolades, including Academy Award nominations for Best Picture, Best Director, and Best Actor for Williams. The film won the BAFTA Award for Best Film, the César Award for Best Foreign Film and the David di Donatello Award for Best Foreign Film. Schulman received the Academy Award for Best Original Screenplay for his work.</p>"
  },
  "plotFull": {
    "plainText": "Dead Poets Society is a 1989 American drama film directed by Peter Weir and written by Tom Schulman. The film, starring Robin Williams, is set in 1959 at the fictional elite conservative boarding school Welton Academy, and tells the story of an English teacher who inspires his students through his teaching of poetry.\r\nDead Poets Society was released in the United States on June 2, 1989. The film was a commercial success and received numerous accolades, including Academy Award nominations for Best Picture, Best Director, and Best Actor for Williams. The film won the BAFTA Award for Best Film, the César Award for Best Foreign Film and the David di Donatello Award for Best Foreign Film. Schulman received the Academy Award for Best Original Screenplay for his work.\r\nPlot\r\nIn 1959, Todd Anderson begins his junior year of high school at Welton Academy, an all-male preparatory boarding school in Vermont. Assigned one of Welton's most promising students, senior Neil Perry, as his roommate, he meets his friends: Knox Overstreet, Richard Cameron, Steven Meeks, Gerard Pitts, and Charlie Dalton.\r\nOn the first day of classes, the boys are surprised by the unorthodox teaching methods of new English teacher, John Keating. A Welton alumnus himself, Keating encourages his students to \"make your lives extraordinary\", a sentiment he summarizes with the Latin expression carpe diem (\"seize the day\").\r\nSubsequent lessons include Keating having the students take turns standing on his desk to demonstrate ways to look at life differently, telling them to rip out the introduction of their poetry books which explains a mathematical formula used for rating poetry, and inviting them to make up their own style of walking in a courtyard to encourage their individualism. Keating's methods attract the attention of strict headmaster, Gale Nolan.\r\nUpon learning that Keating was a member of the unsanctioned Dead Poets Society while at Welton, Neil restarts the club and he and his friends sneak off campus to a cave where they read poetry. As the school year progresses, Keating's lessons and their involvement with the club encourage them to live their lives on their own terms. Knox pursues Chris Noel, an attractive cheerleader who is dating Chet Danburry, a football player from a local public school whose family is friends with his.\r\nNeil discovers his love of acting and gets the role as Puck in a local production of A Midsummer Night's Dream, despite the fact that his domineering father wants him to attend Harvard to study medicine. Meanwhile, Keating helps Todd come out of his shell and realize his potential when he takes him through an exercise in self-expression, resulting in his composing a poem spontaneously in front of the class.\r\nCharlie publishes an article in the school newspaper in the club's name suggesting that girls be admitted to Welton. Nolan paddles Charlie to coerce him into revealing who else is in the Dead Poets Society, but he resists. Nolan also speaks with Keating, warning him that he should discourage his students from questioning authority. Keating admonishes the boys in his manner, warning that one must assess all consequences.\r\nNeil becomes devastated after his father discovers his involvement in the play and demands he quit on the eve of the opening performance. He goes to Keating, who advises him to stand his ground and prove to his father that his love of acting is something he takes seriously. Neil's father unexpectedly shows up at the performance. He angrily takes Neil home and has him withdrawn from Welton and enrolled in a military academy. Lacking any support from his concerned mother, and unable to explain how he feels to his father, a distraught Neil commits suicide.\r\nNolan investigates Neil's death at the request of the Perry family. Cameron blames Neil's death on Keating to escape punishment for his own participation in the Dead Poets Society, and names the other members. Confronted by Charlie, Cameron urges the rest of them to let Keating take the fall. Charlie punches Cameron and is expelled. Each of the boys is called to Nolan's office to sign a letter attesting to the truth of Cameron's allegations, even knowing they are false. When Todd's turn comes, he is reluctant to sign, but does so after seeing that the others have complied and succumbs to his parents' pressure.\r\nKeating is fired and Nolan, who taught English at Welton prior to becoming headmaster, takes over teaching the class, with the intent of adhering to traditional Welton rules. Keating interrupts the class to gather his leftover belongings. As he leaves, Todd reveals to Keating that the boys were intimidated into signing the paper that sealed his fate, and he assures Todd that he believes him. Nolan threatens to expel Todd. Todd stands up on his desk, with the words \"O Captain! My Captain!\", which prompts Nolan to threaten him again. The other members of the Dead Poets Society (except for Cameron), as well as several other students in the class, do the same, to Nolan's fury and Keating's pleased surprise. Touched by their support, Keating proudly thanks the boys and departs.\r\nCast\r\nRobin Williams as John Keating, new English teacher\r\nRobert Sean Leonard as Neil Perry\r\nEthan Hawke as Todd Anderson\r\nJosh Charles as Knox Overstreet\r\nGale Hansen as Charlie Dalton\r\nDylan Kussman as Richard Cameron\r\nAllelon Ruggiero as Steven Meeks\r\nJames Waterston as Gerard Pitts\r\nNorman Lloyd as Dr. Gale Nolan, headmaster of Welton Academy\r\nKurtwood Smith as Thomas Perry, Neil's controlling father\r\nAlexandra Powers as Chris Noel, Knox's love interest, a cheerleader at Ridgeway High.\r\nMelora Walters as Gloria\r\nWelker White as Tina\r\nLeon Pownall as George McAllister, Latin teacher\r\nGeorge Martin as Dr. Hager, mathematics teacher\r\nCarla Belver as Mrs. Perry, Neil's mother who is scared of her husband.\r\nJane Moore as Mrs. Danburry\r\nKevin Cooney as Joe Danburry, Chet's father and a friend of Knox's family.\r\nColin Irving as Chet Danburry, Chris's boyfriend and a football player at Ridgeway High.\r\nMatt Carey as Kurt Hopkins, a student at Welton.\r\nJohn Cunningham as Mr. Anderson\r\nLara Flynn Boyle as Ginny Danburry, Chet's younger sister (scenes deleted)\r\nProduction\r\nDevelopment\r\nThe original script was written by Tom Schulman, based on his experiences at the Montgomery Bell Academy in Nashville, Tennessee, particularly with his inspirational teacher Samuel Pickering.\r\nJeff Kanew was originally hired as the director, and Kanew had envisioned Liam Neeson in the role of Keating. Other actors considered for the role were Dustin Hoffman, Mel Gibson, Tom Hanks, and Mickey Rourke. Robin Williams, Touchstone Pictures' preferred choice, was ultimately cast, but on the first day of shooting outside Atlanta, Williams did not show as he did not want to work with Kanew. The studio burned down the already-built sets and replaced Kanew with another director.\r\nIn late 1988, Peter Weir had met with Jeffrey Katzenberg at Disney. Katzenberg, who oversaw Touchstone, suggested Weir read Schulman's script. On a flight back to Sydney, Weir was captivated and six weeks later returned to Los Angeles to cast the principal characters. It was not until Weir was given directing duties that filming began in earnest.\r\nIn Schulman's manuscript, Keating had been ill and slowly dying of Hodgkin lymphoma, with a scene showing him on his deathbed in the hospital. This was removed by Weir who deemed it unnecessary, claiming this would focus audiences on Keating's illness and not on what he stood for.\r\nEarly notes from Disney on the script also suggested making the boys' passion dancing rather than poetry, as well as a new title, Sultans of Swing, focusing on the character of Mr. Keating rather than on the boys themselves, but both were dismissed outright.\r\nFilming\r\nFilming began in November 1988 wrapped in January 1989, and took place at St. Andrew's School and the Everett Theatre in Middletown, Delaware, and at locations in New Castle, Delaware, and in nearby Wilmington, Delaware. Classroom scenes with Keating were filmed in a replica classroom built on a soundstage in Wilmington. During the shooting, Weir requested the young cast not to use modern slang, even off camera. Weir also said he hid a half-day's worth of filming from Disney executives in order to allow Williams free range to use his comedy improvisational skills.\r\nDuring filming, Williams used to crack many jokes on set, which Ethan Hawke found incredibly irritating. For the scene where Todd Anderson is spontaneously incited by John Keating to make a poem in front of the class, Williams apparently made a joke saying that Hawke was intimidating, which Hawke later realized was serious and that the joke referred to his earnestness and intensity as a young man. Ironically, Hawke's first agent signed with Hawke once Williams told him that Hawke would \"do really well\".\r\nReception\r\nBox office\r\nThe worldwide box office was reported as $235,860,579, which includes domestic grosses of $95,860,116. The film's global receipts were the fifth highest for 1989, and the highest for dramas.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 84% based on 61 reviews with an average score of 7.2/10. The website's critical consensus reads, \"Affecting performances from the young cast and a genuinely inspirational turn from Robin Williams grant Peter Weir's prep school drama top honors.\" On Metacritic, the film received a score of 79 based on 14 reviews, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film a rare \"A+\" grade.\r\nThe Washington Post's reviewer called it \"solid, smart entertainment\", and praised Robin Williams for giving a \"nicely restrained acting performance\". Vincent Canby of The New York Times also praised Williams' \"exceptionally fine performance\", while writing that \"Dead Poets Society ... is far less about Keating than about a handful of impressionable boys\". Pauline Kael was unconvinced about the film, and its \"middlebrow highmindedness\", but praised Williams. \"Robin Williams' performance is more graceful than anything he's done before he's totally, concentratedly there – reads his lines stunningly, and when he mimics various actors reciting Shakespeare there's no undue clowning in it; he's a gifted teacher demonstrating his skills.\"\r\nRoger Ebert's review gave the film two out of four stars. He criticized Williams for spoiling an otherwise creditable dramatic performance by occasionally veering into his onstage comedian's persona, and lamented that for a film set in the 1950s there was no mention of the Beat Generation writers. Additionally, Ebert described the film as an often poorly constructed \"collection of pious platitudes ... The movie pays lip service to qualities and values that, on the evidence of the screenplay itself, it is cheerfully willing to abandon.\"\r\nOn their Oscar nomination edition of Siskel & Ebert, both Gene Siskel (who also gave the film a mixed review) and Ebert disagreed with Williams' Oscar nomination; Ebert said that he would have swapped Williams with either Matt Dillon for Drugstore Cowboy or John Cusack for Say Anything. On their If We Picked the Winners special in March 1990, Ebert chose the film's Best Picture nomination as the worst nomination of the year, believing it took a slot that could have gone to Spike Lee's Do the Right Thing.\r\nFilm historian Leonard Maltin wrote: \"Well made, extremely well acted, but also dramatically obvious and melodramatically one-sided. Nevertheless, Tom Schulman's screenplay won an Oscar.\"\r\nJohn Simon, writing for National Review, said Dead Poets Society was the most dishonest film he had seen in some time.\r\nAccolades\r\nAmerican Film Institute Lists\r\nAFI's 100 Years...100 Heroes and Villains: John Keating – Nominated Hero\r\nJohn Keating – Nominated Hero\r\nAFI's 100 Years...100 Movie Quotes: \"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" – #95\r\n\"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" – #95\r\nAFI's 100 Years...100 Cheers – #52\r\nThe film was voted #52 on the AFI's 100 Years…100 Cheers list, a list of the top 100 most inspiring films of all time.\r\nThe film's line \"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" was voted as the 95th greatest movie quote by the American Film Institute.\r\nLegacy\r\nAfter Robin Williams' death in August 2014, fans of his work used social media to pay tribute to him with photo and video reenactments of the film's final \"O Captain! My Captain!\" scene.\r\nAdaptations\r\nNancy H. Kleinbaum's novel Dead Poets Society (1989) is based on the movie.\r\nStage play\r\nA theatrical adaptation written by Tom Schulman and directed by John Doyle opened Off-Broadway on October 27, 2016, and ran through December 11, 2016. Jason Sudeikis starred as John Keating with Thomas Mann as Neil Perry, David Garrison as Gale Nolan, Zane Pais as Todd Anderson, Francesca Carpanini as Chris, Stephen Barker Turner as Mr. Perry, Will Hochman as Knox Overstreet, Cody Kostro as Charlie Dalton, Yaron Lotan as Richard Cameron, and Bubba Weiler as Steven Meeks.\r\nThe production received a mixed review from The New York Times, with critic Ben Brantley calling the play \"blunt and bland\", and criticizing Sudeikis's performance, citing his lack of enthusiasm when delivering powerful lines.\r\nIn 2018, the theatrical adaptation of the film, written by Tom Schulman and directed by Francisco Franco, premiered in Mexico. The Mexican actor Alfonso Herrera played the main character.\r\nParodies\r\nThe ending of the film was parodied in the Saturday Night Live sketch \"Farewell, Mr. Bunting\", with Fred Armisen playing Williams' role. The sketch is a largely faithful recreation of the scene until a student (Pete Davidson) is decapitated by a ceiling fan when he jumps on top of his desk, resulting in the room being covered with gushing blood from his headless body and the teacher awkwardly leaving the room.",
    "html": "<p>Dead Poets Society is a 1989 American drama film directed by Peter Weir and written by Tom Schulman. The film, starring Robin Williams, is set in 1959 at the fictional elite conservative boarding school Welton Academy, and tells the story of an English teacher who inspires his students through his teaching of poetry.</p><p>Dead Poets Society was released in the United States on June 2, 1989. The film was a commercial success and received numerous accolades, including Academy Award nominations for Best Picture, Best Director, and Best Actor for Williams. The film won the BAFTA Award for Best Film, the César Award for Best Foreign Film and the David di Donatello Award for Best Foreign Film. Schulman received the Academy Award for Best Original Screenplay for his work.</p><br/><h3>Plot</h3><p>In 1959, Todd Anderson begins his junior year of high school at Welton Academy, an all-male preparatory boarding school in Vermont. Assigned one of Welton's most promising students, senior Neil Perry, as his roommate, he meets his friends: Knox Overstreet, Richard Cameron, Steven Meeks, Gerard Pitts, and Charlie Dalton.</p><p>On the first day of classes, the boys are surprised by the unorthodox teaching methods of new English teacher, John Keating. A Welton alumnus himself, Keating encourages his students to \"make your lives extraordinary\", a sentiment he summarizes with the Latin expression carpe diem (\"seize the day\").</p><p>Subsequent lessons include Keating having the students take turns standing on his desk to demonstrate ways to look at life differently, telling them to rip out the introduction of their poetry books which explains a mathematical formula used for rating poetry, and inviting them to make up their own style of walking in a courtyard to encourage their individualism. Keating's methods attract the attention of strict headmaster, Gale Nolan.</p><p>Upon learning that Keating was a member of the unsanctioned Dead Poets Society while at Welton, Neil restarts the club and he and his friends sneak off campus to a cave where they read poetry. As the school year progresses, Keating's lessons and their involvement with the club encourage them to live their lives on their own terms. Knox pursues Chris Noel, an attractive cheerleader who is dating Chet Danburry, a football player from a local public school whose family is friends with his.</p><p>Neil discovers his love of acting and gets the role as Puck in a local production of A Midsummer Night's Dream, despite the fact that his domineering father wants him to attend Harvard to study medicine. Meanwhile, Keating helps Todd come out of his shell and realize his potential when he takes him through an exercise in self-expression, resulting in his composing a poem spontaneously in front of the class.</p><p>Charlie publishes an article in the school newspaper in the club's name suggesting that girls be admitted to Welton. Nolan paddles Charlie to coerce him into revealing who else is in the Dead Poets Society, but he resists. Nolan also speaks with Keating, warning him that he should discourage his students from questioning authority. Keating admonishes the boys in his manner, warning that one must assess all consequences.</p><p>Neil becomes devastated after his father discovers his involvement in the play and demands he quit on the eve of the opening performance. He goes to Keating, who advises him to stand his ground and prove to his father that his love of acting is something he takes seriously. Neil's father unexpectedly shows up at the performance. He angrily takes Neil home and has him withdrawn from Welton and enrolled in a military academy. Lacking any support from his concerned mother, and unable to explain how he feels to his father, a distraught Neil commits suicide.</p><p>Nolan investigates Neil's death at the request of the Perry family. Cameron blames Neil's death on Keating to escape punishment for his own participation in the Dead Poets Society, and names the other members. Confronted by Charlie, Cameron urges the rest of them to let Keating take the fall. Charlie punches Cameron and is expelled. Each of the boys is called to Nolan's office to sign a letter attesting to the truth of Cameron's allegations, even knowing they are false. When Todd's turn comes, he is reluctant to sign, but does so after seeing that the others have complied and succumbs to his parents' pressure.</p><p>Keating is fired and Nolan, who taught English at Welton prior to becoming headmaster, takes over teaching the class, with the intent of adhering to traditional Welton rules. Keating interrupts the class to gather his leftover belongings. As he leaves, Todd reveals to Keating that the boys were intimidated into signing the paper that sealed his fate, and he assures Todd that he believes him. Nolan threatens to expel Todd. Todd stands up on his desk, with the words \"O Captain! My Captain!\", which prompts Nolan to threaten him again. The other members of the Dead Poets Society (except for Cameron), as well as several other students in the class, do the same, to Nolan's fury and Keating's pleased surprise. Touched by their support, Keating proudly thanks the boys and departs.</p><br/><h3>Cast</h3><ul><li>Robin Williams as John Keating, new English teacher</li><li>Robert Sean Leonard as Neil Perry</li><li>Ethan Hawke as Todd Anderson</li><li>Josh Charles as Knox Overstreet</li><li>Gale Hansen as Charlie Dalton</li><li>Dylan Kussman as Richard Cameron</li><li>Allelon Ruggiero as Steven Meeks</li><li>James Waterston as Gerard Pitts</li><li>Norman Lloyd as Dr. Gale Nolan, headmaster of Welton Academy</li><li>Kurtwood Smith as Thomas Perry, Neil's controlling father</li><li>Alexandra Powers as Chris Noel, Knox's love interest, a cheerleader at Ridgeway High.</li><li>Melora Walters as Gloria</li><li>Welker White as Tina</li><li>Leon Pownall as George McAllister, Latin teacher</li><li>George Martin as Dr. Hager, mathematics teacher</li><li>Carla Belver as Mrs. Perry, Neil's mother who is scared of her husband.</li><li>Jane Moore as Mrs. Danburry</li><li>Kevin Cooney as Joe Danburry, Chet's father and a friend of Knox's family.</li><li>Colin Irving as Chet Danburry, Chris's boyfriend and a football player at Ridgeway High.</li><li>Matt Carey as Kurt Hopkins, a student at Welton.</li><li>John Cunningham as Mr. Anderson</li><li>Lara Flynn Boyle as Ginny Danburry, Chet's younger sister (scenes deleted)</li></ul><br/><h3>Production</h3><h4>Development</h4><p>The original script was written by Tom Schulman, based on his experiences at the Montgomery Bell Academy in Nashville, Tennessee, particularly with his inspirational teacher Samuel Pickering.</p><p>Jeff Kanew was originally hired as the director, and Kanew had envisioned Liam Neeson in the role of Keating. Other actors considered for the role were Dustin Hoffman, Mel Gibson, Tom Hanks, and Mickey Rourke. Robin Williams, Touchstone Pictures' preferred choice, was ultimately cast, but on the first day of shooting outside Atlanta, Williams did not show as he did not want to work with Kanew. The studio burned down the already-built sets and replaced Kanew with another director.</p><p>In late 1988, Peter Weir had met with Jeffrey Katzenberg at Disney. Katzenberg, who oversaw Touchstone, suggested Weir read Schulman's script. On a flight back to Sydney, Weir was captivated and six weeks later returned to Los Angeles to cast the principal characters. It was not until Weir was given directing duties that filming began in earnest.</p><p>In Schulman's manuscript, Keating had been ill and slowly dying of Hodgkin lymphoma, with a scene showing him on his deathbed in the hospital. This was removed by Weir who deemed it unnecessary, claiming this would focus audiences on Keating's illness and not on what he stood for.</p><p>Early notes from Disney on the script also suggested making the boys' passion dancing rather than poetry, as well as a new title, Sultans of Swing, focusing on the character of Mr. Keating rather than on the boys themselves, but both were dismissed outright.</p><h4>Filming</h4><p>Filming began in November 1988 wrapped in January 1989, and took place at St. Andrew's School and the Everett Theatre in Middletown, Delaware, and at locations in New Castle, Delaware, and in nearby Wilmington, Delaware. Classroom scenes with Keating were filmed in a replica classroom built on a soundstage in Wilmington. During the shooting, Weir requested the young cast not to use modern slang, even off camera. Weir also said he hid a half-day's worth of filming from Disney executives in order to allow Williams free range to use his comedy improvisational skills.</p><p>During filming, Williams used to crack many jokes on set, which Ethan Hawke found incredibly irritating. For the scene where Todd Anderson is spontaneously incited by John Keating to make a poem in front of the class, Williams apparently made a joke saying that Hawke was intimidating, which Hawke later realized was serious and that the joke referred to his earnestness and intensity as a young man. Ironically, Hawke's first agent signed with Hawke once Williams told him that Hawke would \"do really well\".</p><br/><h3>Reception</h3><h4>Box office</h4><p>The worldwide box office was reported as $235,860,579, which includes domestic grosses of $95,860,116. The film's global receipts were the fifth highest for 1989, and the highest for dramas.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 84% based on 61 reviews with an average score of 7.2/10. The website's critical consensus reads, \"Affecting performances from the young cast and a genuinely inspirational turn from Robin Williams grant Peter Weir's prep school drama top honors.\" On Metacritic, the film received a score of 79 based on 14 reviews, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film a rare \"A+\" grade.</p><p>The Washington Post's reviewer called it \"solid, smart entertainment\", and praised Robin Williams for giving a \"nicely restrained acting performance\". Vincent Canby of The New York Times also praised Williams' \"exceptionally fine performance\", while writing that \"Dead Poets Society ... is far less about Keating than about a handful of impressionable boys\". Pauline Kael was unconvinced about the film, and its \"middlebrow highmindedness\", but praised Williams. \"Robin Williams' performance is more graceful than anything he's done before he's totally, concentratedly there – reads his lines stunningly, and when he mimics various actors reciting Shakespeare there's no undue clowning in it; he's a gifted teacher demonstrating his skills.\"</p><p>Roger Ebert's review gave the film two out of four stars. He criticized Williams for spoiling an otherwise creditable dramatic performance by occasionally veering into his onstage comedian's persona, and lamented that for a film set in the 1950s there was no mention of the Beat Generation writers. Additionally, Ebert described the film as an often poorly constructed \"collection of pious platitudes ... The movie pays lip service to qualities and values that, on the evidence of the screenplay itself, it is cheerfully willing to abandon.\"</p><p>On their Oscar nomination edition of Siskel & Ebert, both Gene Siskel (who also gave the film a mixed review) and Ebert disagreed with Williams' Oscar nomination; Ebert said that he would have swapped Williams with either Matt Dillon for Drugstore Cowboy or John Cusack for Say Anything. On their If We Picked the Winners special in March 1990, Ebert chose the film's Best Picture nomination as the worst nomination of the year, believing it took a slot that could have gone to Spike Lee's Do the Right Thing.</p><p>Film historian Leonard Maltin wrote: \"Well made, extremely well acted, but also dramatically obvious and melodramatically one-sided. Nevertheless, Tom Schulman's screenplay won an Oscar.\"</p><p>John Simon, writing for National Review, said Dead Poets Society was the most dishonest film he had seen in some time.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th><style data-mw-deduplicate=\"TemplateStyles:r1038841319\">.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help}</style><span class=\"rt-commentedText tooltip tooltip-dotted\">Ref.</span></th></tr><tr><td rowspan=\"4\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Steven Haft</span>, <span>Paul Junger Witt</span> and <span>Tony Thomas</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span>Best Director</span></td><td><span>Peter Weir</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td><span>Robin Williams</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Written Directly for the Screen</span></td><td><span>Tom Schulman</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Argentine Film Critics Association</span> Awards</td><td><span>Best Foreign Film</span></td><td>Peter Weir</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Artios Awards</span></td><td><span>Outstanding Achievement in Feature Film Casting – Drama</span></td><td>Howard Feuer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>ASCAP Film and Television Music Awards</span></td><td>Top Box Office Films</td><td><span>Maurice Jarre</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Association of Polish Filmmakers Critics Awards</td><td>Best Foreign Film</td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"6\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td>Steven Haft, Paul Junger Witt, Tony Thomas and Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\"></td></tr><tr><td><span>Best Direction</span></td><td>Peter Weir</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Leading Role</span></td><td>Robin Williams</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Original</span></td><td>Tom Schulman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td><span>William M. Anderson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Film Score</span></td><td>Maurice Jarre</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Society of Cinematographers</span></td><td>Best Cinematography in a Theatrical Feature Film</td><td><span>John Seale</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>César Awards</span></td><td><span>Best Foreign Film</span></td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Chicago Film Critics Association Awards</span></td><td>Most Promising Actor</td><td><span>Robert Sean Leonard</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\"><span>David di Donatello</span> Awards</td><td><span>Best Foreign Film</span></td><td rowspan=\"2\">Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Best Foreign Director</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Best Foreign Actor</span></td><td>Robin Williams</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Peter Weir</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Golden Ciak Awards</span></td><td>Best Foreign Film</td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td><span>Best Motion Picture – Drama</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Robin Williams</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Peter Weir</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Tom Schulman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Golden Screen Awards</span></td><td></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Guild of German Art House Cinemas Awards</td><td>Best Foreign Film</td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Joseph Plateau Awards</span></td><td>Best Foreign Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"2\"><span>Jupiter Awards</span></td><td>Best International Film</td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Best International Actor</td><td>Robin Williams</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Nastro d'Argento</span></td><td>Best Foreign Director</td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>National Board of Review Awards</span></td><td><span>Top Ten Films</span></td><td></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">6th Place</td><td></td></tr><tr><td>Online Film &amp; Television Association Awards</td><td>Hall of Fame – Motion Picture</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td></td></tr><tr><td>Political Film Society Awards</td><td><span>Democracy</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Turkish Film Critics Association</span> Awards</td><td>Best Foreign Film</td><td></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">6th Place</td><td></td></tr><tr><td><span>Warsaw Film Festival</span></td><td>Audience Award</td><td>Peter Weir</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Screenplay – Written Directly for the Screen</span></td><td>Tom Schulman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Young Artist Awards</span></td><td>Best Motion Picture – Drama</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><p>American Film Institute Lists</p><ul><li>AFI's 100 Years...100 Heroes and Villains: John Keating – Nominated Hero</li><li>John Keating – Nominated Hero</li><li>AFI's 100 Years...100 Movie Quotes: \"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" – #95</li><li>\"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" – #95</li><li>AFI's 100 Years...100 Cheers – #52</li></ul><p>The film was voted #52 on the AFI's 100 Years…100 Cheers list, a list of the top 100 most inspiring films of all time.</p><p>The film's line \"Carpe diem. Seize the day, boys. Make your lives extraordinary.\" was voted as the 95th greatest movie quote by the American Film Institute.</p><h4>Legacy</h4><p>After Robin Williams' death in August 2014, fans of his work used social media to pay tribute to him with photo and video reenactments of the film's final \"O Captain! My Captain!\" scene.</p><br/><h3>Adaptations</h3><p>Nancy H. Kleinbaum's novel Dead Poets Society (1989) is based on the movie.</p><h4>Stage play</h4><p>A theatrical adaptation written by Tom Schulman and directed by John Doyle opened Off-Broadway on October 27, 2016, and ran through December 11, 2016. Jason Sudeikis starred as John Keating with Thomas Mann as Neil Perry, David Garrison as Gale Nolan, Zane Pais as Todd Anderson, Francesca Carpanini as Chris, Stephen Barker Turner as Mr. Perry, Will Hochman as Knox Overstreet, Cody Kostro as Charlie Dalton, Yaron Lotan as Richard Cameron, and Bubba Weiler as Steven Meeks.</p><p>The production received a mixed review from The New York Times, with critic Ben Brantley calling the play \"blunt and bland\", and criticizing Sudeikis's performance, citing his lack of enthusiasm when delivering powerful lines.</p><p>In 2018, the theatrical adaptation of the film, written by Tom Schulman and directed by Francisco Franco, premiered in Mexico. The Mexican actor Alfonso Herrera played the main character.</p><h4>Parodies</h4><p>The ending of the film was parodied in the Saturday Night Live sketch \"Farewell, Mr. Bunting\", with Fred Armisen playing Williams' role. The sketch is a largely faithful recreation of the scene until a student (Pete Davidson) is decapitated by a ceiling fan when he jumps on top of his desk, resulting in the room being covered with gushing blood from his headless body and the teacher awkwardly leaving the room.</p><br/>"
  },
  "errorMessage": ""
}