{
  "imDbId": "tt0114814",
  "title": "The Usual Suspects",
  "fullTitle": "The Usual Suspects (1995)",
  "type": "Movie",
  "year": "1995",
  "items": [
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "100",
      "content": "The Usual Suspects is an ironic, bang-up thriller about the wages of crime. A terrific cast of exciting actors socks over this absorbingly complicated yarn that's been spun in a seductively slick fashion by director Bryan Singer."
    },
    {
      "publisher": "",
      "author": "Newsweek",
      "link": "https://www.msnbc.com/",
      "rate": "90",
      "content": "This one's done right. Here's an intelligent movie with no special effects. You have to pay close attention, to listen hard to its cross-fires of dialogue."
    },
    {
      "publisher": "Baltimore Sun",
      "author": "Ann Hornaday",
      "link": "",
      "rate": "88",
      "content": "Dense, ironic and thoroughly engrossing caper melodrama."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "The Usual Suspects is an accomplished synthesis of noir elements and, as such, is an entertaining entry to the genre."
    },
    {
      "publisher": "Mr. Showbiz",
      "author": "F. X. Feeney",
      "link": "https://www.disney.com/",
      "rate": "85",
      "content": "Byrne is a stand-up poet the way some actors are stand-up comics. His innate depth prompts The Usual Suspects to transcend its own cleverness--and this is the movie's smartest, least predictable surprise."
    },
    {
      "publisher": "Washington Post",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "This thriller is like a game of life-and-death chess, with quick double-crosses and wild gambits."
    },
    {
      "publisher": "Film.com",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "I liked this film better the second time around."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "75",
      "content": "Dense with plot intricacies, thick with atmosphere, and packed with showy roles for a hip ensemble."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "50",
      "content": "Self-consciously bleak."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "38",
      "content": "To the degree that you will want to see this movie, it will be because of the surprise, and so I will say no more, except to say that the \"solution,\" when it comes, solves little - unless there is really little to solve, which is also a possibility."
    }
  ],
  "errorMessage": ""
}