{
  "imDbId": "tt0114814",
  "title": "The Usual Suspects",
  "fullTitle": "The Usual Suspects (1995)",
  "type": "Movie",
  "year": "1995",
  "language": "en",
  "titleInLanguage": "The Usual Suspects",
  "url": "https://en.wikipedia.org/wiki/The_Usual_Suspects",
  "plotShort": {
    "plainText": "The Usual Suspects is a 1995 neo-noir mystery film directed by Bryan Singer and written by Christopher McQuarrie. It stars Stephen Baldwin, Gabriel Byrne, Benicio del Toro, Kevin Pollak, Chazz Palminteri, Pete Postlethwaite, and Kevin Spacey.\r\nThe plot follows the interrogation of Roger \"Verbal\" Kint, a small-time con man, who is one of only two survivors of a massacre and fire on a ship docked at the Port of Los Angeles. Through flashback and narration, Kint tells an interrogator a convoluted story of events that led him and his criminal companions to the boat, and of a mysterious crime lord—known as Keyser Söze—who controlled them. The film was shot on a $6 million budget and began as a title taken from a column in Spy magazine called The Usual Suspects, after one of Claude Rains' most memorable lines in the classic film Casablanca, and Singer thought that it would make a good title for a film.\r\nThe film was shown out of competition at the 1995 Cannes Film Festival and then initially released in a few theaters. It received favorable reviews and was eventually given a wider release. The praise was towards the mystery elements, the screenplay, the plot twist and Spacey's performance. McQuarrie won the Academy Award for Best Original Screenplay and Spacey won the Academy Award for Best Supporting Actor for his performance. The Writers Guild of America ranked the film as having the 35th greatest screenplay of all time.",
    "html": "<p>The Usual Suspects is a 1995 neo-noir mystery film directed by Bryan Singer and written by Christopher McQuarrie. It stars Stephen Baldwin, Gabriel Byrne, Benicio del Toro, Kevin Pollak, Chazz Palminteri, Pete Postlethwaite, and Kevin Spacey.</p><p>The plot follows the interrogation of Roger \"Verbal\" Kint, a small-time con man, who is one of only two survivors of a massacre and fire on a ship docked at the Port of Los Angeles. Through flashback and narration, Kint tells an interrogator a convoluted story of events that led him and his criminal companions to the boat, and of a mysterious crime lord—known as Keyser Söze—who controlled them. The film was shot on a $6 million budget and began as a title taken from a column in Spy magazine called The Usual Suspects, after one of Claude Rains' most memorable lines in the classic film Casablanca, and Singer thought that it would make a good title for a film.</p><p>The film was shown out of competition at the 1995 Cannes Film Festival and then initially released in a few theaters. It received favorable reviews and was eventually given a wider release. The praise was towards the mystery elements, the screenplay, the plot twist and Spacey's performance. McQuarrie won the Academy Award for Best Original Screenplay and Spacey won the Academy Award for Best Supporting Actor for his performance. The Writers Guild of America ranked the film as having the 35th greatest screenplay of all time.</p>"
  },
  "plotFull": {
    "plainText": "The Usual Suspects is a 1995 neo-noir mystery film directed by Bryan Singer and written by Christopher McQuarrie. It stars Stephen Baldwin, Gabriel Byrne, Benicio del Toro, Kevin Pollak, Chazz Palminteri, Pete Postlethwaite, and Kevin Spacey.\r\nThe plot follows the interrogation of Roger \"Verbal\" Kint, a small-time con man, who is one of only two survivors of a massacre and fire on a ship docked at the Port of Los Angeles. Through flashback and narration, Kint tells an interrogator a convoluted story of events that led him and his criminal companions to the boat, and of a mysterious crime lord—known as Keyser Söze—who controlled them. The film was shot on a $6 million budget and began as a title taken from a column in Spy magazine called The Usual Suspects, after one of Claude Rains' most memorable lines in the classic film Casablanca, and Singer thought that it would make a good title for a film.\r\nThe film was shown out of competition at the 1995 Cannes Film Festival and then initially released in a few theaters. It received favorable reviews and was eventually given a wider release. The praise was towards the mystery elements, the screenplay, the plot twist and Spacey's performance. McQuarrie won the Academy Award for Best Original Screenplay and Spacey won the Academy Award for Best Supporting Actor for his performance. The Writers Guild of America ranked the film as having the 35th greatest screenplay of all time.\r\nPlot\r\nCareer criminal Dean Keaton (Byrne) lies badly wounded on a ship docked in San Pedro Bay. He is confronted by a mysterious figure he calls \"Keyser,\" who shoots him dead and sets fire to the ship. The next day, the police recover 27 bodies and only two survivors: Arkosh Kovash (\"Ákos Kovács\"), a Hungarian mobster hospitalized with severe burns, and Roger \"Verbal\" Kint, a physically disabled con artist. U.S. Customs agent Dave Kujan flies to Los Angeles from New York City to interrogate Verbal. The men are left alone in a borrowed office belonging to LAPD police sergeant Jeff Rabin while FBI agent Jack Baer visits a hospitalized Kovash. The events that led Keaton, Verbal, and their associates onto the ship are then described by Verbal via flashback.\r\nSix weeks earlier in New York City, Keaton and Verbal are arrested alongside fellow criminals Michael McManus, Fred Fenster, and Todd Hockney and placed in a police lineup as suspects in a truck hijacking that none of them admits to participating in. Believing the police were unfairly harassing them, McManus proposes they pull a heist to get revenge on the NYPD. Trying to go straight, Keaton initially refuses but eventually agrees to help rob a jewel smuggler being escorted by corrupt cops, netting millions in emeralds, getting over fifty cops arrested after leaking their activities to the press. They then go to California to fence the jewels through a man named Redfoot, who connects them with another jewel heist, but it goes badly and the contents are instead revealed to be China White (synthetic heroin). The men learn that the job was arranged by a lawyer named Kobayashi, who says he arranged for their arrests in New York and that his employer, mysterious Turkish crime lord Keyser Söze, from whom each of the men has unwittingly stolen, has ordered them to raid a ship holding Argentinian drug dealers and destroy $91 million worth of cocaine being sold on board. The cash brought for the exchange will be their reward.\r\nDuring Kujan's interrogation, he learns that there was no cocaine on the ship, and Söze was seen onboard. At the hospital, Baer learns that Kovács has seen Söze and has a sketch artist begin making a picture. Verbal then tells Kujan a legend about Söze: he was a small-time drug runner who murdered his own family when they were being held hostage by Hungarian mobsters, then massacred the mobsters and their families before disappearing, and from then on conducted business only indirectly through underlings who are mostly unfamiliar with their true employer. Söze thus became a fearsome urban legend, \"a spook story that criminals tell their kids at night.\"\r\nConcluding his story, Verbal reveals that Fenster was killed after trying to flee; the men then threatened Kobayashi, only to accept the assignment when he threatened their loved ones. The men attacked the ship during the night, killing several Argentinian and Hungarian gangsters before discovering that there was no cocaine. An unseen assailant killed Hockney, McManus, Keaton, and a prisoner in one of the ship's cabins. The mysterious figure then set fire to the ship as Verbal looked on from a hiding place on the dock.\r\nKujan deduces that Keaton must be Söze, as the prisoner killed on the ship was Arturo Marquez, a smuggler who escaped prosecution by claiming that he could identify Söze. Marquez was represented by lawyer Edie Finneran, Keaton's girlfriend, who was recently murdered. Kujan claims that the Argentinians took Marquez to sell him to Söze's Hungarian rivals. Keaton then used the assault so that he could kill Marquez personally and fake his own death. Verbal finally confesses that Keaton had been behind everything, but refuses to testify in court. Verbal's bail is posted, and he is released.\r\nMoments later, Kujan realizes Verbal apparently fabricated his entire story by piecing together details from random items in Rabin's cluttered office. Verbal walks outside, gradually losing his limp and flexing his supposedly disabled hand. As Kujan pursues Verbal, a fax arrives at the police station with the artist's facial composite of Söze. The picture resembles Verbal, revealing that he was Söze the entire time. Verbal/Söze enters a car driven by \"Kobayashi\" and leaves, moments before Kujan arrives on the scene.\r\nCast\r\nKevin Spacey as Roger \"Verbal\" Kint / Keyser Söze\r\nGabriel Byrne as Dean Keaton:\r\nChazz Palminteri as Agent Dave Kujan:\r\nStephen Baldwin as Michael McManus:\r\nBenicio del Toro as Fred Fenster:\r\nKevin Pollak as Todd Hockney:\r\nPete Postlethwaite as Kobayashi\r\nSuzy Amis as Edie Finneran\r\nGiancarlo Esposito as FBI Agent Jack Baer\r\nDan Hedaya as Sergeant Jeff Rabin\r\nCástulo Guerra as Arturo Marquez\r\nPeter Greene as Redfoot (uncredited)\r\nScott B. Morgan as Keyser Söze (in flashbacks) (uncredited)\r\nProduction\r\nOrigins\r\nBryan Singer met Kevin Spacey at a party after a screening of the young filmmaker's first film, Public Access, at the 1993 Sundance Film Festival, where it won the Grand Jury Prize. Spacey had been encouraged by a number of people he knew who had seen it, and was so impressed that he told Singer and his screenwriting partner Christopher McQuarrie, that he wanted to be in whatever film they did next. Singer read a column in Spy magazine called \"The Usual Suspects\" after Claude Rains' line in Casablanca. Singer thought that it would be a good title for a film. When asked by a reporter at Sundance what their next film was about, McQuarrie replied, \"I guess it's about a bunch of criminals who meet in a police line-up,\" which incidentally was the first visual idea that he and Singer had for the poster: \"five guys who meet in a line-up,\" Singer remembers. The director also envisioned a tagline for the poster, \"All of you can go to Hell.\" Singer then asked the question, \"What would possibly bring these five felons together in one line-up?\" McQuarrie revamped an idea from one of his own unpublished screenplays — the story of a man who murders his own family and disappears. The writer mixed this with the idea of a team of criminals.\r\nSöze's character is based on John List, a New Jersey accountant who murdered his family in 1971 and then disappeared for almost two decades, assuming a new identity before he was ultimately apprehended. McQuarrie based the name of Keyser Söze on one of his previous supervisors, Kayser Sume, at a Los Angeles law firm where he worked, but decided to change the last name because he thought that his former boss would object to how it was used. He found the word söze in his roommate's English-to-Turkish dictionary, which translates as \"talk too much\". All the characters' names are taken from staff members of the law firm at the time of his employment. McQuarrie had also worked for a detective agency, and this influenced the depiction of criminals and law enforcement officials in the script.\r\nSinger described the film as Double Indemnity meets Rashomon, and said that it was made \"so you can go back and see all sorts of things you didn't realize were there the first time. You can get it a second time in a way you never could have the first time around.\" He also compared the film's structure to Citizen Kane (which also contained an interrogator and a subject who is telling a story) and the criminal caper The Anderson Tapes.\r\nPre-production\r\nMcQuarrie wrote nine drafts of his screenplay over five months, until Singer felt that it was ready to shop around to the studios. None were interested except for a European financing company. McQuarrie and Singer had a difficult time getting the film made because of the non-linear story, the large amount of dialogue and the lack of cast attached to the project. Financiers wanted established stars, and offers for the small role of Redfoot (the L.A. fence who hooks up the five protagonists with Kobayashi) went out to Christopher Walken, Tommy Lee Jones, Jeff Bridges, Charlie Sheen, James Spader, Al Pacino, and Johnny Cash. However, the European money allowed the film's producers to make offers to actors and assemble a cast. They were able to offer the actors only salaries that were well below their usual pay, but they agreed because of the quality of McQuarrie's script and the chance to work with one another. That money fell through, and Singer used the script and the cast to attract PolyGram to pick up the film negative.\r\nAbout casting, Singer said, \"You pick people not for what they are, but what you imagine they can turn into.\" To research his role, Spacey met doctors and experts on cerebral palsy and talked with Singer about how it would fit dramatically in the film. They decided that it would affect only one side of his body. According to Byrne, the cast bonded quickly during rehearsals. Del Toro worked with Alan Shaterian to develop Fenster's distinctive, almost unintelligible speech patterns. According to the actor, the source of his character's unusual speech patterns came from the realization that \"the purpose of my character was to die.\" Del Toro told Singer, \"It really doesn't matter what I say, so I can go really far out with this and really make it uncomprehensible.\"\r\nFilming\r\nThe budget was set at $5.5 million, and the film was shot in 35 days in Los Angeles, San Pedro and New York City. Spacey said that they shot the interrogation scenes with Palminteri over a span of five to six days. These scenes were also shot before the rest of the film. The police lineup scene ran into scheduling conflicts because the actors kept blowing their lines. Screenwriter Christopher McQuarrie would feed the actors questions off-camera and they improvised their lines. When Stephen Baldwin gave his answer, he made the other actors break character. Byrne remembers that they were often laughing between takes and \"when they said, 'Action!', we'd barely be able to keep it together.\" Spacey also said that the hardest part was not laughing through takes, with Baldwin and Pollak being the worst culprits. Their goal was to get the usually serious Byrne to crack up. They spent all morning trying unsuccessfully to film the scene. At lunch, a frustrated Singer angrily scolded the five actors, but, when they resumed, the cast continued to laugh through each take. Byrne remembers, \"Finally, Bryan just used one of the takes where we couldn't stay serious.\" Singer and editor John Ottman used a combination of takes and kept the humor in to show the characters bonding with one another.\r\nWhile Del Toro told Singer how he was going to portray Fenster, he did not tell his cast members, and in their first scene together none of them understood what Del Toro was saying. Byrne confronted Singer and the director told him that for the lockup scene, \"If you don't understand what he's saying maybe it's time we let the audience know that they don't need to know what he's saying.\" This led to the inclusion of Kevin Pollak's improvised line, \"What did you say?\"\r\nThe stolen emeralds were real gemstones on loan for the film.\r\nSinger spent an 18-hour day shooting the underground parking garage robbery. According to Byrne, by the next day Singer still did not have all of the footage that he wanted, and refused to stop filming in spite of the bonding company's threat to shut down the production.\r\nIn the scene in which the crew meets Redfoot after the botched drug deal, Redfoot flicks his cigarette at McManus' face. The scene was originally to have Redfoot flick the cigarette at McManus's chest, but the actor missed and hit Baldwin's face by accident. Baldwin's reaction is genuine.\r\nDespite enclosed practical locations and a short shooting schedule, cinematographer Newton Thomas Sigel \"developed a way of shooting dialogue scenes with a combination of slow, creeping zooms and dolly moves that ended in tight close-ups,\" to add subtle energy to scenes. \"This style combined dolly movement with \"imperceptible zooms\" so that you'd always have a sense of motion in a limited space.\"\r\nIn December 2017, amid several sexual misconduct allegations against Spacey, Byrne said that, at one point during shooting, production was shut down for two days because Spacey made unwanted sexual advances toward a younger actor. Singer, who has himself been accused of sexual misconduct against minors, has denied that Spacey behaved inappropriately on the set of the film. However, Kevin Pollak, in a 2018 episode of his podcast Kevin Pollak's Chat Show, told another version of the story involving Spacey engaging in sexual acts with Singer's young French boyfriend with only several days left in the production, which disrupted filming and led to a bitter ruination of their relationship.\r\nPost-production\r\nDuring the editing phase, Singer thought that they had completed the film two weeks early, but woke up one morning and realized that they needed that time to put together a sequence that convinced the audience that Dean Keaton was Söze — and then do the same for Verbal Kint because the film did not have \"the punch that Chris had written so beautifully.\" According to Ottman, he assembled the footage as a montage but it still did not work until he added an overlapping voice-over montage featuring key dialogue from several characters and had it relate to the images. Early on, executives at Gramercy had problems pronouncing the name Keyser Söze and were worried that audiences would have the same problem. The studio decided to promote the character's name. Two weeks before the film debuted in theaters, \"Who is Keyser Söze?\" posters appeared at bus stops, and TV spots told people how to say the character's name. Despite these efforts, all the actors in the film consistently mispronounce his name as \"Soze\" instead of \"Söze\".\r\nSinger wanted the music for the boat heist to resemble Tchaikovsky's Piano Concerto No. 1. The ending's music was based on a k.d. lang song.\r\nRelease\r\nGramercy ran a pre-release promotion and advertising campaign before The Usual Suspects opened in the summer of 1995. Word of mouth marketing was used to advertise the film, and buses and billboards were plastered with the simple question, \"Who is Keyser Söze?\"\r\nThe film was shown out of competition at the 1995 Cannes Film Festival and was well received by audiences and critics. The film was then given an exclusive run in Los Angeles, where it took a combined $83,513, and New York City, where it made $132,294 on three screens in its opening weekend. The film was then released in 42 theaters where it earned $645,363 on its opening weekend. It averaged a strong $4,181 per screen at 517 theaters and the following week added 300 locations. It eventually made $23.3 million in the United States and Canada. It grossed $43.6 million internationally for a worldwide total of $66.9 million.\r\nReception\r\nOn Rotten Tomatoes, the film has received a rating of 88%, based on 81 reviews, with an average rating of 7.80/10. The site's consensus reads, \"Expertly shot and edited, The Usual Suspects gives the audience a simple plot and then piles on layers of deceit, twists, and violence before pulling out the rug from underneath.\" On Metacritic, the film has a score of 77 out of 100, based on 22 reviews, indicating \"generally favorable reviews\".\r\nRoger Ebert, in a review for the Chicago Sun-Times, gave the film one and a half stars out of four, writing that it was confusing and uninteresting: \"To the degree that I do understand, I don't care.\" He also included the film in his \"most hated films\" list. USA Today rated the film two and a half stars out of four, calling it \"one of the most densely plotted mysteries in memory—though paradoxically, four-fifths of it is way too easy to predict.\"\r\nRolling Stone praised Spacey, saying his \"balls-out brilliant performance is Oscar bait all the way.\" In his review for The Washington Post, Hal Hinson wrote, \"Ultimately, The Usual Suspects may be too clever for its own good. The twist at the end is a corker, but crucial questions remain unanswered. What's interesting, though, is how little this intrudes on our enjoyment. After the movie you're still trying to connect the dots and make it all fit—and these days, how often can we say that?\"\r\nIn her review for The New York Times, Janet Maslin praised the performances of the cast: \"Mr. Singer has assembled a fine ensemble cast of actors who can parry such lines, and whose performances mesh effortlessly despite their exaggerated differences in demeanor ... Without the violence or obvious bravado of Reservoir Dogs, these performers still create strong and fascinatingly ambiguous characters.\" The Independent praised the film's ending: \"The film's coup de grace is as elegant as it is unexpected. The whole movie plays back in your mind in perfect clarity—and turns out to be a completely different movie to the one you've been watching (rather better, in fact).\"\r\nAccolades\r\nAt the 68th Academy Awards, Kevin Spacey won the Academy Award for Best Supporting Actor and Christopher McQuarrie won the Academy Award for Best Original Screenplay. In his acceptance speech, Spacey said, \"Well, whoever Keyser Söze is, I can tell you he's gonna get gloriously drunk tonight.\"\r\nLegacy\r\nOn June 17, 2008, the American Film Institute revealed its \"AFI's 10 Top 10\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. The Usual Suspects was acknowledged as the tenth-best mystery film. Verbal Kint was voted the #48 villain in \"AFI's 100 Years...100 Heroes and Villains\" in June 2003.\r\nEntertainment Weekly cited the film as one of the \"13 must-see heist movies\". Empire ranked Keyser Söze #69 in their \"The 100 Greatest Movie Characters\" poll. In August 2016, James Charisma of Paste ranked The Usual Suspects among Kevin Spacey's greatest film performances.\r\nIn 2013, the Writers Guild of America ranked the screenplay #35 on its list of 101 Greatest Screenplays ever written.\r\nRemake\r\nIn India, a critically panned Hindi-language adaptation of The Usual Suspects, titled Chocolate, was released in 2005.",
    "html": "<p>The Usual Suspects is a 1995 neo-noir mystery film directed by Bryan Singer and written by Christopher McQuarrie. It stars Stephen Baldwin, Gabriel Byrne, Benicio del Toro, Kevin Pollak, Chazz Palminteri, Pete Postlethwaite, and Kevin Spacey.</p><p>The plot follows the interrogation of Roger \"Verbal\" Kint, a small-time con man, who is one of only two survivors of a massacre and fire on a ship docked at the Port of Los Angeles. Through flashback and narration, Kint tells an interrogator a convoluted story of events that led him and his criminal companions to the boat, and of a mysterious crime lord—known as Keyser Söze—who controlled them. The film was shot on a $6 million budget and began as a title taken from a column in Spy magazine called The Usual Suspects, after one of Claude Rains' most memorable lines in the classic film Casablanca, and Singer thought that it would make a good title for a film.</p><p>The film was shown out of competition at the 1995 Cannes Film Festival and then initially released in a few theaters. It received favorable reviews and was eventually given a wider release. The praise was towards the mystery elements, the screenplay, the plot twist and Spacey's performance. McQuarrie won the Academy Award for Best Original Screenplay and Spacey won the Academy Award for Best Supporting Actor for his performance. The Writers Guild of America ranked the film as having the 35th greatest screenplay of all time.</p><br/><h3>Plot</h3><p>Career criminal Dean Keaton (Byrne) lies badly wounded on a ship docked in San Pedro Bay. He is confronted by a mysterious figure he calls \"Keyser,\" who shoots him dead and sets fire to the ship. The next day, the police recover 27 bodies and only two survivors: Arkosh Kovash (\"Ákos Kovács\"), a Hungarian mobster hospitalized with severe burns, and Roger \"Verbal\" Kint, a physically disabled con artist. U.S. Customs agent Dave Kujan flies to Los Angeles from New York City to interrogate Verbal. The men are left alone in a borrowed office belonging to LAPD police sergeant Jeff Rabin while FBI agent Jack Baer visits a hospitalized Kovash. The events that led Keaton, Verbal, and their associates onto the ship are then described by Verbal via flashback.</p><p>Six weeks earlier in New York City, Keaton and Verbal are arrested alongside fellow criminals Michael McManus, Fred Fenster, and Todd Hockney and placed in a police lineup as suspects in a truck hijacking that none of them admits to participating in. Believing the police were unfairly harassing them, McManus proposes they pull a heist to get revenge on the NYPD. Trying to go straight, Keaton initially refuses but eventually agrees to help rob a jewel smuggler being escorted by corrupt cops, netting millions in emeralds, getting over fifty cops arrested after leaking their activities to the press. They then go to California to fence the jewels through a man named Redfoot, who connects them with another jewel heist, but it goes badly and the contents are instead revealed to be China White (synthetic heroin). The men learn that the job was arranged by a lawyer named Kobayashi, who says he arranged for their arrests in New York and that his employer, mysterious Turkish crime lord Keyser Söze, from whom each of the men has unwittingly stolen, has ordered them to raid a ship holding Argentinian drug dealers and destroy $91 million worth of cocaine being sold on board. The cash brought for the exchange will be their reward.</p><p>During Kujan's interrogation, he learns that there was no cocaine on the ship, and Söze was seen onboard. At the hospital, Baer learns that Kovács has seen Söze and has a sketch artist begin making a picture. Verbal then tells Kujan a legend about Söze: he was a small-time drug runner who murdered his own family when they were being held hostage by Hungarian mobsters, then massacred the mobsters and their families before disappearing, and from then on conducted business only indirectly through underlings who are mostly unfamiliar with their true employer. Söze thus became a fearsome urban legend, \"a spook story that criminals tell their kids at night.\"</p><p>Concluding his story, Verbal reveals that Fenster was killed after trying to flee; the men then threatened Kobayashi, only to accept the assignment when he threatened their loved ones. The men attacked the ship during the night, killing several Argentinian and Hungarian gangsters before discovering that there was no cocaine. An unseen assailant killed Hockney, McManus, Keaton, and a prisoner in one of the ship's cabins. The mysterious figure then set fire to the ship as Verbal looked on from a hiding place on the dock.</p><p>Kujan deduces that Keaton must be Söze, as the prisoner killed on the ship was Arturo Marquez, a smuggler who escaped prosecution by claiming that he could identify Söze. Marquez was represented by lawyer Edie Finneran, Keaton's girlfriend, who was recently murdered. Kujan claims that the Argentinians took Marquez to sell him to Söze's Hungarian rivals. Keaton then used the assault so that he could kill Marquez personally and fake his own death. Verbal finally confesses that Keaton had been behind everything, but refuses to testify in court. Verbal's bail is posted, and he is released.</p><p>Moments later, Kujan realizes Verbal apparently fabricated his entire story by piecing together details from random items in Rabin's cluttered office. Verbal walks outside, gradually losing his limp and flexing his supposedly disabled hand. As Kujan pursues Verbal, a fax arrives at the police station with the artist's facial composite of Söze. The picture resembles Verbal, revealing that he was Söze the entire time. Verbal/Söze enters a car driven by \"Kobayashi\" and leaves, moments before Kujan arrives on the scene.</p><br/><h3>Cast</h3><ul><li>Kevin Spacey as Roger \"Verbal\" Kint / Keyser Söze</li></ul><ul><li>Gabriel Byrne as Dean Keaton:</li></ul><ul><li>Chazz Palminteri as Agent Dave Kujan:</li></ul><ul><li>Stephen Baldwin as Michael McManus:</li></ul><ul><li>Benicio del Toro as Fred Fenster:</li></ul><ul><li>Kevin Pollak as Todd Hockney:</li></ul><ul><li>Pete Postlethwaite as Kobayashi</li><li>Suzy Amis as Edie Finneran</li><li>Giancarlo Esposito as FBI Agent Jack Baer</li><li>Dan Hedaya as Sergeant Jeff Rabin</li><li>Cástulo Guerra as Arturo Marquez</li><li>Peter Greene as Redfoot (uncredited)</li><li>Scott B. Morgan as Keyser Söze (in flashbacks) (uncredited)</li></ul><br/><h3>Production</h3><h4>Origins</h4><p>Bryan Singer met Kevin Spacey at a party after a screening of the young filmmaker's first film, Public Access, at the 1993 Sundance Film Festival, where it won the Grand Jury Prize. Spacey had been encouraged by a number of people he knew who had seen it, and was so impressed that he told Singer and his screenwriting partner Christopher McQuarrie, that he wanted to be in whatever film they did next. Singer read a column in Spy magazine called \"The Usual Suspects\" after Claude Rains' line in Casablanca. Singer thought that it would be a good title for a film. When asked by a reporter at Sundance what their next film was about, McQuarrie replied, \"I guess it's about a bunch of criminals who meet in a police line-up,\" which incidentally was the first visual idea that he and Singer had for the poster: \"five guys who meet in a line-up,\" Singer remembers. The director also envisioned a tagline for the poster, \"All of you can go to Hell.\" Singer then asked the question, \"What would possibly bring these five felons together in one line-up?\" McQuarrie revamped an idea from one of his own unpublished screenplays — the story of a man who murders his own family and disappears. The writer mixed this with the idea of a team of criminals.</p><p>Söze's character is based on John List, a New Jersey accountant who murdered his family in 1971 and then disappeared for almost two decades, assuming a new identity before he was ultimately apprehended. McQuarrie based the name of Keyser Söze on one of his previous supervisors, Kayser Sume, at a Los Angeles law firm where he worked, but decided to change the last name because he thought that his former boss would object to how it was used. He found the word söze in his roommate's English-to-Turkish dictionary, which translates as \"talk too much\". All the characters' names are taken from staff members of the law firm at the time of his employment. McQuarrie had also worked for a detective agency, and this influenced the depiction of criminals and law enforcement officials in the script.</p><p>Singer described the film as Double Indemnity meets Rashomon, and said that it was made \"so you can go back and see all sorts of things you didn't realize were there the first time. You can get it a second time in a way you never could have the first time around.\" He also compared the film's structure to Citizen Kane (which also contained an interrogator and a subject who is telling a story) and the criminal caper The Anderson Tapes.</p><h4>Pre-production</h4><p>McQuarrie wrote nine drafts of his screenplay over five months, until Singer felt that it was ready to shop around to the studios. None were interested except for a European financing company. McQuarrie and Singer had a difficult time getting the film made because of the non-linear story, the large amount of dialogue and the lack of cast attached to the project. Financiers wanted established stars, and offers for the small role of Redfoot (the L.A. fence who hooks up the five protagonists with Kobayashi) went out to Christopher Walken, Tommy Lee Jones, Jeff Bridges, Charlie Sheen, James Spader, Al Pacino, and Johnny Cash. However, the European money allowed the film's producers to make offers to actors and assemble a cast. They were able to offer the actors only salaries that were well below their usual pay, but they agreed because of the quality of McQuarrie's script and the chance to work with one another. That money fell through, and Singer used the script and the cast to attract PolyGram to pick up the film negative.</p><p>About casting, Singer said, \"You pick people not for what they are, but what you imagine they can turn into.\" To research his role, Spacey met doctors and experts on cerebral palsy and talked with Singer about how it would fit dramatically in the film. They decided that it would affect only one side of his body. According to Byrne, the cast bonded quickly during rehearsals. Del Toro worked with Alan Shaterian to develop Fenster's distinctive, almost unintelligible speech patterns. According to the actor, the source of his character's unusual speech patterns came from the realization that \"the purpose of my character was to die.\" Del Toro told Singer, \"It really doesn't matter what I say, so I can go really far out with this and really make it uncomprehensible.\"</p><h4>Filming</h4><p>The budget was set at $5.5 million, and the film was shot in 35 days in Los Angeles, San Pedro and New York City. Spacey said that they shot the interrogation scenes with Palminteri over a span of five to six days. These scenes were also shot before the rest of the film. The police lineup scene ran into scheduling conflicts because the actors kept blowing their lines. Screenwriter Christopher McQuarrie would feed the actors questions off-camera and they improvised their lines. When Stephen Baldwin gave his answer, he made the other actors break character. Byrne remembers that they were often laughing between takes and \"when they said, 'Action!', we'd barely be able to keep it together.\" Spacey also said that the hardest part was not laughing through takes, with Baldwin and Pollak being the worst culprits. Their goal was to get the usually serious Byrne to crack up. They spent all morning trying unsuccessfully to film the scene. At lunch, a frustrated Singer angrily scolded the five actors, but, when they resumed, the cast continued to laugh through each take. Byrne remembers, \"Finally, Bryan just used one of the takes where we couldn't stay serious.\" Singer and editor John Ottman used a combination of takes and kept the humor in to show the characters bonding with one another.</p><p>While Del Toro told Singer how he was going to portray Fenster, he did not tell his cast members, and in their first scene together none of them understood what Del Toro was saying. Byrne confronted Singer and the director told him that for the lockup scene, \"If you don't understand what he's saying maybe it's time we let the audience know that they don't need to know what he's saying.\" This led to the inclusion of Kevin Pollak's improvised line, \"What did you say?\"</p><p>The stolen emeralds were real gemstones on loan for the film.</p><p>Singer spent an 18-hour day shooting the underground parking garage robbery. According to Byrne, by the next day Singer still did not have all of the footage that he wanted, and refused to stop filming in spite of the bonding company's threat to shut down the production.</p><p>In the scene in which the crew meets Redfoot after the botched drug deal, Redfoot flicks his cigarette at McManus' face. The scene was originally to have Redfoot flick the cigarette at McManus's chest, but the actor missed and hit Baldwin's face by accident. Baldwin's reaction is genuine.</p><p>Despite enclosed practical locations and a short shooting schedule, cinematographer Newton Thomas Sigel \"developed a way of shooting dialogue scenes with a combination of slow, creeping zooms and dolly moves that ended in tight close-ups,\" to add subtle energy to scenes. \"This style combined dolly movement with \"imperceptible zooms\" so that you'd always have a sense of motion in a limited space.\"</p><p>In December 2017, amid several sexual misconduct allegations against Spacey, Byrne said that, at one point during shooting, production was shut down for two days because Spacey made unwanted sexual advances toward a younger actor. Singer, who has himself been accused of sexual misconduct against minors, has denied that Spacey behaved inappropriately on the set of the film. However, Kevin Pollak, in a 2018 episode of his podcast Kevin Pollak's Chat Show, told another version of the story involving Spacey engaging in sexual acts with Singer's young French boyfriend with only several days left in the production, which disrupted filming and led to a bitter ruination of their relationship.</p><h4>Post-production</h4><p>During the editing phase, Singer thought that they had completed the film two weeks early, but woke up one morning and realized that they needed that time to put together a sequence that convinced the audience that Dean Keaton was Söze — and then do the same for Verbal Kint because the film did not have \"the punch that Chris had written so beautifully.\" According to Ottman, he assembled the footage as a montage but it still did not work until he added an overlapping voice-over montage featuring key dialogue from several characters and had it relate to the images. Early on, executives at Gramercy had problems pronouncing the name Keyser Söze and were worried that audiences would have the same problem. The studio decided to promote the character's name. Two weeks before the film debuted in theaters, \"Who is Keyser Söze?\" posters appeared at bus stops, and TV spots told people how to say the character's name. Despite these efforts, all the actors in the film consistently mispronounce his name as \"Soze\" instead of \"Söze\".</p><p>Singer wanted the music for the boat heist to resemble Tchaikovsky's Piano Concerto No. 1. The ending's music was based on a k.d. lang song.</p><br/><h3>Release</h3><p>Gramercy ran a pre-release promotion and advertising campaign before The Usual Suspects opened in the summer of 1995. Word of mouth marketing was used to advertise the film, and buses and billboards were plastered with the simple question, \"Who is Keyser Söze?\"</p><p>The film was shown out of competition at the 1995 Cannes Film Festival and was well received by audiences and critics. The film was then given an exclusive run in Los Angeles, where it took a combined $83,513, and New York City, where it made $132,294 on three screens in its opening weekend. The film was then released in 42 theaters where it earned $645,363 on its opening weekend. It averaged a strong $4,181 per screen at 517 theaters and the following week added 300 locations. It eventually made $23.3 million in the United States and Canada. It grossed $43.6 million internationally for a worldwide total of $66.9 million.</p><br/><h3>Reception</h3><p>On Rotten Tomatoes, the film has received a rating of 88%, based on 81 reviews, with an average rating of 7.80/10. The site's consensus reads, \"Expertly shot and edited, The Usual Suspects gives the audience a simple plot and then piles on layers of deceit, twists, and violence before pulling out the rug from underneath.\" On Metacritic, the film has a score of 77 out of 100, based on 22 reviews, indicating \"generally favorable reviews\".</p><p>Roger Ebert, in a review for the Chicago Sun-Times, gave the film one and a half stars out of four, writing that it was confusing and uninteresting: \"To the degree that I do understand, I don't care.\" He also included the film in his \"most hated films\" list. USA Today rated the film two and a half stars out of four, calling it \"one of the most densely plotted mysteries in memory—though paradoxically, four-fifths of it is way too easy to predict.\"</p><p>Rolling Stone praised Spacey, saying his \"balls-out brilliant performance is Oscar bait all the way.\" In his review for The Washington Post, Hal Hinson wrote, \"Ultimately, The Usual Suspects may be too clever for its own good. The twist at the end is a corker, but crucial questions remain unanswered. What's interesting, though, is how little this intrudes on our enjoyment. After the movie you're still trying to connect the dots and make it all fit—and these days, how often can we say that?\"</p><p>In her review for The New York Times, Janet Maslin praised the performances of the cast: \"Mr. Singer has assembled a fine ensemble cast of actors who can parry such lines, and whose performances mesh effortlessly despite their exaggerated differences in demeanor ... Without the violence or obvious bravado of Reservoir Dogs, these performers still create strong and fascinatingly ambiguous characters.\" The Independent praised the film's ending: \"The film's coup de grace is as elegant as it is unexpected. The whole movie plays back in your mind in perfect clarity—and turns out to be a completely different movie to the one you've been watching (rather better, in fact).\"</p><h4>Accolades</h4><p>At the 68th Academy Awards, Kevin Spacey won the Academy Award for Best Supporting Actor and Christopher McQuarrie won the Academy Award for Best Original Screenplay. In his acceptance speech, Spacey said, \"Well, whoever Keyser Söze is, I can tell you he's gonna get gloriously drunk tonight.\"</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Association</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient</th><th scope=\"col\">Result</th></tr><tr><td rowspan=\"3\">20/20 Awards</td><td>Best Supporting Actor</td><td><span>Kevin Spacey</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Original Screenplay</td><td><span>Christopher McQuarrie</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Film Editing</td><td><span>John Ottman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Academy Awards</span></td><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Written Directly for the Screen</span></td><td>Christopher McQuarrie</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>John Ottman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Artios Awards</span></td><td><span>Outstanding Achievement in Feature Film Casting – Drama</span></td><td>Francine Maisler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\">Awards Circuit Community Awards</td><td>Best Motion Picture</td><td><span>Bryan Singer</span> and Michael McDonnell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actor in a Supporting Role</td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Original Screenplay</td><td>Christopher McQuarrie</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Film Editing</td><td>John Ottman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td colspan=\"2\">Best Cast Ensemble</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Boston Society of Film Critics Awards</span></td><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td>Bryan Singer and Michael McDonnell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Christopher McQuarrie</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Editing</span></td><td>John Ottman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Chicago Film Critics Association Awards</span></td><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Christopher McQuarrie</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Most Promising Actor</td><td><span>Benicio del Toro</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Chlotrudis Awards</span></td><td>Best Supporting Actor</td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>César Awards</span></td><td colspan=\"2\"><span>Best Foreign Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Critics' Choice Awards</span></td><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Dallas-Fort Worth Film Critics Association Awards</span></td><td colspan=\"2\"><span>Best Picture</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td rowspan=\"2\">Christopher McQuarrie</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Edgar Allan Poe Awards</span></td><td><span>Best Motion Picture</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Empire Awards</span></td><td><span>Best Debut</span></td><td>Bryan Singer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Golden Globe Awards</span></td><td><span>Best Supporting Actor – Motion Picture</span></td><td>Kevin Spacey</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Independent Spirit Awards</span></td><td><span>Best Supporting Male</span></td><td>Benicio del Toro</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Christopher McQuarrie</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Newton Thomas Sigel</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Kinema Junpo Awards</span></td><td>Best Foreign Language Film</td><td>Bryan Singer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Los Angeles Film Critics Association Awards</span></td><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td rowspan=\"3\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top 10 Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">10th Place</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\"><span>Best Cast</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Society of Film Critics Awards</span></td><td><span>Best Supporting Actor</span></td><td rowspan=\"2\">Kevin Spacey</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td><span>New York Film Critics Circle Awards</span></td><td><span>Best Supporting Actor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Best Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Sant Jordi Awards</span></td><td>Best Foreign Actor</td><td><span>Chazz Palminteri</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Sarajevo Film Festival</span></td><td>Audience Award for Best Feature Film</td><td>Bryan Singer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Saturn Awards</span></td><td colspan=\"2\"><span>Best Action/Adventure Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Bryan Singer</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Music</span></td><td>John Ottman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Supporting Role</span></td><td>Kevin Spacey</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Seattle International Film Festival</span></td><td>Best Director</td><td>Bryan Singer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor</td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>Society of Texas Film Critics Awards</span></td><td colspan=\"2\">Best Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Director</td><td>Bryan Singer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actor</td><td>Kevin Spacey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Original Screenplay</td><td>Christopher McQuarrie</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Southeastern Film Critics Association Awards</td><td colspan=\"2\">Best Picture</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">8th Place</td></tr><tr><td><span>Tokyo International Film Festival</span></td><td>Silver Award</td><td>Bryan Singer</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Turkish Film Critics Association Awards</span></td><td colspan=\"2\">Best Foreign Film</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td></tr></tbody></table><h4>Legacy</h4><p>On June 17, 2008, the American Film Institute revealed its \"AFI's 10 Top 10\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. The Usual Suspects was acknowledged as the tenth-best mystery film. Verbal Kint was voted the #48 villain in \"AFI's 100 Years...100 Heroes and Villains\" in June 2003.</p><p>Entertainment Weekly cited the film as one of the \"13 must-see heist movies\". Empire ranked Keyser Söze #69 in their \"The 100 Greatest Movie Characters\" poll. In August 2016, James Charisma of Paste ranked The Usual Suspects among Kevin Spacey's greatest film performances.</p><p>In 2013, the Writers Guild of America ranked the screenplay #35 on its list of 101 Greatest Screenplays ever written.</p><br/><h3>Remake</h3><p>In India, a critically panned Hindi-language adaptation of The Usual Suspects, titled Chocolate, was released in 2005.</p><br/>"
  },
  "errorMessage": ""
}