{
  "imDbId": "tt0091763",
  "title": "Platoon",
  "fullTitle": "Platoon (1986)",
  "type": "Movie",
  "year": "1986",
  "items": [
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2913187",
      "warningSpoilers": false,
      "date": "28 November 2013",
      "rate": "9",
      "helpful": "33 out of 35 found this helpful.",
      "title": "The quintessential Vietnam war movie",
      "content": "It's September 1967, and Chris (Charlie Sheen) has just arrived in Vietnam. He is sheltered and his father and grandfather fought in the military. As the new guy, nobody cares to be his friend. Lt. Wolfe (Mark Moses) is a weak ineffective leader. His men are divided in two. Some are followers of the cruel Sgt. Barnes (Tom Berenger). Others are followers of the humane Sgt. Elias (Willem Dafoe). In the end, Barnes and Elias are in a struggle for Chris' soul.This is the quintessential Vietnam war movie. Oliver Stone has recreated the jungle combat and placed a morality tale in the middle of it. It is possibly Charlie Sheen's greatest performance. His innocence at the beginning evolves into a grizzled veteran fighter. The combat is so realistic, and the story is so compelling. It is a must see for all movie goers."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3335507",
      "warningSpoilers": false,
      "date": "14 October 2015",
      "rate": "10",
      "helpful": "136 out of 159 found this helpful.",
      "title": "A Realistic Vietnam film Oliver's Stone's masterpiece",
      "content": "Platoon is a 1986 American war film written and directed by Oliver Stone one of the most strongest realistic anti war films of all time. It is one of the best Vietnam war films I have ever seen that won the Academy Award for Best Picture of 1986 and best Director for Oliver Stone, as well as Best Sound Mixing and Best Film Editing. Stone's Vietnam film portrayed a real life human been on his point of view of the story telling that went on in his real life that he experienced after his tour of duty in Vietnam ended in 1968, Oliver Stone wrote a screenplay called Break: a semi-autobiographical account detailing his experiences and the life he was in Vietnam. The characters were portrayed more then a few soldiers they were portrayed more as a human been than been soldiers obeying an order.Platoon shows the Vietnam War was a big mistake, but being a fictional documentary on Vietnam is far from its purpose. It is one of my personal favorite war movies. I love this movie to death. Those of us who did make it have an obligation to build again, to teach to others what we know, and to try with what's left of our lives to find a goodness and meaning in this life. In Platoon, Chris Taylor (Charlie Sheen) is a young, naive U.S. soldier who, upon his arrival to Vietnam, quickly discovers that he must do battle not only with the Viet Cong, but also with the gnawing fear, physical exhaustion and intense anger growing within him. While his two commanding officers draw a fine line between the war they wage against the enemy and the one they fight with each other, the conflict, chaos and hatred permeate Taylor, suffocating his realities and numbing his feelings to man's highest value... life.Chris sees his platoon fragmented into two halves, each aligned with one of two men -- Sgt. Elias (Willem Dafoe) and Sgt. Barnes (Tom Berenger). Those two soldiers are really two positive good things to see in the film because it sets the viewer on the seat of the edge. They both have nominally the same enemy (Viet Cong), but, really, it doesn't take long to realize that Elias is Good, and Barnes is Evil (the \"enemy\" does not enter into the moral equation of this film, at all it's an outside threat, same as malaria-carrying mosquitoes or even friendly fire). Elias feels the futility of the war and has respect for life; Barnes fights the war doggedly and has no compassion, period. Both are efficient soldiers fighting the same enemy, but really as is at one point aptly put by Chris Taylor himself,they are fighting for the souls of the platoon members, as the outcome of the war is never really in doubt.The platoon reaches the village, where a food and weapons cache is discovered. While questioning the village chief, Barnes loses his patience and senselessly kills the man's wife despite his denials that they are aiding the Viet Cong. Barnes is about to murder the man's young daughter to force him to tell them to where the enemy is. Elias doesn't take kindly to this kind of behavior. Elias and Barnes come closer and closer to open conflict, as Taylor becomes a veteran, obviously siding with Elias. Meanwhile, the fate of the platoon comes closer and closer to them, culminating in an explosively shot action conclusion. The end is dark, but morally satisfying.Platoon is a legendary film. A film that I will always cherish, and a film that I will never get tired of. And the last Vietnam film worth a damn to watch. There isn't any War film today that was filmed as really human drama war today in 2015. It respectively represents the very essence of purposefully haunting powerful cinematography in the history.-- It is representing admirable cinematic craftsmanship and storytelling. A film that is sometimes impossible to watch for its frighteningly intense and emotionally draining account of the Vietnam War as it is waged both on the battlefields and within the very souls of men.The best real human drama portrayed on screen anti-war film in Vietnam from the 80's, It is my favorite film that I will always love to death to see. I also don't watch this film for an action ; I actually see it for the war and how it everything was, what is more valuable and it is life: The film also have a message in it. The actors portraying the characters did make a believable performance as the real team of squad soldier fighting the Enemy the Viet Cong.The battles with Viet-Cong are shown realistic mostly on the end of the final battle. 10/10"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0236439",
      "warningSpoilers": false,
      "date": "3 July 2002",
      "rate": "",
      "helpful": "137 out of 175 found this helpful.",
      "title": "Uncomfortable but very worthy view of war's impact on the young",
      "content": "At the height of the Vietnam War, America's teens are drafted into the war effort to find themselves in the middle of hell. One such young man is Chris Taylor. He is placed in a squadron where two sergeants have different approaches to the war  Elias is more about surviving without being brutal or cruel, whereas Barnes is crueller, more ruthless and more violent. During the course of his term, Taylor's very soul is torn between the two men as he deals with what he must do.The first film in Oliver Stone's unofficial trilogy is arguably the best of the three. The basic story not only shows us what the war was like for those serving but also how the different personalities come out of those involved in it. As we follow Taylor we see him change as he is influenced by those around him and by his situation. It makes for an uncomfortable film but one that's worth watching. It's certainly a better war movie than things like Wild Geese or The Dirty Dozen, simply because it's a little more real to what happens than those ones.Charlie Sheen has never been better than when he's acting for Stone. Here he gives one of his best ever performances as the innocent who is changed. Willem Dafoe is a great actor and here is no different  he also gives us one of the film's most enduring images so I'm a little biased. Berenger is another one for whom it's hard to think of a higher point reached than when he did this film. He is brutal and ruthless but he makes us support him in a strange way. The support cast are all good and contains a few famous faces (John C McGinley, Whitaker, Depp) however this is really a three man show.Overall this is brutal and violent with no happy ending. At the end of the day isn't that what a war film should be?"
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0236513",
      "warningSpoilers": false,
      "date": "3 September 2003",
      "rate": "9",
      "helpful": "200 out of 268 found this helpful.",
      "title": "One Of The Best Movies Of The 1980s",
      "content": "The 1980s in general and the mid 1980s in particular aren't highly regarded where pop culture is concerned , this is most especially true in cinema where films seemed to be written around their soundtrack in much the same way as Hollywood movies nowadays seem to be written around their special effects . PLATOON is one of the very few films from that period that has an emotional impact , an impact that it still retains while watching it in 2003. Everyone else seems to have mentioned what makes PLATOON a classic anti-war ( Note it's anti-war , not anti American or anti soldier ) movie along with being a classic movie , so I won't go over old ground except to say THAT death scene is up there with all the other tear jerking scenes from 20th century cinema , don't be ashamed to say you cried If PLATOON has a flaw it's in its duality , there's the good Sarge/bad Sarge , good officer/bad officer , good white guy/bad white guy , good black guy/bad black boy etc which is maybe a bit clichéd and possibly leads me to believe Stone is making an excuse/reason that the Americans lost in Vietnam because that spent so much fighting each other rather than the VC ( Though I do concede I'm possibly misinterpreting that as an excuse or even a reason since no one will confuse the politics of Stone with the politics of John Wayne ) while Taylor's character comes across as being more of a literary device rather than a real human being , but these are minor flawsIt's a shame to see war films from the last few years devoid of scathing anti-war sentiments like the ones seen here . PLATOON screams at you \" War is hell and whatever the rights and wrongs of conflict you need a bloody good reason to wage war . Vietnam wasn't a good enough reason to sacrifice human lives \""
    },
    {
      "username": "gigan-92",
      "userUrl": "https://www.imdb.com/user/ur20916867",
      "reviewLink": "https://www.imdb.com/review/rw2363919",
      "warningSpoilers": true,
      "date": "4 January 2011",
      "rate": "10",
      "helpful": "50 out of 58 found this helpful.",
      "title": "\"When I﻿ die, bury me upside-down, so the world can kiss my ass\"",
      "content": "A+ Undoubtedly one of the best war films ever made, if not one of the THE best films of all time. Where to begin with such a film? A lot of this goes to Oliver Stone, who actually served in the God-forsaken jungles of Vietnam. The film really brings to light the atrocities and pointlessness of the Vietnam War full force, all cleverly represented by the soldiers who fought these not so courageous and valor-filled battles.The conflict is simple at a glance; Chris Taylor, played superbly by Charlie Sheen, is a young recruit who in a similar trait to the Civil War novel \"The Red Bade of Courage\" is naively eager to be a proud and loyal soldier fighting against Communism, as he believes, nobly. However, he soon finds that \"the 'Nam\" is nothing like he thought it would be. The Vietnam is portrayed as realistically as it will ever be here: as a chaotic, dark, and all to real nightmare. It is within this hell he realizes that there are only two ways to truly endure the war: Give into near animal instincts, discarding all morals and perspectives of decency or find ways to escape the war at least for short bursts. Taylor decides to choose the latter, but regardless the platoon is divided by these two choices, on one side being Barnes, who will let the war consume them completely. The other is Elias, who represents Taylor's last grasp to his humanity. Many choose one path and never turn away from it, despite the fact that many of these men will die regardless. The underlying conflict is how you spend those last remaining days, minutes, instances of life. And all along the Vietcong are just an outside force who the soldiers have no real chance of understanding or negotiating with , just one of the many hazards they will have to survive.Tom Berenger is endlessly great as Barnes, and Willem Dafoe is no less stunning. Every performance is stunning and captures the very real fear of war. Among the many other stand out performances in this picture are Kevin Dillon as the sadistic Bunny, John C. McGinley as Sgt. O'Neill, Francesco Quinn as Rhah, Johnny Depp as Lerner, Forest Whitaker as Big Harold and Keith David as the unforgettable King. And the coup de grace, an unforgettable and heartbreaking score by the late Georges Delerue and Samuel Barber, such beautiful and yet clearly pained music. \"Platoon\" will never cease to be my favorite war flick ever."
    },
    {
      "username": "tomgillespie2002",
      "userUrl": "https://www.imdb.com/user/ur3741220",
      "reviewLink": "https://www.imdb.com/review/rw3569861",
      "warningSpoilers": false,
      "date": "27 October 2016",
      "rate": "9",
      "helpful": "37 out of 44 found this helpful.",
      "title": "Still packs a punch 30 years on",
      "content": "Ever since Steven Spielberg wowed the cinematic world and changed the aesthetic of the war movie forever with the exceptional opening 25 minutes of 1998's Saving Private Ryan - the film went downhill from there - audiences have come to expect the same grainy camera-work and ultra-realism of Spielberg's breathtaking vision whenever a battle is depicted. Anything else would be 'unrealistic', and many movies dated horribly almost overnight as a result. While Oliver Stone's Platoon, which was once considered difficult to watch due to its unflinching depiction of the insanity of war, may not seem quite as brutal as it used to, it possesses one thing that no war other movie can boast - the guiding hand of a veteran.Stone did a tour in Vietnam which ended in 1968, changing the future writer/director forever. Starting out life as a screenplay focusing on a soldier's experiences both before and during the war which had Jim Morrison touted for the lead, it evolved into a movie focused solely on a young volunteer's time spent in the sweaty, eternally damp jungle. Charlie Sheen's Chris Taylor is an obvious stand-in for Stone, and he arrives fresh-faced and eager to fight for his country. By the end, he is dazed and confused, and angry at the country who would send such \"bottom of the barrel\" men - invisible in society - into a world of such horror and meaningless bloodshed. It's an experience that moulded Stone into the one of the most outspoken voices in cinema.The casting of the two sergeants vying for Chris' soul is a stroke of genius. The platoon is made up of two main groups - the 'juicers', a collection of beer-swilling meat-heads seemingly intent on violence at every opportunity, and the 'heads', a more laid-back and weary bunch who are happiest when getting high and having a singalong. At the head of the juicers is Sgt. Barnes, played by Tom Berenger, an actor known for his heart-throb leading-man roles but here cast as a dead-eyed, heavily scarred brute. While Willem Dafoe, who was and still is known for his crazy-eyed villainous roles, plays the wiser, gentler leader of the heads, an all-round good guy battling his own demons. By toying with expectations, Stone adds layers to their characters, and they both received Best Actor nominations for their efforts.Yet what makes Platoon truly stand out 30 years after its release is the way Stone manages to transport the audience to that terrible place. It's teeming with dangers at every turn, be it the ants, the snakes or the Viet Cong better equipped for the harsh surroundings, the most frightening moment is when they fall asleep. And even when they awake, there's something moving in the shadows. The film never allows you to ever be at ease, despite the fun to be had with spotting the many famous faces dotted throughout the supporting cast. There are flaws, especially with some overacting from some of the supporting cast - in particular John C. McGinley - and Chris' unnecessary, rambling narration, but the movie packs such a punch that it's easy to forget these quibbles. It's a true insight into the mind of a grunt and how combat can have a lasting, eye-opening effect on those on the ground, and undoubtedly one of the most important war pictures ever to come out of the US."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2188635",
      "warningSpoilers": true,
      "date": "9 January 2010",
      "rate": "10",
      "helpful": "22 out of 28 found this helpful.",
      "title": "Thoroughly unpleasant viewing...",
      "content": "This is a very, very hard film for me to review. I was too young to be in Vietnam (thank God) and I have no idea what the real Vietnam War was like. Was it like John Wayne's THE GREEN BERETS? I am sure it was not! But, was it like PLATOON? I just don't know. Did the soldiers in the war do drugs, kill civilians and run amok? Yes, but whether or not it was the norm (like it was shown in this film), I just can't say. Some Vietnam vets I've spoken with say this film is accurate, others say it over-emphasizes isolated incidents because it has an agenda. I just don't know, especially since director Oliver Stone does have problems, at least in some films, with fictionalizing events (such as in JFK and Alexander). Regardless, it is a very powerful film.Unlike FULL METAL JACKET, this Vietnam War film begins in Vietnam. The film opens with Barber's \"Adagio for Strings\" providing an appropriately somber and dirge-like musical introduction--newbie Charlie Sheen arrives as body bags are being loaded into a plane. This is the perfect music for the intro, though I must admit that later in the film it is overused just a bit--losing some of its impact.The film revolves around young Sheen and the men serving with him--soldiers on the front lines and in the middle of the action. Over time, the whole reason for them being their and their humanity all comes into question. This struggle is epitomized in the two sergeants. One, Tom Berenger, is a bit nuts. He's willing to break the rules, kill civilians and become an animal. The other, Willem Defoe, is an equally skilled soldier but cannot allow himself to give in to his darker side. This all comes to a head when Berenger and several others viciously kill several villagers--villagers who could easily have been completely innocent and certainly did not deserve this. When Defoe swears to file a report about this, you know that eventually there will be a serious confrontation between these two men. However, it's Sheen who eventually finds himself in the middle--and you are pretty sure that it will be him or Berenger that must die. Yet, there is STILL almost an hour left in the film! The final hour is one of the most harrowing in film history. It consists of one hellacious firefight after another--culminating in a battle along the Cambodian border that ultimately kills off most of the men in the platoon--and further dehumanizes the survivors. For sheer violence and terror, I can't think of another war film that can even come close. It's practically non-stop and will keep you on the edge of your seat.So what did I think about the film? Well, watching it was certainly among the most unpleasant experiences I have ever had! The extreme violence, the pointlessness, the horrible language and the drugs were all pretty awful and didn't make this a film for little kids, that's for sure! But, you certainly must admire it for the intensity and realism you lack in many films--traditional war films that make war seem fun or manly. You certainly can't watch this film enjoy it--and that really is a good thing when you think about it.So, for a film that shows war in all its awfulness, you can't find one quite like PLATOON. Once again, I can't attest to the voracity of the portrait of the war, but for a vision of what war can be like, it can't fail to have a huge emotional impact. My only quibble, and it is minor, is that Charlie Sheen seemed a tad young in his role--so much so that I had a hard time accepting him as a soldier among all these men."
    },
    {
      "username": "ASuiGeneris",
      "userUrl": "https://www.imdb.com/user/ur45959440",
      "reviewLink": "https://www.imdb.com/review/rw2902322",
      "warningSpoilers": true,
      "date": "10 November 2013",
      "rate": "8",
      "helpful": "15 out of 17 found this helpful.",
      "title": "An illuminating expose on the long-lasting, personality-changing effects of the military and war...",
      "content": "I don't usually like war movies, at all. Platoon was an unexpected exception. Oliver Stone's first of three Vietnam War films, for me it really came down to an educational expose of the psychological trauma unique to war. With an all-star ensemble cast, the performances were exceptional. From what I have read, this can be attributed to training from a retired Marines Captain as well as director Oliver Stone's personal history as a Vietnam soldier. I believe Platoon to be an accurate representation of war on a micro scale, but not a macro one- any and all of these events could have and probably did happen at some time during the war, but it is unlikely that this much could happen between such a small number of men in such a short amount of time. The protagonist is played by none other than a young Charlie Sheen at his prime. Taylor's words of wisdom throughout the film are a testament to the long lasting effects of war. Veterans have a stereotype personality: more often than not, someone more logical than emotional; a lover of order, rules, and regimen; individuals willing to sacrifice for the greater good; a cool, collected, logical decision maker and leader even under high-pressure circumstances. As with all stereotypes, it is rooted in truth. Studies have shown that individuals attracted to the military tend to, overall, be a little less agreeable, extroverted, and friendly than those who do not seek it out. One study in particular finds them to be \"more aggressive\", \"interested in competition rather than cooperation\", and \"less concerned about the feelings of others\". These particular personality traits, whereas obviously not so great for romantic relationships or for forming lasting friendships, are often an asset in career success. For example, these individuals are more likely to make the difficult decisions sometimes necessary for success. Psychologists claim that our personalities do not change dramatically over the course of our lifetime. Interestingly, the military is one of the only exceptions to this, as various research has shown. An exception, though, that couldn't be more understandable. After all, what one experience is more immersive, uncompromising, and invasive? A prominent aim of military training is to disseminate your preconceptions, views, and outlook of the \"outside\" world. They want to, literally, break you down and build you back up as a soldier. The aggression, the rules, the logical coolness of higher-ranking officials? Not only welcomed, but expected. If you cannot handle yourself under pressure, cannot brace yourself for both physical and emotional war, you will not survive training, let alone deployment. Ironic, then, isn't it, that once a soldier signs his/her contract, they are bound to their word for the next several years? What if he realizes he is too sensitive? She realizes she hasn't the strength, either emotionally and/or physically? At some point, it's just too damn bad. In this way, individuals are often forced into an extreme situation; unexpected, life-altering, and personality-changing. After the all-immersive experience of military training, an individual has had to harden themselves even more; close off their emotions in order to endure trying physical tests and emotional assault from all angles. And if they are chosen to actually go to war? Well, I am certain that the personality shift will only be that much more ingrained. Once they return home, it's easier said than done to just smoothly transition back to who they once were, how they once responded and reacted to life. And Taylor is no exception to this. It has been a while since I felt so moved watching a film, in both positive and negative ways. Scenes depicting the cold, ruthless killing of others, friend or foe. Empathizing with soldiers wishing to be killed or injured in order to be sent home. Taylor trying to save some young Vietnamese girls from being raped by his own men. Imagining the psychological trauma of watching people you yelled at yesterday, got high with last night, bonded with this morning, die in your arms. The palpable loneliness of these men, writing home to their loved ones, or even as they vie for the any emotionless type of physical intimacy. Watching Taylor transform from a positive, optimistic young man wanting to do the right thing for his country into an old soul, enervated and jaded, murder becoming a daily occurrence rather than the unbelievable nightmare it should always be. In the penultimate scene before he is rescued, Taylor serving personal justice in taking the life of the heartless Staff Sargent Barnes. So, I wonder, is it any surprise that soldiers return home that much more emotionally closed off, their minds almost accustomed to the idea of everyday trauma and constant panic, with an inability to open themselves up to others or allow themselves to succumb to emotional weakness?"
    },
    {
      "username": "Agent10",
      "userUrl": "https://www.imdb.com/user/ur1696608",
      "reviewLink": "https://www.imdb.com/review/rw0236428",
      "warningSpoilers": false,
      "date": "15 May 2002",
      "rate": "8",
      "helpful": "79 out of 114 found this helpful.",
      "title": "Excellent look at Vietnam",
      "content": "This certainly rates as one of the best Vietnam films of all time. What I especially enjoyed was the realistic atmosphere of the film, entrenching the viewer into a world which seems surreal yet believable. Oliver Stone's real-life experience in Vietnam brought a gifted outlook to this film, one drawn by experience, not common Hollywood conventions. While this proved be a lesser film to the equally amazing Full Metal Jacket, it was not by much. The performances by Tom Berenger, Willem Dafoe, Charlie Sheen and John C. McGinley were exceptional, capturing the plight of the tortured soldiers."
    },
    {
      "username": "asifahsankhan",
      "userUrl": "https://www.imdb.com/user/ur55828906",
      "reviewLink": "https://www.imdb.com/review/rw4051038",
      "warningSpoilers": false,
      "date": "2 February 2018",
      "rate": "8",
      "helpful": "23 out of 28 found this helpful.",
      "title": "Platoon focuses on the moral decay of the soldiers in the most unpopular war in modern American history",
      "content": "Many great war films of the Vietnam conflict are centered around these themes of blurred morality and the uselessness of war, and Oliver Stone's Platoon is among the most well known. Stone, who wrote and directed the film and also served as an infantryman in Vietnam, first rose to fame for his war films that dramatized the infamous Cold War conflict. The main premise of his magnum opus are the inner conflicts within US forces deployed to southeast Asia, rather than the actual physical conflicts between them and the Communist-allied Vietnamese forces. More broadly, Platoon analyzes the \"duality of man\" concept that has been studied in numerous other works, from fellow Vietnam War films like Full Metal Jacket (1987) and Apocalypse Now (1979), all the way back to the latter's source material and inspiration in Joseph Conrad's Heart of Darkness. Platoon focuses on the moral decay of soldiers in American units, and how this contributes to their inability to fight their Vietnamese enemies. Charlie Sheen sums up this theme with his on-the-nose voiceover, \"We did not fight the enemy, we fought ourselves... and the enemy was in us.\"Vietnam War-movies tend to be even harder to watch than most war flicks, as the lines between the \"heroes\" and \"villains\" are blurred more than in any other dramatized period of warfare in recent human history. In wars like World War II, which are widely known for being as black and white as military conflicts have become, the contrasting features between the heroic forces we are meant to root for and their opposing enemy platoons are well defined. That is almost never the case with the United States-North Vietnamese/Vietcong conflict in Vietnam during the overarching Cold War.That is not to say that most wars throughout human history have not been many shades of grey, with the winners and losers not always corresponding with the righteous and evil. But because of the guerrilla nature and infamous legacy of the Vietnam War itself - namely, the immense public protest against American involvement - the Vietnam War remains by far the most unpopular war in modern American history. With that said, most of the film is fantastic, from the aforementioned narrative to the grim lightning of the southeast Asian jungles that emphasize the film's tone, to the poignant, melancholic score."
    },
    {
      "username": "blinkchester",
      "userUrl": "https://www.imdb.com/user/ur2809724",
      "reviewLink": "https://www.imdb.com/review/rw0236539",
      "warningSpoilers": false,
      "date": "28 April 2004",
      "rate": "",
      "helpful": "241 out of 307 found this helpful.",
      "title": "Perfection... or as close to it as we're ever likely to see",
      "content": "Its hard to know where to start with such a breathtaking film. Oliver Stone's Platoon is quite simply the best Vietnam war film ever made in my opinion. Everything about it is as close to perfection as we are likely to see. Charlie Sheen plays the lead, and Willem Defoe and Tom Berenger play the two sergeants that form a key part of the plot.Chris Taylor (Sheen) is torn between the sergeants. Barnes (Berenger) is the battle hardened, brutal murderer, who uses the war as an excuse to tender to his sadistic pleasures. Elias (Defoe) is the other side of the spectrum. We get the sense that he has wrestled with his inner demons, but he has successfully come through to the other side. He has compassion for his fellow man, and he uses drugs as a form of escapism from this brutal war. The two symbolise the struggle that Taylor must face if he is to survive out in Vietnam.Oliver Stone perfectly captures war. The shooting is frantic and impossible to follow. It perfectly disorientates us, just as the soldiers were. We have no idea who is being shot at, and neither do they. We follow the war at ground level, and see the brutalities first hand. Having served in Vietnam, the film is loosely based on Stone's time out there, and Taylor loosely based on himself.Full Metal Jacket showcases how inhumane the war was, Apocalypse Now turns it into a story about life in general, and hopelessness, but Platoon has everything. Trying hard to avoid the old cliché, but if you only watch one war film, make sure it is this one. Nothing else can come close."
    },
    {
      "username": "red_core",
      "userUrl": "https://www.imdb.com/user/ur2942938",
      "reviewLink": "https://www.imdb.com/review/rw0236541",
      "warningSpoilers": false,
      "date": "8 May 2004",
      "rate": "9",
      "helpful": "236 out of 287 found this helpful.",
      "title": "within Vietnam and beyond",
      "content": "Platoon is generally regarded as one of the strongest anti-war films of all time. While this is certainly true, what's often overlooked -- at least after only one run through the film -- is that it's chiefly a tale of God vs. Satan, and the war is there to set a perilous backdrop. No doubt, Platoon shows the Vietnam War was a big mistake, but being a fictional documentary on Vietnam is far from its purpose.The story is told from the point of view of Chris Taylor (solidly played by Charlie Sheen), a middle class kid who goes to Vietnam to do what he thinks is his patriotic duty. In the first ten minutes, Chris is shown in the uncomfortable jungle, struggling just to survive in the natural environment, let alone do any actual damage to the enemy. Quickly we're introduced to the well-known facets of the Vietnam War: The lack of sense of purpose, the wraith-like enemies, the obvious prevalence of the uneducated and poor among the fighting grunts -- and, soon, we see how these factors combine to cause widespread low morale and some actions of more than questionable ethical value.Chris sees his platoon fragmented into two halves, each aligned with one of two men -- Sgt. Elias (Willem Dafoe) and Sgt. Barnes (Tom Berenger). These two really are the driving force behind the film. They both have nominally the same enemy (the Viet Cong), but, really, it doesn't take long to realize that Elias is Good, and Barnes is Evil (the \"enemy\" does not enter into the moral equation of this film, at all -- it's an outside threat, same as malaria-carrying mosquitoes or even friendly fire). I won't deny it is a very black-vesus-white relationship, but this polarity does not feel contrived. Elias feels the futility of the war and has respect for life; Barnes fights the war doggedly and has no compassion, period. Both are efficient soldiers fighting the same enemy, but really -- as is at one point aptly put by Chris Taylor himself -- they are fighting for the souls of the platoon members, as the outcome of the war is never really in doubt.Elias/Barnes' hold on the platoon, and the viewer, is developed through several war sequences. A chilling scene takes place in a village, where our soldiers find no VC, but they do find a cache of VC weapons. The inhumanity of certain soldiers, including of Sgt. Barnes, is unflinchingly shown here. It leaves the viewer with an empty feeling that is hard to shake, reminding of the similarly empty look on a woman's face after she sees her son killed in front her.Elias doesn't take kindly to this kind of behavior. Elias and Barnes come closer and closer to open conflict, as Taylor becomes a veteran, obviously siding with Elias. Meanwhile, the fate of the platoon comes closer and closer to them, culminating in an explosively shot action conclusion. The end is dark, but morally satisfying.Don't watch this movie for the action. That's not to say it's not well shot, or unrealistic. On the contrary. It's quite convincing. But it doesn't show war as a fun sport, and it's never a question of good guys versus bad guys. There will be no cheering for the \"good guys\" or anyone else in this one. Stone succeeds brilliantly at putting the viewer into the middle of it all, and it's not a pretty sigh (and definitely not for the squeamish, either).On the other hand, if you want great acting, it's here. Dafoe and Berenger do incredibly well, with the incredibly good (and seemingly authentically sounding) script. Barnes is horrific as he challenges three men to kill him, drinking hard liquor out of the bottle. They don't make a move, and neither will you, though you'll hate him just as much as them. Dafoe is a ray of light in the dark as Elias. The cast is rounded out with many characters, all well played, and adding another dimension to the film.The technical aspects of the film are superb, though one never thinks about them much, as the movie is completely engrossing. The production values seem quite good, as well. The most stunning peripheral aspect of this film, however, is the music. It's emotional and draining, and used to great effect -- listen for the main theme as you watch the village burn.Watch this one a few times, and you'll likely be quite moved each time. I'll be surprised if you give it less than what I gave it: 9/10"
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5480010",
      "warningSpoilers": false,
      "date": "13 February 2020",
      "rate": "",
      "helpful": "26 out of 35 found this helpful.",
      "title": "Platoon",
      "content": "Platoon is the landmark definition of a war film. Pulse-pounding sequences stacked on well-performed portrayal of soldiers (Sheen, Berenger & Dafoe) as well as a couple of heart-wrenching scenes that would be somewhat difficult to view. The film is Oliver Stone's most significant to date, especially since it's based off his own personal experience in the Vietnam War."
    },
    {
      "username": "Lt_Coffey_182",
      "userUrl": "https://www.imdb.com/user/ur2489267",
      "reviewLink": "https://www.imdb.com/review/rw1273205",
      "warningSpoilers": false,
      "date": "23 January 2006",
      "rate": "8",
      "helpful": "42 out of 53 found this helpful.",
      "title": "Shows the harsh realities of war very effectively",
      "content": "The Vietnam War has been one of the controversial wars in history and was an unpleasant experience for everyone involved. Oliver Stone harnessed these experiences to make Platoon; a film where he could illustrate to everyone what Vietnam was like from his perspective.In my opinion, this is the best war movie ever made. The sheer horror of war is captured so well in everyway. The fear of death, compatriots dying, divisions in the platoon, guilt of killing; it's all there and Stone doesn't try to disguise it. Platoon is very honestly written and it is this honesty that makes the film so great. Platoon isn't an anti war movie and it certainly does not glorify war in anyway, it is simply how war is in its entirety. There are some shocking scenes such as the one in the Vietnamese village but there are also more light hearted moments such as where the troops on Dafoe's side are partying and having a good time. On base camp, there is great contrast with the mood but on the forest, it is just fear, aggression and blood, nothing else.Taylor's (Charlie Sheen) story is very good as he experiencing war at the same time of the audience. Before the war, he was a rich kid who loved his grandma and it is how war changes him that is truly fascinating. The character story that always receives most praise however is that between Barnes (Tom Berenger) and Elias (Willem Dafoe) is very compelling and leads to some great scenes with them and carves an interesting divide within the camp. This film is big on character and explores many relationships but (take note Jarhead) doesn't sacrifice any action time for these scenes. Stone struck a perfect balance between action and story.Acting from everyone involved is very good. Sheen as the naïve newcomer is very good and after this, should have done much better for himself than he did. Dafoe and Berenger, once again steal the attention off the lead. Their extreme contrasting personalities is brilliantly done and raises the standard of the film. Berenger is truly terrifying, he didn't hold back in this one. Dafoe is much more sympathetic and will speak his mind to anyone. Johnny Depp makes one of his early film appearances with a small, yet memorable role. The way Sheen is wearing Depp's bandana after Lerner (Depp) gets taken by the chopper is discretely done but touching.Platoon is the best war movie there's ever been. Stone wrote and directed this film with such passion that it couldn't be anything but good. A great mix of characters, a great cast and such well crafted action scenes are all what you need for an exceptional war movie and they're all here. The film ends perfectly as we are given a chance to reflect and take it in before the credits start rolling. Stone, who often misses the point with his films, hit the nail on the head with this one."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw3825175",
      "warningSpoilers": false,
      "date": "7 October 2017",
      "rate": "8",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Visceral and violent war film by Oliver Stone based on his own soldier experiences in Vietnam",
      "content": "A very strong and tough Vietnam war film made by Oliver Stone who has directed his film in the form of Patrol Drama , a formula much beloved by filmmakers of Hollywood , War and western movies , and revived successfully by this great director . As a shy soldier , Charlie Sheen in the lead , arrives as a rookie in a veteran platoon led by two very different sergeants , the good boy : Willem Defoe , and the bad guy : Tom Berenger. They are accompanied by a motley group of soldiers as John G. Mcginley , Kevin Dillon , Tony Todd , Francesco Quinn , all of them are resplendent , among others.A Grunt's view of the Vietnam war is provided in all terrible , bloody and violent detail . Blundering and interesting Vietnam war film pre-dating the flood of the eighties and early nineties . It describes a pretty crude portrayal of America's thunderous days in Vietnam . Including a realist and thought-provoking dialog plenty of profanities , bad taste , sexual remarks and dealing with foreign intervention . Wooden acting by Charlie Sheen as naive soldier , it made a star out of Sheen and Stone cast him in his followup film : Wall Street . Charlie Sheen is the central figure in this exciting story through whose shell-shocked eyes we watch the violent events , slaughters , crossfires and atrocities. But here stand out Dafoe and Berenguer , both are top-notch as , respectively , the good and bad sergeants . Support cast is frankly excellent , as you will spot stars and prestigious secondaries in waiting as Johnny Depp , Forest Whitaker , Mark Moses , Tony Todd , Dale Dye and Kevin Dillon brother of Matt Dillon . And brief cameo by Oliver Stone himself . Bloody final reflects the bitterness and disillusion felt by most Americans about Vietnam war .Colorful and evocative cinematography by Robert Richardson . Perceptible and sensitive score by George Delerue , adding the famous adagio by Samuel Barber . Very good and graphic violent direction from Oliver stone who based the movie on his own GI experiences . It won Oscars for best picture , edition , sound and best director , being highly considered ; that's why it is deemed by many to be the most realistic and violent portrayal of the war on movie . It forms a trilogy about Vietnam along with ¨Born on the fourth of July¨ and ¨Heaven and Earth¨ directed splendidly by the fearless Oliver Stone . He gives a sour description about Vietnam war , a brutal vision of the conflict as witnessed first hand by the ordinary foot soldiers or Grunts."
    },
    {
      "username": "Red-Barracuda",
      "userUrl": "https://www.imdb.com/user/ur1616919",
      "reviewLink": "https://www.imdb.com/review/rw3249264",
      "warningSpoilers": false,
      "date": "1 June 2015",
      "rate": "6",
      "helpful": "46 out of 73 found this helpful.",
      "title": "Pivotal at the time but hasn't aged as well as some other Vietnam films",
      "content": "Platoon is the film that not only put director Oliver Stone well and truly on the Hollywood map, its huge critical and commercial success also would set the Vietnam War film cycle into hyper-drive. It centres on a platoon on a tour of duty in Vietnam through the eyes of a young recruit who quit college to volunteer for active service. It is in essence a combat film where the view is at ground level. In this sense it mixes traditional gun battles with the smaller more personal details that show the discomfort of life in the jungle. Its approach was very realistic for its time and in some ways it did reinvent what a war film could be.While it does have many scenes of combat action, they are pretty messy and unglorified and the film has a pretty clear anti-war message. This is conveyed in quite a major way by how the platoon itself is portrayed. It's divided into two camps led by two diametrically opposite sergeants Barnes and Elias (Tom Berenger and Willem Dafoe, respectively). The former is a facially scarred, violent man, while the latter is a morally sensitive borderline hippy. They show both sides of the American thinking about the war, with Barnes and his alcohol drinking followers the ugly brutal side of the coin and Elias and his marijuana smoking buddies the ones who question the participation of their country. This dramatic tension is brought fully to the fore in the pivotal moment of the film where the platoon commit mass murder and rape in a village, in a nod to arguably the most infamous real event in the war, a massacre at the village of Mai Lai in 1968.The dramatic conflict, while being the real meat of the film, does look quite overly simplistically done to my eyes now, with the evil Barnes and his bevvy merchant bad boys set against the hippy-like Elias and his chilled-out troops. It comes across as too black and white. It gets the message across but it does so with little subtlety or grey areas. I think Platoon overall, has aged a little worse than some of its contemporaries like Apocalypse Now (1979), Full Metal Jacket (1987) or Casualties of War (1989). This is probably a lot to do with Stone's overly politicised message, while the classical music which soundtracks the grimmest moments probably felt original at the time but now almost comes across as, dare I say it, a little cheesy. The film benefits somewhat from having quite a good cast, some of whom are actors who would go onto big careers, although in truth future mega star Johnny Depp makes absolutely no impression whatsoever in his minor role as a translator.All-in-all, Platoon is still an impressive combat film but it's one which for me has not aged too great in other ways. It still has historical importance as a key entry in the sub-genre though."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw3581854",
      "warningSpoilers": false,
      "date": "17 November 2016",
      "rate": "8",
      "helpful": "9 out of 12 found this helpful.",
      "title": "What a war",
      "content": "The only military conflict that was in the American experience similar to Vietnam was the Phillipine Insurrection. I doubt that any of the characters whom Oliver Stone created for Platoon would even have known we were in a five year war in the Phillipines battling elements wanting independence after the Spanish-American War made the territory our's.This was a war without uniforms or battle lines. No one knew who was friend or foe. That bred callousness of an extreme kind into our troops. They learned to shoot first then fake a story for the official report. This is what we see in Platoon.Charlie Sheen is a newly arrived private in Vietnam and through him Oliver Stone the director/writer of Platoon tells the story of his war. He gets caught in a power struggle between Sergeants Willem Dafoe and Tom Berenger who are presented as good versus evil. Dafoe is a professional soldier who has managed to keep some semblance of humanity. Berenger has totally lost it. A Yin and Yang of personal valor.Other films like Casualties Of War and Apocalypse Now have given their Vietnam stories. I like Casualties Of War as a favorite Vietnam film of mine, but Platoon certainly has its merits. I think an awful lot who were there will say Platoon is the real deal.Some familiar people are scattered through the supporting cast. One that stands out is Matt's younger brother Kevin who plays a kind of Berenger in training. I doubt this kid from small town USA ever imagined himself doing the brutal things he does. He learned his lessons from Vietnam well and Berenger was a good teacher.Platoon got several Oscar nominations. Not my favorite Vietnam war film, but a very good one."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw2660500",
      "warningSpoilers": false,
      "date": "17 August 2012",
      "rate": "",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Depressing and Raw",
      "content": "Platoon (1986) **** (out of 4) Oliver Stone's Oscar-winning Vietnam film has a new soldier (Charlie Sheen) arriving in the jungle not fully knowing what to expect and for the next year we follow his platoon as they lose one man after another. I really don't think PLATOON is one of the greatest films ever made and I'm not certain I'd even place it among the best films of the decade but you have to admire a war film that doesn't try to be manly or fun. This is one of the most depressing, dark and somber films you're ever going to see about the war and I think this is its strongest aspect. It's even more raw when you know that Stone went through this stuff and is basically sharing his memories of what it was like serving in Vietnam. I wasn't even born yet so I'm not going to sit here and say which film most realistically captured the war but when I hear people say this is the closest it's easy to see why. Stone's direction is certainly the star here because he really makes the viewer feel like they were in a platoon and there's no question that the director gets his points across without preaching. The film is ultra intense during certain scenes and brutally sad in others and especially during a scene where villagers are attacked and we're not even sure if they're guilty or not. The entire thing does make you wonder why such violence was needed and if it accomplishes anything. Of course, looking back on the film today you are amazed at how many great performers are here. Tom Berenger, Willem Dafoe and Sheen are all excellent in their leading bits but we get terrific support from the likes of Forest Whitaker, Keith David, Francesco Quinn, John C. McGinley, Kevin Dillon, Tony Todd and Johnny Depp. PLATOON isn't a fun film to watch but then again should a film like this be \"fun\" to watch?"
    },
    {
      "username": "TheMovieDiorama",
      "userUrl": "https://www.imdb.com/user/ur67902729",
      "reviewLink": "https://www.imdb.com/review/rw4085442",
      "warningSpoilers": false,
      "date": "9 March 2018",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Platoon is so much more than just your average war film.",
      "content": "This is actually rather intelligent, both in its plot and technical execution. It's the Vietnam War, we follow a platoon of US soldiers as they attempt to wipe out the enemy. The question that this film raises is: who really is the enemy? You have the conflict of the war itself (America against Vietnam) but within the platoon is a conflict for authority. Split between what is right and what is wrong, the moral implications of this war have taken effect on several soldiers as they question their choices. This was a smart element to include within the plot, it was easier to establish character development and build some tension. The majority of the characters were sufficiently developed and their personalities had charisma. This was mostly down to the great cast. Willem Dafoe was easily the best performance, Tom Berenger was also decent and the heated chemistry between them was well conveyed. Charlie Sheen however, didn't work for me. His acting ability consisted of monotonous dialogue delivery and shouting, perhaps he was overpowered by the rest of the great cast? I don't know, just felt meh. Didn't help that his biggest battle was with nature...we're talking ants, leeches and other insects. Obviously, animals love abit of Sheen. Oliver Stone's direction was solid, very realistic and gritty. The makeup effects were practical, the wounds and blown up limbs looked pretty damn realistic. A standout scene was the raiding of the Vietnamese village. This was the turning point where actually the American side were perceived as the antagonists, clearly communicating with our inner moral compasses. Effective, very effective. This is easily one of the best war films I've seen and winning Best Picture was fully justified."
    },
    {
      "username": "bzb2001",
      "userUrl": "https://www.imdb.com/user/ur2222698",
      "reviewLink": "https://www.imdb.com/review/rw0236478",
      "warningSpoilers": false,
      "date": "13 March 2003",
      "rate": "10",
      "helpful": "102 out of 143 found this helpful.",
      "title": "Still my favorite film",
      "content": "Every once in a while I will watch this film again and see if maybe I have grown tired of it. Surely after \"Saving Private Ryan,\" \"Titanic,\" \"Crimes and Misdemeanors,\" or \"Schindler's List\" I have seen a better film. Well, after every viewing there is something about Oliver Stone's masterpiece that keeps me saying that I have never seen anything better.I am a sucker for Vietnam pictures. \"Apocalypse Now\" and \"The Deer Hunter\" also rank in my top ten of all time. Stories about Vietnam can run the entire gambit of human emotions. \"Platoon\" is not only a documentation of America's sordid involvement in a foreign civil war, it is also a dramatic story of human response. A life developing in the most horrible of places.There have been films put together better. There have been films with more detailed and interesting plots. But none have ever told a more touching story of human development set in the backdrop of bloody violence and inhuman suffering.Rating: 10 out of 10."
    },
    {
      "username": "alifanova",
      "userUrl": "https://www.imdb.com/user/ur23378160",
      "reviewLink": "https://www.imdb.com/review/rw2262380",
      "warningSpoilers": true,
      "date": "10 June 2010",
      "rate": "10",
      "helpful": "79 out of 94 found this helpful.",
      "title": "Hell is the impossibility of reason",
      "content": "Why I think Platoon is probably the best war movie Hollywood ever made? Because it's very humane. I mean it. The director sees all his characters as victims of war rather than heroes or villains. Have a closer look at 'em.Taylor has no power inside himself and is torn between the two fathers; he ends up with a physical act of revenge. This is not what one father taught him - and the other father is actually murdered by him. Sgt. Barnes would never fit the postwar life and knew it damn too well himself; after all, he is not a fool although might seem a senseless killing machine at first sight. Vietnamese bullets could not kill him, his talent for survival being his enemy. So, he attempts kinda suicide twice (at least) begging others to kill him and thus end the pain tearing him from inside: first, in the potheads' bunker scene after Taylor's accusations; then, when Taylor finds him in the final scene.Sgt. Elias was far too good to survive the Nam and maybe even challenged and annoyed lifers on purpose, waiting for some bob barnes to hit back :) It's a pity Stone excluded the stars' scene monologue which explains pretty much about Elias' ways and view of the future. In fact, for himself he sees no future. Not in this world that is all about betrayal and killing.Bunny and Junior, one the embodiment of somewhat sadistic bravery and the other of cowardice. Their deaths are partly a morality, partly to show that it does not matter if you're black or white, brave or cowardly, war makes no difference wiping off everyone it can. King, Big Harold, Francis are survivors yet victims, too. What is awaiting them in the \"real\" world where nobody understands and nobody respects anything? They are dreaming of a comeback to music, girlfriends, fun time - but reality bites, and who knows, will they find their spot under the sun or will be forced to use the skills obtained in the Nam and get engaged in crime and drug abuse?Red O'Neill talking about his ability to predict if a guy is gonna make it or not. A reflection of his own fears: shall I stay alive and get out of here or not. The odds are that he is not, and Stone nails him to the place with Captain's order to take over what was once the Platoon... Bye Patsy.The idea that Stone has been trying to bring forward to us is NOT (to my mind) a story of struggle between the good and the bad for the possession of Taylor's soul (remember, the boy became a murderer in the end), but: where is war there can be no escape. Leave hope everyone who enters.Highest rate ever for that."
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw6695233",
      "warningSpoilers": false,
      "date": "15 March 2021",
      "rate": "",
      "helpful": "5 out of 6 found this helpful.",
      "title": "It Ain't The 1950's",
      "content": "After 600+ reviews, there's no need to detail the movie's many outstanding points. Instead, a brief comparison with the war-glorifying films of the 1950's is, I think, in order. After all many of the grunts suffering through Vietnam grew up in and were no doubt motivated by that formative period. At the time, of course, we were coming off the victorious years of WWII, while the stalemate in Korea (1950-53) got shoved aside as an inconvenience. {The only critical Korea exception I know of is 'The Bridges at Toko-Ri' (1954) which many theatres of the time refused to show.} Meanwhile, typical 50's war films such as 'Battle Cry' (1955), 'In Love And War' (1958), 'Battleground' (1950), and others, all provided cosmetic and basically sanitized profiles of warfare. With their big budgets, name stars, and nation-wide distribution, these crowd pleasers helped soothe a Cold War nation from the prospect of actual warfare. Happily for the producers, box-office rewards awaited. The true costs as Platoon shows would come later. Of course, hovering in the background during the period was the blue-nose Production Code, whose censorial influence precluded anything like gore, excessive pain, or, heaven forbid, soldierly cursing. So, the period's cosmetized results weren't entirely the fault of the movie studios.All in all, that critical period purged real warfare- so literally portrayed in Stone's Platoon- of its ghastly elements; instead portraying it as an ordeal, at worst, and a shot at glory, at best. As a result, I suspect many well-meaning guys entered Vietnam under those same cosmetic influences, as I was. However, as Stone's trip-through-hell shows, combat should never be cosmetized, even though war may at times be unavoidable. So my salute to you, Mr. Stone, and to your Platoon."
    },
    {
      "username": "richardchatten",
      "userUrl": "https://www.imdb.com/user/ur67430579",
      "reviewLink": "https://www.imdb.com/review/rw8523659",
      "warningSpoilers": false,
      "date": "7 September 2022",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Green Hell",
      "content": "As much an exercise in nostalgia for the sixties than a war movie, Oliver Stone despite his celebrated use of Barber's 'Adagio' can't resist slipping in a couple of popular hits from his youth. The platoon devotes far more time to fighting each other than engaging the enemy, showing a lack of empathy towards the Vietnamese that is truly shocking.Probably intentionally the relentless gore and brutality gets rather monotonous (as has been said of flying it combines hours of mumbling boredom with moments of sheer terror); while occasional visual pyrotechnics and the Oscar-nominated photography of the and the attractive greenery belies the oppressive heat that made jungle warfare such an ordeal at first hand."
    },
    {
      "username": "ereinion",
      "userUrl": "https://www.imdb.com/user/ur2332156",
      "reviewLink": "https://www.imdb.com/review/rw0236552",
      "warningSpoilers": true,
      "date": "27 September 2004",
      "rate": "8",
      "helpful": "33 out of 48 found this helpful.",
      "title": "An important work",
      "content": "\"Platoon\" was my first introduction to wartime reality.I was just a kid when first viewing it and the film left a powerful impression in me.Before that,I had only seen a couple of Rambo films and thats what I expected to get here,pretty much.It turned out to be something quite different from that,although it would take me a few years to realize just how different.\"Platoon\" is Oliver Stone's breakthrough picture and a landmark in Hollywood history of the 80's.It features almost every well known actor on the rise from that era,most notable ones being Forest Whitaker,Johnny Depp,Willem Dafoe,Francesco Quinn and Charlie Sheen.Why is it a landmark film?It helped to bring more understanding into the hot issue of Vietnam war,although \"Apocalypse Now!\" had already worked out that subject in the most stunning way.Yet there was still something left to say for Stone.It was pretty much the same as Coppola said,but in another,more harrowing and less complex way.We got a closer glimpse of how it is to die,for one.Dafoe's heroic end is one of the most dramatic scenes in history of war films.A strong issue here is the abuse of military codes and discipline.Tom Berenger's sadistic,disturbed sgt. Barnes is the perfect example of a warrior playing god,or angel of death, and fighting a war by his own rules.Berenger plays Barnes so well that it really gives you the chills watching him and you want him dead.Sgt. Elias is his counterpart in every way,as he really cares for his men and is in touch with the human in him always.He is not popular among the lowlifes like the redneck psychopath Bunny (great early role by Kevin Dillon) and the spineless racist O'Neill in John McGinley's incarnation.Another spineless character is the young lieutenant,who on one hand is a greater sinner than Barnes.He has no control over the men under his command whatsoever and refuses to take responsibility or even feel the guilt for not doing anything to prevent the massacre of the village committed by Barnes and his butchers.Here we see the effect that the horrors are having on private Chris,as he in a fit of frustration and anger over the situation he is in tortures a sick and frail creature of a man and ends up in tears.Its a powerful and riveting scene which highlights the film's message against war,showing its inhumanity and absurdity in the most shocking way.The final battle is very brutal and well shot.It sums up the whole Vietnam war and the strategy of the American army.The napalm kills not just the Vietcongs but also Americans.Ironically,it saves Chris' life as he is about to be killed by Barnes during their confrontation.Bunny gets what he deserves and Junior,who is the most despicable of the black characters here,also dies.This may be seen as director's own judgment.The only other sympathetic character still alive by this time,the underground lord Rah, is left alive.Francesco Quinn shows here that he is capable of taking over his father's legacy.In the end,this film is not flawless,but it is a perfect document of the madness that occurred in Vietnam 1964-73.And its consistent to its very end,which by the way is very touching and almost made me cry the second time I watched it.It is funny how one can feel both happy and sad about leaving a war torn place.Such are the feelings that a war conjures up in a man.It is almost like Chris was sad he was leaving,or maybe the emotions that were bubbling under surface just came out for real.Any which way,this film will always be remembered as the one that gave a true and unpolished picture of mankind at war at a time when Hollywood producers made an attempt to glorify the US army and cast an eclipse on its disgraceful stain,transforming the killing into culture.Ironically they succeeded.8/10"
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1869838",
      "warningSpoilers": false,
      "date": "6 May 2008",
      "rate": "5",
      "helpful": "21 out of 36 found this helpful.",
      "title": "The First of Many Oliver Stone Onslaughts",
      "content": "So began the string of films with which Oliver Stone would assault our senses and earn him some of the most undeserved accolades in film history.\"Platoon\" is probably one of his stronger films, but it doesn't hold up well. At the time, it was notable for its authenticity in depicting the life of a Vietnam grunt, and I certainly want to be sensitive to anyone who served in Vietnam and has an appreciation for this movie because of it. But the movie itself is hopelessly overwrought and reeks of Stone's sledgehammer style of film-making. He can't allow emotions to speak for themselves, so he asks slow motion shots and thundering music to do the work instead. And there was enough material for a movie about Vietnam already without his having to concoct the ridiculous rivalry plot he cooks up for Tom Berenger and Willem Dafoe to play out, both of them seemingly transplanted straight from the jungles of \"Apocalypse Now\".Every time I hear that classical composition that plays over and over and over in this film I want to jab a fork into my eye.Grade: C+"
    }
  ],
  "errorMessage": ""
}