{
  "imDbId": "tt0091763",
  "title": "Platoon",
  "fullTitle": "Platoon (1986)",
  "type": "Movie",
  "year": "1986",
  "language": "en",
  "titleInLanguage": "Platoon (film)",
  "url": "https://en.wikipedia.org/wiki/Platoon_(film)",
  "plotShort": {
    "plainText": "Platoon is a 1986 American war film written and directed by Oliver Stone, starring Tom Berenger, Willem Dafoe, Charlie Sheen, Keith David, Kevin Dillon, John C. McGinley, Forest Whitaker, and Johnny Depp. It is the first film of a trilogy of Vietnam War films directed by Stone, followed by Born on the Fourth of July (1989) and Heaven & Earth (1993). The film, based on Stone's experience from the war, follows a U.S. Army volunteer (Sheen) serving in Vietnam while his Platoon Sergeant and his Squad Leader (Berenger and Dafoe) argue over the morality in the platoon and of the war itself.\r\nStone wrote the screenplay based upon his experiences as a U.S. infantryman in Vietnam, to counter the vision of the war portrayed in John Wayne's The Green Berets. Although having written films such as Midnight Express and Scarface, Stone struggled to get the film developed until Hemdale Film Corporation acquired the project along with Salvador. Filming took place in the Philippines in February 1986 and lasted 54 days. Platoon was the first Hollywood film to be written and directed by a veteran of the Vietnam War.\r\nUpon its release, Platoon received critical acclaim for Stone's directing and screenplay, the cinematography, battle sequences' realism, and the performances of Sheen, Dafoe, and Berenger. The film was a box office success upon its release, grossing $138.5 million domestically against its $6 million budget. The film was nominated for eight Academy Awards at the 59th Academy Awards, and won four including Best Picture, Best Director for Stone, Best Sound, and Best Film Editing.\r\nIn 1998, the American Film Institute placed Platoon at #83 in their \"AFI's 100 Years ... 100 Movies\" poll. In 2019, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>Platoon is a 1986 American war film written and directed by Oliver Stone, starring Tom Berenger, Willem Dafoe, Charlie Sheen, Keith David, Kevin Dillon, John C. McGinley, Forest Whitaker, and Johnny Depp. It is the first film of a trilogy of Vietnam War films directed by Stone, followed by Born on the Fourth of July (1989) and Heaven & Earth (1993). The film, based on Stone's experience from the war, follows a U.S. Army volunteer (Sheen) serving in Vietnam while his Platoon Sergeant and his Squad Leader (Berenger and Dafoe) argue over the morality in the platoon and of the war itself.</p><p>Stone wrote the screenplay based upon his experiences as a U.S. infantryman in Vietnam, to counter the vision of the war portrayed in John Wayne's The Green Berets. Although having written films such as Midnight Express and Scarface, Stone struggled to get the film developed until Hemdale Film Corporation acquired the project along with Salvador. Filming took place in the Philippines in February 1986 and lasted 54 days. Platoon was the first Hollywood film to be written and directed by a veteran of the Vietnam War.</p><p>Upon its release, Platoon received critical acclaim for Stone's directing and screenplay, the cinematography, battle sequences' realism, and the performances of Sheen, Dafoe, and Berenger. The film was a box office success upon its release, grossing $138.5 million domestically against its $6 million budget. The film was nominated for eight Academy Awards at the 59th Academy Awards, and won four including Best Picture, Best Director for Stone, Best Sound, and Best Film Editing.</p><p>In 1998, the American Film Institute placed Platoon at #83 in their \"AFI's 100 Years ... 100 Movies\" poll. In 2019, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "Platoon is a 1986 American war film written and directed by Oliver Stone, starring Tom Berenger, Willem Dafoe, Charlie Sheen, Keith David, Kevin Dillon, John C. McGinley, Forest Whitaker, and Johnny Depp. It is the first film of a trilogy of Vietnam War films directed by Stone, followed by Born on the Fourth of July (1989) and Heaven & Earth (1993). The film, based on Stone's experience from the war, follows a U.S. Army volunteer (Sheen) serving in Vietnam while his Platoon Sergeant and his Squad Leader (Berenger and Dafoe) argue over the morality in the platoon and of the war itself.\r\nStone wrote the screenplay based upon his experiences as a U.S. infantryman in Vietnam, to counter the vision of the war portrayed in John Wayne's The Green Berets. Although having written films such as Midnight Express and Scarface, Stone struggled to get the film developed until Hemdale Film Corporation acquired the project along with Salvador. Filming took place in the Philippines in February 1986 and lasted 54 days. Platoon was the first Hollywood film to be written and directed by a veteran of the Vietnam War.\r\nUpon its release, Platoon received critical acclaim for Stone's directing and screenplay, the cinematography, battle sequences' realism, and the performances of Sheen, Dafoe, and Berenger. The film was a box office success upon its release, grossing $138.5 million domestically against its $6 million budget. The film was nominated for eight Academy Awards at the 59th Academy Awards, and won four including Best Picture, Best Director for Stone, Best Sound, and Best Film Editing.\r\nIn 1998, the American Film Institute placed Platoon at #83 in their \"AFI's 100 Years ... 100 Movies\" poll. In 2019, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nIn 1967, U.S. Army volunteer Chris Taylor arrives in South Vietnam and is assigned to an infantry platoon of the 25th Infantry Division near the Cambodian border. Though the platoon is officially under the command of the young and inexperienced Lieutenant Wolfe, the soldiers instead defer to two of his older and more experienced subordinates: the cynical Staff Sergeant Barnes, and the more idealistic Sergeant Elias.\r\nTaylor is immediately deployed with Barnes, Elias and other experienced soldiers for a night ambush on a North Vietnamese Army force. The NVA soldiers manage to get close to the sleeping Americans before a brief firefight ensues, which leads to Taylor becoming wounded and sent to the aid station. Upon his return, Taylor bonds with Elias and his circle of marijuana smokers while remaining distant from Barnes and his more hard-edged followers.\r\nDuring a subsequent patrol, three men are killed by booby traps and unseen assailants. Already on edge, the platoon is further angered when they discover an enemy supply cache in a nearby village. Barnes aggressively interrogates the village chief about whether the villagers have been aiding the NVA, and coldly shoots his wife dead when she snaps back at him. Elias then gets into a physical altercation with Barnes over the killing before Wolfe pacifies them and orders the supplies destroyed and the village razed. Taylor later prevents two girls from being gang-raped by some of Barnes' men.\r\nWhen the platoon returns to base, company commander Captain Harris declares that if he finds out that an illegal killing took place, a court-martial will ensue, leaving Barnes worried that Elias will testify against him. On their next patrol, the platoon is ambushed and pinned down in a firefight, and the situation is worsened when Wolfe accidentally directs an artillery strike onto his own unit before Barnes calls it off. Elias takes Taylor, Rhah and Crawford to intercept flanking enemy troops, while Barnes orders the rest of the platoon to retreat and goes back into the jungle to find Elias' group. Barnes finds Elias alone and shoots him, then tells the others that Elias was killed by the enemy. While the platoon is extracting via helicopter, they see a mortally wounded Elias emerge from the treeline being chased by NVA soldiers, who eventually kill him. Noting Barnes' anxious manner, Taylor realizes that he was responsible.\r\nBack at base, Taylor attempts to talk his group into fragging Barnes in retaliation when Barnes, having overheard them, enters the room and mocks them. Taylor then assaults Barnes but is quickly overpowered, and Barnes cuts Taylor near his eye with a push dagger before departing.\r\nThe platoon is sent back to the front line to maintain defensive positions, where Taylor shares a foxhole with another soldier named Francis. That night, a major NVA assault occurs, and the defensive lines are broken. Much of the platoon, including Wolfe and most of Barnes' followers, are killed in the ensuing battle, while an NVA sapper destroys the battalion headquarters in a suicide attack. Now in command, Captain Harris orders air support to expend all remaining ordnance inside the perimeter. In the chaos, Taylor encounters Barnes, who has been seriously wounded. Just as Barnes is about to kill Taylor, both men are knocked unconscious by an air strike.\r\nTaylor regains consciousness the following morning, picks up an enemy rifle, and finds Barnes, who orders Taylor to call a medic. Seeing that Taylor will not help, Barnes contemptuously tells Taylor to kill him, with which he complies. Francis, who survived the battle unharmed, deliberately stabs himself in the leg and reminds Taylor that because they have been twice wounded, they can return home, and a helicopter carries the two men away. Overwhelmed, Taylor breaks down sobbing as he glares down at multiple craters full of corpses.\r\nCast\r\nCharlie Sheen as Chris Taylor\r\nTom Berenger as Staff Sgt. Barnes\r\nWillem Dafoe as Sgt. Elias\r\nKeith David as King\r\nForest Whitaker as Big Harold\r\nFrancesco Quinn as Rhah Vermucci\r\nKevin Dillon as Bunny\r\nJohn C. McGinley as Sgt. O'Neill\r\nReggie Johnson as Junior\r\nMark Moses as Lt. Wolfe\r\nCorey Glover as Francis\r\nJohnny Depp as Gator Lerner\r\nChris Pedersen as Crawford\r\nBob Orwig as Gardner\r\nCorkey Ford as Manny\r\nDavid Neidorf as Tex\r\nRichard Edson as Sal\r\nTony Todd as Warren\r\nDale Dye as Captain Harris\r\nPaul Sánchez as Doc\r\nOliver Stone as Alpha Company Major in bunker (uncredited)\r\nProduction\r\nDevelopment\r\n\"Vietnam was really visceral, and I had come from a cerebral existence: study ... working with a pen and paper, with ideas. I came back really visceral. And I think the camera is so much more ... that's your interpreter, as opposed to a pen.\"\r\n—Oliver Stone\r\nOliver Stone's journey of creating a cinematic piece about his tour of duty in the Vietnam War began almost after it ended in 1968 when he wrote a screenplay called Break, a semi-autobiographical account detailing his experiences with his parents and his time in the Vietnam War. Stone's active duty service resulted in a \"big change\" in how he viewed life and the war. Although the screenplay Break was never produced, he later used it as the basis for Platoon. His screenplay featured several characters who were the seeds of those he developed in Platoon. The script was set to music from The Doors; Stone sent the script to Jim Morrison in the hope he would play the lead. (Morrison never responded, but his manager returned the script to Stone shortly after Morrison's death; Morrison had the script with him when he died in Paris.) Although Break was never produced, Stone decided to attend film school.\r\nAfter writing several other screenplays in the early 1970s, Stone worked with Robert Bolt on the screenplay, The Cover-up (it was not produced). Bolt's rigorous approach rubbed off on Stone. The younger man used his characters from the Break screenplay and developed a new screenplay, which he titled Platoon. Producer Martin Bregman attempted to elicit studio interest in the project, but was not successful. Stone claims that during that time, Sidney Lumet was to have helmed the film with Al Pacino slated to star had there been studio interest. But, based on the strength of his writing in Platoon, Stone was hired to write the screenplay for Midnight Express (1978).\r\nThe film was a critical and commercial success, as were some other Stone films at the time, but most studios were still reluctant to finance Platoon, because it was about the unpopular Vietnam War. After the release of The Deer Hunter and Apocalypse Now, the studios then cited the perception that these films were considered the pinnacle of the Vietnam War film genre as reasons not to make Platoon.\r\nStone responded by attempting to break into mainstream direction via the easier-to-finance horror genre, but The Hand failed at the box office, and he began to think Platoon would never be made. Instead, he cowrote Year of the Dragon for a lower-than-usual fee of $200,000, on the condition from producer Dino De Laurentiis would next produce Platoon. Year of the Dragon was directed by Stone's friend Michael Cimino, who had also helmed The Deer Hunter. According to Stone, Cimino attempted to produce Platoon in 1984.\r\nDe Laurentiis secured financing for Platoon, but he struggled to find a distributor. Because De Laurentiis had already spent money sending Stone to the Philippines to scout for locations, he decided to keep control of the film's script until he was repaid. Then Stone's script for what would become Salvador was passed to John Daly of British production company Hemdale. Once again, this was a project that Stone had struggled to secure financing for, but Daly loved the script and was prepared to finance both Salvador and Platoon. Stone shot Salvador first, before turning his attention to Platoon.\r\nCasting\r\nJames Woods, who had starred in Stone's film Salvador, was offered a part in Platoon. Despite his friendship with the director, he turned it down, later teasingly saying he \"couldn't face going into another jungle with\". Denzel Washington expressed interest in playing the role of Elias, a character Stone said was based on a soldier he knew in Vietnam. Stone confirmed in a 2011 interview with Entertainment Weekly that Mickey Rourke, Emilio Estevez and Kevin Costner were all considered for the part of Barnes. He believes Costner turned down the role \"because his brother had been in Vietnam.\" Stone also verified in the interview that Keanu Reeves turned down the role of Taylor because of the violence. Sheen said that he got the part of Taylor, because of Dafoe's nod of approval. Jon Cryer auditioned for the role of Bunny.\r\nMany Vietnamese refugees living in the Philippines at the time were recruited to act in different Vietnamese roles in the film.\r\nStone makes a cameo appearance as the commander of the 3d Battalion, 22d Infantry in the final battle, which was based on the historic New Year's Day Battle of 1968 in which he had taken part while on duty in South Vietnam. Dale Dye, who played Captain Harris, the commander of Company B, is a U.S. Marine Corps Vietnam War veteran who also served as the film's technical advisor. The third US Army veteran who appears in the film is a member of the crew who was briefly seen shirtless in the climactic battle.\r\nFilming\r\nExterior shooting began on the island of Luzon in the Philippines in February 1986, although the production was almost canceled because of the political upheaval in the country, due to then-president Ferdinand Marcos. With the help of well-known Asian producer Mark Hill, the shoot commenced, as scheduled, two days after Marcos fled the country. Shooting lasted 54 days and cost $6.5 million. The production made a deal with the Philippine military for the use of military equipment. Filming was done chronologically.\r\nUpon arrival in the Philippines, the cast was sent on an intensive training course, during which they had to dig foxholes and were subjected to forced marches and nighttime \"ambushes,\" which used special-effects explosions. Led by Vietnam War veteran Dale Dye, training put the principal actors—including Sheen, Dafoe, Depp and Whitaker—through an immersive 30-day military-style training regimen. They limited how much food and water they could drink and eat and when the actors slept, fired blanks to keep the tired actors awake. Dye also had a small role as Captain Harris. Stone said that he was trying to break them down, \"to mess with their heads so we could get that dog-tired, don't give a damn attitude, the anger, the irritation ... the casual approach to death\". Willem Dafoe said \"the training was very important to the making of the film\", adding to its authenticity and strengthening the camaraderie developed among the cast: \"By the time you got through the training and through the film, you had a relationship to the weapon. It wasn't going to kill people, but you felt comfortable with it.\"\r\nScenes were shot in Mount Makiling, Laguna (province) (for the forest scenes), Cavite (for the river and village scenes), and Villamor Air Base near Manila.\r\nIn 1986, a novelization of the film script, written by Dale Dye, was published. In 2018 actor Paul Sanchez, who played Doc in the movie, made a documentary about the making of film, entitled Platoon: Brothers in Arms.\r\nSoundtrack\r\nThe film score was by George Delerue. Music used in the film includes Adagio for Strings by Samuel Barber, \"White Rabbit\" by Jefferson Airplane, and \"Okie from Muskogee\" by Merle Haggard (which is an anachronism, as the film is set in 1967 but Haggard's song was not released until 1969). During a scene in the \"Underworld\", the soldiers sing along to \"The Tracks of My Tears\" by Smokey Robinson and The Miracles, which was also featured in the film's trailer. The soundtrack includes \"Groovin'\" by The Rascals and \"(Sittin' On) The Dock of the Bay\" by Otis Redding.\r\nRelease\r\nPlatoon was released in the United States on December 19, 1986 and in the Philippines and the United Kingdom in March 1987, with its release in the latter receiving an above 15 rating for strong language, scenes of violence, and soft drug use.\r\nIn its seventh weekend of release, the film expanded from 214 theatres to 590 and became number one at the United States box office with a gross of $8,352,394. It remained number one for four weekends. In its ninth weekend, it grossed $12.9 million from 1,194 theatres over the four-day President's Day weekend, being the first film to gross more than $10 million in a weekend in February and setting a weekend record for Orion.\r\nReception\r\nOn Rotten Tomatoes, the film has an approval rating of 89% based on 120 reviews, with an average rating of 8.5/10. The site's critical consensus reads, \"Informed by director Oliver Stone's personal experiences in Vietnam, Platoon forgoes easy sermonizing in favor of a harrowing, ground-level view of war, bolstered by no-holds-barred performances from Charlie Sheen and Willem Dafoe.\" On Metacritic, the film has a weighted average score of 92 out of 100, based on 16 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.\r\nRoger Ebert gave it four out of four stars, calling it the best film of the year, and the ninth best of the 1980s. Gene Siskel also awarded the film four out of four stars, and observed that Vietnam War veterans greatly identified with the film. In his New York Times review, Vincent Canby described Platoon as \"possibly the best work of any kind about the Vietnam War since Michael Herr's vigorous and hallucinatory book Dispatches.\r\n\"The film has been widely acclaimed,\" Pauline Kael admitted, \"but some may feel that Stone takes too many melodramatic shortcuts, and that there's too much filtered light, too much poetic license, and too damn much romanticized insanity ... The movie crowds you; it doesn't leave you room for an honest emotion.\"\r\nHowever, black journalist Wallace Terry, who spent a two-year tour in Vietnam, and wrote the 1967 Time cover story entitled The Negro in Vietnam, criticized the film for its depiction of African-American soldiers in Vietnam. In an interview with Maria Wilhelm of People, he called the film's depiction of black troops \"a slap in the face\". In the interview, Terry noted that there were no black actors playing officers, and the three notable black soldiers in the film were all portrayed as cowards. He further went on to criticise the film for perpetuating black stereotypes, stating the film \"barely rises above the age-old Hollywood stereotypes of blacks as celluloid savages and coons who do silly things\".\r\nAwards and nominations\r\nOther honors\r\nAmerican Film Institute lists:\r\nAFI's 100 Years...100 Movies: #83\r\nAFI's 100 Years...100 Thrills: #72\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition): #86\r\nAFI's 100 Years...100 Heroes & Villains: Sgt. Bob Barnes - Nominated Villain\r\nIn 2011, British television channel Channel 4 voted Platoon as the 6th greatest war film ever made, behind Full Metal Jacket and ahead of A Bridge Too Far.\r\nHome media\r\nDue to a legal dispute between HBO Home Video and Vestron Video over home video rights, the film was delayed from its planned October 1987 release. After a settlement was reached, it was finally released on tape on January 22, 1988 through HBO, and then reissued on September 1, 1988 by Vestron. Vestron reissued the film twice, in 1991 and 1994. It made its DVD debut in 1997 through Live Entertainment. It was released again on VHS in 1999 by Polygram Filmed Entertainment (who briefly held the rights to the film through its purchase of the Epic library). The film was rereleased on DVD and again on VHS in 2001 by Metro-Goldwyn-Mayer (who now owns the rights to the film through their purchase of the pre-1996 Polygram Filmed Entertainment library). MGM released the 20th anniversary DVD through Sony Pictures Home Entertainment in 2006 while 20th Century Fox released the Blu-ray version on May 25, 2011. Shout! Factory released the 4K remastered Blu-Ray on September 18, 2018 and released a 4K Ultra-HD/Blu-ray combo pack on September 13, 2022.\r\nGames\r\nAvalon Hill produced a 1986 wargame as an introductory game to attract young people into the wargaming hobby.\r\nPlatoon (1987), a shooter video game, was developed by Ocean Software and published in 1987–88 by Data East for a variety of computer and console gaming systems.\r\nPlatoon (2002), also known as Platoon: The 1st Airborne Cavalry Division in Vietnam, a real-time strategy game for Microsoft Windows based on the film, was developed by Digital Reality and published by Monte Cristo and Strategy First.",
    "html": "<p>Platoon is a 1986 American war film written and directed by Oliver Stone, starring Tom Berenger, Willem Dafoe, Charlie Sheen, Keith David, Kevin Dillon, John C. McGinley, Forest Whitaker, and Johnny Depp. It is the first film of a trilogy of Vietnam War films directed by Stone, followed by Born on the Fourth of July (1989) and Heaven & Earth (1993). The film, based on Stone's experience from the war, follows a U.S. Army volunteer (Sheen) serving in Vietnam while his Platoon Sergeant and his Squad Leader (Berenger and Dafoe) argue over the morality in the platoon and of the war itself.</p><p>Stone wrote the screenplay based upon his experiences as a U.S. infantryman in Vietnam, to counter the vision of the war portrayed in John Wayne's The Green Berets. Although having written films such as Midnight Express and Scarface, Stone struggled to get the film developed until Hemdale Film Corporation acquired the project along with Salvador. Filming took place in the Philippines in February 1986 and lasted 54 days. Platoon was the first Hollywood film to be written and directed by a veteran of the Vietnam War.</p><p>Upon its release, Platoon received critical acclaim for Stone's directing and screenplay, the cinematography, battle sequences' realism, and the performances of Sheen, Dafoe, and Berenger. The film was a box office success upon its release, grossing $138.5 million domestically against its $6 million budget. The film was nominated for eight Academy Awards at the 59th Academy Awards, and won four including Best Picture, Best Director for Stone, Best Sound, and Best Film Editing.</p><p>In 1998, the American Film Institute placed Platoon at #83 in their \"AFI's 100 Years ... 100 Movies\" poll. In 2019, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>In 1967, U.S. Army volunteer Chris Taylor arrives in South Vietnam and is assigned to an infantry platoon of the 25th Infantry Division near the Cambodian border. Though the platoon is officially under the command of the young and inexperienced Lieutenant Wolfe, the soldiers instead defer to two of his older and more experienced subordinates: the cynical Staff Sergeant Barnes, and the more idealistic Sergeant Elias.</p><p>Taylor is immediately deployed with Barnes, Elias and other experienced soldiers for a night ambush on a North Vietnamese Army force. The NVA soldiers manage to get close to the sleeping Americans before a brief firefight ensues, which leads to Taylor becoming wounded and sent to the aid station. Upon his return, Taylor bonds with Elias and his circle of marijuana smokers while remaining distant from Barnes and his more hard-edged followers.</p><p>During a subsequent patrol, three men are killed by booby traps and unseen assailants. Already on edge, the platoon is further angered when they discover an enemy supply cache in a nearby village. Barnes aggressively interrogates the village chief about whether the villagers have been aiding the NVA, and coldly shoots his wife dead when she snaps back at him. Elias then gets into a physical altercation with Barnes over the killing before Wolfe pacifies them and orders the supplies destroyed and the village razed. Taylor later prevents two girls from being gang-raped by some of Barnes' men.</p><p>When the platoon returns to base, company commander Captain Harris declares that if he finds out that an illegal killing took place, a court-martial will ensue, leaving Barnes worried that Elias will testify against him. On their next patrol, the platoon is ambushed and pinned down in a firefight, and the situation is worsened when Wolfe accidentally directs an artillery strike onto his own unit before Barnes calls it off. Elias takes Taylor, Rhah and Crawford to intercept flanking enemy troops, while Barnes orders the rest of the platoon to retreat and goes back into the jungle to find Elias' group. Barnes finds Elias alone and shoots him, then tells the others that Elias was killed by the enemy. While the platoon is extracting via helicopter, they see a mortally wounded Elias emerge from the treeline being chased by NVA soldiers, who eventually kill him. Noting Barnes' anxious manner, Taylor realizes that he was responsible.</p><p>Back at base, Taylor attempts to talk his group into fragging Barnes in retaliation when Barnes, having overheard them, enters the room and mocks them. Taylor then assaults Barnes but is quickly overpowered, and Barnes cuts Taylor near his eye with a push dagger before departing.</p><p>The platoon is sent back to the front line to maintain defensive positions, where Taylor shares a foxhole with another soldier named Francis. That night, a major NVA assault occurs, and the defensive lines are broken. Much of the platoon, including Wolfe and most of Barnes' followers, are killed in the ensuing battle, while an NVA sapper destroys the battalion headquarters in a suicide attack. Now in command, Captain Harris orders air support to expend all remaining ordnance inside the perimeter. In the chaos, Taylor encounters Barnes, who has been seriously wounded. Just as Barnes is about to kill Taylor, both men are knocked unconscious by an air strike.</p><p>Taylor regains consciousness the following morning, picks up an enemy rifle, and finds Barnes, who orders Taylor to call a medic. Seeing that Taylor will not help, Barnes contemptuously tells Taylor to kill him, with which he complies. Francis, who survived the battle unharmed, deliberately stabs himself in the leg and reminds Taylor that because they have been twice wounded, they can return home, and a helicopter carries the two men away. Overwhelmed, Taylor breaks down sobbing as he glares down at multiple craters full of corpses.</p><br/><h3>Cast</h3><ul><li>Charlie Sheen as Chris Taylor</li><li>Tom Berenger as Staff Sgt. Barnes</li><li>Willem Dafoe as Sgt. Elias</li><li>Keith David as King</li><li>Forest Whitaker as Big Harold</li><li>Francesco Quinn as Rhah Vermucci</li><li>Kevin Dillon as Bunny</li><li>John C. McGinley as Sgt. O'Neill</li><li>Reggie Johnson as Junior</li><li>Mark Moses as Lt. Wolfe</li><li>Corey Glover as Francis</li><li>Johnny Depp as Gator Lerner</li><li>Chris Pedersen as Crawford</li><li>Bob Orwig as Gardner</li><li>Corkey Ford as Manny</li><li>David Neidorf as Tex</li><li>Richard Edson as Sal</li><li>Tony Todd as Warren</li><li>Dale Dye as Captain Harris</li><li>Paul Sánchez as Doc</li><li>Oliver Stone as Alpha Company Major in bunker (uncredited)</li></ul><br/><h3>Production</h3><h4>Development</h4><blockquote>\"Vietnam was really visceral, and I had come from a cerebral existence: study ... working with a pen and paper, with ideas. I came back really visceral. And I think the camera is so much more ... that's your interpreter, as opposed to a pen.\"</blockquote><p>—Oliver Stone</p><p>Oliver Stone's journey of creating a cinematic piece about his tour of duty in the Vietnam War began almost after it ended in 1968 when he wrote a screenplay called Break, a semi-autobiographical account detailing his experiences with his parents and his time in the Vietnam War. Stone's active duty service resulted in a \"big change\" in how he viewed life and the war. Although the screenplay Break was never produced, he later used it as the basis for Platoon. His screenplay featured several characters who were the seeds of those he developed in Platoon. The script was set to music from The Doors; Stone sent the script to Jim Morrison in the hope he would play the lead. (Morrison never responded, but his manager returned the script to Stone shortly after Morrison's death; Morrison had the script with him when he died in Paris.) Although Break was never produced, Stone decided to attend film school.</p><p>After writing several other screenplays in the early 1970s, Stone worked with Robert Bolt on the screenplay, The Cover-up (it was not produced). Bolt's rigorous approach rubbed off on Stone. The younger man used his characters from the Break screenplay and developed a new screenplay, which he titled Platoon. Producer Martin Bregman attempted to elicit studio interest in the project, but was not successful. Stone claims that during that time, Sidney Lumet was to have helmed the film with Al Pacino slated to star had there been studio interest. But, based on the strength of his writing in Platoon, Stone was hired to write the screenplay for Midnight Express (1978).</p><p>The film was a critical and commercial success, as were some other Stone films at the time, but most studios were still reluctant to finance Platoon, because it was about the unpopular Vietnam War. After the release of The Deer Hunter and Apocalypse Now, the studios then cited the perception that these films were considered the pinnacle of the Vietnam War film genre as reasons not to make Platoon.</p><p>Stone responded by attempting to break into mainstream direction via the easier-to-finance horror genre, but The Hand failed at the box office, and he began to think Platoon would never be made. Instead, he cowrote Year of the Dragon for a lower-than-usual fee of $200,000, on the condition from producer Dino De Laurentiis would next produce Platoon. Year of the Dragon was directed by Stone's friend Michael Cimino, who had also helmed The Deer Hunter. According to Stone, Cimino attempted to produce Platoon in 1984.</p><p>De Laurentiis secured financing for Platoon, but he struggled to find a distributor. Because De Laurentiis had already spent money sending Stone to the Philippines to scout for locations, he decided to keep control of the film's script until he was repaid. Then Stone's script for what would become Salvador was passed to John Daly of British production company Hemdale. Once again, this was a project that Stone had struggled to secure financing for, but Daly loved the script and was prepared to finance both Salvador and Platoon. Stone shot Salvador first, before turning his attention to Platoon.</p><h4>Casting</h4><p>James Woods, who had starred in Stone's film Salvador, was offered a part in Platoon. Despite his friendship with the director, he turned it down, later teasingly saying he \"couldn't face going into another jungle with\". Denzel Washington expressed interest in playing the role of Elias, a character Stone said was based on a soldier he knew in Vietnam. Stone confirmed in a 2011 interview with Entertainment Weekly that Mickey Rourke, Emilio Estevez and Kevin Costner were all considered for the part of Barnes. He believes Costner turned down the role \"because his brother had been in Vietnam.\" Stone also verified in the interview that Keanu Reeves turned down the role of Taylor because of the violence. Sheen said that he got the part of Taylor, because of Dafoe's nod of approval. Jon Cryer auditioned for the role of Bunny.</p><p>Many Vietnamese refugees living in the Philippines at the time were recruited to act in different Vietnamese roles in the film.</p><p>Stone makes a cameo appearance as the commander of the 3d Battalion, 22d Infantry in the final battle, which was based on the historic New Year's Day Battle of 1968 in which he had taken part while on duty in South Vietnam. Dale Dye, who played Captain Harris, the commander of Company B, is a U.S. Marine Corps Vietnam War veteran who also served as the film's technical advisor. The third US Army veteran who appears in the film is a member of the crew who was briefly seen shirtless in the climactic battle.</p><h4>Filming</h4><p>Exterior shooting began on the island of Luzon in the Philippines in February 1986, although the production was almost canceled because of the political upheaval in the country, due to then-president Ferdinand Marcos. With the help of well-known Asian producer Mark Hill, the shoot commenced, as scheduled, two days after Marcos fled the country. Shooting lasted 54 days and cost $6.5 million. The production made a deal with the Philippine military for the use of military equipment. Filming was done chronologically.</p><p>Upon arrival in the Philippines, the cast was sent on an intensive training course, during which they had to dig foxholes and were subjected to forced marches and nighttime \"ambushes,\" which used special-effects explosions. Led by Vietnam War veteran Dale Dye, training put the principal actors—including Sheen, Dafoe, Depp and Whitaker—through an immersive 30-day military-style training regimen. They limited how much food and water they could drink and eat and when the actors slept, fired blanks to keep the tired actors awake. Dye also had a small role as Captain Harris. Stone said that he was trying to break them down, \"to mess with their heads so we could get that dog-tired, don't give a damn attitude, the anger, the irritation ... the casual approach to death\". Willem Dafoe said \"the training was very important to the making of the film\", adding to its authenticity and strengthening the camaraderie developed among the cast: \"By the time you got through the training and through the film, you had a relationship to the weapon. It wasn't going to kill people, but you felt comfortable with it.\"</p><p>Scenes were shot in Mount Makiling, Laguna (province) (for the forest scenes), Cavite (for the river and village scenes), and Villamor Air Base near Manila.</p><p>In 1986, a novelization of the film script, written by Dale Dye, was published. In 2018 actor Paul Sanchez, who played Doc in the movie, made a documentary about the making of film, entitled Platoon: Brothers in Arms.</p><br/><h3>Soundtrack</h3><p>The film score was by George Delerue. Music used in the film includes Adagio for Strings by Samuel Barber, \"White Rabbit\" by Jefferson Airplane, and \"Okie from Muskogee\" by Merle Haggard (which is an anachronism, as the film is set in 1967 but Haggard's song was not released until 1969). During a scene in the \"Underworld\", the soldiers sing along to \"The Tracks of My Tears\" by Smokey Robinson and The Miracles, which was also featured in the film's trailer. The soundtrack includes \"Groovin'\" by The Rascals and \"(Sittin' On) The Dock of the Bay\" by Otis Redding.</p><br/><h3>Release</h3><p>Platoon was released in the United States on December 19, 1986 and in the Philippines and the United Kingdom in March 1987, with its release in the latter receiving an above 15 rating for strong language, scenes of violence, and soft drug use.</p><p>In its seventh weekend of release, the film expanded from 214 theatres to 590 and became number one at the United States box office with a gross of $8,352,394. It remained number one for four weekends. In its ninth weekend, it grossed $12.9 million from 1,194 theatres over the four-day President's Day weekend, being the first film to gross more than $10 million in a weekend in February and setting a weekend record for Orion.</p><br/><h3>Reception</h3><p>On Rotten Tomatoes, the film has an approval rating of 89% based on 120 reviews, with an average rating of 8.5/10. The site's critical consensus reads, \"Informed by director Oliver Stone's personal experiences in Vietnam, Platoon forgoes easy sermonizing in favor of a harrowing, ground-level view of war, bolstered by no-holds-barred performances from Charlie Sheen and Willem Dafoe.\" On Metacritic, the film has a weighted average score of 92 out of 100, based on 16 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.</p><p>Roger Ebert gave it four out of four stars, calling it the best film of the year, and the ninth best of the 1980s. Gene Siskel also awarded the film four out of four stars, and observed that Vietnam War veterans greatly identified with the film. In his New York Times review, Vincent Canby described Platoon as \"possibly the best work of any kind about the Vietnam War since Michael Herr's vigorous and hallucinatory book Dispatches.</p><p>\"The film has been widely acclaimed,\" Pauline Kael admitted, \"but some may feel that Stone takes too many melodramatic shortcuts, and that there's too much filtered light, too much poetic license, and too damn much romanticized insanity ... The movie crowds you; it doesn't leave you room for an honest emotion.\"</p><p>However, black journalist Wallace Terry, who spent a two-year tour in Vietnam, and wrote the 1967 Time cover story entitled The Negro in Vietnam, criticized the film for its depiction of African-American soldiers in Vietnam. In an interview with Maria Wilhelm of People, he called the film's depiction of black troops \"a slap in the face\". In the interview, Terry noted that there were no black actors playing officers, and the three notable black soldiers in the film were all portrayed as cowards. He further went on to criticise the film for perpetuating black stereotypes, stating the film \"barely rises above the age-old Hollywood stereotypes of blacks as celluloid savages and coons who do silly things\".</p><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Subject</th><th>Result</th></tr><tr><td rowspan=\"8\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Arnold Kopelson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>Oliver Stone</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Supporting Actor</span></td><td><span>Tom Berenger</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Willem Dafoe</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td>Oliver Stone</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Robert Richardson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Claire Simpson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound</span></td><td><span>John K. Wilkinson</span>, <span>Richard Rogers</span>, <span>Charles \"Bud\" Grenzbach</span>, <span>Simon Kaye</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>BAFTA Award</span></td><td><span>Best Editing</span></td><td>Claire Simpson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Robert Richardson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Direction</span></td><td rowspan=\"4\"><span>Oliver Stone</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Directors Guild of America Award</span></td><td><span>Outstanding Directing – Feature Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">Golden Globe Award</span></td><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Motion Picture – Drama</span></td><td><span>Arnold Kopelson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td><span>Tom Berenger</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Silver Bear</span></td><td><span>Best Director</span></td><td rowspan=\"3\"><span>Oliver Stone</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">Independent Spirit Award</span></td><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film</span></td><td><span>Arnold Kopelson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Male Lead</span></td><td><span>Willem Dafoe</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Robert Richardson</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Award</span></td><td><span>Best Original Screenplay</span></td><td><span>Oliver Stone</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>Other honors</h4><p>American Film Institute lists:</p><ul><li>AFI's 100 Years...100 Movies: #83</li><li>AFI's 100 Years...100 Thrills: #72</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition): #86</li><li>AFI's 100 Years...100 Heroes & Villains: Sgt. Bob Barnes - Nominated Villain</li></ul><p>In 2011, British television channel Channel 4 voted Platoon as the 6th greatest war film ever made, behind Full Metal Jacket and ahead of A Bridge Too Far.</p><br/><h3>Home media</h3><p>Due to a legal dispute between HBO Home Video and Vestron Video over home video rights, the film was delayed from its planned October 1987 release. After a settlement was reached, it was finally released on tape on January 22, 1988 through HBO, and then reissued on September 1, 1988 by Vestron. Vestron reissued the film twice, in 1991 and 1994. It made its DVD debut in 1997 through Live Entertainment. It was released again on VHS in 1999 by Polygram Filmed Entertainment (who briefly held the rights to the film through its purchase of the Epic library). The film was rereleased on DVD and again on VHS in 2001 by Metro-Goldwyn-Mayer (who now owns the rights to the film through their purchase of the pre-1996 Polygram Filmed Entertainment library). MGM released the 20th anniversary DVD through Sony Pictures Home Entertainment in 2006 while 20th Century Fox released the Blu-ray version on May 25, 2011. Shout! Factory released the 4K remastered Blu-Ray on September 18, 2018 and released a 4K Ultra-HD/Blu-ray combo pack on September 13, 2022.</p><h4>Games</h4><ul><li>Avalon Hill produced a 1986 wargame as an introductory game to attract young people into the wargaming hobby.</li><li>Platoon (1987), a shooter video game, was developed by Ocean Software and published in 1987–88 by Data East for a variety of computer and console gaming systems.</li><li>Platoon (2002), also known as Platoon: The 1st Airborne Cavalry Division in Vietnam, a real-time strategy game for Microsoft Windows based on the film, was developed by Digital Reality and published by Monte Cristo and Strategy First.</li></ul><br/>"
  },
  "errorMessage": ""
}