{
  "imDbId": "tt0057115",
  "title": "The Great Escape",
  "fullTitle": "The Great Escape (1963)",
  "type": "Movie",
  "year": "1963",
  "items": [
    {
      "publisher": "",
      "author": "Empire",
      "link": "https://www.empireonline.com/movies/reviews/empire-essay-great-escape-review/",
      "rate": "100",
      "content": "The final act of The Great Escape is a masterfully sustained piece of action and tension as the various escapees struggle for freedom via train, bicycle, motorbike, row boat and hitchhiking. The Great Escape should always be seen. It reminds us of a history that is all too quickly forgotten."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Scott Tobias",
      "link": "https://www.avclub.com/the-great-escape-1798199594",
      "rate": "100",
      "content": "McQueen speeding across the German countryside and leaping over the first of two barbed-wire fences leading into Switzerland may be the film's most iconic and enduring image. Dubious or not, it's a triumph of sorts that a tale that ends in war crimes could have such a rousing conclusion."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/the-great-escape/review/2030121311/",
      "rate": "100",
      "content": "Expertly directed and written with an infectious undercurrent of wry humor, this classic WWII POW escape yarn features an all-star cast of hardened Allied prisoners who the Germans have thrown together in a special escape-proof camp."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/2003-01-16/the-great-escape/",
      "rate": "100",
      "content": "One of the all-time great action movies, The Great Escape also features an all-star international cast. The first half of the movie sets up all the various characters who have to drop their prickly differences and unite to outwit their German captors. Steve McQueen as the Cooler King is a genuine classic."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://content.time.com/time/subscriber/article/0,33009,896917,00.html",
      "rate": "100",
      "content": "With accurate casting, a swift screenplay, and authentic German settings, Producer-Director John Sturges has created classic cinema of action. There is no sermonizing, no soul probing, no sex. The Great Escape is simply great escapism."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1962/film/reviews/the-great-escape-3-1200420303/",
      "rate": "90",
      "content": "Producer-director John Sturges has fashioned a motion picture that entertains, captivates, thrills and stirs."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Chris Cabin",
      "link": "",
      "rate": "88",
      "content": "The Great Escape is that rare war film that doesn’t fully indulge in assumed nationalism, save for the fact that everyone speaks English. Sturges never touches on the essential hollowness and cruel pageantry of war, but he does the next best thing by depicting an international effort where victory, no matter how short-lived, depends on the cooperation of myriad talents, rather than the gruff can-do attitude of an unbreakable chosen one."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "75",
      "content": "Way too flabby at 168 minutes, but once this 1963 feature gets going it's good, solid stuff, directed with an unusual lack of rhetoric by John Sturges."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Uneven but entertaining World War II escape drama, which even when it first appeared seemed very old-fashioned. Worth seeing the last half hour, if nothing else, for one of the best stunt sequences in years: McQueen's motor-cycle bid for freedom."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9A06E7DE1431E73BBC4053DFBE668388679EDE",
      "rate": "60",
      "content": "There are a few moments when Richard Attenborough as the chief engineer of the whole project demonstrates some impressive strength and poise. But for much longer than is artful or essential, The Great Escape grinds out its tormenting story without a peek beneath the surface of any man, without a real sense of human involvement. It's a strictly mechanical adventure with make-believe men."
    }
  ],
  "errorMessage": ""
}