{
  "imDbId": "tt0057115",
  "title": "The Great Escape",
  "fullTitle": "The Great Escape (1963)",
  "type": "Movie",
  "year": "1963",
  "language": "en",
  "titleInLanguage": "The Great Escape (film)",
  "url": "https://en.wikipedia.org/wiki/The_Great_Escape_(film)",
  "plotShort": {
    "plainText": "The Great Escape is a 1963 American epic war suspense adventure film starring Steve McQueen, James Garner and Richard Attenborough and featuring James Donald, Charles Bronson, Donald Pleasence, James Coburn, Hannes Messemer, David McCallum, Gordon Jackson, John Leyton and Angus Lennie. It was filmed in Panavision, and its musical score was composed by Elmer Bernstein.\r\nBased on Paul Brickhill's 1950 non-fiction book of the same name, the film depicts a heavily fictionalized version of the mass escape by British Commonwealth prisoners of war from German POW camp Stalag Luft III in the Second World War. The film made numerous compromises for its commercial appeal, such as its depiction in regards to American involvement in the escape.\r\nThe Great Escape was made by The Mirisch Company, released by United Artists, and produced and directed by John Sturges. The film had its Royal World Premiere at the Odeon Leicester Square in London's West End on 20 June 1963. The Great Escape received critical acclaim and emerged as one of the highest-grossing films of the year, winning McQueen the award for Best Actor at the Moscow International Film Festival, and is considered a classic. The film is also noted for its motorcycle chase and jump scene, which is considered one of the best stunts ever performed.",
    "html": "<p>The Great Escape is a 1963 American epic war suspense adventure film starring Steve McQueen, James Garner and Richard Attenborough and featuring James Donald, Charles Bronson, Donald Pleasence, James Coburn, Hannes Messemer, David McCallum, Gordon Jackson, John Leyton and Angus Lennie. It was filmed in Panavision, and its musical score was composed by Elmer Bernstein.</p><p>Based on Paul Brickhill's 1950 non-fiction book of the same name, the film depicts a heavily fictionalized version of the mass escape by British Commonwealth prisoners of war from German POW camp Stalag Luft III in the Second World War. The film made numerous compromises for its commercial appeal, such as its depiction in regards to American involvement in the escape.</p><p>The Great Escape was made by The Mirisch Company, released by United Artists, and produced and directed by John Sturges. The film had its Royal World Premiere at the Odeon Leicester Square in London's West End on 20 June 1963. The Great Escape received critical acclaim and emerged as one of the highest-grossing films of the year, winning McQueen the award for Best Actor at the Moscow International Film Festival, and is considered a classic. The film is also noted for its motorcycle chase and jump scene, which is considered one of the best stunts ever performed.</p>"
  },
  "plotFull": {
    "plainText": "The Great Escape is a 1963 American epic war suspense adventure film starring Steve McQueen, James Garner and Richard Attenborough and featuring James Donald, Charles Bronson, Donald Pleasence, James Coburn, Hannes Messemer, David McCallum, Gordon Jackson, John Leyton and Angus Lennie. It was filmed in Panavision, and its musical score was composed by Elmer Bernstein.\r\nBased on Paul Brickhill's 1950 non-fiction book of the same name, the film depicts a heavily fictionalized version of the mass escape by British Commonwealth prisoners of war from German POW camp Stalag Luft III in the Second World War. The film made numerous compromises for its commercial appeal, such as its depiction in regards to American involvement in the escape.\r\nThe Great Escape was made by The Mirisch Company, released by United Artists, and produced and directed by John Sturges. The film had its Royal World Premiere at the Odeon Leicester Square in London's West End on 20 June 1963. The Great Escape received critical acclaim and emerged as one of the highest-grossing films of the year, winning McQueen the award for Best Actor at the Moscow International Film Festival, and is considered a classic. The film is also noted for its motorcycle chase and jump scene, which is considered one of the best stunts ever performed.\r\nPlot\r\nIn 1942, the German Army is wasting significant manpower on catching escapees from POW camps across occupied Europe. The most persistent offenders are moved to Stalag Luft III, a new max-security camp near the Polish border, under the command of Luftwaffe Colonel von Luger. Von Luger tells British Group Captain Ramsey—the highest-ranked officer in captivity and de facto leader of the Allied prisoners—that trying to escape from this new facility will be futile.\r\nIt soon becomes clear that the guards are trained to spot methods the POWs successfully used at other camps. USAAF Captain Virgil Hilts, a notoriously prolific escapee, discovers a blind spot between two guard towers but purposefully gets caught so as not to prematurely raise suspicions. He is sentenced to solitary isolation (“the cooler”) in a cell next to RAF airman Ives, with whom he becomes friends.\r\nWith Ramsey's tacit approval, Squadron Leader Roger Bartlett establishes \"the X Organisation\", a secret escape-planning committee. Bartlett has an audacious plan: breaking out 250 men at once with a tunnel, to waste as much German manpower as possible on recapturing them all. The men begin working on three tunnels simultaneously: \"Tom\", \"Dick\", and \"Harry\".\r\nEach POW brings their specialist skills to the plan. Hendley secures vital objects on the black market, and forms a bond with Blythe, an expert document forger. Sedgwick makes picks and air bellows for the tunnels, while Welinski and Dickes oversee the digging. MacDonald gathers intelligence, Griffith makes civilian disguises, and Ashley-Pitt devises a method of hiding dirt from the tunnels. Noise from digging is masked by a prisoners' choir, led by Cavendish, who also surveys the tunnels' routes. Bartlett also approaches Hilts and asks him to escape again, scout out the surrounding area, then allow himself to be recaptured so he can draw maps for the main escape. Hilts refuses to be deliberately recaptured out of pride.\r\nWhen \"Tom\" nears completion first, Bartlett orders \"Dick\" and \"Harry\" sealed off. Hilts, Hendley, and Goff brew potato moonshine with a homemade still and celebrate the Fourth of July with the entire camp, but during the party the camp guards discover \"Tom\". A despondent Ives snaps, frantically climbs the barbed wire fence and is shot dead. Hilts, shaken by Ives' death, agrees to be deliberately recaptured after his next escape attempt. Bartlett switches the prisoners' efforts to \"Harry\", but after the tunnel partially collapses, Welinski has a breakdown and confides in Dickes that he is actually claustrophobic. He tries to break out through the fence, but Dickes manages to calm him down. Blythe realizes that he's going blind due to progressive myopia, and Hendley takes it upon himself to be Blythe's eyes during the escape.\r\nThe last part of the tunnel is completed, but when they break the surface, the end is 20 feet (6 m) short of the treeline, well within sight of the guards. Hilts goes first with a rope, tugging on it to signal when it's safe for each man to come out, and multiple POWs escape amidst an air raid blackout. However, Cavendish slips and makes a noise, drawing a guard. An impatient Griffith, unaware that the guard is standing directly over the hole, exits and is captured, ending the breakout.\r\nThe 76 escapees scatter throughout Europe. Cavendish hitches a ride on a truck, but is turned in by the driver. Hilts steals a motorcycle, heads for the German-Swiss border and tries to jump the fence, but is recaptured. Hendley, Blythe, Ashley-Pitt, Bartlett, McDonald, Nimmo, and Haynes board a train, but Hendley and Blythe jump off when they see soldiers conducting ID checks. They steal a plane to fly to Switzerland, but crash when the engine fails. Blythe is shot and Hendley recaptured.\r\nAt a railway station, Kuhn, a Gestapo officer from the camp, is with the soldiers searching the disembarking passengers for escapees. Ashley-Pitt shoots Kuhn to stop him from catching Bartlett, sacrificing himself so that the others can escape. However, the men are still caught when another Gestapo officer tricks MacDonald into speaking English while boarding a bus. Eventually, all but three of the POWs are recaptured: Welinski and Dickes row a small boat to the sea and stow away on a ship to Sweden, while Sedgwick makes it to France, where the Resistance smuggles him to Spain.\r\nMost of the men are grouped together, then loaded into trucks for what they assume is a journey back to the camp. However, they are instead taken to a field and shot on Hitler's direct orders. An ashamed von Luger tells Ramsey that fifty escapees were killed, is relieved of command and driven to an uncertain fate. Hilts returns and is sent to the cooler, where he begins planning his next escape.\r\nCast\r\nSteve McQueen as Captain Virgil Hilts 'The Cooler King': one of three Americans in the camp, Hilts irritates his captors with frequent escape attempts and his irreverent attitude, to the point that he is regularly confined in isolation in the cooler. He has a habit of bouncing a baseball against the cooler cell wall to entertain himself, as he plans an escape attempt.\r\nJames Garner as Flight Lieutenant Bob Hendley 'The Scrounger': an American in an RAF Eagle Squadron who is responsible for finding materials that will be necessary for the POWs during the escape attempt and on the outside.\r\nRichard Attenborough as Squadron Leader Roger Bartlett 'Big X': an ambitious RAF officer, who has developed an intense hatred for the Nazis after his transfer of captivity from the Gestapo. Bartlett, a veteran escaper, is the ringleader of the escape committee and declares his intention for a mass breakout is to waste German manpower.\r\nJames Donald as Group Captain Ramsey 'The SBO': the Senior British Officer and de facto commanding officer of the prisoners. He serves as an intermediary between the POWs and the Germans. Ramsey is taken aback at the possible consequences of Bartlett's plan but supports it.\r\nCharles Bronson as Flight Lieutenant Danny Welinski 'Tunnel King': a Polish émigré who escaped Nazi-held Poland and went to England to continue to fight against the Germans. He suffers from claustrophobia and is fearful of tunnel collapses, primarily coming from his experience of having dug 17 escape tunnels.\r\nDonald Pleasence as Flight Lieutenant Colin Blythe 'The Forger': a mild-mannered and good-natured master forger with a love of bird-watching who requires paper, inks, a camera, and current travel documents to copy. Hendley strikes a friendship with him.\r\nJames Coburn as Flying Officer Sedgwick 'The Manufacturer': an Australian officer who constructs objects necessary to implement the escape.\r\nHannes Messemer as Oberst von Luger 'The Kommandant': the Commandant of the camp and a senior Luftwaffe officer, von Luger is very civil with the POWs, and is openly anti-Nazi, having a dislike for the SS and Gestapo. When the Gestapo orders that Bartlett receive strict confinement, von Luger makes a passing note of it and instead shows sympathy for Bartlett.\r\nDavid McCallum as Lieutenant-Commander Eric Ashley-Pitt 'Dispersal': a Fleet Air Arm officer who finds an ingenious way to get rid of the dirt being brought up from the tunnels.\r\nGordon Jackson as Flight Lieutenant Andy MacDonald 'Intelligence': Bartlett's second-in-command in planning the escape.\r\nJohn Leyton as Flight Lieutenant Willie Dickes 'Tunnel King': Danny's best friend, who seeks to encourage Danny during his struggles with claustrophobia.\r\nAngus Lennie as Flying Officer Archie Ives 'The Mole': a Scottish airman who has an intense desire to escape, leading him to the precipice of paranoia.\r\nNigel Stock as Flight Lieutenant Dennis Cavendish 'The Surveyor': a Flight Lieutenant who has an important duty for the building of the tunnel.\r\nRobert Graf as Werner 'The Ferret': a young, naive guard, with whom Hendley forms a friendship, which he exploits as a means of obtaining travel documents and other needed items.\r\nJud Taylor as Second Lieutenant Goff: the third American in the camp.\r\nHans Reiser as Kuhn: a Gestapo officer, and an ardent Nazi, he orders von Luger that Bartlett be kept under the most restrictive permanent security confinement, which von Luger only makes a note of. He is critical of the Luftwaffe's fair treatment of the prisoners, and believes the camp should be brought under the control of the Gestapo and SS. Kuhn warns Bartlett that if he escapes again, he will be shot on his next capture.\r\nHarry Riebauer as Stabsfeldwebel Strachwitz, the senior NCO amongst the German guards.\r\nWilliam Russell as Sorren 'Security', a British officer.\r\nRobert Freitag as Hauptmann Posen, von Luger's adjutant.\r\nUlrich Beiger as Preissen: a Gestapo officer, and an ardent Nazi. He has a condescending attitude.\r\nGeorge Mikell as SD Hauptsturmführer Dietrich: one of the SS officers.\r\nLawrence Montaigne as Haynes 'Diversions', a Canadian officer.\r\nRobert Desmond as Griffith 'Tailor', a British officer responsible for supplying clothes for the POWs for the escape.\r\nTil Kiwe as Frick\r\nHeinz Weiss as Kramer\r\nTom Adams as Dai Nimmo 'Diversions', a Welsh officer.\r\nKarl-Otto Alberty as SD Untersturmführer Steinach: one of the SS officers.\r\nProduction\r\nWriting\r\nIn 1963, the Mirisch brothers worked with United Artists to adapt Paul Brickhill's 1950 book The Great Escape. Brickhill had been a very minor member of the X Organisation at Stalag Luft III, who acted as one of the \"stooges\" who monitored German movements in the camp. The story had been adapted as a live TV production, screened by NBC as an episode of The Philco Television Playhouse on January 27, 1951. The live broadcast was praised for engineering an ingenious set design for the live broadcast, including creating the illusion of tunnels. The film's screenplay was adapted by James Clavell, W. R. Burnett, and Walter Newman.\r\nCasting\r\nSteve McQueen has been credited with the most significant performance. Critic Leonard Maltin wrote that \"the large, international cast is superb, but the standout is McQueen; it's easy to see why this cemented his status as a superstar\". This film established his box-office clout. Hilts was based on at least three pilots, David M. Jones, John Dortch Lewis, and Bill Ash.\r\nRichard Attenborough's Sqn Ldr Roger Bartlett RAF, \"Big X\", was based on Roger Bushell, the South African-born British POW who was the mastermind of the real Great Escape. This was the film that first brought Attenborough to common notice in the United States. During World War II, Attenborough served in the Royal Air Force. He volunteered to fly with the Film Unit and after further training (where he sustained permanent ear damage) he qualified as a sergeant. He flew on several missions over Europe, filming from the rear gunner's position to record the outcome of Bomber Command sorties. (Richard Harris was originally announced for the role.)\r\nGroup Captain Ramsey RAF, \"the SBO\" (Senior British Officer), was based on Group Captain Herbert Massey, a World War I veteran who had volunteered in World War II. Massey walked with a limp, and in the movie Ramsey walks with a cane. Massey had suffered severe wounds to the same leg in both wars. There would be no escape for him, but as SBO he had to know what was going on. Group Captain Massey was a veteran escaper himself and had been in trouble with the Gestapo. His experience allowed him to offer sound advice to the X-Organisation. Another officer who is likely to have inspired the character of Ramsey was Wing Commander Harry Day.\r\nFlt Lt Colin Blythe RAF, \"The Forger\", was based on Tim Walenn and played by Donald Pleasence. Pleasence himself had served in the Royal Air Force during World War II. He was shot down and spent a year in German prisoner-of-war camp Stalag Luft I. Charles Bronson had been a gunner in the USAAF and had been wounded, but never shot down. Like his character, Danny Valinski, he suffered from claustrophobia because of his childhood work in a mine. James Garner had been a soldier in the Korean War and was twice wounded. He was a scrounger during that time, as is his character.\r\nHannes Messemer's Commandant, \"Colonel von Luger\", was based on Oberst Friedrich Wilhelm von Lindeiner-Wildau. He had been a POW in Russia during World War II and had escaped by walking hundreds of miles to the German border. He was wounded by Russian fire, but was not captured by the Russians. He surrendered to British forces and then spent two years in a POW facility in London known as the London Cage.\r\nAngus Lennie's Flying Officer Archibald Ives, \"The Mole\", was based on Jimmy Kiddel, who was shot dead while trying to scale the fence.\r\nThe film is accurate in showing that only three escapees made home runs, although the people who made them differed from those in the film. The escape of Danny and Willie in the film is based on two Norwegians who escaped by boat to Sweden, Per Bergsland and Jens Müller. The successful escape of James Coburn's Australian character, Sedgwick (\"the Manufacturer\"), via Spain was based on Dutchman Bram van der Stok. Coburn, an American, was cast in the role of Royal Australian Air Force (RAAF) Flying Officer Sedgwick who was an amalgamation of Flt Lt Albert Hake, an Australian serving in the RAF, the camp's compass maker, and Johnny Travis, the real manufacturer.\r\nTilman 'Til Kiwe' Kiver played the German guard \"Frick\", who discovers the escape. Kiwe had been a German paratrooper officer who was captured and held prisoner at a POW camp in Colorado. He made several escape attempts, dyeing his uniform and carrying forged papers. He was captured in the St. Louis train station during one escape attempt. He won the Knight's Cross before his capture and was the cast member who had actually performed many of the exploits shown in the film.\r\nFilming\r\nThe film was made on location in Germany at the Bavaria Film Studio in the Munich suburb of Geiselgasteig in rural Bavaria, where sets for the barrack interiors and tunnels were constructed. The camp was built in a clearing of the Perlacher Forst (Perlacher Forest) near the studio. The German town near the real camp was Sagan (now Żagań, Poland); it was renamed Neustadt in the film. Many scenes were filmed in and around the town of Füssen in Bavaria, including its railway station. The nearby district of Pfronten, with its distinctive St. Nikolaus Church and scenic background, also appears often in the film. The first scenes involving the railway were filmed on the Munich–Holzkirchen line at Großhesselohe station (\"Neustadt\" station in the movie) and near Deisenhofen. Hendley and Blythe's escape from the train was shot on the Munich–Mühldorf railway east of Markt Schwaben. The station where Bartlett, MacDonald and Ashley-Pitt arrive is Füssen station, whereas the scene of Sedgwick (whose theft of a bike was shot in Markt Schwaben) boarding a train was created in Pfronten-Ried station on the Ausserfern Railway. The castle Hendley and Blythe fly by while attempting to escape is Neuschwanstein Castle.\r\nThe motorcycle chase scenes with the barbed wire fences were shot on meadows outside Füssen, and the \"barbed wire\" that Hilts crashes into before being recaptured was simulated by strips of rubber tied around barbless wire, constructed by the cast and crew in their spare time. Insurance concerns prevented McQueen from performing the film's notable motorcycle leap, which was done by his friend and fellow cycle enthusiast Bud Ekins, who resembled McQueen from a distance. When Johnny Carson later tried to congratulate McQueen for the jump during a broadcast of The Tonight Show, McQueen said, \"It wasn't me. That was Bud Ekins.\" However, McQueen and Australian Motocross champion Tim Gibbes both performed the stunt on camera for fun, and according to second unit director Robert Relyea, the stunt in the final cut of the movie could have been performed by any of the three men. Other parts of the chase were done by McQueen, playing both Hilts and the soldiers chasing him, because of his skill on a motorcycle. The motorcycle was a Triumph TR6 Trophy which was painted to look like a German machine. The restored machine is currently on display at Triumph's factory at Hinckley, England.\r\nHistorical accuracy\r\nThe film was largely fictional, with changes made to increase its drama and appeal to an American audience, and to serve as vehicle for its box-office stars. Many details of the actual escape attempt were changed for the film, including the roles of American personnel in both the planning and the escape. While the characters are fictitious, they are based on real men, in most cases being composites of several people. The screenwriters significantly increased the involvement of American POWs; a few American officers in the camp initially helped dig the tunnels and worked on the early plans. However, they were moved away seven months before the escape, which ended their involvement. The real escape was by largely British and other Allied personnel, with the exception of American Johnnie Dodge, who was a British officer. The film omits the crucial role that Canadians played in building the tunnels and in the escape itself. Of the 1,800 or so POWs, 600 were involved in preparations: 150 of those were Canadian. Wally Floody, an RCAF pilot and former miner who was the real-life \"tunnel king\", was engaged as a technical advisor for the film.\r\nRamsey tells Von Luger that it is the sworn duty of every officer to attempt escape. In reality, there was no requirement in the King's Regulations, or in any form of international convention.\r\nThe film shows the tunnel codenamed Tom with its entrance under a stove and Harry's in a drain sump in a washroom. In reality, Dick's entrance was the drain sump, Harry's was under the stove, and Tom's was in a darkened corner next to a stove chimney.\r\nFormer POWs asked the filmmakers to exclude details about the help they received from their home countries, such as maps, papers, and tools hidden in gift packages, lest it jeopardise future POW escapes. The filmmakers complied.\r\nThe film omits any mention that many Germans willingly helped in the escape itself. The film suggests that the forgers were able to make near-exact replicas of just about any pass that was used in Nazi Germany. In reality, the forgers received a great deal of assistance from Germans who lived many hundreds of miles away on the other side of the country. Several German guards, who were openly anti-Nazi, also willingly gave the prisoners items and assistance of any kind to aid their escape. The need for such accuracy produced much eyestrain, but unlike in the film, there were no cases of blindness. Some, such as Frank Knight, gave up forging because of the strain, but he certainly did not suffer the same ocular fate as the character of Colin Blythe in the film. In fact, no one in the film says that Colin Blythe's blindness is the result of eyestrain. He identifies his problem as \"progressive myopia\", suggesting that he has not only heard of the condition but has also been diagnosed.\r\nThe film depicts the escape taking place in ideal weather conditions, whereas at the time much was done in freezing temperatures, and snow lay thick on the ground. In reality there were no escapes by aircraft or motorcycle: McQueen requested the motorcycle sequence, which shows off his skills as a keen motorcyclist. He did the stunt riding himself (except for the final jump, done by Bud Ekins).\r\nIn the film, Hilts incapacitates a German soldier for his motorcycle, Ashley-Pitt kills Kuhn, a Gestapo officer, when he recognizes Bartlett waiting to pass through a Gestapo checkpoint at a railway station and Hendley knocks out a German guard at the airfield. Sedgwick witnesses the killing of German officers at a French Cafe by the French resistance. No German personnel were killed or injured by the escapees.\r\nThree truckloads of recaptured POWs drive in three directions. One truck contains 20 prisoners who are invited to stretch their legs in a field, whereupon they are all machine gunned in a single massacre, with the implication that the other two have the same manner; in reality, the POWs were shot individually or in pairs. The majority of the POWs were killed by pistol shots taken by Gestapo officers; however, at least ten of them were killed in a manner like that portrayed in the film: Dutchy Swain, Chaz Hall, Brian Evans, Wally Valenta, George McGill, Pat Langford, Edgar Humphreys, Adam Kolanowski, Bob Stewart and Henry \"Hank\" Birkland. The film depicts the three prisoners who escape to freedom as British, Polish, and Australian; in reality, they were Norwegian (Jens Müller and Per Bergsland) and Dutch (Bram van der Stok).\r\nIn 2009, seven POWs returned to Stalag Luft III for the 65th anniversary of the escape and watched the film. According to the veterans, many details of the first half depicting life in the camp were authentic, e.g. the death of Ives, who tries to scale the fence, and the actual digging of the tunnels. The film has kept the memory of the 50 executed airmen alive for decades and has made their story known worldwide, if in a distorted form. British author Guy Walters notes that a pivotal scene in the film where MacDonald blunders by replying in English to a suspicious Gestapo officer saying, \"Good luck\", is now so strongly imprinted that historians have accepted it as a real event, and that it was Bushell's partner Bernard Scheidhauer who made the error. However, Walters points out that an historical account says that one of the two men said \"yes\" in English in response to a Kripo man's questions without any mention of \"good luck\" and notes that as Scheidhauser was French, and Bushell's first language was English, it seems likely that if a slip did take place, it was made by Bushell himself, and says the \"good luck\" scene should be regarded as fiction.\r\nMusic\r\nThe film's iconic music was composed by Elmer Bernstein, who gave each major character their own musical motif based on the Great Escape's main theme. Its enduring popularity helped Bernstein live off the score's royalties for the rest of his life. Critics have said the film score succeeds because it uses rousing militaristic motifs with interludes of warmer softer themes that humanizes the prisoners and endears them to audiences; the music also captures the bravery and defiance of the POWs. The main title's patriotic march has since become popular in Britain, particularly with sports such as fans of the England national football team. However, in 2016, the sons of Elmer Bernstein openly criticized the use of the Great Escape theme by the Vote Leave campaign in the UK Brexit referendum, saying \"Our father would never have allowed UKIP to use his music\" because he would have strongly opposed the party.\r\nIn 2011 Intrada, a company specializing in film soundtracks, released a digitized re-mastered version of the full film score based on the original 1/4\" two-track stereo sessions and original 1/2\" three-channel stereo masters.\r\nDisc one\r\nDisc two\r\nDisc three\r\nReception\r\nBox office\r\nThe Great Escape grossed $11.7 million at the box office, after a budget of $4 million. It became one of the highest-grossing films of 1963, despite heavy competition. In the years since its release, its audience has broadened, cementing its status as a cinema classic. It was entered into the 3rd Moscow International Film Festival, where McQueen won the Silver Prize for Best Actor.\r\nCritical response\r\nContemporary reviews for the film were mostly positive. In 1963, The New York Times critic Bosley Crowther wrote: \"But for much longer than is artful or essential, The Great Escape grinds out its tormenting story without a peek beneath the surface of any man, without a real sense of human involvement. It's a strictly mechanical adventure with make-believe men.\" British film critic Leslie Halliwell described it as \"pretty good but overlong POW adventure with a tragic ending\". The Time magazine reviewer wrote in 1963: \"The use of colour photography is unnecessary and jarring, but little else is wrong with this film. With accurate casting, a swift screenplay, and authentic German settings, Producer-Director John Sturges has created classic cinema of action. There is no sermonizing, no soul probing, no sex. The Great Escape is simply great escapism\".\r\nModern appraisals\r\nThe Great Escape continues to receive acclaim from modern critics. On review aggregator Rotten Tomatoes, the film holds an approval rating of 94% based on 53 reviews. The site's critics consensus reads, \"With its impeccably slow-building story and a cast for the ages, The Great Escape is an all-time action classic.\"\r\nIn a 2006 poll in the United Kingdom, regarding the family film that television viewers would most want to see on Christmas Day, The Great Escape came in third, and was first among the choices of male viewers. In an article for the British Film Institute, \"10 great prisoner of war films\", updated in August 2018, Samuel Wigley wrote that watching films like The Great Escape and the 1955 British film The Colditz Story, \"for all their moments of terror and tragedy, is to delight in captivity in times of war as a wonderful game for boys, an endless Houdini challenge to slip through the enemy's fingers. Often based on true stories of escape, they have the viewer marvelling at the ingenuity and seemingly unbreakable spirit of imprisoned soldiers.\" He described The Great Escape as \"the epitome of the war-is-fun action film\", which became \"a fixture of family TV viewing\".\r\nAccolades\r\nNominated Academy Award for Film Editing (Ferris Webster)\r\nNominated Golden Globe Award for Best Picture\r\nWinner Moscow International Film Festival Best Actor (Steve McQueen)\r\nNominated Moscow International Film Festival Grand Prix (John Sturges)\r\nSelected National Board of Review Top Ten Films of Year\r\nNominated Writers Guild of America Best Written American Drama (James Clavell, W. R. Burnett) (Screenplay Adaptation)\r\n19th place in AFI's 100 Years...100 Thrills\r\nLegacy\r\nOn 24 March 2014, the 70th anniversary of the escape, the RAF staged a commemoration of the escape attempt, with 50 serving personnel each carrying a photograph of one of the shot men.\r\nOn 24 March 2019, the RAF held another event for the 75th anniversary of the escape. There was a screening of the film at London's Eventim Hammersmith Apollo, hosted by Dan Snow. The film was simulcast with other cinemas throughout the UK.\r\nSequel\r\nA fictional, made-for-television sequel, The Great Escape II: The Untold Story, was released in 1988, with Christopher Reeve, and directed by Jud Taylor (who played 2nd Lt. Goff in the 1963 film). The film is not a true sequel, as it dramatizes the escape itself just as the original film does, although mostly using the real names of the individuals involved (whereas the original film fictionalized them and used composite characters). It depicts the search for the culprits responsible for the murder of the 50 Allied officers. Donald Pleasence appears in a supporting role as a member of the SS.\r\nIn popular culture\r\nThe Great Escape (1986) was released for the Commodore 64, ZX Spectrum and DOS platforms, and shares a title and similar plot to the movie. The game follows an unnamed prisoner of war who has been interned in a POW camp somewhere in northern Germany in 1942.\r\nThe Great Escape (2003) was released for Microsoft Windows, Xbox and PlayStation 2. The plotline follows that of the film, except there are also levels featuring some of the characters' first captures and early escape attempts, as well as a changed ending.\r\nThe film is mentioned and heavily referenced in Metal Gear Solid 3: Snake Eater.\r\nThe films Chicken Run, Reservoir Dogs, the 1998 remake of The Parent Trap, Top Secret!, Charlie's Angels, The Tao of Steve, and Naked Gun 33 1/3: The Final Insult, Inglorious Bastards all contain references or homages to the film.\r\nMonty Python's Flying Circus, The Simpsons, Hogan's Heroes, Nash Bridges, Seinfeld, Get Smart, Fugget About It, Archer, Goodness Gracious Me, Shaun the Sheep, and Red Dwarf have all parodied or paid homage to the film.\r\nBernstein's Great Escape theme tune has been taken up by the Pukka Pies England Band, a small brass band who have played in the crowd at England football team matches since 1996. They released an arrangement of the theme as a single for the 1998 FIFA World Cup and a newer version for UEFA Euro 2000.",
    "html": "<p>The Great Escape is a 1963 American epic war suspense adventure film starring Steve McQueen, James Garner and Richard Attenborough and featuring James Donald, Charles Bronson, Donald Pleasence, James Coburn, Hannes Messemer, David McCallum, Gordon Jackson, John Leyton and Angus Lennie. It was filmed in Panavision, and its musical score was composed by Elmer Bernstein.</p><p>Based on Paul Brickhill's 1950 non-fiction book of the same name, the film depicts a heavily fictionalized version of the mass escape by British Commonwealth prisoners of war from German POW camp Stalag Luft III in the Second World War. The film made numerous compromises for its commercial appeal, such as its depiction in regards to American involvement in the escape.</p><p>The Great Escape was made by The Mirisch Company, released by United Artists, and produced and directed by John Sturges. The film had its Royal World Premiere at the Odeon Leicester Square in London's West End on 20 June 1963. The Great Escape received critical acclaim and emerged as one of the highest-grossing films of the year, winning McQueen the award for Best Actor at the Moscow International Film Festival, and is considered a classic. The film is also noted for its motorcycle chase and jump scene, which is considered one of the best stunts ever performed.</p><br/><h3>Plot</h3><p>In 1942, the German Army is wasting significant manpower on catching escapees from POW camps across occupied Europe. The most persistent offenders are moved to Stalag Luft III, a new max-security camp near the Polish border, under the command of Luftwaffe Colonel von Luger. Von Luger tells British Group Captain Ramsey—the highest-ranked officer in captivity and de facto leader of the Allied prisoners—that trying to escape from this new facility will be futile.</p><p>It soon becomes clear that the guards are trained to spot methods the POWs successfully used at other camps. USAAF Captain Virgil Hilts, a notoriously prolific escapee, discovers a blind spot between two guard towers but purposefully gets caught so as not to prematurely raise suspicions. He is sentenced to solitary isolation (“the cooler”) in a cell next to RAF airman Ives, with whom he becomes friends.</p><p>With Ramsey's tacit approval, Squadron Leader Roger Bartlett establishes \"the X Organisation\", a secret escape-planning committee. Bartlett has an audacious plan: breaking out 250 men at once with a tunnel, to waste as much German manpower as possible on recapturing them all. The men begin working on three tunnels simultaneously: \"Tom\", \"Dick\", and \"Harry\".</p><p>Each POW brings their specialist skills to the plan. Hendley secures vital objects on the black market, and forms a bond with Blythe, an expert document forger. Sedgwick makes picks and air bellows for the tunnels, while Welinski and Dickes oversee the digging. MacDonald gathers intelligence, Griffith makes civilian disguises, and Ashley-Pitt devises a method of hiding dirt from the tunnels. Noise from digging is masked by a prisoners' choir, led by Cavendish, who also surveys the tunnels' routes. Bartlett also approaches Hilts and asks him to escape again, scout out the surrounding area, then allow himself to be recaptured so he can draw maps for the main escape. Hilts refuses to be deliberately recaptured out of pride.</p><p>When \"Tom\" nears completion first, Bartlett orders \"Dick\" and \"Harry\" sealed off. Hilts, Hendley, and Goff brew potato moonshine with a homemade still and celebrate the Fourth of July with the entire camp, but during the party the camp guards discover \"Tom\". A despondent Ives snaps, frantically climbs the barbed wire fence and is shot dead. Hilts, shaken by Ives' death, agrees to be deliberately recaptured after his next escape attempt. Bartlett switches the prisoners' efforts to \"Harry\", but after the tunnel partially collapses, Welinski has a breakdown and confides in Dickes that he is actually claustrophobic. He tries to break out through the fence, but Dickes manages to calm him down. Blythe realizes that he's going blind due to progressive myopia, and Hendley takes it upon himself to be Blythe's eyes during the escape.</p><p>The last part of the tunnel is completed, but when they break the surface, the end is 20 feet (6 m) short of the treeline, well within sight of the guards. Hilts goes first with a rope, tugging on it to signal when it's safe for each man to come out, and multiple POWs escape amidst an air raid blackout. However, Cavendish slips and makes a noise, drawing a guard. An impatient Griffith, unaware that the guard is standing directly over the hole, exits and is captured, ending the breakout.</p><p>The 76 escapees scatter throughout Europe. Cavendish hitches a ride on a truck, but is turned in by the driver. Hilts steals a motorcycle, heads for the German-Swiss border and tries to jump the fence, but is recaptured. Hendley, Blythe, Ashley-Pitt, Bartlett, McDonald, Nimmo, and Haynes board a train, but Hendley and Blythe jump off when they see soldiers conducting ID checks. They steal a plane to fly to Switzerland, but crash when the engine fails. Blythe is shot and Hendley recaptured.</p><p>At a railway station, Kuhn, a Gestapo officer from the camp, is with the soldiers searching the disembarking passengers for escapees. Ashley-Pitt shoots Kuhn to stop him from catching Bartlett, sacrificing himself so that the others can escape. However, the men are still caught when another Gestapo officer tricks MacDonald into speaking English while boarding a bus. Eventually, all but three of the POWs are recaptured: Welinski and Dickes row a small boat to the sea and stow away on a ship to Sweden, while Sedgwick makes it to France, where the Resistance smuggles him to Spain.</p><p>Most of the men are grouped together, then loaded into trucks for what they assume is a journey back to the camp. However, they are instead taken to a field and shot on Hitler's direct orders. An ashamed von Luger tells Ramsey that fifty escapees were killed, is relieved of command and driven to an uncertain fate. Hilts returns and is sent to the cooler, where he begins planning his next escape.</p><br/><h3>Cast</h3><ul><li>Steve McQueen as Captain Virgil Hilts 'The Cooler King': one of three Americans in the camp, Hilts irritates his captors with frequent escape attempts and his irreverent attitude, to the point that he is regularly confined in isolation in the cooler. He has a habit of bouncing a baseball against the cooler cell wall to entertain himself, as he plans an escape attempt.</li><li>James Garner as Flight Lieutenant Bob Hendley 'The Scrounger': an American in an RAF Eagle Squadron who is responsible for finding materials that will be necessary for the POWs during the escape attempt and on the outside.</li><li>Richard Attenborough as Squadron Leader Roger Bartlett 'Big X': an ambitious RAF officer, who has developed an intense hatred for the Nazis after his transfer of captivity from the Gestapo. Bartlett, a veteran escaper, is the ringleader of the escape committee and declares his intention for a mass breakout is to waste German manpower.</li><li>James Donald as Group Captain Ramsey 'The SBO': the Senior British Officer and de facto commanding officer of the prisoners. He serves as an intermediary between the POWs and the Germans. Ramsey is taken aback at the possible consequences of Bartlett's plan but supports it.</li><li>Charles Bronson as Flight Lieutenant Danny Welinski 'Tunnel King': a Polish émigré who escaped Nazi-held Poland and went to England to continue to fight against the Germans. He suffers from claustrophobia and is fearful of tunnel collapses, primarily coming from his experience of having dug 17 escape tunnels.</li><li>Donald Pleasence as Flight Lieutenant Colin Blythe 'The Forger': a mild-mannered and good-natured master forger with a love of bird-watching who requires paper, inks, a camera, and current travel documents to copy. Hendley strikes a friendship with him.</li><li>James Coburn as Flying Officer Sedgwick 'The Manufacturer': an Australian officer who constructs objects necessary to implement the escape.</li><li>Hannes Messemer as Oberst von Luger 'The Kommandant': the Commandant of the camp and a senior Luftwaffe officer, von Luger is very civil with the POWs, and is openly anti-Nazi, having a dislike for the SS and Gestapo. When the Gestapo orders that Bartlett receive strict confinement, von Luger makes a passing note of it and instead shows sympathy for Bartlett.</li><li>David McCallum as Lieutenant-Commander Eric Ashley-Pitt 'Dispersal': a Fleet Air Arm officer who finds an ingenious way to get rid of the dirt being brought up from the tunnels.</li><li>Gordon Jackson as Flight Lieutenant Andy MacDonald 'Intelligence': Bartlett's second-in-command in planning the escape.</li><li>John Leyton as Flight Lieutenant Willie Dickes 'Tunnel King': Danny's best friend, who seeks to encourage Danny during his struggles with claustrophobia.</li><li>Angus Lennie as Flying Officer Archie Ives 'The Mole': a Scottish airman who has an intense desire to escape, leading him to the precipice of paranoia.</li><li>Nigel Stock as Flight Lieutenant Dennis Cavendish 'The Surveyor': a Flight Lieutenant who has an important duty for the building of the tunnel.</li><li>Robert Graf as Werner 'The Ferret': a young, naive guard, with whom Hendley forms a friendship, which he exploits as a means of obtaining travel documents and other needed items.</li><li>Jud Taylor as Second Lieutenant Goff: the third American in the camp.</li><li>Hans Reiser as Kuhn: a Gestapo officer, and an ardent Nazi, he orders von Luger that Bartlett be kept under the most restrictive permanent security confinement, which von Luger only makes a note of. He is critical of the Luftwaffe's fair treatment of the prisoners, and believes the camp should be brought under the control of the Gestapo and SS. Kuhn warns Bartlett that if he escapes again, he will be shot on his next capture.</li><li>Harry Riebauer as Stabsfeldwebel Strachwitz, the senior NCO amongst the German guards.</li><li>William Russell as Sorren 'Security', a British officer.</li><li>Robert Freitag as Hauptmann Posen, von Luger's adjutant.</li><li>Ulrich Beiger as Preissen: a Gestapo officer, and an ardent Nazi. He has a condescending attitude.</li><li>George Mikell as SD Hauptsturmführer Dietrich: one of the SS officers.</li><li>Lawrence Montaigne as Haynes 'Diversions', a Canadian officer.</li><li>Robert Desmond as Griffith 'Tailor', a British officer responsible for supplying clothes for the POWs for the escape.</li><li>Til Kiwe as Frick</li><li>Heinz Weiss as Kramer</li><li>Tom Adams as Dai Nimmo 'Diversions', a Welsh officer.</li><li>Karl-Otto Alberty as SD Untersturmführer Steinach: one of the SS officers.</li></ul><br/><h3>Production</h3><h4>Writing</h4><p>In 1963, the Mirisch brothers worked with United Artists to adapt Paul Brickhill's 1950 book The Great Escape. Brickhill had been a very minor member of the X Organisation at Stalag Luft III, who acted as one of the \"stooges\" who monitored German movements in the camp. The story had been adapted as a live TV production, screened by NBC as an episode of The Philco Television Playhouse on January 27, 1951. The live broadcast was praised for engineering an ingenious set design for the live broadcast, including creating the illusion of tunnels. The film's screenplay was adapted by James Clavell, W. R. Burnett, and Walter Newman.</p><h4>Casting</h4><p>Steve McQueen has been credited with the most significant performance. Critic Leonard Maltin wrote that \"the large, international cast is superb, but the standout is McQueen; it's easy to see why this cemented his status as a superstar\". This film established his box-office clout. Hilts was based on at least three pilots, David M. Jones, John Dortch Lewis, and Bill Ash.</p><p>Richard Attenborough's Sqn Ldr Roger Bartlett RAF, \"Big X\", was based on Roger Bushell, the South African-born British POW who was the mastermind of the real Great Escape. This was the film that first brought Attenborough to common notice in the United States. During World War II, Attenborough served in the Royal Air Force. He volunteered to fly with the Film Unit and after further training (where he sustained permanent ear damage) he qualified as a sergeant. He flew on several missions over Europe, filming from the rear gunner's position to record the outcome of Bomber Command sorties. (Richard Harris was originally announced for the role.)</p><p>Group Captain Ramsey RAF, \"the SBO\" (Senior British Officer), was based on Group Captain Herbert Massey, a World War I veteran who had volunteered in World War II. Massey walked with a limp, and in the movie Ramsey walks with a cane. Massey had suffered severe wounds to the same leg in both wars. There would be no escape for him, but as SBO he had to know what was going on. Group Captain Massey was a veteran escaper himself and had been in trouble with the Gestapo. His experience allowed him to offer sound advice to the X-Organisation. Another officer who is likely to have inspired the character of Ramsey was Wing Commander Harry Day.</p><p>Flt Lt Colin Blythe RAF, \"The Forger\", was based on Tim Walenn and played by Donald Pleasence. Pleasence himself had served in the Royal Air Force during World War II. He was shot down and spent a year in German prisoner-of-war camp Stalag Luft I. Charles Bronson had been a gunner in the USAAF and had been wounded, but never shot down. Like his character, Danny Valinski, he suffered from claustrophobia because of his childhood work in a mine. James Garner had been a soldier in the Korean War and was twice wounded. He was a scrounger during that time, as is his character.</p><p>Hannes Messemer's Commandant, \"Colonel von Luger\", was based on Oberst Friedrich Wilhelm von Lindeiner-Wildau. He had been a POW in Russia during World War II and had escaped by walking hundreds of miles to the German border. He was wounded by Russian fire, but was not captured by the Russians. He surrendered to British forces and then spent two years in a POW facility in London known as the London Cage.</p><p>Angus Lennie's Flying Officer Archibald Ives, \"The Mole\", was based on Jimmy Kiddel, who was shot dead while trying to scale the fence.</p><p>The film is accurate in showing that only three escapees made home runs, although the people who made them differed from those in the film. The escape of Danny and Willie in the film is based on two Norwegians who escaped by boat to Sweden, Per Bergsland and Jens Müller. The successful escape of James Coburn's Australian character, Sedgwick (\"the Manufacturer\"), via Spain was based on Dutchman Bram van der Stok. Coburn, an American, was cast in the role of Royal Australian Air Force (RAAF) Flying Officer Sedgwick who was an amalgamation of Flt Lt Albert Hake, an Australian serving in the RAF, the camp's compass maker, and Johnny Travis, the real manufacturer.</p><p>Tilman 'Til Kiwe' Kiver played the German guard \"Frick\", who discovers the escape. Kiwe had been a German paratrooper officer who was captured and held prisoner at a POW camp in Colorado. He made several escape attempts, dyeing his uniform and carrying forged papers. He was captured in the St. Louis train station during one escape attempt. He won the Knight's Cross before his capture and was the cast member who had actually performed many of the exploits shown in the film.</p><h4>Filming</h4><p>The film was made on location in Germany at the Bavaria Film Studio in the Munich suburb of Geiselgasteig in rural Bavaria, where sets for the barrack interiors and tunnels were constructed. The camp was built in a clearing of the Perlacher Forst (Perlacher Forest) near the studio. The German town near the real camp was Sagan (now Żagań, Poland); it was renamed Neustadt in the film. Many scenes were filmed in and around the town of Füssen in Bavaria, including its railway station. The nearby district of Pfronten, with its distinctive St. Nikolaus Church and scenic background, also appears often in the film. The first scenes involving the railway were filmed on the Munich–Holzkirchen line at Großhesselohe station (\"Neustadt\" station in the movie) and near Deisenhofen. Hendley and Blythe's escape from the train was shot on the Munich–Mühldorf railway east of Markt Schwaben. The station where Bartlett, MacDonald and Ashley-Pitt arrive is Füssen station, whereas the scene of Sedgwick (whose theft of a bike was shot in Markt Schwaben) boarding a train was created in Pfronten-Ried station on the Ausserfern Railway. The castle Hendley and Blythe fly by while attempting to escape is Neuschwanstein Castle.</p><p>The motorcycle chase scenes with the barbed wire fences were shot on meadows outside Füssen, and the \"barbed wire\" that Hilts crashes into before being recaptured was simulated by strips of rubber tied around barbless wire, constructed by the cast and crew in their spare time. Insurance concerns prevented McQueen from performing the film's notable motorcycle leap, which was done by his friend and fellow cycle enthusiast Bud Ekins, who resembled McQueen from a distance. When Johnny Carson later tried to congratulate McQueen for the jump during a broadcast of The Tonight Show, McQueen said, \"It wasn't me. That was Bud Ekins.\" However, McQueen and Australian Motocross champion Tim Gibbes both performed the stunt on camera for fun, and according to second unit director Robert Relyea, the stunt in the final cut of the movie could have been performed by any of the three men. Other parts of the chase were done by McQueen, playing both Hilts and the soldiers chasing him, because of his skill on a motorcycle. The motorcycle was a Triumph TR6 Trophy which was painted to look like a German machine. The restored machine is currently on display at Triumph's factory at Hinckley, England.</p><br/><h3>Historical accuracy</h3><p>The film was largely fictional, with changes made to increase its drama and appeal to an American audience, and to serve as vehicle for its box-office stars. Many details of the actual escape attempt were changed for the film, including the roles of American personnel in both the planning and the escape. While the characters are fictitious, they are based on real men, in most cases being composites of several people. The screenwriters significantly increased the involvement of American POWs; a few American officers in the camp initially helped dig the tunnels and worked on the early plans. However, they were moved away seven months before the escape, which ended their involvement. The real escape was by largely British and other Allied personnel, with the exception of American Johnnie Dodge, who was a British officer. The film omits the crucial role that Canadians played in building the tunnels and in the escape itself. Of the 1,800 or so POWs, 600 were involved in preparations: 150 of those were Canadian. Wally Floody, an RCAF pilot and former miner who was the real-life \"tunnel king\", was engaged as a technical advisor for the film.</p><p>Ramsey tells Von Luger that it is the sworn duty of every officer to attempt escape. In reality, there was no requirement in the King's Regulations, or in any form of international convention.</p><p>The film shows the tunnel codenamed Tom with its entrance under a stove and Harry's in a drain sump in a washroom. In reality, Dick's entrance was the drain sump, Harry's was under the stove, and Tom's was in a darkened corner next to a stove chimney.</p><p>Former POWs asked the filmmakers to exclude details about the help they received from their home countries, such as maps, papers, and tools hidden in gift packages, lest it jeopardise future POW escapes. The filmmakers complied.</p><p>The film omits any mention that many Germans willingly helped in the escape itself. The film suggests that the forgers were able to make near-exact replicas of just about any pass that was used in Nazi Germany. In reality, the forgers received a great deal of assistance from Germans who lived many hundreds of miles away on the other side of the country. Several German guards, who were openly anti-Nazi, also willingly gave the prisoners items and assistance of any kind to aid their escape. The need for such accuracy produced much eyestrain, but unlike in the film, there were no cases of blindness. Some, such as Frank Knight, gave up forging because of the strain, but he certainly did not suffer the same ocular fate as the character of Colin Blythe in the film. In fact, no one in the film says that Colin Blythe's blindness is the result of eyestrain. He identifies his problem as \"progressive myopia\", suggesting that he has not only heard of the condition but has also been diagnosed.</p><p>The film depicts the escape taking place in ideal weather conditions, whereas at the time much was done in freezing temperatures, and snow lay thick on the ground. In reality there were no escapes by aircraft or motorcycle: McQueen requested the motorcycle sequence, which shows off his skills as a keen motorcyclist. He did the stunt riding himself (except for the final jump, done by Bud Ekins).</p><p>In the film, Hilts incapacitates a German soldier for his motorcycle, Ashley-Pitt kills Kuhn, a Gestapo officer, when he recognizes Bartlett waiting to pass through a Gestapo checkpoint at a railway station and Hendley knocks out a German guard at the airfield. Sedgwick witnesses the killing of German officers at a French Cafe by the French resistance. No German personnel were killed or injured by the escapees.</p><p>Three truckloads of recaptured POWs drive in three directions. One truck contains 20 prisoners who are invited to stretch their legs in a field, whereupon they are all machine gunned in a single massacre, with the implication that the other two have the same manner; in reality, the POWs were shot individually or in pairs. The majority of the POWs were killed by pistol shots taken by Gestapo officers; however, at least ten of them were killed in a manner like that portrayed in the film: Dutchy Swain, Chaz Hall, Brian Evans, Wally Valenta, George McGill, Pat Langford, Edgar Humphreys, Adam Kolanowski, Bob Stewart and Henry \"Hank\" Birkland. The film depicts the three prisoners who escape to freedom as British, Polish, and Australian; in reality, they were Norwegian (Jens Müller and Per Bergsland) and Dutch (Bram van der Stok).</p><p>In 2009, seven POWs returned to Stalag Luft III for the 65th anniversary of the escape and watched the film. According to the veterans, many details of the first half depicting life in the camp were authentic, e.g. the death of Ives, who tries to scale the fence, and the actual digging of the tunnels. The film has kept the memory of the 50 executed airmen alive for decades and has made their story known worldwide, if in a distorted form. British author Guy Walters notes that a pivotal scene in the film where MacDonald blunders by replying in English to a suspicious Gestapo officer saying, \"Good luck\", is now so strongly imprinted that historians have accepted it as a real event, and that it was Bushell's partner Bernard Scheidhauer who made the error. However, Walters points out that an historical account says that one of the two men said \"yes\" in English in response to a Kripo man's questions without any mention of \"good luck\" and notes that as Scheidhauser was French, and Bushell's first language was English, it seems likely that if a slip did take place, it was made by Bushell himself, and says the \"good luck\" scene should be regarded as fiction.</p><br/><h3>Music</h3><p>The film's iconic music was composed by Elmer Bernstein, who gave each major character their own musical motif based on the Great Escape's main theme. Its enduring popularity helped Bernstein live off the score's royalties for the rest of his life. Critics have said the film score succeeds because it uses rousing militaristic motifs with interludes of warmer softer themes that humanizes the prisoners and endears them to audiences; the music also captures the bravery and defiance of the POWs. The main title's patriotic march has since become popular in Britain, particularly with sports such as fans of the England national football team. However, in 2016, the sons of Elmer Bernstein openly criticized the use of the Great Escape theme by the Vote Leave campaign in the UK Brexit referendum, saying \"Our father would never have allowed UKIP to use his music\" because he would have strongly opposed the party.</p><p>In 2011 Intrada, a company specializing in film soundtracks, released a digitized re-mastered version of the full film score based on the original 1/4\" two-track stereo sessions and original 1/2\" three-channel stereo masters.</p><h4>Disc one</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Original Motion Picture Soundtrack</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Main Title\"</td><td class=\"tracklist-length\">2:30</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"At First Glance\"</td><td class=\"tracklist-length\">3:07</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Premature Plans\"</td><td class=\"tracklist-length\">2:28</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"If At Once\"</td><td class=\"tracklist-length\">2:31</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Forked\"</td><td class=\"tracklist-length\">1:28</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Cooler\"</td><td class=\"tracklist-length\">1:59</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Mole\"</td><td class=\"tracklist-length\">1:28</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"\"X\"/Tonight We Dig\"</td><td class=\"tracklist-length\">1:30</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"The Scrounger/Blythe\"</td><td class=\"tracklist-length\">3:50</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Water Faucet\"</td><td class=\"tracklist-length\">1:23</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Interruptus\"</td><td class=\"tracklist-length\">1:33</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"The Plan/The Sad Ives\"</td><td class=\"tracklist-length\">1:43</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Green Thumbs\"</td><td class=\"tracklist-length\">2:28</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Hilts And Ives\"</td><td class=\"tracklist-length\">0:38</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Cave In\"</td><td class=\"tracklist-length\">2:01</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Restless Men\"</td><td class=\"tracklist-length\">1:56</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Booze\"</td><td class=\"tracklist-length\">1:47</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"\"Yankee Doodle\"\"</td><td class=\"tracklist-length\">0:55</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Discovery\"</td><td class=\"tracklist-length\">3:40</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>57:35</td></tr></tbody></table><h4>Disc two</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Original Motion Picture Soundtrack (Continued)</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Various Troubles\"</td><td class=\"tracklist-length\">3:52</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Panic\"</td><td class=\"tracklist-length\">2:05</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Pin Trick\"</td><td class=\"tracklist-length\">0:59</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Hendley's Risk\"</td><td class=\"tracklist-length\">1:43</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Released Again/Escape Time\"</td><td class=\"tracklist-length\">5:25</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"20 Feet Short\"</td><td class=\"tracklist-length\">3:06</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Foul Up\"</td><td class=\"tracklist-length\">2:37</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"At The Station\"</td><td class=\"tracklist-length\">1:33</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"On The Road\"</td><td class=\"tracklist-length\">3:27</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"The Chase/First Casualty\"</td><td class=\"tracklist-length\">6:49</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Flight Plan\"</td><td class=\"tracklist-length\">2:09</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"More Action/Hilts Captured\"</td><td class=\"tracklist-length\">6:07</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Road's End\"</td><td class=\"tracklist-length\">2:06</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Betrayal\"</td><td class=\"tracklist-length\">2:20</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Three Gone/Home Again\"</td><td class=\"tracklist-length\">3:13</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Finale/The Cast\"</td><td class=\"tracklist-length\">2:47</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>1:18:58</td></tr></tbody></table><h4>Disc three</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Original 1963 United Artists Score Album</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Main Title\"</td><td class=\"tracklist-length\">2:07</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Premature Plans\"</td><td class=\"tracklist-length\">2:08</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Cooler And Mole\"</td><td class=\"tracklist-length\">2:26</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Blythe\"</td><td class=\"tracklist-length\">2:13</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Discovery\"</td><td class=\"tracklist-length\">2:54</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Various Troubles\"</td><td class=\"tracklist-length\">2:40</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"On The Road\"</td><td class=\"tracklist-length\">2:54</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Betrayal\"</td><td class=\"tracklist-length\">2:05</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Hendley's Risk\"</td><td class=\"tracklist-length\">2:24</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Road's End\"</td><td class=\"tracklist-length\">2:00</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"More Action\"</td><td class=\"tracklist-length\">1:57</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"The Chase\"</td><td class=\"tracklist-length\">2:49</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Finale\"</td><td class=\"tracklist-length\">3:14</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>49:11</td></tr></tbody></table><br/><h3>Reception</h3><h4>Box office</h4><p>The Great Escape grossed $11.7 million at the box office, after a budget of $4 million. It became one of the highest-grossing films of 1963, despite heavy competition. In the years since its release, its audience has broadened, cementing its status as a cinema classic. It was entered into the 3rd Moscow International Film Festival, where McQueen won the Silver Prize for Best Actor.</p><h4>Critical response</h4><p>Contemporary reviews for the film were mostly positive. In 1963, The New York Times critic Bosley Crowther wrote: \"But for much longer than is artful or essential, The Great Escape grinds out its tormenting story without a peek beneath the surface of any man, without a real sense of human involvement. It's a strictly mechanical adventure with make-believe men.\" British film critic Leslie Halliwell described it as \"pretty good but overlong POW adventure with a tragic ending\". The Time magazine reviewer wrote in 1963: \"The use of colour photography is unnecessary and jarring, but little else is wrong with this film. With accurate casting, a swift screenplay, and authentic German settings, Producer-Director John Sturges has created classic cinema of action. There is no sermonizing, no soul probing, no sex. The Great Escape is simply great escapism\".</p><h4>Modern appraisals</h4><p>The Great Escape continues to receive acclaim from modern critics. On review aggregator Rotten Tomatoes, the film holds an approval rating of 94% based on 53 reviews. The site's critics consensus reads, \"With its impeccably slow-building story and a cast for the ages, The Great Escape is an all-time action classic.\"</p><p>In a 2006 poll in the United Kingdom, regarding the family film that television viewers would most want to see on Christmas Day, The Great Escape came in third, and was first among the choices of male viewers. In an article for the British Film Institute, \"10 great prisoner of war films\", updated in August 2018, Samuel Wigley wrote that watching films like The Great Escape and the 1955 British film The Colditz Story, \"for all their moments of terror and tragedy, is to delight in captivity in times of war as a wonderful game for boys, an endless Houdini challenge to slip through the enemy's fingers. Often based on true stories of escape, they have the viewer marvelling at the ingenuity and seemingly unbreakable spirit of imprisoned soldiers.\" He described The Great Escape as \"the epitome of the war-is-fun action film\", which became \"a fixture of family TV viewing\".</p><h4>Accolades</h4><ul><li>Nominated Academy Award for Film Editing (Ferris Webster)</li><li>Nominated Golden Globe Award for Best Picture</li><li>Winner Moscow International Film Festival Best Actor (Steve McQueen)</li><li>Nominated Moscow International Film Festival Grand Prix (John Sturges)</li><li>Selected National Board of Review Top Ten Films of Year</li><li>Nominated Writers Guild of America Best Written American Drama (James Clavell, W. R. Burnett) (Screenplay Adaptation)</li><li>19th place in AFI's 100 Years...100 Thrills</li></ul><h4>Legacy</h4><p>On 24 March 2014, the 70th anniversary of the escape, the RAF staged a commemoration of the escape attempt, with 50 serving personnel each carrying a photograph of one of the shot men.</p><p>On 24 March 2019, the RAF held another event for the 75th anniversary of the escape. There was a screening of the film at London's Eventim Hammersmith Apollo, hosted by Dan Snow. The film was simulcast with other cinemas throughout the UK.</p><br/><h3>Sequel</h3><p>A fictional, made-for-television sequel, The Great Escape II: The Untold Story, was released in 1988, with Christopher Reeve, and directed by Jud Taylor (who played 2nd Lt. Goff in the 1963 film). The film is not a true sequel, as it dramatizes the escape itself just as the original film does, although mostly using the real names of the individuals involved (whereas the original film fictionalized them and used composite characters). It depicts the search for the culprits responsible for the murder of the 50 Allied officers. Donald Pleasence appears in a supporting role as a member of the SS.</p><br/><h3>In popular culture</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This article <b>appears to contain <span>trivial, minor, or unrelated</span> references to <span>popular culture</span></b>.<span class=\"hide-when-compact\"> Please reorganize this content to explain the subject's impact on popular culture, <span>providing citations</span> to <span>reliable, secondary sources</span>, rather than simply listing appearances. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">November 2022</span>)</i></span></div></td></tr></tbody></table><ul><li>The Great Escape (1986) was released for the Commodore 64, ZX Spectrum and DOS platforms, and shares a title and similar plot to the movie. The game follows an unnamed prisoner of war who has been interned in a POW camp somewhere in northern Germany in 1942.</li><li>The Great Escape (2003) was released for Microsoft Windows, Xbox and PlayStation 2. The plotline follows that of the film, except there are also levels featuring some of the characters' first captures and early escape attempts, as well as a changed ending.</li><li>The film is mentioned and heavily referenced in Metal Gear Solid 3: Snake Eater.</li><li>The films Chicken Run, Reservoir Dogs, the 1998 remake of The Parent Trap, Top Secret!, Charlie's Angels, The Tao of Steve, and Naked Gun 33 1/3: The Final Insult, Inglorious Bastards all contain references or homages to the film.</li><li>Monty Python's Flying Circus, The Simpsons, Hogan's Heroes, Nash Bridges, Seinfeld, Get Smart, Fugget About It, Archer, Goodness Gracious Me, Shaun the Sheep, and Red Dwarf have all parodied or paid homage to the film.</li><li>Bernstein's Great Escape theme tune has been taken up by the Pukka Pies England Band, a small brass band who have played in the crowd at England football team matches since 1996. They released an arrangement of the theme as a single for the 1998 FIFA World Cup and a newer version for UEFA Euro 2000.</li></ul><br/>"
  },
  "errorMessage": ""
}