{
  "imDbId": "tt0110413",
  "title": "Léon: The Professional",
  "fullTitle": "Léon: The Professional (1994)",
  "type": "Movie",
  "year": "1994",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "91",
      "content": "Ah, monsieur, you can lead a Frenchman to the Big Apple, but you can't make him a New Yorker -- and that's exactly what makes The Professional so fascinating."
    },
    {
      "publisher": "Washington Post",
      "author": "Hal Hinson",
      "link": "",
      "rate": "90",
      "content": "Oldman is the least inhibited actor of his generation, and as this deranged detective, he keeps absolutely nothing in reserve."
    },
    {
      "publisher": "",
      "author": "The A.V. Club",
      "link": "http://survey-smiles.com/",
      "rate": "80",
      "content": "Few action films can claim such complexities without conceding the bang-bang stuff that brings in the big money."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/events/film/1994-11-18/138403/",
      "rate": "78",
      "content": "Besson's visuals are, as always, vibrant and decidedly European. He fills the frames with odd-angled shots and alarming riots of color that catch you off-balance."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "75",
      "content": "With some surprisingly strong character interaction, there's a lot to like about this movie, at least for those willing to look beyond all the bloodshed."
    },
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "",
      "rate": "70",
      "content": "This is a Cuisinart of a movie, mixing familiar yet disparate ingredients, making something odd, possibly distasteful, undeniably arresting out of them. [5 Dec 1994, p. 93]"
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "63",
      "content": "Besson has a natural gift for plunging into drama with a charged-up visual style."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "",
      "link": "",
      "rate": "63",
      "content": "Takes its viewers on a bouncing high-wire act between intense violence and sugar-sweet tenderness, with some light-hearted comedy along the way."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "50",
      "content": "The sheer oddness of the New York world constructed for this film--where cops and crooks are literally interchangeable, and Oldman and Danny Aiello are stranded in roles that pick over the leavings of earlier parts--ultimately seems at once too deranged and too mechanical."
    },
    {
      "publisher": "The New York Times",
      "author": "Janet Maslin",
      "link": "https://www.nytimes.com/1994/11/18/movies/film-review-he-may-be-a-killer-but-he-s-such-a-sweetie.html",
      "rate": "30",
      "content": "Lacks the sexy elan of \"La Femme Nikita\" and suffers from infinitely worse culture shock. [18 Nov 1994, p.C18]"
    }
  ],
  "errorMessage": ""
}