{
  "imDbId": "tt0045152",
  "title": "Singin' in the Rain",
  "fullTitle": "Singin' in the Rain (1952)",
  "type": "Movie",
  "year": "1952",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-singin-in-the-rain-1952",
      "rate": "100",
      "content": "Singin' in the Rain is a transcendent experience, and no one who loves movies can afford to miss it."
    },
    {
      "publisher": "Empire",
      "author": "William Thomas",
      "link": "",
      "rate": "100",
      "content": "With so many films dedicated to the agonies of filmmaking, Singin’ overflows with the pleasure of movie creation, stitching together references to Hollywood history with more alacrity than Tarantino. One of the highpoints of hoofin’ history but, more importantly, an unadulterated joy."
    },
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/singin-rain-1952-review-959758/",
      "rate": "100",
      "content": "With the names and versatile talents of Gene Kelly, Donald O'Connor and Debbie Reynolds, supported by lilting melodies, wonderful dancing and some very funny comedy, the show just can't miss being another MGM top-grosser."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/singin-in-the-rain",
      "rate": "100",
      "content": "Watching Singin' in the Rain is an exuberant, magical experience – a journey deep into the heart of feel-good territory. Sitting through the film's 102 minutes is like ingesting a mood-altering drug. It's the perfect antidote to the blues and the blahs, and a way to bolster, enhance, and extend a natural high."
    },
    {
      "publisher": "New York Daily News",
      "author": "Wanda Hale",
      "link": "https://www.nydailynews.com/entertainment/movies/singin-rain-premieres-1952-article-1.2153848",
      "rate": "100",
      "content": "In this picture, the screen’s greatest dancer contributes some of his art of choreography for the special pleasure of movie audiences."
    },
    {
      "publisher": "Empire",
      "author": "Ian Freer",
      "link": "",
      "rate": "100",
      "content": "Incredible set pieces and songs that have entered the culture forever, this is also extremely well-paced and beautifully played. Truly one of the greatest musicals ever made."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/3621151/Must-have-movies-Singin-in-the-Rain.html",
      "rate": "100",
      "content": "Still the wittiest of all the MGM musicals of the 1940s and '50s."
    },
    {
      "publisher": "Time Out London",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "If you've never seen it and don't, you're bonkers."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1952/film/reviews/singin-in-the-rain-2-1117794912/",
      "rate": "90",
      "content": "Concocted by Arthur Freed with showmanship know-how, it glitters with color, talent and tunes, and an infectious air that will click with ticket buyers in all types of situations."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?mcubz=0&amp;res=9A01E1D8163AE23BBC4051DFB5668389649EDE",
      "rate": "80",
      "content": "The nonsense is generally good and at times it reaches the level of first-class satiric burlesque. Adolph Green and Betty Comden may have tossed off the script with their left hands, but occasionally they come through with powerful and hilarious round-house rights."
    }
  ],
  "errorMessage": ""
}