{
  "imDbId": "tt0045152",
  "title": "Singin' in the Rain",
  "fullTitle": "Singin' in the Rain (1952)",
  "type": "Movie",
  "year": "1952",
  "items": [
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2362980",
      "warningSpoilers": false,
      "date": "2 January 2011",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Now that's entertainment!",
      "content": "Singin In the Rain is arguably the best movie musical of all time, not just because of the music but because of the entire package - the premise, the comedy, the characters - everything here works together to make you feel better any time you sit down to watch it. It's ironic that this movie was thrown together quickly to capitalize on the success of \"An American in Paris\", since the improvisational feeling of the movie is one of the things that makes it so much fun. Although this film is number ten on the top 100 films of all time as compiled by the American Film Institute, it wasn't nominated for best picture the year of its release, 1952. Although it did well at the box office, it would be over twenty years before people would look back and realize just what a great motion picture it was. Perhaps that was because the 1970's were such bleak and cynical years, with movies that largely matched that mood, that people were eager to rediscover the fun that a motion picture viewing experience could be.The movie focuses on that period of time in which the entire motion picture film industry was in nervous transition from silent to talking pictures. Although the movie compresses time in this respect - the transition actually took about three years - it does accurately describe the technical problems of that era along with their comical aspects. There was an overabundance of musicals in the first batch of talking films, many stars did have heavy accents that made their speech undecipherable or voices that came across like nails on a chalkboard like Lina Lamont (Jean Hagen) and saw their careers ruined, and early sound technology itself was so fragile that you would often see actors speaking to potted plants or to coat racks with comic effect. The preview of silent picture team Lockwood and Lamont's first talkie, \"The Dueling Cavalier\", is one of the most hilarious scenes in the film. It is pretty typical of what you would see in such an early talking picture - dialogue going in and out of sync, actors and actresses strutting around and wildly gesturing as if nobody can hear them, and dialogue that still resembled what you would read off of the title cards in a silent film - \"I love you, I love you, I love you\".All of this is one of the reasons Singin' In The Rain will never get dated - it is a comic nostalgic look at a very narrow period in time. This movie is fun outside of its comic take on movie history, though. For one, it's hard to say who steals the show the most, since there are so many thieves involved. Most notably there is Jean Hagen - who actually has a very pleasant speaking voice - as the evil silent star who can't accept her days are numbered. Then there is a 27 year-old Donald O'Connor as Cosmo, the studio music director and sidekick of Gene Kelly's character whose youthful exuberance really shines in the number \"Make 'Em Laugh\" along with all of his goofy facial expressions. He seems to be having as much fun as the audience. Finally, there are all of the great dance numbers and music, capped by probably one of the most famous scenes of all time - Gene Kelly's rendition of the title number that perfectly captures the joy of a man who has just fallen in love and feels he has the world at his feet. You just can't watch this film and not come away with a smile on your face. It is as good for the soul as chicken soup, just a lot more fun."
    },
    {
      "username": "BrandtSponseller",
      "userUrl": "https://www.imdb.com/user/ur0139258",
      "reviewLink": "https://www.imdb.com/review/rw1071459",
      "warningSpoilers": false,
      "date": "1 May 2005",
      "rate": "10",
      "helpful": "127 out of 148 found this helpful.",
      "title": "A fabulous musical romance about film technology",
      "content": "Don Lockwood (Gene Kelly) and Lina Lamont (Jean Hagen) are a famed Hollywood duo, making films at the tail end of the silent era. The studio has been issuing PR suggesting that they're a romantic item. In reality, they can barely stand one another. One night, while on the town with his best friend Cosmo Brown (Donald O' Connor), Lockwood has to run to escape fans who want a piece of him badly enough that they'll literally rip his clothes to shreds. He hops over a number of moving vehicles and ends up in the passenger seat of Kathy Selden's (Debbie Reynolds) car. Lockwood seems immediately taken with her, but she gives him the cold shoulder. She says she's an actress with a love of theater, and she looks down on film acting. Later, Lockwood discovers that she was inflating the truth a bit, as he sees Selden performing as a cute song & dance girl at an industry party he's attending. She runs out of the party and Lockwood chases after her, but he's too late. While he tries to track her down, he, Lamont and their studio have to deal with the changing nature of film in 1927--made much more difficult by the fact that Lamont may look glamorous, but she talks more like Fran Drescher in \"The Nanny\" (1993).Aside from the more serious aspects of the plot, Singing in the Rain is a great success as a romance and a musical. It also has an astoundingly rich Technicolor look, and it is charmingly humorous. Kelly and Reynolds click on screen, even if offscreen Kelly, who also co-directed and co-choreographed, was famously difficult to work with--he drove Reynolds so hard (she was a much more inexperienced dancer) that her feet literally started bleeding at one point. The songs are great, they're worked into the story well--which is perhaps surprising given that most of them weren't written specifically for this film--and the choreography is impeccable, frequently jaw dropping and always aesthetically wondrous and sublime. If for nothing else, the film is worth a look for its often-athletic dance numbers, which can resemble Jackie Chan's showy martial arts stunts as much as dancing. It's also imperative viewing for cultural literacy in the realm of film.But the more serious aspects of the plot are fascinating as well. In a significant way, Singing in the Rain is about film technology. Film technology is the hinge of the plot, after all. The climax and dénouement are decided by the advent of synchronized sound in the film industry. We see studio head R.F. Simpson (Millard Mitchell) demonstrating sound films at the party where Lockwood sees Selden for the second time, providing two big turning points at once. There are sequences of actors heading off to diction coaches, as happened in reality once sound entered the scene, and also in reality as in the film some actor's careers were jeopardized by having to suddenly master a new skill.But Singing in the Rain is about technology on another level, too. Kelly and co-director Stanley Donen go to great lengths to ensure that the film is an exemplar of state-of-the-art film technology in 1952. For example, the beautiful Technicolor cinematography is emphasized by the fabulously colorful costumes and production design--they're showing off cutting edge color. The sound is as good as it could be in 1952, and the fact that this is a musical helps show that off. The sets and effects are complex and an attempt is made to show them off as well.Donen and Kelly often play up the artificiality of the sets and effects to emphasize artistry and technology. This is clearly shown in the \"Make 'Em Laugh\" sequence (and surrounding events) and the extended \"Broadway Rhythm Ballet\" sequence with Cyd Charisse. Showing off this artistry and technology also occurs very subtly, as with the rain in the \"Singing in the Rain\" sequence. Even today, rain machines are frequently employed in a way that it appears to be raining on film, but in reality, it's just enough coverage to produce the illusion. In the \"Singing in the Rain\" sequence, they make sure that you can see the whole area is getting flooded, and they use Gene Kelly's umbrella, as torrents of water bounce off of it, to emphasize that no matter where he goes, \"rain\" is pouring down on him.While there are many musicals I like as much as Singing in The Rain, this is one of the better-loved examples of that genre, and for good reason. Any musical lover has surely seen this already, and if not, they should run out now and pick it up on DVD. If you're relatively unfamiliar with classic Hollywood musicals, this is one of the best places to start."
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw1253264",
      "warningSpoilers": false,
      "date": "2 January 2006",
      "rate": "10",
      "helpful": "75 out of 91 found this helpful.",
      "title": "The talkies",
      "content": "The transition from the silent film era to the newly arrived technique of the 'talkies' proved to be the ruin for many well established stars that were great on the screen, but who had no professional training in the theater, or otherwise, and had horrible speaking voices. Thus, a star of the magnitude of Lina Lamont, suffers a hard blow to her career and ego.That's the basis of one of the best movies about old Hollywood of all times: \"Singin' in the Rain\". The film is one of the classics it is because of the marvelous direction of Gene Kelly and Stanley Donen, two men who knew a lot about musicals. The screen play is by one of the best people in the business, Betty Comden and Adolph Green.MGM was the studio that employed all the stars one sees in the film, and what a cast they put together: Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen, Cyd Charisse in a dancing part, Millard Mitchell and Rita Moreno. As if those names weren't big enough, there is the fantastic musical numbers that even, viewing them today, have kept their freshness because of the care in which this film was crafted.\"Singin' in the Rain\" is one of the best musicals of all times. It's right up there with the best of them thanks to the vision of Gene Kelly and Stanley Donen and it will live forever as more people discover this wonderful example of entertainment."
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw1004555",
      "warningSpoilers": false,
      "date": "22 January 2005",
      "rate": "10",
      "helpful": "101 out of 127 found this helpful.",
      "title": "One of the best Hollywood musicals",
      "content": "This isn't my all time favorite (that goes to \"Meet me in St. Louis\") but this is definitely in the top 10. This is a fictitous musical comedy of the 1920s when silent films became \"talkies\". It chronicles how it affects Don Lockwood (Gene Kelly), his leading lady Lina Lamont (Jean Hagen), best friend Cosmo (Donald O'Connor) and Lockwood's new girlfriend Kathey Selden (Debbie Reynolds). Problem is Lina has a voice that can cut glass and doesn't like lockwood falling for Selden...This movie has one highlight after another. Almost all the numbers are great--the title tune, \"Make 'Em Laugh\", \"Beautiful Girl\", \"Good Morning\" on and on. My two favorites are two short ones: \"Fit as a Fiddle\" which has incredible dancing from Kelly and O'Connor and \"Would You?\" at the end. Kelly isn't that good acting (he never was) but his dancing is superb; Reynolds (only 19 when she did this) is beautiful, energetic and full of life; Hagen is uproarious as Lamont (she was nominated for an Academy Award--she should have won!) and O'Connor is just great as Cosmo (his \"Make Em' Laugh\" number has astounding dancing). It's hard to believe that Reynolds and O'Connor hated working with Kelly (he was obnoxious, VERY demanding and a tyrant)--it's a credit to their acting that it never comes through.I only have one (small) complaint--the big, elaborate production number with Cyd Charisse in the middle. It LOOKS great and colorful--but it brings the film to a screeching halt and is way too long. After it ends I have trouble remembering where the film left off! Still, that's a small problem. This remains one of the 10 best movie musicals ever made. HIGHLY recommended!"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6126671",
      "warningSpoilers": false,
      "date": "26 September 2020",
      "rate": "9",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Heart Singin' in a Rain of Joyful Tears...",
      "content": "It's the magic that seldom appears, whose longevity is perpetual, the pleasure of enjoying the perfections that people, music and great storytelling can sometimes offer, with the backdrop a little piece of cinema history itself. All without foul language, extravagant pyrotechnics, mass brawls and bullets ricocheting all over the place, just immensely talented people doing what they do best - keeping you entertained and allowing you to escape for a while and live with the dreams of others. Whether musicals are you thing or not, there can be no doubt that you witness greatness as you welcome the rain and it makes your heart sing."
    },
    {
      "username": "drednm",
      "userUrl": "https://www.imdb.com/user/ur0736738",
      "reviewLink": "https://www.imdb.com/review/rw1160880",
      "warningSpoilers": false,
      "date": "29 August 2005",
      "rate": "",
      "helpful": "91 out of 112 found this helpful.",
      "title": "It Ain't Been in Vain for Nothing",
      "content": "Singin' in the Rain is one of the best movies ever made. The film is beautiful, tuneful, and loads of fun. While it pokes fun at Hollywood it also does so with great love. Little bits and pieces of Hollywood lore find their way into this great film and it's a pleasure to get the joke or recognize the real star they're referring to.The star trio is just perfect: Gene Kelly give a funny performance as the hammy silent actor; Donald O'Connor makes the most of his \"second banana\" role; Debbie Reynolds is perfect as the ingénue trying to break into films. The three stars perform many memorable numbers, including Kelly's \"Singin' in the Rain\" classic; all three in the \"Good Mornin'\" number; O'Connor's \"Make 'Em Laugh\"; and Kelly and Reynolds in \"You Were Meant for Me.\" The masterpiece however may be the \"Gotta Dance\" production number with Kelly and Cyd Charissejust perfect. Also great fun are O'Connor and Kelly in \"Fit as a Fiddle\" and \"Moses Supposes.\"There are of course other production numbers, including the montage that shows Hollywood's race to transition to talkies, a scene that ends in the \"Beautiful Girl\" number featuring Jimmy Thompson. Jean Hagen (as Lina Lamont) won an Oscar nomination and steals the film in a classic comedy performance. Also good are Millard Mitchell, Douglas Fowley, Rita Moreno, King Donovan, Kathleen Freeman, Mae Clarke, Julius Tannen, and Madge Blake.The great trick to this film is that while Reynolds is supposedly \"lip syncing\" for Hagen, it's really Hagen's voice that Reynolds is miming to as in the \"I Would, Would You\" number. The final miming act is Hagen mouthing \"Singin' in the Rain\" is really Reynolds. It gets so confusing you can't tell who is lip syncing whose voice.Lots of Hollywood lore retold in this film. Hagen's Lamont character is a veiled reference to Norma Talmadge, who supposedly failed in talkies because of her New York accent. It's also a reference to Louise Brooks, whose talkie debut in The Canary Murder Case was all dubbed. When Kelly screams \"I LOVE YOU\" it's a reference to John Gilbert in is talkie debut flop. His Glorious Night. Kathleen Freeman's diction coach character is a reference to Constance Collier, who returned to Hollywood as a coach. And on it goes.A great film!"
    },
    {
      "username": "Sober-Friend",
      "userUrl": "https://www.imdb.com/user/ur16178412",
      "reviewLink": "https://www.imdb.com/review/rw4040089",
      "warningSpoilers": false,
      "date": "22 January 2018",
      "rate": "9",
      "helpful": "26 out of 28 found this helpful.",
      "title": "A Classic",
      "content": "Last year I was very lucky to catch this on the big screen. This film is meant to be seen on the big screen! It was also the first time I saw it at the theaters and I was very impressed with the visuals.In this film movies are switching over from being silent to being \"talkies\". However the film is a spoof of the turmoil that afflicted the movie industry in the late 1920s when movies when the change over went from silent to sound. When two silent movie stars', Don Lockwood and Lina Lamont, latest movie is made into a musical a chorus girl is brought in to dub Lina's speaking and singing. Don is on top of the world until Lina finds out.This is such a great film that if you ever get the chance to see this at the movies then DO IT.Gene Kelly and Debbie Reynolds made an awesome team."
    },
    {
      "username": "ToldYaSo",
      "userUrl": "https://www.imdb.com/user/ur0024463",
      "reviewLink": "https://www.imdb.com/review/rw0047882",
      "warningSpoilers": false,
      "date": "24 May 1999",
      "rate": "9",
      "helpful": "177 out of 215 found this helpful.",
      "title": "The title alone will have you humming the song",
      "content": "I don't like musicals. They never made any sense to me. Don't get me wrong, I love music; it's an important part of my life. I love movies also, and while the two often compliment each other, sometimes I'm repelled. It's probably the dancing. A person breaking into a complicated dance number, seemingly unaware of their surroundings, or worse yet, in complete synch with a complete stranger is like making fun of the movie, as if to say, \"Please don't take us seriously, we like to sing and dance.\" Or even more ridiculous, \"Let's not fight, let's settle this dispute with a song and dance.\" Forget about suspension of disbelief.This film however, I manage to enjoy. I once was given the task of my film teacher to watch the film and keep track of all the cuts in the film. Well, sometime after ten minutes I lost track because I was so wrapped up in the story. It really is an interesting period in the history of cinema, told well, and with well placed song and dance numbers that at times drag on, but that seems to be more of an excuse to show off the technicolour than anything else. They build you up to it slowly. The first few numbers don't break out at an inappropriate time. It doesn't last though, but by then they've got you.With such memorable tunes as these, it's hard to imagine them going wrong. When Gene Kelly sings the title piece, somehow time stands still as you're swept up in one of the most memorable scenes in film history. Just reading the title in print has likely caused you to hum a few bars, or sing a few words. Or maybe, just maybe, walk out without an umbrella when you know it's raining. One thing's for sure, if all Gene Kelly did was choreograph the dance numbers, he more than deserves the co-directing credit he has.They simply don't make films like this anymore. Which in some ways is a testament to the film's theme and narrative. The business of show is constantly in a state of evolution. The narrative portrays a time period when silent films were being replaced by \"talkies\" with sound, yet the musical genre itself has almost all but disappeared with the exception of animated films with musical numbers, and rare live-action pieces.One might speculate that Hollywood overdid the musical. Personally, I can't get into them. Most of the time it seems like a drawn out affair, but this film is something special. Considering my feelings about musicals, it would have to take a film of this one's caliber to make me sit up and take notice."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2084076",
      "warningSpoilers": false,
      "date": "21 June 2009",
      "rate": "10",
      "helpful": "22 out of 27 found this helpful.",
      "title": "Just amazing! One of the best musicals ever made!",
      "content": "This absolutely delightful film has everything I love in a musical, and is definitely one of the greatest musicals ever made.(I love them) I personally think the film's main merit is the electrifying choreography, evident in the songs, Make Em Laugh, Roses, Good Morning and especially Broadway Melody.As for the songs, they are superb, and quite rightly some of the finest in the history of musicals, and somehow they remind me of Easter Parade. The performances give a rare sense of energy and charm, particularly Gene Kelly as Donald Lockwood, also co-director. His rendition of the title is possibly the most famous scene in the movie, and is pretty extraordinary. Donald O'Connor is hilarious as Cosmo and Debbie Reynolds, with her lovely appearance and fabulous voice is perfectly appealing. Jean Hagen is quite hysterical as Lina, the source of the film's ongoing joke, that her character can't act, dance or sing, and her acting in the talkie was intentionally laughable. Also nice to see the beautiful long-legged Cyd Charisse and Rita Moreno. (best known for Anita in West Side Story)The plot mayn't be the best merit of the film, but with everything else so good, it is such a minor criticism. All in all, a wonderful film, that is well worth watching for the song and dance numbers alone. 10/10 Bethany Cox."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1833107",
      "warningSpoilers": false,
      "date": "4 March 2008",
      "rate": "10",
      "helpful": "20 out of 24 found this helpful.",
      "title": "I'm happy again!",
      "content": "Singing In The Rain is to me the greatest musical ever made, sure many others push it close, The Wizard Of Oz for one will always be a 10/10 movie in my opinion, but Singing In The Rain is a film that has no flaws, it is a perfect movie.Don Lockwood is a star of silent movies but his life is boring, then talking movies arrive and with them he eyes an opportunity to greatly improve his life. A chance encounter with dancer Kathy Selden will further shape his destiny, and along with best pal and partner Cosmo Brown, their respective fortunes will hopefully dovetail towards fulfillment.Where do you start? The film is a homage to happiness, be it film making or love, or friendships and honour, the film is pure and simply joyous from the first reel to the triumphant last shot. Featuring stunning choreography, Singing In The Rain doesn't cop out by merely having characters plodding thru a script and then bursting into song occasionally, each song furthers the characters and fleshes out the story unfolding to keep the plot lines tight and crucially, important.Make 'Em Laugh, Good Morning, and Singing In The Rain are just some of the brilliant songs and dance routines on show here, with the latter a now legendary piece of cinematic history that speaks volumes for the joyous nature of the film, whilst the finale sequence of the 'Broadway Ballet' is magic & elegance personified. The cast are uniformly excellent, Gene Kelly, Donald O'Connor & Debbie Reynolds interplay together like they were hatched from the same egg, and the joint direction from Stanley Donen (along with Kelly) is seamless.Full of hat tipping and self-referencing winks, Singing In The Rain regularly hits the top ten lists of critics and movie fans alike, so lets not beat around the bush about it...it flipping well deserves it. 10/10 in every respect."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0047996",
      "warningSpoilers": false,
      "date": "28 December 2003",
      "rate": "9",
      "helpful": "16 out of 19 found this helpful.",
      "title": "What a glorious feeling, indeed!",
      "content": "Everybody remembers the scene. It's the one where he walks along the street, dancing, and singin' in the rain. The musical sequence has yet to be surpassed by any film -- even my all-time-favorite musical, \"Grease\" (1978), doesn't stand a chance. In fact, there's another great musical number in \"Singin' in the Rain,\" with Donald O'Connor throwing his body around like a rag doll. Even though the singin' in the rain number is the infamous trademark of the film and musicals everywhere, my personal favorite is \"Make 'em Laugh.\"Not many people know, however, that Gene Kelly had a 103 degree fever during the filming of the infamous scene -- a dangerous thing to do, in retrospect, considering that he was flailing about and working up a sweat in pouring water with such a high temperature. But even then, not many people know that the \"rain water\" pouring down on the joyously cheesy street was actually composed of water and milk. The milk was added to the mix in an effort to achieve the effect of raindrops showing up on screen. (Mel Gibson noted once that most of the time during the filming of \"Braveheart\" it was raining around them, but it was basically impossible to notice any rainfall in the film since the sheets of liquid were so thin.)\"Singin' in the Rain\" can probably be called the greatest musical of all time, even though my guilty pleasure is \"Grease\" (how outdated the film is, and yet how amusing it remains!). Every serious filmgoer knows this movie, and just yesterday as I watched Britain's countdown to the greatest musical ever made, I noted that \"Singin' in the Rain\" was high on the list (\"Grease\" was no. 1, although any list that posts \"Buffy the Vampire Slayer: The Musical\" higher on a list than \"Singin' in the Rain\" can't be trusted).Don Lockwood (Kelly) is a silent film star in 1927, an ex-musician living an on-screen romance with Lina Lamont (Jean Hagen) and letting the publicity take their screen relationship to a whole new level (think Ben and Jen's recent tabloid romance). The press loves to think that its two biggest stars are the nation's cutest couple, but in reality Lockwood despises Lamont, and Lamont -- having read trashy magazines -- believes their relationship to be factual. \"Oh, Donny!\" Lina cries. \"You couldn't kiss my like that and not mean it just a teensy bit!\" Lockwood: \"Meet the greatest actor in the world -- I'd rather kiss a tarantula.\" Lina: \"You don't mean that.\" Lockwood: \"I don't? Hey Joe, get me a tarantula!\"When the silent film studio begins the transition from silent film to new \"talkies,\" it means that Lockwood will have to take acting lessons in able to learn to truly be able to act, and Lamont -- a squeaky-voiced young lady -- will have to learn to learn proper grammar. (Some scenes with a grammar instructor reminded me of \"My Fair Lady,\" truth be told, although it was filmed 12 years afterwards.)Lockwood meets a young girl named Kathy Seldon (Debbie Reynolds), who refuses to fall victim to his Hollywood charm but eventually learns to love the guy after he gets her out of a tight squeeze or two.Meanwhile, Lockwood's pal, Cosmo (O'Connor), suggests that they start to stage film musicals instead of feature \"talkies\" -- that way, all Lockwood needs to do is sing and dance, something he already excels at. (\"Make a musical! The new Don Lockwood: he yodels! He jumps about to music!\")But people want Lockwood and Lamont, not Lockwood by himself, and the prospect of losing money is not a bright prospect for the film company. So Lina is filmed in the musicals with him, and towards the end of our film, sweet young Kathy dubs over Lina's voice and is given no credit for the task. Lamont is too embarrassed to admit that she can't sing, and so she blackmails the film distributor -- if they credit Kathy at the end of her new feature film, she'll take legal action.And so comes the climatic finale on stage as Lockwood reveals the true singer behind the film (ironic, since it was Lamont herself who dubbed over Reynolds' voice during the sequence). As Roger Ebert noted, the scene where Lockwood bursts onto stage and fingers out Kathy from the crowd of onlookers is corny, but it's sweet and exactly the time of emotionally uplifting moment that is rarely made nowadays.Gene Kelly's notorious cruelty on the set of \"Singin' in the Rain\" has become a sort of folklore, and it's true. He berated the actors if they messed up a single dance number. O'Connor later admitted that he was extremely frightened to make a single mistake, afraid that Kelly would lash out at him.That strictness doesn't shine through Kelly's character in \"Singin' in the Rain.\" In fact, many of the dance moves (such as the frantic splashing in the puddles) look quite haphazard, but they were all choreographed to an extreme.Is that why the film is highly regarded as perhaps the definitive American musical? That probably has something to do with it. I think it's mostly the joy of it all, though -- bright, cheery, happy, and uplifting, the film is one of the most purely fun films of all time. It doesn't demand anything like some films, but it gives a lot back.The ads for \"Singin' in the Rain\" promised a glorious feeling, and in that way the film lives up to its slogan. It is fun and bright and glorious and entertaining. It doesn't take itself seriously, but it offers the viewer a chance to experience something quite rare -- an all-around great movie. What a glorious feeling, indeed.5/5."
    },
    {
      "username": "primodanielelori",
      "userUrl": "https://www.imdb.com/user/ur15079491",
      "reviewLink": "https://www.imdb.com/review/rw1744003",
      "warningSpoilers": false,
      "date": "10 October 2007",
      "rate": "10",
      "helpful": "108 out of 114 found this helpful.",
      "title": "Timeles Magic",
      "content": "Can you imagine? Me, a film lover since the age of six, hadn't seen \"Singing In The Rain\" until last night. I had read and heard so much about it over the years that I knew I was going to be disappointed. As a musical I've never seen anything so perfectly \"in tune\" I can see how many directors have been influenced by the soul of this gorgeous movie. I've seen even Federico Fellini here. The tap routine with Gene Kelly and Donald O'Connor is so energizing that I wanted to see it again and again. The fantasy number with Gene Kelly and Cyd Charisse is breathtaking, breathtaking! How extraordinary to see Debiee Reynolds going through the contagious (Good morning!Good morning!) I had seen her a few nights before as Grace's mother in \"Will and Grace\" She hasn't lost her zest. I'm sure I'll be seeing this movie many times and I intend to show it to very young people from the post MTV generation and I'm betting with myself that they're going to love it. Greatness is timeless."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1404950",
      "warningSpoilers": false,
      "date": "28 June 2006",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "MGM Near the Top of Its Musical Game",
      "content": "The heaps of scholarly criticism heaped on \"Singing' in the Rain\" have done it a disservice by giving it the ball and chain reputation of an IMPORTANT picture in cinema history. Let's not forget why \"Singin' in the Rain\" was made, which was to provide a form of escapist entertainment, nor why it's still so loved now, which is because it's great fun and everything clicks. It's not homework, and it's not medicine.I don't even think it's the best movie musical ever made (I liked MGM's \"Seven Brides for Seven Brothers\" more), and it's not one I feel compelled to go back to again and again. I'm not a huge fan of Gene Kelly, and think he's squirrelly when he's trying to be dashing, and Donald O'Connor's manic energy is just as likely to be exhausting as it is funny. But there's no improving on Jean Hagen's pitch-perfect performance as the ditzy villainess, and Debbie Reynolds shows how sweet and charming she was early in her career, before she became a broad.The songs and dances aren't especially well integrated into the film --you can practically hear the gears grinding whenever the film transitions from its book to its musical portions. But the numbers are so wildly entertaining in and of themselves that you don't much care. The \"Singin' in the Rain\" sequence does what far too few films do -- it transports you to a place where what's happening on the screen in front of you is the only thing that matters.Grade: A-"
    },
    {
      "username": "cinemel",
      "userUrl": "https://www.imdb.com/user/ur0186847",
      "reviewLink": "https://www.imdb.com/review/rw0047859",
      "warningSpoilers": false,
      "date": "25 January 1999",
      "rate": "10",
      "helpful": "81 out of 106 found this helpful.",
      "title": "The dancingest, funniest musical of Hollywood's golden age.",
      "content": "Gene Kelly and Stanley Donen have produced the best musical written directly for the screen. They have used the period in film history during the transition to sound movies and embroidered it with the wonderful songbook of Arthur Freed and Nacio Herb Brown. The icing on the cake, of course is the choreography of Kelly and Donen. From the first moment, the movie takes flight as Kelly relates the tale of his rise as a silent film star with his sidekick, the incomparable Donald O'Connor. Watch the flying feet of O'Connor and Kelly in the \"Fit as a Fiddle\" number. It doesn't get much better than this. Everyone is familiar with the classic \"Singin' in the Rain\" sequence. Donald O'Connor's hysterical \"Make 'em Laugh\" number is probably the funniest musical three minutes on film. Even the Broadway Ballet is a kaleidoscope of color and movement, with a minimum of the highbrow balletic choreography found in the later \"An American in Paris.\"What makes \"Singin'\" such an entertaining classic is its superb integration of comedy and music. Jean Hagen gives the performance of her life as the vocally challenged silent film star, Lena Lamont. Every scene she's in is a comic gem. Her \"fingernails on a blackboard\" voice and massacre of the English language make her a figure of ridicule. However, in the end when she finally gets her comeuppance, one can't help feeling a little sorry for her.This delightful film has been given its due on video. On VHS it can be purchased with the complete remastered soundtrack on CD. The laserdisc versions include one with commentary by film historian Ronald Haver (Criterion) and the film-only version from MGM/UA Home Video with a restored Dolby Digital stereo soundtrack., Last,but not least,is a masterful rendering on DVD with, unfortunately, no supplementary material to speak of.This is truly a film for all time that can be watched just for its entertainment value and studied as probably the apex of the Hollywood musical in its Golden Age."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0047970",
      "warningSpoilers": true,
      "date": "10 December 2002",
      "rate": "",
      "helpful": "36 out of 52 found this helpful.",
      "title": "Folded Eye Jazz",
      "content": "Spoilers herein.This is a nearly perfect film from my perspective: It feels naturally improvised. Its episodes are radically discontinuous, but feel like fluid transitions. It has some great numbers, including the incomparable Cyd Charisse.But what really puts this on my `must see' list is the deep self-reference. Superficially, it is a movie about a movie, but actually the folding is a whole lot more complex, even psychedelic. The narrative structure is flashbacks, flashforwards, about the movie, IS the movie, about the fooling behind the movie (oddly, Debbie's non-movie songs were dubbed by someone else!). It has nested abstractions, and encompassing ones. It has several manner of annotative features. And the internal movie itself grows while we watch to have internal nesting of different types: the original costume drama becomes a vision from a modern newcomer whacked on the head. And further, there is the Charisse number which is another abstraction. There were precessors: `Kane' (41) introduced the use of many parallel narrative devices, `Children of Paradise' (45) had conflated reality and performance: `Red Shoes' (48) took it to dance, and those are must see as well. But here, the technique becomes visual jazz improvisations on reality. Thrilling.None of the people involved ever came close on other projects. Odd.Ted's evaluation: 4 of 4 -- Every visually literate person should experience this."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1234108",
      "warningSpoilers": false,
      "date": "9 December 2005",
      "rate": "10",
      "helpful": "26 out of 37 found this helpful.",
      "title": "Deserves Every Accolade",
      "content": "This is one of those handful of films that is universally loved and respected and I have to join the crowd on that. For over 50 years it has been considered the best musical ever made and I can't argue with that, either, especially with the newly- restored DVD version that came out a short time ago. The film never looked and sounded better!In a nutshell, the reason for the high praise, I would think would be: 1 - Likable lead characters (Debbie Reynolds, Gene Kelly, Donald O'Connor); 2 - Excellent song-and-dance numbers, capped off by one of the most famous of all-time, the title song \"Singin' In the Rain,\" featuring Kelly; 3 - Very good humor throughout the film, aided by Jean Hagen's dumb blonde imitation, which may be the best ever put on film; 4 - Spectacular color (please get this latest 2-disc DVD), and 5 - of course, simply a very entertaining film start-to-finish.A few side comments: Kelly gets the legacy with his title song dance but O'Connor's dancing in here is just as good. In fact, one of his solo routines reportedly exhausted him so much he could not work for five days. A nice bonus is seeing Cyd Charisse in here, showing off her dancing skills and great legs."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw7688954",
      "warningSpoilers": false,
      "date": "26 December 2021",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Fabulous.",
      "content": "Singin' in The Rain remains one of the most entertaining and uplifting films of all time. It's become a Christmas must watch, and this year was no different, after a disappointing 2021 schedule, it was made all the better by this magical film.It looks fabulous, made all the way back in 1952, it is beautifully filmed, directed and acting. It's an iconic film for good reason, no matter what mood you're in, this film has the ability to lift your mood, and bring a smile to your face.Kelly's dance remains one of the best scenes ever to grace the big screens.A magical film, 10/10."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw0047948",
      "warningSpoilers": false,
      "date": "13 April 2001",
      "rate": "",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Jean Hagen's contribution makes 'Singin' in the Rain' one of the all-time greats...",
      "content": "Much as I admire the talents of Gene Kelly, Debbie Reynolds and Donald O'Connor, it's really Jean Hagen who provides us with the funniest, most hilarious moments in her way-over-the-top performance of the dumb film star with the appalling accent. Her character also provides the key to the plot for this witty look at Hollywood making the transition to sound films. A pity Hagen wasn't given any of the song numbers to participate in--but that's my only complaint. Everything is in good hands here--Kelly and Reynolds and O'Connor do outstanding jobs. The only other drawback, as I see it, is the extended Broadway musical number Kelly imagines and co-starring Cyd Charisse. It strikes a somewhat jarring note and wasn't really necessary. His song-and-dance routine in the rain is, of course, the most famous highlight--but equally endearing is the 'Good Mornin' number, staged with such style and verve and performed with gusto by the three stars. Betty Comden and Adolph Green provided a supremely funny script, somewhat reminiscent of an older film with Alice Faye and Don Ameche called 'Hollywood Cavalcade'('39), which also dealt with the transition from silent to sound movies. One of the great MGM musicals, not to be missed."
    },
    {
      "username": "schappe1",
      "userUrl": "https://www.imdb.com/user/ur1623123",
      "reviewLink": "https://www.imdb.com/review/rw0047858",
      "warningSpoilers": false,
      "date": "18 April 2002",
      "rate": "",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Why it's the best",
      "content": "There are two kinds of musicals. You can call them different things. You could call them the Hollywood Musical and the Broadway Musical. That's not quite proper because the Hollywood Musical is what the Broadway Musical was in the 20's and 30's, before Rogers and Hammerstein changed everything. maybe a better distinction is the Dancing Musical vs. the Singing Musical, except that both kinds have dancing and singing...Let's try it this way. The original musicals on Broadway in the 20's and 30's and Hollywood in the 30's and 40's were musicals with a slight storyline, some singing and tremendous dancing numbers. They also have low comedy and plenty of beautiful girls. They usually are about show business itself and many of the numbers take place on the stage. the others seem like the likely result of bringing show people together: of course they are going to sing and dance from time to time. Looking at them these days, the singing is kind of boring, the comics dreadful and the plots the answer to a moron's prayer. It's the dance numbers that are timeless. These films were made for highlight reels like \"That's Entertainment\".Rogers and Hammerstein changed all that. They took serious plays and converted them into operetta of popular music. Characters who were not in show business at all used songs and dances as soliloquies to reveal their private thoughts. The result was some of the best plays and films of all time- Oklahoma, Carousel, The King and I, South Pacific, The Sound of Music, Brigadoon, Gigi, My Fair Lady, The Music Man, etc. South Pacific was the first film my parent sever took me to see and this is the type of musical I normally prefer. Here songs tended to dominate- \"Surrey with the Fringe on Top, \"Out of My Dreams\", \"People Will Say We're in Love, \"If I Loved You\", \"My Boy Bill\", \"I Have Dreamed\", \"Hello Young Lovers\", \"Some Enchanted Evening\", \"Younger Than Springtime\", etc. ,etc. There are dance pieces but the dancers are on the sidelines.\"Singing in the Rain\" is the greatest of all the Hollywood Musicals. It has the memorable dances a Hollywood Musical needs: \"Make 'Em Laugh\", Singing in the Rain\", \"Good Morning\", \"Broadway Melody\". There is also the best of the Freed-Brown songbook, such as \"You are My Lucky Star\". But it has the strongest story of any of the Hollywood Musicals, thanks to the Comden-Green team and the memories of the early days of sound. it's virtually the only Hollywood Musical that could have held up as a non-musical. It could have just been a comedy about he conversion to sound. it would not have been \"Singing in the Rain\", but it would have been good.As it is, it's the one musical that has it all."
    },
    {
      "username": "ecjones1951",
      "userUrl": "https://www.imdb.com/user/ur3968766",
      "reviewLink": "https://www.imdb.com/review/rw1169402",
      "warningSpoilers": false,
      "date": "10 September 2005",
      "rate": "10",
      "helpful": "76 out of 106 found this helpful.",
      "title": "The Divine Miss Charisse",
      "content": "I'm going to confine my comments about \"Singin' in the Rain\" to the \"Broadway Rhythm\" sequence where Cyd Charisse steals the movie without saying a word. In my view, Charisse, who is still gorgeous at 83, was the quintessential movie dancer of the 1950s. Her height, elegance, aloofness and those impossibly long legs -- along with an uncanny ability to match her style to that of her partner -- makes watching her dance a mesmerizing experience.Many have said that the two numbers in \"Singin' in the Rain\" that feature Charisse probably belong in another movie. I don't know as the flapper in jade, she sexes up Kelly's rube character to a steamy height unusual in movies of that era. In a dance full of wonderful moves, my favorite comes after she's left him with her cigarette holder. She sashays away from him, blowing on her nails in studied boredom. She's gotten some distance away, and as she tosses her right hand back, he throws down the cigarette holder, grabs her hand and brings her flying up to his chest, where she proceeds to slide down Kelly's thigh to the floor for one of several prone positions she takes during this duet, from which she returns to a standing position with amazing grace. I'm not wild about dances that rely heavily on props, but this one does so very effectively: they're amusing and they reinforce character.And thank heaven for the artistic control that allowed Kelly to keep the \"crazy veil\" number in the picture. Charisse has discussed that dance, where she got to show off her early ballet training, most charmingly for a \"Word of Mouth\" feature on TCM. She and others have noted over the years that the wind machines required to keep that impossibly long veil moving and undulating between and above her and Kelly made filming a nightmare. But it looks effortless, on a set that is a subtle optical illusionnot as deep nor as sloped as it appears to be.Both dances end the same way. Whether she's a cheap gangster's moll in garish green or a Grecian goddess in white, less obviously in a mobster's sway, Charisse is invariably lured back to reality by proffered baubles and menacingly tossed coins. But at the end of the crazy veil number, she's the one tossing the coins.Wonderful."
    },
    {
      "username": "bsmith5552",
      "userUrl": "https://www.imdb.com/user/ur1019294",
      "reviewLink": "https://www.imdb.com/review/rw3874276",
      "warningSpoilers": true,
      "date": "3 December 2017",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Gene Kelly's Crowning Moment!",
      "content": "\"Singin' in the Rain\" is considered by many to be the greatest movie musical of all time. It's hard to argue that point. It's got everything, a solid cast, great songs, glorious Technicolor and solid production numbers.Don Lockwood (Kelly and Cosmo Brown (Donald O'Connor) are vaudevillians in the 1920s. They are not doing so well and decide to try Hollywood. Lockwood becomes a stunt man who graduates to starring in adventure films with co-star Lina Lamont (Jean Hagen). It is the time of the introduction to sound and it is discovered that Lamont does not have a voice suitable for sound. One night after being mobbed by adoring fans, Lockwood meets Kathy Selden (the still teen-aged Debbie Reynolds), an aspiring singer/dancer. Love at first sight. Kathy is trained to dub Lamont's voice in the studio's first sound film. It is a big success. Lamont arranges for Kathy to be contractually bound to continue dubbing her voice. But Lockwood, Cosmo, and studio boss R.F. Simpson (Millard Mitchell have other ideas and...................................There are several memorable performances in this film. O'Connor performs the comical \"Make 'em Laugh\", Kelly of course performs the title tune and appears in the \"Broadway Melody\" production number with a cast of thousands and the lovely Cyd Charisse with whom he has a couple of dance numbers. The stars do a delightful \"Good Mornin\" song and dance as well. Jean Hagen almost steals the film as the deceitful Lina Lamont.MGM dusted off several of their old songs for this film. \"Good Mornin'\" for example, was sung by Judy Garland in 1939's \"Babes in Arms\". The song, \"Beautiful Girl\" is ably performed by Jimmy Thompson who received no billing or acclaim for his effort. Wwatch for Rita Moreno as Zelda, Lamont's scheming ally. \"B\" western bad guy Douglas Fowley turns in a dandy performance as the frustrated director and Kathleen Freeman and King Donovan turn up in minor roles as well.This would by Gene Kelly's second of back to back successes following \"An American in Paris\" a year earlier. Sadly the movie musical was on decline and both Kelly and O'Connor would soon be searching for alternatives. The diminutive Debbie Reynolds was just getting started and would go on performing on stage, film and TV for the rest of her life."
    },
    {
      "username": "sibisi73",
      "userUrl": "https://www.imdb.com/user/ur1134263",
      "reviewLink": "https://www.imdb.com/review/rw0047832",
      "warningSpoilers": false,
      "date": "22 August 2001",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Most entertaining movie ever made!",
      "content": "A perfect movie in every sense, 'Singin In The Rain' has rightly gone down in history as the best musical picture ever. But it is much more than that. A sparkling comedy, with a cast that is 100% perfect, and one of the best movies about movies ever made too.Gene Kelly's genius has never been more apparent than in this movie, but, as always he never steals the show, in fact here practically having the show stolen from him by Donald O'Connor's gravity defying 'Make 'Em Laugh' and Jean Hagen's unforgettable Lina Lamont. Kelly's title number is the epitome of carefree nonchalance. The guy's in love and he isn't going to let a little rain get in the way. This 'classic' scene is possibly the feelgood moment to beat all others. I defy anyone not to succumb to the Kelly's Irish charm during this number, if you haven't already been won over.But a musical is just a musical without a decent story. That's where Comden and Green's pertinent screenplay comes in. Using Nacio Herb Brown's songs from the era in which the movie is set we are taken back to Hollywood in transition, a time when silent movies were ousted by the talkies. For what is generally regarded as just a light-hearted song and dance movie 'Singin In The Rain' takes a pretty accurate line and takes a satirical swipe at the studios and the gossip mongers of the day. There were stars, like Lina Lamont, whose careers disintegrated on the advent of talking pictures, and others, like Kathy Seldon, whose stars were beginning to rise. For a while, there weren't enough voice coaches to go round! The race to match the success of 'The Jazz Singer' was truly chaotic, with studios churning out potboiler after potboiler to cash in on the talking picture. It was also a time when MGM itself started it's reign of the musical genre with epic production numbers, and casts of thousands. In a sense,'Singin In The Rain' both lampoons and celebrates it's own ancestry and place in cinema history.Exhilarating, exuberant, and mesmerising. Still, in my opinion, the most entertaining, and the best, movie ever made!"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1590485",
      "warningSpoilers": false,
      "date": "4 February 2007",
      "rate": "10",
      "helpful": "10 out of 14 found this helpful.",
      "title": "We Lived The Research",
      "content": "In the book The Films of Arthur Freed, Freed made one comment about Singin' in the Rain that always stood out in my mind. As the film was about the Hollywood era when films were learning to talk, Freed said that there was no need to do any research as he lived the research. He and any number of people who were still working at MGM a quarter of a century later.The knowledge that folks had who worked on Singin' in the Rain and the talent of Gene Kelly are the two things that make that film some consider the greatest of all musicals.Arthur Freed who wrote a lot of the song lyrics in those twenties and thirties MGM musicals together with his partner, composer Nacio Herb Brown, just reached into his own catalog for the score. The whole score is Brown-Freed except for Moses which was written by Roger Edens and Adolph Green and Betty Comden and Fit As A Fiddler with lyrics by Freed and music by Al Goodheart and Al Hoffman.The only 'original' song written for the show was Make 'Em Laugh by Brown and Freed and was Donald O'Connor's specialty. You have to put that in quotes because even the writers agreed they ripped off Cole Porter's Be A Clown. Which is from an MGM musical that Arthur Freed produced. Lucky they weren't sued.Of course the number that Singin' in the Rain is noted for is the title tune sung and danced in the splashing rain by Gene Kelly. That and the Broadway Melody ballet became two of his signature numbers. I know I don't enjoy myself as much as Mr. Kelly did in that inclement weather.Jean Hagen got a Best Supporting Actress nomination for playing that 'shimmering star in the cinema firmament' Lina Lamont. Unfortunately she lost to Gloria Grahame for The Bad and The Beautiful. One thing that the silent screen did was mask a whole lot of personalities whose voices did not fit the screen image created. That was done for great comic affect by Hagen, but Kelly in some of his love scenes was using the tragedy of John Gilbert who acted in two much the classical manner as a continental lover. Just think how history might have been different if Gilbert had the background of a song and dance man and could have transitioned to musicals. Of course Debbie Reynolds is just fine in her first real starring part as the young singing hopeful whose career is made by sound. So many in fact were, as many as those that were broken. A favorite of mine in this is Douglas Fowley the harassed director trying to get a talking performance out of the nasal Hagen and dealing with the new technology at the same time.As Freed said, no research was needed. Singin' in the Rain is a product of his life experience in those early days of sound."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1552423",
      "warningSpoilers": false,
      "date": "23 December 2006",
      "rate": "10",
      "helpful": "10 out of 14 found this helpful.",
      "title": "A Musical Masterpiece",
      "content": "In 1927, the former stunt Don Lockwood (Gene Kelley) becomes a successful actor with the company of his best friend Cosmo Brown (Donald O'Connor) forming a romantic pair with the actress Lina Lamont (Jean Hagen).In the period of transition from silent movies to talking pictures, Don accidentally meets the aspirant actress Kathy Selden (Debbie Reynolds) while escaping from his fans and fall in love for her. Lina has troubles with the sharp tune of her voice, and Cosmo and Don decides to dub her, using Kathy's voice, to save their movie. When the jealous Lina finds the strategy of the studio, she does not want to share the credits with Kathy and tries to force the studio to use Kathy in the shadow to dub her in other productions. But when Lina decides to speech and sing to the audience, the truth arises.\"Singing in the Rain\" is a musical masterpiece, one of those unforgettable movies that the viewer never get tired of watching. The cast is in state of grace, with wonderful interpretations. Jean Hagen is simply fantastic in the role of Lina Lamont, an actress unable to speak correctly and with an awful voice. Debbie Reynolds has a doll face, Donald O'Connor is very funny and Gene Kelly is fantastic. This is certainly one of the best movies ever made. My vote is ten.Title (Brazil): \"Cantando na Chuva\" (\"Singing in the Rain\")"
    },
    {
      "username": "silverscreen888",
      "userUrl": "https://www.imdb.com/user/ur5501912",
      "reviewLink": "https://www.imdb.com/review/rw1216042",
      "warningSpoilers": false,
      "date": "14 November 2005",
      "rate": "7",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Genial, Strongly-Made Satire With Music About the Early Days of Talkies",
      "content": "\"Singin' In the Rain\" I find to be a relaxed musical, one whose subject is the traumatic changeover that was faced by Hollywood producers, actors and directors when sound was introduced into film circa 1928. Many fans and critics believe the musical is one of the best ever; I disagree. But it is quite unusual in several respects, I suggest: first because its background is so realistic as a milieu from which to draw appealing characters and opportunities to introduce songs; and second because the film is played on the edge of parody without ever really falling into that error. The three characters at the center of the film are a love triangle. Don Lockwood, played amiably by Gene Kelly, is the on-screen partner of Lina Lamont (Oscar-worthy Jean Hagen); she has mistaken his sincere performance for real interest; he is in love with Kathy Selden, played by too-young but plucky nineteen-year-old Debbie Reynolds, about whom Lina knows nothing. The professional duo are completing one more romantic adventure film as a silent when suddenly sound is introduced into movies. The studio executives panic; and Don and his partner, played by Donald O'Connor, convince the director, craggy-faced and very realistic Douglas Fowley, to get the studio to let them remake the film as a musical--completing the unfinished portion, etc. The problem turns out not to be Don's transition to talkies but Lina's; she has the voice of a screech owl. Coaching becomes necessary; sensational dance numbers are introduced, including Kelly's solo \"Singin' in the Rain\", motivated by his falling in love with Kathy; Donald O'Connor's \"Make 'Em Laugh\" acrobatic classic; and the unnecessary but very-well-done \"Gotta Dance\" showcase ballet with Cyd Charisse as a gangster's moll, and Kelly as a Broadway hopeful. Then, the film is completed and debuted; of course Lina has found out about Kathy. And of course this intelligent satire works out well for all concerned, after some trials and tribulations. Great fun is gotten I suggest from the actors having to learn to \"talk into the flowers\", where early microphones had to be hidden, etc. Harold Rosson provided the cinematography, with art direction by Randall Duell and Cedric Gibbons. Nacio Herb Brown's songs were intelligently recycled for the film. Arthur Freed, MGM's master musical specialist, had the use of the talents of Betty Comden and Adolph Green for the screenplay and one song, \"Moses Supposes\"; he also had then-28- year-old nice guy Stanley Donen as director, soon to add \"On The Town\" and \"Seven Brides For Seven Brothers\" to this triumph. Walter Plunkett did the period costumes, with complex set decorations being done by Jacques Mapes and Edwin B. Willis. The studio's boss was played by Millard Mitchell, with Rita Moreno and a dozen familiar faces in smaller parts and uncredited appearances such as Joi Lansing, Paul Maxey, Sylvia Lewis, Kathleen freeman, King Donovan, Dawn Addams, Elaine Edwards, Mae Clarke and Snub Pollard. The film was influential, I assert, my criterion for including it among these reviews, because, immediately afterward, other 1920s and period projects were inspired by its success; these included, \"Has Anybody Seen My Gal\", the TV show \"So This is Hollytwood\", and ultimately \"The Great Race\", \"The Rise and Fall of Legs Diamond Story\" and a hundred others, including a few musicals. I consider it to be genial, a clever period evocation, lightweight, exuberant, youthful, and a very seminal work with a strong central character and unusually-interesting reality background."
    }
  ],
  "errorMessage": ""
}