{
  "imDbId": "tt0045152",
  "title": "Singin' in the Rain",
  "fullTitle": "Singin' in the Rain (1952)",
  "type": "Movie",
  "year": "1952",
  "language": "en",
  "titleInLanguage": "Singin' in the Rain",
  "url": "https://en.wikipedia.org/wiki/Singin%27_in_the_Rain",
  "plotShort": {
    "plainText": "Singin' in the Rain is a 1952 American musical romantic comedy film directed and choreographed by Gene Kelly and Stanley Donen, starring Kelly, Donald O'Connor, and Debbie Reynolds and featuring Jean Hagen, Millard Mitchell and Cyd Charisse. It offers a lighthearted depiction of Hollywood in the late 1920s, with the three stars portraying performers caught up in the transition from silent films to \"talkies\".\r\nThe film was only a modest hit when it was first released. O'Connor won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and Betty Comden and Adolph Green won the Writers Guild of America Award for their screenplay, while Jean Hagen was nominated for the Academy Award for Best Supporting Actress. However, it has since been accorded legendary status by contemporary critics, and is often regarded as the greatest musical film ever made and one of the greatest films ever made, as well as the greatest film made in the \"Freed Unit\" at Metro-Goldwyn-Mayer. It topped the AFI's Greatest Movie Musicals list and is ranked as the fifth-greatest American motion picture of all time in its updated list of the greatest American films in 2007.\r\nIn 1989, Singin' in the Rain was one of the first 25 films selected by the United States Library of Congress for preservation in the National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2005, the British Film Institute included it in its list of the 50 films to be seen by the age of 14. In 2008, Empire magazine ranked it as the eighth-best film of all time. In Sight & Sound magazine's 2022 list of the greatest films of all time, Singin' in the Rain placed 10th.",
    "html": "<p>Singin' in the Rain is a 1952 American musical romantic comedy film directed and choreographed by Gene Kelly and Stanley Donen, starring Kelly, Donald O'Connor, and Debbie Reynolds and featuring Jean Hagen, Millard Mitchell and Cyd Charisse. It offers a lighthearted depiction of Hollywood in the late 1920s, with the three stars portraying performers caught up in the transition from silent films to \"talkies\".</p><p>The film was only a modest hit when it was first released. O'Connor won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and Betty Comden and Adolph Green won the Writers Guild of America Award for their screenplay, while Jean Hagen was nominated for the Academy Award for Best Supporting Actress. However, it has since been accorded legendary status by contemporary critics, and is often regarded as the greatest musical film ever made and one of the greatest films ever made, as well as the greatest film made in the \"Freed Unit\" at Metro-Goldwyn-Mayer. It topped the AFI's Greatest Movie Musicals list and is ranked as the fifth-greatest American motion picture of all time in its updated list of the greatest American films in 2007.</p><p>In 1989, Singin' in the Rain was one of the first 25 films selected by the United States Library of Congress for preservation in the National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2005, the British Film Institute included it in its list of the 50 films to be seen by the age of 14. In 2008, Empire magazine ranked it as the eighth-best film of all time. In Sight & Sound magazine's 2022 list of the greatest films of all time, Singin' in the Rain placed 10th.</p>"
  },
  "plotFull": {
    "plainText": "Singin' in the Rain is a 1952 American musical romantic comedy film directed and choreographed by Gene Kelly and Stanley Donen, starring Kelly, Donald O'Connor, and Debbie Reynolds and featuring Jean Hagen, Millard Mitchell and Cyd Charisse. It offers a lighthearted depiction of Hollywood in the late 1920s, with the three stars portraying performers caught up in the transition from silent films to \"talkies\".\r\nThe film was only a modest hit when it was first released. O'Connor won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and Betty Comden and Adolph Green won the Writers Guild of America Award for their screenplay, while Jean Hagen was nominated for the Academy Award for Best Supporting Actress. However, it has since been accorded legendary status by contemporary critics, and is often regarded as the greatest musical film ever made and one of the greatest films ever made, as well as the greatest film made in the \"Freed Unit\" at Metro-Goldwyn-Mayer. It topped the AFI's Greatest Movie Musicals list and is ranked as the fifth-greatest American motion picture of all time in its updated list of the greatest American films in 2007.\r\nIn 1989, Singin' in the Rain was one of the first 25 films selected by the United States Library of Congress for preservation in the National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2005, the British Film Institute included it in its list of the 50 films to be seen by the age of 14. In 2008, Empire magazine ranked it as the eighth-best film of all time. In Sight & Sound magazine's 2022 list of the greatest films of all time, Singin' in the Rain placed 10th.\r\nPlot\r\nDon Lockwood is a popular silent film star with humble roots as a hoofer and stuntman. Don barely tolerates his spoiled and conniving costar Lina Lamont, though their studio, Monumental Pictures, links them romantically to increase their popularity. Lina is convinced that they truly are in love, despite Don's protestations otherwise.\r\nAt the premiere of their latest film, The Royal Rascal, Don tells the gathered crowd a version of his life story, including his motto: \"Dignity, always dignity.\" His words are humorously contradicted by flashbacks showing him alongside his best friend Cosmo Brown since their childhood (\"Fit as a Fiddle\"). To escape from his fans after the premiere, Don jumps into a passing car driven by Kathy Selden. Because of his shabby look thanks to being manhandled by the fans, she thinks him a vagrant trying to rob her, but Don's identity is proven by a policeman Kathy tries to get help from. She drops him off at where he needs to go but not before claiming to be a stage actress and sneering at his \"undignified\" accomplishments as a movie star.\r\nLater, at an after-party, the head of Don's studio, R.F. Simpson, shows a short demonstration of a talking picture, but his guests are unimpressed, claiming it will never amount to anything. Cosmo however warns, \"That's what they said about the horseless carriage.\" To Don's amusement, Kathy pops out of a mock cake right in front of him, revealing herself to be a chorus girl (\"All I Do is Dream of You\"). Furious at Don's teasing, she throws a cake at him, accidentally hitting Lina in the face when Don ducks, and then flees. Don becomes smitten with Kathy and searches for her for weeks, with Cosmo trying to cheer him up (\"Make 'Em Laugh\"). While filming a romantic scene, a jealous Lina reveals that her influence is behind Kathy's loss of work and subsequent disappearance. On the studio lot, Cosmo finally finds Kathy quietly working in another Monumental Pictures production (\"Beautiful Girl\"). Don sings her a love song, and she confesses to having been a fan of his all along (\"You Were Meant for Me\").\r\nAfter rival studio Warner Bros. has an enormous hit with its first talking picture, the 1927 film The Jazz Singer, R.F. decides he has no choice but to convert the next Lockwood and Lamont film, The Dueling Cavalier, into a talkie. The production is beset with difficulties, including the actors being unfamiliar with the recording technology used and Lina's grating voice and strong Brooklyn accent, driving poor director Roscoe Dexter to tears. An exasperated diction coach tries to teach her how to speak properly, but to no avail. In contrast, Don fares far better when taking diction lessons (\"Moses Supposes\"). The Dueling Cavalier's preview screening is a disaster; the actors are barely audible thanks to the awkward placing of the microphones, Don repeats the line \"I love you\" to Lina over and over, to the audience's derisive laughter, and in the middle of the film, the sound goes out of synchronization, with hilarious results as Lina shakes her head while the villain's deep voice says, \"Yes! Yes! Yes!\" and the villain nods his head while Lina's squeaky soprano says, \"No! No! No!\"\r\nAfterward (\"Good Morning\"), Kathy and Cosmo help Don come up with the idea to turn The Dueling Cavalier into a musical called The Dancing Cavalier, complete with a modern musical number and backstory. The three are disheartened when they realize Lina's terrible voice remains a problem. Still, Cosmo, inspired by the scene in The Dueling Cavalier where Lina's voice was out of sync, suggests that they dub Lina's voice with Kathy's (\"Singin' in the Rain\"). After hearing Don and Cosmo pitch the idea (\"Broadway Melody\"), R.F. approves but tells them not to inform Lina that Kathy is doing the dubbing. Having learned the truth, an infuriated Lina barges in on a dubbing session, and becomes even angrier when she is told that Don and Kathy are in love and intend to marry, and that R.F. intends to give Kathy a screen credit and a big publicity buildup. Lina threatens to sue R.F. unless he makes sure no one ever hears of Kathy and that she keeps dubbing for the rest of her career. R.F. reluctantly agrees because of a clause in Lina's contract which holds the studio responsible for positive media coverage.\r\nThe premiere of The Dancing Cavalier is a tremendous success (\"Would You\"). When the audience clamors for Lina to sing live, Don, Cosmo, and R.F. tell her to lip sync into a microphone while Kathy, concealed behind the curtain, sings into a second one. While Lina is \"singing\" (\"Singin' in the Rain Reprise\"), Don, Cosmo and R.F. gleefully open the curtain, revealing the fakery. The defeated Lina flees in humiliation, and a distressed Kathy tries to run away as well, but Don proudly announces to the audience that she's \"the real star\" of the film (\"You Are My Lucky Star\"). Later, Kathy and Don kiss in front of a billboard for their new film, Singin' in the Rain.\r\nCast\r\nGene Kelly as Donald (Don) Lockwood\r\nDonald O'Connor as Cosmo Brown\r\nDebbie Reynolds as Kathy Selden.\r\nJean Hagen as Lina Lamont. Fresh from her role in The Asphalt Jungle, Hagen read for the part for producer Arthur Freed. She did a dead-on impression of Billie Dawn, Judy Holliday's character from Born Yesterday – for which Hagen had been Holliday's understudy – which won her the role.\r\nMillard Mitchell as R.F. Simpson. The initials of the fictional head of Monumental Pictures are a reference to producer Arthur Freed. R.F. also uses one of Freed's favorite expressions when he says that he \"cannot quite visualize it\" and has to see it on film first, referring to the \"Broadway Melody\" sequence. This is a joke, since the audience has just seen it.\r\nCyd Charisse as the long-legged woman in the green sequined dress and Louise Brooks–style hair who vamps Gene Kelly in the \"Broadway Melody\" sequence.\r\nDouglas Fowley as Roscoe Dexter, the director of Don and Lina's films.\r\nRita Moreno as Zelda Zanders, the \"Zip Girl\" and Lina's friend. As of 2023, Moreno is the last surviving credited star from the film.\r\nUncredited\r\nDawn Addams as \"Teresa\", a lady-in-waiting to Lina's character in The Duelling Cavalier\r\nMadge Blake as Dora Bailey, a Hollywood gossip columnist based on Louella Parsons\r\nMae Clarke as the hairdresser who puts the finishing touches on Lina Lamont's hairdo\r\nJohn Dodsworth as \"Baron de la Ma de la Toulon\", the villain in The Duelling Cavalier\r\nKing Donovan as Rod, head of the publicity department at Monumental Pictures\r\nTommy Farrell as Sid Phillips, the director of the movie featuring \"Beautiful Girl\"\r\nKathleen Freeman as Phoebe Dinsmore, Lina's diction coach\r\nStuart Holmes as J. Cumberland Spendrill III, Olga Mara's husband who accompanies her to the premiere of The Royal Rascal\r\nJudy Landon as Olga Mara, a silent screen vamp who attends the premiere of The Royal Rascal.\r\nBetty Noyes as the singing voice of Debbie Reynolds on \"Would You\" and \"You Are My Lucky Star\"In addition, although the film revolves around the idea that Kathy has to dub for Lina's piercing voice, in the scene where Kathy is portrayed recording a line of Lina's dialogue (\"Nothing can keep us apart, our love will last 'til the stars turn cold\"), Jean Hagen's normal voice is used, because Hagen's deep, rich voice was preferred over Reynolds' somewhat thin and youthful one.\r\nIn addition, although the film revolves around the idea that Kathy has to dub for Lina's piercing voice, in the scene where Kathy is portrayed recording a line of Lina's dialogue (\"Nothing can keep us apart, our love will last 'til the stars turn cold\"), Jean Hagen's normal voice is used, because Hagen's deep, rich voice was preferred over Reynolds' somewhat thin and youthful one.\r\nJulius Tannen as the man demonstrating the technology of talking pictures\r\nJimmy Thompson as the singer of \"Beautiful Girl\"\r\nBobby Watson as Lockwood's diction coach during the \"Moses Supposes\" number\r\nSongs\r\nSingin' in the Rain was originally conceived by MGM producer Arthur Freed, the head of the \"Freed Unit\" responsible for turning out MGM's lavish musicals, as a vehicle for his catalog of songs written with Nacio Herb Brown for previous MGM musical films of the 1929–39 period. Screenwriters Betty Comden and Adolph Green wrote one entirely new song, \"Moses Supposes\", with music director Roger Edens providing the music (see below). Freed and Brown wrote a new song for the movie, \"Make 'Em Laugh\".\r\nAll songs have lyrics by Freed and music by Brown unless otherwise indicated. Some of the songs, such as \"Broadway Rhythm\", \"Should I?\", and especially \"Singin' in the Rain\" itself, have been featured in numerous films. The films listed below mark the first time each song was presented on screen.\r\n\"Fit as a Fiddle (And Ready for Love)\", originally published in 1932 with music by Al Hoffman and Al Goodhart, lyrics by Freed.\r\n\"Temptation\" (instrumental only) from Going Hollywood (1933).\r\n\"All I Do Is Dream of You\" from Sadie McKee (1934). The arrangement in \"Singin' in the Rain\" is an up tempo, upbeat, \"flapper\" version of the song with full instrumentation. In contrast, the \"Sadie McKee\" version is slower tempo, and appears routinely throughout the film as a love ballad accompanied by a solo ukulele. An instrumental only version with full orchestration is also part of the film's opening and closing theme. An instrumental version was also played on the piano by Chico Marx in the 1935 Marx Brothers film A Night at the Opera.\r\n\"Singin' in the Rain\" from The Hollywood Revue of 1929 (1929). Kelly's performance in the song is now considered iconic.\r\n\"Make 'Em Laugh\", considered an original song, but bearing a striking resemblance to Cole Porter's \"Be a Clown\" from another MGM Freed-produced musical, The Pirate (1948).\r\n\"Beautiful Girl Montage\" comprising \"I've Got a Feelin' You're Foolin'\" from Broadway Melody of 1936 (1935), \"The Wedding of the Painted Doll\" from The Broadway Melody (1929), \"Should I?\" from Lord Byron of Broadway (1930) and \"Beautiful Girl\" from Stage Mother (1933)\r\n\"You Were Meant for Me\" from The Broadway Melody (1929)\r\n\"You Are My Lucky Star\" from Broadway Melody of 1936 (1935)\r\n\"Moses Supposes\" (music by Roger Edens, lyrics by Comden and Green), from a 1944 version based on the tongue-twister with the same title.\r\n\"Good Morning\" from Babes In Arms (1939)\r\n\"Would You?\" from San Francisco (1936)\r\n\"Broadway Melody\" composed of \"The Broadway Melody\" from The Broadway Melody (1929) and \"Broadway Rhythm\" from Broadway Melody of 1936 (1935). The music for the \"Broadway Ballet\" section is by Nacio Herb Brown.\r\nProduction\r\nHistory\r\nArthur Freed, the head of the \"Freed Unit\" at MGM responsible for the studio's glossy and glamorous musicals, conceived the idea of a movie based on the back catalog of songs written by himself and Nacio Herb Brown, and called in Betty Comden and Adolph Green from New York to come up with a story to tie the songs together and to write the script. Comden and Green first refused the assignment, as their agent had assured them that their new contract with MGM called for them to write the lyrics to all songs unless the score was by Irving Berlin, Cole Porter, or Rodgers and Hammerstein. After a two-week hold-out, their new agent, Irving \"Swifty\" Lazar, having looked over the contract, told them that the clause had been entirely an invention of their previous agent, and that there was no such language in the contract. After hearing this, Comden and Green began working on the story and script.\r\nBecause many of the songs had originally been written during the time when silent films were giving way to \"talkies\" and musicals were popular with audiences, Comden and Green came up with the idea that the story should be set during that transitional period in Hollywood, an era they were intimately familiar with. When Howard Keel was mentioned as the possible lead, they tried to work up a story involving a star of Western films who makes a comeback as a singing cowboy, but they kept gravitating to a story about a swashbuckling romantic hero with a vaudeville background who survives the transition by falling back on his abilities as a song-and-dance man, a story which Gene Kelly was well-suited for.\r\nKelly could not be approached at the time, as he was deeply immersed in An American in Paris (1951), which he was co-choreographing with Stanley Donen, and in which he was starring. Comden and Green continued to work on the script, and had at that time three possible openings for the film: a silent movie premiere, a magazine interview with a Hollywood star, and a star-meets-girl, star-loses-girl sequence. Unable to decide which to use or how to proceed, they had just decided to return their advance to MGM and admit defeat, when Betty Comden's husband arrived from New York and suggested that they combine all three openings into one. The script with the re-written opening was approved by Freed and by MGM's head of production Dore Schary, who had recently replaced Louis B. Mayer.\r\nBy this time shooting on An American in Paris had completed, and Freed suggested that Kelly be given the script to read. Kelly and Donen responded enthusiastically, and immediately become involved in re-writes and adjustments to the script. Comden, Green, Kelly, and Donen were all old friends, and the process went smoothly. Besides the Freed-Brown songs, Comden and Green contributed the lyrics to \"Moses Supposes\", which was set to music by Roger Edens. Shortly before shooting began, \"The Wedding of the Painted Doll\", which Comden and Green had \"painfully wedged into the script as a cheering-up song\" was replaced with a new Freed/Brown song, \"Make 'Em Laugh\", which bore a remarkable resemblance to Cole Porter's 1948 song \"Be a Clown\".\r\nAfter Comden and Green had returned to New York to work on other projects, they received word that a new song was needed for a love-song sequence between Kelly and Debbie Reynolds. The original had been a song-and-dance medley involving different sets in different soundstages on the studio lot, but they were asked for a romantic love song set in an empty sound stage, and it was needed immediately. Comden and Green provided such a scene for \"You Were Meant for Me\" and sent it off to Hollywood.\r\nRevisions from early drafts\r\nIn an early draft of the script, the musical number \"Singin' in the Rain\" was to be sung by Reynolds, O'Connor, and Kelly, emerging from a restaurant after the flop preview of The Dueling Cavalier, to celebrate the idea of changing the film into a musical.\r\nKelly singing \"You Were Meant For Me\" to Reynolds on an empty sound stage was not included in that draft. The number was originally conceived as Kelly singing a medley of other songs to her as they romped around various studio back lot sets.\r\nRita Moreno was originally to have sung the lead in \"I've Got a Feelin' You're Foolin'\" with other showgirls, but this ended up as part of the \"Beautiful Girl Montage\" without her.\r\nScenes filmed but cut before release\r\nGene Kelly sang a reprise of \"All I Do Is Dream of You\" after the party at R.F. Simpson's house when Kelly chases after Reynolds. The song, ending in Kelly's bedroom, was cut from the release version after two previews, and the footage has been lost.\r\nReynolds' solo rendition of \"You Are My Lucky Star\" (to a billboard showing an image of Lockwood) was cut after previews. This number has survived and is included on the original soundtrack and DVD version of the film. It also was used in the retrospective film That's Entertainment III.\r\nIn the steamy \"Vamp Dance\" segment of the \"Broadway Melody Ballet\" with Cyd Charisse and Gene Kelly, reviewers from both the Production Code and the Catholic Legion of Decency objected to a brief, suggestive pose or movement between the dancers. Although there is no precise documentation of what or where it was, close examination of footage toward the end of the dance shows an abrupt cut when Charisse is wrapped around Kelly, indicating the probable location.\r\nOther notes\r\nReynolds' singing in two songs was dubbed by Betty Noyes, one of them when Kathy is shown dubbing Lina Lamont, while her high notes and taps were dubbed in the entire film. The spoken dialog in the same scene was actually uttered by Hagen. Donen once explained Reynolds' \"mid-western\" accent was thought inferior to Hagen's natural speaking voice for this one scene.\r\nIn the sequence in which Gene Kelly dances and sings the title song while spinning an umbrella, splashing through puddles and getting soaked with rain, Kelly was sick with a 103 °F (39 °C) fever. The water used in the scene caused Kelly's wool suit to shrink during filming. A common myth is that Kelly managed to perform the entire song in one take, thanks to cameras placed at predetermined locations. However, this was not the case; filming the sequence took two to three days. Another myth is that the rain was mixed with milk in order for the drops to show up better on camera; but the desired visual effect was produced, albeit with difficulty, through backlighting.\r\nDebbie Reynolds was not a dancer when she made Singin' in the Rain; her background was as a gymnast. Kelly apparently insulted her for her lack of dance experience, upsetting her. In a subsequent encounter when Fred Astaire was in the studio, he found Reynolds crying under a piano. Hearing what had happened, Astaire volunteered to help her with her dancing. Kelly later admitted that he had not been kind to Reynolds and was surprised that she was still willing to talk to him afterwards. After shooting the \"Good Morning\" routine, which had taken from 8:00 a.m. until 11:00 p.m. to shoot, Reynolds' feet were bleeding. Years later, she was quoted as saying that \"Singin' in the Rain and childbirth were the two hardest things I ever had to do in my life.\"\r\nDonald O'Connor, a four-pack-a-day smoker at the time, had to stay in bed in the hospital for several days after filming the \"Make 'Em Laugh\" sequence.\r\nMost of the costumes from this film were eventually acquired by Debbie Reynolds and held in her massive collection of original film costumes, sets, and props. Many of these items were sold at a 2011 auction in Hollywood. While most items were sold to private collectors, Donald O'Connor's green check \"Fit As a Fiddle\" suit and shoes were purchased by Costume World, Inc. They are now on permanent display at the Costume World Broadway Collection Museum in Pompano Beach, Florida.\r\nReception\r\nAccording to MGM records, during the film's initial theatrical release, it made $3,263,000 in the US and Canada, and $2,367,000 internationally, earning the studio a profit of $666,000. It was the tenth-highest-grossing movie of the year in the US and Canada.\r\nCritical response\r\nBosley Crowther of The New York Times wrote: \"Compounded generously of music, dance, color spectacle and a riotous abundance of Gene Kelly, Jean Hagen and Donald O'Connor on the screen, all elements in this rainbow program are carefully contrived and guaranteed to lift the dolors of winter and put you in a buttercup mood.\" Variety was also positive, writing: \"Arthur Freed has produced another surefire grosser for Metro in Singin' in the Rain. Musical has pace, humor, and good spirits a-plenty, in a breezy, good-natured spoof at the film industry itself ... Standout performances by Gene Kelly and Donald O'Connor, especially the latter, enhance the film's pull.\" Harrison's Reports called it \"top-notch entertainment in every department – music, dancing, singing, staging and story\". Richard L. Coe of The Washington Post called it \"yet another fresh and breezy, colorful and funny musical\" from Gene Kelly, adding, \"Of the players there's not a dud in the lot, from Kelly's facile performing to the brief but electric dance appearance by Cyd Charisse, a swell partner for him.\"\r\nPauline Kael, the long-time film critic for The New Yorker, said of the film \"This exuberant and malicious satire of Hollywood in the late twenties is perhaps the most enjoyable of movie musicals – just about the best Hollywood musical of all time.\" Roger Ebert placed Singin' in the Rain on his Great Movies list, calling the film \"a transcendent experience, and no one who loves movies can afford to miss it.\"\r\nOn review aggregator Rotten Tomatoes, the film has a perfect 100% approval rating based on 64 reviews, with an average rating of 9.3/10. The website's critical consensus reads: \"Clever, incisive, and funny, Singin' In The Rain is a masterpiece of the classical Hollywood musical.\" On Metacritic, the film has a weighted average score of 99 out of 100, based on 17 critics, indicating \"universal acclaim\". The film made each site's list of best-rated films, ranked 46th on Rotten Tomatoes (as of 2021) and 9th on Metacritic.\r\nAdmiration in the film industry\r\nBetty Comden and Adolph Green report that when they met François Truffaut at a party in Paris, Truffaut was very excited to meet the authors of Chantons sous la pluie. He told them that he had seen the film so many times that he knew it frame by frame, and that he and fellow director and screenwriter Alain Resnais, among others, went to see it regularly at a small Parisian movie theatre where it sometimes ran for months at a time.\r\nAwards and honors\r\nThe film is recognized by the American Film Institute in these lists:\r\n1998: AFI's 100 Years...100 Movies – #10\r\n2000: AFI's 100 Years...100 Laughs – #16\r\n2002: AFI's 100 Years...100 Passions – #16\r\n2003: AFI's 100 Years...100 Heroes & Villains: Lina Lamont – Nominated Villain\r\nLina Lamont – Nominated Villain\r\n2004: AFI's 100 Years...100 Songs: \"Singin' in the Rain\" – #3 \"Make 'Em Laugh\" – #49 \"Good Morning\" – #72\r\n\"Singin' in the Rain\" – #3\r\n\"Make 'Em Laugh\" – #49\r\n\"Good Morning\" – #72\r\n2005: AFI's 100 Years...100 Movie Quotes: Lina Lamont: \"What do they think I am, dumb or something? Why, I make more money than Calvin Coolidge! Put together!\" – Nominated\r\nLina Lamont: \"What do they think I am, dumb or something? Why, I make more money than Calvin Coolidge! Put together!\" – Nominated\r\n2006: AFI's Greatest Movie Musicals – #1\r\n2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #5\r\nIn 1989, Singin' in the Rain was among the first 25 films chosen for the newly established National Film Registry for films that are deemed \"culturally, historically or aesthetically significant\" by the United States Library of Congress and selected for preservation.\r\nSingin' in the Rain has appeared three times on Sight & Sound's list of the ten best films of all time, in 1982, 2002 and 2022. Its position in 1982 was at number 4 on the critics list; on the 2002 critics' list, it was listed as number 10, and it tied for 19 on the directors' list; on the 2022 critics' list, it was listed again as number 10. In 2008, Singin' in the Rain was placed on Empire's 500 Greatest Movies of All Time List, ranking at #8, the highest ranked G-rated movie on the list.\r\nHome media\r\nThe film was released on home video on July 16, 1985.\r\nThe 40th Anniversary Edition VHS version released in 1992 include a documentary, the original trailer, and Reynolds' solo rendition of \"You Are My Lucky Star\", which had been cut from the final film.\r\nAccording to the audio commentary on the 2002 Special Edition DVD, the original negative was destroyed in a fire. Despite this, the film was digitally restored for its DVD release. A Blu-ray Ultimate Collector's Edition was released in July 2012. A Ultra HD Blu-ray was released on April 26, 2022.\r\nThe digital version of the film is currently available to stream on HBO Max.\r\nAdaptations\r\nComic book adaptation\r\nEastern Color Movie Love #14 (April 1952)\r\nStage adaptationThe Broadway musical Singin' in the Rain was adapted from the motion picture, and the plot of the stage version closely adheres to the original. Directed and choreographed by post-modern choreographer Twyla Tharp, the opening night cast starred Don Correia as Don Lockwood, Mary D'Arcy as Kathy Selden, Richard Fancy as Roscoe Dexter, Faye Grant as Lina Lamont, and Peter Slutsker as Cosmo Brown. The musical opened on July 2, 1985, at the Gershwin Theatre after 39 previews, and ran for 367 performances, closing on May 18, 1986.\r\nIn popular culture\r\nKelly's hometown Pittsburgh Pirates games at PNC Park play the scene from the film during rain delays.\r\nGene Kelly's \"Singin' in the Rain\" sequence was one of the opening scenes of The Great Movie Ride at Disney's Hollywood Studios. Kelly approved his Audio-Animatronics likeness prior to its delivery to Florida.\r\n1971 - In Stanley Kubrick's film \"A Clockwork Orange\" Alex (Malcolm McDowell) sings \"Singin' in the Rain\" during the home invasion and rape scene.\r\n1976 – In their 1976 Christmas special, the British comedy act Morecambe and Wise parodied the \"Singin' in the Rain\" sequence.\r\n1983 – In the television special Paddington Goes to the Movies, the film is mentioned at some points and Paddington performs a version of Gene Kelly's famous dance from the film.\r\n1986 – In the film Legal Eagles, Robert Redford \"sings in the rain\" watching the movie on TV during a sleepless night.\r\n1989 – In the Woody Allen film Crimes and Misdemeanors, Cliff (Woody Allen) and Halley (Mia Farrow) watch Singin' in the Rain at Cliff's apartment. Cliff claims to watch the film \"every few months to keep my spirits up\".\r\n2005 – The dance to the title song is parodied in the Monty Python Broadway musical Spamalot in the dance break to \"Always Look on the Bright Side of Life\", complete with tap-dancing knights spinning bright yellow umbrellas around.\r\n2005 – The \"Singin' in the Rain\" sequence was featured in a Volkswagen Golf commercial, with Gene Kelly seen break-dancing in the street. Also featured was Mint Royale's version of the song accompanying the commercial.\r\n2005 – A parody of the number \"Singin' in the Rain\" was featured in the 2005 animated film Robots where Fender (Robin Williams) breaks out singing and dancing after dropping off a date. Instead of 'rain' he says 'oil' to fit the film's theme, and emulates Gene Kelly's iconic swing on the lamppost.\r\n2010 – Two songs from the film were featured in \"The Substitute\", a season 2 episode of the musical comedy television series Glee.\r\n2012 – In the film Silver Linings Playbook, Jennifer Lawrence's character is inspired by a clip of Donald O'Connor and Gene Kelly dancing to \"Moses Supposes\" from Singin' in the Rain.\r\n2013 – The anime short Gisoku no Moses features a young female ghost dancing with a pair of haunted dance shoes to the tune of \"Moses Supposes\".\r\n2015 – In the romantic drama film Brooklyn, Tony Fiorello (Emory Cohen) takes Eilis Lacey (Saoirse Ronan) out on a date to see the film. In the next scene, he emulates Gene Kelly's iconic swing on the lamppost.\r\n2015 – The scene in which Gene Kelly sings \"You Were Meant for Me\" is featured in the Nancy Meyers film The Intern. Tropicana Products used this song in their commercial throughout 2015 adverting their orange juice.\r\n2016 – Singin' in the Rain was an inspiration for the musical film La La Land, directed by Damien Chazelle.\r\n2017 – The song \"Good Morning\" was featured in the Legends of Tomorrow season 3 episode \"Phone Home\".\r\n2019 – The video to the BTS song \"Boy with Luv\" heavily references \"Singin' in the Rain.\r\n2022 – The plot lines closely resembling Singin' in the Rain are used in the feature film Downton Abbey: A New Era.\r\n2022 - The plot and scenes from the film itself are heavily referenced and depicted in the historical comedy-drama film, Babylon, directed by Damien Chazelle.",
    "html": "<p>Singin' in the Rain is a 1952 American musical romantic comedy film directed and choreographed by Gene Kelly and Stanley Donen, starring Kelly, Donald O'Connor, and Debbie Reynolds and featuring Jean Hagen, Millard Mitchell and Cyd Charisse. It offers a lighthearted depiction of Hollywood in the late 1920s, with the three stars portraying performers caught up in the transition from silent films to \"talkies\".</p><p>The film was only a modest hit when it was first released. O'Connor won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and Betty Comden and Adolph Green won the Writers Guild of America Award for their screenplay, while Jean Hagen was nominated for the Academy Award for Best Supporting Actress. However, it has since been accorded legendary status by contemporary critics, and is often regarded as the greatest musical film ever made and one of the greatest films ever made, as well as the greatest film made in the \"Freed Unit\" at Metro-Goldwyn-Mayer. It topped the AFI's Greatest Movie Musicals list and is ranked as the fifth-greatest American motion picture of all time in its updated list of the greatest American films in 2007.</p><p>In 1989, Singin' in the Rain was one of the first 25 films selected by the United States Library of Congress for preservation in the National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2005, the British Film Institute included it in its list of the 50 films to be seen by the age of 14. In 2008, Empire magazine ranked it as the eighth-best film of all time. In Sight & Sound magazine's 2022 list of the greatest films of all time, Singin' in the Rain placed 10th.</p><br/><h3>Plot</h3><p>Don Lockwood is a popular silent film star with humble roots as a hoofer and stuntman. Don barely tolerates his spoiled and conniving costar Lina Lamont, though their studio, Monumental Pictures, links them romantically to increase their popularity. Lina is convinced that they truly are in love, despite Don's protestations otherwise.</p><p>At the premiere of their latest film, The Royal Rascal, Don tells the gathered crowd a version of his life story, including his motto: \"Dignity, always dignity.\" His words are humorously contradicted by flashbacks showing him alongside his best friend Cosmo Brown since their childhood (\"Fit as a Fiddle\"). To escape from his fans after the premiere, Don jumps into a passing car driven by Kathy Selden. Because of his shabby look thanks to being manhandled by the fans, she thinks him a vagrant trying to rob her, but Don's identity is proven by a policeman Kathy tries to get help from. She drops him off at where he needs to go but not before claiming to be a stage actress and sneering at his \"undignified\" accomplishments as a movie star.</p><p>Later, at an after-party, the head of Don's studio, R.F. Simpson, shows a short demonstration of a talking picture, but his guests are unimpressed, claiming it will never amount to anything. Cosmo however warns, \"That's what they said about the horseless carriage.\" To Don's amusement, Kathy pops out of a mock cake right in front of him, revealing herself to be a chorus girl (\"All I Do is Dream of You\"). Furious at Don's teasing, she throws a cake at him, accidentally hitting Lina in the face when Don ducks, and then flees. Don becomes smitten with Kathy and searches for her for weeks, with Cosmo trying to cheer him up (\"Make 'Em Laugh\"). While filming a romantic scene, a jealous Lina reveals that her influence is behind Kathy's loss of work and subsequent disappearance. On the studio lot, Cosmo finally finds Kathy quietly working in another Monumental Pictures production (\"Beautiful Girl\"). Don sings her a love song, and she confesses to having been a fan of his all along (\"You Were Meant for Me\").</p><p>After rival studio Warner Bros. has an enormous hit with its first talking picture, the 1927 film The Jazz Singer, R.F. decides he has no choice but to convert the next Lockwood and Lamont film, The Dueling Cavalier, into a talkie. The production is beset with difficulties, including the actors being unfamiliar with the recording technology used and Lina's grating voice and strong Brooklyn accent, driving poor director Roscoe Dexter to tears. An exasperated diction coach tries to teach her how to speak properly, but to no avail. In contrast, Don fares far better when taking diction lessons (\"Moses Supposes\"). The Dueling Cavalier's preview screening is a disaster; the actors are barely audible thanks to the awkward placing of the microphones, Don repeats the line \"I love you\" to Lina over and over, to the audience's derisive laughter, and in the middle of the film, the sound goes out of synchronization, with hilarious results as Lina shakes her head while the villain's deep voice says, \"Yes! Yes! Yes!\" and the villain nods his head while Lina's squeaky soprano says, \"No! No! No!\"</p><p>Afterward (\"Good Morning\"), Kathy and Cosmo help Don come up with the idea to turn The Dueling Cavalier into a musical called The Dancing Cavalier, complete with a modern musical number and backstory. The three are disheartened when they realize Lina's terrible voice remains a problem. Still, Cosmo, inspired by the scene in The Dueling Cavalier where Lina's voice was out of sync, suggests that they dub Lina's voice with Kathy's (\"Singin' in the Rain\"). After hearing Don and Cosmo pitch the idea (\"Broadway Melody\"), R.F. approves but tells them not to inform Lina that Kathy is doing the dubbing. Having learned the truth, an infuriated Lina barges in on a dubbing session, and becomes even angrier when she is told that Don and Kathy are in love and intend to marry, and that R.F. intends to give Kathy a screen credit and a big publicity buildup. Lina threatens to sue R.F. unless he makes sure no one ever hears of Kathy and that she keeps dubbing for the rest of her career. R.F. reluctantly agrees because of a clause in Lina's contract which holds the studio responsible for positive media coverage.</p><p>The premiere of The Dancing Cavalier is a tremendous success (\"Would You\"). When the audience clamors for Lina to sing live, Don, Cosmo, and R.F. tell her to lip sync into a microphone while Kathy, concealed behind the curtain, sings into a second one. While Lina is \"singing\" (\"Singin' in the Rain Reprise\"), Don, Cosmo and R.F. gleefully open the curtain, revealing the fakery. The defeated Lina flees in humiliation, and a distressed Kathy tries to run away as well, but Don proudly announces to the audience that she's \"the real star\" of the film (\"You Are My Lucky Star\"). Later, Kathy and Don kiss in front of a billboard for their new film, Singin' in the Rain.</p><br/><h3>Cast</h3><ul><li>Gene Kelly as Donald (Don) Lockwood</li><li>Donald O'Connor as Cosmo Brown</li><li>Debbie Reynolds as Kathy Selden.</li><li>Jean Hagen as Lina Lamont. Fresh from her role in The Asphalt Jungle, Hagen read for the part for producer Arthur Freed. She did a dead-on impression of Billie Dawn, Judy Holliday's character from Born Yesterday – for which Hagen had been Holliday's understudy – which won her the role.</li><li>Millard Mitchell as R.F. Simpson. The initials of the fictional head of Monumental Pictures are a reference to producer Arthur Freed. R.F. also uses one of Freed's favorite expressions when he says that he \"cannot quite visualize it\" and has to see it on film first, referring to the \"Broadway Melody\" sequence. This is a joke, since the audience has just seen it.</li><li>Cyd Charisse as the long-legged woman in the green sequined dress and Louise Brooks–style hair who vamps Gene Kelly in the \"Broadway Melody\" sequence.</li><li>Douglas Fowley as Roscoe Dexter, the director of Don and Lina's films.</li><li>Rita Moreno as Zelda Zanders, the \"Zip Girl\" and Lina's friend. As of 2023, Moreno is the last surviving credited star from the film.</li></ul><p>Uncredited</p><ul><li>Dawn Addams as \"Teresa\", a lady-in-waiting to Lina's character in The Duelling Cavalier</li><li>Madge Blake as Dora Bailey, a Hollywood gossip columnist based on Louella Parsons</li><li>Mae Clarke as the hairdresser who puts the finishing touches on Lina Lamont's hairdo</li><li>John Dodsworth as \"Baron de la Ma de la Toulon\", the villain in The Duelling Cavalier</li><li>King Donovan as Rod, head of the publicity department at Monumental Pictures</li><li>Tommy Farrell as Sid Phillips, the director of the movie featuring \"Beautiful Girl\"</li><li>Kathleen Freeman as Phoebe Dinsmore, Lina's diction coach</li><li>Stuart Holmes as J. Cumberland Spendrill III, Olga Mara's husband who accompanies her to the premiere of The Royal Rascal</li><li>Judy Landon as Olga Mara, a silent screen vamp who attends the premiere of The Royal Rascal.</li><li>Betty Noyes as the singing voice of Debbie Reynolds on \"Would You\" and \"You Are My Lucky Star\"In addition, although the film revolves around the idea that Kathy has to dub for Lina's piercing voice, in the scene where Kathy is portrayed recording a line of Lina's dialogue (\"Nothing can keep us apart, our love will last 'til the stars turn cold\"), Jean Hagen's normal voice is used, because Hagen's deep, rich voice was preferred over Reynolds' somewhat thin and youthful one.</li><li>In addition, although the film revolves around the idea that Kathy has to dub for Lina's piercing voice, in the scene where Kathy is portrayed recording a line of Lina's dialogue (\"Nothing can keep us apart, our love will last 'til the stars turn cold\"), Jean Hagen's normal voice is used, because Hagen's deep, rich voice was preferred over Reynolds' somewhat thin and youthful one.</li><li>Julius Tannen as the man demonstrating the technology of talking pictures</li><li>Jimmy Thompson as the singer of \"Beautiful Girl\"</li><li>Bobby Watson as Lockwood's diction coach during the \"Moses Supposes\" number</li></ul><br/><h3>Songs</h3><p>Singin' in the Rain was originally conceived by MGM producer Arthur Freed, the head of the \"Freed Unit\" responsible for turning out MGM's lavish musicals, as a vehicle for his catalog of songs written with Nacio Herb Brown for previous MGM musical films of the 1929–39 period. Screenwriters Betty Comden and Adolph Green wrote one entirely new song, \"Moses Supposes\", with music director Roger Edens providing the music (see below). Freed and Brown wrote a new song for the movie, \"Make 'Em Laugh\".</p><p>All songs have lyrics by Freed and music by Brown unless otherwise indicated. Some of the songs, such as \"Broadway Rhythm\", \"Should I?\", and especially \"Singin' in the Rain\" itself, have been featured in numerous films. The films listed below mark the first time each song was presented on screen.</p><ul><li>\"Fit as a Fiddle (And Ready for Love)\", originally published in 1932 with music by Al Hoffman and Al Goodhart, lyrics by Freed.</li><li>\"Temptation\" (instrumental only) from Going Hollywood (1933).</li><li>\"All I Do Is Dream of You\" from Sadie McKee (1934). The arrangement in \"Singin' in the Rain\" is an up tempo, upbeat, \"flapper\" version of the song with full instrumentation. In contrast, the \"Sadie McKee\" version is slower tempo, and appears routinely throughout the film as a love ballad accompanied by a solo ukulele. An instrumental only version with full orchestration is also part of the film's opening and closing theme. An instrumental version was also played on the piano by Chico Marx in the 1935 Marx Brothers film A Night at the Opera.</li><li>\"Singin' in the Rain\" from The Hollywood Revue of 1929 (1929). Kelly's performance in the song is now considered iconic.</li><li>\"Make 'Em Laugh\", considered an original song, but bearing a striking resemblance to Cole Porter's \"Be a Clown\" from another MGM Freed-produced musical, The Pirate (1948).</li><li>\"Beautiful Girl Montage\" comprising \"I've Got a Feelin' You're Foolin'\" from Broadway Melody of 1936 (1935), \"The Wedding of the Painted Doll\" from The Broadway Melody (1929), \"Should I?\" from Lord Byron of Broadway (1930) and \"Beautiful Girl\" from Stage Mother (1933)</li><li>\"You Were Meant for Me\" from The Broadway Melody (1929)</li><li>\"You Are My Lucky Star\" from Broadway Melody of 1936 (1935)</li><li>\"Moses Supposes\" (music by Roger Edens, lyrics by Comden and Green), from a 1944 version based on the tongue-twister with the same title.</li><li>\"Good Morning\" from Babes In Arms (1939)</li><li>\"Would You?\" from San Francisco (1936)</li><li>\"Broadway Melody\" composed of \"The Broadway Melody\" from The Broadway Melody (1929) and \"Broadway Rhythm\" from Broadway Melody of 1936 (1935). The music for the \"Broadway Ballet\" section is by Nacio Herb Brown.</li></ul><br/><h3>Production</h3><h4>History</h4><p>Arthur Freed, the head of the \"Freed Unit\" at MGM responsible for the studio's glossy and glamorous musicals, conceived the idea of a movie based on the back catalog of songs written by himself and Nacio Herb Brown, and called in Betty Comden and Adolph Green from New York to come up with a story to tie the songs together and to write the script. Comden and Green first refused the assignment, as their agent had assured them that their new contract with MGM called for them to write the lyrics to all songs unless the score was by Irving Berlin, Cole Porter, or Rodgers and Hammerstein. After a two-week hold-out, their new agent, Irving \"Swifty\" Lazar, having looked over the contract, told them that the clause had been entirely an invention of their previous agent, and that there was no such language in the contract. After hearing this, Comden and Green began working on the story and script.</p><p>Because many of the songs had originally been written during the time when silent films were giving way to \"talkies\" and musicals were popular with audiences, Comden and Green came up with the idea that the story should be set during that transitional period in Hollywood, an era they were intimately familiar with. When Howard Keel was mentioned as the possible lead, they tried to work up a story involving a star of Western films who makes a comeback as a singing cowboy, but they kept gravitating to a story about a swashbuckling romantic hero with a vaudeville background who survives the transition by falling back on his abilities as a song-and-dance man, a story which Gene Kelly was well-suited for.</p><p>Kelly could not be approached at the time, as he was deeply immersed in An American in Paris (1951), which he was co-choreographing with Stanley Donen, and in which he was starring. Comden and Green continued to work on the script, and had at that time three possible openings for the film: a silent movie premiere, a magazine interview with a Hollywood star, and a star-meets-girl, star-loses-girl sequence. Unable to decide which to use or how to proceed, they had just decided to return their advance to MGM and admit defeat, when Betty Comden's husband arrived from New York and suggested that they combine all three openings into one. The script with the re-written opening was approved by Freed and by MGM's head of production Dore Schary, who had recently replaced Louis B. Mayer.</p><p>By this time shooting on An American in Paris had completed, and Freed suggested that Kelly be given the script to read. Kelly and Donen responded enthusiastically, and immediately become involved in re-writes and adjustments to the script. Comden, Green, Kelly, and Donen were all old friends, and the process went smoothly. Besides the Freed-Brown songs, Comden and Green contributed the lyrics to \"Moses Supposes\", which was set to music by Roger Edens. Shortly before shooting began, \"The Wedding of the Painted Doll\", which Comden and Green had \"painfully wedged into the script as a cheering-up song\" was replaced with a new Freed/Brown song, \"Make 'Em Laugh\", which bore a remarkable resemblance to Cole Porter's 1948 song \"Be a Clown\".</p><p>After Comden and Green had returned to New York to work on other projects, they received word that a new song was needed for a love-song sequence between Kelly and Debbie Reynolds. The original had been a song-and-dance medley involving different sets in different soundstages on the studio lot, but they were asked for a romantic love song set in an empty sound stage, and it was needed immediately. Comden and Green provided such a scene for \"You Were Meant for Me\" and sent it off to Hollywood.</p><h4>Revisions from early drafts</h4><ul><li>In an early draft of the script, the musical number \"Singin' in the Rain\" was to be sung by Reynolds, O'Connor, and Kelly, emerging from a restaurant after the flop preview of The Dueling Cavalier, to celebrate the idea of changing the film into a musical.</li><li>Kelly singing \"You Were Meant For Me\" to Reynolds on an empty sound stage was not included in that draft. The number was originally conceived as Kelly singing a medley of other songs to her as they romped around various studio back lot sets.</li><li>Rita Moreno was originally to have sung the lead in \"I've Got a Feelin' You're Foolin'\" with other showgirls, but this ended up as part of the \"Beautiful Girl Montage\" without her.</li></ul><h4>Scenes filmed but cut before release</h4><ul><li>Gene Kelly sang a reprise of \"All I Do Is Dream of You\" after the party at R.F. Simpson's house when Kelly chases after Reynolds. The song, ending in Kelly's bedroom, was cut from the release version after two previews, and the footage has been lost.</li><li>Reynolds' solo rendition of \"You Are My Lucky Star\" (to a billboard showing an image of Lockwood) was cut after previews. This number has survived and is included on the original soundtrack and DVD version of the film. It also was used in the retrospective film That's Entertainment III.</li><li>In the steamy \"Vamp Dance\" segment of the \"Broadway Melody Ballet\" with Cyd Charisse and Gene Kelly, reviewers from both the Production Code and the Catholic Legion of Decency objected to a brief, suggestive pose or movement between the dancers. Although there is no precise documentation of what or where it was, close examination of footage toward the end of the dance shows an abrupt cut when Charisse is wrapped around Kelly, indicating the probable location.</li></ul><h4>Other notes</h4><p>Reynolds' singing in two songs was dubbed by Betty Noyes, one of them when Kathy is shown dubbing Lina Lamont, while her high notes and taps were dubbed in the entire film. The spoken dialog in the same scene was actually uttered by Hagen. Donen once explained Reynolds' \"mid-western\" accent was thought inferior to Hagen's natural speaking voice for this one scene.</p><p>In the sequence in which Gene Kelly dances and sings the title song while spinning an umbrella, splashing through puddles and getting soaked with rain, Kelly was sick with a 103 °F (39 °C) fever. The water used in the scene caused Kelly's wool suit to shrink during filming. A common myth is that Kelly managed to perform the entire song in one take, thanks to cameras placed at predetermined locations. However, this was not the case; filming the sequence took two to three days. Another myth is that the rain was mixed with milk in order for the drops to show up better on camera; but the desired visual effect was produced, albeit with difficulty, through backlighting.</p><p>Debbie Reynolds was not a dancer when she made Singin' in the Rain; her background was as a gymnast. Kelly apparently insulted her for her lack of dance experience, upsetting her. In a subsequent encounter when Fred Astaire was in the studio, he found Reynolds crying under a piano. Hearing what had happened, Astaire volunteered to help her with her dancing. Kelly later admitted that he had not been kind to Reynolds and was surprised that she was still willing to talk to him afterwards. After shooting the \"Good Morning\" routine, which had taken from 8:00 a.m. until 11:00 p.m. to shoot, Reynolds' feet were bleeding. Years later, she was quoted as saying that \"Singin' in the Rain and childbirth were the two hardest things I ever had to do in my life.\"</p><p>Donald O'Connor, a four-pack-a-day smoker at the time, had to stay in bed in the hospital for several days after filming the \"Make 'Em Laugh\" sequence.</p><p>Most of the costumes from this film were eventually acquired by Debbie Reynolds and held in her massive collection of original film costumes, sets, and props. Many of these items were sold at a 2011 auction in Hollywood. While most items were sold to private collectors, Donald O'Connor's green check \"Fit As a Fiddle\" suit and shoes were purchased by Costume World, Inc. They are now on permanent display at the Costume World Broadway Collection Museum in Pompano Beach, Florida.</p><br/><h3>Reception</h3><p>According to MGM records, during the film's initial theatrical release, it made $3,263,000 in the US and Canada, and $2,367,000 internationally, earning the studio a profit of $666,000. It was the tenth-highest-grossing movie of the year in the US and Canada.</p><h4>Critical response</h4><p>Bosley Crowther of The New York Times wrote: \"Compounded generously of music, dance, color spectacle and a riotous abundance of Gene Kelly, Jean Hagen and Donald O'Connor on the screen, all elements in this rainbow program are carefully contrived and guaranteed to lift the dolors of winter and put you in a buttercup mood.\" Variety was also positive, writing: \"Arthur Freed has produced another surefire grosser for Metro in Singin' in the Rain. Musical has pace, humor, and good spirits a-plenty, in a breezy, good-natured spoof at the film industry itself ... Standout performances by Gene Kelly and Donald O'Connor, especially the latter, enhance the film's pull.\" Harrison's Reports called it \"top-notch entertainment in every department – music, dancing, singing, staging and story\". Richard L. Coe of The Washington Post called it \"yet another fresh and breezy, colorful and funny musical\" from Gene Kelly, adding, \"Of the players there's not a dud in the lot, from Kelly's facile performing to the brief but electric dance appearance by Cyd Charisse, a swell partner for him.\"</p><p>Pauline Kael, the long-time film critic for The New Yorker, said of the film \"This exuberant and malicious satire of Hollywood in the late twenties is perhaps the most enjoyable of movie musicals – just about the best Hollywood musical of all time.\" Roger Ebert placed Singin' in the Rain on his Great Movies list, calling the film \"a transcendent experience, and no one who loves movies can afford to miss it.\"</p><p>On review aggregator Rotten Tomatoes, the film has a perfect 100% approval rating based on 64 reviews, with an average rating of 9.3/10. The website's critical consensus reads: \"Clever, incisive, and funny, Singin' In The Rain is a masterpiece of the classical Hollywood musical.\" On Metacritic, the film has a weighted average score of 99 out of 100, based on 17 critics, indicating \"universal acclaim\". The film made each site's list of best-rated films, ranked 46th on Rotten Tomatoes (as of 2021) and 9th on Metacritic.</p><h4>Admiration in the film industry</h4><p>Betty Comden and Adolph Green report that when they met François Truffaut at a party in Paris, Truffaut was very excited to meet the authors of Chantons sous la pluie. He told them that he had seen the film so many times that he knew it frame by frame, and that he and fellow director and screenwriter Alain Resnais, among others, went to see it regularly at a small Parisian movie theatre where it sometimes ran for months at a time.</p><br/><h3>Awards and honors</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"2\"><span>Academy Awards</span></td><td><span>Best Supporting Actress</span></td><td><span>Jean Hagen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Scoring of a Musical Picture</span></td><td><span>Lennie Hayton</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>British Academy Film Awards</span></td><td><span>Best Film from any Source</span></td><td><i>Singin' in the Rain</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td><span>Gene Kelly</span> and <span>Stanley Donen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>DVD Exclusive Awards</span></td><td>Best Overall New Extra Features, Library Release</td><td><i>Singin' in the Rain: 50th Anniversary Edition</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Original Retrospective Documentary, Library Release</td><td><i>Musicals Great Musicals: The Arthur Freed Unit at MGM</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Golden Globe Awards</span></td><td><span>Best Motion Picture – Musical or Comedy</span></td><td><i>Singin' in the Rain</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Motion Picture – Musical or Comedy</span></td><td><span>Donald O'Connor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Board of Review Awards</span></td><td><span>Top Ten Films</span></td><td rowspan=\"3\"><i>Singin' in the Rain</i></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">8th Place</td></tr><tr><td><span>National Film Preservation Board</span></td><td><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td>Online Film &amp; Television Association Awards <small>(1997)</small></td><td>Best Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Online Film &amp; Television Association Awards <small>(2021)</small></td><td>Best Song</td><td>\"<span>Singin' in the Rain</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Photoplay Awards</span></td><td>Best Performances of the Month (June)</td><td>Gene Kelly, Donald O'Connor and Jean Hagen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Satellite Awards</span></td><td><span>Outstanding Youth DVD</span></td><td rowspan=\"2\"><i>Singin' in the Rain</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best DVD Extras</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Written American Musical</span></td><td><span>Betty Comden</span> and <span>Adolph Green</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>The film is recognized by the American Film Institute in these lists:</p><ul><li>1998: AFI's 100 Years...100 Movies – #10</li><li>2000: AFI's 100 Years...100 Laughs – #16</li><li>2002: AFI's 100 Years...100 Passions – #16</li><li>2003: AFI's 100 Years...100 Heroes & Villains: Lina Lamont – Nominated Villain</li><li>Lina Lamont – Nominated Villain</li><li>2004: AFI's 100 Years...100 Songs: \"Singin' in the Rain\" – #3 \"Make 'Em Laugh\" – #49 \"Good Morning\" – #72</li><li>\"Singin' in the Rain\" – #3</li><li>\"Make 'Em Laugh\" – #49</li><li>\"Good Morning\" – #72</li><li>2005: AFI's 100 Years...100 Movie Quotes: Lina Lamont: \"What do they think I am, dumb or something? Why, I make more money than Calvin Coolidge! Put together!\" – Nominated</li><li>Lina Lamont: \"What do they think I am, dumb or something? Why, I make more money than Calvin Coolidge! Put together!\" – Nominated</li><li>2006: AFI's Greatest Movie Musicals – #1</li><li>2007: AFI's 100 Years...100 Movies (10th Anniversary Edition) – #5</li></ul><p>In 1989, Singin' in the Rain was among the first 25 films chosen for the newly established National Film Registry for films that are deemed \"culturally, historically or aesthetically significant\" by the United States Library of Congress and selected for preservation.</p><p>Singin' in the Rain has appeared three times on Sight & Sound's list of the ten best films of all time, in 1982, 2002 and 2022. Its position in 1982 was at number 4 on the critics list; on the 2002 critics' list, it was listed as number 10, and it tied for 19 on the directors' list; on the 2022 critics' list, it was listed again as number 10. In 2008, Singin' in the Rain was placed on Empire's 500 Greatest Movies of All Time List, ranking at #8, the highest ranked G-rated movie on the list.</p><br/><h3>Home media</h3><p>The film was released on home video on July 16, 1985.</p><p>The 40th Anniversary Edition VHS version released in 1992 include a documentary, the original trailer, and Reynolds' solo rendition of \"You Are My Lucky Star\", which had been cut from the final film.</p><p>According to the audio commentary on the 2002 Special Edition DVD, the original negative was destroyed in a fire. Despite this, the film was digitally restored for its DVD release. A Blu-ray Ultimate Collector's Edition was released in July 2012. A Ultra HD Blu-ray was released on April 26, 2022.</p><p>The digital version of the film is currently available to stream on HBO Max.</p><br/><h3>Adaptations</h3><p>Comic book adaptation</p><ul><li>Eastern Color Movie Love #14 (April 1952)</li></ul><p>Stage adaptationThe Broadway musical Singin' in the Rain was adapted from the motion picture, and the plot of the stage version closely adheres to the original. Directed and choreographed by post-modern choreographer Twyla Tharp, the opening night cast starred Don Correia as Don Lockwood, Mary D'Arcy as Kathy Selden, Richard Fancy as Roscoe Dexter, Faye Grant as Lina Lamont, and Peter Slutsker as Cosmo Brown. The musical opened on July 2, 1985, at the Gershwin Theatre after 39 previews, and ran for 367 performances, closing on May 18, 1986.</p><br/><h3>In popular culture</h3><ul><li>Kelly's hometown Pittsburgh Pirates games at PNC Park play the scene from the film during rain delays.</li><li>Gene Kelly's \"Singin' in the Rain\" sequence was one of the opening scenes of The Great Movie Ride at Disney's Hollywood Studios. Kelly approved his Audio-Animatronics likeness prior to its delivery to Florida.</li><li>1971 - In Stanley Kubrick's film \"A Clockwork Orange\" Alex (Malcolm McDowell) sings \"Singin' in the Rain\" during the home invasion and rape scene.</li><li>1976 – In their 1976 Christmas special, the British comedy act Morecambe and Wise parodied the \"Singin' in the Rain\" sequence.</li><li>1983 – In the television special Paddington Goes to the Movies, the film is mentioned at some points and Paddington performs a version of Gene Kelly's famous dance from the film.</li><li>1986 – In the film Legal Eagles, Robert Redford \"sings in the rain\" watching the movie on TV during a sleepless night.</li><li>1989 – In the Woody Allen film Crimes and Misdemeanors, Cliff (Woody Allen) and Halley (Mia Farrow) watch Singin' in the Rain at Cliff's apartment. Cliff claims to watch the film \"every few months to keep my spirits up\".</li><li>2005 – The dance to the title song is parodied in the Monty Python Broadway musical Spamalot in the dance break to \"Always Look on the Bright Side of Life\", complete with tap-dancing knights spinning bright yellow umbrellas around.</li><li>2005 – The \"Singin' in the Rain\" sequence was featured in a Volkswagen Golf commercial, with Gene Kelly seen break-dancing in the street. Also featured was Mint Royale's version of the song accompanying the commercial.</li><li>2005 – A parody of the number \"Singin' in the Rain\" was featured in the 2005 animated film Robots where Fender (Robin Williams) breaks out singing and dancing after dropping off a date. Instead of 'rain' he says 'oil' to fit the film's theme, and emulates Gene Kelly's iconic swing on the lamppost.</li><li>2010 – Two songs from the film were featured in \"The Substitute\", a season 2 episode of the musical comedy television series Glee.</li><li>2012 – In the film Silver Linings Playbook, Jennifer Lawrence's character is inspired by a clip of Donald O'Connor and Gene Kelly dancing to \"Moses Supposes\" from Singin' in the Rain.</li><li>2013 – The anime short Gisoku no Moses features a young female ghost dancing with a pair of haunted dance shoes to the tune of \"Moses Supposes\".</li><li>2015 – In the romantic drama film Brooklyn, Tony Fiorello (Emory Cohen) takes Eilis Lacey (Saoirse Ronan) out on a date to see the film. In the next scene, he emulates Gene Kelly's iconic swing on the lamppost.</li><li>2015 – The scene in which Gene Kelly sings \"You Were Meant for Me\" is featured in the Nancy Meyers film The Intern. Tropicana Products used this song in their commercial throughout 2015 adverting their orange juice.</li><li>2016 – Singin' in the Rain was an inspiration for the musical film La La Land, directed by Damien Chazelle.</li><li>2017 – The song \"Good Morning\" was featured in the Legends of Tomorrow season 3 episode \"Phone Home\".</li><li>2019 – The video to the BTS song \"Boy with Luv\" heavily references \"Singin' in the Rain.</li><li>2022 – The plot lines closely resembling Singin' in the Rain are used in the feature film Downton Abbey: A New Era.</li><li>2022 - The plot and scenes from the film itself are heavily referenced and depicted in the historical comedy-drama film, Babylon, directed by Damien Chazelle.</li></ul><br/>"
  },
  "errorMessage": ""
}