{
  "imDbId": "tt0053604",
  "title": "The Apartment",
  "fullTitle": "The Apartment (1960)",
  "type": "Movie",
  "year": "1960",
  "items": [
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1393693",
      "warningSpoilers": true,
      "date": "14 June 2006",
      "rate": "10",
      "helpful": "74 out of 84 found this helpful.",
      "title": "\"I've Decided to Take My Doctor's Advice, I'm going to become a mensch.\"",
      "content": "In the recent biography of Billy Wilder by Ed Sikov, it is mentioned that for the first time Wilder used as his protagonist a lovable loser. Think about it. In a whole lot of his previous films the main lead in Ace in the Hole, Double Indemnity, Stalag 17 are the people who are the takers as Shirley MacLaine describes Fred MacMurray here.In The Apartment, it's the schnook that's took who the story focuses on. Jack Lemmon creates one of his immortal characters in C.C. Baxter, a minor cog in the machinery of the insurance company he works for.Lemmon has maybe found a way to move up the corporate ladder, but it's driving him nuts. He lives on West 67 Street in Manhattan, a most convenient location for kanoodling. Only it isn't him that kanoodles. One time he allowed one of the middle level managers to use his apartment for a little nookie. One guy tells another and so on and so on and pretty soon Lemmon can't call his place his own.In walks big boss Fred MacMurray to seemingly save the situation. But it turns out he only wants exclusive use for himself and he actually does vault Baxter several steps up the corporate ladder. And unfortunately MacMurray is currently kanoodling with elevator operator Shirley MacLaine who Lemmon has a thing for.The Apartment was years ahead of its time in that it was one of the first major films to deal with sexual harassment. The whole group of middle executives Ray Walston, David Lewis, Willard Waterman, David White and the big cheese Fred MacMurray just look on that insurance company as one gigantic harem. As typical for 1960 note there are no women in any managerial positions at all.Fred MacMurray almost didn't play Mr. Sheldrake. Paul Douglas was cast originally, but died suddenly just before shooting on The Apartment commenced. MacMurray stepped in and got great critical reviews for another effort with Billy Wilder as a heavy. MacMurray was also starting at this time a long run in the family comedy My Three Sons on television. There would be no more bad guys in his future.Billy Wilder held out in casting for Jack Kruschen as Doctor Dreyfus the next door neighbor who is available to save Shirley MacLaine's life. The folks at United Artists were ready to sign Groucho Marx for the part. Wilder's faith in Kruschen was justified, he got an Oscar nomination for Best Supporting Actor, but lost to Peter Ustinov for Spartacus. Lemmon and MacLaine were also nominated for the leads, but failed to win. But The Apartment was chosen Best Film of 1960 and Billy Wilder was Best Director.Also look out for a biting performance by Edie Adams who really makes her role count as MacMurray's secretary and former flame. During a Christmas party she tips off MacLaine to MacMurray's philandering ways and then later on brings the house of cards all around Fred.The Apartment is so timeless in so many ways although women in the workplace have made great strides in the last 46 years. One thing though that does show how dated it is. It's mentioned that Lemmon pays $94.00 a month, presumably rent controlled, for a one bedroom apartment in the West Sixties in Manhattan.Now that is dated."
    },
    {
      "username": "moonspinner55",
      "userUrl": "https://www.imdb.com/user/ur0989035",
      "reviewLink": "https://www.imdb.com/review/rw0070306",
      "warningSpoilers": false,
      "date": "28 June 2001",
      "rate": "10",
      "helpful": "79 out of 94 found this helpful.",
      "title": "Likewise, it's a love-fest Lemmon-wise",
      "content": "One of the finest examples of smart, satiric comedy-drama ever created for the screen. Jack Lemmon (in amazing comic form) plays a working stiff in Corporate America--via New York City--whose bachelor apartment inadvertently becomes a love-nest for amorous, married executives. The film is extremely modern for 1960 and features a non-stop barrage of funny, clever talk. Lemmon is a mad genius at frenzied (yet sympathetic) characterization, and \"The Apartment\" catches him at his professional peak in the movies. Working alongside huggable neurotic Shirley MacLaine (also at her peak) and shady Fred MacMurray (parlaying his slimeball role with curt persuasion), Lemmon creates a new kind of acting: screwball realism. **** from ****"
    },
    {
      "username": "davidals",
      "userUrl": "https://www.imdb.com/user/ur2066951",
      "reviewLink": "https://www.imdb.com/review/rw1004011",
      "warningSpoilers": false,
      "date": "21 January 2005",
      "rate": "10",
      "helpful": "210 out of 223 found this helpful.",
      "title": "Becoming A Mensch",
      "content": "Ohhh - after my 4th or 5th viewing, I think this may be one of the most remarkable blends of comedy and drama to have ever been filmed - THE APARTMENT - in subtle ways - rises well above the conventions of any genre. It was my introduction to the great Billy Wilder, and my fondness for Jack Lemmon (a remarkable and sorely missed actor) begins here as well.*SOME SPOILERS* The cold take on the sex-and-money ethos to be found in many corporate environments hasn't dated one bit; it could be argued that THE APARTMENT stands a bit ahead of its' time in the depiction of (what would appear to be) educated employees treated like (and feeling like) tools to be used in generation of someone else's income. Lemmon's character never forgets that he's disposable, even if the optimist in him hopes that something better may be found in his superiors. Deep down he knows this to be a pipe dream - the sexual adventurism of those same superiors betrays their utter lack of ethics. Of course, Lemmon's character isn't entirely above it all; he's been more than willing to hire out his own apartment as a place for his colleagues' peccadilloes, in exchange for career advancement, which of course - as Wilder early on links amoral sexual conduct and professional/corporate/financial misconduct in a greater social critique - gets him into trouble.The dialogue is - as is always true with Wilder - very finely crafted, yet seems natural - this film is a remarkable display of the kind of reactions any of us would offer in similar situations. Interestingly, our two protagonists are also wonderfully imperfect as human beings - Lemmon and MacLaine bear some responsibility for the very serious situations they've gotten themselves into; they manage to realize this (\"Be a mensch!\" Lemmon's doctor neighbor exclaims) just in time to set things right. MacLaine in particular delivers a remarkable, complex performance - sweet and smart in her earliest scenes, bleak and emotionally ravaged in her climactic scene with MacMurray, naive elsewhere, sharp but hopeful at the end. The cinematography captures the entire cast beautifully - with minimal movement, abundant long takes, and a sleek lack of visual clutter, all of the principals are free to reveal their own best and worst impulses, within an environment that is stripped of artifice. The end result is a film filled with great moments one can easily identify with."
    },
    {
      "username": "bankofmarquis",
      "userUrl": "https://www.imdb.com/user/ur10919398",
      "reviewLink": "https://www.imdb.com/review/rw4161490",
      "warningSpoilers": false,
      "date": "11 May 2018",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "A classic in every sense of the word",
      "content": "My local cinema does \"Secret Movie Night\" once a month, you just show up and watch a \"classic\" of their choosing, you just don't know what it is until it starts.One of the reasons that I enjoy this is that I end up viewing films that I might not, otherwise, choose to watch. Case in point is the selection for May - the 1960 Oscar winner for Best Picture, THE APARTMENT - a \"love story\" with some comedy and some dark dramatic moments and themes. A very tricky combination of items that are bundled together, brilliantly, by a master of the craft.THE APARTMENT tells the story of nebbish office worker C.C. Baxter (Jack Lemmon in an Oscar nominated performance, more on that later) who is talked into lending his apartment to higher-ups in his company so they can carry out extra-marital affairs. When one of the affairs goes wrong, Baxter is forced to \"clean up the mess\".Written and Directed by the GREAT Billy WIlder (SOME LIKE IT HOT, SUNSET BOULEVARD), The Apartment is more than a love story, more than a look into the vacuous lives of those anonymous office workers, it is a look into the lives of those who are victims of abuse of power. Wilder, rightfully so, won the Oscar for Best Director and Best Screenplay for this film. The Apartment is strongly written and directed not flinching at the deep subject matter while also balancing things out with moments of comedy and joy, turning what could have been a dour, dark subject into a more joyous exploration of true humanity and love rising through the corruption and abuse of power heaped upon them.In the lead role of CC Baxter, Lemmon is perfectly cast. Starting as a pure comedic character who is set upon by a world too strong for him, his character slowly turns sharper, deeper, more serious and more real as the film progresses. Lemmon was nominated for the Oscar for his performance - and rightfully so. I had to look up who beat him out for the statue and found out it was Burt Lancaster's powerhouse performance in ELMER GANTRY, so I can't really argue about this (but I digress).Matching Lemmon beat for beat is Shirley MacLaine, the wronged girl who's \"issues\" (I'm not going to spoil what happens, if you haven't seen this) are at the heart of this film - and at the heart of Lemmon's character. MacLaine is charming and tragic in this role and she, too, was nominated for an Oscar (for Best Actress losing to Elizabeth Taylor for Butterfield 8). Rounding out the cast was a pre-MY 3 SONS Fred MacMurray (as the Exec who abuses both Lemmon's and MacLaine's characters). He was terrific as this cad, and thought for sure that he would have been nominated for Best Supporting Actor, but that honor went to Jack Kruschen as Lemmon's neighbor in the apartment building where they both lived. I am fine with that but preferred MacMurray's performance. Also showing up are such great character actors as Ray Walston (MY FAVORITE MARTIAN), David Lewis (GENERAL HOSPITAL), Willard Waterman (THE GREAT GILDERSLEEVE) and David White (Larry Tate in BEWITCHED) as other Execs using The Apartment for their purposes.This is a terrific motion picture and if you haven't seen it (or if you haven't seen it in quite sometime), I highly recommend you check it out (it is shown on the Turner Classic Movie channel on a fairly regular basis). It certainly shows a slice of life during the MAD MEN days that just doesn't exist anymore - and also presents a type of film, and a type of filmmaker, that just doesn't exist today.Letter Grade: A+10 (out of 10) stars and you can take that to the Bank (ofMarquis)"
    },
    {
      "username": "KatMiss",
      "userUrl": "https://www.imdb.com/user/ur1112373",
      "reviewLink": "https://www.imdb.com/review/rw0070303",
      "warningSpoilers": false,
      "date": "24 May 2001",
      "rate": "10",
      "helpful": "49 out of 51 found this helpful.",
      "title": "WILDER'S GREATEST ACCOMPLISHMENT",
      "content": "Billy Wilder's \"The Apartment is his greatest accomplishment. It is his most successful melding of comedy and drama that he never quite pulled off again. I'm glad the Academy had enough good taste to award Wilder The Triple Crown: Best Picture/Director/Screenplay. But they still had enough bad taste to deny Jack Lemmon a Best Actor award, Shirley MacLaine a Best Actress award and Fred MacMurray a nomination and award.The plot this time: C.C. Baxter (Lemmon; in case you're wondering: \"C for Calvin C for Clifford, but most people call me \"Bud\")lends out his apartment to executives for their extramarital trysts in the faint hope of a promotion. Eventually, his boss, Sheldrake (MacMurray, excellent in a rare straight role) finds out and wants the key for his own affairs. Meanwhile, Baxter has a crush on Miss Kubelik (MacLaine, in a strong performance)the elevator operator.For those who accuse me of spoiling the whole movie: rest assured. This only covers the first 20 minutes or so of the 126 minute feature. Wilder has many twists and tricks up his sleeve and I'll leave you to discover what happens. What amazes me about \"The Apartment\" is that unlike most films, this isn't about the plot. It's a study in human nature and the mistakes they make. That is a strong trait of most Wilder films (including \"Kiss Me, Stupid\" and \"The Fortune Cookie\", both hilarious comedies with a hidden meaning)Also the dialogue by Wilder and I.A.L. Diamond isn't just one-liners (although they are funny; especially when spoken by Lemmon and Ray Walston)There is real heartfelt sentiment here and it isn't the syrupy kind that makes my stomach churn (as in films like \"Patch Adams\") Wilder allows enough to make his points and then gets back to comedy.The cinematography is fabulous too. Wilder's film (as most of his 60s films) is in widescreen Black and White (shot by Joseph LaShelle, in Panavision; one of the most unsung and unrecognized cinematographers in history, he was nominated but lost) It has a crisp,clean look and is one of the few widescreen films that actually make the viewer feel confined in a tight space.\"The Apartment\" is a superior example of the \"serious comedy\", films that work as both comedy and drama. Sadly, many of today's filmmakers have lost touch with this genre. I can't help but feel that the freedoms granted today that weren't in the 1950s and 60s haven't been an advance. They've been holding us back. Smart characters have lost way to stupid and oversexed ones. That's a real shame and it's high time we go back to our roots.**** out of 4 stars"
    },
    {
      "username": "gaityr",
      "userUrl": "https://www.imdb.com/user/ur1579047",
      "reviewLink": "https://www.imdb.com/review/rw0070321",
      "warningSpoilers": false,
      "date": "24 March 2002",
      "rate": "10",
      "helpful": "177 out of 191 found this helpful.",
      "title": "That's the way it crumbles...",
      "content": "What a wonderful way to spend an evening--dinner, Christmas and New Year's with CC Baxter (Jack Lemmon) and 'friends', accompanied by much champagne and laughter, and spaghetti and meatballs lovingly prepared by the host himself. There's even a game of gin rummy to get into that Baxter and Fran can't ever seem to finish--here's hoping it never does!THE APARTMENT is one of those truly classic classic movies--for one thing, it has an absolutely top-notch cast, featuring Jack Lemmon (at his wryly humourous best); Shirley MacLaine (a glowing screen presence); Fred MacMurray (smarm personified); and a younger Ray Walston (still wisecracking, still hilarious). They also benefit from a clever, perceptive and timelessly relevant script by Billy Wilder, under his capable direction. Though there are plenty of brilliant one-liners, the best of the dialogue feels true and real, which adds to the feeling that you've known Baxter et al for years. I loved the score to the movie as well, artfully attributed to the Rickshaw Boys and used to great effect.There are so many good moments scattered throughout the film (I can't even begin to enumerate them all here!). A lot of them are little touches that must have been added by the actors themselves (Jack Lemmon humming as he prepares the meatball sauce is just *so* funny!). I love the madness of the Christmas party scene, and when Baxter's doctor-neighbour takes charge of the situation with Fran, slapping her awake and marching her around the living room. I also love it when Baxter first starts playing gin rummy with Fran, and she reveals how she has a talent for falling for the wrong guy all the time. Best of all, Lemmon makes such a believable, sweet pushover that you often want to shake him and hug him at the same time--the things he would do for Fran! It makes his final scene with MacMurray that much more satisfying for the audience.If you see this gem of a movie on a video store shelf, or (even better) playing in the cinema, don't let it pass you by. Join Baxter, Fran, Mr. Sheldrake and everyone else, and have a great time!"
    },
    {
      "username": "BandSAboutMovies",
      "userUrl": "https://www.imdb.com/user/ur69172350",
      "reviewLink": "https://www.imdb.com/review/rw8013352",
      "warningSpoilers": true,
      "date": "28 March 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The Apartment",
      "content": "The Apartment is astounding because it makes me consider how we view actors based on where we arrive in reality. For me, Fred McMurray is the kind Steve Douglas from TV's My Three Sons. For those born before 1960, they probably saw him on that show and wondered how the heel from Double Indemnity and The Caine Mutiny could be trusted around three growing children.In Billy Wilder's The Apartment, he's Jeff Sheldrake, a man who uses everyone he meets, like lonely C. C. \"Bud\" Baxter (Jack Lemmon) for his apartment and Fran Kubelik (Shirley MacLaine) for her body, uncaring when he pushes both of their to the pit of depression and even a suicide attempt by Fran.Bud is willing to let the rest of the world see him as the villain, as every executive - Ray Walston is one of them - uses his home to have dalliances with his secret lovers while he drinks in bars, dreaming of taking home a married woman when all he really wants is the kind of secure love that allows you to sit happily on the couch next to one another and play cards.There's also a genuine sadness at the heart of this movie, as Wilder and co-writer I. A. L. Diamond based the film on reality, as high-powered agent Jennings Lang was shot by producer Walter Wanger for having an affair with Wanger's wife Joan Bennett. Lang had used a low-level employee's apartment for the affair, just like the film. Diamond also contributed something that had happened to a friend, who returned home after breaking up with his girlfriend to discover that she had committed suicide in his bed.Back to McMurray. After this was released, women yelled at him in the street, complaining that he had made a filthy movie. One even hit him with her purse. I guess that was the Twitter of 1960.This may be the best awarded movie we've talked about on this site, as it won Best Picture, Best Director, Best Screenplay, Best Art Direction and Best Film Editing at the 1960 Oscars. Jack Lemmon may not have won Best Actor, but when Kevin Spacey won that award in 1999 for American Beauty, he dedicated his Oscar to him, as Sam Mendes had the cast watch this movie for inspiration.Since then, The Apartment has been remade as a musical (Promises, Promises, which played in 1972 and was revived in 2010) and as two Bollywood movies, Raaste Kaa Patthar and Life in a... Metro.The amazing thing is that 62 years after this movie was made, it reduced me to tears. It pulled me in and made me care about every single character, even the villain, and the closing scene - and that last line! - absolutely devastated me."
    },
    {
      "username": "JohnHowardReid",
      "userUrl": "https://www.imdb.com/user/ur12596887",
      "reviewLink": "https://www.imdb.com/review/rw3765642",
      "warningSpoilers": true,
      "date": "27 July 2017",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Deserved all its awards!",
      "content": "In many ways, the best of Wilder's comedies and of Lemmon's performances, and by any standards one of the best films of its period. Scene after scene is worked out in terms that are both moving and funny, as when Lemmon tries to cheer MacLaine with such housekeeping tricks as straining the spaghetti with a tennis racket (\"You should see me serve the meat balls!\") or the ending with the build-up of the run along the street turned into a laugh by the shot of Lemmon standing with the champagne pouring over his hand.The film has a remarkably bitter strain even for Wilder, with lift- girl MacLaine saying, \"Just 'cos I wear a uniform doesn't mean I'm a girl scout!\" and the office heads selling out the hero only to be outclassed by four-star swine MacMurray as the boss who is prepared to use his power as dispenser of keys to the executive washroom to reward the underling. Each of the characters is beautifully caught by an excellent cast. \"The Apartment\" relates to Wilder's other movies in its realistic settings (Double Indemnity, Lost Weekend, Kiss Me Stupid) and in such marvelous gags like the Santa Claus who rushes into the bar explaining that his sled is double-parked, or the landlady who accuses Lemmon of being a beatnik because he uses paper towels.The portraits Wilder has drawn from his players are among the best of their careers. As the heavy, MacMurray is an absolute stand- out.AVAILABLE on an excellent M-G-M DVD."
    },
    {
      "username": "ComedyFan2010",
      "userUrl": "https://www.imdb.com/user/ur23138767",
      "reviewLink": "https://www.imdb.com/review/rw3076594",
      "warningSpoilers": false,
      "date": "27 August 2014",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A classic romantic comedy with depth and drama",
      "content": "The movie is already half a century old but it has kept its charm which makes it worthy of being considered a classic.This is one of the early romantic comedies. But besides fun moments there is also a lot of drama and a pretty original idea for the story. No wonder it won so many Oscars in 1960! On the first glance it may seem like the ah so boring good guy vs bad boy story and the female that finally gets a clue, but it is more than that. We have Baxter who lends his apartment for influential coworkers to climb the corporate ladder and we have Fran, the elevator girl, who has an affair with the boss while he promises to get a divorce. There is a parallel in their stories as they both agree to be mistreated by people with more power hoping for a better life and not seeing yet that even when they get it, it won't be as happy.A smart story is brought to us by a great cast. Jack Lemmon and Shirley MacLaine are easy to identify with and they show some great acting skills with a lot of face expressions and gestures that perfectly show us the feelings of the character. I especially like Shirley MacLaine, she has some spark in her and so much freshness that take over the screen. She wasn't a big star yet when she made the movie but then she deservingly became one. Supporting cast was great as well. Jack Kruschen as Dr. Dreyfuss was great.A good movie with a good story, great cats and well presented atmosphere of its times."
    },
    {
      "username": "markdroulston",
      "userUrl": "https://www.imdb.com/user/ur26580940",
      "reviewLink": "https://www.imdb.com/review/rw2443822",
      "warningSpoilers": false,
      "date": "15 June 2011",
      "rate": "9",
      "helpful": "33 out of 35 found this helpful.",
      "title": "They don't make 'em like this anymore",
      "content": "Billy Wilder's The Apartment was one of a huge list of movies that are considered classics which I haven't seen, and indeed knew very little about (other than the level of admiration which many people have for it). Having a vague knowledge of the stars of the film (Jack Lemmon, Shirley MacLaine), for one reason or another I was expecting a light-hearted comedy filled with innuendo and witty banter, a tradition of filmmaking that was common around the period when this film was released. Thankfully I wasn't disappointed, as these elements are all in play in The Apartment, but what really thrilled and surprised me was the much more serious subject matter that the film deals with. To say this is simply a comedy is completely false, as it's a somewhat dark and daring study of the nature of love and infidelity, and the stunning performances and filmmaking on display had me enthralled from the first frame.The film certainly begins as a comedy. C.C. Baxter (Lemmon) is a young bachelor trying to ascend the corporate ladder by allowing a group of his superiors to use his apartment for their extra-marital liaisons. After he falls for charismatic elevator attendant Fran (MacLaine), who is engaged in an illicit relationship with Mr. Sheldrake, the married head of the company, Baxter tries to free himself from the demands of his bosses, with hilarious results. While this is certainly risqué subject matter (for 1960), the film takes an unexpectedly sombre turn when Fran makes a suicide attempt in the apartment after learning the truth behind Sheldrake's motives. What follows is a touching, and at times heart-wrenching flowering of Baxter and Fran's relationship, and if the ending is a little predictable, the journey getting there is really something wonderful.The Apartment features an excellent selection of fully-formed support characters, but the film really belongs to Lemmon and MacLaine. Lemmon's reputation as cinema's greatest everyman is really on show here, and it's impossible not to root for him and sympathise with his plight. Playing Baxter as a charming yet awkward underdog, his character is the embodiment of the 'nice guys finish last' maxim, and although some elements of his life may be a little shady to say the least, Lemmon is flawless. MacLaine is completely up to Lemmon's high standard as Fran, effortlessly making audiences fall in love with her just as Baxter has. She's just so damn cute that even when she's recovering from an overdose of sleeping pills, she exudes such a potent 'girl next door' allure that can't be avoided. Her chemistry with Lemmon is palpable, and when they inevitably end up together, it's one of those truly satisfying romantic moments seen all too rarely in modern cinema.I'm not usually one to get nostalgic when it comes to film periods, but while I do have great fondness for many more recent romantic comedies, Hollywood really doesn't make movies like The Apartment any more. Wilder's screenplay (co-written with I.A.L. Diamond) is clever, witty and engaging, particularly in the subtle motifs and unique idiosyncrasies of all the characters, and the film is just so expertly crafted. I'm determined now to seek out more Wilder films, along with catching up on my Jack Lemmon and Shirley MacLaine. I can't recommend The Apartment highly enough!"
    },
    {
      "username": "jdoan-4",
      "userUrl": "https://www.imdb.com/user/ur7338453",
      "reviewLink": "https://www.imdb.com/review/rw1356604",
      "warningSpoilers": false,
      "date": "1 May 2006",
      "rate": "9",
      "helpful": "20 out of 21 found this helpful.",
      "title": "A precise satire",
      "content": "Billy Wilder has made some tremendous satires. \"Sunset Boulevard\" is one of the greatest satires on film. \"The Apartment\", though not as cynical, is a very good one as well. I like that the satire is a backdrop for the main love story, and yet an integral part of it. The film shows just how much people are will to prostitute themselves in order to get what they want, whether that be a family or an executive office. Wilder handles some very serious and bawdy themes with a precise touch. This film could have easily turned into a wacky comedy of errors, but he is much to talented and sympathetic for that. He gives Baxter's character some sincere emotional depth. I could almost feel his loneliness and longing in many scenes. He is never really sure what he wants and how he can get it. He is a man searching for something, and he doesn't quite know it. Lemon plays this role to perfection. He doesn't go overboard. He gives the character the right amount of silliness and charm. McClaine is very strong. Her character is not stereotyped. She is a wounded soul that is looking for respite in the absolutely wrong place. I found her very charming and lovable. Some much of the film is in the wonderful cinematography. Wilder uses the widescreen to its fullest capability. The framing is so precise. You get a feeling of utter separation and distance. I really like the nearly infinite succession of desks in the office."
    },
    {
      "username": "I_Ailurophile",
      "userUrl": "https://www.imdb.com/user/ur1964495",
      "reviewLink": "https://www.imdb.com/review/rw8667285",
      "warningSpoilers": false,
      "date": "10 November 2022",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A superb classic, smarter and sharper than it first looks and more so than most possible comparisons",
      "content": "This is definitely not the movie I was expecting when I first sat to watch. My first impression wasn't the strongest, and I was prepared to say this doesn't strike quite the same chord with me as it has with so many other viewers. Even at that, I'd have said that for the space it plays in, it does so better than almost any other point of comparison. Heading into the second hour, however, the film takes a turn, both in terms of content and quality. Ostensibly a romantic comedy-drama, the meaningful romantic element is very gradual, and rather oblique; the flourishes of comedy are decidedly adult, but smarter than any humor in most any similar title to have followed in subsequent years; the drama is extra cold, and unexpectedly dark. In fact, 'The apartment' increasingly becomes downright grim as protagonist Baxter reaps the consequences of the boorish seeds he has sown in the very deep hole he has dug for himself. I suppose this shouldn't come as too much of a surprise coming from the filmmaker who gave us 'Sunset Boulevard' and 'Ace in the hole,' yet by Jove, this is terrific, and more of a wild ride than some abject thrillers or action flicks could claim.There's real, believable, piercing depth and complexity to the characters Billy Wilder penned with co-writer I. A. L. Diamond, and the dialogue itself is a trip. The scene writing grows ever more absorbing as the plot advances and events spiral out of control - and while the narrative itself takes its time to build into its core value, the wait is absolutely worth it. Achieving an off-kilter sort of balance between its constituent elements, the screenplay is unquestionably one of the chief highlights of the picture, and it's no wonder why it nabbed accolades upon release. A close second is undoubtedly the acting, for while the cast at large is great, Jack Lemmon and Shirley MacLaine are especially marvelous. Even if one is only familiar with them in passing otherwise, I don't think there's much arguing that 'The apartment' represents one of the best performances either have ever given - a fabulous illustration of their skill set as actors, with commendable physicality and nuance merely being the most readily notable facets thereof. Between the writing and the acting one has all the reason one needs for this to earn a solid, blanket recommendation.And that's all to say nothing of the excellence elsewhere in the feature. The production design and art direction are altogether brilliant, and the costume design and hair and makeup work are lovely. I very much appreciate Joseph LaShelle's cinematography - and I should think it goes without saying that Wilder's direction is frankly unimpeachable. To date I haven't had the opportunity to explore all his movies, but even based just on those I have seen there's no disputing that Wilder was a master filmmaker, sharp of mind and keen of vision. By all means this is another fine demonstration of why he very much deserved his reputation. And so it is in every regard: even at its weakest moments, instilling doubt in the whole before the turn comes, the movie can claim a thrumming vividness and polish that shows the care and intelligence of everyone who worked on it. Even before I could say I was won over, there was never any misgivings about the quality of craftsmanship on hand. So lump this together with the high caliber of storytelling and acting that ultimately shine through, and what we have on our hands is nothing less than a classic. Sure, personal preferences may vary, but when all is said and done this is so very good that I've a hard time imagining there'd be many people to whom it wouldn't appeal. Even if it doesn't immediately come off as something one would like, at length 'The apartment' is a superb, vibrant film, and a real joy as a viewer. This is well worth taking your time to watch, however you must go about it."
    },
    {
      "username": "MissSimonetta",
      "userUrl": "https://www.imdb.com/user/ur28071275",
      "reviewLink": "https://www.imdb.com/review/rw5945838",
      "warningSpoilers": false,
      "date": "27 July 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Maybe the most serious comedy of all time",
      "content": "THE APARTMENT is technically a comedy, but the material is so bleak and dark, that sometimes it's hard to laugh at the human misery on display. That's not to say there is nothing funny-- Jack Lemmon's drunken dancing at a bar on Christmas Eve had me chuckling, as did his attempt to watch TV while consuming a not-so-appealing TV dinner-- but by and large, this is as cynical as satire gets in so many ways. Lemmon and Maclaine's characters essentially prostitute themselves (figuratively and literally) in the hopes of getting ahead or fighting off loneliness, only to be kicked down again and again by life and other people.And in spite of the cold-hearted corporate politics, sexual sleaze, suicidal despair, and delusions of many of the characters, THE APARTMENT is kept from total hopelessness only due to the subtle, understated love story between Lemmon and Maclaine. Those scenes are played in such a natural manner, lacking the usual Hollywood histrionics or passion, making their bond seem all the more vulnerable in such a cutthroat environment.I wholeheartedly recommend this one."
    },
    {
      "username": "marcelbenoitdeux",
      "userUrl": "https://www.imdb.com/user/ur151373166",
      "reviewLink": "https://www.imdb.com/review/rw8683955",
      "warningSpoilers": false,
      "date": "19 November 2022",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Sweet and Sour, Wilder Style",
      "content": "Certain films travel in time, undisturbed. Always relevant. \"The Apartment\" is such a film. Jack Lemmon at the top of his form and the luminous Shirley MacLaine at the center of this bitter romantic comedy. The cynics with the keys and the ambition are also the corruptors of the little man. The ones dangling the golden carrot. Billy Wilder finds a way out, where love, if not triumphs, survives. Fred MacMurray is a surprisingly believable corruptor, living a socially acceptable life, at least on the surface. The laughs are well earned but with that Wilderian aftertaste that makes \"The Apartment\" a unique piece of film art."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1503522",
      "warningSpoilers": false,
      "date": "22 October 2006",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "One of the Most Delightful Movies of Hollywood",
      "content": "On 01 November 1959, in New York, C.C. \"Bud\" Baxter (Jack Lemon) is a popular clerk of \"Consolidate Life\", an insurance company with 31,259 employees. The secret of his success is a well located apartment where he lives that he sublets for his superiors, making him climb to the executive position of 2nd Administrative Assistant very early. He likes the elevator girl Fran Kubelik (Shirley MacLaine), a reserved woman considered a \"jackpot\" among the executives. Fran is the secret lover of the director Jeff D. Sheldrake (Fred MacMurray), a married man that seduced her convincing that he will divorce his wife to stay with her. When Fran tries to commit suicide in Baxter's apartment after a meeting with Jeff, she stays with Baxter while recovering, and he falls in love for her. Later he has to come up to a decision between his excellent position in the company and his love.\"The Apartment\" is one of the most delightful movies of Hollywood ever and fairly ranked # 95 in IMDb. In my opinion, Billy Wilder is the best director Hollywood has ever had, and this dramatic comedy is one of his many masterpieces. The screenplay is simply perfect, developing very well each character with great lines. Shirley MacLaine is very sweet and it is impossible not falling in love for her character, who has the talent of falling in love for the wrong guy, in the wrong place and at the wrong time. Jack Lemon has another amazing performance in the role of a man that sells his soul to climb positions in his company, and redeems himself with pure love. Fred MacMurray is also excellent in the role of a seductive scum. The soundtrack presents a wonderful very well known musical theme. The list of awards, with five Oscars, another seventeen wins and eight nominations is enough to show how perfect this movie is. My vote is ten.Title (Brazil): \"Se Meu Apartamento Falasse\" (\"If My Apartment Speaks\")Note: On 06 June 2009, I watched this movie again."
    },
    {
      "username": "Primtime",
      "userUrl": "https://www.imdb.com/user/ur0099933",
      "reviewLink": "https://www.imdb.com/review/rw0070273",
      "warningSpoilers": false,
      "date": "14 August 1999",
      "rate": "8",
      "helpful": "71 out of 88 found this helpful.",
      "title": "Another Wilder classic",
      "content": "Jack Lemmon is the man.The Apartment really surprised me. The Best Picture winner starts off right in the middle of the action, but yet the first hour seems long and overrun. Too much time seems spent in trying to develop the characters (and oh so many of them) and not enough time is spent on just seeing what will happen. Just when I was about to lose faith, the film picks it up like I have never seen before. The whole sub-plot of the four guys wanting to use Lemmon's apartment for their evening tyrsts is dropped and Wilder smartly concentrates on Lemmon, MacLaine and MacMurray and the film creates true magic.The Apartment is more of a drama than a comedy and balances the two elements perfectly. Just after one of the more dramatic moments of the film, we see Lemmon straining his pasta with a tennis racquet. The use of the doctor and his wife in supporting roles are completely there for comedy and yet add so much to the film. The ending also rates up there with the best of all time using an old device that doesn't seem at all cliched in this film. Some say that \"Some like it hot\" was Wilder's best, but now I have to disagree. The Apartment is better and surely would have made my top ten had the first hour not been so predictable.How Jack Lemmon didn't win Best Actor is beyond me. His is a great performance, getting to act on more than one scale. MacMurray, another Wilder favourite is perfectly cast in the role of a family-wrecker. I wish they would have put a scene in which his wife confronts him with \"The News\". MacLaine glows on the screen even when she is sick and in bed.I fully recommend this film to all, it being Wilder's best makes it a must see.8/10 stars."
    },
    {
      "username": "cwelty1",
      "userUrl": "https://www.imdb.com/user/ur2158588",
      "reviewLink": "https://www.imdb.com/review/rw0946971",
      "warningSpoilers": false,
      "date": "15 October 2004",
      "rate": "10",
      "helpful": "168 out of 181 found this helpful.",
      "title": "A rare gem, this is a blessedly adult comedy with great performances, great writing and the kind of depth hardly ever seen in the more vapid, formulaic romantic comedies of today.",
      "content": "Written by the great filmmaker Billy Wilder, this is a serious, sardonic comedy for people who've known what's its like to feel the pressure of compromising your principles or your self- respect for the sake of getting ahead in life. And there are very few over the age of consent who haven't had to at one time or another. This isn't the laugh out loud comedy of Jim Carrey or the Farrelly brothers, but a subtle, nuanced comedy about two people who have both been jaded in love and yet continue to hope again and again that it will someday work out for them -- mainly because despite the unlikeable things they do, they are both basically decent, nice people. Flawed and even weak at times, but good people. This is a movie that doesn't just make it you laugh, it makes you think. A rare find indeed."
    },
    {
      "username": "MotoMike",
      "userUrl": "https://www.imdb.com/user/ur0355290",
      "reviewLink": "https://www.imdb.com/review/rw0070312",
      "warningSpoilers": true,
      "date": "4 October 2001",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "A masterpiece",
      "content": "***SPOILERS*** ***SPOILERS*** Anyone that knows about comedy knows about \"Some Like It Hot\", and anyone that know about \"Some Like It Hot\" knows about Billy Wilder. This was his next film, and the reason I mention that is that this is a serious and melancholy drama with the form and rhythm of comedy. But it's not a funny movie, and part of the genius of the writing and direction is that Lemmon's character especially only figures this out in the third act.Jack Lemmon plays C.C. Baxter, an unmarried drone amongst drones in a huge insurance company, possessing of two important things: a bachelor's apartment near Central Park (check out his rent!!), and an amoral willingness to allow company higher-ups to use his place for after-hours trysts with their girlfriends and pickups they meet in bars. To C.C., the problems associated with operating a safe-house for affairs are merely logistical, not moral; in one scene, he is seen rearranging his and everyone's schedule to accomodate Jeff Sheldrake (Fred MacMurray) a real bigwig, with the expertise and interest of an air traffic controller.His hope is to promote himself within the company by pleasing his superiors, and for awhile that seems to be working. It turns out, however, that Sheldrake's current flame is Fran Kubelik (Shirley MacLaine), who C.C. has quite the crush on; in fact, she stands him up on their first date to meet Sheldrake at their favorite Chinese restaurant, where Sheldrake asks her to resume their affair, intimating that he will leave his wife for her (a lie that no-one except her even pretends to believe).Without going into too many details, the joy of and intelligence this is how well this triangle works itself out slowly and with some pain by all concerned. Although C.C. really likes Fran, she won't give him the time of day, first because she's already bruised and involved with Sheldrake, and, later, because she sees his flaws better than he does (and, possibly, we do). At one point they agree that it's too bad that she doesn't fall for a guy like him, but the exchange is given additional bittersweetness not only by her inability to fall for a \"nice guy\" but her awareness that, as he is at that point, he's not really such a nice guy. One of the beauties of this script is that it takes awhile for us to notice that C.C. is just as bad as Sheldrake is; he's totally okay with the infidelities he is assisting in as long as he gets his promotion out of it, and it isn't his business whether anyone (wives or girlfriends) gets hurt in the process. Even the resounding disapproval from his next door neighbors (who just think he's a very busy playboy from what they can hear night after night coming through the walls) doesn't get him to think. Yet Lemmon plays the role with total innocence; he thinks he's in a comedy and it takes a real life-threatening problem halfway through to get him to start considering the error of his ways. Even then, he's still just trying to work the situation, without taking any stand himself. (There are only about two actors I know of that could pull this role off: Jack Lemmon and Tom Hanks, both of whom have such audience appeal that they can be this spineless without the audience despising them.) Interestingly, for all her personality, intelligence and self-awareness, Fran isn't much better; she's no stranger to the hazards of having affairs with married men, yet has little qualms about resuming her affair with Sheldrake. Both C.C. and Fran really are willing to sacrifice their integrity for something they hope to get from Sheldrake - him, the high-floor, corner window office, her, the gold wedding ring.I've stressed that this is a drama in comedy form to emphasize that this screen play is one of the most intelligently written I have ever seen; it takes a non-story (or at least, obviously bedroom-farcical material) and inhabits it with character interaction and development of the most subtle and human kind. You expect lots of bedroom-closet-under-the couch people shuffling (like in The Pink Panther of three years later) and general hilarity, perhaps ending up with someone partially disrobed and dangling from a window; instead you find out that each of these characters has a little history of his own. I rented this the other night, thinking that it would indeed be a comedy, and about halfway through found myself thinking \"This is REALLY good!\". I've been renting lots of pre-1975 movies (The Sting, Spartacus, this one) in an unprecedented attack of escapist nostalgia, and have been rewarded with jewels like this. Winner of 5 Oscars including Best Picture, this is one of the best pictures I've seen this or any year. It's a cliche to say that Hollywood doesn't make movies like this anymore, yet the nearest thing to this is My Best Friend's Wedding?(A couple of notes I really liked: Ray Walston's character is perfectly cast and played, as usual; the whole picture is a cynical Valentine to New York and the 50's at the same time; and anyone who saw this at the time could see that Shirley MacLaine was gonna be a big star)."
    },
    {
      "username": "Ford-kp",
      "userUrl": "https://www.imdb.com/user/ur3149151",
      "reviewLink": "https://www.imdb.com/review/rw1340614",
      "warningSpoilers": false,
      "date": "13 April 2006",
      "rate": "",
      "helpful": "52 out of 56 found this helpful.",
      "title": "I work on the 19th floor. Ordinary Policy Department, Premium Accounting Division, Section W, desk number 861",
      "content": "In the beginning of The Apartment we see C. C. Baxter (Jack Lemmon) being lost in a sea of desks within a gigantic office room. He works for a huge New York insurance company employing over thirty thousand souls spread over twenty-seven floors. Sometimes he is working overtime; \"It's not like I was overly ambitious...\" Baxter tells us defensively. \"You see, I have this little problem with my apartment I can't always get in when I want to.\" The reason are several superiors, to whom he is lending his apartment for their extra-marital escapades. In exchange they promise to give his career a push by passing recommendations to the personnel manager, Mr. Sheldrake (Fred MacMurray). Although Buddy Boy (that's his disrespectful yet firmly established nickname) is daily surrounded by hundreds of people, he is drowning in lonesomeness. Apart from his mocking colleagues, there does not seem to be any family or close friends. In fact, the only decent person among his acquaintances is his neighbour, Dr. Dreyfuss (Jack Kruschen), ironically under the wrong impression that the man next door is a womanizing drunkard. So Baxter meekly adapts to the mercilessness of corporate life, putting all hopes of happiness into his career. His free evenings consist of watching TV, preparing dinner or cleaning up after the occupants of his apartment. Yes, one could say that Baxter does not exactly lead a joyful life. Yet, there is something, or rather somebody carrying light into the loner's gloominess when he falls in love with the pretty elevator girl Fran Kubelik (Shirley MacLaine). Although Fran likes him for his decency and kindness, she does not quite share the feelings of her ardent admirer. But Buddy Boy refuses to notice any signs of unrequited love and eventually talks her into going out with him. You can imagine how Baxter feels when she fails to turn up, and how things get significantly worse when he finds out that she is actually having intimate meetings with the personnel manager Mr. Sheldrake in HIS apartment. The image of purity Baxter had of Fran is gone. On Christmas Eve, he decides to drown his broken heart in a bar while his apartment is occupied by the cause of his misery. But Fran doesn't feel any happier than Baxter, and with the depressing effect Christmas can have on the lonesome and desperate, the story threatens to take a turn into tragedy... It is hard to pin The Apartment on a single genre. The sharp, witty dialogue as well as Jack Lemmon's hilarious mimic would hint at a romantic comedy. Yet, one cannot overlook the tragic elements which let us dive into thoughtfulness, but never too deeply. Then again the film works on a satiric level, operating as cynical social commentary on corporate culture in the sixties (which is not very unlike today's business life). The remarkable thing about this film is that these three qualities merge perfectly into each other without ever losing the balance. The Apartment is a most entertaining picture, sometimes rushing from one hilarity to the next, and then suddenly slowing down to leave room for contemplation. Sometimes uplifting, sometimes depressing, sometimes both at the same time. Billy Wilder mixed these contrary moods, and most amazingly, it worked out just fine. First and foremost The Apartment deals with loneliness and the everlasting search for unaccomplished love. \"I used to live like Robinson Crusoe. I mean shipwrecked among 8 million people. And then one day I saw a footprint in the sand and there you were.\" Baxter tells Ms Kubelik. Does any relationship ever work out the way one dreamed it would? Additionally the film points out how people let themselves be treated badly out of total lack of self-esteem. Standing up for oneself and saying the simple word \"no\" can sometimes be an art of its own. As an able filmmaker and scriptwriter (together with I. A. L. Diamond, \"Some like it Hot\"), Billy Wilder once again produced a film classic of outstanding quality. I have yet to see another picture, equally consistent at providing such humorous and well-timed dialogues. The amount of memorable quotes is remarkable and the entire cast did a terrific job at delivering them. Moreover, Wilder chose to shoot in black and white widescreen, shining with beautiful cinematography, and thereby gave the film a very special melancholy mood. Maybe the greatest strength of The Apartment is its honesty. It doesn't lie to us by painting images of perfect love or of perfect people. Neither does it create scenarios of utter hopelessness. However, it shows us that although life can be unfair on default, everyone is responsible for oneself to work up the courage to achieve happiness. With the director's cynical, yet comic approach to life, the film takes itself serious and it doesn't. It lets us taste the bitter and the sweet, thereby lending itself a tone of reality. For that reason alone I don't feel cheated by The Apartment and its story never failed to cheer me up. Then again, I may be too much of a pessimistic optimist."
    },
    {
      "username": "Det_McNulty",
      "userUrl": "https://www.imdb.com/user/ur4602745",
      "reviewLink": "https://www.imdb.com/review/rw1507574",
      "warningSpoilers": false,
      "date": "27 October 2006",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "One Of the Finest Scripts Ever Written, and Jack Lemmon Creates One Of The Greatest Character Performances As The Wonderful C.C. Baxter",
      "content": "For me Billy Wilder has always been one of my all time favourite directors and he has not made a single film that has not appealed to me. Billy Wilder sums up perfection all his films manage to succeed in what they set out to do. Billy Wilder is not just one of the greatest directors; he is also one of the finest scriptwriters ever. Creating flowing dialogue like no other and perfectly making his actors and actresses work with the script brilliantly. Billy Wilder has made dark noirs, hilarious musicals and studies of human nature. It is extremely difficult to fully describe a director as versatile and genius as Billy Wilder. His films have held up for generations and will continue to have the same mass appeal that his films have had since their opening days.On the surface The Apartment might seem like a comedy and yes that's what it is on the surface. Once you start watching The Apartment you realise that actually it is a very dark film underneath and actually has characters that contemplate suicide. The fact is that The Apartment captures the realism of the everyday workman and makes you laugh as well as feel pity. The script is what keeps the film moving and shows how the characters in The Apartment change as the film progresses. The Apartment is about becoming somebody rather than being something that someone uses.Jack Lemmon creates C.C. Baxter the young aspiring workman who just wants to have a good career and the perfect woman. Though something always goes wrong and he's perfectly able to get a woman, but not the one he wants. At times you pity C.C. Baxter because he's so kind to everyone and never gets the thing he wants in return because something will always get in the way. I think there are times in every man's life where you probably feel like C.C. Baxter in one way or another.Jack Lemmon perfectly progresses with his character to make himself one of the most distinguishable character actors ever. Jack Lemmon works with an elegant skill at comedic performances and always captures the true essence of his characters. He seems to be one of those actors who are able to find the perfect chemistry with his fellow cast. What makes C.C. Baxter so brilliant is the fact he stands for everything the film is about. He becomes one of the mot uplifting and joyous ever put on screen. Shirley MacLaine is also excellent as the lovable Fran Kubelik (C.C. Baxter's heartthrob). From first impressions you'd think she is a beautiful and happy women, but she's actually very different to what you might expect.The script is fast paced, memorable and most of all it helps sum up all the characters so well. It's a script that works so easily with its actors and helps to make some of the most superb character situations. The script is realistic as well and actually does feel like the kind of talk that would be used in similar situations in life. The script is extremely natural and the subtle undertones prove Billy Wilder's crafting of intellectual film-making.The film is actually very similar to that of its A Wonderful Life and you could say Jack Lemmon is very similar to that of James Stewart. The direction is simple and fulfilling. It captures the image of \"the apartment\" perfectly and though just like any other New York apartment it feels extremely likable and memorable. The film's use of music is another high point and feels perfectly hand picked for the scenes it's used in. The film is actually quite sexually vibrant and does have many sexual undertones in its dialogue. Though subtle, it definitely is there and perfectly helps add more subtext to the film as a whole. A film to be studied in depth and not just watched.A film that never gets old and always manages to make the viewer feel uplifted with happiness. A first class example of perfected film-making you're ever going to see. Yes it's a definitive must-see, a masterpiece that was way ahead of its time and much more than just a movie."
    },
    {
      "username": "film-critic",
      "userUrl": "https://www.imdb.com/user/ur1601212",
      "reviewLink": "https://www.imdb.com/review/rw1177402",
      "warningSpoilers": false,
      "date": "21 September 2005",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "...and then one day I saw a footprint in the sand and there you were.",
      "content": "I would first like to make the comment that this is no comedy. For those that consider this film a valuable part of Hollywood cinema due to the comedic aspects need to get their eyes examined along with their minds. I do not think that I laughed at all during this film, but I would like to mention that I do not think that is a bad thing. Not laughing at this film means that it hit you at a different level. I witnessed a beautiful film with some highly intelligent actors painting a dark and disturbing picture of a sexual world circa 1960. I suppose I was thinking that this was going to be a \"screwball\" comedy, which completely threw me off balance when the events of this film occurred. Never have I witnessed such a bold attack on the sexual revolution of the 60s and its effect on the business world. It was a slap in the face to see the way that Billy Wilder represented corporate America and honestly, it felt really good. To see this lonely man turned away from his apartment at all hours of the night because his boss needed a place to take their mistresses was sad, not funny, yet in The Apartment it worked beautifully.To begin, this film revolved around the actors. If you would not have had such strong actors like Jack Lemmon, Shirley MacLaine, and Fred MacMurray honestly conquering their roles than this film would not have succeeded as it did. It won Oscars for a reason, and even watched by today's standard of Hollywood I think that everyone involved should be very proud. Their work was the best Hollywood had to offer. Lemmon successfully portrayed this hurt every-man that you could easily find yourself engulfed within. MacLaine, beautiful in her young age, was an emotional powerhouse. Her eyes could have told the story without any words. You could feel her emotions through her eyes, and it was outstanding. I must say that my favorite actor in this entire film was Fred MacMurray. His portrayal of the typical \"boss\" who seems to use his powers to control instead of help, was perfect. In fact, even if you watch the film today, you may still be able to see your boss in MacMurray's portrayal. For once, it was a solid cast. It had a structured story that was heightened by sublime actors that knew exactly what they needed to do. I would have to say that this is one of the greatest pairings in cinema history, these three together could have taken Hollywood by storm, and it is evident in The Apartment.As I stated before, the characters are exceptional, but coupled with their performances is a rich story that seems developed well before its time. I was not expecting to see such a sexual driven film released from the 60s. Films of this nature typically hint towards sex, but never quite spell it out, but in The Apartment it is in your face throughout the course of the film. From the opening sequence until the end, sex seems to be the biggest underlying theme of this film. In the world of C.C. Baxter, all he seems to know is sex, business, and the occasional conversation with the elevator girl. You can't help but wonder if that wasn't what was going through the minds of our fathers as they headed to the corporate world on a daily basis. It was such a slap to the face of the day to day America. To think that in this nation portrayed with family values and moral uprising that The Apartment would emerge as the breakout film of 1960. It shocked me. I think the reason that it did so was because of the strong writing, the powerful story, and the emergence of such innocent \"characters\" (as mentioned above). There were moments during this film that I honestly wanted to walk into the television, tell everyone to stop, and explain what was happening because I didn't want anyone to get hurt in the end. Isn't that a sign of a long-lasting powerful film? To me it is.Overall, I must say that The Apartment left my jaw on the floor. While my wife will disagree with me, I thought that it was a brilliant moment in cinematic history. Jack Lemmon could not have been handed a greater roll, nor could he have pulled it off with such beauty and pizazz. The story will shock and amaze you for nearly two hours. We are taken into a world in which we feel comfortable in, we feel as if we have been there before, and we can only thank the imaginative mind of Billy Wilder for that. He takes those moments in our lives that we wholeheartedly want to forget and places them in the window for all to see. His mockery of corporations, of the small man working his way to the top, and the disasters that follow are nothing short of classic. I have never witnessed a film quite like this and I hope I never do again. The Apartment was a once in a lifetime enjoyment, and I cannot wait to revisit it soon to see what I may have missed! Grade: ***** out of *****"
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3283558",
      "warningSpoilers": false,
      "date": "24 July 2015",
      "rate": "8",
      "helpful": "15 out of 22 found this helpful.",
      "title": "It's lost a step over time, but still satisfies even if it does not surprise",
      "content": "This film was groundbreaking in the sense that it dealt with sexual harassment in the workplace in a way that was quite realistic for 1960. All the women are in menial jobs at the insurance company where Jack Lemmon's character works, and all of the executives are men. The executives look at their female workforce as one big harem and won't let a little thing like the fact that they are married and intend to stay that way interfere with their stepping out from time to time. This is where C.C. Baxter (Jack Lemmon) comes in. He trades the use of his apartment to these executives in return for promotions and perks. However, Baxter has an attack of conscience when he comes face-to-face with the collateral damage that one of these executives is doing in the person of Fran Kubelik (Shirley MacLaine). Fran, the elevator operator, has just found out she is one of many affairs for big boss Mr. Sheldrake (Fred McMurray), whom she genuinely loves, and when she and Sheldrake quarrel in Baxter's apartment and Sheldrake leaves her some money for her troubles, unintentionally making her feel even cheaper than she already feels she swallows a bottle of sleeping pills hoping not to wake up, slipping into a coma on Baxter's bed.Things I noticed - this film has lost something with the passage of time in the shock value that was, I think, part of the original appeal. But it still has some outstanding acting, some personal redemption and transformation that people just love to see on film, and kudos to Mr. McMurray for portraying an authentic heel, leading women on and leading a double life without a tinge of conscience, phoning to inquire about his mistress' health on Christmas Day as he is busy playing with his children at home. Without this entry under his belt I would have always doubted his range as he was the perennial nice guy in almost every other role he ever had.Did you also notice a business world and a New York that is gone forever? Nobody adds numbers by hand - or by computer for that matter - any more, elevators have long been run by machines, and the entire floor of people that Baxter worked on would today be replaced by computers. Also notice that Baxter has a very middling job - at least at first - and yet lives comfortably sans roommate to share expenses in an apartment IN Manhattan. Those were the days."
    },
    {
      "username": "RanchoTuVu",
      "userUrl": "https://www.imdb.com/user/ur2467778",
      "reviewLink": "https://www.imdb.com/review/rw0070362",
      "warningSpoilers": false,
      "date": "7 September 2004",
      "rate": "9",
      "helpful": "47 out of 68 found this helpful.",
      "title": "corporate sex ladder",
      "content": "A struggling office worker in a giant insurance company lends his apartment to higher ups in order to get a promotion. Set during the Holidays, the theme of infidelity turned a lot of viewers off. The Holiday setting however is what provides a lot of the film's best scenes, as in the fantastic office Christmas party where the secretaries are doing a CanCan on the table and couples are making out in the corner. The one-two punch of Jack Lemmon's classic performance and that of Fred MacMurray is fabulous, and the triangle of sorts that forms with Shirley McClaine makes this much more than the comedy that it is known for."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw1072657",
      "warningSpoilers": false,
      "date": "3 May 2005",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Awesome classic!",
      "content": "I wasn't a huge fan of Billy Wilder's \"Some Like it Hot\" when I first saw it some years ago, but \"The Apartment\" didn't let me down at all. Jack Lemmon is superb as C.C. Baxter, the meek corporate worker who loans his apartment out to co-workers so they can spend alone time with their mistresses. In exchange for his services, Baxter is rewarded with high praise and before he knows it he is climbing the corporate ladder to success.The movie also stars Shirley MacLaine as the young woman Baxter falls in love with, and Fred MacMurray as his boss -- and the man who also has his sex-hungry eyes on MacLaine.In fact in one of cinema's greatest cases of irony, Baxter accepts tickets to a play from MacMurray in exchange for a night in his hotel room. Baxter invites his crush to go with him -- little does he know that she's the girl going to his own apartment that very night with MacMurray's character! \"The Apartment\" must have been very risqué and controversial when it was first released in 1960. This was an era of squeaky-clean, bright and colorful romantic comedies and this put a harsh twist on everything. The implications of sex are none-too-subtle and one of Baxter's neighbors tells him to keep the noise down at night -- followed by innuendo that nowadays would almost garner a film a PG-13 rating! Lemmon is really great in his role and displays perfect comic timing and Woody Allen-like nervous twitches and neurosis. Teamed with Billy Wilder it really is a great combination and the film itself is engaging and thoroughly entertaining.\"The Apartment\" -- along with other 1960s films such as \"The Hustler\" and \"Midnight Cowboy\" -- helped pave the way for future films, but its revolutionary status does not outweigh its lasting impact as a quality feature. This movie holds up on its own. Some films gain reputations due to their effect and for nostalgic purposes on behalf of critics and audiences; \"The Apartment\" really is a great movie and still is."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3081651",
      "warningSpoilers": false,
      "date": "6 September 2014",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Dark rom-com with a great pairing",
      "content": "C.C. Baxter (Jack Lemmon) is a meek hard working drone at the insurance company Consolidated Life. His bosses have taken to using his apartment as a love nest for their mistresses. They take advantage of him dangling good recommendations. He gets called into head of personnel Jeff Sheldrake (Fred MacMurray) thinking he's getting a promotion. Instead Sheldrake wants the apartment only for himself and the elevator girl Fran Kubelik (Shirley MacLaine). Fran is flirtatious with Baxter but she doesn't tell him about Sheldrake. Baxter first sees Fran in his apartment when she tries to kill herself.Jack Lemmon and Shirley MacLaine are just great together with terrific chemistry. It's a dark compelling rom-com from Billy Wilder. It's not as funny as his usual comedies but the couple really sells the passion. There is a darkness hanging over everybody in this movie that is lifted by the couple getting together. That darkness isn't simply the shocking thing that Fran does but it permeates throughout in the ugliness of the situations. Even her hand mirror is broken to make her look the way she feels."
    }
  ],
  "errorMessage": ""
}