{
  "imDbId": "tt0053604",
  "title": "The Apartment",
  "fullTitle": "The Apartment (1960)",
  "type": "Movie",
  "year": "1960",
  "language": "en",
  "titleInLanguage": "The Apartment",
  "url": "https://en.wikipedia.org/wiki/The_Apartment",
  "plotShort": {
    "plainText": "The Apartment is a 1960 American romantic comedy-drama film directed and produced by Billy Wilder from a screenplay he co-wrote with I. A. L. Diamond. It stars Jack Lemmon, Shirley MacLaine, Fred MacMurray, Ray Walston, Jack Kruschen, David Lewis, Willard Waterman, David White, Hope Holiday and Edie Adams.\r\nThe film follows an insurance clerk (Lemmon) who, in the hope of climbing the corporate ladder, lets more senior coworkers use his Upper West Side apartment to conduct extramarital affairs. He is attracted to an elevator operator (MacLaine) in his office building, unaware that she is having an affair with his immediate boss (MacMurray).\r\nThe Apartment was distributed by United Artists to widespread critical acclaim and was a commercial success, despite controversy owing to its subject matter. It became the 8th highest grossing film of 1960. At the 33rd Academy Awards, the film was nominated for ten awards, and won five, including Best Picture, Best Director and Best Screenplay. Lemmon, MacLaine and Kruschen were Oscar-nominated. Lemmon and MacLaine won Golden Globe Awards for their performances. It provided the basis for Promises, Promises, a 1968 Broadway musical by Burt Bacharach, Hal David and Neil Simon.\r\nEver since its release, The Apartment has come to be regarded as one of the greatest films ever made, appearing in lists by the American Film Institute and Sight and Sound magazine. In 1994, it was one of the 25 films selected for inclusion to the United States Library of Congress National Film Registry.",
    "html": "<p>The Apartment is a 1960 American romantic comedy-drama film directed and produced by Billy Wilder from a screenplay he co-wrote with I. A. L. Diamond. It stars Jack Lemmon, Shirley MacLaine, Fred MacMurray, Ray Walston, Jack Kruschen, David Lewis, Willard Waterman, David White, Hope Holiday and Edie Adams.</p><p>The film follows an insurance clerk (Lemmon) who, in the hope of climbing the corporate ladder, lets more senior coworkers use his Upper West Side apartment to conduct extramarital affairs. He is attracted to an elevator operator (MacLaine) in his office building, unaware that she is having an affair with his immediate boss (MacMurray).</p><p>The Apartment was distributed by United Artists to widespread critical acclaim and was a commercial success, despite controversy owing to its subject matter. It became the 8th highest grossing film of 1960. At the 33rd Academy Awards, the film was nominated for ten awards, and won five, including Best Picture, Best Director and Best Screenplay. Lemmon, MacLaine and Kruschen were Oscar-nominated. Lemmon and MacLaine won Golden Globe Awards for their performances. It provided the basis for Promises, Promises, a 1968 Broadway musical by Burt Bacharach, Hal David and Neil Simon.</p><p>Ever since its release, The Apartment has come to be regarded as one of the greatest films ever made, appearing in lists by the American Film Institute and Sight and Sound magazine. In 1994, it was one of the 25 films selected for inclusion to the United States Library of Congress National Film Registry.</p>"
  },
  "plotFull": {
    "plainText": "The Apartment is a 1960 American romantic comedy-drama film directed and produced by Billy Wilder from a screenplay he co-wrote with I. A. L. Diamond. It stars Jack Lemmon, Shirley MacLaine, Fred MacMurray, Ray Walston, Jack Kruschen, David Lewis, Willard Waterman, David White, Hope Holiday and Edie Adams.\r\nThe film follows an insurance clerk (Lemmon) who, in the hope of climbing the corporate ladder, lets more senior coworkers use his Upper West Side apartment to conduct extramarital affairs. He is attracted to an elevator operator (MacLaine) in his office building, unaware that she is having an affair with his immediate boss (MacMurray).\r\nThe Apartment was distributed by United Artists to widespread critical acclaim and was a commercial success, despite controversy owing to its subject matter. It became the 8th highest grossing film of 1960. At the 33rd Academy Awards, the film was nominated for ten awards, and won five, including Best Picture, Best Director and Best Screenplay. Lemmon, MacLaine and Kruschen were Oscar-nominated. Lemmon and MacLaine won Golden Globe Awards for their performances. It provided the basis for Promises, Promises, a 1968 Broadway musical by Burt Bacharach, Hal David and Neil Simon.\r\nEver since its release, The Apartment has come to be regarded as one of the greatest films ever made, appearing in lists by the American Film Institute and Sight and Sound magazine. In 1994, it was one of the 25 films selected for inclusion to the United States Library of Congress National Film Registry.\r\nPlot\r\nC.C. \"Bud\" Baxter is a lonely office drudge at an insurance corporation in New York City. To climb the corporate ladder, he allows four company managers to take turns borrowing his Upper West Side apartment, 51 West 67th Street, for their extramarital affairs. Baxter meticulously juggles the \"booking\" schedule, but the steady stream of women convinces his neighbors that he is a playboy.\r\nBaxter solicits glowing performance reviews from the four managers and submits them to personnel director Jeff Sheldrake, who then promises to promote him – but Sheldrake also demands use of the apartment for his own affairs, beginning that night. As compensation for this short notice, he gives Baxter two theater tickets for that evening. Bud asks his secret crush, Fran Kubelik, an elevator operator in the office building, to join him. She agrees, but first meets up with a \"former fling\", who turns out to be Sheldrake. When Sheldrake dissuades her from breaking up with him, promising to divorce his wife, they head to Baxter’s apartment, while Baxter waits outside the theater.\r\nDuring the company's raucous Christmas party, Sheldrake's secretary, Miss Olsen, tells Fran that her boss has had affairs with other female employees, including herself. Fran confronts Sheldrake at Baxter’s apartment, but he claims he loves her, then heads back to his suburban family.\r\nRealizing that Fran is the woman Sheldrake has been taking to his apartment, Baxter lets himself be picked up by a married lady at a local bar. When they arrive at his apartment, he discovers Fran, passed out on his bed from an apparent suicidal overdose of sleeping pills. He ditches the woman from the bar and enlists Dr. Dreyfuss, a medical doctor living in the next-door apartment, to revive Fran. When Baxter makes Dreyfuss believe that he was the cause of the incident, Dreyfuss scolds him for philandering and advises him to \"be a mensch.\"\r\nThe following morning, Mrs. Dreyfuss brings breakfast over for Fran and pleads with her to make a lifestyle change and settle down. Mrs. Dreyfuss and Fran repeatedly point out the poor housekeeping in Baxter's bachelor pad, notably including the fact that he uses a tennis racket as spaghetti strainer in the kitchen. Dr. Dreyfuss recommended that Fran spends two days recuperating in the apartment, during which time she grows close to Baxter, especially after he confesses to his own suicide attempt over unrequited feelings for a woman who now sends him a fruitcake every Christmas. Fran says she has always suffered bad luck in her love life.\r\nAs Baxter prepares a romantic dinner, one of the managers arrives for a tryst. Baxter persuades him and his companion to leave, but the manager recognizes Fran and informs his colleagues. Later confronted by Fran's brother-in-law, Karl Matuschka, who is looking for her, the jealous managers direct Karl to Baxter’s apartment. Baxter and Fran were in the middle of eating meatballs and spaghetti, which Baxter had strained using the tennis racket, when Karl rings the doorbell and demands that Fran return home to her sister who is concerned about her. Baxter deflects the brother's-in-law anger over Fran's wayward behavior by once again assuming all responsibility. When Karl finds out about Fran's suicide attempt, he punches Baxter twice and knocking him to the floor. Fran reacts by kissing Baxter on the forehead for protecting her, exclaiming softly \"Oh you fool, you damn fool.\"\r\nWhen Sheldrake learns that Miss Olsen tipped off Fran about his affairs, he fires her, but she retaliates by spilling all to Sheldrake's wife, who promptly throws her husband out. With no regrets for his behavior, Sheldrake believes that this situation just makes it easier to pursue Fran, although she hints that she is losing interest. Having promoted Baxter to an even higher position, which also gives him a key to the executive washroom, Sheldrake expects Baxter to loan out his apartment yet again for him and Fran. Baxter gives him back the washroom key instead, proclaiming that he has decided to become a mensch, and quits the firm, forbidding Sheldrake from ever bringing anyone to his apartment again, and \"especially not Ms. Kubelik\". He decides to move out of the apartment and begins to pack his belongings, including a handgun and the tennis racket.\r\nThat night at a New Year's Eve party, Sheldrake indignantly tells Fran about Baxter quitting rather than let Sheldrake bring Ms. Kubelik to his apartment. Realizing her love for Baxter, Fran abandons Sheldrake and runs to the apartment. At the door, she hears an apparent gunshot. Fearing that Baxter has shot himself, she frantically pounds on the door. Baxter opens the door with a bottle of champagne in his hand, having just popped the cork. As they sit down to a game of cards, Fran reveals that she is on her own, like he is. When he asks about Sheldrake, she replies, \"We'll send him a fruitcake every Christmas,” prompting him to declare his love for her. She hands him the cards and affectionately tells him to \"Shut up and deal\".\r\nCast\r\nJack Lemmon as Calvin Clifford (C.C.) \"Bud\" Baxter\r\nShirley MacLaine as Fran Kubelik\r\nFred MacMurray as Jeff D. Sheldrake, personnel manager, Baxter's boss and apartment user\r\nRay Walston as Joe Dobisch, office manager and Baxter apartment user\r\nJack Kruschen as Dr. David Dreyfuss, Baxter's neighbor\r\nDavid Lewis as Al Kirkeby, manager and Baxter apartment user\r\nEdie Adams as Miss Olsen\r\nHope Holiday as Mrs. Margie MacDougall\r\nJoan Shawlee as Sylvia\r\nNaomi Stevens as Mrs. Mildred Dreyfuss\r\nJohnny Seven as Karl Matuschka (Fran's cab driving brother-in-law)\r\nJoyce Jameson as the blonde in the bar\r\nHal Smith as Santa Claus in the bar\r\nWillard Waterman as Mr. Vanderhoff, manager and Baxter apartment user\r\nDavid White as Mr. Eichelberger, manager and Baxter apartment user\r\nProduction\r\nImmediately following the success of Some Like It Hot, Wilder and Diamond wished to make another film with Lemmon. Wilder had originally planned to cast Paul Douglas as Sheldrake; however, after he died unexpectedly, MacMurray was cast.\r\nThe initial concept came from Brief Encounter by Noël Coward, in which Laura Jesson (Celia Johnson) meets Alec Harvey (Trevor Howard) for a thwarted tryst in his friend's apartment. However, due to the Hays Production Code, Wilder was unable to make a film about adultery in the 1940s. Wilder and Diamond also based the film partially on a Hollywood scandal in which high-powered agent Jennings Lang was shot by producer Walter Wanger for having an affair with Wanger's wife, actress Joan Bennett. During the affair, Lang used a low-level employee's apartment. Another element of the plot was based on the experience of one of Diamond's friends, who returned home after breaking up with his girlfriend to find that she had committed suicide in his bed.\r\nAlthough Wilder generally required his actors to adhere exactly to the script, he allowed Lemmon to improvise in two scenes: In one scene, he squirts a bottle of nasal spray across the room, and in another, he sings while cooking spaghetti (which he strains through the grid of a tennis racket). In another scene, where Lemmon was supposed to mime being punched, he failed to move correctly, and was accidentally knocked down. Wilder chose to use the shot of the genuine punch in the film. Lemmon also caught a cold when one scene on a park bench was filmed in sub-zero weather.\r\nArt director Alexandre Trauner used forced perspective to create the set of a large insurance company office. The set appeared to be a very long room full of desks and workers; however, successively smaller people and desks were placed to the back of the room, ending up with children. He designed the set of Baxter's apartment to appear smaller and shabbier than the spacious apartments that usually appeared in films of the day. He used items from thrift stores and even some of Wilder's own furniture for the set.\r\nMusic\r\nThe film's title theme, written by Charles Williams and originally titled \"Jealous Lover\", was first heard in the 1949 film The Romantic Age. A recording by Ferrante & Teicher, released as \"Theme from The Apartment\", reached #10 on the Billboard Hot 100 chart later in 1960.\r\nReception\r\nThe film made double its $3 million budget at the American box office in 1960. Critics were split on The Apartment. Time and Newsweek praised it, as did The New York Times film critic Bosley Crowther, who called the film \"gleeful, tender, and even sentimental\" and Wilder's direction \"ingenious\". Esquire critic Dwight Macdonald gave the film a poor review, calling it \"a paradigm of corny avantgardism\". Others took issue with the film's controversial depictions of infidelity and adultery, with critic Hollis Alpert of the Saturday Review dismissing it as \"a dirty fairy tale\".\r\nMacMurray, having generally played guileless characters, related that after the film's release he was accosted by women in the street who berated him for making a \"dirty filthy movie\", and one of them hit him with her purse. In 2001, Chicago Sun-Times film critic Roger Ebert gave the film four stars out of four, and added it to his Great Movies list. The film critic Clarisse Loughrey has identified it as one of her two favorite movies, along with the 2010 film Boy. The film holds a 93% \"Certified Fresh\" rating on Rotten Tomatoes, based on 103 reviews with an average rating of 8.8/10; the site's consensus states that \"Director Billy Wilder's customary cynicism is leavened here by tender humor, romance, and genuine pathos. On Metacritic, the film has a score of 94 out of 100 based on 21 reviews, indicating \"universal acclaim\", and was awarded the \"Must-See\" badge.\r\nAwards and nominations\r\nAlthough Lemmon did not win the Oscar, Kevin Spacey dedicated his Oscar for American Beauty (1999) to Lemmon's performance. According to the behind-the-scenes feature on the American Beauty DVD, the film's director, Sam Mendes, had watched The Apartment (among other classic American films) as inspiration in preparation for shooting his film.\r\nWithin a few years after The Apartment's release, the routine use of black-and-white film in Hollywood ended. Since The Apartment only two black-and-white movies have won the Academy Award for Best Picture: Schindler's List (1993) and The Artist (2011).\r\nIn 1994, The Apartment was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in the National Film Registry. In 2002, a poll of film directors conducted by Sight and Sound magazine listed the film as the 14th greatest film of all time (tied with La Dolce Vita). In the 2012 poll by the same magazine directors voted the film 44th greatest of all time. The film was included in \"The New York Times Guide to the Best 1,000 Movies Ever Made\" in 2002. In 2006, Premiere voted this film as one of \"The 50 Greatest Comedies Of All Time\". The Writers Guild of America ranked the film's screenplay (written by Billy Wilder & I.A.L. Diamond.) the 15th greatest ever. In 2015, The Apartment ranked 24th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. The film was selected as the 27th best comedy of all time in a poll of 253 film critics from 52 countries conducted by the BBC in 2017.\r\nAmerican Film Institute lists:\r\nAFI's 100 Years...100 Movies (#93),\r\nAFI's 100 Years...100 Laughs (#20),\r\nAFI's 100 Years...100 Passions (#62),\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) (#80).\r\nAFI's 100 Years...100 Movie Quotes: Fran Kubelik: \"Shut up, and deal.\" – Nominated\r\nFran Kubelik: \"Shut up, and deal.\" – Nominated\r\nStage adaptation\r\nIn 1968, Burt Bacharach, Hal David and Neil Simon created a musical adaptation titled Promises, Promises which opened on Broadway at the Shubert Theatre in New York City. Starring Jerry Orbach, Jill O'Hara and Edward Winter in the roles of Chuck, Fran and Sheldrake, the production closed in 1972. An all-star revival began in 2010 with Sean Hayes, Kristin Chenoweth and Tony Goldwyn as the three leads. This version added famous Bacharach/David songs \"I Say a Little Prayer\" and \"A House Is Not a Home\" to the roster.",
    "html": "<p>The Apartment is a 1960 American romantic comedy-drama film directed and produced by Billy Wilder from a screenplay he co-wrote with I. A. L. Diamond. It stars Jack Lemmon, Shirley MacLaine, Fred MacMurray, Ray Walston, Jack Kruschen, David Lewis, Willard Waterman, David White, Hope Holiday and Edie Adams.</p><p>The film follows an insurance clerk (Lemmon) who, in the hope of climbing the corporate ladder, lets more senior coworkers use his Upper West Side apartment to conduct extramarital affairs. He is attracted to an elevator operator (MacLaine) in his office building, unaware that she is having an affair with his immediate boss (MacMurray).</p><p>The Apartment was distributed by United Artists to widespread critical acclaim and was a commercial success, despite controversy owing to its subject matter. It became the 8th highest grossing film of 1960. At the 33rd Academy Awards, the film was nominated for ten awards, and won five, including Best Picture, Best Director and Best Screenplay. Lemmon, MacLaine and Kruschen were Oscar-nominated. Lemmon and MacLaine won Golden Globe Awards for their performances. It provided the basis for Promises, Promises, a 1968 Broadway musical by Burt Bacharach, Hal David and Neil Simon.</p><p>Ever since its release, The Apartment has come to be regarded as one of the greatest films ever made, appearing in lists by the American Film Institute and Sight and Sound magazine. In 1994, it was one of the 25 films selected for inclusion to the United States Library of Congress National Film Registry.</p><br/><h3>Plot</h3><p>C.C. \"Bud\" Baxter is a lonely office drudge at an insurance corporation in New York City. To climb the corporate ladder, he allows four company managers to take turns borrowing his Upper West Side apartment, 51 West 67th Street, for their extramarital affairs. Baxter meticulously juggles the \"booking\" schedule, but the steady stream of women convinces his neighbors that he is a playboy.</p><p>Baxter solicits glowing performance reviews from the four managers and submits them to personnel director Jeff Sheldrake, who then promises to promote him – but Sheldrake also demands use of the apartment for his own affairs, beginning that night. As compensation for this short notice, he gives Baxter two theater tickets for that evening. Bud asks his secret crush, Fran Kubelik, an elevator operator in the office building, to join him. She agrees, but first meets up with a \"former fling\", who turns out to be Sheldrake. When Sheldrake dissuades her from breaking up with him, promising to divorce his wife, they head to Baxter’s apartment, while Baxter waits outside the theater.</p><p>During the company's raucous Christmas party, Sheldrake's secretary, Miss Olsen, tells Fran that her boss has had affairs with other female employees, including herself. Fran confronts Sheldrake at Baxter’s apartment, but he claims he loves her, then heads back to his suburban family.</p><p>Realizing that Fran is the woman Sheldrake has been taking to his apartment, Baxter lets himself be picked up by a married lady at a local bar. When they arrive at his apartment, he discovers Fran, passed out on his bed from an apparent suicidal overdose of sleeping pills. He ditches the woman from the bar and enlists Dr. Dreyfuss, a medical doctor living in the next-door apartment, to revive Fran. When Baxter makes Dreyfuss believe that he was the cause of the incident, Dreyfuss scolds him for philandering and advises him to \"be a mensch.\"</p><p>The following morning, Mrs. Dreyfuss brings breakfast over for Fran and pleads with her to make a lifestyle change and settle down. Mrs. Dreyfuss and Fran repeatedly point out the poor housekeeping in Baxter's bachelor pad, notably including the fact that he uses a tennis racket as spaghetti strainer in the kitchen. Dr. Dreyfuss recommended that Fran spends two days recuperating in the apartment, during which time she grows close to Baxter, especially after he confesses to his own suicide attempt over unrequited feelings for a woman who now sends him a fruitcake every Christmas. Fran says she has always suffered bad luck in her love life.</p><p>As Baxter prepares a romantic dinner, one of the managers arrives for a tryst. Baxter persuades him and his companion to leave, but the manager recognizes Fran and informs his colleagues. Later confronted by Fran's brother-in-law, Karl Matuschka, who is looking for her, the jealous managers direct Karl to Baxter’s apartment. Baxter and Fran were in the middle of eating meatballs and spaghetti, which Baxter had strained using the tennis racket, when Karl rings the doorbell and demands that Fran return home to her sister who is concerned about her. Baxter deflects the brother's-in-law anger over Fran's wayward behavior by once again assuming all responsibility. When Karl finds out about Fran's suicide attempt, he punches Baxter twice and knocking him to the floor. Fran reacts by kissing Baxter on the forehead for protecting her, exclaiming softly \"Oh you fool, you damn fool.\"</p><p>When Sheldrake learns that Miss Olsen tipped off Fran about his affairs, he fires her, but she retaliates by spilling all to Sheldrake's wife, who promptly throws her husband out. With no regrets for his behavior, Sheldrake believes that this situation just makes it easier to pursue Fran, although she hints that she is losing interest. Having promoted Baxter to an even higher position, which also gives him a key to the executive washroom, Sheldrake expects Baxter to loan out his apartment yet again for him and Fran. Baxter gives him back the washroom key instead, proclaiming that he has decided to become a mensch, and quits the firm, forbidding Sheldrake from ever bringing anyone to his apartment again, and \"especially not Ms. Kubelik\". He decides to move out of the apartment and begins to pack his belongings, including a handgun and the tennis racket.</p><p>That night at a New Year's Eve party, Sheldrake indignantly tells Fran about Baxter quitting rather than let Sheldrake bring Ms. Kubelik to his apartment. Realizing her love for Baxter, Fran abandons Sheldrake and runs to the apartment. At the door, she hears an apparent gunshot. Fearing that Baxter has shot himself, she frantically pounds on the door. Baxter opens the door with a bottle of champagne in his hand, having just popped the cork. As they sit down to a game of cards, Fran reveals that she is on her own, like he is. When he asks about Sheldrake, she replies, \"We'll send him a fruitcake every Christmas,” prompting him to declare his love for her. She hands him the cards and affectionately tells him to \"Shut up and deal\".</p><br/><h3>Cast</h3><ul><li>Jack Lemmon as Calvin Clifford (C.C.) \"Bud\" Baxter</li><li>Shirley MacLaine as Fran Kubelik</li><li>Fred MacMurray as Jeff D. Sheldrake, personnel manager, Baxter's boss and apartment user</li><li>Ray Walston as Joe Dobisch, office manager and Baxter apartment user</li><li>Jack Kruschen as Dr. David Dreyfuss, Baxter's neighbor</li><li>David Lewis as Al Kirkeby, manager and Baxter apartment user</li><li>Edie Adams as Miss Olsen</li><li>Hope Holiday as Mrs. Margie MacDougall</li><li>Joan Shawlee as Sylvia</li><li>Naomi Stevens as Mrs. Mildred Dreyfuss</li><li>Johnny Seven as Karl Matuschka (Fran's cab driving brother-in-law)</li><li>Joyce Jameson as the blonde in the bar</li><li>Hal Smith as Santa Claus in the bar</li><li>Willard Waterman as Mr. Vanderhoff, manager and Baxter apartment user</li><li>David White as Mr. Eichelberger, manager and Baxter apartment user</li></ul><br/><h3>Production</h3><p>Immediately following the success of Some Like It Hot, Wilder and Diamond wished to make another film with Lemmon. Wilder had originally planned to cast Paul Douglas as Sheldrake; however, after he died unexpectedly, MacMurray was cast.</p><p>The initial concept came from Brief Encounter by Noël Coward, in which Laura Jesson (Celia Johnson) meets Alec Harvey (Trevor Howard) for a thwarted tryst in his friend's apartment. However, due to the Hays Production Code, Wilder was unable to make a film about adultery in the 1940s. Wilder and Diamond also based the film partially on a Hollywood scandal in which high-powered agent Jennings Lang was shot by producer Walter Wanger for having an affair with Wanger's wife, actress Joan Bennett. During the affair, Lang used a low-level employee's apartment. Another element of the plot was based on the experience of one of Diamond's friends, who returned home after breaking up with his girlfriend to find that she had committed suicide in his bed.</p><p>Although Wilder generally required his actors to adhere exactly to the script, he allowed Lemmon to improvise in two scenes: In one scene, he squirts a bottle of nasal spray across the room, and in another, he sings while cooking spaghetti (which he strains through the grid of a tennis racket). In another scene, where Lemmon was supposed to mime being punched, he failed to move correctly, and was accidentally knocked down. Wilder chose to use the shot of the genuine punch in the film. Lemmon also caught a cold when one scene on a park bench was filmed in sub-zero weather.</p><p>Art director Alexandre Trauner used forced perspective to create the set of a large insurance company office. The set appeared to be a very long room full of desks and workers; however, successively smaller people and desks were placed to the back of the room, ending up with children. He designed the set of Baxter's apartment to appear smaller and shabbier than the spacious apartments that usually appeared in films of the day. He used items from thrift stores and even some of Wilder's own furniture for the set.</p><h4>Music</h4><p>The film's title theme, written by Charles Williams and originally titled \"Jealous Lover\", was first heard in the 1949 film The Romantic Age. A recording by Ferrante & Teicher, released as \"Theme from The Apartment\", reached #10 on the Billboard Hot 100 chart later in 1960.</p><br/><h3>Reception</h3><p>The film made double its $3 million budget at the American box office in 1960. Critics were split on The Apartment. Time and Newsweek praised it, as did The New York Times film critic Bosley Crowther, who called the film \"gleeful, tender, and even sentimental\" and Wilder's direction \"ingenious\". Esquire critic Dwight Macdonald gave the film a poor review, calling it \"a paradigm of corny avantgardism\". Others took issue with the film's controversial depictions of infidelity and adultery, with critic Hollis Alpert of the Saturday Review dismissing it as \"a dirty fairy tale\".</p><p>MacMurray, having generally played guileless characters, related that after the film's release he was accosted by women in the street who berated him for making a \"dirty filthy movie\", and one of them hit him with her purse. In 2001, Chicago Sun-Times film critic Roger Ebert gave the film four stars out of four, and added it to his Great Movies list. The film critic Clarisse Loughrey has identified it as one of her two favorite movies, along with the 2010 film Boy. The film holds a 93% \"Certified Fresh\" rating on Rotten Tomatoes, based on 103 reviews with an average rating of 8.8/10; the site's consensus states that \"Director Billy Wilder's customary cynicism is leavened here by tender humor, romance, and genuine pathos. On Metacritic, the film has a score of 94 out of 100 based on 21 reviews, indicating \"universal acclaim\", and was awarded the \"Must-See\" badge.</p><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"10\"><span>1960</span></td><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Motion Picture</span></td><td rowspan=\"2\"><span>Billy Wilder</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Jack Lemmon</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td><span>Shirley MacLaine</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Jack Kruschen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Story and Screenplay – Written Directly for the Screen</span></td><td>Billy Wilder and <span>I. A. L. Diamond</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction – Black-and-White</span></td><td><span>Alexandre Trauner</span> and <span>Edward G. Boyle</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography – Black-and-White</span></td><td><span>Joseph LaShelle</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Daniel Mandell</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound</span></td><td><span>Gordon E. Sawyer</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>1960</span></td><td rowspan=\"3\"><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Foreign Actor</span></td><td>Jack Lemmon</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Foreign Actress</span></td><td>Shirley MacLaine</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>1960</td><td><span>Cinema Writers Circle Awards</span></td><td colspan=\"2\">Best Foreign Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>1960</span></td><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Director - Motion Pictures</span></td><td>Billy Wilder</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>1960</span></td><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Musical or Comedy</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Motion Picture – Musical or Comedy</span></td><td>Jack Lemmon</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress in a Motion Picture – Musical or Comedy</span></td><td>Shirley MacLaine</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Billy Wilder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>1960</span></td><td><span>Grammy Awards</span></td><td><span>Best Soundtrack Album</span></td><td><span>Adolph Deutsch</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\">1960</td><td rowspan=\"3\"><span>Laurel Awards</span></td><td colspan=\"2\">Top Comedy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Top Male Comedy Performance</td><td>Jack Lemmon</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Top Female Dramatic Performance</td><td>Shirley MacLaine</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>1960</span></td><td><span class=\"mw-redirect\">National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">8th Place</td></tr><tr><td>1960</td><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"3\"><span>1960</span></td><td rowspan=\"3\"><span class=\"mw-redirect\">New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>Billy Wilder</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td>Billy Wilder and I. A. L. Diamond</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>1960</span></td><td rowspan=\"2\"><span class=\"mw-redirect\">Venice International Film Festival</span></td><td><span>Golden Lion</span></td><td>Billy Wilder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td>Shirley MacLaine</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>1960</span></td><td><span>Writers Guild of America Awards</span></td><td><span>Best Written American Comedy</span></td><td>Billy Wilder and I. A. L. Diamond</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>Although Lemmon did not win the Oscar, Kevin Spacey dedicated his Oscar for American Beauty (1999) to Lemmon's performance. According to the behind-the-scenes feature on the American Beauty DVD, the film's director, Sam Mendes, had watched The Apartment (among other classic American films) as inspiration in preparation for shooting his film.</p><p>Within a few years after The Apartment's release, the routine use of black-and-white film in Hollywood ended. Since The Apartment only two black-and-white movies have won the Academy Award for Best Picture: Schindler's List (1993) and The Artist (2011).</p><p>In 1994, The Apartment was deemed \"culturally, historically, or aesthetically significant\" by the United States Library of Congress and selected for preservation in the National Film Registry. In 2002, a poll of film directors conducted by Sight and Sound magazine listed the film as the 14th greatest film of all time (tied with La Dolce Vita). In the 2012 poll by the same magazine directors voted the film 44th greatest of all time. The film was included in \"The New York Times Guide to the Best 1,000 Movies Ever Made\" in 2002. In 2006, Premiere voted this film as one of \"The 50 Greatest Comedies Of All Time\". The Writers Guild of America ranked the film's screenplay (written by Billy Wilder & I.A.L. Diamond.) the 15th greatest ever. In 2015, The Apartment ranked 24th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. The film was selected as the 27th best comedy of all time in a poll of 253 film critics from 52 countries conducted by the BBC in 2017.</p><p>American Film Institute lists:</p><ul><li>AFI's 100 Years...100 Movies (#93),</li><li>AFI's 100 Years...100 Laughs (#20),</li><li>AFI's 100 Years...100 Passions (#62),</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) (#80).</li><li>AFI's 100 Years...100 Movie Quotes: Fran Kubelik: \"Shut up, and deal.\" – Nominated</li><li>Fran Kubelik: \"Shut up, and deal.\" – Nominated</li></ul><br/><h3>Stage adaptation</h3><p>In 1968, Burt Bacharach, Hal David and Neil Simon created a musical adaptation titled Promises, Promises which opened on Broadway at the Shubert Theatre in New York City. Starring Jerry Orbach, Jill O'Hara and Edward Winter in the roles of Chuck, Fran and Sheldrake, the production closed in 1972. An all-star revival began in 2010 with Sean Hayes, Kristin Chenoweth and Tony Goldwyn as the three leads. This version added famous Bacharach/David songs \"I Say a Little Prayer\" and \"A House Is Not a Home\" to the roster.</p><br/>"
  },
  "errorMessage": ""
}