{
  "imDbId": "tt8267604",
  "title": "Capernaum",
  "fullTitle": "Capernaum (2018)",
  "type": "Movie",
  "year": "2018",
  "items": [
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/films/0/capernaum-review-crazily-ambitious-heart-in-mouth-neorealist/",
      "rate": "100",
      "content": "A social-realist blockbuster – fired by furious compassion and teeming with sorrow, yet strewn with diamond-shards of beauty, wit and hope."
    },
    {
      "publisher": "The Playlist",
      "author": "Jordan Ruimy",
      "link": "",
      "rate": "83",
      "content": "Capharnaüm is not without its issues. The director over-relies on the courtroom scenes and the movie’s message is heavy-handed at times. Yet, the sheer force of the filmmaking and its artful delivery overpowers sappy overreaching."
    },
    {
      "publisher": "Variety",
      "author": "Jay Weissberg",
      "link": "https://variety.com/2018/film/reviews/capernaum-review-capharnaum-1202814614/",
      "rate": "80",
      "content": "While this is unquestionably an issue film, it tackles its subject with intelligence and heart."
    },
    {
      "publisher": "CineVue",
      "author": "Martyn Conterio",
      "link": "https://cine-vue.com/2018/05/cannes-2018-capernaum-review.html",
      "rate": "80",
      "content": "Makes for a generally powerful statement on human misery and grotesque inequality, though some third act creative decisions and maneuvers cause a wobble or two."
    },
    {
      "publisher": "Time Out",
      "author": "Anna Smith",
      "link": "",
      "rate": "80",
      "content": "It’s quietly absorbing and fitfully shocking as we experience the sights, sounds and smells of the streets where a one-year-old child can wander around alone without anyone stopping to wonder why."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Leslie Felperin",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/capharnaum-review-1112973/",
      "rate": "70",
      "content": "Although the narrative is structured through a highly unbelievable instigating conceit — Zain is trying to sue his own parents in court for giving him life in the first place — Labaki lures such outstanding performances out of the almost entirely non-professional cast and sketches such a credible view of this wretchedly poor milieu that the flaws are mostly forgivable."
    },
    {
      "publisher": "Screen Daily",
      "author": "Lee Marshall",
      "link": "https://www.screendaily.com/reviews/capernaum-cannes-review/5129486.article",
      "rate": "70",
      "content": "If it doesn’t tie many (or any) of these thematic strands with a neat bow, that’s in the nature of a film that chooses raw dramatic power over narrative finesse."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2018/may/18/capernaum-review-cannes-film-festival",
      "rate": "60",
      "content": "It’s a simplistic film in some ways, with a naive ending – but there is energy and vigour, too."
    },
    {
      "publisher": "The A.V. Club",
      "author": "A.A. Dowd",
      "link": "https://www.avclub.com/the-best-movies-of-cannes-2018-plus-a-serious-palme-do-1826130650",
      "rate": "58",
      "content": "Capernaum’s neorealist spirit is smothered by its sentimentality and endless string of indignities; it’s as if the film is operating as Zain’s trial defense, every moment making his case that it probably would have been better if he’d never been born."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/features/general/capernaum-review-nadine-labaki-cannes-2018-1201966059/",
      "rate": "50",
      "content": "Capernaum is a movie that wants its audience to empathize with its protagonist so intensely that you agree he should never have been born. It’s a fascinating (if obviously counterintuitive) approach, but one that’s frustrated by the literalness with which Labaki unpacks it."
    }
  ],
  "errorMessage": ""
}