{
  "imDbId": "tt8267604",
  "title": "Capernaum",
  "fullTitle": "Capernaum (2018)",
  "type": "Movie",
  "year": "2018",
  "items": [
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5480034",
      "warningSpoilers": false,
      "date": "13 February 2020",
      "rate": "",
      "helpful": "112 out of 125 found this helpful.",
      "title": "Capernaum",
      "content": "Zain Al Rafeea is a terrific revelation in this powerful and profoundly devastating look at the miserable existence of a poor child who, like many others, deserved so much more from life - and I'm pretty sure his eyes of infinite sadness will haunt me for the rest of my life after this."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw5928544",
      "warningSpoilers": false,
      "date": "23 July 2020",
      "rate": "8",
      "helpful": "54 out of 60 found this helpful.",
      "title": "Well made but very difficult to watch....and not a film for everyone.",
      "content": "\"Capernaum\" is a very unpleasant film that deals with very unpleasant situations and people. Because of that, it's not a film for kids to watch and I don't recommend anyone suffering from depression watch the movie....it's very hard to take and is brutal in its realism.The film is about a 12 year-old named Zain who lives in Lebanon and who physically looks like a 9 or 10 year-old...possibly because of malnutrition. The film begins with the boy in prison for stabbing someone and his parents have been called back to court because the boy is now suing them for bringing him life. The film then is a series of flashbacks which show how neglected the boy was. It became so bad that eventually he is taken in by an illegal alien and he takes care of her baby while she goes out looking for any work. Later, when she disappears, Zain continues caring for the baby and trying to work at the same time. It's a miserable existence and you know eventually it will end in violence.This film was made with a minimum of dialog and a plot that is hard to see without the story tearing at your heart. It's one of the more unpleasant movies I've seen in some time and implies many things that aren't overtly stated, such as pedophilia and other ghastly crimes. Hard to take...so much so that although it's an excellent character study, it's the sort of film few would really want to watch in the first place."
    },
    {
      "username": "thesar-2",
      "userUrl": "https://www.imdb.com/user/ur17825945",
      "reviewLink": "https://www.imdb.com/review/rw6022577",
      "warningSpoilers": true,
      "date": "24 August 2020",
      "rate": "9",
      "helpful": "48 out of 55 found this helpful.",
      "title": "I Also Accuse My Parents",
      "content": "Watch this and you'll never feel poor again. You might even appreciate every single thing you own.Wow, this movie set in the slums of Beirut, Lebanon, did a 180 on me. The entire movie revolves around the main character, child, Zain - maybe 12, maybe 13, but wise beyond twice his maybe age. At first, I didn't care for him. He seemed always angry, cross, mean and rude. I just accepted this is the character the movie's about.Well, then the 180 degrees SLOOOOWLY, but surely kicks in. It takes a lot of patience, attention and definitely reading to see why he's like what he is and it may break your heart.Zain has an infinite number of brothers and sisters and some ruthless parents. The one Zain loves and cares for the most, his 11-year-old sister, Sahar and is being courted by a full-grown man. Just as Zain is about to run away to save Sahar, she is, in fact, sold/bartered to the man to be his 11-year-old wife. Unable to save her Zain just leaves.That's all just the setup, as not the movie kicks in with his journey, observations and inability to take care of a baby he ends up with. And there's much more. Believe me when I tell you I've only told you 10% of the plot just so you know what you're getting into.Wow, this movie was heartbreaking, uplifting from the boy's plight and scary this could/probably does happen. That 180 turnaround I spoke about: well, I ended up loving this kid. Pitying him, definitely, but he's more MAN at 12 or 13 then most adult men are.Highly recommend this movie. Use this as birth control. No one else seems to be getting the message.***Final thoughts: Beirut, Lebanon's been in the news lately from their nuclear-sized blast. While this isn't a pretty movie by ANY means, at least it's an uplifting tale of someone speaking out against the wrongs of some its people. Wish people would hear this message, but sadly, unlikely."
    },
    {
      "username": "Zi_Reviews_Movies",
      "userUrl": "https://www.imdb.com/user/ur134107995",
      "reviewLink": "https://www.imdb.com/review/rw8473422",
      "warningSpoilers": false,
      "date": "21 August 2022",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Real. Touching. Heartbreaking.",
      "content": "At first, I didn't want to review the movie, just give it the highest rating and leave it at that because I don't think I am worthy to judge it. And here I am, writing this, not because I have become any worthier but because people need to watch it. Capernaum tugs at your heartstrings and makes you ache. It's painful, and not in an ordinary way. I watched the movie a few days back and I still think about it. It's definitely made me more grateful for the things I have. The actors don't feel like they're acting (to some extent they're not), it feels like a reality, their innocent eyes describing a journey most of the world was unaware of.I want to recommend this to everyone, but if you're at a low point in your life or show signs of depression, avoid it, you suffer enough. I watched most of the film with tears streaming down my face and at the end, I just sat in the dark with the credits rolling and wondering about the world we live in.Capernaum is a masterpiece."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw6677698",
      "warningSpoilers": false,
      "date": "9 March 2021",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Other World",
      "content": "This is not a documentary, yet it may very well have been. It does feel a lot like one. And because of that, which includes a pace and a mood that some may not like that much, it may or may not be your cup of tea. The family problems and issues are so direct and so obnoxious at times, that you may feel annoyed. This is by design. Depending on your level of empathy, you will of course have different reactions to a crying baby for example.This is not a judging tool and we are all different in many ways, which in general is a good thing. But this is also why we'll react differently to certain things and it's ok. It would be bad if all liked the same things and would not leave any room for discussions - which hopefully are not stretching into fights. Because whether you think this is a masterpiece (and there are indications of that here, thorough throughout, grim, dark, but taken directly from life - the drama and all that) or think this is not worth a minute of your time ... doesn't mean you're more right than anyone not believing what you believe.It's quite the harrowing and draining watching experience. So not an easy watch (not just because of babies crying, but generally what happens to kids - not just physically but mentally and so forth) ... does this sound like something you want to watch?"
    },
    {
      "username": "andrewestrella",
      "userUrl": "https://www.imdb.com/user/ur60343557",
      "reviewLink": "https://www.imdb.com/review/rw4461566",
      "warningSpoilers": false,
      "date": "16 November 2018",
      "rate": "",
      "helpful": "160 out of 206 found this helpful.",
      "title": "The Best Foreign Film Ever Made?",
      "content": "I have taken so long to review this film because it has had so much of an emotional effect on me. It was also the first film I saw at AFI Festival and since I was genuinely shocked at how bad the subsequent films I saw there, I decided to get those out of the way first.Well, here I am, giving my review on the most heart-wrenching yet most beautiful film I have ever seen. The \"acting\" was absolutely extraordinary (standouts are from a young eleven year old boy and a one year old baby). The score from the director's husband happens to be one of my favorite pieces of music from the decade. The cinematography manages to take some of the most disgusting places in the world and manages to give it beauty, especially through the gorgeous landscape and aerial shots.Coming from a Lebanese female director, Capernaum is a film that discusses a variety of issues, but I will try to make it as simple as I can. In the present day, our main character, eleven year old Zain is a boy currently serving a sentence for stabbing a man. Through certain circumstances, Zain is able to take a break from jail to partake in a court case against his parents, where he is attempting to sue them for ever having him in the first place and to urge them to never have kids again. Through a series of flashbacks, we get to see Zain suffering in his large family of about seven to eight, including sisters of all ages, and two horribly misguided parents. The parents struggle financially, forcing their children to work long hours and never partake in school. The parents also abuse Zain for being extremely rebellious in nature (think of Rebel Without a Cause) and they starve him a lot. There is a lot of family issues here, but over the course of the film, Zain experiences a journey of a lifetime, running away from home and trying to make a life for himself, living life on the streets. Regardless of the amount of suffering Zain goes through, he delivers an utmost love and care for everyone around him.Capernaum is an extraordinary film that won my heart in every way. It depicts the harsh realities of the children living in squalor in Lebanon, and perhaps in all of the Middle East. Filmed as a narrative, Capernaum actually uses real life Syrian refugees and kids who were all going through extremely similar circumstances to the ones found in this film. The director and her husband were their following the screening, and they really emphasized how they spent 100s of hours in Lebanon, ensuring that they experienced the squalor themselves and the interviewed hundreds of children to get an idea of what life is like there.The common theme: \"I wish I never lived\" or \"I wish my parents never had me.\"The director took those two most common statements and developed a powerful film that gives humanity to these children who need it most. Perhaps the themes of love and compassion amidst squalor and pain could be a guiding light to all the children who are suffering in the foster care system or are getting abused here in the United States as well. I just hope Capernaum spreads awareness to all people throughout the world that child abuse is still rampant throughout the world, and all children want to be is loved. All people want to be is accepted and have a home. All people just wanted to be treated like a *queues Tommy Wiseau's voice* human being.Honestly, I am proud to say this is currently my favorite film of all time. At two and a half hours long, I was begging for more at the end. Bring lots of tissues, but also do not be afraid to let loose and laugh a little.Regardless of all the positive reviews for Roma, I am going to be rooting for Capernaum to win Best Foreign Film at the Academy Awards. This experience changed my life, and I hope it does for you as well.Fun Fact: The original cut was ten hours long.Another fun fact: This received a 15 minute standing ovation at Cannes Film Festival, and it was well deserved."
    },
    {
      "username": "bugsmoran29",
      "userUrl": "https://www.imdb.com/user/ur25914400",
      "reviewLink": "https://www.imdb.com/review/rw4991093",
      "warningSpoilers": true,
      "date": "12 July 2019",
      "rate": "10",
      "helpful": "61 out of 75 found this helpful.",
      "title": "Made a grumpy old white guy cry",
      "content": "This movie was almost unwatchable for me at time because of its heartbreaking depiction of life on the streets of a big city. The scenes with the 12 year pulling around the infant in a big pot as he sought to provide for them both made me cry. There's so much pain in the world!"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw4869198",
      "warningSpoilers": false,
      "date": "20 May 2019",
      "rate": "10",
      "helpful": "24 out of 31 found this helpful.",
      "title": "I bet that more people live like this than we realize",
      "content": "We've heard a lot about refugees in the past few years. There have been images of people trying to cross the Mediterranean Sea, or pouring into Lebanon and Jordan, or other things like that. The reality on the ground for them is horrible beyond belief. This topic gets addressed in Nadine Labaki's \"Capharnaüm\" (also rendered Kafarnaum, called \"Capernaum\" in English). It concerns Zain, a Lebanese boy who befriends Yonas, an Ethiopian immigrant boy.Shot in a naturalistic style, the movie offers a rough look at their existences. Zain comes from a dilapidated part of the city but has run away from his parents, while Yonas lives with his mother in a cramped apartment. People flee their homes in search of a better and safer life, and then terrible things happen to them in their new homes. It's a heartbreaking movie, and I wholeheartedly recommend it. Let's hope that Labaki keeps making these sorts of movies.No telling how many people this happens to worldwide (and it looks likely to increase)."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw5099991",
      "warningSpoilers": true,
      "date": "4 September 2019",
      "rate": "8",
      "helpful": "12 out of 14 found this helpful.",
      "title": "\"We're insects, my friend. Don't you get it?\"",
      "content": "This is one of the more disturbing movies one is likely to see. Disturbing in the sense that it reveals the horrendous conditions that people are forced to live in if they have no other recourse. The story follows a twelve year old Lebanese boy, (who quite literally doesn't even know his true age) who has seen enough in his short lifetime that he has no trouble at all distinguishing good from bad. Unfortunately for Zain (Zain Al Rafeea), things are almost always bad, as the story traces his tragic circumstances at home and the way he's forced to use his street smarts to survive in unrelenting chaotic conditions. What infuriated me the most was the extent of human trafficking that the film reveals, which affected Zain's own family and circumstances, to a degree that he lost his own eleven year old sister to a merchant who traded meager security for a youngster he could abuse sexually. I would have been more comfortable with the central character if his upbringing hadn't contaminated him with the obscene language he used in virtually every circumstance, calling his own mother a whore, though her treatment of Zain certainly didn't qualify Saoud (Kawsar Al Haddad) as Mother of the Year. What the story never got around to however, was a resolution to the premise that Zain sued his parents for 'being born'. A courtroom hearing delivered no reprisals against the couple, nor do we learn what happened to the man Assaad (Nour El Husseini), who made Zain's sister an unintended victim. The pathos and poignancy of the story is best expressed in Zain's own words to a mother who held no value for the life her children - \"Your words are stabbing me in the heart\"."
    },
    {
      "username": "HadeelKouta",
      "userUrl": "https://www.imdb.com/user/ur93114713",
      "reviewLink": "https://www.imdb.com/review/rw4361678",
      "warningSpoilers": true,
      "date": "26 September 2018",
      "rate": "10",
      "helpful": "358 out of 405 found this helpful.",
      "title": "A Masterpiece",
      "content": "Capharnaum - The MovieNadine Labaki always astonishes me with her work and this is actually my first time ever to write a review about a movie. But this... this is a masterpiece...Capharnaum managed to stir my emotions, it awakened my mind to things we see on a daily basis but decide to ignore. It was a big slap in the face, to be honest. As I watched, I hated myself for having food and shelter. I hated the fact that I paid 14.000 LBPs for my own pleasure and enjoyment to watch a movie. I hated the fact that I bought a $1 worth of pop corn for $7. Why do I get to enjoy a three-hour movie whilst others need that money for a three-day food supply? For those who still haven't seen it, it's a story of a supposedly 12-year old boy who gets sued for stabbing a \"son of a bitch\" (as the boy, Zain describes him). It depicts the life of a typical Lebanese poor family, only if the word poor was enough. It portrays how they eat, how they dress, how they talk and behave and what they do for a living. It was so REAL that I thought it was actual footage from Zain's life. The movie also displays the life of an Ethiopian woman who has no permit and who was knocked up by some guy and gave birth to a baby she can barely support. Oh, speaking of the Ethiopian woman; I was meaning to mention, as soon as the movie starts, we see Zain at court and then we also see the Ethiopian, Tegist with tears in her eyes while waiting for Internal Security to call out her name. At this point I'm really curious as of what this is going to be about and some guy behind me makes a \"funny\" joke about the scene saying \"oh, so the Ethiopian is the star of the movie?\"... I don't know why but I thought I'd mention that because it left me in shock... we'll get back to that later. Capharnaum addresses poverty, illiteracy, ignorance, cruelty, racism, unawareness and child abuse. On the other hand, it also addresses kindness, innocence, forgiveness and faith. It is just amazing how Zain worked so damn hard to support Tigest's baby all alone while his parents didn't have a care in the world for their own children. A 12-year old boy taking care of a baby was just so heartwarming and beautiful. Zain's personality is amazingly complex and in him one can touch awareness and illiteracy at the same time. Innocence and violence. Politeness and insensitivity. Good and bad. Love and hate. He had a vision, he had a message. His message was bigger than governments and countries. It was bigger than you and me. It was a message that we decide to laugh about instead of help spread. The message is simplified in one word: AWARENESS.About the guy I mentioned earlier, lets hope he has learned something from the movie...Lets make this movie our prayer before going to bed every night... Then, we could try and change the world to the better.Nadine Labaki keeps on dazzling us with her great work... I can't wait for the next one. We, as Lebanese, are so proud of you. And the whole world should be. Much love."
    },
    {
      "username": "tedicaprio",
      "userUrl": "https://www.imdb.com/user/ur49293940",
      "reviewLink": "https://www.imdb.com/review/rw4982567",
      "warningSpoilers": false,
      "date": "7 July 2019",
      "rate": "8",
      "helpful": "60 out of 76 found this helpful.",
      "title": "Two great boys!",
      "content": "OMG. Zain and Yonas are movie miracles. The director succeeded in crafting them into natural actors. And the story ..... flowing like a strong current that carries you helplessly you can't do nothing but let go of everything. And Zain, how his energy infiltrated my being, I realized that I smiled when he also finally smiled at the end, that through the movie I became him. He is magic!"
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw5140783",
      "warningSpoilers": false,
      "date": "24 September 2019",
      "rate": "8",
      "helpful": "11 out of 13 found this helpful.",
      "title": "As close to 'real' as possible.",
      "content": "'Capernaum (2019)' is social-realism at its finest, so palpably 'real' that it almost seems a documentary. It somehow depicts a bleak and difficult-to-stomach world with sparks of hope and fun. Of course, a lot of what happens is devastating, too. Apparently, writer-director Labaki amalgamated the story only from real-life events she witnessed first-hand during her research. It certainly shows and, for me, this information makes everything that much more heart-breaking. It's precisely because it's so real that it hurts so much. This emotional connection is only possible because of a fantastically subdued screenplay, some brilliant direction and typically phenomenal performances from all members of the cast. Indeed, the child actors are remarkably good here, ranging in age from pre-teen to barely out-of-the-womb. It's impressive stuff that solidifies the film as one of the most believable in recent years. The whole thing is just effortlessly engaging, wrapping you up in a relatively small story that usually wouldn't get the time of day it deserves. It may be fiction, but it highlights a plethora of issues that truly plague our world every single day. It's all so domestic and, even, mundane, too. It's just a slice of life that we usually don't see. It's great. 8/10"
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw4628301",
      "warningSpoilers": false,
      "date": "5 February 2019",
      "rate": "10",
      "helpful": "27 out of 38 found this helpful.",
      "title": "Took My Breath Away",
      "content": "This movie took my breath away like a punch in the gut.My wife and I have two young boys and are in the middle of navigating the complicated world of grade school. We're constantly left wondering to each other why various parents we know even decided to have children at all for as little as they seem to enjoy them or want to spend any time with them. They act like kids were foisted on them and their job is to raise them into adults as quickly as possible so that they don't have to spend their time on the menial tasks that come with raising young children.That same question -- why do people keep bringing children into this world when they can't or won't take care of them? -- is the central one at the heart of \"Capernaum,\" and it's asked not by another parent, but by a little boy who's old and wise beyond his years and is fed up with his parents and the environment they've created for him and his siblings. The young actor who plays the little boy is astonishing -- I can't remember a movie in recent memory that features such a young actor who so ably carries an entire film. And the film itself is amazing in the way that it pulls forth from the viewer equal parts sadness and rage on the little boy's behalf without resorting to cheap melodramatics or editorials. The final shot of the film had me smiling and tearing up at the same time, and it's one that I will likely remember for a long time.Nominated for Best Foreign Language Film at the 2018 Academy Awards.Grade: A+"
    },
    {
      "username": "wisDOM87",
      "userUrl": "https://www.imdb.com/user/ur1484694",
      "reviewLink": "https://www.imdb.com/review/rw5653723",
      "warningSpoilers": false,
      "date": "18 April 2020",
      "rate": "9",
      "helpful": "34 out of 42 found this helpful.",
      "title": "A film which dares to ask: if you live in poverty, is it moral to have children?",
      "content": "It's the missing question in the often heated debates about child poverty - I hear it all the time in my own country (UK) - has it risen? Should the government be doing more to help? How can a developed country tolerate children growing up in squalor? The question that is never asked, that is in fact completely taboo to even suggest, is why are people living in poverty having children? And is that moral?It is the question asked by Zain, the protagonist of this superb film, who decides to sue his parents for having him. Having endured a lifetime of neglect, abuse and poverty he thinks no, and asks the court to prevent his parents from having anymore children.That sets the film rolling, the vast majority of which takes place in flashback as we see how Zain ended up in court. Along the way we see the grim reality of life in the slums of Beirut, as Zain eventually decides to run away after his parents sell off his older (11 year old) sister in marriage to their landlord. He ends up living with an undocumented Ethiopian migrant who lives in a shack with her baby, and Zain ends up looking after the child while the mother works. This provides a counterpoint in many ways to the earlier scenes, as the threesome establish something akin to the warm loving home Zain had never known. But yet again, the films forces us to ask - why has this woman had a child? Though employed, she lives in squalor, and as an illegal migrant her child will never be able to get an education, as a local people trafficker trying to persuade her to sell the child reminds her. Is this moral? Does her right to have a child trump that of the child's right for a decent start in life?The films develops from there, though I cannot reveal anymore without spoiling the final act. Though this isn't really a plot-driven film per se, more a slice-of-life look at Zain and how he deals with the situations life throws at him. This film reminded me very much of 'Salaam Bombay', Mira Nair's 1987 film which deals with street children in Mumbai.It's a brave film and the only other film I can think of which tackles this issue is Ken Loach's 'Ladybird Ladybird', in which an impoverished woman with a chaotic home-life repeatedly gets pregnant. There I think Loach approached his protagonist from a more sympathetic perspective, seeing her as a victim of an unfair economic system and social forces beyond her control. Though I may be misreading her intention, Nadine Labaki takes this further and asks - is it basically selfish for people in these circumstances to have children?Personally speaking - should the government (whether in rich or poor countries) be doing more to alleviate poverty? Yes. Is the economic system both within and between states currently too unequal? Yes. If you are stuck in poverty, dealing with poor mental health, drug addiction, illiteracy, malnutrition, slum-living condition - that sucks, and is unfair. But one thing you should not be doing is bringing children into that situation and thereby perpetuating the cycle of misery. Yes, some children rise above their circumstances, but the vast majority don't, and are thereby condemned to a miserable life through no fault of their own. It's the height of selfishness. This is the provocative question Labaki and Zain pose in this engrossing film."
    },
    {
      "username": "ibrahim-elzein-20189",
      "userUrl": "https://www.imdb.com/user/ur66041420",
      "reviewLink": "https://www.imdb.com/review/rw4337227",
      "warningSpoilers": false,
      "date": "13 September 2018",
      "rate": "10",
      "helpful": "269 out of 307 found this helpful.",
      "title": "It's not a movie! It's a Masterpiece!",
      "content": "This is what you call art. This is not just a movie, this is a story of the hardships of life told from the eyes of a beautiful boy. Nadine Labaki out did herself by portraying the reality that most countries are going through in this time and age.Do not believe the negative reviews. This is not at all about refugees, they do not even cover this topic in the movie. This is about survival in the toughest and most heartbreaking of situations.This movie should be on everybody's watch list. It is tough at times, but that's life these days.Watch it for the sake of the children like Zain."
    },
    {
      "username": "karamcaline",
      "userUrl": "https://www.imdb.com/user/ur35131340",
      "reviewLink": "https://www.imdb.com/review/rw4352154",
      "warningSpoilers": false,
      "date": "21 September 2018",
      "rate": "9",
      "helpful": "242 out of 285 found this helpful.",
      "title": "!",
      "content": "To all the people who said this is a shameful representations of Syrians, you would know if you paid attention to the movie that the boy snd his family are actually Lebanese. Stop trying to bring attention to issues that are not even there in the first place. The movie is beautifully filmed and Labaki managed to capture so many issues present in our society (I say this as a Lebanese myself) in such a brilliant way."
    },
    {
      "username": "georges-nahas",
      "userUrl": "https://www.imdb.com/user/ur21182783",
      "reviewLink": "https://www.imdb.com/review/rw4353512",
      "warningSpoilers": false,
      "date": "22 September 2018",
      "rate": "9",
      "helpful": "69 out of 96 found this helpful.",
      "title": "Nadine Labaki's Chef d'Oeuvre!",
      "content": "Capharnaum is the new precious gift to Lebanese cinema. Directed by Nadine Labaki and written by Labaki, Joelle Keserwani, Jihad Hojeily and Georges Khabbaz the movie follows the journey and the misery of a boy called Zain that led him to sue his parents for giving him life! The movie took years to finish with a total of 500 hours of rushes filmed! Shot in a \"Cinema Realité\" style without any professional actors and with a raw cinematography you're going to witness the dark side of the country, the unacceptable neighborhoods, the unfair life that poor children are facing. Everyone is absolutely well casted! Zain was the ultimate discovery a super talented boy, the Ethiopian maid was great also and even the real retired judge did a good job. Each actor is really telling his own personal story so you will arrive at a point where you couldn't differentiate if you're watching cinema, a written script or even a documentary. Wonderful job from Labaki and well deserved Jury Prize at Cannes! Thumbs up also to Khaled Mouzanar for giving us another remarkable score. The movie is nothing less than heartbreaking. As Truffaut freezed his last scene back in 1959 in \"The 400 Blows\" giving us some hope, the last shot of Capernaum will speak a lot...!"
    },
    {
      "username": "JohnDeSando",
      "userUrl": "https://www.imdb.com/user/ur1391596",
      "reviewLink": "https://www.imdb.com/review/rw4671868",
      "warningSpoilers": false,
      "date": "18 February 2019",
      "rate": "",
      "helpful": "17 out of 27 found this helpful.",
      "title": "This great film should give Roma and Shoplifters the jitters.",
      "content": "Travel the slums of Beirut with 12-year Zain (Zain Al Rafeea), who is suing his parents \"for giving me life.\" Included in his anger are the other children they can't take care of. Capernaum (translated \"chaos\") is a stunning cinematic achievement that will make you forget the splash of Slumdog Millionaire, the grit of City of God, and the unbelievable nature of the law suit.Yet, given that his parents couldn't afford to register his birth and therefore denied him personhood in Lebanon, the suit doesn't seem so odd (\"I need proof that you're a human being,\" declaims an official to Zain). After they sell off his little sister, Sahar, to the grocer for whom Zain makes deliveries, Zain takes off on a picaresque journey that starts at an amusement park-figuratively appropriate.Like Slumdog, non-professional actors from the street in Capernaum lend the realism that De Sica practically patented in his iconic Italian neo-realism. Casting director Jennifer Haddad has done an enviable job drawing in children whose lives have reflected the ones they are playing, e.g., Zain has worked as a delivery boy since he was 10.After meeting Ethiopian immigrant Rahil (Yordanos Shiferaw), Zain takes care of her toddler Yonas (Boluwatife Treasure Bankole-a phenomenal one-year-old child actor) in a loving, protective, and resourceful way as the boy's troll Beirut to such a sweet intent it seems this could not be about a 12-year old child incarcerated for five years for stabbing an adult.Capernaum rightly won the Cannes Jury award and is nominated for a best foreign language Oscar. You will agree to that wisdom when you spend some time in director Nadine Labaki's unforgettable slice of mid-eastern life. Were it not for Netflix's Roma, Capernaum might win that category (Shoplifters, another example of \"poverty porn,\" also occupies that territory).Capernaum's overarching beauty is partly in the cinematography, which careens through the ghetto with such agility as to make the place familiar and charming in its chaos. Left by Yonas's mother, who is foolishly and miserably jailed before she can contact the boys, Zain tenderly takes care of the child, carrying him like a wounded brother in battle in the streets foraging for baby formula and looking for Rahil.Confronting his own mother in court, the handsome Zain has nothing but contempt for her as she sits there pregnant and oblivious to the pain she causes children she can't adequately raise. The suit becomes more a metaphor than a reality given its unlikely success.Throughout, Zain is resourceful and proud, giving back insults like a 30-year old. His acting and most others' are first-rate, astonishing because they are non-professionals. Working with gifted director Nadine Labaki for six months in Beirut shows the importance of location shooting and premier coaching.By the end, a sympathetic audience will forgive the formulaic coincidences and sweet resolutions because the bulk of the film is as real as the world of today's immigrants lining the Mexican border to the US."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw5615035",
      "warningSpoilers": false,
      "date": "6 April 2020",
      "rate": "8",
      "helpful": "10 out of 15 found this helpful.",
      "title": "unrelenting, raw",
      "content": "In Beirut, Zain El Hajj is a 12 year old boy, or 13 at the most. No one knows for sure. He has been sentence to a 5 year prison term for a stabbing. He hates his life and wishes to sue his parents for being born. The movie follows Zain in the months before his arrest. He's a hustler, making money any way possible, for the family. Life is hard and he runs away.This movie is visceral giving a sense of life from the street level or from the gutter. It is unrelenting which can get tough. Some viewers can break under the deluge of indignities. It is a hammer that does not stop. It is raw and unforgiving. It can be tiring but worth the watch."
    },
    {
      "username": "CinemaClown",
      "userUrl": "https://www.imdb.com/user/ur20018357",
      "reviewLink": "https://www.imdb.com/review/rw4692500",
      "warningSpoilers": false,
      "date": "1 March 2019",
      "rate": "",
      "helpful": "10 out of 15 found this helpful.",
      "title": "A Masterwork of Social-Realism",
      "content": "A powerfully compelling, hard-hitting & thought-provoking portrait of poverty, neglect, child abuse & desperation that also ruminates on immigration crisis & refugee situation, Capernaum (also known as Capharnaüm) is an endlessly gripping, thoroughly captivating & emotionally engrossing Lebanese drama that's sincere in its approach, compassionate in its treatment & downright effective in its execution. An unforgettable & heartbreaking slice of social-realism that's bolstered by the most memorable performance of 2018, Capernaum is one of last year's finest offerings and certainly the strongest of all the films that were nominated for Best Foreign Language Film Oscar at the recently concluded Academy Awards."
    },
    {
      "username": "jackjackjackjack-69282",
      "userUrl": "https://www.imdb.com/user/ur89410916",
      "reviewLink": "https://www.imdb.com/review/rw4214543",
      "warningSpoilers": false,
      "date": "24 June 2018",
      "rate": "10",
      "helpful": "189 out of 235 found this helpful.",
      "title": "Carefully handcrafted movie with deeply touching story!",
      "content": "Labaki excels in creating a masterpiece that should harvest as many awards as it can, and hopefully the Oscar. It is a heart breaking story with amazing protagonists performance. No one can expects an amazing acting coming from a child and a toddler of such ages! Will Zein be nominated for an Oscar? No one can deny that he deserves it. Labaki directed a marvelous film revealing a great pure talent.Seeing this many fake reviews here with 1 star rating reveals that these \"reviewers\" are manipulating the overall rating of the movie with an unfair score. Anyone who actually watched the movie will give it an above than average rating no matter his taste."
    },
    {
      "username": "salahdeanmoussalli",
      "userUrl": "https://www.imdb.com/user/ur93570256",
      "reviewLink": "https://www.imdb.com/review/rw4382065",
      "warningSpoilers": false,
      "date": "7 October 2018",
      "rate": "10",
      "helpful": "137 out of 168 found this helpful.",
      "title": "Moving touching human film",
      "content": "It's almost like documentary, real honest raw emotions of unfortunate forgotten children in the world in any country with homeless or refugee kids"
    },
    {
      "username": "jmholmes-73727",
      "userUrl": "https://www.imdb.com/user/ur93321019",
      "reviewLink": "https://www.imdb.com/review/rw4782488",
      "warningSpoilers": false,
      "date": "15 April 2019",
      "rate": "10",
      "helpful": "17 out of 26 found this helpful.",
      "title": "IMPOSSIBLE TO OVERPRAISE, LAST YEAR'S BEST (IN ANY LANGUAGE!)",
      "content": "Two minutes into this movie you start worrying about this little boy, and two hours later you realize it hasn't let up one bit in intensity. The camera explores a city most of us are thankful we do not have to deal with - and by forcing us to do exactly that: deal with it - if only cinematically, it opens us up to great sympathy and understanding of so many people living on the brink of total hopelessness. It must be something like the effect Rosellini's Italian neo-realism films had on European audiences after WW2, this feeling that we are seeing something filmed on the actual streets and in the actual homes of citizens under the great stress of living in a world of deprivation, where everything is broken, and deliverance is nowhere in sight. Much has been written about most of the cast being drawn from the city's streets, and if this is true of the young man who has the lead role of Zain, then we see here the debut of a naturally gifted actor who seems, as they say, destined for stardom. The movie's overt plea for people not to have children until they can provide them with the simplest necessities is perhaps a controversial issue, but it's easy to see the logic behind it. There are many indelible moments in this powerhouse of a movie, the most riveting sequence being the few days Zain spends taking care of a child who is barely 2 yrs. old and needs care much more than the 12 yr. old Zain himself does. How he can dredge up such compassion and care for the baby is a marvel to behold. The camera picks up his generous, selfless nature, reminding us it is his goodness that ends up carrying us to the end, where we finally see a long-awaited hopeful smile brighten his face. Hunt this one down, search high and low, a stunning achievement in world cinema."
    },
    {
      "username": "lea-bou7",
      "userUrl": "https://www.imdb.com/user/ur46651814",
      "reviewLink": "https://www.imdb.com/review/rw4444074",
      "warningSpoilers": false,
      "date": "7 November 2018",
      "rate": "10",
      "helpful": "110 out of 143 found this helpful.",
      "title": "Very powerful movie !",
      "content": "This movie shows a lot of issues that we can find in Lebanon but also in a lot of other countries , it raises awareness of how bad life can get specially to young children . I hope that after watching this movie every single one of us will start to act in order to make this world a better place . Nadine Labaki did an amazing job because she showed the truth in a strong and realistic way . I also want to add that the kid is very talented he played his caracter in such a powerful way we could see pain in his eyes and it touched our heart and soul ! I recommend this movie it's a roller coaster of emotions !!"
    },
    {
      "username": "atractiveeyes",
      "userUrl": "https://www.imdb.com/user/ur55939461",
      "reviewLink": "https://www.imdb.com/review/rw4349972",
      "warningSpoilers": false,
      "date": "20 September 2018",
      "rate": "10",
      "helpful": "24 out of 43 found this helpful.",
      "title": "Touching Masterpiece",
      "content": "A beautiful decent important movie that sheds light on many social issues in a moving heartbreaking painful way. Although it's so sad and makes you cry a lot, it also makes you laugh at some points. Just typical Nadine Labaki style. Everyone needs to see this masterpiece."
    }
  ],
  "errorMessage": ""
}