{
  "imDbId": "tt0035446",
  "title": "To Be or Not to Be",
  "fullTitle": "To Be or Not to Be (1942)",
  "type": "Movie",
  "year": "1942",
  "language": "en",
  "titleInLanguage": "To Be or Not to Be (1942 film)",
  "url": "https://en.wikipedia.org/wiki/To_Be_or_Not_to_Be_(1942_film)",
  "plotShort": {
    "plainText": "To Be or Not to Be is a 1942 American comedy film directed by Ernst Lubitsch, starring Carole Lombard and Jack Benny, and featuring Robert Stack, Felix Bressart, Lionel Atwill, Stanley Ridges and Sig Ruman. The plot concerns a troupe of actors in Nazi-occupied Warsaw who use their abilities at disguise and acting to fool the occupying troops. It was adapted by Lubitsch (uncredited) and Edwin Justus Mayer from the story by Melchior Lengyel. The film was released one month after actress Carole Lombard was killed in an airplane crash. In 1996, it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"\r\nThe title is a reference to the famous \"To be, or not to be\" soliloquy in William Shakespeare's Hamlet.",
    "html": "<p>To Be or Not to Be is a 1942 American comedy film directed by Ernst Lubitsch, starring Carole Lombard and Jack Benny, and featuring Robert Stack, Felix Bressart, Lionel Atwill, Stanley Ridges and Sig Ruman. The plot concerns a troupe of actors in Nazi-occupied Warsaw who use their abilities at disguise and acting to fool the occupying troops. It was adapted by Lubitsch (uncredited) and Edwin Justus Mayer from the story by Melchior Lengyel. The film was released one month after actress Carole Lombard was killed in an airplane crash. In 1996, it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"</p><p>The title is a reference to the famous \"To be, or not to be\" soliloquy in William Shakespeare's Hamlet.</p>"
  },
  "plotFull": {
    "plainText": "To Be or Not to Be is a 1942 American comedy film directed by Ernst Lubitsch, starring Carole Lombard and Jack Benny, and featuring Robert Stack, Felix Bressart, Lionel Atwill, Stanley Ridges and Sig Ruman. The plot concerns a troupe of actors in Nazi-occupied Warsaw who use their abilities at disguise and acting to fool the occupying troops. It was adapted by Lubitsch (uncredited) and Edwin Justus Mayer from the story by Melchior Lengyel. The film was released one month after actress Carole Lombard was killed in an airplane crash. In 1996, it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"\r\nThe title is a reference to the famous \"To be, or not to be\" soliloquy in William Shakespeare's Hamlet.\r\nPlot\r\nThe well-known stars of a Warsaw theater company, including \"ham\" Josef Tura and wife Maria, are rehearsing Gestapo, a satirical play. That night, when the company performs Hamlet, with Josef in the title role, one actor, Bronski, commiserates with colleague Greenberg about being spear carriers. Greenberg, implied to be Jewish, reveals he's always dreamed of playing Shylock in The Merchant of Venice.\r\nMaria receives an admiring letter from Lieutenant Stanislav Sobinski; she invites him to visit her in her dressing room that night when Josef begins his \"To be or not to be...\" speech. Soon, the government issues orders to cancel Gestapo in order to avoid worsening relations with Germany. The following night, Sobinski again walks out during \"To be...\" to meet Maria, infuriating Josef. Sobinski confesses his love to Maria, assuming that she'll leave her husband, and the stage, to be with him. Before Maria can correct him, news breaks out that Germany has invaded Poland. Sobinski leaves to join the Polish division of the Royal Air Force (RAF), and the actors hide as Warsaw is bombed.\r\nSobinski and his fellows meet the Polish resistance leader Professor Siletsky. Siletsky will return to Warsaw soon, and the men give him messages for their loved ones. However, Sobinski becomes suspicious when Siletsky doesn't know of Maria Tura. The Allies realize that Siletsky knows the identity of Polish airmen's relatives, against whom reprisals can be taken should he tell the Nazis. Sobinski flies back to warn Maria; however, Siletsky has Maria brought to him by German soldiers and passes on Sobinski's message to her. He invites Maria to dinner, hoping to recruit her as a Nazi spy. Just before she arrives home, Josef returns and finds Sobinski in his bed. Maria and Sobinski try to figure out what to do about Siletsky, while Josef tries to understand his wife's relationship with the pilot. Josef proclaims he'll kill Siletsky.\r\nA company member in Gestapo disguise summons Siletsky to \"Gestapo headquarters\", the theatre. Josef pretends to be Gestapo Colonel Ehrhardt. Siletsky reveals Sobinski's message for Maria, and that \"To be or not to be\" signals their rendezvous. A surprised Josef uncontrollably reveals himself. Siletsky pulls a gun on him and tries to escape, but is shot and killed, on the theatre's stage, by Sobinski. Josef disguises himself as Siletsky, destroying his extra copy of the information and confronting Maria about her relationship with Sobinski. He meets Ehrhardt's adjutant, Captain Schultz, and is taken to meet him. Josef successfully passes himself off, and names recently executed prisoners as the leaders of the resistance.\r\nLater, Maria meets with Ehrhardt, who informs her that they found Siletsky's corpse in the theatre. Josef, unaware of this, telephones Ehrhardt still masquerading as Siletsky. Ehrhardt decides to expose him as an impostor by leaving him in a room where he finds Siletsky's body. Josef, who has an extra fake beard, shaves off Siletsky's beard and applies the fake beard, and then goads Ehrhardt into pulling it off, convincing him Josef is the real Siletsky. Unaware of Josef's successful scheme, several actors disguised as Gestapo arrive at Maria's request, yank off Josef's fake beard, and pretend to drag him out. Everyone is safe but now cannot leave Poland on the plane Ehrhardt had arranged for Siletsky.\r\nThe Germans stage a show to honor the visiting Hitler. The actors slip into the theater dressed as Germans and hide until Hitler and his entourage take their seats. As the Germans sing the Deutschlandlied, Greenberg suddenly appears and rushes Hitler's box, causing enough distraction to exchange the actors for the real Germans. Acting as the head of Hitler's guard, Josef demands to know what Greenberg wants, giving the actor his chance to deliver Shylock's speech, ending with \"if you wrong us, shall we not revenge?!\" Josef orders Greenberg to be \"taken away\"; all the actors march out, get in Hitler's cars and drive away.\r\nAt her apartment, Maria waits for the company, as they all intend to leave, but Ehrhardt arrives. Bronski enters costumed as Hitler, then walks out speechless, shocked at seeing Ehrhardt trying to seduce Maria—which makes Erhardt believe she's Hitler's mistress. Maria flees; Ehrhardt shoots himself out of shame.\r\nThe actors take off on Hitler's plane. Sobinski flies to Scotland, where the press interviews the actors. Asked what reward Josef would like for saving the underground movement, Maria asserts that he wants to play Hamlet. While performing, Josef is gratified to see Sobinski sitting quietly in the audience at the critical moment of his soliloquy. But as he proceeds, the audience is distracted as a handsome young officer gets up and heads noisily backstage.\r\nCast\r\nCarole Lombard as Maria Tura, a famous Polish actress\r\nJack Benny as Joseph Tura, a famous Polish actor and Maria's husband\r\nRobert Stack as Lt. Stanislav Sobinski, a Polish airman in love with Maria\r\nFelix Bressart as Greenberg, a Jewish actor who plays bit parts and dreams of playing Shylock\r\nLionel Atwill as Rawitch, a ham actor\r\nStanley Ridges as Professor Alexander Siletsky, a Nazi spy pretending to be a Polish resistance worker\r\nSig Ruman as Col. Ehrhardt, the bumbling Gestapo commander in Warsaw\r\nTom Dugan as Bronski, a minor actor who impersonates Hitler\r\nCharles Halton as Dobosh, the producer of the company\r\nGeorge Lynn an actor who masquerades as Col. Ehrhardt's adjutant\r\nHenry Victor as Capt. Schultz, the real adjutant of Col. Ehrhardt\r\nMaude Eburne as Anna, Maria's maid\r\nHalliwell Hobbes as Gen. Armstrong, a British intelligence officer\r\nMiles Mander as Major Cunningham, a British intelligence officer\r\nJames Finlayson as Scottish farmer (uncredited)\r\nOlaf Hytten as Polonius in Warsaw (uncredited)\r\nMaurice Murphy as Polish RAF Pilot (uncredited)\r\nFrank Reicher as Polish Foreign Office official (uncredited)\r\nProduction\r\nLubitsch had never considered anyone other than Jack Benny for the lead role in the film. He had even written the character with Benny in mind. Benny, thrilled that a director of Lubitsch's caliber had been thinking of him while writing it, accepted the role immediately. Benny was in a predicament as, strangely enough, his success in the film version of Charley's Aunt (1941) did not interest anyone in hiring the actor for their films.\r\nFor Benny's costar, the studio and Lubitsch decided on Miriam Hopkins, whose career had been faltering in recent years. The role was designed as a comeback for the veteran actress, but Hopkins and Benny did not get along well, and Hopkins left the production.\r\nLubitsch was left without a leading lady until Carole Lombard, hearing his predicament, asked to be considered. Lombard had never worked with the director and yearned to have an opportunity. Lubitsch agreed and Lombard was cast. The film also provided Lombard with an opportunity to work with friend Robert Stack, whom she had known since he was a teenager. The film was shot at United Artists, which allowed Lombard to say that she had worked at every major studio in Hollywood.\r\nReception\r\nTo Be or Not To Be, now regarded as one of the great films of Lubitsch's, Benny's and Lombard's careers, initially was not well received by the public, many of whom could not understand the notion of making fun out of such a real threat as the Nazis. According to Jack Benny's unfinished memoir, published in 1991, his own father walked out of the theater early in the film, disgusted that his son was in a Nazi uniform, and vowed not to set foot in the theater again. Benny convinced him otherwise, and his father ended up loving the film, and saw it 46 times.\r\nThe same could not be said for all critics. While they generally praised Lombard, some scorned Benny and Lubitsch and found the film to be in bad taste. Bosley Crowther of The New York Times wrote that it was \"hard to imagine how any one can take, without batting an eye, a shattering air raid upon Warsaw right after a sequence of farce or the spectacle of Mr. Benny playing a comedy scene with a Gestapo corpse. Mr. Lubitsch had an odd sense of humor—and a tangled script—when he made this film.\" The Philadelphia Inquirer agreed, calling the film \"a callous, tasteless effort to find fun in the bombing of Warsaw.\" Some critics were especially offended by Colonel Ehrhardt's line: \"Oh, yes I saw him in 'Hamlet' once. What he did to Shakespeare we are now doing to Poland.\"\r\nHowever, other reviews were positive. Variety called it one of Lubitsch's \"best productions in number of years...a solid piece of entertainment.\" Harrison's Reports called it \"An absorbing comedy-drama of war time, expertly directed and acted. The action holds one in tense suspense at all times, and comedy of dialogue as well as of acting keeps one laughing almost constantly.\" John Mosher of The New Yorker also praised the film, writing \"That comedy could be planted in Warsaw at the time of its fall, of its conquest by the Nazis, and not seem too incongruous to be endured is a Lubitsch triumph.\"\r\nIn 1943, the critic Mildred Martin reviewed another of Lubitsch's films in The Philadelphia Inquirer and referred derogatively to his German birth and his comedy about Nazis in Poland. Lubitsch responded by publishing an open letter to the newspaper in which he wrote,\r\nWhat I have satirized in this picture are the Nazis and their ridiculous ideology. I have also satirized the attitude of actors who always remain actors regardless of how dangerous the situation might be, which I believe is a true observation. It can be argued if the tragedy of Poland realistically portrayed as in To Be or Not to Be can be merged with satire. I believe it can be and so do the audience which I observed during a screening of To Be or Not to Be; but this is a matter of debate and everyone is entitled to his point of view, but it is certainly a far cry from the Berlin-born director who finds fun in the bombing of Warsaw.\r\nIn recent times the film has become recognized as a comedy classic. To Be or Not To Be has a 96% approval rating on the review aggregator website Rotten Tomatoes with an average rating of 8.7/10, based on 47 reviews, with the consensus: \"A complex and timely satire with as much darkness as slapstick, Ernst Lubitsch's To Be or Not To Be delicately balances humor and ethics.\" Slovenian cultural critic and philosopher, Slavoj Žižek named it his favourite comedy, in an interview in 2015, where he remarked \"It is madness, you can not do a better comedy I think\".\r\nAwards and honors\r\nTo Be or Not to Be was nominated for one Academy Award: the Best Music, Scoring of a Dramatic or Comedy Picture.\r\nThe film is recognized by American Film Institute in these lists:\r\n2000: AFI's 100 Years...100 Laughs – #49\r\nRemakes\r\nA radio drama adaptation of To Be or Not to Be was produced by the Screen Guild Theatre on January 18, 1943, starring William Powell and Diana Lewis.\r\nThe film was remade by 20th Century Fox under the same name, To Be or Not to Be, in 1983. It was directed by Alan Johnson and starred Mel Brooks and Anne Bancroft.\r\nA stage adaptation was written in German by Juergen Hoffmann in 1988.\r\nA Bollywood version, Maan Gaye Mughal-e-Azam, was released in 2008.\r\nA stage version also titled To Be or Not to Be opened on Broadway in 2008.\r\nA stage adaptation was created in Budapest, Hungary by Marton László, Radnóti Zsuzsa, and Deres Péter in 2011.\r\nA stage adaptation was created in Madrid, Spain by Juan Echanove in 2022.",
    "html": "<p>To Be or Not to Be is a 1942 American comedy film directed by Ernst Lubitsch, starring Carole Lombard and Jack Benny, and featuring Robert Stack, Felix Bressart, Lionel Atwill, Stanley Ridges and Sig Ruman. The plot concerns a troupe of actors in Nazi-occupied Warsaw who use their abilities at disguise and acting to fool the occupying troops. It was adapted by Lubitsch (uncredited) and Edwin Justus Mayer from the story by Melchior Lengyel. The film was released one month after actress Carole Lombard was killed in an airplane crash. In 1996, it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\"</p><p>The title is a reference to the famous \"To be, or not to be\" soliloquy in William Shakespeare's Hamlet.</p><br/><h3>Plot</h3><p>The well-known stars of a Warsaw theater company, including \"ham\" Josef Tura and wife Maria, are rehearsing Gestapo, a satirical play. That night, when the company performs Hamlet, with Josef in the title role, one actor, Bronski, commiserates with colleague Greenberg about being spear carriers. Greenberg, implied to be Jewish, reveals he's always dreamed of playing Shylock in The Merchant of Venice.</p><p>Maria receives an admiring letter from Lieutenant Stanislav Sobinski; she invites him to visit her in her dressing room that night when Josef begins his \"To be or not to be...\" speech. Soon, the government issues orders to cancel Gestapo in order to avoid worsening relations with Germany. The following night, Sobinski again walks out during \"To be...\" to meet Maria, infuriating Josef. Sobinski confesses his love to Maria, assuming that she'll leave her husband, and the stage, to be with him. Before Maria can correct him, news breaks out that Germany has invaded Poland. Sobinski leaves to join the Polish division of the Royal Air Force (RAF), and the actors hide as Warsaw is bombed.</p><p>Sobinski and his fellows meet the Polish resistance leader Professor Siletsky. Siletsky will return to Warsaw soon, and the men give him messages for their loved ones. However, Sobinski becomes suspicious when Siletsky doesn't know of Maria Tura. The Allies realize that Siletsky knows the identity of Polish airmen's relatives, against whom reprisals can be taken should he tell the Nazis. Sobinski flies back to warn Maria; however, Siletsky has Maria brought to him by German soldiers and passes on Sobinski's message to her. He invites Maria to dinner, hoping to recruit her as a Nazi spy. Just before she arrives home, Josef returns and finds Sobinski in his bed. Maria and Sobinski try to figure out what to do about Siletsky, while Josef tries to understand his wife's relationship with the pilot. Josef proclaims he'll kill Siletsky.</p><p>A company member in Gestapo disguise summons Siletsky to \"Gestapo headquarters\", the theatre. Josef pretends to be Gestapo Colonel Ehrhardt. Siletsky reveals Sobinski's message for Maria, and that \"To be or not to be\" signals their rendezvous. A surprised Josef uncontrollably reveals himself. Siletsky pulls a gun on him and tries to escape, but is shot and killed, on the theatre's stage, by Sobinski. Josef disguises himself as Siletsky, destroying his extra copy of the information and confronting Maria about her relationship with Sobinski. He meets Ehrhardt's adjutant, Captain Schultz, and is taken to meet him. Josef successfully passes himself off, and names recently executed prisoners as the leaders of the resistance.</p><p>Later, Maria meets with Ehrhardt, who informs her that they found Siletsky's corpse in the theatre. Josef, unaware of this, telephones Ehrhardt still masquerading as Siletsky. Ehrhardt decides to expose him as an impostor by leaving him in a room where he finds Siletsky's body. Josef, who has an extra fake beard, shaves off Siletsky's beard and applies the fake beard, and then goads Ehrhardt into pulling it off, convincing him Josef is the real Siletsky. Unaware of Josef's successful scheme, several actors disguised as Gestapo arrive at Maria's request, yank off Josef's fake beard, and pretend to drag him out. Everyone is safe but now cannot leave Poland on the plane Ehrhardt had arranged for Siletsky.</p><p>The Germans stage a show to honor the visiting Hitler. The actors slip into the theater dressed as Germans and hide until Hitler and his entourage take their seats. As the Germans sing the Deutschlandlied, Greenberg suddenly appears and rushes Hitler's box, causing enough distraction to exchange the actors for the real Germans. Acting as the head of Hitler's guard, Josef demands to know what Greenberg wants, giving the actor his chance to deliver Shylock's speech, ending with \"if you wrong us, shall we not revenge?!\" Josef orders Greenberg to be \"taken away\"; all the actors march out, get in Hitler's cars and drive away.</p><p>At her apartment, Maria waits for the company, as they all intend to leave, but Ehrhardt arrives. Bronski enters costumed as Hitler, then walks out speechless, shocked at seeing Ehrhardt trying to seduce Maria—which makes Erhardt believe she's Hitler's mistress. Maria flees; Ehrhardt shoots himself out of shame.</p><p>The actors take off on Hitler's plane. Sobinski flies to Scotland, where the press interviews the actors. Asked what reward Josef would like for saving the underground movement, Maria asserts that he wants to play Hamlet. While performing, Josef is gratified to see Sobinski sitting quietly in the audience at the critical moment of his soliloquy. But as he proceeds, the audience is distracted as a handsome young officer gets up and heads noisily backstage.</p><br/><h3>Cast</h3><ul><li>Carole Lombard as Maria Tura, a famous Polish actress</li><li>Jack Benny as Joseph Tura, a famous Polish actor and Maria's husband</li><li>Robert Stack as Lt. Stanislav Sobinski, a Polish airman in love with Maria</li><li>Felix Bressart as Greenberg, a Jewish actor who plays bit parts and dreams of playing Shylock</li><li>Lionel Atwill as Rawitch, a ham actor</li><li>Stanley Ridges as Professor Alexander Siletsky, a Nazi spy pretending to be a Polish resistance worker</li><li>Sig Ruman as Col. Ehrhardt, the bumbling Gestapo commander in Warsaw</li><li>Tom Dugan as Bronski, a minor actor who impersonates Hitler</li><li>Charles Halton as Dobosh, the producer of the company</li><li>George Lynn an actor who masquerades as Col. Ehrhardt's adjutant</li><li>Henry Victor as Capt. Schultz, the real adjutant of Col. Ehrhardt</li><li>Maude Eburne as Anna, Maria's maid</li><li>Halliwell Hobbes as Gen. Armstrong, a British intelligence officer</li><li>Miles Mander as Major Cunningham, a British intelligence officer</li><li>James Finlayson as Scottish farmer (uncredited)</li><li>Olaf Hytten as Polonius in Warsaw (uncredited)</li><li>Maurice Murphy as Polish RAF Pilot (uncredited)</li><li>Frank Reicher as Polish Foreign Office official (uncredited)</li></ul><br/><h3>Production</h3><p>Lubitsch had never considered anyone other than Jack Benny for the lead role in the film. He had even written the character with Benny in mind. Benny, thrilled that a director of Lubitsch's caliber had been thinking of him while writing it, accepted the role immediately. Benny was in a predicament as, strangely enough, his success in the film version of Charley's Aunt (1941) did not interest anyone in hiring the actor for their films.</p><p>For Benny's costar, the studio and Lubitsch decided on Miriam Hopkins, whose career had been faltering in recent years. The role was designed as a comeback for the veteran actress, but Hopkins and Benny did not get along well, and Hopkins left the production.</p><p>Lubitsch was left without a leading lady until Carole Lombard, hearing his predicament, asked to be considered. Lombard had never worked with the director and yearned to have an opportunity. Lubitsch agreed and Lombard was cast. The film also provided Lombard with an opportunity to work with friend Robert Stack, whom she had known since he was a teenager. The film was shot at United Artists, which allowed Lombard to say that she had worked at every major studio in Hollywood.</p><br/><h3>Reception</h3><p>To Be or Not To Be, now regarded as one of the great films of Lubitsch's, Benny's and Lombard's careers, initially was not well received by the public, many of whom could not understand the notion of making fun out of such a real threat as the Nazis. According to Jack Benny's unfinished memoir, published in 1991, his own father walked out of the theater early in the film, disgusted that his son was in a Nazi uniform, and vowed not to set foot in the theater again. Benny convinced him otherwise, and his father ended up loving the film, and saw it 46 times.</p><p>The same could not be said for all critics. While they generally praised Lombard, some scorned Benny and Lubitsch and found the film to be in bad taste. Bosley Crowther of The New York Times wrote that it was \"hard to imagine how any one can take, without batting an eye, a shattering air raid upon Warsaw right after a sequence of farce or the spectacle of Mr. Benny playing a comedy scene with a Gestapo corpse. Mr. Lubitsch had an odd sense of humor—and a tangled script—when he made this film.\" The Philadelphia Inquirer agreed, calling the film \"a callous, tasteless effort to find fun in the bombing of Warsaw.\" Some critics were especially offended by Colonel Ehrhardt's line: \"Oh, yes I saw him in 'Hamlet' once. What he did to Shakespeare we are now doing to Poland.\"</p><p>However, other reviews were positive. Variety called it one of Lubitsch's \"best productions in number of years...a solid piece of entertainment.\" Harrison's Reports called it \"An absorbing comedy-drama of war time, expertly directed and acted. The action holds one in tense suspense at all times, and comedy of dialogue as well as of acting keeps one laughing almost constantly.\" John Mosher of The New Yorker also praised the film, writing \"That comedy could be planted in Warsaw at the time of its fall, of its conquest by the Nazis, and not seem too incongruous to be endured is a Lubitsch triumph.\"</p><p>In 1943, the critic Mildred Martin reviewed another of Lubitsch's films in The Philadelphia Inquirer and referred derogatively to his German birth and his comedy about Nazis in Poland. Lubitsch responded by publishing an open letter to the newspaper in which he wrote,</p><blockquote>What I have satirized in this picture are the Nazis and their ridiculous ideology. I have also satirized the attitude of actors who always remain actors regardless of how dangerous the situation might be, which I believe is a true observation. It can be argued if the tragedy of Poland realistically portrayed as in To Be or Not to Be can be merged with satire. I believe it can be and so do the audience which I observed during a screening of To Be or Not to Be; but this is a matter of debate and everyone is entitled to his point of view, but it is certainly a far cry from the Berlin-born director who finds fun in the bombing of Warsaw.</blockquote><p>In recent times the film has become recognized as a comedy classic. To Be or Not To Be has a 96% approval rating on the review aggregator website Rotten Tomatoes with an average rating of 8.7/10, based on 47 reviews, with the consensus: \"A complex and timely satire with as much darkness as slapstick, Ernst Lubitsch's To Be or Not To Be delicately balances humor and ethics.\" Slovenian cultural critic and philosopher, Slavoj Žižek named it his favourite comedy, in an interview in 2015, where he remarked \"It is madness, you can not do a better comedy I think\".</p><br/><h3>Awards and honors</h3><p>To Be or Not to Be was nominated for one Academy Award: the Best Music, Scoring of a Dramatic or Comedy Picture.</p><p>The film is recognized by American Film Institute in these lists:</p><ul><li>2000: AFI's 100 Years...100 Laughs – #49</li></ul><br/><h3>Remakes</h3><ul><li>A radio drama adaptation of To Be or Not to Be was produced by the Screen Guild Theatre on January 18, 1943, starring William Powell and Diana Lewis.</li><li>The film was remade by 20th Century Fox under the same name, To Be or Not to Be, in 1983. It was directed by Alan Johnson and starred Mel Brooks and Anne Bancroft.</li><li>A stage adaptation was written in German by Juergen Hoffmann in 1988.</li><li>A Bollywood version, Maan Gaye Mughal-e-Azam, was released in 2008.</li><li>A stage version also titled To Be or Not to Be opened on Broadway in 2008.</li><li>A stage adaptation was created in Budapest, Hungary by Marton László, Radnóti Zsuzsa, and Deres Péter in 2011.</li><li>A stage adaptation was created in Madrid, Spain by Juan Echanove in 2022.</li></ul><br/>"
  },
  "errorMessage": ""
}