{
  "imDbId": "tt0036868",
  "title": "The Best Years of Our Lives",
  "fullTitle": "The Best Years of Our Lives (1946)",
  "type": "Movie",
  "year": "1946",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/the-best-years-of-our-lives-1946",
      "rate": "100",
      "content": "It feels surprisingly modern: lean, direct, honest about issues that Hollywood then studiously avoided. After the war years of patriotism and heroism in the movies, this was a sobering look at the problems veterans faced when they returned home."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9506E1DC1E38E53ABC4A51DFB767838D659EDE",
      "rate": "100",
      "content": "It is seldom that there comes a motion picture which can be wholly and enthusiastically endorsed not only as superlative entertainment but as food for quiet and humanizing thought."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1946/film/reviews/best-years-of-our-lives-1200414825/",
      "rate": "100",
      "content": "One of the best pictures of our lives."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/best-years-of-our-lives-the",
      "rate": "100",
      "content": "The Best Years of Our Lives runs almost three hours, but it doesn't seem nearly that long. The film is so involving that there's no temptation to glance at a watch, nor a need to get a snack or take a bathroom break. In fact, when it's over, there's almost a sense of disappointment that there aren't a few scenes left hiding on the other side of the closing credits. The feeling of warmth and satisfaction that accompanies the conclusion is the hallmark of a great drama - a distinction that anyone who has seen The Best Years of Our Lives will apply to this landmark production."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/the-best-years-of-our-lives/review/2030114354/",
      "rate": "100",
      "content": "The best coming home movie ever made. \"I don't care if it doesn't make a nickel,\" Sam Goldwyn reportedly said of THE BEST YEARS, \"I just want every man, woman, and child in America to see it.\""
    },
    {
      "publisher": "The New Yorker",
      "author": "Richard Brody",
      "link": "https://www.newyorker.com/culture/richard-brody/dvr-alert-the-best-years-of-our-lives",
      "rate": "100",
      "content": "It’s not the whole story, of course; it’s resolutely on the side of decorum and falls far short of the inner and outer postwar apocalypses envisioned in film noir. But the intensity of its liberal romanticism is utterly gripping."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://time.com/vault/issue/1946-11-25/page/105/",
      "rate": "90",
      "content": "Unlike most sure-fire movies, it was put together with good taste, honesty, wit—and even a strong suggestion of guts."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Eric Henderson",
      "link": "",
      "rate": "88",
      "content": "If The Best Years of Our Lives emerges as a more contemporary-seeing film than almost anything else to which its ingredients could compare, it’s because of how it wrestles with the burden of patriotism. The nation’s problems are right there in plain sight, just as clear as cinematographer Gregg Toland’s typically precise deep-focus shots."
    },
    {
      "publisher": "Empire",
      "author": "David Parkinson",
      "link": "https://www.empireonline.com/movies/reviews/best-years-lives-review/",
      "rate": "80",
      "content": "This is intelligent, admirably unsentimental and utterly involving for its full three-hour running time."
    },
    {
      "publisher": "Time Out",
      "author": "Keith Uhlich",
      "link": "",
      "rate": "80",
      "content": "The movie does have an air of cautiousness about it, trying so hard to be a respectful, definitive statement on WWII (and often succeeding) that it sometimes feels cadaverous."
    }
  ],
  "errorMessage": ""
}