{
  "imDbId": "tt0036868",
  "title": "The Best Years of Our Lives",
  "fullTitle": "The Best Years of Our Lives (1946)",
  "type": "Movie",
  "year": "1946",
  "language": "en",
  "titleInLanguage": "The Best Years of Our Lives",
  "url": "https://en.wikipedia.org/wiki/The_Best_Years_of_Our_Lives",
  "plotShort": {
    "plainText": "The Best Years of Our Lives (also known as Glory for Me and Home Again) is a 1946 American epic drama film directed by William Wyler and starring Myrna Loy, Fredric March, Dana Andrews, Teresa Wright, Virginia Mayo and Harold Russell. The film is about three United States servicemen re-adjusting to societal changes and civilian life after coming home from World War II. The three men come from different services with different ranks that do not correspond with their civilian social class backgrounds.\r\nThe film was a critical and commercial success. It won seven Academy Awards: Best Picture, Best Director (William Wyler), Best Actor (Fredric March), Best Supporting Actor (Harold Russell), Best Film Editing (Daniel Mandell), Best Adapted Screenplay (Robert E. Sherwood), and Best Original Score (Hugo Friedhofer).\r\nIn addition, Russell was also awarded an honorary Academy Award, the only time in history that two such awards were given for a single performance.\r\nIt was the highest-grossing film in both the United States and United Kingdom since the release of Gone with the Wind, and is the sixth most-attended film of all time in the United Kingdom, with over 20 million tickets sold.\r\nIn 1989, The Best Years of Our Lives was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".",
    "html": "<p>The Best Years of Our Lives (also known as Glory for Me and Home Again) is a 1946 American epic drama film directed by William Wyler and starring Myrna Loy, Fredric March, Dana Andrews, Teresa Wright, Virginia Mayo and Harold Russell. The film is about three United States servicemen re-adjusting to societal changes and civilian life after coming home from World War II. The three men come from different services with different ranks that do not correspond with their civilian social class backgrounds.</p><p>The film was a critical and commercial success. It won seven Academy Awards: Best Picture, Best Director (William Wyler), Best Actor (Fredric March), Best Supporting Actor (Harold Russell), Best Film Editing (Daniel Mandell), Best Adapted Screenplay (Robert E. Sherwood), and Best Original Score (Hugo Friedhofer).</p><p>In addition, Russell was also awarded an honorary Academy Award, the only time in history that two such awards were given for a single performance.</p><p>It was the highest-grossing film in both the United States and United Kingdom since the release of Gone with the Wind, and is the sixth most-attended film of all time in the United Kingdom, with over 20 million tickets sold.</p><p>In 1989, The Best Years of Our Lives was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "The Best Years of Our Lives (also known as Glory for Me and Home Again) is a 1946 American epic drama film directed by William Wyler and starring Myrna Loy, Fredric March, Dana Andrews, Teresa Wright, Virginia Mayo and Harold Russell. The film is about three United States servicemen re-adjusting to societal changes and civilian life after coming home from World War II. The three men come from different services with different ranks that do not correspond with their civilian social class backgrounds.\r\nThe film was a critical and commercial success. It won seven Academy Awards: Best Picture, Best Director (William Wyler), Best Actor (Fredric March), Best Supporting Actor (Harold Russell), Best Film Editing (Daniel Mandell), Best Adapted Screenplay (Robert E. Sherwood), and Best Original Score (Hugo Friedhofer).\r\nIn addition, Russell was also awarded an honorary Academy Award, the only time in history that two such awards were given for a single performance.\r\nIt was the highest-grossing film in both the United States and United Kingdom since the release of Gone with the Wind, and is the sixth most-attended film of all time in the United Kingdom, with over 20 million tickets sold.\r\nIn 1989, The Best Years of Our Lives was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".\r\nPlot\r\nAt the end of World War II, three veterans - (USAAF bombardier captain Fred Derry, U.S. Navy petty officer Homer Parrish, and U.S. Army sergeant Al Stephenson) - meet on a flight to their midwestern hometown of Boone City.\r\nBefore the war, Fred was a drug store soda jerk who lived with his parents in the poorer part of town. Shortly before shipping out, Fred married Marie after a whirlwind romance; she has since been working in a nightclub, and enjoyed the extra income that Fred's military pay afforded her, without much thought to her husband. Al worked as an officer at the local bank and lived in an upscale apartment with his wife, Millie, and their children, Peggy and Rob. Homer was a star high school athlete living with his middle-class parents and younger sister. Homer had also been dating his next-door neighbor, Wilma, committed to marrying upon his return.\r\nEach man faces challenges integrating back into civilian life. Homer lost both hands in the war and though he has become quite functional in the use of his mechanical hooks, he cannot believe that Wilma will still want to marry him. Al, tired and jaded from the war, returns to the bank and is given a promotion, but wrestles with alcohol. Though highly decorated, Fred suffers from PTSD flashbacks by night, is unable to find a better job than soda jerk and returns to the same drug store.\r\nFred and Peggy develop an attraction for each other, which ultimately puts the married Fred at odds with Al. Although proficient in managing the challenges of his disability, Homer is frustrated by his loss of independence and adjusting to his relationship with Wilma, who loyally remains by his side. Al continues to struggle with re-entry into normal life. Widely respected by the bank's senior management for his past business acumen, Al approves an unsecured loan to a farmer and fellow veteran. His behavior is made worse by his excessive drinking.\r\nAll three characters' individual stories come to a head. When Homer visits Fred at the drug store, another customer criticizes U.S. involvement in the war and tells Homer his injuries were not necessary. Homer responds in anger, and Fred intervenes on Homer's behalf, punching the customer and then being fired for it. Meanwhile, Fred's wife, Marie, frustrated with his lack of financial success and missing her past nightlife, tells Fred she is getting a divorce. Bitter, and seeing no future in Boone City, particularly with Al telling Fred to stay away from Peggy, Fred decides to pack up and catch the next plane out. While waiting at the airport, Fred walks into an aircraft boneyard, where he climbs into one of the decommissioned B-17 bombers. Sitting in the bombardier's seat, Fred has another flashback. He is roused out of his stressful memories by a work crew foreman, who informs him that the planes are being demolished for use in the growing pre-fab housing industry. Fred asks him if they need any help in the budding business, and is hired.\r\nAl, Millie, and Peggy attend Homer's and Wilma's wedding, where Fred is best man. Now divorced, Fred reunites with Peggy after the ceremony. Fred expresses his love but tells her things may be financially difficult if she stays with him. Peggy's smile makes it clear she will remain committed to Fred.\r\nCast\r\nMyrna Loy as Milly Stephenson\r\nFredric March as Technical Sergeant Al Stephenson\r\nDana Andrews as Captain Fred Derry\r\nTeresa Wright as Peggy Stephenson\r\nVirginia Mayo as Marie Derry\r\nCathy O'Donnell as Wilma Cameron\r\nHoagy Carmichael as Butch Engle, Homer's uncle\r\nHarold Russell as Petty Officer 2nd Class Homer Parrish\r\nGladys George as Hortense Derry\r\nRoman Bohnen as Pat Derry\r\nRay Collins as Mr. Milton\r\nMinna Gombell as Mrs. Parrish\r\nWalter Baldwin as Mr. Parrish\r\nSteve Cochran as Cliff\r\nDorothy Adams as Mrs. Cameron\r\nDon Beddoe as Mr. Cameron\r\nMarlene Aames as Luella Parrish\r\nCharles Halton as Prew\r\nRay Teal as Mr. Mollett\r\nHowland Chamberlain as Thorpe\r\nDean White as Novak\r\nErskine Sanford as Bullard\r\nMichael Hall as Rob Stephenson\r\nVictor Cutler as Woody Merrill\r\nCasting brought together established stars as well as character actors and relative unknowns. The jazz drummer Gene Krupa was seen in archival footage, while Tennessee Ernie Ford, later a television star, appeared as an uncredited \"hillbilly singer\" (in the first of his only three film appearances). Blake Edwards, later a film producer and director, appeared fleetingly as an uncredited \"Corporal\". Wyler's daughters, Catherine and Judy, were cast as uncredited customers seen in the drug store where Fred Derry works. Sean Penn's father, Leo, played the uncredited part of the soldier working as the scheduling clerk in the Air Transport Command Office at the beginning of the film.\r\nTeresa Wright was only thirteen years younger than her on-screen mother, played by Myrna Loy. Michael Hall (1926-2020), at the time of his death the last surviving credited cast member, with his role as Fredric March's on-screen son, is absent after the first third of the film. The reason was that Hall's contract with Goldwyn ended during filming, but the producer was reluctant to pay extra money to rehire him.\r\nProduction\r\nSamuel Goldwyn was inspired to produce a film about veterans after reading an August 7, 1944, article in Time about the difficulties experienced by men returning to civilian life. Goldwyn hired former war correspondent MacKinlay Kantor to write a screenplay. His work was first published as a novella, Glory for Me, which Kantor wrote in blank verse. Robert E. Sherwood then adapted the novella as a screenplay.\r\nDirector Wyler had flown combat missions over Europe in filming Memphis Belle (1944), and worked hard to get accurate depictions of the combat veterans he had encountered. Wyler changed the original casting, which had featured a veteran suffering from post-traumatic stress disorder, and sought out Harold Russell, a non-actor, to take on the exacting role of Homer Parrish.\r\nFor The Best Years of Our Lives, he asked the principal actors to purchase their own clothes, in order to connect with daily life and produce an authentic feeling. Other Wyler touches included constructing life-size sets, which went against the standard larger sets that were more suited to camera positions. The impact for the audience was immediate, as each scene played out in a realistic, natural way.\r\nRecounting the interrelated story of three veterans right after the end of World War II, The Best Years of Our Lives began filming just over seven months after the war's end, starting on April 15, 1946 at a variety of locations, including the Los Angeles County Arboretum and Botanic Garden, Ontario International Airport in Ontario, California, Raleigh Studios in Hollywood, and the Samuel Goldwyn/Warner Hollywood Studios.\r\nIn The Best Years of Our Lives cinematographer Gregg Toland used deep focus photography, in which objects both close to and distant from the camera are in sharp focus. For the passage of Fred Derry's reliving a combat mission while sitting in the remains of a former bomber, Wyler used \"zoom\" effects to simulate Derry's subjective state.\r\nThe fictional Boone City was patterned after Cincinnati, Ohio. The \"Jackson High\" football stadium seen early in aerial footage of the bomber flying over the Boone City, is Corcoran Stadium located at Xavier University in Cincinnati. A few seconds later Walnut Hills High School with its dome and football field can be seen along with the downtown Cincinnati skyline (Carew Tower and Fourth and Vine Tower) in the background.\r\nAfter the war, the combat aircraft featured in the film were being destroyed and disassembled for reuse as scrap material. The scene of Derry's walking among aircraft ruins was filmed at the Ontario Army Air Field in Ontario, California. The former training facility had been converted into a scrap yard, housing nearly 2,000 former combat aircraft in various states of disassembly and reclamation.\r\nReception\r\nCritical response\r\nUpon its release, The Best Years of Our Lives received extremely positive reviews from critics. Shortly after its premiere at the Astor Theater, New York, Bosley Crowther, film critic for The New York Times, hailed the film as a masterpiece. He wrote,\r\nIt is seldom that there comes a motion picture which can be wholly and enthusiastically endorsed not only as superlative entertainment, but as food for quiet and humanizing thought... In working out their solutions, Mr. Sherwood and Mr. Wyler have achieved some of the most beautiful and inspiring demonstrations of human fortitude that we have had in films.\" He also said the ensemble casting gave the \"'best' performance in this best film this year from Hollywood\".\r\nFrench film critic André Bazin used examples of Toland's and Wyler's deep-focus visual style to illuminate his theory of realism in film—going into detail about the scene in which Fred uses the phone booth in the far background while Homer and Butch play piano in the foreground. Bazin explains how deep focus functions in this scene:\r\nThe action in the foreground is secondary, although interesting and peculiar enough to require our keen attention since it occupies a privileged place and surface on the screen. Paradoxically, the true action, the one that constitutes at this precise moment a turning point in the story, develops almost clandestinely in a tiny rectangle at the back of the room—in the left corner of the screen.... Thus the viewer is induced actively to participate in the drama planned by the director.\r\nProfessor and author Gabriel Miller discusses briefly the use of deep-focus in both the bar scene and the wedding scene at the end of the picture in an article written for the National Film Preservation Board.\r\nSeveral decades later, film critic David Thomson offered tempered praise: \"I would concede that Best Years is decent and humane... acutely observed, despite being so meticulous a package. It would have taken uncommon genius and daring at that time to sneak a view of an untidy or unresolved America past Goldwyn or the public.\"\r\nThe Best Years of Our Lives has a 97% \"Fresh\" rating at Rotten Tomatoes, with an average rating of 8.9/10, based on 96 reviews. The critical consensus states: \"An engrossing look at the triumphs and travails of war veterans, The Best Years of Our Lives is concerned specifically with the aftermath of World War II, but its messages speak to the overall American experience.\" Chicago Sun-Times film critic Roger Ebert put the film on his \"Great Movies\" list in 2007, calling it \"... modern, lean, and honest\".\r\nPopular response\r\nThe Best Years of Our Lives was a massive commercial success, earning an estimated $10.2 million at the U.S. and Canadian box office during its initial theatrical run, not only making it the highest-grossing film of 1946, but also the highest-grossing film of the 1940s decade. It benefited from much larger admission prices than the majority of films released that year which accounted for almost 70% of its earnings. When box office figures are adjusted for inflation, it remains one of the top 100 grossing films in U.S. history.\r\nAmong films released before 1950, only Gone With the Wind, The Bells of St. Mary's, The Big Parade and four Disney titles have done more total business, in part due to later re-releases. (Reliable box office figures for certain early films such as The Birth of a Nation and Charlie Chaplin's comedies are unavailable.)\r\nHowever, because of the distribution arrangement RKO had with Goldwyn, RKO recorded a loss of $660,000 on the film.\r\nRussell Academy Award\r\nDespite his Oscar-nominated performance, Harold Russell was not a professional actor. As the Academy Board of Governors considered him a long shot to win, they gave him an Academy Honorary Award \"for bringing hope and courage to his fellow veterans through his appearance\". When Russell in fact won Best Supporting Actor, there was an enthusiastic response. He is the only actor to have received two Academy Awards for the same performance. In 1992, Russell sold his Best Supporting Actor statuette at auction for $60,500 ($126,200 today), to pay his wife's medical bills.\r\nIn 1989, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nAmerican Film Institute included the film as #37 in its 1998 AFI's 100 Years...100 Movies, as #11 in its 2006 AFI's 100 Years...100 Cheers, and as #37 in its 2007 AFI's 100 Years...100 Movies (10th Anniversary Edition).\r\nRadio adaptations\r\nIn 1947 and 1949, there were four separate half-hour adaptations from Hedda Hopper's This Is Hollywood, The Screen Guild Theater (two) and Screen Directors Playhouse. In all four cases, various actors reprised their film roles.",
    "html": "<p>The Best Years of Our Lives (also known as Glory for Me and Home Again) is a 1946 American epic drama film directed by William Wyler and starring Myrna Loy, Fredric March, Dana Andrews, Teresa Wright, Virginia Mayo and Harold Russell. The film is about three United States servicemen re-adjusting to societal changes and civilian life after coming home from World War II. The three men come from different services with different ranks that do not correspond with their civilian social class backgrounds.</p><p>The film was a critical and commercial success. It won seven Academy Awards: Best Picture, Best Director (William Wyler), Best Actor (Fredric March), Best Supporting Actor (Harold Russell), Best Film Editing (Daniel Mandell), Best Adapted Screenplay (Robert E. Sherwood), and Best Original Score (Hugo Friedhofer).</p><p>In addition, Russell was also awarded an honorary Academy Award, the only time in history that two such awards were given for a single performance.</p><p>It was the highest-grossing film in both the United States and United Kingdom since the release of Gone with the Wind, and is the sixth most-attended film of all time in the United Kingdom, with over 20 million tickets sold.</p><p>In 1989, The Best Years of Our Lives was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".</p><br/><h3>Plot</h3><p>At the end of World War II, three veterans - (USAAF bombardier captain Fred Derry, U.S. Navy petty officer Homer Parrish, and U.S. Army sergeant Al Stephenson) - meet on a flight to their midwestern hometown of Boone City.</p><p>Before the war, Fred was a drug store soda jerk who lived with his parents in the poorer part of town. Shortly before shipping out, Fred married Marie after a whirlwind romance; she has since been working in a nightclub, and enjoyed the extra income that Fred's military pay afforded her, without much thought to her husband. Al worked as an officer at the local bank and lived in an upscale apartment with his wife, Millie, and their children, Peggy and Rob. Homer was a star high school athlete living with his middle-class parents and younger sister. Homer had also been dating his next-door neighbor, Wilma, committed to marrying upon his return.</p><p>Each man faces challenges integrating back into civilian life. Homer lost both hands in the war and though he has become quite functional in the use of his mechanical hooks, he cannot believe that Wilma will still want to marry him. Al, tired and jaded from the war, returns to the bank and is given a promotion, but wrestles with alcohol. Though highly decorated, Fred suffers from PTSD flashbacks by night, is unable to find a better job than soda jerk and returns to the same drug store.</p><p>Fred and Peggy develop an attraction for each other, which ultimately puts the married Fred at odds with Al. Although proficient in managing the challenges of his disability, Homer is frustrated by his loss of independence and adjusting to his relationship with Wilma, who loyally remains by his side. Al continues to struggle with re-entry into normal life. Widely respected by the bank's senior management for his past business acumen, Al approves an unsecured loan to a farmer and fellow veteran. His behavior is made worse by his excessive drinking.</p><p>All three characters' individual stories come to a head. When Homer visits Fred at the drug store, another customer criticizes U.S. involvement in the war and tells Homer his injuries were not necessary. Homer responds in anger, and Fred intervenes on Homer's behalf, punching the customer and then being fired for it. Meanwhile, Fred's wife, Marie, frustrated with his lack of financial success and missing her past nightlife, tells Fred she is getting a divorce. Bitter, and seeing no future in Boone City, particularly with Al telling Fred to stay away from Peggy, Fred decides to pack up and catch the next plane out. While waiting at the airport, Fred walks into an aircraft boneyard, where he climbs into one of the decommissioned B-17 bombers. Sitting in the bombardier's seat, Fred has another flashback. He is roused out of his stressful memories by a work crew foreman, who informs him that the planes are being demolished for use in the growing pre-fab housing industry. Fred asks him if they need any help in the budding business, and is hired.</p><p>Al, Millie, and Peggy attend Homer's and Wilma's wedding, where Fred is best man. Now divorced, Fred reunites with Peggy after the ceremony. Fred expresses his love but tells her things may be financially difficult if she stays with him. Peggy's smile makes it clear she will remain committed to Fred.</p><br/><h3>Cast</h3><ul><li>Myrna Loy as Milly Stephenson</li><li>Fredric March as Technical Sergeant Al Stephenson</li><li>Dana Andrews as Captain Fred Derry</li><li>Teresa Wright as Peggy Stephenson</li><li>Virginia Mayo as Marie Derry</li><li>Cathy O'Donnell as Wilma Cameron</li><li>Hoagy Carmichael as Butch Engle, Homer's uncle</li><li>Harold Russell as Petty Officer 2nd Class Homer Parrish</li><li>Gladys George as Hortense Derry</li><li>Roman Bohnen as Pat Derry</li><li>Ray Collins as Mr. Milton</li><li>Minna Gombell as Mrs. Parrish</li><li>Walter Baldwin as Mr. Parrish</li><li>Steve Cochran as Cliff</li><li>Dorothy Adams as Mrs. Cameron</li><li>Don Beddoe as Mr. Cameron</li><li>Marlene Aames as Luella Parrish</li><li>Charles Halton as Prew</li><li>Ray Teal as Mr. Mollett</li><li>Howland Chamberlain as Thorpe</li><li>Dean White as Novak</li><li>Erskine Sanford as Bullard</li><li>Michael Hall as Rob Stephenson</li><li>Victor Cutler as Woody Merrill</li></ul><p>Casting brought together established stars as well as character actors and relative unknowns. The jazz drummer Gene Krupa was seen in archival footage, while Tennessee Ernie Ford, later a television star, appeared as an uncredited \"hillbilly singer\" (in the first of his only three film appearances). Blake Edwards, later a film producer and director, appeared fleetingly as an uncredited \"Corporal\". Wyler's daughters, Catherine and Judy, were cast as uncredited customers seen in the drug store where Fred Derry works. Sean Penn's father, Leo, played the uncredited part of the soldier working as the scheduling clerk in the Air Transport Command Office at the beginning of the film.</p><p>Teresa Wright was only thirteen years younger than her on-screen mother, played by Myrna Loy. Michael Hall (1926-2020), at the time of his death the last surviving credited cast member, with his role as Fredric March's on-screen son, is absent after the first third of the film. The reason was that Hall's contract with Goldwyn ended during filming, but the producer was reluctant to pay extra money to rehire him.</p><br/><h3>Production</h3><p>Samuel Goldwyn was inspired to produce a film about veterans after reading an August 7, 1944, article in Time about the difficulties experienced by men returning to civilian life. Goldwyn hired former war correspondent MacKinlay Kantor to write a screenplay. His work was first published as a novella, Glory for Me, which Kantor wrote in blank verse. Robert E. Sherwood then adapted the novella as a screenplay.</p><p>Director Wyler had flown combat missions over Europe in filming Memphis Belle (1944), and worked hard to get accurate depictions of the combat veterans he had encountered. Wyler changed the original casting, which had featured a veteran suffering from post-traumatic stress disorder, and sought out Harold Russell, a non-actor, to take on the exacting role of Homer Parrish.</p><p>For The Best Years of Our Lives, he asked the principal actors to purchase their own clothes, in order to connect with daily life and produce an authentic feeling. Other Wyler touches included constructing life-size sets, which went against the standard larger sets that were more suited to camera positions. The impact for the audience was immediate, as each scene played out in a realistic, natural way.</p><p>Recounting the interrelated story of three veterans right after the end of World War II, The Best Years of Our Lives began filming just over seven months after the war's end, starting on April 15, 1946 at a variety of locations, including the Los Angeles County Arboretum and Botanic Garden, Ontario International Airport in Ontario, California, Raleigh Studios in Hollywood, and the Samuel Goldwyn/Warner Hollywood Studios.</p><p>In The Best Years of Our Lives cinematographer Gregg Toland used deep focus photography, in which objects both close to and distant from the camera are in sharp focus. For the passage of Fred Derry's reliving a combat mission while sitting in the remains of a former bomber, Wyler used \"zoom\" effects to simulate Derry's subjective state.</p><p>The fictional Boone City was patterned after Cincinnati, Ohio. The \"Jackson High\" football stadium seen early in aerial footage of the bomber flying over the Boone City, is Corcoran Stadium located at Xavier University in Cincinnati. A few seconds later Walnut Hills High School with its dome and football field can be seen along with the downtown Cincinnati skyline (Carew Tower and Fourth and Vine Tower) in the background.</p><p>After the war, the combat aircraft featured in the film were being destroyed and disassembled for reuse as scrap material. The scene of Derry's walking among aircraft ruins was filmed at the Ontario Army Air Field in Ontario, California. The former training facility had been converted into a scrap yard, housing nearly 2,000 former combat aircraft in various states of disassembly and reclamation.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Upon its release, The Best Years of Our Lives received extremely positive reviews from critics. Shortly after its premiere at the Astor Theater, New York, Bosley Crowther, film critic for The New York Times, hailed the film as a masterpiece. He wrote,</p><blockquote>It is seldom that there comes a motion picture which can be wholly and enthusiastically endorsed not only as superlative entertainment, but as food for quiet and humanizing thought... In working out their solutions, Mr. Sherwood and Mr. Wyler have achieved some of the most beautiful and inspiring demonstrations of human fortitude that we have had in films.\" He also said the ensemble casting gave the \"'best' performance in this best film this year from Hollywood\".</blockquote><p>French film critic André Bazin used examples of Toland's and Wyler's deep-focus visual style to illuminate his theory of realism in film—going into detail about the scene in which Fred uses the phone booth in the far background while Homer and Butch play piano in the foreground. Bazin explains how deep focus functions in this scene:</p><blockquote>The action in the foreground is secondary, although interesting and peculiar enough to require our keen attention since it occupies a privileged place and surface on the screen. Paradoxically, the true action, the one that constitutes at this precise moment a turning point in the story, develops almost clandestinely in a tiny rectangle at the back of the room—in the left corner of the screen.... Thus the viewer is induced actively to participate in the drama planned by the director.</blockquote><p>Professor and author Gabriel Miller discusses briefly the use of deep-focus in both the bar scene and the wedding scene at the end of the picture in an article written for the National Film Preservation Board.</p><p>Several decades later, film critic David Thomson offered tempered praise: \"I would concede that Best Years is decent and humane... acutely observed, despite being so meticulous a package. It would have taken uncommon genius and daring at that time to sneak a view of an untidy or unresolved America past Goldwyn or the public.\"</p><p>The Best Years of Our Lives has a 97% \"Fresh\" rating at Rotten Tomatoes, with an average rating of 8.9/10, based on 96 reviews. The critical consensus states: \"An engrossing look at the triumphs and travails of war veterans, The Best Years of Our Lives is concerned specifically with the aftermath of World War II, but its messages speak to the overall American experience.\" Chicago Sun-Times film critic Roger Ebert put the film on his \"Great Movies\" list in 2007, calling it \"... modern, lean, and honest\".</p><h4>Popular response</h4><p>The Best Years of Our Lives was a massive commercial success, earning an estimated $10.2 million at the U.S. and Canadian box office during its initial theatrical run, not only making it the highest-grossing film of 1946, but also the highest-grossing film of the 1940s decade. It benefited from much larger admission prices than the majority of films released that year which accounted for almost 70% of its earnings. When box office figures are adjusted for inflation, it remains one of the top 100 grossing films in U.S. history.</p><p>Among films released before 1950, only Gone With the Wind, The Bells of St. Mary's, The Big Parade and four Disney titles have done more total business, in part due to later re-releases. (Reliable box office figures for certain early films such as The Birth of a Nation and Charlie Chaplin's comedies are unavailable.)</p><p>However, because of the distribution arrangement RKO had with Goldwyn, RKO recorded a loss of $660,000 on the film.</p><h4>Russell Academy Award</h4><p>Despite his Oscar-nominated performance, Harold Russell was not a professional actor. As the Academy Board of Governors considered him a long shot to win, they gave him an Academy Honorary Award \"for bringing hope and courage to his fellow veterans through his appearance\". When Russell in fact won Best Supporting Actor, there was an enthusiastic response. He is the only actor to have received two Academy Awards for the same performance. In 1992, Russell sold his Best Supporting Actor statuette at auction for $60,500 ($126,200 today), to pay his wife's medical bills.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"10\"><span>Academy Awards</span></td><td><span>Best Motion Picture</span></td><td><span>Samuel Goldwyn</span> (for <span>Samuel Goldwyn Productions</span>)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>William Wyler</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Fredric March</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Harold Russell</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay</span></td><td><span>Robert E. Sherwood</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Daniel Mandell</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Scoring of a Dramatic or Comedy Picture</span></td><td><span>Hugo Friedhofer</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound Recording</span></td><td><span>Gordon E. Sawyer</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Academy Honorary Award</span></td><td>Harold Russell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Irving G. Thalberg Memorial Award</span></td><td>Samuel Goldwyn</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Bodil Awards</span></td><td><span>Best American Film</span></td><td>William Wyler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film from any Source</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Brussels World Film Festival</td><td>Best Actress</td><td><span>Myrna Loy</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Cinema Writers Circle Awards</span></td><td colspan=\"2\">Best Foreign Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Picture</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Special Achievement Award</td><td>Harold Russell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Karlovy Vary International Film Festival</span></td><td><span>Crystal Globe</span></td><td rowspan=\"2\">William Wyler</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Screenplay</td><td>Robert E. Sherwood</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>William Wyler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>William Wyler</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Fredric March</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>In 1989, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><p>American Film Institute included the film as #37 in its 1998 AFI's 100 Years...100 Movies, as #11 in its 2006 AFI's 100 Years...100 Cheers, and as #37 in its 2007 AFI's 100 Years...100 Movies (10th Anniversary Edition).</p><br/><h3>Radio adaptations</h3><p>In 1947 and 1949, there were four separate half-hour adaptations from Hedda Hopper's This Is Hollywood, The Screen Guild Theater (two) and Screen Directors Playhouse. In all four cases, various actors reprised their film roles.</p><br/>"
  },
  "errorMessage": ""
}