{
  "imDbId": "tt0112641",
  "title": "Casino",
  "fullTitle": "Casino (1995)",
  "type": "Movie",
  "year": "1995",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0358218",
      "warningSpoilers": true,
      "date": "30 October 2003",
      "rate": "10",
      "helpful": "323 out of 406 found this helpful.",
      "title": "\"Now it looks like Disney Land\"",
      "content": "This is one of the best films of the 90's hands down. Without a doubt this has become one of my favorite movies. I'm not sure why really, I just love it. I think because I read the book and a lot of what happened in real life happened in my little town in Chicago. No names, and my old boss who runs our town grocery store actually knew \"Ace\". Again, no names. That was always pretty cool to me, since my town really didn't have much excitement. I guess also because I'm a huge fan of Martin, Robert, and Joe's. When they work together, they create masterpieces. I've read a lot of comments on IMDb, and more than 50% of the comments are calling this \"Goodfells Part 2\". Is it \"Goodfellas Part 2\", in my opinion, no. Yes, it's very similar situations, but it's not the same plot. It's a little more gory and more bright. \"Casino\" is mainly about the rise and fall of Las Vegas. When Robert DeNiro's character says \"It's more like Disney Land now\". Actually that's true, it's not like it used to be. I'm only 20, but my mom and dad told me how different the times were in the 60's and 70's. Everyone was more close and wanted to know who you were and how everything was going. Everything is more corporate greed now-a-days. But back onto the movie, it does have gangsta's in it, and with that comes some pretty gruesome violence.Robert DeNiro. No words can describe how wonderful of an actor he is. If you read in most of my comments, you can tell I'm a fan. This movie is actually what made me into a huge fan of his. He's dialog and image is very powerful and you understand his position. You want to love him, even though technically he's a bad guy too, you still think he is so cool. A lot of people I talked too: the guys wanted to be him and the girls wanted to be with him. What a performance, it deserved more praise.Joe does it again being the A$$hole who thinks with his gun and not with his head. Joe as an actor is very remarkable. He's only 5' 6'', but he is so intimidating. His speech in the desert with Ace and the big confrontation. \"You want me to get out of my own town?! Don't *bleep* with me, Ace!\" Does he swear in this movie? Oh, yeah. A lot, we're talking 400+ f-words, guys. But you get past the vulgar language and just enjoy what Joe says and does. The head vice scene and the metal bat scene with Joe is two of the most disturbing scenes in cinematic history.Sharon Stone, what can I say? What a remarkable performance! She was very much robbed of her deserved Oscar. I was reading in my \"Rober DeNiro: A history of his films\" that Sharon over shined both Joe's and Robert's performance. In some ways that is very true. She plays a gold-digging, druggie, drunk, hustling, whore. She is very glamorous in the film though, she is covered in beautiful gowns and jewelery that no guy could ever resist. Her first scene where Robert first sees her and she is stealing chips from a guy who has \"hired\" her for a night was extremely effective. You can see why Ace fell so hard for her. What a terrific performance in the end. When she screams at Ace \"I will go to the FBI! I will go to the police! I'm not protecting you anymore!\", you get scarred and can't help but watch more even though you are sitting on your butt for more than 2 1/2 hours. You hate her character so much, you want her to get what's coming to her, that's what makes a terrific performance. When you actually want to make sure that this character gets the justice he or she deserves. Sharon, I apologize, you deserved more praise as well.Martin Scorcesse. One of the greatest living directors of our time. This film was very wonderfully made with great visuals. The soundtrack really adds a lot, I'm telling you, and the theatrical trailer with the song \"Gimme Shelter\" by the Rolling Stones, what a great feel. Martin has been nominated several times for an Oscar, but they snub him. I think because his films are so violent and typical. But they remain classics. I'm disappointed with the Oscars, this man deserves more. Whew. \"Casino\" is an excellent movie that I highly recommend for mob movie lovers. Don't compare this to \"Goodfellas\", let it stand on it's own. But please, this is not a movie for children in any manor. For the parents, this is a movie that should be on the wait until the later teens. It's very violent, we're talking a head in a vice, a beating with a metal bat(just to name a few violent scenes, there's more)drugs, sex, and very vulgar language. This is for adults only!It's a great movie that deserves very much to be on the top 250. I'd like to see it in the top 100, but we'll see. 10/10"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw7700011",
      "warningSpoilers": false,
      "date": "29 December 2021",
      "rate": "9",
      "helpful": "45 out of 55 found this helpful.",
      "title": "I enjoyed this more than \"Goodfellas\".",
      "content": "I generally avoid violent films...which is why I resisted watching \"Casino\" for a long time. However, despite being very violent in spots, the film turned out to be very compelling....it was far more than just violence and had an interesting look at the mob influence in Las Vegas back in the day.The film is unusual in that it has two leading men with parallel stories. Sometimes Ace and Nicky (Robert De Niro and Joe Pesci) were in scenes together....often they were apart...each doing his own thing. As for Ace, he was a smart man who was in charge of one of Vegas' top casinos. He was tough...but basically honest for a mobster. As for Nicky, as you'd expect with a Joe Pesci character, he's a bit of a nut-job....often out of control and letting anger govern most of his decisions. Unlike Ace who had a veneer of honesty about him, Nicky was a hood...and didn't mind this. Eventually, the pair end up having a downfall. How and what happens to each you'll have to see for yourself.The parts of this film I enjoyed the most were when you learned about how Vegas operated. Seeing Ace dealing with crooked gamblers was especially interesting. And, in this sense, I enjoyed the film much more than \"Goodfellas\"...also with the same stars and same director. This is because \"Goodfellas\" was mostly just about violence and crime...whereas \"Casino\" seemed to have more story and wasn't always about excessive violence and nastiness...not that the film is in any way a 'nice' picture. It's filled with obscenities, nasty folks and a few scenes of horrific violence. Think about this before you decide whether or not to see the movie.By the way, this is only a personal choice and doesn't really affect the movie much, but one thing I did not love about the film is the omnipresent pop music....which at times made the film seem like a music video. I think less of this would have been nice."
    },
    {
      "username": "Movie-ManDan",
      "userUrl": "https://www.imdb.com/user/ur31261952",
      "reviewLink": "https://www.imdb.com/review/rw3282257",
      "warningSpoilers": true,
      "date": "22 July 2015",
      "rate": "10",
      "helpful": "93 out of 115 found this helpful.",
      "title": "I Know I Am In The Minority When I Say This Was Much Better Than Goodfellas.",
      "content": "I saw Goodfellas first and more times than Casino. Yet, I totally love Casino as it is one of the best movies I have literally ever seen. I find Goodfellas to be overrated and Casino to be the movie that learned from the former's flaws.Something I really do think (more than my own opinion) is that if this was released before Goodfellas, this would be more liked. No new ground was broken, everything was just elevated.Robert De Niro gives his most underrated performance--as well as the second best of the year (behind Nicolas Cage in Leaving Las Vegas)-- as Sam \"Ace\" Rothstein. Ace is an unbeatable gambler who secures the mob's casino shenanigans while his lifelong best friend, Nicky Santoro (Pesci) keeps everybody in line. The only real difference between Nicky and Tommy from Goodfellas is Tommy has curlier hair. There's divided opinion on who is crazier/more violent. I lean towards Nicky. Ace helps the casino grow and eventually seizes full power by becoming the owner. Nicky's wild and crazy antics get him banned from every Las Vegas casino, so he decides to create his own. Meanwhile, Ace blindly falls for a beautiful prostitute named Ginger (Stone) and they get married. Her habits don't change and Ace does all he can to help her out. The love story in this is amazing. Ginger is unlikeable but we can't turn away from her. Her and Nicky both contribute to Ace's fall as well as the rise of other casinos in Vegas.One easy thing I loved was the performance by Robert De Niro. He is very likable and my heart breaks every time he is screwed over by Ginger and Nicky. He was easily a better lead than Ray Liotta and his character was more likable and deeper than Jimmy. In fact, all three of our leads in this are much deeper developed than the leads in Goodfellas. Ray Liotta is a dummy who is not cut out to be a mobster, while we see the conviction in Ace as he tries to make everything work out. Casino is also much more flashy and nicer too look at than Goodfellas which takes place in New York. The music in this is not distracting or overpowering. The filming is a step up. the flow is much better. And the story is superior. This has more of a linear and stable story than Goodfellas, which is just a man's escapades in the mafia. Everybody that watches Casino is impacted more than Goodfellas. To watch Casino, you have to be in a mood and well prepared. A movie has really done its job if it does that to a viewer, and actually has a purpose for its content.4/4"
    },
    {
      "username": "contronatura",
      "userUrl": "https://www.imdb.com/user/ur0614400",
      "reviewLink": "https://www.imdb.com/review/rw0358109",
      "warningSpoilers": false,
      "date": "20 February 2000",
      "rate": "10",
      "helpful": "373 out of 435 found this helpful.",
      "title": "The most uncompromising studio picture of the 1990s.",
      "content": "A complex, multilayered, beautifully directed film, Martin Scorsese's Casino is a masterpiece of destruction and betrayal. Few films take so many chances and succeed so wonderfully. It takes some of the basic formulas that were found in Goodfellas and applies them to another type of story - while Goodfellas' view was ground-level, telling the story of the \"blue collar\" gangsters of NYC, this film tells the story of the guys who controlled those guys. And it's fascinating to watch these people run Las Vegas, control the flow of money, and then fall from the heights of power due to lust, hubris, and greed. An amazing film that will hopefully get the recognition it deserves in the years to come."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1660414",
      "warningSpoilers": false,
      "date": "22 May 2007",
      "rate": "8",
      "helpful": "82 out of 108 found this helpful.",
      "title": "Robert De Niro, an icon of the contemporary Hollywood crime film...",
      "content": "Based on a true story, Martin Scorsese \"Casino\" is a motion picture about two characters and their chance to rule the desert paradise of Las Vegas We are introduced in with all the lights, the noise, the flashing and the colors of the town that doesn't sleep day or night De Niro's character, Sam 'Ace' Rothstein, is based on Frank \"Lefty\" Rosenthal, who was a hell of a handicapper He was so good that whenever he bets, he could change the odds for every bookmaker in the country Genius at what he was doing with numbers, he proved to a lot of guys in the Chicago Mob that he was a tremendous earner that he could make a lot of money for them As a result, he was able to accomplish whatever bookmaking, handicapping, he wanted to do, with the umbrella of protection from those guys 'Ace' runs the casino with an iron fist refusing any outside people cheating at his tables But he had a fatal flaw 'Ace' always felt that he could logically and intelligently deal with things, even to deal with emotions So he decides on making a life with a woman who, he knows, does not necessarily love him Anyway with such a sexy wife and money to burn, 'Ace' was the epitome of opulence, confidence and power Ginger McKenna (Sharon Stone) was fascinating Great woman, truly beautiful, one of the best-known hustlers in town For her, a guy like 'Ace' was the ultimate score So the way to Ginger's heart was clearly money 'Ace' knew that but he didn't care What he wanted was to marry her Sharon Stone really stood up to the challenge in her role as a casino hustler who is so wild She was young, fresh, confident, looking absolutely fantastic as the independent woman whom everybody desires Joe Pesci succeeds in his scary tough role as the strong man who has nerve, and isn't afraid of the cops He was reportedly a mob hit man reputed to be a sadistic killer (In one scene, his character is shown torturing someone by putting his head in a vise.) To protect his friend and adviser, Nicky (Pesci) would beat to a pulp any street guys who messed with 'Ace' or didn't give him the proper respect Over the course of their friendship Nicky delivered a number of these messages always making sure that 'Ace' didn't get his hands dirty 'Ace' witnessed several beatings on his behalf Nicky's mission was to show his worth to the family as an enforcer The clothes on De Niro looked very straight, more dangerous and very threatening They were very important cues to his character, and again, to the progression of the story 'Ace' was an extremely fastidious guy And, of course, as you follow the story he starts out in more conservative colors and as things become more chaotic, the colors become more chaotic"
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0358205",
      "warningSpoilers": false,
      "date": "14 May 2003",
      "rate": "8",
      "helpful": "148 out of 202 found this helpful.",
      "title": "Typically fantastic Scorcese film",
      "content": "I have to admit my bias, because I believe that Scorcese cannot do wrong - ever. Even his lesser-known or critically panned films are above the \"great film\" line, and Casino is certainly no exception. Casino spans three decades and chronicles the true story of a faction of the mob who ran Las Vegas casinos. Robert DeNiro plays Ace Rothstein, a fantastic bookie who is chosen to run the Tangiers hotel and casino. Along the way, he marries a drug-addicted con-artist trophy wife (Sharon Stone) and struggles with his friendship with loose-cannon Nicky Santoro (Joe Pesci). Rothstein is a complicated figure in that he is not a heavy, yet he wields a lot of power due to the respect he has gained from his mob bosses back home. Robert DeNiro and Joe Pesci are both fantastic in their roles, and Sharon Stone actually turned out a non-irritating performance. As the viewer, you can't stand her, but that is the point. Scorcese's normal supporting cast are also involved in this film, including his great mother - even though she usually has incredibly minimal roles, they are always memorable. Scorcese seems to have several different directing styles, and Casino follows in the tradition of Goodfellas as a pseudo-documentary. A lot of the exposition is revealed by the characters themselves in the form of voice-overs, and several scenes are filmed in documentarian fashion. The entire production however, is sleek and very quick. The use of music bears mentioning as well: Most Martin Scorcese films have an amazing soundtrack that adds to and enhances the scene. Being a child of the MTV age, I'm a sucker for good uses of music in films and Scorcese is a master. Scorcese doesn't just utilize the soundtrack, he makes it part of the storytelling - by the music, we chronologically know what time period we are witnessing, since one cannot rely on other factors, such as fashion alone. One of my favorite scenes in film which effectively involves music is actually from Casino - the very intense scene when the relationship between DeNiro, Stone and Pesci come to a head in the climax of the film. The pounding music cut throughout this scene is a cover of \"Satisfaction\" by Devo and the result is absolutely brilliant. Being a complete film geek, I generally don't go to films that feature certain stars, I go to films by certain directors and Scorcese is one of them. While this was probably the tenth time I'd seen this film there were more things I noticed, and I'm sure I'll notice more upon my eleventh viewing. The man is a complete genius, and a gift to film - my suggestion is to watch some of his films, then check out his unbelievable series, \"A Personal Journey with Martin Scorcese Through American Movies\" which was done the same year as Casino. The series is essentially a primer on the history of film, sectioned off by film genres. You not only will experience his amazing intellect and massive knowledge of film history, but his incredible humility as well.--Shelly"
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw1052809",
      "warningSpoilers": true,
      "date": "3 April 2005",
      "rate": "7",
      "helpful": "56 out of 78 found this helpful.",
      "title": "Entertaining, but it lacks bite and emotion",
      "content": "Martin Scorsese's Casino has all the ingredients for a great crime film. It's got hits, bad language, Robert DeNiro, gambling, lots of Italian Americans - it's all there. Furthermore, it's got a great soundtrack, the Las Vegas setting makes for a great location and the acting is largely very good...but somehow, this just isn't a great film. Scorsese has missed the mark thanks to a lack of emotion. There is no reason to care for the characters in this movie, and that makes the film hard to connect with on the whole. The movie also follows the common Scorsese format, in that some guy gets rich and respected, then something bad happens and he finds himself back where he started. In fact, the ending of this movie is only an \"I'm a schmo\" away from being a complete copy of Goodfellas. Still, at least the movie manages to stay interesting for most of it's runtime, and it's easy to forgive the flaws when you're watching Joe Pesci threatening someone who's head he's jammed into a vice.Casino lasts almost three hours, and it's fair to say therefore that this movie is overlong. It's not so bad for the first two hours, but once the film enters the final third; cracks begin to appear and the film isn't as interesting as it was, not much unlike Goodfellas; which also suffered from a trite final third. Tarantino's influence on cinema is felt in this movie, and that is obvious from the way that Scorsese has seen fit to saturate the movie in 'cool' old classics. Still, some of these songs; such as Fleetwood Mac's \"Go Your Own Way\" and The Animals' \"The House of the Rising Sun\" are really good songs and actually bode well with the action on screen. For this movie, Martin Scorsese has re-recruited the excellent pairing of Robert DeNiro and Joe Pesci, and both give their trademark excellent performances in this film. Casino may well be DeNiro's last great performance before he went on his downward spiral, which started with the fellow 1995 movie \"Heat\". On the whole, while this film is technically sound, it lacks emotional bite and there will be times during the film when your interest will trail off. It's an entertaining ride, but it's one that is ultimately shallow."
    },
    {
      "username": "famsmith",
      "userUrl": "https://www.imdb.com/user/ur0781142",
      "reviewLink": "https://www.imdb.com/review/rw0358128",
      "warningSpoilers": false,
      "date": "28 October 2000",
      "rate": "10",
      "helpful": "389 out of 482 found this helpful.",
      "title": "An underrated and undervalued Scorsese Classic",
      "content": "If you haven't seen Casino yet, stop whatever it is you're doing, rush to the nearest video store, rent it, and watch it. Along with Mean Streets Casino is probably Scorsese's most underrated and unheralded picture. I would also venture to say that this is probably his most ambitious film. The film deals with a particular time period and a particular atmosphere and accomplishes an overwhelming achievement by creating and accurately portraying both. The art direction is splendid, most likely the best of any film Scorsese has ever done. The acting is superb. I never thought Pesci would be able to top his dynamic performance in Raging Bull until I saw Casino. Every time I watch this picture I fall in love with it all over again. This is the most honest depiction of Las Vegas, especially of the time period it was portrayed in. Scorsese's direction is flawless. Perhaps it is because I watch alot of Scorsese and Kubrick films, but I am becoming less satisfied with plot driven films and more enamored by films that possess the freedom that typical stories just don't seem to hold. Sharon Stone gives the best performance of her career, and as far as the editing is concerned, well if you believe like Kubrick and Pudovkin that a film is not shot, but built who better to have on your team than long time cohort, collaborator, and editor Thelma Schoonmaker. Ultimately, the genius of Scorsese is not just in the mastery of the medium, but in the understanding and appreciation for the necessity of great collaborators on all levels that Scorsese has consistently utilized throughout his career. Casino exemplifies not only the best of a Scorsese film, but transcends it. This film is truly a gem."
    },
    {
      "username": "ray-280",
      "userUrl": "https://www.imdb.com/user/ur3847467",
      "reviewLink": "https://www.imdb.com/review/rw1151808",
      "warningSpoilers": false,
      "date": "16 August 2005",
      "rate": "10",
      "helpful": "122 out of 165 found this helpful.",
      "title": "A Can't-Miss Story No Matter How Told",
      "content": "As a lifelong gambler who has crossed paths with a few fringe types portrayed in the film, I'm well aware of the story, the culture, and the ambiance of the Tangiers, the fictional casino placed in the control of Sam \"Ace\" Rothstein (Robert Deniro). Rothstein is not a mob member, but a \"moneymaker\" for them because he's the nation's best sports handicapper. It was refreshing for a movie to finally show that not all gamblers are stupid, but instead one of those who takes advantage of the many who are.Rothstein's partner in crime is Nicky Santoro (Joe Pesci), who is far less convincing as a mobster than he would seem to like to believe. Sharon Stone plays the psychotic Ginger, a once-in-a-lifetime role in that it was the only time in my life I could bear to watch her on film. The supporting cast is strong, led by James Woods and Don Rickles (excellent in his dramatic capacity), and the movie is generally well-acted.If you are a gambler or know the \"wiseguy\" culture, the movie doesn't have to be explained, while if you aren't, you'll feel like you've stumbled upon the secret meeting place of the mafia and made privy to what is said, without anyone knowing you were there. This film is based on the true story of what happened when the mob tried to put its men in suits and have them heading a casino, and why it has never been tried since. The homage paid to the incestuous nature of Nevada politics was an excellent touch.Most of us wouldn't like a guy like Sam Rothstein, nor would we like to be him, but if we go to Vegas for a weekend and stay at a casino/hotel, we'll have a better experience if his watchful eye is ensuring that our stay is a pleasant one. The film's nod to how Vegas has been sanitized since those days is also accurate, and reflects sadness at a lost era, where the baby (the \"old school\" types who made Vegas great) was thrown out with the bathwater (the organized crime influences)."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2444854",
      "warningSpoilers": false,
      "date": "17 June 2011",
      "rate": "10",
      "helpful": "23 out of 33 found this helpful.",
      "title": "Hugely underrated and very compelling film",
      "content": "I don't consider Casino Scorsese's very best film(Goodfellas is my personal favourite), but it is a fantastic film and definitely one to see. It is shocking, disturbing and unflinching in places, particularly the part where a head gets squeezed in a vice, but that added to the atmosphere rather than distracted from it.Casino is brilliantly made too. I loved the setting, the cinematography and editing are outstanding and never take away from the atmosphere, and Martin Scorsese's direction is superb. The realism the film has is always absorbing, the subplots that form the story are intriguing and the characters are adeptly drawn.The story for me has seldom a dull moment, not with the subplots as intriguing as they are, how well made it is, how good the characters and acting are. The characters also are deliberately less endearing than are seen with Goodfellas, making it perhaps a more even portrayal of unorganised crime, but the decision to do that paid off. The acting is equally impressive. Robert DeNiro the great actor he is is incredibly charismatic, Joe Pesci gives his best performance in one of his more meatier roles and Sharon Stone(who has never been this good or even sexy before) is a revelation in a very demanding role.Overall, hugely compelling and underrated. 10/10 Bethany Cox"
    },
    {
      "username": "DunnDeeDaGreat",
      "userUrl": "https://www.imdb.com/user/ur1100711",
      "reviewLink": "https://www.imdb.com/review/rw0358154",
      "warningSpoilers": false,
      "date": "15 June 2002",
      "rate": "10",
      "helpful": "134 out of 213 found this helpful.",
      "title": "Scorsese ,Deniro &Pesci deliver again",
      "content": "Casino has to be one of the most underrated films that Martin Scorsese directed in the nineties. The acting by the leads is good and the script is excellent. Robert Deniro gave an Oscar worthy performance and Joes Pesci is chilling yet funny again. Even Sharon Stone is good in this brilliant film"
    },
    {
      "username": "pedroborges-90881",
      "userUrl": "https://www.imdb.com/user/ur65079747",
      "reviewLink": "https://www.imdb.com/review/rw3458713",
      "warningSpoilers": true,
      "date": "26 April 2016",
      "rate": "10",
      "helpful": "111 out of 136 found this helpful.",
      "title": "The perfect picture of Las Vegas early days.",
      "content": "Scorsese, De Niro and Pesci team up again for a amazing movie with unforgettable performances.The film portrays Las Vegas at a time when it was dominated by the mafia, extremely well directed by Scorsese, that film shows Robert De Niro as manager of the Tangiers Casino who have to deal with his unstable wife that used to be a high-class prostitute but who can not forget her pimp Lester and with his childhood friend Nicky that is taking the city with extreme uncontrolled violence bringing a bad image to the plans that the mafia has in Las Vegas.Sharon Stone definitely give the best performance of her career in this film and the secondary characters convey very well the image of the great leaders of the mafia.Casino is a classic and a must-see movie."
    },
    {
      "username": "kenjha",
      "userUrl": "https://www.imdb.com/user/ur2590596",
      "reviewLink": "https://www.imdb.com/review/rw2317070",
      "warningSpoilers": false,
      "date": "28 September 2010",
      "rate": "6",
      "helpful": "22 out of 32 found this helpful.",
      "title": "Narrated for the Blind",
      "content": "Fueled by mob bosses, two long-time friends make it big in Las Vegas. Scorsese not only rehashes the themes he explored in \"Goodfellas,\" but is also much too long-winded about it. After the film starts with heavily narrated expository scenes, one would expect the main story to kick in, but it continues in the same vein. This must be the most heavily narrated film in history, defying the notion that film is mainly a visual medium. Adding to the busy soundtrack is a non-stop hit parade of 1970s songs. Of course there are numerous scenes showcasing Scorsese's obsession with repulsive violence. De Niro and Pesci essentially reprise their \"Goodfellas\" roles. Stone is alluring."
    },
    {
      "username": "TheUnknown837-1",
      "userUrl": "https://www.imdb.com/user/ur6321000",
      "reviewLink": "https://www.imdb.com/review/rw2711109",
      "warningSpoilers": false,
      "date": "26 November 2012",
      "rate": "5",
      "helpful": "22 out of 31 found this helpful.",
      "title": "Even though the technique is pure, the storytelling seems half-baked and uninterested in itself.",
      "content": "The opening 30 minutes or so of \"Casino\" embodies everything that I adore about pre-21st century Martin Scorsese cinema, most particularly the excellent craftsmanship he seems to have lost his grip in on recent years. As the picture begins, we get this fabulous quasi-documentary narrative with Robert De Niro, as the film's protagonist—nobody with any sense of morality can call a mob figure a hero—providing us all the details. What he's been given to say is fascinating, and the way Scorsese coordinates his camera is superb. The technique is pure, the edits are crisp and clean (there are none of those horrendous, in-your-face jump cuts that stabbed his 2006 film \"The Departed\" clean through the heart), and the amount of detailed information presented in an entertaining way. Scorsese and his co-screenwriter, Nicolas Pileggi, both of whom collaborated on the 1990 gangster masterpiece \"GoodFellas,\" are certainly to be commended as researchers. In this fabulous first half-hour, they know just when and where to tell us data about how the mob ran a Las Vegas casino and when to show us. They tell us who watches who during a big gambling night, and show us, in splendid detail, how to get rid of a cardsharp by giving him a bogus heart attack.Unfortunately, for me, once Sharon Stone, as a prostitute who sets the protagonist's heart aflame, enters the picture, everything begins to drag. This is not a negative reflection on Sharon Stone's performance. Not only is this her best piece of work that I'm aware of—I personally do not think she's untalented as an actress—but she gives the best performance of the entire movie. There isn't a bad performance, really, but she does dominate everybody else in \"Casino.\" So it's not her acting that wears out the movie for me; it's the pretentious and uninteresting melodrama that follows in her tracks.The pseudo-romantic dynamic between De Niro and Stone is, at heart, just an old-fashioned gangster-and-his-moll story, with the feisty woman first being pushed around, then pushing back, standing up to the boyfriend with the gun. Why does this dynamic go wrong? Because the screenplay tries to make something monumentally important out of it all. It tries to go deep, explore the psyches of both characters, takes them out of the casino and into the deserts and apartments of Las Vegas, and attempts to bring a psychologically fascinating angle to their relationship. Here, it completely falls apart, and the remaining two and a half hours of the movie—the middle in particularly—really begins to drag. The other problem with this relationship is that De Niro's character is not interesting when the movie tries to explore his depth as a person. He's much more interesting in the old-fashioned personality of the 'rough-and-touch, silent but deadly' casino manager who, save for his cameras, supervises everything that goes in his establishment. Once he gets all mucky and muggy with Stone, the fascination is wiped clean from the slate. As was my ability to stay interested.I wish that \"Casino\" had stayed inside the casinos and not gone into the deserts, apartments, swamps, of outer Las Vegas. For me, the heart of the movie was contained in that big, luxurious building with the omnipresent colors. And I do not see why the movie could not have just stayed there and told its story from that setting, venturing outside only when necessary. Obviously, it's based on true events, but since the true events, as told on screen, become this dull, what's the point? Even Joe Pesci, essentially repeating his performance from \"GoodFellas,\" seems to have little purpose outside the casino. There's some promising sequences with him forcing De Niro to come down in the middle of the night to get him fifty million-dollar chips for a gambling rage, but, once again, once the story leaves the casino and starts getting involved with all the other stuff, it goes downhill.But to the filmmakers' credit, having Pesci narrate part of the story does make his denouement all the more surprising. I will not give away exactly what happens, but the way things unfold toward the end, with Pesci's narration almost completely eradicating De Niro's, really does leave the audience unexpected for what eventually turns out. It's a brilliant touch.I admired the physical production values of \"Casino\" as much as any great-looking movie I've ever seen, and Scorsese's flair as a director is very impressive. But even though the technique is pure, the storytelling seems half-baked and uninterested in itself. And that's the coldest feeling a movie can possibly give you. Whether it's representational or not, when you get the notion that the filmmaker lost interest in the story he was telling, it's all for nothing."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1143011",
      "warningSpoilers": false,
      "date": "5 August 2005",
      "rate": "10",
      "helpful": "23 out of 36 found this helpful.",
      "title": "How Others See Us",
      "content": "Casino is my favorite movie of the last decade of the last century. Just like in Goodfellas, Martin Scorsese rivets the audience to their seats without a real hero to root for. It's the power of the characters he creates.Robert DeNiro as the gambler boss of the Tangiers casino in Las Vegas of the 70s and 80s and Joe Pesci gangster are long time boyhood pals from the mean streets of Brooklyn. Both move out to Las Vegas seeking their respective places in their related fields at the orders of the higher ups in the criminal world. But circumstance drives them apart and one of those circumstances is Sharon Stone.People descending into degradation is always a role that will get you noticed by the Academy. Sharon Stone's part as Ginger is no exception here. She's a high price call girl when we first meet her and her descent into drug addiction isn't pretty, but Scorsese keeps it very real.But the main story line involves DeNiro and Pesci. To see ourselves as others see us is one elusive goal not attained by many in this world. These two aren't an exception. Each can see how the other is screwing up and absolutely cannot see what he's doing.The key scene in the whole film is when DeNiro and Pesci meet in the desert where a lot of problems have been known to disappear. If you can get passed all the cursing which is how you would expect gangsters to talk, each is making very realistic assessments about the other one and neither is listening to a word the other is saying. This is why I love Casino so much. I've never seen that particular theme ever handled so well on the screen."
    },
    {
      "username": "BrandtSponseller",
      "userUrl": "https://www.imdb.com/user/ur0139258",
      "reviewLink": "https://www.imdb.com/review/rw1111920",
      "warningSpoilers": false,
      "date": "26 June 2005",
      "rate": "8",
      "helpful": "113 out of 191 found this helpful.",
      "title": "Very good but not without flaws",
      "content": "Casino is a very good film. If you're at all interested in gangster/mafia films, or if you're at all a fan of director/co-writer Martin Scorsese, novelist/co-writer Nicholas Pileggi, or actors Robert De Niro, Joe Pesci, Sharon Stone or James Woods, then Casino is without a doubt a must-see. I'm a huge De Niro fan, and I'm a fan of Scorsese and Woods as well. I certainly enjoyed the film.But I don't think that Casino is at all a \"perfect\" film. An 8 out of 10 may seem high, but if you're familiar with my reviews, you'll know that it's not that high of a score from me--it's closer to average from me. There are plenty of flaws here, and I'm going to spend some time pointing them out, particularly since the film receives so many 10's.Casino is based on the story of Frank \"Lefty\" Rosenthal and the Stardust casino in Las Vegas. The Rosenthal character is here named Sam \"Ace\" Rothstein and is played by De Niro. The hotel became the Tangiers for the film. The mob backs Rothstein but has to set up a false front while Rothstein \"secretly\" runs the hotel, because of his gambling charges back East. He falls in love with and marries former hooker/call-girl and current Vegas hustler Ginger McKenna (Stone), who remains in love with her pimp, Lester Diamond (Woods). Meanwhile, mob strong-arm Nicky Santoro (Pesci) heads out to Vegas to protect Rothstein, but eventually ends up running his own rackets and trying to effectively take over the town. Casino is the story of the relationship and political problems that this cast of characters and a number of associates run into. It's roughly a gradual road to destruction for everyone involved.The film is unusual in many ways. The most prominent oddity is that a large chunk of it is told via alternated narration from the two main characters, Rothstein and Santoro. The aim was probably to include a lot more of Pileggi's book, in a more literal way, than would have been possible through more conventional means. It's remarkable that the narration works as well as it does, especially because a lot of it is given a rapid-fire delivery. For at least the first 15 minutes, there is barely a pause in the narrational dialogue.One of the reasons it works is because of the style that Scorsese uses to accompany it in the opening. He employs a lot of fast cuts while presenting very stylized, documentary-like footage. The opening feels as much like an entertaining behind-the-scenes look at how the typical casino works as it feels like a fictional film about gangsters.Eventually, the film evolves from almost 100% narration to almost no narration (although the narration never completely leaves the film). This happens so subtly that one hardly notices. Scorsese's directorial style likewise evolves from the fast-cut documentary approach to something more conventional.This is all well and good, but on the other hand, the gradual evolution can only happen because the film is so long--it clocks in just a couple minutes shy of 3 hours. That's a bit too long for the story being told. By at least the halfway point, it starts to feel a bit draggy. All the material is necessary to the story, but it could have been tightened up a lot more.Another unusual aspect is the score/soundtrack, which consists primarily of pop hits from a wide time span--30 years or more. While I like the songs--I've owned the CD since it came out and I listen to it often enough--and the songs can help set the mood for some scenes, they become a bit too incessant and overbearing for the story after awhile. It begins to approach the dreaded \"mix tape\" mentality, where the songs are just there because the director wanted to share some bitchin' tunes that he likes a lot. A bit of ebb and flow with the music, and music better correlated to the drama, would have worked even better.Presumably, Scorsese was shooting for something like a sensory assault, since that's what you get in Vegas. The visuals are filled with neon lights, flashy clothes (I love Rothstein's suits), flashy people and such. The soundtrack is probably meant to match. But in that case, if I were directing, I think I would have went for a combination of commissioned music that incorporated a lot of casino sounds, or that mimicked a lot of casino sounds--the cacophonous electronic symphony of various machines constantly going through their modes--with schmaltzy show tunes, ala Liza, Jerry Vale, Tom Jones, Wayne Newton, etc.That Scorsese was trying to give a Vegas-styled sensory assault is also supported by the audio-visual contrast between the Vegas scenes and the scenes in other locations, such as Kansas City. So I can understand the motivation, but I'm not sure the final result exactly worked.Of course the performances are exceptional, even if everyone is playing to type, except for maybe Woods. The plot and characters are written and performed so that the viewer can see the disasters coming way before the characters can--and that's how it should be. For example, as a viewer, you know as soon as it starts that it's a bad idea for Rothstein to kowtow to McKenna to win her hand in marriage, but Rothstein is blind in love and he ends up paying for it. Everything unfolds almost a bit predictably in this respect, and another slight flaw is that we're shown the penultimate moment of the film right at the very beginning. It tends to make it feel even more stretched out, as you keep anticipating that scene.But the slight flaws shouldn't stop anyone from seeing this film, and of course, quite a few viewers feel that there are no flaws at all."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6144000",
      "warningSpoilers": false,
      "date": "3 October 2020",
      "rate": "7",
      "helpful": "20 out of 31 found this helpful.",
      "title": "7-7-7-7",
      "content": "Nothing you haven't seen before, Robert De Niro performs in a similar style to several he established his career playing and Joe Pesci can only play himself no matter what the role calls for. If organised crime capers are your thing, or you're a casino denizen, it's lucky 7s all round for you, although, on this occasion, it's complemented and elevated through an outstanding performance by Sharon Stone. She steals the picture as the addicted to anything femme fatale opportunist most men would aspire to tame and, if they did get that chance, they would soon discover the trophy wife from hell - Sam did, but don't let that put you off."
    },
    {
      "username": "jpschapira",
      "userUrl": "https://www.imdb.com/user/ur4751428",
      "reviewLink": "https://www.imdb.com/review/rw1837322",
      "warningSpoilers": false,
      "date": "10 March 2008",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "The Scorsese spell...",
      "content": "During its first forty minutes, Martin Scorsese's \"Casino\" is pure narration, except for little spoken moments. It's a risky move, but then Marty has always been risky, and this movie may be the ultimate example to prove it. Closing in at three hours duration time, it takes its characters on a roller-coaster ride that not everyone might appreciate; from the advantages of recurrent fortune to the regular Scorsese tragedy.That's cutting it short, because there's a lot in the middle, but without telling you 'what' exactly goes on in \"Casino\", I'll tell you how you can approach it as a film. When Sam Rothstein (Robert De Niro) is put in charge of the Tangiers Casino in Las Vegas, he sees it as the perfect chance to erase the obscure past we call carry with us. However, his best friend Nicky (Joe Pesci) is not fond of legitimacy; and when he settles in Vegas to protect him, it's not long until he starts doing some business of his own. As Nicky himself puts it: \"The dollar Always the dollar\". But if we go back, Nicky also expresses at the beginning: \"It was perfect. Sam was the perfect guy to run the casino and he had me, his best friend, and Ginger, the woman he loved\". We see Ginger (a monumental Sharon Stone) at first as Sam sees her, a light in the middle of the room (there's one scene where this translates literally in images, with Robert Richardson's cinematography-that contains a wonderful use of light-putting the rest of the room in a mild darkness, while De Niro stands in awe as Stone walks and works the room accompanied by a constant light), but she is actually the most complex character of the film.If you approach \"Casino\" as a movie to see the inside movement of the casino business and its ups and downs (a subject the film manages perfectly), you may not notice the complexity of Stone's character and her performance. But then, if you view the film as the study of the consequences of an arranged marriage and life, you might miss the best element of the film: Joe Pesci's creation of Nicky; something that's indeed better than his work in \"Goodfellas\".Ultimately, you may choose to take \"Casino\" as the story of a long-time friendship and the betrayals that come with the years because people change and want different things from life. Again, this (as the marriage thing) is a subject that the film dominates. That's how brilliant Nicholas Pilleggi's-together with Scorsese-adaptation of his own book is; it covers everything with every detail. They did the same thing with \"Goodfellas\" and it was so rich that you could get lost in the 'mafia' universe. Here, as in \"Goodfelas\" (both film share many similarities, more than anything in the ongoing decay of certain characters and images that seem obvious copies from the 1990 film and speak by themselves, about how great both movies are and that these similarities don't change that fact at all), you have to try to follow every plot line in order to witness every scene exactly as what it means in the movie. It's the only way you'll enjoy the many conversations between Sam and Nick that lie between the best of the film and, besides showing that De Niro is the best when it comes to calming someone down and/or persuading him to make another decision; but Pesci is better because his stubbornness allows him to evade discussions and therefore cause the other more trouble (also that both know each other by heart so the work together is pure pleasure), are crucial to its development. The narration comes and goes during the film, in present or past time, generating more confusion for the viewer. This is all after the first hour and a half, and if you're not hypnotized by the film's spell at that point, something must be wrong. Is the movie too long? Yes, if the spell didn't work on you; but if you're already connected with the characters and don't want to get out, it makes no difference if it lasts three or five hours."
    },
    {
      "username": "CuriosityKilledShawn",
      "userUrl": "https://www.imdb.com/user/ur0102816",
      "reviewLink": "https://www.imdb.com/review/rw1644928",
      "warningSpoilers": true,
      "date": "27 April 2007",
      "rate": "9",
      "helpful": "18 out of 29 found this helpful.",
      "title": "Is it just me...",
      "content": "...or is this the darkest black comedy ever made? I just find Casino so amusing and funny that I hardly even notice the grim violence and harrowing drama. I also think that Casino is far, far superior to the over-rated Goodfellas. Even though it's longer, it passes in a breeze. Casino is just so colorful, multi-layered and intricate despite it's apparent simplicity. The film has three different characters narrating the story but none of it feels like exposition and it's never over-bearing.Adapted from a true story, the film focuses on the fictional Tangiers Casino in Las Vegas. The boss is Sam 'Ace' Rothstein, his wife, volatile hustler Ginger and his psychotic 'friend' Nicky Santoro. All they needed to do was to keep the cash-flow at the Casino steady to satisfy the bosses back home. But it was just never meant to be. And everything implodes at the end.Casino is filled with dozens of sub-plots, tangent stories and brilliant side-characters. James Woods is especially funny as a lowlife con-man who can't even win a fight with a ten-year-old girl. Vinny Vella also amuses as long-suffering Artie Piscano. But it's Sharon Stone who walks away with the movie. Despite starring opposite loads of well-established male lead actors she owns Casino. She was absolutely robbed at the Academy Awards when they gave the Oscar to Susan Sarandon. Stone delivered a performance so authentic that it's truly unfair the amount of criticism she gets for her other, less-important films.The violence will satisfy gore fans. In this lovely film we have a dope with his head in a vice (after getting icepicks in his balls), a truly brutal beating with baseball bats, some moron getting a pen shoved into his neck and a cheater getting his hand mashed by a hammer. Don't let this put you off, that was the old Vegas. Nowadays you just get told not to come back.I know most people will call it sacrilege to condemn Goodfellas but Casino is just the better film of the two, plain and simple. Better lighting, far more impressive cinematography and more entertaining characters. It just has so much going for it that Goodfellas did not."
    },
    {
      "username": "jadavix",
      "userUrl": "https://www.imdb.com/user/ur55157303",
      "reviewLink": "https://www.imdb.com/review/rw7858082",
      "warningSpoilers": false,
      "date": "12 February 2022",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Another Scorsese classic",
      "content": "While re-watching \"Casino\" just now I kept thinking of Spielberg's words re: Kubrick. \"Just try to stop watching one of Stanley's movies when you've already started,\" he said. \"It's impossible\".Perhaps, with Kubrick's passing, Scorsese became the greatest filmmaker on the planet. \"Casino\" is just an unbridled jolt of cinema, a three hour movie that feels like an hour and a half, a breakneck pace that still allows for rare depth in its performances and characterisations. It's the best performance Sharon Stone ever put in; after the ridiculous \"Basic Instinct\" and \"Sliver\", they could have written her off if not for this. Her character's arc is tremendous.More than anything, \"Casino\" is a showcase of what Pauline Kael called \"film sense\", that implacable quality that all great directors have. Like Spielberg and Kubrick, Scorsese has a gift for knowing exactly what shot should follow which, is an absolute master of camera movements, angles, framing such that the movie streaks across the screen like fast-moving water over rocks, never once stalling or slowing down.It's brilliant, but it's not up with the director's greatest work like \"Taxi Driver\", \"Raging Bull\", or \"Hugo\", which is a truly underrated masterpiece. It's a notch below, but when Scorsese is a notch below his best, he's still streets ahead of everybody else."
    },
    {
      "username": "dover",
      "userUrl": "https://www.imdb.com/user/ur0298435",
      "reviewLink": "https://www.imdb.com/review/rw0358090",
      "warningSpoilers": false,
      "date": "20 September 1999",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Very Good, not great",
      "content": "Taken alone, this was an excellent movie, very watchable, if a bit long. However, a lot of this movie obviously plays very close to what some of the people involved in it have played before. De Niro's character is eerily similar to Al Pacino's in \"The Godfather II\", and Joe Pesci could easily be playing himself in \"Goodfellas\". This is another solid effort from Scorcese and crew, but it lacks originality.There were some interesting points. Sharon Stone was excellent, but once again, she seems to remind me of Talia Shire's Connie in \"The Godfather\". The same could be said of James Woods, who plays a Fredo-like scumbag (maybe Fredo wasn't that bad, but still....). To top it all off, we've got De Niro AND Pesci doing Ray Liotta's over-voice shtick from \"Goodfellas\".All in all, I would recommend this movie, but I'd also recommend you see the other movies I've mentioned here first. The acting here is good, the plot isn't lacking, the only negative side is that it does get a little violent. All the same, if you're familiar with Scorcese's work, at times you feel like this movie is basically Henry Hill narrating the Corleone family history. It's hard to see this group be so good without quite reaching the greatness they've achieved in the past."
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw3228386",
      "warningSpoilers": false,
      "date": "28 April 2015",
      "rate": "6",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Bloated, but there's some good mob stuff here",
      "content": "It's not \"Goodfellas\", but there are stretches when \"Casino\" is pretty great. That back-and-forth narration between De Niro and Pesci is a brilliant narrative trick and plays like a guided tour through this lavish empire the mob has carved out in Las Vegas (this, in spite of the town's gaudy trappings). Seductive, to say the least.It's in the second half that the narration vanishes and the movie starts to overstay its welcome. This criminal enterprising dream can't last forever, and when things start to come crashing down, they do so viciously (don't ever tell Scorsese he's timid on his violence). It's mostly when the '70s give way to the '80s and Sharon Stone's drama takes center stage that things become sour. \"Boogie Nights\" sprang to mind around this time, although that was a much more satisfying story.6/10"
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0358164",
      "warningSpoilers": false,
      "date": "3 September 2002",
      "rate": "7",
      "helpful": "12 out of 20 found this helpful.",
      "title": "Ossessione",
      "content": "A reprise of Goodfellas, mostly, as has been pointed out, and although long, not as tired or boring as some have felt. How could a movie with Steve Allen and Jerry Vale be all bad? People have wondered why Scorcese and Coppola keep coming back to mobsters, specifically the Mafia, and all that corruption mixed with loyalty. Of course no one knows, perhaps not even the directors. But I suspect there are at least three reasons: First, it works economically. It draws the audience in. There is power and violence and sex to appeal to the men's fantasies. There is loyalty, intrigue, sheltered family lives, and the excitement of a wealthy rogue male for women. Second, Italian-Americans may return repeatedly to stories of the Mafia for the same reason that Southern writers deal over and over with themes of minority relations. In spelling out the stories, they are explaining the odd customs of their subcultures to the rest of us. Yes, we are hung up on these obsessions, just as you believe, and here is how things work -- a bit more subtle than you'd thought, aren't they? Finally, in exploring these themes in the interests of the outsider's better understanding of them, they can explore their own conflicts in model form, as stated in the anthropologist John M. Roberts' conflict-enculturation hypothesis. When we view something with ambivalence we tend to poke around in it, to touch it, fascinated by it. If we can't actually DO the thing itself -- become a mobster, endorse slavery -- we can play games with the idea, constructing little mock worlds in which we can jiggle the concepts around. In conflict about having children? Well -- you don't really need to. You can nurture something that is a model or surrogate child. Cats and dogs will do fine. But if your conflict is more intense, you are driven to less recognizable models. House plants, say. And if the conflict is VERY intense, you can start a coin or a stamp collection. What, after all, do you do with a stamp collection? You conceive of the idea, you start it when it's small, you feed it, you watch it grow and get bigger, and when it gets too big, or when you lost interest, you sell it on eBay and it moves out of the house. Directing a movie means constructing a model world too, like the model social world of a chess game.In a movie, you lay out a plot, cause the characters to do certain forbidden things, and imagine how you might feel if you were doing them yourself. I'm not surprised that Scorcese made this movie, or that he's filled it with Italian-American actors. I'm not surprised that Faulkner wrote Intruder in the Dust, or that Judith Rossner wrote Looking for Mr. Goodbar, or that Philip Roth wrote Portnoy's Complaint. These model worlds they've created deal with issues like crime, race, female sexuality, and ethnic loyalties that have kept Italian-Americans and Southerners and feminists and Jews marginal to the rest of our culture. The artists are trying to explain to us and to themselves how things look from the inside. If these issues ever disappear, which is most improbable, the conflicts will ease, marginal populations will no longer be prompted to produce such intense work, and the rest of us will be poorer for it.Maybe in this case Scorsese did too good a job of it. I found myself listening to DeNiro's voice-over telling us that the James Woods character was a \"scumbag\" because he was a small-time chiseler chasing dentists on the golf course, taking money from the whore Sharon Stone. But who is DeNiro's character to make such judgments? Woods is detestable because he's a vellicating minor hood with no money? Whereas DeNiro is morally superior because he's a major player with LOTS of illegal gains? We admire DeNiro because he is the more successful crook. The moral calculus is a little confusing. On top of all that highbrow stuff -- man, does Scorsese know how to stage a fierce family fight. I should know. And that opening scene -- a car explosion backed by the majestic sweep of Bach's Missa Solemnis!"
    },
    {
      "username": "Cinemaniac1984",
      "userUrl": "https://www.imdb.com/user/ur1444027",
      "reviewLink": "https://www.imdb.com/review/rw7827302",
      "warningSpoilers": false,
      "date": "2 February 2022",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "A captivating and brilliant movie with an all star cast that I still cherish to this day.",
      "content": "I still remember watching Casino as a 12 year old on New Year's Day back in 1997 and being captivated from start to finish. I was lucky to be watching Casino at that age considering that the film is rated R 18+ in Australia for Medium Level Violence and Medium Level Coarse Language. Thankfully my Dad was lenient as long as we were sensible as myself, my Dad and my brother sat together and watched the movie. Casino was and still is a brilliant movie. Martin Scorsese directed another top notch film. The all star cast was perfect. Robert De Niro and Martin Scorsese mark another collaboration after their success with the classics Mean Streets (1973), Taxi Driver (1976), New York, New York (1977), The King of Comedy (1983), and Cape Fear (1991). Also joining in the collaboration is Joe Pesci of whom the three actors united for Raging Bull (1980), Goodfellas (1990) and The Irishman (2019).Set in Las Vegas during the 1970's, Sam \"Ace\" Rothstein (Robert De Niro in another brilliant role) is in charge of the mafia connected Tangiers Casino to oversee its day to day operations. Sam is successful in turning the casino into a legitimate profitable venture as well as skimming some of the profits to the mafia. His legitimate lifestyle is put in jeopardy after he marries former hustler and prostitute Ginger (Sharon Stone in an Academy Award nominated performance) who turns out to be unstable and dishonest as she leads a self destructive lifestyle with alcohol and drugs as Sam continues to shower her with diamonds, fur coats, money and other expensive gifts along with access to a safety disposit box. Another huge threat in Sam's life is Chicago mafia enforcer and childhood friend Nicky Santoro (Joe Pesci in another terrific performance) whose volatile behaviour earns him a ban from every casino in Las Vegas as he forms a crew and commits various crimes including robbery and burglary as well as beating, threatening and killing people. Nicky's actions bring a lot of unwanted attention to Sam due to their lifelong friendship. Ginger continues to see her ex boyfriend Lester Diamond (James Woods) who is a pimp and con artist yet is nothing more than a loser who is always asking Ginger for money. Though Sam organises to have Lester beaten up as a warning to stay away from his wife, Lester still pops up and continues to act as a leach. Marrying Ginger and bringing Nicky to Las Vegas would turn out to be Sam's downfall.The all star cast also includes Kevin Pollak, L. Q. Jones, Dick Smithers and the late actors Don Rickles, Frank Vincent, and Alan King.Director Martin Scorsese as always does an amazing job as he brought to life a classic movie based on Nicholas Pileggi's nonfiction novel Casino: Love and Honor in Las Vegas.Casino is an extremely violent movie with several scenes that are quite unsettling and not for the faint hearted. The \"f\" is used 422 times throughout the whole movie.I loved Casino when I first saw it and to this day, it deserves a spot as one of my top 10 movies of all time. It is 178 minutes long, but is a movie that I still cherish.A well deserved 10/10."
    },
    {
      "username": "hall895",
      "userUrl": "https://www.imdb.com/user/ur0915482",
      "reviewLink": "https://www.imdb.com/review/rw1116139",
      "warningSpoilers": false,
      "date": "1 July 2005",
      "rate": "6",
      "helpful": "11 out of 17 found this helpful.",
      "title": "GoodFellas in Vegas...it was better in New York",
      "content": "Scorsese, De Niro and Pesci team up again for a GoodFellas rehash. Casino is not a bad film. But it pales in comparison to what has come before it. It would be much easier to applaud Casino if we could take it on its own merits. But the parallels to GoodFellas are so numerous and so obvious, Casino always leaves us wanting more. We've seen this all before and we've seen it done better.Casino starts quite literally with a bang with a rather shocking car bombing before the opening titles have even rolled. It's a fascinating and highly intriguing opening but Casino never is able to sustain that energy. The film slogs along for three hours with the pace so slow that at times the movie seems to come to a dead stop. Scorsese has, even in his most brilliant successes, been criticized for the pacing (or lack thereof) in his films. Casino is a prime example of a Scorsese film that would have benefited greatly if the action could have been pushed along just a little bit faster. There's a terrific story here, top-notch acting performances and the typically brilliant Scorsese visual touches. What's missing is the energy a film like GoodFellas had. For all that Casino has going for it, in the end it's simply not entertaining enough.After the shock of the opening sequence, Casino goes back in time ten years to tell the story of Ace Rothstein, as played by Robert De Niro. We see he is running, on behalf of Midwestern mob bosses, the Tangiers casino in Las Vegas. Through use of voice-over narration (a la Goodfellas) Rothstein, and later Joe Pesci's Nicky Santoro, explain how the money moves through the casino and into the hands of the mafia kingpins. As the story begins everybody's getting paid, everything's running smoothly, everybody's happy. When mafia tough guy Santoro, played wonderfully by Pesci who could do this type of thing in his sleep, takes up residence in Vegas things start to unravel. Santoro's a hothead, out to make a quick buck for himself. Where Rothstein had been free to operate his casino in peace, when Santoro starts stirring things up he brings unwanted attention from the authorities. Rothstein's wife, Ginger, is not helping matters by being constantly drunk, stoned or drunk and stoned. Sharon Stone plays Ginger and the character is such a train wreck it's hard to really evaluate Stone's performance. She's certainly convincing as a glamorous call girl early on, perhaps less convincing when she's forced to be hysterically screaming all the time.Anyhow, Ace ends up having problems with the wife, problems with the authorities and problems with his onetime good friend Nicky. It's fascinating to see all the conflict swirl around him and De Niro is reliably brilliant in his performance as he deals with all the madness around him. Pesci is terrific and Stone is OK. Actors playing smaller roles also do noteworthy work. James Woods does well in a bit part as a man who is part of Ginger's past. Frank Vincent (GoodFellas parallel number 8,362 or thereabouts) settles into his mobster's role quite easily. And Don Rickles and Dick Smothers of all people have serious parts to play and each does a fine job. So, the acting certainly isn't the problem. The main characters, and some of the secondary ones, are wonderfully developed. Casino is beautifully photographed as you would expect from Scorsese. And the story is a good one, intriguing from beginning to end. It's in that long journey from beginning to end where Casino stumbles somewhat. It just takes too long to get where we're going and the film can't sustain the energy it opened with. A fascinating story, but in the end one that with a better pace could have been told in a much more entertaining way."
    }
  ],
  "errorMessage": ""
}