{
  "imDbId": "tt0112641",
  "title": "Casino",
  "fullTitle": "Casino (1995)",
  "type": "Movie",
  "year": "1995",
  "language": "en",
  "titleInLanguage": "Casino (1995 film)",
  "url": "https://en.wikipedia.org/wiki/Casino_(1995_film)",
  "plotShort": {
    "plainText": "Casino is a 1995 American epic crime film directed by Martin Scorsese, produced by Barbara De Fina and distributed by Universal Pictures. It is based on the 1995 nonfiction book Casino: Love and Honor in Las Vegas by Nicholas Pileggi, who also co-wrote the screenplay along with Scorsese. It stars Robert De Niro, Sharon Stone, Joe Pesci, Don Rickles, Kevin Pollak, and James Woods. The film was the eighth collaboration between director Scorsese and De Niro.\r\nCasino follows Sam \"Ace\" Rothstein (De Niro), a Jewish American gambling expert handicapper who is asked by the Chicago Outfit to oversee the day-to-day casino and hotel operations at the Tangiers Casino in Las Vegas. Other major characters include Nicky Santoro (Pesci), a \"made man\" and friend of Sam, and Ginger McKenna (Stone), a streetwise chip hustler whom Sam marries and has a daughter. The film details Sam's operation of the casino, the difficulties he confronts in his job, the Mafia's involvement with the casino, and the gradual breakdown of his relationships and standing, as Las Vegas changes over the years.\r\nThe primary characters are based on real people: Sam is inspired by the life of Frank Rosenthal, also known as \"Lefty,\" who ran the Stardust, Fremont, Marina, and Hacienda casinos in Las Vegas for the Chicago Outfit from 1968 until 1981. Nicky and Ginger are based on mob enforcer Anthony Spilotro and former dancer and socialite Geri McGee, respectively.\r\nCasino was released on November 22, 1995, by Universal Pictures, to a mostly positive critical reception, and was a worldwide box office success. Stone's performance was singled out for acclaim, earning her a Golden Globe Award for Best Actress in a Motion Picture – Drama and a nomination for the Academy Award for Best Actress.",
    "html": "<p>Casino is a 1995 American epic crime film directed by Martin Scorsese, produced by Barbara De Fina and distributed by Universal Pictures. It is based on the 1995 nonfiction book Casino: Love and Honor in Las Vegas by Nicholas Pileggi, who also co-wrote the screenplay along with Scorsese. It stars Robert De Niro, Sharon Stone, Joe Pesci, Don Rickles, Kevin Pollak, and James Woods. The film was the eighth collaboration between director Scorsese and De Niro.</p><p>Casino follows Sam \"Ace\" Rothstein (De Niro), a Jewish American gambling expert handicapper who is asked by the Chicago Outfit to oversee the day-to-day casino and hotel operations at the Tangiers Casino in Las Vegas. Other major characters include Nicky Santoro (Pesci), a \"made man\" and friend of Sam, and Ginger McKenna (Stone), a streetwise chip hustler whom Sam marries and has a daughter. The film details Sam's operation of the casino, the difficulties he confronts in his job, the Mafia's involvement with the casino, and the gradual breakdown of his relationships and standing, as Las Vegas changes over the years.</p><p>The primary characters are based on real people: Sam is inspired by the life of Frank Rosenthal, also known as \"Lefty,\" who ran the Stardust, Fremont, Marina, and Hacienda casinos in Las Vegas for the Chicago Outfit from 1968 until 1981. Nicky and Ginger are based on mob enforcer Anthony Spilotro and former dancer and socialite Geri McGee, respectively.</p><p>Casino was released on November 22, 1995, by Universal Pictures, to a mostly positive critical reception, and was a worldwide box office success. Stone's performance was singled out for acclaim, earning her a Golden Globe Award for Best Actress in a Motion Picture – Drama and a nomination for the Academy Award for Best Actress.</p>"
  },
  "plotFull": {
    "plainText": "Casino is a 1995 American epic crime film directed by Martin Scorsese, produced by Barbara De Fina and distributed by Universal Pictures. It is based on the 1995 nonfiction book Casino: Love and Honor in Las Vegas by Nicholas Pileggi, who also co-wrote the screenplay along with Scorsese. It stars Robert De Niro, Sharon Stone, Joe Pesci, Don Rickles, Kevin Pollak, and James Woods. The film was the eighth collaboration between director Scorsese and De Niro.\r\nCasino follows Sam \"Ace\" Rothstein (De Niro), a Jewish American gambling expert handicapper who is asked by the Chicago Outfit to oversee the day-to-day casino and hotel operations at the Tangiers Casino in Las Vegas. Other major characters include Nicky Santoro (Pesci), a \"made man\" and friend of Sam, and Ginger McKenna (Stone), a streetwise chip hustler whom Sam marries and has a daughter. The film details Sam's operation of the casino, the difficulties he confronts in his job, the Mafia's involvement with the casino, and the gradual breakdown of his relationships and standing, as Las Vegas changes over the years.\r\nThe primary characters are based on real people: Sam is inspired by the life of Frank Rosenthal, also known as \"Lefty,\" who ran the Stardust, Fremont, Marina, and Hacienda casinos in Las Vegas for the Chicago Outfit from 1968 until 1981. Nicky and Ginger are based on mob enforcer Anthony Spilotro and former dancer and socialite Geri McGee, respectively.\r\nCasino was released on November 22, 1995, by Universal Pictures, to a mostly positive critical reception, and was a worldwide box office success. Stone's performance was singled out for acclaim, earning her a Golden Globe Award for Best Actress in a Motion Picture – Drama and a nomination for the Academy Award for Best Actress.\r\nPlot\r\nIn 1973, sports handicapper and Mafia associate Sam \"Ace\" Rothstein is sent by the Chicago Mafia to Las Vegas to run the Tangiers Casino, with front man Philip Green. Sam soon doubles the casino's profits, with the extra unaccounted for cash skimmed directly from the casino count room, and delivered to the Midwest Mafia bosses. Chicago boss Remo Gaggi sends Sam's childhood friend and mob enforcer Nicky Santoro to protect Sam, the cash skim, and the casino. Nicky recruits his younger brother Dominick and childhood friend Frankie Marino to gather a experienced crew that specializes in shakedowns and jewelry burglaries. Nicky's Las Vegas criminal activities start drawing too much media and police attention and he is eventually placed in the Black Book, banning him from every casino in Nevada. Sam meets and falls in love with beautiful hustler showgirl, and former prostitute Ginger McKenna. They have a daughter, Amy, and marry, but their marriage is soon thrown into turmoil due to Ginger's relationship with her longtime boyfriend, con artist Lester Diamond. Sam has Nicky's crew beat Lester when they catch him accepting $25,000 from her. In the late 1970s, Ginger's problems intensify, as she turns to drugs and alcohol.\r\nIn 1976, Sam fires slot manager Don Ward for incompetence. Ward is brother-in-law to Clark County Commission chairman Pat Webb, who is unable to convince Sam to re-hire Ward. Webb arranges for Sam's gaming license to be denied, jeopardizing Sam's position. Sam starts hosting a local television talk show from inside the casino, irritating both Nicky and the bosses back home for bringing more unneeded attention. Sam blames Nicky's recklessness for ongoing police and state government pressure, and Sam's attempts to get Nicky to leave Las Vegas only result in further strain on their friendship.\r\nWhen the Midwest bosses discover that people on the inside are stealing from their skim, they install incompetent Kansas City underboss Artie Piscano to oversee the operation. Disobeying orders, Piscano keeps detailed written records of the operation. Additionally, an FBI bug placed in Piscano's grocery store catches him talking in detail about the skim, prompting a full investigation into the Tangiers Casino.\r\nIn 1980, Ginger kidnaps little Amy, planning to flee to Europe with her and Lester. Sam convinces Ginger to return with Amy, then overhears her planning on the phone to kill him. Enraged, Sam kicks her out of their home but relents and forgives her. Ginger confides in Nicky about the situation, and the two start an affair. Sam soon discovers their affair, confronts Ginger and ends his friendship with Nicky. Nicky ends his affair with Ginger once she asks him to kill Sam and threatens to go to the FBI. Ginger leaves Sam and takes all of her money and jewelry, then approached by the FBI, tells them nothing, but they already have all the evidence they need.\r\nIn 1982, the FBI discovers Pisacano's records, closes the Tangiers, and Green agrees to cooperate. The FBI approaches Sam for help by showing him photos of Nicky and Ginger together, but he turns them down. The Chicago bosses are arrested, get ready for trial, murdering anyone who might testify against them. In 1983, Ginger dies of a hot dose, presumably orchestrated by the mob. That same year, Sam narrowly survives a car bomb, suspecting Nicky to be the culprit. Sam states that the bosses did not authorize the bombing, because they had \"other ideas\" for him.\r\nIn 1986, the bosses, finally fed up with Nicky's recklessness, order Frankie and his crew to kill Nicky and Dominick. Invited to attend a meetup in an Illinois remote cornfield, they are brutally beaten there with baseball bats, stripped of their clothes and buried alive in a shallow grave. With the Mafia now out of the casino industry, nearly all of the old casinos are demolished, and new casinos are built with money from junk bonds. Sam laments the new impersonal, corporate-run resorts of Las Vegas. Because of his status as a reliable and high earner for the outfit, Sam is allowed to live and is last seen working as a sports handicapper in San Diego, right back where he started. Sam states, \"And why mess up a good thing? And that's that.\"\r\nCast\r\nRobert De Niro as Sam \"Ace\" Rothstein\r\nSharon Stone as Ginger McKenna\r\nJoe Pesci as Nicky Santoro\r\nJames Woods as Lester Diamond\r\nDon Rickles as Billy Sherbert\r\nAlan King as Andy Stone\r\nKevin Pollak as Phillip Green\r\nL. Q. Jones as Pat Webb\r\nDick Smothers as Senator\r\nFrank Vincent as Frank Marino\r\nJohn Bloom as Don Ward\r\nPasquale Cajano as Remo Gaggi\r\nMelissa Prophet as Jennifer Santoro\r\nBill Allison as John Nance\r\nVinny Vella as Artie Piscano\r\nOscar Goodman as Himself\r\nCatherine Scorsese as Piscano's mother\r\nPhilip Suriano as Dominick Santoro\r\nErika Von Tagen as Older Amy\r\nRichard Riehle as Charlie Clark\r\nFrankie Avalon as Himself\r\nSteve Allen as Himself\r\nJayne Meadows as Herself\r\nJerry Vale as Himself\r\nJoseph Rigano as Vincent Borelli\r\nGene Ruffini as Vinny Forlano\r\nPaul Herman as Gambler in Phone Booth\r\nProduction\r\nDevelopment\r\nCasino is based on New York crime reporter Nicholas Pileggi's book Casino: Love and Honor in Las Vegas. The research for Casino began when Pileggi read a 1980 report from the Las Vegas Sun about a domestic argument between Frank \"Lefty\" Rosenthal, a casino figure, and his wife Geri McGee, a former topless dancer. This gave him an idea to focus on a new book about the true story of mob infringement in Las Vegas during the 1970s, when filming of Goodfellas (whose screenplay he co-wrote with Scorsese) was coming to an end. The fictional Tangiers resort reflected the story of the Stardust Resort and Casino, which had been bought by Argent Corporation in 1974 using loans from the Teamsters Central States Pension Fund. Argent was owned by Allen Glick, but the casino was believed to be controlled by various organized crime families from the Midwest. Over the next six years, Argent Corporation siphoned off between $7 and $15 million using rigged scales. This skimming operation, when uncovered by the FBI, was the largest ever exposed. A number of organized crime figures were convicted as a result of the skimming.\r\nPileggi contacted Scorsese about taking the lead of the project, which became known as Casino. Scorsese expressed interest, calling this an \"idea of success, no limits.\" Pileggi was keen to release the book and then concentrate on a film adaptation, but Scorsese encouraged him to \"reverse the order.\"\r\nScorsese and Pileggi collaborated on the script for five months, towards the end of 1994. Real-life characters were reshaped, such as Frank \"Lefty\" Rosenthal, Geri McGee, Anthony Spilotro, and Spilotro's brother Michael. Some characters were combined, and parts of the story were set in Kansas City instead of Chicago. A problem emerged when they were forced to refer to Chicago as \"back home\" and use the words \"adapted from a true story\" instead of \"based on a true story.\" Real life mobster turned witness Frank Cullotta inspired the character Frank Marino (played by Frank Vincent), served as a technical advisor for the film, and also played an on-screen role as a hitman.\r\nThey also decided to simplify the script, so that the character of Sam \"Ace\" Rothstein worked only at the Tangiers Casino, in order to show a glimpse of the trials involved in operating a Mafia-run casino hotel without overwhelming the audience. According to Scorsese, the initial opening sequence was to feature the main character, Sam Rothstein, fighting with his estranged wife Ginger on the lawn of their house. The scene was too detailed, so they changed the sequence to show the explosion of Sam's car and him flying into the air before hovering over the flames in slow motion—like a soul about to go straight down to hell.\r\nPrincipal photography\r\nFilming took place at night in the Riviera casino in Las Vegas, with the nearby defunct Landmark Hotel as the entrance, to replicate the fictional Tangiers. According to Barbara De Fina, the film's producer, there was no reason to construct a set if they could simply film around an actual casino. The opening scene, with Sam's car exploding, was shot three times; the third take was used for the film. Saul Bass designed the title sequence, which was his last work. The total cost for the titles was $11,316, not including the fees for the Basses. Bass justified the cost to De Fina by noting that creating a continuous explosion from a second shot of an explosion demanded a lot of experimentation, as did getting the flight path of the body exactly right. When first submitted to the MPAA, the film received an NC-17 rating due to its depictions of violence. Several edits were made in order to reduce the rating to R.\r\nThe film was shot in the common-top Super 35 format as it allowed the picture to be reformatted for television broadcast. Scorsese said, \"I wish I could just shoot straight anamorphic, but the lenses we had in this situation were actually much more diversified. To a certain extent, shooting a film this way can make certain technical aspects more difficult, but to me, anything is better than panning and scanning on TV. We can re-frame just about every shot we did on this picture for video.\" Cinematographer Robert Richardson, on the other hand, was not impressed with the quality of the release prints, and did not touch the format again until Kill Bill: Volume 1, at which point the digital intermediate process was available.\r\nReception\r\nBox office\r\nDuring its five-day Thanksgiving holiday weekend, Casino opened in fifth place at the box office, grossing $14.5 million. The film grossed $43 million domestically and $73 million internationally, for a total of $116 million worldwide, against a $40–50 million production budget.\r\nCritical response\r\nOn its release, the film received mostly positive reviews from critics, although their praise was more muted than it had been for the thematically similar Goodfellas, released only five years earlier, with some reviewers criticizing Scorsese for retreading familiar territory. On review aggregator Rotten Tomatoes, the film has an approval rating of 79% based on 70 reviews, with an average rating of 7.2/10. The site's critical consensus reads, \"Impressive ambition and bravura performances from an outstanding cast help Casino pay off in spite of a familiar narrative that may strike some viewers as a safe bet for director Martin Scorsese.\" On Metacritic, the film has a weighted average score of 73 out of 100, based on 17 critics, indicating \"generally favorable reviews.\" Audiences surveyed by CinemaScore gave the film a grade \"B−\" on scale of A+ to F.\r\nRoger Ebert of the Chicago Sun-Times gave the film four complete stars, stating that \"Martin Scorsese's fascinating new film Casino knows a lot about the Mafia's relationship with Las Vegas. Like The Godfather it makes us feel like eavesdroppers in a secret place.\" He added, \"Unlike his other Mafia movies (Mean Streets and Goodfellas), Scorsese's Casino is as concerned with history as with plot and character.\" Janet Maslin of The New York Times analyzed the film's journalistic approach resulted with \"no conveniently sharp focus, a plot built like a centipede and characters with lives too messy to form conventional dramatic arcs.\" Regardless, she praised Sharon Stone, writing she \"will be nobody's idea of Hollywood fluff after this spectacular, emblematic performance.\"\r\nTodd McCarthy of Variety felt the film \"possesses a stylistic boldness and verisimilitude that is virtually matchless\". He praised De Niro's performance as \"outstanding\" and felt Stone was \"simply a revelation here\". However, he noted Pesci \"holds up his end of the picture perfectly well, but Nicky is basically the same character he won an Oscar for in Goodfellas, but with a shade less of an edge.\" Peter Travers of Rolling Stone wrote the film \"is not the equal of Mean Streets or GoodFellas, the more instinctive pieces in the crime trilogy that the flawed Casino completes (Coppola's Godfather Part III fell off far more precipitously). It is, however, just as unmistakably the work of a virtuoso — bold, brutally funny and ferociously alive.\"\r\nKenneth Turan of the Los Angeles Times noted the film is a return to Scorsese's earlier gangster films, but felt he made \"too few emotional connections to persuade us to see things the way he does. So instead of being operatic and cathartic, this film ends up exhausting and claustrophobic.\" He praised the principal actors, most particularly highlighting Stone for displaying \"star quality and a feral intensity that is the equal of what the boys are putting down.\" Philip Thomas of Empire magazine praised the film while highlighting its similarities to Goodfellas. He gave the film five stars commenting \"It may not be Scorsese's greatest work, but this guy feeling a little off-colour is still far, far better than most people on fighting-fit form. It only gets more impressive as time goes on.\"\r\nGene Siskel of the Chicago Tribune gave the film 2+1⁄2 stars out of four, writing Casino is a \"sometime-dazzling, often-disappointing film from the great Martin Scorsese, who too often seems like he's replaying his greatest hits with this picture, and not to the best effect ... DeNiro's relationship with Cathy Moriarty in Raging Bull was better and the flash-temper role by Pesci is a carbon copy of his work in Goodfellas. Casino is hardly a bad film, but it breaks no new ground for Scorsese.\" Desson Howe of The Washington Post wrote the film is \"not great\" and that clearly \"Scorsese and Pileggi are trying to disinter the success of GoodFellas, their last collaboration. But they only come up with Raging B.S.\"\r\nThe film's critical profile has increased in years after its release, with critics Tom Charity and Natasha Vargas-Cooper expressing that they retrospectively feel Casino is a more accomplished and artistically mature work than the thematically similar Goodfellas.\r\nAccolades\r\nSoundtrack\r\nDisc 1\r\nDisc 2",
    "html": "<p>Casino is a 1995 American epic crime film directed by Martin Scorsese, produced by Barbara De Fina and distributed by Universal Pictures. It is based on the 1995 nonfiction book Casino: Love and Honor in Las Vegas by Nicholas Pileggi, who also co-wrote the screenplay along with Scorsese. It stars Robert De Niro, Sharon Stone, Joe Pesci, Don Rickles, Kevin Pollak, and James Woods. The film was the eighth collaboration between director Scorsese and De Niro.</p><p>Casino follows Sam \"Ace\" Rothstein (De Niro), a Jewish American gambling expert handicapper who is asked by the Chicago Outfit to oversee the day-to-day casino and hotel operations at the Tangiers Casino in Las Vegas. Other major characters include Nicky Santoro (Pesci), a \"made man\" and friend of Sam, and Ginger McKenna (Stone), a streetwise chip hustler whom Sam marries and has a daughter. The film details Sam's operation of the casino, the difficulties he confronts in his job, the Mafia's involvement with the casino, and the gradual breakdown of his relationships and standing, as Las Vegas changes over the years.</p><p>The primary characters are based on real people: Sam is inspired by the life of Frank Rosenthal, also known as \"Lefty,\" who ran the Stardust, Fremont, Marina, and Hacienda casinos in Las Vegas for the Chicago Outfit from 1968 until 1981. Nicky and Ginger are based on mob enforcer Anthony Spilotro and former dancer and socialite Geri McGee, respectively.</p><p>Casino was released on November 22, 1995, by Universal Pictures, to a mostly positive critical reception, and was a worldwide box office success. Stone's performance was singled out for acclaim, earning her a Golden Globe Award for Best Actress in a Motion Picture – Drama and a nomination for the Academy Award for Best Actress.</p><br/><h3>Plot</h3><p>In 1973, sports handicapper and Mafia associate Sam \"Ace\" Rothstein is sent by the Chicago Mafia to Las Vegas to run the Tangiers Casino, with front man Philip Green. Sam soon doubles the casino's profits, with the extra unaccounted for cash skimmed directly from the casino count room, and delivered to the Midwest Mafia bosses. Chicago boss Remo Gaggi sends Sam's childhood friend and mob enforcer Nicky Santoro to protect Sam, the cash skim, and the casino. Nicky recruits his younger brother Dominick and childhood friend Frankie Marino to gather a experienced crew that specializes in shakedowns and jewelry burglaries. Nicky's Las Vegas criminal activities start drawing too much media and police attention and he is eventually placed in the Black Book, banning him from every casino in Nevada. Sam meets and falls in love with beautiful hustler showgirl, and former prostitute Ginger McKenna. They have a daughter, Amy, and marry, but their marriage is soon thrown into turmoil due to Ginger's relationship with her longtime boyfriend, con artist Lester Diamond. Sam has Nicky's crew beat Lester when they catch him accepting $25,000 from her. In the late 1970s, Ginger's problems intensify, as she turns to drugs and alcohol.</p><p>In 1976, Sam fires slot manager Don Ward for incompetence. Ward is brother-in-law to Clark County Commission chairman Pat Webb, who is unable to convince Sam to re-hire Ward. Webb arranges for Sam's gaming license to be denied, jeopardizing Sam's position. Sam starts hosting a local television talk show from inside the casino, irritating both Nicky and the bosses back home for bringing more unneeded attention. Sam blames Nicky's recklessness for ongoing police and state government pressure, and Sam's attempts to get Nicky to leave Las Vegas only result in further strain on their friendship.</p><p>When the Midwest bosses discover that people on the inside are stealing from their skim, they install incompetent Kansas City underboss Artie Piscano to oversee the operation. Disobeying orders, Piscano keeps detailed written records of the operation. Additionally, an FBI bug placed in Piscano's grocery store catches him talking in detail about the skim, prompting a full investigation into the Tangiers Casino.</p><p>In 1980, Ginger kidnaps little Amy, planning to flee to Europe with her and Lester. Sam convinces Ginger to return with Amy, then overhears her planning on the phone to kill him. Enraged, Sam kicks her out of their home but relents and forgives her. Ginger confides in Nicky about the situation, and the two start an affair. Sam soon discovers their affair, confronts Ginger and ends his friendship with Nicky. Nicky ends his affair with Ginger once she asks him to kill Sam and threatens to go to the FBI. Ginger leaves Sam and takes all of her money and jewelry, then approached by the FBI, tells them nothing, but they already have all the evidence they need.</p><p>In 1982, the FBI discovers Pisacano's records, closes the Tangiers, and Green agrees to cooperate. The FBI approaches Sam for help by showing him photos of Nicky and Ginger together, but he turns them down. The Chicago bosses are arrested, get ready for trial, murdering anyone who might testify against them. In 1983, Ginger dies of a hot dose, presumably orchestrated by the mob. That same year, Sam narrowly survives a car bomb, suspecting Nicky to be the culprit. Sam states that the bosses did not authorize the bombing, because they had \"other ideas\" for him.</p><p>In 1986, the bosses, finally fed up with Nicky's recklessness, order Frankie and his crew to kill Nicky and Dominick. Invited to attend a meetup in an Illinois remote cornfield, they are brutally beaten there with baseball bats, stripped of their clothes and buried alive in a shallow grave. With the Mafia now out of the casino industry, nearly all of the old casinos are demolished, and new casinos are built with money from junk bonds. Sam laments the new impersonal, corporate-run resorts of Las Vegas. Because of his status as a reliable and high earner for the outfit, Sam is allowed to live and is last seen working as a sports handicapper in San Diego, right back where he started. Sam states, \"And why mess up a good thing? And that's that.\"</p><br/><h3>Cast</h3><ul><li>Robert De Niro as Sam \"Ace\" Rothstein</li><li>Sharon Stone as Ginger McKenna</li><li>Joe Pesci as Nicky Santoro</li><li>James Woods as Lester Diamond</li><li>Don Rickles as Billy Sherbert</li><li>Alan King as Andy Stone</li><li>Kevin Pollak as Phillip Green</li><li>L. Q. Jones as Pat Webb</li><li>Dick Smothers as Senator</li><li>Frank Vincent as Frank Marino</li><li>John Bloom as Don Ward</li><li>Pasquale Cajano as Remo Gaggi</li><li>Melissa Prophet as Jennifer Santoro</li><li>Bill Allison as John Nance</li><li>Vinny Vella as Artie Piscano</li><li>Oscar Goodman as Himself</li><li>Catherine Scorsese as Piscano's mother</li><li>Philip Suriano as Dominick Santoro</li><li>Erika Von Tagen as Older Amy</li><li>Richard Riehle as Charlie Clark</li><li>Frankie Avalon as Himself</li><li>Steve Allen as Himself</li><li>Jayne Meadows as Herself</li><li>Jerry Vale as Himself</li><li>Joseph Rigano as Vincent Borelli</li><li>Gene Ruffini as Vinny Forlano</li><li>Paul Herman as Gambler in Phone Booth</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Casino is based on New York crime reporter Nicholas Pileggi's book Casino: Love and Honor in Las Vegas. The research for Casino began when Pileggi read a 1980 report from the Las Vegas Sun about a domestic argument between Frank \"Lefty\" Rosenthal, a casino figure, and his wife Geri McGee, a former topless dancer. This gave him an idea to focus on a new book about the true story of mob infringement in Las Vegas during the 1970s, when filming of Goodfellas (whose screenplay he co-wrote with Scorsese) was coming to an end. The fictional Tangiers resort reflected the story of the Stardust Resort and Casino, which had been bought by Argent Corporation in 1974 using loans from the Teamsters Central States Pension Fund. Argent was owned by Allen Glick, but the casino was believed to be controlled by various organized crime families from the Midwest. Over the next six years, Argent Corporation siphoned off between $7 and $15 million using rigged scales. This skimming operation, when uncovered by the FBI, was the largest ever exposed. A number of organized crime figures were convicted as a result of the skimming.</p><p>Pileggi contacted Scorsese about taking the lead of the project, which became known as Casino. Scorsese expressed interest, calling this an \"idea of success, no limits.\" Pileggi was keen to release the book and then concentrate on a film adaptation, but Scorsese encouraged him to \"reverse the order.\"</p><p>Scorsese and Pileggi collaborated on the script for five months, towards the end of 1994. Real-life characters were reshaped, such as Frank \"Lefty\" Rosenthal, Geri McGee, Anthony Spilotro, and Spilotro's brother Michael. Some characters were combined, and parts of the story were set in Kansas City instead of Chicago. A problem emerged when they were forced to refer to Chicago as \"back home\" and use the words \"adapted from a true story\" instead of \"based on a true story.\" Real life mobster turned witness Frank Cullotta inspired the character Frank Marino (played by Frank Vincent), served as a technical advisor for the film, and also played an on-screen role as a hitman.</p><p>They also decided to simplify the script, so that the character of Sam \"Ace\" Rothstein worked only at the Tangiers Casino, in order to show a glimpse of the trials involved in operating a Mafia-run casino hotel without overwhelming the audience. According to Scorsese, the initial opening sequence was to feature the main character, Sam Rothstein, fighting with his estranged wife Ginger on the lawn of their house. The scene was too detailed, so they changed the sequence to show the explosion of Sam's car and him flying into the air before hovering over the flames in slow motion—like a soul about to go straight down to hell.</p><h4>Principal photography</h4><p>Filming took place at night in the Riviera casino in Las Vegas, with the nearby defunct Landmark Hotel as the entrance, to replicate the fictional Tangiers. According to Barbara De Fina, the film's producer, there was no reason to construct a set if they could simply film around an actual casino. The opening scene, with Sam's car exploding, was shot three times; the third take was used for the film. Saul Bass designed the title sequence, which was his last work. The total cost for the titles was $11,316, not including the fees for the Basses. Bass justified the cost to De Fina by noting that creating a continuous explosion from a second shot of an explosion demanded a lot of experimentation, as did getting the flight path of the body exactly right. When first submitted to the MPAA, the film received an NC-17 rating due to its depictions of violence. Several edits were made in order to reduce the rating to R.</p><p>The film was shot in the common-top Super 35 format as it allowed the picture to be reformatted for television broadcast. Scorsese said, \"I wish I could just shoot straight anamorphic, but the lenses we had in this situation were actually much more diversified. To a certain extent, shooting a film this way can make certain technical aspects more difficult, but to me, anything is better than panning and scanning on TV. We can re-frame just about every shot we did on this picture for video.\" Cinematographer Robert Richardson, on the other hand, was not impressed with the quality of the release prints, and did not touch the format again until Kill Bill: Volume 1, at which point the digital intermediate process was available.</p><br/><h3>Reception</h3><h4>Box office</h4><p>During its five-day Thanksgiving holiday weekend, Casino opened in fifth place at the box office, grossing $14.5 million. The film grossed $43 million domestically and $73 million internationally, for a total of $116 million worldwide, against a $40–50 million production budget.</p><h4>Critical response</h4><p>On its release, the film received mostly positive reviews from critics, although their praise was more muted than it had been for the thematically similar Goodfellas, released only five years earlier, with some reviewers criticizing Scorsese for retreading familiar territory. On review aggregator Rotten Tomatoes, the film has an approval rating of 79% based on 70 reviews, with an average rating of 7.2/10. The site's critical consensus reads, \"Impressive ambition and bravura performances from an outstanding cast help Casino pay off in spite of a familiar narrative that may strike some viewers as a safe bet for director Martin Scorsese.\" On Metacritic, the film has a weighted average score of 73 out of 100, based on 17 critics, indicating \"generally favorable reviews.\" Audiences surveyed by CinemaScore gave the film a grade \"B−\" on scale of A+ to F.</p><p>Roger Ebert of the Chicago Sun-Times gave the film four complete stars, stating that \"Martin Scorsese's fascinating new film Casino knows a lot about the Mafia's relationship with Las Vegas. Like The Godfather it makes us feel like eavesdroppers in a secret place.\" He added, \"Unlike his other Mafia movies (Mean Streets and Goodfellas), Scorsese's Casino is as concerned with history as with plot and character.\" Janet Maslin of The New York Times analyzed the film's journalistic approach resulted with \"no conveniently sharp focus, a plot built like a centipede and characters with lives too messy to form conventional dramatic arcs.\" Regardless, she praised Sharon Stone, writing she \"will be nobody's idea of Hollywood fluff after this spectacular, emblematic performance.\"</p><p>Todd McCarthy of Variety felt the film \"possesses a stylistic boldness and verisimilitude that is virtually matchless\". He praised De Niro's performance as \"outstanding\" and felt Stone was \"simply a revelation here\". However, he noted Pesci \"holds up his end of the picture perfectly well, but Nicky is basically the same character he won an Oscar for in Goodfellas, but with a shade less of an edge.\" Peter Travers of Rolling Stone wrote the film \"is not the equal of Mean Streets or GoodFellas, the more instinctive pieces in the crime trilogy that the flawed Casino completes (Coppola's Godfather Part III fell off far more precipitously). It is, however, just as unmistakably the work of a virtuoso — bold, brutally funny and ferociously alive.\"</p><p>Kenneth Turan of the Los Angeles Times noted the film is a return to Scorsese's earlier gangster films, but felt he made \"too few emotional connections to persuade us to see things the way he does. So instead of being operatic and cathartic, this film ends up exhausting and claustrophobic.\" He praised the principal actors, most particularly highlighting Stone for displaying \"star quality and a feral intensity that is the equal of what the boys are putting down.\" Philip Thomas of Empire magazine praised the film while highlighting its similarities to Goodfellas. He gave the film five stars commenting \"It may not be Scorsese's greatest work, but this guy feeling a little off-colour is still far, far better than most people on fighting-fit form. It only gets more impressive as time goes on.\"</p><p>Gene Siskel of the Chicago Tribune gave the film 2+1⁄2 stars out of four, writing Casino is a \"sometime-dazzling, often-disappointing film from the great Martin Scorsese, who too often seems like he's replaying his greatest hits with this picture, and not to the best effect ... DeNiro's relationship with Cathy Moriarty in Raging Bull was better and the flash-temper role by Pesci is a carbon copy of his work in Goodfellas. Casino is hardly a bad film, but it breaks no new ground for Scorsese.\" Desson Howe of The Washington Post wrote the film is \"not great\" and that clearly \"Scorsese and Pileggi are trying to disinter the success of GoodFellas, their last collaboration. But they only come up with Raging B.S.\"</p><p>The film's critical profile has increased in years after its release, with critics Tom Charity and Natasha Vargas-Cooper expressing that they retrospectively feel Casino is a more accomplished and artistically mature work than the thematically similar Goodfellas.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Association</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient</th><th scope=\"col\">Result</th></tr><tr><td>20/20 Awards</td><td>Best Film Editing</td><td><span>Thelma Schoonmaker</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Academy Awards</span></td><td><span>Best Actress</span></td><td><span>Sharon Stone</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>Thelma Schoonmaker</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Awards Circuit Community Awards</td><td colspan=\"2\">Best Cast Ensemble</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Cahiers du Cinéma</span></td><td><span>Best Film</span></td><td rowspan=\"2\"><span>Martin Scorsese</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td rowspan=\"2\"><span>Chicago Film Critics Association Awards</span></td><td><span>Best Director</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td rowspan=\"3\">Sharon Stone</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Dallas–Fort Worth Film Critics Association Awards</span></td><td><span>Best Actress</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Golden Globe Awards</span></td><td><span>Best Actress in a Motion Picture – Drama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Martin Scorsese</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>MTV Movie Awards</span></td><td><span>Best Female Performance</span></td><td>Sharon Stone</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Villain</span></td><td><span>Joe Pesci</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Nastro d'Argento</span></td><td>Best Foreign Director</td><td>Martin Scorsese</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Production Design</td><td><span>Dante Ferretti</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Male Dubbing</td><td><span>Gigi Proietti</span> <small>(for dubbing <span>Robert De Niro</span>)</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Soundtrack</h3><h4>Disc 1</h4><h4>Disc 2</h4><br/>"
  },
  "errorMessage": ""
}