{
  "imDbId": "tt0050212",
  "title": "The Bridge on the River Kwai",
  "fullTitle": "The Bridge on the River Kwai (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Richard Roeper",
      "link": "https://www.rogerebert.com/reviews/great-movie-the-bridge-on-the-river-kwai-1957",
      "rate": "100",
      "content": "The story in the jungle moves ahead neatly, economically, powerfully."
    },
    {
      "publisher": "Empire",
      "author": "Ian Nathan",
      "link": "https://www.empireonline.com/movies/reviews/bridge-river-kwai-review/",
      "rate": "100",
      "content": "Possibly Lean's most complicated movie, Kwai is a towering work."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1957/film/reviews/the-bridge-on-the-river-kwai-2-1200418413/",
      "rate": "100",
      "content": "A gripping drama, expertly put together and handled with skill in all departments. Its potency stems only partly from the boxoffice draw of William Holden and, to a lesser degree, Alec Guinness. What elevates “Kwai” to the rank of an artistic and financial triumph for producer Sam Spiegel is the engrossing entertainment it purveys, including some scenes which will be listed as among the best of film memorabilia."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9A01E6DD1739E33BBC4152DFB467838C649EDE",
      "rate": "100",
      "content": "Brilliant is the word, and no other, to describe the quality of skills that have gone into the making of this picture, from the writing of the script out of a novel by the Frenchman Pierre Boulle, to direction, performance, photographing, editing and application of a musical score."
    },
    {
      "publisher": "Slant Magazine",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Whereas Lawrence of Arabia and Doctor Zhivago feel more pictorial than cinematic, The Bridge on the River Kwai carefully builds its psychological tension until it erupts in a blinding flash of sulfur and flame."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/bridge-on-the-river-kwai-the",
      "rate": "100",
      "content": "The post-World War II cinematic landscape is littered with big-budget movies about the conflict and the toll it took upon those who participated. Some of those pictures have become timeless classics and some are nearly forgotten. Few, if any, are as simultaneously thrilling, awe-inspiring, and tragic as The Bridge on the River Kwai"
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "",
      "rate": "100",
      "content": "Brilliant performances are to be credited to Alec Guinness, as the British colonel, who insists on sticking to the rules of the Geneva Conference governing prisoners of war, and Sessue Hayakawa as the stubborn, cruel, proud Japanese officer."
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/the-bridge-on-the-river-kwai/review/2030361287/",
      "rate": "100",
      "content": "This intelligent and exciting WWII tale, masterfully helmed by Lean (at the start of his \"epic\" period), features a splendid performance from Guinness as Col. Nicholson, a British officer who has surrendered with his regiment to the Japanese in Burma in 1943."
    },
    {
      "publisher": "",
      "author": "Entertainment Weekly",
      "link": "https://ew.com/article/2000/11/24/bridge-river-kwai/",
      "rate": "100",
      "content": "The Bridge on the River Kwai is that rare film about something as seemingly black-and-white as World War II that is colored entirely in shades of gray, and the better for it."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "50",
      "content": "For what it is, it ain't bad, though it serves mainly as an illustration of the ancient quandary of revisionist moviemakers: if all you do is systematically invert cliches, you simply end up creating new ones."
    }
  ],
  "errorMessage": ""
}