{
  "imDbId": "tt0050212",
  "title": "The Bridge on the River Kwai",
  "fullTitle": "The Bridge on the River Kwai (1957)",
  "type": "Movie",
  "year": "1957",
  "items": [
    {
      "username": "EUyeshima",
      "userUrl": "https://www.imdb.com/user/ur3608743",
      "reviewLink": "https://www.imdb.com/review/rw1383383",
      "warningSpoilers": true,
      "date": "1 June 2006",
      "rate": "10",
      "helpful": "74 out of 86 found this helpful.",
      "title": "Still Stirring Wartime Adventure and Compelling Psychological Drama Exhibit David Lean at His Peak",
      "content": "After years of more intimate British films and just discovering the joys of location shooting with 1955's \"Summertime\", master director David Lean made his first actual widescreen epic with 1957's \"The Bridge on the River Kwai\", an acknowledged classic that deserves attention from a new generation of viewers and another visit from the rest of us who love perfectly executed films by an unparalleled craftsman. Recently, this movie has been overshadowed by his 1962 follow-up epic, the comparatively more elaborate \"Lawrence of Arabia\", but this richly textured WWII-set adventure is special enough on its own terms. While it has its share of action and suspense presented in exacting detail, the film is even more resonant as a psychological drama about the test of wills between mission-driven officers amid the perils of wartime survival.The plot takes place in 1943 when after surrendering in Singapore, Col. Nicholson marches his ragged British company into a Japanese prisoner work camp in the Burmese jungle (this is where the famous whistling of \"Colonel Bogey March\" is first heard). The erudite Col. Saito runs the camp and demands that the new prisoners build a massive railway bridge, a critical juncture between Rangoon and Malaysia. In a classic stand-off, Nicholson finally forces Saito to respect Geneva Convention and not allow his officers to do manual labor on the construction. Upon his ironic Pyrrhic victory, Nicholson slowly descends into the madness of seeing the completed bridge as a potential morale booster for his battle-weary men. Meanwhile, shortly after Nicholson's arrival, U.S. Navy Cmdr. Shears escapes from the camp only to be later blackmailed into joining a British commando mission led by do-or-die Maj. Warden and hesitant Lt. Joyce with the sole goal of blowing up the bridge. Through Peter Taylor's thoughtful film editing, the movie breathlessly alternates between the parallel story lines of the bridge construction and the jungle commando mission until the exciting climax.Lean's accomplishments are many with this memorable film - the authenticity of the Burmese jungle locations (filmed in Sri Lanka), the seamless integration of the two story lines, the masterful handing of the final scenes, and in particular, the gradual metamorphosis of Nicholson from a by-the-book British officer to Saito's willing collaborator. A frequent participant in Lean's films, Alec Guinness gives his career-best performance as Nicholson providing all sorts of unexpected shades to his complex characterization. As Shears, William Holden does what he did best in the 1950's, concurrently exude natural bravado and a conflicted soul and then added a layer of cynicism that dares to challenge the viewer to support him. The 68-year old Sessue Hayakawa came out of retirement to play Saito and delivers a subtle performance of unbending discipline and pained humiliation. Jack Hawkins and Geoffrey Horne lend sturdy support as Warden and Joyce respectively. With the same expert eye he lent to \"Summertime\", Jack Hildyard provides the superbly expressive and composed cinematography. Michael Wilson and Carl Foreman, both blacklisted at the time, wrote the brilliantly developed screenplay. This is essential viewing.The two-disc 2000 Limited Edition DVD set has a pristine print transfer with great sound making the entire experience feel surprisingly fresh upon viewing. There is a nearly hour-long documentary on Disc Two, \"The Making of The Bridge on the River Kwai\", produced for the DVD and full of intriguing insight into the production logistics. There are a couple of shorter featurettes produced around the time of the film's original release, the first is a black-and-white teaser for the film itself and the second a rather pedestrian lesson in Film 101 produced by USC grad students and introduced by Holden. Director John Milius provides a respectful tribute to the film in another short."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw0060654",
      "warningSpoilers": false,
      "date": "5 April 2003",
      "rate": "",
      "helpful": "82 out of 102 found this helpful.",
      "title": "Nothing less than a masterpiece...",
      "content": "About as Oscar-worthy as any film made in the '50s is David Lean's gripping BRIDGE ON THE RIVER KWAI. Based loosely on a real-life incident, it tells the story of an imprisoned British officer (Alec Guinness) who loses sight of his mission when forced to build a bridge for the Japanese that will enable the enemy to carry supplies by train through the jungle during World War II. Guinness plays the crisp British officer to perfection, brilliant in all of his scenes but especially in his confrontations with Sessue Hayakawa. William Holden has a pivotal role as one of the prisoners who escapes and enjoys his freedom for awhile before being asked to return with a small squadron to destroy the bridge. Jack Hawkins and Geoffrey Horne have colorful roles too and all are superb under David Lean's direction.The jungle settings filmed in Ceylon add the necessary realism to the project and there is never a suspension of interest although the story runs well over two-and-a-half hours. The film builds to a tense and magnificent climax with an ending that seems to be deliberately ambiguous and thought provoking. Well worth watching, especially if shown in the restored letterbox version now being shown on TCM.Some of the best lines go to William Holden and he makes the most of a complex role--a mixture of cynicism and heroism in a character that ranks with his best anti-hero roles in films of the '50s. He brings as much conviction to his role as Alec Guinness does and deserved a Best Actor nomination that he did not get."
    },
    {
      "username": "jhclues",
      "userUrl": "https://www.imdb.com/user/ur0785249",
      "reviewLink": "https://www.imdb.com/review/rw0060625",
      "warningSpoilers": false,
      "date": "9 June 2001",
      "rate": "10",
      "helpful": "138 out of 178 found this helpful.",
      "title": "The Definitive Guinness Performance",
      "content": "Within the Conflict that was World War II, there were many more smaller, more personal conflicts which, when added up, made a significant impact on the outcome of the War; though trying to explain them, or war in general, is like attempting to decipher the indecipherable. In `The Bridge On the River Kwai,' director David Lean takes you deep into the Burmese jungle to examine some of these deeper conflicts, and the effects of extraordinary circumstances on some ordinary men: British Colonel Nicholson (Alec Guinness) is a man of rigid principles and ideals, to whom acquiescence in any quarter is not an option; Japanese Colonel Saito (Sessue Hayakawa) lives by an inflexible code of conduct and is adamant in his adherence to it, through which he maintains his dignity and honor; American Navy Commander Shears (William Holden) just wants to make it through the war alive and get back home. As an integral part of their war effort, the Japanese have ordered a strategic bridge to be built across the Kwai River to facilitate the transport of troops and equipment. This monumental task has been given to Saito, the commandant of an allied prisoners-of-war camp; and not only must he build it, it must be completed by a specific date. And time is short. Toward that end, Saito has pressed into service every prisoner, including officers, whom according to the Geneva Convention of 1864 (which established rules for the humane treatment of prisoners of war), are to be excluded from any manual labor. When a fresh contingent of British prisoners arrives to bolster his complement of workers, Saito finds himself up against a formidable opponent, Nicholson, who immediately informs Saito that his officers will not work, in accordance with the rules of the Geneva Convention. And it's the beginning of another war-- a war of wills-- between two men determined to win at any cost. To Saito, this is more than just another assignment, it's an obligation, and failure is not an option. If he does not succeed in having the bridge built-- and on time-- he will be forced to take his own life, in accordance with his own moral code. Nicholson, on the other hand, is unyielding to the point of madness, and will die before he accedes to Saito's demands. Meanwhile Shears has managed by some miracle to escape and has made his way back to Ceylon. And he's home free-- after some recuperation time at Mount Lavinia Hospital, he'll be on his way back to the states. Or so he thinks. But unbeknownst to him, the British are aware of the bridge being built on the Kwai, and are planning a commando raid to destroy it. And Shears has something they need: First hand knowledge of the precise location, and of the jungle through which he made his miraculous escape. Subsequently, the Navy agrees to `loan' Shears to the British, to aid them with their mission. So instead of a ticket home, Shears is faced with another arduous trek through an uncompromising jungle, all for a mission of which the odds against success are nearly incalculable. From the beginning of the film to it's spectacular climax, Lean builds and maintains a subtle tension that underscores the drama, which makes this a compelling, unforgettable motion picture. Lean is the Master of epic films such as this, filling them with sweeping visuals while integrating them with the emotional involvement of his characters perfectly. Lean knows what he wants and how to get it, and he takes a terrific story (and this definitely is one) and tells it by using every bit of space--visually and audibly-- at this disposal. And most importantly, he knows how to get the kind of performances from his actors to put it all across so convincingly and believably. Alec Guinness deservedly received the Oscar for Best Actor for his role of Nicholson, whom he embodies from the inside out, disappearing so utterly into the character that the actor is forgotten, leaving nothing but the real man in his stead. It's a superlative piece of acting from one of the truly great actors of all times. Holden, as well, delivers an outstanding performance as Shears, capturing that somewhat embittered, off-handed sarcasm and resignation of a man trapped by circumstances beyond his control, who nevertheless does what he can to make the most of it, while awaiting the first opportunity for escape that affords itself. Holden's work here is Award-worthy, as well, but was destined to forever remain in the shadows of what is probably the definitive Guinness performance. And what a rare treat, having two performances of this caliber in a single film. Other notable performances include Hayakawa, entirely convincing as the tormented Saito, and Jack Hawkins, as demolition expert Major Warden, the absolute personification of the undaunted British stiff-upper-lip. The supporting cast includes James Donald (Clipton), Geoffrey Horne (Joyce), Percy Herbert (Grogan), Ann Sears (Nurse) and Andre Morell (Green). Beautifully filmed and expertly crafted and delivered, `The Bridge On the River Kwai' is one of David Lean's masterpieces. It's an emotionally involving, dramatic action/adventure that offers some real insight into the determination and tenacity of the human spirit. This film (especially the ending) is one you will never forget; a classic in every sense of the word, it exemplifies the magic of the movies. I rate this one 10/10."
    },
    {
      "username": "bat-5",
      "userUrl": "https://www.imdb.com/user/ur0100620",
      "reviewLink": "https://www.imdb.com/review/rw0060650",
      "warningSpoilers": false,
      "date": "19 February 1999",
      "rate": "10",
      "helpful": "74 out of 89 found this helpful.",
      "title": "They don't make movies like this anymore.",
      "content": "I recently saw The Bridge on the River Kwai at the Cinerama Dome, and it was quite spectacular. Unlike some of today's grand adventure films, you get to know the characters along with seeing great scenes of acting and cinematography. Alec Guinness is at the top of his form as the single minded Colonel Nicholson. The scene between Nicholson and Saito in Saito's hut is remarkable. Nicholson still will not concede defeat, he even takes offense that other officers of different armies gave in and worked alongside the enlisted men. Saito can't understand Nicholson's acceptance of his punishment, and it drives him crazy. The film's plot has two stories that are beautifully intertwined. Shears' return to the bridge is his only way to escape the bridge. In the film's final act, the tension is turned up as the British commandos try to blow up the bridge, and a train, and only then does Nicholson realise what the bridge really is. The Bridge on the River Kwai is one film that is hard to top, the only film able to do that is Lawrence of Arabia, both directed by the meticulous eye of David Lean. One director who could put intimacy in epic circumstances."
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw1871684",
      "warningSpoilers": false,
      "date": "10 May 2008",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "\"This is not a game of cricket\"",
      "content": "The Bridge on the River Kwai – David Lean's first epic, a genre he would later be associated with more than any other. Previously having made his mark as a director of deep and often psychological dramas, Lean's easy transition into bigger pictures reflects the change that was taking place in the genre itself, moving from the grandiose spectacle of De Mille et al, towards the \"intimate\" epic of the late 50s and early 60s.We are also here seeing the development of the war, or rather, the anti-war picture. Prior to this most anti-war or anti-military pictures were small-scale dramas, whereas all the big war films were rousing flag wavers. Bridge on the River Kwai ticks both boxes, and is all the more effective for it. It is an anti-war film which prevents itself from becoming static or preachy, and an action film with a humanist edge.The problem presented to David Lean, aside from the fact that he had never done anything on this scale before, is that Michael Wilson and Carl Foreman's multi-layered screenplay contains many different strands, with stories told from multiple points of view. Lean fortunately had dealt with such fragmentary narratives before – 1952's The Sound Barrier for example – and here he actually uses the trappings of the epic to keep the narrative focused. This was the first time he had used the cinemascope aspect ratio, but rather than employing it purely to show off the stunning landscapes (although he does do a fair bit of that too, and why not?) he also uses the width of the screen to cram varying elements into the frame. For example, in the scene where Nicholson (Alec Guinness) surveys the railway construction with his fellow officers, the figure of Saito (Sessue Hayakawa) can be seen on a hill in the background. This reminds us of his presence, and subtly keeps his story arc going.Lean's use of colour is also remarkable. Of course, when your film is set in a PoW camp in the middle of a jungle, you have a fairly limited colour palette anyway, but Lean's crafty choice of camera angle and positioning is calculated to show off different tones at different times. In the opening moments, highly reminiscent of The African Queen (which, like Kwai, was produced by Sam Spiegel) he begins with the greens of the jungle – a fairly cold colour. As we descend through the trees, Lean gradually turns up the heat with those dusty yellows and browns. For the middle section of the film, he cools things off again with more lush greens and even some vibrant shades, before returning to the stark hot tones for the tense finale. Again, this is all very subtle director's work, but these touches do create little shifts in mood and influence the way we view each scene.Lean's handling of the larger canvas was however not yet quite up to best showing off his actors upon it. That's a shame with such a good cast, although Alec Guinness in one of his earliest non-comedic roles shone through enough to garner an Oscar. William Holden was also deserving of at least a nomination, but didn't get one. To my mind though the best performance of the picture was that of Sessue Hayakawa. Hayakawa was an incredibly powerful silent film actor – check him out in De Mille's The Cheat (1915) – and it's great to see him at the top of his game again here.Bombarded with awards, Bridge on the River Kwai is typical Oscar-winning fare, particularly for the conflicted political climate of the 1950s. It can be read as a damning critique of war, but also enjoyed as a gripping action film. This broad appeal, the depth of the screenplay and Lean's assured direction made it a hit in its day and allowed its popularity to endure in the generations since."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1351632",
      "warningSpoilers": true,
      "date": "25 April 2006",
      "rate": "10",
      "helpful": "50 out of 69 found this helpful.",
      "title": "Unlike The Bridge, This Movie Holds Up",
      "content": "SPOILER: This film is long (161 minutes), is almost 40 years old, and yet still is terrific, still holds up and will forever, I suspect, be considered one of the greatest war movies ever made.'Kwai' is particularly amazing in that there is very little action in it, yet it consistently entertains - during the actual movie and no matter when you see it. It entertained me when I saw in the theater as a 12- year-old as years later as a 50-something-year-old seeing it on DVD. I say this to encourage younger people to check this film out, and give it a chance. Anyone who is fascinated with character studies might find this particularly interesting with Alec Guiness' role in here as Colonel Nicholson. He was mesmerizing in his role. William Holden, Sessue Hayakawan, Jack Hawkins and the rest of the cast are all excellent, with the four mentioned above perhaps playing the roles of their lives.The gorgeous countryside of Ceylon is photographed beautifully. David Lean, one of the all-time great directors, did this film, too, so it certainly has good credentials. A winner of seven Oscars, this great movie has stood the test of time."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0060603",
      "warningSpoilers": true,
      "date": "25 December 1999",
      "rate": "9",
      "helpful": "37 out of 48 found this helpful.",
      "title": "Winner of 7 Academy Awards...",
      "content": "David Lean's \"The Bridge on the River Kwai\" like Jean Renoir's \"Grand Illusion\" is an anti-heroic war film, set in a prisoner of war camp environment... But there, the point of resemblance came to an end... \"The Bridge on the River Kwai\" is an adventure film in which the nature of World War II is explored... And if in \"Grand Illusion\" the characters were described by a great artist who treasures their common humanity, in \"The Bridge on the River Kwai\" they are forced to carry out their destinies by an officer who cannot bear to see his bridge blown up...Escape is almost impossible from the Japanese camp located near the Kwai River in Burma... The prisoners are badly treated by cruel guards... The camp commander is a rigid psychopath... Conditions are hard to bear... Psychological state of the war British prisoners in constant alteration...Into the presumptuous situation comes Colonel Nicholson (Alec Guinness in a fascinating performance), a strict, serene, dedicated British Officer, deeply concerned for the welfare of his men...Nicholson is under severe pressure from the stubborn Japanese Colonel Saito (Sessue Hayakawa) for insisting on his attachment to the Geneva convention and refusing to allow his officers to be used on the construction of the strategic bridge...Nichilson survives the oppressive punishment imposed on him, but his obsession has risen to near-madness... He agrees to help the Japanese build their bridge, and in his determination to find victory in defeat, he ignores that the bridge, which he insists must be a 'proper bridge,' will serve the Japanese objectives against the British troops...In addition to the powerful rules of a prison camp picture, captors against captives and an interesting moral respect to a military code, a third element, in the story, is introduced: a small commando team led by Major Warden (Jack Hawkins) and an American sailor (William Holden) whose mission is to destroy the strategic bridge..The film leads swiftly to a suspenseful climax: a Japanese train and a Commando force directed to a same goal, the Brige of the River Kwai...Each character, in the motion picture, has a valid reason for what he is doing, and each elaborates a relationship to the bridge revealed to be obsession and insane...\"The Bridge on the River Kwai\" hits with 'war' in a compelling logic of events, the indulgence of self-destruction.With a great visual beauty and terrific whistling tune March, \"The Bridge on the River Kwai\" is a great dramatic entertainment of the wills of men..."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8787869",
      "warningSpoilers": false,
      "date": "8 January 2023",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "David Lean's incredible masterpiece.",
      "content": "A group of British soldiers arrive in a Japanese prisoner of war camp, led by Colonel Nicholson, their captors order them to build a bridge linking Burma to Siam.Having recently been wowed by Lawrence of Arabia, Bridge on The River Kwai seemed like the next logical choice, it's been some time since I last watched it, and the memory I have going in, is that it's a masterpiece.I wonder if David Lean realised what he'd created when he completed this film, a timeless classic, a film for the ages.I know it's a film, but wow do you get a sense of what those poor men must have suffered, prisoners in the hands of a cruel bunch of captors, with no regard for international rule.Incredibly well made, a production of epic proportions that holds up perfectly to this day, amazing location work, costumes, and sets, and remember there were no special effects to rely on in 1957.So many scenes are incredible, so it's hard to highlight one, however the scene that had me hugely absorbed was that incredible moment where Nicholson and Colonel Saito try to come to an agreement about work on the bridge over a glass of Johnny Walker red label.Sir Alec Guinness gives arguably his finest ever performance, and let's be honest, he delivered countless masterclasses. His delivery and actions are incredible, Nicholson is tough, rigid, determined, proper and loaded with a sense of duty.What is fascinating to contemplate is Nicholson's real motive for choosing to convince the men to work, was it to keep them occupied, or for other reasons, such as a legacy to be admired, interesting.Amazing cast, William Holden, Jack Hawkins, Sessue Hayakawa, everyone plays their part.It's virtually perfect, 10/10."
    },
    {
      "username": "Haplo-4",
      "userUrl": "https://www.imdb.com/user/ur0222505",
      "reviewLink": "https://www.imdb.com/review/rw0060655",
      "warningSpoilers": false,
      "date": "22 February 1999",
      "rate": "8",
      "helpful": "94 out of 113 found this helpful.",
      "title": "A movie about madness",
      "content": "I have watched this movie several times and it is just getting better and better all the time. Why? Because this movie actually has a message built-in, this isn't a violent story, like \"Saving Private Ryan\" - also a good movie with a message - but it is still not a slow story.When I last saw it, I realised that there was something in the movie that I had never understood, this isn't a movie about war, torture or how it was to be a prisoner of war; this is a movie about madness and pride. The pride shows both in Saiko and Colonel Nicholson, they are so full of it that it is almost impossible for them to come to a civil-conclusion with the problems they have with each other. The madness is shown in Colonel Nicholson and Holden's character - here they are, two prisoners of war and they don't want to help each other out, instead they try to reach separate goals, and they are both willing to die for it.After you have watched this movie one is amazed by the performances made by Alec Guinness and William Holden and I must say that this is therefore one of the best War/Drama movies ever made My vote? 9 out of 10 naturally."
    },
    {
      "username": "calspers",
      "userUrl": "https://www.imdb.com/user/ur43544732",
      "reviewLink": "https://www.imdb.com/review/rw5111015",
      "warningSpoilers": false,
      "date": "9 September 2019",
      "rate": "8",
      "helpful": "13 out of 14 found this helpful.",
      "title": "\"It's a matter of principle\" - timeless direction by David Lean",
      "content": "\"The Bridge on the River Kwai\" is a prinoner-of-war drama at its best, masterfully directed by David Lean.Amazing direction, and the whole approach to making this film is timeless - a study in being ahead of its time. Stunning set pieces and production design - such and effort was put into this. Fantastic cinematography, filled to the brim with pitch-perfect pans, wide-shots, and tracking-shots. Intense and dramatic score, deservedly receiving one of the total of seven Academy Awards. Brilliant cast and in particular Alec Guinness, who perfectly portrays a man of honour.What is a big shame is the way Colonel Philip Toosey - the original colonel, portrayed through Nicholson - was misrepresented, in that he actually acted very differently and much more courageously than in the film.Nonetheless, as a look into the historic event that took place in 1943 Burma, it is absolutely brilliant, and although the film does not carry loads of emotional moments, it is technically excellent, and greatly entertaining.Highly recommended."
    },
    {
      "username": "theowinthrop",
      "userUrl": "https://www.imdb.com/user/ur3280905",
      "reviewLink": "https://www.imdb.com/review/rw1464105",
      "warningSpoilers": true,
      "date": "1 September 2006",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "\"Madness, Madness\"",
      "content": "Let's face it - war is organized madness, and although the stakes in World War II were tremendous for whichever side lost, the individual effects of the war on the men and nations involved caused madness on several levels.Pierre Boule's short novel brilliantly discusses the madness in the crazy situation that sweeps up Colonels Nicholson and Saito. Under normal circumstances, the two men might never had been friends but they might have had a degree of respect for each other. Both come from nations that have long histories and traditions, and whose officer corps prided themselves on leadership and withstanding privations. The Japanese formalized these traditions in the code of Bushido (which was twisted, unfortunately, in World War II). It included sharing privation with one's men and was similar to the concept of noblesse oblige that the aristocratic officers of Britain's army tried to maintain. Nicholson's stoicism when put into the isolation box was as much in his tradition as Saito's tradition would have included willingly reducing his own share of his rations for the benefit of his men in a siege.The situation that develops is a racial rivalry. The Japanese, in 1943, have won so many of the campaigns, and witnessed the surrender of Allied (i.e. Western - American, British, French, Dutch troops) that they really have a contempt for them. As we now know was true, the Japanese soldiers frequently fought to the last man (think of Saipan and Okinawa in the last stages of the war, where flame throwers were frequently used to force Japanese soldiers and civilians out into the open). Westerners could do this too, but traditionally the western states saw no shame in surrendering after putting up a hard fight. Not so the Japanese military.Saito is identifying with this tradition. In the novel, he is also disappointed that he is in charge of a prisoner of war camp - he'd prefer to be back in the fighting. But they need the prisoners to build the railroads throughout the new Japanese empire (as mentioned on another comment, the \"Greater East Asiatic Co-Prosperity Sphere\") that can have men and material race from one end of the empire to the other.In reality this frequently ended up more like slave labor than what Boule arranges (or what Saito probably had in mind). Nicholson insists on treatment under the Geneva convention for P.O.W.s, but Saito thinks it's typically Western and wimpish. As punishment for his presumption he puts Nicholson in a hellish underground cell in solitary. But Nicholson's men refuse to cooperate until he's released, and when he is he sneers at the Japanese engineers and their mistakes, and insists on the English army engineers taking control of the building - and this works well for the Japanese Army but not for Saito, who seriously feels like he has lost face and should commit suicide.Director David Lean wisely shot the film on location, capturing the heat and disorientation of a humid jungle war front. His wide screen film manages to make the locale of the prison camp and the Kwai River (and the bridge) look like it is the entire world, and that escape is impossible from it (indeed the one man who escapes - Holden - has to return eventually). The novel does not include the character played by William Holden, one of his typically laconic Americans who retain a clear sightedness when compared to the British. Holden's \"Shears\" sees the prison camp as a massive graveyard (he's on the burial detail) and hates it to the point of escaping. He reaches safety in a recovery hospital in Ceylon, but he's forced by Jack Hawkins to return to the campsite to destroy the bridge.Hawkins' too seems a realist - he is trying to destroy an enemy target that is nearly completed, and will make the enemy's war effort far easier. But his resolve to do this involves blackmailing Holden into assisting him, and forcing himself to continue on his mission after being seriously injured. At the end the mission kills hundreds of men. Hawkins has succeeded, but the local natives who assisted him look at him like he is a mass murderer.Guinness' Nicholson is one of the most myopic soldiers in film (or fiction for that matter) totally forgetting the purpose of himself and his soldiers even in a P.O.W. situation but thinking solely in terms of oneupmanship and morale. It was a splendid performance. One might make a case that he behaved like a man who was hallucinating after an illness, and indeed he does (accidentally) get back to reality at the eleventh hour - too late to save himself, but in time to save his military honor.Sessue Hayakawa had a film career in Hollywood that went back to the silent period (even appearing opposite Gloria Swanson in a Cecil B. DeMille movie), but the coming of sound and the deterioration of Japanese-American relations caused him to leave American movies. Like Swanson's sound comeback in Wilder's SUNSET BLVD., Hayakawa's appearance as Saito, a harsh foe but ultimately sympathetic given his code of behavior and how he is humiliated, brought him belated recognition and an Oscar nomination.Finally there is James Douglas, a highly useful, plain looking British actor who frequently brought dollops of common sense to his films. His P.O.W. Major Clipton tries to rouse Nicholson's sense of reality, but fails (in fact he soon sees that Nicholson's unreality is far more catching with the rest of the British P.O.W.s than he imagined). He sees natural foes, British and Japanese, joining together building a bridge of friendship in a time of war. And the final result is just destruction, confusion and death from that war. Is it any wonder that at the end, he mutters the two words in the \"Summary Line\" as the story's conclusion."
    },
    {
      "username": "Spleen",
      "userUrl": "https://www.imdb.com/user/ur0035229",
      "reviewLink": "https://www.imdb.com/review/rw0060597",
      "warningSpoilers": false,
      "date": "6 September 1999",
      "rate": "10",
      "helpful": "59 out of 89 found this helpful.",
      "title": "Ageless and all but perfect",
      "content": "Of all war movies this is the one with the best idea behind it. Think how easy it is to make a bad war movie. A group of people must blow up a bridge, and this is the story of their quest ... Actually, that DID serve as the premise for a film: it was called `Force Ten from Navarone', and it was dire. Or how about this one: we see close up the brutalities of war. (Then we see them again. Then we see some more of the brutalities of war. Then we see the credits.) Or how about this: a humble American soldier, with the pragmatism native to his breed, rejects his superiors' highfalutin talk of honour and glory and asserts his basic humanity in trying to stay alive. Or this one: we see English prisoners of war maintain their dignity in the face of Japanese brutality.They're all present, in a sort of a way: but ALSO present is a magnificent, long, suspenseful, tight story, around which these apparent clichés wrap naturally. If the clichés don't wrap naturally then they, not the story, are bent out of shape. Just when we think that the American pragmatist will turn out to be the hero, we see him cut a rather shabby figure, and it seems that there really WAS something to that highfalutin talk of honour and glory, after all. But then we discover that he has standards of his own, and they appear to be better ones. But THEN it seems that ... I could go on indefinitely, since there are many people here with something to be said for them, and it requires some thought to see who has the most to be said for him in the end.There's almost no need to mention the excellent performances, photography and music. The only thing one might have qualms about is historical accuracy. Nothing like this ever happened. Still, that makes the movie much less dishonest than those that base themselves on historical events, and then proceed to get them all wrong. You can only be misled by `The Bridge on the River Kwai' if you don't know that it's pure fiction. Well - you know now."
    },
    {
      "username": "moonspinner55",
      "userUrl": "https://www.imdb.com/user/ur0989035",
      "reviewLink": "https://www.imdb.com/review/rw2105598",
      "warningSpoilers": false,
      "date": "2 August 2009",
      "rate": "7",
      "helpful": "9 out of 12 found this helpful.",
      "title": "A clash of wills, principles, and egos amidst the madness of war...",
      "content": "British Army Colonel, captured along with his regimen by the Japanese on the island of Burma in 1943, refuses to abandon the rules of his government and build a railroad bridge across the Kwai river according to the plans of his mercurial Japanese counterpart, Colonel Saito. Saito, under orders from his superiors to have the bridge completed by a certain date, eventually yields to the Britisher's demands and construction gets under way, but a POW escapee from the American Navy has been recruited by British officials in nearby Ceylon to return to Burma and blow the bridge up. Complex clash of personalities, with Best Actor Oscar Winner Alec Guinness nimbly helping us to understand his character's motivations (he not only engineers the building of the bridge to aid the enemy, but helps construct a masterpiece--while underlings wonder if perhaps a temporary structure might have sufficed). To be engrossed by this Best Picture Academy Award winner is to eventually sympathize with Guinness' Colonel Nicholson, who figures it's better to build something worthwhile and long-lasting (even as a prisoner) than to do a sloppy job. David Lean (winner for Best Director) does some of his liveliest work behind the camera; opening the film carefully, like a good novel, he lays all these difficult, stubborn warriors on the table and allows us to get close to each one. That said, the big climactic finish--while suspenseful--is ultimately a let-down. Lean's staging is sufficient...perhaps the editing is at fault? Throwing out the people we've come to know so intimately for the sake of rousing visual action leaves a sour taste behind. Yes, it is the madness of war to finish with no winners, only losers; however, the way it plays out here feels half-hearted, and a line of dialogue from Jack Hawkins' Major Warden adds a curious layer of dissatisfaction and confusion. Pierre Boulle was also awarded an Oscar for adapting his own novel (he was fronting for blacklisted screenwriters Carl Foreman and Michael Wilson); Jack Hildyard won for his cinematography, Malcolm Arnold for his commanding music, and Peter Taylor for his (rather spotty) editing. *** from ****"
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1463922",
      "warningSpoilers": false,
      "date": "1 September 2006",
      "rate": "10",
      "helpful": "14 out of 21 found this helpful.",
      "title": "The Perks of Being An Officer",
      "content": "The Bridge on the River Kwai is about a culture clash of two different races going to war and how they view each other. It's also about a British colonel's concern for the morale of his men and observation of the rules of war that it blinds him to the situation he's in.I like to compare The Bridge on the River Kwai with The Great Escape. Though the prisoners in the former are in a far worse predicament than those in that 'escape proof' stalag in the latter, note the differences in how they view their captivity. No one in The Great Escape ever forgets that they are at war and who the enemy. Their morale is kept very high with the diabolical escape plan they devise.Alec Guinness who is a stickler for protocol reminds us that escape might not be justified under the rules because they were ordered to surrender. But as prisoners he will not be denied the rank and privileges of being an officer. So he gets the sweat box until the commandant, Sessue Hayakawa, gives in for his own reasons.His reasons involve the building of a bridge on a railway the Japanese are constructing from Bangkok to Rangoon, part of their Greater East Asia Co-Prosperity scheme. Hayakawa reminds us that his code of honor is Bushido, the Samurai code which does not entertain surrender. The British to him are an inferior people for doing that and not fighting until the last man.That's not going to sit well with Guinness who's going to show the Japanese who's inferior. He notes that the bridge being built is not sound structurally and he determines that to combat the idleness of the men and the bad effect on morale, he'll build a bridge that will show Hayakawa who's inferior. And Hayakawa loses control of his own bridge construction to the enemy and breaks down because of it.The Bridge on the River Kwai as a film wouldn't work at all if it were not for Alec Guinness. He's clearly not kept his eye on the ball to use an American baseball term, forgotten that two countries are at war, that it's not a private spat between him and Hayakawa. Yet his concern for his men is genuine and he must have been a pretty good commander in a combat situation to retain the affection his men have for him. Executing the complexity of Colonel Nicholson won him the Academy Award and it carries the film.Taking a different view of the perks of being an officer is William Holden. His role is not in the original novel by Pierre Boule, but was created to justify a big American box office name for the USA market. But it was a good thing because Holden as an American does bring a different perspective to the events. Holden having won his Oscar in Stalag 17 as a prisoner of war brings his former role of Sefton to this film. That's not as flip as it sounds because Sefton in Stalag 17 did remark about escaping and then being sent to the Pacific and getting captured and doing time in a Japanese prison. Of course he'd have had to have changed branches of the service. And we never do learn Holden's real name.Seems as though when his ship went down, Holden the survivor exchanges uniform and dog tags with a Navy commander named Shears. It doesn't get him quite the perks he thought he'd get, but he's resourceful enough.It took me several viewings of The Bridge on the River Kwai to figure out why Holden didn't go back to his real name and rank after he escaped and after he arrived in the British hospital in Sri Lanka. It's the reason why Ann Sears has a small, but critical role as the WREN that Holden enjoys a little romantic idyll with. She might not have given him the time of day if he was a seaman first class instead of a Lieutenant Commander. But the British get on to Holden's charade and Jack Hawkins blackjacks him into going on a mission to destroy the bridge that British Intelligence has found out the Japanese are building. If Guinness has forgotten what side he's on, Hawkins sure hasn't. Jack Hawkins's role tends to get overshadowed by Guinness and he never gets the credit due him for this film, but he does well as the determined man on a mission.One other part worthy mentioning is James Donald as the medical officer of Guinness's battalion. He has great affection for Guinness, but apparently he's the only one in the POW camp that sees the implication of what the British prisoners are being ordered to do by their commander and also who'll tell Guinness ever so gently.And Donald puts the final coda on The Bridge on the River Kwai with his words that end this great film achievement."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1339600",
      "warningSpoilers": false,
      "date": "12 April 2006",
      "rate": "9",
      "helpful": "22 out of 37 found this helpful.",
      "title": "an exceptional war film with only one minor flaw",
      "content": "I saw this film as a kid and wasn't particularly impressed. Considering just how long it had been, I decided to give it another chance. And, fortunately, I was rewarded by finding the film far better than I remembered.The movie is apparently based on real-life characters, though exactly how close to the real ones I am real uncertain. And this brings me to a problem with the film. Sessue Hayakawa played an incredibly reasonable Japanese prison commandant. Apparently the real Colonel he played was indeed an atypical man--most Japanese officers in a similar situation would have most likely just killed Alec Guinness and the other officers who refused his orders. I could, begrudgingly, accept this. But, when this tough Japanese soldier is seen CRYING in his hut, this just seemed ridiculous and almost impossible to believe.Okay, now apart from that, the movie was great. William Holden was essentially the same character he played in Stalag 17--almost like a close in fact of the same opportunistic \"hero\". I liked this as a counter-point to the usual tough-guy hero in movies.As for Guinness, he plays an excellent, but very odd British officer who is a great example of an Obsessive-Compulsive nut! He is so bent on maintaining self-control and a \"stiff upper lip\" that he completely loses sight of the war and the fact that the Japanese are the enemy! He and Holden both are amazing psychological portraits.Other than the acting, the cinematography and music were excellent. A very odd and atypical war film that is worth your time."
    },
    {
      "username": "Wormtongue1",
      "userUrl": "https://www.imdb.com/user/ur0533704",
      "reviewLink": "https://www.imdb.com/review/rw0060601",
      "warningSpoilers": false,
      "date": "10 December 1999",
      "rate": "10",
      "helpful": "125 out of 161 found this helpful.",
      "title": "A powerful film experience",
      "content": "I heard a film critic once say that there really aren't \"war movies\"; there are only \"anti-war\" movies. I'm still not sure what I think of that claim, but having seen - The Bridge on the River Kwai- enough times in the past several years, I think I'm persuaded that it's at least half right. -Kwai-, I believe, is both a \"war\" and \"anti-war\" movie, and, in my view, it succeeds admirably at both.There is almost no element of -Kwai- that is not praise-worthy. David Lean's direction is tight and evocative. The cinematography is great (even though the color seems increasingly drained in film versions that I have seen). The acting is top-notch. I honestly believe that this is Alec Guiness's best performance, and Sessue Hayakawa is also highly sympathetic and believable. William Holden and Jack Hawkins round out the cast nicely.The musical score is also right on. Simply put, -Kwai- is an excellently constructed film made by people who obviously cared a great deal about it. As a result, the viewer comes to care a great deal about it as well.Clearly -Kwai- is an anti-war film. There is no glorification here. War is brutal, period. It's brutality is not captured here in terms of gory carnage or senseless battles. Instead, the psychological dimension of brutality comes across clearly. Yet, -Kwai- also shows the resilience of the human spirit as well as its complexity. One is left wondering if participation in World War II not only psychologically brutalized the characters played by Guiness, Hayakawa, and Holden but also if it simultaneously uplifted them. The paradox is striking to me each time I view this film. War can act both as a positive and negative catalyst, and it can do both of these things at the same instant.So, is -The Bridge on the River Kwai- a war movie or an anti-war movie? I think Lean clearly preferred the latter, but the subject matter and his approach to it may have landed somewhere in between.Regardless, -Kwai- is a fantastic film experience and is not to be missed. It is, simply put, my very favorite film--bar none."
    },
    {
      "username": "Local Hero",
      "userUrl": "https://www.imdb.com/user/ur0961115",
      "reviewLink": "https://www.imdb.com/review/rw0060621",
      "warningSpoilers": false,
      "date": "19 January 2001",
      "rate": "",
      "helpful": "31 out of 38 found this helpful.",
      "title": "A true classic, despite one disturbing aspect",
      "content": "In my opinion, David Lean is one of the cinema's greatest directors, in the highest pantheon along with the likes of Kurosawa, Welles, De Sica, and Bergman. Lean's \"Lawrence of Arabia\" and his vastly underrated \"A Passage to India\" are unmitigated masterpieces, and some of his 'smaller' films, such as \"Summertime,\" \"Great Expectations,\" and \"Brief Encounter\" are true gems.\"The Bridge on the River Kwai\" should justly be grouped with \"Lawrence\" and \"India,\" as all three are sweeping in scope, and all three are some of the most thematically ambitious films ever made, reflecting a mature filmmaker at the peak of his craft. Like \"Lawrence,\" \"Kwai\" does not flinch for a moment while it forces the viewer to gaze deep into the chasm of the human condition, and it is not an easy film to take in, as it presents us with profoundly symbolic (archetypal, you might say) character types, most of whom elicit both admiration and repulsion, sympathy and frustration. And while the film explores these character themes at length, it is ultimately content to leave the conflicts unresolved, happy simply to present us with the Hamlet-like paradoxes that are the human condition in all its glory and stupidity.If there is any clear, unequivocal message that can be gleaned from \"Kwai,\" it is an ode in praise of stoic virtue and the struggle for dignity and meaning in the face of a hostile universe-- in this case, in the face of an inhuman and absurd war. However, ironically, it is in this very aspect that the film, in my opinion, has its greatest failing. In retrospect, it would seem that in order to distill the film's philosophical elements down to universal themes, and perhaps in order to make the story palatable to 1950s audiences (and more Oscar-worthy?), the film greatly tones down the very inhumanity of the historical situation it portrays. In reality, the Japanese were perfectly capable of engineering their own bridges and, far more importantly, the building of the Burma-Thailand Railroad was an atrocity so vast and inhuman that it can only be rightly compared with the Nazi Holocaust and the Khmer Rouge Genocide. The true \"stiff upper lip\" displayed by the surviving prisoners-of-war from that hell in the jungle was not an insistence that a bridge be built right if it is to be built at all, etc.; the true \"stiff upper lip\" was mere survival itself, as thousands upon thousands were dying of starvation, overwork, constant beatings, summary executions, disease and exposure. While it is true that not every film about war needs to be \"Shoah,\" \"Schindler's List,\" or \"The Killing Fields,\" and \"Kwai\" should be viewed on its own terms, as a film solely about the themes and characters it has chosen to depict; nevertheless, by so greatly downplaying the horrors of the actual historical situation it portrays, the film ultimately does a great disservice to the hundreds of thousands of people of several nationalities who suffered and died in the building of this monstrosity of a railroad. While it seems to me that the intentions of the filmmakers were noble, that Lean sought to explore the struggle of the human spirit under the greatest adversity, the film's light treatment of the still-seldom-discussed topic of Japanese war crimes inadvertently trivializes that very struggle.Nonetheless, I still feel that \"Kwai\" is an amazing cinematic achievement in its own right. And while it would only be with heavy reservation that I place it on a list of \"greatest films,\" it does manage to squeak onto my hypothetical Top 100."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2158688",
      "warningSpoilers": true,
      "date": "16 November 2009",
      "rate": "",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Jolly good show, chaps",
      "content": "\"We can teach these barbarians a lesson in Western methods and efficiency that will put them to shame! We'll show them what the British soldier is capable of doing!\" - Colonel Nicholson \"The Bridge on the River Kwai\" stars Alec Guinness as Colonel Nicholson, a British officer who has been captured by the Japanese Army and placed in a prison camp somewhere in western Thailand. The Japanese camp commander, Colonel Saito, orders Nicholson and his men to build a bridge across the river Kwai (in order for a rail-link connecting Bangkok and Burma to be completed) but Nicholson refuses.What follows is a battle of wills. The Japanese camp commander seeks to break Nicholson, turning him into a slave labourer. Nicholson, however, remains steadfast in his pride and dignity. A caricature of stiff-upper-lipped Brits, he's proud of the Empire, proud of British engineering, dutiful, cultured, and a stickler for rules, regulations and the Geneva Convention. If he is to be made a slave, then by God, he will do it with dignity! He will do it on his own terms! \"The Bridge on the River Kwai\" was, of course, directed by David Lean, that master of location photography and beautiful compositions. In our CGI age, its refreshing to see a director who went to such extreme lengths to find great scenery. Lean, from this point onwards, would paint on an increasingly grand canvas.Though \"Bridge\" works on an archetypal level, there are some nagging problems. Following WW2, the British and Americans suddenly needed to portray the Japanese as \"our allies\". After years of portraying them as screaming savages, Japan was now our new \"friend\" in the \"war against communism\". They were needed as a bulwark to prevent the Russians from moving further southward and so efforts were made to paint them in a more \"friendly\" manner. As a result, all Asians in \"Bridge\" are portrayed in a ridiculously cartoonish light. They are all teary base commanders, resourceful peasants or big breasted sexy women who fall head over heels for American boys. The film's titular bridge itself eventually becomes a hokey symbol for uneasy cultures working together to bridge their differences because, \"someday, after this war, what we build here might help somebody.\" Compare this to \"Hei Tai Yang 731\", a Chinese film which documented the atrocities that the Japense army regiment of Camp 731 carried out on innocent Chinese and Russian families. Of course that film is merely propaganda from another perspective, but in its extremities it nevertheless highlights how absurd \"Bridge's\" portrayals of camp life are; Lean's prison camps are far too homey.Strange too is Nicholson's comment that he \"refuses to work like a coolie\". \"Coolie\" is a derogatory slang term used to describe Asian and Indian slaves or indentured workers. Today the term is still used in some Caribbean islands to describe West Indians brought over during the slave trade. The irony that Nicholson is condemning the Japanese for using the very same practises used by the British Empire is completely lost on Lean. Nicholson isn't a hero for \"retaining his humanity\" and \"refusing to work like a coolie\", he's a hypocrite.But still, the film works on a primal level. Why does everyone love a good prison break movie (\"Cool Hand Luke\", \"Shawshank\", \"Papillon\", \"Birdman of Alcatraz\", \"One Flew Over The Cuckoo's Nest\", \"The Great Escape\" etc\")? Probably because they're all thinly disguised existential tales centring on captured heroes who must break free, emancipating themselves from some phantom Order. Having escaped the constrictions of this immoral system, they achieve a kind of Nietzschean freedom or spiritual transcendence. It's all quite silly, but hits people on an archetypal, almost primal level.What's unique about \"The Bridge Over The River Kwai\" is that there is no \"literal\" freedom. Nicholson and his men don't escape the constrictions of the camp, rather, they change the camp to adhere to their own standards, their own \"British\" way of life.At the end of \"Bridge\", Nicholson and Saito stand on their bridge, and Nicholson remarks \"isn't this beautiful?\" Saito nods, the duo sharing their only moment of agreement, though Lean subtly implies that Saito is really referring to the rising sun in the distance. One man sees beauty in British engineering, pride, duty, strength and solidarity, whilst the other quite literally sees beauty in the \"rising sun\" of the Japanese Empire. With the bridge blowing up at the end of the film and Saito eventually dying, the film ends on what Lean has insisted is an \"anti-war note\", suggesting that it is the \"madness of war\" that keeps cultures apart. For Brit audiences, though, the film tends to fan the passions of patriotism.8/10 – An attempt to rewrite history, yes, but the film is nevertheless iconic, its characters have gravity and Lean in many ways invented huge chunks of cinematic grammar. We take his influence for granted now, but there are numerous little shots, compositions and trends in this film that Lean is responsible for starting. Worth two viewings."
    },
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw4676800",
      "warningSpoilers": false,
      "date": "20 February 2019",
      "rate": "7",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Entertaining and beautiful, but some real issues with tone and the portrayal",
      "content": "Highlights: Cinematography. Fantastic jungle scenes. The massive flock of birds scattering during a surprise encounter with the enemy was my favorite.Dramatic climax. You have to suspend disbelief a bit, but it's gripping, suspenseful, and well-told.Alec Guinness. Brilliant character, brilliant acting. His scene walking stiffly out of the hot box is fantastic.The theme of maniacal devotion to duty blinding one to what's right. Obviously in Guinness's character, and in a minor key, the leader of the commando force (Jack Hawkins).The whistling of the 'Colonel Bogey March.' A little crazy, but catchy. Also perfectly symbolic of the above two items.Sessue Hayakawa. Just seeing the legend at age 71 was great and he has some nice early scenes, but it's too bad his character was so limited (part of the lowlights).The context. It sits at an interesting crossroads between highly patriotic work of the 1940's, and deeper satire of military madness (e.g. Catch-22) and the disillusionment of the 1960's. Aside from the leaders being a bit off-kilter, one young solider says \"I suppose I find it hard to kid myself that killing isn't a crime,\" and it's clear the escaped American (William Holden) wants no part of further battle.Lowlights: Treatment of the Japanese. They're shown as incompetent at building bridges, and weak at controlling the prisoners. It's remarkable how little the Japanese are present in the film. Also remarkable is how much control the British commander has in his interactions with them, and in just strolling around. In one scene, Hayakawa privately weeps in frustration. These things are simply ludicrous and seem to me to stem from feelings of racial superiority.Overall lightness of tone. After the opening scenes it's almost a cartoon, and I think it did the real-life POW's and civilians who worked under horrific conditions a real disservice.William Holden's character. He's the cool American who enjoys seeing a woman after escaping, hanging out in loafers, and acting in ways that are decidedly un-military. On the trek through the jungle on the daring mission, he's soaped and shampooed in a natural pool by a lovely young Thai woman, one of several who are (of course!) helping carry the gear. It's ridiculous."
    },
    {
      "username": "851222",
      "userUrl": "https://www.imdb.com/user/ur4405474",
      "reviewLink": "https://www.imdb.com/review/rw7734693",
      "warningSpoilers": false,
      "date": "8 January 2022",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Great movie",
      "content": "Greetings from Lithuania.\"The Bridge on the River Kwai\" (1957) is a terrific movie. It is very involving, has a very good story, its superbly acted, directed and written. Cinematography is gorgeous and you can clearly see how a movie can look when it is shoot at location - \"The Bridge on the River Kwai\" looks breathtaking during its whole almost 3 hours run time. This is an epic movie in every way and scene.Overall, \"The Bridge on the River Kwai\" is a great movie by a great David Lean. Never boring, always involving and amazingly looking this a true classic that everyone should see at least once in his life. Great movie."
    },
    {
      "username": "Sickfrog",
      "userUrl": "https://www.imdb.com/user/ur0019730",
      "reviewLink": "https://www.imdb.com/review/rw0060617",
      "warningSpoilers": false,
      "date": "14 August 1998",
      "rate": "9",
      "helpful": "101 out of 142 found this helpful.",
      "title": "Far Ahead of Its Time",
      "content": "First off, what is so amazing about this film is that, for the time that it was made, how modern it looks. David Lean certainly had the eye of any modern director and managed to direct a visual masterpiece at a time when many films were still being shot in black and white. William Holden gives one of his finest performances as a cynic of warfare , citing for us the insanity and absurdity that the combatants often convey. And he hates the war, but he cannot avoid been thrown back into it again and again. We wish he could stay on the beach with his nurse lover, but he is a man destined for a tragic doom for his country, whether he wants to or not. Alec Guiness also delivers a fine performance as a bold general whose own pride is, at the same time, his most noble quality as well as his greatest fault. He is uncompromising, yet when the Japanese submit to his demands, he begins overseeing the construction of the bridge with great esteem. Eventually, for him, the bridge becomes a manifestation of his belief of the superiority of the British Army, which he follows like a religion. And in putting all his pride into this bridge, he loses sight of even the British's own true agenda. Truly, his sense of overwhelming honor is, at the same time, his downfall in a descent to a loss of morality, and a sense of good and evil. And yes, by the end of this film, we learn a great lesson of the horrors of war. Not only does it take the lives of many good men, but the utter failure and despair that accompany it make it an unbearable existence. And this message has only recently been re-evaluated with the also-brilliant masterpiece \"Saving Private Ryan.\" But, keep in mind that it took forty years to regain the power that this film inspired so long ago."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1329604",
      "warningSpoilers": false,
      "date": "31 March 2006",
      "rate": "9",
      "helpful": "9 out of 14 found this helpful.",
      "title": "It Doesn't Have to Be Historically Accurate",
      "content": "To criticize movies for historical inaccuracy is to damn almost every work of historical fiction. First of all, the people who were there were not involved in the production. Secondly, if movies were truly historically accurate, they would be so dull, you couldn't watch them. To start with, this is based on a work of fiction. It is an idealized version of an event that took place some time in the past. It's characters are fictionalized. We don't know what they said or really did. Some were probably combinations of two or three different characters. Also, the criticism that people wouldn't make deals with the enemy is pretty naive. Sometime the deal making is what keeps you alive and gives you a chance to fight another day. It's easy to say that one would do or not do something, sitting on a couch in a living room. It doesn't reflect badly on soldiers in war time to be afraid, and, yes, seemingly traitorous. The story is a wonderful one about courage and drive and sacrifice and pain. This is how we as human beings keep going. A man once told me that the one consistent trait that Holocaust survivors had was that they had determined a goal in their lives. The building of the bridge becomes something to live for, even if it is for the gratification of the enemy. Of course, the leader cracked and almost destroyed the mission. This does happen. It doesn't diminish the movie or the character. This is a wonderful, exciting film with great performances, even if history may not totally accept it."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw0060696",
      "warningSpoilers": true,
      "date": "2 September 2004",
      "rate": "9",
      "helpful": "18 out of 32 found this helpful.",
      "title": "Among the Best.",
      "content": "This may be the best war movie -- if that's what it is -- that was ever put together. I don't think it would be made today. It was expensive and there were no women in it to speak of, and any committee member with an MBA reading the script would wonder why there wasn't more action. Further, the movie hasn't got any magnificent computerized graphics going for it. And we hardly see any blood. And nobody's head gets blown apart. And there's not a foul word in it.David Lean has pulled off a neat stunt, making a superb film with a good script, great performances, effective location shooting, a subtext that provokes thought, a marvelously believable set of characterizations -- and no gimmicks.It begins traditionally enough, with red mud and brilliant green foliage, and an authentic prisoner of war camp into which Nicholson's captured battalion marches proudly. The first real hint we get of the film's originality is when the men are marching in place to Colonel Bogey's march and we get one or two shots of feet stomping up and down on the wet gravel. One pair of feet wears only half shoes. The toes are pointing out of the right shoe. On the left shoe, the upper has separated from the sole, and it flaps up and down as the foot inside it drives into the earth. Not only is the shot THERE but it's lingered over, just long enough.William Holden is running through the bushes, trying to escape from the camp, disturbing flocks of bird that chirp madly at him. One of his Japanese pursuers shoots him and he tumbles into a turbulent river. In any Hollywood movie, the drop would be done by a stunt man in the usual manner -- head over heels, arms flailing, off the cliff. Not here. Holden falls feet first, hands and palms held out at his sides, as if expecting to land on a trampoline. He simply doesn't FALL like a professional.The film is loaded with grace notes like this. It's difficult to imagine a director willing to take the time to fine tune his film like this today because both the people making films and the viewers themselves are impatient to get on with the story and reach the next scene that has sex, blood, or comedy in it. I wonder if it's coincidental that people now categorize themselves as fans of one or another basketball team instead of a baseball team. Watching a baseball game calls for patience while the batter digs his cleated shoes into the dirt around the plate. Basketball is all momentum and no patience is required.I won't go on about the movie except to say that it's masterly in almost every respect. But I guess I will mention one more thing of the sort that impressed me, dealing with characterization. Throughout the movie, we've been told and shown that Nicholson cares for nothing so much as the bridge itself. He began by thinking of it as a way to keep up the men's morale and a reason for keeping discipline, but it has come to have functional autonomy, eclipsing everything else in importance. Note the way Guiness's eyes light up in the day-for-night scene when he's told that similar bridges built of English elms have lasted for three hundred years. \"Three hundred years!\", he marvels.Likewise, the supporting character of Joyce, on the commandos, is shown as being uncertain of whether he could use his knife in hand to hand combat or not. When an armed Japanese soldier appears at arm's length, Joyce freezes and Jack Hawkins dashes in to kill the man. These two traits -- Nicholson's obsession with the bridge and Joyce's inability to use a knife -- are set up so that the final (and only) confrontation between Nicholson and Joyce can take place the way it does. Nicholson screams, \"Blow up the BRIDGE?\", grabs Joyce's legs and pulls him down to the sand, preventing Joyce from reaching the detonator. Commandoes be damned, nobody is going to destroy his bridge. Hawkins and Holden shout from the opposite bank of the river, urging Joyce to \"kill him!\" But Joyce can't kill him without using a knife, which we know he will be unable to do.It's a perfect payoff for what we've learned about the two men.Did Nicholson deliberately throw himself on the detonator as he was dying or did he fall on it by accident? Who cares. If he did it deliberately it would be a heroic act since he finally \"came to his senses.\" But an accident would be more in keeping with the ironic tone of the rest of the film. At the end, everyone and everything of importance is dead except Clipton the humanitarian doctor who tells us unnecessarily that this is \"madness\" -- and those floating vultures with their Olympian view of these goings-on.It's a gripping movie from beginning to end, a magnificent job by everyone involved."
    },
    {
      "username": "hnt_dnl",
      "userUrl": "https://www.imdb.com/user/ur13630333",
      "reviewLink": "https://www.imdb.com/review/rw1840042",
      "warningSpoilers": true,
      "date": "14 March 2008",
      "rate": "10",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Great film from a year of great movies.",
      "content": "Man, 1957! What a year of great films: 12 ANGRY MEN, PATHS OF GLORY, SWEET SMELL OF SUCCESS, GUNFIGHT AT THE OK CORRAL, and this film, THE BRIDGE ON THE RIVER KWAI. Sometimes, I think that 1957 gets forgotten as being one of the great years of films and that's a shame. BRIDGE won Best Picture in this year, one of the very few in film history that I think is at least deserving. That said, PATHS OF GLORY is amongst the top 10 films of all time as far as I'm concerned, but I don't think it was released immediately in the U.S. in 1957, so I can forgive the Academy that one!This film is about a band of British POWs at a Japanese internment camp in the Burmese jungle during mid-WWII. They are led by career military man Colonel Nicholson (Best Actor Oscar winner Sir Alec Guiness) and the camp's Commander Saito forces Nicholson and his men to build a railroad bridge which trains will be able to cross to transport enemy troops and dignitaries, and to get supplies to enemy forces. Nicholson, ever the 'loyal' British officer, agrees to build a quality bridge in exchange for Saito treating his men in accordance with the Geneva Convention. Some of his officers question Nicholson's collusion with Saito and wonder about his patriotism. Also questioning Nicholson's motives are an American POW Shears (William Holden, who actually has top billing in this film and gives a terrific performance in his own right). Shears escapes the camp, only to be drafted by Major Warden (2nd billed Jack Hawkins) to be part of a team of Allied soldiers to return to the camp to destroy the bridge. Shears is necessary to lead the expedition since he was at the camp and could lead them the quickest route to get there.The film speaks a lot about the duality of man: on the one hand as 'prisoners' of war, Nicholson wanted he and his men to be treated accordingly to the Geneva convention, but he knew that to get this treatment, he had to make compromises with Saito; on the other hand, they were prisoners of 'war' and Saito is the enemy and it is unspoken rule that you should never collude with the enemy, even if it means mistreatment and taking uncalled for punishment. Nicholson is very prideful, prim, and proper and let these properties shine through. In his mind, he was doing his duty as a 'British' soldier, but in the end realized that what he was really doing was betraying the core values of what it really meant to be a British 'soldier'.The film is also very watchable, even today. You get completely enthralled by the story and characters. It never seems dated. The climactic bridge-destroying scene at the end always blows me away (no pun intended). And the last line in the film is one I've never forgotten and sums up the point of the whole film. A true classic."
    },
    {
      "username": "yenlo",
      "userUrl": "https://www.imdb.com/user/ur0313186",
      "reviewLink": "https://www.imdb.com/review/rw0060610",
      "warningSpoilers": false,
      "date": "3 May 2000",
      "rate": "9",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Historically inaccurate but great film.",
      "content": "While this film is loaded with historical inaccuracies it nonetheless remains a great motion picture. Many fine performances and the dual story line make it the picture that it is. However don't view it for historic purposes. The true story of the bridge and railway built by POW's is more brutal and horrifying than what is presented here. The History Channel has an excellent presentation about the actual story. By all means watch this film but don't pass up learning the real story."
    }
  ],
  "errorMessage": ""
}