{
  "imDbId": "tt0050212",
  "title": "The Bridge on the River Kwai",
  "fullTitle": "The Bridge on the River Kwai (1957)",
  "type": "Movie",
  "year": "1957",
  "language": "en",
  "titleInLanguage": "The Bridge on the River Kwai",
  "url": "https://en.wikipedia.org/wiki/The_Bridge_on_the_River_Kwai",
  "plotShort": {
    "plainText": "The Bridge on the River Kwai is a 1957 epic war film directed by David Lean and based on the 1952 novel written by Pierre Boulle. Although the film uses the historical setting of the construction of the Burma Railway in 1942–1943, the plot and characters of Boulle's novel and the screenplay are almost entirely fictional. The cast includes William Holden, Alec Guinness, Jack Hawkins, and Sessue Hayakawa.\r\nIt was initially scripted by screenwriter Carl Foreman, who was later replaced by Michael Wilson. Both writers had to work in secret, as they were on the Hollywood blacklist and had fled to the UK in order to continue working. As a result, Boulle, who did not speak English, was credited and received the Academy Award for Best Adapted Screenplay; many years later, Foreman and Wilson posthumously received the Academy Award.\r\nThe Bridge on the River Kwai is now widely recognized as one of the greatest films ever made. It was the highest-grossing film of 1957 and received overwhelmingly positive reviews from critics. The film won seven Academy Awards (including Best Picture) at the 30th Academy Awards. In 1997, the film was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. It has been included on the American Film Institute's list of best American films ever made. In 1999, the British Film Institute voted The Bridge on the River Kwai the 11th greatest British film of the 20th century.",
    "html": "<p>The Bridge on the River Kwai is a 1957 epic war film directed by David Lean and based on the 1952 novel written by Pierre Boulle. Although the film uses the historical setting of the construction of the Burma Railway in 1942–1943, the plot and characters of Boulle's novel and the screenplay are almost entirely fictional. The cast includes William Holden, Alec Guinness, Jack Hawkins, and Sessue Hayakawa.</p><p>It was initially scripted by screenwriter Carl Foreman, who was later replaced by Michael Wilson. Both writers had to work in secret, as they were on the Hollywood blacklist and had fled to the UK in order to continue working. As a result, Boulle, who did not speak English, was credited and received the Academy Award for Best Adapted Screenplay; many years later, Foreman and Wilson posthumously received the Academy Award.</p><p>The Bridge on the River Kwai is now widely recognized as one of the greatest films ever made. It was the highest-grossing film of 1957 and received overwhelmingly positive reviews from critics. The film won seven Academy Awards (including Best Picture) at the 30th Academy Awards. In 1997, the film was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. It has been included on the American Film Institute's list of best American films ever made. In 1999, the British Film Institute voted The Bridge on the River Kwai the 11th greatest British film of the 20th century.</p>"
  },
  "plotFull": {
    "plainText": "The Bridge on the River Kwai is a 1957 epic war film directed by David Lean and based on the 1952 novel written by Pierre Boulle. Although the film uses the historical setting of the construction of the Burma Railway in 1942–1943, the plot and characters of Boulle's novel and the screenplay are almost entirely fictional. The cast includes William Holden, Alec Guinness, Jack Hawkins, and Sessue Hayakawa.\r\nIt was initially scripted by screenwriter Carl Foreman, who was later replaced by Michael Wilson. Both writers had to work in secret, as they were on the Hollywood blacklist and had fled to the UK in order to continue working. As a result, Boulle, who did not speak English, was credited and received the Academy Award for Best Adapted Screenplay; many years later, Foreman and Wilson posthumously received the Academy Award.\r\nThe Bridge on the River Kwai is now widely recognized as one of the greatest films ever made. It was the highest-grossing film of 1957 and received overwhelmingly positive reviews from critics. The film won seven Academy Awards (including Best Picture) at the 30th Academy Awards. In 1997, the film was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. It has been included on the American Film Institute's list of best American films ever made. In 1999, the British Film Institute voted The Bridge on the River Kwai the 11th greatest British film of the 20th century.\r\nPlot\r\nIn early 1943, a contingent of British prisoners of war, led by Colonel Nicholson, arrive at a Japanese prison camp in Thailand. US Navy Commander Shears tells of the horrific conditions. Nicholson forbids any escape attempts because they were ordered by headquarters to surrender, and escapes could be seen as defiance of orders. Also, the dense surrounding jungle renders escape virtually impossible.\r\nColonel Saito, the camp commandant, informs the new prisoners they will all work, even officers, on the construction of a railway bridge over the River Kwai that will connect Bangkok and Rangoon. Nicholson objects, informing Saito the Geneva Convention exempts officers from manual labour. After the enlisted men are marched to the bridge site, Saito threatens to have the officers shot, until Major Clipton, the British medical officer, warns Saito there are too many witnesses for him to get away with murder. Saito leaves the officers standing all day in the intense heat. That evening, the officers are placed in a punishment hut, while Nicholson is beaten and locked in an iron box.\r\nShears and two others escape. Only he survives, though he is wounded. He wanders into a Burmese village, is nursed back to health, and eventually reaches the British colony of Ceylon.\r\nWork on the bridge proceeds badly, due to both the faulty Japanese engineering plans and the prisoners' slow pace and deliberate sabotage. Saito is expected to commit ritual suicide if he fails to meet the rapidly approaching deadline. Desperate, he uses the anniversary of Japan's 1905 victory in the Russo-Japanese War as an excuse to save face; he announces a general amnesty, releasing Nicholson and his officers and exempting them from manual labour. Nicholson is shocked by the poor job being done by his men and orders the building of a proper bridge, intending it to stand as a tribute to the British Army's ingenuity for centuries to come. Clipton objects, believing this to be collaboration with the enemy. Nicholson's obsession with the bridge eventually drives him to allow his officers to volunteer to engage in manual labor.\r\nShears is enjoying his hospital stay in Ceylon unwittingly within a commando school referred to as \"Force 316\" (likely based on the real world Force 136 of the Special Operations Executive (SOE)). Major Warden of SOE invites Shears to join a commando mission to destroy the bridge just as it is completed. Shears tries to get out of the mission by confessing that he impersonated an officer, hoping for better treatment from the Japanese. Warden responds that he already knew and that the US Navy had agreed to transfer him to the British SOE with the simulated rank of Major to avoid embarrassment. Realising he has no choice, Shears volunteers.\r\nWarden, Shears, and two other commandos parachute into Thailand; one, Chapman, dies after falling into a tree, and Warden is wounded in an encounter with a Japanese patrol and must be carried on a litter. He, Shears, and Joyce reach the river in time with the assistance of Siamese women bearers and their village chief, Khun Yai. Under cover of darkness, Shears and Joyce plant explosives on the bridge towers. A train carrying important dignitaries and soldiers is scheduled to be the first to cross the bridge the following day, and Warden wants to destroy both. By daybreak, however, the river level has dropped, exposing part of the wire connecting the explosives to the detonator. Nicholson spots the wire and brings it to Saito's attention. As the train approaches, they hurry down to the riverbank to investigate. Joyce, manning the detonator, breaks cover and stabs Saito to death. Nicholson yells for help, while attempting to stop Joyce from reaching the detonator. When Joyce is wounded by Japanese fire, Shears swims across, but is himself shot. Recognising Shears, Nicholson exclaims, \"What have I done?\"\r\nWarden fires a mortar, killing Shears and Joyce and fatally wounding Nicholson. Dying, Nicholson stumbles toward the detonator and falls on the plunger, blowing up the bridge and sending the train hurtling into the river. Warden tells the Siamese women that he had to prevent anyone from falling into enemy hands, and leaves with them. Witnessing the carnage, Clipton shakes his head and mutters, \"Madness! ... Madness!\"\r\nCast\r\nWilliam Holden as \"Commander\" Shears, U.S. Navy (later Brevet Major, Force 316)\r\nJack Hawkins as Major Warden, Force 316\r\nAlec Guinness as Colonel Nicholson, British commander\r\nSessue Hayakawa as Colonel Saito, Japanese commander\r\nJames Donald as Major Clipton, medical officer\r\nAndré Morell as Colonel Green\r\nPeter Williams as Captain Reeves\r\nJohn Boxer as Major Hughes\r\nPercy Herbert as Grogan\r\nHarold Goodwin as Baker\r\nHenry Okawa as Captain Kanematsu\r\nKeiichiro Katsumoto as Lieutenant Miura\r\nM.R.B. Chakrabandhu as Yai\r\nGeoffrey Horne as Lieutenant Joyce\r\nProduction\r\nScreenplay\r\nThe screenwriters, Carl Foreman and Michael Wilson, were on the Hollywood blacklist and, even though living in exile in England, could only work on the film in secret. The two did not collaborate on the script; Wilson took over after Lean was dissatisfied with Foreman's work. The official credit was given to Pierre Boulle (who did not speak English), and the resulting Oscar for Best Screenplay (Adaptation) was awarded to him. Only in 1984 did the Academy rectify the situation by retroactively awarding the Oscar to Foreman and Wilson, posthumously in both cases. Subsequent releases of the film finally gave them proper screen credit. David Lean himself also claimed that producer Sam Spiegel cheated him out of his rightful part in the credits since he had had a major hand in the script.\r\nThe film was relatively faithful to the novel, with two major exceptions. Shears, who is a British commando officer like Warden in the novel, became an American sailor who escapes from the POW camp. Also, in the novel, the bridge is not destroyed: the train plummets into the river from a secondary charge placed by Warden, but Nicholson (never realising \"what have I done?\") does not fall onto the plunger, and the bridge suffers only minor damage. Boulle nonetheless enjoyed the film version though he disagreed with its climax.\r\nCasting\r\nAlthough Lean later denied it, Charles Laughton was his first choice for the role of Nicholson. Laughton was in his habitually overweight state, and was either denied insurance coverage, or was simply not keen on filming in a tropical location. Guinness admitted that Lean \"didn't particularly want me\" for the role, and thought about immediately returning to England when he arrived in Ceylon and Lean reminded him that he wasn't the first choice.\r\nWilliam Holden's deal was considered one of the best ever for an actor at the time, with him receiving $300,000 plus 10% of the film's gross receipts.\r\nFilming\r\nMany directors were considered for the project, among them John Ford, William Wyler, Howard Hawks, Fred Zinnemann, and Orson Welles (who was also offered a starring role).\r\nThe film was an international co-production between companies in Britain and the United States.\r\nDirector David Lean clashed repeatedly with his cast members, particularly Guinness and James Donald, who thought the novel was anti-British. Lean had a lengthy row with Guinness over how to play the role of Nicholson; the actor wanted to play the part with a sense of humour and sympathy, while Lean thought Nicholson should be \"a bore.\" On another occasion, they argued over the scene where Nicholson reflects on his career in the army. Lean filmed the scene from behind Guinness and exploded in anger when Guinness asked him why he was doing this. After Guinness was done with the scene, Lean said, \"Now you can all fuck off and go home, you English actors. Thank God that I'm starting work tomorrow with an American actor (William Holden).\"\r\nThe film was made in Ceylon (now Sri Lanka). The bridge in the film was near Kitulgala. The Mount Lavinia Hotel was used as a location for the hospital.\r\nGuinness later said that he subconsciously based his walk while emerging from \"the Oven\" on that of his eleven-year-old son Matthew, who was recovering from polio at the time, a disease that left him temporarily paralyzed from the waist down. Guinness later reflected on the scene, calling it the \"finest piece of work\" he had ever done.\r\nLean nearly drowned when he was swept away by the river current during a break from filming.\r\nIn a 1988 interview with Barry Norman, Lean confirmed that Columbia almost stopped filming after three weeks because there was no white woman in the film, forcing him to add what he called \"a very terrible scene\" between Holden and a nurse on the beach.\r\nThe filming of the bridge explosion was to be done on 10 March 1957, in the presence of S.W.R.D. Bandaranaike, then Prime Minister of Ceylon, and a team of government dignitaries. However, cameraman Freddy Ford was unable to get out of the way of the explosion in time, and Lean had to stop filming. The train crashed into a generator on the other side of the bridge and was wrecked. It was repaired in time to be blown up the next morning, with Bandaranaike and his entourage present.\r\nMusic and soundtrack\r\nBritish composer Malcolm Arnold recalled that he had \"ten days to write around forty-five minutes worth of music\" – much less time than he was used to. He described the music for The Bridge on the River Kwai as the \"worst job I ever had in my life\" from the point of view of time. Despite this, he won an Oscar and a Grammy.\r\nA memorable feature of the film is the tune that is whistled by the POWs—the first strain of the \"Colonel Bogey March\"—when they enter the camp. Gavin Young recounts meeting Donald Wise, a former prisoner of the Japanese who had worked on the Burma Railway. Young: \"Donald, did anyone whistle Colonel Bogey ... as they did in the film?\" Wise: \"I never heard it in Thailand. We hadn't much breath left for whistling. But in Bangkok I was told that David Lean, the film's director, became mad at the extras who played the prisoners—us—because they couldn't march in time. Lean shouted at them, 'For God's sake, whistle a march to keep time to.' And a bloke called George Siegatz ... —an expert whistler—began to whistle Colonel Bogey, and a hit was born.\"\r\nThe march was written in 1914 by Kenneth J. Alford, a pseudonym of British Bandmaster Frederick J. Ricketts. The Colonel Bogey strain was accompanied by a counter-melody using the same chord progressions, then continued with film composer Malcolm Arnold's own composition, \"The River Kwai March\", played by the off-screen orchestra taking over from the whistlers, though Arnold's march was not heard in completion on the soundtrack. Mitch Miller had a hit with a recording of both marches.\r\nIn many tense, dramatic scenes, only the sounds of nature are used. An example of this is when commandos Warden and Joyce hunt a fleeing Japanese soldier through the jungle, desperate to prevent him from alerting other troops.\r\nHistorical accuracy\r\nThe plot and characters of Boulle's novel and the screenplay were almost entirely fictional. Since it was not a documentary, there are many historical inaccuracies in the film, as noted by eyewitnesses to the building of the real Burma Railway by historians.\r\nThe conditions to which POW and civilian labourers were subjected were far worse than the film depicted. According to the Commonwealth War Graves Commission:\r\nThe notorious Burma-Siam railway, built by Commonwealth, Dutch and American prisoners of war, was a Japanese project driven by the need for improved communications to support the large Japanese army in Burma. During its construction, approximately 13,000 prisoners of war died and were buried along the railway. An estimated 80,000 to 100,000 civilians also died in the course of the project, chiefly forced labour brought from Malaya and the Dutch East Indies, or conscripted in Siam (Thailand) and Burma. Two labour forces, one based in Siam and the other in Burma, worked from opposite ends of the line towards the centre.\r\nLieutenant Colonel Philip Toosey of the British Army was the real senior Allied officer at the bridge in question. Toosey was very different from Nicholson and was certainly not a collaborator who felt obliged to work with the Japanese. Toosey in fact did as much as possible to delay the building of the bridge. While Nicholson disapproves of acts of sabotage and other deliberate attempts to delay progress, Toosey encouraged this: termites were collected in large numbers to eat the wooden structures, and the concrete was badly mixed. Some consider the film to be an insulting parody of Toosey.\r\nOn a BBC Timewatch programme, a former prisoner at the camp states that it is unlikely that a man like the fictional Nicholson could have risen to the rank of lieutenant colonel, and, if he had, due to his collaboration he would have been \"quietly eliminated\" by the other prisoners.\r\nJulie Summers, in her book The Colonel of Tamarkan, writes that Boulle, who had been a prisoner of war in Thailand, created the fictional Nicholson character as an amalgam of his memories of collaborating French officers. He strongly denied the claim that the book was anti-British, although many involved in the film itself (including Alec Guinness) felt otherwise.\r\nErnest Gordon, a survivor of the railway construction and POW camps described in the novel/film, stated in his 1962 book, Through the Valley of the Kwai:\r\nIn Pierre Boulle's book The Bridge over the River Kwai and the film which was based on it, the impression was given that British officers not only took part in building the bridge willingly, but finished in record time to demonstrate to the enemy their superior efficiency. This was an entertaining story. But I am writing a factual account, and in justice to these men—living and dead—who worked on that bridge, I must make it clear that we never did so willingly. We worked at bayonet point and under bamboo lash, taking any risk to sabotage the operation whenever the opportunity arose.\r\nA 1969 BBC television documentary, Return to the River Kwai, made by former POW John Coast, sought to highlight the real history behind the film (partly through getting ex-POWs to question its factual basis, for example Dr Hugh de Wardener and Lt-Col Alfred Knights), which angered many former POWs. The documentary itself was described by one newspaper reviewer when it was shown on Boxing Day 1974 (The Bridge on the River Kwai had been shown on BBC1 on Christmas Day 1974) as \"Following the movie, this is a rerun of the antidote.\"\r\nSome of the characters in the film use the names of real people who were involved in the Burma Railway. Their roles and characters, however, are fictionalised. For example, a Sergeant-Major Risaburo Saito was in real life second in command at the camp. In the film, a Colonel Saito is camp commandant. In reality, Risaburo Saito was respected by his prisoners for being comparatively merciful and fair towards them. Toosey later defended him in his war crimes trial after the war, and the two became friends.\r\nSome Japanese viewers resented the movie's depiction of their engineers' capabilities as inferior and less advanced than they were in reality. Japanese engineers had been surveying and planning the route of the railway since 1937, and they had demonstrated considerable skill during their construction efforts across South-East Asia. Some Japanese viewers also disliked the film for portraying the Allied prisoners of war as more capable of constructing the bridge than the Japanese engineers themselves were, accusing the filmmakers of being unfairly biased and unfamiliar with the realities of the bridge construction, a sentiment echoed by surviving prisoners of war who saw the film in cinemas.\r\nThe major railway bridge described in the novel and film did not actually cross the river known at the time as the Kwai. However, in 1943 a railway bridge was built by Allied POWs over the Mae Klong river – renamed Khwae Yai in the 1960s as a result of the film – at Tha Ma Kham, five kilometres from Kanchanaburi, Thailand. Boulle had never been to the bridge. He knew that the railway ran parallel to the Kwae for many miles, and he therefore assumed that it was the Kwae which it crossed just north of Kanchanaburi. This was an incorrect assumption. The destruction of the bridge as depicted in the film is also entirely fictional. In fact, two bridges were built: a temporary wooden bridge and a permanent steel/concrete bridge a few months later. Both bridges were used for two years, until they were destroyed by Allied bombing. The steel bridge was repaired and is still in use today.\r\nReception\r\nBox office\r\nThe Bridge on the River Kwai was a massive commercial success. It was the highest-grossing film of 1957 in the United States and Canada and was also the most popular film at the British box office that year. According to Variety, the film earned estimated domestic box office revenues of $18,000,000 although this was revised downwards the following year to $15,000,000, which was still the biggest for 1958 and Columbia's highest-grossing film at the time. By October 1960, the film had earned worldwide box office revenues of $30 million.\r\nThe film was re-released in 1964 and earned a further estimated $2.6 million at the box office in the United States and Canada but the following year its revised total US and Canadian revenues were reported by Variety as $17,195,000.\r\nCritical response\r\nOn review aggregator website Rotten Tomatoes, the film received an approval rating of 96% based on 93 reviews, with an average rating of 9.4/10. The site's critical consensus reads, \"This complex war epic asks hard questions, resists easy answers, and boasts career-defining work from star Alec Guinness and director David Lean.\" On Metacritic, the film has a weighted average score of 87 out of 100 based on 14 critics, indicating \"universal acclaim\".\r\nBosley Crowther of The New York Times praised the film as \"a towering entertainment of rich variety and revelation of the ways of men\". Mike Kaplan, reviewing for Variety, described it as \"a gripping drama, expertly put together and handled with skill in all departments.\" Kaplan further praised the actors, especially Alec Guinness, later writing \"the film is unquestionably\" his. William Holden was also credited for his acting for giving a solid characterization that was \"easy, credible and always likeable in a role that is the pivot point of the story\". Edwin Schallert of the Los Angeles Times claimed the film's strongest points were for being \"excellently produced in virtually all respects and that it also offers an especially outstanding and different performance by Alec Guinness. Highly competent work is also done by William Holden, Jack Hawkins and Sessue Hayakawa\". Time magazine praised Lean's directing, noting he demonstrates \"a dazzlingly musical sense and control of the many and involving rhythms of a vast composition. He shows a rare sense of humor and a feeling for the poetry of situation; and he shows the even rarer ability to express these things, not in lines but in lives.\" Harrison's Reports described the film as an \"excellent World War II adventure melodrama\" in which the \"production values are first-rate and so is the photography.\"\r\nAmong retrospective reviews, Roger Ebert gave the film four out of four stars, noting that it is one of the few war movies that \"focuses not on larger rights and wrongs but on individuals\", but commented that the viewer is not certain what is intended by the final dialogue due to the film's shifting points of view. Slant magazine gave the film four out of five stars. Slant stated that \"the 1957 epic subtly develops its themes about the irrationality of honor and the hypocrisy of Britain's class system without ever compromising its thrilling war narrative\", and in comparing to other films of the time said that Bridge on the River Kwai \"carefully builds its psychological tension until it erupts in a blinding flash of sulfur and flame.\"\r\nBalu Mahendra, the Tamil film director, observed the shooting of this film at Kitulgala, Sri Lanka during his school trip and was inspired to become a film director. Warren Buffett said it was his favorite movie. In an interview, he said that \"here were a lot of lessons in that... The ending of that was sort of the story of life. He created the railroad. Did he really want the enemy to come in across it?\"\r\nSome Japanese viewers have disliked the film's depiction of the Japanese characters and the historical background presented as being inaccurate, particularly in the interactions between Saito and Nicholson. In particular, they objected to the implication presented in the film that Japanese military engineers were generally unskilled at their profession and lacked proficiency. In reality, Japanese engineers proved to be just as capable at construction efforts as their Allied counterparts.\r\nAccolades\r\nAmerican Film Institute lists:\r\n1998 — AFI's 100 Years...100 Movies — #13\r\n2001 — AFI's 100 Years...100 Thrills — #58\r\n2006 — AFI's 100 Years...100 Cheers — #14\r\n2007 — AFI's 100 Years...100 Movies (10th Anniversary Edition) — #36\r\nThe film has been selected for preservation in the United States National Film Registry.\r\nThe British Film Institute placed The Bridge on the River Kwai as the 11th greatest British film.\r\nFirst TV broadcast\r\nABC, sponsored by Ford, paid a record $1.8 million for the television rights for two screenings in the United States. The 167-minute film was first telecast, uncut, in colour, on the evening of 25 September 1966, as a three hours-plus ABC Movie Special. The telecast of the film lasted more than three hours because of the commercial breaks. It was still highly unusual at that time for a television network to show such a long film in one evening; most films of that length were still generally split into two parts and shown over two evenings. But the unusual move paid off for ABC—the telecast drew huge ratings with a record audience of 72 million and a Nielsen rating of 38.3 and an audience share of 61%.\r\nRestorations and home video releases\r\nIn 1972, the movie was among the first selection of films released on the early Cartrivision video format, alongside classics such as The Jazz Singer and Sands of Iwo Jima.\r\nThe film was restored in 1985 by Columbia Pictures. The separate dialogue, music and effects were located and remixed with newly recorded \"atmospheric\" sound effects. The image was restored by OCS, Freeze Frame, and Pixel Magic with George Hively editing.\r\nOn 2 November 2010 Columbia Pictures released a newly restored The Bridge on the River Kwai for the first time on Blu-ray. According to Columbia Pictures, they followed an all-new 4K digital restoration from the original negative with newly restored 5.1 audio. The original negative for the feature was scanned at 4k (four times the resolution in High Definition), and the colour correction and digital restoration were also completed at 4k. The negative itself manifested many of the kinds of issues one would expect from a film of this vintage: torn frames, embedded emulsion dirt, scratches through every reel, colour fading. Unique to this film, in some ways, were other issues related to poorly made optical dissolves, the original camera lens and a malfunctioning camera. These problems resulted in a number of anomalies that were very difficult to correct, like a ghosting effect in many scenes that resembles colour mis-registration, and a tick-like effect with the image jumping or jerking side-to-side. These issues, running throughout the film, were addressed to a lesser extent on various previous DVD releases of the film and might not have been so obvious in standard definition.\r\nIn popular culture\r\nIn 1962, Spike Milligan and Peter Sellers, with Peter Cook and Jonathan Miller, released the LP record Bridge on the River Wye (Parlophone LP PMC 1190, PCS 3036 (November 1962)). This spoof of the film was based on the script for the 1957 Goon Show episode \"An African Incident\". Shortly before its release, for legal reasons, producer George Martin edited out the 'K' every time the word 'Kwai' was spoken.\r\nThe comedy team of Wayne and Shuster performed a sketch titled \"Kwai Me a River\" on their 27 March 1967 TV show, in which an officer in the British Dental Corps (Wayne) is captured by the Japanese and, despite being comically unintimidated by any abuse the commander of the POW camp (Shuster) inflicts on him, is forced to build a (dental) \"bridge on the river Kwai\" for the commander and plans to include an explosive in the appliance to detonate in his mouth. The commander survives the explosion, attributed to a toothpaste commercial punchline in 1960s commercials.\r\nIn season 1, episode 1 of The Wire, Detective Jimmy McNulty laments, \"I feel like that motherfucker at the end of Bridge over the River Kwai, like what the fuck did I do?\"",
    "html": "<p>The Bridge on the River Kwai is a 1957 epic war film directed by David Lean and based on the 1952 novel written by Pierre Boulle. Although the film uses the historical setting of the construction of the Burma Railway in 1942–1943, the plot and characters of Boulle's novel and the screenplay are almost entirely fictional. The cast includes William Holden, Alec Guinness, Jack Hawkins, and Sessue Hayakawa.</p><p>It was initially scripted by screenwriter Carl Foreman, who was later replaced by Michael Wilson. Both writers had to work in secret, as they were on the Hollywood blacklist and had fled to the UK in order to continue working. As a result, Boulle, who did not speak English, was credited and received the Academy Award for Best Adapted Screenplay; many years later, Foreman and Wilson posthumously received the Academy Award.</p><p>The Bridge on the River Kwai is now widely recognized as one of the greatest films ever made. It was the highest-grossing film of 1957 and received overwhelmingly positive reviews from critics. The film won seven Academy Awards (including Best Picture) at the 30th Academy Awards. In 1997, the film was deemed \"culturally, historically, or aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. It has been included on the American Film Institute's list of best American films ever made. In 1999, the British Film Institute voted The Bridge on the River Kwai the 11th greatest British film of the 20th century.</p><br/><h3>Plot</h3><p>In early 1943, a contingent of British prisoners of war, led by Colonel Nicholson, arrive at a Japanese prison camp in Thailand. US Navy Commander Shears tells of the horrific conditions. Nicholson forbids any escape attempts because they were ordered by headquarters to surrender, and escapes could be seen as defiance of orders. Also, the dense surrounding jungle renders escape virtually impossible.</p><p>Colonel Saito, the camp commandant, informs the new prisoners they will all work, even officers, on the construction of a railway bridge over the River Kwai that will connect Bangkok and Rangoon. Nicholson objects, informing Saito the Geneva Convention exempts officers from manual labour. After the enlisted men are marched to the bridge site, Saito threatens to have the officers shot, until Major Clipton, the British medical officer, warns Saito there are too many witnesses for him to get away with murder. Saito leaves the officers standing all day in the intense heat. That evening, the officers are placed in a punishment hut, while Nicholson is beaten and locked in an iron box.</p><p>Shears and two others escape. Only he survives, though he is wounded. He wanders into a Burmese village, is nursed back to health, and eventually reaches the British colony of Ceylon.</p><p>Work on the bridge proceeds badly, due to both the faulty Japanese engineering plans and the prisoners' slow pace and deliberate sabotage. Saito is expected to commit ritual suicide if he fails to meet the rapidly approaching deadline. Desperate, he uses the anniversary of Japan's 1905 victory in the Russo-Japanese War as an excuse to save face; he announces a general amnesty, releasing Nicholson and his officers and exempting them from manual labour. Nicholson is shocked by the poor job being done by his men and orders the building of a proper bridge, intending it to stand as a tribute to the British Army's ingenuity for centuries to come. Clipton objects, believing this to be collaboration with the enemy. Nicholson's obsession with the bridge eventually drives him to allow his officers to volunteer to engage in manual labor.</p><p>Shears is enjoying his hospital stay in Ceylon unwittingly within a commando school referred to as \"Force 316\" (likely based on the real world Force 136 of the Special Operations Executive (SOE)). Major Warden of SOE invites Shears to join a commando mission to destroy the bridge just as it is completed. Shears tries to get out of the mission by confessing that he impersonated an officer, hoping for better treatment from the Japanese. Warden responds that he already knew and that the US Navy had agreed to transfer him to the British SOE with the simulated rank of Major to avoid embarrassment. Realising he has no choice, Shears volunteers.</p><p>Warden, Shears, and two other commandos parachute into Thailand; one, Chapman, dies after falling into a tree, and Warden is wounded in an encounter with a Japanese patrol and must be carried on a litter. He, Shears, and Joyce reach the river in time with the assistance of Siamese women bearers and their village chief, Khun Yai. Under cover of darkness, Shears and Joyce plant explosives on the bridge towers. A train carrying important dignitaries and soldiers is scheduled to be the first to cross the bridge the following day, and Warden wants to destroy both. By daybreak, however, the river level has dropped, exposing part of the wire connecting the explosives to the detonator. Nicholson spots the wire and brings it to Saito's attention. As the train approaches, they hurry down to the riverbank to investigate. Joyce, manning the detonator, breaks cover and stabs Saito to death. Nicholson yells for help, while attempting to stop Joyce from reaching the detonator. When Joyce is wounded by Japanese fire, Shears swims across, but is himself shot. Recognising Shears, Nicholson exclaims, \"What have I done?\"</p><p>Warden fires a mortar, killing Shears and Joyce and fatally wounding Nicholson. Dying, Nicholson stumbles toward the detonator and falls on the plunger, blowing up the bridge and sending the train hurtling into the river. Warden tells the Siamese women that he had to prevent anyone from falling into enemy hands, and leaves with them. Witnessing the carnage, Clipton shakes his head and mutters, \"Madness! ... Madness!\"</p><br/><h3>Cast</h3><ul><li>William Holden as \"Commander\" Shears, U.S. Navy (later Brevet Major, Force 316)</li><li>Jack Hawkins as Major Warden, Force 316</li><li>Alec Guinness as Colonel Nicholson, British commander</li><li>Sessue Hayakawa as Colonel Saito, Japanese commander</li><li>James Donald as Major Clipton, medical officer</li><li>André Morell as Colonel Green</li><li>Peter Williams as Captain Reeves</li><li>John Boxer as Major Hughes</li><li>Percy Herbert as Grogan</li><li>Harold Goodwin as Baker</li><li>Henry Okawa as Captain Kanematsu</li><li>Keiichiro Katsumoto as Lieutenant Miura</li><li>M.R.B. Chakrabandhu as Yai</li><li>Geoffrey Horne as Lieutenant Joyce</li></ul><br/><h3>Production</h3><h4>Screenplay</h4><p>The screenwriters, Carl Foreman and Michael Wilson, were on the Hollywood blacklist and, even though living in exile in England, could only work on the film in secret. The two did not collaborate on the script; Wilson took over after Lean was dissatisfied with Foreman's work. The official credit was given to Pierre Boulle (who did not speak English), and the resulting Oscar for Best Screenplay (Adaptation) was awarded to him. Only in 1984 did the Academy rectify the situation by retroactively awarding the Oscar to Foreman and Wilson, posthumously in both cases. Subsequent releases of the film finally gave them proper screen credit. David Lean himself also claimed that producer Sam Spiegel cheated him out of his rightful part in the credits since he had had a major hand in the script.</p><p>The film was relatively faithful to the novel, with two major exceptions. Shears, who is a British commando officer like Warden in the novel, became an American sailor who escapes from the POW camp. Also, in the novel, the bridge is not destroyed: the train plummets into the river from a secondary charge placed by Warden, but Nicholson (never realising \"what have I done?\") does not fall onto the plunger, and the bridge suffers only minor damage. Boulle nonetheless enjoyed the film version though he disagreed with its climax.</p><h4>Casting</h4><p>Although Lean later denied it, Charles Laughton was his first choice for the role of Nicholson. Laughton was in his habitually overweight state, and was either denied insurance coverage, or was simply not keen on filming in a tropical location. Guinness admitted that Lean \"didn't particularly want me\" for the role, and thought about immediately returning to England when he arrived in Ceylon and Lean reminded him that he wasn't the first choice.</p><p>William Holden's deal was considered one of the best ever for an actor at the time, with him receiving $300,000 plus 10% of the film's gross receipts.</p><h4>Filming</h4><p>Many directors were considered for the project, among them John Ford, William Wyler, Howard Hawks, Fred Zinnemann, and Orson Welles (who was also offered a starring role).</p><p>The film was an international co-production between companies in Britain and the United States.</p><p>Director David Lean clashed repeatedly with his cast members, particularly Guinness and James Donald, who thought the novel was anti-British. Lean had a lengthy row with Guinness over how to play the role of Nicholson; the actor wanted to play the part with a sense of humour and sympathy, while Lean thought Nicholson should be \"a bore.\" On another occasion, they argued over the scene where Nicholson reflects on his career in the army. Lean filmed the scene from behind Guinness and exploded in anger when Guinness asked him why he was doing this. After Guinness was done with the scene, Lean said, \"Now you can all fuck off and go home, you English actors. Thank God that I'm starting work tomorrow with an American actor (William Holden).\"</p><p>The film was made in Ceylon (now Sri Lanka). The bridge in the film was near Kitulgala. The Mount Lavinia Hotel was used as a location for the hospital.</p><p>Guinness later said that he subconsciously based his walk while emerging from \"the Oven\" on that of his eleven-year-old son Matthew, who was recovering from polio at the time, a disease that left him temporarily paralyzed from the waist down. Guinness later reflected on the scene, calling it the \"finest piece of work\" he had ever done.</p><p>Lean nearly drowned when he was swept away by the river current during a break from filming.</p><p>In a 1988 interview with Barry Norman, Lean confirmed that Columbia almost stopped filming after three weeks because there was no white woman in the film, forcing him to add what he called \"a very terrible scene\" between Holden and a nurse on the beach.</p><p>The filming of the bridge explosion was to be done on 10 March 1957, in the presence of S.W.R.D. Bandaranaike, then Prime Minister of Ceylon, and a team of government dignitaries. However, cameraman Freddy Ford was unable to get out of the way of the explosion in time, and Lean had to stop filming. The train crashed into a generator on the other side of the bridge and was wrecked. It was repaired in time to be blown up the next morning, with Bandaranaike and his entourage present.</p><h4>Music and soundtrack</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">The Bridge on the River Kwai (Original Soundtrack Recording)</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">Various</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">1957</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">21 October 1957</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Soundtrack</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">44</span>:<span class=\"s\">49</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Columbia</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">Various</td></tr></tbody></table><p>British composer Malcolm Arnold recalled that he had \"ten days to write around forty-five minutes worth of music\" – much less time than he was used to. He described the music for The Bridge on the River Kwai as the \"worst job I ever had in my life\" from the point of view of time. Despite this, he won an Oscar and a Grammy.</p><p>A memorable feature of the film is the tune that is whistled by the POWs—the first strain of the \"Colonel Bogey March\"—when they enter the camp. Gavin Young recounts meeting Donald Wise, a former prisoner of the Japanese who had worked on the Burma Railway. Young: \"Donald, did anyone whistle Colonel Bogey ... as they did in the film?\" Wise: \"I never heard it in Thailand. We hadn't much breath left for whistling. But in Bangkok I was told that David Lean, the film's director, became mad at the extras who played the prisoners—us—because they couldn't march in time. Lean shouted at them, 'For God's sake, whistle a march to keep time to.' And a bloke called George Siegatz ... —an expert whistler—began to whistle Colonel Bogey, and a hit was born.\"</p><p>The march was written in 1914 by Kenneth J. Alford, a pseudonym of British Bandmaster Frederick J. Ricketts. The Colonel Bogey strain was accompanied by a counter-melody using the same chord progressions, then continued with film composer Malcolm Arnold's own composition, \"The River Kwai March\", played by the off-screen orchestra taking over from the whistlers, though Arnold's march was not heard in completion on the soundtrack. Mitch Miller had a hit with a recording of both marches.</p><p>In many tense, dramatic scenes, only the sounds of nature are used. An example of this is when commandos Warden and Joyce hunt a fleeing Japanese soldier through the jungle, desperate to prevent him from alerting other troops.</p><br/><h3>Historical accuracy</h3><p>The plot and characters of Boulle's novel and the screenplay were almost entirely fictional. Since it was not a documentary, there are many historical inaccuracies in the film, as noted by eyewitnesses to the building of the real Burma Railway by historians.</p><p>The conditions to which POW and civilian labourers were subjected were far worse than the film depicted. According to the Commonwealth War Graves Commission:</p><blockquote>The notorious Burma-Siam railway, built by Commonwealth, Dutch and American prisoners of war, was a Japanese project driven by the need for improved communications to support the large Japanese army in Burma. During its construction, approximately 13,000 prisoners of war died and were buried along the railway. An estimated 80,000 to 100,000 civilians also died in the course of the project, chiefly forced labour brought from Malaya and the Dutch East Indies, or conscripted in Siam (Thailand) and Burma. Two labour forces, one based in Siam and the other in Burma, worked from opposite ends of the line towards the centre.</blockquote><p>Lieutenant Colonel Philip Toosey of the British Army was the real senior Allied officer at the bridge in question. Toosey was very different from Nicholson and was certainly not a collaborator who felt obliged to work with the Japanese. Toosey in fact did as much as possible to delay the building of the bridge. While Nicholson disapproves of acts of sabotage and other deliberate attempts to delay progress, Toosey encouraged this: termites were collected in large numbers to eat the wooden structures, and the concrete was badly mixed. Some consider the film to be an insulting parody of Toosey.</p><p>On a BBC Timewatch programme, a former prisoner at the camp states that it is unlikely that a man like the fictional Nicholson could have risen to the rank of lieutenant colonel, and, if he had, due to his collaboration he would have been \"quietly eliminated\" by the other prisoners.</p><p>Julie Summers, in her book The Colonel of Tamarkan, writes that Boulle, who had been a prisoner of war in Thailand, created the fictional Nicholson character as an amalgam of his memories of collaborating French officers. He strongly denied the claim that the book was anti-British, although many involved in the film itself (including Alec Guinness) felt otherwise.</p><p>Ernest Gordon, a survivor of the railway construction and POW camps described in the novel/film, stated in his 1962 book, Through the Valley of the Kwai:</p><blockquote>In Pierre Boulle's book The Bridge over the River Kwai and the film which was based on it, the impression was given that British officers not only took part in building the bridge willingly, but finished in record time to demonstrate to the enemy their superior efficiency. This was an entertaining story. But I am writing a factual account, and in justice to these men—living and dead—who worked on that bridge, I must make it clear that we never did so willingly. We worked at bayonet point and under bamboo lash, taking any risk to sabotage the operation whenever the opportunity arose.</blockquote><p>A 1969 BBC television documentary, Return to the River Kwai, made by former POW John Coast, sought to highlight the real history behind the film (partly through getting ex-POWs to question its factual basis, for example Dr Hugh de Wardener and Lt-Col Alfred Knights), which angered many former POWs. The documentary itself was described by one newspaper reviewer when it was shown on Boxing Day 1974 (The Bridge on the River Kwai had been shown on BBC1 on Christmas Day 1974) as \"Following the movie, this is a rerun of the antidote.\"</p><p>Some of the characters in the film use the names of real people who were involved in the Burma Railway. Their roles and characters, however, are fictionalised. For example, a Sergeant-Major Risaburo Saito was in real life second in command at the camp. In the film, a Colonel Saito is camp commandant. In reality, Risaburo Saito was respected by his prisoners for being comparatively merciful and fair towards them. Toosey later defended him in his war crimes trial after the war, and the two became friends.</p><p>Some Japanese viewers resented the movie's depiction of their engineers' capabilities as inferior and less advanced than they were in reality. Japanese engineers had been surveying and planning the route of the railway since 1937, and they had demonstrated considerable skill during their construction efforts across South-East Asia. Some Japanese viewers also disliked the film for portraying the Allied prisoners of war as more capable of constructing the bridge than the Japanese engineers themselves were, accusing the filmmakers of being unfairly biased and unfamiliar with the realities of the bridge construction, a sentiment echoed by surviving prisoners of war who saw the film in cinemas.</p><p>The major railway bridge described in the novel and film did not actually cross the river known at the time as the Kwai. However, in 1943 a railway bridge was built by Allied POWs over the Mae Klong river – renamed Khwae Yai in the 1960s as a result of the film – at Tha Ma Kham, five kilometres from Kanchanaburi, Thailand. Boulle had never been to the bridge. He knew that the railway ran parallel to the Kwae for many miles, and he therefore assumed that it was the Kwae which it crossed just north of Kanchanaburi. This was an incorrect assumption. The destruction of the bridge as depicted in the film is also entirely fictional. In fact, two bridges were built: a temporary wooden bridge and a permanent steel/concrete bridge a few months later. Both bridges were used for two years, until they were destroyed by Allied bombing. The steel bridge was repaired and is still in use today.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The Bridge on the River Kwai was a massive commercial success. It was the highest-grossing film of 1957 in the United States and Canada and was also the most popular film at the British box office that year. According to Variety, the film earned estimated domestic box office revenues of $18,000,000 although this was revised downwards the following year to $15,000,000, which was still the biggest for 1958 and Columbia's highest-grossing film at the time. By October 1960, the film had earned worldwide box office revenues of $30 million.</p><p>The film was re-released in 1964 and earned a further estimated $2.6 million at the box office in the United States and Canada but the following year its revised total US and Canadian revenues were reported by Variety as $17,195,000.</p><h4>Critical response</h4><p>On review aggregator website Rotten Tomatoes, the film received an approval rating of 96% based on 93 reviews, with an average rating of 9.4/10. The site's critical consensus reads, \"This complex war epic asks hard questions, resists easy answers, and boasts career-defining work from star Alec Guinness and director David Lean.\" On Metacritic, the film has a weighted average score of 87 out of 100 based on 14 critics, indicating \"universal acclaim\".</p><p>Bosley Crowther of The New York Times praised the film as \"a towering entertainment of rich variety and revelation of the ways of men\". Mike Kaplan, reviewing for Variety, described it as \"a gripping drama, expertly put together and handled with skill in all departments.\" Kaplan further praised the actors, especially Alec Guinness, later writing \"the film is unquestionably\" his. William Holden was also credited for his acting for giving a solid characterization that was \"easy, credible and always likeable in a role that is the pivot point of the story\". Edwin Schallert of the Los Angeles Times claimed the film's strongest points were for being \"excellently produced in virtually all respects and that it also offers an especially outstanding and different performance by Alec Guinness. Highly competent work is also done by William Holden, Jack Hawkins and Sessue Hayakawa\". Time magazine praised Lean's directing, noting he demonstrates \"a dazzlingly musical sense and control of the many and involving rhythms of a vast composition. He shows a rare sense of humor and a feeling for the poetry of situation; and he shows the even rarer ability to express these things, not in lines but in lives.\" Harrison's Reports described the film as an \"excellent World War II adventure melodrama\" in which the \"production values are first-rate and so is the photography.\"</p><p>Among retrospective reviews, Roger Ebert gave the film four out of four stars, noting that it is one of the few war movies that \"focuses not on larger rights and wrongs but on individuals\", but commented that the viewer is not certain what is intended by the final dialogue due to the film's shifting points of view. Slant magazine gave the film four out of five stars. Slant stated that \"the 1957 epic subtly develops its themes about the irrationality of honor and the hypocrisy of Britain's class system without ever compromising its thrilling war narrative\", and in comparing to other films of the time said that Bridge on the River Kwai \"carefully builds its psychological tension until it erupts in a blinding flash of sulfur and flame.\"</p><p>Balu Mahendra, the Tamil film director, observed the shooting of this film at Kitulgala, Sri Lanka during his school trip and was inspired to become a film director. Warren Buffett said it was his favorite movie. In an interview, he said that \"here were a lot of lessons in that... The ending of that was sort of the story of life. He created the railroad. Did he really want the enemy to come in across it?\"</p><p>Some Japanese viewers have disliked the film's depiction of the Japanese characters and the historical background presented as being inaccurate, particularly in the interactions between Saito and Nicholson. In particular, they objected to the implication presented in the film that Japanese military engineers were generally unskilled at their profession and lacked proficiency. In reality, Japanese engineers proved to be just as capable at construction efforts as their Allied counterparts.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"8\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Sam Spiegel</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td><span>David Lean</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Alec Guinness</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Sessue Hayakawa</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Based on Material from Another Medium</span></td><td><span>Michael Wilson</span>, <span>Carl Foreman</span>, and <span>Pierre Boulle</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Jack Hildyard</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Peter Taylor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Score</span></td><td><span>Malcolm Arnold</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>British Academy Film Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\"><span class=\"mw-redirect\">Best British Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best British Actor</span></td><td>Alec Guinness</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best British Screenplay</span></td><td>Pierre Boulle</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Society of Cinematographers</span></td><td>Best Cinematography</td><td>Jack Hildyard</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>David di Donatello Awards</span></td><td>Best Foreign Production</td><td>Sam Spiegel</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>David Lean</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>DVD Exclusive Awards</span></td><td colspan=\"2\">Best DVD Menu Design</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best DVD Original Retrospective Documentary/Featurette</td><td><span>Laurent Bouzereau</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Alec Guinness</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td>Sessue Hayakawa</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>David Lean</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Golden Screen Awards</span></td><td colspan=\"2\">Golden Screen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\">Golden Screen with 1 Star</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Grammy Awards</span></td><td><span>Best Sound Track Album, Dramatic Picture Score or Original Cast</span></td><td>Malcolm Arnold</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Laurel Awards</span></td><td colspan=\"2\">Top Drama</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Top Male Dramatic Performance</td><td>Alec Guinness</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>David Lean</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Alec Guinness</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Sessue Hayakawa</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td></tr><tr><td rowspan=\"3\"><span>New York Film Critics Circle Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Director</span></td><td>David Lean</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Alec Guinness</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Honored</td></tr><tr><td><span>Sant Jordi Awards</span></td><td>Best Foreign Actor</td><td>Alec Guinness</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><p>American Film Institute lists:</p><ul><li>1998 — AFI's 100 Years...100 Movies — #13</li><li>2001 — AFI's 100 Years...100 Thrills — #58</li><li>2006 — AFI's 100 Years...100 Cheers — #14</li><li>2007 — AFI's 100 Years...100 Movies (10th Anniversary Edition) — #36</li></ul><p>The film has been selected for preservation in the United States National Film Registry.</p><p>The British Film Institute placed The Bridge on the River Kwai as the 11th greatest British film.</p><br/><h3>First TV broadcast</h3><p>ABC, sponsored by Ford, paid a record $1.8 million for the television rights for two screenings in the United States. The 167-minute film was first telecast, uncut, in colour, on the evening of 25 September 1966, as a three hours-plus ABC Movie Special. The telecast of the film lasted more than three hours because of the commercial breaks. It was still highly unusual at that time for a television network to show such a long film in one evening; most films of that length were still generally split into two parts and shown over two evenings. But the unusual move paid off for ABC—the telecast drew huge ratings with a record audience of 72 million and a Nielsen rating of 38.3 and an audience share of 61%.</p><br/><h3>Restorations and home video releases</h3><p>In 1972, the movie was among the first selection of films released on the early Cartrivision video format, alongside classics such as The Jazz Singer and Sands of Iwo Jima.</p><p>The film was restored in 1985 by Columbia Pictures. The separate dialogue, music and effects were located and remixed with newly recorded \"atmospheric\" sound effects. The image was restored by OCS, Freeze Frame, and Pixel Magic with George Hively editing.</p><p>On 2 November 2010 Columbia Pictures released a newly restored The Bridge on the River Kwai for the first time on Blu-ray. According to Columbia Pictures, they followed an all-new 4K digital restoration from the original negative with newly restored 5.1 audio. The original negative for the feature was scanned at 4k (four times the resolution in High Definition), and the colour correction and digital restoration were also completed at 4k. The negative itself manifested many of the kinds of issues one would expect from a film of this vintage: torn frames, embedded emulsion dirt, scratches through every reel, colour fading. Unique to this film, in some ways, were other issues related to poorly made optical dissolves, the original camera lens and a malfunctioning camera. These problems resulted in a number of anomalies that were very difficult to correct, like a ghosting effect in many scenes that resembles colour mis-registration, and a tick-like effect with the image jumping or jerking side-to-side. These issues, running throughout the film, were addressed to a lesser extent on various previous DVD releases of the film and might not have been so obvious in standard definition.</p><br/><h3>In popular culture</h3><ul><li>In 1962, Spike Milligan and Peter Sellers, with Peter Cook and Jonathan Miller, released the LP record Bridge on the River Wye (Parlophone LP PMC 1190, PCS 3036 (November 1962)). This spoof of the film was based on the script for the 1957 Goon Show episode \"An African Incident\". Shortly before its release, for legal reasons, producer George Martin edited out the 'K' every time the word 'Kwai' was spoken.</li><li>The comedy team of Wayne and Shuster performed a sketch titled \"Kwai Me a River\" on their 27 March 1967 TV show, in which an officer in the British Dental Corps (Wayne) is captured by the Japanese and, despite being comically unintimidated by any abuse the commander of the POW camp (Shuster) inflicts on him, is forced to build a (dental) \"bridge on the river Kwai\" for the commander and plans to include an explosive in the appliance to detonate in his mouth. The commander survives the explosion, attributed to a toothpaste commercial punchline in 1960s commercials.</li><li>In season 1, episode 1 of The Wire, Detective Jimmy McNulty laments, \"I feel like that motherfucker at the end of Bridge over the River Kwai, like what the fuck did I do?\"</li></ul><br/>"
  },
  "errorMessage": ""
}