{
  "imDbId": "tt0317248",
  "title": "City of God",
  "fullTitle": "City of God (2002)",
  "type": "Movie",
  "year": "2002",
  "language": "en",
  "titleInLanguage": "City of God (2002 film)",
  "url": "https://en.wikipedia.org/wiki/City_of_God_(2002_film)",
  "plotShort": {
    "plainText": "City of God (Portuguese: Cidade de Deus) is a 2002 Brazilian epic crime film co-directed by Fernando Meirelles and Kátia Lund, released in Brazil in 2002 and worldwide in 2003. Bráulio Mantovani adapted the story from the 1997 novel of the same name written by Paulo Lins, but the plot is loosely based on real events. It depicts the growth of organized crime in the Cidade de Deus suburb of Rio de Janeiro, between the end of the 1960s and the beginning of the 1980s, with the film's closure depicting the war between the drug dealer Li'l Zé and vigilante-turned-criminal Knockout Ned. The tagline is \"If you run, the beast catches you; if you stay, the beast eats you.\"\r\nThe cast includes Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva, Alice Braga, and Seu Jorge. Most of the actors were, in fact, residents of favelas such as Vidigal and the Cidade de Deus itself.\r\nThe film received critical acclaim and garnered four nominations at the 76th Academy Awards; Best Cinematography (César Charlone), Best Director (Meirelles), Best Film Editing (Daniel Rezende), and Best Writing (Adapted Screenplay) (Mantovani). In 2003, it was Brazil's entry for the Academy Award for Best Foreign Language Film, but it did not end up being nominated as one of the five finalists. It is frequently listed by many critics and audiences as one of the greatest films of the 21st century and one of the best films of all time.\r\nMeirelles and Lund went on to create the City of Men TV series and film City of Men (2007), which share some of the actors (notably leads Silva and Darlan Cunha) and their setting with City of God.",
    "html": "<p>City of God (Portuguese: Cidade de Deus) is a 2002 Brazilian epic crime film co-directed by Fernando Meirelles and Kátia Lund, released in Brazil in 2002 and worldwide in 2003. Bráulio Mantovani adapted the story from the 1997 novel of the same name written by Paulo Lins, but the plot is loosely based on real events. It depicts the growth of organized crime in the Cidade de Deus suburb of Rio de Janeiro, between the end of the 1960s and the beginning of the 1980s, with the film's closure depicting the war between the drug dealer Li'l Zé and vigilante-turned-criminal Knockout Ned. The tagline is \"If you run, the beast catches you; if you stay, the beast eats you.\"</p><p>The cast includes Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva, Alice Braga, and Seu Jorge. Most of the actors were, in fact, residents of favelas such as Vidigal and the Cidade de Deus itself.</p><p>The film received critical acclaim and garnered four nominations at the 76th Academy Awards; Best Cinematography (César Charlone), Best Director (Meirelles), Best Film Editing (Daniel Rezende), and Best Writing (Adapted Screenplay) (Mantovani). In 2003, it was Brazil's entry for the Academy Award for Best Foreign Language Film, but it did not end up being nominated as one of the five finalists. It is frequently listed by many critics and audiences as one of the greatest films of the 21st century and one of the best films of all time.</p><p>Meirelles and Lund went on to create the City of Men TV series and film City of Men (2007), which share some of the actors (notably leads Silva and Darlan Cunha) and their setting with City of God.</p>"
  },
  "plotFull": {
    "plainText": "City of God (Portuguese: Cidade de Deus) is a 2002 Brazilian epic crime film co-directed by Fernando Meirelles and Kátia Lund, released in Brazil in 2002 and worldwide in 2003. Bráulio Mantovani adapted the story from the 1997 novel of the same name written by Paulo Lins, but the plot is loosely based on real events. It depicts the growth of organized crime in the Cidade de Deus suburb of Rio de Janeiro, between the end of the 1960s and the beginning of the 1980s, with the film's closure depicting the war between the drug dealer Li'l Zé and vigilante-turned-criminal Knockout Ned. The tagline is \"If you run, the beast catches you; if you stay, the beast eats you.\"\r\nThe cast includes Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva, Alice Braga, and Seu Jorge. Most of the actors were, in fact, residents of favelas such as Vidigal and the Cidade de Deus itself.\r\nThe film received critical acclaim and garnered four nominations at the 76th Academy Awards; Best Cinematography (César Charlone), Best Director (Meirelles), Best Film Editing (Daniel Rezende), and Best Writing (Adapted Screenplay) (Mantovani). In 2003, it was Brazil's entry for the Academy Award for Best Foreign Language Film, but it did not end up being nominated as one of the five finalists. It is frequently listed by many critics and audiences as one of the greatest films of the 21st century and one of the best films of all time.\r\nMeirelles and Lund went on to create the City of Men TV series and film City of Men (2007), which share some of the actors (notably leads Silva and Darlan Cunha) and their setting with City of God.\r\nPlot\r\nThe film begins in medias res with an armed gang chasing after an escaped chicken in a favela called the Cidade de Deus (\"City of God\"). The chicken stops between the gang and the narrator, a young man nicknamed Rocket (\"Buscapé\").\r\nThe film flashes back to the 1960s where the favela is shown as a newly built housing project with few resources. Three impoverished, amateur thieves known as the \"Tender Trio\" – Shaggy (\"Cabeleira\"), Clipper (\"Alicate\"), and Rocket's older brother, Goose (\"Marreco\") – rob business owners and share their gains with the community who, in turn, hide them from the police.\r\nLi'l Dice (Dadinho), a younger yet ambitious hanger-on, convinces them to hold up a motel and rob its occupants. The gang resolves not to kill anyone and tells Li'l Dice to serve as a lookout. Instead, a frustrated Li'l Dice falsely warns the trio that the police are coming and guns down the motel occupants after they flee. The massacre attracts so much police attention that the trio is forced to split up: Clipper joins the Church, Shaggy is shot by the police while trying to escape the favela with his girlfriend, and Goose is shot by Li'l Dice after taking his money while Li'l Dice's friend Benny (Bené), Shaggy's brother, watches.\r\nIn the 1970s, the favela has been transformed into an urban jungle. Rocket has joined a group of young hippies. He enjoys photography and likes one girl, Angélica. Rocket tries to get close to her while they share a tender moment on the beach, but they're interrupted by a group of delinquents known as \"The Runts\". Li'l Dice, who now calls himself \"Li'l Zé\" (\"Zé Pequeno\"), has established a drug empire with Benny by eliminating all of the competition, except for Carrot, who is a good friend of Benny's.\r\nLi'l Zé takes over 'the apartment', a known drug distribution center, and forces Carrot's manager Blacky (\"Neguinho\"), to work for him instead. Coincidentally, Rocket visits the apartment to get some drugs off Blacky for Angélica during the apartment raid. Through narration, Rocket momentarily considers attempting to kill Li'l Zé and avenge his brother but decides against it. He is let go after Benny tells Li'l Zé that Rocket is Goose's brother. A relative peace comes over the City of God under the reign of Li'l Zé, who manages to avoid police attention. However, the police remain a threat to Zé's business due to the Runts robbing stores in Carrot's district. When Carrot refuses to intervene, Li'l Zé punishes the Runts himself and forces a boy named Steak n' Fries (Fille com Fritas) to kill one of them.\r\nRocket continues to pursue photography and starts working in a supermarket to try and save up for a new camera. However, he gets fired when the Runts loot the store and the owner accuses Rocket of being a part of them. Convinced that he can't earn a living from honest work, Rocket digs up his brother's gun and considers turning to crime. He plans to hold up a bus, but changes his mind after the clerk, a respectful veteran named Knockout Ned (Mané Galinha), urges him to avoid violence and live a peaceful life. Benny decides to branch out of the drug dealer crowd and befriends Tiago, Angélica's ex-boyfriend, who introduces him to his (and Rocket's) friend group. Benny and Angélica begin dating. Together, they decide to leave the City and the drug trade.\r\nDuring Benny's farewell party, Tiago trades a new camera for drugs then Benny tries giving it to Rocket. Embittered by Benny's plan to leave, Li'l Zé takes the camera from him and the two start fighting over it. During this, Blacky arrives and tries to shoot Zé, but misses and kills Benny instead. Upon hearing about this, Carrot murders Blacky, knowing that Benny's death has endangered his life. That night, a heartbroken Li'l Zé and a group of his soldiers set out to kill Carrot and finally conquer his territory.\r\nOn the way, Zé beats up Knockout Ned and rapes his girlfriend for dismissing his advances at Benny's party. After leaving, Li'l Zé questions his decision to spare Ned and goes to his home to finish him off. Ned's brother, Gerson steps outside and tries reasoning with Zé to no avail. Gerson then stabs Li'l Zé in the arm and the gang retaliates by shooting into the house, killing Gerson and Ned's uncle in the process. Li'l Zé postpones the assault on Carrot and a gang war breaks out between the two. After promising that they won't harm the innocent, a vengeful Ned sides with Carrot. However, this is quickly broken by Ned himself, who kills a security guard during a bank holdup.\r\nThe war is still ongoing a year later, in 1981, the origin forgotten. Both sides enlist more \"soldiers\" and public interest greatly increases. To avoid the violence, Rocket begins delivering papers for a newspaper company. After finding Steak n' Fries killed in a fight, Ned is shot by an unseen assailant and arrested. The gangs start trafficking firearms to supply both sides and Knockout Ned is interviewed on the news about the gang war. Envious of Ned's newfound fame, Li'l Zé gives Benny's camera to Rocket and has him take photos of their gang while they brandish their newly acquired weapons. Zé then orders Rocket to develop the photos and bring them back to him. Rocket uses his job to develop the pictures, but without his knowledge, a reporter publishes them on the front page. The photos receive widespread acclaim since no outsiders can safely enter the City of God anymore, prompting the newspaper to offer Rocket a photography internship in exchange for more. Fearing Li'l Zé will kill him for publishing the photos, Rocket decides to lay low before returning to the favela. The reporter, a woman named Marina, takes Rocket in for the night and he loses his virginity to her. Later that night, Carrot infiltrates the hospital where Ned is being held and frees him. Unbeknownst to Rocket, Li'l Zé is pleased by the photos because of the increased notoriety they bring him.\r\nEventually, Li'l Zé recruits the Runts and Rocket returns to the City for more photographs, bringing the film back to its opening scene. Rocket finds himself caught between Zé's gang and the arriving police, who quickly withdraw when they realize they are outnumbered and outgunned. Rocket is surprised when Zé asks him to take pictures, but as he prepares to, Carrot's gang arrives. In the ensuing gunfight, Li'l Zé and Tiago hijack a truck, but Ned shoots and kills Tiago, causing them to crash. Ned is subsequently killed by a boy, who's revealed to be the one who shot him earlier; he infiltrated Carrot's gang to avenge his father, the bank security guard whom Ned killed when the war began. The police capture Li'l Zé and Carrot and plan to show Carrot off to the media. Since Li'l Zé has been bribing the police, they take all of his money and let him go, but Rocket secretly photographs the scene. After this, the Runts corner Li'l Zé and collectively execute him; they intend to take over his criminal enterprise and avenge their friend killed by Steak n' Fries.\r\nRocket contemplates whether to publish the cops' photo, expose corruption, and become famous or the picture of Li'l Zé's dead body, which will secure his position at the newspaper. He decides on the latter, fearing a violent response from the cops, as well as seeing the opportunity to pursue his dream. In the final scene, the Runts are shown walking around the City of God, listing off the dealers they plan to kill to take over the drug business, including the Red Brigade.\r\nCast\r\nAlexandre Rodrigues as Rocket:The narrator, who dreams of becoming a photographer. His real name is Wilson Rodrigues.\r\nLeandro Firmino as Li'l Zé/Li'l Dice:A power-hungry sociopath, who takes sadistic pleasure in killing. \"Dado\" is a common nickname for Eduardo and means \"dice\", and \"inho\" a diminutive suffix. As an adult, he is given the name Zé Pequeno in a Candomblé ceremony, which may be unrelated to his actual name. Zé is a nickname for José, while pequeno means \"little\". Douglas Silva portrays Li'l Dice as a child.\r\nPhellipe Haagensen as Benny:Zé's longtime partner in crime, he is a friendly City of God drug dealer who fancies himself a sort of Robin Hood, and eventually wants to lead an honest life. Michel Gomes portrays Benny as a child.\r\nMatheus Nachtergaele as Carrot:A smaller-scale drug dealer who is friendly with Benny but is constantly threatened by Zé.\r\nSeu Jorge as Knockout Ned: A handsome, charismatic gentleman. As a former veteran, he is an excellent shot and can shoot better than most of the \"soldiers\". His name was changed for the English subtitles because in English, \"chicken\" is a term for a coward (in Brazil it denotes popularity among women). \"Mané\" is a nickname for Manuel.\r\nJonathan Haagensen as Shaggy:Older brother of Benny and the leader of the Tender Trio (\"Trio Ternura\"), a group of thieves who share their profits with the population of the City of God.\r\nRoberta Rodrigues as Berenice:Shaggy's girlfriend, who convinces him to leave the favela and his criminal past.\r\nRenato de Souza as Goose:One of the Tender Trio, and Rocket's brother. He sleeps with a bartender's wife and gets kicked out by his father when the police arrive, he's killed by Li'l Dice later that day.\r\nJefechander Suplino as Clipper:One of the Tender Trio. He later gives up crime to join the Church.\r\nEdson Oliveira as Stringy:Childhood friend of Rocket. Emerson Gomes portrays Stringy as a child.\r\nAlice Braga as Angélica:A friend and love interest of Rocket, and later Benny's girlfriend, who motivates Benny to abandon the criminal life.\r\nDaniel Zettel as Tiago:Angélica's ex-boyfriend, who later becomes Li'l Zé's associate and a drug addict.\r\nDarlan Cunha as Steak n' Fries:A young boy who joins Zé's gang.\r\nCharles Paraventi as Charles / Uncle Sam:A weapons dealer who's supplied by the police. After returning from a deal empty-handed, the police kill him.\r\nGraziella Moretto as Marina Cintra:A journalist for Jornal do Brasil, who hires Rocket as a photographer.\r\nLuiz Carlos Ribeiro Seixas as Touro:An honest police officer.\r\nMaurício Marques as Melonhead:A corrupt police officer.\r\nThiago Martins as Lampião:Child leader of the Runts gang.\r\nMarcos Junqueira as Otávio:Child leader of the Runts gang.\r\nProduction\r\nCity of God was filmed on 16mm film stock.\r\nOn the bonus DVD, it is revealed that the only professional actor with years of filming experience was Matheus Nachtergaele, who played the supporting role of Carrot. Most of the remaining cast were from real-life favelas, and in some cases, even the real-life City of God favela itself. According to Meirelles, amateur actors were used for two reasons: the lack of available professional black actors, and the desire for authenticity. Meirelles explained: \"Today I can open a casting call and have 500 black actors, but just ten years ago this possibility did not exist. In Brazil, there were three or four young black actors and at the same time I felt that actors from the middle class could not make the film. I needed authenticity.\"\r\nBeginning around 2000, about a hundred children and young people were hand-picked and placed into an \"actors' workshop\" for several months. In contrast to more traditional methods (e.g. studying theatre and rehearsing), it focused on simulating authentic street war scenes, such as a hold-up, scuffle, and shoot-out. A lot came from improvisation, as it was thought better to create an authentic, gritty atmosphere. This way, the inexperienced cast soon learned to move and act naturally. After filming, the crew could not leave the cast to return to their old lives in the favelas. Help groups were set up to help those involved in the production to build more promising futures.: 135–139\r\nMeirelles went into the film with the intention of staying true to the \"casual nature\" of the violence in the novel by Lins. Critic Jean Oppenheimer wrote on the production of the film saying that: \"A second guiding principle was to avoid glamorising the violence\" and that \"many of the killings are either shown indistinctly or kept out of frame.\": 26–32\r\nBecause the real Cidade de Deus favela was in conflict, a large majority of the film was shot in Cidade Alta, a different favela within Rio. During the production, slumlords did not allow for the production company to have their own security, so local security guards were hired for the safety of the set.\r\nLund and Meirelles filmed the short film Golden Gate as a test run while casting for City of God was in the initial stages.\r\nReception\r\nBox office\r\nThe film was screened out of competition at the 2002 Cannes Film Festival. In Brazil, City of God garnered the largest audience for a domestic film in 2003, with over 3.1 million tickets sold, and a gross of R$18.6 million ($10.3 million). The film grossed over $7.5 million in the U.S. and over US$30.5 million worldwide.\r\nCritical response\r\nOn Rotten Tomatoes, City of God has an approval rating of 91% based on reviews from 164 critics, with an average rating of 8.3/10. The website's consensus reads, \"City of God offers a shocking and disturbing—but always compelling—look at life in the slums of Rio de Janeiro.\" On Metacritic, the film holds a score of 79 out of 100 based on 33 critic reviews, indicating \"generally favorable reviews\".\r\nColin Kennedy from Empire awarded the film a full 5 out of 5 stars, comparing it favorably to Goodfellas and writing in his review, \"At once a laboratory for cinema technique and a victory for raw heart, this is a snot-nosed, blood-stained masterpiece. If you see even one or two better movies this year, you will be very lucky indeed.\" In 2008, the magazine chose City of God as the 177th best film of all time.\r\nFilm critic Roger Ebert awarded the film 4 stars out of 4, writing in his review, \"City of God churns with furious energy as it plunges into the story of the slum gangs of Rio de Janeiro. Breathtaking and terrifying, urgently involved with its characters, it announces a new director of great gifts and passions: Fernando Meirelles. Remember the name.\"\r\nFilmmaker Robert Altman stated, \"I don't know how Fernando Meirelles made City Of God. It's so courageous, so truthful. I think it's the best picture I've ever seen\". Meirelles himself cited Altman's work as an influence on his own career.\r\nThe film was not without criticism. Peter Rainer of New York magazine stated that while the film was \"powerful\", it was also \"rather numbing\". John Powers of LA Weekly wrote that \" whirs with energy for nearly its full 130-minute running time, it is oddly lacking in emotional heft for a work that aspires to be so epic – it is essentially a tarted up exploitation picture whose business is to make ghastly things fun\".\r\nIvana Bentes, a Brazilian film critic, criticised the film for its depiction of the favela and her view that it glorified issues of poverty and violence as means of \"domestication of the most radical themes of culture and Brazilian cinema ... as products for export.\" Bentes targets the film specifically in saying that: \"City of God promotes tourism in hell\".\r\nCity of God was ranked No.3 in Film4's \"50 Films to See Before You Die\", and No.7 in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010. It was also ranked No.6 on The Guardian's list of \"the 25 Best Action Movies Ever\". It was ranked No.1 in Paste magazine's 50 best movies of the decade of the 2000s. Time listed it as one of the 100 greatest films of all time.\r\nIn 2012, the Motion Picture Editors Guild listed City of God as the 17th best-edited film of all time based on a survey of its members.\r\nTop ten lists\r\nThe film appeared on several American critics' top ten lists of the best films of 2003.\r\n2nd – Chicago Sun-Times (Roger Ebert) (for 2002)\r\n2nd – The Charlotte Observer (Lawrence Toppman)\r\n2nd – Chicago Tribune (Marc Caro)\r\n4th – New York Post (Jonathan Foreman)\r\n4th – Time (Richard Corliss)\r\n5th – Portland Oregonian (Shawn Levy)\r\n7th – Chicago Tribune (Michael Wilmington)\r\n10th – The Hollywood Reporter (Michael Rechtshaffen)\r\n10th – New York Post (Megan Lehmann)\r\n10th – The New York Times (Stephen Holden)\r\nIt is ranked No.38 on the BBC list of best 100 films of the 21st century.\r\nMV Bill's response\r\nBrazilian rapper MV Bill, a resident of Cidade de Deus, said the film had \"brought no good to the favela, no social, moral, or human benefit.\" He said, \"The world will know that they exploited the image of the children who live here in Cidade de Deus. What is obvious is that they are going to carry a bigger stigma throughout their lives; it has only become greater because of the film.\": 123\r\nAwards and nominations\r\nCity of God won fifty-five awards and received another twenty-nine nominations. Among those:\r\nMusic\r\nThe score to the film composed by Antonio Pinto and Ed Córtes. It was followed by two remix albums. Songs from the film:\r\n\"Alvorada\" (Cartola / Carlos Cachaça / Herminio B. Carvalho) – Cartola\r\n\"Azul Da Cor Do Mar\" (Tim Maia) – Tim Maia\r\n\"Dance Across the Floor\" (Harry Wayne Casey / Ronald Finch) – Jimmy Bo Horne\r\n\"Get Up (I Feel Like Being a) Sex Machine\" (James Brown / Bobby Byrd / Ronald R. Lenhoff) – James Brown\r\n\"Hold Back the Water\" (Randy Bachman / Robin Bachman / Charles Turner) – Bachman–Turner Overdrive\r\n\"Hot Pants Road\" (Charles Bobbit / James Brown / St Clair Jr Pinckney) – The J.B.'s\r\n\"Kung Fu Fighting\" (Carl Douglas) – Carl Douglas\r\n\"Magrelinha\" (Luiz Melodia) – Luiz Melodia\r\n\"Metamorfose Ambulante\" (Raul Seixas) – Raul Seixas\r\n\"Na Rua, Na Chuva, Na Fazenda\" (Hyldon) – Hyldon\r\n\"Nem Vem Que Não Tem\" (Carlos Imperial) – Wilson Simonal\r\n\"O Caminho Do Bem\" (Sérgio / Beto / Paulo) – Tim Maia\r\n\"Preciso Me Encontrar\" (Candeia) – Cartola\r\n\"So Very Hard to Go\" (Emilio Castillo / Stephen M. Kupka) – Tower of Power\r\nLegacy\r\nIn an interview with Slant Magazine, Meirelles states he had met with Brazil's former and current president Luiz Inácio Lula da Silva who told him about the impact the film has had on both policies and public security within the country. The film has also sparked major increase in film productions, with over 45 being done during 2002. Films such as The Motorcycle Diaries and The Intruder are some of the films which have used Brazil for film production.\r\nThe 2013 documentary City of God – 10 Years Later reunites the cast and crew of City of God and takes a look at how their lives have changed after the original film's release. In a BBC article written at the time of the documentary's release, Firmino mentions that the cast had mixed careers after the film's release. Firmino says that Jefechander Suplino, who played Clipper, could not be found by the documentary producers. His mother, however, believes him to still be alive, but is unaware of his whereabouts. Seu Jorge, who played Knockout Ned, had a better career after the film and became a major musician, performing at the London 2012 Olympic Games closing ceremony.",
    "html": "<p>City of God (Portuguese: Cidade de Deus) is a 2002 Brazilian epic crime film co-directed by Fernando Meirelles and Kátia Lund, released in Brazil in 2002 and worldwide in 2003. Bráulio Mantovani adapted the story from the 1997 novel of the same name written by Paulo Lins, but the plot is loosely based on real events. It depicts the growth of organized crime in the Cidade de Deus suburb of Rio de Janeiro, between the end of the 1960s and the beginning of the 1980s, with the film's closure depicting the war between the drug dealer Li'l Zé and vigilante-turned-criminal Knockout Ned. The tagline is \"If you run, the beast catches you; if you stay, the beast eats you.\"</p><p>The cast includes Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva, Alice Braga, and Seu Jorge. Most of the actors were, in fact, residents of favelas such as Vidigal and the Cidade de Deus itself.</p><p>The film received critical acclaim and garnered four nominations at the 76th Academy Awards; Best Cinematography (César Charlone), Best Director (Meirelles), Best Film Editing (Daniel Rezende), and Best Writing (Adapted Screenplay) (Mantovani). In 2003, it was Brazil's entry for the Academy Award for Best Foreign Language Film, but it did not end up being nominated as one of the five finalists. It is frequently listed by many critics and audiences as one of the greatest films of the 21st century and one of the best films of all time.</p><p>Meirelles and Lund went on to create the City of Men TV series and film City of Men (2007), which share some of the actors (notably leads Silva and Darlan Cunha) and their setting with City of God.</p><br/><h3>Plot</h3><p>The film begins in medias res with an armed gang chasing after an escaped chicken in a favela called the Cidade de Deus (\"City of God\"). The chicken stops between the gang and the narrator, a young man nicknamed Rocket (\"Buscapé\").</p><p>The film flashes back to the 1960s where the favela is shown as a newly built housing project with few resources. Three impoverished, amateur thieves known as the \"Tender Trio\" – Shaggy (\"Cabeleira\"), Clipper (\"Alicate\"), and Rocket's older brother, Goose (\"Marreco\") – rob business owners and share their gains with the community who, in turn, hide them from the police.</p><p>Li'l Dice (Dadinho), a younger yet ambitious hanger-on, convinces them to hold up a motel and rob its occupants. The gang resolves not to kill anyone and tells Li'l Dice to serve as a lookout. Instead, a frustrated Li'l Dice falsely warns the trio that the police are coming and guns down the motel occupants after they flee. The massacre attracts so much police attention that the trio is forced to split up: Clipper joins the Church, Shaggy is shot by the police while trying to escape the favela with his girlfriend, and Goose is shot by Li'l Dice after taking his money while Li'l Dice's friend Benny (Bené), Shaggy's brother, watches.</p><p>In the 1970s, the favela has been transformed into an urban jungle. Rocket has joined a group of young hippies. He enjoys photography and likes one girl, Angélica. Rocket tries to get close to her while they share a tender moment on the beach, but they're interrupted by a group of delinquents known as \"The Runts\". Li'l Dice, who now calls himself \"Li'l Zé\" (\"Zé Pequeno\"), has established a drug empire with Benny by eliminating all of the competition, except for Carrot, who is a good friend of Benny's.</p><p>Li'l Zé takes over 'the apartment', a known drug distribution center, and forces Carrot's manager Blacky (\"Neguinho\"), to work for him instead. Coincidentally, Rocket visits the apartment to get some drugs off Blacky for Angélica during the apartment raid. Through narration, Rocket momentarily considers attempting to kill Li'l Zé and avenge his brother but decides against it. He is let go after Benny tells Li'l Zé that Rocket is Goose's brother. A relative peace comes over the City of God under the reign of Li'l Zé, who manages to avoid police attention. However, the police remain a threat to Zé's business due to the Runts robbing stores in Carrot's district. When Carrot refuses to intervene, Li'l Zé punishes the Runts himself and forces a boy named Steak n' Fries (Fille com Fritas) to kill one of them.</p><p>Rocket continues to pursue photography and starts working in a supermarket to try and save up for a new camera. However, he gets fired when the Runts loot the store and the owner accuses Rocket of being a part of them. Convinced that he can't earn a living from honest work, Rocket digs up his brother's gun and considers turning to crime. He plans to hold up a bus, but changes his mind after the clerk, a respectful veteran named Knockout Ned (Mané Galinha), urges him to avoid violence and live a peaceful life. Benny decides to branch out of the drug dealer crowd and befriends Tiago, Angélica's ex-boyfriend, who introduces him to his (and Rocket's) friend group. Benny and Angélica begin dating. Together, they decide to leave the City and the drug trade.</p><p>During Benny's farewell party, Tiago trades a new camera for drugs then Benny tries giving it to Rocket. Embittered by Benny's plan to leave, Li'l Zé takes the camera from him and the two start fighting over it. During this, Blacky arrives and tries to shoot Zé, but misses and kills Benny instead. Upon hearing about this, Carrot murders Blacky, knowing that Benny's death has endangered his life. That night, a heartbroken Li'l Zé and a group of his soldiers set out to kill Carrot and finally conquer his territory.</p><p>On the way, Zé beats up Knockout Ned and rapes his girlfriend for dismissing his advances at Benny's party. After leaving, Li'l Zé questions his decision to spare Ned and goes to his home to finish him off. Ned's brother, Gerson steps outside and tries reasoning with Zé to no avail. Gerson then stabs Li'l Zé in the arm and the gang retaliates by shooting into the house, killing Gerson and Ned's uncle in the process. Li'l Zé postpones the assault on Carrot and a gang war breaks out between the two. After promising that they won't harm the innocent, a vengeful Ned sides with Carrot. However, this is quickly broken by Ned himself, who kills a security guard during a bank holdup.</p><p>The war is still ongoing a year later, in 1981, the origin forgotten. Both sides enlist more \"soldiers\" and public interest greatly increases. To avoid the violence, Rocket begins delivering papers for a newspaper company. After finding Steak n' Fries killed in a fight, Ned is shot by an unseen assailant and arrested. The gangs start trafficking firearms to supply both sides and Knockout Ned is interviewed on the news about the gang war. Envious of Ned's newfound fame, Li'l Zé gives Benny's camera to Rocket and has him take photos of their gang while they brandish their newly acquired weapons. Zé then orders Rocket to develop the photos and bring them back to him. Rocket uses his job to develop the pictures, but without his knowledge, a reporter publishes them on the front page. The photos receive widespread acclaim since no outsiders can safely enter the City of God anymore, prompting the newspaper to offer Rocket a photography internship in exchange for more. Fearing Li'l Zé will kill him for publishing the photos, Rocket decides to lay low before returning to the favela. The reporter, a woman named Marina, takes Rocket in for the night and he loses his virginity to her. Later that night, Carrot infiltrates the hospital where Ned is being held and frees him. Unbeknownst to Rocket, Li'l Zé is pleased by the photos because of the increased notoriety they bring him.</p><p>Eventually, Li'l Zé recruits the Runts and Rocket returns to the City for more photographs, bringing the film back to its opening scene. Rocket finds himself caught between Zé's gang and the arriving police, who quickly withdraw when they realize they are outnumbered and outgunned. Rocket is surprised when Zé asks him to take pictures, but as he prepares to, Carrot's gang arrives. In the ensuing gunfight, Li'l Zé and Tiago hijack a truck, but Ned shoots and kills Tiago, causing them to crash. Ned is subsequently killed by a boy, who's revealed to be the one who shot him earlier; he infiltrated Carrot's gang to avenge his father, the bank security guard whom Ned killed when the war began. The police capture Li'l Zé and Carrot and plan to show Carrot off to the media. Since Li'l Zé has been bribing the police, they take all of his money and let him go, but Rocket secretly photographs the scene. After this, the Runts corner Li'l Zé and collectively execute him; they intend to take over his criminal enterprise and avenge their friend killed by Steak n' Fries.</p><p>Rocket contemplates whether to publish the cops' photo, expose corruption, and become famous or the picture of Li'l Zé's dead body, which will secure his position at the newspaper. He decides on the latter, fearing a violent response from the cops, as well as seeing the opportunity to pursue his dream. In the final scene, the Runts are shown walking around the City of God, listing off the dealers they plan to kill to take over the drug business, including the Red Brigade.</p><br/><h3>Cast</h3><ul><li>Alexandre Rodrigues as Rocket:The narrator, who dreams of becoming a photographer. His real name is Wilson Rodrigues.</li><li>Leandro Firmino as Li'l Zé/Li'l Dice:A power-hungry sociopath, who takes sadistic pleasure in killing. \"Dado\" is a common nickname for Eduardo and means \"dice\", and \"inho\" a diminutive suffix. As an adult, he is given the name Zé Pequeno in a Candomblé ceremony, which may be unrelated to his actual name. Zé is a nickname for José, while pequeno means \"little\". Douglas Silva portrays Li'l Dice as a child.</li><li>Phellipe Haagensen as Benny:Zé's longtime partner in crime, he is a friendly City of God drug dealer who fancies himself a sort of Robin Hood, and eventually wants to lead an honest life. Michel Gomes portrays Benny as a child.</li><li>Matheus Nachtergaele as Carrot:A smaller-scale drug dealer who is friendly with Benny but is constantly threatened by Zé.</li><li>Seu Jorge as Knockout Ned: A handsome, charismatic gentleman. As a former veteran, he is an excellent shot and can shoot better than most of the \"soldiers\". His name was changed for the English subtitles because in English, \"chicken\" is a term for a coward (in Brazil it denotes popularity among women). \"Mané\" is a nickname for Manuel.</li><li>Jonathan Haagensen as Shaggy:Older brother of Benny and the leader of the Tender Trio (\"Trio Ternura\"), a group of thieves who share their profits with the population of the City of God.</li><li>Roberta Rodrigues as Berenice:Shaggy's girlfriend, who convinces him to leave the favela and his criminal past.</li><li>Renato de Souza as Goose:One of the Tender Trio, and Rocket's brother. He sleeps with a bartender's wife and gets kicked out by his father when the police arrive, he's killed by Li'l Dice later that day.</li><li>Jefechander Suplino as Clipper:One of the Tender Trio. He later gives up crime to join the Church.</li><li>Edson Oliveira as Stringy:Childhood friend of Rocket. Emerson Gomes portrays Stringy as a child.</li><li>Alice Braga as Angélica:A friend and love interest of Rocket, and later Benny's girlfriend, who motivates Benny to abandon the criminal life.</li><li>Daniel Zettel as Tiago:Angélica's ex-boyfriend, who later becomes Li'l Zé's associate and a drug addict.</li><li>Darlan Cunha as Steak n' Fries:A young boy who joins Zé's gang.</li><li>Charles Paraventi as Charles / Uncle Sam:A weapons dealer who's supplied by the police. After returning from a deal empty-handed, the police kill him.</li><li>Graziella Moretto as Marina Cintra:A journalist for Jornal do Brasil, who hires Rocket as a photographer.</li><li>Luiz Carlos Ribeiro Seixas as Touro:An honest police officer.</li><li>Maurício Marques as Melonhead:A corrupt police officer.</li><li>Thiago Martins as Lampião:Child leader of the Runts gang.</li><li>Marcos Junqueira as Otávio:Child leader of the Runts gang.</li></ul><br/><h3>Production</h3><p>City of God was filmed on 16mm film stock.</p><p>On the bonus DVD, it is revealed that the only professional actor with years of filming experience was Matheus Nachtergaele, who played the supporting role of Carrot. Most of the remaining cast were from real-life favelas, and in some cases, even the real-life City of God favela itself. According to Meirelles, amateur actors were used for two reasons: the lack of available professional black actors, and the desire for authenticity. Meirelles explained: \"Today I can open a casting call and have 500 black actors, but just ten years ago this possibility did not exist. In Brazil, there were three or four young black actors and at the same time I felt that actors from the middle class could not make the film. I needed authenticity.\"</p><p>Beginning around 2000, about a hundred children and young people were hand-picked and placed into an \"actors' workshop\" for several months. In contrast to more traditional methods (e.g. studying theatre and rehearsing), it focused on simulating authentic street war scenes, such as a hold-up, scuffle, and shoot-out. A lot came from improvisation, as it was thought better to create an authentic, gritty atmosphere. This way, the inexperienced cast soon learned to move and act naturally. After filming, the crew could not leave the cast to return to their old lives in the favelas. Help groups were set up to help those involved in the production to build more promising futures.: 135–139</p><p>Meirelles went into the film with the intention of staying true to the \"casual nature\" of the violence in the novel by Lins. Critic Jean Oppenheimer wrote on the production of the film saying that: \"A second guiding principle was to avoid glamorising the violence\" and that \"many of the killings are either shown indistinctly or kept out of frame.\": 26–32</p><p>Because the real Cidade de Deus favela was in conflict, a large majority of the film was shot in Cidade Alta, a different favela within Rio. During the production, slumlords did not allow for the production company to have their own security, so local security guards were hired for the safety of the set.</p><p>Lund and Meirelles filmed the short film Golden Gate as a test run while casting for City of God was in the initial stages.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The film was screened out of competition at the 2002 Cannes Film Festival. In Brazil, City of God garnered the largest audience for a domestic film in 2003, with over 3.1 million tickets sold, and a gross of R$18.6 million ($10.3 million). The film grossed over $7.5 million in the U.S. and over US$30.5 million worldwide.</p><h4>Critical response</h4><p>On Rotten Tomatoes, City of God has an approval rating of 91% based on reviews from 164 critics, with an average rating of 8.3/10. The website's consensus reads, \"City of God offers a shocking and disturbing—but always compelling—look at life in the slums of Rio de Janeiro.\" On Metacritic, the film holds a score of 79 out of 100 based on 33 critic reviews, indicating \"generally favorable reviews\".</p><p>Colin Kennedy from Empire awarded the film a full 5 out of 5 stars, comparing it favorably to Goodfellas and writing in his review, \"At once a laboratory for cinema technique and a victory for raw heart, this is a snot-nosed, blood-stained masterpiece. If you see even one or two better movies this year, you will be very lucky indeed.\" In 2008, the magazine chose City of God as the 177th best film of all time.</p><p>Film critic Roger Ebert awarded the film 4 stars out of 4, writing in his review, \"City of God churns with furious energy as it plunges into the story of the slum gangs of Rio de Janeiro. Breathtaking and terrifying, urgently involved with its characters, it announces a new director of great gifts and passions: Fernando Meirelles. Remember the name.\"</p><p>Filmmaker Robert Altman stated, \"I don't know how Fernando Meirelles made City Of God. It's so courageous, so truthful. I think it's the best picture I've ever seen\". Meirelles himself cited Altman's work as an influence on his own career.</p><p>The film was not without criticism. Peter Rainer of New York magazine stated that while the film was \"powerful\", it was also \"rather numbing\". John Powers of LA Weekly wrote that \" whirs with energy for nearly its full 130-minute running time, it is oddly lacking in emotional heft for a work that aspires to be so epic – it is essentially a tarted up exploitation picture whose business is to make ghastly things fun\".</p><p>Ivana Bentes, a Brazilian film critic, criticised the film for its depiction of the favela and her view that it glorified issues of poverty and violence as means of \"domestication of the most radical themes of culture and Brazilian cinema ... as products for export.\" Bentes targets the film specifically in saying that: \"City of God promotes tourism in hell\".</p><p>City of God was ranked No.3 in Film4's \"50 Films to See Before You Die\", and No.7 in Empire magazine's \"The 100 Best Films of World Cinema\" in 2010. It was also ranked No.6 on The Guardian's list of \"the 25 Best Action Movies Ever\". It was ranked No.1 in Paste magazine's 50 best movies of the decade of the 2000s. Time listed it as one of the 100 greatest films of all time.</p><p>In 2012, the Motion Picture Editors Guild listed City of God as the 17th best-edited film of all time based on a survey of its members.</p><h4>Top ten lists</h4><p>The film appeared on several American critics' top ten lists of the best films of 2003.</p><ul><li>2nd – Chicago Sun-Times (Roger Ebert) (for 2002)</li><li>2nd – The Charlotte Observer (Lawrence Toppman)</li><li>2nd – Chicago Tribune (Marc Caro)</li><li>4th – New York Post (Jonathan Foreman)</li><li>4th – Time (Richard Corliss)</li><li>5th – Portland Oregonian (Shawn Levy)</li><li>7th – Chicago Tribune (Michael Wilmington)</li><li>10th – The Hollywood Reporter (Michael Rechtshaffen)</li><li>10th – New York Post (Megan Lehmann)</li><li>10th – The New York Times (Stephen Holden)</li></ul><p>It is ranked No.38 on the BBC list of best 100 films of the 21st century.</p><h4>MV Bill's response</h4><p>Brazilian rapper MV Bill, a resident of Cidade de Deus, said the film had \"brought no good to the favela, no social, moral, or human benefit.\" He said, \"The world will know that they exploited the image of the children who live here in Cidade de Deus. What is obvious is that they are going to carry a bigger stigma throughout their lives; it has only become greater because of the film.\": 123</p><h4>Awards and nominations</h4><p>City of God won fifty-five awards and received another twenty-nine nominations. Among those:</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Organization</th><th>Award</th><th>Recipient</th><th>Result</th><th>Ref</th></tr><tr><td rowspan=\"4\"><span>Academy Awards</span></td><td><span>Best Director</span></td><td><span>Fernando Meirelles</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span>Best Adapted Screenplay</span></td><td><span>Bráulio Mantovani</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>César Charlone</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Daniel Rezende</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">AFI Fest</span></td><td>Audience Award</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Broadcast Film Critics Association Awards</span></td><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>British Academy Film Awards</span></td><td><span>Best Editing</span></td><td><span>Daniel Rezende</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Best Foreign Film</span></td><td>Andrea Barata Ribeiro, Mauricio Andrade Ramos,<br> Fernando Meirelles</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>British Independent Film Awards</span></td><td>Best Foreign Independent Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Chicago Film Critics Association Awards</span></td><td>Best Foreign Language Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Golden Globe Awards</span></td><td><span>Best Foreign Language Film</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Golden Trailer Awards</span></td><td>Best Independent Foreign Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"16\"><span>Grande Prêmio do Cinema Brasileiro</span></td><td><span>Best Film</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\"></td></tr><tr><td>Best Director</td><td>Fernando Meirelles</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Adapted Screenplay</td><td>Bráulio Mantovani</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Cinematography</td><td>César Charlone</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Editing</td><td>Daniel Rezende</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Sound</td><td>Guilherme Ayrosa, Paulo Ricardo Nunes,<br> Alessandro Laroca, Alejandro Quevedo, Carlos Honc,<br> Roland Thai, Rudy Pi, Adam Sawelson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor</td><td>Leandro Firmino</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best Actress</td><td>Roberta Rodrigues</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor</td><td>Jonathan Haagensen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best Supporting Actor</td><td>Douglas Silva</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress</td><td>Alice Braga</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best Supporting Actress</td><td>Graziela Moretto</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Art Direction</td><td>Tulé Peak</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>Best Costume Design</td><td>Bia Salgado, Inês Salgado</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>Best Makeup</td><td>Anna Van Steen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>Best Soundtrack</td><td>Antonio Pinto, Ed Côrtes</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Independent Spirit Awards</span></td><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td>Fernando Meirelles</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>Las Vegas Film Critics Society Awards</td><td>Best Foreign Language Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Motion Picture Sound Editors</span></td><td>Best Sound Editing in a Foreign Film</td><td>Martín Hernández, Roland N. Thai, Alessandro Laroca</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">New York Film Critics Circle Awards</span></td><td><span class=\"mw-redirect\">Best Foreign Language Film</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Prism Awards</span></td><td>Best Theatrical Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Satellite Awards</span></td><td>Best Foreign Language Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Southeastern Film Critics Association Awards</td><td>Best Foreign Language Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Toronto Film Critics Association Awards</span></td><td>Best Foreign Language Film</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Toronto International Film Festival</span></td><td>Visions Award – Special Citation</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><br/><h3>Music</h3><p>The score to the film composed by Antonio Pinto and Ed Córtes. It was followed by two remix albums. Songs from the film:</p><ul><li>\"Alvorada\" (Cartola / Carlos Cachaça / Herminio B. Carvalho) – Cartola</li><li>\"Azul Da Cor Do Mar\" (Tim Maia) – Tim Maia</li><li>\"Dance Across the Floor\" (Harry Wayne Casey / Ronald Finch) – Jimmy Bo Horne</li><li>\"Get Up (I Feel Like Being a) Sex Machine\" (James Brown / Bobby Byrd / Ronald R. Lenhoff) – James Brown</li><li>\"Hold Back the Water\" (Randy Bachman / Robin Bachman / Charles Turner) – Bachman–Turner Overdrive</li><li>\"Hot Pants Road\" (Charles Bobbit / James Brown / St Clair Jr Pinckney) – The J.B.'s</li><li>\"Kung Fu Fighting\" (Carl Douglas) – Carl Douglas</li><li>\"Magrelinha\" (Luiz Melodia) – Luiz Melodia</li><li>\"Metamorfose Ambulante\" (Raul Seixas) – Raul Seixas</li><li>\"Na Rua, Na Chuva, Na Fazenda\" (Hyldon) – Hyldon</li><li>\"Nem Vem Que Não Tem\" (Carlos Imperial) – Wilson Simonal</li><li>\"O Caminho Do Bem\" (Sérgio / Beto / Paulo) – Tim Maia</li><li>\"Preciso Me Encontrar\" (Candeia) – Cartola</li><li>\"So Very Hard to Go\" (Emilio Castillo / Stephen M. Kupka) – Tower of Power</li></ul><br/><h3>Legacy</h3><p>In an interview with Slant Magazine, Meirelles states he had met with Brazil's former and current president Luiz Inácio Lula da Silva who told him about the impact the film has had on both policies and public security within the country. The film has also sparked major increase in film productions, with over 45 being done during 2002. Films such as The Motorcycle Diaries and The Intruder are some of the films which have used Brazil for film production.</p><p>The 2013 documentary City of God – 10 Years Later reunites the cast and crew of City of God and takes a look at how their lives have changed after the original film's release. In a BBC article written at the time of the documentary's release, Firmino mentions that the cast had mixed careers after the film's release. Firmino says that Jefechander Suplino, who played Clipper, could not be found by the documentary producers. His mother, however, believes him to still be alive, but is unaware of his whereabouts. Seu Jorge, who played Knockout Ned, had a better career after the film and became a major musician, performing at the London 2012 Olympic Games closing ceremony.</p><br/>"
  },
  "errorMessage": ""
}