{
  "imDbId": "tt0033467",
  "title": "Citizen Kane",
  "fullTitle": "Citizen Kane (1941)",
  "type": "Movie",
  "year": "1941",
  "items": [
    {
      "publisher": "",
      "author": "The Hollywood Reporter",
      "link": "https://www.hollywoodreporter.com/news/general-news/citizen-kane-review-1941-movie-998891/",
      "rate": "100",
      "content": "Citizen Kane is a great motion picture. Great in that it was produced by a man who had never had any motion picture experience; great because he cast it with people who had never faced a camera in a motion picture production before; great in the manner of its story-telling, in both the writing of that story and its unfolding before a camera; great in that its photographic accomplishments are the highlights of motion picture photography to date, and finally great, because technically, it is a few steps ahead of anything that has been made in pictures before."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-citizen-kane-1941",
      "rate": "100",
      "content": "Its surface is as much fun as any movie ever made. Its depths surpass understanding. I have analyzed it a shot at a time with more than 30 groups, and together we have seen, I believe, pretty much everything that is there on the screen. The more clearly I can see its physical manifestation, the more I am stirred by its mystery."
    },
    {
      "publisher": "New York Daily News",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Welles displays touches of genius in the handling of his story. His cast, made up of players from his Mercury Theatre group, respond like sensitive musicians to the movements of the conductor’s baton."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/citizen-kane",
      "rate": "100",
      "content": "While I acknowledge that Kane is a seminal masterpiece, I don't think it's the greatest motion picture of all time. Even so, there's no denying the debt that the movie industry owes to Welles and his debut feature. Motion picture archives and collections across the world would be poorer without copies of this film, which will forever be recognized as a defining example of American cinema."
    },
    {
      "publisher": "",
      "author": "Empire",
      "link": "https://www.empireonline.com/movies/reviews/citizen-kane-review/",
      "rate": "100",
      "content": "The sheer audacity and delight Welles takes in flouting conventions and inventing new ones is what keeps it fresh."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1941/film/reviews/citizen-kane-1200413671/",
      "rate": "100",
      "content": "It happens to be a first-class film of potent importance to the art of motion pictures...a triumph for Orson Welles."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9E00E3D6173AE33BBC4A53DFB366838A659EDE",
      "rate": "100",
      "content": "In spite of some disconcerting lapses and strange ambiguities in the creation of the principal character, Citizen Kane is far and away the most surprising and cinematically exciting motion picture to be seen here in many a moon. As a matter of fact, it comes close to being the most sensational film ever made in Hollywood."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://time.com/vault/issue/1941-03-17/page/92/",
      "rate": "100",
      "content": "It is a work of art created for grown people by grown people...Orson Welles treats the audience like a jury, calling up the witnesses, letting them offer the evidence, injecting no opinions of his own. He merely sees that their stories are told with absorbing clarity. Unforgettable are such scenes as the spanning of Kane's first marriage in a single conversation, the silly immensity of the castle halls which echo the flat whines of Susan."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Chris Cabin",
      "link": "",
      "rate": "100",
      "content": "I still stare at it, amazed and entertained, but dwarfed by the very idea of attempting to untangle the crow’s nest that has formed through the film’s ever-expanding histories. And what continuously stupefies me is that time works no miracles on this particular film: Scenes remain familiar, but the narrative seems to shift every time I return to it."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2009/oct/30/citizen-kane-review",
      "rate": "100",
      "content": "Sublime moments, of which the most extraordinary must still be Everett Sloane, playing Kane's former business manager Mr Bernstein, remembering the girl in the white dress on the Jersey ferry: \"I only saw her for one second and she didn't see me at all – but I'll bet a month hasn't gone by since that I haven't thought of that girl.\" I'll bet a week hasn't gone by when I haven't thought about that line and pictured the girl so clearly that she has become a false memory of the movie itself."
    }
  ],
  "errorMessage": ""
}