{
  "imDbId": "tt0078748",
  "title": "Alien",
  "fullTitle": "Alien (1979)",
  "type": "Movie",
  "year": "1979",
  "items": [
    {
      "publisher": "Dallas Observer",
      "author": "Gregory Weinkauf",
      "link": "",
      "rate": "100",
      "content": "This is the breakout role for Sigourney (née Susan) Weaver, whose iconic presence still propels this ride beyond the scores of substandard imitations that followed. Why see it on the big screen? Because it's bloody brilliant."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Peter Hartlaub",
      "link": "",
      "rate": "100",
      "content": "Feels like a streamlined improvement on the original."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "https://www.avclub.com/alien-1798199015",
      "rate": "90",
      "content": "Despite years of imitators, sequels (some great, some not so), and edited-for-television broadcasts, Alien has lost none of its power, and the big screen only intensifies its impact."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Manohla Dargis",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "90",
      "content": "Twenty-four years later -- digitally spruced up, with some scenes shaved and others padded with previously cut material -- Scott's film still shreds nerves."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "The most important features of this \"new\" version are the digital cleaning of the print and the re-mastering of the sound. There are a few added scenes, but they are mostly insignificant and have been previously seen (at least by fans of the movie) on the laserdisc or DVD releases."
    },
    {
      "publisher": "Baltimore Sun",
      "author": "Chris Kaltenbach",
      "link": "https://www.baltimoresun.com/entertainment/movies/bal-to.alien29oct29,0,216502.story?coll=bal-artslife-movies",
      "rate": "88",
      "content": "Alien, even with some scene tinkering that has left this \"director's cut\" one minute shorter than its original release, is still one of the creepiest, scariest, most shocking films ever."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "88",
      "content": "What's most unusual about the original 24 years later, though, is its elegant minimalism."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "88",
      "content": "An old nightmare, made shiny new."
    },
    {
      "publisher": "New York Post",
      "author": "Lou Lumenick",
      "link": "",
      "rate": "88",
      "content": "Mostly it's worth seeing Alien, which established Scott as an A-list director, in a theater because his brilliant and often expansive visuals have always worked better on a big screen than on video."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "30",
      "content": "An empty-headed horror movie (1979) with nothing to recommend it beyond the disco-inspired art direction and some handsome, if gimmicky, cinematography."
    }
  ],
  "errorMessage": ""
}