{
  "imDbId": "tt0078748",
  "title": "Alien",
  "fullTitle": "Alien (1979)",
  "type": "Movie",
  "year": "1979",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw5412227",
      "warningSpoilers": false,
      "date": "16 January 2020",
      "rate": "10",
      "helpful": "124 out of 133 found this helpful.",
      "title": "Holds up as a classic.",
      "content": "Alien remains one of the most original, terrifying movies of all time. Compare this with the lame sci fi horrors we get nowadays, 1979, and it still packs a huge punch.Fantastically atmospheric, chilling and terrifying even now, the story holds up incredibly well. The special effects were incredible for the time, no wonder the franchise is still in demand, though sadly nowhere near the quality of this one or its amazing successor.The music is fantastic, the direction is incredible, and as for the Alien itself, way ahead of its time. Weaver is phenomenal, but arguably she's upstaged by the creature.You can't help but remember scenes days after watching it, it definitely has the chill factor.A cinematic masterpiece. 10/10"
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4059563",
      "warningSpoilers": false,
      "date": "11 February 2018",
      "rate": "10",
      "helpful": "265 out of 298 found this helpful.",
      "title": "A Timeless Science Fiction Masterpiece",
      "content": "'Alien' is one of those special films that have aged very, very well. Even now, after nearly 40 years, everything about it just feels fresh. The restrained, natural performances by the fantastic cast; the outstanding production design; the beautiful, ominous score by Jerry Goldsmith; the realistic, \"lived-in\" look of space-freighter Nostromo's interior: it actually feels less dated than many science fiction films that were made much later, which is quite an astonishing feat. Even the (what now must be considered) \"retro\" technology inside the ship doesn't necessarily have to be viewed as anachronistic in the face of our obvious recent advancements, because it's the most simple technological equipment that is usually robust enough to survive the longest under harsh conditions (like the extreme temperatures in space). I feel it's especially hard for science fiction films to stand the test of time - which is kind of inherent to the genre I suppose - and 'Alien' simply remains an outstanding achievement in that regard. It's a testament to the talent of everyone involved, but especially to the vision of director Ridley Scott. The film was crafted with so much love for every little detail, and the designs by Moebius, Chris Foss - and in particular the Lovecraftian horrors unleashed by Swiss surrealist H.R. Giger - are among the best and most iconic in any science fiction film. This isn't just an outstanding, timeless piece of entertainment: it's a work of art. 10 Stars out of 10. Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/"
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw6736848",
      "warningSpoilers": false,
      "date": "24 March 2021",
      "rate": "9",
      "helpful": "45 out of 51 found this helpful.",
      "title": "The facehugger scared me as a kid and i still find em creepy.",
      "content": "Everything has already been said about this great film n there seems to be little left to say but lemme contribute a lil more by praising how good this film is.I first saw this in the late 80s on a vhs n as a kid i found it to be a bit slow but was shaken by the chestburster scene.The facehugger terrified me as a kid.Revisited all the four parts in the early 2k on dvds which i own.Revisited this part again few days back as i am on Alien movie marathon n very impatient to check out Prometheus n Covenant.I feel that this part is inspired by Bava's Planet of the Vampires.The ruins with the skeletal remains, the design and shots of the ship itself does have the deja vu effect.This one is atmospheric n dark, gory at times, it has enuff stuff for sci fi fans, it also has slasher n war like tone.But the best thing is the feminist tone where in this part the women are not being cast as the helpless victims."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw4068907",
      "warningSpoilers": true,
      "date": "20 February 2018",
      "rate": "10",
      "helpful": "155 out of 184 found this helpful.",
      "title": "One of the best classic sci-fi horror films of all time - A masterpiece",
      "content": "A masterpiece one of the best classic sci-fi horror films from the 70's I have ever saw and experience. The first time I saw this film was in the 97 when I was 13 years old because this film was so popular that time and even today people talk's about it. Watching the first time this film I must say I loved it. I love this film to death of all the sci-fi films today this one is the best one and beats them all. This is the real science fiction film about \"extraterrestrial life form\" it is interesting, brilliant about time in the space and life form that want's to whip whole humanity out. This is Ridley Scott's masterpiece and one of his best films of all time. Everything about this film is perfect, the script, the actors, puppetry, models, and special effects about Alien design. I would give this movie an 8 but it deserves a perfect 10 because it has a vision of the most imaginative directors on earth. Dan O'Bannon wrote brilliantly a story and screenplay with help from Ronald Shusett. Both of them make a brilliant imaginative story. This film has no plot holes I don't see them. Helen Horton as the voice of Mother, the Nostromo's computer was believable and realistic and well performed. The design for the parasite (the facehugger) was excellent designed and brilliant. Everyone from the cast in here at acting is spectacular and acts believable. I love all the characters: Parker, Brett, Lambert, Ripley, Ash, Captain Dallas, Kane and even Jonesy the cat. He was really trained I love that cat in this movie. The design about the ship Nostromo is fantastic and so is space and the computers in this film. The eponymous Alien and its accompanying elements were designed by the Swiss artist H. R. Giger which the effects and designs were excellent spectacular created in the film. Jerry Goldsmith makes an excellent music score for the film that I have enjoy it. My favorite scene in this film is when Parker torchers with flamethrower on Ash's corpse and burns his remains great a special effect. This movie stars Tom Skerritt, Sigourney Weaver, Veronica Cartwright, Harry Dean Stanton, John Hurt, Ian Holm, Yaphet Kotto, Bolaji Badejo and Helen Horton they are all believable in their roles.This is my favorite science fiction film tough I prefer Aliens over this film (because it is my favorite film), The Thing, Leviathan even The Blob as a horror films because I enjoy them more but \"Alien\" is my favorite science fiction film the best of it's kind. 10/10 doesn't deserve the hate."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0165107",
      "warningSpoilers": true,
      "date": "6 April 2000",
      "rate": "10",
      "helpful": "161 out of 210 found this helpful.",
      "title": "The Purina Dog Chow company will expand and make a big mistake!",
      "content": "Ridely Scott is such a minimalist in Alien that many sci-fi nuts find it slow and unexciting. So many people prefer Aliens, its sequel, to this one. I think Aliens, directed by James Cameron, is another sci-fi masterpiece (and maybe the best action film ever made), but I think Alien is much better. In fact, I would say that it is among the best films ever made, in sci-fi, only second to 2001. The plot absolutely lacks contrivance. All the plot points develop how they would naturally. And there are great surprises throughout the film. Even if you haven't seen the film, you know about the chest-bursting scene. You probably saw it parodied dozens of times. But watch the scene where Ian Holm reveals his secret! That is one amazing scene! I actually saw the sequel first, so I kind of knew that secret, too, but it still shocked me. It was so well directed.Notice how the dialogue works. It never particularly draws attention to itself. It actually reminds me of Robert Altman, how he directed such movies as Nashville, where many characters are speaking at the same time, and nothing seems more or less important than anything else. It is just like real life. Alien is one of the most realistic, documentary-like sci-fi films ever made. Also notice the setting. The Nostromo's design is so believable that I feel that I'm actually seeing a real space vehicle. The alien ship also beams with its spookiness.The characters are also extremely believable. They are so well written that even the first character who dies is completely developed. If you get the DVD, they actually created dossiers about each of the crew members. It also has extra scenes which round out the characters even more. I think Ripley is one of the most endearing characters in film history. Even in the last two sequels, which were visually interesting but not very well written or directed, Ripley held my interest. I teared up when she died at the end of 3. If they made a fifth one, I would go, no matter how terrible I knew it would be. The acting is also top-notch. Ian Holm, a great actor, gives one of his best performances here. I love the last scene that he is in. Truly a master. And of course Sigourney Weaver could have just as easily been nominated for an Oscar for her performance here as she was for Aliens. I wish she would make more movies. She's so talented.The most important part of a film, in my mind, is the mood. And boy, does Alien have one of the most genuinely spooky movies I've ever seen. Make sure you watch it after the sun has gone down. Also, watching it alone will help. The special effects are kind of cheap, but Scott knows this well enough. He only shows the alien for seconds at a time. Besides keeping us from seeing the shoddiness of those puppets, this technique makes the alien seem all the more creepy and mysterious. 10/10, no doubt at all (BTW, the symbols all over the Nostromo are the same insignias as those of the Purina Dog Chow company)"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0165216",
      "warningSpoilers": false,
      "date": "16 October 2001",
      "rate": "",
      "helpful": "267 out of 365 found this helpful.",
      "title": "Classic horror",
      "content": "The further we go in special effects, the more movies show us and ignore the unseen, the more people will return to dark horrors like this one.It's hard to look at this film without considering the sequels and knowing the alien itself, however when made the alien was mostly unseen and a mystery. It's difficult to forget what you've seen, but it's important to approach this film first if possible rather than joining the series late.It's amazing that this is over 20 years old - apart from the actors looking so young, the film doesn't feel dated at all. The sci-fi visions here are still bleak and futuristic as they were then - this is not the Star Trek vision of the future. The foreboding exists long before John Hurt spills his secret, Scott's direction is excellent throughout. Once the alien is \"born\" the tension is cranked up and the characters dispatched one by one (a formula we know oh-so well now!)However here the characters are not merely alien-food but have some dimension to them. Weaver is excellent, while the support cast is full of great support actors (Stanton, Kotto, Hurt, Skerritt, Holm), but of course the real star is the one we see least of.We barely see the alien in full detail, most of the time it is set in shadows, moving with deadly intent.The alien here is not simply a killing machine as seen in later films but is cruel with it. Witness the alien trap a female crew member and slowly rub up her leg, moving with slow seductive movements before moving with terrifying speed to kill another crew member sneaking up behind it. The slow movements betray the alien's pure cruelty.The film is a study in terror. It may not be as action packed as the other films in the series but it brings the claustrophobia of being hunted to a new level."
    },
    {
      "username": "deepfrieddodo",
      "userUrl": "https://www.imdb.com/user/ur123203865",
      "reviewLink": "https://www.imdb.com/review/rw8631850",
      "warningSpoilers": false,
      "date": "23 October 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Sci-Fi Masterpiece",
      "content": "Not only is Alien one of the greatest sci-fi films created, it is undoubtedly encapsulates all the best elements of the horror genre too.The plot is perfect. Simple enough that missed dialogue doesn't throw the audience out of the loop, yet complex enough to demonstrate the depth behind the context. Twists are utilised at the perfect moments to ensure that intrigue remains at a high while tension is at a constant. Characters superb, with no real stereotypes of tokenism added in to no effect.Visually, the 1979 release is still far more aesthetic than films released 40 years later. The sets are superb, costuming is great, and the lighting to capture the right atmosphere is perfect. Brief glimpses of the Xenomorph establish the fearsome foe without putting everything on show and lessening it's impact, and is a perfect example of why costuming and puppetry done right will always look better than CGI.An excellent cast, with Weaver's breakout role supported by the likes of Hurt and Holm. Dialogue is delivered realistically and always at the right intensity, and never out-of-step with the perfect directorial pacing.A phenomenal start to clear franchise material, which no matter how wayward later editions go, will always be a classic. Somehow Alien's sequel matches this performance too."
    },
    {
      "username": "hellholehorror",
      "userUrl": "https://www.imdb.com/user/ur80918438",
      "reviewLink": "https://www.imdb.com/review/rw6879289",
      "warningSpoilers": false,
      "date": "4 May 2021",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Undeniably stunning",
      "content": "This was made in the seventies. Seventies. The picture quality is stunning. Undeniably stunning. The sound is perfect except minor issues regarding occasional muffled dialogue. God it looks good. Rivals and beats many films made thirty years later. The blend of suspense, horror, science-fiction is perfect. The budget is perfectly used. Perfect. I say stick with the theatrical version, the various director cuts are not as well paced, add irrelevant scenes and don't fix the one bit that annoys me - the jump cut on Ash's head. Stay theatrical and think of the best film ever made and you would possibly have this. There may be a scant few other films but this would be the first. The ending is so intense and fearful without cheap techniques. I love it. Very minor technical issues are forgotten through fear, fascination and legacy."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0165403",
      "warningSpoilers": false,
      "date": "12 December 2002",
      "rate": "",
      "helpful": "217 out of 302 found this helpful.",
      "title": "A horror classic that has stood the test of time! Still by far the best movie in the series.",
      "content": "'Alien' while technically science fiction is also one of the greatest horror/suspense movies ever made. Ridley Scott is now one of the most well known and successful directors in Hollywood, but I don't think anything he's made in the last ten years is a patch on this perfect film, which is a near masterpiece in my opinion. In fact, on reflection there are only three Scott movies I genuinely like, those being his first three. The last of these 'Blade Runner' was released twenty years ago now, so to me Scott is long past his use by date. Whatever, 'Alien' itself is a brilliant piece of work, and is almost flawless. Scott's direction is superb and everything else about it is outstanding - a strong script from Dan O'Bannon et al, an evocative score from Jerry Goldsmith, brilliant design and special effects, including the amazing contributions from H.R.Giger, all add up to an amazing movie experience. I also really liked how the cast were character actors and not \"stars\" so there was plenty of suspense generated as to who will live and who will die. This is something very few subsequent movies have done, 'Pitch Black' being one of the exceptions. Sigourney Weaver may be an icon as Ripley now, but when the movie was first released she was virtually unknown, having had a small cameo in Woody Allen's 'Annie Hall' and not much else. The rest of the cast are equally as good. I especially enjoyed Yaphet Kotto ('Blue Collar') and the legendary Harry Dean Stanton ('Wise Blood') as the wise cracking \"below deck\" crew. Many people seem to prefer James Cameron's sequel 'Aliens' over this, but as I much prefer horror and suspense movies to action ones I think this is definitely the better movie, and still the strongest and most effective in the series. 'Alien' is a horror classic and an absolutely unforgettable movie that I can't recommend highly enough. If you haven't seen it before watch it immediately!"
    },
    {
      "username": "BroadswordCallinDannyBoy",
      "userUrl": "https://www.imdb.com/user/ur2214855",
      "reviewLink": "https://www.imdb.com/review/rw0165562",
      "warningSpoilers": false,
      "date": "15 April 2004",
      "rate": "10",
      "helpful": "165 out of 224 found this helpful.",
      "title": "Classic tale of terror",
      "content": "This is one of the finest science fiction films ever made. Everything is so carefully and expertly constructed to the point that repeated viewings are just as good as the first. Also, the atmosphere, along with the amazing sets, is real shocker and few movies have managed to create the same kind eerie feeling.The story starts with the crew of the cargo vessel \"Nostromo\" waking up before schedule. They soon realize their on-board computer has detected life on a nearby planet and they go to investigate. One of them unwillingly brings back an...ALIEN (!) which soon becomes a very unwanted passenger. The introduction of the title creature in the famous chest-burster scene is a real jolter. Especially if you watch it after dinner.The music, too, must be mentioned and it moves the story along with unrelenting terror. However, the lack of music, in certain scenes, works just as well and this combination makes for one of the best musical montages to be put on film.This is a classic film that spawned a series, which is good overall, and a bunch of copycats, many of which are just sad. \"Alien\" came first and it is easily one the best. 10/10Rated R: violence/gore and profanity"
    },
    {
      "username": "WalterFrith",
      "userUrl": "https://www.imdb.com/user/ur0222950",
      "reviewLink": "https://www.imdb.com/review/rw1004485",
      "warningSpoilers": false,
      "date": "22 January 2005",
      "rate": "",
      "helpful": "197 out of 266 found this helpful.",
      "title": "My favourite tagline for a movie",
      "content": "\"In space, no one can hear you scream.\" This remains my favourite tagline ever for a movie. When 'Alien' was released in 1979, it caused almost as much talk as 'Star Wars' did when released two years earlier. The science fiction genre was being revolutionized at this time and 'Alien' had a horror characteristic to it which was psychological, visually striking and compelling with the type of strength in silence not seen since '2001: A Space Odyssey' in 1968. Definitely a big influence in blockbuster film making, 'Alien' has spawned three sequels so far and is a great horror/science-fiction classic not to be missed. It is director Ridley Scott's best effort on the big screen for making fear the best character in the film."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw7495218",
      "warningSpoilers": false,
      "date": "30 October 2021",
      "rate": "9",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Prophetic & Visionary...",
      "content": "Allegorically and quite unintentionally a tale of a virus, ignorantly released its only aim is to destroy us, the wheels set in motion, a search begins for a new potion, but perpetuation has begun and there's absolutely nowhere you can run - from the evolutionary transformations, variations and mutations, the prequels, sequels and unequals yet to come."
    },
    {
      "username": "gftbiloxi",
      "userUrl": "https://www.imdb.com/user/ur1592694",
      "reviewLink": "https://www.imdb.com/review/rw1065979",
      "warningSpoilers": true,
      "date": "23 April 2005",
      "rate": "10",
      "helpful": "172 out of 245 found this helpful.",
      "title": "Iconographic Horror",
      "content": "ALIEN received mixed reviews when it debuted in 1979--largely from science fiction critics, who accused it of being little more than a sort of Friday the 13th in Outer Space, a blood-and-gore horror flick given a futuristic twist via special effects. But while these accusations have more than a little truth, it has been an incredibly influential film--and even today, in the wake of CGI effects, it still holds up extremely, extremely well.The story is well known: the crew of an interstellar craft responds to what seems a distress signal, only to encounter a remarkably lethal alien life form that boards their ship and sets about picking them off one by one. Some of the special effects are weak (the alien spacecraft and the android \"revival\" are fairly notorious). There is little in the way of character development, the film has a fairly slow pace, and the story itself is predictable; you can usually guess who is going to die next.BUT. The art designs are incredible: the entire look of the film, from the commercial nature of the spacecraft to the iconographic alien itself (brilliantly envisioned by Giger) is right on the money. Director Ridley Scott encouraged his cast to ad lib from the script, and the result is a shocking sense of realism--and the somewhat slow pace of the film and the predictability of the story gives it a sense of relentless and ever-mounting paranoia that is greatly enhanced by the tight sets and camera set-ups. With its odd mixture of womb-like organics and cold mechanics, ALIEN is a film calculated to send even the most slightly claustrophobic viewer into a fit of hysteria.The entire cast, led by Tom Skerrit and Sigorney Weaver, is very, very good--and the film abounds with memorable images and scenes ranging from John Hurt's encounter with the alien egg to Skerrit's search of the ship air ducts to Weaver's terrifying race against time as the ship counts down to self-destruct. Seldom has any film been so consistent in design, cast, direction, and out-and-out fear factor, and although certain aspects of ALIEN are open to legitimate criticism the end result is powerful enough to bring it in at a full five stars. A word of warning, however: you'll need to send the kids to bed for this one. And you'll probably be up half the night afterward yourself! Recommended.Gary F. Taylor, aka GFT, Amazon Reviewer"
    },
    {
      "username": "bretttaylor-04022",
      "userUrl": "https://www.imdb.com/user/ur77212199",
      "reviewLink": "https://www.imdb.com/review/rw8463260",
      "warningSpoilers": true,
      "date": "18 August 2022",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Classic, Classic, Classic. Classic Sci fi, Classic Horror, Classic pacing, Classic visual effects, Classic crew, Classic Android conspiracy, Classic Cat.",
      "content": "This has a problem now where it is a victim if its own success.Anyone watching the film for the first time now already knows what the Alien looks like and Sigourney Weaver survives.This one of the best horror films and a masterclass in how to slowly build up tension and strategically placed jump scares usually done by a Cat but not overdone it gives you chance to forget about the cat before it appears again.This is fear of the unknown.It starts slowly getting to know the characters a little bit. The random Cat on board makes them more relatable.Once they venture outside the tension is cranked upto about 8 and seemingly very slowly throughout the movie ends at about 50.The face hugger scene is legendary and from thereafter it is a hunt to catch this Alien and all we know is it bleeds acid.It grows to a mammoth size very quickly and it starts to puck off the crew one by one revealing just a tiny bit more deatail each time and you have absolutely no idea who is next (Obviously Ripley survives but audiences in 1979 wouldn't have known that) This is because all the cast are treated as equal and no one is given more star treatment than anyone else.Throw in an Android conspiracy swerve and there you have it one of the best movies ever made.The claustrophobic setting is also amazing.The ending where the Alien has escaped and is on board the escape pod is terrifying.One of the best paced films ever as well.Did I mention that i think the Cat was great too."
    },
    {
      "username": "a-alexander119",
      "userUrl": "https://www.imdb.com/user/ur57122839",
      "reviewLink": "https://www.imdb.com/review/rw6839468",
      "warningSpoilers": false,
      "date": "23 April 2021",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "After 40 years it still scares the hell out of me",
      "content": "When I see reviewers ratings less than five I have shake my head in disbelief. Alien set a standard that has yet to be equaled let alone surpassed. I watched it on the wide screen when it was first released, and over a dozen times since. And even though I know what's coming, the hairs on the back of my neck still stand up. What a brilliant work of theatrical genius."
    },
    {
      "username": "BrandtSponseller",
      "userUrl": "https://www.imdb.com/user/ur0139258",
      "reviewLink": "https://www.imdb.com/review/rw1015405",
      "warningSpoilers": true,
      "date": "6 February 2005",
      "rate": "10",
      "helpful": "73 out of 104 found this helpful.",
      "title": "A new appreciation of this film's excellence",
      "content": "Seven members of a space mining cargo ship who are headed back to Earth are awakened from hypersleep when their ship detects a signal from an intelligent civilization on a small, uncharted planet. When they locate the source of the signal, they find more than they bargained for, and all of their lives are endangered.My feelings about this first film in the Alien series have vacillated slightly over the years. I loved it when I first saw it as a young teenager in the theater back in 1979. Later, I wasn't as enamored with it, and had actually rated it as low as a 7 out of 10--at one point believing it to be my least favorite of the series. Now, however, my appreciation of the film has matured a bit, and I'm back to thinking it's a solid 10 out of 10.The film's strong points are rooted in director Ridley Scott's focused commitment to sustaining a desolate, dark atmosphere and gradually building suspense over the course of the film. Alien is unusual for its era in its pacing, its lack of comic relief, and its refusal to provide breaks from its growing tension. All three of these facts make it a somewhat \"difficult film\". It's not recommended for light viewing. It's not a \"popcorn film\". You have to be in the mood to sit down, slow down, concentrate, invest emotion, and let yourself be enveloped in the film's world.With Alien, Scott has created a kind of bleak tribute to Stanley Kubrick's 2001: A Space Odyssey (1968). This is evident in many characteristics of the film, such as the graceful slowness of the cinematography, editing and much of the action in the first section of the film, including sustained pans across sterile-looking environments and wide external shots of (a) hulking but elegant spacecraft, the personification of the ship's computer, known as \"Mother\" here rather than Hal, a few subtle instances of classical music, the surprise discovery of a monumental structure on another celestial body, and so on. However, there are no instances of pleasant psychedelia here, no retreats into dreamworlds, no messages of hope, no benevolence from alien beings. Alien is strictly concerned with making its sci-fi an issue of classic horror. At a base level, it is about a malevolent monster, first encountered in a dark, Gothic environment and later chasing our heroes through a cross between a haunted house and crypt-like labyrinths.Much has been said about visual artist H.R. Giger's alien and production design, and the film wouldn't be nearly as successful without it. Giger is largely responsible for the look of the beacon ship on the small planet, both its exterior and interior, the cocoon later encountered on the cargo ship, and the creatures. His work also inspired a lot of smaller elements, as can be seen in doorways, pipes, and other features of the cargo ship. Like most of his work, these features are a combination of metallic and organic, mechanical and biological, futuristic and Gothic. They complement the austere Kubrickian sensibility in a surprising but completely successful way.Scott also uses simple effects like steam, as well as unique lighting and sound effects to help build the film's thick tension. These techniques gradually become more conspicuous as the film goes on, finally culminating in a claustrophobic symphony of flashing lights, constantly hissing pipes and hoses, and an incessant audio alarm.Finally, the last key to the excellence of the film is the cast. Although a somewhat stereotypical movie-world ragtag bunch, their characterizations provide more depth than the norm, with Sigourney Weaver as the standout, in perhaps the defining role of her career, and one of the more admirable filmic portrayals of a woman--she's the smartest, most sensible, strongest, and certainly most sexy of the bunch."
    },
    {
      "username": "maryolalov",
      "userUrl": "https://www.imdb.com/user/ur69458085",
      "reviewLink": "https://www.imdb.com/review/rw3639767",
      "warningSpoilers": true,
      "date": "14 February 2017",
      "rate": "9",
      "helpful": "11 out of 11 found this helpful.",
      "title": "The start of a great anthology",
      "content": "Alien has a slow and mysterious beginning. It starts like nothing special - some people eating and talking on a space ship. But it gets more intense when they detect an unknown planet and land on it so they can explore it. The audience has to wait more than 1 hour to see the thing they paid for - the xenomorph. And this waiting makes its emergence one of the greatest moments in the cinematic history. Still we see the xenomorph only 3 or 4 times which is quite disappointing but this makes the alien more mysterious and gives the movie a horror character. And of course another reason we see the xenomorph so rarely is because the CGI wasn't very well developed at that time and it was pretty hard to make the alien's appearance. Alien(1979) is a great start for the Alien anthology and even though the bad CGI it's the best movie in the whole anthology. The movie is worth watching."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0165588",
      "warningSpoilers": true,
      "date": "31 July 2004",
      "rate": "10",
      "helpful": "30 out of 41 found this helpful.",
      "title": "Whose idea was it to bring a cat in the first place?",
      "content": "I'm a little confused as to why there was a cat on board in the first place. Needless to say, given that there was an entire crew on board the Nostromo, a merchant vessel carrying, if I remember correctly, something like 20,000,000 tons of mineral ore, there was hardly a lack of companionship. At any rate, I can easily brush aside my curiosity about the effort that went into designing the life support system that would have been needed to keep the cat alive along with the rest of the humans as they traveled for months on end in deep sleep. It doesn't matter, because the cat was involved in most of the scariest scenes. That being said, I think that one of the things that really makes Alien great is that it explains all the twists and turns of its plot in great detail, which is almost unheard of in science fiction and horror films. No one displays ludicrous behavior to allow for the construction of bloody, gory death scenes, the alien, masterfully designed, isn't rushing across the screen in every scene to allow for maximum payoff of the costume design, we don't even see it until well past the halfway point in the movie. Like Jaws, Alien takes its time to allow the characters to gradually grasp the enormity of their situation. The Nostromo is a merchant ship, which allows for a non-military crew to be faced with a mortal enemy that they do not understand. The ship intercepts a strange transmission that must be from an intelligent source since it repeats itself every twelve seconds, and so it wakes up the crew to investigate. The subtlety of the way the conflict is introduced is very important. The transmission didn't just appear, the ship awoke the crew months ahead of schedule, because it was programmed to do so should anything like that happen. And to the chagrin of a couple of the money financial-minded crew members, it is also in their contracts to investigate any such occurrence. The movie is covering its tracks very thoroughly and to great effect. When they reach the planet from which the transmission originated, they find the spectacular discovery of what appears to be a crashed alien spaceship, complete with a dead alien pilot still in his chair. A brief look at the body suggests that the pilot may have exploded from the inside, creating curiosity about his death that the movie never satisfies but doesn't need to. One of the crew members discovers what look like dozens of leathery eggs, gets attacked, and is brought back on board the ship. Significantly, protocol is broken to get him and the alien life form back on board for medical attention. When they discover that the alien has blood that melts through the hull of the ship like thermite, a new and particularly difficult challenge arises. How do they kill a deadly enemy without making it bleed? And to make matters worse, the very ship is programmed to work against them. They are in the most hostile environment imaginable, worse than anywhere on earth. They are being stalked by an unknown creature that they can't injure for fear of damaging the hull of the spaceship, and the ship itself has placed the survival of the alien life form above their own survival. They have to trick the alien into submission without letting the ship know what's going on. Even HAL wasn't THIS creepy.Released at a time when science fiction was probably at the most popular that it had ever been (and possibly ever will be) thanks to the recent release of Star Wars and the soon to follow first sequel, Alien came along and capitalized in an area of science fiction that people evidently were very eager for, the darker, more sinister and dangerous side. The side of science fiction with the bloody deaths rather than light sabers and heroes. In fact, by looking at the way people probably saw Alien in 1979 and the way they see it now, you can learn a lot about how science fiction and horror have evolved over the years. Back then, this was horror/science fiction. Today, it's science fiction/horror. But while it was more horrible in 1979 than it is today, it is significant that, while other films that have come along over the years have overshadowed Alien as far as the intensity of the horror, the movie has lost none of its powerful effect. Rather than reinventing the science fiction genre by adding horror to it, it is now maintaining the life of the science fiction genre by reminding us of how good it can be when it's done right."
    },
    {
      "username": "chrishn",
      "userUrl": "https://www.imdb.com/user/ur4172848",
      "reviewLink": "https://www.imdb.com/review/rw1014961",
      "warningSpoilers": false,
      "date": "6 February 2005",
      "rate": "9",
      "helpful": "378 out of 475 found this helpful.",
      "title": "\"Alien\" is not just the monster, it's the atmosphere and the way you feel!",
      "content": "In \"Alien\" we follow a seven man crew en-route to earth on board the huge space freighter \"Nostromo\". The crew is in cryosleep, but the on board computer interrupts the journey when a foreign radio signal is picked up. It originates from an uninhabited planet and the crew lands to investigate. There they make contact with an alien life-form...What makes Alien so great is the constant feel of uneasiness. Right from the beginning you have a feeling that something is wrong. The crew is not particularly friendly towards each other, and you truly feel all the in-group tension. The ship itself is a huge worn out industrial-style maze of halls and corridors, and it feels more like a prison than a place to live. It is as if not only the alien but also the ship itself is against the humans. The Alien itself is the scariest monster in history because it is a ruthless, soul-less parasite completely devoid of any human or civilized traits. The design of the monster is a stroke of genius. Sure it has a humanoid form, but it has no facial traits or anything else which could give away emotions or intentions. Its actions reveals no weaknesses nor civilized intelligence. The Alien is more or less the opposite of everything human and civilized, plus the creature is more well-adapted to the inhumane interior of the ship than the humans who build it. To sum up, you then have a setting where the humans are caught in a web of in-group tensions, an inhospitable ship and the perfect killer which thrives in the ships intestines. You almost get the feel that the humans are the ones who are alienated to each other and to their own ship.Ridley Scott tells the story with a perfectly synchronized blend of visuals and sounds. The actors do a superb job, portraying their characters in a subtle but very realistic way. The seven man crew is not a bunch of Hollywood heroes. They are ordinary people with strengths and weaknesses, likes and dislikes. In this way they all seem so fragile when confronted with the enemy. As mentioned the ship is very claustrophobic and Ridley Scott adds to the eeriness by using camera movement, lights and shadows in an effective way. The living quarters are bright and should be comfortable to the crew, but there is something sterile about it all. The rest of the ship is basically a huge basement. The music by Jerry Goldsmith underlines the eeriness so well, and the movie wouldn't have worked without his score. Combined with the sounds of the ship it all adds to the uneasiness. This is not a story about heroic people who boldly teams up against evil. It's a story about ordinary people facing true fear, which is the fear without a face. The fear we can't understand and can't negotiate with, because its only goal is to survive on the expense of us. It's a story where some people bravely fight back whilst others are destroyed by the terror. It's a story where people a killed in a completely random way. There is no higher-order justice behind who gets to live and who dies. All seven characters are just part of a race where the fittest - not necessarily the most righteous - will prevail, and all seven characters start the race on an equal footing. None of them are true heroes, and none of them are true villains. All the above makes Alien so great as a horror movie. The terror isn't just the Alien itself, it's the entire atmosphere which gets so effectively under your skin, that you just can't shrug it off after the end credits like you can with so many other Hollywood horror movies. The title \"Alien\" doesn't just refer to the monster, it is the theme of the movie and it is the feeling you have during and after the movie. 9/10"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw2972950",
      "warningSpoilers": false,
      "date": "3 March 2014",
      "rate": "9",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Visually impressive and exciting Sci/Fi horror , including Oscar-winning special effects",
      "content": "This horrifying as well as heart-pounding movie contains shocks , stomach-churning violence , chills , profanity , thrills and results to be pretty entertaining . The commercial vessel Nostromo with a crew in deep-space sleep wakes up and receives a distress call from an unexplored planet . The futuristic cargo ship picks up an unwanted passenger : a malicious extraterrestrial . After searching for survivors, the ill-fated crew heads home only to realize that a deadly bioform has joined them . The merciless alien lives on human flesh and continually changes form . Then the Earthlings have a hard time figuring out the whereabout of the heinous being that is running amok . This nail-biting picture contains tension from start to finish , gory scenes aplenty , thrills , some strong scares , slime , emotion , entertainment and good acting . It is a superb cinematic combination of Sci-Fi , monster movie and terror . This is a brutal , considerable violent and exciting sci-fi thriller that scales new heights of savagery even by the standards of the 70s and 80s . The result is a throughly violent but undeniably thrilling action movie with a strong cast giving sweatily good value to their abrasive characters . Spectacular as well as bloody slaughter sequences took long time to shoot and were extremely difficult to make . Magnificently designed creature by the artist HR Giger , it was conceptual artist Ron Cobb who came up with the idea that the Alien should bleed acid . Extraordinary as well as astounding special effects in the chestburster scenes , the rumor that the cast, except for John Hurt, did not know what would happen during scenes is partly true and it was filmed in one take with four cameras; for instance, Veronica Cartwright did not expect to be sprayed with blood. The ending part is particularly exciting with Sigourney Weaver battling the malicious alien . ¨Alien¨ is clearly inspired by ¨It ¡ the terror from beyond space¨ . Sigourney Weaver breathes fire into Ripley and remaining actors are all magnificent as the crew of a futurist starship such as Tom Skerritt who is awesome in compelling lead role as commandant , Harry Dean Stanton , Veronica Cartwright , Yaphet Kotto , John Hurt and special mention to Ian Holm . The motion picture was stunningly directed by Ridley Scott who keeps everything bouncing at an absolutely frantic pace . Ridley Scott cites three films as the shaping influences on his movie: George Lucas' Star Wars (1977) and Stanley Kubrick's 2001 (1968) for their depiction of outer space, and Tobe Hooper's Texas chain saw massacre (1974) for its treatment of horror .It is followed by ¨Aliens ¨, also visually astounding by James Cameron with Paul Reiser , Bill Paxton , Jenette Goldstein , Lance Henriksen ; Alien 3 ¨ in which the alien regenerates and causes wreak havoc on isolated planet prison , being directed by David Fincher with Charles S Dutton , Paul McGann , Charles Dance ; ¨Alien: Resurrection¨ by Jean Pierre Jeunet with Winona Ryder , Dominique Pinon , Ron Perlman , Gary Dourdan and Michael Wincott . All of them starred by the great Sigourney Weaver who performed one of the best female leads created in years . Furthermore, ¨Alien vs. Predator¨ (2004) by Paul Anderson with Sanaa Lathan , Raoul Bova , Lance Henriksen , Colin Salmon , Tommy Flannagan and ¨Aliens vs. Predator 2¨ (2007) by Strause Brothers with Steven Pasquale , Reiko Aylesworth , John Ortiz , Johnny Lewis and Robert Joy ."
    },
    {
      "username": "Patuquitos",
      "userUrl": "https://www.imdb.com/user/ur4555708",
      "reviewLink": "https://www.imdb.com/review/rw1010889",
      "warningSpoilers": false,
      "date": "31 January 2005",
      "rate": "10",
      "helpful": "737 out of 976 found this helpful.",
      "title": "The mother of all movies",
      "content": "Back in early 20th century, Lumière brothers didn't have a clue of what they were playing with. I'm freaking sure that if somebody could have magically told them that thanks to their work, a movie like 'Alien' would have been made in the future, they both would have died of a sudden, shocked by the consequences of their labor, like an honest scientist would if he was shown an evil use of his research. In that sense, but in the best way imaginable, 'Alien' is the atomic bomb.In my opinion, 'Alien' is the only perfect movie in the history of cinema. Of course, this could be debatable, but of all the films I've watched since I was born, this is the only one in which I haven't been able to find the slightest flaw. It gets a golden ten out of ten. Bright, solid and massive.I could go on with a panegyric, but I'll try to be short and accurate:The direction is just perfect. Every shot is marvellous, every movement of the camera is breathtaking. There is absolutely nothing you could add or subtract. Touch it, and you spoil it. Seriously.The acting is splendid. The performances build a credible world centuries away. I don't know about you, but this take on the future was unveliabably acceptable. Sigourney Weaver is more than a revelation, John Hurt is a master, and the rest are nothing short of marvellous.The script is a work of art, the story is mesmerizing, well-constructed, well-developed, and free of absurd twists. Its simplicity and efectiveness are yet, 25 years after, to be matched.The atmosphere is pure genius. Gothic, claustrophobic and sometimes baroque. The use of light and dark is beyond description, the use of sound is as creepy as it gets.The FX are the best possible for 1979. In the time of the release, some scenes were stomach churning.The score. Jerry Goldsmith's work matches the images so perfectly it seems to bleed from them. It is and will be the best soundtrack for a sci-fi flick in space ever.The tagline. \"In space, no one can hear you scream\". THIS is a tagline.And, of course... the alien. The only alive creature that can steal Weaver the movie. Its design is the most innovative I've seen. It has spawned dozens of disgraceful imitations. This is the real deal. Not only the look, but the complete design of a life form, including biological features. Acid instead of blood. Jaws inside jaws. What more could you possibly want? This is how a movie is done.A very good sign of a movie that has gone down in history is the amount of collectively well remembered scenes. Well, 'Alien' has so many that I won't go into it. This movie contains so many iconic scenes that has become an icon itself.So, what else? I urge all young directors to watch this movie a zillion times, as I've already done, and take notes all along. But not in order to rip off from it, as many others have done, but to learn, learn, learn, learn and learn how a movie should be done. 'Casablanca'? You must be joking.Oh, I almost forget! There's a lovable cat in it.RATING: 10"
    },
    {
      "username": "neil-douglas2010",
      "userUrl": "https://www.imdb.com/user/ur51134330",
      "reviewLink": "https://www.imdb.com/review/rw8721610",
      "warningSpoilers": false,
      "date": "7 December 2022",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One Bad Apple",
      "content": "A classic in sci fi horror movies, this one gets you right from the start. It's a claustrophobic film and never lets up, the trouble is it's been remade so any times and never bettered.The crew of the Nostromo have just woken up but are nowhere near Earth, instead their ship has received a distress beacon. Except it's more of a warning, and on the planet Kane (John Hurt) is attacked by an alien lifeform. Trying to get back to the ship Ripley (Sigourney Weaver) says the land crew should be put in isolation. Dallas (Tom Skerritt) disagrees and lets them on the ship. BAD IDEA, as one by one the crew is killed, of course there is a bad apple. I won't tell you who but it's pretty obvious as the film progresses. Sequels followed, all starring Weaver and they're all good in their own ways, but this is the superior movie in every way. It certainly helps with a great cast and a superb special effects crew."
    },
    {
      "username": "shortround8391",
      "userUrl": "https://www.imdb.com/user/ur12527015",
      "reviewLink": "https://www.imdb.com/review/rw2053927",
      "warningSpoilers": false,
      "date": "17 April 2009",
      "rate": "10",
      "helpful": "54 out of 68 found this helpful.",
      "title": "Alien.....the one that started it all........",
      "content": "Alien....the creature......the film.....the legend. The one that started it all, the one that led to one of the greatest sequels ever made, one that got a comic book mini-series and 2 cross-over films with \"Predator\". This is THE film. And without a doubt, the greatest horror film ever created, and this totally makes \"Halloween\" look like \"Chicken Little\". You can forget about all those rubbish \"Friday the 13th\" or \"Nightmare on Elm Street\" movies, 'cause \"Alien\" just takes horror up to so many levels! In \"Alien\", we find ourselves in the distant future with a crew just coming back from a haul of 20 million tons of ore back to Earth. But while the crew members are in stasis, their ship picks up an \"SOS\" from a nearby planet, and once the crew is awakened, they are forced by the \"Company\" regulations to follow that signal. And then when they land on the planet and it turns out that something terrifying is in store for them, when a hostile organism attaches itself to one of the crew members. And later on, it becomes clear that the crew member was being impregnated and then dies a horrible, violent death from a deadly breed of an other-worldly life-form. And now the rest of the crew must fight off the creature.As other classic films should always have, \"Alien\" does great on the characters. And of course, the most recognizable one is the lead woman, Ellen Ripley who is played then-unknown Sigourney Weaver. She provides a very human face and you're gonna feel like you're actually watching a real-life woman in here, and it could be because of her accent, or her mannerisms. But as the film progresses, she develops into a more mentally tougher woman while combating the Alien. There are times when she totally keeps it cool, times when she's afraid, times when she's angry, and times when its just Ripley being Ripley. And thanks to Weavers acting talents, she can really dish out one hell of a character.The rest of the supporting cast are nothing short of spectacular, Parker and Brett are the selfish, sarcastic men who only want to make a profit. And through most of the film, you can feel the tension that Ripley and Parker have. Lambert, who one of my favorites from here is the second woman who happens to be the opposite of Ripley, a total coward. Dallas, who the viewer might get the vibe that HE is the main character in the 1st 15 minutes or so, is pretty much the leader here. Kane, is the tired, dead-looking guy who is the one that carries the alien species inside of him. And finally, Ash is the one with the sinister purpose and you start to suspect that he's up to no good at some point. And movie characters need to have their own personalities and that's what \"Alien\" has.And as for the Alien itself, well what can i say? It is the most horrifying creature in the history of cinema, period. I mean, how could you stop it? It has acid for blood, and is very lethal to fight face-to-face. And the special effects were over 20 years ahead of its time. The face-hugger on Kane looked so freaking real, that you're gonna be scared just by looking at it, even it doesn't do anything except breathe most of the time. And the sets couldn't have been better, very futuristic, yet there's always something ominous and dark about them.The suspense is impossible to resist as the sequences deliver the chills at times when you least expect it, and when you do expect something to happen, nothing happens. And \"Alien\" is one of the very few horror films that understands that you can't scare people by raking up the bodies and the blood, but you have to build up the suspense to do it. And director Ridley Scott is such a genius, and he shows that here, he absolutely knows how to make any kind of film, ones that can scare (Alien), one that can sadden (Thelma and Louise), and one that can excite/thrill (Gladiator). And Ridley really keeps up the dark atmosphere, especially in the beginning when there's no talking for the 1st 5 minutes or so, we get the feeling that something's not right all the time. Some parts are very quiet and very depressing and we feel exactly what we see.This is the legend that I'm talking about here, folks. Don't miss the chance to see this, because it will scare the living daylights outta you more than any other movie you're gonna see in your life. Take my word for it....I'm practically a movie buff, so I know what I'm talking about...."
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1294467",
      "warningSpoilers": true,
      "date": "18 February 2006",
      "rate": "10",
      "helpful": "23 out of 32 found this helpful.",
      "title": "This Ageless, Silent, Haunted House Floating in Silent Space",
      "content": "Before gore, special effects, and the denouement of the alien itself in future sequels, this was the movie that revolutionized the concept of the \"haunted house\" and merged it in a seamless sieve with \"body horror\" and its ultimate intrusion into our own most intimate space.The story had been done before, in different genres, never veering too far from its horror origins. Lovecraft (and others) had written about expeditions that had gone to \"investigate\" and \"collect important data\" only to find themselves being hunted down one by one, be it an unseen terror or their own fears.Ridley Scott's ALIEN looks and feels like a science fiction movie. However, it is not. Everything in its look and tone suggests horror of a more cerebral kind. When three crew members come across what seems to be a large space-jockey with a thing attached to its face, dead, we feel our stomach turn. If something that small was able to take over a creature this large, they are in deep trouble here. The scene is masterful, restrained, but a classic in the horror-movie sense: it's as if we had been witness to terrible events which had taken place and decided to get to the bottom of it. Scott tightens the noose employing age-old tricks of the horror genre and only once shows blood and guts -- one which follows a calm dinner sequence. He never allows the viewer to get a true glimpse of this sadistic killer much like Spielberg in JAWS and this becomes nerve-wracking because again, fear of the unseen is more powerful than what comes into view. The theory dictates: \"I was afraid of that thing? I thought it was bigger!\" All we see of this alien are his teeth and in one memorable, twisted scene, his tail snaking up Lambert's (Veronica Cartwright) leg. Later on, as Ripley (Sigourney Weaver in her breakthrough role), the quintessential Final Girl, makes her escape, it is possible to hear Lambert shrieking. What the alien is doing to her we can only imagine and recoil."
    },
    {
      "username": "dworldeater",
      "userUrl": "https://www.imdb.com/user/ur22826047",
      "reviewLink": "https://www.imdb.com/review/rw7588774",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Original and terrifying sci fi terror",
      "content": "Alien is Ridley Scott's masterpiece. This kicked off a mostly excellent franchise and influenced cinema as whole. Designed with great detail by brilliant artist HR Geiger the Alien brings forth a new level of intergalactic terror. Alien is completely different from anything that came before and took sci fi horror to new heights and gave it a lot of depth. The ensemble cast is excellent and is lead by Sigorney Weaver and had Yaphett Kotto, Tom Skerrit and Harry Dean Stanton as strong support. In my opinion this film is flawless and still looks incredible today. The special effects are amazing and the acting and direction is spot on. Alien is incredible and in my opinion is timeless. The film aged well and is essential and a classic."
    }
  ],
  "errorMessage": ""
}