{
  "imDbId": "tt0093058",
  "title": "Full Metal Jacket",
  "fullTitle": "Full Metal Jacket (1987)",
  "type": "Movie",
  "year": "1987",
  "items": [
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "100",
      "content": "Elliptical, full of subtle inner rhymes...and profoundly moving, this is the most tightly crafted Kubrick film since \"Dr. Strangelove,\" as well as the most horrific; the first section alone accomplishes most of what \"The Shining\" failed to do."
    },
    {
      "publisher": "Newsweek",
      "author": "Jack Kroll",
      "link": "",
      "rate": "100",
      "content": "As brutally unsparing as \"Platoon\" was, it was ultimately warm and embracing. Kubrick's film is about as embracing as a full-metal-jacketed bullet in the gut. [29 June 1987]"
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "https://archive.nytimes.com/www.nytimes.com/library/film/062687kubrick-jacket.html",
      "rate": "100",
      "content": "Kubrick's harrowing, beautiful and characteristically eccentric new film about Vietnam, is going to puzzle, anger and (I hope) fascinate audiences as much as any film he has made to date... A film of immense and very rare imagination."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "100",
      "content": "What makes the film stunning is less its metaphorical scheme than its cinematic style. Always a matter of flowing camera movement, Kubrick has photographed much of the action with long \"traveling shots\" that capture time and space as a seamless whole, not fractured into the bits and pieces of standard editing techniques. [26 June 1987]"
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Jay Scott",
      "link": "",
      "rate": "100",
      "content": "May be the best war movie ever made...Different is Kubrick's artistry and control, and his almost perverse, but philosophically progressive, refusal to impart to chaos a coherent narrative contour."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "An intense, schematic, superbly made Vietnam War drama."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Dave Kehr",
      "link": "",
      "rate": "88",
      "content": "The film has undeniable power, but it's an unusual and unsettling power, a product of a collision between red-hot material and the cool serenity with which Kubrick observes and accepts it. [26 June 1987]"
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "A perversely fascinating movie--one that answers no questions, offers no hope and has little meaning. In a way this is perfect for what the film has to say about war, but you find yourself numbed and apathetic as the film progresses."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "",
      "link": "",
      "rate": "75",
      "content": "The concluding image of men silhouetted against the dying flares of explosives, as they march to the raucous refrain of the Mickey Mouse Club theme, is masterly, but leaves a viewer curiously discomfited. Whereas \"Platoon\" shattered civilian complacency about that war, Full Metal Jacket is merely numbing. [26 June 1987]"
    },
    {
      "publisher": "Wall Street Journal",
      "author": "Julie Salamon",
      "link": "",
      "rate": "30",
      "content": "By most standards of conventional film narrative, this movie is a mess. [25 June, 1987, p.22(E)]"
    }
  ],
  "errorMessage": ""
}