{
  "imDbId": "tt0093058",
  "title": "Full Metal Jacket",
  "fullTitle": "Full Metal Jacket (1987)",
  "type": "Movie",
  "year": "1987",
  "items": [
    {
      "username": "Lechuguilla",
      "userUrl": "https://www.imdb.com/user/ur2420383",
      "reviewLink": "https://www.imdb.com/review/rw2158899",
      "warningSpoilers": false,
      "date": "16 November 2009",
      "rate": "10",
      "helpful": "139 out of 177 found this helpful.",
      "title": "Paint It Black",
      "content": "\"With flowers and my love both never to come back ... It's not easy facing up when your whole world is black\". So sings the man whose throbbing song marks the film's end, merciless lyrics to describe thematically a story that is as wrenching as it is mesmerizing.There are no villains in this film, only heroic victims. The villains are all off-screen, comfy behind mahogany desks, or dressed for success and giving shrill speeches about how maintaining peace requires war. Strange logic.First it's boot camp, a dreary prospect at best, for an ordinary group of young American men. Here, a sadistic drill Sargent, in colorful language, barks out orders and insults straight from Hades. It's do or die, almost literally, for our greenhorns. It's an ordeal of blackness from which some may never recover. Still, the grunts learn a valuable lesson; namely, that life is mostly physical, not mental. It's a lesson some ivory tower college professors never learn.But then it's on to an even blacker black ... Vietnam. Combat scenes are rendered believable by effective visuals and terrific sound effects: pounding percussion, amplified sounds of equipment and footsteps across explosive debris, and an always present, ever-so-subtle ... echo. Potent and torturous, these scenes convey a Zen-like immediacy, an impending sense of doom. And then at film's end, those lyrics ...Composed of two, barely overlapping, parts, the script's structure is a bit unorthodox. But the film works, owing to an intensity that never lets up. R. Lee Ermey is of course terrific as the harsh drillmaster. Casting of the young lions is okay, though a tad weak in one or two cases. Insertion of pop songs of the era works well, to amplify the cultural disconnect between a war-torn Vietnam and an indifferent America.Like reading a history book, watching an occasional war movie is good for the soul. It puts one's problems in perspective. For that reason, this particular war movie is better than most. It's riveting, intense. And the sense of impending blackness hovers ever present over the story's heroic victims, like the sword of Damocles."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2089048",
      "warningSpoilers": false,
      "date": "1 July 2009",
      "rate": "9",
      "helpful": "34 out of 42 found this helpful.",
      "title": "Very well made--tough to watch.",
      "content": "Warning--This movie is NOT for young kids or those who do not wish to see violence and adult content, as it's rather brutal and the language is pretty rough. Now I am not complaining about this, but this is clearly an adult film intended for adults. It's hard to really do this sort of film without making it this intense--just be forewarned. In addition, this is a very tense and unpleasant sort of film--be aware of this before watching.This film has a ton of reviews, so my summarizing the film or going into any sort of in-depth analysis is probably a giant waste of time. And, Bob the Moo has done such a good job of reviewing it, I say you just go read his! In brief, here's what I liked or at least respected in the film: It had a very gritty realism and managed to pull the viewer into it very, very well. The first portion (in boot camp) and the second portion (in Vietnam) were very different but both were very tense and compelling. While it wasn't pretty, it was well done.And, in brief, here's what I didn't like: The constant and clichéd use of rock and pop music. A few decades ago, this would have been innovative. Now, FULL METAL JACKET sounds an awful lot like GOOD MORNING Vietnam and APOCALYPSE NOW and other films. The constant blaring soundtrack was, I suppose, meant to be surreal and illustrate how ludicrous the war was. However, I just thought hearing \"Surfin' Bird\" was annoying and a cheap use of music. Apart from that, there isn't anything to say negative about the film.Is this the greatest anti-war film? No. Its message (like the war) was rather mixed at times and lacked the same impact of films like ALL QUIET ON THE WESTERN FRONT or WESTFRONT 1918, but it sure did come close."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3335538",
      "warningSpoilers": false,
      "date": "14 October 2015",
      "rate": "10",
      "helpful": "141 out of 183 found this helpful.",
      "title": "'Born To Kill' - The best Vietnam war movie of all time",
      "content": "SPOILER: Full Metal Jacket is a 1987 realistic Vietnam war film and is one of the best films of the 80's ever made, directed and produced by Stanley Kubrick. The screenplay by Kubrick, Michael Herr, and Gustav Hasford was based on Hasford's novel The Short-Timers (1979). Full Metal jacket (1987) was Nominated for 1 Oscar. Another 7 wins & 9 nominations. It is one of my personal favorite war movies. I love this movie to death. A superb ensemble falls in for for Stanley Kubrick's brilliant saga about the Vietnam War and the dehumanizing process that turns people into trained killers. Joker (Matthew Modine), Animal Mother (Adam Baldwin), Gomer (Vincent D'Onofrio), Eightball (Dorian Harewood), Cowboy (Arliss Howard) and more experience boot-camp hell pit bulled by a leather lung D.I. (Lee Ermey) viewing would-be devil dogs as grunts,maggots or something less. The action is savage, the story unsparing the dialog spiked with catching humor. From Basic training rigors to Hue City combat nightmare, Full Metal Jacket scores a cinematic direct hit.The film focus on a two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. In the hell camp the dehumanizing process turns people into trained killers. From boys in to a trained mean machine killers. It's the late 1960s at Parris Island, South Carolina, the U.S. Marine Corps Training Camp, where a group of young Marine recruits, after having their heads shaved, are being prepped for basic training by the brutal Gunnery Sergeant Hartman (R. Lee Ermey), whose orders are to \"weed out all non-hackers\". Hartman gives each of the Marines nicknames; one pragmatic recruit who talks behind his back becomes \"Joker\" (Matthew Modine); a Texas recruit becomes \"Cowboy\" (Arliss Howard). And finally Leonard Lawrence, a 6-foot 3-inch, 280 pound, slow-witted recruit with low intelligence and ambition becomes \"Gomer Pyle\" (Vincent D'Onofrio), and the focus of Hartman's brutality, because the overweight boy cannot keep up with the other more physically fit recruits in the grueling obstacle courses. The first half more focus on training basics preparing recruits before they ship them to Vietnam and point view story telling from Private James T. \"Joker\" Davis (Matthew Modine) and about torture physics of a young men who is a marine recruit in the platoon lead by Gunnery Sergeant Hartman his Parris Island drill instructor who tortures him by punish his whole squad for his mistakes. And how that young man turns in to a killing mean machine that blows Hartman's head off! And than Pyle sits down on a toilet, places the muzzle of the weapon in his mouth and pulls the trigger, killing himself. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive. The film now more focus on one of those recruits Private Joker (Matthew Moddine) from the boot camp Parris Island, who is in Da Nang Vietnam, reporting on the Vietnam War for the military newspaper Stars and Stripes. He and his partner, combat photographer Rafterman (Kevyn Major Howard), meet a prostitute (Leanne Hong) in the streets and encounter a thief (Nguyen Hue Phong) who steals Rafterman's camera. When they return to their base, they are given new assignments, but Joker wants to go to the front lines to get a good story. Joker and Rafterman are assigned to Phu Bai, a Marine forward operating-base near the ancient Vietnamese city of Hue, Joker is reunited with his team recruit from his training boot camp Paris Island, Cowboy and his unit, the Lusthog Squad, before they met Cowboy's Unit they are go trough They go to the mass grave and find over 20 bodies in a mass grave that have been covered with lime.The film is Staney Kubrick's best realistic Vietnam War film of all time. One of my all time favorite Vietnam War flicks from the 80's, the other film is Platoon (1986) Once more there's excellent cinematography - check out the haunting, almost claustrophobic landscapes of Vietnam. The combination of the demented treatment the recruits receive in boot camp with the combined \"hours of boredom, seconds of terror\" feel of the Vietnam scenes is intense and not for everyone, but feels REAL. I love how the film focus more in a city of Hue and the battlefield starts their. The battle scene sequences are outstanding and Terrific!They look real, There are dozen's of body's out their. We first see Tank driving trough the city of Hue the city's are filed with fire, burning buildings and destroyed houses and street is full of blood. Sergeant Animal Mother (Adam Baldwin),the nihilistic M60 machine gunner of the Lusthog Squad is one of the most beloved characters in the movie and he is at best a supporting cast member. But you wouldn't even think about Animal Mother being just another guy. He is so memorable that you look at him as one of the stars of the show. 'Born to Kill' - written on Joke's helmet. Is sequent that it has to do with the \"duality of Man\" according to Jung. 10/10"
    },
    {
      "username": "tr91",
      "userUrl": "https://www.imdb.com/user/ur41569276",
      "reviewLink": "https://www.imdb.com/review/rw2866226",
      "warningSpoilers": false,
      "date": "9 September 2013",
      "rate": "6",
      "helpful": "267 out of 343 found this helpful.",
      "title": "A film of two halves",
      "content": "'Full Metal Jacket' was a film that I had been meaning to watch for a while after all the good stuff I had heard about it.It really is a film of two halves, unfortunately I didn't like the 2nd half.The 1st half at boot camp was excellent, we saw a lot of character development and emotion as well as a lot of humour and really serious issues. R. Lee Ermey and Vincent D'Onofrio were just brilliant.The 2nd half I didn't enjoy as much, it looked great and there was a lot of action but it was just a bit boring and felt really dragged out, whereas the 1st part just had everything that you wanted.Glad I got round to seeing it but wouldn't watch it again, slightly disappointed after a really good start to the film.6/10."
    },
    {
      "username": "Peach-2",
      "userUrl": "https://www.imdb.com/user/ur0140921",
      "reviewLink": "https://www.imdb.com/review/rw0244023",
      "warningSpoilers": false,
      "date": "10 December 1998",
      "rate": "10",
      "helpful": "297 out of 406 found this helpful.",
      "title": "Kubrick is genius.",
      "content": "Stanley Kubrick's Full Metal Jacket seems like an uncompleted film, but to me that's poetic justice to one of America's uncompleted wars. The film is harsh and doesn't turn a blind eye to the atrocities of Vietnam. Kubrick is the true master of atmosphere in film. He makes you feel like you are there. Friends of mine have commented that they only like the first half of the film and that the second half falls apart. I believe Kubrick sets up the first half to be an understandable reflection of the terror that would eventually enter the lives of these soldiers during war. It is easy to identify with being picked on because we all have in some way. Not all of us, on the other hand, have fought in war. Kubrick is the master."
    },
    {
      "username": "Aidan McGuinness",
      "userUrl": "https://www.imdb.com/user/ur0839067",
      "reviewLink": "https://www.imdb.com/review/rw0244272",
      "warningSpoilers": false,
      "date": "5 November 2002",
      "rate": "",
      "helpful": "216 out of 281 found this helpful.",
      "title": "Kubrick - yay! One of the best war-based movies ever",
      "content": "I like Kubrick's stuff. Generally any movie he directed was several notches, in quality terms, above any other director (particularly those working nowdays). Does `Full Metal Jacket' continue to show the mastermind behind `2001', `The Shining' and `Dr. Strangelove'? Yup, it does.As plots go. there isn't much here. I don't particularly care because the script makes up for it. `Full Metal Jacket' is very much a movie of two halves - the first half dealing with a group of conscripts in training at military camp and the hardships they endure under their `hard-as-nails' instructor. The second half is about their exploits in Vietnam itself. Fights? In 'Nam? Haven't we seen all that before? Yes, but rarely with such an experienced hand at work. And it's the camp scenes that are so wonderful.Gustav Hasford et. Al. have produced an excellent script, particularly for the opening hour. There's barely a moment's pause before you're thrown into the screaming face of Sergeant Hartman. He's hurling abuse at his new recruits with lines so forceful and sharp they'll have you gasping in shock while simultaneously laughing in incredulity. It's the way the script runs in without a pause for breath that helps so wonderfully - and the fact that it's so powerful. It's never just about one-liners from a sergeant, it's also telling a story about how humans work under these conditions. The first half is about how they suffer under their own at home (and very well told it is too), the second half about the human condition under the duress of war. It's an interesting comparison, and a tale well told. The battle may lack some sort of overall context or resolution, but then I feel that's in keeping with the movie - it's about the individual, and not the war, and such elements cannot be easily quantified.All the characters have a grounded `real world' feel to them, due to both the material and the versatility of the actors. R. Lee Emery is viciously delightful as the manic Sergeant Hartman, while managing to add occasional touches of humanity and a `this is for your own good' attitude through subtle gestures. Matthew Modine is the amiable lead, Private Joker, and as such balances the hard and soft edges admirably (if not spectacularly). The other stand out though is Vincent D'Onofrio as Private Gomer Pyle, the recruit picked upon by Hartman and the other cadets. There's a wonderful innocence about him in the beginning, which transforms into a frightening hardening of his soul later on. The evil/beyond-hope look he gives later on (anyone who has seen the movie will know the one I mean), remains as the most frightening look I've ever seen depicted onscreen. All in all the cast accredit themselves well here.And so to the direction. It's Kubrick. It's good. Once more there's excellent cinematography - check out the haunting, almost claustrophobic landscapes of Vietnam. There's some lovely use of filters (that haunting blue). There's a brilliant subtle score, that's eerie when used, but never intrusive. There's a very good command of pace - the viewer is never left idle or bored, and the story (particularly in the tremendous first half) flows along smoothly. Great touches abound throughout - check out the many examples, such as the opening scene of Hartman marching right up to the recruits (and to the camera), spitting and screaming vindictive comments, almost as if at the viewer. Some may criticise the almost disconnected feeling you have in the battle scenes towards the end, but I found their stillness, their quietness, and raw power, far more effective than the flash-bang wizardry employed in tripe such as `We Were Heroes'. I can blather on about Kubrick for ages. so I'll stop now.Is `Full Metal Jacket' perfect? Not quite because of the `two halves' syndrome. Although they do contrast and complement one another, the first half is very much the stronger half. The second feels weaker against it. In and of itself the second half would normally be regarded well, but it doesn't have the visceral power that the first does. I love both bits, but I do love one bit more. This makes the movie suffer just a little. There's so much to like here though that I can't criticise too much - and so much to cherish (especially in the lines delved out). Once more the main man succeeds. Definetely worth seeing. 9/10."
    },
    {
      "username": "brujay-1",
      "userUrl": "https://www.imdb.com/user/ur11964725",
      "reviewLink": "https://www.imdb.com/review/rw1551647",
      "warningSpoilers": false,
      "date": "22 December 2006",
      "rate": "8",
      "helpful": "273 out of 317 found this helpful.",
      "title": "The movies finally got Parris Island right",
      "content": "Though I've read only a couple of dozen of the nearly 500 comments on this film, I didn't see any from ex-Marines who'd had the Parris Island experience. I went through PI in 1957. The time period in the picture would have been about 1967, since the in-country sequence includes the '68 Tet Offensive. Little had changed in those 10 years except the switch from M1s to M16s. For the most part Kubrick got Parris Island right on the money. And why shouldn't he have, since his screen DI, Lee Ermey was in fact a real DI before he started acting (he played another DI in \"The Boys of Company C,\" an earlier and lesser Vietnam flick)? He had a built- in technical adviser. The screams and insults and profanity and physical punishment were all part of the DIs armamentarium. When you're facing up to 75 young strangers you need to immediately establish absolute authority and hang on to it for 13 weeks. Furthermore, you want to break the breakable as soon as you can. My platoon had its Private Pyles and though none ended up as he does in \"Full Metal Jacket,\" I remember that they simply disappeared from our ranks, never to be heard from again. Nothing Ermey as Sgt. Hartman does is exaggerated.Kubrick, however, does exaggerate. Speaking of Pyle's ending, it's almost impossible for me to imagine that a recruit could manage to sneak a clip of live rounds away from the rifle range. Every shooter at the range has his own rifle coach, and every single round is very carefully accounted for. Kubrick started the killing one scene too early.I've read that DIs nowadays are forbidden to use the time-honored f-word, and are not allowed to lay hands on recruits. I don't know if that's good or bad for training (I had my face slapped hard my first day of boot camp and that was just for openers), but then all of us old-timers like to brag about how tough it useta be!A final note: It's interesting to compare \"Full Metal Jacket\" to another attempt at a portrayal of Parris Island, Jack Webb's \"The DI,\" made around '55 or '56. Webb tries for authenticity, but as I was to learn a year or so later, his PI was a boy scout camp."
    },
    {
      "username": "AaronCapenBanner",
      "userUrl": "https://www.imdb.com/user/ur23589178",
      "reviewLink": "https://www.imdb.com/review/rw2870685",
      "warningSpoilers": false,
      "date": "16 September 2013",
      "rate": "7",
      "helpful": "10 out of 11 found this helpful.",
      "title": "R. Lee Ermey.",
      "content": "R. Lee Ermey dominates this Stanley Kubrick directed Vietnam War drama, as he plays profane, no-nonsense, ultra tough Gunnery Sergeant Hartman, who belittles, browbeats, and insults the marine recruits in brutal boot camp training. Vincent D'Onofrio plays a slow-witted recruit who gets it the worst from Hartman, until he finds out that he is quite good at shooting... Mathew Modine plays \"Joker\", since he has an overt sense of humor that also captures the attention of Hartman, whose relentless, unmerciful verbal attacks take their toll in ways he didn't imagine... Film then picks up later, as Joker is a war correspondent for Stars & Stripes, who witnesses first hand the insanity of Vietnam...R. Lee Ermey so dominates the first half of the film(in an unforgettable, searing portrayal of dehumanization) that, when his part is over, it leaves a looming shadow over the rest of the film that is never lifted, though it is still a well-presented look at the war, though nothing exceptional. Worth watching for Ermey, who should have received an Academy Award!"
    },
    {
      "username": "heisenberg12",
      "userUrl": "https://www.imdb.com/user/ur57699719",
      "reviewLink": "https://www.imdb.com/review/rw3725607",
      "warningSpoilers": false,
      "date": "7 June 2017",
      "rate": "8",
      "helpful": "29 out of 35 found this helpful.",
      "title": "Very good movie- A film of 2 halves: the first perfect, the second lagging behind but good enough",
      "content": "I finally got around to watching this for the first time. The first half is a 10/10, the second half is a 7/10 and falls apart into what seems like every war movie's clichés, even though it's good enough. The first half is a masterpiece of filmmaking- there's almost no flaws, the pacing is perfect, the acting great, it has an instant classic type experience to it you'll never forget. The second half is good, decent but it doesn't rival the first half and its perfection. That makes its let down even more pronounced. So overall, I give it an 8/10 because you can't overlook the drop in quality of the second half. 8/10"
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0244117",
      "warningSpoilers": true,
      "date": "27 August 2001",
      "rate": "",
      "helpful": "28 out of 39 found this helpful.",
      "title": "The Battle Photographer",
      "content": "Spoilers herein.Since Vietnam, there have been a few competent films by Americans about Americans on the ground in battle. I think which one you like best (or appreciate the most) probably says a lot about you and how you look through the filmmaker's camera.Ready? `Red Line,' `Metal Jacket.' `Catch-22,' `Apocalypse,' `3 Kings,' `Platoon,' `Private Ryan.' Seven types of people. How would you rank them? Who are you? How do you see?I listed them according to my own ranking, which is heavily weighted on the degree to which the filmmaker mastered the art of filmmaking to do something to my soul that no one else could through any other art experience. Private Ryan was just a noisey Norman Rockwell. Platoon's war was somebody's fault, and we watch colorful and depictions as accusations. But Red Line weaved a mystical hypnotic internal narrative that put me in the mind (and incidentally the body) of a character swept by violent events. So very expert at understanding how to make us see war around us permanently on leaving the theater.But I rank this film high as well. Less visceral, at least at first. But there is so much style in the manner of the storytelling that it alone has more power than the story itself.The story is clever, however, concerned with framing the narrative. `Joker,' (an apt name if there ever was one) starts with a voiceover. We immediately know it is his story, but we don't know which character matches the voice for sure until the toilet murder scene. So we spend about half of the film, not in the story proper, but in a metastory which defines the narrator. And bingo, at the end, he is turned into a reporter.Then flash to a whore's butt and the story begins with a stolen camera! Immediately thereafter we have a whole different stance from Kubric's camera. Before, it was sterile, `outside' the action like most other films. Now it turns into a camera that is part of the group. It's internal to the gathering and travels with the men as a member of the party. And the camera is now less apparently controlled by the reporter than by the sweep of fate.We go through a middle section which sets up the `war story' proper, and this is framed once again by dickering with a whore. Then we are carried along with Rafterman's cameras. (And incidentally, Kubric's daughter with a camera at the burial pit.)And now to battle, and the style takes on a new Dantesque hue at the third layer of Hell. Just one example: that trio of sounds leading up to final encounter with the sniper are three metallic grating/screeching sounds that transmute to nearly identical violin sounds leading up to Joker's decision to shoot. Another: the sets in this third are transforming. I invite you to compare them to Spielburg's for a literal eyeopener. `Enemy at the Gates' had a similar battle-sniper-set style, clearly derivative of Kubric, but more stagey. Here we have carefully composed primitive shapes and fractal textures that suggest more than mere war: the destruction of civilization but the preservation of a more basic order. Another: the action is interrupted by journalistic interviews where the characters look you right in the eye to underscore that you are there -- you are the narrator; you have to decide whether to shoot or not.Kubric is a very personal filmmaker, and his personality is tied up in abstractions unique to the film narrative. I take war personally, so prefer this film above most of the others, except for Malick which is more personally abstract and therefore even more present."
    },
    {
      "username": "ReelCheese",
      "userUrl": "https://www.imdb.com/user/ur3924830",
      "reviewLink": "https://www.imdb.com/review/rw1423879",
      "warningSpoilers": false,
      "date": "18 July 2006",
      "rate": "8",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Fascinating Despite Come-Down",
      "content": "The first half of \"Full Metal Jacket\" is so intensely entertaining that director Stanley Kubrick can be forgiven for the slight come-down that follows. The opening scenes draw us into the strict world of \"maggots\" training to join the ranks of real men, otherwise known as Marines. We see the characters humiliated, yelled at like children, beaten and, in one tragic case, broken down. It's an unpleasant yet fascinating place to visit from the comfort and safety of our living room couches. Yet once the action shifts to the Vietnam War, when you would expect even better, something is lost. The characters seem less real and the atmosphere less intriguing. Overall, however, there aren't many faults to find with this effort, but be forewarned that it's certainly not for younger viewers."
    },
    {
      "username": "Agent10",
      "userUrl": "https://www.imdb.com/user/ur1696608",
      "reviewLink": "https://www.imdb.com/review/rw0244157",
      "warningSpoilers": false,
      "date": "28 April 2002",
      "rate": "10",
      "helpful": "118 out of 178 found this helpful.",
      "title": "Kubrick's version of Vietnam",
      "content": "Stanley Kubrick always managed to bring something new to his palate whenever he made a film. He brought dark comedy to the screen with Dr. Stranglove, an epic story with Spartacus, and a film more important for its efforts than box office potential in the film Paths of Glory. This is what makes Full Metal Jacket so entertaining.Humor, horror and political commentary are the themes which shape Full Metal Jacket. From the overbearing drill sergeant to the war loving soldiers. It all seems to make sense within this film, never overstepping its bounds or being to subtle. Kubrick may have alienated some his hardcore fans with such a mainstream-type story, but then again, he helped mainstream movies take a bold step. What doesn't the current cinema owe Kubrick?"
    },
    {
      "username": "wes-connors",
      "userUrl": "https://www.imdb.com/user/ur15896852",
      "reviewLink": "https://www.imdb.com/review/rw2136464",
      "warningSpoilers": false,
      "date": "4 October 2009",
      "rate": "7",
      "helpful": "12 out of 15 found this helpful.",
      "title": "That Giant Sucking Sound",
      "content": "The unifying theme of Stanley Kubrick's 'Full Metal Jacket' is that Vietnam put American in the toilet; each of the film's three parts, or \"Acts\", has characters in what is repeatedly described as \"a world of s--t.\" The men are successful trained to kill - but, they do not know when to kill, who to kill, or why anyone should die. Narrator protagonist Matthew Modine (as James \"Joker\" Davis) not only wears a \"Peace\" button on his uniform, but also has written \"Born To Kill\" on his helmet (to illustrate the duality of man). The reason for the war is explained, \"We are here to help the Vietnamese because inside every gook there is an American trying to get out.\" Probably, the film's strongest \"story\" is told in the first \"Act\"; it features drill sergeant R. Lee Ermey (as Hartman) belittling overweight Vincent D'Onofrio (as Leonard \"Gomer Pyle\" Lawrence). This story literally ends in the latrine, where a successfully trained killer demonstrates his ability. Some of the material in the rest of the film becomes very weak, in comparison; especially disappointing are some mid-movie scenes \"staged\" for the camera of \"Stars and Stripes\" photographer \"Rafterman\" (Kevyn Major Howard) - the characters all say silly things for the camera. Still, some near-poetic moments of humor and brutality remain to be seen.******* Full Metal Jacket (6/17/87) Stanley Kubrick ~ Matthew Modine, R. Lee Ermey, Vincent D'Onofrio, Arliss Howard"
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1091154",
      "warningSpoilers": true,
      "date": "29 May 2005",
      "rate": "8",
      "helpful": "68 out of 101 found this helpful.",
      "title": "Repeated viewings reveal more details and connections",
      "content": "The first third of Stanley Kubrick's take on the Vietnam War is as powerful and shocking as any film ever made about the military In the film's opening shots, we see close-ups of new Marine recruits getting their heads shaved at a military training post The next shot follows Hartman (R. Lee Ermey) as he strides through a barracks and completes the first stage of the young men's intimidating indoctrination into the Marine Corps The scene also establishes the measured pace that Kubrick maintains throughout Booming, gloriously profane, and imaginative, Sgt. Hartman is a force of nature that will mold these boys into killing machines At that point, most war films would turn to the young men, sketch out their pasts and then show their transformation into a cohesive unit These kids are names and archetypes who will react differently to Hartman's approach Kubrick makes Ermey such a mesmerizing force that one key early element is easy to overlook From the first moment we see him in the barber's chair, before we even know his name, it is abundantly clear that Leonard is mad He has that familiar vacant, smiling, dull-eyed expression of evil that Kubrick also uses to define Little Alex in \"A Clockwork Orange\" and Jack Torrance in \"The Shining.\" The other characters do not see it, and so the inevitable confrontation between Hartman and Leonard is all the more horrifying The middle section of the film establishes Joker's role as a war reporter, working behind the lines during the Tet Offensive of 1968, and his desire for some \"trigger time\" with his old pals from basic That's where Kubrick shapes his view of the Vietnam war In the third part, a new sociopath named Animal Mother (Adam Baldwin) is introduced, and the focus shifts to a patrol searching through the bombed out city of Hue to root out a sniper That is where the filmmakers comment most pointedly on the war itself They see it as a dead-end that serve no purpose That's certainly a valid artistic interpretation of history Many other films have made the same points, often more eloquently But Kubrick isn't interested in eloquence, either The three sections are unmistakably separated from each other The first stands on its own though key elements are stated again at the end For the viewer expecting a \"traditional\" war film, the result is disconcerting, frustrating, and somehow unfinished Most Kubrick fans will admit that \"Paths of Glory\" and \"Dr. Strangelove\" are more enjoyable, but even if their man is not in top form, \"Full Metal Jacket\" is challenging, and repeated viewings reveal more details and connections"
    },
    {
      "username": "alanbenfieldjr",
      "userUrl": "https://www.imdb.com/user/ur77751130",
      "reviewLink": "https://www.imdb.com/review/rw3741222",
      "warningSpoilers": false,
      "date": "28 June 2017",
      "rate": "9",
      "helpful": "87 out of 104 found this helpful.",
      "title": "Full Metal Jacket 30 years later",
      "content": "Strange, as I sat to watch Full Metal Jacket for the first time in years, what I remembered most was Lee Emery's Sgt Hartman's rantings and Vincent D'Onofrio. In fact, it was Vincent D'Onofrio's Pvt Lawrence, known as \"Gomer Pyle\" that made this Stanley Kubrick film, truly memorable. I'm noticing this more and more as I get older and revisit old films. The performances, certain performances, even in supporting roles allow a film to keep growing with the passing of time. Full Metal Jacket a shattering film or I should say, two shattering films. The first part, the training, the intro is a masterpiece practically impossible to match up, so, the second part doesn't match it. But, still. A film-experience. Vincent D'Onofrio's performance even more powerful now, 30 years later. Enormous! The British skies over Vietnam is another reminder than an artist's eye knows no boundaries."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2081588",
      "warningSpoilers": false,
      "date": "16 June 2009",
      "rate": "7",
      "helpful": "17 out of 23 found this helpful.",
      "title": "The Marine's don't want robots - they want killers.",
      "content": "This is the journey undertaken by Private \"Joker\" J.T. Davis, from brutal training camp to Vietnam itself.As most people know by now, Full Metal Jacket is divided very much into two different halves, halves that to me show the best and worst of the talented director, Stanley Kubrick. For the first part we are subjected to the training regime inflicted on wet behind the ears boys, boys soon to become Marines out in the harshness of the Vietnam War. This is real dehumanising stuff, frighteningly essayed by the brilliance of drill instructor R Lee Ermey's performance. We know, see and feel that the boys are primed to be killing machines, unemotional killing machines at that, with Kubrick astutely weaving the brutality of camp into the moral quandary that was the war itself. One particular recruit, Private Gomer (a heartfelt and unnervingly great Vincent D'Onofrio) is the film, and Gustav Hasford's (writer of the novel and co screenwriter here) point of reference in this incredible first half. It's with this strand that \"Jacket\" burns itself into the soul of the viewer, to hopefully set us up for what will be Private \"Joker's\" (Matthew Modine) preparation for the Vietnam conflict.Then it's that second half...Where do we go from here? We already know that \"Joker\" and his mentally brutalised colleagues have been stripped of their basic humanity. Soldiers primed to kill, it's harsh, but true. But Kubrick has already chilled our blood and bludgeoned us repeatedly courtesy of the \"Boot Camp\" set up. Modine's (who isn't strong enough to carry the picture) \"Joker\" is now the film's axis, a clever, most definitely articulate character, who is thrust into the murky and muddled battle of the Tet Offensive, yeah and so? All it amounts to is a prolonged series of rationale and philosophical musings on the false war. Kubrick even shifting to safe mode with a clumsy narration segment spouted by \"Joker\".Full Metal Jacket is a truly fine film, but it's not the brilliant one it really should have been. If one can take the time to venture deeper with the second half, then it doesn't deliver on the already made point promise of the first part. Technically it's flawless, incredibly designed, with Douglas Milsome's cinematography stunningly effective. But I'll maintain to my final day that Full Metal Jacket finished up as being bloody and pretty instead of being a poignant and horrifying masterpiece. 7/10"
    },
    {
      "username": "Marc_Israel_365",
      "userUrl": "https://www.imdb.com/user/ur20531137",
      "reviewLink": "https://www.imdb.com/review/rw2843640",
      "warningSpoilers": true,
      "date": "3 August 2013",
      "rate": "6",
      "helpful": "6 out of 6 found this helpful.",
      "title": "From boys to men to boys",
      "content": "Events of dehumanization as learned scene by scene as coldly dictated by director Stanley Kubrick. Our Marines are always rallying around something white trying to hold onto their own values, themselves and, overall, their sanity. Much like \"The Deer Hunter\", this anti-war film is broken down into two parts, one prior to war, and then into the beast itself. While one movie shone an extra light on those stateside, Full Metal Jacket stayed with our boys and to what was left of themselves; their boyhood instincts (to defend each other) and their Mickey Mouse marches which drove the point home. This cold film doesn't bring you into each character as others might, but war is not about one person, is it? It is full of dogma (first to go, last to know), direction (our marines got lost) and dehumanization (see the first hour alone to hear the non-stop rant of Gunnery Seargent Hartman (Lee Ermey). Brutal and darkly funny, this is what I held onto as our narrator, Joker (Mathew Modine) is simply trying to fend off the brainwash, while it bounced off of Private Pyle (Vincent D'Onofrio) whose story tells us all Kubrick needed to say. That is why the second half of the film in Viet Nam seemed only to serve the audience a follow up and adventure as to what happened to some of our original boot camp marines. I still found the film both detached and personal, as if I was trying to fend off the disgracing of my viewers' soul. I like this film due to that internal struggle of whether or not to view war as acceptable."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2368813",
      "warningSpoilers": false,
      "date": "13 January 2011",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Superb, one of Kubrick's best",
      "content": "I like Stanley Kubrick, and I love his films, especially 2001, Barry Lyndon, Paths of Glory, Dr Strangelove and this, his penultimate film. Full Metal Jacket is a harrowing, violent and foul-mouthed film, yet it is superbly done. True, one or two parts may lack tropical realism, but the atmosphere the film creates is extraordinary. The film looks excellent with skillful cinematography. The script is very well crafted and does have a sense of realism, while the story is compelling with the transition from the training at the camp to the bombed Vietamnesse city smoothly done. I am with those who thinks the first half is better than the second, but that is not to say the second half isn't good, it is more than good, but the first half really was outstanding. Kubrick's direction as always is superb, as is the acting especially Lee Ermey and Vincent D'Onofrio. All in all, one of Kubrick's best and one of the best war movies you will see. 10/10 Bethany Cox"
    },
    {
      "username": "FKDZ",
      "userUrl": "https://www.imdb.com/user/ur65836273",
      "reviewLink": "https://www.imdb.com/review/rw7909532",
      "warningSpoilers": false,
      "date": "1 March 2022",
      "rate": "7",
      "helpful": "8 out of 9 found this helpful.",
      "title": "FMJ",
      "content": "Arguably the first half of this movie is what this movie is remembered by. It's a incredible piece of acting and writing. It fully engages you and doesn't really let you go. Though it does at a moment become predictable where it will end. But being the bare witness to the demoralization and dehumanization of humans to turn them into killing machines is somewhat unmatched.The second half however is underwhelming. Few of the things seen truly feel impactful and that's also due to the somewhat underwhelming performance, writing and directing of Pvt. Joker. I don't know why they did it but his emotional vulnerability is all over the place, one moment he doesn't even care about a fallen squad member, and then he does, there's no transition. And it made the character unbelievable and thus ruined much of the emotional turmoil for me. The second half felt simpler and cheaper to me in general, dumb, ignorant soldiers in a war they aren't supposed to be in. The acting just felt somewhat flat as well. Like the banter between Joker and Animal Mother. And the anti-war message was lacking to say the least due to a lack of visual despair and agony.The directing and music is fantastic (though not that bird song..ugh), not much more to say there than you'll hear more than enough iconic soundtracks and beautifully shot scenes (set design mostly). Some practical effects and such feel lacking though and is inconsistent, one guy gets shot, blood splatters everywhere, another guy gets shot, and nothing, just falls down to the ground unconvincingly. This was especially bad during a ambush scene at basecamp where the enemies just ''played dead'' it seemed and fell with grace.So yeah, I'll remember this movie for its first half, but I almost already forgot most of the second half...definitely not one of Kubrick's best."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0244269",
      "warningSpoilers": false,
      "date": "26 October 2002",
      "rate": "",
      "helpful": "16 out of 23 found this helpful.",
      "title": "A good (but heavy handed) anti-war movie that has an enjoyable vein of black humour",
      "content": "A bunch of young men join a marine training camp to prepare for war in Vietnam. However before they can face the enemy they must make it past the rigours of Gunnery Sergeant Hartman. Once past the training they face a war where many may not return alive. They learn that the dehumanising effects of war run through every stage and are complete.This is Kubrick's most accessible film and I suspect that contributes to it's high rating on the imdb. There can be no other reason why it would rank so high on it's own merits. This is not to say it's a bad film but it is certainly not one of the best anti-war films ever made. The plot is a game of two halves  first the training camp and second the actual conflict. The point that both halves hammer home relentlessly is that war dehumanises those involved.The first half is enjoyable pure and simply because of Emery's Gunnery Sergeant. His is a witty character despite the inherent cruelty in his actions. However eventually his screen time is ended and the film continues to make the same point over again but in a different setting. The problem is that it hammers it's point home so heavily that it doesn't allow us to work things out for ourselves. Even things like Platoon and the like allow us to work it out ourselves! The film's strength is it's wonderful streak of black comedy that runs right the way through  it is the reason for watching and makes it feel a little different from other hardcore war movies of this ilk.Kubrick is always going to be watchable but this is not one of his best. His cold direction is usually excellent but here it is alienating and clinical when we should really be getting to like the soldiers involved. The film is still good but I felt that the flaws are too much here. Emery is undoubtedly the main reason for watching this film. He gives a great performance that is a mix of improvisation and script that works well and guaranteed him work in the same role for many years. Modine is suitably wide eyed as our guide through his experiences but he is like most of the other marines  just blank characters for Kubrick to work around. Only D'Onofrio (Pyle) came out of this as a real person.Overall this is a good anti-war film but not a great one. There is no doubting the power of the message and Emery easily carries the film till the war itself. It is still a very good film but I suspect that the fact that this is Kubrick's easiest film to get into explains why it is rated so highly."
    },
    {
      "username": "WriterDave",
      "userUrl": "https://www.imdb.com/user/ur1069062",
      "reviewLink": "https://www.imdb.com/review/rw1254602",
      "warningSpoilers": true,
      "date": "3 January 2006",
      "rate": "9",
      "helpful": "34 out of 49 found this helpful.",
      "title": "In a World of S**T, they are not Afraid....",
      "content": "Kubrick's films are generally more accessible and mainstream than he is often given credit for. As gritty and unflinching as his take on the Vietnam War is, this is for my money his most mainstream work. Kubrick gives us a \"grunts-eye-view\" of military training and combat in a war that was particularly unpopular and well documented. This was the first war to be fully televised on TV, and Kubrick pokes fun at the soldier's awareness of this, and of the dubious nature of the propaganda put out by the military's own front-line reporting. Here we get a world-wind tour speckled with dark humor (but never too much politics, a similar stance that benefited the recent \"Jarhead,\" which owes a world of debt to this film), excellent use of pop music (who thought Kubrick could go all Scorcese on us), and brutal sequences of hard-edged violence.My one complaint is that Matthew Modine is extremely underwhelming in the lead role, but the rest of the ensemble is top notch. Lee Ermey is perfect as the sadistic but oddly sympathetic drill instructor who turns maggots into killing machines in boot camp, and Arliss Howard is especially good as the underwritten \"Cowboy.\" Kubrick, always the master of his art, leaves us with some lasting images, most notably D'Onofrio's stare-down before blowing his brains out, which is mirrored later on by a young female Vietnamese sniper begging to be put out of her misery after being fatally wounded. Kubrick also closes the film with something he doesn't often do, a wink to the audience, as our grunts, now combat weary and barely alive, march to the theme of the \"Mickey Mouse Club\" showing that indoctrination started long before they were dehumanized in boot camp and rebuilt as \"The Core.\" Semper Fi, indeed."
    },
    {
      "username": "guy-bellinger",
      "userUrl": "https://www.imdb.com/user/ur3438860",
      "reviewLink": "https://www.imdb.com/review/rw0970555",
      "warningSpoilers": false,
      "date": "30 November 2004",
      "rate": "9",
      "helpful": "178 out of 301 found this helpful.",
      "title": "Still modern today, all too modern.",
      "content": "One of the greatest war movies ever, a statement very few will dispute. I will therefore not illustrate this point : thousands have done it before me, often brilliantly.I'd rather lay the stress on Kubrick's modernity in \"Full Metal Jacket\". Indeed the USA being once again at war, it is interesting to compare the way they wage war these days with the way they did back in the sixties. And the comparison is edifying. Just apply the following statements to Iraq and you will realize NOTHING HAS CHANGED : - the marines are trained to become killing machines without being taught minimum knowledge about the people they come to defend. - the boys know nothing about the Vietnamese and reason according to American standards : for instance \"Cow-Boy\" complains half-jokingly half-seriously that there are no horses in Vietnam. Another example is the soldiers singing the Mickey Mouse Club hymn after fighting, which strikes as particularly out of place. - they try in vain to impose democracy through gruesome violence and destruction. Such similarities abound and testify to the film's absolute - and unfortunate - modernity. I wish Kubrick was still with us. I also wish George Bush and his advisers had seen this masterpiece and - most of all - understood its message. They would have avoided another bloody war doomed to fail."
    },
    {
      "username": "thomasgouldsbrough",
      "userUrl": "https://www.imdb.com/user/ur148218272",
      "reviewLink": "https://www.imdb.com/review/rw7910027",
      "warningSpoilers": false,
      "date": "1 March 2022",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "\"The dead know only one thing - it is better to be alive\"",
      "content": "Full Metal Jacket is an excellent war film. All the characters are very well written, and represent very common characters in the military. There's always a class clown, a hardened individual that's respected, and someone who just isn't capable. The acting of Vincent D'Onofrio in this is exceptional, he only has a short amount of screen time, but his story is very sad and impactful. The second half of the film starts to become less enjoyable, but nevertheless it's still a good film."
    },
    {
      "username": "auberus",
      "userUrl": "https://www.imdb.com/user/ur0728175",
      "reviewLink": "https://www.imdb.com/review/rw0244317",
      "warningSpoilers": true,
      "date": "22 August 2003",
      "rate": "8",
      "helpful": "63 out of 88 found this helpful.",
      "title": "`The dead know only one thing: it's better to be alive'",
      "content": "Mr. Stanley Kubrick was not a prolific director. After 71 years walking this Earth he left us with only 16 movies among which some of the most powerful cinematic experience to date. `Full Metal Jacket' is part of Mr. Kubrick's list of masterpiece and was released 12 years before his last movie `Eyes Wide Shut' as War always precedes Denial.Having a total control on his Picture from the writing to the editing, what you see on the screen is what he wanted you to see and what we see is close to a perfect demonstration: One can learn to kill. Through this learning one looses his individuality. By loosing his individuality one can loose is Innocence and reach Madness and of course during all those steps something can go wrong To make this demonstration as obvious on paper as on screen you have to be methodic (as methodic as Stanley Kubrick) and you have to have the right actors and the right acting. Matthew Modine (Pvt Joker), Vincent D'Onofrio (Pvt Gomer Pyle) and R.Lee Ermey (Gunnery Sgt. Hartman) are a good example of how pristine the casting was. In order to draw a clear conclusion Stanley Kubrick used the chapter technique and delivers a 2 chapters demonstration. Chapter One  The building of a Corp.  The Training. Here Mr. Kubrick shows us how a Marine Corp. is built, how one can learn to kill and how through this learning one looses his individuality. This building has to go through 2 major processes: Humiliation and Team building. The humiliation process consists in the destruction of your ego, because your ego is what makes you unique. If an organization breaks your ego then you are most likely to be just like everybody else. Private Gomer Pyle is the perfect example of how someone goes through this humiliating process: he is the most humiliated Private and we all remember this wonderful quote from the Gunnery Sergeant Hartman Drill Instructor (R.Lee Ermey):'Are you quitting on me?! Well, are you?! Then quit, you slimy *beep* walrus-looking piece of *beep*! etc ' The second process in the building of a Corp., is in fact the team building process: It is an equally important process because at the end of this process each team member only exists through the team, alone each of them is `equally worthless' as our favorite Sergeant Instructor would say. Obviously something will go wrong because there is no such thing as invincibility (it's a chimer at best, a lie). The suicide scene is therefore the transition between the notion of individuality and the notion of Corp., between chapter one and chapter two. Admirably played by our 3 protagonist (Private Joker and Pyle and the Sergeant Drill Instructor) it emphasis the only true statement of the movie: `we live in a world of *beep*' and `the dead know only one thing: it's better to be alive'. Chapter Two  Disintegration of a Corp.  The War. This second piece of the demonstration (one can loose his innocence) is fueled with two dynamics: the desire of the killing and the reality of war. The desire of the killing is impersonating by Pvt `Joker', he is a combat correspondent who doesn't really understand the meaning of this War. At the same time he is `born to kill' and think that the combat will bring meaning to this absurdity. This contradiction is very well sum up in the following memorable quote from Pvt Joker: `I wanted to meet stimulating and interesting people of an ancient culture and kill them. I wanted to be the first kid on my block to get a confirmed kill.' As soon as Pvt Joker links up with Pvt Cowboy, Mr. Kubrick makes us dive in `the reality of war' and the disintegration of the Corp. begins: The lieutenant goes first with him the authority, one by one the Marines falls under the fire of a sniper. The climax of this chapter is the fugitive vision of the sniper. The platoon has reached the border of Madness, where `a day without blood is like a day without sunshine'. Did Pvt Joker found the meaning he was looking for? Can we control the dogs of war once we've unleashed them? Once again there is no lesson only one statement as the thoughts of Pvt Joker `drift back to erect nipple wet dreams about Mary Jane Rottencrotch and the Great Homecoming *beep* Fantasy.' He is `so happy that he is alive, in one piece and short. He lives in a world of *beep* yes. But he is alive and not afraid'. Innocence is lost forever left on the ground by the corpses and their `Full Metal Jackets'."
    }
  ],
  "errorMessage": ""
}