{
  "imDbId": "tt0093058",
  "title": "Full Metal Jacket",
  "fullTitle": "Full Metal Jacket (1987)",
  "type": "Movie",
  "year": "1987",
  "language": "en",
  "titleInLanguage": "Full Metal Jacket",
  "url": "https://en.wikipedia.org/wiki/Full_Metal_Jacket",
  "plotShort": {
    "plainText": "Full Metal Jacket is a 1987 war drama film directed and produced by Stanley Kubrick, who also co-wrote the screenplay with Michael Herr and Gustav Hasford. The film is based on Hasford's 1979 novel The Short-Timers and stars Matthew Modine, Lee Ermey, Vincent D'Onofrio and Adam Baldwin.\r\nThe storyline follows a platoon of U.S. Marines through their boot camp training in Marine Corps Recruit Depot Parris Island, South Carolina, primarily focusing in the first half of the film on privates J.T. Davis and Leonard Lawrence, nicknamed \"Joker\" and \"Pyle,\" who struggle under their abusive drill instructor Gunnery Sergeant Hartman. The second half portrays the experiences of Joker and one other of the platoon's Marines in Vietnamese cities Da Nang and Huế during the Tet Offensive of the Vietnam War. The film's title refers to the full metal jacket bullet used by military servicemen.\r\nWarner Bros. released Full Metal Jacket in the United States on June 26, 1987. It was the last of Kubrick's films to be released during his lifetime. The film received critical acclaim, grossed $120 million against a budget of $16 million, and was nominated for an Academy Award for Best Adapted Screenplay for Kubrick, Herr, and Hasford. In 2001, the American Film Institute placed the film at number 95 in its poll titled \"AFI's 100 Years...100 Thrills\".",
    "html": "<p>Full Metal Jacket is a 1987 war drama film directed and produced by Stanley Kubrick, who also co-wrote the screenplay with Michael Herr and Gustav Hasford. The film is based on Hasford's 1979 novel The Short-Timers and stars Matthew Modine, Lee Ermey, Vincent D'Onofrio and Adam Baldwin.</p><p>The storyline follows a platoon of U.S. Marines through their boot camp training in Marine Corps Recruit Depot Parris Island, South Carolina, primarily focusing in the first half of the film on privates J.T. Davis and Leonard Lawrence, nicknamed \"Joker\" and \"Pyle,\" who struggle under their abusive drill instructor Gunnery Sergeant Hartman. The second half portrays the experiences of Joker and one other of the platoon's Marines in Vietnamese cities Da Nang and Huế during the Tet Offensive of the Vietnam War. The film's title refers to the full metal jacket bullet used by military servicemen.</p><p>Warner Bros. released Full Metal Jacket in the United States on June 26, 1987. It was the last of Kubrick's films to be released during his lifetime. The film received critical acclaim, grossed $120 million against a budget of $16 million, and was nominated for an Academy Award for Best Adapted Screenplay for Kubrick, Herr, and Hasford. In 2001, the American Film Institute placed the film at number 95 in its poll titled \"AFI's 100 Years...100 Thrills\".</p>"
  },
  "plotFull": {
    "plainText": "Full Metal Jacket is a 1987 war drama film directed and produced by Stanley Kubrick, who also co-wrote the screenplay with Michael Herr and Gustav Hasford. The film is based on Hasford's 1979 novel The Short-Timers and stars Matthew Modine, Lee Ermey, Vincent D'Onofrio and Adam Baldwin.\r\nThe storyline follows a platoon of U.S. Marines through their boot camp training in Marine Corps Recruit Depot Parris Island, South Carolina, primarily focusing in the first half of the film on privates J.T. Davis and Leonard Lawrence, nicknamed \"Joker\" and \"Pyle,\" who struggle under their abusive drill instructor Gunnery Sergeant Hartman. The second half portrays the experiences of Joker and one other of the platoon's Marines in Vietnamese cities Da Nang and Huế during the Tet Offensive of the Vietnam War. The film's title refers to the full metal jacket bullet used by military servicemen.\r\nWarner Bros. released Full Metal Jacket in the United States on June 26, 1987. It was the last of Kubrick's films to be released during his lifetime. The film received critical acclaim, grossed $120 million against a budget of $16 million, and was nominated for an Academy Award for Best Adapted Screenplay for Kubrick, Herr, and Hasford. In 2001, the American Film Institute placed the film at number 95 in its poll titled \"AFI's 100 Years...100 Thrills\".\r\nPlot\r\nDuring the Vietnam War, a group of recruits arrive at the United States Marine Corps training facility at Parris Island. Drill instructor Gunnery Sergeant Hartman uses harsh methods to train them for combat. Among the recruits is the overweight and dim-witted Leonard Lawrence, whom Hartman nicknames \"Gomer Pyle\", and the wisecracking J.T. Davis, who receives the name \"Joker\" after interrupting Hartman's introductory speech with an impression of John Wayne.\r\nDuring basic training, Hartman names Joker as squad leader and puts him in charge of helping Pyle improve. One day, Hartman discovers a jelly doughnut in Pyle's footlocker, blames the platoon for Pyle's infractions, and adopts a collective punishment policy in which any infraction committed by Pyle will earn a punishment for everyone else in the platoon. One night, the recruits haze Pyle with a blanket party, in which Joker reluctantly participates. Following this, Pyle appears to reinvent himself as a model recruit, showing particular expertise in marksmanship. This pleases Hartman but worries Joker, who believes Pyle may be suffering a mental breakdown after seeing Pyle talking to his rifle. After the recruits graduate and the night before they leave Parris Island, Joker discovers Pyle in the bathroom, loading his service rifle with live ammunition, executing drill commands, and loudly reciting the Rifleman's Creed. Hartman attempts to intervene, but Pyle shoots and kills him and then commits suicide.\r\nBy January 1968, Joker is a sergeant and is based in Da Nang for the newspaper Stars and Stripes alongside his colleague Private First Class Rafterman, a combat photographer. The Tet Offensive begins and Joker's base is attacked, but holds. The following morning, Joker and Rafterman are sent to Phu Bai where Joker searches for and reunites with Sergeant \"Cowboy\", a friend he met at Parris Island. During the Battle of Huế, a booby trap kills the squad leader, leaving Cowboy in command. Becoming lost in the city, the squad is ambushed by a Viet Cong sniper who kills two members. As the squad moves in on the sniper's location, Cowboy is killed.\r\nAssuming command, squad machine gunner \"Animal Mother\" leads an attack on the sniper. Joker locates her first, but his M-16 rifle jams, alerting the sniper to his presence. As the sniper opens fire, she is revealed to be a teenage girl. Rafterman shoots her, wounding her mortally. As the squad converges on the sniper, she begs for death, leading to an argument over whether or not to kill her. Animal Mother agrees to a mercy killing but only if Joker does it; Joker shoots her after some hesitance. Later, as night falls, the Marines return to camp singing the \"Mickey Mouse March\". A narration of Joker's thoughts conveys that, despite being \"in a world of shit\", he is glad to be alive and no longer afraid.\r\nCast\r\nMatthew Modine as Private/Sergeant J. T. \"Joker\" Davis, a wise-cracking young Marine. On set, Modine kept a diary that in 2005 was adapted into a book and in 2013 into an interactive app.\r\nVincent D'Onofrio as Private Leonard \"Gomer Pyle\" Lawrence, an overweight, slow-minded recruit who is the subject of Hartman's mockery. D'Onofrio heard from Modine of the auditions for the film. D'Onofrio recorded his audition using a rented video camera and was dressed in army fatigues. According to Kubrick, Pyle was \"the hardest part to cast in the whole movie\"; Kubrick, however, quickly responded to D'Onofrio and cast him in the part. D'Onofrio was required to gain 70 pounds (32 kg).\r\nLee Ermey as Gunnery Sergeant Hartman, a harsh, foul-mouthed and ruthless senior drill instructor. Ermey used his actual experience as a U.S. Marine drill instructor in the Vietnam War to ad lib much of his dialogue.\r\nAdam Baldwin as Sergeant \"Animal Mother\", a combat-hungry machine gunner who takes pride in killing enemy soldiers. Arnold Schwarzenegger was first considered for the role but turned it down in favor of a part in The Running Man.\r\nArliss Howard as Private/Sergeant \"Cowboy\" Evans, a friend of Joker and a member of the Lusthog Squad.\r\nKevyn Major Howard as Private First Class \"Rafterman\", a combat photographer.\r\nDorian Harewood as Corporal \"Eightball\", a member of the squad and Animal Mother's friend.\r\nTim Colceri as Doorgunner, a ruthless and sadistic helicopter door gunner who suggests Joker and Rafterman write a story about him. Colceri, a former Marine, was originally slated to play Hartman, a role that went to Ermey. Kubrick gave Colceri this smaller part as a consolation.\r\nEd O'Ross as First Lieutenant Walter J. \"Touchdown\" Schinoski, the first platoon leader of the Lusthog Squad.\r\nJohn Terry as First Lieutenant Lockhart, the editor of Stars and Stripes.\r\nBruce Boa as a POG Colonel who dresses down Joker for wearing a peace symbol on his lapel.\r\nProduction\r\nDevelopment\r\nIn early 1980, Kubrick contacted Michael Herr, author of the Vietnam War memoir Dispatches (1977), to discuss work on a film about the Holocaust but Kubrick discarded that idea in favor of a film about the Vietnam War. Herr and Kubrick met in England; Kubrick told Herr he wanted to make a war film but had yet to find a story to adapt. Kubrick discovered Gustav Hasford's novel The Short-Timers (1979) while reading the Kirkus Review. Herr received the novel in bound galleys and thought it a masterpiece. In 1982, Kubrick read the novel twice; he concluded it is \"a unique, absolutely wonderful book\" and decided to adapt it for his next film. According to Kubrick, he was drawn to the book's dialogue, which he found \"almost poetic in its carved-out, stark quality\". In 1983, Kubrick began researching for the film; he watched archival footage and documentaries, read Vietnamese newspapers on microfilm from the Library of Congress, and studied hundreds of photographs from the era. Initially, Herr was not interested in revisiting his Vietnam War experiences, and Kubrick spent three years persuading him to participate, describing the discussions as \"a single phone call lasting three years, with interruptions\".\r\nIn 1985, Kubrick contacted Hasford and invited him to join the team; he talked to Hasford by telephone three to four times a week for hours at a time. Kubrick had already written a detailed treatment of the novel, and Kubrick and Herr met at Kubrick's home every day, breaking the treatment into scenes. Herr then wrote the first draft of the film script. Kubrick worried the audience might misread the book's title as a reference to people who did only half a day's work and changed it to Full Metal Jacket after coming across the phrase in a gun catalogue. After the first draft was complete, Kubrick telephoned his orders to Hasford and Herr, who mailed their submissions to him. Kubrick read and edited Hasford's and Herr's submissions, and the team repeated the process. Neither Hasford nor Herr knew how much each had contributed to the screenplay, which led to a dispute over the final credits. Hasford said, \"We were like guys on an assembly line in the car factory. I was putting on one widget and Michael was putting on another widget and Stanley was the only one who knew that this was going to end up being a car\". Herr said Kubrick was not interested in making an anti-war film but \"he wanted to show what war is like\".\r\nAt some point, Kubrick wanted to meet Hasford in person, but Herr advised against this, describing The Short-Timers author as a \"scary man, a big, haunted marine\", and did not believe Hasford and Kubrick would \"get on\". Kubrick, however, insisted on the meeting, which occurred at Kubrick's house in England. The meeting went poorly, and Hasford did not meet with Kubrick again.\r\nCasting\r\nThrough Warner Bros., Kubrick advertised a casting search in the United States and Canada; he used videotape to audition actors and received over 3,000 submissions. Kubrick's staff screened the tapes, leaving 800 of them for him to review.: 461\r\nFormer U.S. Marine drill instructor Ermey was originally hired as a technical advisor. Ermey asked Kubrick if he could audition for the role of Hartman. Kubrick, who had seen Ermey's portrayal of drill instructor Staff Sergeant Loyce in The Boys in Company C (1978), told Ermey he was not vicious enough to play the character. Ermey improvised insulting dialogue against a group of Royal Marines who were being considered for the part of background Marines, to demonstrate his ability to play the character and to show how a drill instructor breaks down individuality in new recruits.: 462 Upon viewing the videotape of these sessions, Kubrick gave Ermey the role, realizing he \"was a genius for this part\". Kubrick incorporated the 250-page transcript of Ermey's rants into the script.: 462–463 Ermey's experience as a drill instructor during the Vietnam War proved invaluable; Kubrick estimated Ermey wrote 50% of his character's dialogue, particularly the insults.\r\nWhile Ermey practiced his lines in a rehearsal room, Kubrick's assistant Leon Vitali would throw tennis balls and oranges at him, which Ermey had to catch and throw back as quickly as possible while saying his lines as fast as he could. Any hesitation, slip, or missed line would necessitate starting over. Twenty error-free runs were required. \" was my drill instructor\", Ermey said of Vitali.: 463\r\nEight months of negotiations to cast Anthony Michael Hall as Private Joker were unsuccessful. Val Kilmer was also considered for the role, and Bruce Willis turned down a role due to filming commitments of his television series Moonlighting. Kubrick called Ed Harris on the phone to offer him the role of Gunnery Sergeant Hartman, but Harris declined it, a decision which he later called \"foolish\". Bill McKinney was also considered for that role. Denzel Washington wanted to be in the film, but Kubrick did not send him a script.\r\nFilming\r\nKubrick filmed Full Metal Jacket in England in 1985 and 1986. Scenes were filmed in Cambridgeshire, the Norfolk Broads, in eastern London at Millennium Mills and Beckton Gas Works in Newham, and in the Isle of Dogs. Bassingbourn Barracks, a former Royal Air Force station and then British Army base, was used as the Parris Island Marine boot camp. A British Army rifle range near Barton, Cambridge, was used for the scene in which Hartman congratulates Private Pyle for his shooting skills. Kubrick worked from still photographs of Huế taken in 1968; he found an area owned by British Gas that closely resembled it and was scheduled to be demolished. The disused Beckton Gas Works, a few miles from central London, was filmed to depict Huế after attacks. Kubrick had buildings blown up, and the film's art director used a wrecking ball to knock specific holes in some buildings for two months. Kubrick had a plastic replica jungle flown in from California but once he saw it dismissed the idea, saying; \"I don't like it. Get rid of it.\" The open country scenes were filmed at marshland in Cliffe-at-Hoo and along the River Thames; locations were supplemented with 200 imported Spanish palm trees and 100,000 plastic tropical plants from Hong Kong.\r\nKubrick acquired four M41 tanks from a Belgian army colonel who was an admirer. Westland Wessex helicopters, which have a much longer and less-rounded nose than that of the Vietnam era H-34, were painted Marine green to represent Marine Corps Sikorsky H-34 Choctaw helicopters. Kubrick obtained a selection of rifles, M79 grenade launchers, and M60 machine guns from a licensed weapons dealer.\r\nModine described the filming as difficult; Beckton Gas Works was a toxic environment for the film crew, being contaminated with asbestos and hundreds of other chemicals. During the boot camp sequence of the film, Modine and the other recruits underwent Marine Corps training, during which Ermey yelled at them for 10 hours a day while filming the Parris Island scenes. To ensure the actors' reactions to Ermey's lines were as authentic and fresh as possible, Ermey and the recruits did not rehearse together.: 468 For film continuity, each recruit had his head shaved once a week.\r\nWhile filming, Ermey had a car accident and broke several ribs, making him unavailable for four and a half months. During Cowboy's death scene, a building that resembles the alien monolith in Kubrick's 2001: A Space Odyssey (1968) is visible, which Kubrick described as an \"extraordinary accident\".\r\nDuring filming, Hasford contemplated taking legal action over the writing credits. Originally, the filmmakers intended Hasford to receive an \"additional dialogue\" credit but he fought for and eventually received full credit. Hasford and two friends visited the set dressed as extras but was mistaken by a crew member for Herr. Hasford identified himself as the writer upon whose work the film is based.\r\nKubrick's daughter Vivian, who appears uncredited as a news camera operator, shadowed the filming of Full Metal Jacket. She filmed 18 hours of behind-the-scenes footage for a potential \"making-of\" documentary that went unmade. Sections of her work can be seen in the documentary Stanley Kubrick's Boxes (2008).\r\nThemes\r\nMichael Pursell's essay \"Full Metal Jacket: The Unravelling of Patriarchy\" (1988) was an early, in-depth consideration of the film's two-part structure and its criticism of masculinity, saying the film shows \"war and pornography as facets of the same system\".\r\nMost reviews have focused on military brainwashing themes in the boot camp section of the film while seeing the content in the film's latter half as more confusing and disjointed. Rita Kempley of The Washington Post wrote, \"it's as if they borrowed bits of every war movie to make this eclectic finale\". Roger Ebert saw in the film an attempt to tell a story of individual characters and the war's effects on them. According to Ebert, the result is a shapeless film that feels \"more like a book of short stories than a novel\". Julian Rice, in his book Kubrick's Hope (2008), saw the second part of the film as a continuation of Joker's psychic journey in his attempt to understand human evil.\r\nTony Lucia, in his 1987 review of Full Metal Jacket for the Reading Eagle, examined the themes of Kubrick's career, suggesting \"the unifying element may be the ordinary man dwarfed by situations too vast and imposing to handle\". Lucia refers to the \"military mentality\" in this film and also said the theme covers \"a man testing himself against his own limitations\", and concluded: \"Full Metal Jacket is the latest chapter in an ongoing movie which is not merely a comment on our time or a time past, but on something that reaches beyond\".\r\nBritish critic Gilbert Adair wrote, \"Kubrick's approach to language has always been reductive and uncompromisingly deterministic in nature. He appears to view it as the exclusive product of environmental conditioning, only very marginally influenced by concepts of subjectivity and interiority, by all the whims, shades and modulations of personal expression\".\r\nMichael Herr wrote of his work on the screenplay, \"The substance was single-minded, the old and always serious problem of how you put into a film or a book the living, behaving presence of what Jung called The Shadow, the most accessible of archetypes, and the easiest to experience ... War is the ultimate field of Shadow-activity, where all of its other activities lead you. As they expressed it in Vietnam, 'Yea, though I walk through the Valley of the Shadow of Death, I will fear no Evil, for I am the Evil'.\"\r\nMusic\r\nKubrick's daughter Vivian, under the alias \"Abigail Mead\", wrote the film's score. According to an interview in the January 1988 issue of Keyboard, the film was scored mostly with a Series III edition Fairlight CMI synthesizer and a Synclavier. For the period music, Kubrick went through Billboard's list of Top 100 Hits for each year from 1962 to 1968 and tried many songs but found \"sometimes the dynamic range of the music was too great, and we couldn't work in dialogue\".\r\nJohnnie Wright – \"Hello Vietnam\"\r\nThe Dixie Cups – \"Chapel of Love\"\r\nSam the Sham & The Pharaohs – \"Wooly Bully\"\r\nChris Kenner – \"I Like It Like That\"\r\nNancy Sinatra – \"These Boots Are Made for Walkin'\"\r\nThe Trashmen – \"Surfin' Bird\"\r\nGoldman Band – \"Marines' Hymn\"\r\nThe Rolling Stones – \"Paint It Black\"\r\nA single titled \"Full Metal Jacket (I Wanna Be Your Drill Instructor)\", credited to Mead and Nigel Goulding, was released to promote the film and incorporates Ermey's drill cadences from the film. The single reached Number 1 in Ireland, Number 2 in the UK, Number 4 in both the Netherlands and the Flanders region of Belgium, Number 8 in West Germany, Number 11 in Sweden, and Number 29 in New Zealand.\r\nRelease\r\nBox office\r\nFull Metal Jacket received a limited release on June 26, 1987, in 215 theaters. During its opening weekend, it accrued $2.2 million, an average of $10,313 per theater, ranking it the number 10 film for the weekend June 26–28. It took a further $2 million for a total of $5.7 million before being widely released in 881 theaters on July 10, 1987. The weekend of July 10–12 saw the film gross $6.1 million, an average of $6,901 per theater, and rank as the second-highest-grossing film. Over the next four weeks the film opened in a further 194 theaters to its widest release of 1,075 theaters; it closed two weeks later with a total gross of $46.4 million, making it the twenty-third-highest-grossing film of 1987. As of 1998, the film had grossed $120 million worldwide.\r\nHome media\r\nFull Metal Jacket was released on Blu-ray on October 23, 2007. Warner Home Video released a 25th anniversary edition on Blu-ray on August 7, 2012.\r\nWarner released the film on 4K Ultra HD in the UK on September 21, 2020, and in the U.S. on the following day. Other regions were slated for an October release. The 4K UHD release uses a new HDR remastered native 2160p that was transferred from the original 35mm negative, which was supervised by Kubrick's personal assistant Leon Vitali. It contains the remixed audio and, for the first time since the original DVD release, the theatrical mono mix. The release was a critical success; publications praised its image and audio quality, calling the former exceptionally good and faithful to the original theatrical release, and Kubrick's vision while noting the lack of new extras and bonus content. A collector's edition box set of this 4K UHD version was released with different cover art, a replica theatrical poster of the film, a letter from director Stanley Kubrick, and a booklet about the film's production among other extras.\r\nCritical reception\r\nReview aggregator website Rotten Tomatoes retrospectively collected reviews to give the film a score of 90% based on reviews from 84 critics and an average rating of 8.30/10. The summary states; \"Intense, tightly constructed, and darkly comic at times, Stanley Kubrick's Full Metal Jacket may not boast the most original of themes, but it is exceedingly effective at communicating them\". Another aggregator, Metacritic, gave it a score of 76 out of 100 based on 19 reviews, which indicates a \"generally favorable\" response. Reviewers generally reacted favorably to the cast—Ermey in particular— and the film's first act about recruit training. Several reviews, however, were critical of the latter part of the film, which is set in Vietnam, and what was considered a \"muddled\" moral message in the finale.\r\nRichard Corliss of Time called the film a \"technical knockout\", praising \"the dialogue's wild, desperate wit; the daring in choosing a desultory skirmish to make a point about war's pointlessness\", and \"the fine, large performances of almost every actor\", saying Ermey and D'Onofrio would receive Oscar nominations. Corliss appreciated \"the Olympian elegance and precision of Kubrick's filmmaking\". Empire's Ian Nathan awarded the film three stars out of five, saying it is \"inconsistent\" and describing it as \"both powerful and frustratingly unengaged\". Nathan said after the opening act, which focuses on the recruit training, the film becomes \"bereft of purpose\"; nevertheless, he summarized his review by calling it a \"hardy Kubrickian effort that warms on you with repeated viewings\" and praised Ermey's \"staggering performance\". Vincent Canby of The New York Times called the film \"harrowing, beautiful and characteristically eccentric\". Canby echoed praise for Ermey, calling him \"the film's stunning surprise ... he's so good—so obsessed—that you might think he wrote his own lines\". Canby said D'Onofrio's performance should be admired and described Modine as \"one of the best, most adaptable young film actors of his generation\", and concluded Full Metal Jacket is \"a film of immense and very rare imagination\".\r\nJim Hall, writing for Film4 in 2010, awarded the film five stars out of five and added to the praise for Ermey, saying his \"performance as the foul-mouthed Hartman is justly celebrated and it's difficult to imagine the film working anything like as effectively without him\". The review preferred the opening training segment to the later Vietnam sequence, calling it \"far more striking than the second and longer section\". Hall commented the film ends abruptly but felt \"it demonstrates just how clear and precise the director's vision could be when he resisted a fatal tendency for indulgence\". Hall concluded; \"Full Metal Jacket ranks with Dr. Strangelove as one of Kubrick's very best\". Jonathan Rosenbaum of the Chicago Reader called it \"Elliptical, full of subtle inner rhymes ... and profoundly moving, this is the most tightly crafted Kubrick film since Dr. Strangelove, as well as the most horrific\". Variety called the film an \"intense, schematic, superbly made\" drama that is \"loaded with vivid, outrageously vulgar military vernacular that contributes heavily to the film's power\" but said it never develops \"a particularly strong narrative\". The cast performances were all labeled \"exceptional\"; Modine was singled out as \"embodying both what it takes to survive in the war and a certain omniscience\". Gilbert Adair, writing for Full Metal Jacket, commented; \"Kubrick's approach to language has always been of a reductive and uncompromisingly deterministic nature. He appears to view it as the exclusive product of environmental conditioning, only very marginally influenced by concepts of subjectivity and interiority, by all whims, shades and modulations of personal expression\".\r\nChicago Sun-Times critic Roger Ebert called Full Metal Jacket \"strangely shapeless\" and awarding it two and a half stars out of four. Ebert called it \"one of the best-looking war movies ever made on sets and stage\" but said this was not enough to compete with the \"awesome reality of Platoon, Apocalypse Now and The Deer Hunter\". Ebert criticized the film's Vietnam-set second act, saying the \"movie disintegrates into a series of self-contained set pieces, none of them quite satisfying\" and concluded the film's message is \"too little and too late\", having been done by other Vietnam War films. Ebert praised Ermey and D'Onofrio, saying \"these are the two best performances in the movie, which never recovers after they leave the scene\". Ebert's review angered Gene Siskel on their television show At The Movies; he criticized Ebert for liking Benji the Hunted more than Full Metal Jacket. Time Out London disliked the film, saying \"Kubrick's direction is as steely cold and manipulative as the régime it depicts\", and that the characters are underdeveloped, adding \"we never really get to know, let alone care about, the hapless recruits on view\".\r\nAudiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.\r\nBritish television channel Channel 4 voted Full Metal Jacket fifth on its list of the greatest war films ever made. In 2008, Empire placed the film at number 457 on its list of \"The 500 Greatest Movies of All Time\". In 2010, The Guardian ranked it 19th on its list of the \"25 best action and war films of all time\". The film is ranked 95 on the American Film Institute's 100 Years... 100 Thrills list, which was published in 2001.\r\nAccolades\r\nBetween 1987 and 1989, Full Metal Jacket was nominated for 11 awards, including an Academy Award for Best Adapted Screenplay, two BAFTA Awards for Best Sound and Best Special Effects, and a Golden Globe for Best Supporting Actor for Ermey. It won five awards, including three from overseas; Best Foreign Language Film from the Japanese Academy, Best Producer from the Academy of Italian Cinema, Director of the Year at the London Critics Circle Film Awards, and Best Director and Best Supporting Actor at the Boston Society of Film Critics Awards for Kubrick and Ermey respectively. Of the five awards it won, four were awarded to Kubrick and the other was given to Ermey.\r\nDifferences between novel and screenplay\r\nFilm scholar Greg Jenkins has analyzed the adaptation of the novel as a screenplay. The novel is in three parts and the film greatly expands the relatively brief first section about the boot camp on Parris Island and essentially discards Part III. This gives the film a twofold structure, telling two largely independent stories that are connected by the same characters. Jenkins said this structure is a development of concepts Kubrick originally discussed in the 1960s, when he talked about wanting to explode the usual conventions of narrative structure.\r\nSergeant Hartman, who is renamed from the book's Gerheim, has an expanded role in the film. Private Pyle's incompetence is presented as weighing negatively on the rest of the platoon; unlike those in the novel, he is the only under-performing recruit. The film omits Hartman's disclosure he thinks Pyle might be mentally unstable—a \"Section 8\"—to the other troops; instead, Joker questions Pyle's mental state. In contrast, Hartman praises Pyle, saying he is \"born again hard\". Jenkins says that portraying Hartman as having a warmer social relationship with the troops would have upset the balance of the film, which depends on the spectacle of ordinary soldiers coming to grips with Hartman as a force of nature who embodies a killer culture.\r\nSome scenes in the book were removed from the screenplay or conflated with others. For example, Cowboy's introduction of the \"Lusthog Squad\" was markedly shortened and supplemented with material from other sections of the book. Although the book's third section was largely omitted, elements from it were inserted into other parts of the film. For instance, the climactic episode with the sniper is a conflation of two sections of Parts II and III of the book. According to Jenkins, the film presents this passage more dramatically but in less gruesome detail than the novel.\r\nThe film often has a more tragic tone than the book, which relies on callous humor. In the film, Joker remains a model of humane thinking, as evidenced by his moral struggle in the sniper scene and elsewhere. Joker works to overcome his own meekness rather than compete with other Marines. The film omits Joker's eventual domination over Animal Mother shown in the book.\r\nThe film also omits Rafterman's death; according to Jenkins, this allows viewers to reflect on Rafterman's personal growth and speculate on his future growth after the war.\r\nIn popular culture\r\nThe line \"Me so horny. Me love you long time\", which is uttered by the Da Nang street prostitute to Joker, became a catchphrase in popular culture and was sampled by rap artists 2 Live Crew in their 1989 hit \"Me So Horny\" and by Sir Mix-A-Lot in \"Baby Got Back\" (1992).",
    "html": "<p>Full Metal Jacket is a 1987 war drama film directed and produced by Stanley Kubrick, who also co-wrote the screenplay with Michael Herr and Gustav Hasford. The film is based on Hasford's 1979 novel The Short-Timers and stars Matthew Modine, Lee Ermey, Vincent D'Onofrio and Adam Baldwin.</p><p>The storyline follows a platoon of U.S. Marines through their boot camp training in Marine Corps Recruit Depot Parris Island, South Carolina, primarily focusing in the first half of the film on privates J.T. Davis and Leonard Lawrence, nicknamed \"Joker\" and \"Pyle,\" who struggle under their abusive drill instructor Gunnery Sergeant Hartman. The second half portrays the experiences of Joker and one other of the platoon's Marines in Vietnamese cities Da Nang and Huế during the Tet Offensive of the Vietnam War. The film's title refers to the full metal jacket bullet used by military servicemen.</p><p>Warner Bros. released Full Metal Jacket in the United States on June 26, 1987. It was the last of Kubrick's films to be released during his lifetime. The film received critical acclaim, grossed $120 million against a budget of $16 million, and was nominated for an Academy Award for Best Adapted Screenplay for Kubrick, Herr, and Hasford. In 2001, the American Film Institute placed the film at number 95 in its poll titled \"AFI's 100 Years...100 Thrills\".</p><br/><h3>Plot</h3><p>During the Vietnam War, a group of recruits arrive at the United States Marine Corps training facility at Parris Island. Drill instructor Gunnery Sergeant Hartman uses harsh methods to train them for combat. Among the recruits is the overweight and dim-witted Leonard Lawrence, whom Hartman nicknames \"Gomer Pyle\", and the wisecracking J.T. Davis, who receives the name \"Joker\" after interrupting Hartman's introductory speech with an impression of John Wayne.</p><p>During basic training, Hartman names Joker as squad leader and puts him in charge of helping Pyle improve. One day, Hartman discovers a jelly doughnut in Pyle's footlocker, blames the platoon for Pyle's infractions, and adopts a collective punishment policy in which any infraction committed by Pyle will earn a punishment for everyone else in the platoon. One night, the recruits haze Pyle with a blanket party, in which Joker reluctantly participates. Following this, Pyle appears to reinvent himself as a model recruit, showing particular expertise in marksmanship. This pleases Hartman but worries Joker, who believes Pyle may be suffering a mental breakdown after seeing Pyle talking to his rifle. After the recruits graduate and the night before they leave Parris Island, Joker discovers Pyle in the bathroom, loading his service rifle with live ammunition, executing drill commands, and loudly reciting the Rifleman's Creed. Hartman attempts to intervene, but Pyle shoots and kills him and then commits suicide.</p><p>By January 1968, Joker is a sergeant and is based in Da Nang for the newspaper Stars and Stripes alongside his colleague Private First Class Rafterman, a combat photographer. The Tet Offensive begins and Joker's base is attacked, but holds. The following morning, Joker and Rafterman are sent to Phu Bai where Joker searches for and reunites with Sergeant \"Cowboy\", a friend he met at Parris Island. During the Battle of Huế, a booby trap kills the squad leader, leaving Cowboy in command. Becoming lost in the city, the squad is ambushed by a Viet Cong sniper who kills two members. As the squad moves in on the sniper's location, Cowboy is killed.</p><p>Assuming command, squad machine gunner \"Animal Mother\" leads an attack on the sniper. Joker locates her first, but his M-16 rifle jams, alerting the sniper to his presence. As the sniper opens fire, she is revealed to be a teenage girl. Rafterman shoots her, wounding her mortally. As the squad converges on the sniper, she begs for death, leading to an argument over whether or not to kill her. Animal Mother agrees to a mercy killing but only if Joker does it; Joker shoots her after some hesitance. Later, as night falls, the Marines return to camp singing the \"Mickey Mouse March\". A narration of Joker's thoughts conveys that, despite being \"in a world of shit\", he is glad to be alive and no longer afraid.</p><br/><h3>Cast</h3><ul><li>Matthew Modine as Private/Sergeant J. T. \"Joker\" Davis, a wise-cracking young Marine. On set, Modine kept a diary that in 2005 was adapted into a book and in 2013 into an interactive app.</li><li>Vincent D'Onofrio as Private Leonard \"Gomer Pyle\" Lawrence, an overweight, slow-minded recruit who is the subject of Hartman's mockery. D'Onofrio heard from Modine of the auditions for the film. D'Onofrio recorded his audition using a rented video camera and was dressed in army fatigues. According to Kubrick, Pyle was \"the hardest part to cast in the whole movie\"; Kubrick, however, quickly responded to D'Onofrio and cast him in the part. D'Onofrio was required to gain 70 pounds (32 kg).</li><li>Lee Ermey as Gunnery Sergeant Hartman, a harsh, foul-mouthed and ruthless senior drill instructor. Ermey used his actual experience as a U.S. Marine drill instructor in the Vietnam War to ad lib much of his dialogue.</li><li>Adam Baldwin as Sergeant \"Animal Mother\", a combat-hungry machine gunner who takes pride in killing enemy soldiers. Arnold Schwarzenegger was first considered for the role but turned it down in favor of a part in The Running Man.</li><li>Arliss Howard as Private/Sergeant \"Cowboy\" Evans, a friend of Joker and a member of the Lusthog Squad.</li><li>Kevyn Major Howard as Private First Class \"Rafterman\", a combat photographer.</li><li>Dorian Harewood as Corporal \"Eightball\", a member of the squad and Animal Mother's friend.</li><li>Tim Colceri as Doorgunner, a ruthless and sadistic helicopter door gunner who suggests Joker and Rafterman write a story about him. Colceri, a former Marine, was originally slated to play Hartman, a role that went to Ermey. Kubrick gave Colceri this smaller part as a consolation.</li><li>Ed O'Ross as First Lieutenant Walter J. \"Touchdown\" Schinoski, the first platoon leader of the Lusthog Squad.</li><li>John Terry as First Lieutenant Lockhart, the editor of Stars and Stripes.</li><li>Bruce Boa as a POG Colonel who dresses down Joker for wearing a peace symbol on his lapel.</li></ul><br/><h3>Production</h3><h4>Development</h4><p>In early 1980, Kubrick contacted Michael Herr, author of the Vietnam War memoir Dispatches (1977), to discuss work on a film about the Holocaust but Kubrick discarded that idea in favor of a film about the Vietnam War. Herr and Kubrick met in England; Kubrick told Herr he wanted to make a war film but had yet to find a story to adapt. Kubrick discovered Gustav Hasford's novel The Short-Timers (1979) while reading the Kirkus Review. Herr received the novel in bound galleys and thought it a masterpiece. In 1982, Kubrick read the novel twice; he concluded it is \"a unique, absolutely wonderful book\" and decided to adapt it for his next film. According to Kubrick, he was drawn to the book's dialogue, which he found \"almost poetic in its carved-out, stark quality\". In 1983, Kubrick began researching for the film; he watched archival footage and documentaries, read Vietnamese newspapers on microfilm from the Library of Congress, and studied hundreds of photographs from the era. Initially, Herr was not interested in revisiting his Vietnam War experiences, and Kubrick spent three years persuading him to participate, describing the discussions as \"a single phone call lasting three years, with interruptions\".</p><p>In 1985, Kubrick contacted Hasford and invited him to join the team; he talked to Hasford by telephone three to four times a week for hours at a time. Kubrick had already written a detailed treatment of the novel, and Kubrick and Herr met at Kubrick's home every day, breaking the treatment into scenes. Herr then wrote the first draft of the film script. Kubrick worried the audience might misread the book's title as a reference to people who did only half a day's work and changed it to Full Metal Jacket after coming across the phrase in a gun catalogue. After the first draft was complete, Kubrick telephoned his orders to Hasford and Herr, who mailed their submissions to him. Kubrick read and edited Hasford's and Herr's submissions, and the team repeated the process. Neither Hasford nor Herr knew how much each had contributed to the screenplay, which led to a dispute over the final credits. Hasford said, \"We were like guys on an assembly line in the car factory. I was putting on one widget and Michael was putting on another widget and Stanley was the only one who knew that this was going to end up being a car\". Herr said Kubrick was not interested in making an anti-war film but \"he wanted to show what war is like\".</p><p>At some point, Kubrick wanted to meet Hasford in person, but Herr advised against this, describing The Short-Timers author as a \"scary man, a big, haunted marine\", and did not believe Hasford and Kubrick would \"get on\". Kubrick, however, insisted on the meeting, which occurred at Kubrick's house in England. The meeting went poorly, and Hasford did not meet with Kubrick again.</p><h4>Casting</h4><p>Through Warner Bros., Kubrick advertised a casting search in the United States and Canada; he used videotape to audition actors and received over 3,000 submissions. Kubrick's staff screened the tapes, leaving 800 of them for him to review.: 461</p><p>Former U.S. Marine drill instructor Ermey was originally hired as a technical advisor. Ermey asked Kubrick if he could audition for the role of Hartman. Kubrick, who had seen Ermey's portrayal of drill instructor Staff Sergeant Loyce in The Boys in Company C (1978), told Ermey he was not vicious enough to play the character. Ermey improvised insulting dialogue against a group of Royal Marines who were being considered for the part of background Marines, to demonstrate his ability to play the character and to show how a drill instructor breaks down individuality in new recruits.: 462 Upon viewing the videotape of these sessions, Kubrick gave Ermey the role, realizing he \"was a genius for this part\". Kubrick incorporated the 250-page transcript of Ermey's rants into the script.: 462–463 Ermey's experience as a drill instructor during the Vietnam War proved invaluable; Kubrick estimated Ermey wrote 50% of his character's dialogue, particularly the insults.</p><p>While Ermey practiced his lines in a rehearsal room, Kubrick's assistant Leon Vitali would throw tennis balls and oranges at him, which Ermey had to catch and throw back as quickly as possible while saying his lines as fast as he could. Any hesitation, slip, or missed line would necessitate starting over. Twenty error-free runs were required. \" was my drill instructor\", Ermey said of Vitali.: 463</p><p>Eight months of negotiations to cast Anthony Michael Hall as Private Joker were unsuccessful. Val Kilmer was also considered for the role, and Bruce Willis turned down a role due to filming commitments of his television series Moonlighting. Kubrick called Ed Harris on the phone to offer him the role of Gunnery Sergeant Hartman, but Harris declined it, a decision which he later called \"foolish\". Bill McKinney was also considered for that role. Denzel Washington wanted to be in the film, but Kubrick did not send him a script.</p><h4>Filming</h4><p>Kubrick filmed Full Metal Jacket in England in 1985 and 1986. Scenes were filmed in Cambridgeshire, the Norfolk Broads, in eastern London at Millennium Mills and Beckton Gas Works in Newham, and in the Isle of Dogs. Bassingbourn Barracks, a former Royal Air Force station and then British Army base, was used as the Parris Island Marine boot camp. A British Army rifle range near Barton, Cambridge, was used for the scene in which Hartman congratulates Private Pyle for his shooting skills. Kubrick worked from still photographs of Huế taken in 1968; he found an area owned by British Gas that closely resembled it and was scheduled to be demolished. The disused Beckton Gas Works, a few miles from central London, was filmed to depict Huế after attacks. Kubrick had buildings blown up, and the film's art director used a wrecking ball to knock specific holes in some buildings for two months. Kubrick had a plastic replica jungle flown in from California but once he saw it dismissed the idea, saying; \"I don't like it. Get rid of it.\" The open country scenes were filmed at marshland in Cliffe-at-Hoo and along the River Thames; locations were supplemented with 200 imported Spanish palm trees and 100,000 plastic tropical plants from Hong Kong.</p><p>Kubrick acquired four M41 tanks from a Belgian army colonel who was an admirer. Westland Wessex helicopters, which have a much longer and less-rounded nose than that of the Vietnam era H-34, were painted Marine green to represent Marine Corps Sikorsky H-34 Choctaw helicopters. Kubrick obtained a selection of rifles, M79 grenade launchers, and M60 machine guns from a licensed weapons dealer.</p><p>Modine described the filming as difficult; Beckton Gas Works was a toxic environment for the film crew, being contaminated with asbestos and hundreds of other chemicals. During the boot camp sequence of the film, Modine and the other recruits underwent Marine Corps training, during which Ermey yelled at them for 10 hours a day while filming the Parris Island scenes. To ensure the actors' reactions to Ermey's lines were as authentic and fresh as possible, Ermey and the recruits did not rehearse together.: 468 For film continuity, each recruit had his head shaved once a week.</p><p>While filming, Ermey had a car accident and broke several ribs, making him unavailable for four and a half months. During Cowboy's death scene, a building that resembles the alien monolith in Kubrick's 2001: A Space Odyssey (1968) is visible, which Kubrick described as an \"extraordinary accident\".</p><p>During filming, Hasford contemplated taking legal action over the writing credits. Originally, the filmmakers intended Hasford to receive an \"additional dialogue\" credit but he fought for and eventually received full credit. Hasford and two friends visited the set dressed as extras but was mistaken by a crew member for Herr. Hasford identified himself as the writer upon whose work the film is based.</p><p>Kubrick's daughter Vivian, who appears uncredited as a news camera operator, shadowed the filming of Full Metal Jacket. She filmed 18 hours of behind-the-scenes footage for a potential \"making-of\" documentary that went unmade. Sections of her work can be seen in the documentary Stanley Kubrick's Boxes (2008).</p><br/><h3>Themes</h3><p>Michael Pursell's essay \"Full Metal Jacket: The Unravelling of Patriarchy\" (1988) was an early, in-depth consideration of the film's two-part structure and its criticism of masculinity, saying the film shows \"war and pornography as facets of the same system\".</p><p>Most reviews have focused on military brainwashing themes in the boot camp section of the film while seeing the content in the film's latter half as more confusing and disjointed. Rita Kempley of The Washington Post wrote, \"it's as if they borrowed bits of every war movie to make this eclectic finale\". Roger Ebert saw in the film an attempt to tell a story of individual characters and the war's effects on them. According to Ebert, the result is a shapeless film that feels \"more like a book of short stories than a novel\". Julian Rice, in his book Kubrick's Hope (2008), saw the second part of the film as a continuation of Joker's psychic journey in his attempt to understand human evil.</p><p>Tony Lucia, in his 1987 review of Full Metal Jacket for the Reading Eagle, examined the themes of Kubrick's career, suggesting \"the unifying element may be the ordinary man dwarfed by situations too vast and imposing to handle\". Lucia refers to the \"military mentality\" in this film and also said the theme covers \"a man testing himself against his own limitations\", and concluded: \"Full Metal Jacket is the latest chapter in an ongoing movie which is not merely a comment on our time or a time past, but on something that reaches beyond\".</p><p>British critic Gilbert Adair wrote, \"Kubrick's approach to language has always been reductive and uncompromisingly deterministic in nature. He appears to view it as the exclusive product of environmental conditioning, only very marginally influenced by concepts of subjectivity and interiority, by all the whims, shades and modulations of personal expression\".</p><p>Michael Herr wrote of his work on the screenplay, \"The substance was single-minded, the old and always serious problem of how you put into a film or a book the living, behaving presence of what Jung called The Shadow, the most accessible of archetypes, and the easiest to experience ... War is the ultimate field of Shadow-activity, where all of its other activities lead you. As they expressed it in Vietnam, 'Yea, though I walk through the Valley of the Shadow of Death, I will fear no Evil, for I am the Evil'.\"</p><br/><h3>Music</h3><p>Kubrick's daughter Vivian, under the alias \"Abigail Mead\", wrote the film's score. According to an interview in the January 1988 issue of Keyboard, the film was scored mostly with a Series III edition Fairlight CMI synthesizer and a Synclavier. For the period music, Kubrick went through Billboard's list of Top 100 Hits for each year from 1962 to 1968 and tried many songs but found \"sometimes the dynamic range of the music was too great, and we couldn't work in dialogue\".</p><ul><li>Johnnie Wright – \"Hello Vietnam\"</li><li>The Dixie Cups – \"Chapel of Love\"</li><li>Sam the Sham & The Pharaohs – \"Wooly Bully\"</li><li>Chris Kenner – \"I Like It Like That\"</li><li>Nancy Sinatra – \"These Boots Are Made for Walkin'\"</li><li>The Trashmen – \"Surfin' Bird\"</li><li>Goldman Band – \"Marines' Hymn\"</li><li>The Rolling Stones – \"Paint It Black\"</li></ul><p>A single titled \"Full Metal Jacket (I Wanna Be Your Drill Instructor)\", credited to Mead and Nigel Goulding, was released to promote the film and incorporates Ermey's drill cadences from the film. The single reached Number 1 in Ireland, Number 2 in the UK, Number 4 in both the Netherlands and the Flanders region of Belgium, Number 8 in West Germany, Number 11 in Sweden, and Number 29 in New Zealand.</p><br/><h3>Release</h3><h4>Box office</h4><p>Full Metal Jacket received a limited release on June 26, 1987, in 215 theaters. During its opening weekend, it accrued $2.2 million, an average of $10,313 per theater, ranking it the number 10 film for the weekend June 26–28. It took a further $2 million for a total of $5.7 million before being widely released in 881 theaters on July 10, 1987. The weekend of July 10–12 saw the film gross $6.1 million, an average of $6,901 per theater, and rank as the second-highest-grossing film. Over the next four weeks the film opened in a further 194 theaters to its widest release of 1,075 theaters; it closed two weeks later with a total gross of $46.4 million, making it the twenty-third-highest-grossing film of 1987. As of 1998, the film had grossed $120 million worldwide.</p><h4>Home media</h4><p>Full Metal Jacket was released on Blu-ray on October 23, 2007. Warner Home Video released a 25th anniversary edition on Blu-ray on August 7, 2012.</p><p>Warner released the film on 4K Ultra HD in the UK on September 21, 2020, and in the U.S. on the following day. Other regions were slated for an October release. The 4K UHD release uses a new HDR remastered native 2160p that was transferred from the original 35mm negative, which was supervised by Kubrick's personal assistant Leon Vitali. It contains the remixed audio and, for the first time since the original DVD release, the theatrical mono mix. The release was a critical success; publications praised its image and audio quality, calling the former exceptionally good and faithful to the original theatrical release, and Kubrick's vision while noting the lack of new extras and bonus content. A collector's edition box set of this 4K UHD version was released with different cover art, a replica theatrical poster of the film, a letter from director Stanley Kubrick, and a booklet about the film's production among other extras.</p><br/><h3>Critical reception</h3><p>Review aggregator website Rotten Tomatoes retrospectively collected reviews to give the film a score of 90% based on reviews from 84 critics and an average rating of 8.30/10. The summary states; \"Intense, tightly constructed, and darkly comic at times, Stanley Kubrick's Full Metal Jacket may not boast the most original of themes, but it is exceedingly effective at communicating them\". Another aggregator, Metacritic, gave it a score of 76 out of 100 based on 19 reviews, which indicates a \"generally favorable\" response. Reviewers generally reacted favorably to the cast—Ermey in particular— and the film's first act about recruit training. Several reviews, however, were critical of the latter part of the film, which is set in Vietnam, and what was considered a \"muddled\" moral message in the finale.</p><p>Richard Corliss of Time called the film a \"technical knockout\", praising \"the dialogue's wild, desperate wit; the daring in choosing a desultory skirmish to make a point about war's pointlessness\", and \"the fine, large performances of almost every actor\", saying Ermey and D'Onofrio would receive Oscar nominations. Corliss appreciated \"the Olympian elegance and precision of Kubrick's filmmaking\". Empire's Ian Nathan awarded the film three stars out of five, saying it is \"inconsistent\" and describing it as \"both powerful and frustratingly unengaged\". Nathan said after the opening act, which focuses on the recruit training, the film becomes \"bereft of purpose\"; nevertheless, he summarized his review by calling it a \"hardy Kubrickian effort that warms on you with repeated viewings\" and praised Ermey's \"staggering performance\". Vincent Canby of The New York Times called the film \"harrowing, beautiful and characteristically eccentric\". Canby echoed praise for Ermey, calling him \"the film's stunning surprise ... he's so good—so obsessed—that you might think he wrote his own lines\". Canby said D'Onofrio's performance should be admired and described Modine as \"one of the best, most adaptable young film actors of his generation\", and concluded Full Metal Jacket is \"a film of immense and very rare imagination\".</p><p>Jim Hall, writing for Film4 in 2010, awarded the film five stars out of five and added to the praise for Ermey, saying his \"performance as the foul-mouthed Hartman is justly celebrated and it's difficult to imagine the film working anything like as effectively without him\". The review preferred the opening training segment to the later Vietnam sequence, calling it \"far more striking than the second and longer section\". Hall commented the film ends abruptly but felt \"it demonstrates just how clear and precise the director's vision could be when he resisted a fatal tendency for indulgence\". Hall concluded; \"Full Metal Jacket ranks with Dr. Strangelove as one of Kubrick's very best\". Jonathan Rosenbaum of the Chicago Reader called it \"Elliptical, full of subtle inner rhymes ... and profoundly moving, this is the most tightly crafted Kubrick film since Dr. Strangelove, as well as the most horrific\". Variety called the film an \"intense, schematic, superbly made\" drama that is \"loaded with vivid, outrageously vulgar military vernacular that contributes heavily to the film's power\" but said it never develops \"a particularly strong narrative\". The cast performances were all labeled \"exceptional\"; Modine was singled out as \"embodying both what it takes to survive in the war and a certain omniscience\". Gilbert Adair, writing for Full Metal Jacket, commented; \"Kubrick's approach to language has always been of a reductive and uncompromisingly deterministic nature. He appears to view it as the exclusive product of environmental conditioning, only very marginally influenced by concepts of subjectivity and interiority, by all whims, shades and modulations of personal expression\".</p><p>Chicago Sun-Times critic Roger Ebert called Full Metal Jacket \"strangely shapeless\" and awarding it two and a half stars out of four. Ebert called it \"one of the best-looking war movies ever made on sets and stage\" but said this was not enough to compete with the \"awesome reality of Platoon, Apocalypse Now and The Deer Hunter\". Ebert criticized the film's Vietnam-set second act, saying the \"movie disintegrates into a series of self-contained set pieces, none of them quite satisfying\" and concluded the film's message is \"too little and too late\", having been done by other Vietnam War films. Ebert praised Ermey and D'Onofrio, saying \"these are the two best performances in the movie, which never recovers after they leave the scene\". Ebert's review angered Gene Siskel on their television show At The Movies; he criticized Ebert for liking Benji the Hunted more than Full Metal Jacket. Time Out London disliked the film, saying \"Kubrick's direction is as steely cold and manipulative as the régime it depicts\", and that the characters are underdeveloped, adding \"we never really get to know, let alone care about, the hapless recruits on view\".</p><p>Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.</p><p>British television channel Channel 4 voted Full Metal Jacket fifth on its list of the greatest war films ever made. In 2008, Empire placed the film at number 457 on its list of \"The 500 Greatest Movies of All Time\". In 2010, The Guardian ranked it 19th on its list of the \"25 best action and war films of all time\". The film is ranked 95 on the American Film Institute's 100 Years... 100 Thrills list, which was published in 2001.</p><h4>Accolades</h4><p>Between 1987 and 1989, Full Metal Jacket was nominated for 11 awards, including an Academy Award for Best Adapted Screenplay, two BAFTA Awards for Best Sound and Best Special Effects, and a Golden Globe for Best Supporting Actor for Ermey. It won five awards, including three from overseas; Best Foreign Language Film from the Japanese Academy, Best Producer from the Academy of Italian Cinema, Director of the Year at the London Critics Circle Film Awards, and Best Director and Best Supporting Actor at the Boston Society of Film Critics Awards for Kubrick and Ermey respectively. Of the five awards it won, four were awarded to Kubrick and the other was given to Ermey.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"2\">1987</td><td rowspan=\"2\"><span class=\"mw-redirect\">BAFTA Awards</span></td><td><span>Best Sound</span></td><td>Nigel Galt, Edward Tise and <span>Andy Nelson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Best Special Effects</span></td><td><span>John Evans</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"7\">1988</td><td rowspan=\"1\"><span>60th Academy Awards</span></td><td><span>Best Adapted Screenplay</span></td><td>Stanley Kubrick, Michael Herr and Gustav Hasford</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Boston Society of Film Critics Awards</span></td><td><span>Best Director</span></td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Supporting Actor</span></td><td>R. Lee Ermey</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">David di Donatello Awards</span></td><td><span>Best Producer</span> – Foreign film</td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">Golden Globes</span></td><td><span>Best Performance by an Actor in a Supporting Role in a Motion Picture</span></td><td>R. Lee Ermey</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">London Critics Circle Film Awards</span></td><td>Director of the Year</td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">Writers Guild of America</span></td><td><span>Best Adapted Screenplay</span></td><td>Stanley Kubrick, Michael Herr, Gustav Hasford</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\">1989</td><td rowspan=\"1\"><span>Kinema Junpo</span> Awards</td><td>Best Foreign Language Film Director</td><td>Stanley Kubrick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">Awards of the Japanese Academy</span></td><td>Best Foreign Language Film</td><td>Stanley Kubrick</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr></tbody></table><br/><h3>Differences between novel and screenplay</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>relies largely or entirely on a <span>single source</span></b>.<span class=\"hide-when-compact\"> Relevant discussion may be found on the <span>talk page</span>. Please help <span class=\"external text\">improve this article</span> by <span>introducing  citations to additional sources</span>.<br><small><span class=\"plainlinks\"><i>Find sources:</i> <span rel=\"nofollow\" class=\"external text\">\"Full Metal Jacket\"</span> – <span rel=\"nofollow\" class=\"external text\">news</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">newspapers</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">books</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">scholar</span> <b>·</b> <span rel=\"nofollow\" class=\"external text\">JSTOR</span></span></small></span>  <span class=\"date-container\"><i>(<span class=\"date\">February 2023</span>)</i></span></div></td></tr></tbody></table><p>Film scholar Greg Jenkins has analyzed the adaptation of the novel as a screenplay. The novel is in three parts and the film greatly expands the relatively brief first section about the boot camp on Parris Island and essentially discards Part III. This gives the film a twofold structure, telling two largely independent stories that are connected by the same characters. Jenkins said this structure is a development of concepts Kubrick originally discussed in the 1960s, when he talked about wanting to explode the usual conventions of narrative structure.</p><p>Sergeant Hartman, who is renamed from the book's Gerheim, has an expanded role in the film. Private Pyle's incompetence is presented as weighing negatively on the rest of the platoon; unlike those in the novel, he is the only under-performing recruit. The film omits Hartman's disclosure he thinks Pyle might be mentally unstable—a \"Section 8\"—to the other troops; instead, Joker questions Pyle's mental state. In contrast, Hartman praises Pyle, saying he is \"born again hard\". Jenkins says that portraying Hartman as having a warmer social relationship with the troops would have upset the balance of the film, which depends on the spectacle of ordinary soldiers coming to grips with Hartman as a force of nature who embodies a killer culture.</p><p>Some scenes in the book were removed from the screenplay or conflated with others. For example, Cowboy's introduction of the \"Lusthog Squad\" was markedly shortened and supplemented with material from other sections of the book. Although the book's third section was largely omitted, elements from it were inserted into other parts of the film. For instance, the climactic episode with the sniper is a conflation of two sections of Parts II and III of the book. According to Jenkins, the film presents this passage more dramatically but in less gruesome detail than the novel.</p><p>The film often has a more tragic tone than the book, which relies on callous humor. In the film, Joker remains a model of humane thinking, as evidenced by his moral struggle in the sniper scene and elsewhere. Joker works to overcome his own meekness rather than compete with other Marines. The film omits Joker's eventual domination over Animal Mother shown in the book.</p><p>The film also omits Rafterman's death; according to Jenkins, this allows viewers to reflect on Rafterman's personal growth and speculate on his future growth after the war.</p><br/><h3>In popular culture</h3><p>The line \"Me so horny. Me love you long time\", which is uttered by the Da Nang street prostitute to Joker, became a catchphrase in popular culture and was sampled by rap artists 2 Live Crew in their 1989 hit \"Me So Horny\" and by Sir Mix-A-Lot in \"Baby Got Back\" (1992).</p><br/>"
  },
  "errorMessage": ""
}