{
  "imDbId": "tt0081505",
  "title": "The Shining",
  "fullTitle": "The Shining (1980)",
  "type": "Movie",
  "year": "1980",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "But there is no way, within the film, to be sure with any confidence exactly what happens, or precisely how, or really why. Kubrick delivers this uncertainty in a film where the actors themselves vibrate with unease."
    },
    {
      "publisher": "Empire",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Ostensibly a haunted house story, it manages to traverse a complex world of incipient madness, spectral murder and supernatural visions ...and also makes you jump."
    },
    {
      "publisher": "The New York Times",
      "author": "Janet Maslin",
      "link": "",
      "rate": "80",
      "content": "Meticulously detailed and never less than fascinating, The Shining may be the first movie that ever made its audience jump with a title that simply says \"Tuesday.\""
    },
    {
      "publisher": "Film Threat",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "For a supposed mainstream movie, Kubrick’s The Shining isn’t very audience friendly. Half the time you have to guess what the hell is going on, and if you're not familiar with Kubrick's narrative style you’ll be completely lost."
    },
    {
      "publisher": "Boston Globe",
      "author": "",
      "link": "",
      "rate": "75",
      "content": "When you sit down to The Shining, you sit down with normal expectations of being diverted, perhaps even being gripped, but not being undermined. But the film undermines you in powerful, inchoate ways. It's a horror story even for people who don't like horror stories - maybe especially for them. [14 Jun 1980, p.1]"
    },
    {
      "publisher": "Salon",
      "author": "Andrew O'Hehir",
      "link": "",
      "rate": "70",
      "content": "Stephen King reportedly loathed the liberties Kubrick and co-writer Diane Johnson took with his story, but King's ur-villain, the emasculated husband from hell, has never been more clearly presented on-screen."
    },
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "",
      "rate": "50",
      "content": "It is a daring thing the director has done, this bleaching out of all the cheap thrills, this dashing of all the hopes one brings to what is, after all, advertised as \"a masterpiece of modern horror.\" Certainly he has asked much of Nicholson, who must sustain attention in a hugely unsympathetic role, and who responds with a brilliantly crazed performance."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "40",
      "content": "The crazier Nicholson gets, the more idiotic he looks. Shelley Duvall transforms the warm sympathetic wife of the book into a simpering, semi-retarded hysteric."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Dave Kehr",
      "link": "",
      "rate": "40",
      "content": "Kubrick is after a cool, sunlit vision of hell, born in the bosom of the nuclear family, but his imagery--with its compulsive symmetry and brightness--is too banal to sustain interest, while the incredibly slack narrative line forestalls suspense."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Jay Scott",
      "link": "",
      "rate": "38",
      "content": "Kubrick certainly doesn't fail small. One could fast forget The Shining as an overreaching, multi-levelled botch were it not for Jack Nicholson. Nicholson, one of the few actors capable of getting the audience to love him no matter what he does, is an ideal vehicle for Kubrick. [14 Jun 1980, p.E1]"
    }
  ],
  "errorMessage": ""
}