{
  "imDbId": "tt0081505",
  "title": "The Shining",
  "fullTitle": "The Shining (1980)",
  "type": "Movie",
  "year": "1980",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw6186405",
      "warningSpoilers": false,
      "date": "18 October 2020",
      "rate": "10",
      "helpful": "114 out of 141 found this helpful.",
      "title": "Forty years on, and it's still outstanding.",
      "content": "Kubrick, King and Nicholson, the writing was literally on the wall, and I don't mean RedRum, forty years on, and The Shining is still a masterpiece.Kubrick takes King's fantastic book, and builds on it, bringing the story to life in his own inimitable way. It's dark, it's bleak, it's terrifying, a masterpiece in storytelling. You watch as the central character's mental collapse is played out in a spine chilling fashion.Gorgeous camera work, incredible visuals, that opening is iconic. So many incredible, visual moments, the twins, lift, barman etc, no wonder it's been parodied multiple times over the years, famously by The Simpsons.An iconic role for Jack Nicholson, he is incredible, well supported by a terrific cast.It's a classic, 10/10."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0180193",
      "warningSpoilers": true,
      "date": "23 November 2003",
      "rate": "10",
      "helpful": "134 out of 183 found this helpful.",
      "title": "One of my favorite films",
      "content": "The Shining, you know what's weird about this movie? This is the movie that everyone, for people who claim to not like horror films, will always say that The Shining is a terrific film. This is Stanley Kubrick's classic vision of Stephen King's horror tale of madness and blood. This is just an incredible film and wither you have seen it or not, you have heard of it, know a few lines from it, and know some of the classic images. Who could forget Jack's \"Here's Johnny!\"? Who could forget \"All Work and No Play Make Jack a Dull Boy\"? Who could forget that chilling ending? This is the film that is unforgettable and honestly in my opinion is Kubrick's best work. I know there is a lot of argument in that department, a lot of people say it's 2001: A Space Odyssey or Clockwork Orange or even Dr. Strangelove, but if those film pioneered film making, then The Shining perfected it. This is the tale of isolation, madness, terrifying images, and the ultimate ghost story that will crawl underneath your skin. Jack Torrance, Jack's son Danny, and Jack's wife, Wendy arrive at the Overlook Hotel on closing day. The elderly African-American chef, Dick Hallorann, surprises Danny by speaking to him telepathically and offering him some ice cream. He explains to Danny that he and his grandmother shared the gift; they called the communication \"shining.\" Danny asks if there is anything to be afraid of in the hotel, particularly Room 237. Dick tells Danny that the hotel has a certain \"shine\" to it and many memories, not all of them good, and advises him to stay out of room 237 under all circumstances. Danny's curiosity about Room 237 finally gets the better of him when he sees the room has been opened. Danny shows up injured and visibly traumatized after Jack tells Wendy that he loves his family. Seeing this, Wendy thinks Jack has been abusing Danny. Jack wanders into the hotel's Gold Room where he meets a ghostly bartender named Lloyd. Danny starts calling out the word \"redrum\" frantically, and scribbling it on walls. He goes into a trance, and withdraws; he now says that he is Tony, his own \"imaginary friend.\" Jack sabotages the hotel radio, cutting off communication from the outside world, but Hallorann has received Danny's telepathic cry for help and is on his way. Wendy discovers that Jack has been typing endless pages of manuscript repeating \"All work and no play makes Jack a dull boy\" formatted in various ways. Horrified, Jack threatens her and she knocks him unconscious with a baseball bat, locking him in a storage locker in the kitchen. Jack converses with Grady through the door of the locker, which then unlocks releasing him. Danny has written \"REDRUM\" in lipstick on the door of Wendy's bedroom. When she looks in the mirror, she sees that it is \"Murder\" spelled backwards. Jack picks up an axe and begins to chop through the door leading to his family's living quarters. \"Here's Johnny!\", and Jack's legendary image is born.The Shining is one of those films that you seriously have to make time to see, this is an incredible film and still gives me nightmares. Jack Nicholson's performance is timeless and unforgettable. But one I also feel is extremely overlooked is Shelley Duvall, her scene of finding Jack's rant All Work is incredible, that's a look of horror and you can see that fear in her face after realizing her husband is mad. Also another incredible scene is when Jack sees a ghost woman in the bathtub, it's honestly one of the most terrifying scenes in horror cinema. The reason this film is so well known is because it's a film of perfection, it's been on The Simpsons, it's been shown in other films and it's a film that will forever stay with you when you see it, trust me.10/10"
    },
    {
      "username": "b_kite",
      "userUrl": "https://www.imdb.com/user/ur69376952",
      "reviewLink": "https://www.imdb.com/review/rw8255163",
      "warningSpoilers": false,
      "date": "20 June 2022",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "An absolute classic. Even if it does stray away from the novel.",
      "content": "While I can understand a lot of Stephen King's arguments over Kubrick's vision, including casting Jack Nicholson who instead of a descent into madness looks insane from the first frame. This is still an absolute classic."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0179898",
      "warningSpoilers": false,
      "date": "29 October 2001",
      "rate": "",
      "helpful": "179 out of 255 found this helpful.",
      "title": "A classic horror from a master director",
      "content": "When Jack Torrance (Nicholson) is offered a job as winter caretaker for the Overlook Hotel he accepts it as an opportunity to work on his novel in an isolated environment. He is told stories of the last caretaker going mad and butchering his family but isn't deterred. He arrives at the Overlook Hotel with his wife (Duvall) and child Danny (Lloyd) and is shown around the hotel by the cook (Scatman Crothers) who has the gift of perception. The cook warns Danny that the hotel can be of particular danger for those with the gift. It's only a matter of time before Jack begins to act increasingly erratic.This is one of Jack Nicholson's finest roles, his increasingly unhinged character is amusing and terrifying in almost equal measures. Duvall plays the role of the terrorised wife quite well - she does look like she's genuinely filled with fear - but doesn't have much else to do. Lloyd is excellent as the boy, although he doesn't have too much emotion to express. However no doubt that this is Jack's show.The story doesn't stick to King's novel and is better for it; this is Kubrick's Shining. The film has plenty of genuinely scary moments but manages to keep a creepy atmosphere all through - especially as the ghosts come out and Jack begins to move between his reality and the reality that is gradually claiming him.Kubrick is excellent here, his cold direction adds to the overall creep factor of the film. It's one of the best examples of his masterful touch.Overall this is an excellent horror movie - because the focus is on horror and fear rather than gore alone (as with modern horrors). Jack is excellent in one of his best roles ever and the whole package is delivered in a cold creepy manner by a sadly lost director."
    },
    {
      "username": "chaos-rampant",
      "userUrl": "https://www.imdb.com/user/ur17699578",
      "reviewLink": "https://www.imdb.com/review/rw1980444",
      "warningSpoilers": false,
      "date": "24 November 2008",
      "rate": "",
      "helpful": "120 out of 170 found this helpful.",
      "title": "Eeriness surpassed by class",
      "content": "Sometimes all good horror needs is a good idea. But sometimes, rarely indeed, a horror masterpiece will reach us by the hand of a Kubrick, with the adept, elusive touch of a great artist to guide the vision, and we know what separates it from all else.Okay, the story has enough promise that even a hired gun would have to try to fail. Heck, even Stephen King himself didn't fare so bad. It's how Kubrick perceives King's universe however, how he fills the frame with it, that renders THE SHINING a feast for the senses.Horror that will reach us through the mind and body alike, an assault as it were, tending eventually its pitch to a crescendo, yet curiously not without a delicate lull.Kubrick's cinema is, as usually, a sight to behold. We get the adventurous camera that prowls through the lavish corridors of the Overlook Hotel like it is some kind of mystic labyrinth rife for exploration, linear tracking shots exposing impeccably decorated interiors in symmetric grandeur. The geometrical approach in how Kubrick perceives space reminds me very much of Japanese directors of some 10 years before. In that what is depicted in the frame, the elements of narrative, is borderline inconsequential to how they all balance and harmonize together.Certain images stand out in this. The first shot of Jack's typewriter, ominously accompanied by the off-screen thumps of a ball, drums of doom that seem to emanate from the very walls or the typewriter itself, an instrument of doom in itself as is later shown. A red river flowing through the hotel's elevators in a poetry of slow motions. Jack hitting the door with the axe, the camera moving along with him, tracking the action as it happens, as though it's the camera piercing through the door and not the axe. The ultra fast zoom in the kid's face violently thrusting us inside his head before we see the two dead girls from his POV. And of course, the epochal bathroom scene.Much has been said of Jack Nicholson's obtrusive overacting. His mad is not entirely successful, because, well, he's Jack Nicholson. The guy looks half-mad anyway. Playing mad turns him into an exaggerated caricature of himself. Shelley Duvall on the other hand is one of the most inspired casting choices Kubrick ever made. Coming from a streak of fantastic performances for Robert Altman in the seventies (3 WOMEN, THIEVES LIKE US, NASHVILLE), she brings to her character the right amounts of swanlike fragility and emotional distress. A delicate, detached thing thrown in with the mad."
    },
    {
      "username": "neil-476",
      "userUrl": "https://www.imdb.com/user/ur7813355",
      "reviewLink": "https://www.imdb.com/review/rw1799833",
      "warningSpoilers": false,
      "date": "14 January 2008",
      "rate": "5",
      "helpful": "67 out of 95 found this helpful.",
      "title": "Equivocation",
      "content": "This is a difficult review to write. You see, I've just posted comments on Ella Enchanted where I comment that, as someone who has never read the book, the film is absolutely fine. But it's difficult for me to approach Stanley Kubrick's The Shining on that basis because, you see, I've read Stephen King's The Shining.If I do my absolute best to put the book out of my mind, I suppose that the film must be acknowledged as a tolerable horror, with two major flaws - one, it's overlong, and what should be a slow burn loaded with increasing dread becomes simply boring, and two, Jack Nicholson's established screen persona means that there is absolutely no suspense in his development from decent though flawed father/husband to scenery-chewing maniac - the final madness is there from the first frame he appears in.If you've never read the book and you're a horror fan, then you'll probably enjoy it - no huge surprises, but it ticks most of the boxes. And it looks very good.But what a missed opportunity! Stanley Kubrick's The Shining is a film about a man who goes mad in a haunted hotel. Stephen King's The Shining is a novel about an evil entity which inhabits a hotel, and which wants to consume a boy's psychic power: the boy is strong enough to resist it, so it works on the weakest link, the father, and gradually erodes everything which made him a good, decent man. Jack's transition from the decent though weak man he starts out as, to the point where the Overlook is in control of his every action, is absolutely central to Stephen King's The Shining, and it could only have worked on screen if Jack was portrayed by an actor who was initially credible as a decent, gentle man. Not Nicholson - I love him, but he was (in my view) a spectacular piece of miscasting for this movie. Picture Dustin Hoffman, Harrison Ford, or someone similar, and how dramatic and shocking their descent to axe-wielding maniachood would have been.The contrast is essential to Stephen King's story: with Nicholson, there was no contrast.It is also worth commenting that King's The Shining is about a man who loves his family: Kubrick's The Shining is stated, by the screenwriter in one of the DVD documentaries, to be about a man who hates his family. A fairly fundamental difference, yes?Ah well. \"What if\"s never got us anywhere. Go and see Stanley Kubrick's The Shining anyway, and enjoy Jack Nicholson chewing scenery. The scenery's pretty good eye candy and, besides, he does it so well."
    },
    {
      "username": "Anonymous_Maxine",
      "userUrl": "https://www.imdb.com/user/ur0562732",
      "reviewLink": "https://www.imdb.com/review/rw0179828",
      "warningSpoilers": true,
      "date": "2 April 2001",
      "rate": "10",
      "helpful": "182 out of 277 found this helpful.",
      "title": "The greatest horror movie of all time.",
      "content": "Okay, okay, maybe not THE greatest. I mean, The Exorcist and Psycho and a few others are hard to pass up, but The Shining is way up there. It is, however, by far the best Stephen King story that has been made into a movie. It's better than The Stand, better than Pet Sematary (if not quite as scary), better than Cujo, better than The Green Mile, better the Dolores Claiborne, better than Stand By Me (just barely, though), and yes, it's better than The Shawshank Redemption (shut up, it's better), I don't care WHAT the IMDb Top 250 says. I read that, a couple of decades ago, Stanley Kubrick was sorting through novels at his home trying to find one that might make a good movie, and from the other room, his wife would hear a pounding noise every half hour or so as he threw books against the wall in frustration. Finally, she didn't hear any noise for almost two hours, and when she went to check and see if he had died in his chair or something (I tell this with all due respect, of course), she found him concentrating on a book that he had in his hand, and the book was The Shining. And thank God, too, because he went on to convert that book into one of the best horror films ever.Stephen King can be thanked for the complexity of the story, about a man who takes his wife and son up to a remote hotel to oversee it during the extremely isolated winter as he works on his writing. Jack Nicholson can be thanked for his dead-on performance as Jack Torrance (how many movies has Jack been in where he plays a character named Jack?), as well as his flawless delivery of several now-famous lines (`Heeeeeere's Johnny!!'). Shelley Duvall can be thanked for giving a performance that allows the audience to relate to Jack's desires to kill her. Stanley Kubrick can be thanked for giving this excellent story his very recognizable touch, and whoever the casting director was can be thanked for scrounging up the creepiest twins on the planet to play the part of the murdered girls. One of the most significant aspects of this movie, necessary for the story as a whole to have its most significant effect, is the isolation, and it's presents flawlessly. The film starts off with a lengthy scene following Jack as he drives up to the old hotel for his interview for the job of the caretaker for the winter. This is soon followed by the same thing following Jack and his family as they drive up the windy mountain road to the hotel. This time the scene is intermixed with shots of Jack, Wendy, and Danny talking in the car, in which Kubrick managed to sneak in a quick suggestion about the evils of TV, as Wendy voices her concern about talking about cannibalism in front of Danny, who says that it's okay because he's already seen it on TV (`See? It's okay, he saw it on the television.'). The hotel itself is the perfect setting for a story like this to take place, and it's bloody past is made much more frightening by the huge, echoing rooms and the long hallways. These rooms with their echoes constantly emphasize the emptiness of the hotel, but it is the hallways that really created most of the scariness of this movie, and Kubrick's traditional tracking shots give the hallways a creepy three-dimensional feel. Early in the film, there is a famous tracking shot that follows Danny in a large circle as he rides around the halls on his Big Wheel (is that what those are called?), and his relative speed (as well as the clunking made by the wheels as he goes back and forth from the hardwood floors to the throw rugs) gives the feeling of not knowing what is around the corner. And being a Stephen King story, you EXPECT something to jump out at you. I think that the best scene in the halls (as well as one of the scariest in the film) is when Danny is playing on the floor, and a ball rolls slowly up to him. He looks up and sees the long empty hallway, and because the ball is something of a child's toy, you expect that it must have been those horrendously creepy twins that rolled it to him. Anyway, you get the point. The Shining is a damn scary movie.Besides having the rare quality of being a horror film that doesn't suck, The Shining has a very in depth story that really keeps you guessing and leaves you with a feeling that there was something that you missed. HAD Jack always been there, like Mr. Grady told him in the men's room? Was he really at that ball in 1921, or is that just someone who looks exactly like him? If he has always been the caretaker, as Mr. Grady also said, does that mean that it was HIM that went crazy and killed his wife and twin daughters, and not Mr. Grady, after all? It's one thing for a film to leave loose ends that should have been tied, that's just mediocre filmmaking. For example, The Amityville Horror, which obviously copied much of The Shining as far as its subject matter, did this. But it is entirely different when a film is presented in a way that really makes you think (as mostly all of Kubrick's movies are). One more thing that we can all thank Stanley Kubrick for, and we SHOULD thank him for, is for not throwing this book against the wall. That one toss would have been cinematic tragedy."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw6939125",
      "warningSpoilers": false,
      "date": "18 May 2021",
      "rate": "9",
      "helpful": "39 out of 55 found this helpful.",
      "title": "The best creepy horror movie involving isolation n eeriness. Also it captured the fear of the unseen in one of the best way.",
      "content": "I first saw this in the late 80s on a vhs, then again in the early 2k on a dvd which I own. Revisited the 144 mins director's cut recently as i am anxious to check out Doctor Sleep n the tv version of The Shining.Everything has already been said about this film n there seems to be little left to say but as a fan of horror movies (especially to do with isolation n eeriness), lemme contribute by praising how good this film is n at the same time why it doesn't deserve a full 10.The film has solid amount of tension n scare factor.The vast isolation, the snow capped peaks, the valleys, the mountains, the narrow, winding roads, the snow covered roads, the eerie corridors, they all add to the film's narration.The start scene wher Jack is driving and the background music, itself gives goosebumps n a sign that something sinister is awaiting.On a technical level this film is gr8, the music, the visuals, the camera angles, etc all add to it except the lead actor Nicholson.Nicholson was already well known for playing unstable characters and his character Jack in this film is shown to be a bit wierd from the beginning.They shud have asked him to potray a normal family loving person in the beginning n later show the gradual transition into madness n possession.Who wud discuss Donner Party in front of a kid?Also the way Jack gives an evilish smile when his kid tells about watching cannibalism on tv.What kinda parent wud approve of that?Also most of the time Jack's behavior is more laughable.Even when he is hit on the head by his wife n he falls down, it is a big lol."
    },
    {
      "username": "hanniballe11752",
      "userUrl": "https://www.imdb.com/user/ur0592950",
      "reviewLink": "https://www.imdb.com/review/rw0179913",
      "warningSpoilers": false,
      "date": "19 January 2002",
      "rate": "",
      "helpful": "367 out of 500 found this helpful.",
      "title": "A masterpiece of psychological horror",
      "content": "Stephen King may have said the master director knew nothing about horror, but that simply is not true. That is a too biased opinion for anyone to go on given that he wrote the book, which Kubrick based his wonderful film ever so loosely on. And at any rate, faithful or not, KUBRICK's Shining-the BEST crafted genre film of the 80's- performs it's duty as a fright flick, and then some.There are appropriately no words strong enough to convey the haunting beauty of the visuals showcased throughout the movie, from the drive to the Overlook to the final chase in the hedgemaze the movie is a feast for the eyes as it is for the mind. And it IS a feast for the mind as The Shining is as psychological as horror gets, toying relentlessly, and expertly with your emotions and expectations(some could even say SADISTICALLY), throwing something in that's completely out of left field and never, ever letting you catch your breath between the now classic shocks as the movie speeds toward it's memorable conclusion in the last half hour.Kudos are in order for Kubrick, a director of the old school style, who builds an eerie atmosphere by exercising total control over the filmic environment, manipulating everything down to the tiniest detail to suit the needs of the picture, yet filming with a coldly detatched, objective eye, as though Kubrick were making a documentary about these events. This would account for the dialouge, which-thankfully-is not the typical phoney balloney Hollywood banter (Kubrick detractors/King purists usually bitch about this the most, having been weaned on the phony nature of 'Hollywood talk', which is usually nothing at all like real talk. Many of us speak 'on the nose', and do not try to convey subtext through use of carefully chosen words that articulate our state of being without being direct.) In this light, Shelley Duvall must be commended for her performance which is very naturalistic. It does not seem like acting at all. She is not concerned with glamour, nor does she clutter her performance with typical acting chops, but rather she is solely focussed on hitting the emotional highpoints of her character as 'Wendy' gradually comes to realize that her husband is a madman. And let's face it folks, how many of us would like a million bucks when placed in a situation like that? Who does NOT look like a blubbering idiot when they are hysterical? That's what I thought, so what did you expect? She was great. To say nothing of the rest of the cast."
    },
    {
      "username": "elliotjeory",
      "userUrl": "https://www.imdb.com/user/ur69864183",
      "reviewLink": "https://www.imdb.com/review/rw7341072",
      "warningSpoilers": false,
      "date": "13 September 2021",
      "rate": "6",
      "helpful": "31 out of 44 found this helpful.",
      "title": "The book is better",
      "content": "Watching this after reading the book I can see why Stephen king was annoyed with it.Jack Nicholson looked unhinged from the beginning which means there isn't much difference in his decent into madness.Certain characters from the book are left out, where are the bees? Where are the moving ani mail bushes? The boiler is barely mentioned.The direction is brilliant and I love the blood down the elevator shaft scene."
    },
    {
      "username": "Ricky_Roma__",
      "userUrl": "https://www.imdb.com/user/ur5767111",
      "reviewLink": "https://www.imdb.com/review/rw1195042",
      "warningSpoilers": true,
      "date": "16 October 2005",
      "rate": "",
      "helpful": "300 out of 486 found this helpful.",
      "title": "Fact: Kubrick is better than King",
      "content": "It's well know that Stephen King doesn't like Stanley Kubrick's version of The Shining (so much so that he scripted an abysmal TV movie version). According to him, Kubrick didn't understand the horror genre. Well, I think Kubrick did. I think he understood it only too well. He knew that it was a genre full of conventions, cheap tricks and tired clichés. Therefore Kubrick decided to throw all that nonsense out of the window and make a film based on atmosphere rather than predictable thrills. You don't get people here jumping out of the dark time after time. You don't get worthless shocks. Kubrick's version of The Shining is an insidious film. It gets under your skin. In other words, it isn't for Pavlovian dogs that have spent a lifetime being conditioned by cretinous nonsense.What runs deepest through The Shining is a frustration with family. Right from the beginning it's obvious that Jack isn't happy with his lot  as he's being shown around the hotel he can't help but take a sneaky look at the backsides of a couple of women. Well, can you blame him? The poor man is married to a bug-eyed, bucktoothed Olive Oil look-a-like.Then there's Jack's quiet frustration with his son Danny. As he's driving to the hotel, he's bothered by requests for food. And then his son makes out that he's knowledgeable because he saw a programme on TV. Already he's slightly irked - he's got to spend months alone with these people; one who resembles Popeye's missus and one who talks to his finger.So really the hotel brings out nothing that isn't already there. It merely brings everything to the surface  Jack's resentment as regards his wife, his frustration as regards his lack of writing talent and his annoyance at having a troubled son. It's kind of like he's testing his family. Are they strong enough as a unit to survive being cooped up together?One of the underlying themes in the film seems to be television. What happens in The Shining is what happens when someone stops watching the idiot box. With it, a person can find solace in mindless programming and retreat from the strictures of family life. Without it they're faced with all their problems and all the failings of their loved ones. Even the strongest family can be brought to its knees when there's no escape from each other's company. Therefore it's quite telling, when Jack loses the plot completely, that he spouts lines from TV: \"Honey, I'm home\" and \"Here's Johnny.\" Just watch some television, Jack.But it's also the pain of writing that contributes to Jack's insanity. There's nothing quite as harrowing as an empty page. Plus there's nothing more annoying than being interrupted mid-flow. One of the best scenes in the film is when Jack tells his wife to get lost when she interrupts him. It's extremely violent in how cold Jack is towards Wendy. And because it's grounded in a reality, it's all the more effective.Also rather unsettling is the scene where Jack talks to his son. He makes Danny sit on his lap and he proceeds to tell him how much he loves him and how he'd never hurt him. It works so well because it's so cold and because there's such an obvious lack of affection. The words are just empty platitudes. They mean absolutely nothing.Jack's true feelings are only revealed when he gets to talk to Lloyd. It's in this scene that you realise the marriage isn't all it's cracked up to be  Wendy has never forgiven him for accidentally hurting his son. And it's also in this scene that you realise (as if you hadn't noticed earlier) that Jack is absolutely crackers. He's talking to ghosts. But they could also be figments of his imagination, for there are mirrors behind most of the ghosts he talks to. Effectively he's talking to himself. And I love this matter of fact way of dealing with the supernatural. There are no fancy tricks. Everything just seems unnaturally natural.In fact, everything to do with the ghosts is superbly handled. The twins are spooky, Lloyd is amiable and Grady is out of his mind. And it's Grady who's probably the most chilling presence in the film. He starts off as a bumbling waiter but then quickly becomes a stone cold killer. Just the way he says 'corrected' conveys more terror than a million slasher films. And Philip Stone's performance is a million times more subtle than Nicholson's. I mean, as much as I like Jack in the film, he does chew the scenery. But Kubrick likes his over the top performances, so that's the way he wanted it.And undoubtedly it's Kubrick's movie. He's the real star. And I love everything he brings to the film. I love his command of lighting  just look at The Gold Room scenes. I love his use of music. I love the way that he turns the Room 237 scene, one that could have been a standard 'jump' scene, into a comment on Jack's marriage  his willingness to be unfaithful. I love the way that he leaves lots of unanswered questions. I love the shots of the blood coming out of the lift. I love the helicopter shots at the start. I love the way that pages and pages of typed words are the most frightening visual in the film. I love the maze. I love the fact that you see a ghost getting a blow-job from a ghost in a bear suit Man, I love absolutely everything about this film. It's horror for people who know that true horror isn't being stalked by a man in a mask, but being trapped alone with your family."
    },
    {
      "username": "portraitofaladyonfire",
      "userUrl": "https://www.imdb.com/user/ur107612409",
      "reviewLink": "https://www.imdb.com/review/rw6449135",
      "warningSpoilers": false,
      "date": "6 January 2021",
      "rate": "6",
      "helpful": "86 out of 119 found this helpful.",
      "title": "I can see why people like it",
      "content": "My expectation were to high. I expected a masterpiece, but in the end I found it just mediocre. Dont get me wrong the acting and the camera work are great. Storywise I couldnt really get invested in it. In terms of horror except the twins it wasn't scary at all in my opinion."
    },
    {
      "username": "Chiller7",
      "userUrl": "https://www.imdb.com/user/ur22751513",
      "reviewLink": "https://www.imdb.com/review/rw3288535",
      "warningSpoilers": false,
      "date": "31 July 2015",
      "rate": "5",
      "helpful": "321 out of 498 found this helpful.",
      "title": "Overrated",
      "content": "Once again, I decided to check out a highly regarded \"cinematic masterpiece\" and was left kinda disappointed. Scariest movie of all time? No, not really. It wasn't even particularly scary.Admittedly, a lot of it was well done. The little girls were the best part. They were great. The steadicam shots through the hallways were pretty cool. There was a good sense of \"What horrors could be lurking around the corner?\" as the camera follows the kid through the halls.But aside from those things, much of the movie didn't work so well. Jack Nicholson was more hilarious than menacing. Was that intentional? His witty dialogue provided many laughs, but watching him slowly stumbling around holding an axe was hardly what I'd call horror.The story was completely nonsensical. What was any of that? There's no explanation for almost everything that happens in the movie! Here's where I'll probably get derided by the movie's fans for not \"getting it,\" but I'm convinced this is really a case where the movie-makers themselves had no clue what it all meant. They just threw all this random imagery at us just to confuse us and convince us that it's actually brilliant (because if we can't comprehend any of it, it must be brilliant, right?) but really it just makes zero sense.I don't get why this is so highly rated."
    },
    {
      "username": "us012862",
      "userUrl": "https://www.imdb.com/user/ur0846694",
      "reviewLink": "https://www.imdb.com/review/rw0179774",
      "warningSpoilers": false,
      "date": "27 August 2000",
      "rate": "",
      "helpful": "785 out of 1,000 found this helpful.",
      "title": "Best Horror Film I've Ever Seen",
      "content": "When this film first came out in 1980, I remember going to see it on opening night. The sheer terror that I experienced in viewing \"The Shining\" was enough to make me go to bed with the lights turned ON every night for an entire summer. This movie just scared the life out of me, which is what still happens every time I rent the video for a re-watch. I have seen The Shining at least six or seven times, and I still believe it to be simultaneously and paradoxically one of the most frightening and yet funniest films I've ever seen. Frightening because of the extraordinarily effective use of long shots to create feelings of isolation, convex lens shots to enhance surrealism, and meticulously scored music to bring tension levels to virtually unbearable levels. And \"funny\" because of Jack Nicholson's outrageous and in many cases ad-libbed onscreen antics. It never ceases to amaze me how The Shining is actually two films in one, both a comedy AND a horror flick. Ghostly apparitions of a strikingly menacing nature haunt much of the first half of the film, which gradually evolve into ever more serious physical threats as time progresses. Be that as it may, there is surprisingly little violence given the apparent intensity, but that is little comfort for the feint of heart as much of the terror is more implied than manifest. The Shining is a truly frightening movie that works symbolically on many levels, but is basically about human shortcomings and the way they can be exploited by unconscious forces combined with weakness of will. This film scares the most just by using suggestion to turn your own imagination against you. The Shining is a brilliant cinematic masterpiece, the likes of which have never been seen before or since. Highly, highly recommended. - Paul"
    },
    {
      "username": "Sfpsycho415",
      "userUrl": "https://www.imdb.com/user/ur1233583",
      "reviewLink": "https://www.imdb.com/review/rw1030037",
      "warningSpoilers": false,
      "date": "28 February 2005",
      "rate": "8",
      "helpful": "220 out of 359 found this helpful.",
      "title": "One of the scariest movies ever---8/10",
      "content": "I was never a big fan of horror movies. They usually try cheap tricks to scare their audiences like loud noises and creepy children. They usually lack originality and contain overacting galore. The only horror movie i like was Stir of Echoes with Kevin Bacon. It was well-acted, and had a great story. But it has been joined and maybe even surpassed by Stanley Kubrick's The Shining, quite possibly the scariest movie ever.The movie follows a writer (Jack Nicholson) and his family who agree to watch over a hotel while it is closed for the winter. There were rumors of the place being haunted and the last resident went crazy and murdered his family. But Jack is convinced it will be OK and he can use the quiet to overcome his writer's block. After months of solitude and silence however, Jack becomes a grumpy and later violent. Is it cabin fever or is there something in the hotel that is driving him mad?One of the creepiest parts about the movie is the feeling of isolation that Kubrick makes. The hotel is very silent, and the rooms are huge, yet always empty. It is also eerily calm when Jack's son is riding his bike through the barren hallways. Jack Nicholson's performance is also one of his very best, scaring the hell out of me and making me sure to get out once in awhile. My favorite scene is when he is talking to a ghost from inside a walk-in refrigerator.The Shining is tops for horror movies in my opinion, beating the snot out of crap like the Ring and The Blair Witch Project. It may be a oldie, but is definitely a goodie. 8/10"
    },
    {
      "username": "Chromium_5",
      "userUrl": "https://www.imdb.com/user/ur2405286",
      "reviewLink": "https://www.imdb.com/review/rw0180281",
      "warningSpoilers": false,
      "date": "12 September 2004",
      "rate": "6",
      "helpful": "63 out of 98 found this helpful.",
      "title": "A major disappointment.",
      "content": "This has got to be the most overrated movie in the history of film. I just watched it for the first time, expecting the best of the best, and it was quite a letdown. The sets and music are great, of course, but Kubrick seems to have forgotten one very important thing: to make a horror movie horrifying, you have to have likable characters. That way, when bad things start happening, the audience feels for them.What we have here, however, is a documentary on the most dysfunctional family in the world. Isn't this supposed to be about a loving husband and father who goes insane? Jack Nicholson is brilliant at portraying total insanity, but there's no gradual shift into at all. He looks like he's about to snap from scene one. His wife is a whimpering, nervous wreck who does not seem to trust him at any point throughout the movie. And the kid, Danny, is just a weird little nut. Who can identify with these people?Another major problem is that there is no clear storyline here. The whole first half of the movie is about the kid's psychic abilities, and then it does a total switch and focuses on Jack Nicholson being crazy. What was the point of spending all that time on Danny? It seems like it is foreshadowing something, but it never amounts to anything. I guess Danny is the first one to see ghosts in the house, but that is not a big enough plot point to spend the entire first half of the movie on.Other than some incredibly creepy music and sets, there is nothing really scary in this movie. It is fun to see Jack Nicholson ham it up, of course, but there is no scariness involved when you spend the entire movie waiting listlessly for him to pick up an ax, rather than being shocked when he goes from lovable to psychotic. Instead, he goes from obviously-wanting-to-release-a-ton-of-built-up-aggression to psychotic, which is extremely inferior.6/10 stars, and that is being generous."
    },
    {
      "username": "unbreakablepabs",
      "userUrl": "https://www.imdb.com/user/ur2341632",
      "reviewLink": "https://www.imdb.com/review/rw0180145",
      "warningSpoilers": true,
      "date": "29 June 2003",
      "rate": "",
      "helpful": "549 out of 721 found this helpful.",
      "title": "A truly brilliant and scary film from Stanley Kubrick.",
      "content": "I can't praise this film long enough!The Shining is, without doubt, one of Stanley Kubrick's undisputed masterpieces and a true classic in horror cinema. It is a film that, over the course of the years, has managed to scare the living hell out of its audiences (and still does). The film is an adaptation of Stepehen King's original novel, written in the late '70s, and although the film is not very loyal to the book, it still stands as a thing of its own.Right from the beginning, as we contemplate the car going to the hotel from those stunning aerial shots, deeply inside us we know that something in the film, somehow, sometime is going to go wrong. As we obtain that severe warning, an almost inaudible voice gently whispers to us 'sit tight', a sense of unexpectedness invades us all, and it is that very same feeling that makes our hair stand on end throughout out the entire movie. The plot is simple: Jack Torrance (Jack Nicholson) becomes the caretaker of the Overlook Hotel in up in the secluded mountains of Colorado. Jack, being a family man, takes his wife (Shelley Duvall) and son (Danny Lloyd) to the hotel to keep him company throughout the long, isolated nights. During their stay, strange things occur when Jack's son Danny sees gruesome images powered by a force called 'the shining' and Jack is heavily affected by this. Along with writer's block and the demons of the hotel haunting him, Jack has a complete mental breakdown and the situation takes a sinister turn for the worse.The film, unlike many horror-oriented films nowadays, doesn't only rely on stomach-churning and gory images (which it does contain, anyway) but on the incredibly scary music based on the works of Béla Bartók and on the excellent cinematography (the Steadicam is superbly used, giving us a sense of ever-following evil), as well. The terrifying mood and atmosphere of the film is carefully and masterfully woven by Kubrick, who clearly knows how to really make a horror movie.Jack Nicholson's powerful performance as the mad father and husband is as over the top as it is brilliant. Shelley Duvall, who plays the worrying wife who tries to help her son, is also a stand out; she shows a kind of trembling fear in many scenes and is able to display weakness and vulnerability in a very convincing way. Undoubtedly, The Shining is full of memorable moments (the elevator scene or the 'Heeeeeere's Johnny' one-liner for instance) and, simply put, it's flawlessly brilliant.Stanley Kubrick's direction is pure excellence, giving the whole film a cold and atmospheric look, thus creating an unbearable sense of paranoia and terror. There are moments of sheer brilliance and exquisite perfection in this film; the horrifying maze chase is a perfect example. Every single shot is masterfully created and there are some genuinely scary scenes which will make you sit on the edge of your seat.The Shining is, in my opinion, a special landmark in horror cinema which will always be regarded as one of the scariest movies in film history. Since I saw it last year, when I was 13, I have rarely been able to have a bath in my bathtub.Just in case, ya know. Overall, The Shining is incomparably the scariest film I've ever seen in my whole life (and I can tell you I've seen a great deal of horror films).It is an unforgettable, chilling, majestic and truly, profoundly scary film crafted by an eccentric genius who wants to show that the impossible can be done. The Shining is a sublime, hauntingly intriguing and endlessly watchable film that shows Kubrick at his best."
    },
    {
      "username": "akdjreview",
      "userUrl": "https://www.imdb.com/user/ur129603614",
      "reviewLink": "https://www.imdb.com/review/rw7698196",
      "warningSpoilers": false,
      "date": "28 December 2021",
      "rate": "9",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Not so scary incredible film",
      "content": "Horror films are not my cup of tea. But The Shining has gotten me to reconsider this preference. With an incredible performance by Jack Nicholson as Jack Torrance, I might even say it is one of the best I've ever seen. Meanwhile, considering this movie is a horror film, it always keeps you on your toes. While also being a compact story and with few actors making the film more intriguing and heart wrenching.The Shining is a disturbing film from the 80s. It's not so much scary for the audience, but there's always a creepy feeling luring over you. With Jack Nicholson in the lead role, performing one of the best roles I've seen. Playing a so convincing role It's almost frightening. With so many memorable scenes it's impressive how well the actors performed.Meanwhile, the storyline during the entire film is disturbing and alluring, it also manages to be beautiful. Director Stanley Kubrick managed to create a masterpiece. With beautiful angels, use of lightning and scenes. I can tell you that there is no error in the creation of this masterpiece.I highly recommend you watch The Shining. Truly one of the best horror films ever made. And if you don't like horror movies or fear them The Shining is not so frightening."
    },
    {
      "username": "matthewssilverhammer",
      "userUrl": "https://www.imdb.com/user/ur19752191",
      "reviewLink": "https://www.imdb.com/review/rw3565138",
      "warningSpoilers": false,
      "date": "19 October 2016",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "May Not Be Kubrick's Masterpiece, But It's Still a Masterpiece",
      "content": "Kubrick spent his 40+ year career proving that no matter what the genre he will, not only do it well, but will dominate it. The Shining is no exception. A filmed nightmare, it's a naturalistically still and insistently surreal mixture of thick mood and rich story. A maze of surprises even after multiple viewings, its terror hovers right under the surface before exploding onto our brains. A masterpiece of hypnotic horror that's as insidiously, mind-bogglingly creepy as ever. At the center is the ever-menacing presence of Nicholson. Presenting a sobering lesson in how to not be a husband / father (and not just because of the violent climax), his dementia begins unraveling from moment one. Despite his iconically villainous turn, I'm not sure he's even the best of the bunch. Crothers brings beautiful lightness when needed, and his darker moments that much more powerful; and Lloyd walks a brilliant tightrope between creepy-horror-kid, average boyhood, and haunting sadness. Above all, Duvall's compelling and deeply broken turn as forlorn wife / mother is beyond perfect. These performers are given a directorial assuredness to play in rarely matched outside of Kubrick. The plight of these characters is captured with such empathy, we're given a personal view of what could easily have been a cold experience. Every detail is so intentionally and perfectly placed to draw us into the growing madness of the Overlook Hotel: The blood-flood, the dead-eyed stares, the symmetry of the twins, the normally-calm camera ferociously following the swinging axe. Meticulously crafted, intellectually provocative, emotionally penetrating, and dementedly entertaining, though Shining may not be Kubrick's best, it would be most filmmakers magnum opus."
    },
    {
      "username": "yancyscott1",
      "userUrl": "https://www.imdb.com/user/ur9974595",
      "reviewLink": "https://www.imdb.com/review/rw1634260",
      "warningSpoilers": false,
      "date": "9 April 2007",
      "rate": "9",
      "helpful": "214 out of 297 found this helpful.",
      "title": "timeless terror",
      "content": "Even though The Shining is over a quarter of a century old, I challenge anyone to not get freaked out by Jack Nicholson's descent into madness. This is a rare example of something so unique that no one has been able to rip it off; instead it has been referenced time and again in pop culture. The twins, the elevator of blood, RedRum, the crazy nonsense \"writing\"... this should be seen, if for nothing else, to understand all the allusions to it in daily life. The film is simultaneously scary, suspenseful, beautiful, and psychologically intriguing. It has the classic mystery of Hitchcock and the terror of a modern thriller. And it has what horror movies usually lack: a great script."
    },
    {
      "username": "FlickJunkie",
      "userUrl": "https://www.imdb.com/user/ur1279212",
      "reviewLink": "https://www.imdb.com/review/rw0179869",
      "warningSpoilers": false,
      "date": "24 July 2001",
      "rate": "9",
      "helpful": "292 out of 414 found this helpful.",
      "title": "Amazing achievement in filmmaking and the art of terror.",
      "content": "Chilling, majestic piece of cinematic fright, this film combines all the great elements of an intellectual thriller, with the grand vision of a director who has the instinctual capacity to pace a moody horror flick within the realm of his filmmaking genius that includes an eye for the original shot, an ice-cold soundtrack and an overall sense of dehumanization. This movie cuts through all the typical horror movies like a red-poker through a human eye, as it allows the viewer to not only feel the violence and psychosis of its protagonist, but appreciate the seed from which the derangement stems. One of the scariest things for people to face is the unknown and this film presents its plotting with just that thought in mind. The setting is perfect, in a desolate winter hideaway. The quietness of the moment is a character in itself, as the fermenting aggressor in Jack Torrance's mind wallows in this idle time, and breeds the devil's new playground. I always felt like the presence of evil was dormant in all of our minds, with only the circumstances of the moment, and the reasons given therein, needed to wake its violent ass and pounce over its unsuspecting victims. This film is a perfect example of this very thought.And it is within this film's subtle touches of the canvas, the clackity-clacks of the young boy's big wheel riding along the empty hallways of the hotel, the labyrinthian garden representing the mind's fine line between sane and insane, Kubrick's purposely transfixed editing inconsistencies, continuity errors and set mis-arrangements, that we discover a world guided by the righteous and tangible, but coaxed away by the powerful and unknown. I have never read the book upon which the film is based, but without that as a comparison point, I am proud to say that this is one of the most terrifying films that I have ever seen. I thought that the runtime of the film could've been cut by a little bit, but then again, I am not one of the most acclaimed directors in the history of film, so maybe I should keep my two-cent criticisms over a superb film, to myself. All in all, this movie captures your attention with its grand form and vision, ropes you in with some terror and eccentric direction, and ties you down and stabs you in the heart with its cold-eyed view of the man's mind gone overboard, creepy atmosphere and the loss of humanity.Rating: 9/10"
    },
    {
      "username": "charbelelaro",
      "userUrl": "https://www.imdb.com/user/ur70755406",
      "reviewLink": "https://www.imdb.com/review/rw7669173",
      "warningSpoilers": false,
      "date": "22 December 2021",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "This movie has stood the test of time and will forever be praised as one of the greatest achievements in cinema",
      "content": "The Shining is directed by Stanley Kubrick and is a horror movie based on the novel by Steven King. In reviewing this film, there's probably nothing I can say that hasn't already been said about this masterpiece. This movie has stood the test of time and will forever be praised as one of the greatest achievements in cinema. From the production design, to the performances, the movie is unmatched. The atmosphere Kubrick creates in The Shining is in my opinion, the reason why this movie has suck around as long as it has. The Overlook Hotel is a character in itself. The way the music in the opening credits establishes the feeling of this setting whilst the camera travels through nature leading to to hotel, just instantly impacts the audience, immediately immersing them into the world. Once you enter the hotel, you feel as though you are really there living through the characters. Jack Nicholson's performance as Jack Torrance is beyond perfect. He presents the slow progression of insanity so authentically, which ultimately leads to one of the most iconic climaxes of all time. His wife played my Shelley Duvall does an amazing job with a performance so over the top is actually works. The son, Danny Torrance is probably my favourite character in the movie. He easily could have ruined the film but he does a fantastic job in delivering some absurd lines which I still genuinely get so creeped out by. The Shining is a film lovers dream. And whilst Steven king didn't like the film, how can one not marvel at all the symmetry, vibrant colour palette and perfect set design. Seriously I know the Overlook Hotel is haunted, but I would check into that place any day. To walk through the ballroom, see the iconic carpet and use that unusually modern red bathroom would be a dream. The Shining is one of my favourites movies ever. And whilst this review probably doesn't mean anything because this film has already seen enough praise, I'm still going to give it a 10/10. If you haven't seen The Shining get off your phone and go watch it right now. Seriously it's a classic how haven't you watched it yet?"
    },
    {
      "username": "kevin_robbins",
      "userUrl": "https://www.imdb.com/user/ur131783850",
      "reviewLink": "https://www.imdb.com/review/rw8801397",
      "warningSpoilers": false,
      "date": "15 January 2023",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "A true masterpiece and must see",
      "content": "The Shining (1980) is a movie in my DVD collection that I recently rewatched on HBOMAX. The storyline follows a writer who agrees to overlook a hotel in Colorado during the winter months when it's closed down. His son has an imaginary friend that helps him see things. When the family arrives at the hotel he tries to warn the family something is off but they feel it's just him adjusting. The hotel brings lies and secrets about the family to the surface. When a snowstorm hits the hotel that won't let anyone in or out the families hope for surviving the winter diminishes.This movie is directed by icon Stanley Kubrick (A Clockwork Orange) and stars Jack Nicholson (Chinatown), Shelley Duvall (Popeye), Danny Lloyd (Doctor Sleep), Scatman Crothers (One Flew Over the Cuckoo's Nest) and Joe Turkel (Bladerunner).The cinematography and soundtrack for this is legendary. The ability to capture the daunting landscape of the circumstances and portray the intensity of the isolation with background music is magnificent. The acting is out of this world and Nicholson, Duvall and Lloyd deliver all time great performances. Nicholson's evolution as a character is perfectly portrayed. Kubrick had to be very clever with the times and how he portrayed Nicholsons childhood abuses as well as how Nicholson was sexually abusing Danny. It's very subtle but smart simultaneously. There will never be a time that the talking finger and blood elevator isn't creepy and the use of redrum will be a catch phrase for eternity. Every second of this movie is a masterpiece but the last 20 minutes will go down as one of the best finales to any movie ever, in and out of the horror genre.Overall, this is an all time great movie of any genre. Kubrick really put everything into this picture, more than the audience can even capture with the imagination. A true masterpiece and a must see. I would score this a 10/10 and consider it required viewing for anyone who enjoys movies."
    },
    {
      "username": "FiendishDramaturgy",
      "userUrl": "https://www.imdb.com/user/ur2626332",
      "reviewLink": "https://www.imdb.com/review/rw0180168",
      "warningSpoilers": true,
      "date": "21 August 2003",
      "rate": "10",
      "helpful": "41 out of 73 found this helpful.",
      "title": "Kubrick's Masterpiece of Horror Lives On!",
      "content": "*!!- SPOILERS - !!*Before I begin this, let me say that I have had both the advantages of seeing this movie on the big screen and of having seen the \"Authorized Version\" of this movie, remade by Stephen King, himself, in 1997.Both advantages made me appreciate this version of \"The Shining,\" all the more.Also, let me say that I've read Mr. King's book, \"The Shining\" on many occasions over the years, and while I love the book and am a huge fan of his work, Stanley Kubrick's retelling of this story is far more compelling ... and SCARY.Kubrick really knows how to convey the terror of the psyche straight to film. In the direction of the movie AND the writing of the screenplay, itself, he acquired the title \"Magus\" beyond question. Kubrick's genius is like magic. The movie world lost a great director when he died in 1999. Among his other outstanding credits are: Eyes Wide Shut, 1999; Full Metal Jacket, 1987; Barry Lyndon, 1975; A Clockwork Orange, 1971; 2001: A Space Odyssey, 1968; Spartacus, 1960 and many more.The Torrences (Jack, Wendy his wife and Danny, their son) are living in the Overlook Hotel for the winter; Jack has been hired as the caretaker. It is his job to oversee the upkeep of the hotel during the several months of hard snow, until spring when the Overlook reopens its doors. It seems there are many wealthy and jaded tourists who will flock to the Colorado Mountains for a snow-filled summer getaway.The Hotel was an impressive piece of architecture and staging. It lent to the atmosphere, by having a dark, yet at the same time \"welcoming\" atmosphere, itself. The furnishings and furniture was all period (late 70's - early 80's), and the filmography of the landscape approaching the hotel in the opening scene is brilliant. It not only lets you enjoy the approach to the Overlook, it also fixes in your mind how deserted and isolated the Hotel is from the rest of the world.The introduction of Wendy and Danny's characters was a stroke of genius. You get the whole story of their past, Danny's \"imaginary friend,\" Tony, and the story of Jack's alcoholism all rolled into this nice, neat introductory scene. There was no need in stretching the past history out over two hours of the movie; obviously, Kubrick saw that from the beginning.Closing Day. Again, the scenic drive up the mountains to the Hotel (this time, with family in tow), the interaction between Jack and Danny was hilarious while also portraying a very disturbing exchange.The initial tour through the Overlook is quite breathtaking, even as the \"staff\" is moving things out, you get a chance to see the majestic fire places, the high cathedral ceilings and expensive furnishings, dormants and crown moldings in the architecture. \"They did a good job! Pink and gold are my favorite colors.\" (Wendy Torrence) Even the \"staff wing\" is well designed and beautifully built.The maze was a magnificent touch, reminiscent of the Labyrinth in which the Minotaur of Crete was Guardian. When Jack Nicholson stands at the scaled model of the maze and stares into the center, seeing Wendy and Danny entering, it's a magickal moment; one that tells you right away, there are heavy energies in that house; there's something seriously wrong, already starting. \"I wouldn't want to go in there unless I had at least an hour to find my way out.\" (The Hotel Manager)Scatman Cruthers, as Dick Halloran, was genuine and open in his performance. His smiles were natural and his performance was wonderful. You could actually believe you were there in the hotel, taking the tour of the kitchen with Wendy and \"Doc.\" His explanation of \"the shining\" to Danny was very well delivered, as was his conversation with the child about Tony and the Hotel. It was believable and sincere.The cut out and pan scan of the hotel itself, with the mountains looming behind, the cold air swirling about, mist coming up from the warm roof of the snowbound hotel, adds so MUCH to the atmosphere of the movie. It also marks the \"half-way-to-hell\" point, so to speak; the turning point in the movie.Shelley Duvall's portrayal of Wendy Torrence was masterful. (So WHAT if she also played Olive Oyl?! It just shows her marvelous diversity!) Honestly, before I saw the movie on the big screen in 1980, I said,\" What? Olive Oyl? *lol* (Popeye was also released in 1980.) But I took that back as soon as the movie started. She's brilliant. In this Fiend's opinion, this is her best performance, to date! (Although I did love her in Steve Martin's \"Roxanne,\" 1987.)Once Kubrick has established the pearly bits of information of which you, the viewer, need to be in possession: the Torrence's past; Danny's broken arm; Tony; the history of the Hotel itself; the fact that Danny is not \"mental,\" but rather clairvoyant instead, and the general layout of the Hotel; all of which you get in the opening 3 sequences; the movie never stops scaring you.The two butchered daughters of the previous caretaker, Delbert Grady (the girls having appeared several times to Danny, first by way of Tony in the apartment before the family ever left for the hotel) were icons with which Danny could identify, and of which he was afraid, at the same time. They were haunting (and haunted), themselves and showed Danny how and where they were killed, in a rather graphic and material way.Kubrick's Tony was written as an attendant spirit, like a spirit guide which he acquired as a result of his arm nearly being wrenched off his body by his own father. He was...\"the little boy who lives in my mouth.\" He would manifest in the end of Danny's finger and physically spoke through Danny in order to speak TO Danny. NOT like in the book, I realize, where Tony was intended by Stephen King to be the projection of Danny as an older boy, trying to save his father. Kubrick left out that little twist and it somehow made it more frightening when Tony \"took ... Danny ... over.\" The idea of Danny's older self projecting back to his younger self isn't...scary.The \"Woman in the Shower\" scene, done by Lia Beldan (about whom I can find no other credits for having done anything before, or since) as the younger woman and Billie Gibson (who ALSO appears to suffer from a lack of credits for works before or since), was seductively obnoxious and thoroughly disgusting. It was dramatic, and frightening. Abhorrent and scary. When Nicholson looks into the mirror and sees her decomposing flesh beneath his hands; the look of sheer terror on his face was so complete and REAL.Jack quickly embarks on his trek from the \"jonesing\" alcoholic to a certifiable insane person. The degradation of his character's mental state is carefully and thoroughly documented by Kubrick. Jack's instant friendship with Lloyd the Bartender (as only alcoholics, would-be mental patients and drug addicts do) portrays his pressing NEED of the atmosphere to which Lloyd avails him; namely, alcohol ...\"hair of the dog that bit me.\" (Jack Torrence) In Jack's case, it's bourbon on the rocks, at no charge to Jack. \"Orders from the house.\" (Lloyd the Bartender) Nice play on words.When Wendy find's Jack's \"screenplay\" is nothing more than page after page of the same line typed over and over, albeit in 8 or 9 different creative styles...when he asks from the shadows, \"How do you like it?\" and Wendy whirls and screams with the baseball bat in her hand...is so poignant. It's the point where she realizes how messed up the whole situation is...how messed up Jack is. It's very scary, dramatic and delivers a strong presence. That coupled with Danny's visions of the hotel lobby filling with blood, imposed over the scene between Jack and Wendy, and with the confrontational ending to this scene, make this possibly THE strongest scene of the movie.The \"REDRUM\" scene. Wow. What do I say? What mother would not be totally freaked by awakening to find their young, troubled son standing over them with a huge knife, talking in that freaky little voice, exclaiming \"REDRUM\" over and over? Even if it HAD no meaning, it would still be as scary as the 7th level of HELL. It was something everyone could (and has) remember(ed). Speaking of memorable scenes...Nicholson's final assault on his family with an axe was perhaps one of the scariest scenes of movie history. His ad-libbed line, \"Heeeeere's Johnny!\" was a stroke of brilliance and is one of the most memorable scenes in the history of horror. It also goes down in horror movie history.The ending..? Kubrick's ending was perfection. I felt it ended beautifully. No smarm, no platitudinous whining, no tearfully idiotic ending for THIS movie. Just epitomized perfection. That's all I'll say on the subject of the ending.Who cares what was taken out?! Look what Kubrick put IN. Rent it, watch it, BUY IT. It's a classic in the horror genre, and for good reason. IT RAWKS!!*Me being Me* ... Take this movie, and sitck it in your Stephen King collection, and take the 1997 \"Authorized\" version done by King and stick it down in the kiddie section. That's where it belongs. .: This movie rates a 9.98 from the Fiend :."
    },
    {
      "username": "ScottAmundsen",
      "userUrl": "https://www.imdb.com/user/ur23249778",
      "reviewLink": "https://www.imdb.com/review/rw2248160",
      "warningSpoilers": true,
      "date": "11 May 2010",
      "rate": "1",
      "helpful": "257 out of 480 found this helpful.",
      "title": "The Funniest Comedy of 1980",
      "content": "I shall never, ever be able to understand the phenomenon known as Stanley Kubrick. When he was on, as with DR STRANGELOVE, he was brilliant. But when he was bad, he was awful.I saw THE SHINING in its first release in a packed movie house in New York City. I had read and loved Stephen King's novel; I am widely read in the horror genre and do not scare easily, but that book gave me the creeps for weeks.Well, for all the people who have been raving what a masterpiece this film is, I can only tell you this. The crowd in the theatre started giggling the minute Jack Nicholson appeared on film, and by the time he chased Shelley Duvall up the stairs, the whole crowd was literally in stitches. And I was laughing right along with them. Maybe New York audiences are just jaded; I don't know.Not that this movie does not have some scary moments. Shelley Duvall is rather good when she is away from Nicholson and it starts to dawn on her that something evil is taking over her family and her life. Unfortunately, Miss Duvall plays Wendy Torrance, a strong, intelligent, and resourceful woman in the novel, as a pathetic, whiny ninny most of the time, and by the time Nicholson had her trapped in the bathroom, I am sure plenty of us were screaming for her head. It must be said that this is not the fault of Miss Duvall, a talented and intelligent actress who according to reports fought bitterly with Kubrick over his interpretation of Wendy.The kid talking to his finger is another idiotic and unintentionally hilarious bit of business that was not in the original novel. Why Kubrick thought this was a good idea is beyond me.But let's get down to the real problem: Jack Nicholson. In the right role, he can be very good, though he has never been among my top ten. Jack Torrance is totally the wrong role for him; for one thing, he does not look ordinary enough. But the worst thing is that Stephen King's story was about a man being SLOWLY AND INEXORABLY driven out of his mind. Nicholson goes nuts so early in the film that there is literally nowhere for him to take the character. And Kubrick was either in awe of Nicholson, who was still riding the post-Oscar high from CUCKOO'S NEST, or he just didn't care, or he thought it was scary when it was actually funny. I don't know.As if all this were not bad enough, the whole mess drags on for two hours and twenty-two minutes; this movie practically cries out for a pair of scissors.Some people will feel that I have spat on an icon, I suppose, and they have that right. But Stephen King himself was not happy with this film, and when he finally got the opportunity to re-do it as a television miniseries in 1997, the results were much better. For the one thing that is missing in Kubrick's version is a heart.Anne Rivers Siddons, in discussing her excellent horror novel THE HOUSE NEXT DOOR, writes that the thing about horror is that it smashes people and relationships. Thus the best horror stories are at bottom also very sad (Brian De Palma's CARRIE gets this; Kubrick's film does not). And whatever your feelings about the miniseries format may be, the Torrance family created in 1997 were people you could care about. Director Mick Garris understands King better than Kubrick did, and Rebecca De Mornay, in particular, redeems the Wendy character in a spectacular tour-de-force towards the end. In 1980 the Torrances were figures of fun. Rather like the barbaric Victorian custom of laughing at the lunatics in Bedlam.Awful, awful, awful."
    }
  ],
  "errorMessage": ""
}