{
  "imDbId": "tt0081505",
  "title": "The Shining",
  "fullTitle": "The Shining (1980)",
  "type": "Movie",
  "year": "1980",
  "language": "en",
  "titleInLanguage": "The Shining (film)",
  "url": "https://en.wikipedia.org/wiki/The_Shining_(film)",
  "plotShort": {
    "plainText": "The Shining is a 1980 psychological horror film produced and directed by Stanley Kubrick and co-written with novelist Diane Johnson. The film is based on Stephen King's 1977 novel of the same name and stars Jack Nicholson, Shelley Duvall, Scatman Crothers, and Danny Lloyd. The film's central character is Jack Torrance (Nicholson), an aspiring writer and recovering alcoholic who accepts a position as the off-season caretaker of the isolated historic Overlook Hotel in the Colorado Rockies, with his wife, Wendy Torrance (Duvall), and young son, Danny Torrance (Lloyd). Danny is gifted with psychic abilities named \"shining\". After a winter storm leaves the Torrances snowbound, Jack's sanity deteriorates due to the influence of the supernatural forces that inhabit the hotel.\r\nProduction took place almost exclusively at EMI Elstree Studios, with sets based on real locations. Kubrick often worked with a small crew, which allowed him to do many takes, sometimes to the exhaustion of the actors and staff. The new Steadicam mount was used to shoot several scenes, giving the film an innovative and immersive look and feel. There has been much speculation about the meanings and actions in the film because of inconsistencies, ambiguities, symbolism, and differences from the book.\r\nThe film was released in the United States on May 23, 1980, and in the United Kingdom on October 2 by Warner Bros. There were several versions for theatrical releases, each of which was cut shorter than the preceding cut; about 27 minutes was cut in total. Reactions to the film at the time of its release were mixed; Stephen King criticized the film due to its deviations from the novel. The film received two controversial nominations at the Razzies—Worst Director and Worst Actress (for Duvall)—the latter of which was later rescinded due to Kubrick's treatment of Duvall on set. Critical response to the film has since become more favorable.\r\nIn 2012, The Shining was ranked the 75th greatest film of all time in the Sight & Sound directors' poll. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". Thirty-nine years after the original film, a sequel, Doctor Sleep, was released on November 8, 2019.",
    "html": "<p>The Shining is a 1980 psychological horror film produced and directed by Stanley Kubrick and co-written with novelist Diane Johnson. The film is based on Stephen King's 1977 novel of the same name and stars Jack Nicholson, Shelley Duvall, Scatman Crothers, and Danny Lloyd. The film's central character is Jack Torrance (Nicholson), an aspiring writer and recovering alcoholic who accepts a position as the off-season caretaker of the isolated historic Overlook Hotel in the Colorado Rockies, with his wife, Wendy Torrance (Duvall), and young son, Danny Torrance (Lloyd). Danny is gifted with psychic abilities named \"shining\". After a winter storm leaves the Torrances snowbound, Jack's sanity deteriorates due to the influence of the supernatural forces that inhabit the hotel.</p><p>Production took place almost exclusively at EMI Elstree Studios, with sets based on real locations. Kubrick often worked with a small crew, which allowed him to do many takes, sometimes to the exhaustion of the actors and staff. The new Steadicam mount was used to shoot several scenes, giving the film an innovative and immersive look and feel. There has been much speculation about the meanings and actions in the film because of inconsistencies, ambiguities, symbolism, and differences from the book.</p><p>The film was released in the United States on May 23, 1980, and in the United Kingdom on October 2 by Warner Bros. There were several versions for theatrical releases, each of which was cut shorter than the preceding cut; about 27 minutes was cut in total. Reactions to the film at the time of its release were mixed; Stephen King criticized the film due to its deviations from the novel. The film received two controversial nominations at the Razzies—Worst Director and Worst Actress (for Duvall)—the latter of which was later rescinded due to Kubrick's treatment of Duvall on set. Critical response to the film has since become more favorable.</p><p>In 2012, The Shining was ranked the 75th greatest film of all time in the Sight & Sound directors' poll. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". Thirty-nine years after the original film, a sequel, Doctor Sleep, was released on November 8, 2019.</p>"
  },
  "plotFull": {
    "plainText": "The Shining is a 1980 psychological horror film produced and directed by Stanley Kubrick and co-written with novelist Diane Johnson. The film is based on Stephen King's 1977 novel of the same name and stars Jack Nicholson, Shelley Duvall, Scatman Crothers, and Danny Lloyd. The film's central character is Jack Torrance (Nicholson), an aspiring writer and recovering alcoholic who accepts a position as the off-season caretaker of the isolated historic Overlook Hotel in the Colorado Rockies, with his wife, Wendy Torrance (Duvall), and young son, Danny Torrance (Lloyd). Danny is gifted with psychic abilities named \"shining\". After a winter storm leaves the Torrances snowbound, Jack's sanity deteriorates due to the influence of the supernatural forces that inhabit the hotel.\r\nProduction took place almost exclusively at EMI Elstree Studios, with sets based on real locations. Kubrick often worked with a small crew, which allowed him to do many takes, sometimes to the exhaustion of the actors and staff. The new Steadicam mount was used to shoot several scenes, giving the film an innovative and immersive look and feel. There has been much speculation about the meanings and actions in the film because of inconsistencies, ambiguities, symbolism, and differences from the book.\r\nThe film was released in the United States on May 23, 1980, and in the United Kingdom on October 2 by Warner Bros. There were several versions for theatrical releases, each of which was cut shorter than the preceding cut; about 27 minutes was cut in total. Reactions to the film at the time of its release were mixed; Stephen King criticized the film due to its deviations from the novel. The film received two controversial nominations at the Razzies—Worst Director and Worst Actress (for Duvall)—the latter of which was later rescinded due to Kubrick's treatment of Duvall on set. Critical response to the film has since become more favorable.\r\nIn 2012, The Shining was ranked the 75th greatest film of all time in the Sight & Sound directors' poll. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". Thirty-nine years after the original film, a sequel, Doctor Sleep, was released on November 8, 2019.\r\nPlot\r\nJack Torrance takes a winter caretaker position at the remote Overlook Hotel in the Rocky Mountains, which closes every winter season. After his arrival, manager Stuart Ullman advises Torrance that a previous caretaker, Charles Grady, killed his family and himself in the hotel.\r\nIn Boulder, Jack's son, Danny, has a premonition and seizure. Jack's wife, Wendy, tells the doctor about a past incident when Jack accidentally dislocated Danny's shoulder during a drunken rage. Jack has been sober ever since. Before leaving for the seasonal break, the Overlook's head chef Dick Hallorann informs Danny of a telepathic ability the two share, which he calls \"shining\". Hallorann tells Danny the hotel also has a \"shine\" due to residue from unpleasant past events, and warns him to avoid Room 237.\r\nA month passes and Danny starts having frightening visions, including of two murdered twin sisters. Meanwhile, Jack's mental health deteriorates; he gets nowhere with his writing, is prone to violent outbursts, and has dreams of killing his family. Danny gets lured to room 237 by unseen forces and Wendy later finds him with signs of physical trauma. Jack investigates and encounters a female ghost in the room, but blames Danny for self-inflicting the bruises. Jack is enticed back to drinking by the ghostly bartender Lloyd. Ghostly figures, including Delbert Grady, then begin appearing in the Gold Room. Grady informs Jack that Danny has telepathically contacted Hallorann for assistance, and says that Jack must \"correct\" his wife and child.\r\nWendy finds Jack's manuscript written with nothing but countless repetitions of \"All work and no play makes Jack a dull boy\". When Jack threatens her life, Wendy knocks him unconscious with a baseball bat and locks him in the kitchen pantry, but she and Danny cannot leave due to Jack having previously sabotaged the hotel's two-way radio and snowcat. Back in their hotel room, Danny says \"redrum\" repeatedly and even writes the word in lipstick on the bathroom door. Wendy sees the word in the mirror and realizes that it is actually \"murder\" spelled backwards.\r\nJack is freed by the ghost of Grady and goes after Wendy and Danny with an axe. Danny escapes outside through the bathroom window, and Wendy fights Jack off with a knife when he tries to break through the door. Hallorann, having flown back to Colorado from his Florida vacation to respond to Danny's telepathic SOS, reaches the hotel in another snowcat. His arrival distracts Jack, who ambushes and murders him in the lobby, then pursues Danny into the hedge maze. Wendy runs through the hotel looking for Danny, encountering the hotel's ghosts and a vision of cascading blood similar to Danny's premonition.\r\nIn the hedge maze, Danny misleads Jack and hides behind a snowdrift while Jack follows a false trail. Danny and Wendy reunite and leave in Hallorann's snowcat, leaving Jack to freeze to death in the maze. In a photograph in the hotel hallway, Jack is pictured standing amidst a crowd of party revelers from July 4, 1921.\r\nCast\r\nJack Nicholson as Jack Torrance\r\nShelley Duvall as Wendy Torrance\r\nDanny Lloyd as Danny \"Doc\" Torrance\r\nScatman Crothers as Dick Hallorann\r\nBarry Nelson as Stuart Ullman\r\nPhilip Stone as Delbert Grady\r\nJoe Turkel as Lloyd\r\nAnne Jackson as Doctor\r\nTony Burton as Larry Durkin\r\nLia Beldam as Young Woman in Bath\r\nBillie Gibson as Old Woman in Bath\r\nBarry Dennen as Bill Watson\r\nLisa and Louise Burns as Grady Twins\r\nIn the European cut, all of the scenes involving Jackson and Burton were removed but the credits remained unchanged. Dennen is on-screen in all versions of the film, albeit to a limited degree (and with no dialogue) in the European cut.\r\nThe actresses who played the ghosts of the murdered Grady daughters, Lisa and Louise Burns, are identical twins; however, the characters in the book and film script are merely sisters, not twins. In the film's dialogue, Ullman says he thinks they were \"about eight and ten\". Nonetheless, they are frequently referred to in discussions about the film as \"the Grady twins\".\r\nThe resemblance in the staging of the Grady girls and the \"Twins\" photograph by Diane Arbus has been noted both by Arbus' biographer, Patricia Bosworth, the Kubrick assistant who cast and coached them, Leon Vitali, and by numerous Kubrick critics. Although Kubrick both met Arbus personally and studied photography under her during his time as photographer for Look magazine, Kubrick's widow says he did not deliberately model the Grady girls on Arbus' photograph, in spite of widespread attention to the resemblance.\r\nProduction\r\nGenesis\r\nBefore making The Shining, Kubrick directed the film Barry Lyndon (1975), a highly visual period film about an Irishman who attempts to make his way into the British aristocracy. Despite its technical achievements, the film was not a box-office success in the United States and was derided by critics for being too long and too slow. Kubrick, disappointed with Barry Lyndon's lack of success, realized he needed to make a film that would be commercially viable as well as artistically fulfilling. Stephen King was told that Kubrick had his staff bring him stacks of horror books as he planted himself in his office to read them all: \"Kubrick's secretary heard the sound of each book hitting the wall as the director flung it into a reject pile after reading the first few pages. Finally one day the secretary noticed it had been a while since she had heard the thud of another writer's work biting the dust. She walked in to check on her boss and found Kubrick deeply engrossed in reading The Shining\".\r\nSpeaking about the theme of the film, Kubrick stated that \"there's something inherently wrong with the human personality. There's an evil side to it. One of the things that horror stories can do is to show us the archetypes of the unconscious; we can see the dark side without having to confront it directly\".\r\nCasting\r\nNicholson was Kubrick's first choice for the role of Jack Torrance; other actors considered included Robert De Niro (who said the film gave him nightmares for a month), Robin Williams, and Harrison Ford, all of whom met with Stephen King's disapproval. Stephen King, for his part, disavowed Nicholson because he thought that, since he had shot One Flew Over the Cuckoo's Nest, the viewer would tend to consider him an unstable individual from the beginning. For this reason, King preferred Jon Voight, Michael Moriarty, or Martin Sheen for the role, who would more faithfully represent the profile of the ordinary individual who is gradually driven to madness. In any case, from the beginning the writer was told that the actor for the lead role \"was not negotiable.\"\r\nAlthough Jack Nicholson initially suggested that Jessica Lange would be a better fit for Stephen King's Wendy, Shelley Duvall knew early that she was the one cast for the role (Nicholson would work with Lange on his next movie, The Postman Always Rings Twice). Wendy's character in the film differs notably from the novel, where she appears more capable and less vulnerable. Throughout the filming Kubrick pushed Duvall hard. It is said that the scene in which, armed with the baseball bat, she walks backwards up the stairs before the attack of her husband (one of the most reshot scenes in all of cinema), she was not representing a terrified woman; Shelley was literally \"terrified\". According to the \"Guinness Book of Records\", Kubrick demanded the shot be repeated 127 times.\r\nThe director's initial candidate to play the Torrances' son was Cary Guffey (Close Encounters of the Third Kind), but the young actor's parents prevented him, claiming that the film was too gruesome for a child. In his search to find the right actor to play Danny, Kubrick sent a husband-and-wife team, Leon (who portrayed Lord Bullingdon in Barry Lyndon) and Kersti Vitali, to Chicago, Denver, and Cincinnati to create an interview pool of 5,000 boys over a six-month period. These cities were chosen since Kubrick was looking for a boy with an accent that fell between Jack Nicholson's and Shelley Duvall's speech patterns, with Nicholson coming from New Jersey and Duvall from Texas. During the filming, the young actor was protected in a special way by Kubrick; the boy believed at all times that he was shooting a drama, not a horror movie. Following his role in the 1982 film Will: G. Gordon Liddy, Danny Lloyd abandoned his acting career.\r\nFilming\r\nInterior sets\r\nHaving chosen King's novel as a basis for his next project, and after a pre-production phase, Kubrick had sets constructed on soundstages at EMI Elstree Studios in Borehamwood, Hertfordshire, England. Some of the interior designs of the Overlook Hotel set were based on those of the Ahwahnee Hotel in Yosemite National Park. To enable him to shoot the scenes in chronological order, he used several stages at EMI Elstree Studios in order to make all sets available during the complete duration of production. The set for the Overlook Hotel was at the time the largest ever built at Elstree, including a life-size re-creation of the exterior of the hotel. In February 1979, the set at Elstree was badly damaged in a fire, causing a delay in the production.\r\nExterior locations\r\nWhile most of the interior shots, and even some of the Overlook exterior shots, were shot on studio sets, a few exterior shots were shot on location by a second-unit crew headed by Jan Harlan. Saint Mary Lake and Wild Goose Island in Glacier National Park, Montana was the filming location for the aerial shots of the opening scenes, with the Volkswagen Beetle driving along Going-to-the-Sun Road. The Timberline Lodge on Mount Hood in Oregon was filmed for a few of the establishing shots of the fictional Overlook Hotel; absent in these shots is the hedge maze, something the Timberline Lodge does not have. The Ahwahnee Hotel (the Overlook Hotel's main interior) and the Timberline Lodge (the Overlook Hotel's main exterior) were both designed by architect Gilbert Stanley Underwood, in the 1920s and 1930s respectively.\r\nOuttakes of the opening panorama shots were later used by Ridley Scott for the closing moments of the original cut of the film Blade Runner (1982).\r\nWriting\r\nIn 1977, a Warner Bros. executive, John Calley, sent Kubrick the proofs of what would become the novel. Its author, Stephen King, was already at that time a best-selling author who, after the blockbuster of Carrie, could boast of successes in adaptations for the big screen. For his part, Kubrick had been considering directing a horror film for some time; a few years before, while Barry Lyndon disappointed at the box office, another Warner film he had refused to direct, The Exorcist, directed by William Friedkin, was breaking box office records around the world.\r\nAsked what it was that attracted Kubrick to the idea of adapting the novel by the popular writer, a regular on the best-seller lists, his executive producer (and brother-in-law) Jan Harlan revealed that Kubrick wanted to \"try\" in this film genre, although with the condition of being able to change King's novel. And that condition would finally be guaranteed by contract.\r\nThe script was written by the director himself with the collaboration of novel writer Diane Johnson. Kubrick had rejected the initial version of the draft, written by King himself, as too literal an adaptation of the novel. Furthermore, the filmmaker did not believe in ghost stories because that \"would imply the possibility that there was something after death,\" and he did not believe there was anything, \"not even hell.\" Instead, Johnson, who was teaching a Gothic novel seminar at the University of California at Berkeley at the time, seemed like a better fit for the project. Deep down, Johnson looked down on Stephen King's literature; shortly after the premiere, in an interview with the Parisian magazine Positif, she stated:\r\nAmong us, The Shining (the novel) is not part of great literature. It is scary, it is effective and it works, without further ado … But it is precisely interesting to see how a very bad book can also be very effective.- … It's quite pretentious. But it is also true that one has less scruples when destroying it: one is aware that a great work of art is not being destroyed.\r\nKubrick, for his part, was more enthusiastic about the possibilities of the manuscript:\r\nIt was the first time that I had read to the end a novel that was sent to me with a view to a possible film adaptation. I was absorbed in its reading and it seemed to me that its plot, ideas and structure were much more imaginative than usual in the horror genre; I thought that a great movie could come from there.\r\nPhotography\r\nThe Shining had a very prolonged and arduous production period, often with very long workdays. Principal photography took over a year to complete, due to Kubrick's highly methodical nature. Actress Shelley Duvall did not get along with Kubrick, frequently arguing with him on set about lines in the script and her acting techniques. She eventually became so overwhelmed by the stress of her role that she became physically ill for months. At one point, she was under so much stress that her hair began to fall out. The shooting script was being changed constantly, sometimes several times a day, adding more stress. Nicholson eventually became so frustrated with the ever-changing script that he would throw away the copies that the production team had given him to memorize, knowing that it was going to change anyway. He learned most of his lines just minutes before filming them. Nicholson was living in London with his then-girlfriend Anjelica Huston and her younger sister, Allegra, who testified to his long shooting days. Joe Turkel stated in a 2014 interview that they rehearsed the \"bar scene\" for six weeks and that the shoot day lasted from 9 a.m. to 10:30 p.m., with Turkel recollecting that his clothes were soaked in perspiration by the end of the day's shoot. He also described it as his favorite scene in the film.\r\nFor the final Gold Room sequence, Kubrick instructed the extras (via megaphone) not to talk, \"but to mime conversation to each other. Kubrick knew from years of scrutinizing thousands of films that extras could often mime their business by nodding and using large gestures that look fake. He told them to act naturally to give the scene a chilling sense of time-tripping realism as Jack walks from the seventies into the roaring twenties\".\r\nFor the international versions of the film, Kubrick shot different takes of Wendy reading the typewriter pages in different languages. For each language, a suitable idiom was used: German (Was du heute kannst besorgen, das verschiebe nicht auf morgen / \"Never put off till tomorrow what may be done today\"), Italian (Il mattino ha l'oro in bocca / \"The morning has gold in its mouth\"), French (Un «Tiens» vaut mieux que deux «Tu l'auras» / \"One 'here you go' is worth more than two 'you'll have it'\", the equivalent of \"A bird in the hand is worth two in the bush\"), Spanish (No por mucho madrugar amanece más temprano / \"No matter how early you get up, you can't make the sun rise any sooner.\")\r\nThe door that Jack chops through with the axe near the end of the film was real; Kubrick originally shot this scene with a fake door, but Nicholson, who had worked as a volunteer fire marshal and a firefighter in the California Air National Guard, tore through it too quickly. Jack's line, \"Heeeere's Johnny!\", is taken from Ed McMahon's introduction to The Tonight Show Starring Johnny Carson, and was improvised by Nicholson. Kubrick, who had lived in England for some time, was unaware of the significance of the line, and nearly used a different take.\r\nDuring production, Kubrick screened David Lynch's Eraserhead (1977) to the cast and crew, to convey the mood he wanted to achieve for the film.\r\nSteadicam\r\nThe Shining was among the early half-dozen films (after the films Bound for Glory, Marathon Man, and Rocky, all released in 1976), to use the newly developed Steadicam, a stabilizing mount for a motion picture camera, which mechanically separates the operator's movement from the camera's, allowing smooth tracking shots while the operator is moving over an uneven surface. It essentially combines the stabilized steady footage of a regular mount with the fluidity and flexibility of a handheld camera. The inventor of the Steadicam, Garrett Brown, was heavily involved with the production of The Shining. Brown has described his excitement taking his first tour of the sets, which offered \"further possibilities for the Steadicam\". This tour convinced Brown to become personally involved with the production. Kubrick was not \"just talking of stunt shots and staircases\". Rather he would use the Steadicam \"as it was intended to be used — as a tool which can help get the lens where it's wanted in space and time without the classic limitations of the dolly and crane\". Brown used an 18 mm Cooke lens that allowed the Steadicam to pass within an inch of walls and door frames. Brown published an article in American Cinematographer about his experience, and contributed to the audio commentary on the 2007 DVD release.\r\nKubrick personally aided in modifying the Steadicam's video transmission technology. Brown states his own abilities to operate the Steadicam were refined by working on Kubrick's film. For this film, Brown developed a two-handed technique, which enabled him to maintain the camera at one height while panning and tilting the camera. In addition to tracking shots from behind, the Steadicam enabled shooting in constricted rooms without flying out walls, or backing the camera into doors. Brown notes that:\r\nOne of the most talked-about shots in the picture is the eerie tracking sequence which follows Danny as he pedals at high speed through corridor after corridor on his plastic Big Wheel tricycle. The soundtrack explodes with noise when the wheel is on wooden flooring and is abruptly silent as it crosses over carpet. We needed to have the lens just a few inches from the floor and to travel rapidly just behind or ahead of the bike.\r\nThis required the Steadicam to be on a special mount resembling a wheelchair, in which the operator sat while pulling a platform with the sound man. The weight of the rig and its occupants proved to be too much for the original tires, resulting in a blowout one day that almost caused a serious crash. Solid tires were then mounted on the rig. Kubrick also had a highly accurate speedometer mounted on the rig so as to duplicate the exact tempo of a given shot so that Brown could perform successive identical takes. Brown also discusses how the scenes in the hedge maze were shot with a Steadicam.\r\nMusic and soundtrack\r\nThe stylistically modernist art-music chosen by Kubrick is similar to the repertoire he first explored in 2001: A Space Odyssey. Although the repertoire was selected by Kubrick, the process of matching passages of music to motion picture was left almost entirely at the discretion of music editor Gordon Stainforth, whose work on this film is known for attention to fine details and remarkably precise synchronization without excessive splicing.\r\nThe soundtrack album on LP was withdrawn due to problems with licensing of the music. The LP soundtrack omits some pieces heard in the film, and also includes complete versions of pieces of which only fragments are heard in the film.\r\nThe non-original music on the soundtrack is as follows:\r\nSegments that didn't appear on the soundtrack album also include:\r\nUpon their arrival at Elstree Studios, Wendy Carlos and Rachel Elkind were shown the first version of the film by Kubrick: \"The film was a little on the long side. There were great gobs of scenes that never made it to the film. There was a whole strange and mystical scene in which Jack Nicholson discovers objects that have been arranged in his working space in the ballroom with arrows and things. He walks down and thinks he hears a voice and a ghost throws a ball back to him. None of that made it to the final film. We scored a lot of those. We didn't know what was going to be used for sure\". After having something similar happen to her on Clockwork Orange, Carlos has said that she was so disillusioned by Kubrick's actions that she vowed never to work with him again. She and Elkind had considered legal action against Kubrick, but because no formal contract was in place, they reluctantly accepted the situation. Carlos's own music was released in its near entirety in 2005 as part of her Rediscovering Lost Scores compilation.\r\nRelease\r\nUnlike Kubrick's previous works, which developed audiences gradually through word-of-mouth, The Shining initially opened on 10 screens in New York City and Los Angeles on the Memorial Day weekend, then was released as a mass-market film nationwide within a month. The European release of The Shining a few months later was 25 minutes shorter due to Kubrick's removal of most of the scenes taking place outside the environs of the hotel.\r\nPost-release edit\r\nAfter its premiere and a week into the general run (with a running time of 146 minutes), Kubrick cut a scene at the end that took place in a hospital. The scene shows Wendy in a bed talking with Mr. Ullman who explains that Jack's body could not be found; he then gives Danny a yellow tennis ball, presumably the same one that Jack was throwing around the hotel. This scene was subsequently physically cut out of prints by projectionists and sent back to the studio by order of Warner Bros., the film's distributor. This cut the film's running time to 144 minutes. Roger Ebert commented:\r\nIf Jack did indeed freeze to death in the labyrinth, of course his body was found – and sooner rather than later, since Dick Hallorann alerted the forest rangers to serious trouble at the hotel. If Jack's body was not found, what happened to it? Was it never there? Was it absorbed into the past and does that explain Jack's presence in that final photograph of a group of hotel party-goers in 1921? Did Jack's violent pursuit of his wife and child exist entirely in Wendy's imagination, or Danny's, or theirs? ... Kubrick was wise to remove that epilogue. It pulled one rug too many out from under the story. At some level, it is necessary for us to believe the three members of the Torrance family are actually residents in the hotel during that winter, whatever happens or whatever they think happens.\r\nThe general consensus among those who saw the first few shows was that the film was better without it because keeping it would weaken the Overlook's threat to the family and reintroduce Ullman, who had barely had a leading role in the story, into the conflict. Co-writer Diane Johnson revealed that Kubrick had a certain \"compassion\" from the beginning for the fate of Wendy and Danny, and in that sense the hospital scene would give a sense of a return to normalcy. Johnson, on the other hand, was in favor of a more tragic outcome: she even proposed the death of Danny Torrance. For Shelley Duvall, \"Kubrick was wrong, because the scene explained some important things, such as the meaning of the yellow ball and the role that the hotel manager played in the intrigue.\" Kubrick decided that the film worked better without the scene.\r\nEuropean version\r\nFor its release in Europe, Kubrick cut about 25 minutes from the film. The excised scenes included: a longer meeting between Jack and Watson at the hotel; Danny being attended by a doctor (Anne Jackson), including references to Tony and how Jack once injured Danny in a drunken rage; more footage of Hallorann's attempts to get to the hotel during the snowstorm, including a sequence with a garage attendant (Tony Burton); extended dialogue scenes at the hotel; and a scene where Wendy discovers a group of skeletons in the hotel lobby during the climax. Jackson and Burton are credited in the European print, despite their scenes having been excised from the movie. According to Harlan, Kubrick decided to cut some sequences because the film was \"not very well received\", and also after Warner Brothers had complained about its ambiguity and length.\r\nThe scene when Jack writes obsessively on the typewriter \"All work and no play makes Jack a dull boy\" was re-shot a number of times, but changing the language of the typed copy to Italian, French, Spanish, and German, in order to match the respective dubbed languages.\r\nThree alternative takes were used in a British television commercial.\r\nHome media\r\nThe U.S. network television premiere of The Shining (on ABC's Friday Night Movie of May 6, 1983) started with a placard saying, \"Tonight's Film Deals With the Supernatural, As a Possessed Man Attempts to Destroy His Family.\" With the movie's ambiguities, it is not known how Kubrick felt about or if he agreed with this proclamation. The placard also said that the film was edited for television and warned about the content.\r\nDVDs in both regions contain a candid fly-on-the-wall 33-minute documentary made by Kubrick's daughter Vivian (who was 17 when she filmed it) entitled Making The Shining, originally shown on British television in 1980. She also provided an audio commentary track about her documentary for its DVD release. It appears even on pre-2007 editions of The Shining on DVD, although most DVDs of Kubrick films before then were devoid of documentaries or audio commentaries. It has some candid interviews and very private moments caught on set, such as arguments with cast and director, moments of a no-nonsense Kubrick directing his actors, Scatman Crothers being overwhelmed with emotion during his interview, Shelley Duvall collapsing from exhaustion on the set, and Jack Nicholson enjoying playing up to the behind-the-scenes camera.\r\nIn May 2019, it was announced that the film would be released on Ultra HD Blu-ray in October. The release includes a 4K remaster using a 4K scan of the original 35mm negative. Filmmaker Steven Spielberg and Kubrick's former personal assistant Leon Vitali closely assisted Warner Bros. in the mastering process. This is the same cut and 4K restoration that was screened at the 2019 Cannes Film Festival. According to the official press release, the official full-length run-time is 146 minutes.\r\nAd campaigns\r\nVarious theatrical posters were used during the original 1980–1981 international release cycle, but in the U.S., where the film first opened, the primary poster and newspaper advert was designed by noted Hollywood graphic designer Saul Bass. Bass and Kubrick reportedly went through over 300 potential designs before settling on the final design of an unsettling, angry-looking, underlit, pointillistic doll-like face (which does not appear in the film) peering through the letters \"The\", with \"SHiNiNG\" below, in smaller letters. At the top of the poster are the words \"A MASTERPIECE OF MODERN HORROR\", with the credits and other information at the bottom.\r\nThe correspondence between the two men during the design process survives, including Kubrick's handwritten critiques on Bass's different proposed designs. Bass originally intended the poster to be black on a red background, but Kubrick, to Bass's dismay, chose to make the background yellow. In response, Bass commissioned a small, silkscreened print run of his original version, which also lacks the \"masterpiece of modern horror\" slogan, and has the credits in a compact white block at the bottom.\r\n4K version\r\nTurner Classic Movies and Fathom Events had a limited screening in October 2016 in 2K and 4K resolution.\r\nIn April 2019, a 4K resolution remastered version from a new scan of the original 35mm camera negative of the film was selected to be shown in the Cannes Classics section at the 2019 Cannes Film Festival. The length is listed as 146 minutes and 143 minutes.\r\nReception\r\nBox office\r\nThe Shining opened on the same weekend as The Empire Strikes Back but was released on 10 screens and grossed $622,337 for the four-day weekend, the third highest-grossing opening weekend from fewer than 50 screens of all time, behind Star Wars (1977) and The Rose (1979). It had a per-screen average gross of $62,234 compared to $50,919 for The Empire Strikes Back from 126 screens.\r\nInitial reviews\r\nThe film had mixed reviews at the time of its opening in the United States. Janet Maslin of The New York Times lauded Nicholson's performance and praised the Overlook Hotel as an effective setting for horror, but wrote that \"the supernatural story knows frustratingly little rhyme or reason ... Even the film's most startling horrific images seem overbearing and perhaps even irrelevant.\" Variety was critical, stating \"With everything to work with ... Kubrick has teamed with jumpy Jack Nicholson to destroy all that was so terrifying about Stephen King's bestseller.\" A common initial criticism was the slow pacing, which was highly atypical of horror films of the time. Neither Gene Siskel nor Roger Ebert reviewed the film on their television show Sneak Previews when it was first released, but in his review for the Chicago Sun-Times, Ebert complained that it was hard to connect with any of the characters. In his Chicago Tribune review, Siskel gave the film two stars out of four and called it \"a crashing disappointment. The biggest surprise is that it contains virtually no thrills. Given Kubrick's world-class reputation, one's immediate reaction is that maybe he was after something other than thrills in the film. If so, it's hard to figure out what.\" Kevin Thomas of the Los Angeles Times wrote \"There are moments so visually stunning only a Kubrick could pull them off, yet the film is too grandiose to be the jolter that horror pictures are expected to be. Both those expecting significance from Kubrick and those merely looking for a good scare may be equally disappointed.\" Pauline Kael of The New Yorker stated \"Again and again, the movie leads us to expect something – almost promises it – and then disappoints us.\" Gary Arnold of The Washington Post wrote \"Stanley Kubrick's production of The Shining, a ponderous, lackluster distillation of Stephen King's best-selling novel, looms as the Big Letdown of the new film season. I can't recall a more elaborately ineffective scare movie.\"\r\nIt was one of only two films of Kubrick's last eleven films, the other being Eyes Wide Shut, to receive no nominations from the BAFTAs. It was the only one of Kubrick's last nine films to receive no nominations from either the Oscars or Golden Globes. Instead, it was Kubrick's only film to be nominated at the Razzie Awards, including Worst Director and Worst Actress (Duvall), in the first year that award was given. These nominations, especially Duvall's, have provoked backlash and controversy for years, and Duvall's nomination was retracted by the Razzie committee on March 31, 2022. Vincent Misiano's review in Ares magazine concluded: \"The Shining lays open to view all the devices of horror and suspense – endless eerie music, odd camera angles, a soundtrack of interminably pounding heart, hatchets and hunts. The result is shallow, self-conscious and dull. Read the book.\"\r\nReappraisal\r\nOn Rotten Tomatoes, the film has a \"certified fresh\" approval rating of 82% based on 102 reviews, with an average rating of 8.5 out of 10. The site's critical consensus reads: \"Though it deviates from Stephen King's novel, Stanley Kubrick's The Shining is a chilling, often baroque journey into madness -- exemplified by an unforgettable turn from Jack Nicholson.\" On Metacritic, it has a weighted average score of 66 out of 100 based on reviews from 26 critics, indicating \"generally favorable reviews\". Tim Cahill of Rolling Stone noted in an interview with Kubrick that by 1987 there was already a \"critical re-evaluation of in process\".\r\nIn 2001, the film was ranked 29th on AFI's 100 Years...100 Thrills list and Jack Torrance was named the 25th greatest villain on the AFI's 100 Years...100 Heroes and Villains list in 2003. In 2005, the quote \"Here's Johnny!\" was ranked 68 on AFI's 100 Years...100 Movie Quotes list. It had Channel 4's all-time scariest moment, and Bravo TV named one of the film's scenes sixth on their list of the 100 Scariest Movie Moments. Film critics Kim Newman and Jonathan Romney both placed it in their top ten lists for the 2002 Sight & Sound poll. In 2005, Total Film ranked The Shining as the 5th-greatest horror film of all time. Director Martin Scorsese placed it on his list of the 11 scariest horror films of all time. Mathematicians at King's College London (KCL) used statistical modeling in a study commissioned by Sky Movies to conclude that The Shining was the \"perfect scary movie\" due to a proper balance of various ingredients including shock value, suspense, gore and size of the cast. In 2010, The Guardian newspaper ranked it as the 5th \"best horror film of all time\". It was voted the 62nd greatest American film ever made in a 2015 poll conducted by BBC. In 2017, Empire magazine's readers' poll ranked the film at No. 35 on its list of \"The 100 Greatest Movies\". In 2021, The film was ranked at No. 2 by Time Out on their list of \"The 100 best horror movies\". Critics, scholars, and crew members (such as Kubrick's producer Jan Harlan) have discussed the film's enormous influence on popular culture. In 2006, Roger Ebert, who was initially critical of the work, inducted the film into his Great Movies series, saying \"Stanley Kubrick's cold and frightening The Shining challenges us to decide: Who is the reliable observer? Whose idea of events can we trust? ... It is this elusive open-endedness that makes Kubrick's film so strangely disturbing.\"\r\nWhile Duvall's performance was originally nominated for a Razzie, Razzies co-founder Maureen Murphy stated in 2022 that she regretted giving Duvall the Worst Actress nomination. On March 31, 2022, the Razzie committee officially rescinded Duvall's nomination, stating \"We have since discovered that Duvall's performance was impacted by Stanley Kubrick's treatment of her throughout the production.\" The retraction of the nomination was in response to public backlash The Razzies received after refusing to retract Bruce Willis's win for \"Worst Bruce Willis Performance in a 2021 Movie\", a one-off award for his roles in eight films released that calendar year. Willis's family announced the star's retirement after being diagnosed with aphasia, a cognitive brain condition, on March 30, 2022. The Razzie committee retracted both Willis's win and Duvall's nomination the following day. On Duvall's performance, Vulture magazine wrote in 2019: \"looking into Duvall's huge eyes from the front row of a theater, I found myself riveted by a very poignant form of fear. Not the fear of an actor out of her element, or the more mundane fear of a victim being chased around by an ax-wielding maniac. Rather, it was something far more disquieting, and familiar: the fear of a wife who's experienced her husband at his worst, and is terrified that she'll experience it again.\" Media site Screen Rant described Duvall as \"the heart of the film; she is out of her depth in dealing with her husband's looming insanity while trying to protect her young son, all while being fearful of the malevolence around her.\"\r\nHorror film critic Peter Bracke, reviewing the Blu-ray release in High-Def Digest, wrote:\r\nJust as the ghostly apparitions of the film's fictional Overlook Hotel would play tricks on the mind of poor Jack Torrance, so too has the passage of time changed the perception of The Shining itself. Many of the same reviewers who lambasted the film for \"not being scary\" enough back in 1980 now rank it among the most effective horror films ever made, while audiences who hated the film back then now vividly recall being \"terrified\" by the experience. The Shining has somehow risen from the ashes of its own bad press to redefine itself not only as a seminal work of the genre, but perhaps the most stately, artful horror ever made.\r\nIn 1999, Jonathan Romney discussed Kubrick's perfectionism and dispelled others' initial arguments that the film lacked complexity: \"The final scene alone demonstrates what a rich source of perplexity The Shining offers ... look beyond the simplicity and the Overlook reveals itself as a palace of paradox\". Romney further explains:\r\nThe dominating presence of the Overlook Hotel – designed by Roy Walker as a composite of American hotels visited in the course of research – is an extraordinary vindication of the value of mise en scène. It's a real, complex space that we don't just see but come to virtually inhabit. The confinement is palpable: horror cinema is an art of claustrophobia, making us loath to stay in the cinema but unable to leave. Yet it's combined with a sort of agoraphobia – we are as frightened of the hotel's cavernous vastness as of its corridors' enclosure ... The film sets up a complex dynamic between simple domesticity and magnificent grandeur, between the supernatural and the mundane in which the viewer is disoriented by the combination of spaciousness and confinement, and an uncertainty as to just what is real or not.\r\nResponse by Stephen King\r\nStephen King has been quoted as saying that although Kubrick made a film with memorable imagery, it was poor as an adaptation and that it is the only adaptation of his novels that he could \"remember hating\". However, in his 1981 nonfiction book Danse Macabre, King noted that Kubrick was among those \"filmmakers whose particular visions are so clear and fierce that ... fear of failure never becomes a factor in the equation,\" commenting that \"even when a director such as Stanley Kubrick makes such a maddening, perverse, and disappointing film as The Shining, it somehow retains a brilliance that is inarguable; it is simply there,\" and listed Kubrick's film among those he considered to have \"contributed something of value to the genre.\" Before the 1980 film, King often said he gave little attention to the film adaptations of his work.\r\nThe novel, written while King was suffering from alcoholism, contains an autobiographical element. King expressed disappointment that some themes, such as the disintegration of family and the dangers of alcoholism, are less present in the film. King also viewed the casting of Nicholson as a mistake, arguing it would result in a rapid realization among audiences that Jack would go insane, due to Nicholson's famous role as Randle McMurphy in One Flew Over the Cuckoo's Nest (1975). King had suggested that a more \"everyman\" actor such as Jon Voight, Christopher Reeve, or Michael Moriarty play the role, so that Jack's descent into madness would be more unnerving. In the novel, the story takes the child's point of view, while in the film the father is the main character; in fact, one of the most notable differences lies in Jack Torrance's psychological profile. According to the novel, the character represented an ordinary and balanced man who little by little loses control; furthermore, the written narration reflected personal traits of the author himself at that time (marked by insomnia and alcoholism), in addition to abuse. There is some allusion to these episodes in the American version of the film.\r\nIn an interview with the BBC, King criticized Duvall's character, stating that she is \"basically just there to scream and be stupid, and that's not the woman that I wrote about.\" King's Wendy is a strong and independent woman on a professional and emotional level; to Kubrick, on the other hand, it did not seem consistent that such a woman had long endured the personality of Jack Torrance.\r\nKing once suggested that he disliked the film's downplaying of the supernatural; King had envisioned Jack as a victim of the genuinely external forces haunting the hotel, whereas King felt Kubrick had viewed the haunting and its resulting malignancy as coming from within Jack himself. In October 2013, however, journalist Laura Miller wrote that the discrepancy between the two was almost the complete opposite:\r\nKing is, essentially, a novelist of morality. The decisions his characters make – whether it's to confront a pack of vampires or to break 10 years of sobriety – are what matter to him. But in Kubrick's The Shining, the characters are largely in the grip of forces beyond their control. It's a film in which domestic violence occurs, while King's novel is about domestic violence as a choice certain men make when they refuse to abandon a delusional, defensive entitlement. As King sees it, Kubrick treats his characters like \"insects\" because the director doesn't really consider them capable of shaping their own fates. Everything they do is subordinate to an overweening, irresistible force, which is Kubrick's highly developed aesthetic; they are its slaves. In King's The Shining, the monster is Jack. In Kubrick's, the monster is Kubrick.\r\nKing later criticized the film and Kubrick as a director:\r\nParts of the film are chilling, charged with a relentlessly claustrophobic terror, but others fall flat. Not that religion has to be involved in horror, but a visceral skeptic such as Kubrick just couldn't grasp the sheer inhuman evil of The Overlook Hotel. So he looked, instead, for evil in the characters and made the film into a domestic tragedy with only vaguely supernatural overtones. That was the basic flaw: because he couldn't believe, he couldn't make the film believable to others. What's basically wrong with Kubrick's version of The Shining is that it's a film by a man who thinks too much and feels too little; and that's why, for all its virtuoso effects, it never gets you by the throat and hangs on the way real horror should.\r\nKing was also disappointed by Kubrick's decision not to film at The Stanley Hotel in Estes Park, Colorado, which inspired the story (a decision Kubrick made since the hotel lacked sufficient snow and electricity). However, King finally supervised the 1997 television adaptation also titled The Shining, filmed at The Stanley Hotel.\r\nThe animosity of King toward Kubrick's adaptation has dulled over time. During an interview segment on the Bravo channel, King stated that the first time he watched Kubrick's adaptation, he found it to be \"dreadfully unsettling\". Nonetheless, writing in the afterword of Doctor Sleep, King professed continued dissatisfaction with the Kubrick film. He said of it \"... of course there was Stanley Kubrick's movie which many seem to remember – for reasons I have never quite understood – as one of the scariest films they have ever seen. If you have seen the movie but not read the novel, you should note that Doctor Sleep follows the latter which is, in my opinion, the True History of the Torrance Family.\"\r\nMike Flanagan, director of the film adaptation of Doctor Sleep, would reconcile the differences between novel and film versions of The Shining there. Doctor Sleep is a direct adaptation of its novel counterpart, which itself is a sequel to the novel version of The Shining, but is also a continuation of Kubrick's film; in explaining the latter, Flanagan expressed, \"The Shining is so ubiquitous and has burned itself into the collective imagination of people who love cinema in a way that so few movies have. There's no other language to tell that story in. If you say 'Overlook Hotel', I see something. It lives right up in my brain because of Stanley Kubrick. You can't pretend that isn't the case\". King initially rejected Flanagan's pitch of bringing back the Overlook as seen in Kubrick's film, but changed his mind after Flanagan pitched a scene within the hotel towards the end of the film that served as his reason to bring back the Overlook. Upon reading the script, King was so satisfied with the result that he said, \"Everything that I ever disliked about the Kubrick version of The Shining is redeemed for me here.\"\r\nAwards and nominations\r\nAmerican Film Institute recognition\r\n2001: AFI's 100 Years...100 Thrills – #29\r\n2003: AFI's 100 Years...100 Heroes & Villains: Jack Torrance – #25 Villain\r\nJack Torrance – #25 Villain\r\n2005: AFI's 100 Years...100 Movie Quotes: \"Here's Johnny!\" – #68\r\n\"Here's Johnny!\" – #68\r\nAnalysis\r\nSocial interpretations\r\nFilm critic Jonathan Romney writes that the film has been interpreted in many ways, including addressing the topics of the crisis in masculinity, sexism, corporate America, and racism. \"It's tempting to read The Shining as an Oedipal struggle not just between generations but between Jack's culture of the written word and Danny's culture of images\", Romney writes, \"Jack also uses the written word to more mundane purpose – to sign his 'contract' with the Overlook. 'I gave my word', ... which we take to mean 'gave his soul' in the ... Faustian sense. But maybe he means it more literally – by the end ... he has renounced language entirely, pursuing Danny through the maze with an inarticulate animal roar. What he has entered into is a conventional business deal that places commercial obligation ... over the unspoken contract of compassion and empathy that he seems to have neglected to sign with his family.\"\r\nNative Americans\r\nAmong interpreters who see the film reflecting more subtly the social concerns that animate other Kubrick films, one of the early viewpoints was discussed in an essay by ABC reporter Bill Blakemore titled \"Kubrick's 'Shining' Secret: Film's Hidden Horror Is The Murder of the Indian\", first published in The Washington Post on July 12, 1987. He believes that indirect references to American killings of Native Americans pervade the film, as exemplified by the Amerindian logos on the baking powder in the kitchen and the Amerindian artwork that appears throughout the hotel, though no Native Americans are seen. Stuart Ullman tells Wendy that when building the hotel, a few Indian attacks had to be fended off since it was constructed on an Indian burial ground.\r\nBlakemore's general argument is that the film is a metaphor for the genocide of Native Americans. He notes that when Jack kills Hallorann, the dead body is seen lying on a rug with an Indian motif. The blood in the elevator shafts is, for Blakemore, the blood of the Indians in the burial ground on which the hotel was built. The date of the final photograph, July 4, is meant to be ironic. Blakemore writes:\r\nAs with some of his other movies, Kubrick ends The Shining with a powerful visual puzzle that forces the audience to leave the theater asking, \"What was that all about?\" The Shining ends with an extremely long camera shot moving down a hallway in the Overlook, reaching eventually the central photo among 21 photos on the wall, each capturing previous good times in the hotel. At the head of the party is none other than the Jack we've just seen in 1980. The caption reads: \"Overlook Hotel – July 4th Ball – 1921.\" The answer to this puzzle, which is a master key to unlocking the whole movie, is that most Americans overlook the fact that July Fourth was no ball, nor any kind of Independence day, for native Americans; that the weak American villain of the film is the re-embodiment of the American men who massacred the Indians in earlier years; that Kubrick is examining and reflecting on a problem that cuts through the decades and centuries.\r\nFilm writer John Capo sees the film as an allegory of American imperialism. This is exemplified by many clues, such as the closing photo of Jack in the past at a Fourth of July party, or Jack's earlier reference to the Rudyard Kipling poem \"The White Man's Burden\", which was written to advocate the American colonial seizure of the Philippine islands, justifying imperial conquest as a mission-of-civilization.\r\nGeoffrey Cocks and Kubrick's concern with the Holocaust\r\nFilm historian Geoffrey Cocks has extended Blakemore's idea that the film has a subtext about Native Americans by arguing that the film indirectly reflects Stanley Kubrick's concerns about the Holocaust (both Cocks's book and Michael Herr's memoir of Kubrick discuss how he wanted his entire life to make a film dealing directly with the Holocaust but could never quite make up his mind). Cocks, writing in his book The Wolf at the Door: Stanley Kubrick, History and the Holocaust, proposed a controversial theory that all of Kubrick's work is informed by the Holocaust; there is, he says, a holocaust subtext in The Shining. This, Cocks believes, is why Kubrick's screenplay goes to emotional extremes, omitting much of the novel's supernaturalism and making the character of Wendy much more hysteria-prone. Cocks places Kubrick's vision of a haunted hotel in line with a long literary tradition of hotels in which sinister events occur, from Stephen Crane's short story \"The Blue Hotel\" (which Kubrick admired) to the Swiss Berghof in Thomas Mann's novel The Magic Mountain, about a snowbound sanatorium high in the Swiss Alps in which the protagonist witnesses a series of events which are a microcosm of the decline of Western culture.\r\nCocks claims that Kubrick has elaborately coded many of his historical concerns into the film with manipulations of numbers and colors and his choice of musical numbers, many of which are post-war compositions influenced by the horrors of World War II. Of particular note is Kubrick's use of Penderecki's The Awakening of Jacob to accompany Jack Torrance's dream of killing his family and Danny's vision of past carnage in the hotel, a piece of music originally associated with the horrors of the Holocaust.\r\nCocks's work has been anthologized and discussed in other works on Stanley Kubrick films, though sometimes with skepticism. Julian Rice, writing in the opening chapter of his book Kubrick's Hope, believes Cocks's views are excessively speculative and contain too many strained \"critical leaps\" of faith. Rice holds that what went on in Kubrick's mind cannot be replicated or corroborated beyond a broad vision of the nature of good and evil (which included concern about the Holocaust) but Kubrick's art is not governed by this one obsession. Diane Johnson, co-screenwriter for The Shining, commented on Cocks's observations, saying that preoccupation with the Holocaust on Kubrick's part could very likely have motivated his decision to place the hotel on a Native American burial ground, although Kubrick never directly mentioned it to her.\r\nLiterary allusions\r\nGeoffrey Cocks notes that the film contains many allusions to fairy tales, both Hansel and Gretel and the Three Little Pigs, with Jack Torrance identified as the Big Bad Wolf, which Bruno Bettelheim interprets as standing for \"all the asocial unconscious devouring powers\" that must be overcome by a child's ego.\r\nThe saying \"all work and no play makes Jack a dull boy\" appeared first in James Howell's Proverbs in English, Italian, French and Spanish (1659).\r\nAmbiguities in the film\r\nRoger Ebert notes that the film does not really have a \"reliable observer\", with the possible exception of Dick Hallorann. Ebert believes various events call into question the reliability of Jack, Wendy and Danny. This leads Ebert to conclude that:\r\nKubrick is telling a story with ghosts (the two girls, the former caretaker and a bartender), but it isn't a \"ghost story\", because the ghosts may not be present in any sense at all except as visions experienced by Jack or Danny.\r\nEbert concludes that \"The movie is not about ghosts but about madness and the energies it sets loose in an isolated situation primed to magnify them\". The film critic James Berardinelli notes that \"King would have us believe that the hotel is haunted. Kubrick is less definitive in the interpretations he offers.\" He dubs the film a failure as a ghost story, but brilliant as a study of \"madness and the unreliable narrator\".\r\nGhosts versus cabin fever\r\nIn some sequences, there is a question of whether or not there are ghosts present. In the scenes where Jack sees ghosts, he is always facing a mirror or, in the case of his storeroom conversation with Grady, a reflective, highly polished door. Film reviewer James Berardinelli notes \"It has been pointed out that there's a mirror in every scene in which Jack sees a ghost, causing us to wonder whether the spirits are reflections of a tortured psyche.\" In Hollywood's Stephen King, Tony Magistrale wrote,\r\nKubrick's reliance on mirrors as visual aids for underscoring the thematic meaning of this film portrays visually the internal transformations and oppositions that are occurring to Jack Torrance psychologically. Through ... these devices, Kubrick dramatizes the hotel's methodical assault on Torrance's identity, its ability to stimulate the myriad of self-doubts and anxieties by creating opportunities to warp Torrance's perspective on himself and. Furthermore the fact that Jack looks into a mirror whenever he \"speaks\" to the hotel means, to some extent, that Kubrick implicates him directly into the hotel's \"consciousness\", because Jack is, in effect, talking to himself.\r\nGhosts are the implied explanation for Jack's seemingly physically impossible escape from the locked storeroom. In an interview of Kubrick by scholar Michel Ciment, the director made comments about the scene in the book that may imply he similarly thought of the scene in the film as a key reveal in this dichotomy:\r\nIt seemed to strike an extraordinary balance between the psychological and the supernatural in such a way as to lead you to think that the supernatural would eventually be explained by the psychological: 'Jack must be imagining these things because he's crazy.' This allowed you to suspend your doubt of the supernatural until you were so thoroughly into the story that you could accept it almost without noticing ... It's not until Grady, the ghost of the former caretaker who axed to death his family, slides open the bolt of the larder door, allowing Jack to escape, that you are left with no other explanation but the supernatural.\r\nThe two Gradys and other doubles\r\nEarly in the film, Stuart Ullman tells Jack of a previous caretaker, Charles Grady, who, in 1970, succumbed to cabin fever, murdered his family and then killed himself. Later, Jack meets a ghostly butler named Grady. Jack says that he knows about the murders, claiming to recognize Grady from pictures, but the butler introduces himself as Delbert Grady.\r\nGordon Dahlquist of The Kubrick FAQ argues that the name change \"deliberately mirrors Jack Torrance being both the husband of Wendy/father of Danny and the mysterious man in the 1920s July Fourth photo. It is to say he is two people: the man with choice in a perilous situation and the man who has 'always' been at the Overlook. It's a mistake to see the final photo as evidence that the events of the film are predetermined: Jack has any number of moments where he can act other than the way he does and that his (poor) choices are fueled by weakness and fear perhaps merely speaks all the more to the questions about the personal and the political that The Shining brings up. In the same way Charles had a chance – once more, perhaps – to not take on Delbert's legacy, so Jack may have had a chance to escape his role as 'caretaker' to the interests of the powerful. It's the tragic course of this story that he chooses not to.\"\r\nDahlquist's argument is that Delbert Grady, the 1920s butler, and Charles Grady, the 1970s caretaker, rather than being either two people or the same are two 'manifestations' of a similar entity; a part permanently at the hotel (Delbert) and the part which is given the choice of whether to join the legacy of the hotel's murderous past (Charles), just as the man in the photo is not exactly Jack Torrance but nor is he someone different. Jack in the photo has 'always' been at the Overlook; Jack the caretaker chooses to become part of the hotel. The film's assistant editor Gordon Stainforth has commented on this issue, attempting to steer a course between the continuity-error explanation on one side and the hidden-meaning explanation on the other; \"I don't think we'll ever quite unravel this. Was his full name Charles Delbert Grady? Perhaps Charles was a sort of nickname? Perhaps Ullman got the name wrong? But I also think that Stanley did NOT want the whole story to fit together too neatly, so absolutely correct, I think, to say that 'the sum of what we learn refuses to add up neatly'.\"\r\nAmong Kubrick's other doubling/mirroring effects in the film:\r\nIn the U.S. version, Jack's interview with Ullman, whose confident affability contrasts with Jack's seemingly forced nonchalance, is paired with Wendy's meeting with a female doctor, whose somber and professional manner contrasts with Wendy's nervousness.\r\nDuring the interview, Jack and Ullman are joined by a hotel employee named Bill Watson, who looks similar to Jack from behind, creating a pseudo–mirror image effect as they sit in chairs to the front-left and front-right of Ullman's desk.\r\nThe Grady sisters look so similar that they appear to be twins, though they are different ages (Ullman states that he thinks that they were about eight and ten).\r\nOn two occasions, Ullman says goodbye to two young female employees and in the second case, they closely resemble each other.\r\nThe film contains two mazes, the hedges outside and, per Wendy's characterization, the Overlook. The hedge maze appears in two forms, the 13-foot-high version outside and the model inside the Overlook. In the overhead shot zooming down on Wendy and Danny in the center of the maze, the maze differs from the map outside and from the model having far more corridors, and the left and right sides are mirror images of each other. The Overlook significantly breaks down into two sections, one old and one remodeled; one past, one present.\r\nTwo versions of the bathing woman inhabit Room 237.\r\nIn Hallorann's Miami bedroom, two paintings showing similar nude black women are seen on opposite walls just before he experiences a \"shining\".\r\nThere appear to be two Jack Torrances, the one who goes mad and freezes to death in the present and the one who appears in a 1921 photograph that hangs on the gold corridor wall inside the Overlook.\r\nThe photograph\r\nAt the end of the film, the camera moves slowly towards a wall in the Overlook and a 1921 photograph, revealed to include Jack seen at the middle of a 1921 party. In an interview with Michel Ciment, Kubrick said that the photograph suggests that Jack was a reincarnation of an earlier official at the hotel. This has not stopped alternative readings, such as that Jack has been \"absorbed\" into the Overlook Hotel. Film critic Jonathan Romney, while acknowledging the absorption theory, wrote:\r\nAs the ghostly butler Grady (Philip Stone) tells him during their chilling confrontation in the men's toilet, 'You're the caretaker, sir. You've always been the caretaker.' Perhaps in some earlier incarnation Jack really was around in 1921, and it's his present-day self that is the shadow, the phantom photographic copy. But if his picture has been there all along, why has no one noticed it? After all, it's right at the center of the central picture on the wall, and the Torrances have had a painfully drawn-out winter of mind-numbing leisure in which to inspect every corner of the place. Is it just that, like Poe's purloined letter, the thing in plain sight is the last thing you see? When you do see it, the effect is so unsettling because you realise the unthinkable was there under your nose – overlooked – the whole time.\r\nSpatial layout of the Overlook Hotel\r\nScreenwriter Todd Alcott has noted:\r\nMuch has been written, some of it quite intelligent, about the spatial anomalies and inconsistencies in The Shining: there are rooms with windows that should not be there and doors that couldn't possibly lead to anywhere, rooms appear to be in one place in one scene and another place in another, wall fixtures and furniture pieces appear and disappear from scene to scene, props move from one room to another, and the layout of the Overlook makes no physical sense.\r\nArtist Juli Kearns first identified and created maps of spatial discrepancies in the layout of the Overlook Hotel, the interiors of which were constructed in studios in England. These spatial discrepancies included windows appearing in impossible places, such as in Stuart Ullman's office, which is surrounded by interior hallways, and apartment doorways positioned in places where they cannot possibly lead to apartments. Rob Ager is another proponent of this theory. Jan Harlan, an Executive Producer on The Shining, was asked about the discontinuity of sets by Xan Brooks of The Guardian and confirmed the discontinuity was intentional, \"The set was very deliberately built to be offbeat and off the track, so that the huge ballroom would never actually fit inside. The audience is deliberately made not to know where they're going. People say The Shining doesn't make sense. Well spotted! It's a ghost movie. It's not supposed to make sense.\" Harlan further elaborated to Kate Abbot, \"Stephen King gave him the go-ahead to change his book, so Stanley agreed – and wrote a much more ambiguous script. It's clear instantly there's something foul going on. At the little hotel, everything is like Disney, all kitsch wood on the outside – but the interiors don't make sense. Those huge corridors and ballrooms couldn't fit inside. In fact, nothing makes sense.\"\r\nComparison with the novel\r\nThe film differs from the novel significantly with regard to characterization and motivation of action. The most obvious differences are those regarding the personality of Jack Torrance (the source of much of author Stephen King's dissatisfaction with the film).\r\nMotivation of ghosts\r\nIn the film, the motive of the ghosts is apparently to \"reclaim\" Jack (although Grady expresses an interest in Danny's \"shining\" ability), who seems to be a reincarnation of a previous caretaker of the hotel, as suggested by the 1920s photograph of Jack at the end of the film and Jack's repeated claims to have \"not just a déjà vu\". The film is more focused on Jack (as opposed to Danny) than the novel.\r\nRoom number\r\nThe room number 217 has been changed to 237. Timberline Lodge, located on Mount Hood in Oregon, was used for the aerial exterior shots of the fictional Overlook Hotel. The Lodge requested that Kubrick not depict Room 217 (featured in the book) in The Shining, because future guests at the Lodge might be afraid to stay there, and a nonexistent room, 237, was substituted in the film. Contrary to the hotel's expectations, Room 217 is requested more often than any other room at Timberline.\r\nThere are fringe analyses relating this number change to rumors that Kubrick faked the first Moon landing, as there are approximately 237,000 miles between the Earth and the Moon (average is 238,855 miles), and claiming that the film is a subtle confession of his involvement. Another theory posits an obsession with the number 42 in the film, and the product of the digits in 237 is 42.\r\nJack Torrance\r\nThe novel initially presents Jack as likeable and well-intentioned, yet haunted by the demons of alcohol and authority issues. Nonetheless, he becomes gradually overwhelmed by what he sees as the evil forces in the hotel. At the novel's conclusion, it is suggested that the evil hotel forces have possessed Jack's body and proceeded to destroy all that is left of his mind during a final showdown with Danny. He leaves a monstrous entity that Danny is able to divert while he, Wendy and Dick Hallorann escape. The film's Jack is established as somewhat sinister much earlier in the story and dies in a different manner. Jack kills Dick Hallorann in the film, but only wounds him in the novel. King attempted to talk Stanley Kubrick out of casting Jack Nicholson even before filming began, on the grounds that he seemed vaguely sinister from the very beginning of the film.\r\nOnly in the novel does Jack hear the haunting, heavy-handed voice of his father, with whom he had a troubled relationship. In both the novel and film, Jack's encounter with the ghostly bartender is pivotal to Jack's deterioration. However, the novel gives much more detail about Jack's problems with drinking and alcohol.\r\nThe film prolongs Jack's struggle with writer's block. Kubrick's co-screenwriter Diane Johnson believes that in King's novel, Jack's discovery of the scrapbook of clippings in the boiler room of the hotel, which gives him new ideas for a novel, catalyzes his possession by the ghosts of the hotel, while at the same time unblocking his writing. Jack is no longer a blocked writer, but now filled with energy. In her contribution to the screenplay, Johnson wrote an adaptation of this scene, which to her regret Kubrick later excised, as she felt this left the father's change less motivated. Kubrick showed Jack's continued blockage quite late in the film with the \"all work and no play makes Jack a dull boy\" scene, which does not appear in the novel.\r\nStephen King stated on the DVD commentary of the 1997 miniseries of The Shining that the character of Jack Torrance was partially autobiographical, as he was struggling with both alcoholism and unprovoked rage toward his family at the time of writing. Tony Magistrale wrote about Kubrick's version of Jack Torrance in Hollywood's Stephen King:\r\nKubrick's version of Torrance is much closer to the tyrannical Hal (from Kubrick's 2001: A Space Odyssey) and Alex (from Kubrick's A Clockwork Orange) than he is to King's more conflicted, more sympathetically human characterization.\r\nFrom Thomas Allen Nelson's Kubrick: Inside a Film Artist's Maze: \"When Jack moves through the reception area on his way to a 'shining' over the model maze, he throws a yellow tennis ball past a stuffed bear and Danny's Big Wheel, which rests on the very spot (a Navajo circle design) where Hallorann will be murdered.\" Jack's tennis ball mysteriously rolls into Danny's circle of toy cars just before the boy walks through the open door of Room 237.\r\nIn the film's opening, the camera from above moves over water and through mountains with the ease of a bird in flight. Below, on a winding mountain road, Jack's diminutive yellow Volkswagen journeys through a tree-lined maze, resembling one of Danny's toy cars or the yellow tennis ball seen later outside of Room 237.\r\nDanny Torrance\r\nDanny Torrance is considerably more open about his supernatural abilities in the novel, discussing them with strangers such as his doctor. In the film, he is quite secretive about them even with his prime mentor Dick Hallorann, who also has these abilities. The same is true of Dick Hallorann, who in his journey back to the Overlook in the book, talks with others with the \"shining\" ability, while in the film he lies about his reason for returning to the Overlook. Danny in the novel is generally portrayed as unusually intelligent across the board. In the film, he is more ordinary, though with a preternatural gift.\r\nAlthough Danny has supernatural powers in both versions, the novel makes it clear that his apparent imaginary friend \"Tony\" really is a projection of hidden parts of his own psyche, though heavily amplified by Danny's psychic \"shining\" abilities. At the end it is revealed that Danny Torrance's middle name is \"Anthony\".\r\nWendy Torrance\r\nWendy Torrance in the film is relatively meek, submissive, passive, gentle, and mousy; this is shown by the way she defends Jack even in his absence to the doctor examining Danny. In the novel, she is a far more self-reliant and independent personality, who is tied to Jack in part by her poor relationship with her parents. In the novel, she never displays hysteria or collapses the way she does in the film, but remains cool and self-reliant. Writing in Hollywood's Stephen King, author Tony Magistrale writes about the mini-series remake:\r\nDe Mornay restores much of the steely resilience found in the protagonist of King's novel and this is particularly noteworthy when compared to Shelley Duvall's exaggerated portrayal of Wendy as Olive Oyl revisited: A simpering fatality of forces beyond her capacity to understand, much less surmount.\r\nCo-screenwriter Diane Johnson stated that in her contributions to the script, Wendy had more dialogue, and that Kubrick cut many of her lines, possibly due to his dissatisfaction with actress Shelley Duvall's delivery. Johnson believes that the earlier draft of the script portrayed Wendy as a more rounded character.\r\nStuart Ullman\r\nIn the novel, Jack's interviewer, Ullman, is highly authoritarian, a kind of snobbish martinet. The film's Ullman is far more humane and concerned about Jack's well-being, as well as smooth and self-assured. Only in the novel does Ullman state that he disapproves of hiring Jack but higher authorities have asked that Jack be hired. Ullman's bossy nature in the novel is one of the first steps in Jack's deterioration, whereas in the film, Ullman serves largely as an expositor.\r\nIn Stanley Kubrick and the Art of Adaptation, author Greg Jenkins writes \"A toadish figure in the book, Ullman has been utterly reinvented for the film; he now radiates charm, grace and gentility.\"\r\nFrom Kubrick: Inside a Film Artist's Maze: Ullman tells Jack that the hotel's season runs from May 15 to October 30, meaning that the Torrances moved in on Halloween (October 31). On Ullmann's desk next to a small American flag sits a metal cup containing pencils and a pen – and a miniature replica of an ax.\r\n\"When Ullman, himself all smiles, relates as a footnote the story about the former caretaker who 'seemed perfectly normal' but nevertheless cut up his family with an ax, Jack's obvious interest (as if he's recalling one of his own nightmares) and his insincere congeniality (early signs of a personality malfunction) lead the viewer to believe that the film's definition of his madness will be far more complex.\"\r\nFamily dynamics\r\nStephen King provides the reader with a great deal of information about the stress in the Torrance family early in the story, including revelations of Jack's physical abuse of Danny and Wendy's fear of Danny's mysterious spells. Kubrick tones down the early family tension and reveals family disharmony much more gradually than does King. In the film, Danny has a stronger emotional bond with Wendy than with Jack, which fuels Jack's rather paranoid notion that the two are conspiring against him. The exact opposite is true in the book, where Wendy occasionally experiences jealousy at the fact that Danny clearly prefers Jack to her.\r\nPlot differences\r\nIn the novel Jack recovers his sanity and goodwill through the intervention of Danny while this does not occur in the film. Writing in Cinefantastique magazine, Frederick Clarke suggests, \"Instead of playing a normal man who becomes insane, Nicholson portrays a crazy man attempting to remain sane.\" In the novel, Jack's final act is to enable Wendy and Danny to escape the hotel before it explodes due to a defective boiler, killing him. The film ends with the hotel still standing. More broadly, the defective boiler is a major element of the novel's plot, entirely missing from the film version.\r\nBecause of the limitations of special effects at the time, the living topiary animals of the novel were omitted and a hedge maze was added, acting as a final trap for Jack Torrance as well as a refuge for Danny.\r\nIn the film, the hotel possibly derives its malevolent energy from being built on a Native American burial ground. In the novel, the reason for the hotel's manifestation of evil is possibly explained by a theme present in King's previous novel Salem's Lot as well as Shirley Jackson's The Haunting of Hill House: a physical place may absorb the evils that transpire there and manifest them as a vaguely sentient malevolence. The film's Hallorann speaks to Danny about that phenomenon occurring at the Overlook. In the novel, Jack does a great deal of investigation of the hotel's past through a scrapbook, a subplot almost omitted from the film aside from two touches: a brief appearance of the scrapbook beside the typewriter, and Jack's statement to the ghost of Grady that he knows his face from an old newspaper article describing the latter's horrific acts. Kubrick in fact shot a scene where Jack discovers the scrapbook but removed it during post-production, a decision which co-screenwriter Diane Johnson lamented.\r\nSome of the film's most iconic scenes, such as the ghost girls in the hallway, the torrent of blood from the elevators, and typewritten pages Wendy discovers on Jack's desk, are unique to the film. Similarly, many of the most memorable lines of dialogue (\"Words of wisdom\" and \"Here's Johnny!\") are heard exclusively in the film.\r\nFilm adaptation commentary\r\nAlthough Stephen King fans were critical of the novel's adaptation on the grounds that Kubrick altered and reduced the novel's themes, a defense of Kubrick's approach was made in Steve Biodrowski's review of the film. He argues that as in earlier films, Kubrick stripped out the back story of the film, reducing it to a \"basic narrative line\", making the characters more like archetypes. His review of the film is one of the few to go into detailed comparison with the novel. He writes, \"The result ... a brilliant, ambitious attempt to shoot a horror film without the Gothic trappings of shadows and cobwebs so often associated with the genre.\"\r\nInfluence in popular culture\r\nBoth parodies and homages to The Shining are prominent in U.K. and U.S. popular culture, particularly in films, TV shows, video games and music. Images and scenes including the Grady girls in the hallway, the word \"Redrum\", the blood spilling out of the elevator doors and Jack sticking his head through the hole in the bathroom door, saying, \"Here's Johnny\", are frequently referenced in the media.\r\nDirector Tim Burton, who credits Kubrick as an influence, modeled the characters of Tweedledum and Tweedledee in his 2010 version of Alice in Wonderland on the Grady girls (like so many viewers of the film, Burton identifies the girls as twins in spite of Ullman's dialogue to the contrary).\r\nThe Simpsons 1994 episode \"Treehouse of Horror V\" includes a parody titled \"The Shinning\". Similarities include Sherri and Terri, the twins in Bart's fourth grade class looking visually similar to the Grady girls, Homer writing \"No TV and No Beer Make Homer Go Crazy\" and Homer breaking into a room with an axe and uttering 'here's Johnny', only to discover that he had entered the wrong room and using the introduction for 60 Minutes instead. The season 30 2019 episode \"Girl's in the Band\" has Homer, driven mad from working double shifts at the nuclear power plant, experiencing a Gold Room party scene with Lloyd followed by an axe-wielding Human Resources Director who resembles Nicholson's character.\r\nDutch dance music duo Hocus Pocus sampled Nicholson's \"Here's Johnny\" line in their 1993 dance song \"Here's Johnny\". In 1994, the song would go number 1 in Australia, making it the first dance single to do so, without radio support in Australia. It stayed at the number one position on the Australian ARIA Charts for five weeks through to 1995.\r\nAmerican heavy metal band Slipknot pay homage to the film in their first music video for their 2000 song \"Spit It Out\", directed by Thomas Mignone. The video consists of conceptual imagery of the band members each portraying characters enacting iconic scenes from the film, with Joey Jordison as Danny Torrance; Shawn Crahan and Chris Fehn as the Grady sisters; Corey Taylor as Jack Torrance; Mick Thomson as Lloyd the Bartender; Craig Jones as Dick Hallorann; James Root as Wendy Torrance; Paul Gray as Harry Derwent; and Sid Wilson as the corpse in the bathtub. The video was banned from MTV for overtly graphic and violent depictions, including Corey Taylor's smashing through a door with an axe and the scene wherein James Root viciously assaults Corey Taylor with a baseball bat. Mignone and the band eventually re-edited a less violent version, which was subsequently aired on MTV.\r\nThe film's haunted ballroom scene served as inspiration for English musician Leyland Kirby to create the Caretaker alias; his debut album Selected Memories from the Haunted Ballroom (1999) featured a prominent influence from the film.\r\nAmerican rock band Thirty Seconds to Mars produced a music video for their 2006 single \"The Kill\" which is an extended homage to the film. The music video is set in a haunted hotel, and replicates imagery from the film including the black intertitles with white text, Jack's typewriter, Lloyd's bar, Jack bouncing a tennis ball against a wall, the ghostly woman in the bathroom, the murdered Grady sisters, and the hotel guest being fellated by another man dressed as a bear. The music video was directed by lead singer Jared Leto.\r\nThe film was played at the drive-in theater alongside Psycho as part of the Night of Horrors combo in Twister from 1996. In the 2003 animated film Finding Nemo, Bruce the shark says \"Here's Brucey!\", which is inspired from the \"Here's Johnny!\" quote.\r\nThe 2017 song \"Enjoy Your Slay\" by American metalcore band Ice Nine Kills is inspired primarily by the novel as well as the film adaption. The song also features Stanley Kubrick's grandson Sam Kubrick as guest vocalist.\r\nThe TV series Psych has a 2012 episode titled \"Heeeeere's Lassie\" in which the plot and characters are based on the film. \"Here's Johnny!\" was parodied by British comedian Lenny Henry in an advertisement for Premier Inn. It was banned from being screened on a children's TV network.\r\nVince Gilligan, being a fan of Kubrick and his \"non-submersible moments\", has included references to Kubrick movies in many of his works. \"I'm happy to see that his inspiration has shown in noticeable ways in our work in Breaking Bad and Better Call Saul\", says Gilligan. Breaking Bad's 2010 episode \"Sunset\" has a cop radioing for assistance and begins, \"KDK-12\" – the radio address at the Overlook, before being axed. The axe-murdered Grady twins in The Shining are turned into the axe-murdering Salamanca twins in Breaking Bad. The descent of the main character, school teacher Walt, into the dark killer has some similarities to Jack's arc. Reflections are used in both to show the characters change. Better Call Saul has a \"Here's Johnny\" scare in a flashback. Gilligan has also likened his early writing situation, getting snowed in and not writing, to feeling like Jack while going insane.\r\nSteven Spielberg, a close friend of Kubrick, included a sequence dedicated to The Shining in the 2018 film Ready Player One when they could not get rights to use Blade Runner for a similar sequence. The Overlook Hotel is recreated, including the Grady sisters, the elevator, room 237, the lady in the bath tub, the ballroom, and the 1921 photo, in addition to using the score. Spielberg considered this inclusion a tribute to Kubrick.\r\nIn his 2019 novel The Institute, Stephen King refers to the film, writing, \"The little girls, Gerda and Greta, were standing and watching with wide, frightened eyes. They were holding hands and clutching dolls as identical as they were. They reminded Luke of twins in some old horror movie.\"\r\nIn 2020, the fifth-season episode \"Our Mojo\" of Lucifer paid homage to Kubrick and The Shining by having a young boy riding on a tricycle down a corridor in a hotel with wallpaper similar to the carpet pattern in the film.\r\nSequel and spin-off\r\nIn 2014, Warner Bros. Pictures began developing a film adaptation of Doctor Sleep (2013), Stephen King's sequel to his book, The Shining (1977). In 2016, Akiva Goldsman announced that he would write and produce the film for Warner Bros. For several years, Warner Brothers could not secure a budget for the sequel nor for a prequel to The Shining to be called Overlook Hotel.\r\nIn June 2019, writer and director Mike Flanagan confirmed Doctor Sleep would be a sequel to both the 1980 film and King's novel. It was released in several international territories on October 31, 2019, followed by the United States and Canada on November 8, 2019.\r\nIn April 2020, a spin-off titled Overlook entered development for HBO Max. In August 2021, HBO Max opted not to proceed with the project. It was soon after reported Netflix was a frontline bidder on the project, though they, too, eventually passed.",
    "html": "<p>The Shining is a 1980 psychological horror film produced and directed by Stanley Kubrick and co-written with novelist Diane Johnson. The film is based on Stephen King's 1977 novel of the same name and stars Jack Nicholson, Shelley Duvall, Scatman Crothers, and Danny Lloyd. The film's central character is Jack Torrance (Nicholson), an aspiring writer and recovering alcoholic who accepts a position as the off-season caretaker of the isolated historic Overlook Hotel in the Colorado Rockies, with his wife, Wendy Torrance (Duvall), and young son, Danny Torrance (Lloyd). Danny is gifted with psychic abilities named \"shining\". After a winter storm leaves the Torrances snowbound, Jack's sanity deteriorates due to the influence of the supernatural forces that inhabit the hotel.</p><p>Production took place almost exclusively at EMI Elstree Studios, with sets based on real locations. Kubrick often worked with a small crew, which allowed him to do many takes, sometimes to the exhaustion of the actors and staff. The new Steadicam mount was used to shoot several scenes, giving the film an innovative and immersive look and feel. There has been much speculation about the meanings and actions in the film because of inconsistencies, ambiguities, symbolism, and differences from the book.</p><p>The film was released in the United States on May 23, 1980, and in the United Kingdom on October 2 by Warner Bros. There were several versions for theatrical releases, each of which was cut shorter than the preceding cut; about 27 minutes was cut in total. Reactions to the film at the time of its release were mixed; Stephen King criticized the film due to its deviations from the novel. The film received two controversial nominations at the Razzies—Worst Director and Worst Actress (for Duvall)—the latter of which was later rescinded due to Kubrick's treatment of Duvall on set. Critical response to the film has since become more favorable.</p><p>In 2012, The Shining was ranked the 75th greatest film of all time in the Sight & Sound directors' poll. In 2018, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". Thirty-nine years after the original film, a sequel, Doctor Sleep, was released on November 8, 2019.</p><br/><h3>Plot</h3><p>Jack Torrance takes a winter caretaker position at the remote Overlook Hotel in the Rocky Mountains, which closes every winter season. After his arrival, manager Stuart Ullman advises Torrance that a previous caretaker, Charles Grady, killed his family and himself in the hotel.</p><p>In Boulder, Jack's son, Danny, has a premonition and seizure. Jack's wife, Wendy, tells the doctor about a past incident when Jack accidentally dislocated Danny's shoulder during a drunken rage. Jack has been sober ever since. Before leaving for the seasonal break, the Overlook's head chef Dick Hallorann informs Danny of a telepathic ability the two share, which he calls \"shining\". Hallorann tells Danny the hotel also has a \"shine\" due to residue from unpleasant past events, and warns him to avoid Room 237.</p><p>A month passes and Danny starts having frightening visions, including of two murdered twin sisters. Meanwhile, Jack's mental health deteriorates; he gets nowhere with his writing, is prone to violent outbursts, and has dreams of killing his family. Danny gets lured to room 237 by unseen forces and Wendy later finds him with signs of physical trauma. Jack investigates and encounters a female ghost in the room, but blames Danny for self-inflicting the bruises. Jack is enticed back to drinking by the ghostly bartender Lloyd. Ghostly figures, including Delbert Grady, then begin appearing in the Gold Room. Grady informs Jack that Danny has telepathically contacted Hallorann for assistance, and says that Jack must \"correct\" his wife and child.</p><p>Wendy finds Jack's manuscript written with nothing but countless repetitions of \"All work and no play makes Jack a dull boy\". When Jack threatens her life, Wendy knocks him unconscious with a baseball bat and locks him in the kitchen pantry, but she and Danny cannot leave due to Jack having previously sabotaged the hotel's two-way radio and snowcat. Back in their hotel room, Danny says \"redrum\" repeatedly and even writes the word in lipstick on the bathroom door. Wendy sees the word in the mirror and realizes that it is actually \"murder\" spelled backwards.</p><p>Jack is freed by the ghost of Grady and goes after Wendy and Danny with an axe. Danny escapes outside through the bathroom window, and Wendy fights Jack off with a knife when he tries to break through the door. Hallorann, having flown back to Colorado from his Florida vacation to respond to Danny's telepathic SOS, reaches the hotel in another snowcat. His arrival distracts Jack, who ambushes and murders him in the lobby, then pursues Danny into the hedge maze. Wendy runs through the hotel looking for Danny, encountering the hotel's ghosts and a vision of cascading blood similar to Danny's premonition.</p><p>In the hedge maze, Danny misleads Jack and hides behind a snowdrift while Jack follows a false trail. Danny and Wendy reunite and leave in Hallorann's snowcat, leaving Jack to freeze to death in the maze. In a photograph in the hotel hallway, Jack is pictured standing amidst a crowd of party revelers from July 4, 1921.</p><br/><h3>Cast</h3><ul><li>Jack Nicholson as Jack Torrance</li><li>Shelley Duvall as Wendy Torrance</li><li>Danny Lloyd as Danny \"Doc\" Torrance</li><li>Scatman Crothers as Dick Hallorann</li><li>Barry Nelson as Stuart Ullman</li><li>Philip Stone as Delbert Grady</li><li>Joe Turkel as Lloyd</li><li>Anne Jackson as Doctor</li><li>Tony Burton as Larry Durkin</li><li>Lia Beldam as Young Woman in Bath</li><li>Billie Gibson as Old Woman in Bath</li><li>Barry Dennen as Bill Watson</li><li>Lisa and Louise Burns as Grady Twins</li></ul><p>In the European cut, all of the scenes involving Jackson and Burton were removed but the credits remained unchanged. Dennen is on-screen in all versions of the film, albeit to a limited degree (and with no dialogue) in the European cut.</p><p>The actresses who played the ghosts of the murdered Grady daughters, Lisa and Louise Burns, are identical twins; however, the characters in the book and film script are merely sisters, not twins. In the film's dialogue, Ullman says he thinks they were \"about eight and ten\". Nonetheless, they are frequently referred to in discussions about the film as \"the Grady twins\".</p><p>The resemblance in the staging of the Grady girls and the \"Twins\" photograph by Diane Arbus has been noted both by Arbus' biographer, Patricia Bosworth, the Kubrick assistant who cast and coached them, Leon Vitali, and by numerous Kubrick critics. Although Kubrick both met Arbus personally and studied photography under her during his time as photographer for Look magazine, Kubrick's widow says he did not deliberately model the Grady girls on Arbus' photograph, in spite of widespread attention to the resemblance.</p><br/><h3>Production</h3><h4>Genesis</h4><p>Before making The Shining, Kubrick directed the film Barry Lyndon (1975), a highly visual period film about an Irishman who attempts to make his way into the British aristocracy. Despite its technical achievements, the film was not a box-office success in the United States and was derided by critics for being too long and too slow. Kubrick, disappointed with Barry Lyndon's lack of success, realized he needed to make a film that would be commercially viable as well as artistically fulfilling. Stephen King was told that Kubrick had his staff bring him stacks of horror books as he planted himself in his office to read them all: \"Kubrick's secretary heard the sound of each book hitting the wall as the director flung it into a reject pile after reading the first few pages. Finally one day the secretary noticed it had been a while since she had heard the thud of another writer's work biting the dust. She walked in to check on her boss and found Kubrick deeply engrossed in reading The Shining\".</p><p>Speaking about the theme of the film, Kubrick stated that \"there's something inherently wrong with the human personality. There's an evil side to it. One of the things that horror stories can do is to show us the archetypes of the unconscious; we can see the dark side without having to confront it directly\".</p><h4>Casting</h4><p>Nicholson was Kubrick's first choice for the role of Jack Torrance; other actors considered included Robert De Niro (who said the film gave him nightmares for a month), Robin Williams, and Harrison Ford, all of whom met with Stephen King's disapproval. Stephen King, for his part, disavowed Nicholson because he thought that, since he had shot One Flew Over the Cuckoo's Nest, the viewer would tend to consider him an unstable individual from the beginning. For this reason, King preferred Jon Voight, Michael Moriarty, or Martin Sheen for the role, who would more faithfully represent the profile of the ordinary individual who is gradually driven to madness. In any case, from the beginning the writer was told that the actor for the lead role \"was not negotiable.\"</p><p>Although Jack Nicholson initially suggested that Jessica Lange would be a better fit for Stephen King's Wendy, Shelley Duvall knew early that she was the one cast for the role (Nicholson would work with Lange on his next movie, The Postman Always Rings Twice). Wendy's character in the film differs notably from the novel, where she appears more capable and less vulnerable. Throughout the filming Kubrick pushed Duvall hard. It is said that the scene in which, armed with the baseball bat, she walks backwards up the stairs before the attack of her husband (one of the most reshot scenes in all of cinema), she was not representing a terrified woman; Shelley was literally \"terrified\". According to the \"Guinness Book of Records\", Kubrick demanded the shot be repeated 127 times.</p><p>The director's initial candidate to play the Torrances' son was Cary Guffey (Close Encounters of the Third Kind), but the young actor's parents prevented him, claiming that the film was too gruesome for a child. In his search to find the right actor to play Danny, Kubrick sent a husband-and-wife team, Leon (who portrayed Lord Bullingdon in Barry Lyndon) and Kersti Vitali, to Chicago, Denver, and Cincinnati to create an interview pool of 5,000 boys over a six-month period. These cities were chosen since Kubrick was looking for a boy with an accent that fell between Jack Nicholson's and Shelley Duvall's speech patterns, with Nicholson coming from New Jersey and Duvall from Texas. During the filming, the young actor was protected in a special way by Kubrick; the boy believed at all times that he was shooting a drama, not a horror movie. Following his role in the 1982 film Will: G. Gordon Liddy, Danny Lloyd abandoned his acting career.</p><h4>Filming</h4><h4>Interior sets</h4><p>Having chosen King's novel as a basis for his next project, and after a pre-production phase, Kubrick had sets constructed on soundstages at EMI Elstree Studios in Borehamwood, Hertfordshire, England. Some of the interior designs of the Overlook Hotel set were based on those of the Ahwahnee Hotel in Yosemite National Park. To enable him to shoot the scenes in chronological order, he used several stages at EMI Elstree Studios in order to make all sets available during the complete duration of production. The set for the Overlook Hotel was at the time the largest ever built at Elstree, including a life-size re-creation of the exterior of the hotel. In February 1979, the set at Elstree was badly damaged in a fire, causing a delay in the production.</p><h4>Exterior locations</h4><p>While most of the interior shots, and even some of the Overlook exterior shots, were shot on studio sets, a few exterior shots were shot on location by a second-unit crew headed by Jan Harlan. Saint Mary Lake and Wild Goose Island in Glacier National Park, Montana was the filming location for the aerial shots of the opening scenes, with the Volkswagen Beetle driving along Going-to-the-Sun Road. The Timberline Lodge on Mount Hood in Oregon was filmed for a few of the establishing shots of the fictional Overlook Hotel; absent in these shots is the hedge maze, something the Timberline Lodge does not have. The Ahwahnee Hotel (the Overlook Hotel's main interior) and the Timberline Lodge (the Overlook Hotel's main exterior) were both designed by architect Gilbert Stanley Underwood, in the 1920s and 1930s respectively.</p><p>Outtakes of the opening panorama shots were later used by Ridley Scott for the closing moments of the original cut of the film Blade Runner (1982).</p><h4>Writing</h4><p>In 1977, a Warner Bros. executive, John Calley, sent Kubrick the proofs of what would become the novel. Its author, Stephen King, was already at that time a best-selling author who, after the blockbuster of Carrie, could boast of successes in adaptations for the big screen. For his part, Kubrick had been considering directing a horror film for some time; a few years before, while Barry Lyndon disappointed at the box office, another Warner film he had refused to direct, The Exorcist, directed by William Friedkin, was breaking box office records around the world.</p><p>Asked what it was that attracted Kubrick to the idea of adapting the novel by the popular writer, a regular on the best-seller lists, his executive producer (and brother-in-law) Jan Harlan revealed that Kubrick wanted to \"try\" in this film genre, although with the condition of being able to change King's novel. And that condition would finally be guaranteed by contract.</p><p>The script was written by the director himself with the collaboration of novel writer Diane Johnson. Kubrick had rejected the initial version of the draft, written by King himself, as too literal an adaptation of the novel. Furthermore, the filmmaker did not believe in ghost stories because that \"would imply the possibility that there was something after death,\" and he did not believe there was anything, \"not even hell.\" Instead, Johnson, who was teaching a Gothic novel seminar at the University of California at Berkeley at the time, seemed like a better fit for the project. Deep down, Johnson looked down on Stephen King's literature; shortly after the premiere, in an interview with the Parisian magazine Positif, she stated:</p><blockquote>Among us, The Shining (the novel) is not part of great literature. It is scary, it is effective and it works, without further ado … But it is precisely interesting to see how a very bad book can also be very effective.- … It's quite pretentious. But it is also true that one has less scruples when destroying it: one is aware that a great work of art is not being destroyed.</blockquote><p>Kubrick, for his part, was more enthusiastic about the possibilities of the manuscript:</p><blockquote>It was the first time that I had read to the end a novel that was sent to me with a view to a possible film adaptation. I was absorbed in its reading and it seemed to me that its plot, ideas and structure were much more imaginative than usual in the horror genre; I thought that a great movie could come from there.</blockquote><h4>Photography</h4><p>The Shining had a very prolonged and arduous production period, often with very long workdays. Principal photography took over a year to complete, due to Kubrick's highly methodical nature. Actress Shelley Duvall did not get along with Kubrick, frequently arguing with him on set about lines in the script and her acting techniques. She eventually became so overwhelmed by the stress of her role that she became physically ill for months. At one point, she was under so much stress that her hair began to fall out. The shooting script was being changed constantly, sometimes several times a day, adding more stress. Nicholson eventually became so frustrated with the ever-changing script that he would throw away the copies that the production team had given him to memorize, knowing that it was going to change anyway. He learned most of his lines just minutes before filming them. Nicholson was living in London with his then-girlfriend Anjelica Huston and her younger sister, Allegra, who testified to his long shooting days. Joe Turkel stated in a 2014 interview that they rehearsed the \"bar scene\" for six weeks and that the shoot day lasted from 9 a.m. to 10:30 p.m., with Turkel recollecting that his clothes were soaked in perspiration by the end of the day's shoot. He also described it as his favorite scene in the film.</p><p>For the final Gold Room sequence, Kubrick instructed the extras (via megaphone) not to talk, \"but to mime conversation to each other. Kubrick knew from years of scrutinizing thousands of films that extras could often mime their business by nodding and using large gestures that look fake. He told them to act naturally to give the scene a chilling sense of time-tripping realism as Jack walks from the seventies into the roaring twenties\".</p><p>For the international versions of the film, Kubrick shot different takes of Wendy reading the typewriter pages in different languages. For each language, a suitable idiom was used: German (Was du heute kannst besorgen, das verschiebe nicht auf morgen / \"Never put off till tomorrow what may be done today\"), Italian (Il mattino ha l'oro in bocca / \"The morning has gold in its mouth\"), French (Un «Tiens» vaut mieux que deux «Tu l'auras» / \"One 'here you go' is worth more than two 'you'll have it'\", the equivalent of \"A bird in the hand is worth two in the bush\"), Spanish (No por mucho madrugar amanece más temprano / \"No matter how early you get up, you can't make the sun rise any sooner.\")</p><p>The door that Jack chops through with the axe near the end of the film was real; Kubrick originally shot this scene with a fake door, but Nicholson, who had worked as a volunteer fire marshal and a firefighter in the California Air National Guard, tore through it too quickly. Jack's line, \"Heeeere's Johnny!\", is taken from Ed McMahon's introduction to The Tonight Show Starring Johnny Carson, and was improvised by Nicholson. Kubrick, who had lived in England for some time, was unaware of the significance of the line, and nearly used a different take.</p><p>During production, Kubrick screened David Lynch's Eraserhead (1977) to the cast and crew, to convey the mood he wanted to achieve for the film.</p><h4>Steadicam</h4><p>The Shining was among the early half-dozen films (after the films Bound for Glory, Marathon Man, and Rocky, all released in 1976), to use the newly developed Steadicam, a stabilizing mount for a motion picture camera, which mechanically separates the operator's movement from the camera's, allowing smooth tracking shots while the operator is moving over an uneven surface. It essentially combines the stabilized steady footage of a regular mount with the fluidity and flexibility of a handheld camera. The inventor of the Steadicam, Garrett Brown, was heavily involved with the production of The Shining. Brown has described his excitement taking his first tour of the sets, which offered \"further possibilities for the Steadicam\". This tour convinced Brown to become personally involved with the production. Kubrick was not \"just talking of stunt shots and staircases\". Rather he would use the Steadicam \"as it was intended to be used — as a tool which can help get the lens where it's wanted in space and time without the classic limitations of the dolly and crane\". Brown used an 18 mm Cooke lens that allowed the Steadicam to pass within an inch of walls and door frames. Brown published an article in American Cinematographer about his experience, and contributed to the audio commentary on the 2007 DVD release.</p><p>Kubrick personally aided in modifying the Steadicam's video transmission technology. Brown states his own abilities to operate the Steadicam were refined by working on Kubrick's film. For this film, Brown developed a two-handed technique, which enabled him to maintain the camera at one height while panning and tilting the camera. In addition to tracking shots from behind, the Steadicam enabled shooting in constricted rooms without flying out walls, or backing the camera into doors. Brown notes that:</p><blockquote>One of the most talked-about shots in the picture is the eerie tracking sequence which follows Danny as he pedals at high speed through corridor after corridor on his plastic Big Wheel tricycle. The soundtrack explodes with noise when the wheel is on wooden flooring and is abruptly silent as it crosses over carpet. We needed to have the lens just a few inches from the floor and to travel rapidly just behind or ahead of the bike.</blockquote><p>This required the Steadicam to be on a special mount resembling a wheelchair, in which the operator sat while pulling a platform with the sound man. The weight of the rig and its occupants proved to be too much for the original tires, resulting in a blowout one day that almost caused a serious crash. Solid tires were then mounted on the rig. Kubrick also had a highly accurate speedometer mounted on the rig so as to duplicate the exact tempo of a given shot so that Brown could perform successive identical takes. Brown also discusses how the scenes in the hedge maze were shot with a Steadicam.</p><h4>Music and soundtrack</h4><p>The stylistically modernist art-music chosen by Kubrick is similar to the repertoire he first explored in 2001: A Space Odyssey. Although the repertoire was selected by Kubrick, the process of matching passages of music to motion picture was left almost entirely at the discretion of music editor Gordon Stainforth, whose work on this film is known for attention to fine details and remarkably precise synchronization without excessive splicing.</p><p>The soundtrack album on LP was withdrawn due to problems with licensing of the music. The LP soundtrack omits some pieces heard in the film, and also includes complete versions of pieces of which only fragments are heard in the film.</p><p>The non-original music on the soundtrack is as follows:</p><p>Segments that didn't appear on the soundtrack album also include:</p><p>Upon their arrival at Elstree Studios, Wendy Carlos and Rachel Elkind were shown the first version of the film by Kubrick: \"The film was a little on the long side. There were great gobs of scenes that never made it to the film. There was a whole strange and mystical scene in which Jack Nicholson discovers objects that have been arranged in his working space in the ballroom with arrows and things. He walks down and thinks he hears a voice and a ghost throws a ball back to him. None of that made it to the final film. We scored a lot of those. We didn't know what was going to be used for sure\". After having something similar happen to her on Clockwork Orange, Carlos has said that she was so disillusioned by Kubrick's actions that she vowed never to work with him again. She and Elkind had considered legal action against Kubrick, but because no formal contract was in place, they reluctantly accepted the situation. Carlos's own music was released in its near entirety in 2005 as part of her Rediscovering Lost Scores compilation.</p><br/><h3>Release</h3><p>Unlike Kubrick's previous works, which developed audiences gradually through word-of-mouth, The Shining initially opened on 10 screens in New York City and Los Angeles on the Memorial Day weekend, then was released as a mass-market film nationwide within a month. The European release of The Shining a few months later was 25 minutes shorter due to Kubrick's removal of most of the scenes taking place outside the environs of the hotel.</p><h4>Post-release edit</h4><p>After its premiere and a week into the general run (with a running time of 146 minutes), Kubrick cut a scene at the end that took place in a hospital. The scene shows Wendy in a bed talking with Mr. Ullman who explains that Jack's body could not be found; he then gives Danny a yellow tennis ball, presumably the same one that Jack was throwing around the hotel. This scene was subsequently physically cut out of prints by projectionists and sent back to the studio by order of Warner Bros., the film's distributor. This cut the film's running time to 144 minutes. Roger Ebert commented:</p><blockquote>If Jack did indeed freeze to death in the labyrinth, of course his body was found – and sooner rather than later, since Dick Hallorann alerted the forest rangers to serious trouble at the hotel. If Jack's body was not found, what happened to it? Was it never there? Was it absorbed into the past and does that explain Jack's presence in that final photograph of a group of hotel party-goers in 1921? Did Jack's violent pursuit of his wife and child exist entirely in Wendy's imagination, or Danny's, or theirs? ... Kubrick was wise to remove that epilogue. It pulled one rug too many out from under the story. At some level, it is necessary for us to believe the three members of the Torrance family are actually residents in the hotel during that winter, whatever happens or whatever they think happens.</blockquote><p>The general consensus among those who saw the first few shows was that the film was better without it because keeping it would weaken the Overlook's threat to the family and reintroduce Ullman, who had barely had a leading role in the story, into the conflict. Co-writer Diane Johnson revealed that Kubrick had a certain \"compassion\" from the beginning for the fate of Wendy and Danny, and in that sense the hospital scene would give a sense of a return to normalcy. Johnson, on the other hand, was in favor of a more tragic outcome: she even proposed the death of Danny Torrance. For Shelley Duvall, \"Kubrick was wrong, because the scene explained some important things, such as the meaning of the yellow ball and the role that the hotel manager played in the intrigue.\" Kubrick decided that the film worked better without the scene.</p><h4>European version</h4><p>For its release in Europe, Kubrick cut about 25 minutes from the film. The excised scenes included: a longer meeting between Jack and Watson at the hotel; Danny being attended by a doctor (Anne Jackson), including references to Tony and how Jack once injured Danny in a drunken rage; more footage of Hallorann's attempts to get to the hotel during the snowstorm, including a sequence with a garage attendant (Tony Burton); extended dialogue scenes at the hotel; and a scene where Wendy discovers a group of skeletons in the hotel lobby during the climax. Jackson and Burton are credited in the European print, despite their scenes having been excised from the movie. According to Harlan, Kubrick decided to cut some sequences because the film was \"not very well received\", and also after Warner Brothers had complained about its ambiguity and length.</p><p>The scene when Jack writes obsessively on the typewriter \"All work and no play makes Jack a dull boy\" was re-shot a number of times, but changing the language of the typed copy to Italian, French, Spanish, and German, in order to match the respective dubbed languages.</p><p>Three alternative takes were used in a British television commercial.</p><h4>Home media</h4><p>The U.S. network television premiere of The Shining (on ABC's Friday Night Movie of May 6, 1983) started with a placard saying, \"Tonight's Film Deals With the Supernatural, As a Possessed Man Attempts to Destroy His Family.\" With the movie's ambiguities, it is not known how Kubrick felt about or if he agreed with this proclamation. The placard also said that the film was edited for television and warned about the content.</p><p>DVDs in both regions contain a candid fly-on-the-wall 33-minute documentary made by Kubrick's daughter Vivian (who was 17 when she filmed it) entitled Making The Shining, originally shown on British television in 1980. She also provided an audio commentary track about her documentary for its DVD release. It appears even on pre-2007 editions of The Shining on DVD, although most DVDs of Kubrick films before then were devoid of documentaries or audio commentaries. It has some candid interviews and very private moments caught on set, such as arguments with cast and director, moments of a no-nonsense Kubrick directing his actors, Scatman Crothers being overwhelmed with emotion during his interview, Shelley Duvall collapsing from exhaustion on the set, and Jack Nicholson enjoying playing up to the behind-the-scenes camera.</p><p>In May 2019, it was announced that the film would be released on Ultra HD Blu-ray in October. The release includes a 4K remaster using a 4K scan of the original 35mm negative. Filmmaker Steven Spielberg and Kubrick's former personal assistant Leon Vitali closely assisted Warner Bros. in the mastering process. This is the same cut and 4K restoration that was screened at the 2019 Cannes Film Festival. According to the official press release, the official full-length run-time is 146 minutes.</p><h4>Ad campaigns</h4><p>Various theatrical posters were used during the original 1980–1981 international release cycle, but in the U.S., where the film first opened, the primary poster and newspaper advert was designed by noted Hollywood graphic designer Saul Bass. Bass and Kubrick reportedly went through over 300 potential designs before settling on the final design of an unsettling, angry-looking, underlit, pointillistic doll-like face (which does not appear in the film) peering through the letters \"The\", with \"SHiNiNG\" below, in smaller letters. At the top of the poster are the words \"A MASTERPIECE OF MODERN HORROR\", with the credits and other information at the bottom.</p><p>The correspondence between the two men during the design process survives, including Kubrick's handwritten critiques on Bass's different proposed designs. Bass originally intended the poster to be black on a red background, but Kubrick, to Bass's dismay, chose to make the background yellow. In response, Bass commissioned a small, silkscreened print run of his original version, which also lacks the \"masterpiece of modern horror\" slogan, and has the credits in a compact white block at the bottom.</p><h4>4K version</h4><p>Turner Classic Movies and Fathom Events had a limited screening in October 2016 in 2K and 4K resolution.</p><p>In April 2019, a 4K resolution remastered version from a new scan of the original 35mm camera negative of the film was selected to be shown in the Cannes Classics section at the 2019 Cannes Film Festival. The length is listed as 146 minutes and 143 minutes.</p><br/><h3>Reception</h3><h4>Box office</h4><p>The Shining opened on the same weekend as The Empire Strikes Back but was released on 10 screens and grossed $622,337 for the four-day weekend, the third highest-grossing opening weekend from fewer than 50 screens of all time, behind Star Wars (1977) and The Rose (1979). It had a per-screen average gross of $62,234 compared to $50,919 for The Empire Strikes Back from 126 screens.</p><h4>Initial reviews</h4><p>The film had mixed reviews at the time of its opening in the United States. Janet Maslin of The New York Times lauded Nicholson's performance and praised the Overlook Hotel as an effective setting for horror, but wrote that \"the supernatural story knows frustratingly little rhyme or reason ... Even the film's most startling horrific images seem overbearing and perhaps even irrelevant.\" Variety was critical, stating \"With everything to work with ... Kubrick has teamed with jumpy Jack Nicholson to destroy all that was so terrifying about Stephen King's bestseller.\" A common initial criticism was the slow pacing, which was highly atypical of horror films of the time. Neither Gene Siskel nor Roger Ebert reviewed the film on their television show Sneak Previews when it was first released, but in his review for the Chicago Sun-Times, Ebert complained that it was hard to connect with any of the characters. In his Chicago Tribune review, Siskel gave the film two stars out of four and called it \"a crashing disappointment. The biggest surprise is that it contains virtually no thrills. Given Kubrick's world-class reputation, one's immediate reaction is that maybe he was after something other than thrills in the film. If so, it's hard to figure out what.\" Kevin Thomas of the Los Angeles Times wrote \"There are moments so visually stunning only a Kubrick could pull them off, yet the film is too grandiose to be the jolter that horror pictures are expected to be. Both those expecting significance from Kubrick and those merely looking for a good scare may be equally disappointed.\" Pauline Kael of The New Yorker stated \"Again and again, the movie leads us to expect something – almost promises it – and then disappoints us.\" Gary Arnold of The Washington Post wrote \"Stanley Kubrick's production of The Shining, a ponderous, lackluster distillation of Stephen King's best-selling novel, looms as the Big Letdown of the new film season. I can't recall a more elaborately ineffective scare movie.\"</p><p>It was one of only two films of Kubrick's last eleven films, the other being Eyes Wide Shut, to receive no nominations from the BAFTAs. It was the only one of Kubrick's last nine films to receive no nominations from either the Oscars or Golden Globes. Instead, it was Kubrick's only film to be nominated at the Razzie Awards, including Worst Director and Worst Actress (Duvall), in the first year that award was given. These nominations, especially Duvall's, have provoked backlash and controversy for years, and Duvall's nomination was retracted by the Razzie committee on March 31, 2022. Vincent Misiano's review in Ares magazine concluded: \"The Shining lays open to view all the devices of horror and suspense – endless eerie music, odd camera angles, a soundtrack of interminably pounding heart, hatchets and hunts. The result is shallow, self-conscious and dull. Read the book.\"</p><h4>Reappraisal</h4><p>On Rotten Tomatoes, the film has a \"certified fresh\" approval rating of 82% based on 102 reviews, with an average rating of 8.5 out of 10. The site's critical consensus reads: \"Though it deviates from Stephen King's novel, Stanley Kubrick's The Shining is a chilling, often baroque journey into madness -- exemplified by an unforgettable turn from Jack Nicholson.\" On Metacritic, it has a weighted average score of 66 out of 100 based on reviews from 26 critics, indicating \"generally favorable reviews\". Tim Cahill of Rolling Stone noted in an interview with Kubrick that by 1987 there was already a \"critical re-evaluation of in process\".</p><p>In 2001, the film was ranked 29th on AFI's 100 Years...100 Thrills list and Jack Torrance was named the 25th greatest villain on the AFI's 100 Years...100 Heroes and Villains list in 2003. In 2005, the quote \"Here's Johnny!\" was ranked 68 on AFI's 100 Years...100 Movie Quotes list. It had Channel 4's all-time scariest moment, and Bravo TV named one of the film's scenes sixth on their list of the 100 Scariest Movie Moments. Film critics Kim Newman and Jonathan Romney both placed it in their top ten lists for the 2002 Sight & Sound poll. In 2005, Total Film ranked The Shining as the 5th-greatest horror film of all time. Director Martin Scorsese placed it on his list of the 11 scariest horror films of all time. Mathematicians at King's College London (KCL) used statistical modeling in a study commissioned by Sky Movies to conclude that The Shining was the \"perfect scary movie\" due to a proper balance of various ingredients including shock value, suspense, gore and size of the cast. In 2010, The Guardian newspaper ranked it as the 5th \"best horror film of all time\". It was voted the 62nd greatest American film ever made in a 2015 poll conducted by BBC. In 2017, Empire magazine's readers' poll ranked the film at No. 35 on its list of \"The 100 Greatest Movies\". In 2021, The film was ranked at No. 2 by Time Out on their list of \"The 100 best horror movies\". Critics, scholars, and crew members (such as Kubrick's producer Jan Harlan) have discussed the film's enormous influence on popular culture. In 2006, Roger Ebert, who was initially critical of the work, inducted the film into his Great Movies series, saying \"Stanley Kubrick's cold and frightening The Shining challenges us to decide: Who is the reliable observer? Whose idea of events can we trust? ... It is this elusive open-endedness that makes Kubrick's film so strangely disturbing.\"</p><p>While Duvall's performance was originally nominated for a Razzie, Razzies co-founder Maureen Murphy stated in 2022 that she regretted giving Duvall the Worst Actress nomination. On March 31, 2022, the Razzie committee officially rescinded Duvall's nomination, stating \"We have since discovered that Duvall's performance was impacted by Stanley Kubrick's treatment of her throughout the production.\" The retraction of the nomination was in response to public backlash The Razzies received after refusing to retract Bruce Willis's win for \"Worst Bruce Willis Performance in a 2021 Movie\", a one-off award for his roles in eight films released that calendar year. Willis's family announced the star's retirement after being diagnosed with aphasia, a cognitive brain condition, on March 30, 2022. The Razzie committee retracted both Willis's win and Duvall's nomination the following day. On Duvall's performance, Vulture magazine wrote in 2019: \"looking into Duvall's huge eyes from the front row of a theater, I found myself riveted by a very poignant form of fear. Not the fear of an actor out of her element, or the more mundane fear of a victim being chased around by an ax-wielding maniac. Rather, it was something far more disquieting, and familiar: the fear of a wife who's experienced her husband at his worst, and is terrified that she'll experience it again.\" Media site Screen Rant described Duvall as \"the heart of the film; she is out of her depth in dealing with her husband's looming insanity while trying to protect her young son, all while being fearful of the malevolence around her.\"</p><p>Horror film critic Peter Bracke, reviewing the Blu-ray release in High-Def Digest, wrote:</p><blockquote>Just as the ghostly apparitions of the film's fictional Overlook Hotel would play tricks on the mind of poor Jack Torrance, so too has the passage of time changed the perception of The Shining itself. Many of the same reviewers who lambasted the film for \"not being scary\" enough back in 1980 now rank it among the most effective horror films ever made, while audiences who hated the film back then now vividly recall being \"terrified\" by the experience. The Shining has somehow risen from the ashes of its own bad press to redefine itself not only as a seminal work of the genre, but perhaps the most stately, artful horror ever made.</blockquote><p>In 1999, Jonathan Romney discussed Kubrick's perfectionism and dispelled others' initial arguments that the film lacked complexity: \"The final scene alone demonstrates what a rich source of perplexity The Shining offers ... look beyond the simplicity and the Overlook reveals itself as a palace of paradox\". Romney further explains:</p><blockquote>The dominating presence of the Overlook Hotel – designed by Roy Walker as a composite of American hotels visited in the course of research – is an extraordinary vindication of the value of mise en scène. It's a real, complex space that we don't just see but come to virtually inhabit. The confinement is palpable: horror cinema is an art of claustrophobia, making us loath to stay in the cinema but unable to leave. Yet it's combined with a sort of agoraphobia – we are as frightened of the hotel's cavernous vastness as of its corridors' enclosure ... The film sets up a complex dynamic between simple domesticity and magnificent grandeur, between the supernatural and the mundane in which the viewer is disoriented by the combination of spaciousness and confinement, and an uncertainty as to just what is real or not.</blockquote><h4>Response by Stephen King</h4><p>Stephen King has been quoted as saying that although Kubrick made a film with memorable imagery, it was poor as an adaptation and that it is the only adaptation of his novels that he could \"remember hating\". However, in his 1981 nonfiction book Danse Macabre, King noted that Kubrick was among those \"filmmakers whose particular visions are so clear and fierce that ... fear of failure never becomes a factor in the equation,\" commenting that \"even when a director such as Stanley Kubrick makes such a maddening, perverse, and disappointing film as The Shining, it somehow retains a brilliance that is inarguable; it is simply there,\" and listed Kubrick's film among those he considered to have \"contributed something of value to the genre.\" Before the 1980 film, King often said he gave little attention to the film adaptations of his work.</p><p>The novel, written while King was suffering from alcoholism, contains an autobiographical element. King expressed disappointment that some themes, such as the disintegration of family and the dangers of alcoholism, are less present in the film. King also viewed the casting of Nicholson as a mistake, arguing it would result in a rapid realization among audiences that Jack would go insane, due to Nicholson's famous role as Randle McMurphy in One Flew Over the Cuckoo's Nest (1975). King had suggested that a more \"everyman\" actor such as Jon Voight, Christopher Reeve, or Michael Moriarty play the role, so that Jack's descent into madness would be more unnerving. In the novel, the story takes the child's point of view, while in the film the father is the main character; in fact, one of the most notable differences lies in Jack Torrance's psychological profile. According to the novel, the character represented an ordinary and balanced man who little by little loses control; furthermore, the written narration reflected personal traits of the author himself at that time (marked by insomnia and alcoholism), in addition to abuse. There is some allusion to these episodes in the American version of the film.</p><p>In an interview with the BBC, King criticized Duvall's character, stating that she is \"basically just there to scream and be stupid, and that's not the woman that I wrote about.\" King's Wendy is a strong and independent woman on a professional and emotional level; to Kubrick, on the other hand, it did not seem consistent that such a woman had long endured the personality of Jack Torrance.</p><p>King once suggested that he disliked the film's downplaying of the supernatural; King had envisioned Jack as a victim of the genuinely external forces haunting the hotel, whereas King felt Kubrick had viewed the haunting and its resulting malignancy as coming from within Jack himself. In October 2013, however, journalist Laura Miller wrote that the discrepancy between the two was almost the complete opposite:</p><blockquote>King is, essentially, a novelist of morality. The decisions his characters make – whether it's to confront a pack of vampires or to break 10 years of sobriety – are what matter to him. But in Kubrick's The Shining, the characters are largely in the grip of forces beyond their control. It's a film in which domestic violence occurs, while King's novel is about domestic violence as a choice certain men make when they refuse to abandon a delusional, defensive entitlement. As King sees it, Kubrick treats his characters like \"insects\" because the director doesn't really consider them capable of shaping their own fates. Everything they do is subordinate to an overweening, irresistible force, which is Kubrick's highly developed aesthetic; they are its slaves. In King's The Shining, the monster is Jack. In Kubrick's, the monster is Kubrick.</blockquote><p>King later criticized the film and Kubrick as a director:</p><blockquote>Parts of the film are chilling, charged with a relentlessly claustrophobic terror, but others fall flat. Not that religion has to be involved in horror, but a visceral skeptic such as Kubrick just couldn't grasp the sheer inhuman evil of The Overlook Hotel. So he looked, instead, for evil in the characters and made the film into a domestic tragedy with only vaguely supernatural overtones. That was the basic flaw: because he couldn't believe, he couldn't make the film believable to others. What's basically wrong with Kubrick's version of The Shining is that it's a film by a man who thinks too much and feels too little; and that's why, for all its virtuoso effects, it never gets you by the throat and hangs on the way real horror should.</blockquote><p>King was also disappointed by Kubrick's decision not to film at The Stanley Hotel in Estes Park, Colorado, which inspired the story (a decision Kubrick made since the hotel lacked sufficient snow and electricity). However, King finally supervised the 1997 television adaptation also titled The Shining, filmed at The Stanley Hotel.</p><p>The animosity of King toward Kubrick's adaptation has dulled over time. During an interview segment on the Bravo channel, King stated that the first time he watched Kubrick's adaptation, he found it to be \"dreadfully unsettling\". Nonetheless, writing in the afterword of Doctor Sleep, King professed continued dissatisfaction with the Kubrick film. He said of it \"... of course there was Stanley Kubrick's movie which many seem to remember – for reasons I have never quite understood – as one of the scariest films they have ever seen. If you have seen the movie but not read the novel, you should note that Doctor Sleep follows the latter which is, in my opinion, the True History of the Torrance Family.\"</p><p>Mike Flanagan, director of the film adaptation of Doctor Sleep, would reconcile the differences between novel and film versions of The Shining there. Doctor Sleep is a direct adaptation of its novel counterpart, which itself is a sequel to the novel version of The Shining, but is also a continuation of Kubrick's film; in explaining the latter, Flanagan expressed, \"The Shining is so ubiquitous and has burned itself into the collective imagination of people who love cinema in a way that so few movies have. There's no other language to tell that story in. If you say 'Overlook Hotel', I see something. It lives right up in my brain because of Stanley Kubrick. You can't pretend that isn't the case\". King initially rejected Flanagan's pitch of bringing back the Overlook as seen in Kubrick's film, but changed his mind after Flanagan pitched a scene within the hotel towards the end of the film that served as his reason to bring back the Overlook. Upon reading the script, King was so satisfied with the result that he said, \"Everything that I ever disliked about the Kubrick version of The Shining is redeemed for me here.\"</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Awards and nominations</caption><tbody><tr style=\"background:#b0c4de; text-align:center;\"><th scope=\"col\" style=\"width:10em;\">Award</th><th scope=\"col\" style=\"width:10em;\">Category</th><th scope=\"col\" style=\"width:10em;\">Nominee</th><th scope=\"col\" style=\"width:7em;\">Result</th></tr><tr><td rowspan=\"2\"><span>Razzie Award</span></td><td><s><span>Worst Actress</span></s></td><td><s><span>Shelley Duvall</span></s></td><td style=\"background: #FDD; color: black; vertical-align: middle; text-align: center;\"><s>Nominated</s></td></tr><tr><td><span>Worst Director</span></td><td rowspan=\"2\"><span>Stanley Kubrick</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Saturn Award</span></td><td><span class=\"mw-redirect\">Best Director</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Scatman Crothers</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td colspan=\"2\"><span>Best Horror Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Music</span></td><td><span>Béla Bartók</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><h4>American Film Institute recognition</h4><ul><li>2001: AFI's 100 Years...100 Thrills – #29</li><li>2003: AFI's 100 Years...100 Heroes & Villains: Jack Torrance – #25 Villain</li><li>Jack Torrance – #25 Villain</li><li>2005: AFI's 100 Years...100 Movie Quotes: \"Here's Johnny!\" – #68</li><li>\"Here's Johnny!\" – #68</li></ul><br/><h3>Analysis</h3><h4>Social interpretations</h4><p>Film critic Jonathan Romney writes that the film has been interpreted in many ways, including addressing the topics of the crisis in masculinity, sexism, corporate America, and racism. \"It's tempting to read The Shining as an Oedipal struggle not just between generations but between Jack's culture of the written word and Danny's culture of images\", Romney writes, \"Jack also uses the written word to more mundane purpose – to sign his 'contract' with the Overlook. 'I gave my word', ... which we take to mean 'gave his soul' in the ... Faustian sense. But maybe he means it more literally – by the end ... he has renounced language entirely, pursuing Danny through the maze with an inarticulate animal roar. What he has entered into is a conventional business deal that places commercial obligation ... over the unspoken contract of compassion and empathy that he seems to have neglected to sign with his family.\"</p><h4>Native Americans</h4><p>Among interpreters who see the film reflecting more subtly the social concerns that animate other Kubrick films, one of the early viewpoints was discussed in an essay by ABC reporter Bill Blakemore titled \"Kubrick's 'Shining' Secret: Film's Hidden Horror Is The Murder of the Indian\", first published in The Washington Post on July 12, 1987. He believes that indirect references to American killings of Native Americans pervade the film, as exemplified by the Amerindian logos on the baking powder in the kitchen and the Amerindian artwork that appears throughout the hotel, though no Native Americans are seen. Stuart Ullman tells Wendy that when building the hotel, a few Indian attacks had to be fended off since it was constructed on an Indian burial ground.</p><p>Blakemore's general argument is that the film is a metaphor for the genocide of Native Americans. He notes that when Jack kills Hallorann, the dead body is seen lying on a rug with an Indian motif. The blood in the elevator shafts is, for Blakemore, the blood of the Indians in the burial ground on which the hotel was built. The date of the final photograph, July 4, is meant to be ironic. Blakemore writes:</p><blockquote>As with some of his other movies, Kubrick ends The Shining with a powerful visual puzzle that forces the audience to leave the theater asking, \"What was that all about?\" The Shining ends with an extremely long camera shot moving down a hallway in the Overlook, reaching eventually the central photo among 21 photos on the wall, each capturing previous good times in the hotel. At the head of the party is none other than the Jack we've just seen in 1980. The caption reads: \"Overlook Hotel – July 4th Ball – 1921.\" The answer to this puzzle, which is a master key to unlocking the whole movie, is that most Americans overlook the fact that July Fourth was no ball, nor any kind of Independence day, for native Americans; that the weak American villain of the film is the re-embodiment of the American men who massacred the Indians in earlier years; that Kubrick is examining and reflecting on a problem that cuts through the decades and centuries.</blockquote><p>Film writer John Capo sees the film as an allegory of American imperialism. This is exemplified by many clues, such as the closing photo of Jack in the past at a Fourth of July party, or Jack's earlier reference to the Rudyard Kipling poem \"The White Man's Burden\", which was written to advocate the American colonial seizure of the Philippine islands, justifying imperial conquest as a mission-of-civilization.</p><h4>Geoffrey Cocks and Kubrick's concern with the Holocaust</h4><p>Film historian Geoffrey Cocks has extended Blakemore's idea that the film has a subtext about Native Americans by arguing that the film indirectly reflects Stanley Kubrick's concerns about the Holocaust (both Cocks's book and Michael Herr's memoir of Kubrick discuss how he wanted his entire life to make a film dealing directly with the Holocaust but could never quite make up his mind). Cocks, writing in his book The Wolf at the Door: Stanley Kubrick, History and the Holocaust, proposed a controversial theory that all of Kubrick's work is informed by the Holocaust; there is, he says, a holocaust subtext in The Shining. This, Cocks believes, is why Kubrick's screenplay goes to emotional extremes, omitting much of the novel's supernaturalism and making the character of Wendy much more hysteria-prone. Cocks places Kubrick's vision of a haunted hotel in line with a long literary tradition of hotels in which sinister events occur, from Stephen Crane's short story \"The Blue Hotel\" (which Kubrick admired) to the Swiss Berghof in Thomas Mann's novel The Magic Mountain, about a snowbound sanatorium high in the Swiss Alps in which the protagonist witnesses a series of events which are a microcosm of the decline of Western culture.</p><p>Cocks claims that Kubrick has elaborately coded many of his historical concerns into the film with manipulations of numbers and colors and his choice of musical numbers, many of which are post-war compositions influenced by the horrors of World War II. Of particular note is Kubrick's use of Penderecki's The Awakening of Jacob to accompany Jack Torrance's dream of killing his family and Danny's vision of past carnage in the hotel, a piece of music originally associated with the horrors of the Holocaust.</p><p>Cocks's work has been anthologized and discussed in other works on Stanley Kubrick films, though sometimes with skepticism. Julian Rice, writing in the opening chapter of his book Kubrick's Hope, believes Cocks's views are excessively speculative and contain too many strained \"critical leaps\" of faith. Rice holds that what went on in Kubrick's mind cannot be replicated or corroborated beyond a broad vision of the nature of good and evil (which included concern about the Holocaust) but Kubrick's art is not governed by this one obsession. Diane Johnson, co-screenwriter for The Shining, commented on Cocks's observations, saying that preoccupation with the Holocaust on Kubrick's part could very likely have motivated his decision to place the hotel on a Native American burial ground, although Kubrick never directly mentioned it to her.</p><h4>Literary allusions</h4><p>Geoffrey Cocks notes that the film contains many allusions to fairy tales, both Hansel and Gretel and the Three Little Pigs, with Jack Torrance identified as the Big Bad Wolf, which Bruno Bettelheim interprets as standing for \"all the asocial unconscious devouring powers\" that must be overcome by a child's ego.</p><p>The saying \"all work and no play makes Jack a dull boy\" appeared first in James Howell's Proverbs in English, Italian, French and Spanish (1659).</p><h4>Ambiguities in the film</h4><p>Roger Ebert notes that the film does not really have a \"reliable observer\", with the possible exception of Dick Hallorann. Ebert believes various events call into question the reliability of Jack, Wendy and Danny. This leads Ebert to conclude that:</p><blockquote>Kubrick is telling a story with ghosts (the two girls, the former caretaker and a bartender), but it isn't a \"ghost story\", because the ghosts may not be present in any sense at all except as visions experienced by Jack or Danny.</blockquote><p>Ebert concludes that \"The movie is not about ghosts but about madness and the energies it sets loose in an isolated situation primed to magnify them\". The film critic James Berardinelli notes that \"King would have us believe that the hotel is haunted. Kubrick is less definitive in the interpretations he offers.\" He dubs the film a failure as a ghost story, but brilliant as a study of \"madness and the unreliable narrator\".</p><h4>Ghosts versus cabin fever</h4><p>In some sequences, there is a question of whether or not there are ghosts present. In the scenes where Jack sees ghosts, he is always facing a mirror or, in the case of his storeroom conversation with Grady, a reflective, highly polished door. Film reviewer James Berardinelli notes \"It has been pointed out that there's a mirror in every scene in which Jack sees a ghost, causing us to wonder whether the spirits are reflections of a tortured psyche.\" In Hollywood's Stephen King, Tony Magistrale wrote,</p><blockquote>Kubrick's reliance on mirrors as visual aids for underscoring the thematic meaning of this film portrays visually the internal transformations and oppositions that are occurring to Jack Torrance psychologically. Through ... these devices, Kubrick dramatizes the hotel's methodical assault on Torrance's identity, its ability to stimulate the myriad of self-doubts and anxieties by creating opportunities to warp Torrance's perspective on himself and. Furthermore the fact that Jack looks into a mirror whenever he \"speaks\" to the hotel means, to some extent, that Kubrick implicates him directly into the hotel's \"consciousness\", because Jack is, in effect, talking to himself.</blockquote><p>Ghosts are the implied explanation for Jack's seemingly physically impossible escape from the locked storeroom. In an interview of Kubrick by scholar Michel Ciment, the director made comments about the scene in the book that may imply he similarly thought of the scene in the film as a key reveal in this dichotomy:</p><blockquote>It seemed to strike an extraordinary balance between the psychological and the supernatural in such a way as to lead you to think that the supernatural would eventually be explained by the psychological: 'Jack must be imagining these things because he's crazy.' This allowed you to suspend your doubt of the supernatural until you were so thoroughly into the story that you could accept it almost without noticing ... It's not until Grady, the ghost of the former caretaker who axed to death his family, slides open the bolt of the larder door, allowing Jack to escape, that you are left with no other explanation but the supernatural.</blockquote><h4>The two Gradys and other doubles</h4><p>Early in the film, Stuart Ullman tells Jack of a previous caretaker, Charles Grady, who, in 1970, succumbed to cabin fever, murdered his family and then killed himself. Later, Jack meets a ghostly butler named Grady. Jack says that he knows about the murders, claiming to recognize Grady from pictures, but the butler introduces himself as Delbert Grady.</p><p>Gordon Dahlquist of The Kubrick FAQ argues that the name change \"deliberately mirrors Jack Torrance being both the husband of Wendy/father of Danny and the mysterious man in the 1920s July Fourth photo. It is to say he is two people: the man with choice in a perilous situation and the man who has 'always' been at the Overlook. It's a mistake to see the final photo as evidence that the events of the film are predetermined: Jack has any number of moments where he can act other than the way he does and that his (poor) choices are fueled by weakness and fear perhaps merely speaks all the more to the questions about the personal and the political that The Shining brings up. In the same way Charles had a chance – once more, perhaps – to not take on Delbert's legacy, so Jack may have had a chance to escape his role as 'caretaker' to the interests of the powerful. It's the tragic course of this story that he chooses not to.\"</p><p>Dahlquist's argument is that Delbert Grady, the 1920s butler, and Charles Grady, the 1970s caretaker, rather than being either two people or the same are two 'manifestations' of a similar entity; a part permanently at the hotel (Delbert) and the part which is given the choice of whether to join the legacy of the hotel's murderous past (Charles), just as the man in the photo is not exactly Jack Torrance but nor is he someone different. Jack in the photo has 'always' been at the Overlook; Jack the caretaker chooses to become part of the hotel. The film's assistant editor Gordon Stainforth has commented on this issue, attempting to steer a course between the continuity-error explanation on one side and the hidden-meaning explanation on the other; \"I don't think we'll ever quite unravel this. Was his full name Charles Delbert Grady? Perhaps Charles was a sort of nickname? Perhaps Ullman got the name wrong? But I also think that Stanley did NOT want the whole story to fit together too neatly, so absolutely correct, I think, to say that 'the sum of what we learn refuses to add up neatly'.\"</p><p>Among Kubrick's other doubling/mirroring effects in the film:</p><ul><li>In the U.S. version, Jack's interview with Ullman, whose confident affability contrasts with Jack's seemingly forced nonchalance, is paired with Wendy's meeting with a female doctor, whose somber and professional manner contrasts with Wendy's nervousness.</li><li>During the interview, Jack and Ullman are joined by a hotel employee named Bill Watson, who looks similar to Jack from behind, creating a pseudo–mirror image effect as they sit in chairs to the front-left and front-right of Ullman's desk.</li><li>The Grady sisters look so similar that they appear to be twins, though they are different ages (Ullman states that he thinks that they were about eight and ten).</li><li>On two occasions, Ullman says goodbye to two young female employees and in the second case, they closely resemble each other.</li><li>The film contains two mazes, the hedges outside and, per Wendy's characterization, the Overlook. The hedge maze appears in two forms, the 13-foot-high version outside and the model inside the Overlook. In the overhead shot zooming down on Wendy and Danny in the center of the maze, the maze differs from the map outside and from the model having far more corridors, and the left and right sides are mirror images of each other. The Overlook significantly breaks down into two sections, one old and one remodeled; one past, one present.</li><li>Two versions of the bathing woman inhabit Room 237.</li><li>In Hallorann's Miami bedroom, two paintings showing similar nude black women are seen on opposite walls just before he experiences a \"shining\".</li><li>There appear to be two Jack Torrances, the one who goes mad and freezes to death in the present and the one who appears in a 1921 photograph that hangs on the gold corridor wall inside the Overlook.</li></ul><h4>The photograph</h4><p>At the end of the film, the camera moves slowly towards a wall in the Overlook and a 1921 photograph, revealed to include Jack seen at the middle of a 1921 party. In an interview with Michel Ciment, Kubrick said that the photograph suggests that Jack was a reincarnation of an earlier official at the hotel. This has not stopped alternative readings, such as that Jack has been \"absorbed\" into the Overlook Hotel. Film critic Jonathan Romney, while acknowledging the absorption theory, wrote:</p><blockquote>As the ghostly butler Grady (Philip Stone) tells him during their chilling confrontation in the men's toilet, 'You're the caretaker, sir. You've always been the caretaker.' Perhaps in some earlier incarnation Jack really was around in 1921, and it's his present-day self that is the shadow, the phantom photographic copy. But if his picture has been there all along, why has no one noticed it? After all, it's right at the center of the central picture on the wall, and the Torrances have had a painfully drawn-out winter of mind-numbing leisure in which to inspect every corner of the place. Is it just that, like Poe's purloined letter, the thing in plain sight is the last thing you see? When you do see it, the effect is so unsettling because you realise the unthinkable was there under your nose – overlooked – the whole time.</blockquote><h4>Spatial layout of the Overlook Hotel</h4><p>Screenwriter Todd Alcott has noted:</p><blockquote>Much has been written, some of it quite intelligent, about the spatial anomalies and inconsistencies in The Shining: there are rooms with windows that should not be there and doors that couldn't possibly lead to anywhere, rooms appear to be in one place in one scene and another place in another, wall fixtures and furniture pieces appear and disappear from scene to scene, props move from one room to another, and the layout of the Overlook makes no physical sense.</blockquote><p>Artist Juli Kearns first identified and created maps of spatial discrepancies in the layout of the Overlook Hotel, the interiors of which were constructed in studios in England. These spatial discrepancies included windows appearing in impossible places, such as in Stuart Ullman's office, which is surrounded by interior hallways, and apartment doorways positioned in places where they cannot possibly lead to apartments. Rob Ager is another proponent of this theory. Jan Harlan, an Executive Producer on The Shining, was asked about the discontinuity of sets by Xan Brooks of The Guardian and confirmed the discontinuity was intentional, \"The set was very deliberately built to be offbeat and off the track, so that the huge ballroom would never actually fit inside. The audience is deliberately made not to know where they're going. People say The Shining doesn't make sense. Well spotted! It's a ghost movie. It's not supposed to make sense.\" Harlan further elaborated to Kate Abbot, \"Stephen King gave him the go-ahead to change his book, so Stanley agreed – and wrote a much more ambiguous script. It's clear instantly there's something foul going on. At the little hotel, everything is like Disney, all kitsch wood on the outside – but the interiors don't make sense. Those huge corridors and ballrooms couldn't fit inside. In fact, nothing makes sense.\"</p><br/><h3>Comparison with the novel</h3><p>The film differs from the novel significantly with regard to characterization and motivation of action. The most obvious differences are those regarding the personality of Jack Torrance (the source of much of author Stephen King's dissatisfaction with the film).</p><h4>Motivation of ghosts</h4><p>In the film, the motive of the ghosts is apparently to \"reclaim\" Jack (although Grady expresses an interest in Danny's \"shining\" ability), who seems to be a reincarnation of a previous caretaker of the hotel, as suggested by the 1920s photograph of Jack at the end of the film and Jack's repeated claims to have \"not just a déjà vu\". The film is more focused on Jack (as opposed to Danny) than the novel.</p><h4>Room number</h4><p>The room number 217 has been changed to 237. Timberline Lodge, located on Mount Hood in Oregon, was used for the aerial exterior shots of the fictional Overlook Hotel. The Lodge requested that Kubrick not depict Room 217 (featured in the book) in The Shining, because future guests at the Lodge might be afraid to stay there, and a nonexistent room, 237, was substituted in the film. Contrary to the hotel's expectations, Room 217 is requested more often than any other room at Timberline.</p><p>There are fringe analyses relating this number change to rumors that Kubrick faked the first Moon landing, as there are approximately 237,000 miles between the Earth and the Moon (average is 238,855 miles), and claiming that the film is a subtle confession of his involvement. Another theory posits an obsession with the number 42 in the film, and the product of the digits in 237 is 42.</p><h4>Jack Torrance</h4><p>The novel initially presents Jack as likeable and well-intentioned, yet haunted by the demons of alcohol and authority issues. Nonetheless, he becomes gradually overwhelmed by what he sees as the evil forces in the hotel. At the novel's conclusion, it is suggested that the evil hotel forces have possessed Jack's body and proceeded to destroy all that is left of his mind during a final showdown with Danny. He leaves a monstrous entity that Danny is able to divert while he, Wendy and Dick Hallorann escape. The film's Jack is established as somewhat sinister much earlier in the story and dies in a different manner. Jack kills Dick Hallorann in the film, but only wounds him in the novel. King attempted to talk Stanley Kubrick out of casting Jack Nicholson even before filming began, on the grounds that he seemed vaguely sinister from the very beginning of the film.</p><p>Only in the novel does Jack hear the haunting, heavy-handed voice of his father, with whom he had a troubled relationship. In both the novel and film, Jack's encounter with the ghostly bartender is pivotal to Jack's deterioration. However, the novel gives much more detail about Jack's problems with drinking and alcohol.</p><p>The film prolongs Jack's struggle with writer's block. Kubrick's co-screenwriter Diane Johnson believes that in King's novel, Jack's discovery of the scrapbook of clippings in the boiler room of the hotel, which gives him new ideas for a novel, catalyzes his possession by the ghosts of the hotel, while at the same time unblocking his writing. Jack is no longer a blocked writer, but now filled with energy. In her contribution to the screenplay, Johnson wrote an adaptation of this scene, which to her regret Kubrick later excised, as she felt this left the father's change less motivated. Kubrick showed Jack's continued blockage quite late in the film with the \"all work and no play makes Jack a dull boy\" scene, which does not appear in the novel.</p><p>Stephen King stated on the DVD commentary of the 1997 miniseries of The Shining that the character of Jack Torrance was partially autobiographical, as he was struggling with both alcoholism and unprovoked rage toward his family at the time of writing. Tony Magistrale wrote about Kubrick's version of Jack Torrance in Hollywood's Stephen King:</p><blockquote>Kubrick's version of Torrance is much closer to the tyrannical Hal (from Kubrick's 2001: A Space Odyssey) and Alex (from Kubrick's A Clockwork Orange) than he is to King's more conflicted, more sympathetically human characterization.</blockquote><p>From Thomas Allen Nelson's Kubrick: Inside a Film Artist's Maze: \"When Jack moves through the reception area on his way to a 'shining' over the model maze, he throws a yellow tennis ball past a stuffed bear and Danny's Big Wheel, which rests on the very spot (a Navajo circle design) where Hallorann will be murdered.\" Jack's tennis ball mysteriously rolls into Danny's circle of toy cars just before the boy walks through the open door of Room 237.</p><blockquote>In the film's opening, the camera from above moves over water and through mountains with the ease of a bird in flight. Below, on a winding mountain road, Jack's diminutive yellow Volkswagen journeys through a tree-lined maze, resembling one of Danny's toy cars or the yellow tennis ball seen later outside of Room 237.</blockquote><h4>Danny Torrance</h4><p>Danny Torrance is considerably more open about his supernatural abilities in the novel, discussing them with strangers such as his doctor. In the film, he is quite secretive about them even with his prime mentor Dick Hallorann, who also has these abilities. The same is true of Dick Hallorann, who in his journey back to the Overlook in the book, talks with others with the \"shining\" ability, while in the film he lies about his reason for returning to the Overlook. Danny in the novel is generally portrayed as unusually intelligent across the board. In the film, he is more ordinary, though with a preternatural gift.</p><p>Although Danny has supernatural powers in both versions, the novel makes it clear that his apparent imaginary friend \"Tony\" really is a projection of hidden parts of his own psyche, though heavily amplified by Danny's psychic \"shining\" abilities. At the end it is revealed that Danny Torrance's middle name is \"Anthony\".</p><h4>Wendy Torrance</h4><p>Wendy Torrance in the film is relatively meek, submissive, passive, gentle, and mousy; this is shown by the way she defends Jack even in his absence to the doctor examining Danny. In the novel, she is a far more self-reliant and independent personality, who is tied to Jack in part by her poor relationship with her parents. In the novel, she never displays hysteria or collapses the way she does in the film, but remains cool and self-reliant. Writing in Hollywood's Stephen King, author Tony Magistrale writes about the mini-series remake:</p><blockquote>De Mornay restores much of the steely resilience found in the protagonist of King's novel and this is particularly noteworthy when compared to Shelley Duvall's exaggerated portrayal of Wendy as Olive Oyl revisited: A simpering fatality of forces beyond her capacity to understand, much less surmount.</blockquote><p>Co-screenwriter Diane Johnson stated that in her contributions to the script, Wendy had more dialogue, and that Kubrick cut many of her lines, possibly due to his dissatisfaction with actress Shelley Duvall's delivery. Johnson believes that the earlier draft of the script portrayed Wendy as a more rounded character.</p><h4>Stuart Ullman</h4><p>In the novel, Jack's interviewer, Ullman, is highly authoritarian, a kind of snobbish martinet. The film's Ullman is far more humane and concerned about Jack's well-being, as well as smooth and self-assured. Only in the novel does Ullman state that he disapproves of hiring Jack but higher authorities have asked that Jack be hired. Ullman's bossy nature in the novel is one of the first steps in Jack's deterioration, whereas in the film, Ullman serves largely as an expositor.</p><p>In Stanley Kubrick and the Art of Adaptation, author Greg Jenkins writes \"A toadish figure in the book, Ullman has been utterly reinvented for the film; he now radiates charm, grace and gentility.\"</p><p>From Kubrick: Inside a Film Artist's Maze: Ullman tells Jack that the hotel's season runs from May 15 to October 30, meaning that the Torrances moved in on Halloween (October 31). On Ullmann's desk next to a small American flag sits a metal cup containing pencils and a pen – and a miniature replica of an ax.</p><p>\"When Ullman, himself all smiles, relates as a footnote the story about the former caretaker who 'seemed perfectly normal' but nevertheless cut up his family with an ax, Jack's obvious interest (as if he's recalling one of his own nightmares) and his insincere congeniality (early signs of a personality malfunction) lead the viewer to believe that the film's definition of his madness will be far more complex.\"</p><h4>Family dynamics</h4><p>Stephen King provides the reader with a great deal of information about the stress in the Torrance family early in the story, including revelations of Jack's physical abuse of Danny and Wendy's fear of Danny's mysterious spells. Kubrick tones down the early family tension and reveals family disharmony much more gradually than does King. In the film, Danny has a stronger emotional bond with Wendy than with Jack, which fuels Jack's rather paranoid notion that the two are conspiring against him. The exact opposite is true in the book, where Wendy occasionally experiences jealousy at the fact that Danny clearly prefers Jack to her.</p><h4>Plot differences</h4><p>In the novel Jack recovers his sanity and goodwill through the intervention of Danny while this does not occur in the film. Writing in Cinefantastique magazine, Frederick Clarke suggests, \"Instead of playing a normal man who becomes insane, Nicholson portrays a crazy man attempting to remain sane.\" In the novel, Jack's final act is to enable Wendy and Danny to escape the hotel before it explodes due to a defective boiler, killing him. The film ends with the hotel still standing. More broadly, the defective boiler is a major element of the novel's plot, entirely missing from the film version.</p><p>Because of the limitations of special effects at the time, the living topiary animals of the novel were omitted and a hedge maze was added, acting as a final trap for Jack Torrance as well as a refuge for Danny.</p><p>In the film, the hotel possibly derives its malevolent energy from being built on a Native American burial ground. In the novel, the reason for the hotel's manifestation of evil is possibly explained by a theme present in King's previous novel Salem's Lot as well as Shirley Jackson's The Haunting of Hill House: a physical place may absorb the evils that transpire there and manifest them as a vaguely sentient malevolence. The film's Hallorann speaks to Danny about that phenomenon occurring at the Overlook. In the novel, Jack does a great deal of investigation of the hotel's past through a scrapbook, a subplot almost omitted from the film aside from two touches: a brief appearance of the scrapbook beside the typewriter, and Jack's statement to the ghost of Grady that he knows his face from an old newspaper article describing the latter's horrific acts. Kubrick in fact shot a scene where Jack discovers the scrapbook but removed it during post-production, a decision which co-screenwriter Diane Johnson lamented.</p><p>Some of the film's most iconic scenes, such as the ghost girls in the hallway, the torrent of blood from the elevators, and typewritten pages Wendy discovers on Jack's desk, are unique to the film. Similarly, many of the most memorable lines of dialogue (\"Words of wisdom\" and \"Here's Johnny!\") are heard exclusively in the film.</p><h4>Film adaptation commentary</h4><p>Although Stephen King fans were critical of the novel's adaptation on the grounds that Kubrick altered and reduced the novel's themes, a defense of Kubrick's approach was made in Steve Biodrowski's review of the film. He argues that as in earlier films, Kubrick stripped out the back story of the film, reducing it to a \"basic narrative line\", making the characters more like archetypes. His review of the film is one of the few to go into detailed comparison with the novel. He writes, \"The result ... a brilliant, ambitious attempt to shoot a horror film without the Gothic trappings of shadows and cobwebs so often associated with the genre.\"</p><br/><h3>Influence in popular culture</h3><p>Both parodies and homages to The Shining are prominent in U.K. and U.S. popular culture, particularly in films, TV shows, video games and music. Images and scenes including the Grady girls in the hallway, the word \"Redrum\", the blood spilling out of the elevator doors and Jack sticking his head through the hole in the bathroom door, saying, \"Here's Johnny\", are frequently referenced in the media.</p><p>Director Tim Burton, who credits Kubrick as an influence, modeled the characters of Tweedledum and Tweedledee in his 2010 version of Alice in Wonderland on the Grady girls (like so many viewers of the film, Burton identifies the girls as twins in spite of Ullman's dialogue to the contrary).</p><p>The Simpsons 1994 episode \"Treehouse of Horror V\" includes a parody titled \"The Shinning\". Similarities include Sherri and Terri, the twins in Bart's fourth grade class looking visually similar to the Grady girls, Homer writing \"No TV and No Beer Make Homer Go Crazy\" and Homer breaking into a room with an axe and uttering 'here's Johnny', only to discover that he had entered the wrong room and using the introduction for 60 Minutes instead. The season 30 2019 episode \"Girl's in the Band\" has Homer, driven mad from working double shifts at the nuclear power plant, experiencing a Gold Room party scene with Lloyd followed by an axe-wielding Human Resources Director who resembles Nicholson's character.</p><p>Dutch dance music duo Hocus Pocus sampled Nicholson's \"Here's Johnny\" line in their 1993 dance song \"Here's Johnny\". In 1994, the song would go number 1 in Australia, making it the first dance single to do so, without radio support in Australia. It stayed at the number one position on the Australian ARIA Charts for five weeks through to 1995.</p><p>American heavy metal band Slipknot pay homage to the film in their first music video for their 2000 song \"Spit It Out\", directed by Thomas Mignone. The video consists of conceptual imagery of the band members each portraying characters enacting iconic scenes from the film, with Joey Jordison as Danny Torrance; Shawn Crahan and Chris Fehn as the Grady sisters; Corey Taylor as Jack Torrance; Mick Thomson as Lloyd the Bartender; Craig Jones as Dick Hallorann; James Root as Wendy Torrance; Paul Gray as Harry Derwent; and Sid Wilson as the corpse in the bathtub. The video was banned from MTV for overtly graphic and violent depictions, including Corey Taylor's smashing through a door with an axe and the scene wherein James Root viciously assaults Corey Taylor with a baseball bat. Mignone and the band eventually re-edited a less violent version, which was subsequently aired on MTV.</p><p>The film's haunted ballroom scene served as inspiration for English musician Leyland Kirby to create the Caretaker alias; his debut album Selected Memories from the Haunted Ballroom (1999) featured a prominent influence from the film.</p><p>American rock band Thirty Seconds to Mars produced a music video for their 2006 single \"The Kill\" which is an extended homage to the film. The music video is set in a haunted hotel, and replicates imagery from the film including the black intertitles with white text, Jack's typewriter, Lloyd's bar, Jack bouncing a tennis ball against a wall, the ghostly woman in the bathroom, the murdered Grady sisters, and the hotel guest being fellated by another man dressed as a bear. The music video was directed by lead singer Jared Leto.</p><p>The film was played at the drive-in theater alongside Psycho as part of the Night of Horrors combo in Twister from 1996. In the 2003 animated film Finding Nemo, Bruce the shark says \"Here's Brucey!\", which is inspired from the \"Here's Johnny!\" quote.</p><p>The 2017 song \"Enjoy Your Slay\" by American metalcore band Ice Nine Kills is inspired primarily by the novel as well as the film adaption. The song also features Stanley Kubrick's grandson Sam Kubrick as guest vocalist.</p><p>The TV series Psych has a 2012 episode titled \"Heeeeere's Lassie\" in which the plot and characters are based on the film. \"Here's Johnny!\" was parodied by British comedian Lenny Henry in an advertisement for Premier Inn. It was banned from being screened on a children's TV network.</p><p>Vince Gilligan, being a fan of Kubrick and his \"non-submersible moments\", has included references to Kubrick movies in many of his works. \"I'm happy to see that his inspiration has shown in noticeable ways in our work in Breaking Bad and Better Call Saul\", says Gilligan. Breaking Bad's 2010 episode \"Sunset\" has a cop radioing for assistance and begins, \"KDK-12\" – the radio address at the Overlook, before being axed. The axe-murdered Grady twins in The Shining are turned into the axe-murdering Salamanca twins in Breaking Bad. The descent of the main character, school teacher Walt, into the dark killer has some similarities to Jack's arc. Reflections are used in both to show the characters change. Better Call Saul has a \"Here's Johnny\" scare in a flashback. Gilligan has also likened his early writing situation, getting snowed in and not writing, to feeling like Jack while going insane.</p><p>Steven Spielberg, a close friend of Kubrick, included a sequence dedicated to The Shining in the 2018 film Ready Player One when they could not get rights to use Blade Runner for a similar sequence. The Overlook Hotel is recreated, including the Grady sisters, the elevator, room 237, the lady in the bath tub, the ballroom, and the 1921 photo, in addition to using the score. Spielberg considered this inclusion a tribute to Kubrick.</p><p>In his 2019 novel The Institute, Stephen King refers to the film, writing, \"The little girls, Gerda and Greta, were standing and watching with wide, frightened eyes. They were holding hands and clutching dolls as identical as they were. They reminded Luke of twins in some old horror movie.\"</p><p>In 2020, the fifth-season episode \"Our Mojo\" of Lucifer paid homage to Kubrick and The Shining by having a young boy riding on a tricycle down a corridor in a hotel with wallpaper similar to the carpet pattern in the film.</p><br/><h3>Sequel and spin-off</h3><p>In 2014, Warner Bros. Pictures began developing a film adaptation of Doctor Sleep (2013), Stephen King's sequel to his book, The Shining (1977). In 2016, Akiva Goldsman announced that he would write and produce the film for Warner Bros. For several years, Warner Brothers could not secure a budget for the sequel nor for a prequel to The Shining to be called Overlook Hotel.</p><p>In June 2019, writer and director Mike Flanagan confirmed Doctor Sleep would be a sequel to both the 1980 film and King's novel. It was released in several international territories on October 31, 2019, followed by the United States and Canada on November 8, 2019.</p><p>In April 2020, a spin-off titled Overlook entered development for HBO Max. In August 2021, HBO Max opted not to proceed with the project. It was soon after reported Netflix was a frontline bidder on the project, though they, too, eventually passed.</p><br/>"
  },
  "errorMessage": ""
}