{
  "imDbId": "tt0133093",
  "title": "The Matrix",
  "fullTitle": "The Matrix (1999)",
  "type": "Movie",
  "year": "1999",
  "items": [
    {
      "publisher": "Portland Oregonian",
      "author": "Shawn Levy",
      "link": "",
      "rate": "91",
      "content": "The Matrix slams you back in your chair, pops open your eyes and leaves your jaw hanging slack in amazement."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Keith Phipps",
      "link": "http://survey-smiles.com/",
      "rate": "90",
      "content": "The Wachowskis do it so playfully well, keeping The Matrix's potentially confusing plot intelligible, intelligent, and suspenseful, that it doesn't matter."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "Manohla Dargis",
      "link": "",
      "rate": "90",
      "content": "Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong. And even if this isn't \"Blade Runner,\" it is very cool shit."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "88",
      "content": "Kinetic, atmospheric, visually stunning, and mind-bending."
    },
    {
      "publisher": "Washington Post",
      "author": "Stephen Hunter",
      "link": "",
      "rate": "80",
      "content": "There's a kind of liberating, almost transforming energy in this film; it lights you up and sends you out all giddy with silliness."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marc Savlov",
      "link": "https://www.austinchronicle.com/events/film/",
      "rate": "78",
      "content": "Doesn't just raise the bar on sci-fi and action films, it rips that sucker off and sends it spiraling into the sun."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "75",
      "content": "The plot switches gears every time it threatens to run out of energy, which keeps the show as lively as it is preposterous."
    },
    {
      "publisher": "Film.com",
      "author": "Sean Means",
      "link": "",
      "rate": "70",
      "content": "Aerves up so much visual wizardry and thought-provoking ideas that even the inevitable Silver touch -- a finale with more bullets than the opening of \"Saving Private Ryan\" -- can't destroy the magic."
    },
    {
      "publisher": "Salon",
      "author": "Andrew O'Hehir",
      "link": "",
      "rate": "70",
      "content": "It may bore you to death or blow your mind -- and it's long and convoluted enough to do both -- but it holds nothing back."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "50",
      "content": "There's not much humor to keep it all life-size, and by the final stretch it's become bloated, mechanical, and tiresome."
    }
  ],
  "errorMessage": ""
}