{
  "imDbId": "tt0047478",
  "title": "Seven Samurai",
  "fullTitle": "Seven Samurai (1954)",
  "type": "Movie",
  "year": "1954",
  "items": [
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "100",
      "content": "Moves like hot mercury, and it draws a viewer so thoroughly into its world that real life can seem thick and dull when the lights come up."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "Much imitated, still unsurpassed. By critical consensus one of the best movies ever made, The Seven Samurai covers so much emotional, historical, and cinematic ground that that it demands to be viewed over and over again."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/2002/0830/p14s01-almo.html",
      "rate": "100",
      "content": "The legendary Mifune leads a superb cast, and Kurosawa's kinetic camera keeps the adventure sizzling with energy and wit from start to finish."
    },
    {
      "publisher": "New York Daily News",
      "author": "Jami Bernard",
      "link": "",
      "rate": "100",
      "content": "It's impossible to imagine how the action genre would have developed without Akira Kurosawa's watershed 1954 movie Seven Samurai."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2021/oct/27/seven-samurai-review-cinema-akira-kurosawa",
      "rate": "100",
      "content": "The glorious vigour and strength of this film is presented with such theatrical relish and flair: its energy flashes out of the screen like a sword."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "90",
      "content": "Rich in detail, vivid in characterization, leisurely in exposition, this 207-minute epic is bravura filmmaking -- a brilliant yet facile synthesis of Hollywood pictorialism, Soviet montage, and Japanese theatricality that could be a B western transposed to Mars."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/reviews/movies?res=9A0CE3D6143BE13BBC4851DFB767838D649EDE",
      "rate": "90",
      "content": "On that simple framework and familiar story line, director Kurosawa has plastered a wealth of rich detail, which brilliantly illuminates his characters and the kind of action in which they are involved. He has loaded his film with unusual and exciting physical incidents and made the whole thing graphic in a hard, realistic western style."
    }
  ],
  "errorMessage": ""
}