{
  "imDbId": "tt0047478",
  "title": "Seven Samurai",
  "fullTitle": "Seven Samurai (1954)",
  "type": "Movie",
  "year": "1954",
  "items": [
    {
      "username": "OttoVonB",
      "userUrl": "https://www.imdb.com/user/ur1559834",
      "reviewLink": "https://www.imdb.com/review/rw0053357",
      "warningSpoilers": false,
      "date": "8 January 2003",
      "rate": "10",
      "helpful": "278 out of 328 found this helpful.",
      "title": "Solid Gold",
      "content": "I discovered 16 of Kurosawa's best known films before returning to the one which is commonly thought of as his masterpiece. Seven Samurai is unlike any other grand classic ever produced. It's basic plot can be summed up in a single easy sentence, yet its refinement and execution rival any movie you've ever seen. The premise: in chaotic 16th century Japan, as marauders threaten raid villages, one village hires samurai to defend it from a group of bandits. Yet Kurosawa (also co-writer) developed these characters in a way unheard of for what might pass as an epic action film. To its astonishing credit, through all of its 207 minutes running time, Seven Samurai never falters or bores. And if the script is a marvel in itself, the acting and production design than derive from it are nothing short of superlative. It is said that Kurosawa forced the villagers (from supporting role to mere extra) to live together as a community during production and be their characters, each and every one of which he had drawn out specifically. This unusual technique gave Seven Samurai a feel of authenticity unparalleled in film history.The samurai themselves are so richly given life to in the screenplay that little more would have been needed to make them memorable characters, yet the main cast pay off at every turn, and though every one of the seven main actors give in perfect performances (never as I had feared before watching it do you confuse them, even in the chaotic battle scenes), two immortal roles have a particularly resounding effect: Takashi Shimura (Kambei Shimada), who plays the leader of the ragged band of samurai, gives his sage and venerable warrior a god-like intensity that makes the magnetic charisma of his character unquestionable. One of the easiest leaders to root for in all the history of film-making. Stealing the show however, albeit by a very thin margin, is longtime Kurosawa favorite coworker Toshiro Mifune (Kikuchiyo) as the rogue seventh, the black sheep of the herd, giving the bravura ultimate performance of a lifetime paved throughout with great roles. The story follows them and the villagers, equally nuanced and developed, through their encounter, training, eventual bonding and the big inevitable fight for survival. Unlike subsequent very successful remakes (i.e. Magnificent Seven), seven Samurai transcended excellency by having many layers (nothing or no one is white or black: everything exists in shades of gray) and thus being very real and human. Even without the menace, its interpersonal dynamics would have made it perfect human drama, subtle, balancing comedy, intensity, realism, drama and a deep philosophy with astonishing ease, yet the menace does materialize and thus Seven Samurai unleashes its violence in a series of action scenes crafted with such vision and ingenuity as has ever reached an action film (the frenetic battle scenes at the end rather evoke Saving Private Ryan in their relentlessness).In the end, what made this into solid gold was, at the core, Akira Kurosawa, who would, despite directing many further masterpieces (Throne of Blood, Yojimbo, Red Beard, Dersu Uzala, Kagemusha, Ran), would never top this one. Throughout his life, Kurosawa kept confirming his status as perhaps the greatest director ever. If so, Seven Samurai is the ultimate proof of that truth. One of the very best films ever made and personal all-time favorite."
    },
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0053207",
      "warningSpoilers": false,
      "date": "28 November 2001",
      "rate": "",
      "helpful": "168 out of 213 found this helpful.",
      "title": "Story-Telling At Its Finest",
      "content": "Story-telling at its finest, \"Seven Samurai\" is a terrific film not because of a handful of memorable scenes or lines, but rather because scene-by-scene, frame-by-frame, it tells an interesting story as well as it is possible to tell it. The story and characters are developed carefully, and everything about the movie, from the settings and props to the musical score, is done carefully and expertly.Mifune grabs the attention in most of his scenes, and Shimura's more restrained character is a nice balance. Those two have the best parts, but all seven of the samurai are memorable characters. The sequence of events that collects the seven together occupies the first part of the movie, and forms a perfect foundation for the rest. A few of the villagers are also portrayed nicely, although they are naturally overshadowed when the samurai are around.The story always moves along nicely, with many ups and downs. It has enough unpredictability to keep you interested the whole time, without ever losing its credibility. There is plenty of action, but there is also substance behind the action to give it more significance. The only possible drawback is the long running time (you can always split it up into two installments, but it's more satisfying if you can watch the whole story through at once), but there is little that you could cut out, even if you wanted to. It holds your attention the entire time with a good story and great technique, not by resorting to sensational or sordid details.This movie well deserves its reputation for excellence, and is one that everyone who appreciates classic cinema will want to see and enjoy."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0053406",
      "warningSpoilers": false,
      "date": "7 December 2003",
      "rate": "10",
      "helpful": "153 out of 203 found this helpful.",
      "title": "Kurosawa's triumphant epic- totally & successfully driven by character and story",
      "content": "Akira Kurosawa was and is considered the master of east-western film-making (in that he made his Japanese films accessible for fans of American westerns while still making the movies his country found popular), and out of the few Kurosawa movies I've had the pleasure of viewing (Hidden Fortress, Rashomon, and this) I'd have to say that while Rashomon is still my favorite, I nevertheless had a blast during this one. The story has become quite influential to filmmakers from the likes of John Sturges (The Magnificent Seven) to John Lasseter (A Bug's Life): a small village has been terrorized by bandits for far too long, amid times of civil war in the nation, and so on the advice of Grand-Dad, they decide to hire four - which soon becomes seven - samurai for the job. There's no money, just food and honor, even though the village isn't exactly pleased to have samurai back in their village. Each character is drawn and executed compellingly, though for my money Toshiro Mifune proves why he became one of Japan's most notorious film actors. His work as the brave, bold outcast of the seven is awe-inspiring practically all the way through, like the hero of a western that anyone can root for since he's a true rebel at heart within a group of men with a task at hand. Kurosawa directs his tale and main and supporting players like a grand composer, orchestrating a vivid story and extracting from great actors like Takashi Shimura (the old, wise Samurai), Ko Kimura (the disciple Samurai), Daisuke Kato (Schichiroji), and Mifune (Kikuchiyo, which isn't his real name) just the right touches of humanity, humor, tragedy, romance, and intensity. The overall intensity, by the way, isn't over-estimated; its long length (almost 3 1/2 hours) isn't distracting in the slightest since Kurosawa's editing and photography (the later helmed by Asakazu Nakai) are extraordinary. Not to compare the two films, but one thing I saw in common with Seven Samurai and a Lord of the Rings film is that, if anything else, it definitely isn't a boring experience. Along with a score by Fumio Hayasaka that gives the film just a bit more of a pulse, and a showdown that is relentless with excitement, this is one of the must-see action films for film buffs, or anyone with an serious interest in having fun with an epic."
    },
    {
      "username": "gkbazalo",
      "userUrl": "https://www.imdb.com/user/ur1147128",
      "reviewLink": "https://www.imdb.com/review/rw0053444",
      "warningSpoilers": false,
      "date": "17 August 2004",
      "rate": "",
      "helpful": "214 out of 255 found this helpful.",
      "title": "Memorable characters and one of the best action movies of all times",
      "content": "Having seen Kurosawa's Seven Samurai at least 10 times, I still see something new every time I watch it. I don't see how anyone, especially a non-Japanese, could possibly absorb this movie in less than 2 or 3 viewings. I've always been surprised at how each of the 7 samurai can make such an individual impression on you even if you can't understand Japanese. Although Toshiro Mifune is often considered the star, for me its Takashi Shimura who is firmly fixed at the center of the movie. He is the guiding moral force from the moment of his appearance in the film and can capture the viewer's attention in a way similar to Alec Guinness. Mifune's character can be annoying at first in his loutish behavior, but he gains stature throughout the film and eventually becomes a unifying force second only to Shimura. Minoru Chiaki as the woodcutting samurai provides a subtle humor and the others look to him to boost their morale. Daisuke Kato is another very familiar face to Japanese movie fans and provides an excellent foil to Shimura as his second in command. Yoshio Inaba is very good as the samurai who is recruited by Shimura and quickly builds a strong rapport with him. Seiji Miyaguchi as the \"expert\" warrior, dedicated to honing his skill as a swordsman is a very low key yet likeable character. Ko Kimura as the young hero-worshipping samurai, as well as the love interest of the peasant girl, wishes to be a great samurai, but is easily distracted by a field of flowers or a pretty face. The peasants in the village being defended by the samurai each have their own defining characteristics as well.In addition to the wealth of interesting characters, we have a terrific action plot--the defending of the village from 40 marauding bandits by the small troop of samurai--, and a more subtle secondary plot involving the distrust of the samurai by the villagers due to the historical interaction of these two classes in feudal Japan. All of these plot and character elements are woven together into an unforgettable epic, but, at least in my opinion, its not one that can be absorbed in a single sitting. While it's similar in this sense to another of my favorite epics, Leone's Once Upon a Time in the West, it is more complex given the number of characters.I can only say that your patience with this film will probably be well rewarded if you take the time to give it multiple viewings. You will also have the pleasure of seeing many of the samurai and villagers pop up in other Kurosawa films and films of other Japanese directors. If you like Mifune and Shimura in this one, catch them in Stray Dog and Drunken Angel in very different settings and parts. This one is 10 out of 10 without a doubt."
    },
    {
      "username": "Davor_Blazevic_1959",
      "userUrl": "https://www.imdb.com/user/ur6136051",
      "reviewLink": "https://www.imdb.com/review/rw2255204",
      "warningSpoilers": false,
      "date": "25 May 2010",
      "rate": "10",
      "helpful": "184 out of 214 found this helpful.",
      "title": "Arguably, the best samurai film ever made",
      "content": "Though its biblical connotation is not the happiest one (\"Seven Deadly Sins\") number seven, omnipresent in our (7 days a) weekly cycles, seems to have been a lucky number in the world of cinema. Several very solid and some great movies have this number in their title, starting with gag-wise incredibly inventive Seven Chances (1925) from genius of silent era Buster Keaton, Frank Borzage's silent version of classic melodrama 7th Heaven (1927), Walt Disney's first feature-length animated movie, Snowhite and Seven Dwarfs (1940), recognized as an instant classic and remained so ever after, Stanley Donen's ear-pleasing, eye-riveting musical Seven Brides for Seven Brothers (1954), staged in western milieu, with the breathtaking barn-raising dance sequence, Ingmar Bergman's literally Death-defying, answers-to-reasons-for-human-misfortune-seeking masterpiece, Det sjunde inseglet (\"The Seventh Seal\") (1957), Billy Wilder's Seven Year Itch (1957), a clever and amusing first collaboration with incomparable Marilyn Monroe (a worm-up for their second, bigger if not decisive step in taboos-of-the-motion-picture-production-code-breaking, brilliant comedy Some Like It Hot (1959)), up to newer examples like David Fincher's disturbing drama Se7en (1995), one of the finest Hollywood movies of the 90's, as well as Tsui Hark's Chat Gim (\"Seven Swords\") (2005), a stunner in the department of action sequences from the often under-appreciated genre Wuxia, originating from Chinese literature.However, even among such illustrious examples of movie-making par excellence, one movie holds a special place, Shichinin no samurai (\"Seven Samurai\") (1954) from the legendary Japanese director Akira Kurosawa. This movie doesn't seem to lack anything that an avid movie consumer, in particular samurai genre admirer, might be wishing for.It is not easy to say anything new about the one of the most analyzed and scrutinized movies of the film history. Nevertheless, and despite being eventually only repeated, it shall be mentioned that movie has a simple but very engaging story - a group of peasants, representing a village, periodically stormed by gang of bandits, looting their crops and other possessions, hires several wandering ronins (masterless samurai) to help them protect the village - not without lucid observations on the possibility of social interaction between members of different classes during the almost seven centuries long feudal history (1185-1868) of Japan.Characterization is excellent, and though having clear stand-outs in samurai's true leader, Kambei (Takashi Shimura), a wise tactician of the exceptional valor, as well as in the exuberantly uncontrollable Kikuchiyo (Toshiro Mifune), messy in its appearance and blustering in its manner, yet, a peasant descendant himself, making for a perfect link between the samurai and their employers, all other samurai are memorable, as well, sporting wide variety of personality traits. In joining the village protection campaign, hired for nothing more than a regular meal for as long as providing a service, thus primarily hoping to finally fill their starving stomachs, each one of them was driven by different additional motives, whether they were challenged to test their bravery, fighting skills and tactics, seeking for excitement and recognition, trying to regain pride and glory of the past days, just reaching out for that human touch (cross-class communication, even mere courtship promising relationship) they have been deprived of, or simply interested in its noble cause.Together with true highlights in realistically choreographed battle scenes, showing all the pain and misery of excessive violence on the reverse of heroism, that even defenders cannot avoid resorting to, sadly announcing inevitable decline of the samurai and their ways exposed to new artless technology, unbecomingly dying ambushed by distant shots from the muskets, while ingloriously stuck in the village muds... it all makes for a compelling narrative.Though triumphant in their common task to protect the village, unlikely alliance between samurai and peasants is ultimately doomed to fail. In the short run, it gives expected results, but in the long run, does not stand the chance. That is so loudly, although in fact silently, expressed at the end, when peasants don't even care to join the surviving samurai in their mourning over the fallen ones, not even giving the last well deserved respect to those who have helped them withstand fierce attacks, prevail and ultimately defeat bandits, and, in doing so, most of them given their lives. Peasants simply continue with their daily chores, while surviving samurai have to leave the village, like they have never existed, sadly symbolizing their ultimate destiny: slowly but surely stepping off the future pages of the history books.Seven Samurai, the movie, is rightfully considered as the one that has redefined samurai film in its contemporary perception, and dawned almost two decades long string of successes, instantly becoming the brightest example of thus revived, uniquely provocative and entertaining sub-genre, unknown as such in the country of its origin, classified there within a broader genre, jidaigeki (a period drama, often describing events from pre-modern era of the Edo period, marking the governance of Tokugawa shogunate (1603-1868), relatively peaceful times for Japan's long history of civil wars, as opposed to gendaigeki, films treating contemporary matters), and by IMDb standards, as an action drama, occasionally historical, when based on real events.Originating in the Edo-era Far East, it has inspired equally successful, star-studded (Y. Brynner, S. McQueen, C. Bronson, J. Coburn, E. Wallach, R. Vaughn, H. Buchholz, B. Dexter) Hollywood remake, The Magnificent Seven (1960), conveniently situated in the U.S. West of 19th century, as well as three lesser sequels, Return of... (1966), Guns of... (1969), and ...Ride! (1972)."
    },
    {
      "username": "PureCinema",
      "userUrl": "https://www.imdb.com/user/ur0092583",
      "reviewLink": "https://www.imdb.com/review/rw0053287",
      "warningSpoilers": false,
      "date": "26 December 1998",
      "rate": "10",
      "helpful": "356 out of 442 found this helpful.",
      "title": "Kurosawa is the greatest director that ever lived",
      "content": "Akira Kurosawa's masterpiece... The Japanese equivalent to Orson Welles' Citizen Kane.. I say it's just as good, if not even better. Not only Kurosawa's most well known film, but the most widely recognized Japanese film ever made. This movie will forever be known as a milestone in motion picture history.The story revolves around a village that has become a group of bandits' common looting and pillaging ground. The villagers cannot take this any longer and go to town to hire warriors to defend the village from the bandits. A wandering ronin, Kambei (Takashi Shimura) agrees to help them and with his help, they recruit six others that agree to take the job. The seven samurai teach the villagers how to stand up to the bandits and defend themselves. Finally, when the time comes, they engage in a fierce battle with the attacking bandits.About once in every 20 years or so we are gifted with a film that has the meaning, power, richness, and technique that The Seven Samurai has. I cannot urge anyone enough to see this film, the images are true cinematic poetry rich with so much emotion that I cannot even describe them in words. If you have never seen any of Kurosawa's works, then please see Seven Samurai... you will witness the true beauty, excellence and magic that the art form known as film is capable of."
    },
    {
      "username": "salfamily",
      "userUrl": "https://www.imdb.com/user/ur1242682",
      "reviewLink": "https://www.imdb.com/review/rw0053188",
      "warningSpoilers": true,
      "date": "29 July 2001",
      "rate": "10",
      "helpful": "484 out of 543 found this helpful.",
      "title": "Required Viewing",
      "content": "The archetypal action film, Seven Samurai is also one of the richest works to ever be committed to celluloid. Each of its characters is extraordinarily realized; each has his or her own arc, his or her own vital part to play in the film's slow progression towards its dramatic finale. Typically, Kurosawa has put the film together using an exceeding degree of artistry; each and every shot, each action sequence, is exquisitely composed; and yet none seems contrived or out-of-place within the overall fabric of the work. Everything is beautifully conceived and in focus, both literally and figuratively.When watching Seven Samurai, movie lovers will immediately recognize that several of its key elements can be readily detected in countless similar films made during the last half-century. The audition scenes, in which several samurai are recruited for the difficult task of defending a farming town from a group of bandits, strikes a particularly familiar chord, as do those showing the samurai training the lowly villagers to fight and use weapons. Indeed, the theme of a highly experienced group of \"tough guys\" taking up the cause of the disenfranchised has become something of an action film cliche, portions of which echo throughout the American western, as well as its progeny (think The Dirty Dozen, The Road Warrior or even television's The A Team).But what really stands out in Seven Samurai are its characters. They run the gamut, from elder teacher to hopeful youth, stoic warrior to undisciplined brigand. Kurosawa even finds room for a youthful romance, not to mention the mix of poor and beleaguered townspeople he depicts within the setting of the town. Perhaps its no wonder the enemy bandits are virtually faceless-- there is so much conflict and passion present within the group of protagonists, the villains need not be more than a vague threat. Through it all Kurosawa never forgets who these people are and where they stand in comparison to one another. Obviously, the samurai are, for the most part, samurai, while the townspeople are merely peasants, lacking even in funds to pay their noble defenders. Kurosawa deftly illustrates these class differences by having one peasant fear horribly for the honor of his daughter, who he suspects will be lured by the wealth of the samurai; and also by giving us one samurai who is no samurai at all, but merely a peasant himself whose own farming village was in his youth destroyed by marauding warriors. The film thus wraps a a portrait of class conflict in a cloak of solidarity. The samurai unite to defend the poor peasants, but the ending is not exactly happy for them. Nor are the peasants completely honorable. We learn, for instance, that they have in the past murdered defeated samurai and looted their bodies, and it becomes apparent late in the film that their claims of poverty are perhaps not as truthful as at first seemed apparent.So why do the samurai defend them so valiantly? For honor? For love of adventure? The answer to this question is left intentionally vague; it is up to each viewer to draw his or her own conclusions. It is to the film's credit that it forces such questions upon us while never allowing them to cause the motivations of its characters to seem untrue.Modern viewers will find the action sequences of Seven Samurai to be restrained. There are, for instance, no \"Gladiator\" or \"Braveheart\" moments in which limbs are visibly hacked off, blood flies and speakers pound with booming audio. But the action is wonderfully filmed and there is some early use of slow motion to accentuate key moments. The 3 1/2 hour running time may also deter some, but I find the length to be one of the film's charms; it takes its dear sweet time in exposing its riches, and no single moment feels underdeveloped or awkward. Don't miss it.10/10"
    },
    {
      "username": "Platypuschow",
      "userUrl": "https://www.imdb.com/user/ur57590728",
      "reviewLink": "https://www.imdb.com/review/rw4288767",
      "warningSpoilers": false,
      "date": "17 August 2018",
      "rate": "9",
      "helpful": "37 out of 50 found this helpful.",
      "title": "Shichinin no samurai: Simply outstanding",
      "content": "I've been on a Toho binge for a while now and for the most part the films have been enjoyable, especially those by Kurosawa. The earlier films were dark, bleak and unsettling viewing and therefore going into Seven Samurai I was of two minds. First I expected more of the same, in both quality and tone but then on the flipside at time of writing this is ranked as the 19th highest rated movie on IMDB which is incredible.My expectations were that it would be good, but that's about it. Seeing Takashi Shimura in the credits also confirmed my logic that this was going to at least be an entertaining three and a half hours.I was mistaken, Seven Samurai is not good............it's outstanding.Wonderfully crafted, perfectly scored, incredibly choreographed, well acted and beautifully written this is well deserving of it's high place and I would consider it nothing short of a masterpiece.If you check out my IMDB rating distribution it's very clear to see that getting anything higher than an eight is a rarity, this deserves it on so many levels.I didn't expect this level of quality further as generally I don't tend to agree with titles in the IMDB top 250, this however I do I thoroughly unconditionally agree.A masterpiece and essential viewing, I don't even need to give the premise of the movie in this review and must simply stress that this is film making mastery at its finest.The Good:Takashi ShimuraVery well shot for its timePerfectly craftedThe Bad:Nothing springs to mindThings I Learnt From This Movie:Akira Kurosawas should be a household name, not Bruckheimer or Bay!I'll put money down now that none of the remakes or movies heavily influenced by Seven Samurai comes close in quality"
    },
    {
      "username": "simon_booth",
      "userUrl": "https://www.imdb.com/user/ur1062540",
      "reviewLink": "https://www.imdb.com/review/rw0053361",
      "warningSpoilers": false,
      "date": "31 January 2003",
      "rate": "10",
      "helpful": "201 out of 298 found this helpful.",
      "title": "Haven't you seen it yet?",
      "content": "Well, if you haven't seen Seven Samurai then you're not really qualified to call yourself a film fan, basically. One of the most influential movies of all time, that still holds up extremely well nearly 50 years later. Akira Kurosawa's epic tale of heroism and barbarism set the standard in so many ways it's hard to imagine that any modern film does not show its influence in some way or other. A great script, great characters, mostly great acting, splendid cinematography and action sequences that wrote the book about how these things should be filmed. Even now, after so many have tried to imitate or beat it, Seven Samurai remains a totally gripping 3.5 hour experience. Akira Kurosawa is one of the gods of Cinema - men who seem to have been born to make films, who have it in their blood. People like Alfred Hitchcock, Stanley Kubrick, King Hu and Steven Spielberg, who make it look easy... who so obviously \"get it\". In this pantheon, Kurosawa is perhaps the daddy of them all, however, and Seven Samurai is one of his finest moments. The scale of the production is remarkable - to undertake making such an epic in post-war Japan was a feat in itself. The cast of dozens of inhabitants of a village specially built for the movie, the 40 bandits and their horses, all the costumes, the armour, the weapons. Few directors could have brought all of this together and still paid such attention to the smallest of details in script and scene. Credit must go to the team Kurosawa worked with too, I presume The movie's setup became the template for many movies to follow, the most recentl example that comes to mind being the excellent Korean period movie MUSA (The Warrior), for example. A motley band of characters is assembled and placed in a situation where the odds are seemingly stacked against them, and each gets there chance to really shine, prove themselves and become something more than a normal man. Kurosawa's Samurai movies all share a little bit in common, which is the depiction of the Samurai as some noble beast, different from the common and pathetic rabble of ordinary man. In Seven Samurai the farmers are a base lot, cowardly, selfish, vain, pathetic and treacherous. How he found actors with such miserable looking faces is a mystery in itself. In contrast, the Samurai embody all the qualities that humanity would generally like to believe define it (us). Brave, righteous, honest, strong and heroic. Toshiro Mifune's character stands in the middle and represents this difference - perhaps meant to suggest that mankind can strive to rise above his flaws, but mostly suggesting to me that the common man is basically a mess and we should learn to respect our betters. Kurosawa was definitely not a socialist, unless I'm mis-reading him wildly. I'm sure many out there wonder, does a 50 year old black and white movie about Samurai really have any interest or relevance to us in the 21st century? The answer is a definite \"Yes!\". Seven Samurai shows us what cinema can be, what cinema is *meant* to be. It is moving picture as art in a way that the multiplex-fillers of today cannot possibly claim to be. It's a film that satisfies on many different levels, and still provides a bench mark which today's film makers could and should use to evaluate their own contributions. True, few out there will ever be able to claim they've made a film that rivals Seven Samurai in scope or beauty, but this *is* what every director should aspire to! The sad thing is, I just can't see a project like this ever coming out of the Hollywood studio system, where art is just another commodity and marketing is the new god"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8750516",
      "warningSpoilers": false,
      "date": "22 December 2022",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Ahead of its time.",
      "content": "Fearing for their lives and livelihood, a group of villagers hire seven samurai to protect them from a group of marauding bandits.For my shame, this is the first Samurai movie I've ever seen, and if this is anything to go by, I've seriously been missing out.A bold statement, but I would call this film a masterpiece, it's actually pretty long, but where some modern two or three hour modern films bore me a little, I hadn't noticed that an afternoon had passed me by, it had actually gone dark when the credits rolled.Quite a lot of violence for a film of this time, the main showdown is a fantastic, quite brutal scene, it's the moment you wait for, although the initial character play is very interesting, the acting is too notch.I've read a few comments where people have said they found it hard to follow, personally I didn't, I engaged the whole way through.Visually very striking, the sets and production values hold up remarkably well.It's brilliant, 10/10."
    },
    {
      "username": "SonOfaGunderson",
      "userUrl": "https://www.imdb.com/user/ur0679995",
      "reviewLink": "https://www.imdb.com/review/rw0053315",
      "warningSpoilers": false,
      "date": "3 February 2001",
      "rate": "10",
      "helpful": "240 out of 318 found this helpful.",
      "title": "Awesome",
      "content": "In 1954, Kurosawa made foreign film history with Seven Samurai. Everything about this film is just absolutely terrific. The film lasts around 3 1/2 hours, and every minute of it is unbelievable filmmaking. Kurosawa's blend of stellar craft, captivating cinematography, ravishing art direction, and unforgettable characters makes this one of the most intelligent films ever made. The first hour is devoted to devoloping the many four-dimensional characters which inhabit the film throughout. When watching the film, the audiece cares for, trusts, mourns and ultimately believes every single attribute the characters have. Samurai set up the way that many action films are made today; films like Predator and Alien still work within it's boundaries. The battle scenes are terrific and the fast-paced editing is ground-breaking. If people have a problem with subtitles and long movies, then see this and your opinions will change. The sheer filmmaking of Kurosawa will not disappoint. Also see Yojimbo and High & Low."
    },
    {
      "username": "yippeiokiyay",
      "userUrl": "https://www.imdb.com/user/ur8908079",
      "reviewLink": "https://www.imdb.com/review/rw1267723",
      "warningSpoilers": false,
      "date": "17 January 2006",
      "rate": "",
      "helpful": "105 out of 139 found this helpful.",
      "title": "Complex Beauty",
      "content": "Donald Richie thought it was Kurosawa's finest, and suggested that it might the best Japanese film ever made. It is a film that rewards casual viewing and careful viewing and repeated viewing and viewing over time. Isn't that rather like a wonderful book, that rewards you every time you pick it up? I suppose that is the definition of greatness. How was this greatness achieved? (This is not a rhetorical question. It truly astonishes me how this film creates meaning...cutting across all boundaries of nationality, language, and culture to become a meaningful personal experience for those who view it). This creation of greatness may be a mystery, but we can point to the some features of the film's excellence: The artistic achievement: The music, the cinematography, the extensive set design, the editing and the acting in the service of a moving story all conspire to create a world that becomes ours on a deeply personal level. It is a film which influences later films and filmmakers. The narrative achievement: Based on an original concept of Kurosawa's which began as a \"day in the life\" documentary of a samurai's existence, Kurosawa developed the idea into this breathtaking film of samurai who save a village. This simple but complexly nuanced human story involves us in different social classes in an historical framework. We come to know individual peasants and samurai, and feel that we know significant things about them, their motivations, hopes and fears.The achievements of the actors: These are characters you will love, people you need to have in your life: the characters of Kyuzo, Heihachi and the unforgettable Bokuzen Hidari as a bewildered peasant..! Takeshi Shimura, as the leader of the samurai, Gambei, is the embodiment of wisdom, and calm in the storm. And, saying that Toshiro Mifune has star power is like saying the noonday sun sheds a little warmth. Toshiro: It's the cut of his jawline when he asks the village patriarch, \"Got a problem, grandad?\", and the most charming look of confusion and embarrassment playing over his face when he is told by Heihachi that he is the triangle on the samurai flag. It's his energy, speed and agility and power and intelligence. Mifune sniffing out the fuse of a gun in the woods, bouncing through the brush half-naked in an abbreviated set of armor, or carrying his ridiculously oversize sword on one shoulder, Mifune crying over a baby, and the incomparable scene of his embarrassment that turns to rage when Mifune accuses the samurai of creating the farmer's condition. Toshiro Mifune represents with extraordinary physicality the spirit of a man desperate to prove his worth: Mifune's got the animal sexuality, the physical response to emotional situations, the expressive face, the humorous and varied vocalisms to make us feel deeply what his character experiences: his struggles, his growth.(His drunken burblings as the last \"samurai\" to audition are nothing short of hilarious, and his \"fish singing\" is eerie and funny, too...also the grunted \"eh?\" that he often uses to show confusion, and the \"heh\" of disgust..such wonderful sounds, and so expressive!) Mifune's acting is wild and alive, even more than 50 years after the film's original release. Takashi Shimura: You will trust him with your life. His great, open heart, his mature calm, his honesty and compassion make him one of the greatest of all samurai on film.Fumio Hayasaka's music: Kuroasawa was lucky to have such a brilliant composer as collaborator. Themes introduce characters, and the samurai theme is surprising and memorable. If you have viewed the film, chances are, the samurai theme is playing in your mind with just a mention of the music. Hayasaka's music is muscular and nuanced: creating humor, or a counterpoint to the action, or deepening our sympathy for and understanding of the characters. Muraki's scenography: There is no doubt that the places shown in the film are real. The achievement of Kurosawa's longtime collaborator provide a real world for the action.The filmography is ground-breaking: the multiple cameras, slow-motion and attention to light and composition make each frame worthy of an 8X10 glossy. How can individual moments of such beauty be sustained throughout the movement of the film? It is an astonishing feat. And, best of all, no image degenerates into interior design or vacuous prettiness...everything forwards the movement of the cinematic experience. When the film ends, we feel as if we have lived it! It is with great respect and humility that I offer my thanks to the memory of Mr. Kurosawa. His great work leads us to treasure humanity and its struggles, to develop our own abilities to feel compassion, encourages us to try to make good choices, to be socially and morally responsible, to embrace life."
    },
    {
      "username": "groatski",
      "userUrl": "https://www.imdb.com/user/ur2786478",
      "reviewLink": "https://www.imdb.com/review/rw1196552",
      "warningSpoilers": false,
      "date": "18 October 2005",
      "rate": "7",
      "helpful": "100 out of 150 found this helpful.",
      "title": "Long and sometimes hard to follow.",
      "content": "Okay, call me an ignorant, uncultured, short-attention-span Yank if you wish, but I found this movie drawn-out and difficult to follow. It was indeed masterful storytelling with great character development, but the movie seemed to take quite a long time to get going, and when it did it was not the cinematic juggernaut I was expecting. Perhaps my expectations were too high? I don't think so. As of this writing Seven Samurai is at #6 in the all-time greatest movies list (and the only foreign-born film in the top 20), so I've obviously missed something big.This was by no means a bad movie; it was in fact a very good movie. However, all the really excellent movies I've seen have one thing in common - they carry you away with them. You get so involved with the story and characters that you feel like you know them personally. I did not get that here. Instead I kept trying to figure out what was going on, and why people were dramatically wailing and rolling on the ground in reaction to situations that didn't seem to warrant it. Is there perhaps a cultural difference that I'm not linking into? Am I over-analyzing it? I fully expected to walk away from this film wide-eyed and and muttering 'Wow. Just .wow' over and over (as I have with so many other films on IMDb's top 100), but instead I'm left to ponder why I seem to be the only one who's not getting it. I'd watch it again, but 3-1/2 hours is a long time."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw2105540",
      "warningSpoilers": false,
      "date": "2 August 2009",
      "rate": "10",
      "helpful": "26 out of 48 found this helpful.",
      "title": "One of the Best Movies of Cinema History",
      "content": "In the Sixteenth Century, in Japan, a poor village is frequently looted by armed bandits losing their crop of rice. Their patriarch Grandpa advises the villagers to hire a Ronin to defend their village. Four farmers head to town to seek out their possible protectors, but they just can offer three meals of rice per day and lodging for the samurai. They succeed in hiring the warming-hearted veteran Kambei Shimada (Takashi Shimura) that advises that they need six other samurai to protect their lands. Kambei recruits the necessary five samurai and the brave jester Kikuchiyo (Toshirô Mifune) and move to the village. After a feared reception, Kambei plots a defense strategy and the samurai start training the farmers how to defend their lands and families for the battle that approaches. In order to celebrate the milestone of 4,000 reviews in IMDb, I decided to watch again \"The Seven Samurai\", the most known masterpiece of Akira Kurosawa and among my Top-10 movies ever. As far as I recall, this was the first samurai movie that I have watched and it is still my favorite despite many other excellent movies. \"The Seven Samurai\" is a perfect movie: the story and screenplay are amazing, dividing the dramatic story in the recruitment, reception, strategy, training, harvest, romance and the final battle of the samurai in such a way that the viewer does not feel the 207 minutes running time. The direction of Akira Kurosawa is perfectionist as usual, and the choreography of the battle in the rain is extremely realistic. The acting is top-notch, highlighting Toshirô Mifune in a great shape, climbing trees, jumping and fighting in the role of a funny character. The cinematography, set decoration, costumes, lighting, everything is fantastic. In 1960, John Sturges remade this masterpiece with the western \"The Magnificent Seven\". My vote is ten.Title (Brazil): \"Os 7 Samurais\" (\"The 7 Samurai\")"
    },
    {
      "username": "cindel-2",
      "userUrl": "https://www.imdb.com/user/ur0324590",
      "reviewLink": "https://www.imdb.com/review/rw0053304",
      "warningSpoilers": true,
      "date": "23 October 2000",
      "rate": "10",
      "helpful": "135 out of 174 found this helpful.",
      "title": "A really great epic film, beautifully told with stunning acting",
      "content": "This is one of those great epic films that stands the test of time. I only saw this film for the first time in 2000, almost 50 years after it was made, and was astounded by it. It was an epic that truly told the whole story. Whereas most movies today manage to skirt around huge chunks of what would happen, this movie manages to show them all, and not in a boring way. The samurai don't even reach the village in danger until more than 30 minutes into the film, all that time being spent getting to know each of the characters and the motivation and history behind them. We get to truly learn what it takes to be a samurai, and what truly sets them apart. By the time we arrive at the village we have become attached to some of the samurai in a very personal way, respecting each of them in their own way. The rest of the movie progresses as if it were a documentary, not a fictional film, where we see each and every piece of the grand puzzle that happens in this village. I can't recommend this film enough, though I must throw a disclaimer out that if you're not a fan of epic movies with subtitles you may not be as interested. It is a 3 1/2 hour long movie! But if you can find the time to sit down and watch it, I doubt you'll be very disappointed."
    },
    {
      "username": "Kool_Joker",
      "userUrl": "https://www.imdb.com/user/ur1557989",
      "reviewLink": "https://www.imdb.com/review/rw0053333",
      "warningSpoilers": false,
      "date": "30 September 2002",
      "rate": "",
      "helpful": "158 out of 212 found this helpful.",
      "title": "This film can be described in one word...Awesome!!",
      "content": "This is my favorite Kurosawa film, the man was a true master of the cinematic arts. If you have never seen a Kurosawa film definetly make this your first. Though extremely long at about 3 1/2 hours it is well worth the time spent.To quickly summarize, a poor Japanese village hires 7 Samurai to protect it from being raided by bandits. Don't get me wrong there is way more to it than that, I just dont want to give anything away. This is an intense and emotional movie that hooks you from the first scene and keeps you on the line till it is all over. The battle scene at the end is in true Kurosawa form. The acting is outstanding by everyone involved from the main characters all the way down to the very last extra. Of course the best way to see any film, especially a Kurosawa film is on the big screen if you are able to. Beautifully filmed, in black and white, anyone familiar with Kurosawa's work has to wonder visually how much more gorgeous it could have been had Kurosawa had the option of color in 1954.The camera use is brilliant and every scene is balanced visually. This film is also the first one to use \"the wipe\" as a way of changing from one scene to another. This technique was later used by George Lucas in his Star Wars movies. I would also recommend the DVD version that has the commentary option by the Japanese cinema expert if anyone is interested in a deeper understanding of the \"hows\" and \"whys\" of Kurosawa's film making. Any man, woman, boy or girl who just wants to see a really, really great movie, THIS IS THE ONE! An A+++ in my book."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0053206",
      "warningSpoilers": true,
      "date": "27 November 2001",
      "rate": "",
      "helpful": "26 out of 52 found this helpful.",
      "title": "A Solid Defense of Art",
      "content": "Spoilers herein.We are all villagers through whose small world great artists pass.This is so clean, so effortless -- the originality is hard to appreciate because so much has been absorbed into the vernacular, but it still amazes. My idea of genius is when someone can show you something you have never seen, but show it to you in such a way that you believe you knew it all along.This is a work of genius."
    },
    {
      "username": "driffma",
      "userUrl": "https://www.imdb.com/user/ur1318354",
      "reviewLink": "https://www.imdb.com/review/rw0053193",
      "warningSpoilers": true,
      "date": "31 August 2001",
      "rate": "10",
      "helpful": "52 out of 88 found this helpful.",
      "title": "Brilliant composition plus brilliant acting = brilliant flawless movie!",
      "content": "It is hard to know exactly where to begin when talking about a film of such utter quality. What must be said at the start is that \"The Seven Samurai\" is flawless. It's characters are brought to life by some of the finest and most committed acting I have ever seen. It is a compelling story of courage, duty, honor, respect and change.I could echo Roger Ebert's commentary, in which he noted that Kurosawa's film set the standard for the modern action film. It was he notes the first film to assemble a team of hardened men to undertake a mission. But I say read Eberts review if you want to get his take.I have watched the film several times and what is truly amazing about \"The Seven Samurai\" is the way in which Kurosawa choses to tell his tale, which is, I think, truly innovative and subtle.Growing up on action fare as we have \"Seven Samurai\" should really hold no magic for us. We have the formula (in many forms) before. Countless times. However it is not old to us and magic it carries. I make the case (now anyway) that this comes largely from Kurosawa's knack, his amazing gift, for photographic composition. Most filmmakers today in the action genre have some flare for flashy cinematography. We get sharp angles, dramatic poses (most favorably lighted), and fast cuts. I guess this is to involve us in the high emotion of the situation. But Kurosawa has patience and while I think he gave the blocking of his shots, and their composition a great deal of thought, it comes across as if he did not. His camera moves as though it were simply following the characters through the story. The camera work in \"Seven\" is so much more subtle and so much more compelling than almost any action fare today. His camera allows, we the viewer, to be, at various times, all of the major characters in the film.Toshiro Mifune's emotional explosion at his \"fellow\" Samurai is probably the most obvious example of this. He gets up and at first appears to agree with the Samurai sentiment that killing all of the villagers is a good idea, but when he turns and his anger is directed at them the scene and our place in it change. We are no longer passive viewers watching heated exchange between two factions. The angry Toshiro is yelling at us, looking down at us. For we are looking up at him as his fellow samurai would see him. By the end of his out burst he angrily leaves the room but before he goes he turns slightly to look at us, but we don't see his face, for now we are looking (in one of the great shots of the film) at his feet. The Samurai are ashamed and so are we because we identified with them at first and Kurosawa had the guts to show us that we are wrong to do so.I could go on, and on about his film, but I leave you with this, watch it."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2624541",
      "warningSpoilers": false,
      "date": "9 June 2012",
      "rate": "10",
      "helpful": "10 out of 19 found this helpful.",
      "title": "Kurasawa's best film",
      "content": "As much as I do love Ran, The Hidden Fortress and Throne of Blood, it was Seven Samurai that I love most of Akira Kurasawa's films. As with all Kurasawa's films, it is incredibly well made with authentic scenery that would give meaning to the term epic and the camera work is truly spectacular. This is especially true in the final battle, with inspired use of moving and multiple camera, precise editing, telephoto lenses and variegated film speeds. As always with Kurasawa, the direction is consistently brilliant. Add to that a stirring score from Fumio Hayasaka and a thoughtful script and you have more reasons why Seven Samurai is so good. The story unfolds slowly, but never felt dull to me and is never hampered by the three-and-a-half-hour running time. Plus Seven Samurai is interesting for being one of the first few to utilise the plot element of recruiting/gathering of heroes into a team to achieve a goal, seen especially with when the audience is first introduced Kambei. The action is spectacular and looks even better with the use of multiple cameras from various angles, and any humanity Seven Samurai has, and it does have a lot, is shown in a poignant way. The cast are excellent, with Takashi Shimura and especially Toshiro Mifune the standouts. Overall, of a resume of one of the greatest directors who ever lived, responsible for many wonderful movies(and I'd say that Seven Samurai and Ran are among the best movies ever made) Seven Samurai stands tall. One of the easiest 10/10s I've ever given. Bethany Cox"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3139541",
      "warningSpoilers": false,
      "date": "10 December 2014",
      "rate": "9",
      "helpful": "5 out of 8 found this helpful.",
      "title": "Iconic influential movie",
      "content": "It's early 16th century and Japan is in the midst of civil wars. A poor village faces constant harassment from bandits. A villager overhears that bandits are planning to come back after the harvest. After a debate, the village elder proposes to hire samurai. The villagers have little to offer. They witness heroic ronin Kambei rescue a boy. Young Katsushirō is desperate to be his disciple. Kambei reluctantly agrees to help the villagers but he determines that the defense needs at least seven samurai.This is simply one of the best movies ever. It is influential in so many other movies. The characters are funny and compelling. They are iconic in their simple characteristics. Modern audiences may find the over 3 hour running time a bit too long."
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw1448252",
      "warningSpoilers": false,
      "date": "14 August 2006",
      "rate": "10",
      "helpful": "17 out of 37 found this helpful.",
      "title": "There's Not One Thing Wrong with This Film",
      "content": "If you think a three-hour Japanese movie from the mid-50s about an ancient time in history sounds like one big snoozer, you'd be right. It SOUNDS like a snoozer. But just sit down to watch this film, and you'll realize how wrong you are. \"Seven Samurai\" is one of the most exciting, suspenseful films I've ever seen, and the running time passed so quickly that I wasn't even ready for the film to be over. I've watched T.V. sitcoms that felt longer.Akira Kurosawa displays utter mastery of every aspect of cinema. There's not a flaw in this film: it's flawlessly acted, paced, edited, composed, scored. It's an action film for thinking people, one that more than holds its own against any movie released today.Astoundingly good.Grade: A+"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw4689135",
      "warningSpoilers": false,
      "date": "27 February 2019",
      "rate": "7",
      "helpful": "12 out of 25 found this helpful.",
      "title": "Classic epic ,though overlong , Kurosawa's masterpiece and at the time it was Japan's most expensive picture ever",
      "content": "This is a superior and enduringly popular film , considered to be a real classical movie .The film gets action in Western style , thrills , intrigue , human relationships , it's fun and entertaining . Kurosawa's vintage pic set in 16th century Japan , a small farming village beset by marauding attackers hires 7 professional Samurai to rid of the scourge. As a group of villagers go to the nearly town where find Kambei : Takashi Shimura , who has carried out a risked rescue of a baby taken hostage by a nasty bandit . As Kambei walks towards town a young samurai, Katsushiro : Kimura , asks to become his acolyte. Then the farmers ask Kambei to help defend their village; to their great joy, he accepts. Kambei, with Katsushiro's assistance, then enlists four samurai more from the city, . Kambei initially decides that seven masterless samurai , Ronin , would be necessary to recruit , and time is running short . The villagers beg him to take Katsushiro also and, with some prodding by the others, he agrees . A clownish samurai named Kikuchiyo : Toshirô Mifune , whom Kambei had rejected for the mission, follows them to the village at a distance , ignoring their protestations and attempts to drive him away. The team gradually come together and 7 Samurai , at last , one by one, each with distinctive skills and personality traits ; all of them to help a poor village against savage thieves .As Kambei and his buddies , each of whom comes for a different reason , must free a village attacked by heinous outlaws who are devastating the small location . All of them get a chance to redeem themselves . Later on , the bunch develops a plan to secure the villagers defend it against enemy attack .This is a magnificent picture by Akira Kurosawa starred by his ordinary actors Toshiro Mifune , and Takashi Shimura , being his international breakthrough one . Sweeping , dramatic , complex human drama with all the ingredients : suspense , action , comedy , character studio and many other things . Seven Samurai , the picture blends drama , violent fights , emotion , slaughters with high body-count and results to be pretty entertaining as well as thought-provoking . It is incredibly detailed vision in its own right , as the impact of the action and combats on this trail-blazing adventure film opened the floodgates for the huge numbers of samurai films and subsequent Spaghetti Westerns that made fortunes for their producers in the sixties and early seventies . Dramatically staged sword-plays occur on and off throughout the plot . The story is classic and traditional , following its interesting premise in subsequent remakes , rif-offs and sequels , including customary misfit band formed by an eclectic gang with diverse characters as well as speciality . Kurosawa took an elemental Western issue ¨good guys against bad guys¨ plot and turned it into a breathtaking classy which is still probably the best-know and one best Samurai film to come from Japan . At the time of its making it got a big success at the boxoffice around the world . Kurosawa's pacing is immaculate and allows for periods of calm in which to establish roles punctuated by viscerally thrilling burst of action . These culminate in the overwhelming climatic battle between the bandits and the samurai which ranks among the very nicest combat scenes ever put on movie . It is followed by several reboots and imitations . Standing out ¨The magnificent seven¨ by John Sturges . Unlike Sturges' remake in 7 Samurai the roles grow originally from the action and they are not conveniently established by star-casting , like in the American film formed by big actors as Yul Brynner , Charles Bronson , James Coburn , Robert Vaughn , Brad Dexter , Elli Wallach . Very good acting by Toshiro Mifune as a valiant Samurai , as he is a harebrained but courageous young dominating warrior , as well as Takashi Shimura as the intelligent and brave leader of the fabulous Samurai . This one made an international star out of Toshiro Mifune .This fiercely-charging , uncompromising picture was compellingly directed by Akira Kurosawa and being exhibited with subtitles or dubbed .After working in a wide range of genres, Kurosawa made this awesome film . And available in a big number of versions of varying length , all too long . Kurosawa's previous and subsequent years saw the low-key , touching Living (1952) , this great epic The seven samurais (1954), the barbaric , fascinating Shakespeare adaptation Throne of blood (1957) , a Macbeth's version , a masterful rendition that transports the story to Medieval Japan , and a fun pair of samurai movies Yojimbo (1961) and Sanjuro (1962) , and Rashomon , often credited as the reason the Academy created the \"Best Foreign Film\" category. When this film was released internationally to rave reviews, many speculated that Akira Kurosawa was influenced by Citizen Kane (1941) in the element of flashbacks that ultimately provide conflicting accounts of events. However, Kurosawa didn't even see Orson Welles's film until several years after . Rashomon won the top prize at the Venice Film Festival, and first revealed the richness of Japanese cinema to the West.Yet , there was a quieter side to Kurosawa's nature , expressed most succinctly on Living , The Lower Depths and especially the medical drama Red Beard . After a lean period in the late 1960s and early 1970s, though, Kurosawa attempted suicide . Other important movies were : The idiot based on Feodor Dostowieski , Drunken Angel , Scandal , A quiet duel , Tiger's tale , High and low . He survived, and made a small, personal, low-budget picture with Dodes'ka-den (1970), a larger-scale Russian co-production Dersu Uzala (1975) an epic tale of adventure in turn-of-the-century Siberia and , with the help of admirers Francis Ford Coppola and George Lucas, the samurai tale Kagemusha (1980), which Kurosawa described as a dry run for Ran (1985), an epic adaptation of Shakespeare's \"King Lear\" . He continued to work into his eighties with the more personal Akira Kurosawa's Dreams (1990), and Madadayo (1993) and Rhapsody in August . Kurosawa's films have always been more popular in the West than in his native Japan, where reviewers have viewed his adaptations of Western genres and authors with suspicion , but he's revered by American and European film-makers, one of his least well-known films but most agreeable pictures is The Bad Sleep Well , a transposition of an Ed McBain detective novel , being remade many his pictures such as The seven samurais (1954), as The magnificent seven (1960),The Hidden Fortress (1958), as Star Wars (1977)as Yojimbo (1961) as For a fistful of dollars by Sergio Leone (1964), in fact Kurosawa's style was the biggest single influence on the Spaghetti Western sub-genre ; as his Samurai 'Western's were copied not only in America but also in Italy . Rating : 7.7/10 . Better than average . Well worth watching ."
    },
    {
      "username": "haildevilman",
      "userUrl": "https://www.imdb.com/user/ur3987336",
      "reviewLink": "https://www.imdb.com/review/rw1256612",
      "warningSpoilers": false,
      "date": "6 January 2006",
      "rate": "10",
      "helpful": "23 out of 48 found this helpful.",
      "title": "Best non-English film ever!!!",
      "content": "I had the pleasure to see this film in America sub-titled and in a Japanese theater in it's original uncut version. This movie gets better every time.The action scenes are better than anything out there today and Kurosawa-san didn't have CGI to abuse.It was incredible seeing this mismatched group of men band together to risk their lives for people they didn't really respect. Great character build-up, brilliant action, superb tension, and even some flashes of comedy. And it's one of the DEEPEST action films that ever existed.It shows the duty the samurai dedicates himself to. That whether he likes it or not, there are some things he just MUST do.3&1/2 hours long but it seemed like 1&1/2. How many films can honestly say that today? Never looked at my watch once."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2054714",
      "warningSpoilers": false,
      "date": "19 April 2009",
      "rate": "10",
      "helpful": "27 out of 54 found this helpful.",
      "title": "A Potpourri of Vestiges Review: A quintessential Kurosawa classic",
      "content": "Shichinin no samurai is a quintessential Kurosawa movie, and probably his greatest lagniappe to the world of cinema. Shichinin no samurai is a classic example of a profound character study well complemented by some ingenious direction and breathtaking cinematography. The world of cinema owes a colossal debt to the master movie-maker and plethora of his sui generis works such as this one. The movie depicts penury with sheer brilliance and uncanny resplendence. The inexorable resolve exhibited by the destitute villagers to fight the rapacious bandits can be inspiring even to the most pessimistic. The fidelity shown by the samurai to the villagers, each hired for a bowl of rice, accentuates the very essence of humanity. The movie's slow pace and its poignant background score enriches it with a sense of melancholy, thereby making it truly mesmerizing to watch. The entire cast has performed really well, taking care of the nuances with utmost precision and incredible conviction. Kurosawa's plaintive storytelling, coupled with his subtle brilliance, makes the movie a truly ineffable experience for the viewer. PS. Though not meant for everyone, the movie is sine qua non for cineastes and avid lovers of pristine cinema. It's also a great means to get acquainted with Kurosawa's oeuvre before exploring his more personal works like Rashomon, Ikiru, Ran, etc.http://www.apotpourriofvestiges.com/"
    },
    {
      "username": "mstomaso",
      "userUrl": "https://www.imdb.com/user/ur3824745",
      "reviewLink": "https://www.imdb.com/review/rw1920427",
      "warningSpoilers": false,
      "date": "29 July 2008",
      "rate": "9",
      "helpful": "16 out of 33 found this helpful.",
      "title": "After 53 Years, Still Fresh",
      "content": "The great Akira Kurosawa's epic action masterpiece \"Seven Samurai\" is an entertaining and thoughtful war epic set in 19th century Japan. Replete with colorful well-realized characters, and sensitively portrayed social and class analysis, Kurosawa's film entertains on all levels. Although not as visually engaging as many of Kurosawa's later efforts, Seven Samurai's cinematography is still masterful, and well above most contemporary films.A farmer overhears some bandits talking about raiding his village as soon as the next harvest is ready and approaches an older Samurai master who is on the verge of retirement for help. The elder Samurai, recognizing the humility of the request and the dignity of the proposed work, takes up the cause and begins recruiting others for the defense of the village. He recruits five Samurai and takes on a young apprentice and a drunken, angry would-be Samurai avenger (Toshirô Mifune ... Kikuchiyo) as the sixth and seventh members of his newly established militia. The Samurai live among the villagers for most of a growing season, teaching them defense and discipline. In turn, the villagers - as fearful of the Samurai as they are in awe of them, hide away their daughters and some of their stores. As the inevitable crisis ensues, these two widely disparate classes of people learn to live and fight together to defend their homes and their crops.Kurosawa's film is as much social realism as it is martial historic fantasy. Their is also a steady supply of humor and an entertaining romance - both of which are relatively rare in this genre. In summary, Seven Samurai is one of those rare works of art which takes on a vast scope and sustains it with apparent facility.Highly recommended."
    }
  ],
  "errorMessage": ""
}