{
  "imDbId": "tt0266543",
  "title": "Finding Nemo",
  "fullTitle": "Finding Nemo (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "100",
      "content": "You could trawl the seven seas and not net a funnier, more beautiful, and more original work of art and comedy than Finding Nemo."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "This time the dad is the hero of the story, although in most animation it is almost always the mother."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Mark Caro",
      "link": "",
      "rate": "100",
      "content": "Finding Nemo and its Pixar predecessors tap into the shared gene among the kids and adults that delights in imagination-engaging, eye-tickling and wit-filled storytelling. You connect to these sea creatures as you rarely do with humans in big-screen adventures. The result: a true sunken treasure."
    },
    {
      "publisher": "The New York Times",
      "author": "Stephen Holden",
      "link": "https://www.nytimes.com/2003/05/30/movies/film-review-vast-sea-tiny-fish-big-crisis.html",
      "rate": "90",
      "content": "The humor bubbling through Finding Nemo is so fresh, sure of itself and devoid of the cutesy, saccharine condescension that drips through so many family comedies that you have to wonder what it is about the Pixar technology that inspires the creators to be so endlessly inventive."
    },
    {
      "publisher": "Wall Street Journal",
      "author": "Joe Morgenstern",
      "link": "",
      "rate": "90",
      "content": "An undersea treasure all the same, and a prodigy of visual energy."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "",
      "rate": "88",
      "content": "Pixar is so good at what it does that every other kiddie-entertainment purveyor -- including parent company Disney -- flounders in comparison."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Ray Conlogue",
      "link": "",
      "rate": "88",
      "content": "Though the Disney logo is on this movie, there is -- possibly excepting little Nemo himself -- not a single cloying, sentimental Disneyesque creature in it. There is, instead, wit and flair in concept and writing, the trademark of the Pixar people who drove the project."
    },
    {
      "publisher": "Dallas Observer",
      "author": "Bill Gallo",
      "link": "",
      "rate": "80",
      "content": "The whole thing is absolutely beautiful to look at, even when it has a bad case of the cutes."
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Carrie Rickey",
      "link": "https://www.inquirer.com/entertainment/?id=99879&amp;reviewId=12217",
      "rate": "75",
      "content": "Though not as great as \"Toy Story 2\" and \"Monsters, Inc.,\" Pixar movies that are the gold standard for family movies, Finding Nemo is visually entrancing."
    },
    {
      "publisher": "The New Yorker",
      "author": "Anthony Lane",
      "link": "",
      "rate": "70",
      "content": "Finding Nemo is, as it happens, the most dangerously sugared of the Pixar productions to date--how could any father-finding-son saga be otherwise?--but the threat is now one of oversophistication. [9 June 2003, p. 108]"
    }
  ],
  "errorMessage": ""
}