{
  "imDbId": "tt0266543",
  "title": "Finding Nemo",
  "fullTitle": "Finding Nemo (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "username": "Coventry",
      "userUrl": "https://www.imdb.com/user/ur2020269",
      "reviewLink": "https://www.imdb.com/review/rw0773564",
      "warningSpoilers": false,
      "date": "10 December 2003",
      "rate": "8",
      "helpful": "203 out of 245 found this helpful.",
      "title": "Yes, it's THAT good !!",
      "content": "I'll be totally honest and confirm to you that everything what they say about this movie is true. It's a brilliantly animated masterpiece with lots of humor that actually works and a plot that really brings tears to your eyes from time to time. The modern artists of Pixar never cease to amaze the audience in expanding their horizons. Finding Nemo is visually stunning and you can have nothing but respect for the people who created it. I was more or less skeptic about watching it, because it was so overhyped ! Two days before it got released in my country, the TV and press loudly announced that the DVD broke all records in the USA during its first release-day. That's usually a sign of being typically mainstream and fake...but Finding Nemo is not. I'm allergic to fake sentiment and pathetic feel-good movies but I was really touched by this one. The moral and valuable life lessons are always present, but they're not shoved down your throat or thrown in your face all the time. This movie really relativates itself and that's important for a good comedy. And it's hilarious !!! Every side character in Finding Nemo (and there are a LOT of them) is exceptional and worth a mention. And the voices are cast perfectly as well...like the voice of Willem Dafoe for Gill, for example...a perfect choice. The character of Dory ( speaks through the voice of Ellen DeGeneres ) steals the show. She's an adorable blue fish who suffers from amnesia. She forgets what she's doing or going to every five minutes and that really leads to hilarious situations. Movies like this aren't just being made for children exclusive... They're good for everyone to realize you have to entertain yourself from time to time and just to enjoy the little things in life. I recommend this to everyone in the world. No matter if you're 9 or 99 years old, Finding Nemo will bring a smile on your face and leave behind a warm feeling in your heart."
    },
    {
      "username": "kylopod",
      "userUrl": "https://www.imdb.com/user/ur0556667",
      "reviewLink": "https://www.imdb.com/review/rw1194203",
      "warningSpoilers": false,
      "date": "15 October 2005",
      "rate": "9",
      "helpful": "187 out of 210 found this helpful.",
      "title": "Pixar's best feature to date",
      "content": "I have enjoyed most of the computer-animated films made so far, ranging from Pixar films like \"Toy Story\" and \"The Incredibles\" to DreamWorks films like \"Shrek.\" But \"Finding Nemo\" is the one that remains unparalleled, not because of its comedy or creativity, both of which are equaled in the \"Toy Story\" movies and in \"Monsters Inc.,\" but because it truly, more than any of the previous computer-animated features, reinvents the genre of the children's animated film.Humor in traditional animation is usually based on broad slapstick and physical exaggeration. There are occasional nods to this brand of humor in \"Finding Nemo,\" as when a flock of seagulls ram into a boat and we see their beaks crowing on the other side of the sail. But such sequences only call attention to how far this movie generally departs from old cartoon conventions. Instead, the movie invests its world of sentient animals with a surprisingly scientific texture. All of the animals are based on real species. The fish tank is constructed out of real devices. There is a strong sense of locale, as Marlin (Albert Brooks) travels across the Pacific to Australia, where even the animals speak with an Australian accent. In a scene that I'm sure Gary Larson of \"Far Side\" fame loved, a pelican discusses with a group of fish the intricate details of dentistry. The fact that the animals talk and understand what's going on is treated as though it were a natural feature of the world. The realism is so striking that by the end of the film, you'll almost believe it possible for fish to plot an escape from a tank.Far from making the film pedantic, this approach results in an intelligent but still entertaining picture. Most of the humor is based on parodies of human behavior: repentant sharks start a club that's like Alcoholics Anonymous, a school of fish act like obnoxious DJs while forming themselves into spectacular patterns, and a four-year-old girl behaves like most kids that age, oblivious and destructive. The manner in which Marlin finds his way to his son is so inventive that we can forgive the film for the number of coincidences involved.The story employs the same basic formula used in \"Toy Story,\" in which two characters, one uptight and the other clueless, are thrown together as they're forced to journey through a world populated by creatures that are a lot more knowing than the humans realize. This movie, however, creates a unique character in Dory (Ellen DeGeneres), a fish with short-term memory loss. To give a cartoon character a real human disorder is risky, to say the least, and I'm glad the filmmakers didn't lose the nerve to include this ingenious device, which not only generates some of the film's biggest laughs, but reinforces the character interaction that is so central to the story. This is in fact the only Pixar film to feature true character development. In the course of his voyage, Marlin learns to be more adventurous, getting parenting tips from a surfer-dude turtle voiced by the film's director Andrew Stanton, while his son Nemo learns to be self-reliant.Of course, none of the sharks, jellyfish, whales, gulls, pelicans, lobsters, and humans that Marlin encounters along the way really mean any harm. They're just doing what they do. As Nigel the Pelican tells Nemo at one point, \"Fish gotta swim, birds gotta eat.\" That's perhaps the film's most interesting insight, that there are no true villains, just creatures that act according to their nature, and a few that transcend it."
    },
    {
      "username": "Buddy-51",
      "userUrl": "https://www.imdb.com/user/ur0375636",
      "reviewLink": "https://www.imdb.com/review/rw0773545",
      "warningSpoilers": false,
      "date": "28 November 2003",
      "rate": "",
      "helpful": "52 out of 63 found this helpful.",
      "title": "amazing visuals",
      "content": "Has there ever been a better-looking feature-length animated film than `Finding Nemo'? We doubt it. With its shimmering underwater landscapes - be they in the vast immensity of a limitless ocean or the cramped confines of a dentist office aquarium - the film sports a look unlike anything we have ever seen before. The fish tank setting, in particular, is a veritable wonderland of eye-popping, many-hued visual splendor.Although the script by Andrew Stanton doesn't scale the comedic heights of, say, `Aladdin,' `Shrek' or `Toy Story 2,' it still sparkles with enough wit and inventiveness to entrance youngsters and beguile the grownups who will be joining them in their viewing. I hasten to point out that the screenplay is blessedly free of all the double entendres and off-color humor that have blighted so much alleged `kiddie' fare in recent years. This is a film on e can watch with one's children and grandchildren and not once have to blush or turn away in embarrassment while doing so. Creators of children's films please take note (and take note, too, of its phenomenal box office take).Like many tales designed for the junior set (`Dumbo,' `Bambi' etc.), `Finding Nemo' taps into the fear all children have of being separated from their parents - and the concomitant fear all parents have of being separated from their children. It is upon this common ground that members of both generations will meet in their emotional response to this film. In this case, it is little Nemo, an adorable clownfish, who is plucked out of the ocean and plunked down into the saltwater aquarium of a dentist in Sydney, Australia. The subject of the film's title is Marlin, Nemo's overprotective, worrywart dad who swims his way towards the continent to find and rescue his little tyke. Along the way, this Nervous Nellie parent learns a little something about giving his son the freedom a boy needs to grow up and become a man, and Nemo, himself, learns a thing or two about just what kind of a fish his dad really is.Albert Brooks and Ellen DeGeneres are brilliant as Marlin and Dory, respectively, the latter a befuddled, daffy and utterly good-natured fish who helps Marlin in his epic quest not only for his lost son but his own definition of filial love. Those familiar with these two fine comedic talents in their live-action performances will actually be able to see many of their distinctive inflections and facial expressions reflected in the animated characters they are portraying.As directed by Stanton and Lee Unkrich, and executed by an army of wonder-working animators and technicians, `Finding Nemo' takes PIXAR technology to its ultimate, final level of perfection - till the studio's next release, that is."
    },
    {
      "username": "mjw2305",
      "userUrl": "https://www.imdb.com/user/ur3174947",
      "reviewLink": "https://www.imdb.com/review/rw1004133",
      "warningSpoilers": false,
      "date": "22 January 2005",
      "rate": "8",
      "helpful": "57 out of 70 found this helpful.",
      "title": "Another Disney/Pixar Classic",
      "content": "Those guys and girls at Disney/Pixar have done it again, they've created the perfect underwater world, full of fascinating Disney characters.A truly enchanting story of a father (Marlon) who loses his son (Nemo), and with help of his new found friend (Dory) ventures out into the ocean to try to find him. On this epic voyage he gets to battle sharks, surf with some turtle dudes, dice with some jellyfish and survive an encounter in a whales stomach.All the characters are vibrant with Disney charm, but my favourite is Dory, the comic relief, probably one of the funniest Disney characters ever written and superbly voiced by Ellen DeGeneres, pure genius.All in all this is another success for Disney and Pixar, It brings out the child in all of us.Solid family fun 8/10"
    },
    {
      "username": "PizzicatoFishCrouch",
      "userUrl": "https://www.imdb.com/user/ur9469926",
      "reviewLink": "https://www.imdb.com/review/rw1320328",
      "warningSpoilers": false,
      "date": "20 March 2006",
      "rate": "10",
      "helpful": "49 out of 56 found this helpful.",
      "title": "Swimming with Sharks is a Whale of a Time",
      "content": "Marlin, a nervous and neurotic clownfish is heavily overprotective of his son Nemo, who only wants to explore the sea in its entirety. When Nemo gets caught by a scuba diver and taken away, it is up to Marlin to swallow his own fears and find Nemo. The ensuing search and rescue organized by the him is a mass effort by swimming and flying creatures of all sizes and personalities, such as a threesome of vegetarian sharks, a fish with short term memory and an aged turtle, all helping him realise the error of his ways in restricting himself to just his home.As charming as it is beautiful, Finding Nemo is a joy, both visually and cinematically. The characters are all so appealing and sweet that you want to hug each and every one of them, Nemo and Dory in particular. But the film transcends above just a generic animated film, for there are lessons to be learnt by it too. The film often tells a children's tale from an adult's point of view, with risky situations and emotional soul-searching putting stress on a disjointed family.The sea is brought to us in such a memorable and unique way that there is brilliance and beauty in every frame. The animation is of all time high for Pixar, and the sound mixing and editing are also to be credited, as they capture the heart of the sea creditably. But perhaps the best thing about the film is the musical score by Thomas Newman. He creates the essence of the sea, as well as the emotions felt by the fish throughout. Note the masterwork that occurs as an upbeat, jovial number quickly escalates into something darker in a matter of minutes. In short, the music is superb.The voice cast are capable and cannily chosen, from young Alexander Gould as the naïve Nemo, as well as Albert Brooks as the bumbling Marlin. But the star of the show is Ellen DeGeneres as Dory. As the forgetful but caring fish, she is sweet and soulful, and provides much of the comedy of the film. But the humour is also provided by the great script, which delivers a potentially dull story with wit and soul, and shies away from the sentimentality that could so easily arise of a Disney film. And the jokes, what jokes  from satire, spoof and slapstick, they'll be a one-liner for everybody here.Gorgeous to look at and utterly adorable, Finding Nemo sets the standard for how animated movies should being terms of entertainment value as well as story and themes  ending with the touching, thought-provoking message of how too much protectiveness on the parent's side will repel, but, no matter how independent a child (or fish) believes themselves to be, they'll always need their parents."
    },
    {
      "username": "Boba_Fett1138",
      "userUrl": "https://www.imdb.com/user/ur1416505",
      "reviewLink": "https://www.imdb.com/review/rw0773590",
      "warningSpoilers": false,
      "date": "11 January 2004",
      "rate": "9",
      "helpful": "70 out of 100 found this helpful.",
      "title": "Who said fish are boring?",
      "content": "\"Finding Nemo\" is a wonderful animated adventure movie that simply is irresistible for young as well as older persons.The most excellent thing about \"Finding Nemo\" is the perfect timing, just like in \"Monsters, Inc\" the jokes are extremely well placed in a quick pace and are good for more then just a few laughs.There are some very fun and great characters which brings me to the only problem I have with this movie. There are too many minor characters, I would have really loved to see some of the characters getting a bigger role with some more importance to the story instead of meeting character after character that are only on screen for no more than 5 minutes (such as the sharks). Sure it's good for the sense of adventure but it leaves some missed opportunities to make the story even more fun.I think it's pretty obvious that the story is inspired on the \"Lord of the Rings\" trilogy since it uses lot's of elements from it and it has the some feeling of adventure and excitement so it's really not a big thing that the story isn't very original, the original and fun way the story is told in compensates for this.The voice cast as in many animated movies is impressive but the one that stood out was Ellen DeGeneres as Dory that you love to hate.Irresistible movie for the whole family with great jokes and lines and some memorable characters and situations. Mine, mine, mine!9/10http://bobafett1138.blogspot.com/"
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0773399",
      "warningSpoilers": false,
      "date": "28 July 2003",
      "rate": "8",
      "helpful": "61 out of 86 found this helpful.",
      "title": "Pixar Remains the Best Family Film Industry Out There Today...",
      "content": "Pixar Animation Studios has a very good knack for making thoughtful, intelligent and humorous family films (note that I didn't say kid films). \"Toy Story\" 1 & 2 and \"Monsters, Inc.\" are some of my favorite family films; \"Finding Nemo\" isn't one of my favorites, but it isn't disappointing like \"A Bug's Life,\" and it is thoughtful, intelligent, humorous and incredibly watchable, just like the other Pixar films.As always, Pixar takes a world of something and completely builds their story around it. In \"Toy Story\" they gave life to toys and created the world through their eyes. In \"Monsters, Inc.,\" they showed us the monster world. In my review on \"A Bug's Life,\" I said that the reason the film didn't work very much is because it was about bugs, and not about something mystical like toys or monsters that bring back childhood memories. Well, I guess I was sorta wrong, because \"Finding Nemo\" is all about fish, nothing too mystical about fish, and I still loved it.This tale takes place underwater with the fish Marlin (voiced by Albert Brooks), whose spouse and baby fish eggs get eaten by a vicious shark in the beginning. All but one egg which Marlin names Nemo.Years later Nemo (voiced by Alexander Gould, Elliot's son?) is a bit older, and heading off to fish school for the first time. But haunted by the fact that his spouse and offspring were all killed years ago, Marlin is extremely over-protective of his one remaining family member. Nemo, sick of being treated like a baby, proves how brave he is by swimming near a fishing boat, only to be captured by a scuba-diving dentist. And so Marlin heads off to find Nemo, with the help of his newfound companion Dory (voice of Ellen DeGeneres), who has short-term memory loss and forgets things sooner than she can carry whatever she is doing out. (Like when she is showing Marlin the way towards a fishing boat and suddenly forgets why Marlin is following her.)Pixar doesn't let down the audience on this film. There are a few things that one can always expect from Pixar films: They can expect something (such as toys) to be given their own world. They can expect that world to be given careful attention to detail. And they can expect humor.\"Finding Nemo\" gives fish their own world, and the underwater realm they live in is paid careful attention, painstakingly captured on film with computer graphics. And the humor is always there. All the characters are funny. I especially like the sequences from the inside of a fish tank in the dentist's office, with a bunch of fish including Gill (Willem Dafoe's vocal talents), who constantly tries to escape. By doing so, Gill has suffered major injuries, including landing on the dentist's tools and getting sliced up. This is, of course, a parody of escaping POWs. The fact that Willem Dafoe was in the great war movie \"Platoon\" might have something to do with that.This is taken from my \"Monsters, Inc.\" review: \"Pixar once again not only expands our mind, but our very worlds. I respect their company and commitment values very much, as you can read in my 'Toy Story' review. They stick to the values that made Disney films so family-friendly back in the fifties and sixties: Respect for the audience, respect for quality, and respect for the audience's INTELLIGENCE, something Disney, who has recently coughed up a bunch of lousy, thoughtless sequels, has forgotten. Now, I know that LEGALLY Disney is co-creator of 'Toy Story' and 'Monsters, Inc.,' but they really are not. They just give Pixar the money and get their name branded on the front box of the film. And even then, I have heard multiple claims that Disney is very mean-spirited towards Pixar (read into sequel trouble for 'Toy Story 3') and gives them the bare minimum.With \"Finding Nemo,\" I still stick towards what I said. Pixar Animation Studios is probably the best family film company out there right now, I really hope they separate from Disney some day and form their own production company. They know what interests both kids and adults, and it's almost creepy how they can make their films so engaging and fun to watch. This is one to take the kids to, and afterwards, maybe even sneak back into again by yourself."
    },
    {
      "username": "MAYESY-44",
      "userUrl": "https://www.imdb.com/user/ur118961119",
      "reviewLink": "https://www.imdb.com/review/rw5825391",
      "warningSpoilers": false,
      "date": "14 June 2020",
      "rate": "8",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Childhood memories",
      "content": "This is another classic animated movie from my childhood. This is a great story and a good amount of comedy with Dory. Must see family film."
    },
    {
      "username": "lhseaglerunner",
      "userUrl": "https://www.imdb.com/user/ur1403018",
      "reviewLink": "https://www.imdb.com/review/rw0773242",
      "warningSpoilers": false,
      "date": "5 June 2003",
      "rate": "9",
      "helpful": "70 out of 86 found this helpful.",
      "title": "\"Finding\" A Flight odf Fancy",
      "content": "Remember back when you were little.you know, back when tall to you was about as high as a mailbox? In those days, Disney animated films (e.g. `Lion King' and `Beauty and the Beast') were some of the coolest things out there and were movies to watch over and over (much to your parents' chagrin). Now, animated movies aren't exactly the `coolest' things to see, but an exception can be made for the uber-hip Pixar movies, the most recent of which being `Finding Nemo'.After losing all but one of his brood, Marlin (Albert Brooks) an over-protective clown fish that strangely lacks a sense of humor, has resolved to protect his one (slightly disabled) `child' remaining, Nemo (Alexander Gould). But disaster strikes as Nemo is taken by a Sydney dentist and plopped into a fish tank where he is comforted by a host of other captive fish (William Dafoe, Vicki Lewis, Allison Janney, et al). But back in the big ocean Down Under, Marlin has resolved to search out his one remaining progeny.Along the way on his quest, Marlin acquires a tag-along `friend', Dory (Ellen DeGeneres)-a fish with, well, the memory capacity of a fish. The two must surmount hurdles like a group of sharks (Eric Bana, Barry Humphries and Bruce Spence) that have (mostly) sworn off eating other fish, a nasty swarm of jellyfish, a bird-brained flock of seagulls, and others.This is the bridge! Well, in a way. Back when I was younger, one of my favorite films was `The Incredible Mr. Limpet', which, for the uninitiated, combined live-action with under-the-sea fish animation. What Pixar has done here was bring back that film to my mind and start me thinking, because they have created a wondrous undersea environment (with `normal-looking' fish instead of 1960s animated fish).My favorite feature in this movie chock-full of sweet treats must be the sharks. I have always been partial to the shark family, but what has been done in creating three humorous sharks (what a movie concept), just sent paroxysms of laughter through me. Another thing that (mostly) works is Ellen DeGeneres' fish (character?) that provides a fairly constant source of laughter with her antics (although a couple gags do wear on the viewer with time). On the whole though, there is not a single bit of shoddy voice-acting or animation in it.Compared to `Monsters Inc.', `Finding Nemo' is something of a revival for Pixar. I like how they have stepped up their efforts to make an altogether pleasing film without any big flaws. The thing that I did not like with `Monsters' was the inclusion of a single key (but EXTREMELY annoying) character. Director Andrew Stanton has done an excellent job at making the film work and be (basically) non-annoying to most of the general public (and this critic).I suppose life has come full circle-now that I am (relatively) old as a high school graduate, animation is cool again, thanks to high-powered computers, at any rate. `Finding Nemo' is one heckuva movie and a good one to take anyone you know to, trust me on this-nine out of ten."
    },
    {
      "username": "nadger_09",
      "userUrl": "https://www.imdb.com/user/ur2533366",
      "reviewLink": "https://www.imdb.com/review/rw0773419",
      "warningSpoilers": false,
      "date": "12 August 2003",
      "rate": "",
      "helpful": "92 out of 111 found this helpful.",
      "title": "quite a catch",
      "content": "Pixar Studios have done it again. I have to say that these guys are totally good in computer animation, as well as in storytelling. Rarely do those qualities come together but here they are, delivering unto the audience once again something that one can only be drowned with wonder. Such is the marvel of Finding Nemo.The story is about Nemo (voiced by Alexander Gould), a young clownfish who is fed up with his dad Marlin's (Albert Brooks) excessive paranoia over him. He swims to a place where his dad forbids him and ends up being captured by a scuba diver. He is then placed in a fish tank in a dental clinic somewhere along the harbors of Sydney. Thus the quest of Marlin, along with Dory (a hilarious forgetful blue tang voiced by Ellen DeGeneres) to find Nemo before it's too late.The story is a simple one but where the film more than makes up is on the overwhelming sense of detail and rich, lavish colors and textures as if we aren't really watching an animated film at all. Scenes such as Marlin bringing Nemo to school while swimming through corals and anemones, to the aquarium where Nemo was taken to, are nothing short of breathtaking, and undoubtedbly one of the most outstanding animation ever to hit the screen.The world of \"Finding Nemo\" is simply alive with lovable creatures swimming about their daily lives under the ocean, darting across the screen in playful manners. The viewer almost literally dives into another world for nearly two hours and one cannot help but be completely captivated. The music and screenplay also blend very well with the visual feast that it produces such a high quality movie. From its basic storyline, to the father-and-son relationship theme, to the wonderful underwater world throughout, this is really an adventure through an ocean of stunning visuals and storytelling.Grade: A"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2061045",
      "warningSpoilers": false,
      "date": "3 May 2009",
      "rate": "9",
      "helpful": "15 out of 20 found this helpful.",
      "title": "What an outstanding movie!",
      "content": "This movie is just gorgeous to look at, really the animation is just stunning, with the blue backgrounds and colourful characters. My only criticism is that although there are some very funny moments, like Doreen speaking whale(Ellen DeGeneres was born to speak whale, really she was) and Barry Humphries's shark, I don't think it is as laugh-out loud funny as Toy Story. Finding Nemo is definitely the most beautiful visually of the Pixar movies, I would certainly pick it over Cars. The music by Thomas Newman was just beautiful, and I always look out for this in a movie, and it was a delight hearing \"Beyond the Sea\" over the end credits. The characters are genuinely memorable, especially Doreen and Bruce. And who can forget the girl Darla, with the Psycho music?(that is really terrifying)The voice talents are very good indeed, especially Ellen DeGeneres, and I liked Willem Dafoe's Gil. Albert Brooks made a wonderfully paranoid father figure, and I loved the plot about Marlin's son Nemo being taken by divers and Marlin (a clown fish) racing to find him. That is simple, but we meet characters like the turtle, so the film is filled with fun, enough to satisfy the fussiest child. In conclusion, 9/10 for the visuals and the characters. Outstanding! Bethany Cox"
    },
    {
      "username": "lilfreeek",
      "userUrl": "https://www.imdb.com/user/ur0990753",
      "reviewLink": "https://www.imdb.com/review/rw0773128",
      "warningSpoilers": false,
      "date": "22 May 2003",
      "rate": "",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Worth your time.",
      "content": "Okay, Disney and Pixar did a fabulous job. The images were so great, the storyline was typical but fun, the characters were well-defined, and the sound was emotive and effective. And, who could not love a flick that makes references to The Shining, Psycho, and other quality films?I seriously got attached to the little Clown fish, Nemo. The movie just sucked me in. Anyway, watch it. It's worth your time, especially if you enjoy Pixar animation. The first 10 minutes is a visual overload in a good way. Very good way.By the way, the voice of Jesus (Willem Dafoe) embodied by a Tiger fish? Awesome."
    },
    {
      "username": "twpain",
      "userUrl": "https://www.imdb.com/user/ur96849171",
      "reviewLink": "https://www.imdb.com/review/rw5883732",
      "warningSpoilers": false,
      "date": "5 July 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Great Movie For Anyone",
      "content": "Finding Nemo is a very good movie and is really rewatchable! The characters are great and the story is heartwarming. The film is never boring and brings constant laughs for everyone! I highly recommend this film!"
    },
    {
      "username": "moviemanMA",
      "userUrl": "https://www.imdb.com/user/ur6078355",
      "reviewLink": "https://www.imdb.com/review/rw1123399",
      "warningSpoilers": false,
      "date": "10 July 2005",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Just keep swimming...",
      "content": "Can Pixar and Disney miss with a film? Both Toy Story's, A Bugs Life, Monster's Inc., Finding Nemo, and The Incredibles. These movies are instant classics.The movie in focus is Finding Nemo, a story of a clown fish named Marlin (voiced by Albert Brooks), trying to find his son Nemo who was taken away by scuba divers. With the help of a fish named Dory (Ellen Degeneres)Marlin bumps into on his journey, they set out on finding Nemo. The only problem is that Dory suffers from short-term memory loss. She can't remember anything except her name. It's sad but brings a lot of comedy to the movie.Along the way they meet some priceless characters like Crush (voiced by writer/director Andrew Stanton), the thrill seeking sea turtle. They also encounter a trio of friendly sharks, Bruce, Anchor, and Chum. They have sworn to never eat a fish again. They also run into some potentially deadly situations with an ugly deep sea fish, also a huge swarm of jellyfish, and a whale. Marlin and Dory must tough it out and make it to find Nemo.Meanwhile, Nemo is now the new addition to an Australian dentist's office aquarium. There he meets some interesting characters. Peach the starfish, Bloat the blowfish, and more sea dwellers. There Nemo tries to fit in, becoming a member of the tank named \"Shark Bait\". He tries to help out Gill (William Defoe) with his plan to escape from the tank and get everyone out. Nemo must come through in order to see his father ever again. A local pelican named Nigel (Geoffrey Rush) also tries to help out in the escape. Word has spread around the world of Marlin's trip to find his son, reaching Nigel.FInding Nemo is an instant classic. With great lines and unforgettable characters, this movie is a delight. The animation itself is remarkable. It's as though the fish are really swimming. You can even see particles floating in the water. Light shines through and currents make the fish and surrounding react. The animators have done their homework for this picture.This movie is quite an experience. It is a film the whole family can enjoy for years to come. It is a timeless adventure that people can enjoy. Don't let this film drift out to sea..."
    },
    {
      "username": "Alex_Lo",
      "userUrl": "https://www.imdb.com/user/ur105617842",
      "reviewLink": "https://www.imdb.com/review/rw6569821",
      "warningSpoilers": false,
      "date": "6 February 2021",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Pixars Genius",
      "content": "A touching and humorous story. As mentioned in my review of \"How to train your Dragon\", for me a good animated film is that both children and adults can enjoy it. The animated film is less funny than other Pixar movies, but still fun enough for the little ones. And the big ones can enjoy a lovingly drawn father-son-story, finely developed figures and nice film allusions."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0773266",
      "warningSpoilers": true,
      "date": "13 June 2003",
      "rate": "",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Space",
      "content": "Spoilers herein.Steve Jobs drags us all into higher awareness. He does so by grabbing our attention by conventional means but does his real work subliminally.In the computer world, what we see is a coherent, accessible approach with appealing style. In the movie world we see the same, except the art of excellent character development and storytelling is substituted for sheer functionality and ease of creativity. In both, we all are pulled by this tractor into a more refined space.And space is what it is all about, in particular a notion of location in space coupled with a higher degree of freedom within that space.This has been a concern of intelligent filmmakers all along. Griffith merged the theatrical space with grand vistas of mass movement and did so from a spot no human would normally have. Welles and Kurosawa played with this, the first by working with architecture, the other by flattening in deep focus. But until the eighties we always had to deal with the reality of the ground -- and the horizon.The real appeal of \"Star Wars\" wasn't the cowboy story or guns, nor the pseudo-religious trappings, though we all thought it was. It was the freedom from that hard bottom, the Earth which we interact with in as consistently as breath and blood. \"Star Wars\" -- and \"2001\" before -- gave a thrill because our visual vocabulary was now expanded spatially rather than ALWAYS being referenced to the floor.Pixar's work has always been cognizant of this new frontier even when owned by Lucas. Under Jobs, every film has become more and more dimensional until now. We don't honk around with the camera as much as I would like, but we do set a new standard for interacting space. Naturally, all else is well crafted but serves this notion of space ? especially the fishtank business.Ted?s Evaluation -- 3 of 4: Worth watching."
    },
    {
      "username": "Misss25",
      "userUrl": "https://www.imdb.com/user/ur86230128",
      "reviewLink": "https://www.imdb.com/review/rw6704448",
      "warningSpoilers": false,
      "date": "17 March 2021",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "It was awesome",
      "content": "I am not an Animation fan and always just avoid watching it.But after watching this, I fall in love with animated movies.It was quite interesting seeing fishes daily life though I know it's not real but somehow I am just mesmerised by it.I never think about what fishes do, do they study,do they really live in fear,who oppress them bla bla. And how the father find it's son was quite interesting. The aquarium incident leaves me really believe tbat do they really did that in real life🤣"
    },
    {
      "username": "vip_ebriega",
      "userUrl": "https://www.imdb.com/user/ur14080241",
      "reviewLink": "https://www.imdb.com/review/rw1964474",
      "warningSpoilers": false,
      "date": "23 October 2008",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "The little fish movie that could.",
      "content": "My Take: Simply magical, down to the last computer-animated detail. I was at least 13 or 14 years old when this came out, and only now am I reviewing it. But that can't stop me, I have to lay out my sentiments for this clever and occasionally brilliant animated achievement. Not only is it the best, so far, in Pixar's portfolio of animated films, it's one of the very best animated films ever made, period. FINDING NEMO is a well-told fairy tale adventure, but a well-told story is only a bonus compared to the film's awesome look and feel. The movie is visually stunning, with images that flow like living paintings, some of which almost but leaps out the screen. The movie is beautifully crafted, and sometimes, I almost didn't care about anything else. Almost.On the contrary, the story is quite simple. After a tragedy introduced in the opening scenes, Marlin the clown fish (voiced by Albert Brooks) becomes too over-protective of his last son Nemo (voiced by Alexander Gould). Every move he makes is always under the watchful eye of his over-protective father, who couldn't afford to lose him. To prove that he can walk with his own two feet (or is that swim with his own fins?), Nemo approached an anchored divers boat and is abducted by two curious divers and taken far off the Great Barrier Reef. Marlin, guilty for his loss, is determined to find his son, captured by a dentist and placed inside a too-small-for-a-fish aquarium in the dentist's clinic. Along his side is a joyous yet forgetful fish named Dory (voiced by Ellen DeGeneres) who gives a helping fin a long the way, whatever she can remember.This is quite an adventure too. Not only are we introduced to a closer-than-life-like reef, we are also introduced with a clever and elaborate band of characters, including a trio of sharks who swore their lives to be vegetarians (until the call of the wild kicks in), a couple of surfer-dude turtles, a charade-playing school of fish and many other wonders. The animation here is, by far, the most brilliant ones I have ever seen. A colorful and life-filled reef, a forest of jellyfish and a crystal-clear aquarium filled of plastic ornaments have never looked more pristine in this lavish and elaborate adventure. But other than its brilliant design which is considerable enough to recommend the picture, the film is not without a good story, and it is told well. The characters have a great deal of features and characteristics. This is most evident on the character of Dory, who not only has the showmanship of the voice who dubbed her, but also the delight we expect from a true family film.If the story may not apply to you, or you might find it cliché, then FINDING NEMO will still do as a brilliant eye-candy, with one of the best sights I have ever seen in an animated film then and now. Sometimes, sitting in front of a theater or even the small screen and just let the elaborate visuals flow right through you is more than enough to see a movie. Sometimes it's a movie like this one that reminds you the fun that going to movies are.Rating: ***** out of 5."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1671514",
      "warningSpoilers": false,
      "date": "10 June 2007",
      "rate": "8",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Cute and pleasant fare for the kids",
      "content": "Okay, I am NOT a huge Nemo fan, but considering the film's modest pretenses and how much kids loved it, who am I to complain--especially since the animation is so nice? Plus, the film is much, much better than the knock-off film, SHARK TALE.The film has one of the simplest plots I have ever seen in a kids movie. Nemo loves his dad and vice-versa. When Nemo is captured for a home aquarium, the timid dad springs to the rescue with rather predictable results. There are no major surprises BUT the journey along the way is pleasant and cute. The kids will no doubt love it but some parents may find it a bit \"sticky\" and shallow like I did. But considering how much fun my daughter had watching it, this can all be forgiven."
    },
    {
      "username": "g-bodyl",
      "userUrl": "https://www.imdb.com/user/ur17646017",
      "reviewLink": "https://www.imdb.com/review/rw1960501",
      "warningSpoilers": false,
      "date": "14 October 2008",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Another Pixar Great!",
      "content": "Finding Nemo is a very good animated film, probably it's in the top 10 animated features of all time. The story is about a little clown fish named Nemo. He ventures out into the open sea while not listening to his father. He gets captured by a dentist and now his father, marlin has to save him from the clutches of the dentist and his \"evil\" niece. The story of the film is unbelievable. I don't know how a movie about a fish can be very popular. The voice acting is pretty good. The all-star cast did a great job voicing their characters. The music in this film is sweet. The music will lure you more into the movie. The song in the film is great for people who like music 40 years ago. Once again, Pixar did not fail in its ability to make classic animated films. Overall, this is a very good film. I rate this movie 10/10."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw3656519",
      "warningSpoilers": false,
      "date": "7 March 2017",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "\"Nice\"",
      "content": "There have always been three reasons why these animated Pixar films have appealed to us all so much. First, of course, is the fact that they are just plain so much fun. Second, is that they have a message that tugs on the heartstrings of young and old. Finally, they are full of humor for both the target children and the adults watching with them. \"Finding Nemo\" is no exception to any of those categories.For a basic plot summary, this movie sees young clownfish Nemo (Alexander Gould) accidentally become separated from his over-protective father Marlin (Albert Brooks). As Nemo has his own adventures in a tropical fish tank owned by a dentist, Marlin begins his quest to rescue his young son, along the way running into the memory-challenged Dory (Ellen Degeneres) who ultimately shows him a new perspective on life.Visually, \"Finding Nemo\" is stunning. Watching it on blu-ray is truly a visual treat, with the underwater landscapes and their various colors making this effort perhaps the best-looking Pixar flick ever.In terms of humor, \"Nemo\" has enough moments that will have the kids giggling as well as the adults chuckling. It can be a very serious movie at times, but it never forgets to mix a healthy dose of fun into the proceedings.The main plot line--Marlin looking for Nemo--turns out to be quite an emotional punchline, as Marlin slowly begins to discover the things he needs to do different if/when he finds his son.Overall, \"Finding Nemo\" deserves a place towards the highest ranking of Pixar endeavors. Though nothing may ever quite top \"Toy Story\", \"Nemo\" belongs on that \"1-B\" slot right along with \"WALL-E\" and \"Up\"."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0773457",
      "warningSpoilers": false,
      "date": "30 September 2003",
      "rate": "",
      "helpful": "11 out of 21 found this helpful.",
      "title": "The now-traditional mix of adult wit and kiddie laughs  although less sharp than usual (but still very funny)",
      "content": "Scarred by the loss of his wife and eggs, Marlin has over sheltered his only child, Nemo. However when Nemo's first day at school comes about, that mothering leads Nemo to swim out to the open ocean where he is caught by a scuba diver and be put in a fish tank far away. Enlisting help from the forgetful Dory, Marlin tracks the boat and his ocean adventure begins.Now as much as a tradition as national holidays, the latest Pixar animation arrives in the UK on a wave (d'oh!) of hype and marketing. Officially the biggest summer film in the US and all over buses and Happy Meals (which seems a little perverse when you think about it) it is hard not to want to see it or prevent your kids from demanding they see it. Happily the well establish benchmark of being kiddie friendly but fun for adults is maintained and the film does exactly what you know it will. The plot is a little like Toy Story's quest but is fleshed out enough to be interesting and the themes of `letting go' and loss are actually quite well handled and will speak more to adults than kids.The slight problem with the film is that is does do just what you expect and the `animated film with adult wit and kiddie characters' stuff is hardly cutting edge anymore. However this is a picky flaw as it is still very good fun. It may not be the strongest of this genre, indeed some bits flag and the sentimental core, while a break from cruel humour or sarcasm, does then to slow things down a bit at times.The adult references are all good but not as frequent as I'd have liked  they seem to be separate from the main flow where I wanted them integral with all of it. Clever homage's to Jaws (Bruce was the pet name of the rubber shark) and The Birds are distracting and make you feel good about yourself, and the banter is mostly witty if lacking a real sharpness at times.The voice cast are all good are quite an all star bunch. Brooks does a workmanlike job in the lead  it must be said I didn't think he distinguished himself but then he did have to carry the moral weight of the film. DeGeneres is much better and her dippy character is a delight at times. The support cast is not as deep and fun as in other films  Janney and Dafoe are both fun in the tank (as are all the tank characters) it's just that none of them are really consistent. My favourite characters were the one word seagulls  `mine?'Overall I have been unfair to this film in my review. If I saw this in isolation I would be praising it to the roof, however using the others as a benchmark this does have a few weaknesses that show signs of wear and tear in the genre. Not to cancel everything I have said, these weaknesses are all things that I realised after I had watched it  while I was watching it I was too busy laughing! Biggest downside for me though  no comedy outtakes, booooooo!"
    },
    {
      "username": "RightWingGuy",
      "userUrl": "https://www.imdb.com/user/ur9545938",
      "reviewLink": "https://www.imdb.com/review/rw1309861",
      "warningSpoilers": false,
      "date": "8 March 2006",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Pixar's best movie.",
      "content": "I didn't see this movie until it came out on DVD. My family and I don't go to the movies very often, mostly because there's hardly anything worth seeing.But this movie was absolutely flawless. The voice cast was super. The voice of Nemo is Alexander Gould, who is 11 years old now. I saw his picture, and I really like his smile.\"Finding Nemo\" is a classic. It'a among my favorite movies, and is a movie everyone should see. Unlike about 96% of movies, this movie is Rated \"G\", and can be viewed by children. There might be a few moments when it gets \"scary,\" but they soon turn into comedy.Watch \"Finding Nemo\" and I think you'll be a happier person by the end of the movie!My Score: 10/10."
    },
    {
      "username": "Sir_AmirSyarif",
      "userUrl": "https://www.imdb.com/user/ur24207434",
      "reviewLink": "https://www.imdb.com/review/rw6907766",
      "warningSpoilers": false,
      "date": "13 May 2021",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "A delight from start to finish",
      "content": "As charming as it is beautiful, Andrew Stanton (and co-director Lee Unkrich)'s 'Finding Nemo' is a joy, both visually and cinematically. It is a brilliantly animated masterpiece with lots of humor that actually works and a plot that warms your heart from time to time. The sea is brought to us in such a memorable and unique way that there is excellence and beauty in every frame. Gorgeous to look at and utterly adorable. All the characters are vibrant with Disney charm, but Dory, the comic relief, probably one of the funniest Disney characters ever written and superbly voiced by Ellen DeGeneres. A delight from start to finish."
    },
    {
      "username": "departed07",
      "userUrl": "https://www.imdb.com/user/ur2498078",
      "reviewLink": "https://www.imdb.com/review/rw1078383",
      "warningSpoilers": false,
      "date": "11 May 2005",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Pixar has gone beyond our limits",
      "content": "Pixar has made some of the enjoyable films in the past years: The Toy Story films, Monsters, Inc., and A Bug's Life to name a few. What makes these films interesting is the designs of the films as if they look identical to real life; now the creators have made underwater more realistic than ever in \"Finding Nemo\" where the waves of the water seem to have life of its own.\"Finding Nemo\" is a story of a clown fish name Marlin (Albert Brooks) who takes on the responsibility of his young son Nemo after the mother and the babies were killed off screen. Now as a single parent, Marlin worries about everything that his young son does, even when he goes off to school for the first day.There is a universal moment in about every Pixar movie where there is always a human nature to relate towards the animated films; with Marlin's parental worries as a single father, most of the dads in the audiences can relate to him, especially when Nemo is kidnapped by a sea diver after getting near a boat.Marlin goes through the sea of Australia where he meets with a blue coral fish name Dory (Ellen DeGeneres) who has STM (Short Term Memory) where she can remember things and than forget until the final moment. They go on adventures from escaping sharks, getting sting by jellyfish, swimming with turtles and going inside a whale's mouth.As for Nemo, he's inside a fish tank in a dentist office where he meets with characters that have been capture by the dentist; the leader of the pack is Gil (Willem Defoe of Spider-Man) who has been trying to free a bunch of sea-animals and with Nemo, they have a chance.\"Finding Nemo\" is funny and touching where like any other film, where audiences get to learn a lesson about letting go of their young ones as they go out into the world, but also have a good time."
    }
  ],
  "errorMessage": ""
}