{
  "imDbId": "tt2582802",
  "title": "Whiplash",
  "fullTitle": "Whiplash (2014)",
  "type": "Movie",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Whiplash (2014 film)",
  "url": "https://en.wikipedia.org/wiki/Whiplash_(2014_film)",
  "plotShort": {
    "plainText": "Whiplash is a 2014 American independent psychological drama film written and directed by Damien Chazelle, and starring Miles Teller, J. K. Simmons, Paul Reiser, and Melissa Benoist. The film follows the ambitious music student and jazz drummer Andrew Neiman (Teller), who is pushed to his limit by his abusive instructor Terence Fletcher (Simmons) at the fictitious Shaffer Conservatory in New York City.\r\nThe film was produced by Bold Films, Blumhouse Productions, and Right of Way Films. Sony Pictures acquired distribution rights for most of the world, releasing the film under its Sony Pictures Classics and Stage 6 Films banners for its North American and international releases, respectively. Chazelle finished writing the script in 2013, drawing upon his experiences in a \"very competitive\" jazz band in high school. Soon after, Right of Way Films and Blumhouse Productions helped Chazelle turn 15 pages of the script into an 18-minute short film, also titled Whiplash. The short film received acclaim after debuting at the 2013 Sundance Film Festival, which attracted investors to produce the complete version of the script. Filming took place in September 2013 throughout Los Angeles in the course of 20 days. The film explores concepts of perfectionism, dedication, and success and deconstructs the concept of ambition.\r\nWhiplash premiered in competition at the 2014 Sundance Film Festival on January 16, 2014, as the festival's opening film; it won the Audience Award and Grand Jury Prize for drama. The film opened in limited release domestically in the United States and Canada on October 10, 2014, gradually expanding to over 500 screens and finally closing on March 26, 2015. The film received widespread acclaim for its screenplay, direction, film editing, sound mixing, and Teller's and Simmons's performances, and grossed $49 million on a $3.3 million budget, making it Chazelle's highest grossing feature until La La Land (2016). The film received multiple awards and nominations, winning Academy Awards for Best Film Editing and Best Sound Mixing, and also being nominated for Best Picture and Best Adapted Screenplay. Simmons's portrayal of Fletcher won him the Academy, BAFTA, Critics' Choice, Golden Globe, and Screen Actors Guild awards for Best Supporting Actor.",
    "html": "<p>Whiplash is a 2014 American independent psychological drama film written and directed by Damien Chazelle, and starring Miles Teller, J. K. Simmons, Paul Reiser, and Melissa Benoist. The film follows the ambitious music student and jazz drummer Andrew Neiman (Teller), who is pushed to his limit by his abusive instructor Terence Fletcher (Simmons) at the fictitious Shaffer Conservatory in New York City.</p><p>The film was produced by Bold Films, Blumhouse Productions, and Right of Way Films. Sony Pictures acquired distribution rights for most of the world, releasing the film under its Sony Pictures Classics and Stage 6 Films banners for its North American and international releases, respectively. Chazelle finished writing the script in 2013, drawing upon his experiences in a \"very competitive\" jazz band in high school. Soon after, Right of Way Films and Blumhouse Productions helped Chazelle turn 15 pages of the script into an 18-minute short film, also titled Whiplash. The short film received acclaim after debuting at the 2013 Sundance Film Festival, which attracted investors to produce the complete version of the script. Filming took place in September 2013 throughout Los Angeles in the course of 20 days. The film explores concepts of perfectionism, dedication, and success and deconstructs the concept of ambition.</p><p>Whiplash premiered in competition at the 2014 Sundance Film Festival on January 16, 2014, as the festival's opening film; it won the Audience Award and Grand Jury Prize for drama. The film opened in limited release domestically in the United States and Canada on October 10, 2014, gradually expanding to over 500 screens and finally closing on March 26, 2015. The film received widespread acclaim for its screenplay, direction, film editing, sound mixing, and Teller's and Simmons's performances, and grossed $49 million on a $3.3 million budget, making it Chazelle's highest grossing feature until La La Land (2016). The film received multiple awards and nominations, winning Academy Awards for Best Film Editing and Best Sound Mixing, and also being nominated for Best Picture and Best Adapted Screenplay. Simmons's portrayal of Fletcher won him the Academy, BAFTA, Critics' Choice, Golden Globe, and Screen Actors Guild awards for Best Supporting Actor.</p>"
  },
  "plotFull": {
    "plainText": "Whiplash is a 2014 American independent psychological drama film written and directed by Damien Chazelle, and starring Miles Teller, J. K. Simmons, Paul Reiser, and Melissa Benoist. The film follows the ambitious music student and jazz drummer Andrew Neiman (Teller), who is pushed to his limit by his abusive instructor Terence Fletcher (Simmons) at the fictitious Shaffer Conservatory in New York City.\r\nThe film was produced by Bold Films, Blumhouse Productions, and Right of Way Films. Sony Pictures acquired distribution rights for most of the world, releasing the film under its Sony Pictures Classics and Stage 6 Films banners for its North American and international releases, respectively. Chazelle finished writing the script in 2013, drawing upon his experiences in a \"very competitive\" jazz band in high school. Soon after, Right of Way Films and Blumhouse Productions helped Chazelle turn 15 pages of the script into an 18-minute short film, also titled Whiplash. The short film received acclaim after debuting at the 2013 Sundance Film Festival, which attracted investors to produce the complete version of the script. Filming took place in September 2013 throughout Los Angeles in the course of 20 days. The film explores concepts of perfectionism, dedication, and success and deconstructs the concept of ambition.\r\nWhiplash premiered in competition at the 2014 Sundance Film Festival on January 16, 2014, as the festival's opening film; it won the Audience Award and Grand Jury Prize for drama. The film opened in limited release domestically in the United States and Canada on October 10, 2014, gradually expanding to over 500 screens and finally closing on March 26, 2015. The film received widespread acclaim for its screenplay, direction, film editing, sound mixing, and Teller's and Simmons's performances, and grossed $49 million on a $3.3 million budget, making it Chazelle's highest grossing feature until La La Land (2016). The film received multiple awards and nominations, winning Academy Awards for Best Film Editing and Best Sound Mixing, and also being nominated for Best Picture and Best Adapted Screenplay. Simmons's portrayal of Fletcher won him the Academy, BAFTA, Critics' Choice, Golden Globe, and Screen Actors Guild awards for Best Supporting Actor.\r\nPlot\r\nAndrew Neiman is a first-year student and jazz drummer at the prestigious Shaffer Conservatory in New York City, hoping one day to leave a legacy like that of his childhood idol, jazz drummer Buddy Rich. Terence Fletcher, the conductor of the Shaffer Conservatory Studio Band, recruits him to play in the Studio ensemble as an alternate for core drummer Carl Tanner. Andrew quickly discovers that Fletcher is relentlessly strict, emotionally manipulative, and abusive to his students; he slaps and berates Andrew when he fails to keep tempo during the ensemble's rehearsal of Hank Levy's titular piece, \"Whiplash\".\r\nDetermined to impress Fletcher, Andrew intensifies his drum practicing. After their first set at a jazz competition, Andrew misplaces Tanner's sheet music. Since Tanner cannot play without the sheets, Andrew replaces him for the next set. After a successful performance of \"Whiplash\", Fletcher promotes Andrew to the core drummer. However, Andrew is taken aback when Fletcher abruptly gives the position to Ryan Connolly, a drummer from a lower-level ensemble within Shaffer. Because of his single-mindedness toward music, Andrew's relationship with his family deteriorates, and he breaks up with his girlfriend, Nicole, to focus on his ambitions. After a grueling five-hour practice session with Tanner and Connolly on \"Caravan\", Andrew earns back the core position.\r\nOn the way to the next competition, Andrew's bus breaks down. He rents a car but arrives late and forgets his sticks at the rental office. After convincing an impatient Fletcher to wait for him, Andrew races back and retrieves them, but is hit by a truck on the way back. Andrew crawls from the wreckage and runs to the theater, arriving just as the ensemble enters the stage. Heavily injured, he struggles to play \"Caravan\", and Fletcher halts the performance to dismiss him from the band. Enraged, Andrew attacks Fletcher onstage but is pulled away by security and expelled from Shaffer.\r\nAt his father's request, Andrew meets a lawyer representing the parents of Sean Casey, a former student of Fletcher's. He learns that Casey hanged himself due to depression and anxiety caused by Fletcher's abuse. Casey's parents want Fletcher held accountable, and Andrew agrees to testify anonymously, leading Shaffer to terminate Fletcher. Andrew subsequently abandons drumming.\r\nMonths later, Andrew encounters Fletcher playing piano at a jazz club. Over a drink, Fletcher admits his teaching methods were harsh but argues they were necessary to motivate his students to become successful, citing Charlie Parker's rise to fame as an example. He invites Andrew to perform with his band at the JVC Jazz Festival, assuring him that the songs will be the same ones played by the Studio Band; Andrew hesitantly accepts. Andrew invites Nicole to the performance but finds out she is in a new relationship.\r\nOnstage at JVC, before the first piece, Fletcher reveals that he knows Andrew testified against him. As revenge, Fletcher leads the band into a song Andrew does not know and does not have the sheet music to play. After a disastrous performance, Andrew walks offstage humiliated but returns and cuts off Fletcher's introduction to the next piece by playing the intro to \"Caravan\", cueing the band himself. Initially angered, Fletcher resumes conducting. As the piece finishes, Andrew continues into an extended, unexpected solo. Impressed, Fletcher nods in approval before cueing the finale.\r\nCast\r\nMiles Teller as Andrew Neiman, an ambitious young jazz drummer at Shaffer Conservatory\r\nJ. K. Simmons as Terence Fletcher, a ruthless jazz instructor at Shaffer\r\nPaul Reiser as Jim Neiman, Andrew's father, a writer turned high school teacher\r\nMelissa Benoist as Nicole, a movie theater employee who briefly dates Andrew\r\nAustin Stowell as Ryan Connolly, another drummer in Fletcher's band\r\nNate Lang as Carl Tanner, another drummer in Fletcher's band\r\nChris Mulkey as Uncle Frank, Andrew's uncle\r\nDamon Gupton as Mr. Kramer\r\nSuanne Spoke as Aunt Emma, Andrew's aunt\r\nJayson Blair as Travis, Andrew's cousin\r\nCharlie Ian as Dustin, Andrew's cousin\r\nHenry G. Sanders as Red Henderson\r\nC.J. Vana as Metz, a trombonist who gets dismissed by Fletcher mid-rehearsal\r\nAdrian Rashad Driscoll as Reed, a trombonist\r\nProduction\r\nWhile attending Princeton High School, writer-director Damien Chazelle was in the \"very competitive\" Studio Band and drew on the dread he felt in those years. He based the conductor, Terence Fletcher, on his former band instructor (who died in 2003) but \"pushed it further\", adding elements of Buddy Rich and other band leaders known for their harsh treatment. Chazelle said he wrote the film \"initially in frustration\" while trying to get his musical La La Land off the ground.\r\nRight of Way Films and Blumhouse Productions helped Chazelle turn 15 pages of his original screenplay into a short film starring Johnny Simmons as Neiman and J. K. Simmons (no relation) as Fletcher. The 18-minute short film received acclaim after debuting at the 2013 Sundance Film Festival, winning the short film Jury Award for fiction, which attracted investors to produce the complete version of the script. The feature-length film was financed for $3.3 million by Bold Films.\r\nIn August 2013, Miles Teller signed on to star in the role originated by Johnny Simmons; J. K. Simmons remained attached to his original role. Early on, Chazelle gave J. K. Simmons direction that \"I want you to take it past what you think the normal limit would be,\" telling him: \"I don't want to see a human being on-screen any more. I want to see a monster, a gargoyle, an animal.\" Many of the band members were real musicians or music students, and Chazelle tried to capture their expressions of fear and anxiety when Simmons pressed them. Chazelle said that between takes, Simmons was \"as sweet as can be\", which he credits for keeping \"the shoot from being nightmarish\".\r\nPrincipal photography began in September 2013, with filming taking place throughout Los Angeles, including the Hotel Barclay, Palace Theater, and the Orpheum Theatre. The film was shot in 20 days, with a schedule of 14 hours of filming per day. Chazelle was involved in a serious car accident in the third week of shooting and was hospitalized with possible concussion, but he returned to set the next day to finish the film on time.\r\nHaving taught himself to play drums at age 15, Teller performed much of the drumming seen in the film. Supporting actor and jazz drummer Nate Lang, who plays Teller's rival Carl in the film, trained Teller in the specifics of jazz drumming; this included changing his grip from \"matched\" to \"traditional\". For certain scenes, professional drummer Kyle Crane served as Teller's drum double.\r\nMusic\r\nThe soundtrack album was released on October 7, 2014, via Varèse Sarabande label. The soundtrack consists of 24 tracks divided in three different parts: original jazz pieces written for the film, original underscore parts written for the film, and classic jazz standards written by Stan Getz, Duke Ellington, and other musicians. The actual drummer was Bernie Dresel.\r\nOn March 27, 2020, an expanded deluxe edition was released on double CD and 2-LP gatefold sleeve vinyl with new cover art, and featured original music by Justin Hurwitz, plus bonus track and remixes by Timo Garcia, Opiuo, Murray A. Lightburn and more.\r\nReception\r\nBox office\r\nIn North America, the film opened in a limited release on October 10, 2014, in 6 theaters, grossing $135,388 ($22,565 per theater) and finishing 34th at the box office. It expanded to 88 locations, then 419 locations. After three months on release it had earned $7 million, and finally expanded nationwide to 1000 locations to capitalize on receiving five Academy Awards nominations. Whiplash grossed $13.1 million in the U.S. and Canada and $35.9 million in other territories, for a worldwide total of $49 million against a budget of $3.3 million.\r\nCritical response\r\nOn the review aggregation website Rotten Tomatoes, the film scored 94% based on 303 reviews, with an average rating of 8.60/10. The site's critical consensus states, \"Intense, inspiring, and well-acted, Whiplash is a brilliant sophomore effort from director Damien Chazelle and a riveting vehicle for stars J. K. Simmons and Miles Teller.\" On Metacritic the film has a score of 88 out of 100, based on reviews from 49 critics, indicating \"universal acclaim\". Simmons received wide praise for his performance and won the 2015 Academy Award for Best Supporting Actor.\r\nPeter Debruge, in his review for Variety, said that the film \"demolishes the cliches of the musical-prodigy genre, investing the traditionally polite stages and rehearsal studios of a topnotch conservatory with all the psychological intensity of a battlefield or sports arena.\" Todd McCarthy of The Hollywood Reporter praised the performances of Teller and Simmons, writing: \"Teller, who greatly impressed in last year's Sundance entry The Spectacular Now, does so again in a performance that is more often simmering than volatile ... Simmons has the great good fortune for a character actor to have here found a co-lead part he can really run with, which is what he excitingly does with a man who is profane, way out of bounds and, like many a good villain, utterly compelling.\" Whiplash also won the 87th Academy Award for Best Sound Mixing and the 87th Academy Award for Best Film Editing.\r\nAmber Wilkinson of The Daily Telegraph praised the direction and editing, writing: \"Chazelle's film has a sharp and gripping rhythm, with shots beautifully edited by Tom Cross... often cutting to the crash of Andrew's drums.\" James Rocchi of Indiewire gave a positive review and said, \"Whiplash is ... full of bravado and swagger, uncompromising where it needs to be, informed by great performances and patient with both its characters and the things that matter to them.\" Henry Barnes of The Guardian gave the film a positive review, calling it a rare film \"about music that professes its love for the music and its characters equally.\"\r\nForrest Wickman of Slate said the film distorted jazz history and promoted a misleading idea of genius, adding that \"In all likelihood, Fletcher isn't making a Charlie Parker. He's making the kind of musician that would throw a cymbal at him.\" In The New Yorker, Richard Brody said,\"Whiplash honors neither jazz nor cinema.\"\r\nTop ten lists\r\nThe film appeared on many critics' end-of-year lists. Metacritic collected lists published by major film critics and publications and in their analysis, recorded that Whiplash appeared on 57 lists and in 1st place on 5 of those lists. Overall the film was ranked in 5th place for the year by Metacritic.\r\n1st – William Bibbiani, CraveOnline\r\n1st – Chris Nashawaty, Entertainment Weekly\r\n1st – Erik Davis, Movies.com\r\n2nd – A. A. Dowd, The A.V. Club\r\n2nd – Scott Feinberg, The Hollywood Reporter\r\n2nd – Mara Reinstein, Us Weekly\r\n3rd – Tasha Robinson, The Dissolve\r\n3rd – Amy Taubin, Artforum\r\n3rd – Steve Persall, Tampa Bay Times\r\n3rd – Matt Singer, ScreenCrush\r\n3rd – Rob Hunter, Film School Rejects\r\n4th – Ignatiy Vishnevetsky, The A.V. Club\r\n4th – Kyle Smith, New York Post\r\n4th – Peter Hartlaub, San Francisco Chronicle\r\n4th – Brian Miller, Seattle Weekly\r\n4th – Michael Phillips, Chicago Tribune\r\n4th – David Edelstein, Vulture\r\n5th – Ty Burr, The Boston Globe\r\n5th – Genevieve Koski, The Dissolve\r\n5th – James Berardinelli, Reelviews\r\n5th – David Ansen, The Village Voice\r\n5th – Betsy Sharkey, Los Angeles Times (tied with Foxcatcher)\r\n6th – Peter Travers, Rolling Stone\r\n6th – Richard Roeper, Chicago Sun-Times\r\n6th – Joe Neumaier, New York Daily News\r\n7th – Jesse Hassenger, The A.V. Club\r\n7th – Rex Reed, New York Observer\r\n7th – Noel Murray, The Dissolve\r\n7th – Jocelyn Noveck, Associated Press\r\n7th – Wesley Morris, Grantland\r\n7th – Alison Willmore, BuzzFeed\r\n8th – Keith Phipps, The Dissolve\r\n8th – Mike Scott, The Times-Picayune\r\n8th – Rafer Guzman, Newsday\r\n8th – Seth Malvín Romero, A.V. Wire\r\n8th – Ben Kenigsberg, The A.V. Club\r\n8th – Barbara Vancheri, Pittsburgh Post-Gazette\r\n8th – Kristopher Tapley, Hitfix\r\n8th – Matthew Jacobs and Christopher Rosen, Huffington Post\r\n9th – Nathan Rabin, The Dissolve\r\n10th – Clayton Davis, Awards Circuit\r\n10th – Owen Gleiberman, BBC\r\nTop 10 (listed alphabetically, not ranked) – Claudia Puig, USA Today\r\nTop 10 (listed alphabetically, not ranked) – Stephen Whitty, The Star-Ledger\r\nAccolades\r\nThe film received the top audience and grand jury awards in the U.S. dramatic competition at the 2014 Sundance Film Festival; Chazelle's short film of the same name took home the jury award in the U.S. fiction category one year prior. The film also took the grand prize and the audience award for its favorite film at the 40th Deauville American Film Festival.\r\nWhiplash was originally planned to compete for the Academy Award for Best Original Screenplay, but on January 6, 2015, the Academy of Motion Picture Arts and Sciences (AMPAS) announced that the film would instead be competing in the Adapted Screenplay category to the surprise of many including Chazelle, due to the short film premiering at the 2013 Sundance Film Festival (one year before the feature film's release), even though the feature film's script was written first and the short was made to attract investors into producing the feature-length film. Although the Writers Guild of America categorized the screenplay as original, AMPAS classed it as an adaptation of the 2013 short version.\r\nAt the 87th Academy Awards, J. K. Simmons received the Academy Award for Best Supporting Actor for his performance, Tom Cross won the Academy Award for Best Film Editing and Craig Mann, Ben Wilkins and Thomas Curley won the Academy Award for Best Sound Mixing. In December 2015, the score received a Grammy nomination, and the film was nominated for the NME Award for Best Film.",
    "html": "<p>Whiplash is a 2014 American independent psychological drama film written and directed by Damien Chazelle, and starring Miles Teller, J. K. Simmons, Paul Reiser, and Melissa Benoist. The film follows the ambitious music student and jazz drummer Andrew Neiman (Teller), who is pushed to his limit by his abusive instructor Terence Fletcher (Simmons) at the fictitious Shaffer Conservatory in New York City.</p><p>The film was produced by Bold Films, Blumhouse Productions, and Right of Way Films. Sony Pictures acquired distribution rights for most of the world, releasing the film under its Sony Pictures Classics and Stage 6 Films banners for its North American and international releases, respectively. Chazelle finished writing the script in 2013, drawing upon his experiences in a \"very competitive\" jazz band in high school. Soon after, Right of Way Films and Blumhouse Productions helped Chazelle turn 15 pages of the script into an 18-minute short film, also titled Whiplash. The short film received acclaim after debuting at the 2013 Sundance Film Festival, which attracted investors to produce the complete version of the script. Filming took place in September 2013 throughout Los Angeles in the course of 20 days. The film explores concepts of perfectionism, dedication, and success and deconstructs the concept of ambition.</p><p>Whiplash premiered in competition at the 2014 Sundance Film Festival on January 16, 2014, as the festival's opening film; it won the Audience Award and Grand Jury Prize for drama. The film opened in limited release domestically in the United States and Canada on October 10, 2014, gradually expanding to over 500 screens and finally closing on March 26, 2015. The film received widespread acclaim for its screenplay, direction, film editing, sound mixing, and Teller's and Simmons's performances, and grossed $49 million on a $3.3 million budget, making it Chazelle's highest grossing feature until La La Land (2016). The film received multiple awards and nominations, winning Academy Awards for Best Film Editing and Best Sound Mixing, and also being nominated for Best Picture and Best Adapted Screenplay. Simmons's portrayal of Fletcher won him the Academy, BAFTA, Critics' Choice, Golden Globe, and Screen Actors Guild awards for Best Supporting Actor.</p><br/><h3>Plot</h3><p>Andrew Neiman is a first-year student and jazz drummer at the prestigious Shaffer Conservatory in New York City, hoping one day to leave a legacy like that of his childhood idol, jazz drummer Buddy Rich. Terence Fletcher, the conductor of the Shaffer Conservatory Studio Band, recruits him to play in the Studio ensemble as an alternate for core drummer Carl Tanner. Andrew quickly discovers that Fletcher is relentlessly strict, emotionally manipulative, and abusive to his students; he slaps and berates Andrew when he fails to keep tempo during the ensemble's rehearsal of Hank Levy's titular piece, \"Whiplash\".</p><p>Determined to impress Fletcher, Andrew intensifies his drum practicing. After their first set at a jazz competition, Andrew misplaces Tanner's sheet music. Since Tanner cannot play without the sheets, Andrew replaces him for the next set. After a successful performance of \"Whiplash\", Fletcher promotes Andrew to the core drummer. However, Andrew is taken aback when Fletcher abruptly gives the position to Ryan Connolly, a drummer from a lower-level ensemble within Shaffer. Because of his single-mindedness toward music, Andrew's relationship with his family deteriorates, and he breaks up with his girlfriend, Nicole, to focus on his ambitions. After a grueling five-hour practice session with Tanner and Connolly on \"Caravan\", Andrew earns back the core position.</p><p>On the way to the next competition, Andrew's bus breaks down. He rents a car but arrives late and forgets his sticks at the rental office. After convincing an impatient Fletcher to wait for him, Andrew races back and retrieves them, but is hit by a truck on the way back. Andrew crawls from the wreckage and runs to the theater, arriving just as the ensemble enters the stage. Heavily injured, he struggles to play \"Caravan\", and Fletcher halts the performance to dismiss him from the band. Enraged, Andrew attacks Fletcher onstage but is pulled away by security and expelled from Shaffer.</p><p>At his father's request, Andrew meets a lawyer representing the parents of Sean Casey, a former student of Fletcher's. He learns that Casey hanged himself due to depression and anxiety caused by Fletcher's abuse. Casey's parents want Fletcher held accountable, and Andrew agrees to testify anonymously, leading Shaffer to terminate Fletcher. Andrew subsequently abandons drumming.</p><p>Months later, Andrew encounters Fletcher playing piano at a jazz club. Over a drink, Fletcher admits his teaching methods were harsh but argues they were necessary to motivate his students to become successful, citing Charlie Parker's rise to fame as an example. He invites Andrew to perform with his band at the JVC Jazz Festival, assuring him that the songs will be the same ones played by the Studio Band; Andrew hesitantly accepts. Andrew invites Nicole to the performance but finds out she is in a new relationship.</p><p>Onstage at JVC, before the first piece, Fletcher reveals that he knows Andrew testified against him. As revenge, Fletcher leads the band into a song Andrew does not know and does not have the sheet music to play. After a disastrous performance, Andrew walks offstage humiliated but returns and cuts off Fletcher's introduction to the next piece by playing the intro to \"Caravan\", cueing the band himself. Initially angered, Fletcher resumes conducting. As the piece finishes, Andrew continues into an extended, unexpected solo. Impressed, Fletcher nods in approval before cueing the finale.</p><br/><h3>Cast</h3><ul><li>Miles Teller as Andrew Neiman, an ambitious young jazz drummer at Shaffer Conservatory</li><li>J. K. Simmons as Terence Fletcher, a ruthless jazz instructor at Shaffer</li><li>Paul Reiser as Jim Neiman, Andrew's father, a writer turned high school teacher</li><li>Melissa Benoist as Nicole, a movie theater employee who briefly dates Andrew</li><li>Austin Stowell as Ryan Connolly, another drummer in Fletcher's band</li><li>Nate Lang as Carl Tanner, another drummer in Fletcher's band</li><li>Chris Mulkey as Uncle Frank, Andrew's uncle</li><li>Damon Gupton as Mr. Kramer</li><li>Suanne Spoke as Aunt Emma, Andrew's aunt</li><li>Jayson Blair as Travis, Andrew's cousin</li><li>Charlie Ian as Dustin, Andrew's cousin</li><li>Henry G. Sanders as Red Henderson</li><li>C.J. Vana as Metz, a trombonist who gets dismissed by Fletcher mid-rehearsal</li><li>Adrian Rashad Driscoll as Reed, a trombonist</li></ul><br/><h3>Production</h3><p>While attending Princeton High School, writer-director Damien Chazelle was in the \"very competitive\" Studio Band and drew on the dread he felt in those years. He based the conductor, Terence Fletcher, on his former band instructor (who died in 2003) but \"pushed it further\", adding elements of Buddy Rich and other band leaders known for their harsh treatment. Chazelle said he wrote the film \"initially in frustration\" while trying to get his musical La La Land off the ground.</p><p>Right of Way Films and Blumhouse Productions helped Chazelle turn 15 pages of his original screenplay into a short film starring Johnny Simmons as Neiman and J. K. Simmons (no relation) as Fletcher. The 18-minute short film received acclaim after debuting at the 2013 Sundance Film Festival, winning the short film Jury Award for fiction, which attracted investors to produce the complete version of the script. The feature-length film was financed for $3.3 million by Bold Films.</p><p>In August 2013, Miles Teller signed on to star in the role originated by Johnny Simmons; J. K. Simmons remained attached to his original role. Early on, Chazelle gave J. K. Simmons direction that \"I want you to take it past what you think the normal limit would be,\" telling him: \"I don't want to see a human being on-screen any more. I want to see a monster, a gargoyle, an animal.\" Many of the band members were real musicians or music students, and Chazelle tried to capture their expressions of fear and anxiety when Simmons pressed them. Chazelle said that between takes, Simmons was \"as sweet as can be\", which he credits for keeping \"the shoot from being nightmarish\".</p><p>Principal photography began in September 2013, with filming taking place throughout Los Angeles, including the Hotel Barclay, Palace Theater, and the Orpheum Theatre. The film was shot in 20 days, with a schedule of 14 hours of filming per day. Chazelle was involved in a serious car accident in the third week of shooting and was hospitalized with possible concussion, but he returned to set the next day to finish the film on time.</p><p>Having taught himself to play drums at age 15, Teller performed much of the drumming seen in the film. Supporting actor and jazz drummer Nate Lang, who plays Teller's rival Carl in the film, trained Teller in the specifics of jazz drumming; this included changing his grip from \"matched\" to \"traditional\". For certain scenes, professional drummer Kyle Crane served as Teller's drum double.</p><br/><h3>Music</h3><p>The soundtrack album was released on October 7, 2014, via Varèse Sarabande label. The soundtrack consists of 24 tracks divided in three different parts: original jazz pieces written for the film, original underscore parts written for the film, and classic jazz standards written by Stan Getz, Duke Ellington, and other musicians. The actual drummer was Bernie Dresel.</p><p>On March 27, 2020, an expanded deluxe edition was released on double CD and 2-LP gatefold sleeve vinyl with new cover art, and featured original music by Justin Hurwitz, plus bonus track and remixes by Timo Garcia, Opiuo, Murray A. Lightburn and more.</p><br/><h3>Reception</h3><h4>Box office</h4><p>In North America, the film opened in a limited release on October 10, 2014, in 6 theaters, grossing $135,388 ($22,565 per theater) and finishing 34th at the box office. It expanded to 88 locations, then 419 locations. After three months on release it had earned $7 million, and finally expanded nationwide to 1000 locations to capitalize on receiving five Academy Awards nominations. Whiplash grossed $13.1 million in the U.S. and Canada and $35.9 million in other territories, for a worldwide total of $49 million against a budget of $3.3 million.</p><h4>Critical response</h4><p>On the review aggregation website Rotten Tomatoes, the film scored 94% based on 303 reviews, with an average rating of 8.60/10. The site's critical consensus states, \"Intense, inspiring, and well-acted, Whiplash is a brilliant sophomore effort from director Damien Chazelle and a riveting vehicle for stars J. K. Simmons and Miles Teller.\" On Metacritic the film has a score of 88 out of 100, based on reviews from 49 critics, indicating \"universal acclaim\". Simmons received wide praise for his performance and won the 2015 Academy Award for Best Supporting Actor.</p><p>Peter Debruge, in his review for Variety, said that the film \"demolishes the cliches of the musical-prodigy genre, investing the traditionally polite stages and rehearsal studios of a topnotch conservatory with all the psychological intensity of a battlefield or sports arena.\" Todd McCarthy of The Hollywood Reporter praised the performances of Teller and Simmons, writing: \"Teller, who greatly impressed in last year's Sundance entry The Spectacular Now, does so again in a performance that is more often simmering than volatile ... Simmons has the great good fortune for a character actor to have here found a co-lead part he can really run with, which is what he excitingly does with a man who is profane, way out of bounds and, like many a good villain, utterly compelling.\" Whiplash also won the 87th Academy Award for Best Sound Mixing and the 87th Academy Award for Best Film Editing.</p><p>Amber Wilkinson of The Daily Telegraph praised the direction and editing, writing: \"Chazelle's film has a sharp and gripping rhythm, with shots beautifully edited by Tom Cross... often cutting to the crash of Andrew's drums.\" James Rocchi of Indiewire gave a positive review and said, \"Whiplash is ... full of bravado and swagger, uncompromising where it needs to be, informed by great performances and patient with both its characters and the things that matter to them.\" Henry Barnes of The Guardian gave the film a positive review, calling it a rare film \"about music that professes its love for the music and its characters equally.\"</p><p>Forrest Wickman of Slate said the film distorted jazz history and promoted a misleading idea of genius, adding that \"In all likelihood, Fletcher isn't making a Charlie Parker. He's making the kind of musician that would throw a cymbal at him.\" In The New Yorker, Richard Brody said,\"Whiplash honors neither jazz nor cinema.\"</p><h4>Top ten lists</h4><p>The film appeared on many critics' end-of-year lists. Metacritic collected lists published by major film critics and publications and in their analysis, recorded that Whiplash appeared on 57 lists and in 1st place on 5 of those lists. Overall the film was ranked in 5th place for the year by Metacritic.</p><ul><li>1st – William Bibbiani, CraveOnline</li><li>1st – Chris Nashawaty, Entertainment Weekly</li><li>1st – Erik Davis, Movies.com</li><li>2nd – A. A. Dowd, The A.V. Club</li><li>2nd – Scott Feinberg, The Hollywood Reporter</li><li>2nd – Mara Reinstein, Us Weekly</li><li>3rd – Tasha Robinson, The Dissolve</li><li>3rd – Amy Taubin, Artforum</li><li>3rd – Steve Persall, Tampa Bay Times</li><li>3rd – Matt Singer, ScreenCrush</li><li>3rd – Rob Hunter, Film School Rejects</li><li>4th – Ignatiy Vishnevetsky, The A.V. Club</li><li>4th – Kyle Smith, New York Post</li><li>4th – Peter Hartlaub, San Francisco Chronicle</li><li>4th – Brian Miller, Seattle Weekly</li><li>4th – Michael Phillips, Chicago Tribune</li><li>4th – David Edelstein, Vulture</li><li>5th – Ty Burr, The Boston Globe</li><li>5th – Genevieve Koski, The Dissolve</li><li>5th – James Berardinelli, Reelviews</li><li>5th – David Ansen, The Village Voice</li><li>5th – Betsy Sharkey, Los Angeles Times (tied with Foxcatcher)</li><li>6th – Peter Travers, Rolling Stone</li><li>6th – Richard Roeper, Chicago Sun-Times</li><li>6th – Joe Neumaier, New York Daily News</li><li>7th – Jesse Hassenger, The A.V. Club</li><li>7th – Rex Reed, New York Observer</li><li>7th – Noel Murray, The Dissolve</li><li>7th – Jocelyn Noveck, Associated Press</li><li>7th – Wesley Morris, Grantland</li><li>7th – Alison Willmore, BuzzFeed</li><li>8th – Keith Phipps, The Dissolve</li><li>8th – Mike Scott, The Times-Picayune</li><li>8th – Rafer Guzman, Newsday</li><li>8th – Seth Malvín Romero, A.V. Wire</li><li>8th – Ben Kenigsberg, The A.V. Club</li><li>8th – Barbara Vancheri, Pittsburgh Post-Gazette</li><li>8th – Kristopher Tapley, Hitfix</li><li>8th – Matthew Jacobs and Christopher Rosen, Huffington Post</li><li>9th – Nathan Rabin, The Dissolve</li><li>10th – Clayton Davis, Awards Circuit</li><li>10th – Owen Gleiberman, BBC</li><li>Top 10 (listed alphabetically, not ranked) – Claudia Puig, USA Today</li><li>Top 10 (listed alphabetically, not ranked) – Stephen Whitty, The Star-Ledger</li></ul><br/><h3>Accolades</h3><p>The film received the top audience and grand jury awards in the U.S. dramatic competition at the 2014 Sundance Film Festival; Chazelle's short film of the same name took home the jury award in the U.S. fiction category one year prior. The film also took the grand prize and the audience award for its favorite film at the 40th Deauville American Film Festival.</p><p>Whiplash was originally planned to compete for the Academy Award for Best Original Screenplay, but on January 6, 2015, the Academy of Motion Picture Arts and Sciences (AMPAS) announced that the film would instead be competing in the Adapted Screenplay category to the surprise of many including Chazelle, due to the short film premiering at the 2013 Sundance Film Festival (one year before the feature film's release), even though the feature film's script was written first and the short was made to attract investors into producing the feature-length film. Although the Writers Guild of America categorized the screenplay as original, AMPAS classed it as an adaptation of the 2013 short version.</p><p>At the 87th Academy Awards, J. K. Simmons received the Academy Award for Best Supporting Actor for his performance, Tom Cross won the Academy Award for Best Film Editing and Craig Mann, Ben Wilkins and Thomas Curley won the Academy Award for Best Sound Mixing. In December 2015, the score received a Grammy nomination, and the film was nominated for the NME Award for Best Film.</p><br/>"
  },
  "errorMessage": ""
}