{
  "imDbId": "tt0059578",
  "title": "For a Few Dollars More",
  "fullTitle": "For a Few Dollars More (1965)",
  "type": "Movie",
  "year": "1965",
  "items": [
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/movies/for-a-few-dollars-more/review/2030107118/",
      "rate": "100",
      "content": "The second film in Leone's Dollar trilogy finds the Italian director in better form than in A Fistful of Dollars. For a Few Dollars More has better writing, superior production values, and more characters who aptly complement Eastwood's stoic Man with No Name."
    },
    {
      "publisher": "The A.V. Club",
      "author": "Sam Adams",
      "link": "https://www.avclub.com/a-fistful-of-dollars-for-a-few-dollars-more-1798220924",
      "rate": "91",
      "content": "While it doesn’t have the lunatic fervor of The Good, The Bad’s climatic cemetery shootout, For A Few Dollars more feels like its successor’s equal, which is about as great a compliment as I can bestow."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1965/film/reviews/for-a-few-dollars-more-2-1117791012/",
      "rate": "80",
      "content": "A hard-hitting western with upper-case values out of the busy Italo stable, this is a topnotch action entry."
    },
    {
      "publisher": "Empire",
      "author": "Kim Newman",
      "link": "https://www.empireonline.com/movies/reviews/dollars-per-qualche-dollari-piu-review/",
      "rate": "80",
      "content": "It has a wealth of marvellous Western imagery, grotesque-comic business (Van Cleef striking a match on seething baddie Klaus Kinski’s hunchback), Ennio Morricone’s baroque score, iconic stars and unforgettable supporting faces."
    },
    {
      "publisher": "Chicago Reader",
      "author": "J.R. Jones",
      "link": "",
      "rate": "80",
      "content": "Leone's artful editing of close-ups to communicate the characters' spatial relationships is always a pleasure, and here he unveils his stylistic signature—extreme close-ups of the characters' eyes—as Van Cleef surveys the villain's wanted poster."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/for-a-few-dollars-more-1967",
      "rate": "75",
      "content": "Here is a gloriously greasy, sweaty, hairy, bloody and violent Western. It is delicious."
    },
    {
      "publisher": "Time Out",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "Not as stylish as The Good, the Bad and the Ugly, but a significant step forward from A Fistful of Dollars, with the usual terrific compositions, Morricone score, and taciturn performances, not to mention the ubiquitous flashback disease."
    },
    {
      "publisher": "The New York Times",
      "author": "Bosley Crowther",
      "link": "https://www.nytimes.com/1967/07/04/archives/screen-for-few-dollars-more-openstranslux-west-shows-new-eastwood.html",
      "rate": "40",
      "content": "The fact that this film is constructed to endorse the exercise of murderers, to emphasize killer bravado and generate glee in frantic manifestations of death is, to my mind, a sharp indictment of it as so-called entertainment in this day."
    }
  ],
  "errorMessage": ""
}