{
  "imDbId": "tt0059578",
  "title": "For a Few Dollars More",
  "fullTitle": "For a Few Dollars More (1965)",
  "type": "Movie",
  "year": "1965",
  "language": "en",
  "titleInLanguage": "For a Few Dollars More",
  "url": "https://en.wikipedia.org/wiki/For_a_Few_Dollars_More",
  "plotShort": {
    "plainText": "For a Few Dollars More (Italian: Per qualche dollaro in più) is a 1965 Spaghetti Western film directed by Sergio Leone. It stars Clint Eastwood and Lee Van Cleef as bounty hunters and Gian Maria Volonté as the primary villain. German actor Klaus Kinski plays a supporting role as a secondary villain. The film was an international co-production between Italy, West Germany, and Spain. The film was released in the United States in 1967, and is the second part of what is commonly known as the Dollars Trilogy.",
    "html": "<p>For a Few Dollars More (Italian: Per qualche dollaro in più) is a 1965 Spaghetti Western film directed by Sergio Leone. It stars Clint Eastwood and Lee Van Cleef as bounty hunters and Gian Maria Volonté as the primary villain. German actor Klaus Kinski plays a supporting role as a secondary villain. The film was an international co-production between Italy, West Germany, and Spain. The film was released in the United States in 1967, and is the second part of what is commonly known as the Dollars Trilogy.</p>"
  },
  "plotFull": {
    "plainText": "For a Few Dollars More (Italian: Per qualche dollaro in più) is a 1965 Spaghetti Western film directed by Sergio Leone. It stars Clint Eastwood and Lee Van Cleef as bounty hunters and Gian Maria Volonté as the primary villain. German actor Klaus Kinski plays a supporting role as a secondary villain. The film was an international co-production between Italy, West Germany, and Spain. The film was released in the United States in 1967, and is the second part of what is commonly known as the Dollars Trilogy.\r\nPlot\r\nThe man that many call Manco is a bounty hunter, a profession shared by a former army officer, Colonel Douglas Mortimer. They separately learn that a ruthless, cold-blooded bank robber, \"El Indio\", has been broken out of prison by his gang, who slaughtered all but one of his jailers. While Indio is murdering the family of the man who had captured him, he is shown to carry a musical pocket watch taken from a woman who had shot herself while he was raping her after he had murdered her husband. The incident has haunted Indio, and he smokes an addictive drug to cloud his memory.\r\nIndio plans to rob the Bank of El Paso, which has a disguised safe containing \"almost a million dollars.\" Manco arrives in the town and becomes aware of Mortimer, who had arrived earlier. He sees Mortimer deliberately insult the hunchback Wild, who is reconnoitering the bank. Manco confronts Mortimer, and after the two have studied each other, each ascertaining that the other will not back down, they decide to work together. Mortimer persuades Manco to join Indio's gang and \"get him between two fires.\" Manco achieves this by freeing a friend of Indio from prison despite Indio's suspicions.\r\nIndio sends Manco and three others to rob the bank in nearby Santa Cruz. Manco guns down the three bandits and sends a false telegraphic alarm to rouse the El Paso sheriff and his posse, who ride to Santa Cruz. The gang blasts the wall at the rear of the El Paso bank and steals the safe, but is unable to open it. Groggy is angry when Manco is the only one to return from Santa Cruz, but Indio accepts Manco's version of events thanks to Mortimer having given Manco a convincing neck wound. The gang ride to the small border town of Agua Caliente where Mortimer, who had anticipated their destination, is waiting. Wild recognizes Mortimer, forcing a showdown that results in the hunchback's death, whereafter Mortimer offers his services to Indio to crack open the safe without using explosives. Indio locks the money in a strongbox and says the loot will be divided after a month.\r\nManco and Mortimer break into the strongbox and hide the money, only to be caught immediately afterward and beaten up. Mortimer has secured the strongbox lock, however, and Indio believes that the money is still there. Later that night, Indio instructs his lieutenant, Niño, to use a knife belonging to Cuchillo to kill the man guarding Manco and Mortimer. Once Niño has freed the prisoners, Indio reveals that he knew they were bounty hunters all along, and executes Cuchillo for supposedly betraying the gang. Indio orders the rest of his men to bring back Manco and Mortimer, hoping they will all kill each other and he and Niño can split the money just between themselves. However, Groggy realizes the scheme, and after killing Niño, forces Indio to open the strongbox, which is found to be empty.\r\nEventually, after he and Manco kill the bandits, Mortimer calls out Indio while revealing his full name. Mortimer shoots Groggy as he runs for cover, but is disarmed by Indio, who plays the pocket watch while challenging the bounty hunter to regain his weapon and kill him when the music ends. As the music ends, the same tune begins from an identical pocket watch that Manco had pilfered from Mortimer. Manco gives his gunbelt and pistol to Mortimer, saying, \"Now we start.\" When the music ends, Mortimer shoots first, killing Indio.\r\nMortimer retrieves the watch from Indio's hand and Manco remarks on Mortimer's resemblance to the woman in the vignette photo inside the watch cover. Mortimer reveals that he is her brother (father in the Spanish dubbing), and with his revenge complete, declines his share of the bounty and leaves. Manco tosses the bodies of Indio and his men into a wagon, finally adding Groggy's body after killing him, and rides off to collect the bounties on them all, briefly pausing to recover the stolen money from its hiding place.\r\nCast\r\nClint Eastwood as Manco (a.k.a. the Man with No Name)\r\nLee Van Cleef as Colonel Douglas Mortimer\r\nGian Maria Volonté as El Indio\r\nMario Brega as Niño\r\nMara Krupp as the hotel manager's wife\r\nLuigi Pistilli as Groggy\r\nAldo Sambrell as Cuchillo\r\nKlaus Kinski as Wild\r\nBenito Stefanelli as Hughie\r\nPanos Papadopoulos as Sancho Perez\r\nRobert Camardiel as Tucumcari station clerk\r\nJosef Egger as Old Prophet\r\nAntoñito Ruiz as Fernando\r\nTomas Blanco as Tucumcari sheriff\r\nLorenzo Robledo as Tomaso, Indio's traitor\r\nDante Maggio as Carpenter in cell with El Indio\r\nWerner Abrolat as Slim, member of Indio's gang\r\nFrank Braña as Blackie, Member of Indio's Gang\r\nJosé Canalejas as Chico, a member of Indio's gang\r\nRosemary Dexter as Mortimer's sister\r\nFernando Di Leo as a cigar-smoking card player\r\nJesús Guzmán as carpetbagger on train\r\nPeter Lee Lawrence as Mortimer's brother-in-law\r\nSergio Leone as a whistling bounty hunter\r\nAntonio Molino Rojo as Frisco, member of Indio's gang\r\nRicardo Palacios as Tucumcari saloon keeper\r\nCarlo Simi as El Paso bank manager\r\nProduction\r\nDevelopment\r\nAfter the box-office success of A Fistful of Dollars in Italy, director Sergio Leone and his new producer, Alberto Grimaldi, wanted to begin production of a sequel. Since Clint Eastwood was not ready to commit to a second film before he had seen the first, the filmmakers rushed an Italian-language print of Per un pugno di dollari to him - as a version in English did not yet exist. When the star arranged for a debut screening at CBS Production Center, though the audience there may not have understood Italian, they found its style and action convincing. Eastwood, therefore, agreed to the proposal. Charles Bronson was again approached for a starring role but he thought the sequel's script was too like the first film. Instead, Lee Van Cleef accepted the role. Eastwood received $50,000 for returning in the sequel, while Van Cleef received $17,000.\r\nScreenwriter Luciano Vincenzoni wrote the film in nine days. However, Leone was dissatisfied with some of the script's dialogue, and hired Sergio Donati to work as an uncredited script doctor.\r\nProduction\r\nThe film was shot in Tabernas, Almería, Spain, with interiors done at Rome's Cinecittà Studios. The production designer Carlo Simi built the town of \"El Paso\" in the Almería desert; it still exists, as the tourist attraction Mini Hollywood. The town of Agua Caliente, where Indio and his gang flee after the bank robbery, was filmed in Los Albaricoques, a small \"pueblo blanco\" on the Níjar plain.\r\nPost-production\r\nAs all of the film's footage was shot MOS (i.e. without recording sound at the time of shooting), Eastwood and Van Cleef returned to Italy where they dubbed over their dialogue, and sound effects were added. Although it is explicitly stated in the movie that the Colonel Mortimer character is originally from the Carolinas, Van Cleef opted to perform his dialogue using his native New Jersey accent rather than a Southern accent.\r\nMusic\r\nThe musical score was composed by Ennio Morricone, who had previously collaborated with director Leone on A Fistful of Dollars. Under Leone's explicit direction, Morricone began writing the score before production had started, as Leone often shot to the music on set. The music is notable for its blend of diegetic and non-diegetic moments through a recurring motif that originates from the identical pocket watches belonging to El Indio and Colonel Mortimer. \"The music that the watch makes transfers your thought to a different place,\" said Morricone. \"The character itself comes out through the watch but in a different situation every time it appears.\"\r\nA soundtrack album was originally released in Italy by RCA Italiana. In the United States, Hugo Montenegro released a cover version as did Billy Strange and Leroy Holmes who released a cover version of the soundtrack album with the original American poster art. Maurizio Graf sang a vocal \"Occhio Per Occhio\"/\"An Eye For An Eye\" to the music of the cue \"Sixty Seconds to What?\". Graf’s performance(s) did not appear in the film but were released as tie-in 45 RPM records.\r\nAll tracks are written by Ennio Morricone.\r\nRelease and reception\r\nBox office\r\nFor a Few Dollars More was released in Italy on 30 December 1965 as Per Qualche Dollaro in Più.\r\nThe film proved to be even more commercially successful than its predecessor. By 1967, the film became the highest-grossing film in Italy with a gross of 3.1 billion lire ($5 million) from 14,543,161 admissions.\r\nThe film opened in Spain on 17 August 1966 as La muerte tenía un precio and became the highest-grossing Spanish film of all-time with a gross of 272 million pesetas, equivalent to $4.53 million in 1966.\r\nIt was the seventh most popular film at the French box office in 1966, for a total of $10.5 million grossed in international territories outside North America.\r\nIn the United States, the film debuted on 10 May 1967, four months after the release of A Fistful of Dollars, earning $5 million in rentals. It grossed a total of $15 million in the United States and Canada, adding up to a total of $25.5 million grossed worldwide.\r\nCritical reception\r\nIt initially received mediocre reviews from critics. Bosley Crowther of The New York Times said, \"The fact that this film is constructed to endorse the exercise of murderers, to emphasize killer bravado and generate glee in frantic manifestations of death is, to my mind, a sharp indictment of it as so-called entertainment in this day.\" Roger Ebert of the Chicago Sun-Times described the film as \"one great old Western cliché after another\" and said that it \"is composed of situations and not plots\", but nonetheless found it \"delicious\". Its platitudinous character immediately laid it open to parody and one followed in the same year as Lando Buzzanca's For a Few Dollars Less (1966).\r\nThe film has since grown in popularity, while also gaining more positive feedback from contemporary critics. The review aggregator website Rotten Tomatoes reports a 92% approval rating with an average rating of 8/10 based on 36 reviews. The website's consensus reads, \"With Clint Eastwood in the lead, Ennio Morricone on the score, and Sergio Leone's stylish direction, For a Few Dollars More earns its recognition as a genre classic.\"\r\nIn a retrospective review of the Dollars Trilogy, Paul Martinovic of Den of Geek said, \"For A Few Dollars More is often overlooked in the trilogy, awkwardly sandwiched between both the original film and the best-known, but it's a stunning film in its own right.\" Paolo Sardinas of MovieWeb said, \"Eastwood gives it his all and turns in another iconic performance along with scene stealer Lee Van Cleef, who helps make For a Few Dollars More twice as good as its predecessor.\" Film historian Richard Schickel, in his biography of Clint Eastwood, believed that this was the best film in the trilogy, arguing that it was \"more elegant and complex than A Fistful of Dollars and more tense and compressed than The Good, the Bad and the Ugly\". Director Alex Cox considered the church scene to be one of \"the most horrible deaths\" of any Western, describing Volonté's Indio as the \"most diabolical Western villain of all time\".\r\nBritish journalist Kim Newman said that the film changed the way bounty hunters were viewed by audiences. It moved them away from a \"profession to be ashamed of\", one with a \"(ranking) lower than a card sharp on the Western scale of worthwhile citizens\", to one of heroic respectability.",
    "html": "<p>For a Few Dollars More (Italian: Per qualche dollaro in più) is a 1965 Spaghetti Western film directed by Sergio Leone. It stars Clint Eastwood and Lee Van Cleef as bounty hunters and Gian Maria Volonté as the primary villain. German actor Klaus Kinski plays a supporting role as a secondary villain. The film was an international co-production between Italy, West Germany, and Spain. The film was released in the United States in 1967, and is the second part of what is commonly known as the Dollars Trilogy.</p><br/><h3>Plot</h3><p>The man that many call Manco is a bounty hunter, a profession shared by a former army officer, Colonel Douglas Mortimer. They separately learn that a ruthless, cold-blooded bank robber, \"El Indio\", has been broken out of prison by his gang, who slaughtered all but one of his jailers. While Indio is murdering the family of the man who had captured him, he is shown to carry a musical pocket watch taken from a woman who had shot herself while he was raping her after he had murdered her husband. The incident has haunted Indio, and he smokes an addictive drug to cloud his memory.</p><p>Indio plans to rob the Bank of El Paso, which has a disguised safe containing \"almost a million dollars.\" Manco arrives in the town and becomes aware of Mortimer, who had arrived earlier. He sees Mortimer deliberately insult the hunchback Wild, who is reconnoitering the bank. Manco confronts Mortimer, and after the two have studied each other, each ascertaining that the other will not back down, they decide to work together. Mortimer persuades Manco to join Indio's gang and \"get him between two fires.\" Manco achieves this by freeing a friend of Indio from prison despite Indio's suspicions.</p><p>Indio sends Manco and three others to rob the bank in nearby Santa Cruz. Manco guns down the three bandits and sends a false telegraphic alarm to rouse the El Paso sheriff and his posse, who ride to Santa Cruz. The gang blasts the wall at the rear of the El Paso bank and steals the safe, but is unable to open it. Groggy is angry when Manco is the only one to return from Santa Cruz, but Indio accepts Manco's version of events thanks to Mortimer having given Manco a convincing neck wound. The gang ride to the small border town of Agua Caliente where Mortimer, who had anticipated their destination, is waiting. Wild recognizes Mortimer, forcing a showdown that results in the hunchback's death, whereafter Mortimer offers his services to Indio to crack open the safe without using explosives. Indio locks the money in a strongbox and says the loot will be divided after a month.</p><p>Manco and Mortimer break into the strongbox and hide the money, only to be caught immediately afterward and beaten up. Mortimer has secured the strongbox lock, however, and Indio believes that the money is still there. Later that night, Indio instructs his lieutenant, Niño, to use a knife belonging to Cuchillo to kill the man guarding Manco and Mortimer. Once Niño has freed the prisoners, Indio reveals that he knew they were bounty hunters all along, and executes Cuchillo for supposedly betraying the gang. Indio orders the rest of his men to bring back Manco and Mortimer, hoping they will all kill each other and he and Niño can split the money just between themselves. However, Groggy realizes the scheme, and after killing Niño, forces Indio to open the strongbox, which is found to be empty.</p><p>Eventually, after he and Manco kill the bandits, Mortimer calls out Indio while revealing his full name. Mortimer shoots Groggy as he runs for cover, but is disarmed by Indio, who plays the pocket watch while challenging the bounty hunter to regain his weapon and kill him when the music ends. As the music ends, the same tune begins from an identical pocket watch that Manco had pilfered from Mortimer. Manco gives his gunbelt and pistol to Mortimer, saying, \"Now we start.\" When the music ends, Mortimer shoots first, killing Indio.</p><p>Mortimer retrieves the watch from Indio's hand and Manco remarks on Mortimer's resemblance to the woman in the vignette photo inside the watch cover. Mortimer reveals that he is her brother (father in the Spanish dubbing), and with his revenge complete, declines his share of the bounty and leaves. Manco tosses the bodies of Indio and his men into a wagon, finally adding Groggy's body after killing him, and rides off to collect the bounties on them all, briefly pausing to recover the stolen money from its hiding place.</p><br/><h3>Cast</h3><ul><li>Clint Eastwood as Manco (a.k.a. the Man with No Name)</li><li>Lee Van Cleef as Colonel Douglas Mortimer</li><li>Gian Maria Volonté as El Indio</li><li>Mario Brega as Niño</li><li>Mara Krupp as the hotel manager's wife</li><li>Luigi Pistilli as Groggy</li><li>Aldo Sambrell as Cuchillo</li><li>Klaus Kinski as Wild</li><li>Benito Stefanelli as Hughie</li><li>Panos Papadopoulos as Sancho Perez</li><li>Robert Camardiel as Tucumcari station clerk</li><li>Josef Egger as Old Prophet</li><li>Antoñito Ruiz as Fernando</li><li>Tomas Blanco as Tucumcari sheriff</li><li>Lorenzo Robledo as Tomaso, Indio's traitor</li><li>Dante Maggio as Carpenter in cell with El Indio</li><li>Werner Abrolat as Slim, member of Indio's gang</li><li>Frank Braña as Blackie, Member of Indio's Gang</li><li>José Canalejas as Chico, a member of Indio's gang</li><li>Rosemary Dexter as Mortimer's sister</li><li>Fernando Di Leo as a cigar-smoking card player</li><li>Jesús Guzmán as carpetbagger on train</li><li>Peter Lee Lawrence as Mortimer's brother-in-law</li><li>Sergio Leone as a whistling bounty hunter</li><li>Antonio Molino Rojo as Frisco, member of Indio's gang</li><li>Ricardo Palacios as Tucumcari saloon keeper</li><li>Carlo Simi as El Paso bank manager</li></ul><br/><h3>Production</h3><h4>Development</h4><p>After the box-office success of A Fistful of Dollars in Italy, director Sergio Leone and his new producer, Alberto Grimaldi, wanted to begin production of a sequel. Since Clint Eastwood was not ready to commit to a second film before he had seen the first, the filmmakers rushed an Italian-language print of Per un pugno di dollari to him - as a version in English did not yet exist. When the star arranged for a debut screening at CBS Production Center, though the audience there may not have understood Italian, they found its style and action convincing. Eastwood, therefore, agreed to the proposal. Charles Bronson was again approached for a starring role but he thought the sequel's script was too like the first film. Instead, Lee Van Cleef accepted the role. Eastwood received $50,000 for returning in the sequel, while Van Cleef received $17,000.</p><p>Screenwriter Luciano Vincenzoni wrote the film in nine days. However, Leone was dissatisfied with some of the script's dialogue, and hired Sergio Donati to work as an uncredited script doctor.</p><h4>Production</h4><p>The film was shot in Tabernas, Almería, Spain, with interiors done at Rome's Cinecittà Studios. The production designer Carlo Simi built the town of \"El Paso\" in the Almería desert; it still exists, as the tourist attraction Mini Hollywood. The town of Agua Caliente, where Indio and his gang flee after the bank robbery, was filmed in Los Albaricoques, a small \"pueblo blanco\" on the Níjar plain.</p><h4>Post-production</h4><p>As all of the film's footage was shot MOS (i.e. without recording sound at the time of shooting), Eastwood and Van Cleef returned to Italy where they dubbed over their dialogue, and sound effects were added. Although it is explicitly stated in the movie that the Colonel Mortimer character is originally from the Carolinas, Van Cleef opted to perform his dialogue using his native New Jersey accent rather than a Southern accent.</p><h4>Music</h4><p>The musical score was composed by Ennio Morricone, who had previously collaborated with director Leone on A Fistful of Dollars. Under Leone's explicit direction, Morricone began writing the score before production had started, as Leone often shot to the music on set. The music is notable for its blend of diegetic and non-diegetic moments through a recurring motif that originates from the identical pocket watches belonging to El Indio and Colonel Mortimer. \"The music that the watch makes transfers your thought to a different place,\" said Morricone. \"The character itself comes out through the watch but in a different situation every time it appears.\"</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">For a Few Dollars More</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Ennio Morricone</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">1965 <small>(Original album)</small></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\">Soundtrack</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>RCA Italiana</span></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Ennio Morricone</span> chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"><i><span>Se non avessi più te</span></i><br>(1965)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>For a Few Dollars More</b></i><br>(1965)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"><i><span>Idoli controluce</span></i><br>(1966)</td></tr></tbody></table></td></tr></tbody></table><p>A soundtrack album was originally released in Italy by RCA Italiana. In the United States, Hugo Montenegro released a cover version as did Billy Strange and Leroy Holmes who released a cover version of the soundtrack album with the original American poster art. Maurizio Graf sang a vocal \"Occhio Per Occhio\"/\"An Eye For An Eye\" to the music of the cue \"Sixty Seconds to What?\". Graf’s performance(s) did not appear in the film but were released as tie-in 45 RPM records.</p><p>All tracks are written by Ennio Morricone.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Track listing</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"La Resa Dei Conti\"</td><td class=\"tracklist-length\">3:06</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Osservatori Osservati\"</td><td class=\"tracklist-length\">2:01</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Il Vizio Di Uccidere\"</td><td class=\"tracklist-length\">2:24</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Il Colpo\"</td><td class=\"tracklist-length\">2:21</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Addio Colonnello\"</td><td class=\"tracklist-length\">1:44</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Per Qualche Dollaro In Più\"</td><td class=\"tracklist-length\">2:50</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Poker D'Assi\"</td><td class=\"tracklist-length\">1:15</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Carillon\"</td><td class=\"tracklist-length\">1:10</td></tr></tbody></table><br/><h3>Release and reception</h3><h4>Box office</h4><p>For a Few Dollars More was released in Italy on 30 December 1965 as Per Qualche Dollaro in Più.</p><p>The film proved to be even more commercially successful than its predecessor. By 1967, the film became the highest-grossing film in Italy with a gross of 3.1 billion lire ($5 million) from 14,543,161 admissions.</p><p>The film opened in Spain on 17 August 1966 as La muerte tenía un precio and became the highest-grossing Spanish film of all-time with a gross of 272 million pesetas, equivalent to $4.53 million in 1966.</p><p>It was the seventh most popular film at the French box office in 1966, for a total of $10.5 million grossed in international territories outside North America.</p><p>In the United States, the film debuted on 10 May 1967, four months after the release of A Fistful of Dollars, earning $5 million in rentals. It grossed a total of $15 million in the United States and Canada, adding up to a total of $25.5 million grossed worldwide.</p><h4>Critical reception</h4><p>It initially received mediocre reviews from critics. Bosley Crowther of The New York Times said, \"The fact that this film is constructed to endorse the exercise of murderers, to emphasize killer bravado and generate glee in frantic manifestations of death is, to my mind, a sharp indictment of it as so-called entertainment in this day.\" Roger Ebert of the Chicago Sun-Times described the film as \"one great old Western cliché after another\" and said that it \"is composed of situations and not plots\", but nonetheless found it \"delicious\". Its platitudinous character immediately laid it open to parody and one followed in the same year as Lando Buzzanca's For a Few Dollars Less (1966).</p><p>The film has since grown in popularity, while also gaining more positive feedback from contemporary critics. The review aggregator website Rotten Tomatoes reports a 92% approval rating with an average rating of 8/10 based on 36 reviews. The website's consensus reads, \"With Clint Eastwood in the lead, Ennio Morricone on the score, and Sergio Leone's stylish direction, For a Few Dollars More earns its recognition as a genre classic.\"</p><p>In a retrospective review of the Dollars Trilogy, Paul Martinovic of Den of Geek said, \"For A Few Dollars More is often overlooked in the trilogy, awkwardly sandwiched between both the original film and the best-known, but it's a stunning film in its own right.\" Paolo Sardinas of MovieWeb said, \"Eastwood gives it his all and turns in another iconic performance along with scene stealer Lee Van Cleef, who helps make For a Few Dollars More twice as good as its predecessor.\" Film historian Richard Schickel, in his biography of Clint Eastwood, believed that this was the best film in the trilogy, arguing that it was \"more elegant and complex than A Fistful of Dollars and more tense and compressed than The Good, the Bad and the Ugly\". Director Alex Cox considered the church scene to be one of \"the most horrible deaths\" of any Western, describing Volonté's Indio as the \"most diabolical Western villain of all time\".</p><p>British journalist Kim Newman said that the film changed the way bounty hunters were viewed by audiences. It moved them away from a \"profession to be ashamed of\", one with a \"(ranking) lower than a card sharp on the Western scale of worthwhile citizens\", to one of heroic respectability.</p><br/>"
  },
  "errorMessage": ""
}