{
  "imDbId": "tt0364569",
  "title": "Oldboy",
  "fullTitle": "Oldboy (2003)",
  "type": "Movie",
  "year": "2003",
  "items": [
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw3540091",
      "warningSpoilers": true,
      "date": "8 September 2016",
      "rate": "10",
      "helpful": "72 out of 83 found this helpful.",
      "title": "A cinematic bad boy",
      "content": "Oldboy really is an odd movie. It's totally unconventional, completely original, and unlike anything else you'll probably find out there, even in the realms of Asian cinema. To say too much would be to spoil the ride, but this is a film where you'll always be guessing what's going to happen next and never quite sure what's really going on.It's a bleak, dark movie that begins very well indeed and stays strong throughout. Chan-wook Park is an expert director and really handles everything well. He's blessed with a superior leading man in Choi Min-sik, the kind of actor who gives his all to the movie, no restraint, no mild-mannered acting here...he lives and breathes the role and you believe in him at all times. Kang Hye-jeong, starring opposite him as love interest Mido, is also very effective, completely lovely and just right for her role.As for the story... wow. This movie has a brilliant script that constantly surprises you right up until the very last scene. Twists are commonplace these days, but the one found here is the most shocking I've ever seen. OLDBOY has it all, really. A great story unveiled in a leisurely way, piece by piece, no hurry. Touches of the surreal – the disgusting octopus-eating scene is everything you'd imagine it to be. Great acting, great technical aspects. There's violence too, of course. The tooth-pulling torture is probably the most squirm-inducing bit, but the highlight for me is the one-take corridor battle which has to be seen to be believed. One guy with a hammer versus twenty hoods...well, watch it and find out what happens.By the time the ending comes and you find out why Oh Dae-su was imprisoned, you realise you're watching a masterwork of cinema. It's not an easy film to sit through by any means, but it is affecting and it is very well made indeed. Challenging, gut-punching and outrageous: OLDBOY is one of the bad boys of our time."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw7788904",
      "warningSpoilers": false,
      "date": "22 January 2022",
      "rate": "10",
      "helpful": "31 out of 42 found this helpful.",
      "title": "You Only Live Once...",
      "content": "Imagine what you'd do, when you wake from a bad dream, to find you're held by four square walls, for as long as someone deems. No idea why you're trapped, what you've done, why you're kidnapped, just a ceaseless line of dumplings going down your gyoza hatch. Now some fifteen years have passed, every question has been asked, and you're suddenly set free, can start your own avenging spree. Before you do you need to feed, by eating something that's in need, so an octopus is ordered, and head first you cross the borders. But things aren't what they might seem, tied and tethered and undreamed, as the puppet master hovers, manipulates what you'll discover.Some films you cannot watch too often and this is one of the greatest pieces of cinematic brilliance ever created."
    },
    {
      "username": "johnny-08",
      "userUrl": "https://www.imdb.com/user/ur14795108",
      "reviewLink": "https://www.imdb.com/review/rw1698667",
      "warningSpoilers": false,
      "date": "22 July 2007",
      "rate": "10",
      "helpful": "332 out of 498 found this helpful.",
      "title": "Excellent in it's sickness",
      "content": "I looked at program for today and I saw movie \"Oldboy\". I read plot and I liked it. What I expected is decent thriller from very good South Korean cinematography,something like \"Salinui chueok \". But once again I was wrong. \"Oldboy\" is masterpiece, so unusual from all other movies. I've seen lots of violence on screen and to me this isn't nothing new but I think that people under 18 really shouldn't watch this one. It's because movie is brutal and I don't think that younger ones would fully understand this one.To say something about plot is quite impossible because I don't know where to begin. If I start talking about the movie I could tell few important things and I know that people often read other comments because they didn't watch that movie. So,I'm going to say only what I read before watching this movie.On his daughter's birthday, Oh Dae-su gets drunk and soon he's arrested by the police. His best friend No Joo-hwan somehow manages to get him out of jail and when No Joo-hwan is making a phone call Oh Dae-su disappears. Someone kidnap's him and puts him into room during 15 long years.But one day he's released.That's the plot. Very interesting, you should watch this movie and then judge it. By the rating on IMDb this movie is in top 250 movies. Now I can understand why. This plot that I wrote doesn't reveal the greatness of the people who wrote the script. I bow to them because this movie is so good, with all those twists and it really represents a whole new wave of making a movie, of writing a script and of acting in it. About direction and actors I can say only good things. Director Park Chan-wook won prize Grand Jury at Cannes. That's enough about direction part. About actors. I can say that I'm impressed by one actor:Choi Min-sik. He's amazing in major role and he showed great potential. I hope I will see him again in some good movie.I cannot say anything more because I could reveal some secret and I don't wanna do that to all new viewers. Only a recommendation. Beautiful, intelligent masterpiece of movie that I highly recommend for everyone with strong stomach and too all of you who want to see one excellent, but sick story. 10/10"
    },
    {
      "username": "bur_007",
      "userUrl": "https://www.imdb.com/user/ur10556094",
      "reviewLink": "https://www.imdb.com/review/rw1783091",
      "warningSpoilers": false,
      "date": "19 December 2007",
      "rate": "10",
      "helpful": "824 out of 1,124 found this helpful.",
      "title": "If only we were all living in Asia....",
      "content": "To start off; This is the one and only film that kept me quiet for a whole 5 mins after seeing it. I literally couldn't close my mouth, and yet there wasn't any sound coming out of it. Oldboy had such an impact on me that words are too little to describe that impact. Therefore this film is definitely in my top 3 films ever made. It belongs there because it has a massive ingredient that a lot of films seem to miss out on; a divine plot. Even though the acting and screenplay are world class, the plot is really the cherry on the cake.When it comes to screenplay Park Chan-Wook is unique (at least for western standards) in his way of filming. The colours are so vivid and it seems like he wanted every shot to be a piece of art. One tip: If you like the shooting in 'Oldboy', have a look at 'Sympathy for Lady Vengeance', the third part in Park's revenge-trilogy. It's even superior to the camera-work in 'Oldboy'. Don't, however, expect a story like Oldboy's, because you would be very disappointed.When it comes to acting and the music, this film is also one of the better films ever made. The music sticks in your head and every time I put in my Oldboy-DVD and the theme-song comes up, I'm just flooded with good memories (even though the plot doesn't have a single reason to be happy about). The characters are also presented very well by the outstanding cast. Especially Choi Min-Sik and Yu Ji-Tae set a very convincing performance. I really appreciate this film being respected as it should be, by having a place in the top 250. If, however, it was up to me it would be even higher in the ranking. I don't see why films like 'The Usual Suspects' or 'Memento', which are fantastic pieces of film-making and which without a doubt deserve a place in the top 250, are higher in the top 250 than 'Oldboy'. They serve the same cause; a fantastic plot. But those plots can't stand in the shadow or even come close to the plot of 'Oldboy'. The one and only reason is that those two films are better known and from a western production company. If we were all living in Asia, no doubt 'Oldboy' would be in the top 20 of all time. My advice to people who haven't watched this film yet: Go see it! This is definitely a must- see. If you have a weak stomach, pull yourself together and still watch it. Don't be as shallow as a lot of people here tend to be. Look beyond the violence and see the things I mentioned before: world class acting, cinematography, music and last but certainly not least the plot. Once you've opened yourself up you'll find a whole new world of cinema. Enjoy!"
    },
    {
      "username": "Genevieve_X",
      "userUrl": "https://www.imdb.com/user/ur1066346",
      "reviewLink": "https://www.imdb.com/review/rw1702789",
      "warningSpoilers": false,
      "date": "29 July 2007",
      "rate": "9",
      "helpful": "325 out of 469 found this helpful.",
      "title": "Freaked me out",
      "content": "I haven't written a comment on IMDb for about 3 years but was inspired to with this film. It is not very often that I come across a film by accident (World Movies on cable) and the spend the next day scouring the internet to find out information about it and can't get it out of my head! Anyway, yep there are plot holes, but Old boy borrows a lot from surrealism and you are meant to suspend your disbelief! I don't buy comments when people say \"it is so unrealistic because he should've done this ...\" because it is a surrealist film and meant to be unrealistic! For me the sign of a good film is if it sticks on your head! THis one surely does (althought I did have to look away a few times ... ) Loved it!!!! Work of cruel genius!!! (HOLLYWOOD - Please don't ruin it by remaking it!!!)"
    },
    {
      "username": "LeroyBrown-2",
      "userUrl": "https://www.imdb.com/user/ur0939196",
      "reviewLink": "https://www.imdb.com/review/rw2017514",
      "warningSpoilers": false,
      "date": "3 February 2009",
      "rate": "8",
      "helpful": "27 out of 37 found this helpful.",
      "title": "As good and disturbing as expected.",
      "content": "I read the review for \"Oldboy\" a few years ago and have since read praise about the movie from IMDb posters. Often times movies with that kind of hype tend to fall short and is a major disappointment. I don't know anything about Korean cinema so I had fairly low expectations. I had expected it to be a simplistic revenge film, shot in bad film stock. Well I have to say that I'm glad I was wrong, and even gladder still that I actually watched this film.The basic story is that a man named Oh Dae-Su is kidnapped and held captive for 18 years and then released. He has no idea who or why this is being done to him. While in captivity he readies himself for the day when he gets out and take revenge on those who imprisoned him, and to find out why he was imprisoned. So far it sounds just like any old revenge martial art flick and up to this point it pretty much is, but it's incredibly well crafted. I have to admit I have not paid much attention to Asian martial arts films since Bruce Lee died and maybe I should now. Mainly because this movie doesn't have the jumpy camera work, or bad editing of those old flicks. This movie is a crisply shot as any Scorcese film. That alone elevates this movie to a higher plateau.Once he is released, Oh Dae-Su goes on a quest to find what happened to his family and to find the identity of those who had him captured. During the quest for the bad guys, the movie played out like an old fashioned detective movie. The search wasn't rushed and neither was it boring. I suppose the set up made us want to go on this quest with Oh Dae-Su which sounds like Odysseus, and just as Odysseus went on one incredible quest so did Oh Dae-Su.It's when he finds the man who had him held captive that the movie truly departs from being an average revenge film to something that is extra ordinary and extraordinarily disturbing. It's at this point that I have to say that the less said the better. It's something totally out of the ordinary and something that I think will repulse some viewers, but at the same time one can't help have sympathy for all the characters even the man who ordered Oh's incarceration. The acting in the movie is excellent. I had no idea that Korean cinema has such skillful actors. They all really played their part incredibly well. Min-sik Choi, who played Oh Dae-Su was incredible. He goes through the rigors of being a desperate captive, to being a determined man on a mission. Along the way he runs through the gamut of so much emotion and not once did he hit a false note. Overall I have to say that this movie is incredibly well crafted and as good as everybody say, however I find it a little disturbing so I can't give this movie a ten. But don't let my not giving the film a ten scare you away it's a good, enjoyable film."
    },
    {
      "username": "lucas739",
      "userUrl": "https://www.imdb.com/user/ur2691100",
      "reviewLink": "https://www.imdb.com/review/rw1618981",
      "warningSpoilers": false,
      "date": "17 March 2007",
      "rate": "9",
      "helpful": "262 out of 427 found this helpful.",
      "title": "Great film!",
      "content": "I feel compelled to defend this film from some quite frankly unwarranted criticism. Although it isn't without its flaws, and all films have a few,it certainly isn't a one star film.What this film has is the ability to be sublime, shocking, ridiculous, mildly amusing and visually stunning which is some feat for any film.The sheer scale of the comments here suggests that here is a film that gets to you in one way or another. This film is as far away from Maborosi as you can get yet both films are up there as great pieces of cinema. I wont divulge the plot or end this comment with a Latin quote to reinforce my self importance i'll just say go and watch it, preferably if you're not too squeamish and don't mind subtitles.This film left me thinking about it the following day which is normally a good thing (atleast it shows my memory is working!)"
    },
    {
      "username": "paulclaassen",
      "userUrl": "https://www.imdb.com/user/ur2263198",
      "reviewLink": "https://www.imdb.com/review/rw4204994",
      "warningSpoilers": true,
      "date": "16 June 2018",
      "rate": "5",
      "helpful": "47 out of 78 found this helpful.",
      "title": "I don't get it; what's the hype all about?",
      "content": "'Oldboy' is constantly mentioned as one of the greatest Korean films ever made, and has also been called the most disturbing Korean film (followed by 'I saw the Devil' and 'The Chaser', which were both incredibly disturbing). I therefore eagerly watched the film in high anticipation, but am quite sad to say I was very disappointed. It started off very interesting and mysterious, and the story was told in a very unique way. The moment Oh Dae Su is released, the film becomes very neo-noir-ish (and I don't enjoy neo-noir) and I actually found it to me more comedic than disturbing or suspenseful. Choi Min-sik was excellent, as usual, and without him in the lead I might have liked the film even less. So, essentially the film is about an old school friend, Lee Woo-jin, who wants to avenge Oh Dae-Su for Lee's sister's suicide. Because of this he locks him up for 15 years, then sets him free after 'programming' both him and his daughter via hypnosis to fall in love. Uhmm, ok... Ok, spoilers to follow, so stop reading if you don't want to know. Is this filmed said to be the most disturbing film simply because it is revealed the woman he so eagerly had sex with is actually his daughter? Nothing else in the film is disturbing. When all is said and done and Lee kills himself (what an anti-climax!!), Oh Dae-Su tracks down the hypnotist and asks her to erase his memory of his daughter so they can have a relationship. Seriously!!?? So he'd rather have her as his lover than his daughter?? I rest my case..."
    },
    {
      "username": "kywoo7",
      "userUrl": "https://www.imdb.com/user/ur9978719",
      "reviewLink": "https://www.imdb.com/review/rw1818421",
      "warningSpoilers": true,
      "date": "12 February 2008",
      "rate": "9",
      "helpful": "667 out of 776 found this helpful.",
      "title": "A couple of answers that may be useful to understand this film better!!",
      "content": "Hi! I am a South Korean national student here in London, and would like to give you some clues why the main character, Oh Dae-Soo, was kept in the private prison for exactly 15 years and why he ate the live octopus as I hope you all understand this film a little better.Firstly, his wife was killed one year after his being kept in the privately run prison. Obviously, Oh Dae-Soo didn't kill her but was suspected of murdering her. It must be done by Lee Yu-Jin who planned to have his sister's revenge upon Oh Dae-Soo. In South Korea, criminals of unsolved crimes including murder cases are forgiven/overlooked by law 15 years after the crimes were committed, which means a murder suspect wouldn't be charged or get punished unless the suspect is caught within 15 years after the murder. This is why Oh Dae-Soo was released 15 years after his wife was killed. Thus, he wouldn't be disturbed by the police investigation and Lee Yu-Jin could play with him at his own discretion.Secondly, nobody in the country eats live octopus like the way he ate in the film. It seems to me that the scene shows his uncontrollable anger against the man who he talked with on the phone and didn't say anything about the reasons why he was kept in the prison. If there was a piece of cake or a bowl of rice in front of him, I guess he would probably eat it in the same way he did with the octopus. So, please don't get it wrong that eating something alive is part of Korean culture. It should be understood itself in that extreme context.I saw this film several times with my friends. I didn't quite understand it in the first view but came to like it in the second time and it's one of my favourites now. I like the complicated plot and the shocking ending. As I'm studying translation of English and Korean, most of my classmates and friends are English who spent some time in South Korean and they liked this one the most among other Korean films.I hope my talk helps."
    },
    {
      "username": "dj_bassett",
      "userUrl": "https://www.imdb.com/user/ur3203728",
      "reviewLink": "https://www.imdb.com/review/rw1066580",
      "warningSpoilers": true,
      "date": "24 April 2005",
      "rate": "",
      "helpful": "767 out of 1,402 found this helpful.",
      "title": "Didn't like it much at all",
      "content": "Armond White of the NY Press has called it a \"virtuosic stupid movie\". I think that's exactly right.Certainly the movie looks fantastic. I liked the surrealistic touches. I think the director has a real imaginative way of capturing the process of memory -- there's an extended flashback about 3/4 way through which I think is as well conceived and shot as anything I've seen. The acting is standout. Hell, I even liked the score.But the movie almost aggressively makes no sense.SPOILERS Leave aside for a moment the obvious plot holes, large and small -- although it's worth noting that there's a whole lot of them. Leave aside the contrivances, too: the endless special gadgets the bad guy comes up with just when he needs them, the rather magical view of hypnosis, Dae-Su's magical new abilities, the seeming omnipotence of the badguy. Let's assume all this is beside the point, and that we're supposed to take the movie more or less symbolically ala FIGHT CLUB (probably the closest reference).The movie doesn't make any sense thematically, either. What's it really about? The virtue of keeping your mouth shut? The movie seems to suggest that the bad guy's sexual relationship with his sister is just fine, the problem seems to be Dae-Su's big mouth. The movie rather laboriously teaches this: the sister kills herself because of the rumors which somehow the sister believes to be true (?); Dae-Su becomes convinced that he was, in fact, at fault; Dae-Su cuts his own tongue out; Dae-Su pleads that Mi-do never learn the truth; Dae-Su even ends up brainwashing himself via hypnosis to forget the truth -- or \"keep his mind shut\", in a sense. I mean, huh? This is a pretty juvenile kind of ethics, to be blunt about it. Although Dae-Su is the protagonist the movie really doesn't seem to be on his side. It also hints at a weird kind of passivity: for all of the hammer swinging and octopus eating, Dae-Su doesn't really do all that much: things are done to him, and eventually he begins to internalize the abuse given to him.Is it about the futility of revenge? One would think, particularly with the references to COUNT OF MONTE CRISTO. But leaving aside the notion that Dae-Su's tormentor's omnipresence seems to weigh against the notion of him and Mi-do doing anything, really, but take their lumps or try to fight back, the fact that Dae-Su is considered by the movie to have really \"done\" something makes any critique pretty complicated. Remember, in COUNT Dantes is a true innocent. His motives are as pure as revenge ever gets -- that's why Dumas's ultimate critique, his ultimate notion that revenge even for the Count is wrong works so well. The force is seen in isolation. Here, though, it seems more a case of Dae-Su learning how \"bad\" he really is. He shouldn't take revenge because he really IS at fault.I guess you could argue that the movie shows revenge is futile from the bad guy's point of view. Then why are we watching Dae-Su at all? Maybe the point is that everyone feels themselves righteous until they realize the true dimensions of their \"sin\". But I don't see a lot of people facing up to facts in the movie: I see a lot of denial, in fact. Dae-Su admits to his relatively \"minor\" sin but can't face up to his \"major\" one.After I saw this I read some interviews with the cast and crew, and apparently some of this vagueness is intentional -- we're supposed to be left unsure. Well, the movie is successful in that, but I think it's an unworthy goal, an abdication of the artist's responsibility. People have bristled at the charge that this movie is nihilistic, but if that really is the point, that the movie's supposed to throw up it's hands and say, \"hey, I dunno, you figure it out\", then that truly is nihilism.Ah well, I could go on, but I won't bore you. A virtuosic stupid movie indeed, I think: often amazing to watch but underneath the surface just a whole bunch of muddleheadedness."
    },
    {
      "username": "LoneWolfAndCub",
      "userUrl": "https://www.imdb.com/user/ur5237888",
      "reviewLink": "https://www.imdb.com/review/rw1611076",
      "warningSpoilers": true,
      "date": "4 March 2007",
      "rate": "10",
      "helpful": "131 out of 231 found this helpful.",
      "title": "One of the most gripping movies I have ever seen",
      "content": "Oldboy is one of the most intense movies you will ever see. Breathtaking, brutal and easily one of the best revenge movies ever made. The acting is amazing, especially Choi as the main protagonist Dae-su Oh. All the actors did great but his performance was powerful and emotional (all you need to do is see the infamous squid scene). Chan-wook Park gives this movie a very unique style with his direction. The plot starts off like a fairly standard revenge drama but he slowly makes the movie darker through a series of beautifully shot flashbacks and a huge scene involving nothing but a family photo album.If you can't handle extremely strong violence, torture, sex and language and can't stand subtitles it's best you stay far away from Oldboy....if you can, though, then watch it! It's an incredible movie with some of the best performances, a moving score and a disturbing but unique plot with twist after twist.5/5"
    },
    {
      "username": "KineticSeoul",
      "userUrl": "https://www.imdb.com/user/ur22171966",
      "reviewLink": "https://www.imdb.com/review/rw2135834",
      "warningSpoilers": false,
      "date": "3 October 2009",
      "rate": "9",
      "helpful": "27 out of 44 found this helpful.",
      "title": "One of the best Korean movie I have ever seen",
      "content": "I will start out by saying that Chan-wook Park is a film making genius, maybe Quentin Tarantino of Korea. The plot was original and the character development and cinematography was really well done. This is a revenge story that grips you from beginning to end, especially at the end. This movie is a must see, even if you have a weak stomach go watch it anyways, cause there will be those \"thats f***** up\" moments, the fight scenes are few but realistic. I am not going to ruin anything about this movie or give away the pot, all I can say is just watch the damn movie. Korean film making at it's best.9.2/10"
    },
    {
      "username": "MrVibrating",
      "userUrl": "https://www.imdb.com/user/ur4763123",
      "reviewLink": "https://www.imdb.com/review/rw1749916",
      "warningSpoilers": true,
      "date": "20 October 2007",
      "rate": "10",
      "helpful": "87 out of 148 found this helpful.",
      "title": "Complex, challenging masterpiece that puts Hollywood to shame.",
      "content": "While Hollywood is slowly choking to death on clichés and unrealistic budgets, the movie lovers turn their attention to Asia. Especially interesting is Korea's emerging movie industry. Japan has a long tradition of quality horror and anime and China dominates the epics with state-sponsored spectacles. Which place Korea will take we don't know but if Oldboy is any inclination it would be intelligent, disturbing drama-action movies.Oldboy has an extremely intelligent and edgy script, which will make you think and question your morals. It would NEVER be picked up in Hollywood. Even the initial concept of being locked up for 15 years without apparent reason would be deemed to strange for the audience. Thankfully, the Korean producers could see the brilliance of the script and give it a shot. It's budget is some $4 million, which is amazingly well used.Oldboy is very much the child of it's director, Chan-Wook Park, who's name should warrant a lot more fame than it does. The camera-work and pacing is amazing. There are virtually no dull moments. The fighting scenes are used to compliment to movie, not to give a reward after half an hour's boredom.The lead actors are no less amazing. Min-Sik Choi is a perfect anti-hero. Unlike the Western antiheroes, he even has the looks of an everyman, which makes his transformation so much more spectacular. The lead actress is a bit understates in my opinion, but memorable never the less. The best one is by far Ji-Tae Ju, the charismatic villain. He dominates every scene he's in, a sort of Korean Christian Bale American Psycho.Music and choreography is great as well. All the details and the grit makes the movie really come alive. At the end, you are in awe, a rare feeling for a movie. The feeling stays with you for days. Occasionally you will think of the movie and shake your head, unbelieving someone could actually pull it off.So do yourself a favor, watch Oldboy. You will not be disappointed."
    },
    {
      "username": "Chris Knipp",
      "userUrl": "https://www.imdb.com/user/ur1501216",
      "reviewLink": "https://www.imdb.com/review/rw1058578",
      "warningSpoilers": true,
      "date": "11 April 2005",
      "rate": "7",
      "helpful": "102 out of 197 found this helpful.",
      "title": "Revenge: a dish best eaten live?",
      "content": "In Park Chan-wook's 'Oldboy' (which won the grand prize at Cannes in 2004 when Tarantino was at the helm), a rough-looking man is held by the cops for some hours after a drunk. A series of relentless jump-cuts show him misbehaving at the police station. Once bailed out, he suddenly disappears in a pour-down rain while his rescuer is in a phone booth. The next we know he's imprisoned in a tiny apartment-like jail cell, and is held there for .fifteen years! Again jump cuts take us through this experience, which includes pumped-in gas while he sleeps, self-tattoos of cross-hatching to remind himself of the years, a journal, a constant TV which is his only companion, imaginary swarms of insects, and personal martial-arts conditioning that includes punching the wall till his knuckles bleed.Once released, having a taste for something other than the pot-stickers he was served all the time in his prison, our man stops at a sushi bar and asks for \"something live.\" He's brought an octopus as big as two fists and he gobbles it -- live -- and passes out. The female sushi chef presiding at this event bonds with the man and they go looking for whoever imprisoned him and try to find out why. I forgot a man who jumps off the roof of the prison building before this: but nobody could keep track of all the hyper-kinetic, dark, grungy contents of 'Oldboy.' It's in Korean, by the way, and if you don't know Korean you may miss a bit of the dialog. It's got those subtitles that fade when the background's light, and they flick by pretty fast too.What is clear is that as somebody taunts him, Oh Dae-Su's just in a larger prison when his captors let him out, and what he does is part of a maniacal scheme to do him far worse harm than mere physical confinement.What's initially endearing about this accomplished but cartoon-like revenge-mystery action film, apart from Choi Min Sik's gonzo performance as Oh Dae-Su, the imprisoned man who turns sushi freak, is its obsessiveness, which Choi's intensity neatly underlines. The troubles begin when you realize that however maniacally determined Oh Dae-Su's pursuit of his tormentor and unraveling of his imprisonment's secrets are, it's all ultimately lost on us because it makes little logical, and even less emotional, sense. Or, where it does make sense, it's patently impossible.Park Chan Wook is a clever and inventive filmmaker who like many of the other 'dark,' 'cool' filmmakers of today has a visual style that outstrips his ability to tell a story. Since you could have said that about The Big Sleep and many still do, it may be that critical head-shaking over 'Oldboy' will seem passé in time and the film will morph into a classic. It's been said already though that Park is pursuing cult status faster than he can keep up with himself.The encrustation of the mechanical upon the living was Bergson's definition of the comic, and by that definition this movie should be a laugh riot. There's both elaborate visual trickery and intense real physicality -- witness Oh Dae-Su's consumption of the octopus. He really bites the thing's head off and chews on the still-writhing tentacles as they nervously coil round his cheek. The martial arts sequences are tricky and complicated; I doubt that the actor is doing all his stunts like Tony Ja in 'Ong-bak: Thai Warrior,' but his physicality is down to earth as he punches out one thug after another. No jumping, just punches and falls. But the images and their sequencing are most artfully manipulated. There's a sex scene, and an erotic scene, and a torture sequence involving dental extractions.How Oh Dae-Su finds people and how people find Oh Dae-Su is pretty confused. There's a vague sense that those tormenting Oh Dae-Su are evil masterminds à la James Bond. They have gangster connections and there's a posh huge penthouse at the end. But our hero seems to have been held in a kind of rent-a-jail cell, and whoever ordered up this treatment was apparently connected with something more mundane than Goldfinger: simply a schoolmate who bears Oh Dae-Su an obscure grudge. When the school enemy appears, if I've got this right, he seems to be a decade or two Oh Dae-Su's junior. Does it matter? Well, cultists of the movie will want to explain everything. But not rest of us, because the people aren't real or specific enough for us to care. Choi Min Sik's a gnarly little dynamo (his wacko behavior fits better here than it did in the artistic biography Chihwaseon) and his nemesis is a tall, cool, godlike personage. That's the point. The contrast is enough.Oldboy has hints of Tarantino and Tarantino's Asian martial arts sources, but although there's a lot of dialog, as far as one can tell the talk is very far from Pulp Fiction's priceless exchanges.You think the idea's unique -- imagine being locked up for fifteen years without explanation -- but then you realize it's not only what happened to Victor Hugo's Jean Valjean, but essentially what happens to a lot of black men in America, only then it isn't the beginning of a hip nightmare film. The imprisonment of black men is the real tale of society's revenge on an undeserving minority, but Oldboy's maniacal and inexplicable personal revenge of one middle class man on another has no social significance; worse yet, it never acquires an emotional one.Director Park Chan Wook is a director to reckon with -- some of Oldboy's sequences are hard to forget -- and he's found a worthy star in Choi Min Sik. But this disturbing, violent movie is clever without being intelligent."
    },
    {
      "username": "coldwaterpdh",
      "userUrl": "https://www.imdb.com/user/ur17816817",
      "reviewLink": "https://www.imdb.com/review/rw1823770",
      "warningSpoilers": false,
      "date": "20 February 2008",
      "rate": "10",
      "helpful": "52 out of 90 found this helpful.",
      "title": "Absolutely authentic and 100% bad ass.",
      "content": "The first time I saw \"Oldboy\" I watched it by myself on a rainy evening. When the credits rolled at the end I think I actually stood up and clapped. It's been a long time since I've seen something so original. The film is gripping, it grabs and never lets you go.It starts out with a man who is locked inside this room and doesn't know why and blah blah blah...sounds almost cliché. Read the back of the DVD case for a summary. The last fifteen minutes of \"Oldboy\" are the most intense fifteen minutes I've seen in any movie. By the end, you are so eager to know what happened to this poor guy and why he has been punished. And the film takes a twist that makes every hair on your arms stand up and it remains satisfying. It's not one of those twists that leaves you scratching your head. It makes sense! A film like \"Oldboy\" is humbling in that it makes you realize that America is no longer turning out the most cutting-edge stuff. But it's also nice to know that someone out there still has the guts to do a film with no barriers that makes you stand up and flip off guys like Tarantino and go, 'that's what I'm talking about.' 10 out of 10, kids."
    },
    {
      "username": "ryuakamrvengeance",
      "userUrl": "https://www.imdb.com/user/ur14515688",
      "reviewLink": "https://www.imdb.com/review/rw1613066",
      "warningSpoilers": false,
      "date": "7 March 2007",
      "rate": "9",
      "helpful": "326 out of 533 found this helpful.",
      "title": "One step ahead of America",
      "content": "Oldboy takes a hammer and \"batters\" its American equivalents, leaving them as pulped as a chewed up squid. Park Chan Wook displays what America misses with his ultra-stylish, ultra-violent thriller. Why watch Ben Affleck fail spectacularly to summon any displayable talent, when Min sik Choi serves up a memorable role as the disturbed, vengeful Dae Su Oh, in the second of the Vengeance trilogy. Park skillfully creates a compelling plot that will have you guessing through the entire film, up until the final shocking revelation. The Cinematography expertly done by Jeong-hun Jeong, who also worked on the follow up to this film, Chinjeolhan geumjassi. Everything about this film is done in style and panache and creates a memorable experience, and has many memorable scenes.Many people accuse this film of being \"unrealistic\". These people forget that this a film, not a documentary. No one complains About Star Wars being unrealistic, and rightly so. Films have a right to stretch out reality, don't forget the reason it does this is to be entertaining.Although the film has strong violence of a graphic nature, I advise you to watch it, if only to broaden your perspectives of world and Asian cinema."
    },
    {
      "username": "poolandrews",
      "userUrl": "https://www.imdb.com/user/ur1355507",
      "reviewLink": "https://www.imdb.com/review/rw2149475",
      "warningSpoilers": true,
      "date": "30 October 2009",
      "rate": "3",
      "helpful": "62 out of 127 found this helpful.",
      "title": "Didn't do anything for me.",
      "content": "Oldboy is set in Korea & starts as a drunken Dae-su Oh (Min-Sik Choi) is bailed out of the police station by his friend only to be abducted, Dae-su wakes up & finds himself in a small room which he will be imprisoned in for the next fifteen years. Dae-su is fed & looked after by his unknown captors but is never allowed out of the room, Dae-su begins to train himself to avenge himself after he gets out which he intends to do by scrapping away the cement from the brickwork with a chopstick. However before Dae-su finishes he is gassed & rendered unconscious, when he wakes up Dae-su finds himself free on the roof of a tall building dressed & all moneyed up. Dae-su instantly sets about trying to find out who imprisoned him, after meeting the pretty Mido (Hye-jeong Kang) the two fall in love & together with her help Dae-su finally finds what he is looking for but the truth comes at a price...This South Korean production was co-written & directed by Chan-wook Park & has gotten any number of glowing reviews (the sort that distributors can pick quotes out & plaster them on the video box) & even won the Grand Prize of the Jury at Cannes while it was also nominated for the Golden Palm so surely Oldboy is a true classic? Well not for me it isn't since as I can't understand why it's so liked & I would go as far as to say I pretty much hated it apart from one or two isolated moments. For a start I couldn't get into the story at all, I just didn't like it as I thought it was slow & boring & while many out there would have you believe Oldboy has the bestest most shocking twist ever I thought it was rather plain & not very well executed either. The ending in which Dae-su goes to the New Zealand Alps to be hypnotised feels tagged on as well almost as if the makers wanted some sort of happy ending. At almost two hours I almost fell asleep I was so bored, the violence is tame & it's the thought of what's happening that I would imagine most people have a problem with rather than what is actually shown. In fact Oldboy has a very low body count of about seven & one mild sex scene, it's really not that graphic or memorable. I didn't warm to any of the character's & while I accept Oldboy has an alright concept & premise it fails to deliver & it's one film that I will never understand why so many people seem to like.Based on a Japanese Manga of the same name Oldboy the film looks alright, there's one or two nice visual moments here although while everyone raves about the hallway fight that takes place in one continuous shot I was pretty unimpressed & thought the fight choreography was quite dull. The actual on-screen gore violence amounts to very little, Dae-su eats a live Octopus which is apparently quite normal in Korea anyway, there are some fight scenes, a severed hand, someones teeth are pulled out & there's a bit of blood at the end.The budget was supposedly around the $4,000,000 mark which is actually a fair bit, filmed in South Korea & New Zealand. The acting looks alright but it's hard to tell when actors are speaking a different language.Oldboy is a film that I found an absolute chore to sit through, I don't mind subtitled films or foreign films or paying attention to the plot as I followed the thing perfectly but I just didn't like any of it & it's as simple & straightforward as that. Apparently the second in director Choi-wook Park's revenge trilogy which also includes Sympathy for Mr. Vengeance (2002) & Lady Vengeance (2005)."
    },
    {
      "username": "max8791",
      "userUrl": "https://www.imdb.com/user/ur5326124",
      "reviewLink": "https://www.imdb.com/review/rw1641578",
      "warningSpoilers": false,
      "date": "21 April 2007",
      "rate": "9",
      "helpful": "390 out of 609 found this helpful.",
      "title": "One of most well-made films I've ever seen",
      "content": "I decided to check this movie out after Ebert's 4 star rave review, and the cult status this movie has received (and was also intrigued by the sexy-looking Ultimate Edition), so I decided to rent it. I was VERY surprised at how different it was than I expected it to be - I expected a ton of violence and not much in the way of writing or acting. The first time I saw it, I wasn't blown away, just kind of like whatever.When I watched it for the second time, however, I really started to notice how well it's made, in addition to liking it more. Every shot is bursting with background detail, a great amount of attention on the production design (the theme of a certain color in a scene was restrained, yet perfectly balanced). The actors really gave it all, especially the 2 male leads who really blew me away. The music is a varied mix of beautiful classical music and some pretty cool techno. The screenplay is brilliant; the characters are developed very well, extremely complex, and the plot is not only ingenious, but the payoff and twists are 1000x better than any Shamaylan movie.Simply put, from a technical point of view, it's one of the best movies ever. From a critic's point of view, it is a very well-done movie that goes a little overboard in sex and violence, and is just a little strange."
    },
    {
      "username": "thomas196x2000",
      "userUrl": "https://www.imdb.com/user/ur7039674",
      "reviewLink": "https://www.imdb.com/review/rw1498095",
      "warningSpoilers": true,
      "date": "15 October 2006",
      "rate": "3",
      "helpful": "160 out of 306 found this helpful.",
      "title": "This was what all the fuss was about?",
      "content": "I don't go to see a lot of movies anymore, despite the fact that when younger I would see easily 5 movies a week, two or three at the movies and the same in rentals.Now, I usually only go to the theaters a few times a year for something special, and when I see an interesting DVD, I just buy it, I don't rent.So, somehow I came across this film when reading things online and noticed a very high Rottentomatoes.com rating. (that should have told me something right there).The \"Kafkaesque\" description intrigued me. A guy wakes up in a prison, everything is controlled, and literally years go by. He is framed for his wife's murder. Why? At first, the dubbing seemed distracting, a little too \"bright\", but I got used to it. In fact, right away, you could see a lot of effort when into the camera work for this film, and the music. It was compelling.The story starts to slip when the guy gets out of the prison. First, this guy is hard to look at, just kind of wacky. He refuses to listen to another man (had he just been released too???) and when that man falls to his death, it is done for comic effect. I started thinking, uh oh.Next, he meets a young woman and eats a live octopus. Not clear why. Perhaps a metaphor that those with the power will consume the lives of those that they can dominate. See, I remember film school too.Anyways, the absurdity of why this guy was locked up, and who is really seeking revenge on who are plot details better left unsaid, but are actually quite disgusting. In fact, this movie is nothing like what I thought it would be.I thought there would be a lot of stylized action. Either the director doesn't know how to stage action, or I don't know what. There could have been a great fight sequence at the beginning with the young punks, but the camera just turns away. Later, at the \"big fight scene\", Oh fights off literally dozens of guys with sticks, armed with only a hammer. There is no fight choreography, no real action, just a slow camera track. Oh is no fighter, but somehow beats up all on-comers, often not really connecting with them but they fall over anyways. At one point he is beaten down but just keeps going in a very odd fashion.At another potential fight sequence, he is simply pushed down by another gangster, and cannot even coordinate standing back up again. By this time, I knew there was not going to be too much action by this guy.This is not an action film. There is plenty of blood and guts, and the \"twist ending\" comes way before the end of the film. The lead character is so degraded, he begins to degrade himself. And when his ex-best friend laughs at how silly he behaves in his self-degradation, his laughing and attitude makes no connection to what he does to himself in the elevator a few minutes later. If this is all he had to live for, why not lock the guy up again? Here are the problems I have: 1) At some points, Oh can kill 50 people at once; the next scene, one guy can overpower him.2) What's the point of the film? Incest is OK as long as you shut up about it? 3) Why would OH make the choice he did at the end, knowing who the girl is? 4) Doesn't a normal restaurant delivery service question bringing tons of food every day to a building that has rooms and screaming coming from it? 5) Wouldn't you eventually die after being gassed every night? 6) Hypnotism has limited powers, and only on people who WANT to be hypnotized. By now, everyone over the age of 10 knows that, so what was the deal here? 7) I don't buy films where the good guy or the bad guy are in some way omnipotent. Or where a character has to have chosen an exact path from a whole series of variables to arrive at the outcome that the other parties--and the script...are expecting. This was the problem with films such as Arlington Road, Seven, The Game, and dozens of other titles. I believe it is a result of lazy or untalented writing.8) Never, ever go see a movie that Quentin Tarantino recommends!So, if you thought this film might have great action, forget it. Martial arts fighting? No. A decent story? Uh uh. Nice shots of the mountains at the end? Yes."
    },
    {
      "username": "imdb-19548",
      "userUrl": "https://www.imdb.com/user/ur17141012",
      "reviewLink": "https://www.imdb.com/review/rw1753806",
      "warningSpoilers": false,
      "date": "27 October 2007",
      "rate": "10",
      "helpful": "40 out of 71 found this helpful.",
      "title": "Absolutely superb",
      "content": "I can't remember the last time I enjoyed a film as much as this one.The key premise is original, which is rare enough by itself, and when you add to that some good writing you get a great film.There are some deliberately hammed up comic moments to lighten the mostly very dark mood of the film and these are genuinely very funny.The action is often over the top, but not in a gory way, and it is interesting to watch the story unfold with the viewer having no more idea of what is happening and why than the protagonist.The pace is quick enough that you never get bored and the ending is dark and nasty and twisted and surprising.There is nothing bad I can say about the film."
    },
    {
      "username": "hakapes",
      "userUrl": "https://www.imdb.com/user/ur3100445",
      "reviewLink": "https://www.imdb.com/review/rw1040625",
      "warningSpoilers": true,
      "date": "16 March 2005",
      "rate": "4",
      "helpful": "474 out of 940 found this helpful.",
      "title": "Violence without sense",
      "content": "Fortunately, I haven't seen this film in a movie, big screen, just on a small screen on video. I doubt that I would have been able to sit through the film in a cinema and watch all the violence present in the film. After watching the first 30 minutes, I became both disappointed and curious.Disappointed because of the hard to follow story line, the hardly understandable screens, the huge amount of aggression - I still don't know why I had been shown the Daesu (main character) pulling out raw the teeth of another person, his beastliness on women, him cutting out his tongue. And also curious, to see what will the film say as a conclusion, what is the ending summary of all this brutality.Unfortunately, though the movie was not boring, I didn't get any answer to all these cruelty that I had to watch from the beginning to the end. To my opinion, if you want blood and want to laugh, there is Kill Bill 1-2, if you want blood with more meaning, you can take any recent war movie, and if you want an Eastern movie, there are much better titles out there. Afterwards I will take the ratings from the Cannes film festival with more precaution, as while Oldboy got a lot of praise from the jury, it had not much to say to me and had only 4/10 on my scale.I am hungry to see something beautiful, harmonious, with true feelings and a clear message."
    },
    {
      "username": "sqreader",
      "userUrl": "https://www.imdb.com/user/ur7568757",
      "reviewLink": "https://www.imdb.com/review/rw1561884",
      "warningSpoilers": false,
      "date": "2 January 2007",
      "rate": "9",
      "helpful": "515 out of 772 found this helpful.",
      "title": "Absolutely Sublime.......................................................",
      "content": "I've scored this a 9 but I think I may have been a little harsh! I have just read a review that says the reviewer cannot understand the hype. I can see no hype. Everything the film promised and more was delivered. This is a truly wonderful film. It is beautifully acted, brutally and painstakingly directed and as good a display of raw emotion as I have witnessed in any language. The story is gripping, the characters believable and well rounded, the emotion human and the feeling I was left with at the end of the film is one of awe. And that was after I had watched it twice. Honestly, this is a truly, truly wonderful film. Do not miss it under any circumstances!"
    },
    {
      "username": "TedStixonAKAMaximumMadness",
      "userUrl": "https://www.imdb.com/user/ur4669024",
      "reviewLink": "https://www.imdb.com/review/rw2568951",
      "warningSpoilers": false,
      "date": "17 February 2012",
      "rate": "10",
      "helpful": "16 out of 28 found this helpful.",
      "title": "Park Chan-Wook's Masterful \"Oldboy\" is a Tour-De-Force of storytelling! My favorite film of all time!",
      "content": "I just recently noticed that I have written 99 reviews on IMDb since joining in 2005. And I have decided, in honor of my 100th review, to tackle my favorite film- a Korean release from 2003, directed by the masterful Park Chan-Wook. I am speaking of course, of the controversial and amazingly elegant film \"Oldboy.\"Based loosely upon a Japanese Manga, Chan-Wook's \"Oldboy\" stars the amazing Choi Min-Sik as Oh Dae-Su, a drunk businessman in Korea. The film opens with his abduction from public, as he is mysteriously placed in a dark, dingy building, where criminals pay to have people held captive. Dae-Su is locked in the hotel-like room, being fed daily and only having a TV to keep him company, for 15 years. One day he learns on a news report that his wife was found murdered, and he later learns that his young daughter was sent to adoptive parents out of the country. Over time, he becomes depressed, angry, and eventually empty. He begins to train himself to fight, plotting to escape and seek vengeance. Then, all of the sudden, he awakens one day to find that he has been set free... given money, a suit and a cellphone. A taunting phone call from the one who ordered his captivity ensures that Dae-Su will stop at nothing to get his revenge.He is joined by Mi-Do (Kang Hye-jeong), a beautiful and feisty young chef and his old friend No Joo-hwan (Ji Dae-Han), whom try to assist him as he solves the mysteries surround why he was imprisoned. He also does eventually encounter the man who ordered his capture- a wealthy businessman who lives in a towering skyscraper named Lee Woo-jin (played by Yoo Ji-tae), though the encounter only raises the stakes- Dae-su cannot kill him, for he will kill himself first to rob Dae-su of his revenge if he tries... And now, Dae-su only has five days to solve the mystery, or else Woo-jin will kill Mi-do, whom Dae-su has began to fall for.The acting is superb, especially from our leads Choi Min-sik and Yoo Ji-tae. Both deliver astounding and detailed performances. Choi Min-sik is sympathetic yet at the same time frightening and unstable... you will root for him while fearing him. And Yoo Ji-tae is incredible as our villain, who is oddly likable and charming despite his cruel and often evil nature, much in the same way Hannibal Lector was in \"Silence of the Lambs\", and he plays the role with much joy and delight. Both were chilling.Supporting roles were all well-played. Kang Hye-jeong and Ji Dae-han were both phenomenal, and all other secondary characters were well-played. (Particularly funny is Oh Dal-su as \"Mr. Park\", the nasty little jerk who runs the building where Dae-su was imprisoned. He's the sort of guy who would double-cross his mother for a nickle, and he's a lot of fun to watch.)Park Chan-Wooks direction is what really, truly elevates this film to unknown bounds, though. Chan-Wook has a poetry and a distinctive, sharp visual sense to his camera-work. Everything is perfectly deliberate and perfectly fine-tuned. His choice of colors, textures and patterns also set a marvelous mood. This is one of those films where even if muted, the visual tell the story just as much as the dialog. Everything is perfectly planned out- right down to the wallpaper on the walls and the tiniest prop. (It's even in the making-of.) Chan-Wook's visual sensibility and ability to communicate his ideas with the actors is the closest to perfection as is obtainable. He is truly a master of film.The script is very tight, dare I say, even flawless. It all fits together like an enormous jigsaw puzzle, and each piece is important. The few action sequences are amazing and gritty, the music is perfectly implemented to compliment the story. The many twists and turns the plot takes are breathtaking, and you will leave this film feeling touched and disturbed. It gets under your skin and infects you. You will not forget this movie! This is truly an amazing film. I usually try to find something negative to mention in each of my reviews, but here... I just can't.\"Oldboy\" is a 10 out of 10. It is as close to perfection as a film can get."
    },
    {
      "username": "atkinsonlouise-73873",
      "userUrl": "https://www.imdb.com/user/ur73989318",
      "reviewLink": "https://www.imdb.com/review/rw8515996",
      "warningSpoilers": true,
      "date": "5 September 2022",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "A true masterpiece!",
      "content": "Man this film is good. Having watched the remake from 2013 first, I finally watched the original and man it's streets ahead of the Spike Lee version. I already knew the plot, but it's told so much better here with a more realistic feel that still keeps the sickening nature of the plot I know. Also the ending is so much better. What sells it, is the chemistry between Choi Min-sik and Kang Hye-jung who feel like they genuinely feel the way they do for one another. Also, Yoo Ji-tae is a phenomenal villain who is cold, calculated and calm. The other standouts are the shots, man they're creative and iconic, showing the directors vision to a tee. Also the soundtrack is weird and cool, mixing European music with Wild West stuff. A fabulous and creepy movie that truly stands out and I can't fault."
    },
    {
      "username": "Angelus2",
      "userUrl": "https://www.imdb.com/user/ur8131454",
      "reviewLink": "https://www.imdb.com/review/rw1814427",
      "warningSpoilers": true,
      "date": "5 February 2008",
      "rate": "8",
      "helpful": "14 out of 24 found this helpful.",
      "title": "What would you do?",
      "content": "A man is imprisoned for 15 years and is released; now he must find out why he was imprisoned.The film has some realistic and gritty fight scenes as well as a very strange yet alluring special effects; it is brilliantly done and the lead actor is fantastic at portraying the conflicted individual.The film is a shocking to say the least, the end will have you squirming as the truth is revealed about his lover and how far a vengeful enemy will go to destroy his already chaos filled existence.The fight scene in the long hall is still the main attraction though as he hammers and punches his way through endless numbers of enemies; it is beautifully shot and is definitely a must see."
    }
  ],
  "errorMessage": ""
}