{
  "imDbId": "tt0347149",
  "title": "Howl's Moving Castle",
  "fullTitle": "Howl's Moving Castle (2004)",
  "type": "Movie",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "Howl's Moving Castle (film)",
  "url": "https://en.wikipedia.org/wiki/Howl%27s_Moving_Castle_(film)",
  "plotShort": {
    "plainText": "Howl's Moving Castle (Japanese: ハウルの動く城, Hepburn: Hauru no Ugoku Shiro) is a 2004 Japanese animated fantasy film written and directed by Hayao Miyazaki. It is loosely based on the 1986 novel of the same name by British author Diana Wynne Jones. The film was produced by Toshio Suzuki, animated by Studio Ghibli and distributed by Toho. The Japanese voice cast featured Chieko Baisho and Takuya Kimura, while the English dub version starred Jean Simmons, Emily Mortimer, Lauren Bacall, Christian Bale, Josh Hutcherson and Billy Crystal. The film is set in a fictional kingdom where both magic and early twentieth-century technology are prevalent, against the backdrop of a war with another kingdom. It tells the story of Sophie, a young milliner who is turned into an elderly woman by a witch who enters her shop and curses her. She encounters a wizard named Howl and gets caught up in his resistance to fighting for the king.\r\nInfluenced by Miyazaki's opposition to the United States' invasion of Iraq in 2003, the film contains strong anti-war themes. Miyazaki stated that he \"had a great deal of rage\" about the Iraq war, which led him to make a film which he felt would be poorly received in the United States. It also explores the theme of old age, depicting age positively as something which grants the protagonist freedom. The film contains feminist elements as well, and carries messages about the value of compassion. In 2013, Miyazaki said Howl's Moving Castle was his favorite creation, explaining, \"I wanted to convey the message that life is worth living, and I don't think that's changed.\" The film is significantly thematically different from the novel; while the novel focuses on challenging class and gender norms, the film focuses on love, personal loyalty and the destructive effects of war.\r\nHowl's Moving Castle premiered at the 61st Venice International Film Festival on 5 September 2004, and was theatrically released in Japan on 20 November 2004. It went on to gross $190 million in Japan and $236 million worldwide, making it one of the most commercially successful Japanese films in history. The film received critical acclaim, with particular praise toward its visuals and Miyazaki's presentation of the themes. It was nominated for the Academy Award for Best Animated Feature at the 78th Academy Awards, but lost to Wallace & Gromit: The Curse of the Were-Rabbit, in 2006, and won several other awards, including four Tokyo Anime Awards and a Nebula Award for Best Script.",
    "html": "<p>Howl's Moving Castle (Japanese: ハウルの動く城, Hepburn: Hauru no Ugoku Shiro) is a 2004 Japanese animated fantasy film written and directed by Hayao Miyazaki. It is loosely based on the 1986 novel of the same name by British author Diana Wynne Jones. The film was produced by Toshio Suzuki, animated by Studio Ghibli and distributed by Toho. The Japanese voice cast featured Chieko Baisho and Takuya Kimura, while the English dub version starred Jean Simmons, Emily Mortimer, Lauren Bacall, Christian Bale, Josh Hutcherson and Billy Crystal. The film is set in a fictional kingdom where both magic and early twentieth-century technology are prevalent, against the backdrop of a war with another kingdom. It tells the story of Sophie, a young milliner who is turned into an elderly woman by a witch who enters her shop and curses her. She encounters a wizard named Howl and gets caught up in his resistance to fighting for the king.</p><p>Influenced by Miyazaki's opposition to the United States' invasion of Iraq in 2003, the film contains strong anti-war themes. Miyazaki stated that he \"had a great deal of rage\" about the Iraq war, which led him to make a film which he felt would be poorly received in the United States. It also explores the theme of old age, depicting age positively as something which grants the protagonist freedom. The film contains feminist elements as well, and carries messages about the value of compassion. In 2013, Miyazaki said Howl's Moving Castle was his favorite creation, explaining, \"I wanted to convey the message that life is worth living, and I don't think that's changed.\" The film is significantly thematically different from the novel; while the novel focuses on challenging class and gender norms, the film focuses on love, personal loyalty and the destructive effects of war.</p><p>Howl's Moving Castle premiered at the 61st Venice International Film Festival on 5 September 2004, and was theatrically released in Japan on 20 November 2004. It went on to gross $190 million in Japan and $236 million worldwide, making it one of the most commercially successful Japanese films in history. The film received critical acclaim, with particular praise toward its visuals and Miyazaki's presentation of the themes. It was nominated for the Academy Award for Best Animated Feature at the 78th Academy Awards, but lost to Wallace & Gromit: The Curse of the Were-Rabbit, in 2006, and won several other awards, including four Tokyo Anime Awards and a Nebula Award for Best Script.</p>"
  },
  "plotFull": {
    "plainText": "Howl's Moving Castle (Japanese: ハウルの動く城, Hepburn: Hauru no Ugoku Shiro) is a 2004 Japanese animated fantasy film written and directed by Hayao Miyazaki. It is loosely based on the 1986 novel of the same name by British author Diana Wynne Jones. The film was produced by Toshio Suzuki, animated by Studio Ghibli and distributed by Toho. The Japanese voice cast featured Chieko Baisho and Takuya Kimura, while the English dub version starred Jean Simmons, Emily Mortimer, Lauren Bacall, Christian Bale, Josh Hutcherson and Billy Crystal. The film is set in a fictional kingdom where both magic and early twentieth-century technology are prevalent, against the backdrop of a war with another kingdom. It tells the story of Sophie, a young milliner who is turned into an elderly woman by a witch who enters her shop and curses her. She encounters a wizard named Howl and gets caught up in his resistance to fighting for the king.\r\nInfluenced by Miyazaki's opposition to the United States' invasion of Iraq in 2003, the film contains strong anti-war themes. Miyazaki stated that he \"had a great deal of rage\" about the Iraq war, which led him to make a film which he felt would be poorly received in the United States. It also explores the theme of old age, depicting age positively as something which grants the protagonist freedom. The film contains feminist elements as well, and carries messages about the value of compassion. In 2013, Miyazaki said Howl's Moving Castle was his favorite creation, explaining, \"I wanted to convey the message that life is worth living, and I don't think that's changed.\" The film is significantly thematically different from the novel; while the novel focuses on challenging class and gender norms, the film focuses on love, personal loyalty and the destructive effects of war.\r\nHowl's Moving Castle premiered at the 61st Venice International Film Festival on 5 September 2004, and was theatrically released in Japan on 20 November 2004. It went on to gross $190 million in Japan and $236 million worldwide, making it one of the most commercially successful Japanese films in history. The film received critical acclaim, with particular praise toward its visuals and Miyazaki's presentation of the themes. It was nominated for the Academy Award for Best Animated Feature at the 78th Academy Awards, but lost to Wallace & Gromit: The Curse of the Were-Rabbit, in 2006, and won several other awards, including four Tokyo Anime Awards and a Nebula Award for Best Script.\r\nPlot\r\nSophie, a young milliner and eldest of three sisters, encounters a wizard named Howl on her way to visit her sister Lettie. Upon returning home, she meets the Witch of the Waste, who transforms her into a 90-year-old woman. Seeking to break the curse, Sophie leaves home and sets off through the countryside. She meets a living scarecrow, whom she calls \"Turnip Head\". He leads her to Howl's moving castle where she enters without invitation. She subsequently meets Howl's young apprentice Markl and a fire demon named Calcifer, the source of the castle's magic and movement. Calcifer makes a deal with Sophie, agreeing to break her curse if she breaks his link with Howl. When Howl appears, Sophie announces that she has \"hired herself\" as a cleaning lady.\r\nMeanwhile, Sophie's nation is caught up in a war with a neighboring kingdom, which is searching for its missing prince. The King summons Howl to fight in the war. However, Howl decides to send Sophie to the King, under the pretense of being his mother, to tell him that Howl is too much of a coward to fight. Before leaving, he gives Sophie a charmed ring that leads her to Calcifer and guarantees her safety. Sophie meets Suliman, the king's head sorceress, and also the Witch of the Waste, whom Suliman punishes by draining all of her power and reverting her to her true age, that of a harmless old woman. Suliman warns Sophie that Howl will meet the same fate if he does not fight for the king. Howl then arrives to rescue Sophie. Suliman tries to trap him by turning him into a monster, but with Sophie's help he remembers himself and just barely avoids death. The duo escapes along with the former Witch of the Waste and Suliman's dog Heen. In the meantime, soldiers from each kingdom break into the homes of both Jenkins and Pendragon (Howl's aliases in those kingdoms). However, the men only find an empty courtyard and warehouse, as the castle's magic nature allows travel between four separate residences.\r\nSophie learns that Howl's life is somehow bound to Calcifer's and that Howl has been transforming into a bird-like creature to interfere with both sides in the war, but each transformation makes it more difficult for him to return to human form. Howl then has the castle magically linked to Sophie's home, parking the castle itself on the town's outskirts. A few days later, the town is bombed by enemy aircraft and Suliman's henchmen attack the house and Sophie's hat shop. Howl heads out to protect the group. Sophie then moves everyone out of the house and removes Calcifer from the fireplace, which collapses the castle. The Witch of the Waste realizes that Calcifer has Howl's heart and grabs the fire demon, setting herself on fire. Sophie panics and pours water onto the Witch, which douses Calcifer. The remainder of the castle then splits in two; Sophie falls down a chasm and is separated from the group.\r\nFollowing the charmed ring, Sophie wanders into a scene from the past, where she sees a young Howl catch a falling star – Calcifer – and gives him his heart. Sophie calls for them to find her in the future as she is teleported away. She returns to the present, finds Howl, and they reunite with the others. The Witch returns Howl's heart, and Sophie places it back inside Howl, reviving him and freeing Calcifer, though he decides to stay. Sophie's curse is broken, though her hair remains white. After she kisses Turnip Head on the cheek, he returns to human form revealing himself to be Justin, the missing prince from the enemy kingdom. He reveals that only his true love's kiss can break his curse. After seeing Sophie's affection lies with Howl, he promptly heads for home to cease the war, but promises he will see them again. Suliman, watching through a crystal globe, also decides to end the war. Sometime later, bombers fly under dark skies over a recovered and green countryside headed to another war, while Sophie, Howl, and the others travel in the opposite direction in a new flying castle.\r\nVoice cast\r\nThemes\r\nPacifism\r\nHowl's Moving Castle contains strong anti-war themes, influenced by Miyazaki's distaste for the 2003 Iraq War. When he received an Oscar for Spirited Away, he said that he \"had a great deal of rage about. So felt some hesitation about the award.\" Miyazaki identifies as a pacifist. On the eve of the Iraq War, Miyazaki decided to make a film that he felt would be poorly received in the United States. Despite the film's success in that country, literary scholar Dani Cavallaro stated that Miyazaki was able to \"create a film which ought, in principle, to have caused a certain unease among American audiences.\" In the movie, Madame Suliman appears to have only sadistic motivations for creating conflict, and despite being omniscient, is unable to recognize the idiocy of the war until the very end of the story. This reflects Miyazaki's desire to show real-world conflicts as also being somewhat arbitrary and fueled by the desires of capricious people. Cavallaro stated that the depiction of the war carried \"an unmistakable bitter taste.\" She also writes that the military presence and warfare was highlighted in the film. From the early concept sketches military elements were emphasized, and when the film shows the bustling commercial district the soldiers in uniforms stand out intentionally.\r\nThe universe of Howl's Moving Castle is depicted as not having clear-cut villains and heroes; instead, the characters are complex, and even those that are initially portrayed in a negative light, such as Howl, are shown as capable of change. Matt Kimmich has stated, however, that the simplistic message of the film is that \"war is bad.\" A scene where Sophie is standing in a beautiful field of flowers is interrupted by a war machine, \"a finger accusing empire as the destroyer of peace.\" This portrayal is in strong contrast to other Miyazaki films like Princess Mononoke, which criticizes military conflict in a more nuanced manner. Andrew Osmond stated that \"Howl's pure-hearted anti-war stance is presented as nihilism with no alternative as he fights forces from each side and becomes the worst terror of all,\" in the form of the monstrous bird. By transforming into the bird, Howl risks losing his own humanity; Calcifer comments at one point that he will soon not be able to return to human form. In contrast, Ashitaka in Princess Mononoke fights the demonic sickness with which he is afflicted, and tries to negotiate a peace between the two sides. Osmond states that both films also point out the limits of masculinity, as exemplified by Howl and Ashitaka.\r\nFlight and critique of modernity\r\nLike several other Miyazaki films, Howl's Moving Castle reflects the director's love of flying. Aircraft of inventive design appear in the film, and Howl frequently transforms into a bird. Miyazaki examines flight as a theme most directly in the later film The Wind Rises. Miyazaki stated that he was attracted to military aircraft as a child, but that he grew to detest them because of the destructive purpose for which they are created. Thus Howl's Moving Castle contains images both of aircraft shown as harmless and beautiful, and large military craft depicted as ugly and destructive. Cavallaro writes that Miyazaki wants to \"portray flight as an object of admiration and awe,\" but that he is not \" to its abuse by unscrupulous strategists and rulers.\"\r\nThe nuanced view of flight is part of Miyazaki's broader critique of modern society and technology. Margaret Talbot writes that in person, Miyazaki exhibits \"a profound dissatisfaction with modern life,\" particularly with the effects of technology and a disconnection from nature. Many of his films depict technological hubris as among the roots of evil. The battleships which are seen moving over the landscape are depicted as \"gleaming with modernity and parading righteousness,\" but are then shown to be highly destructive. In contrast, the semi-organic castle demonstrates \"Miyazaki’s Taoist presentation of industrialism needing to be aligned with nature\" according to Carl and Garrath Wilson. Anthony Lioi writes that Miyazaki often depicts beautiful scenes in contrast to those containing symbols of modernity, such as the scene where Sophie's reverie is interrupted by a war machine. This contrast is part of an ecological criticism of modernity, but Miyazaki also offers an alternative, in the form of beautiful natural scenery.\r\nOld age and compassion\r\nMiyazaki stated that an attractive aspect of the story of Howl's Moving Castle was the relatively positive light it shed on growing old. When Sophie becomes old as a result of the witch's spell, she also feels more able to speak her mind. According to Miyazaki, old women are only infrequently allowed to dominate the screen as in Howl's Moving Castle, which made it a risky concept. Elizabeth Parsons stated that the film disrupts the stereotype of \"aged unattractiveness,\" when the artificially aged Sophie manages to rescue two attractive men (who come to love her) and to unintentionally end the war in her country. Sophie's actions are those usually associated with grandmothers, such as being kind and nurturing to those around her, and engaging in housework; however, these actions are depicted as being powerful and heroic. Sophie is one of several strong female protagonists in Miyazaki's films. According to Parsons, this gives the film a feminist aspect as well. Additionally, even though Sophie manages to make her presence in the castle legitimate by claiming to be a cleaning lady, the film goes on to show that the housework is equitably distributed, strengthening its feminist aspect.\r\nIn 2013, Miyazaki stated that Howl's Moving Castle was his favorite creation, and explained his choice by saying \"I wanted to convey the message that life is worth living, and I don't think that's changed.\" In the film, Sophie is shown to overcome extreme challenges by learning to put the well-being of those she cares about above her own self-interest, a quality which Miyazaki refers to as devotion. Several of the protagonists in Miyazaki's films, such as Ashitaka and San in Princess Mononoke and Sheeta and Pazu in Castle in the Sky learn to survive by learning the same lesson. Cavallaro states that Miyazaki spreads this moral through the entire film, to convey human beings' ability to be compassionate, such as when the scarecrow holds an umbrella over Sophie's head when it rains. Over the course of the film, Howl, its most vain and selfish character, also learns to put others before himself. When Madame Suliman returns the Witch of the Waste to her true form as a decrepit old woman, Sophie takes her in and cares for her, despite the witch being responsible for Sophie's curse, thus strongly demonstrating the idea of compassion. The witch then nearly destroys Howl through her selfish behavior, but also helps save the castle at the end. Parsons writes that \"In Miyazaki's balancing act, old women can be powerful and weak, positive and negative, nurturing and selfish, maligned and loved; in short, they can not be simply categorized or stereotyped, and they can not be dismissed as fantasy malefactors embodied by evil witches.\" They are also given a lot of space in the film as active characters, something not commonly found in western movies.\r\nProduction\r\nIn September 2001, Studio Ghibli announced the production of two films. The first would become The Cat Returns and the second was an adaptation of Diana Wynne Jones' novel, Howl's Moving Castle. A rumor persists that Miyazaki had an idea to do Howl's Moving Castle during a visit to Strasbourg Christmas market. Toshio Suzuki, who produced Howl's Moving Castle, stated that Miyazaki was inspired to make the film when he read Jones' novel, and was struck by the image of a castle moving around the countryside. The novel does not explain how the castle moved, and Miyazaki was interested in figuring out how the castle might move, which led to the image of a castle on chicken legs. The complex moving castle changes and rearranges itself several times throughout the movie in response to Howl's eccentricity and the various situations. The basic structure of the castle consists of more than 80 elements including turrets, a wagging tongue, cogwheels and chicken legs, that were rendered as digital objects.\r\nMamoru Hosoda of Toei Animation was originally selected to direct the film, but quit the project after Studio Ghibli's executives rejected many of his concept ideas. The film was shelved until Miyazaki took over. The project resumed with production in February 2003. It was scheduled to be completed in the spring of 2004, and released in the summer of that year.\r\nMiyazaki went to Colmar and Riquewihr in Alsace, France, to study the architecture and the surroundings for the setting of the film. Additional inspiration came from the concepts of future technology in Albert Robida's work. Commentators have stated that Miyazaki's imagery was influenced by his fondness for the \"illusion art\" of 19th century Europe. Suzuki stated that unlike many Western films, in which the imagery went \"from the general the specific,\" Miyazaki employed a uniquely Japanese approach, frequently beginning with a very specific image and moving from there. However, Howl's Moving Castle, and Miyazaki films in general, have a focus on realistic imagery in a way that other anime films do not.\r\nThe film was produced digitally, but the original backgrounds were drawn by hand and painted prior to being digitized, and the characters were also drawn by hand prior to scanning them into the computer. The 1400 storyboard cuts for the film were completed on 16 January 2004. On 25 June the in-between animation was completed and checking was completed on 26 June. Studio Ghibli used digital technology to run many copies of the still portions of a scene, a process which avoids inconsistencies between various still frames, but can create an impression of artificiality. Therefore, the studio chose to manually retouch the digitally altered images, recreating the \"feel\" of a hand-drawn image.\r\nLike with the other Studio Ghibli movies, the film was co-produced with other companies, which were Tokuma Shoten, the Nippon Television Network, Dentsu, Buena Vista Home Entertainment, Mitsubishi and Toho.\r\nComparisons between film and novel\r\nThe film has several differences from the novel, partly due to the different requirements of the two media. Diana Wynne Jones' novel has a very large cast of characters, and several plot threads that were too complex to be transferred into the film. As a result, characters such as Sophie's second sister Martha are left out, as is the plot thread involving Markl (who is called Michael in the novel, and depicted as an adolescent, rather than as a young boy) courting her. Jones discussed the film with Studio Ghibli representatives, but did not have any input or involvement in the production of the film. Miyazaki traveled to England in the summer of 2004 to give Jones a private viewing of the finished film. She has been quoted as saying \"It's fantastic. No, I have no input—I write books, not films. Yes, it will be different from the book—in fact it's likely to be very different, but that's as it should be. It will still be a fantastic film.\"\r\nThe novel depicts Howl's castle as a tall, dark and sinister wizard's tower, very different from the complex image in the film. The film's castle may be seen as a parody of the machines seen in the movie, driven both by steam-engines and by magic. In the film, it is a \"rotund collage of chimneys, roofs, steam pipes, and other odd appendages, borne along on mechanized bird legs\" that is similar to Baba Yaga's hut in the popular fairy tale. It is vaguely organic, and almost depicted as a life-form. Similarly, Calcifer is a demonic figure in the book, as compared to the \"endearing\" persona and image that he has in the film. Both film and novel try to render fantastic elements as mundane and ordinary things. Although they are set in a fantasy universe, the characters are often shown performing routine tasks, like cooking breakfast or washing up, in contrast to the heroic actions typical of a fantasy universe. In the novel, Jones disrupts the fantasy-world setting by including scenes in which the characters travel to the real-world Wales. The movie, however, avoids this digression, and maintains a constant setting.\r\nMiyazaki's biggest addition to the plot of the book was the use of the war as a large part of the plot. In the book, the war is only tangentially referred to; the king orders Howl to find the king's missing brother Justin, because Justin's military skills are needed for a forthcoming war. Howl's frequent disappearances are because of his womanizing habits, which makes Sophie see him as a superficial and cowardly person. In the film, however, Howl disappears in order to transform into a giant bird and disrupt the battle plans of both armies.\r\nThe roles of several characters also differ between novel and film due to this plot change. The Witch of the Waste is the chief antagonist of the book, whereas in the film she is reduced by Madame Suliman's magic to an ultimately harmless old woman who evokes sympathy in the audience and in Sophie. In contrast, the film conflates the novel's two characters of Mrs. Penstemmon and the wizard Suliman into Madame Suliman. Although Suliman comes closest to being a traditional villain in the film, she is shown as having ambiguous motivations, and reviewers have stated that the real villain is war itself. Howl loses the \"rakish\" womanizing aspect that was a significant part of his character in the novel. In contrast, Sophie becomes a more conventional figure in the film; she is less grumpy and outspoken, and demonstrates her love for Howl earlier and more explicitly. The storyline in the novel of Sophie being a powerful sorceress in her own right is muted in the film, although she is still shown to have control over her curse.\r\nThe thematic focus of the story also differs between the novel and the film. Reviewer Antonia Levi wrote that the experience of watching the film was similar to reading high quality fan fiction; although the characters and the setting were the same, the story was different. Although in both cases the story begins with Sophie being a prisoner of her circumstances and of social norms, the challenges she faces are slightly different. Levi said that \"Jones uses Sophie, Howl, and Calcifer in a fairytale format to tell a story about challenging class and gender expectations, Miyazaki uses the same characters to tell a story about personal loyalty, love, and war.\"\r\nMusic\r\nThe score was composed and conducted by Joe Hisaishi, and performed by the New Japan Philharmonic. The soundtrack CD was first released on 19 November 2004 by Tokuma Japan Communications. Hisaishi also composed and conducted a Howl's Moving Castle: Symphony Suite, an album published on 21 January 2004 which includes ten re-arranged pieces from the original soundtrack. He and Youmi Kimura also composed Howl's Moving Castle CD Maxi-Single, a CD single published on 27 October 2004 which includes the film's theme song, sung by Chieko Baisho (the Japanese voice actor for Sophie), its karaoke version, and a piano version of the film's main theme, \"The Merry-Go-Round of Life\".\r\nRelease and reception\r\nBox office\r\nThe film opened at the 61st Venice Film Festival in 2004, and was released in Japan on 20 November 2004. The film grossed $14.5 million in its first week of release in Japan alone. The film was distributed in Japan by Toho, and made $190,000,000 in that country. It was distributed internationally by various companies, and made approximately an additional $45,000,000 outside Japan, for a worldwide total of $235,184,110. The film was later dubbed into English under the supervision of Pete Docter of Pixar, and released in the United States by Walt Disney Pictures on 10 June 2005. It was one of the most commercially successful Japanese films ever made. Soon after its release, it became the third most financially successful film in Japan, behind Titanic and Spirited Away.\r\nHome media\r\nOn home video, Howl's Moving Castle sold 2.7 million DVD units in Japan as of May 2007, and grossed over $18 million from Blu-ray and DVD sales in the United States as of April 2022. It was released in the United States on DVD on 7 March 2006 and on Blu-ray by Walt Disney Studios Home Entertainment on 21 May 2013. GKIDS re-released the film on Blu-ray and DVD on 17 October 2017.\r\nIn the United Kingdom, the film's Studio Ghibli anniversary release was 2015's eighth best-selling foreign language film on home video, and fifth best-selling Japanese film (below four other Studio Ghibli anime films). It was later 2018's fourth best-selling foreign language film in the UK (below the Japanese films My Neighbor Totoro, Your Name and Blade of the Immortal).\r\nCritical response\r\nThe review aggregator website Rotten Tomatoes reports an 87% approval rating based on 181 reviews, with an average rating of 7.47/10. The website's critical consensus reads, \"Exquisitely illustrated by master animator Miyazaki, Howl's Moving Castle will delight children with its fantastical story and touch the hearts and minds of older viewers as well.\" The film also holds an 80/100 average on Metacritic, based on 40 reviews, indicating \"generally favorable reviews\".\r\nUSA Today critic Claudia Puig gave the film a positive review, praising it for its ability to blend \"a childlike sense of wonder with sophisticated emotions and motives\". Helen McCarthy in 500 Essential Anime Movies said that the natural world was \"beautifully represented\", with \"some absolutely breathtaking mountains and lakeside landscapes\". She also praised the design of the castle and added that Miyazaki added his own themes to the film: \"man's relationship to nature, the futility of war, and the joy of flight\". Joe Morgenstern of The Wall Street Journal called the film \"a moveable feast of delights\". Richard Corliss of Time wrote, \"Palaces and shimmering lakes, warplanes and fire sprites all come to life at the breath of Miyazaki's graphic genius.\" Writing for The Boston Globe, Ty Burr said, \"At its best, 'Howl's Moving Castle' offers a rich fantasy of adolescent escape, of romance in the old and epic sense. At its worst, it's the most amazing 12-course meal you can't bring yourself to finish.\" A.O. Scott of The New York Times wrote, \"Admirers of work, which is wildly imaginative, emotionally intense and surpassingly gentle, will find much to appreciate in this film because it demonstrates, once again, his visual ingenuity and his sensitivity as a storyteller. For newcomers to his world, \"Howl's Moving Castle\" is a fitting introduction to one of modern cinema's great enchanters.\"\r\nConversely, Roger Ebert of the Chicago Sun-Times gave the film two and a half out of four stars, and called it a \"disappointment\" compared to Miyazaki's other recent movies. Jonathan Trout of the BBC said, \"Youngsters and Miyazaki fans will coo at the world's depth and rich surreality, but opaque plotting, and a tendency to mope with Sophie whilst Howl is off affecting events let the momentum of the first act vanish into thin air.\" Writing for Salon, Stephanie Zacharek said, \"the plot of Howl's Moving Castle meanders so listlessly that its details become less and less charming. Miyazaki's storytelling style resembles that of a breathless young tot who's fearlessly exercising his newfound powers of expression.\" Stephen Hunter from The Washington Post criticized the plot of the film, saying \"There is no story, or rather, there's no force to the story, which meanders almost casually this way and that for no apparent reason.\" However, he said that the movie also empowered young women, and was \"beautiful beyond telling.\" David Rooney, writing in Variety, stated that \"the narrative motor roars ahead in the opening hour and is more erratic thereafter,\" and suggested that better translation would help. Literary scholar Matt Kimmich stated that the film came across as \"uneasy compromise between two plots and two imaginations,\" referring to Jones' original story and Miyazaki's style of animation and storytelling. However, he stated that those scenes which were not dependent either on Jones' original plot or Miyazaki's added plot threads found \"a visual humor that recalls the verbal wit and lightness of Jones's novel,\" and that the \"animation manages to free itself from the demands of the two plots—and flies.\"\r\nTop ten lists\r\nThere's a word for the kind of comic, dramatic, romantic, transporting visions Miyazaki achieves in Howl's: bliss.\r\n—Peter Travers, Rolling Stone\r\nThe film appeared on many critics' top ten lists of the best films of 2005.\r\n2nd – Ella Taylor, LA Weekly (tie)\r\n4th – Kenneth Turan, Los Angeles Times\r\n5th – Tasha Robinson, The A.V. Club\r\n6th – Lawrence Toppman, The Charlotte Observer\r\n6th – Jonathan Rosenbaum, The Chicago Reader (tie)\r\n8th – Michael Sragow, The Baltimore Sun\r\n8th – Michael Wilmington, The Chicago Tribune\r\nNA – Peter Rainer, The Christian Science Monitor (listed alphabetically)\r\nAccolades",
    "html": "<p>Howl's Moving Castle (Japanese: ハウルの動く城, Hepburn: Hauru no Ugoku Shiro) is a 2004 Japanese animated fantasy film written and directed by Hayao Miyazaki. It is loosely based on the 1986 novel of the same name by British author Diana Wynne Jones. The film was produced by Toshio Suzuki, animated by Studio Ghibli and distributed by Toho. The Japanese voice cast featured Chieko Baisho and Takuya Kimura, while the English dub version starred Jean Simmons, Emily Mortimer, Lauren Bacall, Christian Bale, Josh Hutcherson and Billy Crystal. The film is set in a fictional kingdom where both magic and early twentieth-century technology are prevalent, against the backdrop of a war with another kingdom. It tells the story of Sophie, a young milliner who is turned into an elderly woman by a witch who enters her shop and curses her. She encounters a wizard named Howl and gets caught up in his resistance to fighting for the king.</p><p>Influenced by Miyazaki's opposition to the United States' invasion of Iraq in 2003, the film contains strong anti-war themes. Miyazaki stated that he \"had a great deal of rage\" about the Iraq war, which led him to make a film which he felt would be poorly received in the United States. It also explores the theme of old age, depicting age positively as something which grants the protagonist freedom. The film contains feminist elements as well, and carries messages about the value of compassion. In 2013, Miyazaki said Howl's Moving Castle was his favorite creation, explaining, \"I wanted to convey the message that life is worth living, and I don't think that's changed.\" The film is significantly thematically different from the novel; while the novel focuses on challenging class and gender norms, the film focuses on love, personal loyalty and the destructive effects of war.</p><p>Howl's Moving Castle premiered at the 61st Venice International Film Festival on 5 September 2004, and was theatrically released in Japan on 20 November 2004. It went on to gross $190 million in Japan and $236 million worldwide, making it one of the most commercially successful Japanese films in history. The film received critical acclaim, with particular praise toward its visuals and Miyazaki's presentation of the themes. It was nominated for the Academy Award for Best Animated Feature at the 78th Academy Awards, but lost to Wallace & Gromit: The Curse of the Were-Rabbit, in 2006, and won several other awards, including four Tokyo Anime Awards and a Nebula Award for Best Script.</p><br/><h3>Plot</h3><p>Sophie, a young milliner and eldest of three sisters, encounters a wizard named Howl on her way to visit her sister Lettie. Upon returning home, she meets the Witch of the Waste, who transforms her into a 90-year-old woman. Seeking to break the curse, Sophie leaves home and sets off through the countryside. She meets a living scarecrow, whom she calls \"Turnip Head\". He leads her to Howl's moving castle where she enters without invitation. She subsequently meets Howl's young apprentice Markl and a fire demon named Calcifer, the source of the castle's magic and movement. Calcifer makes a deal with Sophie, agreeing to break her curse if she breaks his link with Howl. When Howl appears, Sophie announces that she has \"hired herself\" as a cleaning lady.</p><p>Meanwhile, Sophie's nation is caught up in a war with a neighboring kingdom, which is searching for its missing prince. The King summons Howl to fight in the war. However, Howl decides to send Sophie to the King, under the pretense of being his mother, to tell him that Howl is too much of a coward to fight. Before leaving, he gives Sophie a charmed ring that leads her to Calcifer and guarantees her safety. Sophie meets Suliman, the king's head sorceress, and also the Witch of the Waste, whom Suliman punishes by draining all of her power and reverting her to her true age, that of a harmless old woman. Suliman warns Sophie that Howl will meet the same fate if he does not fight for the king. Howl then arrives to rescue Sophie. Suliman tries to trap him by turning him into a monster, but with Sophie's help he remembers himself and just barely avoids death. The duo escapes along with the former Witch of the Waste and Suliman's dog Heen. In the meantime, soldiers from each kingdom break into the homes of both Jenkins and Pendragon (Howl's aliases in those kingdoms). However, the men only find an empty courtyard and warehouse, as the castle's magic nature allows travel between four separate residences.</p><p>Sophie learns that Howl's life is somehow bound to Calcifer's and that Howl has been transforming into a bird-like creature to interfere with both sides in the war, but each transformation makes it more difficult for him to return to human form. Howl then has the castle magically linked to Sophie's home, parking the castle itself on the town's outskirts. A few days later, the town is bombed by enemy aircraft and Suliman's henchmen attack the house and Sophie's hat shop. Howl heads out to protect the group. Sophie then moves everyone out of the house and removes Calcifer from the fireplace, which collapses the castle. The Witch of the Waste realizes that Calcifer has Howl's heart and grabs the fire demon, setting herself on fire. Sophie panics and pours water onto the Witch, which douses Calcifer. The remainder of the castle then splits in two; Sophie falls down a chasm and is separated from the group.</p><p>Following the charmed ring, Sophie wanders into a scene from the past, where she sees a young Howl catch a falling star – Calcifer – and gives him his heart. Sophie calls for them to find her in the future as she is teleported away. She returns to the present, finds Howl, and they reunite with the others. The Witch returns Howl's heart, and Sophie places it back inside Howl, reviving him and freeing Calcifer, though he decides to stay. Sophie's curse is broken, though her hair remains white. After she kisses Turnip Head on the cheek, he returns to human form revealing himself to be Justin, the missing prince from the enemy kingdom. He reveals that only his true love's kiss can break his curse. After seeing Sophie's affection lies with Howl, he promptly heads for home to cease the war, but promises he will see them again. Suliman, watching through a crystal globe, also decides to end the war. Sometime later, bombers fly under dark skies over a recovered and green countryside headed to another war, while Sophie, Howl, and the others travel in the opposite direction in a new flying castle.</p><br/><h3>Voice cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Character</th><th><span class=\"nowrap\">Japanese voice actor</span></th><th><span class=\"nowrap\">English dubbing actor</span></th></tr><tr><td>Sophie Hatter<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">ソフィー・ハッター</span></span>, <span><i lang=\"ja-Latn\">Sofī Hattā</i></span>)</span></td><td><span>Chieko Baisho</span></td><td><span>Emily Mortimer</span> <span style=\"font-size:85%;\">(young)</span><br><span>Jean Simmons</span> <span style=\"font-size:85%;\">(old)</span></td></tr><tr><td>Howl<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">ハウル</span></span>, <span><i lang=\"ja-Latn\">Hauru</i></span>)</span></td><td><span>Takuya Kimura</span></td><td><span>Christian Bale</span></td></tr><tr><td>Witch of the Waste<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">荒地の魔女</span></span>, <span><i lang=\"ja-Latn\">Arechi no Majo</i></span>)</span></td><td><span>Akihiro Miwa</span></td><td><span>Lauren Bacall</span></td></tr><tr><td>Calcifer<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">カルシファー</span></span>, <span><i lang=\"ja-Latn\">Karushifā</i></span>)</span></td><td>Tatsuya Gashuin</td><td><span>Billy Crystal</span></td></tr><tr><td>Markl<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">マルクル</span></span>, <span><i lang=\"ja-Latn\">Marukuru</i></span>)</span></td><td><span class=\"mw-redirect\">Ryūnosuke Kamiki</span></td><td><span>Josh Hutcherson</span></td></tr><tr><td>Suliman<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">サリマン</span></span>, <span><i lang=\"ja-Latn\">Sariman</i></span>)</span></td><td><span>Haruko Kato</span></td><td><span>Blythe Danner</span></td></tr><tr><td>Lettie<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">レティー</span></span>, <span><i lang=\"ja-Latn\">Retī</i></span>)</span></td><td>Yayoi Kazuki</td><td><span>Jena Malone</span></td></tr><tr><td>Honey<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">ハニー</span></span>, <span><i lang=\"ja-Latn\">Hanī</i></span>)</span></td><td>Mayuno Yasokawa</td><td><span>Mari Devon</span></td></tr><tr><td>Prince Justin / Turnip Head<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">カブ</span></span>, <span><i lang=\"ja-Latn\">Kabu</i></span>)</span></td><td><span class=\"mw-redirect\">Yō Ōizumi</span></td><td><span>Crispin Freeman</span></td></tr><tr><td>King of Ingary<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">国王</span></span>, <span><i lang=\"ja-Latn\">Kokuō</i></span>)</span></td><td><span class=\"mw-redirect\">Akio Ōtsuka</span></td><td>Mark Silverman</td></tr><tr><td>Heen<span style=\"font-weight: normal\"> (<span><span lang=\"ja\">ヒン</span></span>, <span><i lang=\"ja-Latn\">Hin</i></span>)</span></td><td>Daijiro Harada</td><td><span>Dee Bradley Baker</span><br>(uncredited)</td></tr></tbody></table><br/><h3>Themes</h3><h4>Pacifism</h4><p>Howl's Moving Castle contains strong anti-war themes, influenced by Miyazaki's distaste for the 2003 Iraq War. When he received an Oscar for Spirited Away, he said that he \"had a great deal of rage about. So felt some hesitation about the award.\" Miyazaki identifies as a pacifist. On the eve of the Iraq War, Miyazaki decided to make a film that he felt would be poorly received in the United States. Despite the film's success in that country, literary scholar Dani Cavallaro stated that Miyazaki was able to \"create a film which ought, in principle, to have caused a certain unease among American audiences.\" In the movie, Madame Suliman appears to have only sadistic motivations for creating conflict, and despite being omniscient, is unable to recognize the idiocy of the war until the very end of the story. This reflects Miyazaki's desire to show real-world conflicts as also being somewhat arbitrary and fueled by the desires of capricious people. Cavallaro stated that the depiction of the war carried \"an unmistakable bitter taste.\" She also writes that the military presence and warfare was highlighted in the film. From the early concept sketches military elements were emphasized, and when the film shows the bustling commercial district the soldiers in uniforms stand out intentionally.</p><p>The universe of Howl's Moving Castle is depicted as not having clear-cut villains and heroes; instead, the characters are complex, and even those that are initially portrayed in a negative light, such as Howl, are shown as capable of change. Matt Kimmich has stated, however, that the simplistic message of the film is that \"war is bad.\" A scene where Sophie is standing in a beautiful field of flowers is interrupted by a war machine, \"a finger accusing empire as the destroyer of peace.\" This portrayal is in strong contrast to other Miyazaki films like Princess Mononoke, which criticizes military conflict in a more nuanced manner. Andrew Osmond stated that \"Howl's pure-hearted anti-war stance is presented as nihilism with no alternative as he fights forces from each side and becomes the worst terror of all,\" in the form of the monstrous bird. By transforming into the bird, Howl risks losing his own humanity; Calcifer comments at one point that he will soon not be able to return to human form. In contrast, Ashitaka in Princess Mononoke fights the demonic sickness with which he is afflicted, and tries to negotiate a peace between the two sides. Osmond states that both films also point out the limits of masculinity, as exemplified by Howl and Ashitaka.</p><h4>Flight and critique of modernity</h4><p>Like several other Miyazaki films, Howl's Moving Castle reflects the director's love of flying. Aircraft of inventive design appear in the film, and Howl frequently transforms into a bird. Miyazaki examines flight as a theme most directly in the later film The Wind Rises. Miyazaki stated that he was attracted to military aircraft as a child, but that he grew to detest them because of the destructive purpose for which they are created. Thus Howl's Moving Castle contains images both of aircraft shown as harmless and beautiful, and large military craft depicted as ugly and destructive. Cavallaro writes that Miyazaki wants to \"portray flight as an object of admiration and awe,\" but that he is not \" to its abuse by unscrupulous strategists and rulers.\"</p><p>The nuanced view of flight is part of Miyazaki's broader critique of modern society and technology. Margaret Talbot writes that in person, Miyazaki exhibits \"a profound dissatisfaction with modern life,\" particularly with the effects of technology and a disconnection from nature. Many of his films depict technological hubris as among the roots of evil. The battleships which are seen moving over the landscape are depicted as \"gleaming with modernity and parading righteousness,\" but are then shown to be highly destructive. In contrast, the semi-organic castle demonstrates \"Miyazaki’s Taoist presentation of industrialism needing to be aligned with nature\" according to Carl and Garrath Wilson. Anthony Lioi writes that Miyazaki often depicts beautiful scenes in contrast to those containing symbols of modernity, such as the scene where Sophie's reverie is interrupted by a war machine. This contrast is part of an ecological criticism of modernity, but Miyazaki also offers an alternative, in the form of beautiful natural scenery.</p><h4>Old age and compassion</h4><p>Miyazaki stated that an attractive aspect of the story of Howl's Moving Castle was the relatively positive light it shed on growing old. When Sophie becomes old as a result of the witch's spell, she also feels more able to speak her mind. According to Miyazaki, old women are only infrequently allowed to dominate the screen as in Howl's Moving Castle, which made it a risky concept. Elizabeth Parsons stated that the film disrupts the stereotype of \"aged unattractiveness,\" when the artificially aged Sophie manages to rescue two attractive men (who come to love her) and to unintentionally end the war in her country. Sophie's actions are those usually associated with grandmothers, such as being kind and nurturing to those around her, and engaging in housework; however, these actions are depicted as being powerful and heroic. Sophie is one of several strong female protagonists in Miyazaki's films. According to Parsons, this gives the film a feminist aspect as well. Additionally, even though Sophie manages to make her presence in the castle legitimate by claiming to be a cleaning lady, the film goes on to show that the housework is equitably distributed, strengthening its feminist aspect.</p><p>In 2013, Miyazaki stated that Howl's Moving Castle was his favorite creation, and explained his choice by saying \"I wanted to convey the message that life is worth living, and I don't think that's changed.\" In the film, Sophie is shown to overcome extreme challenges by learning to put the well-being of those she cares about above her own self-interest, a quality which Miyazaki refers to as devotion. Several of the protagonists in Miyazaki's films, such as Ashitaka and San in Princess Mononoke and Sheeta and Pazu in Castle in the Sky learn to survive by learning the same lesson. Cavallaro states that Miyazaki spreads this moral through the entire film, to convey human beings' ability to be compassionate, such as when the scarecrow holds an umbrella over Sophie's head when it rains. Over the course of the film, Howl, its most vain and selfish character, also learns to put others before himself. When Madame Suliman returns the Witch of the Waste to her true form as a decrepit old woman, Sophie takes her in and cares for her, despite the witch being responsible for Sophie's curse, thus strongly demonstrating the idea of compassion. The witch then nearly destroys Howl through her selfish behavior, but also helps save the castle at the end. Parsons writes that \"In Miyazaki's balancing act, old women can be powerful and weak, positive and negative, nurturing and selfish, maligned and loved; in short, they can not be simply categorized or stereotyped, and they can not be dismissed as fantasy malefactors embodied by evil witches.\" They are also given a lot of space in the film as active characters, something not commonly found in western movies.</p><br/><h3>Production</h3><p>In September 2001, Studio Ghibli announced the production of two films. The first would become The Cat Returns and the second was an adaptation of Diana Wynne Jones' novel, Howl's Moving Castle. A rumor persists that Miyazaki had an idea to do Howl's Moving Castle during a visit to Strasbourg Christmas market. Toshio Suzuki, who produced Howl's Moving Castle, stated that Miyazaki was inspired to make the film when he read Jones' novel, and was struck by the image of a castle moving around the countryside. The novel does not explain how the castle moved, and Miyazaki was interested in figuring out how the castle might move, which led to the image of a castle on chicken legs. The complex moving castle changes and rearranges itself several times throughout the movie in response to Howl's eccentricity and the various situations. The basic structure of the castle consists of more than 80 elements including turrets, a wagging tongue, cogwheels and chicken legs, that were rendered as digital objects.</p><p>Mamoru Hosoda of Toei Animation was originally selected to direct the film, but quit the project after Studio Ghibli's executives rejected many of his concept ideas. The film was shelved until Miyazaki took over. The project resumed with production in February 2003. It was scheduled to be completed in the spring of 2004, and released in the summer of that year.</p><p>Miyazaki went to Colmar and Riquewihr in Alsace, France, to study the architecture and the surroundings for the setting of the film. Additional inspiration came from the concepts of future technology in Albert Robida's work. Commentators have stated that Miyazaki's imagery was influenced by his fondness for the \"illusion art\" of 19th century Europe. Suzuki stated that unlike many Western films, in which the imagery went \"from the general the specific,\" Miyazaki employed a uniquely Japanese approach, frequently beginning with a very specific image and moving from there. However, Howl's Moving Castle, and Miyazaki films in general, have a focus on realistic imagery in a way that other anime films do not.</p><p>The film was produced digitally, but the original backgrounds were drawn by hand and painted prior to being digitized, and the characters were also drawn by hand prior to scanning them into the computer. The 1400 storyboard cuts for the film were completed on 16 January 2004. On 25 June the in-between animation was completed and checking was completed on 26 June. Studio Ghibli used digital technology to run many copies of the still portions of a scene, a process which avoids inconsistencies between various still frames, but can create an impression of artificiality. Therefore, the studio chose to manually retouch the digitally altered images, recreating the \"feel\" of a hand-drawn image.</p><p>Like with the other Studio Ghibli movies, the film was co-produced with other companies, which were Tokuma Shoten, the Nippon Television Network, Dentsu, Buena Vista Home Entertainment, Mitsubishi and Toho.</p><br/><h3>Comparisons between film and novel</h3><p>The film has several differences from the novel, partly due to the different requirements of the two media. Diana Wynne Jones' novel has a very large cast of characters, and several plot threads that were too complex to be transferred into the film. As a result, characters such as Sophie's second sister Martha are left out, as is the plot thread involving Markl (who is called Michael in the novel, and depicted as an adolescent, rather than as a young boy) courting her. Jones discussed the film with Studio Ghibli representatives, but did not have any input or involvement in the production of the film. Miyazaki traveled to England in the summer of 2004 to give Jones a private viewing of the finished film. She has been quoted as saying \"It's fantastic. No, I have no input—I write books, not films. Yes, it will be different from the book—in fact it's likely to be very different, but that's as it should be. It will still be a fantastic film.\"</p><p>The novel depicts Howl's castle as a tall, dark and sinister wizard's tower, very different from the complex image in the film. The film's castle may be seen as a parody of the machines seen in the movie, driven both by steam-engines and by magic. In the film, it is a \"rotund collage of chimneys, roofs, steam pipes, and other odd appendages, borne along on mechanized bird legs\" that is similar to Baba Yaga's hut in the popular fairy tale. It is vaguely organic, and almost depicted as a life-form. Similarly, Calcifer is a demonic figure in the book, as compared to the \"endearing\" persona and image that he has in the film. Both film and novel try to render fantastic elements as mundane and ordinary things. Although they are set in a fantasy universe, the characters are often shown performing routine tasks, like cooking breakfast or washing up, in contrast to the heroic actions typical of a fantasy universe. In the novel, Jones disrupts the fantasy-world setting by including scenes in which the characters travel to the real-world Wales. The movie, however, avoids this digression, and maintains a constant setting.</p><p>Miyazaki's biggest addition to the plot of the book was the use of the war as a large part of the plot. In the book, the war is only tangentially referred to; the king orders Howl to find the king's missing brother Justin, because Justin's military skills are needed for a forthcoming war. Howl's frequent disappearances are because of his womanizing habits, which makes Sophie see him as a superficial and cowardly person. In the film, however, Howl disappears in order to transform into a giant bird and disrupt the battle plans of both armies.</p><p>The roles of several characters also differ between novel and film due to this plot change. The Witch of the Waste is the chief antagonist of the book, whereas in the film she is reduced by Madame Suliman's magic to an ultimately harmless old woman who evokes sympathy in the audience and in Sophie. In contrast, the film conflates the novel's two characters of Mrs. Penstemmon and the wizard Suliman into Madame Suliman. Although Suliman comes closest to being a traditional villain in the film, she is shown as having ambiguous motivations, and reviewers have stated that the real villain is war itself. Howl loses the \"rakish\" womanizing aspect that was a significant part of his character in the novel. In contrast, Sophie becomes a more conventional figure in the film; she is less grumpy and outspoken, and demonstrates her love for Howl earlier and more explicitly. The storyline in the novel of Sophie being a powerful sorceress in her own right is muted in the film, although she is still shown to have control over her curse.</p><p>The thematic focus of the story also differs between the novel and the film. Reviewer Antonia Levi wrote that the experience of watching the film was similar to reading high quality fan fiction; although the characters and the setting were the same, the story was different. Although in both cases the story begins with Sophie being a prisoner of her circumstances and of social norms, the challenges she faces are slightly different. Levi said that \"Jones uses Sophie, Howl, and Calcifer in a fairytale format to tell a story about challenging class and gender expectations, Miyazaki uses the same characters to tell a story about personal loyalty, love, and war.\"</p><br/><h3>Music</h3><p>The score was composed and conducted by Joe Hisaishi, and performed by the New Japan Philharmonic. The soundtrack CD was first released on 19 November 2004 by Tokuma Japan Communications. Hisaishi also composed and conducted a Howl's Moving Castle: Symphony Suite, an album published on 21 January 2004 which includes ten re-arranged pieces from the original soundtrack. He and Youmi Kimura also composed Howl's Moving Castle CD Maxi-Single, a CD single published on 27 October 2004 which includes the film's theme song, sung by Chieko Baisho (the Japanese voice actor for Sophie), its karaoke version, and a piano version of the film's main theme, \"The Merry-Go-Round of Life\".</p><br/><h3>Release and reception</h3><h4>Box office</h4><p>The film opened at the 61st Venice Film Festival in 2004, and was released in Japan on 20 November 2004. The film grossed $14.5 million in its first week of release in Japan alone. The film was distributed in Japan by Toho, and made $190,000,000 in that country. It was distributed internationally by various companies, and made approximately an additional $45,000,000 outside Japan, for a worldwide total of $235,184,110. The film was later dubbed into English under the supervision of Pete Docter of Pixar, and released in the United States by Walt Disney Pictures on 10 June 2005. It was one of the most commercially successful Japanese films ever made. Soon after its release, it became the third most financially successful film in Japan, behind Titanic and Spirited Away.</p><h4>Home media</h4><p>On home video, Howl's Moving Castle sold 2.7 million DVD units in Japan as of May 2007, and grossed over $18 million from Blu-ray and DVD sales in the United States as of April 2022. It was released in the United States on DVD on 7 March 2006 and on Blu-ray by Walt Disney Studios Home Entertainment on 21 May 2013. GKIDS re-released the film on Blu-ray and DVD on 17 October 2017.</p><p>In the United Kingdom, the film's Studio Ghibli anniversary release was 2015's eighth best-selling foreign language film on home video, and fifth best-selling Japanese film (below four other Studio Ghibli anime films). It was later 2018's fourth best-selling foreign language film in the UK (below the Japanese films My Neighbor Totoro, Your Name and Blade of the Immortal).</p><h4>Critical response</h4><p>The review aggregator website Rotten Tomatoes reports an 87% approval rating based on 181 reviews, with an average rating of 7.47/10. The website's critical consensus reads, \"Exquisitely illustrated by master animator Miyazaki, Howl's Moving Castle will delight children with its fantastical story and touch the hearts and minds of older viewers as well.\" The film also holds an 80/100 average on Metacritic, based on 40 reviews, indicating \"generally favorable reviews\".</p><p>USA Today critic Claudia Puig gave the film a positive review, praising it for its ability to blend \"a childlike sense of wonder with sophisticated emotions and motives\". Helen McCarthy in 500 Essential Anime Movies said that the natural world was \"beautifully represented\", with \"some absolutely breathtaking mountains and lakeside landscapes\". She also praised the design of the castle and added that Miyazaki added his own themes to the film: \"man's relationship to nature, the futility of war, and the joy of flight\". Joe Morgenstern of The Wall Street Journal called the film \"a moveable feast of delights\". Richard Corliss of Time wrote, \"Palaces and shimmering lakes, warplanes and fire sprites all come to life at the breath of Miyazaki's graphic genius.\" Writing for The Boston Globe, Ty Burr said, \"At its best, 'Howl's Moving Castle' offers a rich fantasy of adolescent escape, of romance in the old and epic sense. At its worst, it's the most amazing 12-course meal you can't bring yourself to finish.\" A.O. Scott of The New York Times wrote, \"Admirers of work, which is wildly imaginative, emotionally intense and surpassingly gentle, will find much to appreciate in this film because it demonstrates, once again, his visual ingenuity and his sensitivity as a storyteller. For newcomers to his world, \"Howl's Moving Castle\" is a fitting introduction to one of modern cinema's great enchanters.\"</p><p>Conversely, Roger Ebert of the Chicago Sun-Times gave the film two and a half out of four stars, and called it a \"disappointment\" compared to Miyazaki's other recent movies. Jonathan Trout of the BBC said, \"Youngsters and Miyazaki fans will coo at the world's depth and rich surreality, but opaque plotting, and a tendency to mope with Sophie whilst Howl is off affecting events let the momentum of the first act vanish into thin air.\" Writing for Salon, Stephanie Zacharek said, \"the plot of Howl's Moving Castle meanders so listlessly that its details become less and less charming. Miyazaki's storytelling style resembles that of a breathless young tot who's fearlessly exercising his newfound powers of expression.\" Stephen Hunter from The Washington Post criticized the plot of the film, saying \"There is no story, or rather, there's no force to the story, which meanders almost casually this way and that for no apparent reason.\" However, he said that the movie also empowered young women, and was \"beautiful beyond telling.\" David Rooney, writing in Variety, stated that \"the narrative motor roars ahead in the opening hour and is more erratic thereafter,\" and suggested that better translation would help. Literary scholar Matt Kimmich stated that the film came across as \"uneasy compromise between two plots and two imaginations,\" referring to Jones' original story and Miyazaki's style of animation and storytelling. However, he stated that those scenes which were not dependent either on Jones' original plot or Miyazaki's added plot threads found \"a visual humor that recalls the verbal wit and lightness of Jones's novel,\" and that the \"animation manages to free itself from the demands of the two plots—and flies.\"</p><h4>Top ten lists</h4><blockquote>There's a word for the kind of comic, dramatic, romantic, transporting visions Miyazaki achieves in Howl's: bliss.</blockquote><p>—Peter Travers, Rolling Stone</p><p>The film appeared on many critics' top ten lists of the best films of 2005.</p><ul><li>2nd – Ella Taylor, LA Weekly (tie)</li><li>4th – Kenneth Turan, Los Angeles Times</li><li>5th – Tasha Robinson, The A.V. Club</li><li>6th – Lawrence Toppman, The Charlotte Observer</li><li>6th – Jonathan Rosenbaum, The Chicago Reader (tie)</li><li>8th – Michael Sragow, The Baltimore Sun</li><li>8th – Michael Wilmington, The Chicago Tribune</li><li>NA – Peter Rainer, The Christian Science Monitor (listed alphabetically)</li></ul><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Result</th><th>Recipient</th><th>Reference</th></tr><tr><td rowspan=\"3\">2004</td><td>61st <span>Venice Film Festival</span></td><td>Osella Awards for Technical Achievement</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><i>Howl's Moving Castle</i></td><td></td></tr><tr><td><span>Mainichi Film Awards</span></td><td>Best Japanese Movie Overall <br> (Readers' Choice Award)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><i>Howl's Moving Castle</i></td><td></td></tr><tr><td><span>Japan Media Arts Festival</span></td><td>Excellence Prize, Animation</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><i>Howl's Moving Castle</i></td><td></td></tr><tr><td rowspan=\"6\">2005</td><td rowspan=\"4\"><span>Tokyo Anime Award</span></td><td>Animation of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td>Howl's Moving Castle</td><td></td></tr><tr><td>Best Director</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td>Hayao Miyazaki</td><td></td></tr><tr><td>Best Voice Actor/Actress</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td>Chieko Baisho</td><td></td></tr><tr><td>Best Music</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td>Joe Hisaishi</td><td></td></tr><tr><td>Maui Film Festival</td><td>Audience Award</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><i>Howl's Moving Castle</i></td><td></td></tr><tr><td>Seattle International Film Festival</td><td>Golden Space Needle Award</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">1st Runner-up</td><td><i>Howl's Moving Castle</i></td><td></td></tr><tr><td rowspan=\"2\">2006</td><td><span>78th Academy Awards</span></td><td><span>Best Animated Feature</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td>Hayao Miyazaki</td><td></td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best Animated Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><i>Howl's Moving Castle</i></td><td></td></tr><tr><td>2007</td><td><span>Nebula Award</span></td><td><span>Best Script</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td>Hayao Miyazaki (script), <br>Cindy Davis Hewitt, and Donald H. Hewitt <br>(English translation)</td><td></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}