{
  "imDbId": "tt0113277",
  "title": "Heat",
  "fullTitle": "Heat (1995)",
  "type": "Movie",
  "year": "1995",
  "items": [
    {
      "username": "kevin_robbins",
      "userUrl": "https://www.imdb.com/user/ur131783850",
      "reviewLink": "https://www.imdb.com/review/rw7664576",
      "warningSpoilers": false,
      "date": "20 December 2021",
      "rate": "10",
      "helpful": "61 out of 64 found this helpful.",
      "title": "You find yourself rooting for both sides the entire film.",
      "content": "Heat (1995) is a movie that is in my DVD collection that I recently rewatched on Tubi. The storyline follows an underground high end burglary team looking for one big last mission and a parallel story about a successful police officer who is struggling at home. As the buildup to the big heist unfolds the two worlds come closer and closer together until the ultimate collision happens.This movie is directed by Michael Mann (Ali) and stars Robert De Niro (Goodfellas), Al Pacino (Scarface), Val Kilmer (Willow), Jon Voight (Anaconda), Mykelti Williamson (Forest Gump), Ashley Judd (Kiss the Girls), Tom Sizemore (Black Hawk Down), Wes Studi (Deep Rising), Natalie Portman (Leon: The Professional), Ted Levine (Silence of the Lambs) and Dennis Haysbert (Far from Heaven).This cast is absolutely amazing top to bottom. The writing is also excellent and delivers the backstories to each character to perfection and the dialogue is out of this world. The chemistry of the cast throughout the film worked perfectly and the action scenes are intense and very well done. You find yourself rooting for both sides the entire film. The conclusion to such a huge movie is excellent and fits the film perfectly.This is an all time classic that is an absolute must see and an easy 10/10. I would strongly recommend seeing this."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2418301",
      "warningSpoilers": false,
      "date": "23 April 2011",
      "rate": "9",
      "helpful": "100 out of 112 found this helpful.",
      "title": "Exceptionally well done though it's not the sort of film for everyone...but what movie is?",
      "content": "I have very little interest in most action films or violent movies, so I am not the sort of person that would normally watch a film like \"Heat\". However, on a lark and because it's apparently such a good film I decided to give the film a look. Well, I must say that thought I was not in love with the film it sure was exceptionally well made and had a lot to offer--even for folks like me.The biggest reason I liked the movie and thought it was made so well was its rich and complex plot. At nearly three hours, there is lots and lots of time for the plot to slowly unfold. It also allowed for several concurrent plots to interweave themselves through the film--the story about the master criminals, the cops, another criminal as well as a rogue nut-job that just likes to kill. It's almost like a mini-series in this respect. I also loved how this was not a set-bound film but was made throughout LA--though I wonder how this was possible, as it must have tied up huge portions of Los Angeles! I also loved some of the characters--particularly Robert De Niro's oddly professional and scary criminal boss. It was one of his very best performances.There's very little to complain about in the film, though I thought Al Pacino's character was a tad over-acted at times. Unlike De Niro, I had a harder time believing Pacino was real. Perhaps it's just me....Overall, if you don't mind the violence and the occasionally frenetic pace, then this is a film well wroth seeing. Extremely well-directed and never dull."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2366509",
      "warningSpoilers": false,
      "date": "9 January 2011",
      "rate": "10",
      "helpful": "60 out of 70 found this helpful.",
      "title": "Brilliant",
      "content": "This is a brilliant film. While clocking in at a nearly three-hour running time, there isn't a single wasted scene, it is always entertaining and I think it is very rewatchable too. The cinematography, locations and scenery are superb, and the film's atmosphere and pace are also terrific. The story is plausible and beautifully structured with a breathtaking sequence towards the middle of the film, and there are a lot of memorable quotes. Heat is also brilliantly directed by Michael Mann and the acting of Robert DeNiro and Al Pacino is exemplary. So all in all, brilliant and absolutely worth it. 10/10 Bethany Cox"
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1292689",
      "warningSpoilers": false,
      "date": "15 February 2006",
      "rate": "10",
      "helpful": "270 out of 335 found this helpful.",
      "title": "One Of The Best Crime Films Ever",
      "content": "I really believe this is one the great crime movies of all time. It has some drawbacks that wouldn't make me recommend this for family viewing - tons of f- words by Al Pacino and a few bloody scenes, but as far as a fascinating crime story: wow!This movie made modern-day history because it was the first time two of the great actors of this generation - Pacino and Robert De Niro - finally acted together in the same film. Those two didn't disappoint, either. They were great to watch and one of the huge highlights of the film, to me, was when they faced each other in a simple conversation over a cup of coffee. That conversation has always fascinated me, no matter how many times I've heard it. It was such a \"landmark\" scene that It's even the subject of a short documentary on the special-edition DVD.As with the conversation scene, the shootout segment in the streets of Los Angeles still astounds me no matter how many times I see it. The other action scenes are intense and memorable, too, and the cast in here is deep. This isn't just Pacino and De Niro. It's Val Kilmer, Ashley Judd, Jon Voight, Diana Venora, Natlie Portman, Tom Sizemore, Amy Brenamann, Wes Studi, Ted Levine, Mykelti Williamson, on and on. Put that fabulous cast under Michael Mann, one of the best directors in business, add a great soundtrack and interesting camera-work and you have a great film. At three hours long, it never bores one and at same time, doesn't overdo the action, either. I read one critic criticize this film because of the time taken to examine the personal lives of the main characters, but you can't have three hours of nothing but action. The only scene I felt went on a bit too long was the ending chase at the airport, but that's nitpicking considering the film as a whole.This is just one of those movies where a great cast and director live up to their billing."
    },
    {
      "username": "lareval",
      "userUrl": "https://www.imdb.com/user/ur133290271",
      "reviewLink": "https://www.imdb.com/review/rw7237232",
      "warningSpoilers": false,
      "date": "17 August 2021",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "Michael Mann's finest work",
      "content": "A brilliant character driven action thriller with drama and emotion all the way. Despite the long runtime, the pacing never drags. The Magic of this action movie is that you believe the people you see in the screen. You care for them and everything they go through. All of the scenes are influential, the script and the score are iconic. Two thumbs up!"
    },
    {
      "username": "concrndone",
      "userUrl": "https://www.imdb.com/user/ur133028338",
      "reviewLink": "https://www.imdb.com/review/rw7398609",
      "warningSpoilers": false,
      "date": "1 October 2021",
      "rate": "10",
      "helpful": "46 out of 50 found this helpful.",
      "title": "Is better now I'm middle aged",
      "content": "Wow. First saw this in the cinema back in 1996 and of course we all raved over how good it was but I don't think we really appreciated it back then or could have as twenty somethings.Now I'm late forties this made more sense. That obsession with something at the cost of relationships. McCauley could have been out of there a free man but something in him pulled him another way.In the bible that something comes in the guise of a serpent. That's how subtle it creeps up upon us.Great film."
    },
    {
      "username": "ivo-cobra8",
      "userUrl": "https://www.imdb.com/user/ur15140057",
      "reviewLink": "https://www.imdb.com/review/rw3876317",
      "warningSpoilers": true,
      "date": "7 December 2017",
      "rate": "10",
      "helpful": "141 out of 179 found this helpful.",
      "title": "Action masterpiece Michael Mann, Al Pacino and Robert De Niro's best favorite heist movie of all time",
      "content": "A masterpiece and one of the best action heist movies of all time! Heat (1995) is one of my personal favorite Al Pacino and Robert De Niro Action heist movie of all time! I love this movie to death! This movie has everything, action, drama, heist, great cast and incredible realistic great performance from Al Pacino and Robert De Niro! Provides fast and loose action with interesting characters. Great action movie!!!! One of the best for me!!!!!!!!! To this day this movie stands a classic action heist movie of all time! Acting, story, score everything in here is excellent!This movie has a great plot, brilliant story about two lead characters a professional master thief Neil McCauley (Robert De Niro) battling Lt. Vincent Hanna (Al Pacino) LAPD robbery-homicide detective in this non-stop race against time heist. Michael Mann did everything with this film, he wrote the screenplay, produced this movie and directed it. Michael Mann is a brilliant director I love Miami Vice TV Series, Manhunter and Collateral.This movie is the real heist movie un like Point Break and Baby Driver this movie deserves a 10, because it takes the vision of one of the most imaginative directors on Earth, and realizes them almost perfectly with all the tools that fit the task -- actors and great stunts. Without the vision, this film would be nothing. Without the tools, this film would be nothing.Al Pacino stars in the film as Vincent Hanna, a relentless lieutenant in the LAPD's Robbery Homicide Division who is determined to take down a high end robbery crew led by master thief Neil McCauley (De Niro).Notable for its detailed depiction of the techniques used by both law enforcement and criminal elements, as well as exceptional and accurate gun handling, the film was first made as the 1989 television movie L.A. Takedown. Heat also was reported to have been viewed repeatedly by the \"High Incident Bandits\" robbery duo involved in the infamous North Hollywood shootout (as depicted in the film 44 Minutes: The North Hollywood Shootout).Lt. Vincent Hanna (Al Pacino) LAPD robbery-homicide detective was a great character cop. He was at least MILES way better than Johnny Utah (Keanu Reeves) FBI rookie Agent in Point Break that movie sucked! Lt. Vincent Hanna shoot and killed Michael Cheritto (Tom Sizemore) and he saved a child. He cracked the case and he figure it out who the mask robbers were. In the climatic epic battle fight on the end of the film on the airport field he shoot and killed Neil McCauley (Robert De Niro). He destroyed and hunt down McCauley's crew. True two got away but he always got his man. He at least didn't let go McCauley like Johnny Utah did, letting go Bodhi (Patrick Swayze) and he did not arrest or shoot or kill any of Bodhi's men he let them all go. Lt. Vincent Hanna is a hero and veteran police officer to me.Neil McCauley (Robert De Niro), as a professional thief was smart, intelligent, high profile criminal with no criminal record. He was the mastermind behind the robberies, he knew what he was doing. He was a murderer and he did what he know best. He at least wasn't like stupid dumb idiot Bodhi from Point Break, he was trying to get away but he always settle a score with everyone that double crossed him. It is wrong to messing with him. By the end that way leaded him to his end, he made a mistake when he went after Waingro (Kevin Gage).The movie has also one of the greatest shootouts in L.A. in which Shiherlis (Val Kilmer), Cheritto (Tom Sizemore) McCauley (Robert De Niro) firing Colt Model 733 automatic riffle on the cops. Great shootout's I love it.The movie has great famous cast: Al Pacino, Robert De Niro, Val Kilmer, Jon Voight, Tom Sizemore, Ashley Judd, Mykelti Williamson, Ted Levine, Dennis Haysbert, William Fichtner, Natalie Portman, Tom Noonan, Kevin Gage, Danny Trejo, Hank Azaria, Martin Ferrero and Xander Berkeley a lot of famous actors and actresses were extra in this movie.The movie focus on a real human characters that they are ordinary people with normal life's like you and me. That is why I love this film to death! It is realistic performed and it has no jokes or fantasy or anything it is real life. I love Al Pacino and Robert De Niro's performance they both fit the task and accomplish their acting their characters.Heat is the 1995 crime drama directed by Michael Mann and marked the first on screen pairing of legendary actors Al Pacino and Robert De Niro.10/10 My all time personal favorite action heist masterpiece Michael Mann film of all time, this movie kicks ass."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1970875",
      "warningSpoilers": false,
      "date": "4 November 2008",
      "rate": "9",
      "helpful": "27 out of 35 found this helpful.",
      "title": "The Summit",
      "content": "One of the amazing things about Heat is that during an almost three hour running time of the film, your interest in what happens in the summit teaming of Al Pacino and Robert DeNiro never flags for a second. Part of the reason is because these guys are at the top of their profession and brought their A game to the parts. The roles they have are not as good as Jake LaMotta, Jimmy Conway, or Max Cady for DeNiro or Frank Serpico, Michael Corleone, or Bobby Deefield for Pacino. But Neil McCauley master criminal for DeNiro and Jake Hanna dogged detective for Pacino does show these guys at their best.You can best describe Heat as a long running version of Law and Order Criminal Intent with a big budget. Like that show the action shifts back from the cops to the criminals and smoothly for director/writer Michael Mann. We see both of these guys as rather similar to each other. DeNiro prides himself on the fact that he says he can drop any relationship if it interferes with work. And Pacino is on his third marriage and his mistress is the job. He's been a failure twice as a husband and about to go thrice in the romance department.Mann gave Pacino and DeNiro a really outstanding cast for support in Heat. People like Val Kilmer are in DeNiro's gang, Jon Voight is the Sam Jaffe like mastermind of the operation. Pacino on his team has Mykel T. Williamson from Forrest Gump and Ted Levine best known as Captain Stottlemyre on Monk.This action film also does not stint on woman's roles. Diane Venora is fine as Pacino's estranged wife. Amy Breneman is also good as DeNiro's woman who watches her man helplessly trapped by his own criminal rules go to his destruction. Best in the film on the distaff side is Ashley Judd as Val Kilmer's loyal wife who has one great choice given her by Williamson, betray her husband or lose their kid. See how she handles it.Although the scene was shoehorned into the plot and would never happen in real life, Pacino and DeNiro do meet and have a brief scene together over a cup of coffee in a diner. They compare notes so to speak and take the measure of the other guy. Since these two guys are the most acclaimed actors of their generation, the scene artificial though it is takes on a whole different dimension. It's like when writers give Queen Elizabeth and Mary Queen of Scots a climatic meeting scene even though in real life it never happened.But like in Heat, it should have happened."
    },
    {
      "username": "juniorbarra-58647",
      "userUrl": "https://www.imdb.com/user/ur85194843",
      "reviewLink": "https://www.imdb.com/review/rw7205463",
      "warningSpoilers": false,
      "date": "7 August 2021",
      "rate": "10",
      "helpful": "71 out of 79 found this helpful.",
      "title": "Why can't they make movies like this anymore?",
      "content": "Every 2-3 years i come back to this movie and watch it again and again, just a reminder of the 90's movies with cops and robbers...one of the best cop movie ever!"
    },
    {
      "username": "aboriginee",
      "userUrl": "https://www.imdb.com/user/ur0467197",
      "reviewLink": "https://www.imdb.com/review/rw0363537",
      "warningSpoilers": false,
      "date": "23 June 2000",
      "rate": "10",
      "helpful": "831 out of 1,004 found this helpful.",
      "title": "The best character film of all time.",
      "content": "Sound like a bold statement? Devotees of classic cops and robbers flicks of old will no doubt take exception, but I believe that Michael Mann achieved some measure of perfection with Heat. To break this three-hour gem of a film down to its core, this is a film about men - strong men - and the supporting role that he women of the film have on them for better or worse. Take Pacino as good cop Vincent Hanna: one of the most intense characterizations of the tragic hero that I have ever witnessed, as he laments the demise of his third marriage to a pill-junkie wife. A fact which he discusses with his archnemesis (De Niro) in what history will regard as one of the most frenetic scenes in the history of film. The dialogue in this scene (at the very end of the first tape, if you own the VHS version) sets up the last half of the film beautifully, as our two rivals come to the joint realization that they have no hand in choosing the paths that will lead them to their ultimate confrontation: their very natures so define their respective actions that any attempt to do otherwise would simply be a waste of time. While I have heard others (who I am ashamed at times to call close friends) say that Heat drags in places, I will concede that there are moments in the film that require more than the cursory attention that they give to the movie they happen to be watching at any given time (I'm sorry not every director is Jerry Bruckheimer), there are poignant developments of character in Heat that many would casually disregard. I am thinking of the interaction between the ex-con who finds conditional employment in a diner with an opportunistic scum of a boss, and whose girlfriend is so proud of him for swallowing his pride and not simply giving the sonofabitch a good pummeling. But there is a catharsis that I felt for that same ex-con when De Niro's character presents him with the opportunity to take just one more score, for old time's sake. Who doesn't feel for this guy - this minor character in a film with big-time heavyweights who gets to shine for a few brief moments. That's what Heat is really: a series of brief moments, some touching, others traumatic, and still others incredibly horrifying in the feelings that they inspire in the romantic who, like me sees not black or white portrayals of protagonist and villain, but a montage of grays that combine to create a vivid spectrum of film characterization that could not be found in hundreds of films combined. One of my five favorite films of all time, Heat is a cinematic banquet of intense imagery and pulse-pounding action. Come hungry."
    },
    {
      "username": "LeightWinst",
      "userUrl": "https://www.imdb.com/user/ur2031198",
      "reviewLink": "https://www.imdb.com/review/rw0972922",
      "warningSpoilers": false,
      "date": "30 November 2004",
      "rate": "10",
      "helpful": "481 out of 599 found this helpful.",
      "title": "Masterful on all counts",
      "content": "For some reason I cannot stop thinking about this film lately.You know that feeling of having seen it about 3 or 4 times in the last 12 months is not enough? That's what I feel at the moment.I rate it as Mann's best. It's his most kinetic,vibrant(for a film mostly shot in steely blue),agonising,stirring,brash,violent and brilliance in such a simple story. What games did you play as a young kid? Cops and robbers.Good guy.Bad guy.We all know De Niro and Pacino could have been either main part,but can you imagine it any other way round. Pacino doing ice cool calm? De Niro the manic outbursts,arms flailing? It wouldn't work. We know these men now.We know neither will stop at what they do.And yet there is no way either would stop the other.Unless they had too. Which leads us too the characters. All of them.This is an extended family where you feel you know all of them without knowing anything at all. The cops are similar to the robbers and vice-versa. Perhaps Mann is telling us were all the same.Except in what we do.Every speaking part holds substance in this movie, and the support cast is astonishing when you actually read the caliber of who appeared in this film.Tom Sizmore, Val Kilmer,Ashley Judd,Ted Levine,Wes Studi,Hank Azaria,William Fitchner,Henry Rollins,Dennis Haysbert,Tom Noonan. And Natalie Portman, for chrissake! Try getting that cast again.A real 10/10 film. And that Moby song at the end(God moving over the face of waters) gets me every time."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0363888",
      "warningSpoilers": false,
      "date": "15 September 2003",
      "rate": "7",
      "helpful": "43 out of 65 found this helpful.",
      "title": "Good But Overlong",
      "content": "The thing to strike me about HEAT is that it`s overlong . I don`t know if I`ve been watching too much MTV but a major problem I`ve had with a great number of movies coming out of Hollywood studios since the early 1990s is that they`re too long for their own good and I wish to add HEAT to this list since its running time is taken up with too many unnecessary scenes . If these scenes had been ditched at script stage not only would we have had a shorter film we`d have had a far better one . Take the scene in the coffee bar where the gang have just carried out the initial heist and Neil teaches Waingro a lesson by banging his head off the table . Seeing as they`re shown throghout the story to be well organised , professional villains why would Neil draw attention to themselves by assaulting Waingro in this way ? It`s a scene that lacks any credibility and should not have been included . There`s another problem with too many domestic scenes , the film tries to show the audience the marital marital/romantic life of every major character , cop and robber . I know Michael Mann`s later movie THE INSIDER is also full of scenes involving home life but that`s necessary to the plot and characterisation . Here it is not HEAT isn`t by any means a bad film , on the contaray it`s a good one . DeNiro and Pacino in the same movie , boy what a casting coup . Not only that we get to see Val Kilmer when he was famous plus up and coming names like Portman , Sizemore and Fichtner , and once the story gets going it is very compelling with a breath taking shootout . Unfortunately because someone ( I`m guessing Michael Mann deserves all the blame for this ) thought they`d stretch out a two hour movie into a three hour one HEAT remains good instead of great"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw1512096",
      "warningSpoilers": false,
      "date": "2 November 2006",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "More than De Niro and Pacino",
      "content": "What can you say about this movie, that hasn't been said before? Not much, but I state my opinion nonetheless :o).It is undeniably an action classic, although some people will find it (too) slow moving. So if you're more the fast paced action movie viewer, there's a chance that you won't quite enjoy this movie that much.Apart from the well staged action scenes (and the much talked about on-screen meeting of Pacino and De Niro), the supporting cast has to be mentioned. Not only Val Kilmer (who hadn't been that good in a movie since Doc H. in \"Tombstone\" and since then might only have achieved a likewise performance in \"Kiss Kiss Bang Bang\", though comedic and overshadowed by Robert Downey Jr), but every single one. Be it Danny Trejo, Tom Sizemore, Natalie Portman, Ashley Judd, Jon Voight to name a few ...The great film about the movie then (for me) is not the action parts (can't say I don't enjoy them! ;o) ), but the acting in the movie. Nobody is overplaying his/her part.So great acting+good story+well \"executed\"(directed)=Classic (imo)"
    },
    {
      "username": "searchanddestroy-1",
      "userUrl": "https://www.imdb.com/user/ur17559480",
      "reviewLink": "https://www.imdb.com/review/rw8232788",
      "warningSpoilers": false,
      "date": "12 June 2022",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "Is it possible to put more than ten stars?",
      "content": "Al Pacino is definitely attached to the greatest crime gangster movies in film history: THE GODFATHER trilogy, SCARFACE, CARLITO'S WAY. And so Bob De Niro too: THE GODFATHER 2, ONCE UPON A TIME IN AMERICA, THE GOOD FELLAS, CASINO. To summarize, because of the presence of these two giants, this movie which I talk now is also to be put on the list, and maybe on the top of it. For me it is the best cop gangster - armed robbers - scheme ever made, and a model, a reference for ant real gangster in the US and Europe. This movie is simply perfect, flawless, tense, taut, gripping, outstanding; unless to hate this kind of movie - and you have the right to - it's impossible to ignore it, this would be an heresy. Acting, directing, editing, everything is purely chiseled like a jewel, a diamond. We could see this as a kind of US remake of Jean Pierre Melville's LE DEUXIEME SOUFFLE where De Niro would have Lino Ventura's role, and Pacino Paul Meurisse's one."
    },
    {
      "username": "jamie-109",
      "userUrl": "https://www.imdb.com/user/ur0611611",
      "reviewLink": "https://www.imdb.com/review/rw0363507",
      "warningSpoilers": false,
      "date": "17 February 2000",
      "rate": "10",
      "helpful": "572 out of 688 found this helpful.",
      "title": "Heat is truly epic, absolutely breathtaking",
      "content": "One of the most amazing things about Heat is the scale of the film; it is nearly three hours long and packed to bursting with mind-blowing visuals. It seems one of Michael Mann's main priorities was to make a film with a dreamlike feel to it, to portray LA as a dusty oil-painting on which complex characters could play out their lives. One of the main themes is the similarity of the career criminal and the street-wise cop. It is fascinating to find yourself really feeling for DeNiro's tragic bank-robber, a man of philosophical merit who realises he's stuck in a life of crime he doesn't want to lead. Pacino's cop is less easy to sympathise with, but he too leads an in-escapable life of guns and crime. What really stands out is the climax. On the whole, Heat has to be the best cops n' robbers film ever made, indeed, one of the best films. An epic, wonderful, sad, adrenaline-fuelled exercise in scale and grandeur."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2082249",
      "warningSpoilers": true,
      "date": "17 June 2009",
      "rate": "",
      "helpful": "32 out of 48 found this helpful.",
      "title": "Gangster Movies: Part 2",
      "content": "The flaw of all gangster movies, at least those acknowledged as \"classics\" (Godfather trilogy, Scarface, Goodfellas, Casino, White Heat, Once Upon A Time In America etc), is how obvious and predictable their narrative progressions are. We get the rise, the joyous ecstasy of crime and the obvious monetary rewards, and the fall, that period where the world violently collapses around the criminal. With the scripts all so loosely similar, it just becomes a game of dress up. Of who has the best period details, acting and set design.Released the same year as Scorsese's \"Casino\", Michael Mann's \"Heat\" positions itself as one of the first \"neo liberal\" gangster movies, all the others still caught in the old framework of mafia patriarchy, family values, loyalty, honour, total adherence to a distinctive creed, blood lines and tribalism. \"Heat\", in comparison, completely breaks away from these old-fashioned ways. In Mann's film, everyone is an individual in the most extreme sense. The gang is no longer a gang, but a crew of \"independent professionals\" who just come together for a specific job and then split. In this world, families and friends are non-existent or total charades.While Don Corleone hid like a king behind his armed guards and giant fences, Mann's gangsters are trapped in a state of perpetual mobility. Like a group of shareholders, they are held together only by the prospect of future revenue. Their arrangement is temporary, pragmatic and lateral. They know that they are interchangeable parts in a larger machine, that there are no guarantees and that nothing lasts. Compared to this, the gangsters of \"Goodfellas\" and \"The Godfather\" seem like stagnated sentimentalists, nostalgically trapped in dying communities. While The Corleone's fight over territory and family honour, Mann's guys are only interested in Capital. As DeNiro yells during a bank heist, \"We're here for the bank's money, not your money!\"Tellingly, the DeNiro character's creed is one of \"zero loyalty\". He has a 30-second rule of walking away from anyone, however close he may be emotionally or romantically. The message of the film is thus double edged. It isn't just that the film's final resolution is that \"justice prevails\" and the bad guys are put away; rather, it is that those who fall, who get caught, are those who failed to live up to the modern creed, which is actually repeated twice in the film: \"Don't let yourself get attached to anything you are not willing to walk out on in 30 seconds flat if you feel the heat around the corner.\" In other words, late capitalism and attachment do not mix.So in this sense, a film like \"Heat\", though otherwise entirely predictable, essentially a bunch of little boys engaging in idiot machismo one-upmanship posturing (Pacino's obsessive-compulsive manic cop vs DeNiro's cool sociopathic dedication, etc), nevertheless was one of the first films to manifest a fundamental social change. A series like \"The Wire\" then takes all of this much further, with its attempt to consciously map out the vast and unrepresentable complexity of contemporary neo-liberal capitalism. (In fact, a series like \"The Wire\", with its sheer scope, complexity and writing credentials, renders ALL gangster and crime movies irrelevant to any serious viewer.)And so today's gangsters are all \"entrepreneurs\", all so called \"self-made individuals\", the \"self-employed Petite bourgeoisie\", radically without any social links, even down to the kid selling crack to his buddies. This is all a million light years from the long obsolete world of \"The Godfather\", \"Casino\" or \"Goodfellas\". While those elegiac films are about moments that had long passed, Mann's is distinctively modern. This is a film about the 90s. This is a Los Angeles of polished chrome, designer kitchens, featureless freeways, fluorescent bulbs and late night diners. All the colours, sounds, aromas and cultural quirks of Coppola and Scorsese have been torn out, painted over, re-fitted and re-modelled. Mann's LA is a world without landmarks. A vast urban sprawl, all traces of Old Europe replaced by business franchises, multiplexes and multinational coffee shops. While Coppola's film centred around a family called the \"Corleone's\", their name itself a reference to the village in which they originated, Mann's criminals have bland names like \"Neil\". They are without history, culture or family ties. In a brilliant touch, Mann even has De Niro reading a book on metals when he first meets his love interest. The guy is a piece of cold, polished steel in a world that is likewise.Rather than a \"rise/fall\" structure we also get something a bit different. These criminals get no joy from their profession. Trapped in a world of paranoia, Mann's aesthetic is one of flat glass panes and expansive windows, his criminals always fearing exposure. For Mann, crime becomes a means of escape from the world in its entirety. Crime is total disconnection from both family, society and man, his criminals all looking to amass enough wealth to escape to some idyllic island on the horizon.But it's Mann's style itself that seduces us. This style, which I call \"Armani decorum\", owes much to Mann's fondness for such painters and architects as David Hockney, Alex Colville, Edward Hopper and Ed Ruscha (Alex Colville's \"Pacific\" is visually quoted in one shot). Mann's thus trades the \"old noir\" look for 1950's modernism, block colours, expansive glass panes, geometric divisions and contemporary, linear houses. His frame is divided into flat surfaces, characters are dressed in pastels, scenes are assigned panels of light and buildings are relentlessly modernist, with fluorescent bulbs and geometrical, flat surfaces. Couple this with his unique choice in music (minimalist, industrial and techno) and you have a very sexy aesthetic.8.9/10 – Dismissed upon release, \"Heat\" achieved \"classic\" status a few years later due to young film buffs. As the star status of De Niro and Pacino fades, and films like \"Dark Knight\" rip off its style, the film seems to be on another downward spiral.Worth several viewings."
    },
    {
      "username": "Jouford",
      "userUrl": "https://www.imdb.com/user/ur32860880",
      "reviewLink": "https://www.imdb.com/review/rw5675865",
      "warningSpoilers": false,
      "date": "25 April 2020",
      "rate": "6",
      "helpful": "97 out of 133 found this helpful.",
      "title": "I obviously don't get it ...",
      "content": "Let me start by saying that Heat isn't a terrible movie. In fact, it's not a bad movie at all. I just think that it's incredibly overrated. I'm not a huge fan of Michael Mann's work in general. I find his films to be no more than very long music videos. His movies seem to epitomise style over substance to me, and Heat is no different. DeNiro and Pacino chew through the scenes like they normally do. That's a given. The rest of the cast are as competent and watchable, but the film doesn't feel deep enough for me. Though judging by the way everyone else is rating it, I must be missing something, even after watching it three times. I'm sorry that I don't like this film. It's got all the right ingredients to be special, but, as far as I'm concerned, it's undercooked."
    },
    {
      "username": "eddieknocker",
      "userUrl": "https://www.imdb.com/user/ur2734934",
      "reviewLink": "https://www.imdb.com/review/rw1001536",
      "warningSpoilers": false,
      "date": "17 January 2005",
      "rate": "10",
      "helpful": "208 out of 297 found this helpful.",
      "title": "One of the best films of the 90's",
      "content": "I am assuming I am commenting on this film for those who have not seen this film and for those people I pity you. Its a crime thriller. Won't describe the story as its not particularly original and not the best thing about this film. You've got Pacino and Deniro on screen in a film for the first and possibly last time which should be recommendation enough. You've also got director Michael Mann at the top of his game. An awesome supporting cast firing on all cylinders. Arguably the best \"shoot-out\" in any film - ever. What more do you want???It's a long film but there is not one wasted scene in it. Even the incidental story lines - for example, the recently paroled ex-cell mate of Deniro whose first job is in a \"grill\" working for a nasty, exploitative boss and then ends-up as a stand-in getaway driver for Deniros crew. It just adds weight to the whole film. All the domestic dramas of the good-guys and the bad-guys that you wouldn't get in the typical cops and robbers film are shown in loving detail and nothing is rushed. Just makes it a more satisfying and involving film.Mann who started his career on Miami Vice almost seems to be taking a trip back to the eighties with the soundtrack and styling of the film - almost but not quite. If you still don't want to see the film after this then what the hell's wrong with you?! Sit back and enjoy. Also - no. 247 in the top 250?? Whats up with that???"
    },
    {
      "username": "mkrusc",
      "userUrl": "https://www.imdb.com/user/ur0968992",
      "reviewLink": "https://www.imdb.com/review/rw0363573",
      "warningSpoilers": false,
      "date": "19 January 2001",
      "rate": "",
      "helpful": "330 out of 414 found this helpful.",
      "title": "Mann's crime drama delivers",
      "content": "'Heat,' a film of epic proportions on a common placed scale, provides all the essentials of a great crime drama and then some. With a fascinating storyline, involving characters, and Mann's sometimes poetic, sometimes gritty directing, 'Heat' is arguably one of the best crime dramas.Perhaps the most unique feature of this movie is its manifold storyline, which focuses primarily on the main characters: Vincent Hanna and Neil McCauley. Because of this complex storyline, it almost seems as if one is watching two movies, with one about each of the two characters. While following Hanna's personal life, the movie shows how it is about more than just a cop in pursuit of a criminal. Hanna's marriage is deteriorating, his step daughter is falling apart, and, as wife Justine says, he lives his life more among the \"remnants of dead people.\" A man of two other failed marriages, Hanna's story is that of the strain of trying to fulfill both his professional and personal, where, every time, the professional wins out. Neil McCauley's story is that of a man who used to know his role: his job. Everything in his life revolved around making the next score (whether it be large or small). His story chronicles his relationships with the other men in his crew, and his relationship with Eady, his girlfriend who does not know all she should about him. The tensions build as Mann shows the two opposing strategies of each man as their paths (and thus their stories) draw closer together. When the two storylines do meet (at different points in the movie), the result is--for lack of a better word--epic. To say that these two major storylines are the only strong ones of the movie would do injustice to the many others (following Chris and his wife, for example); but to say that they are the driving force of the movie, to say that they are responsible for transforming a typical cops-and-robbers story is the best explanation.In addition, the characters in this movie undoubtedly make it so successful. This cast comes as close as possible to being ensemble with two such huge main characters. And the cast is one of the best, at that. DeNiro. Little more needs to be said. Ever the master, his character, McCauley, can be on the one hand a ruthless robber and cold-hearted killer, on the other a warm friend and tender lover. And, despite his life of crime, McCauley's human side shows through. He will not kill unless he must, as seen through his anger at Waingro and bank heist. His warmer side shows through his relationships with his friends and girlfriend Eady. Pacino. Equally without need of praise. As always, he delivers an intense performance, here as Hanna, a workaholic obsessed with catching his man, while also fighting a losing battle to save his personal relationships. He may seem just the harsh cop, but he cares about every man under his command, about his stepdaughter, and, yes, even about McCauley. Through Hanna, Pacino shows just how torn such a man can be. Hanna demonstrates both coldness and compassion, both anger and sensitivity. Additionally strong is Val Kilmer, as Chris Shiherlis; with a raging temper, undying devotion, and a fierce will to persevere. Kilmer does an excellent job with the character of a flawed individual, whose flaws prevent him from lasting contentment, but against which flaws he continually strives. Ashley Judd is an unforgettable Charlene Shiherlis, who, despite a smaller roll, makes a lasting impression on the film. Tom Sizemore, as the implacable Michael Cheritto, and Jon Voight, as a gruff Nate, are both likeable (because of their human sides) and despicable (because of their professions). Each does excellent work. And equally fine are Diane Venora, as Justine, and Natalie Portman, as Justine's daughter Lauren. As Venora is strong opposite Pacino, so Amy Brenneman, Eady, is an equally strong opposite of DeNiro. In a cast so full of big names, it is so rewarding to see everyone come together to make the characters each have their own place in the film.And Michael Mann's direction of the movie keeps the film moving while providing a tremendous combination of action and drama. He moves from scene to scene quickly and effortlessly. He also switches between the many storylines logically and fluidly, none of the story being lost. Each scene leaves its own, unmistakable impression, and each scene of each storyline builds upon the previous. Action scenes are handles crisply but grittily. The gunshots are loud, the blood is abundant, but Mann wisely does not linger on the horror of the moment. He paints a realistic picture, but keeps to the topic. The action never becomes more important than the drama. Mann is also responsible for what is perhaps the greatest robbery scene ever. Here, his more gritty sense of style is what makes this scene so believable. And, despite the enormous cast, Mann was still able to keep his agenda clear, and orchestrate so much talent into a coherent movie. Michael Mann deserves credit for both his vision and ability to express it.Because of these and other well done aspects, 'Heat' is one of the most powerful crime dramas ever made."
    },
    {
      "username": "jdring2007",
      "userUrl": "https://www.imdb.com/user/ur20263141",
      "reviewLink": "https://www.imdb.com/review/rw7198899",
      "warningSpoilers": false,
      "date": "5 August 2021",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "a masterpiece crime drama/action hybrid with memorable performances",
      "content": "I'd give this a 10 if it weren't for the drawn out \"climax\" and the whole tangent between De Niro and his woman. I understand the necessity of that element, but his character is so indifferent throughout that it lost me completely. That said, about his character, I get it; he isn't supposed to be flamboyant, he's rigid and unforgiving, he lives by a strict creed, and De Niro nails it flawlessly. He just isn't nearly my favorite character. And there's so many to pick from! Heat offers you a slew of people to latch onto, emotionally and empathetically, or even apathetically. Every character showcases his own qualities and flaws, making even the bad guys likable in some cases, but when it comes right down to it they are, clear as day, the bad guys. And all the actors and actresses put on stellar performances. Al Pacino especially; Val Kilmer was a favorite for me, and even Waingro, as despicable a man as he was in the movie, depicted so memorably by Kevin Gage. Even Danny Trejo, who is such a small role, has. Subtle yet powerful performance in the third act. And then there's the action. While the movie is undeniably long, it isn't boring, with the exception of my aforementioned gripe with De Niro's romantic tangent. Aside from that, even when guns aren't blazing (every gunfight is raw and gritty and intensely filmed), there is action to be had. The script is ingenious and cinematography immersive. Have seen multiple times and will watch again in the future."
    },
    {
      "username": "sterlin_rivera",
      "userUrl": "https://www.imdb.com/user/ur53308260",
      "reviewLink": "https://www.imdb.com/review/rw7658536",
      "warningSpoilers": false,
      "date": "18 December 2021",
      "rate": "",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Plain Phenomenal",
      "content": "Heat is quite possibly the greatest crime/heist film ever made. For nearly 3 hours, it runs in an astounding pace and is loaded with entertainment.Heat is about Neil McCauley (Robert De Niro) who him and his crew are professional bank robbers. Neil plans one last heist before his retirement, and that heist goes terribly wrong, leading to homicide. The LAPD are after them, led by Lt. Vincent Hanna (Al Pacino), and Neil and his team do what they can playing a deadly cat-and-mouse game with Vincent and his crew and hopefully make a getaway.Heat is just plain phenomenal. The acting from everyone was awesome. It was great to finally have two legends, De Niro and Pacino, in the same scenes together and they worked so good in the film as well as Val Kilmer turning in an awesome performance.The shootout scenes are epic, especially the famous one that is in the middle of the movie thag is super loud but sounds insanely great. The story was also really well put together, well thought out, and it worked for a 3 hour film. The ending also is so intriguing that it keeps your eyes locked on the screen and makes you really want to see what happens.Bottom line, Heat is one of my all time favorite movies and is actually my 2nd favorite Robert De Niro film (1st being Goodfellas)."
    },
    {
      "username": "tamerhaddou-70008",
      "userUrl": "https://www.imdb.com/user/ur131352600",
      "reviewLink": "https://www.imdb.com/review/rw7087968",
      "warningSpoilers": false,
      "date": "3 July 2021",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "One of the classic theft movies, a great movie",
      "content": "One of the greatest heist movies ever, great movie, classic story, great directing, with a giant legendary cast from a giant acting classic movie 10/10."
    },
    {
      "username": "nmthomas-20486",
      "userUrl": "https://www.imdb.com/user/ur96469561",
      "reviewLink": "https://www.imdb.com/review/rw7442622",
      "warningSpoilers": false,
      "date": "14 October 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Brilliant",
      "content": "The acting is phenomenal from the two leads who are perfection on screen. The lingering shots, the cityscapes, the rawity, the importance of decision making and characters driven by revenge. Great pacing, score and dialogue. Really gritty with familial drama that appeals not repels viewers here to see some action."
    },
    {
      "username": "Eiriksterminator",
      "userUrl": "https://www.imdb.com/user/ur46799929",
      "reviewLink": "https://www.imdb.com/review/rw5272595",
      "warningSpoilers": false,
      "date": "22 November 2019",
      "rate": "10",
      "helpful": "24 out of 34 found this helpful.",
      "title": "They don't make them like this anymore...",
      "content": "I think I watched this once a very long time ago when I was young, but I didn't remember much. Now that The Irishman is coming up with De Niro and Paciono again, it made me look into this movie and rewatch at, now as an adult, very long after the first time, and it was almost like I was watching it for the first time.This movie is so damn good. I can't remember the last time I saw a crime thriller this good, so I guess sthey just don't make them like this anymore, sadly...The writing, the characters, the directing, the acting, the action, the drama, the suspense, the music...It's all so good, I have to say this is probably one of the best movies in the genre that I've seen. A masterpiece. The 3 hours do not overstay their welcome. This one will most likely grip you. I grew attached to the villain, even though I knew I shouldn't. Do yourself a favour and watch this. For myself I think I'm gonna go ahead and buy it, actually. Movies rarely ever satisfy me like this anymore..."
    },
    {
      "username": "stickman-6",
      "userUrl": "https://www.imdb.com/user/ur0534010",
      "reviewLink": "https://www.imdb.com/review/rw0363495",
      "warningSpoilers": false,
      "date": "3 January 2000",
      "rate": "10",
      "helpful": "267 out of 354 found this helpful.",
      "title": "Heat is a masterpiece",
      "content": "In this exciting thrill ride, good and evil battle it out. But not in the usual comic-book style of most films today. \"Heat\" carries with it the moral values so many of us take for granted. Although much in the film is morally ambiguous, one may find that even when all your life you've lived on the other side of the law, you can still settle down and have a heart-to-heart. When I first saw this movie I was sure it would be another violent crime movie that I would never want to see again. I have since seen it 4 times and have a copy of my own. The thrilling sequences and brilliant camera-work have you glued to the screen. The exceptional cast of characters has you wondering \"who could be so lucky to work with them?\". From the opening scene to the thrilling final scenes and everything in between (including the climax) \"Heat\" grabs you and pulls you in. This is a true film masterpiece."
    }
  ],
  "errorMessage": ""
}