{
  "imDbId": "tt0113277",
  "title": "Heat",
  "fullTitle": "Heat (1995)",
  "type": "Movie",
  "year": "1995",
  "language": "en",
  "titleInLanguage": "Heat (1995 film)",
  "url": "https://en.wikipedia.org/wiki/Heat_(1995_film)",
  "plotShort": {
    "plainText": "Heat is a 1995 American crime film written and directed by Michael Mann. It features an ensemble cast led by Al Pacino and Robert De Niro, with Tom Sizemore, Jon Voight, Amy Brenneman, Ashley Judd, Wes Studi and Val Kilmer in supporting roles. The film follows the conflict between an LAPD detective (played by Pacino) and a career criminal (played by De Niro) while also depicting its effect on their professional relationships and personal lives.\r\nMann wrote the original script for Heat in 1979, basing it on Chicago police officer Chuck Adamson's pursuit of criminal Neil McCauley, after whom De Niro's character is named. The script was first used for a television pilot developed by Mann, which became the 1989 television film L.A. Takedown after the pilot did not receive a series order. In 1994, Mann revisited the script to turn it into a feature film, co-producing the project with Art Linson. The film marks De Niro and Pacino's first on-screen appearance together following a period of acclaimed performances from both. Due to their esteemed reputations, promotion centered on their involvement.\r\nHeat was released by Warner Bros. Pictures on December 15, 1995, to critical and commercial success. It grossed $187 million on a $60 million budget, while receiving praise for Mann's direction and screenplay, action sequences, sound mixing, and the performances of Pacino and De Niro. Although it did not receive any major award nominations, Heat is regarded as one of the most influential films of its genre and has inspired several other works. A sequel was announced to be in development on July 20, 2022.",
    "html": "<p>Heat is a 1995 American crime film written and directed by Michael Mann. It features an ensemble cast led by Al Pacino and Robert De Niro, with Tom Sizemore, Jon Voight, Amy Brenneman, Ashley Judd, Wes Studi and Val Kilmer in supporting roles. The film follows the conflict between an LAPD detective (played by Pacino) and a career criminal (played by De Niro) while also depicting its effect on their professional relationships and personal lives.</p><p>Mann wrote the original script for Heat in 1979, basing it on Chicago police officer Chuck Adamson's pursuit of criminal Neil McCauley, after whom De Niro's character is named. The script was first used for a television pilot developed by Mann, which became the 1989 television film L.A. Takedown after the pilot did not receive a series order. In 1994, Mann revisited the script to turn it into a feature film, co-producing the project with Art Linson. The film marks De Niro and Pacino's first on-screen appearance together following a period of acclaimed performances from both. Due to their esteemed reputations, promotion centered on their involvement.</p><p>Heat was released by Warner Bros. Pictures on December 15, 1995, to critical and commercial success. It grossed $187 million on a $60 million budget, while receiving praise for Mann's direction and screenplay, action sequences, sound mixing, and the performances of Pacino and De Niro. Although it did not receive any major award nominations, Heat is regarded as one of the most influential films of its genre and has inspired several other works. A sequel was announced to be in development on July 20, 2022.</p>"
  },
  "plotFull": {
    "plainText": "Heat is a 1995 American crime film written and directed by Michael Mann. It features an ensemble cast led by Al Pacino and Robert De Niro, with Tom Sizemore, Jon Voight, Amy Brenneman, Ashley Judd, Wes Studi and Val Kilmer in supporting roles. The film follows the conflict between an LAPD detective (played by Pacino) and a career criminal (played by De Niro) while also depicting its effect on their professional relationships and personal lives.\r\nMann wrote the original script for Heat in 1979, basing it on Chicago police officer Chuck Adamson's pursuit of criminal Neil McCauley, after whom De Niro's character is named. The script was first used for a television pilot developed by Mann, which became the 1989 television film L.A. Takedown after the pilot did not receive a series order. In 1994, Mann revisited the script to turn it into a feature film, co-producing the project with Art Linson. The film marks De Niro and Pacino's first on-screen appearance together following a period of acclaimed performances from both. Due to their esteemed reputations, promotion centered on their involvement.\r\nHeat was released by Warner Bros. Pictures on December 15, 1995, to critical and commercial success. It grossed $187 million on a $60 million budget, while receiving praise for Mann's direction and screenplay, action sequences, sound mixing, and the performances of Pacino and De Niro. Although it did not receive any major award nominations, Heat is regarded as one of the most influential films of its genre and has inspired several other works. A sequel was announced to be in development on July 20, 2022.\r\nPlot\r\nNeil McCauley is a professional thief based in Los Angeles. He and his crew – right hand man Chris Shiherlis, enforcer Michael Cheritto, driver Gilbert Trejo, and newly hired hand Waingro – rob $1.6 million in bearer bonds from an armored car. During the heist, Waingro kills a guard without provocation. McCauley kills a second guard who attempts to pull out his concealed weapon, and Cheritto kills the third guard so as to not leave any witnesses. Later, McCauley prepares to kill Waingro, but he escapes.\r\nLAPD Lieutenant Vincent Hanna and his team investigate the robbery. Hanna, a dedicated lawman and former Marine, has a strained relationship with his third wife Justine, and struggles to connect with his stepdaughter, Lauren. McCauley follows a code: \"allow nothing to be in your life that you cannot walk out on in 30 seconds flat if you spot the heat around the corner.\" While at a restaurant, McCauley meets Eady, a young graphic designer with whom he begins a relationship.\r\nMcCauley's fence, Nate, suggests he sell the stolen bonds back to their original owner, money launderer Roger Van Zant. Van Zant pretends to agree but instead arranges an ambush. Anticipating a trap, McCauley and his crew counter-ambush, kill the hitmen, and vow to kill Van Zant. Waingro murders a prostitute; Hanna's team investigates, discovering evidence that links it to the murder of other prostitutes, victims of a serial killer. An informant of the LAPD connects Cheritto to the robbery, and Hanna's team begins monitoring him, leading to the rest of the crew and their next target, a precious metals depository. Hanna's team stakes out the depository, but when a careless officer makes a noise, McCauley has his crew walk off the job.\r\nMcCauley's crew agree to one last bank robbery worth $12.2 million. Hanna tracks McCauley and pulls him over on the 105 Freeway, inviting him to coffee. They discuss their dedication to their respective jobs and the limitations of their personal lives; Hanna describes his failing marriage and McCauley confides that he is similarly isolated. Though they admit their respect for one another, both acknowledge that they will kill the other if necessary. Waingro makes a deal with Van Zant to help eliminate McCauley's crew. Trejo quits the bank robbery at the last moment, claiming the LAPD is following him too closely. McCauley recruits an old colleague, Don Breedan, to take Trejo's place as the getaway driver, and the crew carries out the heist.\r\nActing on a tip from Van Zant's bodyguard, the LAPD intercepts the crew as they leave the bank, resulting in a massive shootout where Breedan and several officers are killed. McCauley manages to escape with a wounded Shiherlis. Cheritto attempts to flee, but is shot dead by Hanna. After leaving Shiherlis with Nate, McCauley arrives at Trejo's house to find him mortally wounded and his wife killed. Trejo reveals Waingro and Van Zant's involvement before asking McCauley to kill him. McCauley breaks into Van Zant's mansion and shoots him dead. Upon learning of McCauley's connection to Waingro and discovering that Waingro is hiding at a hotel, Hanna's unit decides to use him as bait to lure McCauley. As McCauley prepares to flee the country, Eady discovers his criminal identity, but agrees to go with him. Before escaping, Shiherlis attempts to reconcile with his wife Charlene, who has been forced by the LAPD to bring in her husband. He encounters her at her hotel, she warns him away with a hand gesture, and he escapes.\r\nHaving separated from Justine, Hanna finds Lauren has attempted suicide in his own hotel room and rushes her to the hospital; he reconciles with Justine after they learn that Lauren has survived. McCauley drives to the airport with Eady, but he learns Waingro's location and abandons his usual caution to seek revenge. McCauley infiltrates the hotel, pulls the fire alarm, bursts into Waingro's room and kills him. As McCauley returns to Eady, he is spotted by Hanna. McCauley abandons Eady, fleeing onto the tarmac at the Los Angeles International Airport, pursued by Hanna. The two stalk each other, and Hanna shoots McCauley in the chest. Hanna takes McCauley's hand as McCauley dies of his wounds.\r\nCast\r\nAl Pacino as Lieutenant Vincent Hanna, LAPD\r\nRobert De Niro as Neil McCauley\r\nVal Kilmer as Chris Shiherlis\r\nJon Voight as Nate\r\nTom Sizemore as Michael Cheritto\r\nDiane Venora as Justine Hanna\r\nAmy Brenneman as Eady\r\nAshley Judd as Charlene Shiherlis\r\nMykelti Williamson as Sergeant Bobby Drucker\r\nWes Studi as Lieutenant Sammy Casals\r\nTed Levine as Detective Mike Bosko\r\nDennis Haysbert as Don Breedan\r\nWilliam Fichtner as Roger Van Zant\r\nNatalie Portman as Lauren Gustafson\r\nTom Noonan as Kelso\r\nKevin Gage as Waingro\r\nHank Azaria as Alan Marciano\r\nDanny Trejo as Gilbert Trejo\r\nSusan Traylor as Elaine Cheritto\r\nKim Staunton as Lillian\r\nHenry Rollins as Hugh Benny\r\nJerry Trimble as Detective Danny Schwartz\r\nTone Loc as Richard Torena\r\nRicky Harris as Albert Torena\r\nRay Buktenica as Timmons\r\nJeremy Piven as Dr. Bob\r\nXander Berkeley as Ralph\r\nBud Cort as Solenko\r\nDan Martin as Detective Harry Dieter\r\nSteven Ford as LAPD Officer Bruce\r\nPaul Herman as LAPD Sergeant Heinz\r\nFarrah Forke as Claudia\r\nNiki Haris as Marcia Drucker\r\nAdditional cast members include Martin Ferrero as a construction clerk, Hazelle Goodman as the mother of a prostitute murdered by Waingro, Patricia Healy as a woman in a relationship with Bosko, and Yvonne Zima as the girl taken hostage by Cheritto. Stuntmen Rick Avery, Bill McIntosh, and Thomas Rosales Jr. portray the ill-fated armored truck guards.\r\nDevelopment\r\nFactual basis\r\nHeat is based on the true story of Neil McCauley, a calculating criminal and ex-Alcatraz inmate who was tracked down by Detective Chuck Adamson in 1964. In 1961, McCauley was transferred from Alcatraz to McNeil, as mentioned in the film. He was released in 1962 and immediately began planning new crimes. Michael Parille and William Pinkerton used bolt cutters and drills to rob a manufacturing company of diamond drill bits, which is recreated in the film. Pacino's character is largely based on Detective Chuck Adamson, who began keeping tabs on McCauley's crew, knowing that he had begun committing crimes again. The two even met for coffee once, just as portrayed in the film. Their dialogue in the script was based on the conversation that McCauley and Adamson had. The next time that the two met, guns were drawn, just as the movie portrays.\r\nOn March 25, 1964, McCauley and members of his regular crew followed an armored car that delivered money to a National Tea grocery store at 4720 S. Cicero Avenue, Chicago. Once the drop was made, three of the robbers entered the store. They threatened the clerks and stole money bags worth $13,137 (equivalent to $124,000 in 2022) before they sped off in a rainstorm amid police gunfire.\r\nMcCauley's crew was unaware that Adamson and eight other detectives had blocked off all potential exits; the getaway car turned down an alley and the robbers saw the blockade and realized that they were trapped. All four exited the vehicle and began firing. Russell Bredon (or Breaden) and Michael Parille were slain in an alley while Miklos Polesti (on whom Chris Shiherlis is very loosely based) shot his way out and escaped. McCauley was shot to death on the lawn of a nearby home. He was 50 years old and the prime suspect in several burglaries. Polesti was caught days later and sent to prison. Polesti was still alive in 2011.\r\nAdamson went on to a successful career as a television and film producer, and he died in 2008 at age 71. Michael Mann's 2009 film Public Enemies stated in its end credits \"In memory of Chuck Adamson\".\r\nThe character of Nate played by Jon Voight is based on Edward Bunker, who served as a consultant to Mann on the film.\r\nCanceled TV series\r\nIn 1979, Mann wrote a 180-page draft of Heat. He re-wrote it after making Thief in 1981 hoping to find a director to make it and mentioning it publicly in a promotional interview for his 1983 film The Keep. In the late 1980s, he offered the film to his friend, film director Walter Hill, who turned him down. Following the success of Miami Vice and Crime Story, Mann was to produce a new crime television show for NBC. He turned the script that would become Heat into a 90-minute pilot for a television series featuring the Los Angeles Police Department Robbery–Homicide division, featuring Scott Plank in the role of Hanna and Alex McArthur playing the character of Neil McCauley, renamed to Patrick McLaren. The pilot was shot in only nineteen days, atypical for Mann. The script was abridged down to almost a third of its original length, omitting many subplots that made it into Heat. The network was unhappy with Plank as the lead actor, and asked Mann to recast Hanna's role. Mann declined and the show was canceled and the pilot aired on August 27, 1989, as a television film entitled L.A. Takedown which was later released on VHS and DVD in Europe.\r\nProduction\r\nPre-production\r\nOn April 5, 1994, Mann was reported to have abandoned his earlier plan to shoot a biopic of James Dean in favor of directing Heat, producing it with Art Linson. The film was marketed as the first on-screen appearance of Al Pacino and Robert De Niro together in the same scene – both actors had previously starred in The Godfather Part II, but owing to the film's double story structure, they were never seen in the same scene. Pacino and De Niro were Mann's first choices for the roles of Hanna and McCauley, respectively, and they both immediately agreed to act.\r\nMann assigned Janice Polley, a former collaborator on The Last of the Mohicans, as the film's location manager. Scouting locations lasted from August to December 1994. Mann requested locations which had not appeared on film before, in which Polley was successful – fewer than 10 of the 85 filming locations were previously used. The most challenging shooting location proved to be Los Angeles International Airport, with the film crew almost missing out due to a threat to the airport by the Unabomber. On the DVD commentary, Mann noted it would be impossible to film the airport climax in the same way following the events of 9/11.\r\nTo make the long shootout more realistic they hired British ex-Special Air Service sergeant Andy McNab as a technical weapons trainer and adviser. He designed a weapons training curriculum to train the actors for three months using live ammunition before shooting with blanks for the actual take and worked with training them for the bank robbery.\r\nCasting\r\nDe Niro was the first cast member to receive the film script, showing it to Pacino, who also wanted to be a part of the film. De Niro believed that Heat was a \"very good story, had a particular feel to it, a reality and authenticity.\" In 2016, Pacino revealed that he viewed his character as having been under the influence of cocaine throughout the whole film.\r\nMann took Kilmer, Sizemore, and De Niro to Folsom State Prison to interview actual career criminals to prepare for their roles. While researching her role, Judd met several former prostitutes who became housewives.\r\nKeanu Reeves was offered the role of Chris Shiherlis, but he turned it down in favor of playing Hamlet at the Manitoba Theatre Centre. As a result, Val Kilmer was given the role.\r\nFilming\r\nPrincipal photography for Heat lasted 107 days during the summer of 1995. All of the shooting was done on location, due to Mann's decision not to use a soundstage.\r\nRelease\r\nBox office\r\nHeat was released on December 15, 1995, and opened at the box office with $8.4 million from 1,325 theaters, finishing in third place behind Jumanji and Toy Story. It went on to have a total gross of $67.4 million in United States box offices, and $120 million in foreign box offices. Heat was ranked the #25 highest-grossing film of 1995.\r\nHome media\r\nHeat was released on VHS on November 12, 1996 by Warner Home Video. Due to its running time, the film had to be released on two cassettes. A DVD release followed on July 27, 1999. A two-disc special-edition DVD was released by Warner Home Video on February 22, 2005, featuring an audio commentary by Michael Mann, deleted scenes, and numerous documentaries detailing the film's production. This edition contains the original theatrical cut.\r\nThe initial Blu-ray Disc was released by Warner Home Video on November 10, 2009, featuring a high-definition film transfer, supervised by Mann. Among the disc extras were Mann's audio commentary, a one-hour documentary about the making of the film and ten minutes worth of scenes cut from the film. As well as approving the look of the transfer, Mann also recut two scenes slightly differently, referring to them as \"new content changes\".\r\nA Director's Definitive Edition Blu-ray was released on May 9, 2017, by 20th Century Fox Home Entertainment, who acquired the distribution rights to the film through their part-ownership of Regency back in 2015. Sourced from a 4K remaster of the film supervised by Mann, the two-disc set contains all the extras from the 2009 Blu-ray, along with two filmmakers panels from 2015 and 2016, one of which was moderated by Christopher Nolan. A 4K Ultra HD Blu-ray Ultimate Collector's Edition of Heat that contains the Director's Definitive Edition of the film on UHD Blu-ray and Blu-ray along with legacy bonus materials was released on August 9, 2022 by Walt Disney Studios Home Entertainment, coinciding with the release date of Mann's sequel novel. Unlike the previous home media releases, the Director's Definitive Edition Blu-ray and the 4K Ultra HD Blu-ray Ultimate Collector's Edition did not feature the Warner Bros. Pictures logo at the beginning, although the in-credit closing is retained.\r\nHeat was broadcast on NBC television on January 3, 1999, in a significantly edited version. Mann had offered the network scenes which had been filmed but omitted from the theatrical edit in hopes of having the film shown in four hours (with commercials) over two nights. Instead, NBC chose to cut nearly 40 minutes from the theatrical version so that Heat could be shown in a three-hour time slot (with commercials). Mann told Variety, \"They cut so much out of the movie that they destroyed the narrative of the film along with its integrity.... Too much time was taken out of the film that wasn't due to language or other content.\" As a result, Mann had his director's credit on the TV version replaced with the pseudonym \"Alan Smithee\".\r\nReception\r\nOn Rotten Tomatoes the film holds an approval rating of 88% based on 83 reviews and an average rating of 7.9/10. The website's critical consensus reads, \"Though Al Pacino and Robert De Niro share but a handful of screen minutes together, Heat is an engrossing crime drama that draws compelling performances from its stars – and confirms Michael Mann's mastery of the genre.\" On Metacritic, the film has a weighted average score of 76 out of 100, based on 22 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.\r\nRoger Ebert gave the film three and a half stars out of four. He described Mann's script as \"uncommonly literate\", with a psychological insight into the symbiotic relationship between police and criminals, and the fractured intimacy between the male and female characters: \"It's not just an action picture. Above all, the dialogue is complex enough to allow the characters to say what they're thinking: They are eloquent, insightful, fanciful, poetic when necessary. They're not trapped with cliches. Of the many imprisonments possible in our world, one of the worst must be to be inarticulate – to be unable to tell another person what you really feel.\" Simon Cote of The Austin Chronicle called the film \"one of the most intelligent crime-thrillers to come along in years\", and said Pacino and De Niro's scenes together were \"poignant and gripping.\"\r\nKenneth Turan of the Los Angeles Times called the film a \"sleek, accomplished piece of work, meticulously controlled and completely involving. The dark end of the street doesn't get much more inviting than this.\" Todd McCarthy of Variety wrote, \"Stunningly made and incisively acted by a large and terrific cast, Michael Mann's ambitious study of the relativity of good and evil stands apart from other films of its type by virtue of its extraordinarily rich characterizations and its thoughtful, deeply melancholy take on modern life.\" Owen Gleiberman of Entertainment Weekly gave it a B− rating, saying that \"Mann's action scenes ... have an existential, you-are-there jitteriness,\" but called the heist-planning and Hanna's investigation scenes \"dry, talky.\"\r\nRolling Stone ranked Heat #28 on its list of \"The 100 Greatest Movies of the '90s\", and The Guardian ranked it #22 on its list of \"The Greatest Crime Films of All Time\", while other publications have noted its influence on numerous subsequent films.\r\nSoundtrack\r\nOn December 19, 1995, Warner Bros. Records released a soundtrack album on cassette and CD to accompany the film, entitled Heat: Music from the Motion Picture. The album was produced by Matthias Gohl. It contains a 29-minute selection of the film score composed by Elliot Goldenthal, as well as songs by other artists such as U2 and Brian Eno (collaborating as Passengers), Terje Rypdal, Moby, and Lisa Gerrard. Heat used an abridged instrumental rendition of the Joy Division song \"New Dawn Fades\" by Moby, which also features in the same form on the soundtrack album. Mann reused the Einstürzende Neubauten track \"Armenia\" in his 1999 film The Insider. The film ends with Moby's \"God Moving Over the Face of the Waters\", a different version of which was included at the end of the soundtrack album.\r\nMann and Goldenthal decided on an atmospheric situation for the film soundtrack. Goldenthal used a setup consisting of multiple guitars, which he termed \"guitar orchestra\", and thought it brought the film score closer to a European style. The soundtrack was noted for lack of a central theme. Christian Clemmensen of Filmtracks.com criticized the omission from the album of much music heard in the film due to the film's length, but praised the album as a decent listening experience, and Goldenthal's score as \"psychologically engaging and intellectually challenging\", believing it to be one of Goldenthal's best. AllMusic called it a \"soundtrack for the mind ... full of twists and turns\". Musicfromthemovies.com thought of the album as uncharacteristic for Goldenthal's style, calling the atmosphere \"absolutely electrifying\".\r\nImpact\r\nFrench gangster Rédoine Faïd told Mann at a film festival \"You were my technical adviser\". The media described later robberies as resembling scenes from Heat, including armored car robberies in South Africa, Colombia, Denmark, and Norway and the 1997 North Hollywood shootout, in which Larry Phillips, Jr. and Emil Mătăsăreanu robbed the North Hollywood branch of the Bank of America and, similarly to the film, were confronted by the LAPD as they left the bank. Phillips had a copy of the movie where he lived. This shootout is considered one of the longest and bloodiest events of its type in American police history. Both robbers were killed, and eleven police officers and seven civilians were injured during the shootout. Heat was widely referenced during the coverage of the shootout.\r\nFor his film The Dark Knight, director Christopher Nolan drew inspiration in his portrayal of Gotham City from Heat in order \"to tell a very large, city story or the story of a city\". In 2016, a year after the 20th anniversary of Heat, Nolan moderated a Q&A session with Michael Mann and cast and crew at the Samuel Goldwyn Theater.\r\nHeat was one of the inspirations behind the highly influential 2001 video game Grand Theft Auto III as well as the 2008 sequel Grand Theft Auto IV, notably the mission \"Three Leaf Clover\", which was inspired by the climactic bank robbery and police shootout, and the 2013 sequel Grand Theft Auto V, notably the mission \"Blitz Play\" where the crew blocks and then knocks over an armored car in order to rob it.\r\nDirector Mia Hansen-Løve has said she is \"obsessed\" with Heat and said \"the themes of Heat, actually, are themes of my films, except in a very different way, in a very different world\".\r\nSubsequent works\r\nOn March 16, 2016, Mann announced that he was developing a Heat prequel novel, as a part of launching his company Michael Mann Books. On April 27, 2017, Reed Farrel Coleman joined the project as co-author. On May 15, 2020, Mann stated that the novel would function as both a prequel and a sequel, with plot taking place before and after the film's main events. By January 19, 2022, it was revealed that the novel would be a collaboration between Mann and Meg Gardiner; it was subsequently released in August 2022. The title is Heat 2.\r\nIn September 2019, Michael Mann stated that he intends to produce an adaptation of the novel, acknowledging film and television as possible mediums for release. By July 5, 2022, Mann reaffirmed his plans to adapt the novel follow-up into a feature film, while stating that the principal cast from the first installment may be recast for the adaptation. In April 2023, it was reported that the sequel was in development, with Adam Driver in talks to play young McCauley.",
    "html": "<p>Heat is a 1995 American crime film written and directed by Michael Mann. It features an ensemble cast led by Al Pacino and Robert De Niro, with Tom Sizemore, Jon Voight, Amy Brenneman, Ashley Judd, Wes Studi and Val Kilmer in supporting roles. The film follows the conflict between an LAPD detective (played by Pacino) and a career criminal (played by De Niro) while also depicting its effect on their professional relationships and personal lives.</p><p>Mann wrote the original script for Heat in 1979, basing it on Chicago police officer Chuck Adamson's pursuit of criminal Neil McCauley, after whom De Niro's character is named. The script was first used for a television pilot developed by Mann, which became the 1989 television film L.A. Takedown after the pilot did not receive a series order. In 1994, Mann revisited the script to turn it into a feature film, co-producing the project with Art Linson. The film marks De Niro and Pacino's first on-screen appearance together following a period of acclaimed performances from both. Due to their esteemed reputations, promotion centered on their involvement.</p><p>Heat was released by Warner Bros. Pictures on December 15, 1995, to critical and commercial success. It grossed $187 million on a $60 million budget, while receiving praise for Mann's direction and screenplay, action sequences, sound mixing, and the performances of Pacino and De Niro. Although it did not receive any major award nominations, Heat is regarded as one of the most influential films of its genre and has inspired several other works. A sequel was announced to be in development on July 20, 2022.</p><br/><h3>Plot</h3><p>Neil McCauley is a professional thief based in Los Angeles. He and his crew – right hand man Chris Shiherlis, enforcer Michael Cheritto, driver Gilbert Trejo, and newly hired hand Waingro – rob $1.6 million in bearer bonds from an armored car. During the heist, Waingro kills a guard without provocation. McCauley kills a second guard who attempts to pull out his concealed weapon, and Cheritto kills the third guard so as to not leave any witnesses. Later, McCauley prepares to kill Waingro, but he escapes.</p><p>LAPD Lieutenant Vincent Hanna and his team investigate the robbery. Hanna, a dedicated lawman and former Marine, has a strained relationship with his third wife Justine, and struggles to connect with his stepdaughter, Lauren. McCauley follows a code: \"allow nothing to be in your life that you cannot walk out on in 30 seconds flat if you spot the heat around the corner.\" While at a restaurant, McCauley meets Eady, a young graphic designer with whom he begins a relationship.</p><p>McCauley's fence, Nate, suggests he sell the stolen bonds back to their original owner, money launderer Roger Van Zant. Van Zant pretends to agree but instead arranges an ambush. Anticipating a trap, McCauley and his crew counter-ambush, kill the hitmen, and vow to kill Van Zant. Waingro murders a prostitute; Hanna's team investigates, discovering evidence that links it to the murder of other prostitutes, victims of a serial killer. An informant of the LAPD connects Cheritto to the robbery, and Hanna's team begins monitoring him, leading to the rest of the crew and their next target, a precious metals depository. Hanna's team stakes out the depository, but when a careless officer makes a noise, McCauley has his crew walk off the job.</p><p>McCauley's crew agree to one last bank robbery worth $12.2 million. Hanna tracks McCauley and pulls him over on the 105 Freeway, inviting him to coffee. They discuss their dedication to their respective jobs and the limitations of their personal lives; Hanna describes his failing marriage and McCauley confides that he is similarly isolated. Though they admit their respect for one another, both acknowledge that they will kill the other if necessary. Waingro makes a deal with Van Zant to help eliminate McCauley's crew. Trejo quits the bank robbery at the last moment, claiming the LAPD is following him too closely. McCauley recruits an old colleague, Don Breedan, to take Trejo's place as the getaway driver, and the crew carries out the heist.</p><p>Acting on a tip from Van Zant's bodyguard, the LAPD intercepts the crew as they leave the bank, resulting in a massive shootout where Breedan and several officers are killed. McCauley manages to escape with a wounded Shiherlis. Cheritto attempts to flee, but is shot dead by Hanna. After leaving Shiherlis with Nate, McCauley arrives at Trejo's house to find him mortally wounded and his wife killed. Trejo reveals Waingro and Van Zant's involvement before asking McCauley to kill him. McCauley breaks into Van Zant's mansion and shoots him dead. Upon learning of McCauley's connection to Waingro and discovering that Waingro is hiding at a hotel, Hanna's unit decides to use him as bait to lure McCauley. As McCauley prepares to flee the country, Eady discovers his criminal identity, but agrees to go with him. Before escaping, Shiherlis attempts to reconcile with his wife Charlene, who has been forced by the LAPD to bring in her husband. He encounters her at her hotel, she warns him away with a hand gesture, and he escapes.</p><p>Having separated from Justine, Hanna finds Lauren has attempted suicide in his own hotel room and rushes her to the hospital; he reconciles with Justine after they learn that Lauren has survived. McCauley drives to the airport with Eady, but he learns Waingro's location and abandons his usual caution to seek revenge. McCauley infiltrates the hotel, pulls the fire alarm, bursts into Waingro's room and kills him. As McCauley returns to Eady, he is spotted by Hanna. McCauley abandons Eady, fleeing onto the tarmac at the Los Angeles International Airport, pursued by Hanna. The two stalk each other, and Hanna shoots McCauley in the chest. Hanna takes McCauley's hand as McCauley dies of his wounds.</p><br/><h3>Cast</h3><ul><li>Al Pacino as Lieutenant Vincent Hanna, LAPD</li><li>Robert De Niro as Neil McCauley</li><li>Val Kilmer as Chris Shiherlis</li><li>Jon Voight as Nate</li><li>Tom Sizemore as Michael Cheritto</li><li>Diane Venora as Justine Hanna</li><li>Amy Brenneman as Eady</li><li>Ashley Judd as Charlene Shiherlis</li><li>Mykelti Williamson as Sergeant Bobby Drucker</li><li>Wes Studi as Lieutenant Sammy Casals</li><li>Ted Levine as Detective Mike Bosko</li><li>Dennis Haysbert as Don Breedan</li><li>William Fichtner as Roger Van Zant</li><li>Natalie Portman as Lauren Gustafson</li><li>Tom Noonan as Kelso</li><li>Kevin Gage as Waingro</li><li>Hank Azaria as Alan Marciano</li><li>Danny Trejo as Gilbert Trejo</li><li>Susan Traylor as Elaine Cheritto</li><li>Kim Staunton as Lillian</li><li>Henry Rollins as Hugh Benny</li><li>Jerry Trimble as Detective Danny Schwartz</li><li>Tone Loc as Richard Torena</li><li>Ricky Harris as Albert Torena</li><li>Ray Buktenica as Timmons</li><li>Jeremy Piven as Dr. Bob</li><li>Xander Berkeley as Ralph</li><li>Bud Cort as Solenko</li><li>Dan Martin as Detective Harry Dieter</li><li>Steven Ford as LAPD Officer Bruce</li><li>Paul Herman as LAPD Sergeant Heinz</li><li>Farrah Forke as Claudia</li><li>Niki Haris as Marcia Drucker</li></ul><p>Additional cast members include Martin Ferrero as a construction clerk, Hazelle Goodman as the mother of a prostitute murdered by Waingro, Patricia Healy as a woman in a relationship with Bosko, and Yvonne Zima as the girl taken hostage by Cheritto. Stuntmen Rick Avery, Bill McIntosh, and Thomas Rosales Jr. portray the ill-fated armored truck guards.</p><br/><h3>Development</h3><h4>Factual basis</h4><p>Heat is based on the true story of Neil McCauley, a calculating criminal and ex-Alcatraz inmate who was tracked down by Detective Chuck Adamson in 1964. In 1961, McCauley was transferred from Alcatraz to McNeil, as mentioned in the film. He was released in 1962 and immediately began planning new crimes. Michael Parille and William Pinkerton used bolt cutters and drills to rob a manufacturing company of diamond drill bits, which is recreated in the film. Pacino's character is largely based on Detective Chuck Adamson, who began keeping tabs on McCauley's crew, knowing that he had begun committing crimes again. The two even met for coffee once, just as portrayed in the film. Their dialogue in the script was based on the conversation that McCauley and Adamson had. The next time that the two met, guns were drawn, just as the movie portrays.</p><p>On March 25, 1964, McCauley and members of his regular crew followed an armored car that delivered money to a National Tea grocery store at 4720 S. Cicero Avenue, Chicago. Once the drop was made, three of the robbers entered the store. They threatened the clerks and stole money bags worth $13,137 (equivalent to $124,000 in 2022) before they sped off in a rainstorm amid police gunfire.</p><p>McCauley's crew was unaware that Adamson and eight other detectives had blocked off all potential exits; the getaway car turned down an alley and the robbers saw the blockade and realized that they were trapped. All four exited the vehicle and began firing. Russell Bredon (or Breaden) and Michael Parille were slain in an alley while Miklos Polesti (on whom Chris Shiherlis is very loosely based) shot his way out and escaped. McCauley was shot to death on the lawn of a nearby home. He was 50 years old and the prime suspect in several burglaries. Polesti was caught days later and sent to prison. Polesti was still alive in 2011.</p><p>Adamson went on to a successful career as a television and film producer, and he died in 2008 at age 71. Michael Mann's 2009 film Public Enemies stated in its end credits \"In memory of Chuck Adamson\".</p><p>The character of Nate played by Jon Voight is based on Edward Bunker, who served as a consultant to Mann on the film.</p><h4>Canceled TV series</h4><p>In 1979, Mann wrote a 180-page draft of Heat. He re-wrote it after making Thief in 1981 hoping to find a director to make it and mentioning it publicly in a promotional interview for his 1983 film The Keep. In the late 1980s, he offered the film to his friend, film director Walter Hill, who turned him down. Following the success of Miami Vice and Crime Story, Mann was to produce a new crime television show for NBC. He turned the script that would become Heat into a 90-minute pilot for a television series featuring the Los Angeles Police Department Robbery–Homicide division, featuring Scott Plank in the role of Hanna and Alex McArthur playing the character of Neil McCauley, renamed to Patrick McLaren. The pilot was shot in only nineteen days, atypical for Mann. The script was abridged down to almost a third of its original length, omitting many subplots that made it into Heat. The network was unhappy with Plank as the lead actor, and asked Mann to recast Hanna's role. Mann declined and the show was canceled and the pilot aired on August 27, 1989, as a television film entitled L.A. Takedown which was later released on VHS and DVD in Europe.</p><br/><h3>Production</h3><h4>Pre-production</h4><p>On April 5, 1994, Mann was reported to have abandoned his earlier plan to shoot a biopic of James Dean in favor of directing Heat, producing it with Art Linson. The film was marketed as the first on-screen appearance of Al Pacino and Robert De Niro together in the same scene – both actors had previously starred in The Godfather Part II, but owing to the film's double story structure, they were never seen in the same scene. Pacino and De Niro were Mann's first choices for the roles of Hanna and McCauley, respectively, and they both immediately agreed to act.</p><p>Mann assigned Janice Polley, a former collaborator on The Last of the Mohicans, as the film's location manager. Scouting locations lasted from August to December 1994. Mann requested locations which had not appeared on film before, in which Polley was successful – fewer than 10 of the 85 filming locations were previously used. The most challenging shooting location proved to be Los Angeles International Airport, with the film crew almost missing out due to a threat to the airport by the Unabomber. On the DVD commentary, Mann noted it would be impossible to film the airport climax in the same way following the events of 9/11.</p><p>To make the long shootout more realistic they hired British ex-Special Air Service sergeant Andy McNab as a technical weapons trainer and adviser. He designed a weapons training curriculum to train the actors for three months using live ammunition before shooting with blanks for the actual take and worked with training them for the bank robbery.</p><h4>Casting</h4><p>De Niro was the first cast member to receive the film script, showing it to Pacino, who also wanted to be a part of the film. De Niro believed that Heat was a \"very good story, had a particular feel to it, a reality and authenticity.\" In 2016, Pacino revealed that he viewed his character as having been under the influence of cocaine throughout the whole film.</p><p>Mann took Kilmer, Sizemore, and De Niro to Folsom State Prison to interview actual career criminals to prepare for their roles. While researching her role, Judd met several former prostitutes who became housewives.</p><p>Keanu Reeves was offered the role of Chris Shiherlis, but he turned it down in favor of playing Hamlet at the Manitoba Theatre Centre. As a result, Val Kilmer was given the role.</p><h4>Filming</h4><p>Principal photography for Heat lasted 107 days during the summer of 1995. All of the shooting was done on location, due to Mann's decision not to use a soundstage.</p><br/><h3>Release</h3><h4>Box office</h4><p>Heat was released on December 15, 1995, and opened at the box office with $8.4 million from 1,325 theaters, finishing in third place behind Jumanji and Toy Story. It went on to have a total gross of $67.4 million in United States box offices, and $120 million in foreign box offices. Heat was ranked the #25 highest-grossing film of 1995.</p><h4>Home media</h4><p>Heat was released on VHS on November 12, 1996 by Warner Home Video. Due to its running time, the film had to be released on two cassettes. A DVD release followed on July 27, 1999. A two-disc special-edition DVD was released by Warner Home Video on February 22, 2005, featuring an audio commentary by Michael Mann, deleted scenes, and numerous documentaries detailing the film's production. This edition contains the original theatrical cut.</p><p>The initial Blu-ray Disc was released by Warner Home Video on November 10, 2009, featuring a high-definition film transfer, supervised by Mann. Among the disc extras were Mann's audio commentary, a one-hour documentary about the making of the film and ten minutes worth of scenes cut from the film. As well as approving the look of the transfer, Mann also recut two scenes slightly differently, referring to them as \"new content changes\".</p><p>A Director's Definitive Edition Blu-ray was released on May 9, 2017, by 20th Century Fox Home Entertainment, who acquired the distribution rights to the film through their part-ownership of Regency back in 2015. Sourced from a 4K remaster of the film supervised by Mann, the two-disc set contains all the extras from the 2009 Blu-ray, along with two filmmakers panels from 2015 and 2016, one of which was moderated by Christopher Nolan. A 4K Ultra HD Blu-ray Ultimate Collector's Edition of Heat that contains the Director's Definitive Edition of the film on UHD Blu-ray and Blu-ray along with legacy bonus materials was released on August 9, 2022 by Walt Disney Studios Home Entertainment, coinciding with the release date of Mann's sequel novel. Unlike the previous home media releases, the Director's Definitive Edition Blu-ray and the 4K Ultra HD Blu-ray Ultimate Collector's Edition did not feature the Warner Bros. Pictures logo at the beginning, although the in-credit closing is retained.</p><p>Heat was broadcast on NBC television on January 3, 1999, in a significantly edited version. Mann had offered the network scenes which had been filmed but omitted from the theatrical edit in hopes of having the film shown in four hours (with commercials) over two nights. Instead, NBC chose to cut nearly 40 minutes from the theatrical version so that Heat could be shown in a three-hour time slot (with commercials). Mann told Variety, \"They cut so much out of the movie that they destroyed the narrative of the film along with its integrity.... Too much time was taken out of the film that wasn't due to language or other content.\" As a result, Mann had his director's credit on the TV version replaced with the pseudonym \"Alan Smithee\".</p><h4>Reception</h4><p>On Rotten Tomatoes the film holds an approval rating of 88% based on 83 reviews and an average rating of 7.9/10. The website's critical consensus reads, \"Though Al Pacino and Robert De Niro share but a handful of screen minutes together, Heat is an engrossing crime drama that draws compelling performances from its stars – and confirms Michael Mann's mastery of the genre.\" On Metacritic, the film has a weighted average score of 76 out of 100, based on 22 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.</p><p>Roger Ebert gave the film three and a half stars out of four. He described Mann's script as \"uncommonly literate\", with a psychological insight into the symbiotic relationship between police and criminals, and the fractured intimacy between the male and female characters: \"It's not just an action picture. Above all, the dialogue is complex enough to allow the characters to say what they're thinking: They are eloquent, insightful, fanciful, poetic when necessary. They're not trapped with cliches. Of the many imprisonments possible in our world, one of the worst must be to be inarticulate – to be unable to tell another person what you really feel.\" Simon Cote of The Austin Chronicle called the film \"one of the most intelligent crime-thrillers to come along in years\", and said Pacino and De Niro's scenes together were \"poignant and gripping.\"</p><p>Kenneth Turan of the Los Angeles Times called the film a \"sleek, accomplished piece of work, meticulously controlled and completely involving. The dark end of the street doesn't get much more inviting than this.\" Todd McCarthy of Variety wrote, \"Stunningly made and incisively acted by a large and terrific cast, Michael Mann's ambitious study of the relativity of good and evil stands apart from other films of its type by virtue of its extraordinarily rich characterizations and its thoughtful, deeply melancholy take on modern life.\" Owen Gleiberman of Entertainment Weekly gave it a B− rating, saying that \"Mann's action scenes ... have an existential, you-are-there jitteriness,\" but called the heist-planning and Hanna's investigation scenes \"dry, talky.\"</p><p>Rolling Stone ranked Heat #28 on its list of \"The 100 Greatest Movies of the '90s\", and The Guardian ranked it #22 on its list of \"The Greatest Crime Films of All Time\", while other publications have noted its influence on numerous subsequent films.</p><br/><h3>Soundtrack</h3><p>On December 19, 1995, Warner Bros. Records released a soundtrack album on cassette and CD to accompany the film, entitled Heat: Music from the Motion Picture. The album was produced by Matthias Gohl. It contains a 29-minute selection of the film score composed by Elliot Goldenthal, as well as songs by other artists such as U2 and Brian Eno (collaborating as Passengers), Terje Rypdal, Moby, and Lisa Gerrard. Heat used an abridged instrumental rendition of the Joy Division song \"New Dawn Fades\" by Moby, which also features in the same form on the soundtrack album. Mann reused the Einstürzende Neubauten track \"Armenia\" in his 1999 film The Insider. The film ends with Moby's \"God Moving Over the Face of the Waters\", a different version of which was included at the end of the soundtrack album.</p><p>Mann and Goldenthal decided on an atmospheric situation for the film soundtrack. Goldenthal used a setup consisting of multiple guitars, which he termed \"guitar orchestra\", and thought it brought the film score closer to a European style. The soundtrack was noted for lack of a central theme. Christian Clemmensen of Filmtracks.com criticized the omission from the album of much music heard in the film due to the film's length, but praised the album as a decent listening experience, and Goldenthal's score as \"psychologically engaging and intellectually challenging\", believing it to be one of Goldenthal's best. AllMusic called it a \"soundtrack for the mind ... full of twists and turns\". Musicfromthemovies.com thought of the album as uncharacteristic for Goldenthal's style, calling the atmosphere \"absolutely electrifying\".</p><br/><h3>Impact</h3><p>French gangster Rédoine Faïd told Mann at a film festival \"You were my technical adviser\". The media described later robberies as resembling scenes from Heat, including armored car robberies in South Africa, Colombia, Denmark, and Norway and the 1997 North Hollywood shootout, in which Larry Phillips, Jr. and Emil Mătăsăreanu robbed the North Hollywood branch of the Bank of America and, similarly to the film, were confronted by the LAPD as they left the bank. Phillips had a copy of the movie where he lived. This shootout is considered one of the longest and bloodiest events of its type in American police history. Both robbers were killed, and eleven police officers and seven civilians were injured during the shootout. Heat was widely referenced during the coverage of the shootout.</p><p>For his film The Dark Knight, director Christopher Nolan drew inspiration in his portrayal of Gotham City from Heat in order \"to tell a very large, city story or the story of a city\". In 2016, a year after the 20th anniversary of Heat, Nolan moderated a Q&A session with Michael Mann and cast and crew at the Samuel Goldwyn Theater.</p><p>Heat was one of the inspirations behind the highly influential 2001 video game Grand Theft Auto III as well as the 2008 sequel Grand Theft Auto IV, notably the mission \"Three Leaf Clover\", which was inspired by the climactic bank robbery and police shootout, and the 2013 sequel Grand Theft Auto V, notably the mission \"Blitz Play\" where the crew blocks and then knocks over an armored car in order to rob it.</p><p>Director Mia Hansen-Løve has said she is \"obsessed\" with Heat and said \"the themes of Heat, actually, are themes of my films, except in a very different way, in a very different world\".</p><br/><h3>Subsequent works</h3><p>On March 16, 2016, Mann announced that he was developing a Heat prequel novel, as a part of launching his company Michael Mann Books. On April 27, 2017, Reed Farrel Coleman joined the project as co-author. On May 15, 2020, Mann stated that the novel would function as both a prequel and a sequel, with plot taking place before and after the film's main events. By January 19, 2022, it was revealed that the novel would be a collaboration between Mann and Meg Gardiner; it was subsequently released in August 2022. The title is Heat 2.</p><p>In September 2019, Michael Mann stated that he intends to produce an adaptation of the novel, acknowledging film and television as possible mediums for release. By July 5, 2022, Mann reaffirmed his plans to adapt the novel follow-up into a feature film, while stating that the principal cast from the first installment may be recast for the adaptation. In April 2023, it was reported that the sequel was in development, with Adam Driver in talks to play young McCauley.</p><br/>"
  },
  "errorMessage": ""
}