{
  "imDbId": "tt0032138",
  "title": "The Wizard of Oz",
  "fullTitle": "The Wizard of Oz (1939)",
  "type": "Movie",
  "year": "1939",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/wizard-of-oz-the",
      "rate": "100",
      "content": "Not only is it wonderfully entertaining, but the issues it addresses, and the way it presents them, are both universal and deeply personal. And therein lies The Wizard of Oz's true magic."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Peter Stack",
      "link": "https://www.sfgate.com/movies/article/Restored-Wizard-Gets-Ahs-2980663.php",
      "rate": "100",
      "content": "This wonderful romp of a movie looks magical on the big screen: colors are a picnic for the eyes, details loom so clearly you can practically touch them and there's a sense of the larger-than-life with a film that's already larger than life."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "https://variety.com/1998/film/reviews/the-wizard-of-oz-6-1200456055/",
      "rate": "100",
      "content": "This is one vintage film that fully lives up to its classic status and should play with outstanding success to contemporary audiences of all ages."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "100",
      "content": "The Wizard of Oz remains the weirdest, scariest, kookiest, most haunting and indelible kid-flick-that's-really-for-adults ever made in Hollywood."
    },
    {
      "publisher": "",
      "author": "BBC",
      "link": "https://www.bbc.co.uk/films/2000/12/18/wizard_of_oz_1939_review.shtml",
      "rate": "100",
      "content": "Each time it is shown, this extraordinary film embraces a new generation of children who succumb to its magic."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-the-wizard-of-oz-1939",
      "rate": "100",
      "content": "The Wizard of Oz has a wonderful surface of comedy and music, special effects and excitement, but we still watch it six decades later because its underlying story penetrates straight to the deepest insecurities of childhood, stirs them and then reassures them."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2006/dec/15/family.musical",
      "rate": "100",
      "content": "Despite its earnest endorsement of the idea that there's no place like home ... well, frankly there are plenty of places like boring old home, but nothing's like Oz."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kate Cameron",
      "link": "https://www.nydailynews.com/entertainment/movies/wizard-oz-instant-disney-classic-1939-review-article-1.2330990",
      "rate": "100",
      "content": "Judy Garland is perfectly cast as Dorothy. She is as clever a little actress as she is a singer and her special style of vocalizing is ideally adapted to the music of the picture."
    },
    {
      "publisher": "The New York Times",
      "author": "Frank S. Nugent",
      "link": "https://www.nytimes.com/1939/08/18/archives/the-screen-in-review-the-wizard-of-oz-produced-by-the-wizards-of.html",
      "rate": "90",
      "content": "A delightful piece of wonder-working which had the youngsters' eyes shining and brought a quietly amused gleam to the wiser ones of the oldsters."
    },
    {
      "publisher": "",
      "author": "The New Yorker",
      "link": "https://www.newyorker.com/magazine/1939/08/19/the-wizard-of-hollywood",
      "rate": "40",
      "content": "Fantasy is still Walt Disney’s undisputed domain. Nobody else can tell a fairy tale with his clarity of imagination, his simple good taste, or his technical ingenuity. This was forcibly borne in on me as I sat cringing before M-G-M’s Technicolor production of The Wizard of Oz, which displays no trace of imagination, good taste, or ingenuity."
    }
  ],
  "errorMessage": ""
}