{
  "imDbId": "tt0032138",
  "title": "The Wizard of Oz",
  "fullTitle": "The Wizard of Oz (1939)",
  "type": "Movie",
  "year": "1939",
  "items": [
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0020959",
      "warningSpoilers": false,
      "date": "27 September 2004",
      "rate": "",
      "helpful": "123 out of 137 found this helpful.",
      "title": "Still Has Its Magic",
      "content": "Judy Garland's portrayal of Dorothy, Dorothy's oddball Oz friends, \"Somewhere Over the Rainbow\", and the rest of this fine production of \"The Wizard of Oz\" have lost little of their magic over the years. While it has become oddly fashionable in recent years to deride this kind of classic, innocent fantasy, the movie itself has aged very well, and it is likely to retain an appreciative audience for some time to come.There's no doubt that part of the appeal of the story and the characters comes from them being such old friends to so many cinema fans, but there are also good reasons why they have endured for so long, and have been able to hold up even after becoming so familiar. Although Dorothy is not a particularly complex character, she represents an innocent but deep yearning that is easy to identify with. Likewise, the 'Oz' characters are bizarre enough to remain interesting, but there is a core of substance that again is easy to believe in. Who does not feel that he or she could use at least one of the things that Dorothy's friends want?The adaptation from the original story is done quite well, making fine choices for the characters and episodes that would work on film. The settings and visual effects may not impress the devotees of today's computer imagery, but in their time they certainly demonstrated a great deal of skill and planning, and even now, in their own way they are more believable than are most of the computer tricks that have become so overused.The popular story has also been used for a number of more recent adaptations, and some of them have had some good points of their own. But this Wizard remains by far the most wonderful of the versions of the classic tale."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2021748",
      "warningSpoilers": false,
      "date": "12 February 2009",
      "rate": "10",
      "helpful": "29 out of 32 found this helpful.",
      "title": "My childhood favourite!",
      "content": "I am 16, and I still love this movie. I grew up watching this, Chitty Chitty Bang Bang and Meet Me in Saint Louis, and I never tire of them. Judy Garland is wonderful as Dorothy, bringing a sense of vulnerability and sadness to the role, making Over The Rainbow more poignant than it already was. Ray Bolger, Jack Haley and Bert Lahr are really entertaining as her three friends. Billie Burke as Glinda, and the Munchkins were great fun too. The wicked witch of the west scared the life out of me here and still does, and even Frank Morgan does 5 roles to great comical effect. The songs are just fabulous, and so is the cinematography and the stunning scenery. True, the film isn't completely faithful to the book, but why does it have to be? If I had one minor drawback, it would be the singing voice of the Lion, but apart from that, this movie is a must-see! 10/10. Bethany Cox"
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1995796",
      "warningSpoilers": false,
      "date": "26 December 2008",
      "rate": "10",
      "helpful": "53 out of 61 found this helpful.",
      "title": "Timeless classic still entertaining the masses as each new generation comes in.",
      "content": "Dorothy is a young girl living on a Kansas farm, during a tornado, she, along with her dog Toto, is swept up and plonked down in a magical and mysterious land known as Oz. Desperate to get back home and under threat from a wicked witch, she is advised to seek out a great wizard who should be able to help her get back home. As she sets off and on her way, she meets and befriends a wonderful array of characters whom also have something to ask of the fabled wizard. It's a journey that will prove to be both magical and fraught with danger.The Wizard Of Oz is a film that has been pored over and dissected from almost everyone involved in the wonderful world of film. One thing that strikes me every time I view it is that there not only is no place like home, there is also no film like The Wizard Of Oz, and really, when all is said and done, there is unlikely to be another film of its ilk to ever grace the silver screen. Upon multiple viewings only the most biased of film fan could say that it is a technically perfect picture, it clearly isn't, for at times it's a wee bit creaky and when scrutinised, some of the performances in the piece are far from being of an excellent standard. Crucially, though, any misgivings are quickly erased due to the utter wonder of it all, you see this is because the film has a beguiling ability to transport everybody who is watching it and slot them into OZ alongside Dorothy.The Wizard Of Oz appeals (and caters) to every demographic and pretty much any age group, we have adventure, the meeting of new friends, fears and trepidations, booming colour, songs to singalong with, and of course the total crux point of homely values. The Wizard Of Oz stands up well 80 years later because it taps into all the emotions available to the human being. Be it a young child spellbound on a first viewing, or an octogenarian couple of grandparents wistfully humming along to the tunes, it's a film that shouldn't be dissected looking for faults and hidden meanings, it's a film that should be loved and praised for the ode to fantastical whimsy that it so obviously is.The film of course will forever be associated with its darling star, Judy Garland. Viewing now, and knowing what a sad life she would eventually lead, The Wizard Of Oz is a fitting picture on which to remember what a magical and wonderful performer she was. Myself as a lump of waning middle aged machismo, has no shame in saying that as Judy sings Somewhere Over The Rainbow I melt and feel as though I'm being sent spinning into another world, that's the power of the piece, because as a sepia Kansas becomes the glorious colour of Oz, nothing else in my world matters, I'm in hook line and sinker.There are many interesting back stories to the picture, with books galore available to anyone interested. Some notes that might interest you being the original castings to be W.C. Fields, Shirley Temple and Deanna Durbin, munchkins running riot, drunken cast members, sadness and suicides, and grizzled old pros fighting hard not to let Garland steal the picture. Well it makes for a great read, for sure, but what remains to this day is one of the most beloved pictures to have ever been made, for once in the pantheon of great cinema we have a film that is termed a classic, that actually deserves to have that tag!One of the great things about the advent of technology is that it can benefit old classic movies to make them better, for now we can view remastered editions of The Wizard Of Oz and appreciate even more what a great job the makers did. Keep your eyes on Dorothy's Ruby Slippers during the film and see how they are the sparkling important character that they should be, or take in the brilliant work of the make up crew, the tiniest of rivets on The Tin Man a testament to the brilliant work that goes into bringing magic to our lives. Get the newest copy you can and then also see it on the biggest screen available to you because The Wizard Of Oz is a 10/10 movie. And then some."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2792136",
      "warningSpoilers": false,
      "date": "4 May 2013",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Perhaps the most well known and watched film in history?",
      "content": "This film predates my birth by 19 years, so I've seen it as a child when it was an annual event on network TV, stretched out to hours in length, believably due to commercials and maybe not so believably today due to the network hosting and talking about the film a little during breaks.Today at age 55, when it shows up on Turner Classic Movies, even though I have in my possession the deluxe \"Wizard of Oz DVD Set and Museum in a Box\", I'll still stop and watch it from whatever point I catch it to the end. Having the advantage of having seen it at all ages I can truly say that it has enough fantasy and whimsy and spectacle to keep the interest of children without being inane so that adults cannot appreciate it too. I think in all of filmdom only Walt Disney in Walt's time with his animated features and Pixar in modern times have been able to strike that balance. Even \"Star Wars\" has lost a step or two in the 36 years since its release.Wizard of Oz has the universal themes of the value of friendship and family, of how many of us have strengths and virtues inside of us we'll never believe we have until tested, and how many powerful people are literally all hot air. \"Pay no attention to that man behind the curtain\" is practically a slogan of American politics as I am writing this in the year 2013. Then there is beautiful Judy Garland when her exterior still matched her voice, before the studio system chewed her up and literally spit her out. She was never more lovely than she is right here. You'd never believe Billie Burke as the good witch Glenda is 55 years old. You'd never believe that Margaret Hamilton as The Bad Witch is only 37. I remember seeing her on a daytime commercial in the 1960's as a child and thinking \"Isn't she dead yet?\" There is maybe one aspect of this film that is uniquely pre-WWII. The theme of the film - \"Never look for anything if you can't find it in your own backyard\" is a motto for the isolationist years between the wars that would be left behind in only a couple of years when it became apparent that the U.S. would have to confront the evil expansionist powers growing on both sides of the globe. It is perhaps a unique snapshot in time in that regard only. It also shows the best the studio system could produce in that fabled year of 1939 when it was at the height of its power.Forgive me for yammering on about a film that has been reviewed hundreds of times, but this one will always have a special place in my heart and my memory."
    },
    {
      "username": "The_Film_Cricket",
      "userUrl": "https://www.imdb.com/user/ur0310469",
      "reviewLink": "https://www.imdb.com/review/rw0020949",
      "warningSpoilers": false,
      "date": "30 May 2004",
      "rate": "",
      "helpful": "217 out of 264 found this helpful.",
      "title": "A fantasy rooted in the landscape of your childhood.",
      "content": "I have a theory that this movie has probably been seen by more people than any other movie. The fact that it comes to us as children is probably the reason why. Other films like 'Gone With the Wind', 'Citizen Kane', 'The Godfather', 'Star Wars', have been seen by a lot of people but in each case I can imagine people that might not have seen them. In the case of 'The Wizard of Oz' it's hard to imagine anyone who might not have seen it at some point in their lives. Almost everyone you talk to has a memory of their first experience. The reason this movie remains the most beloved of Hollywood films even after six decades is because 'The Wizard of Oz' is unique among motion pictures in that it mirrors our longings and imaginations as children. The movie, in front of and behind the scenes, has become movie folklore. We love the legends about the rotating directors, from George Cukor to King Vidor to Victor Fleming. We know the legend of Buddy Ebsen who had to drop out due to an allergic reaction to the Tin Man makeup and Margaret Hamilton whose dress caught fire and nearly had her face burned off because of the copper-based make-up. We love stories about the problems on the set between personal feuds, sweltering costumes, partying munchkins and the costume designer who had to keep up with Judy Garland's developing bust line. There's even a spurious legend of a ghost on the set. All of these elements make 'The Wizard of Oz' a much bigger legend than it already it, but that's okay because this is the one movie that deserves to be over-hyped. It occupies such a large part of our memories that we want to make it more than it is, to just have one more reason to make it more than a movie, we want it to be a life experience.That experience is brought to us because we are intimately familiar with its story elements. The dreams that Dorothy sings about and the adventure that follows seem to mirror our yearnings as children. She imagines a bigger place where her problems don't linger and she is free to explore them. She imagines a place where there isn't any trouble and people actually listen to what she has to say. She sees the rainbow as her golden gate to a better place because in her drab Kansas world, the rainbow is the only source of color that she knows. She dreams of a bigger place and imagines a world where troubles melt like lemondrops. We can relate. How many of us as kids sat in our room or in our yards and played, imagining a place to go and characters to interact with, a colorful world bigger than our small, confined worlds. Oz is meant to represent the colorful palette of our imagination but for Dorothy it is also a place where she does some growing up. The three friends that she meets along the way, The Scarecrow, The Tin Man and The Lion are emblematic of the lessons of bravery, love and devotion and the ability to think for ourselves. The Wicked Witch of the West certainly represents the real dangers along the way. For Dorothy there is a matronly figure, Glinda the Good Witch who intends for Dorothy to discover for herself how to solve her problems, she knows that Dorothy must grow up along the way. In a way, she seems to represent the parent that Dorothy doesn't have back in Kansas. Her aunt and uncle love her but this was a movie made during the depression and we imagine the climate that they live in, where work means keeping the farm. No work = no farm = no home.For 1939, Dorothy was the perfect character for young girls. She echoes many of the small town country girls who, in the midst of the depression, packed their suitcases and ran to Hollywood seeking fame and fortune in the movies. For them this film is a cautionary tale that they'd be better off if they just stayed home. Judy Garland was perfect in the role, 17 at the time, but with wide-eyes and a beautiful, open face she carries that sense of wonderment of a child. Like most of us as children, her only true companion is a dog named Toto and the most frightening moment in the film is when she is nearly robbed of her best friend. When she sings 'Over the Rainbow' we know that it's to escape an unhappy childhood (she has apparently lost her parents) and for Garland we identify. She began in show business as a kiddie act with her sisters and began her long movie career when she was only 13. She was already a familiar face from 'Love Finds Andy Hardy' and by the time of 'Oz' she was already under contract to MGM. That she was familiar to audiences helped her in the role. That familiarity works well with her ability to project the vulnerability and melancholy that the character has to have. We have to believe that she will become frightened and that her life will be in danger because if she doesn't that we sense that the character can work her way out of the situation herself and our interest wanes.If movies are a time capsule than 'The Wizard of Oz' wonderfully captures a brief moment of happiness in Garland's life. We know of her problems with studio execs that put her through an exhausting schedule and used drugs to get her going in the morning then put her to sleep at night. We know the legends of her mental and physical problems that dogged her most of her life but 'The Wizard of Oz' sees her at a moment in her life when it all seemed perfect, just as her star was rising and before her problems really began. There's poignancy in that, and that's why I think that the casting of Shirley Temple in the role would have been a mistake. By 1939, Temple was the biggest star in the world her presence in the film would have been too much, she would have stood out and we would only seen Shirley Temple, not Dorothy Gale.Garland's presence allows the story a certain credibility. I have tried to imagine that famous dance down the Yellow Brick Road with a 4 foot child and it just doesn't fit.If Garland gives the film its center than I think the production design, awe-inspiring in 1939, is the perfect backdrop. In these early musicals filmed on a soundstage it isn't hard to spot where the soundstage ends. Some have seen that as a flaw but I think it adds to the dreamlike quality of the film. The matte paintings behind the sets add to the storybook quality. The fact that we're in a dream makes it okay that the special effects look a little hasty. That was the genius of the screenplay, that and to establish the Oz characters as characters that Dorothy meets in Kansas. In our dreams we often see people and events that have recently occurred in our lives, but this is the first time I've ever seen it expressed in a movie. In particular is the notion that Professor Marvel keeps showing up as various characters in the dream.What generosity the filmmakers had. What ingenuity to create this entire world that is colorful and beautiful and scary. What depth of character they created. What messages they send. This is a movie constructed with loving care. We're told that those who worked on the film just thought of this as just another movie, but when I watch the film I find that hard to believe. Certainly from the screenwriters. I wonder if they saw how brilliantly they were tapping our frustrations and our excitement, our dreams, our need and our sense of wonderment. I wonder if they knew the impact of what they were working on, that the lovely sentiments that they created would still resonate 60 years later. I wonder if they knew that their heart's desires weren't that far from our own."
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1215340",
      "warningSpoilers": true,
      "date": "13 November 2005",
      "rate": "10",
      "helpful": "68 out of 79 found this helpful.",
      "title": "Finding Her Way Back Home -- To Our Hearts.",
      "content": "Even with the advance of special effects there will never be a movie as honest and as true to its heart as THE WIZARD OF OZ, with the exception of THE LORD OF THE RINGS TRILOGY. But since the latter is too new, it can't be compared to the former. Everyone at one point of their lives, especially as children, has seen this film and has experienced the emotions that Dorothy experienced, the terror of entering the Wicked Witch's lair, her transition from little girl to wise young woman, and this incredible world that L. Frank Baum created and Hollywood perfected.What makes a great movie? The experience that you are watching it for the very first time, whether you were seven years old or an adult living in an adult world. This film is one of those. Even when as an adult I can see some of the cracks peeking through and some lapses in continuity, who cares? The tornado ripping through the cornfields is as real as the real ones I have seen even though is was really muslin. The moment that the sepia-tones from the Kansas segment peel away and Dorothy opens the door of her house and I saw the bright colors of Oz I knew I was there. The story had enveloped me now, as it had did back then. In my world, this is an utterly, fantastic film.And what is Oz, by the way? Well, from a little girl (and the child in all of us), it's that place where our imagination runs wild, where everything is perfect, where there is no tomorrow and a yellow brick road will take us to that perfect place filled with song. It's that place where we feel we will belong, and who as a child didn't feel like we were out of place? Notice I repeat the word 'place' because this is so much about placement, places, our place and therefore, our own self-expression, our own sense of self. Who hasn't wanted to \"seek a place of one's own' where light and love prevailed only to return back to where we came from, stronger and wiser? Its message is so universal. Truly, there is no place like home.Timing is crucial for the symbolic success of this movie as well. Still in the middle of the Depression years, when unemployment was at an all time high, it focuses not just on the harshness of keeping a farm, but then throwing a parent-less girl into a strange land who finds a foster mother of sorts who would tell her that the way back home would not be an easy one. Glinda the Good represents this character, the same way, the Wicked Witch of the West represents the darker forces that watch her every move and aggressively try to trip her up. This is quite a lot on the shoulders of a little girl, and having Judy Garland -- not yet the major star but just on the brink of becoming one -- play Dorothy Gale has become casting history. In 1939 she was about seventeen, fresh-faced, innocent and vulnerable: she is Dorothy, and we can't imagine anyone else, not even nearly 70 years later.And speaking of casting, it was genius to have the actors playing Dorothy's friends and enemies in Kansas also show up in Oz. Since the movie is so much like a dream, it's more than logical: many people in our lives sometimes show up in dreams -- it's even in books about dreams. That they also represent that which not only they, but Dorothy most of all, lacks -- courage, love, and wisdom -- makes their appearances even more intrinsic to the story, so when they grow as characters, so do we, and of course, so does Dorothy.THE WIZARD OF OZ is timeless. So simple, so honest, but so deep in its messages about love and self-discovery. All of the actors including the veteran Billie Burke would be remembered the most for their roles here more than any other movie. The set direction is made to look as close to a storybook; all that is missing are the page frames. There isn't a false move here, and all those back-stories... well, their okay to read but for the cinema lover looking for magic, it's all here, in about two hours of pure entertainment."
    },
    {
      "username": "utgard14",
      "userUrl": "https://www.imdb.com/user/ur1896124",
      "reviewLink": "https://www.imdb.com/review/rw3132487",
      "warningSpoilers": false,
      "date": "29 November 2014",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Flawless",
      "content": "The most difficult thing about reviewing The Wizard of Oz is finding something to say about it that doesn't begin with \"the best.\" It's hard to argue that this isn't a strong contender for the greatest movie of all time. Navel-gazing dramas about the human condition are fine, and I know most critics' lists would give preference to those sorts of films, but this movie has a little bit of everything and is easily among the most perfect films ever made. It doesn't matter if you're a kid or a grown-up. The Wizard of Oz is a timeless classic that has appeal for every open-hearted person out there. It's full of iconic lines, songs, characters, and moments. It's had a cultural impact few films do. So many things from the film have made their way into our everyday lives and language. If I had to single out one thing about it I love more than the memorable characters played by an ideal cast, exuberant Arlen & Harburg songs, delightful story, and beautiful sets, costumes, and matte painting backdrops, it would be the vibrant and rich Technicolor. It's such a gorgeous looking movie. Funny, sentimental, sincere -- it's a masterpiece that I've been in love with since I was a little kid. I've never grown tired of it and I hope I never do."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw8758686",
      "warningSpoilers": false,
      "date": "26 December 2022",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "A magical experience.",
      "content": "Young Dorothy runs away from home with her dog Toto, after a tornado hits, she's transported to the magical world of Oz.It is such an uplifting, magical escape, it is no wonder this film is loved by so many, all age groups, it really does survive the ages.It really is an enchanting story, and in terms of its importance in the film industry, it was a game changer, audiences must have been left speechless when this first landed.1939, and it still looks remarkably good, the scenes where the tornado hits look fantastic, considering the technological restraints, it looks particularly good.Judy Garland is delightful throughout, Margaret Hamilton is a riot as The Wicked Witch of The West. The performances are all so good.The music is so well known, so uplifting, and at times pretty moving.I wonder if they even considered for one second that their movie would be loved decades later.10/10."
    },
    {
      "username": "anaconda-40658",
      "userUrl": "https://www.imdb.com/user/ur60028700",
      "reviewLink": "https://www.imdb.com/review/rw3310289",
      "warningSpoilers": true,
      "date": "3 September 2015",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Garland's Oz.",
      "content": "The Wizard of Oz (1939): Dir: Victor Fleming / Cast: Judy Garland, Ray Bolger, Jack Haley, Bert Lahr, Margaret Hamilton: Sensational treasure about mind and imagination. Judy Garland plays Dorothy, a farm girl who, in the midst of a tornado, is spirited away over the rainbow to the glorious land of Oz. She is greeted by numerous Munchkins after her house lands on the Wicked Witch of the East. This angers the Wicked Witch of the West who demands the ruby slippers, which have appeared on Dorothy's feet. To return to Kansas she must follow the yellow brick road to the Emerald City and seek help from the wizard. On the way she encounters a scarecrow who needs a brain, a tin man who needs a heart, and a cowardly lion who needs courage. Skillfully directed by Victor Fleming whose luck had him direct this film and Gone With the Wind the same year. Garland graces the screen with her innocence and beautiful singing voice that belts out \"Over the Rainbow.\" Margaret Hamilton plays the menacing wicked witch whose defeat is one of the great scenes due to its simplicity. Ray Bolger, Jack Haley and Bert Lahr are wonderfully cast as Dorothy's companions. Margaret Hamilton gives a menacing performance as the Wicked Witch of the west. It regards important things taken for granted. Triumphant visual wonder that renders that \"you're not in Kansas anymore.\" Score: 10 / 10"
    },
    {
      "username": "robb_772",
      "userUrl": "https://www.imdb.com/user/ur5390919",
      "reviewLink": "https://www.imdb.com/review/rw1361453",
      "warningSpoilers": false,
      "date": "7 May 2006",
      "rate": "10",
      "helpful": "123 out of 141 found this helpful.",
      "title": "A true cinematic milestone",
      "content": "Where to begin? MGM's elaborate adaptation of L. Frank Baum's 1900 fantasy classic THE WONDERFUL WIZARD OF OZ not only became an institution among itself (and practically defined the concept of modern popular culture), but is reported to be the most viewed film ever made. A sharp screenplay effectively condenses the novel's text into a workable film, and director Victor Fleming (along with countless other behind-the-scenes technicians) craft a visually stimulating fantasy world that surpasses the expectations of even the most imaginative viewers. Brimming with stunning visual effects (the film's fierce tornado is an FX feat that has yet to be surpassed by CGI), witty dialogue, and eye-popping Technicolor, THE WIZARD OF OZ truly lives up to it's reputation as a once-in-a-lifetime film where every element comes together flawlessly.The cast could not be improved upon. The quivery-voiced, solemn-faced Judy Garland will always be Dorothy, the little lost farm girl on the road to Oz, clutching her beloved Toto (impressively portrayed himself by the female canine performer Terry, the terrier). It seems inconceivable that MGM had originally wished to cast Shirley Temple in the role, as Temple's doe-eyed, cutesy-voiced shtick would have been a catastrophic ill-fit for the tone of this picture. Conversely, Garland is perhaps the screen's quintessential woman/child; always seemingly just one step away from reaching full emotional maturity. It is her sadness that transfixes viewers to the screen, the exact same quality that made the film's most memorable Harold Arlen/E. Y. Harburg number \"Over the Rainbow\" into one of the most exquisite marriages between artist and song ever to be recorded.The remainder of the cast is similarly exceptional, many of whom perform perfectly even under the most debilitating make-up and costumes. Frank Morgan is marvelously versatile in no less than five roles, the insanely energetic Bert Lahr mugs brilliantly, the handsome Jack Haley swoons sweetly, Billie Burke lends the film an ornate ethereality, and Ray Bolger's gravity-defying physical presence nearly steals the entire picture on several occasions. Perhaps most notable is former schoolteacher Margaret Hamilton's transformation into the wickedest of wicked witches, which certainly remains among the vilest and most terrifying portrayals of full-throttle evil ever to be seen. No matter how it is analyzed, scrutinized, or satirized, the 1939 production of THE WIZARD OF OZ is a top-notch example of how to turn a great story into a fabulous, milestone of a film."
    },
    {
      "username": "Rainey-Dawn",
      "userUrl": "https://www.imdb.com/user/ur35635716",
      "reviewLink": "https://www.imdb.com/review/rw3038532",
      "warningSpoilers": false,
      "date": "23 June 2014",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Fantasy Classic",
      "content": "The Wizard of Oz is a long time favorite of mine. One I used to watch every Easter with my family. It is a delightful classic film.This film I believe most all movie watchers have seen and have drawn their own conclusions as to whether or not they like the film.I know of hard-core blood and gore fans that enjoys The Wizard of Oz due to it's darker tones (witches, wizards and evil flying monkeys). And there are others that I know of that prefer a more \"wholesome\" style to their films which include this movie. Really this film brings together people who are basically different from each other - from hard-cores all the way to wholesome - not many movies have this capability.10/10"
    },
    {
      "username": "rzajac",
      "userUrl": "https://www.imdb.com/user/ur1517556",
      "reviewLink": "https://www.imdb.com/review/rw0961291",
      "warningSpoilers": false,
      "date": "12 November 2004",
      "rate": "",
      "helpful": "163 out of 201 found this helpful.",
      "title": "a milestone",
      "content": "People talk about The Wizard of Oz as a backdrop to their lives; and how true that is. I just saw it again, DVD, for the first time in--gosh!--20 years. There was a little art house in Lansing Michigan USA that ran it back then, on the popular premise that there's nothing like TWoO on \"the big screen.\" That's the last time I'd seen it, 'til today.I guess the part that \"gets\" me about the movie is how the writers made it pretty plain that the Scarecrow, Tin Man, and Cowardly Lion really already had what they thought they were missing; that their respective problems were in misapprehending their own complete natures. That's a powerful statement for many of us. I found myself most touched in scenes where the Scarecrow was showing wisdom, the Tin Man feeling deeply (\"...when I think of Dorothy in that awful place...\"), and the Lion...well, maybe accomplishing this effect was harder in his case...what *is* true courage?Anyway, if you're reading this here, you must be a movie weenie, and you've no doubt already seen the movie, so I'm not going to recite the usual \"go see this movie\" mantra.I was just very touching to see this movie again, at this phase in my life.I will mention a few more things about how I now see this movie as a \"growed up\" (I'm almost 50): It's interesting how you can see the production values of the time; the lot sets and special effects and so forth. This movie is a powerful example of how a good story overcomes limited means in other areas.People who look back with disdain on the low-tech chintz of old movies can see in TWoO the magic ingredient; narrative solidity. And I'm not a pollyanna about this: I'm sure the underlying reality behind its making is rife with horror stories of expert disagreement, rewrites, discarding, jerryrigging, and the rest of it. But in the end, something like narrative love won out; and that's the important thing.Oh: And having Harold Arlen write the music was good luck indeed. And orchestrations which cleverly appropriated very tasty new ideas in composition (polymodalism, non-standard phrasings, etc.) didn't hurt, either!Geez, this movie is such a little universe....I'd better stop here."
    },
    {
      "username": "atlasmb",
      "userUrl": "https://www.imdb.com/user/ur34845698",
      "reviewLink": "https://www.imdb.com/review/rw3026428",
      "warningSpoilers": true,
      "date": "1 June 2014",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "A Great and Powerful Film",
      "content": "Released in 1939, \"The Wizard of Oz\" is a classic American film that had a modest start. After its release, and for many years, it was viewed as an entertaining film but not as a great film. When I was a child, it aired on network TV once a year, around Thanksgiving. Whole families would gather around their sets for this special annual viewing.Later, when films became more widely available, its reputation seemed to grow and one would find it included in the lists of \"best\" films. Personally, I have always loved \"The Wizard of Oz\". I have seen it so many times, I practically know it frame by frame, as I am sure many others do.Here are some of the reasons this film should be considered great and powerful:1. The Beginning: The first part of the film, which is filmed in rich sepia tones, includes comedy, suspense, drama, music, and the establishment of all main characters.2. The tornado: The special effects used to create the menacing tornado are spectacular. It is still an emotionally charged element, despite our exposure to the spectacles of modern CGI.3. The song: \"Somewhere Over the Rainbow\" is regarded as one of the best film songs of all time. The film almost starred Shirley Temple and MGM wanted to cut the song, so we should consider ourselves lucky.4. Judy Garland: The use of Judy Garland to play the role of Dorothy Gale added a sense of maturity to the role and to the movie in general. Her vocal talents elevated the film.5. Frank Morgan: First introduced in the film as Professor Marvel, Frank Morgan's talents are used in a clever way through his various characters.6. The use of color: When Dorothy arrives in Munchkinland, the screen erupts in color. It has various symbolic uses, but mostly it delineates between the world Dorothy is from and a new world where the rules are unknown.7. The Munchkins: The strangeness of the new world and a considerable amount of charm are enhanced by this troupe and their voices.8. The Yellow Brick Road: Not the literal road, but what it represents--an adventure of possibilities, where heroes are tested.9. Serendipity: The fortunate way the elements of this film came together (Judy Garland vs. Shirley Temple, Ray Bolger vs. Buddy Ebsen, the use of the \"Somewhere Over the Rainbow\", etc.)10. The Wizard: The use of screen projection, smoke and sound produced a scary Wizard that contrasted sharply with the beneficent image suggested to Dorothy by Glinda and the Munchkins.11. The musical score in general. The production is generously endowed with some magical musical numbers.12. The supporting cast: Dorothy's fellow travelers seem perfectly cast to us now, so iconic are their characterizations.13. The Witch: One of the great villains in film history, surrounded by her henchmen and her minions (the flying monkeys, terrors in their own right).14. The script: The story is engaging. It is also responsible for a slew of iconic quotes. My favorite is \"Pay no attention to that man behind the curtain!\"15. The director: Victor Fleming's vision produced a delightful film that can be enjoyed over and over. When we consider that he also is credited with directing \"Gone with the Wind\" in the same year--amazing!"
    },
    {
      "username": "jem132",
      "userUrl": "https://www.imdb.com/user/ur5037232",
      "reviewLink": "https://www.imdb.com/review/rw1674797",
      "warningSpoilers": true,
      "date": "15 June 2007",
      "rate": "10",
      "helpful": "21 out of 23 found this helpful.",
      "title": "An Endurable Fantasy...Will Continue To Last For Many Years Yet...",
      "content": "Probably the world's most-watched film (GONE WITH THE WIND running a close second), THE WIZARD OF OZ is an enduring, magical piece of fantasy that has permeated popular culture like no other film before or since. There are hundreds of unforgettable, instant-classic moments in the film, with the Yellow Brick Road, Dorothy and Toto, the songs, Garland's dazzling ruby red slippers, sepia-toned Kansas and the closing line \"There's no place like a home!\" just a few of the wondrous delights that THE WIZARD OF OZ offers.It is hard to believe that the filing of \"Oz\" was so fraught with problems when you view the finished product. It seems a thing of absolute perfection, with Garland's casting a stroke of genius. Her wistful interpretation of \"Somewhere Over The Rainbow\" is the stuff of legend. The spellbinding Technicolour photography is still a massive achievement, as is Oz, the utopia land of dreams and magic.Most audiences discover the film in childhood, and they will be pleased to find out that the film is just as magical when viewed as an adult, perhaps many years later, if not more."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0020797",
      "warningSpoilers": true,
      "date": "8 August 1999",
      "rate": "10",
      "helpful": "104 out of 134 found this helpful.",
      "title": "An enchanting film with flaws that cannot seriously mar its durable delights",
      "content": "Dorothy's trip, as we follow her from her Kansas farm down the Yellow Brick Road to the Emerald City and back home again, is depicted with rare cinematic imagination and skill At the beginning, we may wonder at the obvious falseness of the black-and-white Kansas setting, although the monotonous, arid landscape ultimately makes an effective contrast to the later scenes in Oz But rationality disappears the moment Judy Garland strikes at the heart with her trembling singing of \"Over the Rainbow.\" And when Frank Morgan appears as Professor Marvel, we are captivated by his familiar bumbling charm Dorothy's entrance into the land of Oz remains one of the screen's most memorable moments, as the black-and-white scene give way to glowing color photography \"I have a feeling we're not in Kansas anymore!\" is her understated response as she enters Munchkinland The sequence in Munchkinland, though beautifully designed, is actually, a mixed blessing Billie Burke is exactly right as the Good Witch of the North, and Margaret Hamilton is wonderfully shrill and repulsive as the Wicked Witch of the West But the Munchkins themselves, midgets gathered from all over the world for the occasion, are all wonderful with their prematurely old faces and chipmunk voices The talents of Dorothy's friends혰Jack Haley as the Tin Man, Ray Bolger as the Scarecrow, Bert Lahr as the Cowardly Lion혰have been frequently celebrated, but their good humor and their shining humanity behind the grotesque makeup remain fresh eternally \"The Wizard of Oz\" is a joy forever Why does it still glow, while other films of the period grow dimmer every year? It is unquestionably due to more than the sum of its sterling cast, winning songs, and lovely special effects, although the absence of these virtues has turned more than one \"musical fantasy\" into failures It may be that Dorothy steps from black-and-white Kansas into the bright colors of Munchkinland, she is taking everyone's first voyage of discovery With the universality of the best fables, \"The Wizard of Oz\" has her learning about evil (the Wicked Witch), friendship (her companions on the road to Oz), and fallibility (the Wizard). And somehow children혰and the child in all of us혰like to see this voyage made repeatedly Children as adults, today as in 1939, \"The Wizard of Oz\" will remain for us the beloved movie ever made!"
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw3072440",
      "warningSpoilers": true,
      "date": "20 August 2014",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Click your heels, fly out of Kansas, and go where nobody mourns the wicked.",
      "content": "For my 2000th review, I felt it would be appropriate to visit the film that I saw 20 times by the time I was 20. Between countless network T.V. viewings (on my grandparent's old T.V. where everything was green, even the black and white Kansas sequences), several big screen visits, hundreds of playings of it at the video store I worked at for 10 years and numerous video covers and different DVD releases, this film has never escaped our culture, and thus my life. My favorite VHS cover was the one in red which focused on the witch and her crystal ball, but that was out of print almost immediately after its release, while the one copy I owned was the blue \"50th Anniversary\" special edition which came with a ton of extras.While throughout grade school, I was obsessed, not only with the film, but the book too, I made a point of seeing it every time network T.V. aired it. When I first discovered it on video, I was thrilled to be able to see it without commercials and certainly without edits. I was also surprised to find out how much was edited from the film, and like Angela Lansbury quoted about the film in her documentary on its filming, \"How long is too long?\". Certainly, I would have loved to see the filmed footage of \"The Jitterbug\" rather than the home movies, but it is obvious from what I have seen that it takes away from the flow of the completed film. What would have been more interesting was the lavish sequence (seen briefly in one of the re-release trailers) of Dorothy and her friend's return from the witches' castle.Of course, the star-making performance of Judy Garland is the heart and soul of this breathtaking fantasy, often imitated but never surpassed. She's a bit busty for the role of the pre-teen Dorothy, but her sincerity is magnetic. There was a genius behind all her madness and as sorry as you can feel for her because of all her woes, you can't feel sorry for the artist who to this day strikes a cord in non-fans, not to mention those of us who consider her the single greatest female performer of all times.There's no better supporting cast (although much of the roles were initially mentioned for other actors), with Ray Bolger an absolute rubbery delight as the Scarecrow, Jack Haley tender and gentle to the max as the Tin Man, and Bert Lahr a blubbering gem as the Cowardly Lion. No good witch was more glamorous than Billie Burke's Glinda (even all the blonde starlets in Broadway's \"Wicked\"), and for pure fright, no wicked witch was scarier than Margaret Hamilton's. I became a huge fan of this wonderful character actress as a child, and to this day, I delight in finding works of hers I hadn't seen yet. Hamilton's Miss Gulch reminds me of the delightfully nosy neighbors of my childhood, and to see her in the same outfit the year later sticking her nose up to W.C. Fields' in \"My Little Chickadee\" was a comic treat.While Fields was mentioned as a candidate for the role of the wizard, it was Frank Morgan, a stuttering gem of a comical character actor who ended up with the role. He appears in an assortment of other roles, beginning in the Kansas sequence, and later as the doorman of Oz and the doorman to the wizard, all disguised to make you think that he's actually another character, which is doubtful. Hamilton obviously is not only Miss Gulch and the Western Witch, but in the brief guise of the Eastern Witch as well. Of course, in \"Wicked\", Nessarose is a lot more beautiful than her sister, only made ugly in spirit by her change in character which didn't ring true.In smaller roles, Charley Grapewin and Clara Blandick as Uncle Henry and Auntie Em offer wise, if distant, support to Judy Garland's Dorothy, with Grapewin very funny as he reluctantly greets the Gulch Woman and Blandick downright hysterical as she tells her off. Toto is an adorable pooch, and I long for a spoof of him getting his revenge on Gulch by biting her in the tush before jumping out of the basket. So as I reflect in my journal of my journey down the yellow brick road, I must call it a lifetime of great and powerful entertainment where every character has become an important part of my child-like heart in my transition to find my own land of Oz."
    },
    {
      "username": "llihilloh",
      "userUrl": "https://www.imdb.com/user/ur0766521",
      "reviewLink": "https://www.imdb.com/review/rw0020850",
      "warningSpoilers": false,
      "date": "8 December 2000",
      "rate": "",
      "helpful": "136 out of 168 found this helpful.",
      "title": "I wish I could have followed the yellow brick road.",
      "content": "I remember watching this movie when they would air it once a year on CBS a few years back. Now it is shown on a couple of different networks quite frequently. This is a wonderful film for the whole family. Who wouldn't want to take a journey to the magical land of Oz?I think that it is terrific how well this movie has held up over the years. It's going on sixty-two years since it was first released and yet, it is timeless. It is great to look back on a film that was made in the thirties, and compare it to the movies made in this day and age. This is a film that will just be something that stays around forever. The Wizard of Oz is enjoyable for people of all ages. Everything about it brings a smile to my face. Wouldn't it be wonderful to just magically be transported to a land of talking trees and little munchkins? Of course it would be. The flying monkeys, a talking lion, the astounding ruby slippers, and everything else adds a special kind of magic to the screen.The atmosphere and setting is magnificent. This is one of the things that makes the film so stunning. Anyway, the forest, the witch's castle, and even the farm is really well laid out.I don't think that the casting could have been done any better. Judy Garland shines as the innocent Kansas girl. Her dancing and singing just brightens the whole story up. The lion, tin man, and scarecrow perform amazingly also. Everyone involved down to the littlest munchkin acts so well. Even though this is a movie for everyone, it is categorized as a children's flick. The writing is good with very simple lines and problems, but slightly complex so we're not falling asleep of boredom. What's left to say? Other things like the wardrobe, special effects, musical talents, and even the famous yellow brick road, are so well put together. Oz gives us an idea of what an almost perfect world would be like. No matter how old this movie becomes and we still look back on it, we'll still be able to enjoy at least one thoughtful movie. Classics never die. (Hence the name.)"
    },
    {
      "username": "Bored_Dragon",
      "userUrl": "https://www.imdb.com/user/ur56005872",
      "reviewLink": "https://www.imdb.com/review/rw3732113",
      "warningSpoilers": false,
      "date": "16 June 2017",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Movie that left mark on countless generations",
      "content": "This is one of those movies that will last forever. Our grandmothers were watching it while they were just little girls and our grandchildren will enjoy it as much. Its values will never be outdated. One of those that define expression \"classic\". Only a shallow viewer could consider it to be just a fairy-tale for children, because this masterpiece is much more than that and its depth covers all generations. Although it's almost 80 years old it still resists the teeth of time, even visually. Its costumes and special effects are extremely outdated but still effective. I admit, it would be very interesting to see how it would all look like with today's technology, but I think this is one of those shrines that should not be touched.10/10"
    },
    {
      "username": "ShelbyTMItchell",
      "userUrl": "https://www.imdb.com/user/ur2745984",
      "reviewLink": "https://www.imdb.com/review/rw2878809",
      "warningSpoilers": true,
      "date": "30 September 2013",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Yellow Brick Memories!",
      "content": "We all have memories of this movie as if nobody has seen this movie just yet, then they are missing out on this treasure. As it is indeed just that you see.Dorothy played by the late, great Judy Garland, is a teenager in KS as she gets swept up on a tornado. As she finds herself in the Land of Oz. With her beloved Toto the dog, they find themselves in such a weird but happy land.Where she runs into the Scarecrow, Tin Man,and Lion. Who are in need of brain, heart, and courage respectfully. But the Oz person is not who they seem to be. If you did not see this, near the end.There is also one good witch and one bad witch. The latter happened to be a mean woman trying to sell off Toto from a crying Dorothy. Still really a sweet and really funny movie.You do not get much movies like this!"
    },
    {
      "username": "lauraeileen894",
      "userUrl": "https://www.imdb.com/user/ur1680684",
      "reviewLink": "https://www.imdb.com/review/rw1632100",
      "warningSpoilers": false,
      "date": "6 April 2007",
      "rate": "",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Timeless",
      "content": "In the fall of 2006, my husband and I saw a screening \"The Wizard of Oz\" that had a full orchestra providing the soundtrack. Never in my life had I seen a more eclectic audience: there were families with little children, adults who came alone (one woman was dressed as Glinda), teens and college students, even couples who had to have been in their '90s. Not to gush, but it's really a testimonial to \"Oz\"'s legacy that it can appeal to every generation, to every age. Like hot chocolate or Mickey Mouse T-shirts, \"The Wizard of Oz\" is something you never have to worry about being too old for. There is something so comforting about the familiar story of farm girl Dorothy's journey through the strange but wonderful land of Oz, and yet it remains a wonder to behold. I still get excited when Dorothy steps out her sepia-toned world of Kansas into the Technicolor Munchkinland, even though I learned ages ago how the trick was done. I'm still overjoyed when Dorothy makes another odd yet loyal friend along her journey (hmmm, a nice message of tolerance, too!). I still cry when Dorothy bids her friends farewell (Jack Haley in particular breaks my heart). I just want to yell at the screen, \"no! Forget boring old Kansas, stay in Oz!\"Not only is \"The Wizard of Oz\" a charming, addictive classic, but it's one of the best-cast films ever. Putty-limbed Ray Bolger (\"Some people without brains do and AWFUL lot of talking, don't they?\"), over-the-top Bert Lahr (I haven't any courage at all, I even scare myself!\"), and boyishly charming Jack Haley (\"Now I know I have a heart, 'cause it's breaking.\") are pitch-perfect in their respective roles as the Scarecrow, the Cowardly Lion, and the Tin Man. All three were vaudeville vets, and they infuse their roles with both theatrical shtick and warmth. Billie Burke is memorably twittery yet poised as Glinda the Good Witch, and who can possibly forget Margaret Hamilton's cackling, gleefully evil performance as the Wicked Witch of the West? Hamiltion's iconic, villainous image is so emblazoned in our minds, that it's easy to forget she was a former kindergarten teacher and future animal rights activist! As superb as the cast is, however, \"The Wizard of Oz\" belongs to the young Judy Garland. Garland makes Dorothy a very real character that we can all relate too, whereas any other actress would have made her one-note and whiny. She believably plays an ordinary girl in an extraordinary place, her lovely brown eyes wide with awe and wonder. And that singing voice! Long before Garland's voice became tinged with tremulous desperation due to age and hard living, the true beauty and purity of her voice comes through in \"Oz\". Garland sings \"Over the Rainbow\" so simply, without a trace of theatrics, and you're swept away just the same. It's spellbinding, seeing someone so young have the presence and talent to hold a movie in the palm of her hand. \"The Wizard of Oz\" will remain the ultimate escapist classic for generations to come, and it will always be one of my favorites. It's comforting, familiar, why... it's just like home."
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw2907398",
      "warningSpoilers": false,
      "date": "17 November 2013",
      "rate": "",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A Late-Comer",
      "content": "I was born the same year the movie came out, but only caught up with it the other night, mainly because musicals are not my usual movie fare. So what's left to say after 500+ reviews. I was most impressed by the art and set direction. Too bad they didn't win Oscars. The sets were so imaginative and well done, from poppy fields to enchanted woods to yellow brick road. For once, MGM's habit of over-producing what's on screen really paid off with an appropriately lavish scale. The effects are simply breathtaking, but I can also detect the nightmarish visuals that go beyond the demonic Witch of the West. So I can see why kids would be both mesmerized and unsettled by the fantastic adventures.I also have to say that Garland was wonderful as Dorothy, though I've never been a particular fan. Plus, her captivating rendition of Rainbow deserves to top the all-time movie charts. All in all, I'm sorry it took me so long to catch up. It's really hard to believe that so many cooks (writers & directors) didn't spoil the outcome. Somehow, the sumptuous production with its sturdy moral all came together, and remains aptly a movie for the ages."
    },
    {
      "username": "851222",
      "userUrl": "https://www.imdb.com/user/ur4405474",
      "reviewLink": "https://www.imdb.com/review/rw8348089",
      "warningSpoilers": false,
      "date": "18 July 2022",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Classic",
      "content": "Greetings from Lithuania.Surely it is impossible to review a movie like \"The Wizard of Oz\" (1939) when first time seeing it in 2022 - 83 years after it was released. I don't think this movie aged that well, but probably this is my cynical heart is speaking. On the other hand i could easily vote this movie a 10/10 because i believe that people who saw i back at its initial release were blown away by the experience. Yet like i said as seen today for a first time one can only admire it.Overall, \"The Wizard of Oz\" is surely is a Hollywood product of its time. One can not properly view it now in 2022, given that cinema since then has changed many times. There is only a charm of innocence left to it that is long gone from cinema now."
    },
    {
      "username": "Uriah43",
      "userUrl": "https://www.imdb.com/user/ur36357573",
      "reviewLink": "https://www.imdb.com/review/rw3077375",
      "warningSpoilers": false,
      "date": "29 August 2014",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "A Pure Delight",
      "content": "This movie is a pure delight. I remember back when I was young that it would come on television once a year and whenever it played it was like watching it for the very first time. It was both wonderful and magical. Even today it is a joy to watch and having seen it at least fifteen times that in and of itself is quite remarkable. At least for me. Be that as it may, I think it is important to inform new viewers that this movie was made back in 1939 and as a result it doesn't have the computer graphics or any of the technology used today to enhance the special effects. But what special effects it does have is still pretty good even by today's standards. Add in the music and performances of Judy Garland (as \"Dorothy\"), Ray Bolger (the \"Scarecrow\"), Bert Lahr (the \"Cowardly Lion\"), and Jack Haley (the \"Tin Man\") and the end result is something that I don't believe can ever be duplicated. In short, not only is this movie a \"classic\" in every sense of the word but I believe it ranks in the top 3 films of all time. If you've never seen this movie then by all means you need to buy or rent it as soon as possible. You'll be glad you did."
    },
    {
      "username": "gavin-thelordofthefu-48-460297",
      "userUrl": "https://www.imdb.com/user/ur26083589",
      "reviewLink": "https://www.imdb.com/review/rw2746354",
      "warningSpoilers": false,
      "date": "31 January 2013",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Is, and always will be, a classic for all time!",
      "content": "In order to coincide with the upcoming \"Oz, the Great and Powerful\", I'm going to make my own review of this 1939 classic that will be celebrating it's 75th anniversary next year (not to mention the fact that it will be in IMAX 3D this year in September). I watched it when I was a little kid and loved it as much as anyone else in the film industry. Sure, it's not actually faithful to the book, but it doesn't matter.It did what it had set out to do and defined the meaning of a true Hollywood classic that inspired other acclaimed directors and filmmakers to do the same. The story is very original in the overall light-hearted tone, although it does have some moments that would make you feel scared(especially the Wicked Witch of the West who scared me as a little child). The scenery is beautiful and realistic and the look of the Emerald City is a sight to behold. The characters are charming and likable too. Judy Garland is a beautiful Dorothy, Ray Bolger is a terrific Scarecrow, Jack Haley is a wonderful Tin Man, Bert Lahr is a hilarious and cowardly Lion, and Margaret Hamilton is a scary Wicked Witch of the West.The pacing moves along very nicely, but the best part would have to go to the musical numbers written by Harold Arlen and E.Y. Yip Harbug including \"Somewhere Over The Rainbow\", \"Ding! Dong! The Wicked Witch Is Dead\", \"If I Only Had A Brain\", \"If I Only Had A Heart\", \"If I Only Had The Nerve\", \"We're Off To See The Wizard\", and more.Overall, The Wizard of Oz is, and always will be, a classic to those who are young and old. Recommended!"
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2574311",
      "warningSpoilers": false,
      "date": "1 March 2012",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "There's no place like home ... no time like childhood ... no movie like \"The Wizard of Oz\" ...",
      "content": "Red like magical ruby slippers, yellow like a brick road to follow, green like the Emerald city, blue like a cloudless sky, violet like a floppy field all the colors of the rainbow celebrate two magical universes with the same initials: cinema and childhood.\"The Wizard of Oz\" is and will forever be associated with a magnificent imagery, unforgettable songs such as \"Ding Dong! the Witch is Dead\", \"We're off to see the Wizard\", the catchy \"If I had...\" songs, the Munchkins' high-pitched voices, Dorothy having the feeling 'not to be in Kansas' anymore, the shrill and scary voice of a green-faced evil witch and so on and so forth. With all these elements, it's comforting that the film lost against a worthy adversary, the iconic \"Gone with the Wind\" from the same director. God, if there ever was a year where film-making triumphed, it's 1939, and the throne of Hollywood undoubtedly belonged to Victor Fleming.\"The Wizard of Oz\" is both a spectacular milestone for its first use of colors and groundbreaking visual effects and a timeless classic in the way it touched the heart of children from many generations, all over the world. It's fascinating how these two aspects drive the film's paradoxical nature as the ultimate escapism, plunging us in the dreamlike Technicolor vision of the enchanted land of Oz, yet concluding with the immortal \"There's no place like home\". \"Oz\" captures through the innate power and insecurity of childhood a very poignant contradiction that reminds us how we used to dream of such places 'over the rainbow' and still were deeply rooted to our home, our family. And Kansas, with its sepia-like simplicity is Dorothy's home and we couldn't be happier for her when she was finally back.But as a set-up to this powerful finale, the whole film is a miraculous journey into a magical world where a group of friends will try to find the only person whose power could fulfill their wishes. Dorothy wants to go home, because she left her aunt worried after a frightening tornado destroyed the farm, the Scarecrow wants to have a brain, the Tin Man, a heart and needless to say what the Cowardly Lion wants. We all can identify with Dorothy or her friends because each one remains true to one of the many emotions that inhabit childhood, fear, awkwardness, joy, sadness, homesickness etc. And watching these three adult actors and an adolescent Judy Garland taking their roles with such dedication is the best tribute to the good old days' innocence. Those were the days ruled by Walt Disney and MGM's roaring lion, when people went to the movie theaters to escape, to dream an even sadder desire when put in the tragic international context of the film.Speaking of my personal experience, I had \"The Wizard of Oz\" in mind long before watching the film, with the unforgettable image of Dorothy and her three friends walking along the \"We're off to see the Wizard\" song, one of these indelible shots in the history of film-making that invites us to re-enact them every once in a while. That's the secret of \"Oz\", which makes any attempt to summarize the film pointless. Any other fantasy film can be more spectacular or penetrating but its popularity might mostly rely on the story, on the way it ends. Take Capra's \"It's a Wonderful Life\", the whole significance of the film depends on the reception of the last act of the film, and kind of diminish the impact of the first scenes. In \"The Wizard of Oz\", it's all about characters, scenes, songs, quotes, each sequence is as valuable and impacting as another, and more than anything, each one conveys a valuable lesson about and for children.Whether it's about children's adoration for their pet animals (Dorothy's adventure starts because she wanted to protect her dog Toto from the evil Miss Gulch) or about the value of friendship in order to face the adversity of the adult world, an undeniable pedagogical value elevates \"Oz\" above all the other fantasy movies. It is, for once, not a coming-of-age, but a coming-to-realization story and a proud affirmation of the value of childhood in the way it intelligently mirrors our own memories of a time of misunderstanding, naivety, trust and fear and a perpetual leaning helping us to face the world, to accept it and moreover to accept ourselves (there's a subtle message about self-acceptance powerfully conveyed by the wizard, played by the jovial Frank Morgan). And the merit of these lessons is to be learned through action: Dorothy and her friends are never passive characters characters and that's crucial because it puts action as a necessary step before learning, and fear, not as a flaw, but a necessary step before learning about courage. \"The Wizard of Oz\" provides also through the wizard's character, the man 'behind the curtain', a lesson about naivety and how child's eyes can easily trust or be impressed. In a way, it illustrates the sad reality that all the adults aren't trustworthy. Of course, some of them can be really mean and the film wouldn't have been half the masterpiece it is without the scene stealing performance of Margaret Hamilton as the Wicked Witch of the West, rightfully nominated #4 in the AFI Top 50 villains. The Witch happens to be a representation of Mrs. Gulch in Dorothy's dream, like most of the characters, including the three friends (farmhands in real-life) and the wizard in a way, it helps us to keep in mind that Dorothy is only dreaming, which doesn't make her dream less impacting anyway.And bizarrely, as we forget it's all a dream, we cease to be marveled by the beauty of the cinematography and the special effects, forgetting that it was before CGI, before \"Star Wars\", that's the miracle of \"The Wizard of Oz\", and as a beautiful dream, its memory can be eternal"
    }
  ],
  "errorMessage": ""
}