{
  "imDbId": "tt0405094",
  "title": "The Lives of Others",
  "fullTitle": "The Lives of Others (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "publisher": "The New Yorker",
      "author": "Anthony Lane",
      "link": "",
      "rate": "100",
      "content": "If there is any justice, this year's Academy Award for best foreign-language film will go to The Lives of Others, a movie about a world in which there is no justice."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "90",
      "content": "It convincingly demonstrates that when done right, moral and political quandaries can be the most intensely dramatic dilemmas of all."
    },
    {
      "publisher": "Newsweek",
      "author": "David Ansen",
      "link": "",
      "rate": "90",
      "content": "It's hard to believe this is von Donnersmarck's first feature. His storytelling gifts have the novelistic richness of a seasoned master. The accelerating plot twists are more than just clever surprises; they reverberate with deep and painful ironies, creating both suspense and an emotional impact all the more powerful because it creeps up so quietly."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/27334/",
      "rate": "90",
      "content": "Ulrich Mühe gives a marvelously self-contained performance. There isn't an ounce of fat on his body, or in his acting: He has pared himself down to a pair of eyes that prowl the faces of his character's countrymen for signs of arrogance--i.e., of independent thinking."
    },
    {
      "publisher": "Rolling Stone",
      "author": "Peter Travers",
      "link": "",
      "rate": "88",
      "content": "Von Donnersmarck has crafted the best kind of movie: one you can't get out of your head."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/movies/l/lives_others.html",
      "rate": "88",
      "content": "With solid performances and a terrific screenplay, this movie offers solid, no-frills drama that feels organic and believable, not contrived."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "Starts out dark and challenging then comes to a startlingly satisfying and warmly human conclusion that lingers long after the curtain has come down."
    },
    {
      "publisher": "Variety",
      "author": "Derek Elley",
      "link": "",
      "rate": "80",
      "content": "Superbly cast drama… that looks to be a solid upscale attraction wherever the special chemistry of good writing and performances is appreciated."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "70",
      "content": "A compelling thriller but an unsatisfying character drama."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "Scott Foundas",
      "link": "",
      "rate": "50",
      "content": "The Lives of Others wants us to see that the Stasi -- at least some of them -- were, like their Gestapo brethren, “just following orders.\" You can call that naive optimism on Donnersmarck's part, or historical revisionism of the sort duly lambasted by the current film version of Alan Bennett's \"The History Boys.\" I, for one, tremble at the thought of what this young director does for an encore."
    }
  ],
  "errorMessage": ""
}