{
  "imDbId": "tt0405094",
  "title": "The Lives of Others",
  "fullTitle": "The Lives of Others (2006)",
  "type": "Movie",
  "year": "2006",
  "items": [
    {
      "username": "wisewebwoman",
      "userUrl": "https://www.imdb.com/user/ur0509769",
      "reviewLink": "https://www.imdb.com/review/rw1614010",
      "warningSpoilers": false,
      "date": "8 March 2007",
      "rate": "10",
      "helpful": "417 out of 454 found this helpful.",
      "title": "Outstandingly great movie",
      "content": "I wonder why there has been so little written and publicized about this movie. This should be seen in every country and its merits trumpeted from the skies.It starts off slowly and the locale is the former East Germany, inhabited by 16 million people who are being spied upon relentlessly by their secret police. In this very real world of the Berlin Wall, there are many Stasi, 90,000, overseeing the populace, aided and abetted by hundreds of thousands of informants. Many of these snitches were blackmailed or other pressures exerted (threats to children and loved ones) and a few obliged voluntarily.What is truly amazing is that this is Florian Henckel von Donnersmarck's directorial debut, and he maintains a masterful hand throughout and keeps the story and the tension rolling from the first scene of interrogation which is filmed back and forth between a tape educating new Stasi as to interview techniques and to the actual cell itself where it was recorded.The movie circles around three main characters and there is a wider circle of the powerful who pull the puppet strings for a variety of reasons which become clear as the movie unfolds.First is Georg Dreyman, a playwright on the verge of celebrating his 40th birthday. Sebastian Koch, a tall,handsome actor dressed in writerly rumple, shares an apartment with his actress girlfriend, Christa-Maria Sieland (Martina Gedeck), and exists within the strictures of the state-sponsored theatre. He is a decent man, and tries to win support for his blacklisted friends.For reasons that become quite clear, Dreyman falls under suspicion and the whole sophisticated Stasi spying system comes into play in the era of 1984. His whole apartment is bugged and every sound is monitored.The man in charge of all this is Captain Gerd Wiesler,(Ulrich Mühe). Ulrich's performance is nothing short of stunning. He starts as an almost robotic presence, dressed in gray, he almost disappears into every scene he's in. But one detects a clear intelligence in his bright eyes, the only part of him that's alive. Captain Wiesler lives in a non-descript arborited apartment, much like himself. He squeezes his food onto a plate from a tube.But the captain starts to awaken slowly as he listens surreptitiously on the state of the art equipment secreted in the attic of Dreyman's building. He starts to fall in love with the couple and then pressure from above is brought to bear on him to dig for the dirt in Dreyman's life.And he is in a dilemma now, as he is drawn further and further into the life of Dreman and his girlfriend.I won't throw spoilers down. Suffice to say is that the story is enthralling right down to the very last frame. The acting is superb, the direction impeccable and the world of East Germany meticulously drawn with the viewer respected enough to find his or her own emotional path through the plot.The ending is truly one of a kind. So right and true that I was left nodding, it was the only one possible.A must see, I will sing the praises of this film to all I know. 10 out of 10 from me. Right up there in my top 50 of all time. I find it so disappointing that these movies don't get wider release AND compete for an Oscar in the best picture of the year and not just for best foreign film. Now there's a heretical thought!"
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw3241394",
      "warningSpoilers": true,
      "date": "19 May 2015",
      "rate": "10",
      "helpful": "41 out of 46 found this helpful.",
      "title": "Masterpiece, a unique lesson on humanity",
      "content": "This is the first full feature film by Florian Henckel von Donnersmarck and won him a Best Foreign Language Film Academy Award as well as an uncountable number of other awards all around the world. The film runs for roughly 2 hours and 15 minutes and does not drag a single second. The reason for this is FHvD's outstanding script and a cast that delivers 100% from minute 1, also including all the actors in smaller roles such as Thomas Thieme, who gives a great performance of an influential figure not scared of using his political power to his own sexual advantage. The standout is Ulrich Mühe showing us his character's transformation from a ruthless Stasi (secret police) agent into a caring human being who puts his own freedom at risk in order to oppose a political system built on fear that is as rotten as it gets and protect the people suffering from it. Merely from the political perspective, in my opinion, this is a movie that everybody needs to see, especially those with an interest in history. And even for those who are not particularly fond of political films, this is highly recommended as the characters and their interaction are written and portrayed with such wit and accuracy that I am not shy of calling it the best German movie ever made. And I have seen lots.I cannot even mention a favorite scene, there are just too many: the joke at the cafeteria table, the boy in the elevator, the interrogation between Mühe and Gedeck, threatening the neighbor('s daughter), the red color on the files near the end, the suicide references and so on. Or I could simply mention the entire epilogue, i.e. everything that happens in the movie after the Fall of the Wall. When Dreyman reads his file or how Wiesler enters the bookstore in the end are maybe the most moving moment of this film. Wiesler's last words are completely genius and I wish all films could end on such a high note. In general, his character and his transformation are one of the most interesting things I have seen in movies in the last years. There are many moments one could analyze, so I will just mention one. Pay attention to how he is looking for real togetherness during his meeting with the prostitute and thus cannot understand the affair between Gedeck's and Thieme's character. His faith in the system crumbles more and more as he realizes everybody is just interested in themselves, while he initially believes in the idea(l) of socialism. But the people in his organization are so different compared to everything he believes in that finally the whole concept of the GDR crumbles in his mind before it crumbles in reality. There is no point anymore in punishing the people who offend his country as he realizes they are the ones who are correct and he uses all the means in his power to help them without becoming part of an investigation himself.It's so sad to see that Ulrich Mühe died so quickly after this film, even before his posthumous BAFTA nomination. But we should be grateful to see the legacy he left us here. What surprises me a bit is that Henckel von Donnersmarck has worked so little in recent years. He only made one movie in the nine years since \"Das Leben der Anderen\" (a forgettable thriller with Johnny Depp and Angelina Jolie) and there is nothing upcoming on his body of work either. Maybe he really was a one-trick pony, but boy was that trick magnificent. A must-see. Perfect score."
    },
    {
      "username": "JohnDeSando",
      "userUrl": "https://www.imdb.com/user/ur1391596",
      "reviewLink": "https://www.imdb.com/review/rw1613212",
      "warningSpoilers": false,
      "date": "7 March 2007",
      "rate": "",
      "helpful": "46 out of 56 found this helpful.",
      "title": "The globe's best . . .",
      "content": "\"Who knows the secrets of the human heart?\" Col in The Crying Game WhenI saw 2006's Oscar winning Departed, I was satisfied it could be the best picture of the year; then I saw Pan's Labyrinth and thought it imaginatively superior; then I saw Lives of Others, the Oscar choice for best foreign film, and I knew it was the globe's best film of the year, no argument.Lives of Others is what all movie making should strive to be: interesting characters, thrilling plot, superb acting, and thematic weight. It's set in East Berlin, 1984, five years before the Wall's fall and Gorbachev's \"glasnost\" and still felling the tremors of Nazism, in this case the Stasi, a government agency similar to the SS. Capt. Gerd Wiesler (Ulrich Muehe), a Stasi teacher and coldly efficient information gatherer, surreptitiously watches playwright Georg Dreyman (Sebastian Koch) and his actress girlfriend Christa-Maria Sieland (Martina Gedeck) to get compromising details that would damn Dreyman and open the romantic way for the culture minister, Bruno Hempf (Thomas Thieme). Oddly for an artist, Dreyman is loyal to socialism, so it is through Sieland that the information must come.The dramatic hub of this absorbing intrigue is the growing affection Wiesler gains for the actress and coincidentally the underground freedom movement, mostly as it is represented by artists and their friends. While his efficiency is amply evident in his cool detachment, similar to that of Rafe Fiennes in Schindler's List and Serg Lopez in Pan's Labyrinth, his humanity seeps out at the edges as he becomes vicariously involved in the artists' lives. First-time director Florian Henckel von Donnersmarck misses not a beat in slowly revealing the hearts of all his principals while he creates a plot remarkably interesting for a character-driven piece.Few films could mine the rich conflict between the totalitarian state and artists who yearn for freedom of expression, between the loyalties of friends and lovers and the crushing exigency of survival. Lives of Others shows how difficult it is to watch others' lives unfold and not be drawn to their passion. It's rough out there: No other film of 2006 showed that cliché better. Here's looking at you, best film of the year."
    },
    {
      "username": "Red-125",
      "userUrl": "https://www.imdb.com/user/ur0442119",
      "reviewLink": "https://www.imdb.com/review/rw1625057",
      "warningSpoilers": false,
      "date": "26 March 2007",
      "rate": "10",
      "helpful": "41 out of 50 found this helpful.",
      "title": "We all have something to hide.",
      "content": "Das Leben der Anderen (2006) (The Lives of Others) was brilliantly written and directed by Florian Henckel von Donnersmarck. The film is a taut thriller. It's also a dramatization of what happened in East Germany--and could happen here--if we allow the government access to every aspect of our lives. Ulrich Mühe stars as Hauptmann Gerd Wiesler of the Stasi--the dreaded secret police. The Captain is so talented in interrogation that he gives lectures on interrogation techniques to Stasi cadets.For complex reasons, Wiesler is investigating a prominent couple-- Christa-Maria Sieland, a beautiful and talented actor (Martina Gedeck), and Georg Dreyman (Sebastian Koch) an accomplished author and playwright.Artists in East Germany were strictly controlled by the state. Some of them played an intricate cat-and-mouse game with the Stasi--going just far enough to attract notice, but not so far as to bring about arrest. The problem with the cat-and-mouse game was that the cats had very sharp teeth, which they didn't hesitate to use. Blacklisting was just one of the state's weapons--a single word from a high official and you never acted again, or your plays or music were never performed. Although both Christa-Maria and Georg have been careful and discrete, they haven't been careful and discrete enough to escape the Stasi's interest. The movie, although in color, looks as if it were shot in black and white. The mood and the locations are drab and muted. Obviously, the color reflects the political and social situation of the time. The camerwork and editing were outstanding. Every other aspect of the film is equally excellent, particularly the work of the supporting actors. Not only does this film represent a riveting thriller, but it provides a powerful political message. After you've seen The Lives of Others, you won't keep quiet when someone tells you \"I don't care if the government taps my phone; I've got nothing to hide.\"This is an extraordinary film--well acted and directed, with a compelling plot and message. Das Leben der Anderen is the finest movie I've seen this year. It's definitely worth seeking out."
    },
    {
      "username": "Hprog",
      "userUrl": "https://www.imdb.com/user/ur0453269",
      "reviewLink": "https://www.imdb.com/review/rw1615577",
      "warningSpoilers": false,
      "date": "11 March 2007",
      "rate": "10",
      "helpful": "167 out of 189 found this helpful.",
      "title": "The ghost of authoritarian regimes",
      "content": "I've been taking German lessons for about 2 months now, and since movies were great in helping me learn English language I'm always looking for German films to watch (as well as German music to listen to) in order to educate my ears.Anyway, I went to this place where I get all sort of rare movies and this one caught my attention... and I had no idea it got the Oscar for foreign language film this year! So I watched it without prejudice and... what did I find? A MASTERPIECE! This is the kind of movie that gets your attention from the first moment, and makes you interested in understanding the characters' psyche, which is very varied: you have the idealistic good guys, the idealistic bad guys, the people that broad their minds understanding that no political dogma is better than individual freedom, etc. And even though the movie has very tough moments it is all so well done and presented with such a good taste that in the end you feel some sort of relieved.In this present day, when the ghost of authoritarian regimes still fly over our heads (in my country we're getting closer and closer to that reality), this movie will make you think about how important love, life and freedom are.A must see!"
    },
    {
      "username": "hareck",
      "userUrl": "https://www.imdb.com/user/ur1486867",
      "reviewLink": "https://www.imdb.com/review/rw1371770",
      "warningSpoilers": false,
      "date": "20 May 2006",
      "rate": "10",
      "helpful": "536 out of 597 found this helpful.",
      "title": "Excellent",
      "content": "I do agree with all the other positive comments, and just need to add that this is the very first movie about the former GDR I saw that is not something like a comedy. Flicks like \"Sonnenallee\" or \"Good bye Lenin\" definitely were great and funny, but unconsciously left myself (a West German) with the impression that the GDR has been a sort of \"Mickey Mouse State\" full of stupid but charming characters, not really to be taken seriously. After seeing \"Das Leben der Anderen\" this impression shifted quite a bit: there actually was suffering, killing desperation and a terribly claustrophobic atmosphere behind that wall. This might well be the most realistic depiction of the dark side of the former East Germany. Thanks to the Producers, actors and director for making this movie. 10 out of 10."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw2196810",
      "warningSpoilers": false,
      "date": "24 January 2010",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "One word: Magnificent",
      "content": "Before the Berlin Wall came down, the government was very interested in \"The Lives of Others,\" a brilliant 2006 German film directed and written by Florian Henckel von Donnersmarck.The story concerns a dramatist, Georg Dreyman (Sebastian Koch), and his actress-girlfriend, Christa-Maria Sieland (Martina Gedeck). As artists, they are revered by the party. In private, however, their politics are somewhat different, but they're careful to keep them quiet. The Minister of Culture isn't convinced of Dreyman's loyalty - in part because of his own interest in Christa, so he assigns an agent, Weisler (Ulrich Muhe), to spy on them. This entails wiring their apartment for sound, listening in 24/7, and providing reports to the Minister. Weisler becomes drawn into the lives of these two people and their friends, and therein lies the fascinating story.Poignant, occasionally funny, scary, and thought-provoking, \"The Lives of Others\" is a fantastic film about the human soul in the face of politics, bureaucracy, fear, and desensitization. The director captures the tension-filled, drab atmosphere of East Berlin. I found the ending especially emotionally powerful.The acting is wonderful. Muhe is great as a colorless puppet of the state, and Gedeck and Koch are excellent as the theatrical couple. The entire film is well cast and well acted.This film won 61 awards internationally and deserved every one. Its best foreign film Oscar came as a big surprise - until people saw the film. Don't miss it."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3375708",
      "warningSpoilers": false,
      "date": "19 December 2015",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Brilliant",
      "content": "Brilliant. East Berlin, 1984. The Cold War is still raging and the communist bloc does not trust its own citizens. A Secret Police agent is tasked with conducting surveillance on a writer and his lover. Over time, rather than being coldly distant, he finds himself being absorbed by their private lives...A great examination of life in East Germany during Communist rule, and how empathy can overcome fascism. Perfect ending.Great performances all round, especially from the three main actors - Martina Gedeck, Ulrich Muhe and Sebastian Koch.Well deserved its Best Foreign Language Film Oscar in 2007, and should have been nominated for more than just that."
    },
    {
      "username": "johno-21",
      "userUrl": "https://www.imdb.com/user/ur4611798",
      "reviewLink": "https://www.imdb.com/review/rw1614572",
      "warningSpoilers": false,
      "date": "9 March 2007",
      "rate": "10",
      "helpful": "33 out of 41 found this helpful.",
      "title": "Sonata for a Good Man",
      "content": "This film is set in the Orlwellian year of 1984 in the old German Democratic Republic of what was known as East Berlin. The Stasi are the \"Shield and the Sword\" of the ruling party of this soviet bloc nation, a secret police force of 100,000 that subjugates another 300,000 to spy for them. This totalitarian system is based on a need to know everything about the countries populace of 16 million. Everything is meticulously documented. Big Brother keeps tabs on any it deems worthy of investigation. Captain Gerd Wiesler (Ulrich Mühe) is a button-down bureaucratic establishmentarian who works as a Stasi interrogator and as an instructor in the school for Stasi. His old schoolmate Lt. Col Grubitz (Ulrich Tukur) is now his immediate superior. In an attempt to further his career, Grubitz wants to impress Cultural Minister Bruno Hempf (Thomas Thieme) and orders Wiesler to set up an elaborate eavesdropping stakeout to gather information on playwright George Dreyman (Sebastian Koch). Dreyman is a playwright loyal to the party but most his contemporaries have not been including his favorite director Albert Jerska (Volkmar Leinert) who has been blacklisted. Dreyman's live-in girlfriend is the popular stage actress Christina- Maria Sieland (Martina Gedeck) who is also the object of amorous affection from the sinister, shades of gestapo-like Hemph. This is no ordinary spy thriller. Writer/director Florian Henckel von Donnersmarck in his feature film debut gives the screen this wonderfully compelling story of life behind the Iron Curtain in the years leading to the 1989 fall of the Berlin Wall and continues into 1991 after the reunification of Germany. Wonderful camera work from cinematographer Hagen Bogdanski enhances the stark realism of this film. This is the Academy Award winning Best Foreign Language Film of 2006. I had to see this since it beat out the highly favored Pan's Labyrinth for the Oscar. It's evident to me that Lives of Others is the superior film and the Academy got it right. This film flows so smoothly and your eyes are constantly on every movement on the screen that it's hard to believe you are reading subtitles too. Gabriel Yared's original composition for the film \"Sonata for a Good Man\" is a pivotal piece of it's storyline. I can't help but give this film my highest rating of a 10 out of 10 and I would highly recommend it."
    },
    {
      "username": "bkrauser-81-311064",
      "userUrl": "https://www.imdb.com/user/ur26591649",
      "reviewLink": "https://www.imdb.com/review/rw3399726",
      "warningSpoilers": false,
      "date": "14 January 2016",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A Quiet, Meticulous, Well-Made Thriller",
      "content": "In the very first minutes of The Lives of Others, the unassuming Captain Gerd Wiesler (Muhe) sits in a small office interrogating a prisoner of the East German Stasi. He records his progress on tape and within hours Wiesler exhausts his prisoner to the point of confession, The tape stops; Wiesler is in a classroom teaching pupils at the university how to do the same. Within those first minutes we get a strong impression of his character; calculated, reserved and above all meticulous. It's those traits along with his dedication to Communism that make him a perfect surveillance man, at least according to Grubitz (Tukur) his supervisor.After attending a show by the popular playwright Georg Dreyman (Koch), Wiesler and Grubitz take an interest in the internationally acclaimed artist. A nationalist, a pro-Communist and loyal to the government; he must be up to no good figures the curious Wiesler. With the coaxing of the Minister of Culture (Thieme), Wiesler sets up a surveillance operation in the attic of Dreyman's apartment complex and places bugs throughout his abode. It is only after weeks of listening does Wiesler realize the Minister has an interest in Dreyman's mistress Christa (Gedeck). Grubitz sees room for advancement if they manage to find dirt on the playwright but Wiesler becomes enveloped in the complex and intriguing lives of Dreyman and Christa. Wiesler even starts to participate quietly in the shadows, making decisions that could change the fate of all involved forever.The essence of The Lives of Others script is essentially political. The workings of the Stasi serve its own self-survival by becoming a tool of Ministers and party elites. What matters more isn't the innocence or guilt of those who commit crimes against the State but whether those under suspicion have the political clout to protect themselves. Those who don't have two remedies, arrest or suicide. It is in-fact a suicide that initiates Dreyman's disillusionment with the entire system and kicks the torrent of dramatics into high gear. That and Christa's abusive relationship with the Minister.Yet there's something much deeper and beautiful about the story than merely being a manifesto against big brother. The acting is so nuanced and superb that the characters become the focal point of audience emotional investment and story tension. Ulrich Muhe especially deserves praise as a foil to Sebastian Koch's Dreyman. Both become disillusioned but for opposite reasons. While Dreyman starts seeing the forest through the trees sort to speak, Wiesler starts seeing people as people instead of abstractions or obstacles of a Communist ideal.There was much ado about The Lives of Others winning Best Foreign Language film at the Academy Awards over the heavy favorite Pan's Labyrinth (2006). Both are beautifully rendered political parables with tenacious emotional strength yet while one has a sense of exhaustive grandeur and filigree, the other is muted, meticulous, and pensive in its plotting. While some may balk at the thought of a reticent thriller, The Lives of Others uses its less ostentatious style to its advantage as evidenced by the dark green mis en scene of Stasi HQ, the faded warmth of Dreyman's apartment and the sooty grays of the attic where Wiesler quietly listens."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw3420449",
      "warningSpoilers": false,
      "date": "22 February 2016",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Think Twice Before You Hand Over Too Much to Government",
      "content": "The Cold War is the center of all this. We were guilty of allowing the division of Germany and the splitting of the city of Berlin. What transpired was a Soviet controlled city with as many informants as citizens (exaggeration, but not that great a one). Of course, the true journalist is going to be the first to go. Don't say anything against the government. The focuses of this film is a young author who has to keep a low profile, and a man who lives right next to him, whose job is to use heavy surveillance on him. Eventually, this man begins to realize the results of his actions and he tries to pull back his invasiveness. The scariest part of this film involves the tactics used to get confessions out of those singled out. Of course, when they can't get to the person, they threaten their wives and children. Of course, since this takes place in 1980, we are in the wake of the destruction of the Berlin Wall. Everyone should see this and think about its implications. There is alo a subtlety and a reserved presentation that makes this work well."
    },
    {
      "username": "ahammel-1",
      "userUrl": "https://www.imdb.com/user/ur10812373",
      "reviewLink": "https://www.imdb.com/review/rw1379708",
      "warningSpoilers": true,
      "date": "28 May 2006",
      "rate": "10",
      "helpful": "760 out of 816 found this helpful.",
      "title": "A stunning directorial debut which deserves to be seen everywhere",
      "content": "Because this movie deals with recent German history, some German comments about it get sidetracked into minute historical discussions. Forget them; Das Leben der Anderen is an outstanding movie that should be seen everywhere.The former East Germany, a relatively small country of 16 million people, was controlled by the most sophisticated, cunning, and thorough secret police the world has ever seen, the East German Ministerium für Staatsicherheit, or \"Stasi.\" The Stasi had about 90,000 employees -- a staggering number for such a small population -- but even more importantly, recruited a network of hundreds of thousands of \"unofficial employees,\" who submitted secret reports on their co-workers, bosses, friends, neighbors, and even family members. Some did so voluntarily, but many were bribed or blackmailed into collaboration.Das Leben der Anderen, (\"The Life of Others\") German director Florian Henckel von Donnersmarck's debut, builds this painful legacy into a fascinating, moving film. In its moral seriousness, artistic refinement, and depth, Das Leben der Anderen simply towers over other recent German movies, and urgently deserves a wide international release. The fulcrum of the movie (but probably not its most important character) is Georg Dreyman, an up-and-coming East German playwright in his late 30s. Played by the square-jawed Sebastian Koch, Dreyman is an (apparently) convinced socialist who's made his peace with the regime. His plays are either ideologically neutral or acceptable, and he's even received State honors.Although he is a collaborator, he is also a Mensch. He uses his ideological \"cleanliness\" to intervene on behalf of dissidents such as his journalist friend Paul Hauser (Hans-Uwe Bauer). These unfortunates must contend with every humiliation a totalitarian state can invent: their apartments are bugged, friends and family are recruited to inform on them, and chances to publish or perform can be extinguished by one stray comment from a Central Committee member. The most recalcitrant can be kicked out of the country and stripped of their citizenship, like the singer songwriter Wolf Biermann.Dreyman lives in a shabby-genteel, book-filled apartment with his girlfriend Christa-Maria Sieland (Martina Gedeck), a renowned actress who often appears in his plays. At the beginning of the movie, Dreyman himself comes under the regime's suspicion, for reasons that become clear only later. The fearful machinery of the Stasi rumbles to life: his movements are recorded, and his apartment bugged. The Stasi had bugging down to a science: a team of meticulously-trained agents swoop into your apartment when you're not there, install miniscule, undetectable listening devices in every single room -- including the bathroom -- and vanish in less than an hour, leaving no trace. Agents set up an secret electronic command post nearby, keeping a written record of every joke, argument, or lovemaking session.The \"operative process\" against Dreyman is overseen by Stasi captain Gerd Wiesler, played by Ulrich Mühe, an actor from the former East who was himself once in the Stasi's cross-hairs. Captain Wiesler starts the film as a colorless, icy, tight-lipped professional who shows no mercy in fighting the \"enemies of socialism\": if he needs to interrogate a suspect for 10 hours without sleep to get a confession, he will do so -- and then place the seat-cover the suspect sat on in a vacuum jar in case the miscreant should later need to be tracked by bloodhounds. At night, Captain Wiesler returns to his tiny apartment in an grubby, anonymous high-rise. He settles himself among his inexpressibly drab furniture, eats a meal squeezed out of a plastic tube while watching reports about agricultural production, and then goes to bed alone.As Captain Wiesler listens to Dreyman and his girlfriend he begins to like them, or perhaps envy the richness and depth of their lives in comparison with his own. Perhaps he also begins to wonder why a stranger should have the right to become privy to Dreyman's most intimate secrets: his occasional impotence, his girlfriend's infidelities, his artistic crises. At the same time, though, Wiesler is under pressure: a Central Committee official has made it clear to Wiesler and his toadying supervisor Lieutenant Colonel Grubitz (Ulrich Tukur), that Dreyman has to go down. I won't discuss more plot details, as there are unexpected twists. Each of the main characters is drawn deeper into the conflict between Dreyman and the State, and each is torqued by loyalty conflicts that intensify as the pressure increases. The cast is outstanding. Sebastian Koch finds the right combination of poetic detachment and watchful sophistication for Dreyman. Martina Gedeck, as his girlfriend, has the most challenging role, since she's buffeted from all sides: by her suspicious partner, by Stasi agents trying to turn her, and by a lecherous Culture Minister. Ulrich Mühe plays the Stasi agent's transformation with reserve, only hinting at the stages in his character's secret, but decisive, change of heart.Director von Donnersmarck, a blue-blooded West German, has re-created the gray, drained look of the former East, and the nature of Stasi intimidation, with a fidelity that has earned the praise of East Germans. His pacing is relaxed, but doesn't drag; although there are a few longueurs, most scenes unfold at just the right pace, and there are several great set-pieces. One is a bone-rattling episode in the Stasi canteen in which a young recruit is caught telling a joke about East German premier Erich Honecker. Another is the penultimate scene, a masterstroke in which Dreyman gains access to his massive Stasi file, while reading it, suddenly understands episodes of his own life which had never made sense to him before. The ending is perfectly judged; bittersweet and moving without swelling strings or teary confessions.Das Leben der Anderen is an outstanding movie, probably a great one. If it's not picked up for international distribution, it will be a bitter loss for thousands of potential moviegoers in other countries."
    },
    {
      "username": "jesse3",
      "userUrl": "https://www.imdb.com/user/ur0331573",
      "reviewLink": "https://www.imdb.com/review/rw1579538",
      "warningSpoilers": false,
      "date": "17 January 2007",
      "rate": "10",
      "helpful": "735 out of 886 found this helpful.",
      "title": "The most underrated film of 2006.",
      "content": "Holy cow! What a terrific movie! I am a voting member of the Academy (actor's branch) so I get all the films for free. I've seen everything---60 films. This was one of the last 3 films that I saw---because I was completely unfamiliar with the title. This film slowly gripped me, but by the end, the grip was merciless. The lead actor, who should be doing The Life Story Of Peter Jennings, was wonderful. Everybody was terrific. Congratulations to the writers for their perfect structure---and to the director for his flawless storytelling---and his eliciting of top performances from his actors. How well cast it was. But now I'm totally bewildered. Why haven't I heard anything about this film? Where was this film at the Golden Globes? I haven't even seen any reviews about it. Nothing! What's going on? I'm very active in the film business. I follow this stuff. This film (that I never heard of) took me by surprise as no other film has ever done. Note to the IMDb: This is not a spoiler. Jesse Vint III"
    },
    {
      "username": "sissoed",
      "userUrl": "https://www.imdb.com/user/ur2274490",
      "reviewLink": "https://www.imdb.com/review/rw1657256",
      "warningSpoilers": true,
      "date": "17 May 2007",
      "rate": "9",
      "helpful": "40 out of 47 found this helpful.",
      "title": "Excellent film, insightful character studies",
      "content": "This film, set in the theater world of the mid-1980s, was particularly satisfying to me because I was a producer of avant-garde theater through the 1980s, based in San Francisco but often on tour -- including to international theater festivals in West Germany, communist Poland and communist Yugoslavia in 1987. Although my experience as an American was of course very different than the experience of these East Berliners, there is a mood and sense of personalities in this film that I found authentic and familiar. The people in this film feel like the people I met in the festival bars and refreshment centers for participating artists and on panel discussions in those festivals. Many commenters here have noted the important character change of the Stasi agent, attributing the change either to his growing appreciation for the humanity of the playwright and the actress, or else complaining that the transformation is unpersuasive. So far as I've read in the comments, no one has focused on the key scene. When the Stasi agent hears the playwright and friends planning the suicide article to be smuggled to the West, he writes up an accurate report on this and hastens to his boss's office. Up until then, whatever sympathies he may have developed for the playwright or for the actress are inadequate to deter him. But when the agent enters the boss's office, the boss doesn't immediately give him a chance to give the report or to say anything -- instead the boss immediately launches into a discussion of a new study analyzing how to interrogate and intimidate artists and writers. The report categorizes writers and artists into 5 basic personality types. The boss says the playwright is a \"type 4.\" He describes how the prescribed approach to intimidate \"type 4\" writers will result in them losing hope and never writing again. Only after hearing this, and realizing that his report exposing the playwright as the author of the suicide paper will result in the playwright being crushed emotionally and never even wanting to write anything new, does the Stasi agent curl up the report in his hands and decide not to give the report to his boss. The agent's precise motivation is unclear. But it cannot be merely that the agent wants the playwright to be able to continue writing new works. The agent must know that the state will never let the playwright do another play or publish anything, if the playwright's authorship of the suicide paper is known, and yet the agent was ready to expose the playwright anyway. So the agent's motive for suddenly deciding to hide his report is not merely because the state will put the playwright on a blacklist and block him from publishing or getting plays produced. Thus it must be that the agent is motivated to change by feeling a general revulsion against the idea that the state should employ the crushing of hope, of creative spirit, as a strategy for responding to a dissenter whom the agent knows is a genuine supporter of the regime but who sees that it has flaws. It is the fact that the state will destroy the playwright's very desire to write, that causes the agent to change. It isn't clear whether the agent would draw back from inflicting that kind of punishment on any artist, even one whom he felt to be a real enemy of the state, but it is clear that he can't bring himself to inflict it on a man whom he feels is a \"good\" man like the playwright. And the agent believes the playwright is \"good\" because the playwright supports what is good about society, tries to correct what is wrong about society, is loyal even to a friend who has made powerful enemies, and treats his lover with compassion even when it appears the lover is betraying him.And the irony -- a good irony -- is that by acting to preserve the playwright's desire to write, the agent winds up being the focus of the playwright's novel -- a novel born of a desire and drive to write that the agent himself kept the state from destroying.Thus it seems to me that the real message of this movie is that even the most unimaginative, bland, uncreative, rigid people -- such as the Stasi agent -- should appreciate and protect the desire that drives creative people who are also \"good\" people to create works of art and literature."
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw4245770",
      "warningSpoilers": false,
      "date": "20 July 2018",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "A true Gem",
      "content": "One of the best German movies ever made, the Lives of Others shows one side of communism, but it does so with sincerity and a human touch. Highly recommended."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1873477",
      "warningSpoilers": false,
      "date": "13 May 2008",
      "rate": "9",
      "helpful": "17 out of 22 found this helpful.",
      "title": "Sonata for a Good Man",
      "content": "In 1984, in East Germany, the popular actress addicted in pills Christa-Maria Sieland (Martina Gedeck) becomes the pivot of an investigation of the successful writer and her boyfriend and mate Georg Dreyman (Sebastian Koch) by the secret police. The Minister of Culture Bruno Hempf (Thomas Thieme) and former lover of Christa orders the ambitious Chief of Police Anton Grubitz (Ulrich Tukur) to find evidences that Georg is not loyal to the party to get rid off him and stay with Christa, and the efficient agent Gerd Wiesler (Ulrich Mühe) is assigned to conduct surveillance on Georg's apartment. Wiesler does not find any evidence that could compromise Georg, until the day of his blacklisted friend and director Albert Jerska (Volkmar Kleinert) commits suicide. Georg decides to write an anonymous article to Der Spiegel about the hidden numbers of suicides in East Germany. However, Wiesler becomes fascinated with the lives and thoughts of George and Christa and covers his findings from his superiors.\"Das Leben der Anderen\" is another powerful German movie, showing the repressing and corrupted system supported by fear in East Germany in times of Cold War. This movie is practically perfect: the screenplay and story are engaging, disclosing a triangle of love that causes a political surveillance of an innocent man based on several characters that are perfectly developed. The pace is neither slow nor fast but very adequate, and uses an awesome cinematography. Therefore the work of the director and writer Florian Henckel von Donnersmarck is outstanding. The performances are top-notch, but the actor Ulrich Mühe is amazingly perfect, deserving an Oscar, and Martina Gedeck gives a great credibility to her abused character. I usually watch many movies , but \"Das Leben der Anderen\" is certainly among the best recent movies I have seen, if not the best. My vote is nine.Title (Brazil): \"A Vida dos Outros\" (\"The Life of the Others\")"
    },
    {
      "username": "THE-BEACON-OF-MOVIES-RAFA",
      "userUrl": "https://www.imdb.com/user/ur34290913",
      "reviewLink": "https://www.imdb.com/review/rw5473019",
      "warningSpoilers": false,
      "date": "10 February 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A masterpiece! A truly deeply madly beautiful masterpiece! ( A+ Movie) My Ratings 10/10",
      "content": "A masterstroke for truth! the little man versus the all powerful machine and though he very nearly loses everything in his fight against evil ,he triumphs and retains his soul. This is a MUST SEE FILM for all of you sadly misguided people out there who are constantly touting the swing to socialism. the culture depicted in this film IS A TRUE AND ACCURATE representation of Life under a socialist regime. Don't tell me we can do it better \" that's what the East Germans believed too! As well as the Russians and every other people that have exercised bad judgement sufficient to turn their freedoms over for \"Social Equality\" to"
    },
    {
      "username": "Cloudmeister",
      "userUrl": "https://www.imdb.com/user/ur2756117",
      "reviewLink": "https://www.imdb.com/review/rw1639435",
      "warningSpoilers": false,
      "date": "17 April 2007",
      "rate": "9",
      "helpful": "72 out of 80 found this helpful.",
      "title": "Every positive word written about this movie is absolutely true",
      "content": "I am still quite speechless. Overwhelmed by how utterly compelling the story was and by how emotive the acting story was. Floored by the unbelievably great character development. This film is close to perfect. It is a spiritual cousin to 2004's magnificent Downfall and shares a lot of similarities with Paul Verhoeven's stunning Black Book from last year, not just because these films share two actors. This multi-faceted character driven masterpiece really is as good as it's hype says.Sebastian Koch in particular absolutely shines. He is one of the best international actors working today and he follows the brilliance of his role in Black Book with the lead here. With his bohemian, dishevelled good looks and brilliant charisma, he's the best German-speaking actor since Bruno Ganz. But he is far from the only good actor in this movie, Ulrich Mühe as the State Security (Stasi) agent whose task it is to monitor Koch's suspiciously free thinking playwright, brings another near perfect performance to the movie. Agent Wiesler initially appears to the audience as the polar opposite of Koch's character. With his grey button down clothing, closely cropped hair and consistently emotionless face he symbolises everything about the overbearing untrusting Socialist government of East Germany that is wrong. He could easily have remained that character throughout the whole film but he becomes the surprising emotional centre of the story and the line between heroes and villains is significantly shifted (something which extends to the supporting cast as well. Truth be told there are probably only two characters in this film whom I didn't have to rethink my opinion of). Weisler reveals himself as a lonely, isolated man who risks his entire career as his attitude to his subject changes from one of mistrust to one of near-adoration. There is an undeniable link between the two characters even though they never share a single scene and Georg Dreyman (Koch) doesn't even find about Wiesler until the last 10 minutes of the movie, which leads us up to what should go down as one of the greatest endings in cinema history. Just thinking about the final spoken lines brings the tears to my eyes.As I said, without a doubt one of the greatest movies I have ever seen. And as much as I adore Pan's Labyrinth, this one really did deserve it's Academy Award for Best Foreign Language Film of the Year. An absolute masterpiece."
    },
    {
      "username": "nick-6",
      "userUrl": "https://www.imdb.com/user/ur1050980",
      "reviewLink": "https://www.imdb.com/review/rw1747859",
      "warningSpoilers": false,
      "date": "16 October 2007",
      "rate": "10",
      "helpful": "206 out of 228 found this helpful.",
      "title": "A German Expat Feels his first pang of forlorn German patriotism",
      "content": "This film utterly blew me away. Full disclosure: I'm a German born (Munich born) German-American who left Germany in 1986, before the wall came down. I cannot describe the feeling I felt as the last few words were spoken on the screen. I could not look at the subtitles ( a habit of speaking two languages ) because my eyes were so full of tears. I cannot tell you how I was so sorry I did not experience the wall coming down. This film healed a wound that may have been left by the nightmare years of 1938-1945, my own great uncle being a Nazi war criminal, convicted in Nuremberg in 1946. Yes, we are mensch too. We have the potential for greatness (of character) in spite of our history. Thank you Florian Henckel von Donnersmarck, for giving me back half of my lost soul in this single \"es ist für mich\". I am reminded again that the difference between ourselves and beasts is that we have a choice."
    },
    {
      "username": "rkj-3",
      "userUrl": "https://www.imdb.com/user/ur6662734",
      "reviewLink": "https://www.imdb.com/review/rw1500845",
      "warningSpoilers": true,
      "date": "19 October 2006",
      "rate": "10",
      "helpful": "201 out of 231 found this helpful.",
      "title": "Brilliant movie",
      "content": "Germany has produced some very good movies recently ... but this one is in a class of its own. The main power of a quality movie, for me, has always been two things, a good story and mood - and this film has both. The story keeps you interested through all 139 minutes. You actually feel yourself transported to the 1980s of the former German republic. They have carefully chosen locations that looks east-germanish ... lots of \"Trabant\" cars on the streets :-) and the general grayish mood is very well recreated. The ordinary peoples fear of the Stasi is realistically portrayed. And i just love the twist in the story in the last 20 minutes or so. A brilliant movie that anyone even remotely interested in non-mainstream movies should see."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1735580",
      "warningSpoilers": false,
      "date": "24 September 2007",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "1984, East Germany - Shield and Sword of the Party know everything",
      "content": "\"The Lives of Others\", the 2007 very deserving Oscar winner for the Best Foreign Film is IMO, the best film of last year regardless of the country it was made in. It took its writer/director several years first to thoroughly research still very painful events of the recent German history, the ones that deal with infamous and evil STASI (State Secret Police) and how it infiltrated and affected almost every aspect of GDR life. Before the collapse of the Soviet system and its most ominous and infamous symbol, the wall in the end of the 80s, life in East Germany of 1984 had imitated art precisely like in the prophetic and terrifying George Orwell's novel. Each citizen could have and majority were closely monitored by STASI which motto was \"Shield and Sword of the Party\" and its goal, \"To know everything\". By the time East Germany collapsed in 1989, STASI employed an estimated 91,000 employees and 300,000 informants; about one in fifty East Germans collaborated with the powerful and Omni-present Secret Police, one of the most extensive infiltrations of a police apparatus in history. The STASI monitored political behavior among GDR citizens, and is known to have used torture and intimidation to mute, corrupt, and destroy dissent. Even those who believed they were above suspicion due to their closeness to the prominent members of the government were not safe. The film explores the lives of those who watched and listened and those on the other side of the wire.I was shocked to find out that such astounding movie was a directorial debut of 33 years old Florian Henckel von Donnersmarck - so artistically impeccable this honest, human, horrifying, harrowing yet hopeful film is. The film makers had recreated successfully and precisely the 1980s with its dark suffocating atmosphere of constant abuse of individual privacy in the former German Democratic republic. The locations, the huge dominating gray apartment buildings of the big city where every wall seems to have the ears and the eyes , the old cars on the streets of East Berlin  everything looks, sounds, and feels authentically . As great as \"The Lives of Others is\", it would not have been the same without Ulrich Mühe, as Captain Gerd Wiesler, a highly skilled and efficient STASI officer and a loyal member of the Socialist Unity Party of Germany, who spies on successful playwright and his actress girlfriend by the order of corrupted hypocritical member of the government. While listening to the Lives of Others, Wiesler's own life would change in the way he had never expected.Once you start watching the movie, you'll see how Ulrich Mühe effortlessly over towers every other performance on the screen, and they are all excellent. The real life of Ulrich Mühe could make a great and compelling movie and the script for \"The Lives of Others\" was written with him in mind. He was born, grew up, and became a famous actor in the Eastern Germany back in the late 70s of the last century. By the words of von Donnersmarck, STASI began spying on Mühe right after he had graduated from High School because STASI realized that he would be great even before he himself realized that. After German reunification, Mühe discovered evidence in his STASI file that he had been under surveillance not only by four of his fellow actors in the East Berlin theater, but also by his second wife, Jenny Gröllmann. This was denied by Gröllmann who, after an acrimonious and highly-publicized court case, succeeded in obtaining an injunction to prevent Mühe from repeating the allegation in a book. Mühe's response when asked how he prepared for his role in Das Leben der Anderen was simple, \"I remembered\". Mühe passed away few months ago, in July 2007 due to stomach cancer at the age or 54, and when I read it, I felt emptiness - like a very good close friend has gone forever. His performance in the film \"The Lives of Others\" will live always as one of the best and most memorable given by any actor of the screen."
    },
    {
      "username": "LunarPoise",
      "userUrl": "https://www.imdb.com/user/ur4069536",
      "reviewLink": "https://www.imdb.com/review/rw2003113",
      "warningSpoilers": false,
      "date": "7 January 2009",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "it's for me... and you, and everyone",
      "content": "A soulless Stasi agent goes about his work diligently and thoroughly, training fledgling agents in the various techniques required to strip their fellow citizens of their humanity. His life is disrupted when the humanity of one of the citizens under his surveillance seeps under his skin...This is a life-affirming piece, delicately and lovingly charting the journey of one man from joyless cog in the wheel of a tyrannical state system, to collaborator in a rebellion based on personal freedom and dignity. The setting is East Germany before the fall of the wall, but the message ripples out to all individuals who feel their society offers them a life less dignified than they deserve.I hesitate to say any more for fear of despoiling a cinematic experience you should come to unencumbered by the biases of any particular reviewer. You will be moved deeply by this film, and come away feeling better about your life. What other recommendation do you need? See it."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3164155",
      "warningSpoilers": false,
      "date": "17 January 2015",
      "rate": "8",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Convincing police state environment",
      "content": "It's 1984 East Germany. The state's secret police Stasi is an ever knowing presence. Hauptmann Gerd Wiesler is an expert interrogator and teacher. Playwright Georg Dreyman and his actress girlfriend Christa-Maria Sieland are loyal artistic stars. Wiesler zeros in on Wiesler and fascinated by Christa. Wiesler bugs his apartment and spies on them from the cellar. Minister of Culture Bruno Hempf lusts after Christa and coerces her into having sex. Wiesler insinuates himself into their lives by pushing her back with Dreyman. Meanwhile, Dreyman is trying to defend his writer friend Jerska but he is helpless against Hempf. When Jerska commits suicide, Dreyman secretly writes a letter denouncing the state.This movie shows the police state as an everyday thing which is somehow more compelling and haunting. The movie is filled with greys and more greys. The character Wiesler is such a great interior person. For such a quiet character, he is able to build up so much emotion. The movie lays down a convincing foundation and constructs these human characters."
    },
    {
      "username": "drgyn2000",
      "userUrl": "https://www.imdb.com/user/ur14989182",
      "reviewLink": "https://www.imdb.com/review/rw1636754",
      "warningSpoilers": false,
      "date": "13 April 2007",
      "rate": "10",
      "helpful": "119 out of 128 found this helpful.",
      "title": "Best film in years",
      "content": "After seeing the outstanding Pan's Labyrinth, I could not understand how anything could beat it to the Oscar for Best Film, let alone the accolade of Best Foreign Film. That was until I saw The Lives of Others.Putting it simply, this is the best film released in years. The framework of the story surrounds a Stasi officer who is assigned to monitor a writer and his actress girlfriend considered loyal to East German regime. That is all I am prepared to reveal because this film operates on so many levels that I wouldn't know where to begin. On the surface this can be enjoyed as a taut drama but essentially it is a study of the human condition and the capacity for compassion and humanity exists in even the most inhumane people. All of this is shot against the backdrop of the greys and browns of communist East Germany.As a film it is virtually flawless. The three central performances are nothing short of electric, with particularly Ulrich Muhe giving one of the greatest leading man performances since Al Pacino in The Godfather. None of this would be possible without a brilliant script and exemplary direction, that brings the characters to life extracting the best out of the actors. The result is no words are wasted, and every scene is relevant and expertly conceived. This manages to explore deep issues without being turgid, is moving without being draining and remains gripping and entertaining without being superficial.In summary, this is film-making at its finest. It is the sort of movie that you'll go down on bended knee and pay homage to the inventor of cinema, because it is films like this that cinema was created for. You'll forgive a year of tedious sequels and cash cows, for the one day that films like this get released.10 out of 10 is too modest."
    },
    {
      "username": "filmbuff1974",
      "userUrl": "https://www.imdb.com/user/ur2290488",
      "reviewLink": "https://www.imdb.com/review/rw1582598",
      "warningSpoilers": false,
      "date": "25 January 2007",
      "rate": "10",
      "helpful": "25 out of 30 found this helpful.",
      "title": "Excellent Film",
      "content": "I won't go into the plot.The film concerns East Germany during the eighties at it's most oppressive.The film is engrossing and so absorbing that I forgot I was reading subtitles all through it.Well worth the evening. The Lives of Others is what film is supposed to do which is to make one think about one's life and the society one is living in.I should say that the promotional poster is very misleading and I fear it will hurt this outstanding film.Those nude couples is absolutely not what this film is about.This is not some film about a group of self-absorbed adults jumping in and out of beds to put some excitement into their dull lives.This is a political film involving adults who are trying to live life freely in a very oppressive environment.The publicists should really re-think their promotional campaign."
    }
  ],
  "errorMessage": ""
}