{
  "imDbId": "tt0031381",
  "title": "Gone with the Wind",
  "fullTitle": "Gone with the Wind (1939)",
  "type": "Movie",
  "year": "1939",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/great-movie-gone-with-the-wind-1939",
      "rate": "100",
      "content": "A towering landmark of film, quite simply because it tells a good story, and tells it wonderfully well."
    },
    {
      "publisher": "Empire",
      "author": "Kim Newman",
      "link": "https://www.empireonline.com/movies/reviews/gone-wind-review/",
      "rate": "100",
      "content": "Well, even if it is essentially four hours about a selfish, silly cow, it's impeccably well made, and should be seen by anyone with even a passing interest in romance or movies."
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1939/film/reviews/gone-with-the-wind-2-1200412649/",
      "rate": "100",
      "content": "One of the truly great films, destined for record-breaking box office business everywhere. The lavishness of its production, the consummate care and skill which went into its making, the assemblage of its fine cast and expert technical staff combine in presenting a theatrical attraction completely justifying the princely investment of $3,900,000."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2013/nov/21/gone-with-the-wind-review",
      "rate": "100",
      "content": "Some elements seem grotesquely dated, but this restoration of the 1939 classic finds the film as powerful and mad as ever."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "https://ew.com/article/1998/07/10/gone-wind-5/",
      "rate": "100",
      "content": "To see Gone With the Wind on a big screen again is to weep for the fearlessness with which Hollywood once believed the sublime was possible."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Bob Graham",
      "link": "https://www.sfgate.com/movies/article/Swirl-of-Emotion-in-Wind-Refreshed-film-shows-3003008.php",
      "rate": "100",
      "content": "The most striking effect of the Technicolor process is its subtlety. The viewer is aware of the gradations of flesh tones in Leigh's face and can see the color rise in her cheeks. The exact color of her eyes is a source of fascination (they are gray-blue with flashes of green)."
    },
    {
      "publisher": "",
      "author": "Time",
      "link": "https://content.time.com/time/magazine/article/0,9171,762137,00.html",
      "rate": "100",
      "content": "Whatever it was not, Gone With the Wind was a first-rate piece of Americana, and Americans in the mass knew what they wanted before the critics had got through telling them they should not want it."
    },
    {
      "publisher": "The New York Times",
      "author": "Frank S. Nugent",
      "link": "https://www.nytimes.com/reviews/movies?res=9807E2DA153EE432A25753C2A9649D946894D6CF",
      "rate": "100",
      "content": "Is it the greatest motion picture ever made? Probably not, although it is the greatest motion mural we have seen and the most ambitious film-making venture in Hollywood's spectacular history."
    },
    {
      "publisher": "",
      "author": "The Telegraph",
      "link": "https://www.telegraph.co.uk/culture/film/filmreviews/10765573/Gone-With-the-Wind-film-review.html",
      "rate": "90",
      "content": "Overblown and melodramatic, it somehow achieves more than the schmaltz of its parts, thanks to a spirited modern heroine, the spoilt Scarlett O'Hara, and its refusal to give us the neat conclusions you'd expect from a 19th-century saga of \"cottonfields and cavaliers.\""
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/gone-with-the-wind",
      "rate": "88",
      "content": "Although this epic romantic melodrama is undoubtedly one of the most popular and beloved motion pictures ever to grace the silver screen, it is also arguably the most overrated. Gone with the Wind is a very good movie, perhaps bordering on being great, but its subject matter and running time (which is easily 60 minutes too long) argue against its status as a masterpiece."
    }
  ],
  "errorMessage": ""
}