{
  "imDbId": "tt0031381",
  "title": "Gone with the Wind",
  "fullTitle": "Gone with the Wind (1939)",
  "type": "Movie",
  "year": "1939",
  "items": [
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw1026203",
      "warningSpoilers": false,
      "date": "22 February 2005",
      "rate": "10",
      "helpful": "301 out of 377 found this helpful.",
      "title": "Georgia on my mind",
      "content": "This film shows the best of the American cinema. Whether we like the film, or not, one has to recognize the greatest achievement, perhaps, of the creative talent of the people working in the movie industry. \"Gone with the Wind\" represents a monumental leap, as well as a departure, for the movies, as they were done prior to this film.The vision of David O. Selznick, the power behind bringing Margaret Mitchell's massive account about the South, before and after the Civil War, pays handsomely with the film that Victor Fleming directed. This movie will live forever because it reminds us of how this great nation came into being, despite the different opinions from the two stubborn factions in the war.\"Gone with the Wind\" brought together the best people in Hollywood. The end result is the stunning film that for about four hours keep us interested in the story unfolding in the screen. Of course, credit must be due to the director, Victor Fleming, and his vision, as well as the adaptation by Sydney Howard, who gave the right tone to the film. The gorgeous cinematography created by Ernest Haller gives us a vision of the gentle South before the war, and the Phoenix raising from the ashes of a burned Atlanta. The music of Max Steiner puts the right touch behind all that is seen in the movie.One can't conceive another Scarlett O'Hara played by no one, but Vivien Leigh. Her beauty, her sense of timing, her intelligent approach to this role, makes this a hallmark performance. Ms. Leigh was at the best moment of her distinguished career and it shows. Scarlett goes from riches to rags, back to riches again and in the process finds an inner strength she didn't know she possessed. Her impossible love for Ashley will consume her and will keep her away from returning the love to the man that really loves her, Rhett.The same thing applies to the Rhett Butler of Clark Gable. No one else comes to mind for playing him with the passion he projects throughout the movie. This is a man's man. Captain Butler was torn between his loyalty to the cause of the South and his sense of decency. His love for Scarlett, the woman he knows is in love with a dream, speaks eloquently for itself.The other two principals, Olivia de Havilland and Leslie Howard, give performances that are amazing to watch. Ms. de Havilland's Melanie Hamilton is perfect. Melanie is loyal to the woman that does everything to undermine her marriage to Ashley. Mr. Howard's Ashley gives a perfect balance to the man in love with his wife, while Scarlett keeps tempting him.The rest of the cast is too numerous to make justice to all the actors one sees on the screen, but omitting the contribution of Hattie McDaniel to the film would be sinful. Ms. McDaniel was such a natural actress that she is excellent no matter in what movie she is playing. This huge talent is a joy to watch.Comments to this forum express their objections to the way the race relations play in the movie, but being realistic, this movie speaks about the not too distant past where all kinds of atrocities, such as the slavery, were the norm of the land. While those things are repugnant to acknowledge, in the film, they are kept at a minimum. After all, this film is based on a book by one of the daughters of that South, Margaret Mitchell, who is presenting the story as she saw it in her mind, no doubt told to her from relatives that lived in that period of a horrible page in the American history.Enjoy this monumental classic in all its splendor."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1503022",
      "warningSpoilers": true,
      "date": "21 October 2006",
      "rate": "10",
      "helpful": "141 out of 176 found this helpful.",
      "title": "Scarlett's So High Spirited And Vivacious",
      "content": "Before I ever saw Gone With the Wind, I was well acquainted with Max Steiner's theme. It opened WOR TV's Million Dollar Movie before every broadcast in New York in the Fifties and Sixties. When my parents took me to see Gone With the Wind in one of MGM's re-releases as the film music started in my youthful eagerness to show off my knowledge I remarked to all who could hear that that was stolen from Million Dollar Movie.Million Dollar Movie is gone now, but Gone With the Wind, book and film, remain eternal. In these days Margaret Mitchell's southern point of view book might have trouble finding a publisher, let alone selling film rights to the story. But it is a tribute to her and the characters she created that they remain alive in everyone's mind who reads the novel or sees the film. And that's just about the same because I can't think of another film that remained so faithful to the text.It is said that Margaret Mitchell wrote the book with Clark Gable in mind as Rhett Butler. As the sober and ever realistic, but charming Rhett, Gable for most of the film is playing a character not to dissimilar from what he usually played on screen. However in the last half hour of the film when he's hit with unbelievable tragedy and he edges to the point of madness, Gable reached dimensions he never did before or subsequently.If Mitchell knew who she wanted as Rhett, nobody knew who would be Scarlett. The search for Scarlett O'Hara is one of those Hollywood legends as every actress with the possible exception of Edna May Oliver read for the part. Gone With the Wind started filming without a Scarlett as the famous burning of Atlanta sequence was done first. While it was being down, David O. Selznick settled on a fairly unknown British actress, at least in the USA, Vivien Leigh.It was a stroke of casting genius. Vivien Leigh's screen output is pretty small, she was primarily a stage actress. Gone With the Wind is more her film than Rhett Butler's. The story is her story, how she evolved from a flighty young southern belle to a hardbitten woman who is determined to survive in the style of living she's become accustomed to from the pre-Civil War era. In the process she helps all those around her economically, but loses all their previous affection.I've always felt the key scene in the film is after Leslie Howard tells Leigh, he'll be marrying Olivia DeHavilland and Leigh makes a fool of herself with him, she finds out that Clark Gable has overheard the whole thing. He's fascinated by her, but because of that he's on to all her ploys.Leslie Howard usually comes in for the smallest amount of analysis among the four leads. His Ashley Wilkes is not all that different from Alan Squire in The Petrified Forest. Imagine Squire as a wealthy plantation owner and you've Ashley. He's stronger than he realizes though, he's the one that reluctantly enlists in the Confederate Army while the cynical Rhett Butler makes some big bucks as a blockade runner.I've always felt however that the most difficult acting job in Gone With the Wind was the role of Melanie Hamilton. Olivia DeHavilland after initially considering trying out for Scarlett, decided to go after Melanie.It's a deceptive part, superficially it's a lot like the crinoline heroines DeHavilland was doing at Warner Brothers. Melanie is the counterpoint to Scarlett, an incredibly kind and decent soul who can't see bad in anyone. One of her best scenes is with Ona Munson who is Belle Watling, the most prominent madam in Atlanta. The other women of society snub her, but DeHavilland accepts her help for the Confederate cause. It's not about politics or slavery for Melanie, her husband is at war and his cause is her's.And DeHavilland's death scene would move the Medusa to tears. It's a great tribute to the playing skill of Olivia DeHavilland in that Melanie NEVER becomes a maudlin character. She got her first Oscar nomination for Melanie in the Supporting Actress category, but lost it to fellow cast member Hattie McDaniel as Scarlett's mammy.Hattie's a shrewd judge of character, she's a slave, but she's also a family confidante of the O'Haras. As Gable says, she's one of the few people he knows whose respect he wants.Of course Gone With the Wind is from the southern point of view. Growing up in Atlanta, Margaret Mitchell heard reminisces from many Confederate veterans and the stories they told found their way into Gone With the Wind. It's about what the white civilian population endured during the war and Reconstruction.David O. Selznick got a bit of irony in there though. Please note during the burning of Atlanta the slaves who are being marched out to dig trenches are singing 'Let My People Go.' And that's just what the Union Army was coming to Atlanta to do.Gone With the Wind copped so many Oscars for 1939 that Bob Hope quipped at the Academy Awards ceremony that it was a benefit for David O. Selznick. Of course it was the Best Picture of 1939 and Vivien Leigh won the first of her two Best Actress Awards.Metro-Goldwyn-Mayer kept itself in the black for years by simply re-releasing Gone With the Wind. Unlike any other classic film, it won new generations of fans with theatrical re-release. Somewhere on this planet there are people seeing this 67 year old classic and it is winning new fans as I write this.And I think Gone With the Wind, the telling of the interwoven lives of Rhett, Scarlett, Ashley, and Melanie and the world they knew, will be something viewed and read hundreds of years from now."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1439927",
      "warningSpoilers": false,
      "date": "5 August 2006",
      "rate": "10",
      "helpful": "51 out of 62 found this helpful.",
      "title": "About as good as it gets in 1930s Hollywood",
      "content": "I've done so many reviews on IMDb and despite this, I can't believe I never reviewed this super-famous film. Well, much if this is because with so many reviews, I truly doubt if anyone will ever read this! I was surprised that when I perused the reviews, there were quite a few knuckleheads that gave the film a score of one!! While I do agree that the film is rather dated in the way it deals with minorities, it is truly insane to trash a film just because it offends your easily damaged sensibilities. One person even compared the film to PLAN 9! Come on, folks,...this is an amazing film. And what makes it even more amazing is that the film had several different directors because producer Selznick was so difficult to work with on this film! And, despite this, the film wins (among many other awards), the BEST DIRECTOR Oscar! While I do think that many Oscars should have been earned, giving it to just one man seemed pretty cheeky! Despite this, this is a magnificent sweeping spectacle about the South--but even more about a selfish beauty who ultimately creates chaos of her decent life. Magnificent, well-acted and memorable--this is one of the greatest films of all time."
    },
    {
      "username": "Turanic",
      "userUrl": "https://www.imdb.com/user/ur58434975",
      "reviewLink": "https://www.imdb.com/review/rw5817901",
      "warningSpoilers": false,
      "date": "12 June 2020",
      "rate": "10",
      "helpful": "97 out of 115 found this helpful.",
      "title": "The tragedy of Scarlet the wise 2020 review",
      "content": "At first you would think, the main theme of the film is the horrors of war and the idea that both sides suffer , but that is not the only case in \"Gone with the Wind\", the war is just a background... Scarlet lives almost her entire life in an illusion of love... She has a target she want to achieve and she thinks if she achieves it she will be happy, while missing the point on the way to that target... Something that I realised on a 2nd viewing is that Scarlet is a pretty selfish person with sociopaths behaviour. She can easily manipulate men and sometimes women in order to achieve her goal. She can kill a person and not feel that bad about it,she can exploit prisoners rather than hire free men. The goal is what pushes her forward and sometimes makes her do good things, but these deeds are never done out of big heart, they are usually done in self interest. You would think she ends up achieving everything she wanted, but she does not. Scarlet lives in a personal hell which partially she created herself and only when the last obstacle to her big love, the female friend that loves her is gone, she realises that all this time, she lived the illusion of love, she was hurting the people that loved her. Is scarlet a horrible person? Probably... Does she pay for her sins? She does more than anyone... Does she understand what true love is? Yes in the end she does... What makes this film so great, it's a tragedy like \"War And Peace\" with monumental character development ...Any scenes of war and racism fade compared to the tragedy of Scarlet which lives in personal hell..."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6134854",
      "warningSpoilers": false,
      "date": "29 September 2020",
      "rate": "9",
      "helpful": "26 out of 31 found this helpful.",
      "title": "A Tempestuous Hurricane of a Tornado...",
      "content": "When a film is consistently recognised through the wisdom of the crowd, over so many years, as being great and epic and, for the duration of that film to run close to four hours - it really does suggest something a bit special. That something a bit special is a timeless story set during some of the darkest times in American history but it isn't the setting that makes this special, it's the story, the story of a cruel, selfish and manipulative opportunist performing her craft to perfection, it's the story portrayed through one of the greatest cinematic performances the world of movies has ever seen. While the leading man and the supporting cast are outstanding, you walk away from this with only one person holding and controlling your thoughts, just like the character she plays, just as she does through the whole of the picture - the incredible and sublimely talented, the beautiful and vivacious, the tempestuous hurricane of a tornado that is Vivien Leigh. Setting the bar so high it remains unparalleled, even to this day."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2455093",
      "warningSpoilers": false,
      "date": "8 July 2011",
      "rate": "10",
      "helpful": "116 out of 145 found this helpful.",
      "title": "A Potpourri of Vestiges Review: An American magnum opus which must be watched and often, and by those who understand cinema",
      "content": "Margaret Mitchell's Gone with the Wind, in its true essence, is a case study on the Old American way of living where pride and honor were the very essence of human existence. Victor Fleming's rendition of the classic novel, a classic within its own right, does full justice to the themes propagated by Mitchell's evocative masterpiece. In the words of Mitchell herself, Gone with the Wind is the story of the people whose gift of gumption gave them a definitive edge to endure the tribulation and throes of the American Civil War vis-à-vis those who lacked an inner resolve and determination needed for survival.Scarlet O'Hara, the well bred, haughty, tempestuous and opportunistic protagonist of the saga, is an ostensibly flawed individual whose inexorable urge to placate her ego and realize her fancies appears far stronger than her adherence to any credence pious to her people and relevant to her time. Her scintillating charm and unrestrained zeal not only make her an object of desire for her male counterparts but also an object of envy for the girls around her.Vivian Leigh perfectly fits into the caricature of Scarlet O'Hara. She makes full use of her talent, courage and guile to portray a part that requires subtlety, brusqueness and poise in equal parts. It may sound like a hyperbole, but no other actress seemed better equipped to play the part a southern belle than Leigh herself, who won not one but two Oscars while playing one: first for her portrayal of Scarlet O'Hara and second for portraying Blanche DuBois in A Streetcar Named Desire opposite Marlon Brando. In fact, her portrayal of Scarlet O'Hara, in which she perfectly blends panache, poignancy and peremptoriness, is arguably the greatest portrayal by a female lead in cinematic history. Leigh uses her on-stage experience to improvise in order to add new dimensions and complexities to Scarlet's caricature, which according to the novel was mostly one dimensional: out-and-out bad. Scarlet's stubbornness and her impish obsession for a conformist like Ashley, who is not only indifferent to her feelings but also incapable of reciprocating the passion and zeal with which she pursues him, represent just one dimension of her multifaceted self, which is revealed layer by layer with the progression of the narrative. The viewer is gifted to see Scarlet in various avatars: a usurper, an egomaniac, a damsel, a nemesis, a menace, a guardian, a savior, a patriot, a fighter and most importantly as a quintessence of womanhood.Clark Gable as Rhett Butler perfectly complements Vivian Leigh's larger than life portrayal. He is an outright reprobate, an unscrupulous opportunist whose life revolves around making money and pursuing carnal pleasures. However, behind this facade, just like Scarlet, there is a human capable of love, and worthy of being loved. These unobtrusive yet obvious similarities make Scarlet and Rhett a perfect match for each other. The subtle chemistry and tension between the two protagonists give the story its impetus and resonant charm. The rest of the cast has given exemplary performances with a special mention of Olivia de Havilland, who as Melanie is a paragon of love, humility and forgiveness. She provides a striking contrast to Scarlet's caricature and represents a more traditional picture of womanhood.The movie's direction, cinematography, editing and music are all top notch and it is the great synergy of all these elements that makes the movie an extravaganza and an undisputed master piece, one to be savored till eternity. The movie is an amalgam of scenes, high on emotion and drama, which keeps the viewer absorbed throughout. The scene in which Scarlet's father tells her the importance of mother land, deeming it as the only thing worth fighting for, is pure gold. Other scenes that come close to matching its brilliance include the one in which Scarlet performs the duties of an obstetrician to help Melanie give birth to her child, and the one in which Scarlet pledges to protect Tara till her last breath. The movie also has an amazing repertoire of dialogs that are delivered with a nice mix of finesse and accuracy. Butler's famous dialog in which he says to Scarlet, \"You should be kissed and often, and by someone who knows how,\" also happens to be one of all time favorite. The movie, especially its anti-climatic ending, brings tears to eyes and leaves the viewer overwhelmed as he experiences a rainbow of different emotions, being awestruck by the tremendous impact of the journey that he is vicariously made to undergo.PS. Gone with the Wind is undoubtedly one of cinema's greatest marvels and is a living testament to cinema's timelessness, and its limitless potential. A must watch for everyone. 10/10http://www.apotpourriofvestiges.com/"
    },
    {
      "username": "PCC0921",
      "userUrl": "https://www.imdb.com/user/ur109135693",
      "reviewLink": "https://www.imdb.com/review/rw8018838",
      "warningSpoilers": false,
      "date": "30 March 2022",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Margaret Mitchell won the Pulitzer Prize for her novel on May 3rd, 1937",
      "content": "The year 1939 was a busy year for the Hollywood industry. Large-scale, majestic epics were front and center that year. You should look up the list of films released in 1939. It was a very, busy year, with huge titles from the golden age. Lots and lots of entertainment for a pre-WW2 audience. The Wizard of Oz (1939), Stagecoach (1939), Son of Frankenstein (1939), Drums Along the Mohawk (1939) and this little film, are just some of the titles on that list. Everyone was competing for perfection in the film industry. The first two hurtles, being sound and color film, had been implemented into the technical side of the filmmaking process, to this point in film history. Technicolor had been utilized for, about, five years to this point and it was perfectly utilized in this film too. Technicolor always was a good film stock, rich with colors, that pop on the screen. Head cinematographer, Ernest Haller's camera, captures images, not seen before on film and blazes colors across the screen, in Gone With the Wind (1939).I'm sure everyone knows the basic premise of the film. It boils down to a story about the life of woman, a daughter of a rich cotton plantation owner in 1860s, Georgia, who's life interweaves with the real life events of the American Civil War and the recovery and reconstruction years. It is a fictitious story utilizing events from the real world. Of course, most of us remember the picture on the movie posters of Scarlett O'Hara (Vivien Leigh) and Rhett Butler (Clark Gable), locked in that emotional, romantic embrace, plus it's on the cover of every DVD and Blu-Ray out there these days, but the film is really about Scarlett and all the other characters come into her circle. And, the film needs to be about Scarlett in order to be successful, because it is her spoiled, selfish, smug demeanor that energizes the whole film. Everyone who comes into her circle feels her wrath, even Rhett. Rhett isn't really a very likeable character either and watching these two unlikeable characters square off, through various parts of this film, is something to see. These are the reasons, that make this film so good. A plot involving two unlikeable characters, who eventually, reach a certain amount of maturity, that they earn some respect from the audience, doesn't deter from the overall quality of the film, because it is such a unique character study, while chaos is happening all around them.The film does contain many sub-plots, involving politically, socially, culturally and racially charged tones, which would be expected, considering the time this period piece takes place. Which, brings up another interesting point to this film. Even though this film is approaching 85 years old now in the 21st century, it is still considered a period piece. The interesting part is the filmmakers had a more recent memory of the events used in the film, being only 75 years before, as opposed to our view, which is roughly 150 years later. In fact, there probably were a couple of Civil War veterans still alive in 1939. Another amazing thing about this film is, they started shooting this thing in January, 1939 and released it just before Christmas that same year. That is impressive, considering the massive runtime of this film. It is the runtime of this film that really hurts it from being a perfect film.The images the filmmakers (I would list names, but you should see the Crew List on this film), are able to show us on the screen, is incredible. The color you will have stuck in your head, for a week after viewing this film, will be the color of orange, red fire, that is seen throughout the movie and obviously, mostly comes from the burning of Atlanta. A technical achievement, that hadn't been seen in the movies yet. The special effects, art direction, costuming and lighting is fantastic. You still don't notice, even today, that most of this movie was just filmed, out in the Los Angeles countryside and on sound stages. So much is going on in this film, you don't notice it. The performances by the cast is perfect. This is an epic journey about redemption and maturing. A maturity that helps the characters and a nation begin to grow. This film would roll through the Oscars in 1940, including winning the Best Picture Oscar.9.3 (A MyGrade) = 9 IMDB."
    },
    {
      "username": "IshtiaqAhmed",
      "userUrl": "https://www.imdb.com/user/ur13475746",
      "reviewLink": "https://www.imdb.com/review/rw5323734",
      "warningSpoilers": false,
      "date": "15 December 2019",
      "rate": "10",
      "helpful": "119 out of 132 found this helpful.",
      "title": "Miracle in Film Making - Can't believe they did it in 1939!",
      "content": "This movie was on my watch list since 1996 or 1997 when I read its review in a local newspaper. I though it must be a dull movie as it is very old and procrastinated to watch until Dec 2019.And friends, I can't tell you how much I am impressed with this movie - wonderful story, superb acting, mesmerizing cinematography and direction. And they did it in 1939 - which is really hard to digest.I am stupid enough to miss this glory for so many years."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1864272",
      "warningSpoilers": false,
      "date": "26 April 2008",
      "rate": "9",
      "helpful": "77 out of 106 found this helpful.",
      "title": "A rich romantic film...",
      "content": "Gerard O'Hara (Thomas Mitchell), an Irish immigrant, settles in North Georgia and becomes a prosperous plantation owner By great luck he marries young Ellen Robillard (Barbara O'Neill) of Savannah, the daughter of one of the noblest Georgian families and becomes accepted by his aristocratic neighbors They are blessed with three daughters, Scarlett (Vivien Leigh), Suellen (Evelyn Keyes), and Carreen (Ann Rutherford).Scarlett, the eldest, worships her mother Yet, under her beauty and Southern coquetry, she is charming, but proud, willful and vain She believes she is in love with Ashley Wilkes (Leslie Howard), a good-hearted young army captain But Ashley loves his cousin, Melanie Hamilton (Olivia de Havilland), a delicate, selfless woman He is frightened by Scarlett's energy and animation And although he admits his feelings for her, he is afraid to marry her and decides to take Melanie for his bride When Scarlett loses Ashley she is more certain than ever that she must have him On their wedding day, she meets Rhett Butler (Clark Gable), a wealthy adventurer from an old Charleston family Rhett, a gamblerwho believes that self-interest is the motive of all human conductis attracted by Scarlett's beauty and realizes that they are equally merciless and conscienceless Vivien Leigh is magnificent as the spoiled, selfish southern belle... She carries the picture, and controls it... She reproduces the spirited character of Scarlett in all its fluent complexity... Clark Gablewith a smile and great light in his eyesis fascinating as the elegant, heroic gentleman ... He is perfect as the ladies man... His dramatic high point is his scene crying in Melanie's presence... His love scenes with Scarlett give the picture a vibrancy that is one of its great attractions... The film begins with their first stormy meeting in the library at Twelve Oaks and intensifies at the Atlanta bazaar, when he shocks the confederacy by bidding $l00 \"in gold,\" to dance with the newly widowed Mrs. Hamilton who cares for nothing but herself Hattie McDaniel gives a rich characterization as Mammy, Scarlett's shrewd black servant who was never fooled by Scarlett's airs and tears...With a memorable music score by Max Steiner, the film was an instant classic, winner of eight Academy Awards..."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2079574",
      "warningSpoilers": false,
      "date": "12 June 2009",
      "rate": "10",
      "helpful": "27 out of 36 found this helpful.",
      "title": "A sweeping epic film, that in my eyes is outstanding!",
      "content": "Gone With the Wind is a truly remarkable epic film. True, it is four hours long, but there are several redeeming qualities that make it an unforgettable movie experience. The cinematography is gorgeous, with a wonderful contrast of beauty (love) and ugliness (war), though the war scenes could have been a tad more developed, if that is a minor offering of a criticism. The costumes are lovely, especially Scarlett O'Hara's dresses, and the music score is phenomenal, with a sweeping unforgettable title theme, that possibly everyone in the world knows. The performances were astonishing. The beautiful Vivien Leigh gives a tour de force performance as Scarlett, a performance of vulnerability, sadness and beauty. Who can't forget her passionate outbursts \"Great Balls of Fire\"? Butterfly McQueen is hilarious as Prissy, with lines such as \"I don't know nothing about birthing babies\". But topping them all, in a natural if somewhat unlikeable performance as Rhett Butler, is the wonderful underrated Clark Gable, with his iconic remarks (\"Frankly my dear I don't give a damn\"), hearty laugh and sneer. This film was ignored for a long time, and is now considered one of the most remarkable films ever made. 10/10 Bethany Cox."
    },
    {
      "username": "ElMaruecan82",
      "userUrl": "https://www.imdb.com/user/ur4234119",
      "reviewLink": "https://www.imdb.com/review/rw2583329",
      "warningSpoilers": true,
      "date": "19 March 2012",
      "rate": "10",
      "helpful": "31 out of 41 found this helpful.",
      "title": "A universal masterpiece and one of the few privileged films where every scene is a classic on its own ...",
      "content": "For some nostalgic dreamers, \"Gone With the Wind\" is a glorious swan song depicting the fall of the South during a devastating Civil War, and its reconstruction on the ashes of the Old Order, a Civilization forever \"gone with the wind\". It's the adaptation of Margaret Mitchell's epic tale written in bold letters with this peculiar ability to portray the Yankees as the 'bad guys', so common in the stories related by Southerners, as they invite us to understand their idealism if not to root for it: a vision of Gallantry and Old European Nobility where women were courted, wives were submissive to their husbands and slaves treated with paternalism.But for some idealistic spirits, \"Gone With the Wind\" resonates as one of the most heart-breaking pages of American History, when the North fought the South in the name of Liberty, Freedom and Justice, and when History, written by the victorious side, ultimately showed the Confederate as the 'ones who were wrong'. \"Gone With the Wind\" chronicles what the South used to be, a world where coexisted two cultures, the Whites and the Colored. And the depiction of the slaves oscillates between the high pitched voice of the simple-minded Prissy (Butterfly McQueen) who knew nothing about \"birthin' babies\" and the wisdom and authority of Mammy, Hattie McDaniel in her Oscar-winning role: two figures, two extremes, so rooted in our hearts it's impossible to dislike them, despite the obvious stereotypes.For literate minds, History is only the setting while the film is an incredible achievement in storytelling, inviting us to follow a gallery of magnificent and appealing characters during a slice of life, where the passing of time can be felt, when History affects story with mercy or ruthlessness... sometimes tragic, sometimes ironic. It's a narrative whose emotional core is the heroine Scarlett O'Hara (Vivien Leigh), whose heart belongs to the charming blonde Ashley Wilkes (Leslie Howard), married to the gentle and extremely good-hearted cousin Melanie Hamilton (Olivia de Havilland). A triangular love that sets the personality of Scarlett as a remarkable anti-heroine: selfish, greedy, jealous, but so brave, courageous and generous when the circumstances of War forever changed the face of the South. A great soul that could only be revealed by a great opportunity, a pivotal metamorphosis incarnated by the iconic \"As God is my witness, I'll never be hungry again\".The fascinating aspect of Scarlett's personality is that her flaws elevated her above all the other characters: she doesn't care for etiquette, for traditions, her spirit is free, her ego is big and her heart so vulnerable. While the South is definitely turned to the past, Scarlett thinks of the future, as she says: \"after all, tomorrow is another day\". Scarlett is a modern figure and that's what makes her so appealing both in the film and to the audience. And Rhett Butler, Clark Gable in his most defining role as 'the visitor from Charleston', is Scarlet's perfect match. Both don't belong to that era, they think of money, greed, prosperity, and passion. They embody all the values that America would stand for, transcending the old-fashioned setting of the South. But like the South's enthusiasm for War, the same pride that drives their passion would ruin their relationships.For many passionate hearts, this is one of the most intense romances ever adapted to the big screen, a frustrating and seemingly impossible love between two strong-minded egos, two faces staring at each other as if they were at the verge of an irresistible passion or about to fight each other. As Scarlett was visibly jealous of Melanie when she went to bed with Ashley, the movie makes you penetrate the soul of these characters with such intensity you could feel she wished that Melanie could die. A childish and immature attitude, probably shared with Butler who wouldn't have minded if Ashley could die in the War, too. The love between Rhett and Scarlett is made of the same idealism that built the South myth, a lost but so endearing cause, a fire that burnt inside, and made pretty fitting that the most intimate and sensual moment they had was under the orange sky, during Atlanta's big fire. Love has never been as passionate as a love-and-hate relationship and never seemed a romance so comparable to a lost cause, mirroring the Southerners' very faith in victory. Rhett's last stand when he takes Scarlett up the stairs in the 'one night she wouldn't turn him out' is the perfect illustration of a love that pumped its energy from hate and anger. As Scarlett, lost in her love for Ashley, will never realize that her man is Rhett... and when she does, Rhett is already fed up and finally delivers the most unforgettable come-uppance ever: \"Frankly, my dear, I don't give a damn\" before disappearing in a foggy mist. Scarlett gets a magnificent lesson about life, and wouldn't have been as likable without this last slap in the face. This \"I don't give a damn\" voted #1 in the American Film Institute's Top 100 Movie quotes was Rhett's revenge, and he sure deserved it... and many wannabe-Scarlett would admit that too.But while \"Gone With the Wind\" deals with lost causes, it's more than anything the triumph of Cinema as the most defining Art of the last century. Echoing the novel's status as a best- seller, it's one of the greatest films of all time, the greatest casting ever, the greatest score and the greatest challenge for superlatives. Victor Fleming's super-production that would become a landmark in film-making, with its unique visual style and beautiful cinematography in colors, forever incarnated by Scarlett's shadowy silhouette standing beside a tree, during a beautiful sunset. Along with \"The Wizard of Oz\", and \"Mr. Smith Goes to Washington\", \"Gone With the Wind\" is probably Hollywood's Golden Age reaching its pinnacle before the War would come in 1939 ."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2746625",
      "warningSpoilers": false,
      "date": "1 February 2013",
      "rate": "9",
      "helpful": "16 out of 20 found this helpful.",
      "title": "All-time classic",
      "content": "I was put off watching this for a long time, mainly because I mistakenly believed it to be an old-fashioned romance. Boy, was I wrong. In fact, it's a story of how two maladjusted characters come together and the volatile relationship that progresses.That's the central thrust of the tale, but there's a whole lot more to GONE WITH THE WIND than that. It's an epic reconstruction of a by-gone era, a pre-Civil War American South in which man and slave lived side by side. It's a war story featuring some hugely impressive pyrotechnic effects which must have blown cinema-goers away on first release. And it's an exploration of the darkest reaches of the human condition.The actors are fantastic. Vivian Leigh really makes something of what must have been a difficult role to play. It's especially noticeable with Olivia de Havilland starring in the traditional role of the beautiful, warm-hearted heroine, and then seeing Leigh's haunted, bitter and vengeful character appearing opposite her in contrast. I especially liked Clark Gable, who exudes charisma from every pore.The production values are immaculate, the supporting cast don't put a foot wrong, and the ultra-lengthy running time flies past thanks to the viewer's involvement in the events that unfold. Tragic, shocking, moving and heart-warming in equal measure, GONE WITH THE WIND truly is a film for the ages."
    },
    {
      "username": "daisukereds",
      "userUrl": "https://www.imdb.com/user/ur26579233",
      "reviewLink": "https://www.imdb.com/review/rw5247550",
      "warningSpoilers": false,
      "date": "10 November 2019",
      "rate": "8",
      "helpful": "40 out of 52 found this helpful.",
      "title": "Even after years of being made.. it is good!",
      "content": "I wish people made more movies like this nowadays..Yes! The movie is LONG, but the development of the main character has you swinging from liking her to hating her, to agreeing with her, to.. all sort of emotions!! It is well worth anyone's time. These characters feel SO real! It's like a perfect summarized soap opera. Anyone studying movie-writing should check this adaptation of the book. Would recommend to anyone.And make yourself a favor and don't watch the sequel.. the movie ends the way it does for a reason."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2912467",
      "warningSpoilers": false,
      "date": "27 November 2013",
      "rate": "10",
      "helpful": "19 out of 25 found this helpful.",
      "title": "Golden age of Hollywood (even with the whitewashing)",
      "content": "I can't add much more to the reviews that handbooks on filmmaking haven't already. It epitomizes the golden age of Hollywood. It's grand. It's a technical marvel. It has the most iconic romance since Romeo and Juliet. Clark Gable, and Vivien Leigh has more quotable lines than anybody else. Is there a better line than Rhett Butler's \"No, I don't think I will kiss you, although you need kissing, badly. That's what's wrong with you. You should be kissed and often, and by someone who knows how.\"? It is bigger than a simple movie.However, the more modern critiques have centered on the treatment of the slavery issue, and the general whitewashing of that 'civilization'. It's a fair criticism, but it misses the times and the subject matter. The movie isn't about slavery. It's a fable of its times. I won't be subtracting any points. I don't want to add retroactive morality to my review.Most of the black characters are noble subservients in the movie. It's understandable to object to the portrayal. However, Sam is one of the more heroic persona. Other than Priss and the carpetbagger, they weren't stupid or mean spirited. I think the best description is whitewashing. They covered up the brutality, and gave it a nice gleaming coat. For its times, I don't think we can expect more. Slavery in The Patriot (2000) was marginally more realistic than this. To me, that seems much more egregious."
    },
    {
      "username": "Tweetienator",
      "userUrl": "https://www.imdb.com/user/ur64264987",
      "reviewLink": "https://www.imdb.com/review/rw3829047",
      "warningSpoilers": false,
      "date": "11 October 2017",
      "rate": "10",
      "helpful": "24 out of 33 found this helpful.",
      "title": "One of the Greatest",
      "content": "A perfect epic movie with a great story and a superb playing cast and one of the biggest productions imaginable. Like Ben Hur and War and Peace a classic for all eternity. A world is going down, a new world is rising out of the ashes of the gone - melancholy, fear, the sacrifice, and hope of a whole generation fighting and suffering in the Amercian Civil War. In our troubled times, where war and terror are present almost in every corner of our world and in times where the status quo seems to be a faster and faster-going constant stream and faster-going flow, where nobody can be sure or predict what the future ahead may bring to us, a movie more relevant than most people think."
    },
    {
      "username": "jamesjustice-92",
      "userUrl": "https://www.imdb.com/user/ur71097662",
      "reviewLink": "https://www.imdb.com/review/rw8097424",
      "warningSpoilers": false,
      "date": "28 April 2022",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "There's never going to be a movie like this",
      "content": "It was way back on New Year's day of 2014 when I got myself a copy of this movie and watched it for the first time, in total awe; that one hadn't got an overture, intermission and exit music and ran at about 3,5 hours but I didn't feel the time at all. What's 4 hours of time when the story is timeless?What can I tell you about the movie that you don't already know? That it is the highest grossing movie of all times? That it got eight Oscars including the first ever given to an African-American, Hattie McDaniel (whose Mammy was an adorable character and I'm totally in love with her performance)? Or that I love this movie to the moon and back? Yes, that's what I'm going to say.This 1939's masterpiece is a perfection of a movie and frankly my dears I don't give a damn about what you have to say about it. Excellent performances (especially by Clark Gable and Hattie McDaniel) and lovable characters, impressive war and hospital scenes, plot and storylines that leave you fidgeting on the edge of the seat until the end, beautiful music, astounding cinematography, colorful set pieces, splendid direction by Victor Fleming and the list goes on and on. It's easier to say bad things about the movie because there are none.Sometimes we all feel like Scarlett: that we are living a lie, believing the things that are untrue, making other people miserable and thinking there's no one out there who truly loves us the way we are but missing it all because of the blindfold on our eyes. But once we take it off everything changes. You change. I change. And I hope every new day will bring positive changes for all of us because after all tomorrow is another day..."
    },
    {
      "username": "krational66",
      "userUrl": "https://www.imdb.com/user/ur114600792",
      "reviewLink": "https://www.imdb.com/review/rw5732555",
      "warningSpoilers": true,
      "date": "13 May 2020",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Love in troubled times",
      "content": "Sometimes love needs to be held on and beaten, but once love has bound the wings of the lover, please let it go as soon as possible. Scarlett, do you think it's worth hurting someone who loves you for someone who has hurt you before? Vanity is a part of all human beings, but it's important to get out of it and not wait for what you really need to lose before you can appreciate it. So always ask yourself: are you doing what you really need right now? You are successful, but do you consider yourself happy? Rhett, I think you've done all you have to do. Including the dedication to the cause, the \"implicit\" loyalty to the south, the unswerving pursuit of lovers, the meticulous love of the daughter. Though you knew that the south had lost the battle before it was fought, and though you and most southerners could not appear to share in it, you fought for the south everywhere during the war. You fought with millions of southerners, and when the battle was won, you left your loved ones behind and joined the confederate army. For the love, for the daughter, changed a man, a father can change everything. You're a shrewd businessman, but you can't calculate your feelings. I think this you know, feelings sometimes need to be confused, so you rarely care about scarlett, everything for the sake of the girl. And once the daughter died, all the sustenance and hope also die. At this time you have nearly collapsed, is mei lanli, the woman you admire most, let you walk out of the bedroom again, to life. But when you know that the woman who gave everything for it has never loved you, but still loves ASHLEY, and married herself only for the poor three hundred dollars. You may be unbearable, so choose to leave, leave that only sad and tragic place, leave that will only make their own shame and pain scarlett. However, leaving will only let you get a temporary adjustment and comfort, not for a long time joy and happiness, because after all you still like, love scarlett, leaving her will only be painful, not happy. It is better to get back together and create happiness for both of us than to cause pain for both of us if one of us leaves. Scarlett has completely come to her senses, so give her another chance, and also give yourself another chance to be happy, and go back to tara and scarlett again! After all, tomorrow is another day. Mei lanli, \"exhaling such as LAN, xinfang such as hui\" so describe you again appropriate however. You have the noblest character in the human race -- kindness, the most appealing quality in a man -- tenderness. You are wise and virtuous, know how to write, gentle and kind... You possess almost all the good qualities of man, so that my clumsy pen cannot describe them. But ASHLEY doesn't really love you. But... ASHLEY, you may be a gentleman, your noble temperament attracted many obsessed with fantasy girls, including scarlett, I do not know what thing is your body captured scarlett's soul. Let's not say your marriage and mei lanli is happy, you and the feelings between mei lanli is not love. Perhaps you have only one kind of dependence and sustenance on mei LAN li. But as a man should never take life on others like you, especially on a woman (no matter how good she is), can't say you have no definite view, but you are weak, you are too too complacent, so that lose the power to change the status quo, the satisfaction of the abnormal gradually eroding your desire to do better. If you want to achieve anything, you must be independent, especially in spirit. If you want to make progress, you must have an endless stream of new goals, and work hard for them. You must be strong. Tragedy happens because of human nature. \"Gone with the wind\" is the youth of scarlett's generation, the kind of picnic and dance life; It is the \"ideal\" of the southern plantation-style aristocracy, and the arrogant, blind and ignorant southerners. Is that unforgettable love, is all the unfortunate past.The power of a classic is that it moves people."
    },
    {
      "username": "dillylamar",
      "userUrl": "https://www.imdb.com/user/ur108521836",
      "reviewLink": "https://www.imdb.com/review/rw5673420",
      "warningSpoilers": false,
      "date": "25 April 2020",
      "rate": "10",
      "helpful": "26 out of 33 found this helpful.",
      "title": "Gone With The Wind",
      "content": "Gone with the Wind is a superb piece of cinema shot in a beautiful way like no other film, a great story with amazing performances all around. A film about love, perseverance, deception, and tragedy. This film captures the pure attitude and idea of the south after the civil war and during the reconstruction period. It captivates you from beginning to end."
    },
    {
      "username": "rbverhoef",
      "userUrl": "https://www.imdb.com/user/ur0312444",
      "reviewLink": "https://www.imdb.com/review/rw0019581",
      "warningSpoilers": false,
      "date": "7 January 2004",
      "rate": "10",
      "helpful": "100 out of 168 found this helpful.",
      "title": "A great American classic",
      "content": "'Gone with the Wind' is one of the greatest American classics ever made. It tells the story of Scarlett O'Hara, played the very beautiful Vivien Leigh. She is one of the most selfish heroines you will ever see in a movie and still care for her. She is in love with Ashley Wilkes (Leslie Howard) but he marries to Melanie Hamilton. She is played by Olivia de Havilland in a great performance. A new man in Scarlett's life is Rhett Butler (Clark Gable) but Scarlett does everything to get what she wants including marrying someone for money and her own benefit. Rhett loves Scarlett with all his heart, mainly because they are much the same. They both think the world is there for them. Melanie and Scarlett become friends.The movie is set in the time of the Civil War. What happens exactly with Scarlett, Rhett, Ashley and Melanie is for you to see but the war is pretty important for the story and the way it is used is great. The story itself is great anyway. Although the movie is long it is never boring. A reason for that is the performances. I already mentioned Olivia de Havilland, Clark Gable is very good, charming and sometimes funny, Hattie McDaniel as the black made is outstanding but I have to say that the best thing in this movie is Vivien Leigh. To make you care for a character like that is a pretty hard thing to do, but she makes it seem so easy. It is one of the strongest performances I have seen.Besides the story and the acting we have the music, the sets, the costumes, the cinematography and of course the direction. It is all great. It was made in 1939 and over 60 years later it still is a very impressive movie."
    },
    {
      "username": "davidmvining",
      "userUrl": "https://www.imdb.com/user/ur110212703",
      "reviewLink": "https://www.imdb.com/review/rw8917967",
      "warningSpoilers": false,
      "date": "10 March 2023",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Entertainment",
      "content": "Now...this is a MOVIE. Huge, sentimental, melodramatic, earnest, detailed, ambitious, impressive, and eager to entertain across four brisk hours, David O. Selznick's Gone with the Wind has dominated the popular cinematic consciousness over the past few decades for a reason. A few reasons, really. Made at the height of Selznick's professional and creative powers, after he had gone independent from RKO and before his obsessive tinkering and control over the people he hired became a detriment, Gone with the Wind was Selznick's biggest, brashest attempt to entertain the masses, hooking onto a popular book and throwing every cinematic tool he had at it until it became the biggest movie of all time.There's an earnestness to the film's portrayal of the Old South evident from its opening text that talks about the time and place as the last vestige of Knights and Chivalry. However, the \"knights\" we see are almost all effeminate dandies with little but big talk to back their assertions that they are much better fighters than the Yankees that they're spoiling to fight (the two exceptions are our two male leads). The \"chivalry\" is these men dropping their woman at a glance from Scarlett O'Hara (Vivien Leigh) just to jockey over which one of them will get her dessert. Essentially, these opening moments, the first half hour or so of the film, feel like the dream of a woman child where everything is perfect except for one detail: the man she thinks she loves, Ashley Wilkes (Leslie Howard), doesn't love her and wants to marry his cousin Melanie (Olivia de Havilland). Ashley and Melanie are the two purest individuals in the film, especially Melanie. Ashley is a good, resolute man who has his head on right, especially regarding the South's chances in the upcoming war (he's not aching for it like the younger suiters), and Melanie is so pure and good that she can't ever see Scarlett as the conniving, selfish, and manipulative spoiled rich girl that she really is.O'Hara, daughter of an Irish immigrant played by my favorite character actor of the era, Thomas Mitchell (who is kind of wasted in the relatively small role, to be honest), is really a waste of a human being at the beginning. I read her as being at least partially representative of the Old South in the narrative, and if that's true, then the Old South was a silly, unserious, uncaring, and manipulative. Her only saving graces are that she's pretty (Vivien Leigh was very pretty) and she is the eldest daughter of a wealthy plantation owner. One of the other bits of irony is how the film deals with slavery. It doesn't deal with it much, and it's really a minor point in the film, but slavery is only ever questioned directly once in the film (late in it) but there are a couple of small instances of people, especially the wealthy, older women of the social circle balking at the idea of a charity auction for dancing at a ball might be like slavery. The focus of this film is simply not slavery, but it's another small piece of evidence that there's an ironic effect in how the film is put together, and I really don't think Selznick, noted big-hearted lover of melodrama, really realized was there.Anyway, the core of the film is O'Hara's love of Ashley going completely unrequited while the visitor from Charleston, Rhett Butler (Clark Gable), a noted runner of the Union blockade during the war who builds up a huge fortune doing it, falls in love with the woman who's just like him. This plays out against the grand backdrop of the American Civil War. The conflicts of the war itself are never the focus, with the first two years playing out quickly before things turn at the news of Lee's defeat at Gettysburg where anxiety begins to build in the hearts and minds of the planter class of the Old South and their livelihoods, marked over the first two years of the war by some limitation on goods but not a real degradation of their stations, actually do begin to falter. As General William Tecumseh Sherman comes closer, news comes through Ashley on a visit that his men are barefoot and losing, and panic begins to set it, but O'Hara can't leave Atlanta to run back home to the plantation of Tara because Melanie is pregnant and can't move without endangering her own life.O'Hara's growth as a person is most evident here where she has to go from completely relying on the few men left in her life, namely Dr. Meade (Harry Davenport), and rely on herself. Melanie goes into labor as the Confederate troops are beginning to pull out in the face of Sherman's march, and Dr. Meade simply cannot abandon the hundreds and thousands of injured Confederate troops to help with a delivery, so O'Hara with her house servant Prissy (Butterfly McQueen), must do it herself. This leads to recruiting the help of Butler who's in town with his preferred company (prostitutes, but the film can never say it because of the Hays Office), who manages to get the group of women out of town through fire, aggressive scavengers, and special effects. They get back to Tara, they see the damage left by the war on their precious home, Butler runs off to join the army after protesting his love to Scarlett, and Scarlett swears to never go hungry again. Intermission.The second half of the film focuses mainly on Reconstruction and Scarlett's attempts to reclaim the life she had before the war (the war that all of the chivalrous knights who are now dead were demanding, by the way). She's met with obstacles from the state of the land to the new governing bodies demanding large sums of money in taxes to the fact that the one man she knows who could help her, Butler, is in prison as a prisoner of war and has no money. Scarlett makes a rash move and marries the beau of her younger sister, Frank Kennedy (Carroll Nye), who can cover the cost with the proceeds from his new shop in Atlanta. She pushes him around in the marriage, does whatever she needs to in order to survive (including doing business with Union officials), and forces Frank to buy a lumber mill that she heedlessly fills with convicts as workers. Ashley, having been freed from a Union prisoner of war camp, comes in on the deal (because Scarlett wants to keep him close, of course) and offers up the closest the film has to a direct rebuke of slavery by equating the use of the prisoners with the use of slaves. Scarlett dismisses that concern because her family treated slaves pretty well while not caring at all that she's treating these prisoners terribly because Scarlett is, through and through, an awful person.Her reckless disregard for her station leads her into a dangerous situation where she's attacked on the road outside a shanty town, which leads the men in her social circle in Atlanta to lead a raid against the town, burning it down. Once again, these chivalrous knights are thick-headed and prone to outrageous violence at the slightest of pretexts. I am pretty sure that everyone involved with the production saw the act as admirable if misguided, but I find it hard to read the film that way. This, however, leads to Frank's death (her second state as widower, since I've completely skipped over her first marriage which lasts a grand total of about three minutes of screentime), and her freedom to marry Rhett at long last.This final section of the film, about the last hour, is where it becomes most evident that the film is really about trying to cling onto dreams. Scarlett and Rhett are perfect for each other, and there's obviously great love between them. However Scarlett simply will not let go of her love for Ashley despite his obvious devotion to Melanie. He provides Scarlett with what could easily be described as friendly gestures because he's simply a good man who does have affection for the pretty young woman throwing herself at him, but it's obvious that he's devoted to Melanie no matter how he frames it. Scarlett simply won't let go, and despite Rhett throwing his entire fortune at her to make her happy, she won't accept that happiness because it's not the dream she had before the war.What's kind of amazing about the film is that it never drags. It is four hours long, and it simply keeps moving with events, but those events are tightly intertwined with our main character's story. This film becomes a bit more random if Scarlett doesn't somehow represent the Old South because her journey mirrors that of the South from the Antebellum period through the war and into Reconstruction, ultimately losing the dream she had when she realizes its not real and what she could have when she lost herself in her dream. Again, I don't think anyone involved intentionally put this stuff in, the film is simply too earnestly presented in every facet of its cinematic storytelling to convince me of that underlying irony, but the elements are there nonetheless.Gone with the Wind is a huge melodrama that is played to the hilt by everyone involved. Leigh throws herself into Scarlett with complete abandon, playing her big emotions big but providing enough small shows of inner life throughout the film to give Scarlett a deeper life. Gable is a cynical counterpoint to so much that goes on all around him, especially in comparison to Leslie Howard's take on Ashley, and he ends up being the voice of reason as the South begs itself into a war that destroys it. De Havilland probably gives the best performance in the film as Melanie, containing eternal suffering and love through all of the trials and tribulations the two families from rural Georgia face. Hattie McDaniel is mostly a fun presence through the film in the supporting role of Mammy, but she has some very nice moments late in the film where she has to deliver a lot of expository dialogue through tears quite effectively.Gone with the Wind is a grand adventure and melodrama, and it still entertains eighty years later."
    },
    {
      "username": "angel_de_tourvel",
      "userUrl": "https://www.imdb.com/user/ur3613568",
      "reviewLink": "https://www.imdb.com/review/rw0993864",
      "warningSpoilers": false,
      "date": "7 January 2005",
      "rate": "8",
      "helpful": "135 out of 184 found this helpful.",
      "title": "An immortal and towering achievement",
      "content": "It is always in people's nature to put down great things and to nit-pick or sometimes just be plain mean. No matter what anyone says, this is utterly fantastic: in story, in special effects, in casting (with perhaps the sad exception of Leslie Howard as \"Ashley\") and in captivation. Vivien Leigh is so powerful, passionate, magnificent and beautiful that you could watch it 1000 times on that ground alone. She brings something so convincing and human to the role of the selfish, spoilt Scarlett; the character is larger than life.Leaving Vivien's astounding performance aside, this remains a sweeping unrivalled epic. Watch it. Esther's rating: 20/10"
    },
    {
      "username": "StevenKeys",
      "userUrl": "https://www.imdb.com/user/ur50943122",
      "reviewLink": "https://www.imdb.com/review/rw5507623",
      "warningSpoilers": false,
      "date": "24 February 2020",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Gone with the Wind",
      "content": "Scarlett (O'Hara) Hamilton: \"I could dance with Abe Lincoln himself\"Margaret (b. ATL) found a porcelain pin amongst the post-War rubble, cleaned it, set it on the mantel, began to dreaming, put that to words and called it Gone-With-The-Wind.What do you write about a 4-hr epic showcasing maybe the most beguiling leading lady (Leigh), commanding lead man (Gable), charming characters (Melanie & Mammy) in arguably the best film ever made? Whatever it is, you keep it under 3000 words.If you are of the politically-correct persuasion, have feelings easily hurt or think the Classics are just so much cinema snooze, don't bother watching. But if you have a warm heart, like its strings tugged on a bit, understand historical context, know the difference between a documentary and a movie, you'll find the time needed to drink-in this sweeping, familial Civil War drama is very well spent. Others could've played Scarlett, no doubt to good reviews (Davis Oberon Goddard), but only one could've become Mitchell's buoyant belle (Leigh). It's clearly her movie but it's the meaning of the Ashley character that makes it one of the most curious. Leslie Howard (d.43) had balked at playing the hesitant Wilkes who may be Mitchell's nod to Lee: learned men clinging to a corrupt code who struggle with divided loyalties, choosing state (VA) over nation (USA), Wilkes engaging the additional battle of love (Melanie) versus passion (Scarlett).Those today with a hidden agenda will have you believe in the absurd, that Producer Selznick, he of Jewish heritage, sought to sentimentalize or make monument to the CSA and slavery. The plain truth, easy enough to see by those who watch film with an eye for entertainment and art, is that David O, along with directors Fleming & Cukor, elaborately portray the pain of life and circumstance, a treatment for which the pharmacology industry holds no monopoly of patents but for which movies offer some relief.PC is the new Red Scare, Blue, as it were, a power-grab no more progressive than the red variety was patriotic. It makes blacklists, kills classic art and business responds as it did in the 50s, with fear, rather than education and dialogue. Non-conformity is still the crime, charged un-American then, racist in the new millennium. As corporations own the rights to most vintage movies and their target market, youth, typically have no interest in vintage art, expect holders in coming years to edit or remove from sale & display, Classics broadly deemed unsuitable by the PC police, likely leading to creation of a 30s-style (pre-Code), illicit film genre called pre-PC, for those that survive.If you've a boycott bee in your bonnet because of unpleasant characterizations (Prissy) and historical telling of events, consider, when Big Sam saves Scarlett at the bridge and Rhett does mix n' mingle with Mammy over bourbons, the movie's makers are firing an early round for Civil-Rights. Does Gone-With-The-Wind romanticize events? Of course it does (\"Cavaliers\"), and that's why it's called cinema (4/4)."
    },
    {
      "username": "Alexis_Ray",
      "userUrl": "https://www.imdb.com/user/ur1798665",
      "reviewLink": "https://www.imdb.com/review/rw0019571",
      "warningSpoilers": false,
      "date": "15 November 2003",
      "rate": "10",
      "helpful": "173 out of 228 found this helpful.",
      "title": "Astounding Film - GWTW is the Definition of a Classic!",
      "content": "The setting is a Georgia plantation. The year is 1861, and sixteen-year-old Scarlett O'Hara is infatuated with the blond, drowsy-eyed Ashley Wilkes - the problem is, Ashley plans to marry another woman. Little matter that every other man in the county is courting Scarlett and that a charming scoundrel named Rhett Butler is staring at her with questionable intent - she cares only for Ashley.Suddenly, the Civil War brakes out, changing the fates and fortunes of all. Scarlett, clever, manipulative, and charming, proves an adept survivor - but what will she have to do to survive? And will she ever learn whom it is that she really loves?GWTW is one of the most meticulously cast films ever; with the possible exception of Leslie Howard as Ashley (in his forties, rather old to be playing a man half that age), every role was perfectly assigned. After you watch Vivien Leigh you will be unable to imagine anyone else playing Scarlett, and Hattie McDaniel's strong, unforgettable performance as \"Mammy\" netted her an academy award (the first for an African-American actor). GWTW's backdrop is the gruesome Civil War, and in the end this film is the story a woman and a civilization (the Old South) going through a war that will not leave either of them unchanged.The cinematography is beautiful, memorable. Gone With the Wind was shot entirely in gorgeous technicolor; the scene of the fire in Atlanta required the use of all eight technicolor cameras in existence at the time. The pragmatic may think Gone with the Wind overly dramatic; the restless may find it too long; the action-stimulated, too subtle. None of this, however, detracts from the fact that GWTW retains a lasting appeal as one of the crowning cinematic achievements of the 20th century. Those who see its ending as depressing - tragic, even - perhaps miss the point - which Scarlett O'Hara makes in her very last instant with us, tear-stained eyes uplifted in a sudden, curious burst of hope beneath all the turmoil; that .. . \"After all, tomorrow is another day.\" 10/10"
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw3320519",
      "warningSpoilers": false,
      "date": "20 September 2015",
      "rate": "9",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Winds of war",
      "content": "The fact that as at my time of writing, \"Gone With The Wind\" stands only at number 152 in the best movie rankings of this site, I hope might be mainly attributable to the relative youth of the posters here. Here surely is Golden Age Hollywood's lasting monument to itself, which like another big-subject civil war movie from a previous generation (D W Griffiths' \"Birth Of A Nation\") while politically flawed in its treatment of black people, nevertheless stands as a significant and magnificent piece of movie-making.It's a film I'd dearly love to see on the big screen but all my viewings of it so far have been on TV which can't begin to do justice to the scale and colour of the achievement here. I know there's some contention about who directed which parts of it but I'm going to give my kudos to Victor Fleming who I believe did the lion's share of the work behind the camera. The sets are magnificent and the set-pieces even more so with several jaw-dropping scenes which are testament to artistic imagination and technical achievement in equal measure. Of course the two most celebrated of these I suppose are Rhett Butler's rescue of Melanie, Scarlett and Missy just ahead of the burning edifices of Atlanta and the rising dolly-shot of the wounded and dead of the Confederate Army as Scarlett seeks out Dr Meade. But let's not forget the acting too, especially the two leads who are both terrific, Gable, in his greatest role, is mean, moody and magnificent, while Vivien Leigh in her Hollywood breakthrough role is captivating as the wild, wilful and wonderful Scarlett O'Hara. While the characters of Ashley and Melanie Wilkes seem almost too good to be true (Ashley's guilty feelings for Scarlett aside), they are nonetheless beautifully played by Leslie Howard and Olivia De Havilland. Hattie McDaniel belies the racial stereotyping of her Mammy character to deliver an unforgettable, often scene-stealing performance. It is difficult today to witness some of the political incorrectness of the treatment given to the black characters, in the main shown as subservient, excitable and slow-witted, not sufficiently redeemed by their brave deeds in the film (Big Sam saves Scarlett from being raped, while Mammy effectively acts as the conscience of the film) and it is dreadful for modern ears to hear the \"d\" word spoken so casually if only sparingly.However I'm not going to criticise the movie for that when there's so much good to praise. It could be argued too that it's better up to the end of the war and goes a bit soap-opera-ish thereafter and the death-count starts to over-dramatically mount up towards the end, but such is the power of the film-making that it sweeps the viewer right along to both the central character's famous last words. By the time Max Steiner's famous theme plays over the final scene of the defiant Scarlett framed (has any film ever bettered the use of silhouette than this one?) against the burnt ochre sky, you realise you have watched something very special.Movie-making has unquestionably got bigger down the years, especially in the C-Gen, SFX-fests of recent times but I don't think any film will ever look or play better than this one. It's been many times said and written that 1939 was probably the year that more great movies came out of Hollywood than any other, but this one outdoes them all. And most other films since, come to that..."
    },
    {
      "username": "paskuniag-584-890551",
      "userUrl": "https://www.imdb.com/user/ur40028278",
      "reviewLink": "https://www.imdb.com/review/rw3863411",
      "warningSpoilers": false,
      "date": "20 November 2017",
      "rate": "9",
      "helpful": "48 out of 59 found this helpful.",
      "title": "Like the film? Read the book.",
      "content": "I've seen the film many times, have always enjoyed it. But I've been reading the book for the first time. It's a very long novel, and you have to stay with it if you want to see the ending. It's a good read, but Margaret Mitchell, former newspaper reporter, is very thorough in her description of both Southern culture and the changes that the Civil War brought to it. It's the size of the book that was the biggest challenge for David O Selznick. Not what parts to film, but which parts to leave out. So many characters that appeared in the book couldn't be introduced in the movie without extending the film's length to well over four hours. So he had Sidney Howard write the screenplay, then cut that down to a filmable length by hiring several more writers to further pare the script, and was still rewriting it himself while it was being filmed. Selznick was close to running out of money, so he asked his angel, millionaire Jock Whitney, to loan him enough to finish the film. The film was finally completed and edited, then was test-marketed at a theatre not far from LA. The viewers were excited about having seen it and said so on their preview cards, which allowed Selznick to rest easy, knowing he had a hit on his hands."
    }
  ],
  "errorMessage": ""
}