{
  "imDbId": "tt0110912",
  "title": "Pulp Fiction",
  "fullTitle": "Pulp Fiction (1994)",
  "type": "Movie",
  "year": "1994",
  "items": [
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "100",
      "content": "Pulp Fiction isn't just funny. It's outrageously funny. [14 Oct 1994]"
    },
    {
      "publisher": "USA Today",
      "author": "Mike Clark",
      "link": "",
      "rate": "100",
      "content": "For a brutal black comedy about L.A. hitmen, Pulp Fiction bursts out of its binding with loopy delights. [14 Oct 1994]"
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "",
      "rate": "100",
      "content": "It is an exhilaration from beginning to end. It's the movie equivalent of that rare sort of novel where you find yourself checking to see how many pages are left and hoping there are more, not fewer."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "Like \"Citizen Kane,\" Pulp Fiction is constructed in such a nonlinear way that you could see it a dozen times and not be able to remember what comes next."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "With this film, every layer that you peel away leads to something deeper and richer. Tarantino makes pictures for movie-lovers, and Pulp Fiction is a near-masterpiece."
    },
    {
      "publisher": "",
      "author": "Rolling Stone",
      "link": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/",
      "rate": "100",
      "content": "The new King Kong of crime movies...Ferocious fun without a trace of caution, complacency or political correctness to inhibit its 154 deliciously lurid minutes."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Rick Groen",
      "link": "",
      "rate": "100",
      "content": "Pulp Fiction is at least three movies rolled into one, and they're all scintillating."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "A spectacularly entertaining piece of pop culture, Pulp Fiction is the \"American Graffiti\" of violent crime pictures."
    },
    {
      "publisher": "Film Threat",
      "author": "Brad Laidman",
      "link": "",
      "rate": "100",
      "content": "The first masterwork of the post-modern pop culture generation...gets better with every viewing, and like good rock n' roll, needs to be played loud!"
    },
    {
      "publisher": "The New Republic",
      "author": "Stanley Kauffmann",
      "link": "",
      "rate": "70",
      "content": "But the way that this picture has been so widely ravened up and drooled over verges on the disgusting. Pulp Fiction nourishes, abets, cultural slumming. [14 Nov 1994]"
    }
  ],
  "errorMessage": ""
}