{
  "imDbId": "tt0110912",
  "title": "Pulp Fiction",
  "fullTitle": "Pulp Fiction (1994)",
  "type": "Movie",
  "year": "1994",
  "items": [
    {
      "username": "kylopod",
      "userUrl": "https://www.imdb.com/user/ur0556667",
      "reviewLink": "https://www.imdb.com/review/rw1218264",
      "warningSpoilers": false,
      "date": "17 November 2005",
      "rate": "10",
      "helpful": "2,170 out of 2,487 found this helpful.",
      "title": "The masterpiece without a message",
      "content": "One of the early scenes in \"Pulp Fiction\" features two hit-men discussing what a Big Mac is called in other countries. Their dialogue is witty and entertaining, and it's also disarming, because it makes these two thugs seem all too normal. If you didn't know better, you might assume these were regular guys having chit-chat on their way to work. Other than the comic payoff at the end of the scene, in which they use parts of this conversation to taunt their victims, their talk has no relevance to anything in the film, or to anything else, for that matter. Yet without such scenes, \"Pulp Fiction\" wouldn't be \"Pulp Fiction.\" I get the sense that Tarantino put into the film whatever struck his fancy, and somehow the final product is not only coherent but wonderfully textured.It's no wonder that fans spend so much time debating what was in the suitcase, reading far more into the story than Tarantino probably intended. The film is so intricately structured, with so many astonishing details, many of which you won't pick up on the first viewing, that it seems to cry out for some deeper explanation. But there is no deeper explanation. \"Pulp Fiction,\" is, as the title indicates, purely an exercise in technique and style, albeit a brilliant and layered one. Containing numerous references to other films, it is like a great work of abstract art, or \"art about art.\" It has all the characteristics we associate with great movies: fine writing, first-rate acting, unforgettable characters, and one of the most well-constructed narratives I've ever seen in a film. But to what end? The self-contained story does not seem to have bearing on anything but itself.The movie becomes a bit easier to understand once you realize that it's essentially a black comedy dressed up as a crime drama. Each of the three main story threads begins with a situation that could easily form the subplot of any standard gangster movie. But something always goes wrong, some small unexpected accident that causes the whole situation to come tumbling down, leading the increasingly desperate characters to absurd measures. Tarantino's originality stems from his ability to focus on small details and follow them where they lead, even if they move the story away from conventional plot developments.Perhaps no screenplay has ever found a better use for digressions. Indeed, the whole film seems to consist of digressions. No character ever says anything in a simple, straightforward manner. Jules could have simply told Yolanda, \"Be cool and no one's going to get hurt,\" which is just the type of line you'd find in a generic, run-of-the-mill action flick. Instead, he goes off on a tangent about what Fonzie is like. Tarantino savors every word of his characters, finding a potential wisecrack in every statement and infusing the dialogue with clever pop culture references. But the lines aren't just witty; they are full of intelligent observations about human behavior. Think of Mia's statement to Vincent, \"That's when you know you've found somebody special: when you can just shut the f--- up for a minute and comfortably enjoy the silence.\"What is the movie's purpose exactly? I'm not sure, but it does deal a lot with the theme of power. Marsellus is the sort of character who looms over the entire film while being invisible most of the time. The whole point of the big date sequence, which happens to be my favorite section of the film, is the power that Marsellus has over his men without even being present. This power is what gets Vincent to act in ways you would not ordinarily expect from a dumb, stoned gangster faced with an attractive woman whose husband has gone away. The power theme also helps explain one of the more controversial aspects of the film, its liberal use of the N-word. In this film, the word isn't just used as an epithet to describe blacks: Jules, for instance, at one point applies the term to Vincent. It has more to do with power than with race. The powerful characters utter the word to express their dominance over weaker characters. Most of these gangsters are not racist in practice. Indeed, they are intermingled racially, and have achieved a level of equality that surpasses the habits of many law-abiding citizens in our society. They resort to racial epithets because it's a patter that establishes their separateness from the non-criminal world.There's a nice moral progression to the stories. We presume that Vincent hesitates to sleep with Mia out of fear rather than loyalty. Later, Butch's act of heroism could be motivated by honor, but we're never sure. The film ends, however, with Jules making a clear moral choice. Thus, the movie seems to be exploring whether violent outlaws can act other than for self-preservation.Still, it's hard to find much of a larger meaning tying together these eccentric set of stories. None of the stories are really \"about\" anything. They certainly are not about hit-men pontificating about burgers. Nor is the film really a satire or a farce, although it contains elements of both. At times, it feels like a tale that didn't need to be told, but for whatever reason this movie tells it and does a better job than most films of its kind, or of any other kind."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw5590710",
      "warningSpoilers": false,
      "date": "30 March 2020",
      "rate": "10",
      "helpful": "83 out of 97 found this helpful.",
      "title": "Shotguns",
      "content": "I like the bit with the cheeseburger. It makes me want to go and get a cheeseburger"
    },
    {
      "username": "SebMoz",
      "userUrl": "https://www.imdb.com/user/ur118818818",
      "reviewLink": "https://www.imdb.com/review/rw6261036",
      "warningSpoilers": false,
      "date": "12 November 2020",
      "rate": "10",
      "helpful": "131 out of 151 found this helpful.",
      "title": "A masterpiece of screenwriting",
      "content": "This is Tarantino's masterpiece, there's no other way to say it. It has arguably one of the smartest scripts I've ever seen. The story, which is non-linear, is so well constructed it takes several viewings to grasp it all. The movie doesn't seem to be about any spesific thing, but there is a subtle hint of redemption as a central theme. The characters and preformances in this movie are practically perfect. This is still one of the best performances I've seen from Sam Jackson, and it's an outrage he didn't win an Oscar. Each scene has its own unique flavour and charm, every segment has its own arc while also tying into the main plot. The comedy is great, the serious moments are great, every word of dialogue is exciting despite seemingly not having any reason to exist. This movie is just such a great time, and I recommend it to everyone who loves movies. I cannot think of a single genuine flaw with it, and it will remain one of my favorite movies for a long time."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3055511",
      "warningSpoilers": false,
      "date": "24 July 2014",
      "rate": "10",
      "helpful": "290 out of 357 found this helpful.",
      "title": "The rebirth of a genre – and film history",
      "content": "I can only speak for myself, but I had never seen anything as stylish, cleverly constructed, well written and electrifying as this milestone when I first saw it in 1994. What really pulled me in right from the start is what we've now come to know as a Tarantino trademark: the dialogue. When gangsters Jules and Vincent talk to each other (or all the other characters, for that matter) there is a natural flow, a sense of realism and yet something slightly over the top and very theatrical about their lines – it's a mixture that immediately grabs your attention (even if it's just two dudes talking about what kind of hamburger they prefer, or contemplating the value of a foot-massage). Then there's the music: the songs Tarantino chose for his masterpiece fit their respective scenes so perfectly that most of those pieces of music are now immediately associated with 'Pulp Fiction'. And the narrative: the different story lines that come together, the elegantly used flashbacks, the use of \"chapters\" – there is so much playful creativity at play here, it's just a pure joy to watch.If you're a bit of a film geek, you realize how much knowledge about film and love for the work of other greats – and inspiration from them - went into this (Leone, DePalma, Scorsese and, of course, dozens of hyper-stylized Asian gangster flicks), but to those accusing Tarantino of copying or even \"stealing\" from other film-makers I can only say: There has never been an artist who adored his kind of art that was NOT inspired or influenced by his favorite artists. And if you watch Tarantino's masterpiece today, it's impossible not to recognize just what a breath of fresh air it was (still is, actually). Somehow, movies - especially gangster films - never looked quite the same after 'Pulp Fiction'. Probably the most influential film of the last 20 years, it's got simply everything: amazing performances (especially Sam Jackson); it features some of the most sizzling, iconic dialogue ever written; it has arguably one of the best non-original soundtracks ever - it's such a crazy, cool, inspirational ride that you feel dizzy after watching it for the first time. It's – well: it's 'Pulp Fiction'. 10 stars out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "gautammayya",
      "userUrl": "https://www.imdb.com/user/ur110759166",
      "reviewLink": "https://www.imdb.com/review/rw5626462",
      "warningSpoilers": true,
      "date": "10 April 2020",
      "rate": "10",
      "helpful": "186 out of 213 found this helpful.",
      "title": "The most rewatchable movie of all time",
      "content": "Possibly the most influential movie made in history since the first movie ever made .Even after 25 years and a countless number of copy cats this movie absolutely holds up and feels fresh.As many of you would know this movie is sort of like a tribute to the pulp stories written back in the 40s and 50s which have punchy and witty dialogue and over the top violence. The random chit chat between characters regarding obscure things might feel a waste of time as it doesn't move the plot. But Tarantino is a genius and he believes in character development more than plot development so these chats actually humanizes the characters a lot and makes them relatable and memorable(The absolute converse of Nolan). This movie is just a collection of wonderful scenes back to back from start to finish.. The movie is a must watch just for the awesome screenplay alone. To top it off all the actors arguably give their career best performance(think about it ,it is true) . And the ability of Tarantino to just create a really tense or ridiculous situation out of nowhere(like the psycho tribute scene with marsellus and butch which is so unexpected or that adrenaline shot scene) is just awesome and keeps you on the edge of your seats .So if you want an entertaining but clever movie this is the one you are looking for . It is funny, filled with some of the best dialogues ever ,superbly acted, great soundtracks(I just wanna see Tarantino's ipod , boy does he have great taste) and is just a spectacular experience.Spoilers ahead(duh): For those of you who say the characters are hollow I suggest you to revisit the gold watch sequence. Walken's Capt Koons tells a story to young butch about how Butch's grandpa requested an enemy soldier to return his watch to his family and the soldier agreed. Similarly Butch could have left Marsellus but the legacy of his watch made him save him which I believe was a nice touch. And how Jules(one of my characters of all time) undergoes a change is also a noteworthy counter argument to the above mentioned criticism.Sorry for the huge review.."
    },
    {
      "username": "hockeydog-75085",
      "userUrl": "https://www.imdb.com/user/ur126223463",
      "reviewLink": "https://www.imdb.com/review/rw6470324",
      "warningSpoilers": false,
      "date": "13 January 2021",
      "rate": "10",
      "helpful": "123 out of 150 found this helpful.",
      "title": "Not overrated at all",
      "content": "Before I saw this I assumed it was probably overrated. I was wrong. It lives up to and surpasses its reputation in pretty much every way. I would definitely recommend."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0346019",
      "warningSpoilers": false,
      "date": "25 June 2000",
      "rate": "",
      "helpful": "337 out of 525 found this helpful.",
      "title": "It's Wild, It's Chaotic, It's Pulp Fiction!!!",
      "content": "My oh my. \"Pulp Fiction\" is one of those roller-coasters of a movie. It is both a joy and a trial to sit through. Amazingly original and unforgettable, Quentin Tarantino's trash masterpiece never gets old or seem outdated. It put a face on American independent film making in 1994. Miramax had been around since the 1970s and no one had heard of it before this film. Studios went into a panic when this film came out because they knew it would be an amazing hit. Of course it was. Independent film making became the rage and hit its peak in 1996 when four of the five nominated Best Picture films were from independent studios. The screenplay and direction by Tarantino are quite amazing, but the cast makes the film work. John Travolta (Oscar nominated) re-invented his career with this film. Bruce Willis cemented his celebrity. Samuel L. Jackson and Uma Thurman (both Oscar nominees) became marketable superstars. Others who make appearances include: Ving Rhames, Christopher Walken, Eric Stoltz, Rosanna Arquette, Steve Buscemi, Frank Whaley, Harvey Keitel, and of course Quentin Tarantino himself. They all leave lasting impressions as well. Samuel L. Jackson stood out the most to me, his lack of substantial screen time may have cost him the Oscar. Just an amazing accomplishment, all involved deserve recognition. Easily 5 stars out of 5."
    },
    {
      "username": "jaaanmerz",
      "userUrl": "https://www.imdb.com/user/ur125929843",
      "reviewLink": "https://www.imdb.com/review/rw6239891",
      "warningSpoilers": false,
      "date": "6 November 2020",
      "rate": "10",
      "helpful": "59 out of 72 found this helpful.",
      "title": "My Favourite Movie",
      "content": "Pulp Fiction is the most original, rule breaking film I have ever seen. Instead of following the widely used 3 act structure, Pulp Fiction makes up its own and while the 3 stories may seem completely disconnected at first, once you look closely you can find the underlying themes that they all share. Anyone who says that the movie lacks focus or has no meaning hasn't analysed enough. I highly recommend this film since it is number one on my list of my favourite movies of all time."
    },
    {
      "username": "Jeremy_Urquhart",
      "userUrl": "https://www.imdb.com/user/ur26226712",
      "reviewLink": "https://www.imdb.com/review/rw5658505",
      "warningSpoilers": true,
      "date": "20 April 2020",
      "rate": "10",
      "helpful": "21 out of 28 found this helpful.",
      "title": "Always has been, and always will be a personal favourite",
      "content": "Perhaps before I start talking about why I think Pulp Fiction works on so many levels, I should mention briefly how I came to watch the film. Pulp Fiction was a film I had heard of at a very young age, and I'm not quite sure why. I had also wanted to see it for a very long time- again, I'm not quite sure why. Maybe the mere fact that it was R-rated and notorious for its violence perked the interest of my 14-year-old self. Nevertheless, I got round to watching it about a month before my 15th birthday- incredibly late at night on an occasion where I found myself home alone. I recall being blown away by the film, but also somewhat overwhelmed and confused. I had never seen anything like it before, and walked away from it being kinda sure I'd enjoyed it. I couldn't say for sure though.Still feeling curious about the film, and the many mysteries relating to it that I'd failed to determine on my first viewing, I re-watched the film just a couple of months later. And something just clicked for me- I fell in love with the film. Everything about the movie suddenly worked for me, and I found the second viewing to be perhaps the shortest two and a half hours of my life I've ever experienced. My own sense of time was warped and bended to the extent that it was in the film itself. That very night it somehow became one of the greatest things I had ever watched; one of the only films I'd seen that I barely hesitated to call a masterpiece.Since then I've watched it another six or seven times- almost once a year- and I continue to feel motivated to watch it because I honestly feel like I get something new out of it each time I watch it.Spoilers ahead, by the way. I plan to get fairly in-depth with my review of this movie, so just a warning for those that haven't seen it.One of the great things about Pulp Fiction is its refusal to fall under any particular genre or category of movies. It feels like a comedy when Jules and Vince discuss fast food and foot massages for nearly ten minutes It feels like a thriller during several segments, notably the scene where Mia overdoses on heroin and the climactic Mexican stand-off in the restaurant- two sequences that would have even Alfred Hitchcock on the edge of his seat. The crime genre is represented through the character's actions- most of the cast are criminals in one way or another, whether they murder, steal, or take generous helpings of class-A drugs. The infamous gimp scene feels straight out of a horror movie.This collage of various movie genres is one of the things that makes the movie stand out- by themselves, certain scenes may feel familiar, but when they're all blended together so well like they are in Pulp Fiction, the end product ends up feeling unique. This is true for most of Quentin Tarantino's films- he borrows elements from different genres, and homages/ references dozens of older movies in order to create something that feels unique, even if most of the individual elements themselves aren't too original. I can see why some people may not be a fan of the fact Tarantino essentially steals from the lesser known works of those who came before him, but for me, I love it- I think he just makes it work due to the fact that his encyclopaedic knowledge of film allows him to borrow from so many sources. If he simply referenced about a half dozen or less films for each one of his movies, then I think that would start to feel like plagiarism.Now, I could go on about the acting, the screenplay, the direction, and the glorious soundtrack, but really, what's there to say about these elements of the film that haven't already been said? Tarantino's screenplay is one of the most acclaimed and quoted from the past couple of decades, and deservedly won him his first Oscar. His direction has been similarly praised, and the soundtrack has become iconic- most impressive of all is that Tarantino chose music that goes so well with the images they accompany. And yes, the acting is phenomenal- the film features what is almost certainly Samuel L. Jackson's best performance, one of Bruce Willis' most interesting performances of his long and successful career, and some great work from Uma Thurman. Even the supporting actors are memorable, including Harvey Keitel, Tim Roth, and Ving Rhames as Marsellus Wallace (who's arguably the film's main character- think about it; without him, none of the three main stories would exist- Butch ripped off Marsellus Wallace, Vince took out Wallace's girlfriend on a date that eventually went horribly wrong, and Vince and Jules were assigned to retrieve the mysterious briefcase for Wallace). And of course, who can forget that Pulp Fiction single-handedly made John Travolta cool again- an absolutely monumental achievement. Of course Travolta did eventually succeed in making himself a joke again a few years later when he made Battlefield Earth, but that's another story (or perhaps better left for another review)?As I said, I could indulge in commenting on these areas of the film, but if you've seen the movie you probably already know how good they are. Pulp Fiction is also one of the most discussed film's of the past 20 years, so you've likely already come across reviews or rabid Tarantino fans who've gushed about why the film works so well, and how fantastic all the various components of the film are.So instead, I'm going to backtrack back to my point about seeing something new in the film upon every new viewing, and explain what I took away from the movie on my most recent viewing.Pulp Fiction was always controversial for its violence, with some criticising its depiction of assaults, shootings, beatings, and exploding heads. But for me, I found the film to have an almost anti-violence message of sorts, and I only realised this on my most recent viewing. Now bear with me, because I know that sounds like a somewhat ridiculous claim, but I have my reasons. Pulp Fiction may be violent, but it doesn't promote violence. Sure, the violence may be somewhat stylised and at times over the top, but that doesn't mean the film is saying that violence is something trivial. Violent acts in the film are often shown to have consequences for those that commit them. Vince's carelessness with his gun- an instrument of violence- causes Marvin's head to be blown off in the backseat of Jules' car, which leads to a near twenty minute detour in which they must take the car to Jimmy's house and consult \"The Wolf\" to assist them in cleaning the car and disposing of the gory evidence. Marsellus' desire to get revenge on Butch by presumably killing him leads them both to the basement of the rednecks- indeed, they are both fighting each other in the redneck's store when they are taken captive.But in the climax of the film, where guns are being pointed at several characters in the middle of a tense Mexican stand-off, not a single bullet is fired. One would expect the tension to be eventually broken and the bullets to start flying, especially if one has seen some of Taratino's other movies that end in explosive and violent climaxes (see Reservoir Dogs, Inglorious Basterds, Death Proof, Django Unchained, and Kill Bill Volume 1). But instead, Jules, who we've seen to be ruthless and unafraid to kill earlier in the movie, believes himself to be a changed man after miraculously surviving a hail-storm of bullets from a criminal that looks a little like Jerry Seinfeld and so instead decides to defuse the situation peacefully. He talks down Pumpkin and Honey-Bunny from killing or robbing anyone, and insists that his dim-witted associate Vince refrain from hurting anyone too. He delivers an absolutely stunning monologue where he ponders the bible reading he quoted so confidently earlier in the movie, and it's damn-near poetic. It sends a shiver up my spine every time I watch that scene, and indeed, Jules' speech works. The two robbers get up after Jules gives them some money from his famous wallet, and then leave. Jules and Vince do the same a few moments later.Not a shot is fired. No one is killed. It's an absolutely beautiful scene.It may have been tempting for Tarantino to give the film a \"Wild Bunch-esque\" ending, but instead he refrained, and I'm glad he did so. The climax to Pulp Fiction is absolutely stunning- fifteen minutes of tension, almost poetic dialogue, and brilliant acting, especially from Samuel L. Jackson. And it took me seven viewings just to notice how beautifully peaceful the ending of the film was. And that's why it's my favourite film of all time- I get new meaning from it, or appreciate different areas of it every-time I watch it.If you've never seen Pulp Fiction before, I implore you to go watch it. And if you have seen Pulp Fiction before, I implore you to go watch it again."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6443003",
      "warningSpoilers": true,
      "date": "4 January 2021",
      "rate": "9",
      "helpful": "38 out of 54 found this helpful.",
      "title": "Pulp Fiction",
      "content": "One of the best movies I have ever seen is a fun and enjoyable story, as most of the film's characters were excellent, and it brought back the character of Butch and his girlfriend, Vincent was the best character and his death was shocking and I did not. Expect that, the interconnectedness of the film's stories was excellent, the direction in the film was excellent The film, the acting in the movie was very cool, I recommend it, and it is the best film by Quentin Tarantino"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2170128",
      "warningSpoilers": false,
      "date": "7 December 2009",
      "rate": "10",
      "helpful": "31 out of 46 found this helpful.",
      "title": "One of the Funniest Movies Ever",
      "content": "It took fifteen years and a subscription to Netflix to finally get around to seeing this film. It was well worth the wait. If all one were to see is the byplay between Samuel L. Jackson and John Travolta, it would be worth the price of admission. But this is only part of the incredible effect this film has. I don't even like gore in movies; I avoid it. But Tarentino weaves a culture of violence where there is actual humanity. We care about these bad guys. There is scene after scene of people being pushed to the limit. The very idea that the boxer, played by Bruce Willis, would risk everything to retrieve a watch that has been transported on two occasions, shove up someone's ass, is amazing. And very, very funny. I can't begin to list all the wonderful scenes. The opening dialogue is incredible as Trovolta and Jackson are on their way to do a hit. They have virtually no respect for human life, yet they, themselves, are very human. The date scene with Uma Thurman with the adrenaline shot. The crazy's in the pawn shop. And, the effort to clean up the car after blowing away a kid in the back seat, the issue being that a guys wife would come home and be very unhappy to find a dead body and a blood filled car in the garage. It sounds horrible and makes me sound sick. I found Fargo to be a hilarious film as well. Is there something wrong with me?"
    },
    {
      "username": "Stefan_Loves_Movies",
      "userUrl": "https://www.imdb.com/user/ur116311545",
      "reviewLink": "https://www.imdb.com/review/rw8477361",
      "warningSpoilers": false,
      "date": "22 August 2022",
      "rate": "6",
      "helpful": "32 out of 44 found this helpful.",
      "title": "I didn't get it",
      "content": "I heard so many people claim that this movie is a masterpiece and it also has high ratings. So I was intrigued to give it a go. I didn't get much enjoyment out of it. Maybe you have to watch it multiple times to enjoy it. As for the first viewing it didn't satisfy me."
    },
    {
      "username": "Rainey-Dawn",
      "userUrl": "https://www.imdb.com/user/ur35635716",
      "reviewLink": "https://www.imdb.com/review/rw3040308",
      "warningSpoilers": false,
      "date": "27 June 2014",
      "rate": "7",
      "helpful": "58 out of 93 found this helpful.",
      "title": "A Bit Over Rated But Good",
      "content": "I did like pulp fiction to a degree - that is mainly because I love the casting in it: John Travolta, Samuel L. Jackson and Uma Thurman.The movie is a good crime thriller that all movie lovers should watch. And in some ways the movie does live up to it's hype because the story is well written and acted out good too.But, to me, the movie is overrated. It seems that *some* of the people that loves this movie will act/talk like it's the only movie worth watching - like it is the \"King of Films\". Yes Pulp Fiction is a very good movie but there are so many great movies to enjoy watching - not just this film.7/10"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0345952",
      "warningSpoilers": false,
      "date": "20 January 2000",
      "rate": "10",
      "helpful": "381 out of 685 found this helpful.",
      "title": "One of the Best Film's I've Seen In A LONG Time... and still is",
      "content": "Quentin Tarantino's Pulp Fiction is a terrific film. It also gets better with each viewing, especially if one of those happens to be on a big theatrical screen where all of the BIG compositions get bigger and more detailed. How much else is there to talk about it after all these years? It's filled with dynamite, sudden and always interesting action, great and naturally clever dialogue, and memorable characters. Also, the acting is always something to behold as by turns straightforward, over the top, subtle, and just downright menacing and spot-on. The directing is one of the strongest that we've seen from Tarantino, as he makes his choices in pacing with shots in unconventional ways but never in a way that would be distracting. And writing, already noted, has been copied by many, and only equaled by a select few. The dance sequence. Samuel L. Jackson's superlative monologuing. It has loyalty among low lifes, and many other odd characters that are all bad and not one is a villain or hero. And somehow even after years of parody and terrible rip-offs, it holds its own and- as one can say after seeing it at a midnight screening- holds its audience as much as it had the countless times before they saw it (or if they are, the first time). The first time you're surprised, the second time you look for the clues or other ambiguity, and then the third time you laugh you head off. The fourth time... I'll leave to you."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8635523",
      "warningSpoilers": false,
      "date": "25 October 2022",
      "rate": "9",
      "helpful": "14 out of 20 found this helpful.",
      "title": "Poetry in Motion...",
      "content": "A pair of assassins in search of McGuffin, unclear what's inside but it's probably nothing, employed by Marcellus to recover his debts, in the course of their work, people lose their assets; one hitman's called Vincent who likes to shoot up, not just firearms but with needles close up, when out with the wife of the boss cuts it close, as she snorts all his gear and then goes overdose; a boxer called Butch throws a fight the wrong way, Marcellus sends Vince to reclaim the foul play, but events take a turn, there's a bit of a twist, as the boss and the boxer are caught in a tryst; a cleaner called Winston removes every trace, of all that remains when you're shot in the face, and a pair of till robbers with new openings, help Jules to consider, should he do other things."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2220181",
      "warningSpoilers": false,
      "date": "13 March 2010",
      "rate": "10",
      "helpful": "37 out of 62 found this helpful.",
      "title": "Brilliantly constructed.",
      "content": "\"Pulp Fiction\" is a brilliantly crafted film. The many separate vignettes all are quite compelling and fit together wonderfully. And, on top of that, the script and acting are exceptional. And, most importantly, the film is wildly original and very, very stylish. The only reservations I have are minor. First, while this is a very, very good film, I can't see why it is ranked #5 all-time on IMDb. This seems wildly overrated and too often more recent films seem to dominated IMDb's Top 250. Second, this film is certainly NOT for everyone, as in spots it is tremendously violent (like any Tarantino film) and should not be viewed by kids or the overly sensitive.Because there are so many reviews for the film already, I won't bother to try to give a synopsis of the film or do an in-depth analysis."
    },
    {
      "username": "marcferrantejr",
      "userUrl": "https://www.imdb.com/user/ur63817467",
      "reviewLink": "https://www.imdb.com/review/rw5647849",
      "warningSpoilers": false,
      "date": "17 April 2020",
      "rate": "10",
      "helpful": "37 out of 51 found this helpful.",
      "title": "Perfect Movie",
      "content": "This is my favorite film of all time. Every second of this film is engaging, and I'm not exaggerating when I say that. Tarantino's direction and script is brilliant, and every role is perfectly cast. Everything that happens in this movie has a purpose, and you don't realize it's hidden in plain sight until the final moments"
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw2565432",
      "warningSpoilers": false,
      "date": "13 February 2012",
      "rate": "10",
      "helpful": "33 out of 55 found this helpful.",
      "title": "Ah, so by that rationale, if a pig had a better personality, he would cease to be a filthy animal. Is that true?",
      "content": "It kind of feels redundant trying to write a review for Pulp Fiction as it approaches its 20th birthday. As a film it needs no introduction, it won the Palme d'Or at Cannes, won a BAFTA and Academy Award for Best Original Screenplay (Tarantino), and garnered a whole host of other awards and nominations. Box office beef was meaty and its reputation even now shows no sign of waning (it currently sits at number 4 on the IMDb top 100 list), it is by definition one cool MOFO of a movie, a picture loved by a cross section of demographics. But why?Pulp Fiction oozes humour, romance, violence and stylish flourishes. It remains compulsive viewing throughout; even as it threatens to get submerged in its own complex structure. Film lover Tarantino takes a number of low life and unfortunate characters from Los Angeles, mainlines then with movie clichés, and then amazingly breathes new life into them. It knowingly winks at B movies from the past yet always remains fresh on its own terms. I myself having just revisited the film after a 5 year gap can attest to just how well it holds up, laughing at the dialogue, perched on the edge of the seat as violence starts to rumble, and yes, singing along with that most catchy of soundtracks.Yet for all its flashiness and hipster chattering, there's one thing that often gets overlooked when talk of Pulp Fiction's greatness arises. That of a basic human urge to survive or find salvation, Tarantino's main characters may be bottom feeders or scummy operatives of the underworld, but there's love and needing beating slowly in its dark heart before the drugs and violence take a hold. Neat trick that from Tarantino, brilliant in fact. 10/10"
    },
    {
      "username": "discoelephant64",
      "userUrl": "https://www.imdb.com/user/ur4568292",
      "reviewLink": "https://www.imdb.com/review/rw1002625",
      "warningSpoilers": false,
      "date": "19 January 2005",
      "rate": "10",
      "helpful": "762 out of 1,237 found this helpful.",
      "title": "Unbelievable.",
      "content": "Pulp Fiction may be the single best film ever made, and quite appropriately it is by one of the most creative directors of all time, Quentin Tarantino. This movie is amazing from the beginning definition of pulp to the end credits and boasts one of the best casts ever assembled with the likes of Bruce Willis, Samuel L. Jackson, John Travolta, Uma Thurman, Harvey Keitel, Tim Roth and Christopher Walken. The dialog is surprisingly humorous for this type of film, and I think that's what has made it so successful. Wrongfully denied the many Oscars it was nominated for, Pulp Fiction is by far the best film of the 90s and no Tarantino film has surpassed the quality of this movie (although Kill Bill came close). As far as I'm concerned this is the top film of all-time and definitely deserves a watch if you haven't seen it."
    },
    {
      "username": "Luke-20",
      "userUrl": "https://www.imdb.com/user/ur0059014",
      "reviewLink": "https://www.imdb.com/review/rw0346287",
      "warningSpoilers": true,
      "date": "30 December 1998",
      "rate": "10",
      "helpful": "663 out of 979 found this helpful.",
      "title": "One of the best movies of the century!",
      "content": "If you think \"Pulp Fiction\" is brilliant, you're wrong. It's more than that. It's a milestone in the history of film making. It's already a classic. But why? Because of the many \"f\" words, or maybe because of the brain and skull pieces on the rear window of a car? No, that's surely not the point (unfortunately some other users - fortunately the minority - don't get it). Tarantino has made a movie that's someway different from many other action, gangster or crime movies. What's so different? He knows the subject of the movie is \"cool\", he knows it's a product of mass culture, and he even likes it by himself. But he smiles at it and tells three great stories with a lot of irony. And this irony is the first point. The second point is that he gave souls to extremely schematic characters. They surely aren't another action heroes who you forget as fast as you can twinkle. They are human beings like we are, talking about Burger King and McDonalds, about TV series and a foot massage. They just earn their money with killing others or selling drugs. What else is so great about \"Pulp Fiction\"? It's the acting, the directing, the cinematography, the soundtrack, the sense of humour and the whole rest. In my opinion it's all worth nothing less than a 10 out of 10. A masterpiece."
    },
    {
      "username": "Gatorman9",
      "userUrl": "https://www.imdb.com/user/ur2372297",
      "reviewLink": "https://www.imdb.com/review/rw0346629",
      "warningSpoilers": false,
      "date": "18 April 2004",
      "rate": "",
      "helpful": "269 out of 496 found this helpful.",
      "title": "Awesome!",
      "content": "I just finished screening this movie for the first time after putting it off for a number of years because of what seemed like equivocating appraisals from some of my friends. In hindsight, however, it seems to me that while the movie must have definitely bowled them over, overall they weren't sure exactly what to make of it or how to articulate what were probably a confused mix of feelings. But I am so impressed that I feel compelled to add a few specific observations to the many fine reviews already on this database.First, this movie hits you with an impact somewhere in between, say, APOCALYPSE NOW and A CLOCKWORK ORANGE, and for some people may be just as disturbing (however, in this respect I am happy to report I didn't think it rose to the level of NATURAL BORN KILLERS). Full of graphically violent action and language, PULP FICTION is not a picture for everyone - I would definitely not recommend it to my parents, born in the 1930's (even to my one fairly \"hip\" relative of the same generation who, at age 66, still teaches high school sex education and likes to talk about things like sunbathing nude, among other potentially sensitive issues).Irrespective of audience sensibilities, however, the film-makers, supported by superb acting in every role, manage to create a world full of the most fascinating sleazy characters possibly ever to appear on screen. From Travolta's pronounced almost-child-like curiosity about the world to Jackson's sincere and thoughtful philosophical ruminating and Willis's deep devotion to the memory of his father, I think such fascination lies not only in the characters' personalities as they are portrayed but in the way they tantalize the viewer into considering the possibility that such people could actually exist. As a lawyer of some years' experience dealing with all sorts of people I was particularly drawn to this aspect of the film.Thus, and in response to some other reviewers' comments, I think this movie is more character-driven than plot-driven. Instead of a story peopled by basically weakly developed characters employed primarily as a mere device to move the plot along, as is too frequently the case in the movies (especially these days), the undeniably strong, clever, and unpredictable plot lines in PULP FICTION are actually of essentially secondary interest and importance, serving primarily as vehicles to get you worried about the fate of characters you can't help caring about despite the truly low attributes that otherwise form the basis for their respective personas. As at least one other reviewer noted, when the film ends you are actually disappointed, left craving more of these crazy people and their explosive lives.Finally, and as strange as it may sound, this film reminds me of another Monumentally Great Film which one would never typically associate with it in any way in a million years - CASABLANCA. As in that film made way back in 1942, and as another reviewer has suggested, perhaps its special appeal - its unusually high degree of emotional impact - lies in its distinctly successful simultaneous application of several different genres in a single film - drama, action, dark humor - with the whole thing bound together by essentially flawless execution in every department. And while CASABLANCA is no doubt clearly much more wholesome and high-minded, like the older film PULP FICTION is not without a pronounced theme of redemption, even if it is not as strongly felt, considering all the later film's sleaze and violence.In sum, when people say that this is probably the best film of the 1990's, it is easy to see why. Fundamentally a truly outstanding movie, it is a must-see for anyone who considers themself a film buff and can handle graphic subject matter.(Incidentally, if you would like a more toned-down, much more overtly humorous and less serious picture with a not-altogether dissimilar look and feel, don't miss another 1990's Travolta picture, GET SHORTY.)"
    },
    {
      "username": "TheHoodOfSwords",
      "userUrl": "https://www.imdb.com/user/ur106575348",
      "reviewLink": "https://www.imdb.com/review/rw5661003",
      "warningSpoilers": false,
      "date": "21 April 2020",
      "rate": "8",
      "helpful": "40 out of 68 found this helpful.",
      "title": "Fun cult film, tad overrated",
      "content": "Conflicted on this one. I like a lot of elements of it, the characters are (mostly) really compelling and interesting. I think some of the \"Segments\" are a lot stronger than others. I think that the first part of Bruce Willis's story is just... bland. I didn't find it very interesting or compelling. It gets interesting though. The first and last are by far my favourite, but for the most part it's pretty strong. I do think this film is slightly overrated. That's not to say that it isn't good, but I think a lot of people think it is a whole lot better then it is. The film is acted well and I enjoyed all the action, not to mention the comedy in this film caught me by surprise. I found it really hilarious. I see why everyone had/has a crush on Uma Thurman now, she really is deserving of the main character on the cover. I also remembered how much I like long shots. I think they allow exposition to be delivered in a way that is more pleasing to the audience. Overall, good crime flick with some great comedy and action but a tad overrated. 7-8/10."
    },
    {
      "username": "paulevenas",
      "userUrl": "https://www.imdb.com/user/ur114254451",
      "reviewLink": "https://www.imdb.com/review/rw6531138",
      "warningSpoilers": false,
      "date": "26 January 2021",
      "rate": "10",
      "helpful": "39 out of 47 found this helpful.",
      "title": "Incredible",
      "content": "Just the best movie... I can imagine my family seeing this movie in 30 years. I really love this movie and his soundtrack."
    },
    {
      "username": "maryolalov",
      "userUrl": "https://www.imdb.com/user/ur69458085",
      "reviewLink": "https://www.imdb.com/review/rw4606172",
      "warningSpoilers": true,
      "date": "25 January 2019",
      "rate": "9",
      "helpful": "29 out of 44 found this helpful.",
      "title": "A true Tarantino classic",
      "content": "Pulp Fiction is one of those movies that not everyone can enjoy. Many people say that it's boring and senseless. It is true that the plot isn't something special but it isn't the plot that makes this movie so unique but the awesome script and great cinematography.Probably one of the greatest things in this movie are the dialogues. The dialogues just like in all other Tarantino movies aren't directly connected with the plot. Take the first dialogue between Samuel Jackson and John Travolta. They are talking about how a certain burger is called in France. This and many others dialogues don't have a direct relation with the plot line but their function is to somehow build the characters' personalities.The other thing that makes this movie so unique is the unexpected turn of events. Like in all other Tarantino movies you don't know who they are going to kill next or what is going to happen. The scene where Vincent shoots Marvin in the face is a great example for such unexpected turn of events. This makes the viewer more intrigued and thus makes the whole experience form the movie way better.There isn't much more that can be said about Pulp Fiction. It's not a movie that everyone will enjoy but still deserves to be seen."
    },
    {
      "username": "wolvesrug",
      "userUrl": "https://www.imdb.com/user/ur1515595",
      "reviewLink": "https://www.imdb.com/review/rw0995534",
      "warningSpoilers": false,
      "date": "9 January 2005",
      "rate": "10",
      "helpful": "1,054 out of 1,448 found this helpful.",
      "title": "Simply The Best",
      "content": "To put this in context, I am 34 years old and I have to say that this is the best film I have seen without doubt and I don't expect it will be beaten as far as I am concerned. Obviously times move on, and I acknowledge that due to its violence and one particularly uncomfortable scene this film is not for everyone, but I still remember watching it for the first time, and it blew me away. Anyone who watches it now has to remember that it actually changed the history of cinema. In context- it followed a decade or more of action films that always ended with a chase sequence where the hero saved the day - you could have written those films yourself. Pulp had you gripped and credited the audience with intelligence. There is not a line of wasted dialogue and the movie incorporates a number of complexities that are not immediately obvious. It also resurrected the career of Grease icon John Travolta and highlighted the acting talent of Samuel L Jackson. There are many films now that are edited out of sequence and have multiple plots etc but this is the one they all want to be, or all want to beat, but never will."
    }
  ],
  "errorMessage": ""
}