{
  "imDbId": "tt0110912",
  "title": "Pulp Fiction",
  "fullTitle": "Pulp Fiction (1994)",
  "type": "Movie",
  "year": "1994",
  "language": "en",
  "titleInLanguage": "Pulp Fiction",
  "url": "https://en.wikipedia.org/wiki/Pulp_Fiction",
  "plotShort": {
    "plainText": "Pulp Fiction is a 1994 American crime film written and directed by Quentin Tarantino from a story he conceived with Roger Avary. It tells four intertwining tales of crime and violence in Los Angeles, California. The film stars John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.\r\nTarantino wrote Pulp Fiction in 1992 and 1993, incorporating scenes that Avary originally wrote for True Romance (1993). Its plot occurs out of chronological order. The film is also self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of \"pulp.\" Considerable screen time is devoted to monologues and casual conversations with eclectic dialogue revealing each character's perspectives on several subjects, and the film features an ironic combination of humor and strong violence. TriStar Pictures reportedly turned down the script as \"too demented.\" Miramax co-chairman Harvey Weinstein was enthralled, however, and the film became the first that Miramax fully financed.\r\nPulp Fiction won the Palme d'Or at the 1994 Cannes Film Festival and was a major critical and commercial success. It was nominated for seven awards at the 67th Academy Awards, including Best Picture, and won Best Original Screenplay; it earned Travolta, Jackson, and Thurman Academy Award nominations and boosted their careers. Its development, marketing, distribution, and profitability had a sweeping effect on independent cinema.\r\nPulp Fiction is widely regarded as Tarantino's magnum opus, with particular praise for its screenwriting. The self-reflexivity, unconventional structure, and extensive homage and pastiche have led critics to describe it as a touchstone of postmodern film. It is often considered a cultural watershed, influencing films and other media that adopted elements of its style. The cast was also widely praised, with Travolta, Thurman, and Jackson earning particular acclaim. In 2008, Entertainment Weekly named it the best film since 1983 and it has appeared on many critics' lists of the greatest films ever made. In 2013, Pulp Fiction was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant.\"",
    "html": "<p>Pulp Fiction is a 1994 American crime film written and directed by Quentin Tarantino from a story he conceived with Roger Avary. It tells four intertwining tales of crime and violence in Los Angeles, California. The film stars John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.</p><p>Tarantino wrote Pulp Fiction in 1992 and 1993, incorporating scenes that Avary originally wrote for True Romance (1993). Its plot occurs out of chronological order. The film is also self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of \"pulp.\" Considerable screen time is devoted to monologues and casual conversations with eclectic dialogue revealing each character's perspectives on several subjects, and the film features an ironic combination of humor and strong violence. TriStar Pictures reportedly turned down the script as \"too demented.\" Miramax co-chairman Harvey Weinstein was enthralled, however, and the film became the first that Miramax fully financed.</p><p>Pulp Fiction won the Palme d'Or at the 1994 Cannes Film Festival and was a major critical and commercial success. It was nominated for seven awards at the 67th Academy Awards, including Best Picture, and won Best Original Screenplay; it earned Travolta, Jackson, and Thurman Academy Award nominations and boosted their careers. Its development, marketing, distribution, and profitability had a sweeping effect on independent cinema.</p><p>Pulp Fiction is widely regarded as Tarantino's magnum opus, with particular praise for its screenwriting. The self-reflexivity, unconventional structure, and extensive homage and pastiche have led critics to describe it as a touchstone of postmodern film. It is often considered a cultural watershed, influencing films and other media that adopted elements of its style. The cast was also widely praised, with Travolta, Thurman, and Jackson earning particular acclaim. In 2008, Entertainment Weekly named it the best film since 1983 and it has appeared on many critics' lists of the greatest films ever made. In 2013, Pulp Fiction was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant.\"</p>"
  },
  "plotFull": {
    "plainText": "Pulp Fiction is a 1994 American crime film written and directed by Quentin Tarantino from a story he conceived with Roger Avary. It tells four intertwining tales of crime and violence in Los Angeles, California. The film stars John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.\r\nTarantino wrote Pulp Fiction in 1992 and 1993, incorporating scenes that Avary originally wrote for True Romance (1993). Its plot occurs out of chronological order. The film is also self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of \"pulp.\" Considerable screen time is devoted to monologues and casual conversations with eclectic dialogue revealing each character's perspectives on several subjects, and the film features an ironic combination of humor and strong violence. TriStar Pictures reportedly turned down the script as \"too demented.\" Miramax co-chairman Harvey Weinstein was enthralled, however, and the film became the first that Miramax fully financed.\r\nPulp Fiction won the Palme d'Or at the 1994 Cannes Film Festival and was a major critical and commercial success. It was nominated for seven awards at the 67th Academy Awards, including Best Picture, and won Best Original Screenplay; it earned Travolta, Jackson, and Thurman Academy Award nominations and boosted their careers. Its development, marketing, distribution, and profitability had a sweeping effect on independent cinema.\r\nPulp Fiction is widely regarded as Tarantino's magnum opus, with particular praise for its screenwriting. The self-reflexivity, unconventional structure, and extensive homage and pastiche have led critics to describe it as a touchstone of postmodern film. It is often considered a cultural watershed, influencing films and other media that adopted elements of its style. The cast was also widely praised, with Travolta, Thurman, and Jackson earning particular acclaim. In 2008, Entertainment Weekly named it the best film since 1983 and it has appeared on many critics' lists of the greatest films ever made. In 2013, Pulp Fiction was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant.\"\r\nPlot\r\nNarrative structure\r\nPulp Fiction's narrative is told out of chronological order and follows three main interrelated stories that each have a different protagonist: Vincent Vega, a hitman; Butch Coolidge, a prizefighter; and Jules Winnfield, Vincent's business partner.\r\nThe film begins with a diner hold-up staged by a couple, then begins to shift from one storyline to another before returning to the diner for the conclusion. There are seven narrative sequences; the three primary storylines are preceded by intertitles:\r\nIf the seven sequences were ordered chronologically, they would run: 4a, 2, 6, 1, 7, 3, 4b, 5. Sequences 1 and 7 partially overlap and are presented from different points of view, as do sequences 2 and 6. According to Philip Parker, the structural form is \"an episodic narrative with circular events adding a beginning and end and allowing references to elements of each separate episode to be made throughout the narrative\". Other analysts describe the structure as a \"circular narrative\".\r\nSummary\r\nHitmen Jules Winnfield and Vincent Vega arrive at an apartment to retrieve a briefcase for their boss, gangster Marsellus Wallace, from a business partner, Brett. After Vincent checks the contents of the briefcase, Jules shoots one of Brett's associates. He declaims a passage from the Bible, and he and Vincent kill Brett for trying to double-cross Marsellus.\r\nAnother man bursts out of the bathroom and fires at them, but every shot misses; after briefly checking themselves for wounds, Jules and Vincent shoot him dead. While driving away with Brett's associate Marvin, Jules professes that their survival was a miracle, which Vincent disputes. Vincent accidentally shoots Marvin in the face, killing him, and covering Vincent, Jules, and the car interior in blood in broad daylight. They hide the car at the home of Jules's friend Jimmie, who demands they deal with the problem before his wife, Bonnie, comes home. Marsellus sends a cleaner, Winston Wolfe, who directs Jules and Vincent to clean the car, hide the body in the trunk, dispose of their bloody clothes, and take the car to a junkyard.\r\nAt a diner, Jules tells Vincent that he plans to retire from his life of crime, convinced that their \"miraculous\" survival at the apartment was a sign of divine intervention. While Vincent is in the bathroom, a couple, \"Pumpkin\" and \"Honey Bunny\", hold up the restaurant and demand Marsellus's briefcase. Jules distracts Pumpkin with its contents, and then overpowers him and holds him at gunpoint; Honey Bunny becomes hysterical and points her gun at Jules. Vincent returns with his gun aimed at her, but Jules defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Jules and Vincent leave the diner with the briefcase in hand. They take the briefcase to Marsellus and wait while he bribes boxer Butch Coolidge to take a dive in his upcoming match.\r\nThe next day, Vincent purchases heroin from his drug dealer, Lance. He shoots up and drives to meet Marsellus's trophy wife, Mia, having agreed to escort her while Marsellus is out of town. They eat at Jack Rabbit Slim's, a 1950s-themed restaurant, and participate in a twist contest, then return home. While Vincent is in the bathroom, Mia finds his heroin and snorts it, mistaking it for cocaine. She suffers an overdose; Vincent rushes her to Lance's house, where they revive her with an injection of adrenaline into her heart. Vincent drops Mia off at her home, and the two agree never to tell Marsellus about the incident.\r\nButch bets the bribe money on himself and double-crosses Marsellus, winning the bout but accidentally killing his opponent as well. Knowing that Marsellus will send hitmen after him, he prepares to flee with his girlfriend, Fabienne, but discovers she has forgotten to pack a gold watch passed down to him through his family. Returning to his apartment to retrieve it, he notices a gun on the kitchen counter and hears the toilet flush. When Vincent exits the bathroom, Butch shoots him dead and departs.\r\nWhen Marsellus spots Butch stopped at a traffic light, Butch rams his car into him, then gets hit by an oncoming vehicle, leaving both of them injured and dazed. Once Marsellus regains consciousness, he shoots at Butch, chasing him into a pawnshop. Butch gains the upper hand and is about to shoot Marsellus, but the shop owner, Maynard, captures them at gunpoint and binds and gags them in the basement. Maynard and his accomplice Zed take Marsellus into another room and begin to rape him, leaving the \"gimp\" – a silent figure in a bondage suit – to watch over Butch. Butch breaks loose and knocks the gimp unconscious. Instead of fleeing, he decides to save Marsellus, and arms himself with a katana from the pawnshop. He kills Maynard and frees Marsellus, who shoots Zed in the crotch with Maynard's shotgun. Marsellus informs Butch that they are even, and to tell no one about the rape and to depart Los Angeles forever. Butch picks up Fabienne on Zed's motorcycle, and they ride away.\r\nCast\r\nJohn Travolta as Vincent Vega:\r\nSamuel L. Jackson as Jules Winnfield:\r\nUma Thurman as Mia Wallace:\r\nHarvey Keitel as Winston Wolfe:\r\nTim Roth as Ringo/\"Pumpkin\":\r\nAmanda Plummer as Yolanda/\"Honey Bunny\":\r\nMaria de Medeiros as Fabienne:\r\nVing Rhames as Marsellus Wallace:\r\nEric Stoltz as Lance:\r\nRosanna Arquette as Jody:\r\nChristopher Walken as Captain Koons:\r\nBruce Willis as Butch Coolidge:\r\nBronagh Gallagher plays Jody's friend Trudi who does little but smoke a bong during the scene where Vincent revives Mia. According to author Jason Bailey, \"Quentin thought it would be funny to have this casual observer who just happened to be there. All of this was born out of the experience of, when you go to someone's house to buy drugs, there are always people who are just there\". Phil LaMarr portrays Marvin, an associate of Jules and Vincent. LaMarr auditioned for Tarantino after both had done a show for an improv group a few months prior. He read for the roles of Jules Winnfield and Brett before being cast as Marvin. Tarantino appears as Jules' friend Jimmie, in whose house they clean up a murder. Tarantino was unsure whether to play Jimmie or Lance, choosing Jimmie as he wanted to be behind the camera during Mia's overdose scene.\r\nFrank Whaley portrays Brett, who has a briefcase requested by Marcellus. Whaley met Tarantino while he was filming Reservoir Dogs at a lab in Sundance Institute. He recalls, \"we ended up meeting and spending time together, and I liked him, so I was really happy when he asked me to be in this movie.\" Burr Steers appears as Roger, a friend of Brett's nicknamed \"Flock of Seagulls\" by Jules. The scene of the confrontation between Brett and Jules went through several takes due to Steers making mistakes. Steers recalled in an interview that he had found acting difficult due to the loudness of the gunshots.\r\nAngela Jones portrays Esmeralda Villalobos, a cab driver who aids Butch's escape. Her casting and character were inspired by her performance in the 1991 short film Curdled, later remade as a 1996 feature film with finance from Tarantino and again starring Jones. Duane Whitaker, Peter Greene and Stephen Hibbert play Maynard, Zed and the gimp. According to The Daily Beast, these \"three psycho hillbillies\" that rape Marsellus in Maynard's shop's basement allude to the film Deliverance. Steve Buscemi makes a cameo appearance as a waiter at Jack Rabbit Slim's, dressed as Buddy Holly. Buscemi, who had appeared in Reservoir Dogs, was originally considered for the role of Jimmie but was unable to commit. Kathy Griffin appears as herself. Michael Gilden and Joseph Pilato also appear at Jack Rabbit Slim’s as waiter Phillip Morris Page and a Dean Martin impersonator, respectively. Emil Sitka made a cameo via posthumous archive footage, Karen Maruyama appears as “Gawker #1” after Butch’s car accident, and Julia Sweeney portrays Raquel, the daughter of the owner of the junkyard in which Marvin’s body is disposed of. Producer Lawrence Bender makes a cameo as a victim of the diner robbery, credited as “Long Hair Yuppie-Scum”. Jerome Patrick Hoban appears in the Jack Rabbit Slim's segment as an Ed Sullivan impersonator. Susan Griffiths appears alongside Hoban as a Marilyn Monroe impersonator.\r\nProduction\r\nWriting\r\nRoger Avary wrote the first element of what would become the Pulp Fiction screenplay in the fall of 1990:\r\nTarantino and Avary decided to write a short, on the theory that it would be easier to get made than a feature. But they quickly realized that nobody produces shorts, so the film became a trilogy, with one section by Tarantino, one by Avary, and one by a third director who never materialized. Each eventually expanded his section into a feature-length script.\r\nThe initial inspiration was the three-part horror anthology film Black Sabbath (1963), by Italian filmmaker Mario Bava. The Tarantino–Avary project was provisionally titled \"Black Mask\", after the seminal hardboiled crime fiction magazine. Tarantino's script was produced as Reservoir Dogs, his directorial debut; Avary created the basis for the \"Gold Watch\" storyline of Pulp Fiction.\r\nWith work on Reservoir Dogs completed, Tarantino returned to the notion of a trilogy film: \"I got the idea of doing something that novelists get a chance to do but filmmakers don't: telling three separate stories, having characters float in and out with different weights depending on the story.\" Tarantino explains that the idea \"was basically to take like the oldest chestnuts that you've ever seen when it comes to crime stories – the oldest stories in the book ... You know, 'Vincent Vega and Marsellus Wallace's Wife' – the oldest story about ... the guy's gotta go out with the big man's wife and don't touch her. You know, you've seen the story a zillion times.\" \"I'm using old forms of storytelling and then purposely having them run awry\", he says. \"Part of the trick is to take these movie characters, these genre characters and these genre situations and actually apply them to some of real life's rules and see how they unravel.\" In at least one case, boxer Butch Coolidge, Tarantino had in mind a specific character from a classic Hollywood crime story: \"I wanted him to be basically like Ralph Meeker as Mike Hammer in Aldrich's Kiss Me Deadly. I wanted him to be a bully and a jerk\".\r\nTarantino went to work on the script for Pulp Fiction in Amsterdam in March 1992, possibly at the Winston Hotel in the Red Light District. He was joined there by Avary, who contributed \"Pandemonium Reigns\" to the project and participated in its rewriting as well as the development of the new storylines that would link up with it. Two scenes originally written by Avary for the True Romance screenplay, exclusively credited to Tarantino, were incorporated into the opening of \"The Bonnie Situation\": the \"miraculous\" missed shots by the hidden gunman and the rear seat automobile killing. The notion of the crimeworld \"cleaner\" that became the heart of the episode was inspired by a short, Curdled, that Tarantino saw at a film festival. He cast the lead actress, Angela Jones, in Pulp Fiction and later backed the filmmakers' production of a feature-length version of Curdled. The script included a couple of made-up commercial brands that often featured in later Tarantino films: Big Kahuna burgers (a Big Kahuna soda cup appears in Reservoir Dogs) and Red Apple cigarettes. As he worked on the script, Tarantino also accompanied Reservoir Dogs around the European film festivals. Released in the United States in October 1992, the picture was a critical and commercial success. In January 1993, the Pulp Fiction script was complete.\r\nFinancing\r\nTarantino and his producer, Lawrence Bender, brought the script to Jersey Films. Before even seeing Reservoir Dogs, Jersey had attempted to sign Tarantino for his next project. Ultimately a development deal worth around $1 million had been struck: The deal gave A Band Apart, Bender and Tarantino's newly formed production company, initial financing and office facilities; Jersey got a share of the project and the right to shop the script to a studio. Jersey had a distribution and \"first look\" deal with Columbia TriStar, which paid Tarantino for the right to consider exercising its option. In February, Pulp Fiction appeared on a Variety list of films in pre-production at TriStar. In June, however, the studio put the script into turnaround. According to a studio executive, TriStar chief Mike Medavoy found it \"too demented\". There were suggestions that TriStar was resistant to back a film featuring a heroin user; there were also indications that the studio simply saw the project as too low-budget for its desired star-driven image. Avary – who was about to start shooting his own directorial debut, Killing Zoe – has said that TriStar's objections were comprehensive, encompassing the script's fundamental structure. He characterizes the studio's position: \"'This is the worst thing ever written. It makes no sense. Someone's dead and then they're alive. It's too long, violent, and unfilmable.' ... So I thought, 'That's that!'\"\r\nBender brought the script to Miramax, the formerly independent studio that had recently been acquired by Disney. Harvey Weinstein – co-chairman of Miramax, along with his brother Bob – was instantly enthralled by the script and the company picked it up. Pulp Fiction, the first Miramax project to get a green light after the Disney acquisition, was budgeted at $8.5 million. It became the first movie that Miramax completely financed. Helping hold costs down was the plan Bender executed to pay all the main actors the same amount per week, regardless of their industry status. The New York Times reported, \"Most of the actors received relatively small salaries along with a percentage of the profits.\" The biggest star to sign on to the project was Bruce Willis. Though he had recently appeared in several big-budget flops, he was still a major overseas draw. On the strength of his name, Miramax garnered $11 million for the film's worldwide rights, virtually ensuring its profitability.\r\nFilming\r\nPrincipal photography commenced on September 20, 1993. The lead offscreen talent had all worked with Tarantino on Reservoir Dogs – cinematographer Andrzej Sekuła, film editor Sally Menke, production designer David Wasco, and costume designer Betsy Heimann. According to Tarantino, \"e had $8 million. I wanted it to look like a $20–25 million movie. I wanted it to look like an epic. It's an epic in everything – in invention, in ambition, in length, in scope, in everything except the price tag.\" The film, he says, was shot \"on 50 ASA film stock, which is the slowest stock they make. The reason we use it is that it creates an almost no-grain image, it's lustrous. It's the closest thing we have to 50s Technicolor.\" The largest chunk of the budget – $150,000 – went to creating the Jack Rabbit Slim's set. It was built in a Culver City warehouse, where it was joined by several other sets, as well as the film's production offices. The diner sequence was shot on location in Hawthorne at the Hawthorne Grill, known for its Googie architecture. For the costumes, Tarantino took his inspiration from French director Jean-Pierre Melville, who believed that the clothes his characters wore were their symbolic suits of armor. Tarantino cast himself in a modest-sized role as he had in Reservoir Dogs. One of his pop totems, Fruit Brute, a long-discontinued General Mills cereal, also returned from the earlier film. The shoot wrapped on November 30. Before Pulp Fiction's premiere, Tarantino convinced Avary to forfeit his agreed-on cowriting credit and accept a \"story by\" credit, so the line \"Written and directed by Quentin Tarantino\" could be used in advertising and onscreen.\r\nMusic\r\nNo film score was composed for Pulp Fiction; Quentin Tarantino instead used an eclectic assortment of surf music, rock and roll, soul, and pop songs. Dick Dale's rendition of \"Misirlou\" plays during the opening credits. Tarantino chose surf music as the basic musical style for the film, but not, he insists, because of its association with surfing culture: \"To me it just sounds like rock and roll, even Morricone music. It sounds like rock and roll spaghetti Western music.\" Tarantino planned to use a power pop song, My Sharona by The Knack, during the film's rape scene, but ultimately discounted it.\r\nSome of the songs were suggested to Tarantino by his friends Chuck Kelley and Laura Lovelace, who were credited as music consultants. Lovelace also appeared in the film as Laura, a waitress; she reprises the role in Jackie Brown. The soundtrack album was released along with the film in 1994. The album peaked on the Billboard 200 chart at number 21. The single, Urge Overkill's cover of the Neil Diamond song \"Girl, You'll Be a Woman Soon\", reached number 59.\r\nEstella Tincknell describes how the particular combination of well-known and obscure recordings helps establish the film as a \"self-consciously 'cool' text. use of the mono-tracked, beat-heavy style of early 1960s U.S. 'underground' pop mixed with 'classic' ballads such as Dusty Springfield's 'Son of a Preacher Man' is crucial to the film's postmodern knowingness.\" She contrasts the soundtrack with that of Forrest Gump, the highest-grossing film of 1994, which also relies on period pop recordings: \"he version of 'the sixties' offered by Pulp Fiction ... is certainly not that of the publicly recognized counter-culture featured in Forrest Gump, but is, rather, a more genuinely marginal form of sub-culture based around a lifestyle – surfing, 'hanging' – that is resolutely apolitical.\" The soundtrack is central, she says, to the film's engagement with the \"younger, cinematically knowledgeable spectator\" it solicits.\r\nRelease and reception\r\nRelease and box office\r\nPulp Fiction premiered in May 1994 at the Cannes Film Festival. The Weinsteins \"hit the beach like commandos\", bringing the picture's entire cast over. The film was unveiled at a midnight hour screening and caused a sensation It won the Palme d'Or, the festival's top prize, generating a further wave of publicity.\r\nThe first U.S. review of the film was published on May 23 in industry trade magazine Variety. Todd McCarthy called Pulp Fiction a \"spectacularly entertaining piece of pop culture ... a startling, massive success.\" From Cannes forward, Tarantino was on the road continuously, promoting the film. Over the next few months it played in smaller festivals around Europe, building buzz: Nottingham, Munich, Taormina, Locarno, Norway, and San Sebastián. Tarantino later said, \"One thing that's cool is that by breaking up the linear structure, when I watch the film with an audience, it does break alpha state. It's like, all of a sudden, 'I gotta watch this ... I gotta pay attention.' You can almost feel everybody moving in their seats. It's actually fun to watch an audience in some ways chase after a movie.\" In late September, it opened the New York Film Festival. The New York Times published its review the day of the opening. Janet Maslin called the film a \"triumphant, cleverly disorienting journey through a demimonde that springs entirely from Mr. Tarantino's ripe imagination, a landscape of danger, shock, hilarity and vibrant local color ... has come up with a work of such depth, wit and blazing originality that it places him in the front ranks of American film makers.\"\r\nOn October 14, 1994, Pulp Fiction went into general release in the United States. As Peter Biskind describes, \"It was not platformed, that is, it did not open in a handful of theaters and roll out slowly as word of mouth built, the traditional way of releasing an indie film; it went wide immediately, into 1,100 theaters.\" In the eyes of some cultural critics, Reservoir Dogs had given Tarantino a reputation for glamorizing violence. Miramax played with the issue in its marketing campaign: \"You won't know the facts till you've seen the fiction\", went one slogan. Pulp Fiction was the top-grossing film at the US box office its first weekend with a gross of $9,311,882, edging out a Sylvester Stallone vehicle, The Specialist, which was in its second week and playing at more than twice as many theaters. The gross claimed by Miramax was disputed by others. Warner Bros. initially reported an estimated gross of $8.9 million for The Specialist with Bob Weinstein then reporting a gross for Pulp Fiction of $9.1 million, claiming that the film was on another 100 screens that had previously been overlooked. Warners then updated their gross to $9.3 million, claiming they had made a calculation error. Early Monday morning, Miramax reported a gross of $9.3 million with Warners reporting $8.9 million for The Specialist, placing Pulp Fiction first but other industry sources did not believe Miramax's numbers. Variety estimated that Pulp Fiction grossed $8.6 to $9 million for the weekend.\r\nAgainst its budget of $8.5 million and about $10 million in marketing costs, Pulp Fiction wound up grossing $107.93 million at the U.S. box office, making it the first \"indie\" film to surpass $100 million. Worldwide, it took in nearly $213 million. In terms of domestic grosses, it was the tenth biggest film of 1994, even though it played on substantially fewer screens than any other film in the top 20. Popular engagement with the film, such as speculation about the contents of the precious briefcase, \"indicates the kind of cult status that Pulp Fiction achieved almost immediately.\" As MovieMaker puts it, \"The movie was nothing less than a national cultural phenomenon.\" Abroad, as well: in Britain, where it opened a week after its U.S. release, not only was the film a big hit, but in book form its screenplay became the most successful in UK publishing history, a top-ten bestseller.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 92% based on 110 reviews, with an average rating of 9.20/10. The website's critical consensus reads, \"One of the most influential films of the 1990s, Pulp Fiction is a delirious post-modern mix of neo-noir thrills, pitch-black humor, and pop-culture touchstones.\" On Metacritic, the film has a weighted average score of 94 out of 100, based on 24 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.\r\nThe response of major American film reviewers was widely favorable. Roger Ebert called it \"a comedy about blood, guts, violence, strange sex, drugs, fixed fights, dead body disposal, leather freaks and a wristwatch that makes a dark journey down through the generations... The screenplay by Tarantino and Roger Avary so well-written in a scruffy, fanzine way that you want to rub noses in it – the noses of those zombie writers who take 'screenwriting' classes that teach them the formulas for 'hit films'\". Richard Corliss of TIME wrote, \"It towers over the year's other movies as majestically and menacingly as a gang lord at a preschool. It dares Hollywood films to be this smart about going this far. If good directors accept Tarantino's implicit challenge, the movie theater could again be a great place to live in.\" In Newsweek, David Ansen wrote, \"The miracle of Quentin Tarantino's Pulp Fiction is how, being composed of secondhand, debased parts, it succeeds in gleaming like something new.\" \"You get intoxicated by it,\" wrote Entertainment Weekly's Owen Gleiberman, \"high on the rediscovery of how pleasurable a movie can be. I'm not sure I've ever encountered a filmmaker who combined discipline and control with sheer wild-ass joy the way that Tarantino does.\" \"There's a special kick that comes from watching something this thrillingly alive\", wrote Peter Travers of Rolling Stone. \"Pulp Fiction is indisputably great.\"\r\nThe Los Angeles Times was one of the few major news outlets to publish a negative review on the film's opening weekend. Kenneth Turan wrote, \"The writer-director appears to be straining for his effects. Some sequences, especially one involving bondage harnesses and homosexual rape, have the uncomfortable feeling of creative desperation, of someone who's afraid of losing his reputation scrambling for any way to offend sensibilities.\" Some who reviewed it in the following weeks took more exception to the predominant critical reaction than to Pulp Fiction itself. While not panning the film, Stanley Kauffmann of The New Republic felt that \"the way that has been so widely ravened up and drooled over verges on the disgusting. Pulp Fiction nourishes, abets, cultural slumming.\" Responding to comparisons between Tarantino's film and the work of French New Wave director Jean-Luc Godard, especially his first, most famous feature, Jonathan Rosenbaum of the Chicago Reader wrote, \"The fact that Pulp Fiction is garnering more extravagant raves than Breathless ever did tells you plenty about which kind of cultural references are regarded as more fruitful – namely, the ones we already have and don't wish to expand.\" Observing in the National Review that \"o film arrives with more advance hype\", John Simon was unswayed: \"titillation cures neither hollowness nor shallowness\".\r\nDebate about the film spread beyond the review pages, with its violence often being the theme. In The Washington Post, Donna Britt described how she was happy not to see Pulp Fiction on a recent weekend and thus avoid \"discussing the rousing scene in which a gunshot sprays somebody's brains around a car interior\". Some commentators took exception to the film's frequent use of the word \"nigger\" (mentioned 18 times). In the Chicago Tribune, Todd Boyd argued that the word's recurrence \"has the ability to signify the ultimate level of hipness for white males who have historically used their perception of black masculinity as the embodiment of cool\". In Britain, James Wood, writing in The Guardian, set the tone for much subsequent criticism: \"Tarantino represents the final triumph of postmodernism, which is to empty the artwork of all content, thus avoiding its capacity to do anything except helplessly represent our agonies ... Only in this age could a writer as talented as Tarantino produce artworks so vacuous, so entirely stripped of any politics, metaphysics, or moral interest.\"\r\nAwards season\r\nAround the turn of the year, Pulp Fiction was named Best Picture by the National Society of Film Critics, National Board of Review, Los Angeles Film Critics Association, Boston Society of Film Critics, Society of Texas Film Critics, Southeastern Film Critics Association, and Kansas City Film Critics Circle. Tarantino was named Best Director by all seven of those organizations as well as by the New York Film Critics Circle and Chicago Film Critics Association. The screenplay won several prizes, with various awarding bodies ascribing credit differently. At the 52nd Golden Globe Awards, Tarantino, named as sole recipient of the Best Screenplay honor, failed to mention Avary in his acceptance speech. In February 1995, the film received seven Oscar nominations – Best Picture, Director, Actor (Travolta), Supporting Actor (Jackson), Supporting Actress (Thurman), Original Screenplay, and Film Editing. Travolta, Jackson, and Thurman were each nominated as well for the 1st Screen Actors Guild Awards, presented on February 25, but none took home the honor. At the Academy Awards ceremony the following month, Tarantino and Avary were announced as joint winners of the Academy Award for Best Original Screenplay. The furor around the film was still going strong: much of the March issue of Artforum was devoted to its critical dissection. Pulp Fiction garnered four honors at the Independent Spirit Awards, held at the end of the month – Best Feature, Best Director, Male Lead (Jackson), and Best Screenplay (Tarantino). At the British Academy Film Awards (BAFTA), Tarantino and Avary shared the BAFTA Award for Best Original Screenplay, and Jackson won for Best Supporting Actor. The film was nominated for the Grand Prix of the Belgian Film Critics Association.\r\nThe February 2020 issue of New York Magazine lists Pulp Fiction alongside Citizen Kane, Sunset Boulevard, Dr. Strangelove, Butch Cassidy and the Sundance Kid, The Conversation, Nashville, Taxi Driver, The Elephant Man, In the Bedroom, There Will Be Blood, and Roma as \"The Best Movies That Lost Best Picture at the Oscars\".\r\nInfluence and legacy\r\nPulp Fiction quickly came to be regarded as one of the most significant films of its era. In 1995, in a special edition of Siskel & Ebert devoted to Tarantino, Gene Siskel argued that the work posed a major challenge to the \"ossification of American movies with their brutal formulas\". In Siskel's view,\r\nthe violent intensity of Pulp Fiction calls to mind other violent watershed films that were considered classics in their time and still are. Hitchcock's Psycho, Arthur Penn's Bonnie and Clyde, and Stanley Kubrick's A Clockwork Orange. Each film shook up a tired, bloated movie industry and used a world of lively lowlifes to reflect how dull other movies had become. And that, I predict, will be the ultimate honor for Pulp Fiction. Like all great films, it criticizes other movies.\r\nKen Dancyger writes that its \"imitative and innovative style\" – like that of its predecessor, Reservoir Dogs – represents\r\na new phenomenon, the movie whose style is created from the context of movie life rather than real life. The consequence is twofold – the presumption of deep knowledge on the part of the audience of those forms such as the gangster films or Westerns, horror films or adventure films. And that the parody or alteration of that film creates a new form, a different experience for the audience.\r\nIn a widely covered speech on May 31, 1995, Republican presidential candidate Bob Dole attacked the American entertainment industry for peddling \"nightmares of depravity\". Pulp Fiction was soon associated with his charges concerning gratuitous violence. Dole had not mentioned the film; he cited two less-celebrated movies based on Tarantino screenplays, Natural Born Killers and True Romance. In September 1996, Dole did accuse Pulp Fiction – which he had not seen – of promoting \"the romance of heroin\".\r\nPaula Rabinowitz expresses the general film industry opinion that Pulp Fiction \"simultaneously resurrected John Travolta and film noir\". In Peter Biskind's description, it created a \"guys-with-guns frenzy\". The film has also been labeled as a black comedy and a \"neo-noir\". Critic Geoffrey O'Brien, however, argued against the classification of Pulp Fiction into the neo-noir genre: \"The old-time noir passions, the brooding melancholy and operatic death scenes, would be altogether out of place in the crisp and brightly lit wonderland that Tarantino conjures up. neither neo-noir nor a parody of noir.\" Similarly, Nicholas Christopher calls it \"more gangland camp than neo-noir\", and Foster Hirsch suggests that its \"trippy fantasy landscape\" characterizes it more definitively than any genre label. Regardless, the stylistic influence of Pulp Fiction soon became apparent. Less than a year after the picture's release, British critic Jon Ronson attended the National Film School's end-of-semester screenings and assessed the impact: \"Out of the five student movies I watched, four incorporated violent shoot-outs over a soundtrack of iconoclastic 70s pop hits, two climaxed with all the main characters shooting each other at once, and one had two hitmen discussing the idiosyncrasies of The Brady Bunch before offing their victim. Not since Citizen Kane has one man appeared from relative obscurity to redefine the art of moviemaking.\" Among the first Hollywood films cited as its imitators were Destiny Turns on the Radio (1995), in which Tarantino acted, Things to Do in Denver When You're Dead (1995), and 2 Days in the Valley (1996). It \"triggered a myriad of clones\", writes Fiona Villella. Internationally, according to David Desser, it \"not only influenced a British brand of noir, but extended the noir vision virtually around the world\". Pulp Fiction's effect on film form was still reverberating in 2007, when David Denby of The New Yorker credited it with initiating the ongoing cycle of disordered cinematic narratives.\r\nIts impact on Hollywood was deeper still. According to Variety, the trajectory of Pulp Fiction from Cannes launch to commercial smash \"forever altered the game\" of so-called independent cinema. It \"cemented Miramax's place as the reigning indie superpower\", writes Biskind. \"Pulp became the Star Wars of independents, exploding expectations for what an indie film could do at the box office.\" The film's large financial return on its small budget\r\ntransform the industry's attitude toward the lowly indies ... spawning a flock of me-too classics divisions ...mart studio executives suddenly woke up to the fact that grosses and market share, which got all the press, were not the same as profits ... Once the studios realized that they could exploit the economies of (small) scale, they more or less gave up buying or remaking the films themselves, and either bought the distributors, as Disney had Miramax, or started their own ... copy Miramax's marketing and distribution strategies.\r\nIn 2001, Variety, noting the increasing number of actors switching back and forth between expensive studio films and low-budget independent or indie-style projects, suggested that the \"watershed moment for movie stars\" came with the decision by Willis – one of Hollywood's highest-paid performers – to appear in Pulp Fiction.\r\nAnd its impact was even broader than that. It has been described as a \"major cultural event\", an \"international phenomenon\" that influenced television, music, literature, and advertising. Not long after its release, it was identified as a significant focus of attention within the growing community of Internet users. Adding Pulp Fiction to his roster of The Great Movies in 2001, Roger Ebert called it \"the most influential film of the decade\". Four years later, Time's Corliss wrote much the same: \"(unquestionably) the most influential American movie of the 90s\".\r\nSeveral scenes and images from the film achieved iconic status; in 2008, Entertainment Weekly declared, \"You'd be hard-pressed, by now, to name a moment from Quentin Tarantino's film that isn't iconic.\" Jules and Vincent's \"Royale with Cheese\" dialogue became famous. It was referenced more than a decade and a half later in the Travolta vehicle From Paris with Love. The adrenalin shot to Mia Wallace's heart is on Premiere's list of \"100 Greatest Movie Moments\". The scene of Travolta and Thurman's characters dancing has been frequently homaged, most unambiguously in the 2005 film Be Cool, starring the same two actors. The image of Travolta and Jackson's characters standing side by side in suit and tie, pointing their guns, has also become widely familiar. In 2007, BBC News reported that \"London transport workers have painted over an iconic mural by 'guerrilla artist' Banksy ... The image depicted a scene from Quentin Tarantino's Pulp Fiction, with Samuel L. Jackson and John Travolta clutching bananas instead of guns.\" Certain lines were adopted popularly as catchphrases, in particular Marsellus's threat, \"I'm 'a get medieval on your ass.\" Jules's \"Ezekiel\" recitation was voted the fourth greatest movie speech of all time in a 2004 poll. One of the more notable homages to Jules \"Biblical\" quote was one Jackson himself played a part in, near the end of 2014's Captain America: The Winter Soldier, Jackson's character Col. Nick Fury, presumed dead, visits his own gravestone, on which, below Fury's name is inscribed \"The path of the righteous man ...\" Ezekiel 25:17. In 2019, it was reported that Dominic Cummings, special political adviser to British Prime Minister Boris Johnson, quoted Jules by telling Conservative MPs to \"be cool like Fonzies\" as political pressure built to request an extension to the date of the UK's withdrawal from the European Union.\r\nPulp Fiction now appears in several critical assessments of all-time great films. In 2008, Entertainment Weekly named it the best film of the past quarter-century. That same year, the American Film Institute's \"Ten Top Ten\" poll ranked it number 7 all-time in the gangster film genre. In 2007, it was voted 94th overall on the AFI's 100 Years ... 100 Movies list. In 2005, it was named one of \"Time's All-Time 100 Movies\". As of September 2018, it is number 54 on Metacritic's list of all-time highest scores. The film ranks very highly in popular surveys. A 2008 Empire poll combining the opinions of readers, movie industry professionals, and critics named Pulp Fiction the ninth-best film of all time. In a 2006 readers' poll by the British magazine Total Film, it ranked as the number three film in history. It was voted as the fourth-greatest film of all time in a nationwide poll for Britain's Channel 4 in 2001.\r\nCritical analysis\r\nTarantino has stated that he originally planned \"to do a Black Mask movie\", referring to the magazine largely responsible for popularizing hardboiled detective fiction. \"t kind of went somewhere else\". Geoffrey O'Brien sees the result as connected \"rather powerfully to a parallel pulp tradition: the tales of terror and the uncanny practiced by such writers as Cornell Woolrich Fredric Brown ... Both dealt heavily in the realm of improbable coincidences and cruel cosmic jokes, a realm that Pulp Fiction makes its own.\" In particular, O'Brien finds a strong affinity between the intricate plot mechanics and twists of Brown's novels and the recursive, interweaving structure of Pulp Fiction. Philip French describes the film's narrative as a \"circular movement or Möbius strip of a kind Resnais and Robbe-Grillet would admire\". James Mottram regards crime novelist Elmore Leonard, whose influence Tarantino has acknowledged, as the film's primary literary antecedent. He suggests that Leonard's \"rich dialogue\" is reflected in Tarantino's \"popular-culture-strewn jive\"; he also points to the acute, extremely dark sense of humor Leonard applies to the realm of violence as a source of inspiration.\r\nFilm scholar/historian Robert Kolker sees the \"flourishes, the apparent witty banality of the dialogue, the goofy fracturing of temporality a patina over a pastiche. The pastiche ... is essentially of two films that Tarantino can't seem to get out of his mind: Mean Streets] and The Killing.\" He contrasts Pulp Fiction with postmodern Hollywood predecessors Hudson Hawk (1991; starring Willis) and Last Action Hero (1993; starring Arnold Schwarzenegger) that \"took the joke too far ... simply mocked or suggested that they were smarter than the audience\" and flopped. Todd McCarthy writes that the film's \"striking widescreen compositions often contain objects in extreme close-up as well as vivid contrasts, sometimes bringing to mind the visual strategies of Sergio Leone\", an acknowledged hero of Tarantino's. To Martin Rubin, the \"expansive, brightly colored widescreen visuals\" evoke comedy directors such as Frank Tashlin and Blake Edwards.\r\nThe movie's host of pop culture allusions, ranging from the famous image of Marilyn Monroe's skirt flying up over a subway grating to Jules addressing a soon-to-be victim as \"Flock of Seagulls\" because of his haircut, have led many critics to discuss it within the framework of postmodernism. Describing the film in 2005 as Tarantino's \"postmodern masterpiece ... to date\", David Walker writes that it \"is marked by its playful reverence for the 1950s ... and its constantly teasing and often deferential references to other films\". He characterizes its convoluted narrative technique as \"postmodern tricksiness\". Calling the film a \"terminally hip postmodern collage\", Foster Hirsch finds Pulp Fiction far from a masterpiece: \"authoritative, influential, and meaningless\". Set \"in a world that could exist only in the movies\", it is \"a succulent guilty pleasure, beautifully made junk food for cinéastes\". O'Brien, dismissing attempts to associate the movie with film noir, argues that \"Pulp Fiction is more a guided tour of an infernal theme park decorated with cultural detritus, Buddy Holly and Mamie Van Doren, fragments of blaxploitation and Roger Corman and Shogun Assassin, music out of a twenty-four-hour oldies station for which all the decades since the fifties exist simultaneously.\" Catherine Constable takes the moment in which a needle filled with adrenalin is plunged into the comatose Mia's heart as exemplary. She proposes that it \"can be seen as effecting her resurrection from the dead, simultaneously recalling and undermining the Gothic convention of the vampire's stake. On this model, the referencing of previous aesthetic forms and styles moves beyond ... empty pastiche, sustaining an 'inventive and affirmative' mode of postmodernism.\"\r\nMark T. Conard asks, \"hat is the film about?\" and answers, \"American nihilism.\" Hirsch suggests, \"If the film is actually about anything other than its own cleverness, it seems dedicated to the dubious thesis that hit men are part of the human family.\" Richard Alleva argues that \"Pulp Fiction has about as much to do with actual criminality or violence as Cyrano de Bergerac with the realities of seventeenth-century France or The Prisoner of Zenda with Balkan politics.\" He reads the movie as a form of romance whose allure is centered in the characters' nonnaturalistic discourse, \"wise-guy literate, media-smart, obscenely epigrammatic\". In Alan Stone's view, the \"absurd dialogue\", like that between Vincent and Jules in the scene where the former accidentally kills Marvin, \"unexpectedly transforms the meaning of the violence cliché ... Pulp Fiction unmasks the macho myth by making it laughable and deheroicizes the power trip glorified by standard Hollywood violence.\" Stone reads the film as \"politically correct. There is no nudity and no violence directed against women ... celebrates interracial friendship and cultural diversity; there are strong women and strong black men, and the director swims against the current of class stereotype.\"\r\nWhere Stone sees a celebration, Kolker finds a vacuum: \"The postmodern insouciance, violence, homophobia, and racism of Pulp Fiction were perfectly acceptable because the film didn't pretend seriousness and therefore didn't mock it.\" Calling it the \"acme of postmodern nineties filmmaking\", he explains, \"the postmodern is about surfaces; it is flattened spatiality in which event and character are in a steady state of reminding us that they are pop-cultural figures.\" According to Kolker:\r\nThat's why Pulp Fiction was so popular. Not because all audiences got all or any of its references to Scorsese and Kubrick, but because the narrative and spatial structure of the film never threatened to go beyond themselves into signification. The film's cycle of racist and homophobic jokes might threaten to break out into a quite nasty view of the world, but this nastiness keeps being laughed off – by the mock intensity of the action, the prowling, confronting, perverse, confined, and airless nastiness of the world Tarantino creates.\r\nHenry A. Giroux argues that Tarantino \"empties violence of any critical social consequences, offering viewers only the immediacy of shock, humor, and irony-without-insight as elements of mediation. None of these elements gets beyond the seduction of voyeuristic gazing ...he facile consumption of shocking images and hallucinatory delight.\"\r\nRegarding the violence and nihilism in the film, Pamela Demory has suggested that Pulp Fiction should be seen in light of the short stories of Flannery O'Connor, which likewise feature \"religious elements, banality, and violence with grotesque humor.\" Discussing \"the connection between violence and redemption,\" Demory concludes that while O'Connor's purpose is to convince readers \"of the powerful force of evil in the world and of our need for grace,\" Tarantino \"seeks to demonstrate that in spite of everything we have seen in the film – all the violence, degradation, death, crime, amoral behavior – grace is still possible; there might still be a God who doesn't judge us on merits.\"\r\nHomage as essence\r\nCinema\r\nPulp Fiction is full of homages to other movies. \"Tarantino's characters\", writes Gary Groth, \"inhabit a world where the entire landscape is composed of Hollywood product. Tarantino is a cinematic kleptomaniac – he literally can't help himself.\" Two scenes in particular have prompted discussion of the film's highly intertextual style. Many have assumed that the dance sequence at Jack Rabbit Slim's was intended as a reference to Travolta's star-making performance as Tony Manero in the epochal Saturday Night Fever (1977); Tarantino, however, credits a scene in the Jean-Luc Godard film Bande à part (1964) with the inspiration. According to the filmmaker;\r\nEverybody thinks that I wrote this scene just to have John Travolta dancing. But the scene existed before John Travolta was cast. But once he was cast, it was like, \"Great. We get to see John dance. All the better.\"... My favorite musical sequences have always been in Godard, because they just come out of nowhere. It's so infectious, so friendly. And the fact that it's not a musical, but he's stopping the movie to have a musical sequence, makes it all the more sweet.\r\nJerome Charyn argues that, beyond \"all the better\", Travolta's presence is essential to the power of the scene, and of the film:\r\nTravolta's entire career becomes \"backstory\", the myth of a movie star who has fallen out of favor, but still resides in our memory as the king of disco. We keep waiting for him to shed his paunch, put on a white polyester suit, and enter the 2001 Odyssey club in Bay Ridge, Brooklyn, where he will dance for us and never, never stop. Daniel Day-Lewis couldn't have woken such a powerful longing in us. He isn't part of America's own mad cosmology ... Tony Manero an angel sitting on Vince's shoulder ... actual dance may be closer to the choreography of Anna Karina's shuffle with her two bumbling gangster boyfriends in Bande à part, but even that reference is lost to us, and we're with Tony again ...\r\nEstella Tincknell notes that while the \"diner setting seems to be a simulacrum of a 'fifties' restaurant ... the twist contest is a musical sequence which evokes 'the sixties,' while Travolta's dance performance inevitably references 'the seventies' and his appearance in Saturday Night Fever. ... The 'past' thus becomes a more general 'pastness' in which the stylistic signifiers of various decades are loaded in to a single moment.\" She also argues that in this passage the film \"briefly shifts from its habitually ironic discourse to one that references the conventions of the classic film musical and in doing so makes it possible for the film to inhabit an affective space that goes beyond stylistic allusion.\"\r\nThe pivotal moment in which Marsellus crosses the street in front of Butch's car and notices him evokes the scene in which Marion Crane's boss sees her under similar circumstances in Psycho (1960). Marsellus and Butch are soon held captive by Maynard and Zed, \"two sadistic honkies straight out of Deliverance\" (1972), directed by John Boorman. Zed shares a name with Sean Connery's character in Boorman's follow-up, the science-fiction film Zardoz (1974). When Butch decides to rescue Marsellus, in Glyn White's words, \"he finds a trove of items with film-hero resonances\". Critics have identified these weapons with a range of possible allusions:\r\nHammer – The Toolbox Murders (1978)\r\nBaseball bat – Walking Tall (1973); The Untouchables (1987)\r\nChainsaw – The Texas Chain Saw Massacre (1974); Evil Dead II (1987)\r\nKatana (samurai sword) – many, including Seven Samurai (1954); The Yakuza (1975); Shogun Assassin (1980)\r\nAt the conclusion of the scene, a portentous line of Marsellus's echoes one from the crime drama Charley Varrick (1973), directed by another of Tarantino's heroes, Don Siegel; the name of the character who speaks it there is Maynard.\r\nDavid Bell argues that far from going against the \"current of class stereotype\", this scene, like Deliverance, \"mobilize a certain construction of poor white country folk – and particularly their sexualization ... 'rustic sexual expression often takes the form of homosexual rape' in American movies.\" Stephen Paul Miller believes the Pulp Fiction scene goes down much easier than the one it echoes: \"The buggery perpetrated is not at all as shocking as it was in Deliverance ... The nineties film reduces seventies competition, horror, and taboo into an entertainingly subtle adrenaline play – a fiction, a pulp fiction.\" Giroux reads the rape scene homage similarly: \"in the end Tarantino's use of parody is about repetition, transgression, and softening the face of violence by reducing it to the property of film history.\" In Groth's view, the crucial difference is that \"in Deliverance the rape created the film's central moral dilemma whereas in Pulp Fiction it was merely 'the single weirdest day of life.'\" (\"American Me did it too,\" Tarantino observed. \"There's like three butt-fucking scenes in American Me. That's definitely the one to beat in that particular category!\")\r\nNeil Fulwood focuses on Butch's weapon selection, writing, \"Here, Tarantino's love of movies is at its most open and nonjudgemental, tipping a nod to the noble and the notorious, as well as sending up his own reputation as an enfant terrible of movie violence. Moreover, the scene makes a sly comment about the readiness of cinema to seize upon whatever is to hand for its moments of mayhem and murder.\" White asserts that \"the katana he finally, and significantly, selects identifies him with ... honourable heroes.\" Conard argues that the first three items symbolize a nihilism that Butch is rejecting. The traditional Japanese sword, in contrasts, represents a culture with a well-defined moral code and thus connects Butch with a more meaningful approach to life.\r\nThe biker film Nam's Angels is also shown with Fabienne characterizing it as \"A motorcycle movie, I'm not sure the name.\"\r\nTelevision\r\nRobert Miklitsch argues that \"Tarantino's telephilia\" may be more central to the guiding sensibility of Pulp Fiction than the filmmaker's love for rock 'n' roll and even cinema:\r\nTalking about his generation, one that came of age in the '70s, Tarantino has commented that the \"number one thing we all shared wasn't music, that was a Sixties thing. Our culture was television.\" A random list of the TV programs referenced in Pulp Fiction confirms his observation: Speed Racer, Clutch Cargo, The Brady Bunch, The Partridge Family, The Avengers, The Three Stooges, The Flintstones, I Spy, Green Acres, Kung Fu, Happy Days, and last but not least, Mia's fictional pilot, Fox Force Five.\r\n\"The above list, with the possible exception of The Avengers,\" writes Miklitsch, \"suggests that Pulp Fiction has less of an elective affinity with the cinematic avant-gardism of Godard than with mainstream network programming.\" Jonathan Rosenbaum had brought TV into his analysis of the Tarantino/Godard comparison, acknowledging that the directors were similar in wanting to cram everything they like onscreen: \"But the differences between what Godard likes and what Tarantino likes and why are astronomical; it's like comparing a combined museum, library, film archive, record shop, and department store with a jukebox, a video-rental outlet, and an issue of TV Guide.\"\r\nSharon Willis focuses on the way a television show (Clutch Cargo) marks the beginning of, and plays on through, the scene between young Butch and his father's comrade-in-arms. The Vietnam War veteran is played by Christopher Walken, whose presence in the role evokes his performance as a traumatized G.I. in the Vietnam War movie The Deer Hunter (1978). Willis writes that \"when Captain Koons enters the living room, we see Walken in his function as an image retrieved from a repertoire of 1970s television and movie versions of ruined masculinity in search of rehabilitation ...he gray light of the television presiding over the scene seems to inscribe the ghostly paternal gaze.\" Miklitsch asserts that, for some critics, the film is a \"prime example of the pernicious ooze-like influence of mass culture exemplified by their bête noire: TV.\" Kolker might not disagree, arguing that \"Pulp Fiction is a simulacrum of our daily exposure to television; its homophobes, thugs and perverts, sentimental boxers and pimp promoters move through a series of long-take tableaux: we watch, laugh, and remain with nothing to comprehend.\"\r\nNotable motifs\r\nThe mysterious 666 briefcase\r\nThe combination of the mysterious suitcase lock is 666, the \"Number of the Beast\". Tarantino has said there is no explanation for its contents – it is simply a MacGuffin, a pure plot device. Originally, the case was to contain diamonds, but this was seen as too mundane. For filming purposes, it contained a hidden orange light bulb that produced an otherworldly glow when the case was opened. In a 2007 video interview with fellow director and friend Robert Rodriguez, Tarantino purportedly \"reveals\" the secret contents of the briefcase, but the film cuts out and skips the scene in the style employed in Tarantino and Rodriguez's Grindhouse (2007), with an intertitle that reads \"Missing Reel\". The interview resumes with Rodriguez discussing how radically the \"knowledge\" of the briefcase's contents alters one's understanding of the movie.\r\nDespite Tarantino's statements, many solutions to what one scholar calls this \"unexplained postmodern puzzle\" have been proposed. A strong similarity has often been observed with Robert Aldrich's 1955 film noir Kiss Me Deadly. That movie, features a glowing briefcase housing an atomic explosive. In their review of Alex Cox's 1984 film Repo Man in The Daily Telegraph, Nick Cowen and Hari Patience suggest that Pulp Fiction may also owe \"a debt of inspiration\" to the glowing car trunk in that film. In scholar Paul Gormley's view, this connection with Kiss Me Deadly, and a similar one with Raiders of the Lost Ark (1981), makes it possible to read the eerie glow as symbolic of violence itself. The idea that the briefcase contains Marsellus's soul gained popular currency in the mid-1990s. Analyzing the notion, Roger Ebert dismissed it as \"nothing more than a widely distributed urban legend given false credibility by the mystique of the Net\".\r\nJules' Bible passage\r\nJules ritually recites what he describes as a biblical passage, Ezekiel 25:17, before he executes someone. The passage is heard three times – in the introductory sequence in which Jules and Vincent reclaim Marsellus's briefcase from the doomed Brett; that same recitation a second time, at the beginning of \"The Bonnie Situation\", which overlaps the end of the earlier sequence; and in the epilogue at the diner. The first version of the passage is as follows:\r\nThe path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men. Blessed is he who in the name of charity and goodwill shepherds the weak through the valley of darkness, for he is truly his brother's keeper and the finder of lost children. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy My brothers. And you will know My name is the Lord when I lay My vengeance upon thee.\r\nThe second version, from the diner scene, is identical except for the final line: \"And you will know I am the Lord when I lay my vengeance upon you.\"\r\nWhile the final two sentences of Jules's speech are similar to the actual cited passage, the first two are fabricated from various biblical phrases. The text of Ezekiel 25 preceding verse 17 indicates that God's wrath is retribution for the hostility of the Philistines. In the King James Version from which Jules's speech is adapted, Ezekiel 25:17 reads in its entirety:\r\nAnd I will execute great vengeance upon them with furious rebukes; and they shall know that I am the LORD, when I shall lay My vengeance upon them.\r\nTarantino's primary inspiration for the speech was the work of Japanese martial arts star Sonny Chiba. Its text and its identification as Ezekiel 25:17 derive from an almost identical creed that appears at the beginning of the Chiba movie Karate Kiba (The Bodyguard; 1976), where it is both shown as a scrolling text and read by an offscreen narrator.\r\nThe version seen at the beginning of The Bodyguard (1976) is as follows:\r\nThe path of the righteous man and defender is beset on all sides by the inequity of the selfish and the tyranny of evil men. Blessed is he, who in the name of charity and good will, shepherds the weak through the valley of darkness, for he is truly his brother's keeper, and the father of lost children. And I will execute great vengeance upon them with furious anger, who poison and destroy my brothers; and they shall know that I am Chiba the Bodyguard when I shall lay my vengeance upon them!\r\nIn the 1980s television series Kage no Gundan (Shadow Warriors), Chiba's character would lecture the villain-of-the-week about how the world must be rid of evil before killing him. A killer delivers a similar biblical rant in Modesty Blaise, the hardback but pulp-style novel Vincent is shown with in two scenes.\r\nTwo critics who have analyzed the role of the speech find different ties between Jules's transformation and the issue of postmodernity. Gormley argues that unlike the film's other major characters – Marsellus aside – Jules is:\r\nlinked to a \"thing\" beyond postmodern simulation ...his is perhaps most marked when he moves on from being a simulation of a Baptist preacher, spouting Ezekiel because it was \"just a cool thing to say ...\" In his conversion, Jules is shown to be cognizant of a place beyond this simulation, which, in this case, the film constructs as God.\r\nAdele Reinhartz writes that the \"depth of Jules's transformation\" is indicated by the difference in his two deliveries of the passage: \"In the first, he is a majestic and awe-inspiring figure, proclaiming the prophecy with fury and self-righteousness ... In the second ... he appears to be a different sort of man altogether ...n true postmodern fashion, reflects on the meaning of his speech and provides several different ways that it might pertain to his current situation.\" Similar to Gormley, Conard argues that as Jules reflects on the passage, it dawns on him \"that it refers to an objective framework of value and meaning that is absent from his life\"; to Conard, this contrasts with the film's prevalent representation of a nihilistic culture. Rosenbaum finds much less in Jules's revelation: \"he spiritual awakening at the end of Pulp Fiction, which Jackson performs beautifully, is a piece of jive avowedly inspired by kung-fu movies. It may make you feel good, but it certainly doesn't leave you any wiser.\"\r\nThe bathroom\r\nMuch of Pulp Fiction's action revolves around characters who are either in the bathroom or need to use the toilet. To a lesser extent, Tarantino's other films also feature this narrative element. At Jack Rabbit Slim's, Mia goes to \"powder her nose\" – literally; she snorts coke in the restroom, surrounded by a bevy of women vainly primping. Butch and Fabienne play an extended scene in their motel bathroom, he in the shower, she brushing her teeth; the next morning, but just a few seconds later in screen time, she is again brushing her teeth. As Jules and Vincent confront Brett and two of his pals, a fourth man is hiding in the bathroom – his actions will lead to Jules' transformative \"moment of clarity\". After Marvin's absurd death, Vincent and Jules wash up in Jimmie's bathroom, where they get into a contretemps over a bloody hand towel. When the diner hold-up turns into a standoff, \"Honey Bunny\" whines, \"I gotta go pee!\"\r\nAs described by Peter and Will Brooker, \"In three significant moments Vincent retires to the bathroom returns to an utterly changed world where death is threatened.\" The threat increases in magnitude as the narrative progresses chronologically, and is realized in the third instance:\r\nIn the Brookers' analysis, \"Through Vince ... we see the contemporary world as utterly contingent, transformed, disastrously, in the instant you are not looking.\" Fraiman finds it particularly significant that Vincent is reading Modesty Blaise in two of these instances. She links this fact with the traditional derisive view of women as \"the archetypal consumers of pulp\":\r\nLocating popular fiction in the bathroom, Tarantino reinforces its association with shit, already suggested by the dictionary meanings of \"pulp\" that preface the movie: moist, shapeless matter; also, lurid stories on cheap paper. What we have then is a series of damaging associations – pulp, women, shit – that taint not only male producers of mass-market fiction but also male consumers. Perched on the toilet with his book, Vincent is feminized by sitting instead of standing as well as by his trashy tastes; preoccupied by the anal, he is implicitly infantilized and homosexualized; and the seemingly inevitable result is being pulverized by Butch with a Czech M61 submachine gun. That this fate has to do with Vincent's reading habits is strongly suggested by a slow tilt from the book on the floor directly up to the corpse spilled into the tub.\r\nWillis reads Pulp Fiction in almost precisely the opposite direction, finding \"its overarching project as a drive to turn shit into gold. This is one way of describing the project of redeeming and recycling popular culture, especially the popular culture of one's childhood, as is Tarantino's wont as well as his stated aim.\" Despite that, argues Fraiman, \"Pulp Fiction demonstrates ... that even an open pulpophile like Tarantino may continue to feel anxious and emasculated by his preferences.\"\r\nAccolades\r\nPulp Fiction won eight major awards from a total of twenty-six nominations, including a Best Original Screenplay win at the 67th Academy Awards. Also, in the balloting by the National Society of Film Critics, Samuel L. Jackson was the runner-up in both the Best Actor and the Best Supporting Actor categories.\r\nAmerican Film Institute Lists\r\nAFI's 100 Years ... 100 Movies – No. 95\r\nAFI's 100 Years ... 100 Heroes & Villains:Vincent Vega and Jules Winnfield – Nominated Villains\r\nVincent Vega and Jules Winnfield – Nominated Villains\r\nAFI's 100 Years ... 100 Movie Quotes:\"Bring out the Gimp\" – Nominated Quote \"They call it a Royale with Cheese\" – Nominated Quote\r\n\"Bring out the Gimp\" – Nominated Quote\r\n\"They call it a Royale with Cheese\" – Nominated Quote\r\nAFI's 100 Years ... 100 Laughs – Nominated\r\nAFI's 100 Years ... 100 Movies (10th Anniversary Edition) – No. 94\r\nAFI's 100 Years ... 100 Thrills – No. 53\r\nNFT dispute\r\nIn November 2021, Miramax filed a lawsuit against Tarantino who released seven NFTs based on uncut and unseen scenes of Pulp Fiction and including the original handwritten script \"revealing secrets about the film and its creator.\" Miramax claimed they own the film rights. However, Tarantino disputed the lawsuit and claimed he had rights to the film script in written form. The matter was later settled with Miramax's lawyers filing a brief statement in court: \"The parties have agreed to put this matter behind them and look forward to collaborating with each other on future projects, including possible NFTs.\"",
    "html": "<p>Pulp Fiction is a 1994 American crime film written and directed by Quentin Tarantino from a story he conceived with Roger Avary. It tells four intertwining tales of crime and violence in Los Angeles, California. The film stars John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.</p><p>Tarantino wrote Pulp Fiction in 1992 and 1993, incorporating scenes that Avary originally wrote for True Romance (1993). Its plot occurs out of chronological order. The film is also self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of \"pulp.\" Considerable screen time is devoted to monologues and casual conversations with eclectic dialogue revealing each character's perspectives on several subjects, and the film features an ironic combination of humor and strong violence. TriStar Pictures reportedly turned down the script as \"too demented.\" Miramax co-chairman Harvey Weinstein was enthralled, however, and the film became the first that Miramax fully financed.</p><p>Pulp Fiction won the Palme d'Or at the 1994 Cannes Film Festival and was a major critical and commercial success. It was nominated for seven awards at the 67th Academy Awards, including Best Picture, and won Best Original Screenplay; it earned Travolta, Jackson, and Thurman Academy Award nominations and boosted their careers. Its development, marketing, distribution, and profitability had a sweeping effect on independent cinema.</p><p>Pulp Fiction is widely regarded as Tarantino's magnum opus, with particular praise for its screenwriting. The self-reflexivity, unconventional structure, and extensive homage and pastiche have led critics to describe it as a touchstone of postmodern film. It is often considered a cultural watershed, influencing films and other media that adopted elements of its style. The cast was also widely praised, with Travolta, Thurman, and Jackson earning particular acclaim. In 2008, Entertainment Weekly named it the best film since 1983 and it has appeared on many critics' lists of the greatest films ever made. In 2013, Pulp Fiction was selected for preservation in the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant.\"</p><br/><h3>Plot</h3><h4>Narrative structure</h4><p>Pulp Fiction's narrative is told out of chronological order and follows three main interrelated stories that each have a different protagonist: Vincent Vega, a hitman; Butch Coolidge, a prizefighter; and Jules Winnfield, Vincent's business partner.</p><p>The film begins with a diner hold-up staged by a couple, then begins to shift from one storyline to another before returning to the diner for the conclusion. There are seven narrative sequences; the three primary storylines are preceded by intertitles:</p><p>If the seven sequences were ordered chronologically, they would run: 4a, 2, 6, 1, 7, 3, 4b, 5. Sequences 1 and 7 partially overlap and are presented from different points of view, as do sequences 2 and 6. According to Philip Parker, the structural form is \"an episodic narrative with circular events adding a beginning and end and allowing references to elements of each separate episode to be made throughout the narrative\". Other analysts describe the structure as a \"circular narrative\".</p><h4>Summary</h4><p>Hitmen Jules Winnfield and Vincent Vega arrive at an apartment to retrieve a briefcase for their boss, gangster Marsellus Wallace, from a business partner, Brett. After Vincent checks the contents of the briefcase, Jules shoots one of Brett's associates. He declaims a passage from the Bible, and he and Vincent kill Brett for trying to double-cross Marsellus.</p><p>Another man bursts out of the bathroom and fires at them, but every shot misses; after briefly checking themselves for wounds, Jules and Vincent shoot him dead. While driving away with Brett's associate Marvin, Jules professes that their survival was a miracle, which Vincent disputes. Vincent accidentally shoots Marvin in the face, killing him, and covering Vincent, Jules, and the car interior in blood in broad daylight. They hide the car at the home of Jules's friend Jimmie, who demands they deal with the problem before his wife, Bonnie, comes home. Marsellus sends a cleaner, Winston Wolfe, who directs Jules and Vincent to clean the car, hide the body in the trunk, dispose of their bloody clothes, and take the car to a junkyard.</p><p>At a diner, Jules tells Vincent that he plans to retire from his life of crime, convinced that their \"miraculous\" survival at the apartment was a sign of divine intervention. While Vincent is in the bathroom, a couple, \"Pumpkin\" and \"Honey Bunny\", hold up the restaurant and demand Marsellus's briefcase. Jules distracts Pumpkin with its contents, and then overpowers him and holds him at gunpoint; Honey Bunny becomes hysterical and points her gun at Jules. Vincent returns with his gun aimed at her, but Jules defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Jules and Vincent leave the diner with the briefcase in hand. They take the briefcase to Marsellus and wait while he bribes boxer Butch Coolidge to take a dive in his upcoming match.</p><p>The next day, Vincent purchases heroin from his drug dealer, Lance. He shoots up and drives to meet Marsellus's trophy wife, Mia, having agreed to escort her while Marsellus is out of town. They eat at Jack Rabbit Slim's, a 1950s-themed restaurant, and participate in a twist contest, then return home. While Vincent is in the bathroom, Mia finds his heroin and snorts it, mistaking it for cocaine. She suffers an overdose; Vincent rushes her to Lance's house, where they revive her with an injection of adrenaline into her heart. Vincent drops Mia off at her home, and the two agree never to tell Marsellus about the incident.</p><p>Butch bets the bribe money on himself and double-crosses Marsellus, winning the bout but accidentally killing his opponent as well. Knowing that Marsellus will send hitmen after him, he prepares to flee with his girlfriend, Fabienne, but discovers she has forgotten to pack a gold watch passed down to him through his family. Returning to his apartment to retrieve it, he notices a gun on the kitchen counter and hears the toilet flush. When Vincent exits the bathroom, Butch shoots him dead and departs.</p><p>When Marsellus spots Butch stopped at a traffic light, Butch rams his car into him, then gets hit by an oncoming vehicle, leaving both of them injured and dazed. Once Marsellus regains consciousness, he shoots at Butch, chasing him into a pawnshop. Butch gains the upper hand and is about to shoot Marsellus, but the shop owner, Maynard, captures them at gunpoint and binds and gags them in the basement. Maynard and his accomplice Zed take Marsellus into another room and begin to rape him, leaving the \"gimp\" – a silent figure in a bondage suit – to watch over Butch. Butch breaks loose and knocks the gimp unconscious. Instead of fleeing, he decides to save Marsellus, and arms himself with a katana from the pawnshop. He kills Maynard and frees Marsellus, who shoots Zed in the crotch with Maynard's shotgun. Marsellus informs Butch that they are even, and to tell no one about the rape and to depart Los Angeles forever. Butch picks up Fabienne on Zed's motorcycle, and they ride away.</p><br/><h3>Cast</h3><ul><li>John Travolta as Vincent Vega:</li></ul><ul><li>Samuel L. Jackson as Jules Winnfield:</li></ul><ul><li>Uma Thurman as Mia Wallace:</li></ul><ul><li>Harvey Keitel as Winston Wolfe:</li></ul><ul><li>Tim Roth as Ringo/\"Pumpkin\":</li></ul><ul><li>Amanda Plummer as Yolanda/\"Honey Bunny\":</li></ul><ul><li>Maria de Medeiros as Fabienne:</li></ul><ul><li>Ving Rhames as Marsellus Wallace:</li></ul><ul><li>Eric Stoltz as Lance:</li></ul><ul><li>Rosanna Arquette as Jody:</li></ul><ul><li>Christopher Walken as Captain Koons:</li></ul><ul><li>Bruce Willis as Butch Coolidge:</li></ul><p>Bronagh Gallagher plays Jody's friend Trudi who does little but smoke a bong during the scene where Vincent revives Mia. According to author Jason Bailey, \"Quentin thought it would be funny to have this casual observer who just happened to be there. All of this was born out of the experience of, when you go to someone's house to buy drugs, there are always people who are just there\". Phil LaMarr portrays Marvin, an associate of Jules and Vincent. LaMarr auditioned for Tarantino after both had done a show for an improv group a few months prior. He read for the roles of Jules Winnfield and Brett before being cast as Marvin. Tarantino appears as Jules' friend Jimmie, in whose house they clean up a murder. Tarantino was unsure whether to play Jimmie or Lance, choosing Jimmie as he wanted to be behind the camera during Mia's overdose scene.</p><p>Frank Whaley portrays Brett, who has a briefcase requested by Marcellus. Whaley met Tarantino while he was filming Reservoir Dogs at a lab in Sundance Institute. He recalls, \"we ended up meeting and spending time together, and I liked him, so I was really happy when he asked me to be in this movie.\" Burr Steers appears as Roger, a friend of Brett's nicknamed \"Flock of Seagulls\" by Jules. The scene of the confrontation between Brett and Jules went through several takes due to Steers making mistakes. Steers recalled in an interview that he had found acting difficult due to the loudness of the gunshots.</p><p>Angela Jones portrays Esmeralda Villalobos, a cab driver who aids Butch's escape. Her casting and character were inspired by her performance in the 1991 short film Curdled, later remade as a 1996 feature film with finance from Tarantino and again starring Jones. Duane Whitaker, Peter Greene and Stephen Hibbert play Maynard, Zed and the gimp. According to The Daily Beast, these \"three psycho hillbillies\" that rape Marsellus in Maynard's shop's basement allude to the film Deliverance. Steve Buscemi makes a cameo appearance as a waiter at Jack Rabbit Slim's, dressed as Buddy Holly. Buscemi, who had appeared in Reservoir Dogs, was originally considered for the role of Jimmie but was unable to commit. Kathy Griffin appears as herself. Michael Gilden and Joseph Pilato also appear at Jack Rabbit Slim’s as waiter Phillip Morris Page and a Dean Martin impersonator, respectively. Emil Sitka made a cameo via posthumous archive footage, Karen Maruyama appears as “Gawker #1” after Butch’s car accident, and Julia Sweeney portrays Raquel, the daughter of the owner of the junkyard in which Marvin’s body is disposed of. Producer Lawrence Bender makes a cameo as a victim of the diner robbery, credited as “Long Hair Yuppie-Scum”. Jerome Patrick Hoban appears in the Jack Rabbit Slim's segment as an Ed Sullivan impersonator. Susan Griffiths appears alongside Hoban as a Marilyn Monroe impersonator.</p><br/><h3>Production</h3><h4>Writing</h4><p>Roger Avary wrote the first element of what would become the Pulp Fiction screenplay in the fall of 1990:</p><blockquote>Tarantino and Avary decided to write a short, on the theory that it would be easier to get made than a feature. But they quickly realized that nobody produces shorts, so the film became a trilogy, with one section by Tarantino, one by Avary, and one by a third director who never materialized. Each eventually expanded his section into a feature-length script.</blockquote><p>The initial inspiration was the three-part horror anthology film Black Sabbath (1963), by Italian filmmaker Mario Bava. The Tarantino–Avary project was provisionally titled \"Black Mask\", after the seminal hardboiled crime fiction magazine. Tarantino's script was produced as Reservoir Dogs, his directorial debut; Avary created the basis for the \"Gold Watch\" storyline of Pulp Fiction.</p><p>With work on Reservoir Dogs completed, Tarantino returned to the notion of a trilogy film: \"I got the idea of doing something that novelists get a chance to do but filmmakers don't: telling three separate stories, having characters float in and out with different weights depending on the story.\" Tarantino explains that the idea \"was basically to take like the oldest chestnuts that you've ever seen when it comes to crime stories – the oldest stories in the book ... You know, 'Vincent Vega and Marsellus Wallace's Wife' – the oldest story about ... the guy's gotta go out with the big man's wife and don't touch her. You know, you've seen the story a zillion times.\" \"I'm using old forms of storytelling and then purposely having them run awry\", he says. \"Part of the trick is to take these movie characters, these genre characters and these genre situations and actually apply them to some of real life's rules and see how they unravel.\" In at least one case, boxer Butch Coolidge, Tarantino had in mind a specific character from a classic Hollywood crime story: \"I wanted him to be basically like Ralph Meeker as Mike Hammer in Aldrich's Kiss Me Deadly. I wanted him to be a bully and a jerk\".</p><p>Tarantino went to work on the script for Pulp Fiction in Amsterdam in March 1992, possibly at the Winston Hotel in the Red Light District. He was joined there by Avary, who contributed \"Pandemonium Reigns\" to the project and participated in its rewriting as well as the development of the new storylines that would link up with it. Two scenes originally written by Avary for the True Romance screenplay, exclusively credited to Tarantino, were incorporated into the opening of \"The Bonnie Situation\": the \"miraculous\" missed shots by the hidden gunman and the rear seat automobile killing. The notion of the crimeworld \"cleaner\" that became the heart of the episode was inspired by a short, Curdled, that Tarantino saw at a film festival. He cast the lead actress, Angela Jones, in Pulp Fiction and later backed the filmmakers' production of a feature-length version of Curdled. The script included a couple of made-up commercial brands that often featured in later Tarantino films: Big Kahuna burgers (a Big Kahuna soda cup appears in Reservoir Dogs) and Red Apple cigarettes. As he worked on the script, Tarantino also accompanied Reservoir Dogs around the European film festivals. Released in the United States in October 1992, the picture was a critical and commercial success. In January 1993, the Pulp Fiction script was complete.</p><h4>Financing</h4><p>Tarantino and his producer, Lawrence Bender, brought the script to Jersey Films. Before even seeing Reservoir Dogs, Jersey had attempted to sign Tarantino for his next project. Ultimately a development deal worth around $1 million had been struck: The deal gave A Band Apart, Bender and Tarantino's newly formed production company, initial financing and office facilities; Jersey got a share of the project and the right to shop the script to a studio. Jersey had a distribution and \"first look\" deal with Columbia TriStar, which paid Tarantino for the right to consider exercising its option. In February, Pulp Fiction appeared on a Variety list of films in pre-production at TriStar. In June, however, the studio put the script into turnaround. According to a studio executive, TriStar chief Mike Medavoy found it \"too demented\". There were suggestions that TriStar was resistant to back a film featuring a heroin user; there were also indications that the studio simply saw the project as too low-budget for its desired star-driven image. Avary – who was about to start shooting his own directorial debut, Killing Zoe – has said that TriStar's objections were comprehensive, encompassing the script's fundamental structure. He characterizes the studio's position: \"'This is the worst thing ever written. It makes no sense. Someone's dead and then they're alive. It's too long, violent, and unfilmable.' ... So I thought, 'That's that!'\"</p><p>Bender brought the script to Miramax, the formerly independent studio that had recently been acquired by Disney. Harvey Weinstein – co-chairman of Miramax, along with his brother Bob – was instantly enthralled by the script and the company picked it up. Pulp Fiction, the first Miramax project to get a green light after the Disney acquisition, was budgeted at $8.5 million. It became the first movie that Miramax completely financed. Helping hold costs down was the plan Bender executed to pay all the main actors the same amount per week, regardless of their industry status. The New York Times reported, \"Most of the actors received relatively small salaries along with a percentage of the profits.\" The biggest star to sign on to the project was Bruce Willis. Though he had recently appeared in several big-budget flops, he was still a major overseas draw. On the strength of his name, Miramax garnered $11 million for the film's worldwide rights, virtually ensuring its profitability.</p><h4>Filming</h4><p>Principal photography commenced on September 20, 1993. The lead offscreen talent had all worked with Tarantino on Reservoir Dogs – cinematographer Andrzej Sekuła, film editor Sally Menke, production designer David Wasco, and costume designer Betsy Heimann. According to Tarantino, \"e had $8 million. I wanted it to look like a $20–25 million movie. I wanted it to look like an epic. It's an epic in everything – in invention, in ambition, in length, in scope, in everything except the price tag.\" The film, he says, was shot \"on 50 ASA film stock, which is the slowest stock they make. The reason we use it is that it creates an almost no-grain image, it's lustrous. It's the closest thing we have to 50s Technicolor.\" The largest chunk of the budget – $150,000 – went to creating the Jack Rabbit Slim's set. It was built in a Culver City warehouse, where it was joined by several other sets, as well as the film's production offices. The diner sequence was shot on location in Hawthorne at the Hawthorne Grill, known for its Googie architecture. For the costumes, Tarantino took his inspiration from French director Jean-Pierre Melville, who believed that the clothes his characters wore were their symbolic suits of armor. Tarantino cast himself in a modest-sized role as he had in Reservoir Dogs. One of his pop totems, Fruit Brute, a long-discontinued General Mills cereal, also returned from the earlier film. The shoot wrapped on November 30. Before Pulp Fiction's premiere, Tarantino convinced Avary to forfeit his agreed-on cowriting credit and accept a \"story by\" credit, so the line \"Written and directed by Quentin Tarantino\" could be used in advertising and onscreen.</p><br/><h3>Music</h3><p>No film score was composed for Pulp Fiction; Quentin Tarantino instead used an eclectic assortment of surf music, rock and roll, soul, and pop songs. Dick Dale's rendition of \"Misirlou\" plays during the opening credits. Tarantino chose surf music as the basic musical style for the film, but not, he insists, because of its association with surfing culture: \"To me it just sounds like rock and roll, even Morricone music. It sounds like rock and roll spaghetti Western music.\" Tarantino planned to use a power pop song, My Sharona by The Knack, during the film's rape scene, but ultimately discounted it.</p><p>Some of the songs were suggested to Tarantino by his friends Chuck Kelley and Laura Lovelace, who were credited as music consultants. Lovelace also appeared in the film as Laura, a waitress; she reprises the role in Jackie Brown. The soundtrack album was released along with the film in 1994. The album peaked on the Billboard 200 chart at number 21. The single, Urge Overkill's cover of the Neil Diamond song \"Girl, You'll Be a Woman Soon\", reached number 59.</p><p>Estella Tincknell describes how the particular combination of well-known and obscure recordings helps establish the film as a \"self-consciously 'cool' text. use of the mono-tracked, beat-heavy style of early 1960s U.S. 'underground' pop mixed with 'classic' ballads such as Dusty Springfield's 'Son of a Preacher Man' is crucial to the film's postmodern knowingness.\" She contrasts the soundtrack with that of Forrest Gump, the highest-grossing film of 1994, which also relies on period pop recordings: \"he version of 'the sixties' offered by Pulp Fiction ... is certainly not that of the publicly recognized counter-culture featured in Forrest Gump, but is, rather, a more genuinely marginal form of sub-culture based around a lifestyle – surfing, 'hanging' – that is resolutely apolitical.\" The soundtrack is central, she says, to the film's engagement with the \"younger, cinematically knowledgeable spectator\" it solicits.</p><br/><h3>Release and reception</h3><h4>Release and box office</h4><p>Pulp Fiction premiered in May 1994 at the Cannes Film Festival. The Weinsteins \"hit the beach like commandos\", bringing the picture's entire cast over. The film was unveiled at a midnight hour screening and caused a sensation It won the Palme d'Or, the festival's top prize, generating a further wave of publicity.</p><p>The first U.S. review of the film was published on May 23 in industry trade magazine Variety. Todd McCarthy called Pulp Fiction a \"spectacularly entertaining piece of pop culture ... a startling, massive success.\" From Cannes forward, Tarantino was on the road continuously, promoting the film. Over the next few months it played in smaller festivals around Europe, building buzz: Nottingham, Munich, Taormina, Locarno, Norway, and San Sebastián. Tarantino later said, \"One thing that's cool is that by breaking up the linear structure, when I watch the film with an audience, it does break alpha state. It's like, all of a sudden, 'I gotta watch this ... I gotta pay attention.' You can almost feel everybody moving in their seats. It's actually fun to watch an audience in some ways chase after a movie.\" In late September, it opened the New York Film Festival. The New York Times published its review the day of the opening. Janet Maslin called the film a \"triumphant, cleverly disorienting journey through a demimonde that springs entirely from Mr. Tarantino's ripe imagination, a landscape of danger, shock, hilarity and vibrant local color ... has come up with a work of such depth, wit and blazing originality that it places him in the front ranks of American film makers.\"</p><p>On October 14, 1994, Pulp Fiction went into general release in the United States. As Peter Biskind describes, \"It was not platformed, that is, it did not open in a handful of theaters and roll out slowly as word of mouth built, the traditional way of releasing an indie film; it went wide immediately, into 1,100 theaters.\" In the eyes of some cultural critics, Reservoir Dogs had given Tarantino a reputation for glamorizing violence. Miramax played with the issue in its marketing campaign: \"You won't know the facts till you've seen the fiction\", went one slogan. Pulp Fiction was the top-grossing film at the US box office its first weekend with a gross of $9,311,882, edging out a Sylvester Stallone vehicle, The Specialist, which was in its second week and playing at more than twice as many theaters. The gross claimed by Miramax was disputed by others. Warner Bros. initially reported an estimated gross of $8.9 million for The Specialist with Bob Weinstein then reporting a gross for Pulp Fiction of $9.1 million, claiming that the film was on another 100 screens that had previously been overlooked. Warners then updated their gross to $9.3 million, claiming they had made a calculation error. Early Monday morning, Miramax reported a gross of $9.3 million with Warners reporting $8.9 million for The Specialist, placing Pulp Fiction first but other industry sources did not believe Miramax's numbers. Variety estimated that Pulp Fiction grossed $8.6 to $9 million for the weekend.</p><p>Against its budget of $8.5 million and about $10 million in marketing costs, Pulp Fiction wound up grossing $107.93 million at the U.S. box office, making it the first \"indie\" film to surpass $100 million. Worldwide, it took in nearly $213 million. In terms of domestic grosses, it was the tenth biggest film of 1994, even though it played on substantially fewer screens than any other film in the top 20. Popular engagement with the film, such as speculation about the contents of the precious briefcase, \"indicates the kind of cult status that Pulp Fiction achieved almost immediately.\" As MovieMaker puts it, \"The movie was nothing less than a national cultural phenomenon.\" Abroad, as well: in Britain, where it opened a week after its U.S. release, not only was the film a big hit, but in book form its screenplay became the most successful in UK publishing history, a top-ten bestseller.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, the film holds an approval rating of 92% based on 110 reviews, with an average rating of 9.20/10. The website's critical consensus reads, \"One of the most influential films of the 1990s, Pulp Fiction is a delirious post-modern mix of neo-noir thrills, pitch-black humor, and pop-culture touchstones.\" On Metacritic, the film has a weighted average score of 94 out of 100, based on 24 critics, indicating \"universal acclaim\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale.</p><p>The response of major American film reviewers was widely favorable. Roger Ebert called it \"a comedy about blood, guts, violence, strange sex, drugs, fixed fights, dead body disposal, leather freaks and a wristwatch that makes a dark journey down through the generations... The screenplay by Tarantino and Roger Avary so well-written in a scruffy, fanzine way that you want to rub noses in it – the noses of those zombie writers who take 'screenwriting' classes that teach them the formulas for 'hit films'\". Richard Corliss of TIME wrote, \"It towers over the year's other movies as majestically and menacingly as a gang lord at a preschool. It dares Hollywood films to be this smart about going this far. If good directors accept Tarantino's implicit challenge, the movie theater could again be a great place to live in.\" In Newsweek, David Ansen wrote, \"The miracle of Quentin Tarantino's Pulp Fiction is how, being composed of secondhand, debased parts, it succeeds in gleaming like something new.\" \"You get intoxicated by it,\" wrote Entertainment Weekly's Owen Gleiberman, \"high on the rediscovery of how pleasurable a movie can be. I'm not sure I've ever encountered a filmmaker who combined discipline and control with sheer wild-ass joy the way that Tarantino does.\" \"There's a special kick that comes from watching something this thrillingly alive\", wrote Peter Travers of Rolling Stone. \"Pulp Fiction is indisputably great.\"</p><p>The Los Angeles Times was one of the few major news outlets to publish a negative review on the film's opening weekend. Kenneth Turan wrote, \"The writer-director appears to be straining for his effects. Some sequences, especially one involving bondage harnesses and homosexual rape, have the uncomfortable feeling of creative desperation, of someone who's afraid of losing his reputation scrambling for any way to offend sensibilities.\" Some who reviewed it in the following weeks took more exception to the predominant critical reaction than to Pulp Fiction itself. While not panning the film, Stanley Kauffmann of The New Republic felt that \"the way that has been so widely ravened up and drooled over verges on the disgusting. Pulp Fiction nourishes, abets, cultural slumming.\" Responding to comparisons between Tarantino's film and the work of French New Wave director Jean-Luc Godard, especially his first, most famous feature, Jonathan Rosenbaum of the Chicago Reader wrote, \"The fact that Pulp Fiction is garnering more extravagant raves than Breathless ever did tells you plenty about which kind of cultural references are regarded as more fruitful – namely, the ones we already have and don't wish to expand.\" Observing in the National Review that \"o film arrives with more advance hype\", John Simon was unswayed: \"titillation cures neither hollowness nor shallowness\".</p><p>Debate about the film spread beyond the review pages, with its violence often being the theme. In The Washington Post, Donna Britt described how she was happy not to see Pulp Fiction on a recent weekend and thus avoid \"discussing the rousing scene in which a gunshot sprays somebody's brains around a car interior\". Some commentators took exception to the film's frequent use of the word \"nigger\" (mentioned 18 times). In the Chicago Tribune, Todd Boyd argued that the word's recurrence \"has the ability to signify the ultimate level of hipness for white males who have historically used their perception of black masculinity as the embodiment of cool\". In Britain, James Wood, writing in The Guardian, set the tone for much subsequent criticism: \"Tarantino represents the final triumph of postmodernism, which is to empty the artwork of all content, thus avoiding its capacity to do anything except helplessly represent our agonies ... Only in this age could a writer as talented as Tarantino produce artworks so vacuous, so entirely stripped of any politics, metaphysics, or moral interest.\"</p><h4>Awards season</h4><p>Around the turn of the year, Pulp Fiction was named Best Picture by the National Society of Film Critics, National Board of Review, Los Angeles Film Critics Association, Boston Society of Film Critics, Society of Texas Film Critics, Southeastern Film Critics Association, and Kansas City Film Critics Circle. Tarantino was named Best Director by all seven of those organizations as well as by the New York Film Critics Circle and Chicago Film Critics Association. The screenplay won several prizes, with various awarding bodies ascribing credit differently. At the 52nd Golden Globe Awards, Tarantino, named as sole recipient of the Best Screenplay honor, failed to mention Avary in his acceptance speech. In February 1995, the film received seven Oscar nominations – Best Picture, Director, Actor (Travolta), Supporting Actor (Jackson), Supporting Actress (Thurman), Original Screenplay, and Film Editing. Travolta, Jackson, and Thurman were each nominated as well for the 1st Screen Actors Guild Awards, presented on February 25, but none took home the honor. At the Academy Awards ceremony the following month, Tarantino and Avary were announced as joint winners of the Academy Award for Best Original Screenplay. The furor around the film was still going strong: much of the March issue of Artforum was devoted to its critical dissection. Pulp Fiction garnered four honors at the Independent Spirit Awards, held at the end of the month – Best Feature, Best Director, Male Lead (Jackson), and Best Screenplay (Tarantino). At the British Academy Film Awards (BAFTA), Tarantino and Avary shared the BAFTA Award for Best Original Screenplay, and Jackson won for Best Supporting Actor. The film was nominated for the Grand Prix of the Belgian Film Critics Association.</p><p>The February 2020 issue of New York Magazine lists Pulp Fiction alongside Citizen Kane, Sunset Boulevard, Dr. Strangelove, Butch Cassidy and the Sundance Kid, The Conversation, Nashville, Taxi Driver, The Elephant Man, In the Bedroom, There Will Be Blood, and Roma as \"The Best Movies That Lost Best Picture at the Oscars\".</p><br/><h3>Influence and legacy</h3><p>Pulp Fiction quickly came to be regarded as one of the most significant films of its era. In 1995, in a special edition of Siskel & Ebert devoted to Tarantino, Gene Siskel argued that the work posed a major challenge to the \"ossification of American movies with their brutal formulas\". In Siskel's view,</p><blockquote>the violent intensity of Pulp Fiction calls to mind other violent watershed films that were considered classics in their time and still are. Hitchcock's Psycho, Arthur Penn's Bonnie and Clyde, and Stanley Kubrick's A Clockwork Orange. Each film shook up a tired, bloated movie industry and used a world of lively lowlifes to reflect how dull other movies had become. And that, I predict, will be the ultimate honor for Pulp Fiction. Like all great films, it criticizes other movies.</blockquote><p>Ken Dancyger writes that its \"imitative and innovative style\" – like that of its predecessor, Reservoir Dogs – represents</p><blockquote>a new phenomenon, the movie whose style is created from the context of movie life rather than real life. The consequence is twofold – the presumption of deep knowledge on the part of the audience of those forms such as the gangster films or Westerns, horror films or adventure films. And that the parody or alteration of that film creates a new form, a different experience for the audience.</blockquote><p>In a widely covered speech on May 31, 1995, Republican presidential candidate Bob Dole attacked the American entertainment industry for peddling \"nightmares of depravity\". Pulp Fiction was soon associated with his charges concerning gratuitous violence. Dole had not mentioned the film; he cited two less-celebrated movies based on Tarantino screenplays, Natural Born Killers and True Romance. In September 1996, Dole did accuse Pulp Fiction – which he had not seen – of promoting \"the romance of heroin\".</p><p>Paula Rabinowitz expresses the general film industry opinion that Pulp Fiction \"simultaneously resurrected John Travolta and film noir\". In Peter Biskind's description, it created a \"guys-with-guns frenzy\". The film has also been labeled as a black comedy and a \"neo-noir\". Critic Geoffrey O'Brien, however, argued against the classification of Pulp Fiction into the neo-noir genre: \"The old-time noir passions, the brooding melancholy and operatic death scenes, would be altogether out of place in the crisp and brightly lit wonderland that Tarantino conjures up. neither neo-noir nor a parody of noir.\" Similarly, Nicholas Christopher calls it \"more gangland camp than neo-noir\", and Foster Hirsch suggests that its \"trippy fantasy landscape\" characterizes it more definitively than any genre label. Regardless, the stylistic influence of Pulp Fiction soon became apparent. Less than a year after the picture's release, British critic Jon Ronson attended the National Film School's end-of-semester screenings and assessed the impact: \"Out of the five student movies I watched, four incorporated violent shoot-outs over a soundtrack of iconoclastic 70s pop hits, two climaxed with all the main characters shooting each other at once, and one had two hitmen discussing the idiosyncrasies of The Brady Bunch before offing their victim. Not since Citizen Kane has one man appeared from relative obscurity to redefine the art of moviemaking.\" Among the first Hollywood films cited as its imitators were Destiny Turns on the Radio (1995), in which Tarantino acted, Things to Do in Denver When You're Dead (1995), and 2 Days in the Valley (1996). It \"triggered a myriad of clones\", writes Fiona Villella. Internationally, according to David Desser, it \"not only influenced a British brand of noir, but extended the noir vision virtually around the world\". Pulp Fiction's effect on film form was still reverberating in 2007, when David Denby of The New Yorker credited it with initiating the ongoing cycle of disordered cinematic narratives.</p><p>Its impact on Hollywood was deeper still. According to Variety, the trajectory of Pulp Fiction from Cannes launch to commercial smash \"forever altered the game\" of so-called independent cinema. It \"cemented Miramax's place as the reigning indie superpower\", writes Biskind. \"Pulp became the Star Wars of independents, exploding expectations for what an indie film could do at the box office.\" The film's large financial return on its small budget</p><blockquote>transform the industry's attitude toward the lowly indies ... spawning a flock of me-too classics divisions ...mart studio executives suddenly woke up to the fact that grosses and market share, which got all the press, were not the same as profits ... Once the studios realized that they could exploit the economies of (small) scale, they more or less gave up buying or remaking the films themselves, and either bought the distributors, as Disney had Miramax, or started their own ... copy Miramax's marketing and distribution strategies.</blockquote><p>In 2001, Variety, noting the increasing number of actors switching back and forth between expensive studio films and low-budget independent or indie-style projects, suggested that the \"watershed moment for movie stars\" came with the decision by Willis – one of Hollywood's highest-paid performers – to appear in Pulp Fiction.</p><p>And its impact was even broader than that. It has been described as a \"major cultural event\", an \"international phenomenon\" that influenced television, music, literature, and advertising. Not long after its release, it was identified as a significant focus of attention within the growing community of Internet users. Adding Pulp Fiction to his roster of The Great Movies in 2001, Roger Ebert called it \"the most influential film of the decade\". Four years later, Time's Corliss wrote much the same: \"(unquestionably) the most influential American movie of the 90s\".</p><p>Several scenes and images from the film achieved iconic status; in 2008, Entertainment Weekly declared, \"You'd be hard-pressed, by now, to name a moment from Quentin Tarantino's film that isn't iconic.\" Jules and Vincent's \"Royale with Cheese\" dialogue became famous. It was referenced more than a decade and a half later in the Travolta vehicle From Paris with Love. The adrenalin shot to Mia Wallace's heart is on Premiere's list of \"100 Greatest Movie Moments\". The scene of Travolta and Thurman's characters dancing has been frequently homaged, most unambiguously in the 2005 film Be Cool, starring the same two actors. The image of Travolta and Jackson's characters standing side by side in suit and tie, pointing their guns, has also become widely familiar. In 2007, BBC News reported that \"London transport workers have painted over an iconic mural by 'guerrilla artist' Banksy ... The image depicted a scene from Quentin Tarantino's Pulp Fiction, with Samuel L. Jackson and John Travolta clutching bananas instead of guns.\" Certain lines were adopted popularly as catchphrases, in particular Marsellus's threat, \"I'm 'a get medieval on your ass.\" Jules's \"Ezekiel\" recitation was voted the fourth greatest movie speech of all time in a 2004 poll. One of the more notable homages to Jules \"Biblical\" quote was one Jackson himself played a part in, near the end of 2014's Captain America: The Winter Soldier, Jackson's character Col. Nick Fury, presumed dead, visits his own gravestone, on which, below Fury's name is inscribed \"The path of the righteous man ...\" Ezekiel 25:17. In 2019, it was reported that Dominic Cummings, special political adviser to British Prime Minister Boris Johnson, quoted Jules by telling Conservative MPs to \"be cool like Fonzies\" as political pressure built to request an extension to the date of the UK's withdrawal from the European Union.</p><p>Pulp Fiction now appears in several critical assessments of all-time great films. In 2008, Entertainment Weekly named it the best film of the past quarter-century. That same year, the American Film Institute's \"Ten Top Ten\" poll ranked it number 7 all-time in the gangster film genre. In 2007, it was voted 94th overall on the AFI's 100 Years ... 100 Movies list. In 2005, it was named one of \"Time's All-Time 100 Movies\". As of September 2018, it is number 54 on Metacritic's list of all-time highest scores. The film ranks very highly in popular surveys. A 2008 Empire poll combining the opinions of readers, movie industry professionals, and critics named Pulp Fiction the ninth-best film of all time. In a 2006 readers' poll by the British magazine Total Film, it ranked as the number three film in history. It was voted as the fourth-greatest film of all time in a nationwide poll for Britain's Channel 4 in 2001.</p><br/><h3>Critical analysis</h3><p>Tarantino has stated that he originally planned \"to do a Black Mask movie\", referring to the magazine largely responsible for popularizing hardboiled detective fiction. \"t kind of went somewhere else\". Geoffrey O'Brien sees the result as connected \"rather powerfully to a parallel pulp tradition: the tales of terror and the uncanny practiced by such writers as Cornell Woolrich Fredric Brown ... Both dealt heavily in the realm of improbable coincidences and cruel cosmic jokes, a realm that Pulp Fiction makes its own.\" In particular, O'Brien finds a strong affinity between the intricate plot mechanics and twists of Brown's novels and the recursive, interweaving structure of Pulp Fiction. Philip French describes the film's narrative as a \"circular movement or Möbius strip of a kind Resnais and Robbe-Grillet would admire\". James Mottram regards crime novelist Elmore Leonard, whose influence Tarantino has acknowledged, as the film's primary literary antecedent. He suggests that Leonard's \"rich dialogue\" is reflected in Tarantino's \"popular-culture-strewn jive\"; he also points to the acute, extremely dark sense of humor Leonard applies to the realm of violence as a source of inspiration.</p><p>Film scholar/historian Robert Kolker sees the \"flourishes, the apparent witty banality of the dialogue, the goofy fracturing of temporality a patina over a pastiche. The pastiche ... is essentially of two films that Tarantino can't seem to get out of his mind: Mean Streets] and The Killing.\" He contrasts Pulp Fiction with postmodern Hollywood predecessors Hudson Hawk (1991; starring Willis) and Last Action Hero (1993; starring Arnold Schwarzenegger) that \"took the joke too far ... simply mocked or suggested that they were smarter than the audience\" and flopped. Todd McCarthy writes that the film's \"striking widescreen compositions often contain objects in extreme close-up as well as vivid contrasts, sometimes bringing to mind the visual strategies of Sergio Leone\", an acknowledged hero of Tarantino's. To Martin Rubin, the \"expansive, brightly colored widescreen visuals\" evoke comedy directors such as Frank Tashlin and Blake Edwards.</p><p>The movie's host of pop culture allusions, ranging from the famous image of Marilyn Monroe's skirt flying up over a subway grating to Jules addressing a soon-to-be victim as \"Flock of Seagulls\" because of his haircut, have led many critics to discuss it within the framework of postmodernism. Describing the film in 2005 as Tarantino's \"postmodern masterpiece ... to date\", David Walker writes that it \"is marked by its playful reverence for the 1950s ... and its constantly teasing and often deferential references to other films\". He characterizes its convoluted narrative technique as \"postmodern tricksiness\". Calling the film a \"terminally hip postmodern collage\", Foster Hirsch finds Pulp Fiction far from a masterpiece: \"authoritative, influential, and meaningless\". Set \"in a world that could exist only in the movies\", it is \"a succulent guilty pleasure, beautifully made junk food for cinéastes\". O'Brien, dismissing attempts to associate the movie with film noir, argues that \"Pulp Fiction is more a guided tour of an infernal theme park decorated with cultural detritus, Buddy Holly and Mamie Van Doren, fragments of blaxploitation and Roger Corman and Shogun Assassin, music out of a twenty-four-hour oldies station for which all the decades since the fifties exist simultaneously.\" Catherine Constable takes the moment in which a needle filled with adrenalin is plunged into the comatose Mia's heart as exemplary. She proposes that it \"can be seen as effecting her resurrection from the dead, simultaneously recalling and undermining the Gothic convention of the vampire's stake. On this model, the referencing of previous aesthetic forms and styles moves beyond ... empty pastiche, sustaining an 'inventive and affirmative' mode of postmodernism.\"</p><p>Mark T. Conard asks, \"hat is the film about?\" and answers, \"American nihilism.\" Hirsch suggests, \"If the film is actually about anything other than its own cleverness, it seems dedicated to the dubious thesis that hit men are part of the human family.\" Richard Alleva argues that \"Pulp Fiction has about as much to do with actual criminality or violence as Cyrano de Bergerac with the realities of seventeenth-century France or The Prisoner of Zenda with Balkan politics.\" He reads the movie as a form of romance whose allure is centered in the characters' nonnaturalistic discourse, \"wise-guy literate, media-smart, obscenely epigrammatic\". In Alan Stone's view, the \"absurd dialogue\", like that between Vincent and Jules in the scene where the former accidentally kills Marvin, \"unexpectedly transforms the meaning of the violence cliché ... Pulp Fiction unmasks the macho myth by making it laughable and deheroicizes the power trip glorified by standard Hollywood violence.\" Stone reads the film as \"politically correct. There is no nudity and no violence directed against women ... celebrates interracial friendship and cultural diversity; there are strong women and strong black men, and the director swims against the current of class stereotype.\"</p><p>Where Stone sees a celebration, Kolker finds a vacuum: \"The postmodern insouciance, violence, homophobia, and racism of Pulp Fiction were perfectly acceptable because the film didn't pretend seriousness and therefore didn't mock it.\" Calling it the \"acme of postmodern nineties filmmaking\", he explains, \"the postmodern is about surfaces; it is flattened spatiality in which event and character are in a steady state of reminding us that they are pop-cultural figures.\" According to Kolker:</p><blockquote>That's why Pulp Fiction was so popular. Not because all audiences got all or any of its references to Scorsese and Kubrick, but because the narrative and spatial structure of the film never threatened to go beyond themselves into signification. The film's cycle of racist and homophobic jokes might threaten to break out into a quite nasty view of the world, but this nastiness keeps being laughed off – by the mock intensity of the action, the prowling, confronting, perverse, confined, and airless nastiness of the world Tarantino creates.</blockquote><p>Henry A. Giroux argues that Tarantino \"empties violence of any critical social consequences, offering viewers only the immediacy of shock, humor, and irony-without-insight as elements of mediation. None of these elements gets beyond the seduction of voyeuristic gazing ...he facile consumption of shocking images and hallucinatory delight.\"</p><p>Regarding the violence and nihilism in the film, Pamela Demory has suggested that Pulp Fiction should be seen in light of the short stories of Flannery O'Connor, which likewise feature \"religious elements, banality, and violence with grotesque humor.\" Discussing \"the connection between violence and redemption,\" Demory concludes that while O'Connor's purpose is to convince readers \"of the powerful force of evil in the world and of our need for grace,\" Tarantino \"seeks to demonstrate that in spite of everything we have seen in the film – all the violence, degradation, death, crime, amoral behavior – grace is still possible; there might still be a God who doesn't judge us on merits.\"</p><h4>Homage as essence</h4><h4>Cinema</h4><p>Pulp Fiction is full of homages to other movies. \"Tarantino's characters\", writes Gary Groth, \"inhabit a world where the entire landscape is composed of Hollywood product. Tarantino is a cinematic kleptomaniac – he literally can't help himself.\" Two scenes in particular have prompted discussion of the film's highly intertextual style. Many have assumed that the dance sequence at Jack Rabbit Slim's was intended as a reference to Travolta's star-making performance as Tony Manero in the epochal Saturday Night Fever (1977); Tarantino, however, credits a scene in the Jean-Luc Godard film Bande à part (1964) with the inspiration. According to the filmmaker;</p><blockquote>Everybody thinks that I wrote this scene just to have John Travolta dancing. But the scene existed before John Travolta was cast. But once he was cast, it was like, \"Great. We get to see John dance. All the better.\"... My favorite musical sequences have always been in Godard, because they just come out of nowhere. It's so infectious, so friendly. And the fact that it's not a musical, but he's stopping the movie to have a musical sequence, makes it all the more sweet.</blockquote><p>Jerome Charyn argues that, beyond \"all the better\", Travolta's presence is essential to the power of the scene, and of the film:</p><blockquote>Travolta's entire career becomes \"backstory\", the myth of a movie star who has fallen out of favor, but still resides in our memory as the king of disco. We keep waiting for him to shed his paunch, put on a white polyester suit, and enter the 2001 Odyssey club in Bay Ridge, Brooklyn, where he will dance for us and never, never stop. Daniel Day-Lewis couldn't have woken such a powerful longing in us. He isn't part of America's own mad cosmology ... Tony Manero an angel sitting on Vince's shoulder ... actual dance may be closer to the choreography of Anna Karina's shuffle with her two bumbling gangster boyfriends in Bande à part, but even that reference is lost to us, and we're with Tony again ...</blockquote><p>Estella Tincknell notes that while the \"diner setting seems to be a simulacrum of a 'fifties' restaurant ... the twist contest is a musical sequence which evokes 'the sixties,' while Travolta's dance performance inevitably references 'the seventies' and his appearance in Saturday Night Fever. ... The 'past' thus becomes a more general 'pastness' in which the stylistic signifiers of various decades are loaded in to a single moment.\" She also argues that in this passage the film \"briefly shifts from its habitually ironic discourse to one that references the conventions of the classic film musical and in doing so makes it possible for the film to inhabit an affective space that goes beyond stylistic allusion.\"</p><p>The pivotal moment in which Marsellus crosses the street in front of Butch's car and notices him evokes the scene in which Marion Crane's boss sees her under similar circumstances in Psycho (1960). Marsellus and Butch are soon held captive by Maynard and Zed, \"two sadistic honkies straight out of Deliverance\" (1972), directed by John Boorman. Zed shares a name with Sean Connery's character in Boorman's follow-up, the science-fiction film Zardoz (1974). When Butch decides to rescue Marsellus, in Glyn White's words, \"he finds a trove of items with film-hero resonances\". Critics have identified these weapons with a range of possible allusions:</p><ul><li>Hammer – The Toolbox Murders (1978)</li><li>Baseball bat – Walking Tall (1973); The Untouchables (1987)</li><li>Chainsaw – The Texas Chain Saw Massacre (1974); Evil Dead II (1987)</li><li>Katana (samurai sword) – many, including Seven Samurai (1954); The Yakuza (1975); Shogun Assassin (1980)</li></ul><p>At the conclusion of the scene, a portentous line of Marsellus's echoes one from the crime drama Charley Varrick (1973), directed by another of Tarantino's heroes, Don Siegel; the name of the character who speaks it there is Maynard.</p><p>David Bell argues that far from going against the \"current of class stereotype\", this scene, like Deliverance, \"mobilize a certain construction of poor white country folk – and particularly their sexualization ... 'rustic sexual expression often takes the form of homosexual rape' in American movies.\" Stephen Paul Miller believes the Pulp Fiction scene goes down much easier than the one it echoes: \"The buggery perpetrated is not at all as shocking as it was in Deliverance ... The nineties film reduces seventies competition, horror, and taboo into an entertainingly subtle adrenaline play – a fiction, a pulp fiction.\" Giroux reads the rape scene homage similarly: \"in the end Tarantino's use of parody is about repetition, transgression, and softening the face of violence by reducing it to the property of film history.\" In Groth's view, the crucial difference is that \"in Deliverance the rape created the film's central moral dilemma whereas in Pulp Fiction it was merely 'the single weirdest day of life.'\" (\"American Me did it too,\" Tarantino observed. \"There's like three butt-fucking scenes in American Me. That's definitely the one to beat in that particular category!\")</p><p>Neil Fulwood focuses on Butch's weapon selection, writing, \"Here, Tarantino's love of movies is at its most open and nonjudgemental, tipping a nod to the noble and the notorious, as well as sending up his own reputation as an enfant terrible of movie violence. Moreover, the scene makes a sly comment about the readiness of cinema to seize upon whatever is to hand for its moments of mayhem and murder.\" White asserts that \"the katana he finally, and significantly, selects identifies him with ... honourable heroes.\" Conard argues that the first three items symbolize a nihilism that Butch is rejecting. The traditional Japanese sword, in contrasts, represents a culture with a well-defined moral code and thus connects Butch with a more meaningful approach to life.</p><p>The biker film Nam's Angels is also shown with Fabienne characterizing it as \"A motorcycle movie, I'm not sure the name.\"</p><h4>Television</h4><p>Robert Miklitsch argues that \"Tarantino's telephilia\" may be more central to the guiding sensibility of Pulp Fiction than the filmmaker's love for rock 'n' roll and even cinema:</p><blockquote>Talking about his generation, one that came of age in the '70s, Tarantino has commented that the \"number one thing we all shared wasn't music, that was a Sixties thing. Our culture was television.\" A random list of the TV programs referenced in Pulp Fiction confirms his observation: Speed Racer, Clutch Cargo, The Brady Bunch, The Partridge Family, The Avengers, The Three Stooges, The Flintstones, I Spy, Green Acres, Kung Fu, Happy Days, and last but not least, Mia's fictional pilot, Fox Force Five.</blockquote><p>\"The above list, with the possible exception of The Avengers,\" writes Miklitsch, \"suggests that Pulp Fiction has less of an elective affinity with the cinematic avant-gardism of Godard than with mainstream network programming.\" Jonathan Rosenbaum had brought TV into his analysis of the Tarantino/Godard comparison, acknowledging that the directors were similar in wanting to cram everything they like onscreen: \"But the differences between what Godard likes and what Tarantino likes and why are astronomical; it's like comparing a combined museum, library, film archive, record shop, and department store with a jukebox, a video-rental outlet, and an issue of TV Guide.\"</p><p>Sharon Willis focuses on the way a television show (Clutch Cargo) marks the beginning of, and plays on through, the scene between young Butch and his father's comrade-in-arms. The Vietnam War veteran is played by Christopher Walken, whose presence in the role evokes his performance as a traumatized G.I. in the Vietnam War movie The Deer Hunter (1978). Willis writes that \"when Captain Koons enters the living room, we see Walken in his function as an image retrieved from a repertoire of 1970s television and movie versions of ruined masculinity in search of rehabilitation ...he gray light of the television presiding over the scene seems to inscribe the ghostly paternal gaze.\" Miklitsch asserts that, for some critics, the film is a \"prime example of the pernicious ooze-like influence of mass culture exemplified by their bête noire: TV.\" Kolker might not disagree, arguing that \"Pulp Fiction is a simulacrum of our daily exposure to television; its homophobes, thugs and perverts, sentimental boxers and pimp promoters move through a series of long-take tableaux: we watch, laugh, and remain with nothing to comprehend.\"</p><h4>Notable motifs</h4><h4>The mysterious 666 briefcase</h4><p>The combination of the mysterious suitcase lock is 666, the \"Number of the Beast\". Tarantino has said there is no explanation for its contents – it is simply a MacGuffin, a pure plot device. Originally, the case was to contain diamonds, but this was seen as too mundane. For filming purposes, it contained a hidden orange light bulb that produced an otherworldly glow when the case was opened. In a 2007 video interview with fellow director and friend Robert Rodriguez, Tarantino purportedly \"reveals\" the secret contents of the briefcase, but the film cuts out and skips the scene in the style employed in Tarantino and Rodriguez's Grindhouse (2007), with an intertitle that reads \"Missing Reel\". The interview resumes with Rodriguez discussing how radically the \"knowledge\" of the briefcase's contents alters one's understanding of the movie.</p><p>Despite Tarantino's statements, many solutions to what one scholar calls this \"unexplained postmodern puzzle\" have been proposed. A strong similarity has often been observed with Robert Aldrich's 1955 film noir Kiss Me Deadly. That movie, features a glowing briefcase housing an atomic explosive. In their review of Alex Cox's 1984 film Repo Man in The Daily Telegraph, Nick Cowen and Hari Patience suggest that Pulp Fiction may also owe \"a debt of inspiration\" to the glowing car trunk in that film. In scholar Paul Gormley's view, this connection with Kiss Me Deadly, and a similar one with Raiders of the Lost Ark (1981), makes it possible to read the eerie glow as symbolic of violence itself. The idea that the briefcase contains Marsellus's soul gained popular currency in the mid-1990s. Analyzing the notion, Roger Ebert dismissed it as \"nothing more than a widely distributed urban legend given false credibility by the mystique of the Net\".</p><h4>Jules' Bible passage</h4><p>Jules ritually recites what he describes as a biblical passage, Ezekiel 25:17, before he executes someone. The passage is heard three times – in the introductory sequence in which Jules and Vincent reclaim Marsellus's briefcase from the doomed Brett; that same recitation a second time, at the beginning of \"The Bonnie Situation\", which overlaps the end of the earlier sequence; and in the epilogue at the diner. The first version of the passage is as follows:</p><blockquote>The path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men. Blessed is he who in the name of charity and goodwill shepherds the weak through the valley of darkness, for he is truly his brother's keeper and the finder of lost children. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy My brothers. And you will know My name is the Lord when I lay My vengeance upon thee.</blockquote><p>The second version, from the diner scene, is identical except for the final line: \"And you will know I am the Lord when I lay my vengeance upon you.\"</p><p>While the final two sentences of Jules's speech are similar to the actual cited passage, the first two are fabricated from various biblical phrases. The text of Ezekiel 25 preceding verse 17 indicates that God's wrath is retribution for the hostility of the Philistines. In the King James Version from which Jules's speech is adapted, Ezekiel 25:17 reads in its entirety:</p><blockquote>And I will execute great vengeance upon them with furious rebukes; and they shall know that I am the LORD, when I shall lay My vengeance upon them.</blockquote><p>Tarantino's primary inspiration for the speech was the work of Japanese martial arts star Sonny Chiba. Its text and its identification as Ezekiel 25:17 derive from an almost identical creed that appears at the beginning of the Chiba movie Karate Kiba (The Bodyguard; 1976), where it is both shown as a scrolling text and read by an offscreen narrator.</p><p>The version seen at the beginning of The Bodyguard (1976) is as follows:</p><blockquote>The path of the righteous man and defender is beset on all sides by the inequity of the selfish and the tyranny of evil men. Blessed is he, who in the name of charity and good will, shepherds the weak through the valley of darkness, for he is truly his brother's keeper, and the father of lost children. And I will execute great vengeance upon them with furious anger, who poison and destroy my brothers; and they shall know that I am Chiba the Bodyguard when I shall lay my vengeance upon them!</blockquote><p>In the 1980s television series Kage no Gundan (Shadow Warriors), Chiba's character would lecture the villain-of-the-week about how the world must be rid of evil before killing him. A killer delivers a similar biblical rant in Modesty Blaise, the hardback but pulp-style novel Vincent is shown with in two scenes.</p><p>Two critics who have analyzed the role of the speech find different ties between Jules's transformation and the issue of postmodernity. Gormley argues that unlike the film's other major characters – Marsellus aside – Jules is:</p><blockquote>linked to a \"thing\" beyond postmodern simulation ...his is perhaps most marked when he moves on from being a simulation of a Baptist preacher, spouting Ezekiel because it was \"just a cool thing to say ...\" In his conversion, Jules is shown to be cognizant of a place beyond this simulation, which, in this case, the film constructs as God.</blockquote><p>Adele Reinhartz writes that the \"depth of Jules's transformation\" is indicated by the difference in his two deliveries of the passage: \"In the first, he is a majestic and awe-inspiring figure, proclaiming the prophecy with fury and self-righteousness ... In the second ... he appears to be a different sort of man altogether ...n true postmodern fashion, reflects on the meaning of his speech and provides several different ways that it might pertain to his current situation.\" Similar to Gormley, Conard argues that as Jules reflects on the passage, it dawns on him \"that it refers to an objective framework of value and meaning that is absent from his life\"; to Conard, this contrasts with the film's prevalent representation of a nihilistic culture. Rosenbaum finds much less in Jules's revelation: \"he spiritual awakening at the end of Pulp Fiction, which Jackson performs beautifully, is a piece of jive avowedly inspired by kung-fu movies. It may make you feel good, but it certainly doesn't leave you any wiser.\"</p><h4>The bathroom</h4><p>Much of Pulp Fiction's action revolves around characters who are either in the bathroom or need to use the toilet. To a lesser extent, Tarantino's other films also feature this narrative element. At Jack Rabbit Slim's, Mia goes to \"powder her nose\" – literally; she snorts coke in the restroom, surrounded by a bevy of women vainly primping. Butch and Fabienne play an extended scene in their motel bathroom, he in the shower, she brushing her teeth; the next morning, but just a few seconds later in screen time, she is again brushing her teeth. As Jules and Vincent confront Brett and two of his pals, a fourth man is hiding in the bathroom – his actions will lead to Jules' transformative \"moment of clarity\". After Marvin's absurd death, Vincent and Jules wash up in Jimmie's bathroom, where they get into a contretemps over a bloody hand towel. When the diner hold-up turns into a standoff, \"Honey Bunny\" whines, \"I gotta go pee!\"</p><p>As described by Peter and Will Brooker, \"In three significant moments Vincent retires to the bathroom returns to an utterly changed world where death is threatened.\" The threat increases in magnitude as the narrative progresses chronologically, and is realized in the third instance:</p><p>In the Brookers' analysis, \"Through Vince ... we see the contemporary world as utterly contingent, transformed, disastrously, in the instant you are not looking.\" Fraiman finds it particularly significant that Vincent is reading Modesty Blaise in two of these instances. She links this fact with the traditional derisive view of women as \"the archetypal consumers of pulp\":</p><blockquote>Locating popular fiction in the bathroom, Tarantino reinforces its association with shit, already suggested by the dictionary meanings of \"pulp\" that preface the movie: moist, shapeless matter; also, lurid stories on cheap paper. What we have then is a series of damaging associations – pulp, women, shit – that taint not only male producers of mass-market fiction but also male consumers. Perched on the toilet with his book, Vincent is feminized by sitting instead of standing as well as by his trashy tastes; preoccupied by the anal, he is implicitly infantilized and homosexualized; and the seemingly inevitable result is being pulverized by Butch with a Czech M61 submachine gun. That this fate has to do with Vincent's reading habits is strongly suggested by a slow tilt from the book on the floor directly up to the corpse spilled into the tub.</blockquote><p>Willis reads Pulp Fiction in almost precisely the opposite direction, finding \"its overarching project as a drive to turn shit into gold. This is one way of describing the project of redeeming and recycling popular culture, especially the popular culture of one's childhood, as is Tarantino's wont as well as his stated aim.\" Despite that, argues Fraiman, \"Pulp Fiction demonstrates ... that even an open pulpophile like Tarantino may continue to feel anxious and emasculated by his preferences.\"</p><br/><h3>Accolades</h3><p>Pulp Fiction won eight major awards from a total of twenty-six nominations, including a Best Original Screenplay win at the 67th Academy Awards. Also, in the balloting by the National Society of Film Critics, Samuel L. Jackson was the runner-up in both the Best Actor and the Best Supporting Actor categories.</p><p>American Film Institute Lists</p><ul><li>AFI's 100 Years ... 100 Movies – No. 95</li><li>AFI's 100 Years ... 100 Heroes & Villains:Vincent Vega and Jules Winnfield – Nominated Villains</li><li>Vincent Vega and Jules Winnfield – Nominated Villains</li><li>AFI's 100 Years ... 100 Movie Quotes:\"Bring out the Gimp\" – Nominated Quote \"They call it a Royale with Cheese\" – Nominated Quote</li><li>\"Bring out the Gimp\" – Nominated Quote</li><li>\"They call it a Royale with Cheese\" – Nominated Quote</li><li>AFI's 100 Years ... 100 Laughs – Nominated</li><li>AFI's 100 Years ... 100 Movies (10th Anniversary Edition) – No. 94</li><li>AFI's 100 Years ... 100 Thrills – No. 53</li></ul><br/><h3>NFT dispute</h3><p>In November 2021, Miramax filed a lawsuit against Tarantino who released seven NFTs based on uncut and unseen scenes of Pulp Fiction and including the original handwritten script \"revealing secrets about the film and its creator.\" Miramax claimed they own the film rights. However, Tarantino disputed the lawsuit and claimed he had rights to the film script in written form. The matter was later settled with Miramax's lawyers filing a brief statement in court: \"The parties have agreed to put this matter behind them and look forward to collaborating with each other on future projects, including possible NFTs.\"</p><br/>"
  },
  "errorMessage": ""
}