{
  "imDbId": "tt3315342",
  "title": "Logan",
  "fullTitle": "Logan (2017)",
  "type": "Movie",
  "year": "2017",
  "items": [
    {
      "publisher": "The Hollywood Reporter",
      "author": "Sheri Linden",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/logan-review-970227/",
      "rate": "80",
      "content": "Seamlessly melding Marvel mythology with Western mythology, James Mangold has crafted an affectingly stripped-down stand-alone feature, one that draws its strength from Hugh Jackman’s nuanced turn as a reluctant, all but dissipated hero."
    },
    {
      "publisher": "Variety",
      "author": "Owen Gleiberman",
      "link": "https://variety.com/2017/film/festivals/logan-review-berlin-film-festival-1201990143/",
      "rate": "80",
      "content": "Each time the violence explodes, it’s slashingly satisfying, because it’s earned, and also because Mangold knows just how to stage it."
    },
    {
      "publisher": "The Telegraph",
      "author": "Robbie Collin",
      "link": "https://www.telegraph.co.uk/films/0/logan-review-hugh-jackmans-last-turn-wolverine/",
      "rate": "80",
      "content": "Logan is a film for people, like me, who thought the only good bit of X-Men: Apocalypse was Michael Fassbender crying in the woods, and left the cinema wishing that had been the whole thing. It’s something no-one could have expected: a creatively risky superhero movie. And it deserves to pay off."
    },
    {
      "publisher": "Miami Herald",
      "author": "Rene Rodriguez",
      "link": "",
      "rate": "75",
      "content": "In Logan, the clawed mutant Wolverine finally gets to slash through the constraints of a kid-friendly PG-13 rating, and the result is bloody, vicious fun. The squeamish will avert their eyes, and young children should not be allowed anywhere near this movie, no matter how many X-Men action figures they own."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/features/general/logan-review-hugh-jackman-x-men-wolverine-1201784397/",
      "rate": "75",
      "content": "Logan isn’t always a satisfying movie, but there’s a very satisfying answer to those questions waiting for viewers at the end of it. Satisfying not only because Mangold resolves things with some brilliantly expressive imagery, or because he endows this story with a no-shits-left-to-give honesty that defies its origins and justifies its spectacular violence and salty vocabulary, but because it proves how iconic Jackman has made this character over the last 17 years."
    },
    {
      "publisher": "The Playlist",
      "author": "Kevin Jagernauth",
      "link": "",
      "rate": "75",
      "content": "A movie with the bleakest vision of Wolverine yet, but also hands down the best treatment the character has received on the big screen in the fifteen plus years Jackman has inhabited the role."
    },
    {
      "publisher": "TheWrap",
      "author": "Alonso Duralde",
      "link": "https://www.thewrap.com/logan-review-hugh-jackman-wolverine-x-men/",
      "rate": "70",
      "content": "Whether or not the “Wolverine” movies have a future — Jackman swears this is his last go-round — Logan is an exceedingly entertaining one."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Chris Nashawaty",
      "link": "https://ew.com/movies/2017/02/17/logan-ew-review/",
      "rate": "67",
      "content": "The loner has to learn to put someone else first. It’s both as manipulative and hokey as that sounds, but occasionally it works well enough that you might find yourself getting choked up against your better judgment."
    },
    {
      "publisher": "Slant Magazine",
      "author": "Jake Cole",
      "link": "",
      "rate": "63",
      "content": "It recognizes that the thinly veiled secret of Wolverine’s loner act is that he’s always been a cog of some kind."
    },
    {
      "publisher": "Time",
      "author": "Stephanie Zacharek",
      "link": "https://time.com/4671852/logan-movie-review/",
      "rate": "40",
      "content": "The picture is mostly tedious and unpleasant, which is a shame for the sake of the performers. Jackman works hard here, and his performance does away with vanity altogether."
    }
  ],
  "errorMessage": ""
}