{
  "imDbId": "tt3315342",
  "title": "Logan",
  "fullTitle": "Logan (2017)",
  "type": "Movie",
  "year": "2017",
  "items": [
    {
      "username": "artgutierrez",
      "userUrl": "https://www.imdb.com/user/ur64091169",
      "reviewLink": "https://www.imdb.com/review/rw6337774",
      "warningSpoilers": false,
      "date": "5 December 2020",
      "rate": "10",
      "helpful": "85 out of 91 found this helpful.",
      "title": "Perfect film to end Wolverine's story",
      "content": "This really is one of the best superhero movies of all time. And best of all, it doesn't even feel like a superhero movie. Fantastic story and great acting all around."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw4156950",
      "warningSpoilers": true,
      "date": "7 May 2018",
      "rate": "9",
      "helpful": "46 out of 55 found this helpful.",
      "title": "A gritty, more adult Wolverine film",
      "content": "It is 2029 and Logan is getting old and tired. Most of the mutants are long gone although Professor Charles Xavier is still alive; he too is old though and as his mind goes so does the control of his powers. Logan is working as a limo drive in the area near the Mexican border and is approached by a woman asking him to drive her and a young girl, Laura, to North Dakota. It turns out Laura is a mutant with similar powers to Logan; unlike him though she isn't a natural mutation but one of a group of new mutants created in a lab in Mexico City as part of an experiment to create super-soldiers. When the experiment was judged to have failed the children were due to be killed so their carers are trying to get them to safety. Logan is initially unwilling to get involved but eventually ends up heading north with Laura and Xavier. They are pursued by those determined to retrieve Laura; everybody who gets in their way is expendable.Those expecting another 'X-Men' film will certainly get a bit of a shock; this is not an exciting superhero movie suitable for all but young children. Instead it is almost consistently downbeat with some fairly brutal violence as Logan and Laura remove limbs and puncture skulls with their adamantium claws. There are some genuine surprises as bad things happen to characters one would expect to be safe. Hugh Jackman is great in the lead role, showing a different side to Logan; he is no longer young and angry, instead he is old and world-weary. Young Dafne Keen impresses as Laura; an almost feral girl who makes Hit Girl from 'Kick-Ass' look gentle! There are nods to other films; most notably 'Shane', which Laura watches with Xavier and their search for the possibly mythical Eden in North Dakota reminded me of a different Logan's search for Sanctuary in 'Logan's Run'. I'd certainly recommend this to older X-Men fans but would caution against showing it to younger fans as it is very violent and has some pretty depressing moments."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5478908",
      "warningSpoilers": false,
      "date": "12 February 2020",
      "rate": "",
      "helpful": "301 out of 389 found this helpful.",
      "title": "Logan",
      "content": "No words can explain the epicness & greatness of this movie."
    },
    {
      "username": "vithiet",
      "userUrl": "https://www.imdb.com/user/ur96996693",
      "reviewLink": "https://www.imdb.com/review/rw4543360",
      "warningSpoilers": false,
      "date": "29 December 2018",
      "rate": "9",
      "helpful": "160 out of 218 found this helpful.",
      "title": "The Wolverine movie we've all been waiting for",
      "content": "Thank you Deadpool for opening the door to R-rated superhero movies."
    },
    {
      "username": "mbhgkmsgg",
      "userUrl": "https://www.imdb.com/user/ur125187549",
      "reviewLink": "https://www.imdb.com/review/rw6247718",
      "warningSpoilers": false,
      "date": "8 November 2020",
      "rate": "9",
      "helpful": "22 out of 25 found this helpful.",
      "title": "A comic book film done right",
      "content": "Gritty, honest and brutal. Just like a movie about Logan should be. This is by far the best X-Men film as far as I'm concerned. Logan doesn't hold back at all which I absolutely loved. For the most part, there is just an onslaught of awful things happening. And apart from the relationship between Laura and Logan, nothing makes you go 'oh, that was nice'.Very early on in the film, I got huge John Wick vibes. The action was very reminiscent of those films. It was fast, it was brutal and graphic, and it wasn't afraid to show everything. Indeed, you got the sense that Mangold was trying to find more and more interesting and gory ways to kill people. Something that the John Wick franchise also does. This comparison between John Wick and Logan is nothing but a positive one. If you ask me, the John Wick films are some of the best action films to have come out in recent years, as is Logan.Where Logan really shines though, is not in the action, but in the story of Logan. It's a depiction Logan that I think a lot of people have wanted to see. Although I'm by no means an expert on the comic books, I have always had the feeling that Logan is a much more complex and difficult character than the previous X-Men or Wolverine films have led to believe. Logan is just as brutal with its depiction of the character as it is with its action.Logan really should be used a case study on how to do a comic book film. The only problem it faces is its R rating. I absolutely loved the rating as it allowed the film to go as dark as it needed and wanted to go. But comic book movies are, of course, supposed to be the highest-grossing films studios make, and an R rating will automatically lower revenues.If you have been looking for a comic book film that isn't just like all the previous ones, Logan is the one for you. As mentioned, it is brutally honest and gritty, and the action is more brutal than you would ever dare to expect. It's a fantastic action film but it also manages to create such an impressive story that you will find yourself amazed with the depth of it. Is it my favourite comic book movie ever? No. But is it easily one of the best ones? Absolutely."
    },
    {
      "username": "TheJediWay9",
      "userUrl": "https://www.imdb.com/user/ur19556601",
      "reviewLink": "https://www.imdb.com/review/rw3652037",
      "warningSpoilers": true,
      "date": "2 March 2017",
      "rate": "10",
      "helpful": "651 out of 932 found this helpful.",
      "title": "Brutally violent, emotional, and character-driven, \"Logan\" is the Wolverine film fans have been waiting for",
      "content": "\"Logan\" is directed by James Mangold and stars Hugh Jackman for one final go around as Wolverine. With an R Rating secured, something the previous two Wolverine films should have had, \"Logan\" was bound to be fantastic. It wasn't fantastic. It was phenomenal.If you are going into \"Logan\" expecting every scene to just be Wolverine tearing people to shreds you'll be thoroughly disappointed. This is definitely not an action film. There are action sequences in the film, but they are not the main focus of the movie like the previous 2 Wolverine movies tried to make them be. \"Logan\" is a grounded film, a film that really takes its time to tell its story and to develop its characters. It's a character-driven film, and it probably has the most characterization in an X-Men film to date. We get enough of Wolverine's backstory within the first few minutes to really become attached to him (if we already weren't). We learn more about Professor X and what he has been doing, and then there's this little girl, who probably should be annoying, but luckily isn't and that was a sigh of relief. This girl, Laura, is the star of the show. It is really \"her\" movie. All of the sequences with Laura were riveting. There was that sense of mystery to her character that you wouldn't really expect from a film like this. You don't ever really know what her next move is going to be. Her motivation to find a safe haven is so well felt in this film that it just brings you a sigh of relief that there is still a sense of good out there in the world of this film where everything seems dark, bleak, and hopeless. Hugh Jackman's performance. Yeah the dude gave it his all. This is by far Hugh Jackman's best performance as Wolverine. We've never seen Wolverine this vulnerable. He's old, he's broken down, he's beaten. He can't heal like he used to. The conviction from Hugh Jackman in this movie was just spot on and really captured the ways Wolverine felt at certain moments. It added layers to this film. When Wolverine gets into a fight, Hugh Jackman is so good in these scenes it's like he got into a fight with the filmmakers on set.This film does not hold back from a violence standpoint. From the get go, you know what type of movie you are in for. It is brutally violent, by far the most violent X-Men film w have gotten. Wolverine hacks, claws, and slashes his way through skirmishes with blood, guts, and gore flying. If this is what you had always wanted from a Wolverine movie and haven't gotten it up to this point, well this movie gives you all of that. From a violence standpoint, the violence is there when the film calls for it. It is not violent for the sake of being violent. This is a film that puts its characters and story first before anything else, with violence being a secondary element to help propel the story along and to create tension. It is in the scenes where it should be. If this were just an all-out 2 hour and 20 minute \"hack-and-slash\" fest this film would have no depth to it. It would look cool, but giving Hugh Jackman the proper sendoff was what was more important in a film like this.This film at times gets downright emotional. The final scene of the film makes you wanna cry. You care about these characters, you are invested in them. You don't want to see them put in harm's way. Even in the scenes where the film may feel a bit slow, the final act of the film is the payoff. This is where everything really meshes together with a force, creating a pulse-pounding, edge of your seat final sendoff for Hugh Jackman as he retires from the role. This is by far the best Wolverine movie and possibly the best X-Men movie to date. I haven't decided yet. It's up there, and it deserves to be. Everything payed off in this film. It is emotional. It is character driven. It has heart. It is emotional. This is everything anyone could have wanted in a Wolverine film.From me \"Logan\" gets a perfect 10/10."
    },
    {
      "username": "trublu215",
      "userUrl": "https://www.imdb.com/user/ur28528605",
      "reviewLink": "https://www.imdb.com/review/rw3646854",
      "warningSpoilers": false,
      "date": "23 February 2017",
      "rate": "10",
      "helpful": "507 out of 787 found this helpful.",
      "title": "If there was ever a comic book movie deemed worthy of perfect, Logan is it.",
      "content": "The word 'perfect' is very objective especially when it comes to film. While Logan may not be a perfect film, it is most certainly a perfect comic book film. It is a masterpiece of the most epic proportions and leaves us with a brilliant swan song for producer and star Hugh Jackman in his final outing as Wolverine. The film, directed brilliantly by James Mangold, is a two plus hour comic book fan's wet dream as we see the version of Wolverine every fan has wanted to see for nearly two decades. While many will be very sad to see Jackman step down from the role, he couldn't have picked a better or more satisfying film to end his cinematic legacy with.The film takes place in 2029 and shows the world in shambles. Mutants are nearly extinct, water is scarce and the world is just an overall wasteland. This is where we find Logan. He is a limo driving cantankerous caretaker to an even more cantankerous Professor X, who is now suffering from dementia and seizures. He is a borderline alcoholic suffering from a mysterious illness that limits his mutant abilities. Due to this, he lives this quiet life until he meets a young girl who he feels he must protect. Without giving too much away, there is much more here than I can go into but I will say, if you are a fan of the Wolverine comics, this film will bring a tear to your eye. This is probably the most faithful adaptation of a comic book character EVER, Marvel and DC combined. The way the story goes, the way Logan behaves, the selflessness and the rage, this is an all around realized version of this character. While it may have taken a little longer than it should have, this film was worth the wait. James Mangold does a fantastic job at creating the world Logan knows now. This is more of a film like Mangold's 3:10 to Yuma. It is bleak, violent and absolutely heartbreaking. This is far from the PG-13 character we're used to. This is a foul mouthed, miserable and very VERY bloody rendition of the source material. This is a film very much like The Guantlet or Badlands, a crime thriller and on-the-road drama. It very much embodies the look and feel of a film from the mid-70s and it plays to this very well. The performances in this film are amazing. Hugh Jackman's performance here is the best as the character and may be one of the best of his career. He is miserable and broken in this film and to see him like this as the character, it is bittersweet especially because Jackman has been so attached to this role. If he hurts, we hurt. If he's mad, we're mad. It is a true testament to Jackman as an actor to make his audience feel this connected to someone who is, by traditional standards, completely unrelateable. Boyd Holbrook brings a sinister performance to this and continues to build a very impressive resume. Holbrook is someone who you'll love to hate. The real standout performance here is from Dafne Keen who plays Laura. Without giving away any spoilers, she is BADASS in this film and even gives Logan a run for his money on the brutality.Overall, Logan is a perfect comic book adaptation that is as heartbreaking as it is visually stunning. Mangold and Jackman create a special film with this that should be talked about for years to come. Believe the hype, Logan is a seriously amazing comic book film that just may be the best ever made and embodies the definition of a perfect adaptation."
    },
    {
      "username": "shawneofthedead",
      "userUrl": "https://www.imdb.com/user/ur48490287",
      "reviewLink": "https://www.imdb.com/review/rw3650637",
      "warningSpoilers": true,
      "date": "1 March 2017",
      "rate": "9",
      "helpful": "282 out of 473 found this helpful.",
      "title": "A fine, fitting farewell to an iconic character, LOGAN is one of the best superhero movies ever made.",
      "content": "Let's cut to the chase, shall we? In every beat, every frame, every moment, LOGAN feels like the Wolverine movie Hugh Jackman has been waiting (and training) for 17 years to make. Set free of a PG rating, this wildly kinetic film has plenty of gore, action and violence pumping through its veins. But what makes this one of the finest superhero movies ever produced is the big, messy, somewhat broken heart beating at its core. Set in a grim near-future where very few mutants remain alive, we meet an unthinkable incarnation of our favourite enclawed superhero: one who's decidedly past his prime. This is not the near-immortal Wolverine we remember, but Logan (Jackman): a broken, far older man who feels the weight of every wound inflicted upon him. His once- formidable body – tattooed with scars that aren't healing as fast or as well as they used to – seems to be failing. It's only his determination to keep the ailing, ageing Professor Charles Xavier (Stewart) safe and alive that never falters. The film's plot kicks into overdrive when Logan's fate becomes entangled with that of Laura (Keen), a close-to-feral young girl who brandishes claws and fury as fierce and lethal as Logan's own. As the unlikely trio go on the run, we see echoes of Logan himself in Laura's terrifying rage and the tentative emotional connection she forges with Xavier. It's one of many smart moves on the part of James Mangold, who does double duty as director and co-writer. Bringing Laura into the picture allows him to explore Logan's trauma, regret and hope through the filter of this pint-sized powerhouse's origin story.In effect, Mangold has placed an intimate family drama squarely at the heart of this ostensible blockbuster film – strip the characters of their superpowers and LOGAN would still pulse with plenty of heartbreak and humanity. Logan keeps dragging himself through the world when one suspects all he wants to do is die. Xavier grapples with his own frailty as his once-sharp mind deteriorates and betrays him, again and again. Laura is a tough, tender mess of contradictions: a victim of horrific abuse but also a warrior in the making. Watching them interact – fighting, screaming, arguing, glaring and, once in a while, forgiving – will elicit laughter and tears (lots of tears), in a way that no other superhero film to date has quire managed.That doesn't mean, however, that LOGAN is an entirely joyless, sombre affair. Far from it. It proves, quite conclusively, that films in this genre can plumb the darkest of psychological depths while finding welcome ways to leaven the misery. (Note: this is something Zack Snyder would do well to learn as he continues to expand DC's largely mirthless cinematic universe.) Mangold threads moments of genuine humour into the proceedings – from casual shoplifting and runaway horses, to an ornery old man who refuses to take his pills. The fast and furious action beats in LOGAN are also quite delightful to witness. The violence that's on full, bloody display is dark and horrible, but somehow fitting for this film in which there really are consequences for battles fought and lost. It's only when you see Logan's claws plunging into flesh, shearing cleanly through meat and bone, that you realise just how neutered and family-friendly his earlier outings were. There's a slow-motion sequence halfway through the film, as Logan struggles to get to an embattled Xavier, that's gritty and beautiful to watch – as thrilling as that scene-stealing Quicksilver moment in X-Men: Days Of Future Past. And it goes without saying that watching Laura gracefully spin and slice her way through oncoming attackers manages to be terribly wrong and wonderfully right at the same time. To be quite frank, none of this would work without the incredible cast, all of them doing award-worthy work that will, sadly, be overlooked because their characters have such silly things as 'powers'. It's truly unsettling to watch Stewart dig beneath his natural gravitas to find the shaken core of a Professor X who's semi-consciously losing grip of his mind – the best and most dangerous mind in the universe. Keen is a revelation. Grabbing this breakout role by the throat and making it very much her own, she somehow manages to convey Laura's childish fragility and overpowering strength, often in the same breath. And, finally, there's Jackman. He's been training for and playing the role that catapulted him to global stardom for 17 years now, and he brings everything he has to this final outing as Logan. He nails Logan's physical tics, of course: from his grizzled and aged demeanour, to his rattling cough and copious drinking. But Jackman also takes delight in unearthing the dark sadness at the heart of this once invincible, now vulnerable man. There is a hope and purity in Logan that doesn't always show through his wisecracks, but it shines brightly and unexpectedly here – often in the film's saddest moments. There are a handful of things about the film don't work quite so well. The main antagonists, played by Richard E. Grant and Boyd Holbrook, are largely forgettable – there's not much that defines them outside their nefarious goals. As many viewers may be turned off by Logan's relentless misery and eye-popping violence as those who welcome it.But this doesn't detract from the fact that LOGAN is a remarkable achievement. It manages to be several things at once: a bruising action film, a tender family drama and an intimate character study, liberally shaken through with comic-book sensibilities and a Western or two. If Jackman really is hanging up his claws for good, there could be no better way to bid farewell to one of Marvel's most enduring and appealing characters."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw3772487",
      "warningSpoilers": false,
      "date": "5 August 2017",
      "rate": "10",
      "helpful": "67 out of 115 found this helpful.",
      "title": "The Last Cut Is The Deepest!",
      "content": "SPOILER: Did we need another X-Men movie? In fact did we need another Wolverine movie? Well the result is there for all to see, with Logan not only showing itself to be undoubtedly the best Wolverine venture by far, but arguably the best X-Men picture as well. If, as expected (and surely to god it's hoped so), this is the last we see of the grumpy metal clawed superhero, then what a fitting and triumphant bow out it is.James Mangold, the director, has managed to create an adult superhero movie without it really being a superhero pic, for he has created a film noir Western that happens to be about a superhero. Mangold's love of noir and Westerns bursts from the screen, which for those who follow those wonderful stands of cinema, will come as no surprise having seen with notice his Copland and 3:10 To Yuma redux. There's a perpetual grimness to the narrative that belies the quite often stunning surrounding locales, heavy themes such as men out of time - with destinies written (cue a deft comic book movie within a comic book chunk of metaphysics) - surrogates, mental illness, human ignorance, and on it goes, the narrative strong on intelligence as much as it is in wrought emotion. Western fans will also be buoyed by the part that the 1953 classic Western Shane has to play in things, considerably so as its importance narratively, orally and visually is mightily strong.Logan's Run!Ah yes, well being \"adult\" is all well and good, but is Logan thrilling? Do we get pumped up Wolverine action, blood brains, splatter and mucho muscle flexing and pained roars of anger? Oh yes! Action from the off is never far away, and wonderfully staged and choreographed it is. Lots of memorable set-pieces, while also some cleverly constructed sequences such as Xavier's mind seizures hold court and enthral. Yet the kicker with all that is we are clued in to the emotional baggage that the side-burn sporting protag carries with him. With each fight we sense the bigger picture, even as we watch in awe the emergence of Laura (ironic film noir name right there as it happens) - and her part in this very \"human\" story - the thrills and spills are propelled by a meaningful but battered heart.Tech credits are superb. Acting honours go to Jackman, who after giving 17 years of his life to the character, gives it his all and this multi faceted performance, in a perfect world, deserves Oscar recognition. Patrick Stewart, also, is immense, playing the nonagenarian Charles Xavier with such class, gracefulness and storming emotion that one can only admire. Film debutante Dafne Keen as Laura is utterly engrossing, quite a debut indeed, whilst Stephen Merchant as albino mutant tracker Caliban is effective to the point we hanker for more. Although the villains fronted by Boyd Holbrook (rote henchman leader) and Richard E. Grant (smarmy scientist git) just about pass muster, there's nothing to damage the piece. Cinematography (John Mathieson) is \"A\" grade, the filters set on neo-noir, with the splendid film noir black and white version a fillip for the heart of noir lovers. All that is left is for the sound mix to boom and the director to steer with heart, brain and soul, without doubt both come up trumps.One of 2017s best films, a genre splicer that ticks all the boxes of great film making. 10/10"
    },
    {
      "username": "ACollegeStudent",
      "userUrl": "https://www.imdb.com/user/ur118665987",
      "reviewLink": "https://www.imdb.com/review/rw8433558",
      "warningSpoilers": true,
      "date": "12 August 2022",
      "rate": "7",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Dark unpredictable with a tragic ending.",
      "content": "Rating: 7.9Solid, abnormal superhero film that's unpredictable with high stakes considering everybody dies besides Laura and her friends. There were some minor conveniences like Gabriela recording the evidence on her phone which was somehow unlocked allowing Logan to learn the info about laura he needed. Laura driving seemingly the entire latter half of a 2 day trip to Eden. Laura not being there just when Gabriela got canned when she usually keeps a constant watch on her because she's a mutant (possible professor meddling mind there). The father-daughter dynamic was nice and Logan went out like the hero everyone believed him to be."
    },
    {
      "username": "NpMoviez",
      "userUrl": "https://www.imdb.com/user/ur69508929",
      "reviewLink": "https://www.imdb.com/review/rw5093122",
      "warningSpoilers": true,
      "date": "1 September 2019",
      "rate": "8",
      "helpful": "53 out of 78 found this helpful.",
      "title": "A nice revisionist western ending to Wolverine saga",
      "content": "Wolverine is perhaps the most beloved character from X-Men film series, but his solo outings have been the most forgettable and/or totally stupid. Thankfully, we have Logan to break that trend. Still have issues with it, but I would acknowledge that it was one of the best films in X-Men series.Good : Hugh Jackman gives the most intense and gritty performance as Wolverine in his final film role as the adamantium clawed mutant. I have always loved him as Wolverine, but he has never been so good. Patrick Stewart does the same in his final role as Charles Xavier, and in his part, there's nothing to complain either. Dafne Keen as Laura - owns the film. Loved the kid as baby/lady Wolverine (X-23). The setting feels really different in this movie, compared to those of other X-Men films. It is obvious that they gave a Revisionist Western tone to the movie, which hasn't been done in the genre so far. It acknowledged the fact that it was inspired by Unforgiven, The Wrestler and Shane, which if had not been done, would've made it look like a ripoff. Not a total waste of a film, it has good parts, but still a copied idea without acknowledgement seems bad. Then, there is action. The actions are the best ones in the entire X-Men film series. The choreography is great to say the least. It looks badass, savage and intense. But there's one thing that this film does with action which most action films don't with these days. And that is, have the actions mean something. Every action scene has a purpose. It either sets up a characterization, or aggressively portrays what a character is feeling. Acting, action and the overall story won't disappoint. Also, all the characters are interesting.Mixed : There are some story issues. It feels as if there is a huge story that needs to be told between the altered timeline of DoFP and Logan. We get tiny little expositions for that matter and sound like much more interesting ideas for a better X-Men Apocalypse movie. This made the largely different characterizations feel totally out of place, for both Xavier and Logan. It works for the movie, I like it, but I don't buy it. It felt a lot out of the place and quite confusing with why they were so different. With all the movies in the series, I don't think they have given all the character development necessary for those changes.Bad : Mostly, it's the villain and some logic issues. There's a video narration/exposition which looked professionally edited with great voiceover, but was by a nurse who didn't even have 12 hours to do it, keeping aside the resources. Xander Rice doesn't feel so good of a villain. Nothing to blame Richard Grant, but just not a compelling villain. X-24 does have a frightening presence, I acknowledge that. But all his likeability depends upon the character arc of Wolverine over the years. Just take out the \"humane\" part of the character of Wolverine, and replace it with Terminator's menace. You'll get X-24.Conclusion : It's a good goodbye to Hugh Jackman as Wolverine. You can get the unpleasant satisfaction of seeing him die, and it does hit emotional notes a number of times and feel really saddening. But there are story and characterization issues which cannot be overlooked and to be honest, do not make a good sense.Rating.Score : 8.2/10Grade : A-"
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw3689938",
      "warningSpoilers": true,
      "date": "21 April 2017",
      "rate": "9",
      "helpful": "163 out of 259 found this helpful.",
      "title": "Say goodbye to Hugh Jackman...",
      "content": "When Logan heard that his comic book would work in a similar way, my expectation was a little more. Later Logan's first trailer ended me. The tone of the trailers, the selected music, the intensity of the emotion was superb. I did not get my eye from X-23 in action scenes. Very good performance. Sir Patrick Stewart, like Hugh Jackman, is the last time to portray the role of the X-Men in the universe. And gave a very good feeling and left the film with more drama.Logan, beyond his superhero films, a fickle old and sick man. He is constantly showing the struggle with himself. Unlike other films, violence and action are not adorned with visual effects, they are given in a very hard and realistic way. These old mutants are trying to save the children to make the world a better place.It's an action that will be an Oscar nominee from Hugh Jackman. Logan, it's a goodbye we cannot forget for a long time. 9/10"
    },
    {
      "username": "badmanlykme",
      "userUrl": "https://www.imdb.com/user/ur70065758",
      "reviewLink": "https://www.imdb.com/review/rw3641938",
      "warningSpoilers": true,
      "date": "18 February 2017",
      "rate": "10",
      "helpful": "582 out of 876 found this helpful.",
      "title": "Logan is everything you wanted it to be and more",
      "content": "Logan is the 2017 movie everyone has been anticipating after two great trailers and a R rating it delivers a surprising amount of heart to characters we have grown to love and know and also balancing a surprising amount of action within the first and third act climax, its violent but not blood for blood sake every cut is with reason.Logan presents us with Logan (Wolverine), Professor X and Laura (X-23) and by definition its an escort mission involving X-23 but shes more capable than Logan and Professor X thinks and shes able to fend for herself. Logan is old and a grizzled shadow of what he once was and by going on this mission he unlocks some of the old wolverine inside of him and we see bursts of that throughout the movie, Logan also begins to realize things about himself through the vision of this little girl because they have striking similarities.Every scene in this film feels necessary from the character development to the humor and action nothing is forced everything comes off natural which is a breath of fresh air and I was very pleased with it, I believe that this movie will be very well received by fans as it treats its characters with such care and embarks on an emotional and satisfying conclusion to Hugh Jackmans Logan (Wolverine)."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6332683",
      "warningSpoilers": true,
      "date": "3 December 2020",
      "rate": "9",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Logan",
      "content": "The best X-men movies and the little girl character were excellent, Hugh Jackman was the best in the movie, I saw Logan bury Charles and it was so sad that Logan's death made me cry. The action scenes in the movie were excellent"
    },
    {
      "username": "Ramascreen",
      "userUrl": "https://www.imdb.com/user/ur12230254",
      "reviewLink": "https://www.imdb.com/review/rw3644538",
      "warningSpoilers": true,
      "date": "17 February 2017",
      "rate": "10",
      "helpful": "159 out of 293 found this helpful.",
      "title": "A character-driven superhero film done right!",
      "content": "LOGAN is brutal, merciless and powerful. This is a character-driven superhero movie done right. I would even dare to say it's better than many of the previous X-Men installments and spinoffs. And if this is indeed Hugh Jackman's final Wolverine movie, then my goodness, what a helluva way to go out in a blaze of glory.The story is set in the near future, mutants are thinning out. They've either died or been hunted down. Logan's (Hugh Jackman) healing power is not as strong as it used to be. He's old and weary and taking care of professor X (Patrick Stewart) in a hideout on the Mexican border, accompanied by Caliban (Stephen Merchant). But their attempt to hide from the world gets interrupted when dark forces arrive at their doorstep looking for a certain young little girl.Great move on the studio's and filmmakers' part to have this film be rated R because what we get here is Wolverine unleashed. The violence is as graphic and fully exposed as you can imagine it to be. So just that aspect alone will excite the fanbase who's been wanting to see the destruction that could take place when Wolverine is really really angry. Setting it on the border does allow the film to play with certain tones and color palette reminiscent to \"Breaking Bad\" for example, the film's ending however does provide a more vibrant environment as a base for an extremely bloody collision.The writing is solid for a superhero film, it really digs deep into these beloved characters, how vulnerable they are, how they long for a world where people would just leave them be. You truly feel for Xavier and Logan in a way that you never did in the previous X-Men movies, not only because they're now in their twilight years but there's also that father-son type of relationship that's tough love and endearing and then there's also the reluctant father daughter connection Logan has with X-23. By the way, the little girl, Dafne Keen, who plays X-23 is remarkable. So much force, so much energy, so much roar, she's like a cheetah that just runs and slices and dices left and right without prejudice, what an incredible young talent. This is a movie that gives you action to its fullest degree and an emotional journey that's uncompromising. The perfect film about the man who's the best at what he does but what he does isn't very nice."
    },
    {
      "username": "GomezAddams666",
      "userUrl": "https://www.imdb.com/user/ur59148101",
      "reviewLink": "https://www.imdb.com/review/rw3649984",
      "warningSpoilers": false,
      "date": "27 February 2017",
      "rate": "9",
      "helpful": "199 out of 373 found this helpful.",
      "title": "Knocked it out of the park",
      "content": "LOGAN - SPOILER FREE REVIEWAs most of you are aware I have not been a huge fan of the latest X- Men outings, but THIS WAS AWESOME!In a rather bleak entry we see a Post X-Men Logan, something has happened and the mutants no longer exist or there is a few of them out there. Director James Mangold chose to make the film almost colorless with much, much more character development than previous Wolverine and X-Men movies. We see a tired character that no longer belongs in a world that has feared him for over a century.While Hugh Jackman in his last outing as Logan does an amazing job and proves once and for all why NO ONE ELSE can ever be Wolverine, the supporting cast does a superb job as well starting with Sir Patrick Stuart who returns as Charles Xavier, Boyd Holbrook (Netflix's NARCOS) as an astounding and dangerous antagonist and newcomer Dafne Keen who is a rather sweet but incredibly deadly Weapon X-23.The movie is filled with gore and violence, but it does not feel forced at all in such an obscure movie. There is a rather new trend in Comic Book Movies after DEADPOOL, make them as brutal as possible, and while this started in the 90s with THE CROW and BLADE it has gained some track and more R Rated CBM are being developed as we speak.I HIGHLY recommend it."
    },
    {
      "username": "tavm",
      "userUrl": "https://www.imdb.com/user/ur11228318",
      "reviewLink": "https://www.imdb.com/review/rw3662894",
      "warningSpoilers": false,
      "date": "15 March 2017",
      "rate": "10",
      "helpful": "23 out of 39 found this helpful.",
      "title": "Logan is a more than excellent final chapter of the Wolverine saga!",
      "content": "Just watched this with my movie theatre-working friend who had previously seen this several times before. He must have liked this a lot if he agreed to watch it again with me as a first-time viewer. Indeed, this was quite different from many previous Hugh Jackman/Wolverine movies as it's a bit more intense and a little more explicit in language as well. This time, it's a future timeline in which he has to take care of a somewhat sick Charles Xavier (once again, Patrick Stewart) in some desert town while he works as a limo driver. Then a woman asks for his help which he at first refuses before a mysterious little girl appears. I'll stop there and just say this was quite a dramatically compelling narrative with plenty of exciting fight scenes along the way. So on that note, me and my friend highly recommend Logan."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3746775",
      "warningSpoilers": true,
      "date": "5 July 2017",
      "rate": "8",
      "helpful": "20 out of 35 found this helpful.",
      "title": "bloody hardness",
      "content": "It's 2029. Mutants in America have been hunted to almost extinction. Logan (Hugh Jackman) is a dying drunk and driving a limo. He is caring for Charles Xavier (Patrick Stewart) who is losing control of his powers and his sanity. Logan is approached by Gabriela for help to care for a little girl named Laura. They're on the run from a corporation which created Laura and other mutant children to be super-soldiers. Its thugs are looking to recapture the escaped subjects.The movie is hard and bloody. It mines the well-worn relationship between Logan and Professor X bringing a feral little girl into the mix. The connection is ingrained. It takes the superhero joy of violence and makes it brutal. I would have liked a little more jokey humor between odd couple Logan and X. Overall, it's good bloody brutal violence with a familiar relationship and some new ones."
    },
    {
      "username": "Horst_In_Translation",
      "userUrl": "https://www.imdb.com/user/ur3914439",
      "reviewLink": "https://www.imdb.com/review/rw3674202",
      "warningSpoilers": true,
      "date": "30 March 2017",
      "rate": "8",
      "helpful": "14 out of 23 found this helpful.",
      "title": "Logan the Personal",
      "content": "Let me start by saying that \"Logan\" is my first favorite movie from 2017. And let me continue by saying that you should not read this review if you have not seen the film yet as it will be full of spoilers to an extent where the normal message up there is not enough and I would like to put special emphasis on this. Now lets go: James Mangold returns from the 2013 film \"Wolverine\" here and I think he did a really good job as this film never drags despite a runtime of over 2 hours and 15 minutes. It's probably still not my favorite from him (\"Walk the Line\"), but this should not take away anything from his effort. You will not really see too many familiar faces in this one except Jackman and Stewart. As for Stewart, there is one quote from him about mortality and this is a theme that fits the entire movie. Everybody keeps dying here, the good guys, the bad guys and the longer it goes the more you wonder if Logan will get out of it alive. The wolf has gone gray and he only has two friends left with whom he is arguing all the time. For example what I just said also applies to an innocent family of Black people and the dad is a perfect example of how hate towards the mutants is fueled, even if you cannot blame Jackman's character really for anything that happened to this family. It's all humans causing it with their decisions.This film has many parallels to other quality films like Léon The Professional (check my review title), Mad Max, Children of Men and this reminded me repeatedly of the child soldiers from the James Cameron television show \"Dark Angel\", a personal favorite. The \"Logan\" title cannot be coincidence right? Holbrook also reminded me a bit of Ames White with the Nazi-resembling race references, but if you know DA, you will see the similarities in general. Anyway, for fans of this series, it's probably the closest we're ever getting of a Dark Angel film with Cameron focusing on all these Avatar sequels right now. Now back to \"Logan\": If there is anything negative to say about this film, then maybe that the child soldier reference was not always working, but still this one also provided really touching scenes at the very end of the film and honestly the X grave was a stroke of genius and a perfect final shot. Also kinda fitting and cool that he can only be killed by his alternate self. It was a sad ending, but also an uplifting one with the next generation of mutants (and with the girl Wolverine left us) going out into the world. Johnny Cash song during the credits doesn't hurt either. Oh yeah and the pain from Stewart's character's brain was done so well you could feel it even in the theater. It is certainly a pretty depressing movie, but this also makes it really authentic I believe. There are very rare moments of situational comedy in there, like the fat kid being too fat to run and gets caught, but it's nowhere near the surface. This film delivers in 10 other areas much more than in comedy.I think I have only seen the very first X-Men film apart from this one here, so even as somebody who is not a fan of the series (but likes superhero movies), it's easy to appreciate this one. Huge fans will probably love it. I think it is impressive how this series is still going so strong after 20 years almost and it was the perfect decision back then to cast the entirely unknown Hugh Jackman for the part as he is a vital ingredient why this film was such a triumph, with critics as well as audiences. I like him a lot and I am certainly biased, but it's hard to disagree with his craft after seeing this movie. Will there be another? Unlikely. I just hope that the fate of Wolverine's character does not go in hand with the fate of Jackman's as you keep reading so frequently about his fight with skin cancer. \"Logan\" also includes a great deal of action which was among the more forgettable parts for me, but there's enough people who like it, so it's all good. And after all with this runtime, people like me also get a great deal of character development and drama besides the special effects. So there are more reasons to see this film than I could actually mention here. You totally do not want to miss out. Check it out now!"
    },
    {
      "username": "UMWolvie2442",
      "userUrl": "https://www.imdb.com/user/ur3305531",
      "reviewLink": "https://www.imdb.com/review/rw3642010",
      "warningSpoilers": false,
      "date": "18 February 2017",
      "rate": "",
      "helpful": "379 out of 652 found this helpful.",
      "title": "Just A Flat Out MASTERPIECE!",
      "content": "Holy Cow! We've finally got the Wolverine movie we've all been waiting for and then some! Mr. Mangold has nailed the character and the action, and Hugh Jackman is truly a part of a Wolverine movie that has showcased the true character that the fans had hoped to see full on. Yes, we've seen superb runs and flashes but nothing this deep or this epic.How could any movie fan in general not just adore this film? It brought elements of a lot of great genres. Logan has to be considered genre-defining. The characters, action and story were all beyond outstanding in this movie. We are taken for a ride and can relate to Logan once again. The acting is superb and the dialogue is perfect for the level of each character. Every single character feels believable. You follow the story through Logan's eyes and what a ride it turns out to be. This movie is emotional and moving in every single way that matters and is unique and is as far away from anything X-Men we've seen before. In this case, that's a very good thing. The fight scenes and pace are superb. I honestly could see Oscar nominations here on multiple fronts.This movie is sophisticated and delivers a grand, tragic story. The action fits in nice but serves the story first. Unlike other \"dark\" films, the tone is perfect and fits the character. The supporting characters are utilized in a comprehensive and cohesive manner and are wonderful in and of themselves. I loved everything about this movie and they left it as if this was the perfect end to Hugh's run."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3754433",
      "warningSpoilers": false,
      "date": "15 July 2017",
      "rate": "8",
      "helpful": "18 out of 31 found this helpful.",
      "title": "Re-tiring",
      "content": "The Wolverine movies did not have much luck. While we got used to Hugh Jackman and his performance will be burned in our heads, the stand-alone movies never really stood out that much. Well that is until Logan came along. And Logan has another member of the X-Men family in it, portrayed by Patrick Stewart in this case. And while Logan/Wolverine does not age, both are retired.A broken down Logan takes care of his former mentor and Professor at the Mutants Academy/school. Especially the Professor has lost a lot of his power (no pun intended). Those two are forced (you could have guessed that even without seeing the trailer) to go on one last road trip. And they have to because of a young girl. And while Logan seems not to care, circumstances do not leave him much choice.There are battles, there is drama and it is one of the best X-Men movies that has been made. There is also a lot of violence. This may be a comic book adaptation, but it certainly does not shy away from the brutality of its source. And this rawness helps it elevate, helps it become even more emotional, in more than one instance. Set in the future this is a good movie to end the Wolverine .... Trilogy"
    },
    {
      "username": "bryank-04844",
      "userUrl": "https://www.imdb.com/user/ur60255714",
      "reviewLink": "https://www.imdb.com/review/rw3641403",
      "warningSpoilers": true,
      "date": "17 February 2017",
      "rate": "9",
      "helpful": "121 out of 238 found this helpful.",
      "title": "'Logan' is the 'Wolverine' film we've always wanted!",
      "content": "For decades now, we have been clamoring for a 'Wolverine' film done right. From his first incarnation in Hulk #181 to his own miniseries in comic book form in the 1980's by Frank Miller, to the amazing Saturday Morning Cartoon, and his first appearance in a feature film in 2000 with 'X-Men', which had the song and dance man Hugh Jackman play the iconic character. He was so good at playing Logan/Wolverine, that fans immediately took a liking to him as that character and he went on to play the 'Snikt-y Snikt' character in almost a dozen more films. Besides the 'X-Men' films, Wolverine got his own set of standalone films, which may or may not have been liked by a lot of people for various reasons. Either the story was too silly or the character Wolverine was to PG for fans.If anyone knows the Wolverine character, it's that he's a brutal, violent, hardcore rated R character, which is something we haven't seen in cinema form at least. That is until now with James Mangold's new film 'Logan', which is very much an R-rated movie, complete with blood, ultra-violence, nudity, and vulgar language. It's everything we've always wanted in a Wolverine movie – FINALLY! With the past three X-Men films, we've seen our favorite X-Men characters growing up as it served as the prequel to the 2000 film. 'LOGAN' is set in the year 2029 and the world has changed for the worst, at least for a mutant friends. This is a very bleak, dark, and violent film with some flashes of dark humor. Nobody is doing well in 2029 here, particularly Logan (Hugh Jackman) who has crawled inside a whisky bottle and has never came back out, with the exception of driving a limo for cash around town. He's old, mean, and his body is starting to fail him. When he's not driving or killing people, he takes care of Charles Xavier (Sir Patrick Stewart), who is suffering from seizures and dementia, and who lives in a rusted out, abandoned water tower. Life is not good here for anyone.Meanwhile, a little girl named Laura (Dafne Keen) crosses paths with Logan who seems to have the same abilities as the Wolverine himself. Logan is now charged with the task of transporting this little girl to a safe haven with Charles in tow, as a group of bad guys are after her, led by Dr. Zander Rice (Richard E. Grant). It's a fairly straight forward story and it takes its time setting up these older, dying characters, as well as its new ones. 'LOGAN' doesn't mess about with side tangent plot lines or love interests here. It's balls-to-the-wall, heart breaking action and drama, which is something we've wanted for a long time now with the Wolverine character. The script is written by Scott Frank ('Get Shorty, 'Minority Report') and Michael Green ('Heroes', 'Gotham'), which these two writers have expertly added in a fair dose of emotion into these characters, but never back pedal into past films. It was a breath of fresh air. James Mangold certainly was influenced by some of his favorite old western films, as can be seen in some of camera shots, which are just fantastic.Also, if you ever wanted to see Wolverine go berserk, you'll finally get that here on more than one occasion, complete with some long shots of Wolverine slicing and dicing the bad guys without any cuts. Simply amazing. In the past films, we've seen the characters Professor Xavier and Wolverine rather smart, witty, and put together for the most part. That's not the case here. These two characters are very sick and are not doing well mentally and physically. Jackman and Stewart give award worthy performances here, which might bring a tear or two down your face. It's that good. Newcomer Dafne Keen as Laura was also fantastic and very believable in every second she's on film. 'LOGAN' runs at about 135 minutes, which can seem a bit long, but everything is necessary here and for good reason. 'LOGAN' is the Wolverine film we've always wanted and it deserves some high recognition."
    },
    {
      "username": "templar77099",
      "userUrl": "https://www.imdb.com/user/ur57467954",
      "reviewLink": "https://www.imdb.com/review/rw3728974",
      "warningSpoilers": false,
      "date": "12 June 2017",
      "rate": "8",
      "helpful": "75 out of 129 found this helpful.",
      "title": "Logan is another level",
      "content": "The best X-Men film alongside First Class. It felt gritty, it felt real with a sense of dread and hopelessness you don't often see in this comic-book blockbuster adaptations. It should be praised for doing things differently and really pushing the edge with what can or can't be done in the genre. The triangle between Logan, Charles and Laura works as the driving force of the plot, and is very well developed. Logan's character arch is quite pleasant to watch, though obviously predictable. With that said, the acting is clearly masterclass. You can feel the dilemmas, the emotions and feelings that the characters are put through, specially those three. And another thing it does really well is alluding to a previous event - the Charles incident - but never fully explaining it to the audience, leaving you wondering. The action is nothing like you'd expect from a tenthpole - the R rating really makes up for wonders - being quite visceral and impactful. \"Logan\" probably deserved a better villain, although one could argue that the real villain here is not the typical multinational corporation, but the inner demons of the characters. Demons that prevent them from living albeit normal and somewhat stable life."
    },
    {
      "username": "Her-Excellency",
      "userUrl": "https://www.imdb.com/user/ur67432377",
      "reviewLink": "https://www.imdb.com/review/rw3664084",
      "warningSpoilers": true,
      "date": "17 March 2017",
      "rate": "6",
      "helpful": "325 out of 674 found this helpful.",
      "title": "Such a sad farewell.",
      "content": "I really can't get how in the world people are rating this movie as highly as they are. You would think they have never seen this done, and done better.Yes, I understand that Logan is a heartfelt character dear to us, but THINK people! For that very same reason we should be holding this movie to a higher standard, and not giving it an emotional pass.To, me, this film was slow and depressing a-la No Country For Old Men, without ANY of the Oscar-worthiness. It was just droll, SUPER PREDICTABLE, moronic in its' execution and so very far-fetched. (Yes, imagine saying 'far-fetched' for a movie based on a comic)! They spun and bent a bunch of things to get them to where they were in the year 2029 and tried to make it believable (it wasn't). Then, they try to impress upon your heartstrings Logan's connection or ties to the little girl, but the connection or ties are SILLY at best. Not only the supposed ties between them are silly, but the entire plot is full of silly holes.Not SILLY, you say? Let me get this straight ... you are trying like hell to get away from the bad guys, and ummmmm, you STOP FOR A MINI VACATION - not ONCE, but TWICE, and put hundreds of strangers in jeopardy the first time, and a nice family in danger the second time? Yeah, sure. Seriously, anyone who could get over that gaping ridiculousness and who can, after that, in good conscience give this movie anything above a 6 is just messing with you or has total fan-boy blinders on. As for the little girl, god, she was annoying and aggravating AF and 80% of her screen time was spent shrieking. Nooo, not screaming. SHRIEKING.The rest of the acting was good. The members of the family they added as filler in the middle of the movie were the only ones IMO that you kind of cared about. Even old Professor X had seen better days and you kind of wanted it to be over for him. It was just painful to watch, and I don't mean in a moving way where the film is made better, but in a painful oh god, kill him off already way.*** BIG SPOILERS BELOW *** DO NOT READ IF YOU HAVE NOT SEEN THE MOVIE OR ARE PLANNING ON SEEING IT!!!The ending was unreal in how bad it was. Without giving too much away ... you have one little girl who is able to take out like 10-12 guys, PLUS you have Wolverine, PLUS a BUNCH of other mutant kids who have varying degrees of mutant abilities, and yet they can't take out a small group of bad guys? W T H ?As for Hugh Jackman, he was good and played Logan like he always has done except maybe this time he looked older and more tired which was a good thing because it translated unto the screen and gave Wolverine some credibility. Otherwise he was just there. The gushing over his acting this time around IMO is unwarranted, as he really didn't do anything that much different than he has on every other X-Men movie and if anyone disagrees, I defy them to point out what. Props also to the action in the film, and to how it was filmed. The action scenes alone are what I imagine 'made' the movie for most people. All in all, I wasn't impressed. Don't get me wrong - it wasn't a horribly BAD movie, I just don't agree that it was very good and I really don't agree with the overrating or the assessment that it is in ANY way a \"masterpiece\". If you look at it just on paper, you would think that the people that are reacting to it in such a way have ONLY EVER watched comic-book movies in their lives and have now seen a drama sold as a comic-book movie and their brains are exploding as they process it as innovative and different.In closing, I understand that Hugh Jackman is getting older, and the great dilemma was 'how exactly do you keep making movies with an actor who is aging, playing a character who is supposed to rejuvenate or heal'? You don't. You kindly retire the character, as the creators of the franchise have chosen to do. The thing is, they could have really made it to where it wasn't SO depressing and/or bleak with no real outlook toward the future except a bunch of kids you are NOT at all INVESTED in, or care one iota about. A bad ending for a good character, was just bad cinema. RIP Logan. hopefully, at some point you will miraculously resurrect so that you can be given the farewell you deserve. My actual rating is 6.5-7/10, but some reviewers have gone over the top crazy with the 10s."
    },
    {
      "username": "slicedbread117",
      "userUrl": "https://www.imdb.com/user/ur26777495",
      "reviewLink": "https://www.imdb.com/review/rw3723404",
      "warningSpoilers": false,
      "date": "4 June 2017",
      "rate": "10",
      "helpful": "87 out of 161 found this helpful.",
      "title": "Here's to 17 Years",
      "content": "Without question, this was Hugh Jackman's movie, from start to finish. No matter how you view it, or who the mantle is passed onto next, Jackman will forever be Wolverine, and this film proves it once and for all. Logan dives deep into the hearts of its viewers, twisting and turning until every emotional string is pulled, and in the end, delivers a superhero film like no other before it; a perfect swan song.Logan heavily, and fittingly, borrows from Marvel's iconic 'Old Man Logan' comic to tell the story of a grim and desolate future, where mutant-kind is all but extinct. Director/writer James Mangold was finally given all the tools necessary to tell a truly compelling Wolverine story, and arguably the biggest tool in the box was the 'R' rating. It pushes the film into an extremely dark and forbidding tone, which helps carve the movie into one of immense intensity and emotion. The 'R' rating, of course, also allows for studious amounts of gore and profanity, but those elements don't feel like they were added just because they could be, they only added to the atmosphere Mangold created for this film, and in turn helps set the narrative to be nothing short of enthralling. The pacing is spot on, the dialogue is stellar and the emotional weight is that of a moving mountain. I applaud Mangold for his brilliant writing, and subsequent directing, as he was at last able to produce the Wolverine story every fan has been craving for the last 17 years, one of raw emotion, brutality and pure magnificence.Hugh Jackman has devoted the last 17 years of his career to this beloved character, and now, he leaves it all on the table, giving the performance of a lifetime, one which could seriously garner some looks at an Oscar nomination. The writing of the characters, Wolverine specifically, stand out the most in the gritty setting, because few superhero movies have ever done what Logan is able to do; make the characters vulnerable, make them real and to make you truly care like never before. Wolverine is worn down and beaten, looking for a way out, and Hugh Jackman gives you every reason to want to feel for his character. His action scenes are nothing short of powerful, none more than his final, and the emotion he displays in every aspect is worthy of an award-winning performance. I genuinely cannot express my praise for Jackman enough, he gave it is all.Wolverine is accompanied by two spectacular supporting characters for most of the film in franchise favorite Professor X and the ferocious X-23. Both characters add tremendous layers of depth to both Wolverine and the film as a whole, with exceptional performances from Patrick Stewart and youngster Dafne Keen, who's X- 23 is an absolute showstopper. The main villain, Pierce, isn't anything too special, but doesn't have to be in a story like this. The core cast of Wolvie, Professor X and X-23 are what drive the film and the performances by their respective actors are outstanding. The father figure that Professor X is to Wolverine and the subsequent father that Wolverine is to X-23 is a deep, touching addition to their characters. This is no-doubt a character driven film, and with Wolverine in the driver's seat, and a pair of dynamite supporting characters, the ability to connect with these characters is real, and that is a treasure few superhero films have ever held.The film's action is gloriously vicious, showcasing what a hacking from Wolverine or X-23 would actually look like. But it's not just the heavy amounts of gore that make the action so amazing, it's again the feeling that these characters are in true danger and every move they make could cost them their lives, none more than Wolverine himself, whose reduced healing factor forces him into a different mindset that, outside of briefly in \"The Wolverine\", we've never seen before. He's not invincible, and even with X-23's relentless attacks, he still has to play his cards differently, and it translates into an emotional roller coaster. All together the action sequences and sheer amount of violence were a sight to behold, entertaining and fierce.17 years it has been, since we first watched a young Hugh Jackman don his X-Men suit. 17 years of stories, character development, action, hardship, humor and emotion, come together to deliver one final journey. The final scene alone may move you to tears, as Hugh Jackman's time as the iconic Wolverine comes to an end. One final epic masterpiece of superhero cinema; Logan.10/10"
    }
  ],
  "errorMessage": ""
}