{
  "imDbId": "tt0071315",
  "title": "Chinatown",
  "fullTitle": "Chinatown (1974)",
  "type": "Movie",
  "year": "1974",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "A nearly flawless example of movie composition, with close examination revealing how carefully it was put together. For those who take a less studious and more visceral approach to movie viewing, it's also worth noting that Chinatown is a superior thriller - one that will keep viewers involved and \"in the moment\" until the final, mournful scene has come to a conclusion."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "100",
      "content": "[Nicholson's] performance is key in keeping Chinatown from becoming just a genre crime picture--that, and a Robert Towne screenplay that evokes an older Los Angeles, a small city in a large desert."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "A wonderfully brooding, suspenseful revisitation of the land of film noir, Chinatown is not only one of the greatest detective films, but one of the most perfectly constructed of all films."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Ty Burr",
      "link": "",
      "rate": "100",
      "content": "But it's Polanski who pries the genre open until it goes metaphysical."
    },
    {
      "publisher": "Variety",
      "author": "",
      "link": "",
      "rate": "100",
      "content": "An outstanding picture."
    },
    {
      "publisher": "Salon",
      "author": "Andrew O'Hehir",
      "link": "",
      "rate": "100",
      "content": "But the greatness of Chinatown, unappreciated by my adolescent self, lies not in its cynical view of the California dream (that's too easy) but in its fatalistic, even tragic conception of America and indeed of human nature."
    },
    {
      "publisher": "Chicago Reader",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "A bit abstract, though gorgeously shot (by John Alonzo) and cleverly plotted (by Robert Towne), Polanski's film suggests that the rules of the game are written in some strange, untranslatable language, and that everyone's an alien and, ultimately, a victim."
    },
    {
      "publisher": "Village Voice",
      "author": "Jessica Winter",
      "link": "",
      "rate": "80",
      "content": "In 1974 a director, a screenwriter, and a producer (Robert Evans, who for once deserves a few of the plaudits he's apportioned himself) could decide to beat a genre senseless and then dump it in the wilds of Greek tragedy. [Review of August 8, 2003 re-release]"
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "70",
      "content": "Mr. Polanski and Mr. Towne attempted nothing so witty and entertaining, being content instead to make a competently stylish, more or less thirites-ish movie that continually made me wish I were back seeing \"The Maltese Falcon\" or \"The Big Sleep.\" Others may not be as finicky. [21 June 1974]"
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "63",
      "content": "As much as I admire the work of both (Roman) Polanski and (Jack) Nicholson, I found Chinatown tedious from beginning to just before the end. [15 July 1974]"
    }
  ],
  "errorMessage": ""
}