{
  "imDbId": "tt0071315",
  "title": "Chinatown",
  "fullTitle": "Chinatown (1974)",
  "type": "Movie",
  "year": "1974",
  "language": "en",
  "titleInLanguage": "Chinatown (1974 film)",
  "url": "https://en.wikipedia.org/wiki/Chinatown_(1974_film)",
  "plotShort": {
    "plainText": "Chinatown is a 1974 American neo-noir mystery film directed by Roman Polanski from a screenplay by Robert Towne, starring Jack Nicholson and Faye Dunaway. The film was inspired by the California water wars, a series of disputes over southern California water at the beginning of the 20th century, by which Los Angeles interests secured water rights in the Owens Valley. The Robert Evans production, released by Paramount Pictures, was the director's last film in the United States and features many elements of film noir, particularly a multi-layered story that is part mystery and part psychological drama.\r\nIn 1991, the film was selected by the Library of Congress for preservation in the United States National Film Registry as being \"culturally, historically or aesthetically significant\" and it is frequently listed as one of the greatest films of all time. At the 47th Academy Awards, it was nominated for 11 Oscars, with Towne winning Best Original Screenplay. The Golden Globe Awards honored it for Best Drama, Best Director, Best Actor, and Best Screenplay. The American Film Institute placed it second among its top ten mystery films in 2008.\r\nA sequel, The Two Jakes, was released in 1990, again starring Nicholson, who also directed, with Robert Towne returning to write the screenplay. The film failed to match the acclaim of its predecessor.",
    "html": "<p>Chinatown is a 1974 American neo-noir mystery film directed by Roman Polanski from a screenplay by Robert Towne, starring Jack Nicholson and Faye Dunaway. The film was inspired by the California water wars, a series of disputes over southern California water at the beginning of the 20th century, by which Los Angeles interests secured water rights in the Owens Valley. The Robert Evans production, released by Paramount Pictures, was the director's last film in the United States and features many elements of film noir, particularly a multi-layered story that is part mystery and part psychological drama.</p><p>In 1991, the film was selected by the Library of Congress for preservation in the United States National Film Registry as being \"culturally, historically or aesthetically significant\" and it is frequently listed as one of the greatest films of all time. At the 47th Academy Awards, it was nominated for 11 Oscars, with Towne winning Best Original Screenplay. The Golden Globe Awards honored it for Best Drama, Best Director, Best Actor, and Best Screenplay. The American Film Institute placed it second among its top ten mystery films in 2008.</p><p>A sequel, The Two Jakes, was released in 1990, again starring Nicholson, who also directed, with Robert Towne returning to write the screenplay. The film failed to match the acclaim of its predecessor.</p>"
  },
  "plotFull": {
    "plainText": "Chinatown is a 1974 American neo-noir mystery film directed by Roman Polanski from a screenplay by Robert Towne, starring Jack Nicholson and Faye Dunaway. The film was inspired by the California water wars, a series of disputes over southern California water at the beginning of the 20th century, by which Los Angeles interests secured water rights in the Owens Valley. The Robert Evans production, released by Paramount Pictures, was the director's last film in the United States and features many elements of film noir, particularly a multi-layered story that is part mystery and part psychological drama.\r\nIn 1991, the film was selected by the Library of Congress for preservation in the United States National Film Registry as being \"culturally, historically or aesthetically significant\" and it is frequently listed as one of the greatest films of all time. At the 47th Academy Awards, it was nominated for 11 Oscars, with Towne winning Best Original Screenplay. The Golden Globe Awards honored it for Best Drama, Best Director, Best Actor, and Best Screenplay. The American Film Institute placed it second among its top ten mystery films in 2008.\r\nA sequel, The Two Jakes, was released in 1990, again starring Nicholson, who also directed, with Robert Towne returning to write the screenplay. The film failed to match the acclaim of its predecessor.\r\nPlot\r\nIn 1937, a woman identifying herself as Evelyn Mulwray hires private investigator Jake Gittes to trail her husband Hollis, whom she suspects of infidelity. Hollis Mulwray is chief engineer at the Los Angeles Department of Water and Power, and Gittes hears him publicly refuse to build a new dam on safety grounds. Later, Gittes photographs Mulwray in the company of a young woman, and the pictures make their way into the next day's paper.\r\nAt his office, Gittes is confronted by the real Evelyn Mulwray, who threatens to sue him. Gittes concludes that the fake Evelyn was using him to discredit Mulwray. He goes to a reservoir to search for clues but instead finds his old police associate, Lieutenant Lou Escobar. Hollis Mulwray's body had been found in the reservoir, having apparently drowned.\r\nNow working for Evelyn, Gittes investigates Mulwray's death as a homicide. He discovers that although there is supposedly a drought, huge quantities of water are released from the reservoir every night. Gittes is warned off by Water Department Security Chief Claude Mulvihill and a henchman who slashes Gittes's left nostril. At his office, Gittes receives a call from Ida Sessions, who identifies herself as the fake Mrs. Mulwray. She refuses to disclose the name of the man who hired her, but tells Gittes to check that day's obituaries.\r\nGittes learns that Mulwray was once the business partner of Evelyn's wealthy father, Noah Cross. Over lunch at Cross's club, Cross offers to double Gittes's fee if he searches for Mulwray's missing mistress. At the hall of records, Gittes discovers that much of the Northwest Valley has recently changed ownership. He visits an orange grove in the valley but is attacked by angry landowners who believe him to be an agent of the Water Department, which they claim is sabotaging the water supply to force them out.\r\nGittes deduces that the Water Department is drying up the land so it can be bought cheaply, and that Mulwray was murdered when he uncovered the plan. He also discovers that some of the property in the valley was seemingly purchased by a recently deceased retirement home resident. Gittes and Evelyn bluff their way into the retirement home and confirm that other real-estate deals were surreptitiously transacted in the names of unknowing residents. Their visit is interrupted by the suspicious director, who has called Mulvihill.\r\nAfter escaping Mulvihill and his thugs, Gittes and Evelyn hide at Evelyn's house and sleep together. During the night, Evelyn receives a phone call and must leave suddenly; she warns Gittes that her father is dangerous. Gittes follows Evelyn's car to a house where he sees Evelyn comforting Mulwray's mistress. He accuses Evelyn of holding the woman hostage, but she claims the woman is her sister, Katherine.\r\nThe next day, an anonymous call draws Gittes to Ida Sessions' apartment, where he finds her body. Lieutenant Escobar, who is waiting there, says the coroner found saltwater in Mulwray's lungs, indicating that he did not drown in the freshwater reservoir. Escobar suspects Evelyn murdered him and tells Gittes to produce her quickly. At the Mulwray mansion, Gittes finds Evelyn gone and the servants packing up the house. He discovers that the garden pond is saltwater and spots a pair of eyeglasses in it. He confronts Evelyn about Katherine, whom Evelyn now claims is her daughter. Gittes slaps Evelyn repeatedly and throws her across the room until she breaks down and reveals that Katherine is her sister and daughter. She explains that her father raped her when she was 15 years old, and she ran away to Mexico. She says the eyeglasses are not Mulwray's, as he did not wear bifocals.\r\nGittes arranges for the women to flee back to Mexico and instructs Evelyn to meet him at her butler's home in Chinatown. He summons Cross to the Mulwray home to settle their deal. Cross admits his intention to incorporate the Northwest Valley into the City of Los Angeles, then irrigate and develop it. Gittes confirms that the bifocals he found are Cross's and accuses Cross of murdering Mulwray. Cross has Mulvihill take the bifocals from Gittes at gunpoint. Gittes is then forced to drive them to Chinatown, where Evelyn is waiting. The police are already there and detain Gittes. Cross advances on Katherine as she gets into Evelyn's car, identifies himself as her grandfather, and attempts to take her away from Evelyn. Desperate to escape Cross, Evelyn shoots him in the arm and drives away with Katherine. The police open fire, killing Evelyn. Cross clutches the hysterical Katherine and pulls her away from the car. Escobar orders Gittes to be released and tells him to go home. One of Gittes's associates leads him away from the scene, telling Gittes as he glances back at Evelyn's body: \"Forget it, Jake. It's Chinatown.\"\r\nCast\r\nJack Nicholson as J. J. \"Jake\" Gittes\r\nFaye Dunaway as Evelyn Cross Mulwray\r\nJohn Huston as Noah Cross\r\nPerry Lopez as Lieutenant Lou Escobar\r\nJohn Hillerman as Russ Yelburton\r\nDarrell Zwerling as Hollis I. Mulwray\r\nDiane Ladd as Ida Sessions\r\nRoy Jenson as Claude Mulvihill\r\nRoman Polanski as Man with Knife\r\nDick Bakalyan as Detective Loach\r\nJoe Mantell as Lawrence Walsh\r\nBruce Glover as Duffy\r\nNandu Hinds as Sophie\r\nJames O'Reare as Lawyer\r\nJames Hong as Kahn, Evelyn's Butler\r\nBeulah Quo as Maid\r\nJerry Fujikawa as Gardener\r\nBelinda Palmer as Katherine Cross\r\nRoy Roberts as Mayor Bagby\r\nNoble Willingham as Councilman\r\nRance Howard as Irate Farmer\r\nGeorge Justin as Barber\r\nDoc Erickson as Customer\r\nFritzi Burr as Mulwray's Secretary\r\nJesse Vint as Farmer in the Valley #2\r\nCharles Knapp as Mortician\r\nClaudio Martinez as Boy on Horseback\r\nFederico Roberto as Cross's Butler\r\nAllan Warnick as Clerk\r\nBurt Young as Curly\r\nElizabeth Harding as Curly's Wife\r\nJohn Rogers as Mr. Palmer\r\nCecil Elliott as Emma Dill\r\nProduction\r\nBackground\r\nIn 1971, producer Robert Evans offered Towne $175,000 to write a screenplay for The Great Gatsby (1974), but Towne felt he could not better the F. Scott Fitzgerald novel. Instead, Towne asked Evans for $25,000 to write his own story, Chinatown, to which Evans agreed.\r\nChinatown is set in 1937 and portrays the manipulation of a critical municipal resource—water—by a cadre of shadowy oligarchs. It was the first part of Towne's planned trilogy about the character J. J. Gittes, the foibles of the Los Angeles power structure, and the subjugation of public good by private greed. The second part, The Two Jakes, has Gittes caught up in another grab for a natural resource—oil—in the 1940s. It was directed by Jack Nicholson and released in 1990, but the second film's commercial and critical failure scuttled plans to make Gittes vs. Gittes, about the third finite resource—land—in Los Angeles, circa 1968.\r\nOrigins\r\nThe character of Hollis Mulwray was inspired by and loosely based on Irish immigrant William Mulholland (1855–1935) according to Mulholland's granddaughter. Mulholland was the superintendent and chief engineer of the Los Angeles Department of Water and Power, who oversaw the construction of the 230-mile (370-km) aqueduct that carries water from the Owens Valley to Los Angeles.\r\nAuthor Vincent Brook considers real-life Mulholland to be split, in the film, into \"noble Water and Power chief Hollis Mulwray\" and \"mobster muscle Claude Mulvihill\", just as Land syndicate and Combination members, who \"exploited their insider knowledge\" on account of \"personal greed\", are \"condensed into the singular, and singularly monstrous, Noah Cross\".\r\nIn the film, Mulwray opposes the dam wanted by Noah Cross and the city of Los Angeles, for reasons of engineering and safety, arguing he would not repeat his previous mistake, when his dam broke resulting in hundreds of deaths. This alludes to the St. Francis Dam disaster of March 12, 1928, when the dam had been inspected by Mulholland on the day of its catastrophic failure. The dam's failure inundated the Santa Clara River Valley, including the town of Santa Paula, with flood water, causing the deaths of at least 431 people. The event effectively ended Mulholland's career.\r\nScript\r\nAccording to Robert Towne, both Carey McWilliams's Southern California Country: An Island on the Land (1946) and a West magazine article called \"Raymond Chandler's L.A\". inspired his original screenplay. In a letter to McWilliams, Towne wrote that Southern California Country \"really changed my life. It taught me to look at the place where I was born, and convinced me to write about it\".\r\nTowne wrote the screenplay with Jack Nicholson in mind. He took the title (and the exchange \"What did you do in Chinatown?\" / \"As little as possible\") from a Hungarian vice cop, who had worked in Los Angeles's Chinatown, confusion of dialects and gangs. The vice cop thought that \"police were better off in Chinatown doing nothing, because you could never tell what went on there\" and whether what you did helped or furthered the exploitation of victims.\r\nPolanski first learned of the script through Nicholson, as they had been searching for a suitable joint project, and the producer Robert Evans was excited at the thought that Polanski direction would create a darker, more cynical, and European vision of the United States. Polanski was initially reluctant to return to Los Angeles (it was only a few years since the murder of his pregnant wife Sharon Tate), but was persuaded on the strength of the script.\r\nTowne wanted Cross to die and Evelyn Mulwray to survive, but the screenwriter and director argued over it, with Polanski insisting on a tragic end: \"I knew that if Chinatown was to be special, not just another thriller where the good guys triumph in the final reel, Evelyn had to die\". They parted ways over this dispute and Polanski wrote the final scene a few days before it was shot.\r\nThe original script was more than 180 pages and included a narration by Gittes; Polanski cut and reordered the story so the audience and Gittes unraveled the mysteries at the same time.\r\nCharacters and casting\r\nJ. J. Gittes was named after Nicholson's friend, producer Harry Gittes.\r\nEvelyn Mulwray is, according to Towne, intended to initially seem the classic \"black widow\" character typical of lead female characters in film noir, but is eventually revealed to be a tragic victim. Jane Fonda was strongly considered for the role, but Polanski insisted on Dunaway.\r\nNoah Cross: Towne said that Huston was, after Nicholson, the second-best-cast actor in the film and that he made the Cross character menacing, through his courtly performance.\r\nPolanski appears in a cameo as the gangster who cuts Gittes' nose. The effect was accomplished with a special knife which could have actually cut Nicholson's nose if Polanski had not held it correctly.\r\nIn 1974, after making Chinatown and while filming The Fortune, Nicholson was informed by Time magazine researchers that his \"sister\" was actually his mother, similarly to the revelation made in the film regarding Evelyn and Katherine.\r\nFilming\r\nWilliam A. Fraker accepted the cinematographer position from Polanski when Paramount agreed. He had worked with the studio previously on Polanski's Rosemary's Baby. Robert Evans, never consulted about the decision, insisted that the offer be rescinded since he felt pairing Polanski and Fraker again would create a team with too much control over the project and complicate the production.\r\nBetween Fraker and the eventual choice John A. Alonzo, the two compromised on Stanley Cortez, but Polanski grew frustrated with Cortez's slow process, old fashioned compositional sensibility, and unfamiliarity with the Panavision equipment. Alonzo was chosen for his fleetness and skill with natural light a few weeks into production. Ultimately, only a handful of scenes in the finished film, including the orange grove confrontation, were shot by Cortez.\r\nIn keeping with a technique Polanski attributes to Raymond Chandler, all of the events of the film are seen subjectively through the main character's eyes; for example, when Gittes is knocked unconscious, the film fades to black and fades in when he awakens. Gittes appears in every scene of the film. This subjectivity is the same construction as Francis Coppola's The Conversation in which the main character, Harry Caul (Gene Hackman) appears in every scene in the film. The Conversation began shooting eleven months prior to Chinatown.\r\nSoundtrack\r\nJerry Goldsmith composed and recorded the film's score in ten days, after producer Robert Evans rejected Phillip Lambro's original effort at the last minute. It received an Academy Award nomination and remains widely praised, ranking ninth on the American Film Institute's list of the top 25 American film scores. Goldsmith's score, with \"haunting\" trumpet solos by Hollywood studio musician and MGM's first trumpet Uan Rasey, was released through ABC Records and features 12 tracks at a running time just over 30 minutes. It was later reissued on CD by the Varèse Sarabande label. Rasey related that Goldsmith \"told to play it sexy — but like it's not good sex!\"\r\nHistorical background\r\nIn his 2004 film essay and documentary Los Angeles Plays Itself, film scholar Thom Andersen lays out the complex relationship between Chinatown's script and its historical background:\r\nChinatown isn't a docudrama, it's a fiction. The water project it depicts isn't the construction of the Los Angeles Aqueduct, engineered by William Mulholland before the First World War. Chinatown is set in 1937, not 1905. The Mulholland-like figure—\"Hollis Mulwray\"—isn't the chief architect of the project, but rather its strongest opponent, who must be discredited and murdered. Mulwray is against the \"Alto Vallejo Dam\" because it's unsafe, not because it's stealing water from somebody else.... But there are echoes of Mulholland's aqueduct project in Chinatown.... Mulholland's project enriched its promoters through insider land deals in the San Fernando Valley, just like the dam project in Chinatown. The disgruntled San Fernando Valley farmers of Chinatown, forced to sell off their land at bargain prices because of an artificial drought, seem like stand-ins for the Owens Valley settlers whose homesteads turned to dust when Los Angeles took the water that irrigated them. The \"Van Der Lip Dam\" disaster, which Hollis Mulwray cites to explain his opposition to the proposed dam, is an obvious reference to the collapse of the Saint Francis Dam in 1928. Mulholland built this dam after completing the aqueduct and its failure was the greatest man-made disaster in the history of California. These echoes have led many viewers to regard Chinatown, not only as docudrama, but as truth—the real secret history of how Los Angeles got its water. And it has become a ruling metaphor of the non-fictional critiques of Los Angeles development.\r\nReception\r\nBox office\r\nThe film earned $29 million at the North American box office.\r\nCritical response\r\nOn Rotten Tomatoes, Chinatown holds an approval rating of 99% based on 79 reviews, with an average rating of 9.40/10. The website's critical consensus reads: \"As bruised and cynical as the decade that produced it, this noir classic benefits from Robert Towne's brilliant screenplay, director Roman Polanski's steady hand, and wonderful performances from Jack Nicholson and Faye Dunaway\". Metacritic assigned the film a weighted average score of 92 out of 100, based on 22 critics, indicating \"universal acclaim\". Roger Ebert added it to his \"Great Movies\" list, saying that Nicholson's performance was \"key in keeping Chinatown from becoming just a genre crime picture\", along with Towne's screenplay, concluding that the film \"seems to settle easily beside the original noirs\".\r\nAlthough the film was widely acclaimed by prominent critics upon its release, Vincent Canby of The New York Times was not impressed with the screenplay as compared to the film's predecessors, saying: \"Mr. Polanski and Mr. Towne have attempted nothing so witty and entertaining, being content instead to make a competently stylish, more or less thirties-ish movie that continually made me wish I were back seeing The Maltese Falcon or The Big Sleep\", but noted Nicholson's performance, calling it the film's \"major contribution to the genre\".\r\nAccolades\r\nOther Honors\r\n2010 – Best film of all time, The Guardian\r\n2012 - In the British Film Institute's 2012 Sight & Sound polls of the greatest films ever made, Chinatown was 78th among critics and 91st among directors.\r\n2015 - The film ranked 12th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world.\r\nAmerican Film Institute recognition\r\n1998 – AFI's 100 Years...100 Movies – Ranked 19th\r\n2001 – AFI's 100 Years...100 Thrills – Ranked 16th\r\n2003 – AFI's 100 Years...100 Heroes and Villains: Noah Cross – Ranked 16th Villain J.J. Gittes – Nominated Hero\r\nNoah Cross – Ranked 16th Villain\r\nJ.J. Gittes – Nominated Hero\r\n2005 – AFI's 100 Years...100 Movie Quotes: \"Forget it, Jake, it's Chinatown\" – Ranked 74th\r\n\"Forget it, Jake, it's Chinatown\" – Ranked 74th\r\n2005 – AFI's 100 Years of Film Scores – Ranked 9th\r\n2007 – AFI's 100 Years...100 Movies (10th Anniversary Edition) – Ranked 21st\r\n2008 – AFI's 10 Top 10 mystery film – Ranked 2nd\r\nSubsequent works\r\nA sequel film, The Two Jakes, was released in 1990, again starring Nicholson, who also directed, with Robert Towne returning to write the screenplay. It was not met with the same financial or critical success as the first film.\r\nA prequel television series by David Fincher and Towne for Netflix about Gittes starting his agency was reported to be in the works in November 2019.\r\nA film about the making of Chinatown, based on the non-fiction book The Big Goodbye: Chinatown and the Last Years of Hollywood, was reported in August 2020 to be in the works, with Ben Affleck as director and writer.\r\nLegacy\r\nTowne's screenplay has become legendary among critics and filmmakers, often cited as one of the best examples of the craft, though Polanski decided on the fatal final scene. While it has been reported that Towne envisioned a happy ending, he has denied these claims and said simply that he initially found Polanski's ending to be excessively melodramatic. He explained in a 1997 interview: \"The way I had seen it was that Evelyn would kill her father but end up in jail for it, unable to give the real reason why it happened. And the detective couldn't talk about it either, so it was bleak in its own way\". Towne retrospectively concluded that \"Roman was right\", later arguing that Polanski's stark and simple ending, due to the complexity of the events preceding it, was more fitting than his own, which he described as equally bleak but \"too complicated and too literary\".\r\nChinatown brought more public awareness to the land dealings and disputes over water rights, which arose while drawing Los Angeles' water supply from the Owens Valley in the 1910s.",
    "html": "<p>Chinatown is a 1974 American neo-noir mystery film directed by Roman Polanski from a screenplay by Robert Towne, starring Jack Nicholson and Faye Dunaway. The film was inspired by the California water wars, a series of disputes over southern California water at the beginning of the 20th century, by which Los Angeles interests secured water rights in the Owens Valley. The Robert Evans production, released by Paramount Pictures, was the director's last film in the United States and features many elements of film noir, particularly a multi-layered story that is part mystery and part psychological drama.</p><p>In 1991, the film was selected by the Library of Congress for preservation in the United States National Film Registry as being \"culturally, historically or aesthetically significant\" and it is frequently listed as one of the greatest films of all time. At the 47th Academy Awards, it was nominated for 11 Oscars, with Towne winning Best Original Screenplay. The Golden Globe Awards honored it for Best Drama, Best Director, Best Actor, and Best Screenplay. The American Film Institute placed it second among its top ten mystery films in 2008.</p><p>A sequel, The Two Jakes, was released in 1990, again starring Nicholson, who also directed, with Robert Towne returning to write the screenplay. The film failed to match the acclaim of its predecessor.</p><br/><h3>Plot</h3><p>In 1937, a woman identifying herself as Evelyn Mulwray hires private investigator Jake Gittes to trail her husband Hollis, whom she suspects of infidelity. Hollis Mulwray is chief engineer at the Los Angeles Department of Water and Power, and Gittes hears him publicly refuse to build a new dam on safety grounds. Later, Gittes photographs Mulwray in the company of a young woman, and the pictures make their way into the next day's paper.</p><p>At his office, Gittes is confronted by the real Evelyn Mulwray, who threatens to sue him. Gittes concludes that the fake Evelyn was using him to discredit Mulwray. He goes to a reservoir to search for clues but instead finds his old police associate, Lieutenant Lou Escobar. Hollis Mulwray's body had been found in the reservoir, having apparently drowned.</p><p>Now working for Evelyn, Gittes investigates Mulwray's death as a homicide. He discovers that although there is supposedly a drought, huge quantities of water are released from the reservoir every night. Gittes is warned off by Water Department Security Chief Claude Mulvihill and a henchman who slashes Gittes's left nostril. At his office, Gittes receives a call from Ida Sessions, who identifies herself as the fake Mrs. Mulwray. She refuses to disclose the name of the man who hired her, but tells Gittes to check that day's obituaries.</p><p>Gittes learns that Mulwray was once the business partner of Evelyn's wealthy father, Noah Cross. Over lunch at Cross's club, Cross offers to double Gittes's fee if he searches for Mulwray's missing mistress. At the hall of records, Gittes discovers that much of the Northwest Valley has recently changed ownership. He visits an orange grove in the valley but is attacked by angry landowners who believe him to be an agent of the Water Department, which they claim is sabotaging the water supply to force them out.</p><p>Gittes deduces that the Water Department is drying up the land so it can be bought cheaply, and that Mulwray was murdered when he uncovered the plan. He also discovers that some of the property in the valley was seemingly purchased by a recently deceased retirement home resident. Gittes and Evelyn bluff their way into the retirement home and confirm that other real-estate deals were surreptitiously transacted in the names of unknowing residents. Their visit is interrupted by the suspicious director, who has called Mulvihill.</p><p>After escaping Mulvihill and his thugs, Gittes and Evelyn hide at Evelyn's house and sleep together. During the night, Evelyn receives a phone call and must leave suddenly; she warns Gittes that her father is dangerous. Gittes follows Evelyn's car to a house where he sees Evelyn comforting Mulwray's mistress. He accuses Evelyn of holding the woman hostage, but she claims the woman is her sister, Katherine.</p><p>The next day, an anonymous call draws Gittes to Ida Sessions' apartment, where he finds her body. Lieutenant Escobar, who is waiting there, says the coroner found saltwater in Mulwray's lungs, indicating that he did not drown in the freshwater reservoir. Escobar suspects Evelyn murdered him and tells Gittes to produce her quickly. At the Mulwray mansion, Gittes finds Evelyn gone and the servants packing up the house. He discovers that the garden pond is saltwater and spots a pair of eyeglasses in it. He confronts Evelyn about Katherine, whom Evelyn now claims is her daughter. Gittes slaps Evelyn repeatedly and throws her across the room until she breaks down and reveals that Katherine is her sister and daughter. She explains that her father raped her when she was 15 years old, and she ran away to Mexico. She says the eyeglasses are not Mulwray's, as he did not wear bifocals.</p><p>Gittes arranges for the women to flee back to Mexico and instructs Evelyn to meet him at her butler's home in Chinatown. He summons Cross to the Mulwray home to settle their deal. Cross admits his intention to incorporate the Northwest Valley into the City of Los Angeles, then irrigate and develop it. Gittes confirms that the bifocals he found are Cross's and accuses Cross of murdering Mulwray. Cross has Mulvihill take the bifocals from Gittes at gunpoint. Gittes is then forced to drive them to Chinatown, where Evelyn is waiting. The police are already there and detain Gittes. Cross advances on Katherine as she gets into Evelyn's car, identifies himself as her grandfather, and attempts to take her away from Evelyn. Desperate to escape Cross, Evelyn shoots him in the arm and drives away with Katherine. The police open fire, killing Evelyn. Cross clutches the hysterical Katherine and pulls her away from the car. Escobar orders Gittes to be released and tells him to go home. One of Gittes's associates leads him away from the scene, telling Gittes as he glances back at Evelyn's body: \"Forget it, Jake. It's Chinatown.\"</p><br/><h3>Cast</h3><ul><li>Jack Nicholson as J. J. \"Jake\" Gittes</li><li>Faye Dunaway as Evelyn Cross Mulwray</li><li>John Huston as Noah Cross</li><li>Perry Lopez as Lieutenant Lou Escobar</li><li>John Hillerman as Russ Yelburton</li><li>Darrell Zwerling as Hollis I. Mulwray</li><li>Diane Ladd as Ida Sessions</li><li>Roy Jenson as Claude Mulvihill</li><li>Roman Polanski as Man with Knife</li><li>Dick Bakalyan as Detective Loach</li><li>Joe Mantell as Lawrence Walsh</li><li>Bruce Glover as Duffy</li><li>Nandu Hinds as Sophie</li><li>James O'Reare as Lawyer</li><li>James Hong as Kahn, Evelyn's Butler</li><li>Beulah Quo as Maid</li><li>Jerry Fujikawa as Gardener</li><li>Belinda Palmer as Katherine Cross</li><li>Roy Roberts as Mayor Bagby</li><li>Noble Willingham as Councilman</li><li>Rance Howard as Irate Farmer</li><li>George Justin as Barber</li><li>Doc Erickson as Customer</li><li>Fritzi Burr as Mulwray's Secretary</li><li>Jesse Vint as Farmer in the Valley #2</li><li>Charles Knapp as Mortician</li><li>Claudio Martinez as Boy on Horseback</li><li>Federico Roberto as Cross's Butler</li><li>Allan Warnick as Clerk</li><li>Burt Young as Curly</li><li>Elizabeth Harding as Curly's Wife</li><li>John Rogers as Mr. Palmer</li><li>Cecil Elliott as Emma Dill</li></ul><br/><h3>Production</h3><h4>Background</h4><p>In 1971, producer Robert Evans offered Towne $175,000 to write a screenplay for The Great Gatsby (1974), but Towne felt he could not better the F. Scott Fitzgerald novel. Instead, Towne asked Evans for $25,000 to write his own story, Chinatown, to which Evans agreed.</p><p>Chinatown is set in 1937 and portrays the manipulation of a critical municipal resource—water—by a cadre of shadowy oligarchs. It was the first part of Towne's planned trilogy about the character J. J. Gittes, the foibles of the Los Angeles power structure, and the subjugation of public good by private greed. The second part, The Two Jakes, has Gittes caught up in another grab for a natural resource—oil—in the 1940s. It was directed by Jack Nicholson and released in 1990, but the second film's commercial and critical failure scuttled plans to make Gittes vs. Gittes, about the third finite resource—land—in Los Angeles, circa 1968.</p><h4>Origins</h4><p>The character of Hollis Mulwray was inspired by and loosely based on Irish immigrant William Mulholland (1855–1935) according to Mulholland's granddaughter. Mulholland was the superintendent and chief engineer of the Los Angeles Department of Water and Power, who oversaw the construction of the 230-mile (370-km) aqueduct that carries water from the Owens Valley to Los Angeles.</p><p>Author Vincent Brook considers real-life Mulholland to be split, in the film, into \"noble Water and Power chief Hollis Mulwray\" and \"mobster muscle Claude Mulvihill\", just as Land syndicate and Combination members, who \"exploited their insider knowledge\" on account of \"personal greed\", are \"condensed into the singular, and singularly monstrous, Noah Cross\".</p><p>In the film, Mulwray opposes the dam wanted by Noah Cross and the city of Los Angeles, for reasons of engineering and safety, arguing he would not repeat his previous mistake, when his dam broke resulting in hundreds of deaths. This alludes to the St. Francis Dam disaster of March 12, 1928, when the dam had been inspected by Mulholland on the day of its catastrophic failure. The dam's failure inundated the Santa Clara River Valley, including the town of Santa Paula, with flood water, causing the deaths of at least 431 people. The event effectively ended Mulholland's career.</p><h4>Script</h4><p>According to Robert Towne, both Carey McWilliams's Southern California Country: An Island on the Land (1946) and a West magazine article called \"Raymond Chandler's L.A\". inspired his original screenplay. In a letter to McWilliams, Towne wrote that Southern California Country \"really changed my life. It taught me to look at the place where I was born, and convinced me to write about it\".</p><p>Towne wrote the screenplay with Jack Nicholson in mind. He took the title (and the exchange \"What did you do in Chinatown?\" / \"As little as possible\") from a Hungarian vice cop, who had worked in Los Angeles's Chinatown, confusion of dialects and gangs. The vice cop thought that \"police were better off in Chinatown doing nothing, because you could never tell what went on there\" and whether what you did helped or furthered the exploitation of victims.</p><p>Polanski first learned of the script through Nicholson, as they had been searching for a suitable joint project, and the producer Robert Evans was excited at the thought that Polanski direction would create a darker, more cynical, and European vision of the United States. Polanski was initially reluctant to return to Los Angeles (it was only a few years since the murder of his pregnant wife Sharon Tate), but was persuaded on the strength of the script.</p><p>Towne wanted Cross to die and Evelyn Mulwray to survive, but the screenwriter and director argued over it, with Polanski insisting on a tragic end: \"I knew that if Chinatown was to be special, not just another thriller where the good guys triumph in the final reel, Evelyn had to die\". They parted ways over this dispute and Polanski wrote the final scene a few days before it was shot.</p><p>The original script was more than 180 pages and included a narration by Gittes; Polanski cut and reordered the story so the audience and Gittes unraveled the mysteries at the same time.</p><h4>Characters and casting</h4><ul><li>J. J. Gittes was named after Nicholson's friend, producer Harry Gittes.</li><li>Evelyn Mulwray is, according to Towne, intended to initially seem the classic \"black widow\" character typical of lead female characters in film noir, but is eventually revealed to be a tragic victim. Jane Fonda was strongly considered for the role, but Polanski insisted on Dunaway.</li><li>Noah Cross: Towne said that Huston was, after Nicholson, the second-best-cast actor in the film and that he made the Cross character menacing, through his courtly performance.</li><li>Polanski appears in a cameo as the gangster who cuts Gittes' nose. The effect was accomplished with a special knife which could have actually cut Nicholson's nose if Polanski had not held it correctly.</li><li>In 1974, after making Chinatown and while filming The Fortune, Nicholson was informed by Time magazine researchers that his \"sister\" was actually his mother, similarly to the revelation made in the film regarding Evelyn and Katherine.</li></ul><h4>Filming</h4><p>William A. Fraker accepted the cinematographer position from Polanski when Paramount agreed. He had worked with the studio previously on Polanski's Rosemary's Baby. Robert Evans, never consulted about the decision, insisted that the offer be rescinded since he felt pairing Polanski and Fraker again would create a team with too much control over the project and complicate the production.</p><p>Between Fraker and the eventual choice John A. Alonzo, the two compromised on Stanley Cortez, but Polanski grew frustrated with Cortez's slow process, old fashioned compositional sensibility, and unfamiliarity with the Panavision equipment. Alonzo was chosen for his fleetness and skill with natural light a few weeks into production. Ultimately, only a handful of scenes in the finished film, including the orange grove confrontation, were shot by Cortez.</p><p>In keeping with a technique Polanski attributes to Raymond Chandler, all of the events of the film are seen subjectively through the main character's eyes; for example, when Gittes is knocked unconscious, the film fades to black and fades in when he awakens. Gittes appears in every scene of the film. This subjectivity is the same construction as Francis Coppola's The Conversation in which the main character, Harry Caul (Gene Hackman) appears in every scene in the film. The Conversation began shooting eleven months prior to Chinatown.</p><h4>Soundtrack</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Chinatown</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Film score</span> by <div class=\"contributor\" style=\"display:inline\"><span>Jerry Goldsmith</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">1974</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Jazz</span>, <span>soundtrack</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Varèse Sarabande</span></td></tr></tbody></table><p>Jerry Goldsmith composed and recorded the film's score in ten days, after producer Robert Evans rejected Phillip Lambro's original effort at the last minute. It received an Academy Award nomination and remains widely praised, ranking ninth on the American Film Institute's list of the top 25 American film scores. Goldsmith's score, with \"haunting\" trumpet solos by Hollywood studio musician and MGM's first trumpet Uan Rasey, was released through ABC Records and features 12 tracks at a running time just over 30 minutes. It was later reissued on CD by the Varèse Sarabande label. Rasey related that Goldsmith \"told to play it sexy — but like it's not good sex!\"</p><br/><h3>Historical background</h3><p>In his 2004 film essay and documentary Los Angeles Plays Itself, film scholar Thom Andersen lays out the complex relationship between Chinatown's script and its historical background:</p><blockquote>Chinatown isn't a docudrama, it's a fiction. The water project it depicts isn't the construction of the Los Angeles Aqueduct, engineered by William Mulholland before the First World War. Chinatown is set in 1937, not 1905. The Mulholland-like figure—\"Hollis Mulwray\"—isn't the chief architect of the project, but rather its strongest opponent, who must be discredited and murdered. Mulwray is against the \"Alto Vallejo Dam\" because it's unsafe, not because it's stealing water from somebody else.... But there are echoes of Mulholland's aqueduct project in Chinatown.... Mulholland's project enriched its promoters through insider land deals in the San Fernando Valley, just like the dam project in Chinatown. The disgruntled San Fernando Valley farmers of Chinatown, forced to sell off their land at bargain prices because of an artificial drought, seem like stand-ins for the Owens Valley settlers whose homesteads turned to dust when Los Angeles took the water that irrigated them. The \"Van Der Lip Dam\" disaster, which Hollis Mulwray cites to explain his opposition to the proposed dam, is an obvious reference to the collapse of the Saint Francis Dam in 1928. Mulholland built this dam after completing the aqueduct and its failure was the greatest man-made disaster in the history of California. These echoes have led many viewers to regard Chinatown, not only as docudrama, but as truth—the real secret history of how Los Angeles got its water. And it has become a ruling metaphor of the non-fictional critiques of Los Angeles development.</blockquote><br/><h3>Reception</h3><h4>Box office</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs expansion</b>. You can help by <span class=\"external text\">adding to it</span>.  <span class=\"date-container\"><i>(<span class=\"date\">April 2018</span>)</i></span></div></td></tr></tbody></table><p>The film earned $29 million at the North American box office.</p><h4>Critical response</h4><p>On Rotten Tomatoes, Chinatown holds an approval rating of 99% based on 79 reviews, with an average rating of 9.40/10. The website's critical consensus reads: \"As bruised and cynical as the decade that produced it, this noir classic benefits from Robert Towne's brilliant screenplay, director Roman Polanski's steady hand, and wonderful performances from Jack Nicholson and Faye Dunaway\". Metacritic assigned the film a weighted average score of 92 out of 100, based on 22 critics, indicating \"universal acclaim\". Roger Ebert added it to his \"Great Movies\" list, saying that Nicholson's performance was \"key in keeping Chinatown from becoming just a genre crime picture\", along with Towne's screenplay, concluding that the film \"seems to settle easily beside the original noirs\".</p><p>Although the film was widely acclaimed by prominent critics upon its release, Vincent Canby of The New York Times was not impressed with the screenplay as compared to the film's predecessors, saying: \"Mr. Polanski and Mr. Towne have attempted nothing so witty and entertaining, being content instead to make a competently stylish, more or less thirties-ish movie that continually made me wish I were back seeing The Maltese Falcon or The Big Sleep\", but noted Nicholson's performance, calling it the film's \"major contribution to the genre\".</p><br/><h3>Accolades</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"11\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Robert Evans</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"11\"> <br> </td></tr><tr><td><span>Best Director</span></td><td><span>Roman Polanski</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td><span>Jack Nicholson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress</span></td><td><span>Faye Dunaway</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Screenplay</span></td><td><span>Robert Towne</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td>Art Direction: <span>Richard Sylbert</span> and <span>W. Stewart Campbell</span>; <br> Set Decoration: <span>Ruby R. Levitt</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>John A. Alonzo</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design</span></td><td><span>Anthea Sylbert</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Sam O'Steen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Dramatic Score</span></td><td><span>Jerry Goldsmith</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Charles Grenzbach</span> and <span>Larry Jost</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Bodil Awards</span></td><td><span>Best Non-European Film</span></td><td rowspan=\"3\">Roman Polanski</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"11\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"11\"></td></tr><tr><td><span>Best Direction</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor in a Leading Role</span></td><td>Jack Nicholson <span style=\"font-size:85%;\">(also for <i><span>The Last Detail</span></i>)</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td>Faye Dunaway</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td><span>John Huston</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Robert Towne <span style=\"font-size:85%;\">(also for <i><span>The Last Detail</span></i>)</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Art Direction</span></td><td>Richard Sylbert</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>John A. Alonzo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Costume Design</span></td><td>Anthea Sylbert</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td>Sam O'Steen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Original Music</span></td><td>Jerry Goldsmith</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Roman Polanski</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Edgar Allan Poe Awards</span></td><td><span>Best Motion Picture</span></td><td>Robert Towne</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Fotogramas de Plata</span></td><td>Best Foreign Movie Performer</td><td>Jack Nicholson <span style=\"font-size:85%;\">(also for <i><span>Five Easy Pieces</span></i>)</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"7\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"7\"></td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Motion Picture – Drama</span></td><td>Faye Dunaway</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td>John Huston</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Roman Polanski</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Robert Towne</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Score – Motion Picture</span></td><td>Jerry Goldsmith</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>International Film Music Critics Awards</span></td><td><span>Best Re-Release/Re-Recording of an Existing Score</span></td><td>Jerry Goldsmith, Douglass Fake, Roger Feigelson, <br> Jeff Bond, and Joe Sikoryak</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\">Kansas City Film Critics Circle Awards</td><td>Best Actor</td><td>Jack Nicholson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td>Best Supporting Actor</td><td>John Huston</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>National Board of Review Awards</span></td><td colspan=\"2\"><span>Top Ten Films</span></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td><td align=\"center\"></td></tr><tr><td><span>National Film Preservation Board</span></td><td colspan=\"2\"><span>National Film Registry</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td><span>National Society of Film Critics Awards</span></td><td><span>Best Actor</span></td><td rowspan=\"2\">Jack Nicholson <span style=\"font-size:85%;\">(also for <i><span>The Last Detail</span></i>)</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><span>New York Film Critics Circle Awards</span></td><td><span>Best Actor</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"2\"></td></tr><tr><td><span>Best Screenplay</span></td><td>Robert Towne</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td align=\"center\"></td></tr><tr><td><span>Producers Guild of America Awards</span></td><td>PGA Hall of Fame – Motion Pictures</td><td>Robert Evans</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Sant Jordi Awards</span></td><td>Best Foreign Film</td><td>Roman Polanski</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Drama – Written Directly for the Screen</span></td><td>Robert Towne</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr></tbody></table><h4>Other Honors</h4><ul><li>2010 – Best film of all time, The Guardian</li><li>2012 - In the British Film Institute's 2012 Sight & Sound polls of the greatest films ever made, Chinatown was 78th among critics and 91st among directors.</li><li>2015 - The film ranked 12th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world.</li></ul><p>American Film Institute recognition</p><ul><li>1998 – AFI's 100 Years...100 Movies – Ranked 19th</li><li>2001 – AFI's 100 Years...100 Thrills – Ranked 16th</li><li>2003 – AFI's 100 Years...100 Heroes and Villains: Noah Cross – Ranked 16th Villain J.J. Gittes – Nominated Hero</li><li>Noah Cross – Ranked 16th Villain</li><li>J.J. Gittes – Nominated Hero</li><li>2005 – AFI's 100 Years...100 Movie Quotes: \"Forget it, Jake, it's Chinatown\" – Ranked 74th</li><li>\"Forget it, Jake, it's Chinatown\" – Ranked 74th</li><li>2005 – AFI's 100 Years of Film Scores – Ranked 9th</li><li>2007 – AFI's 100 Years...100 Movies (10th Anniversary Edition) – Ranked 21st</li><li>2008 – AFI's 10 Top 10 mystery film – Ranked 2nd</li></ul><br/><h3>Subsequent works</h3><p>A sequel film, The Two Jakes, was released in 1990, again starring Nicholson, who also directed, with Robert Towne returning to write the screenplay. It was not met with the same financial or critical success as the first film.</p><p>A prequel television series by David Fincher and Towne for Netflix about Gittes starting his agency was reported to be in the works in November 2019.</p><p>A film about the making of Chinatown, based on the non-fiction book The Big Goodbye: Chinatown and the Last Years of Hollywood, was reported in August 2020 to be in the works, with Ben Affleck as director and writer.</p><br/><h3>Legacy</h3><p>Towne's screenplay has become legendary among critics and filmmakers, often cited as one of the best examples of the craft, though Polanski decided on the fatal final scene. While it has been reported that Towne envisioned a happy ending, he has denied these claims and said simply that he initially found Polanski's ending to be excessively melodramatic. He explained in a 1997 interview: \"The way I had seen it was that Evelyn would kill her father but end up in jail for it, unable to give the real reason why it happened. And the detective couldn't talk about it either, so it was bleak in its own way\". Towne retrospectively concluded that \"Roman was right\", later arguing that Polanski's stark and simple ending, due to the complexity of the events preceding it, was more fitting than his own, which he described as equally bleak but \"too complicated and too literary\".</p><p>Chinatown brought more public awareness to the land dealings and disputes over water rights, which arose while drawing Los Angeles' water supply from the Owens Valley in the 1910s.</p><br/>"
  },
  "errorMessage": ""
}