{
  "imDbId": "tt0077416",
  "title": "The Deer Hunter",
  "fullTitle": "The Deer Hunter (1978)",
  "type": "Movie",
  "year": "1978",
  "items": [
    {
      "publisher": "Chicago Tribune",
      "author": "Gene Siskel",
      "link": "",
      "rate": "100",
      "content": "What distinguishes The Deer Hunter most is its many rich characters and the size of its vision. This is a big film, dealing with big issues, made on a grand scale. Much of it, including some casting decisions, suggest inspiration by \"The Godfather.\" [9 Mar 1979]"
    },
    {
      "publisher": "",
      "author": "TV Guide Magazine",
      "link": "https://www.tvguide.com/?MI=5143",
      "rate": "100",
      "content": "Brutally memorable, The Deer Hunter is an emotionally draining production that draws a vivid portrait of its characters and their milieu--and succeeds in showing the devastating effect of the war on their lives, as well as their brave attempts at renewal. Unfortunately, the film falters when it comes to the larger questions of America's involvement in Vietnam."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/the-deer-hunter-1979",
      "rate": "100",
      "content": "It is not an anti-war film. It is not a pro-war film. It is one of the most emotionally shattering films ever made."
    },
    {
      "publisher": "Empire",
      "author": "Colin Kennedy",
      "link": "https://www.empireonline.com/movies/reviews/deer-hunter-review/",
      "rate": "100",
      "content": "A simultaneuosly touching and harrowing experience that puts the audience directly in the shoes of one man's experience of Vietnam."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2014/jul/31/the-deer-hunter-review-ciminos-masterpiece",
      "rate": "100",
      "content": "The idea of sacrifice permeates everything, along with the cruelty and horror. This is Cimino's masterpiece."
    },
    {
      "publisher": "The New York Times",
      "author": "Vincent Canby",
      "link": "",
      "rate": "90",
      "content": "A big, awkward, crazily ambitious, sometimes breathtaking motion picture that comes as close to being a popular epic as any movie about this country since \"The Godfather.\""
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1978/film/reviews/the-deer-hunter-1200424319/",
      "rate": "90",
      "content": "Among the considerable achievements of Michael Cimino's The Deer Hunter is the fact that the film remains intense, powerful and fascinating for more than three hours."
    },
    {
      "publisher": "Dallas Observer",
      "author": "Luke Y. Thompson",
      "link": "",
      "rate": "70",
      "content": "Overlong, but with moments of greatness."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "50",
      "content": "While the results are far from unprofessional--the cast is uniformly good, including a characteristically slapped-around Meryl Streep...The male self-pity is so overwhelming that you'll probably stagger out of this mumbling something about Tolstoy (as many critics did when the film first came out in 1978) if you aren't as nauseated as I was."
    },
    {
      "publisher": "The New Yorker",
      "author": "Pauline Kael",
      "link": "",
      "rate": "50",
      "content": "A romantic adolescent boys view of friendship."
    }
  ],
  "errorMessage": ""
}