{
  "imDbId": "tt0077416",
  "title": "The Deer Hunter",
  "fullTitle": "The Deer Hunter (1978)",
  "type": "Movie",
  "year": "1978",
  "items": [
    {
      "username": "yawn-2",
      "userUrl": "https://www.imdb.com/user/ur0446676",
      "reviewLink": "https://www.imdb.com/review/rw1334836",
      "warningSpoilers": false,
      "date": "6 April 2006",
      "rate": "10",
      "helpful": "430 out of 545 found this helpful.",
      "title": "It was 1978 and everyone in the audience was about to wet their pants",
      "content": "No, this is not the best film about the Vietnam War; it's hardly about Vietnam at all. The vets who don't like it have it wrong, as do the Vietnamese who found it racist. It could be any war, with any combatants. But because the (primary) victims here are recognizable American archetypes, Americans will feel this in their gut more than any other war film I know of. This is one of the very few post-war Hollywood films that shows a sincere reverence for the lives of small town Americans.After seeing it in a very high quality theater on its initial release, I walked out thinking it was easily one of the best movies I had ever seen - and that I never wanted to see it again. But I looked at it today on cable and found that not much had changed about it, or me. I don't want to see it again...but I want you to see it.Even now, the Russian Roulette scene (in context, people: watch all that comes before it first) is the single most intense sequence I've seen; it makes the end of \"Reservoir Dogs\" seem like a cartoon. Best Walken performance, period. Meryl Streep glows, DeNiro has seldom been more affecting. A unique classic...it is not surprising that Cimino didn't have another movie in him after something this wrenching."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0159415",
      "warningSpoilers": true,
      "date": "7 July 2004",
      "rate": "10",
      "helpful": "234 out of 327 found this helpful.",
      "title": "It's been given a fairly bad reputation over the years - undeservedly so, too. One of the greatest films ever made.",
      "content": "\"One shot is what it's all about. A deer has to be taken with one shot.\"There's that particularly infamous scene in \"The Deer Hunter\" that seems to remain more disturbing each time we view it, when Michael (Robert De Niro), a Vietnam veteran, tracks down a friend of his named Nicky (Christopher Walken), who never arrived home after the war and is eventually found in Saigon, playing Russian Roulette for money, his mind an utter mess. He is unable to fully remember Michael, and refuses to return home, and what proceeds in the following sequence is a haunting example of gut-wrenching film-making.The Vietnam sequences take place midway through the movie, serving as a connection between the beginning and the end, both of which study the lives of the men and not the war around them. Michael, Nicky and Steven (John Savage) are young Pennsylvanian miners drafted into the war. Steven has just gotten married to the love of his life, but has little time to celebrate as he is shipped overseas with his friends. They eventually all find themselves taken hostage in a Vietnamese POW camp where their captors force them to play Russian Roulette. The rules of the game? Put a single bullet in a random chamber of a handgun, spin it, snap it, raise it to your head, squeeze the trigger, and repeat these steps until there's only one man left standing.After a series of fortunate events Michael, Nicky and Steven escape and make their way downriver. All three men are eventually rescued, Nicky via helicopter and Michael and Steven later on. Steven's battered, infected legs are amputated and he is left helpless in a wheelchair. Michael returns home as well only to find that Nicky is still back in Vietnam. Nicky's girlfriend back home, Linda (Meryl Street), begins to fall in love with Michael, but Michael soon remembers his promise to Nicky (\"If I don't make it back don't leave me over there\") and travels over 2,000 miles back into the middle of his own personal hell to find and rescue his best friend. It's hard for him to understand why Nicky doesn't recognize him when he finally tracks him down. \"It's me, Mike.\" \"Mike who?\"Causing mass controversy upon its release because of its alleged \"racist\" content regarding the Vietnamese, a crowd of Vietnam veterans gathered around outside the Oscars ceremony and caused riots as well, claiming that the film was \"not accurate\" and somehow insulting to the veterans of the war. However as many film historians, authors and critics have already pointed out, the film is never meant to be a 100% accurate depiction of the events in Vietnam. It is not really a Vietnam War picture at all. Instead, it is a focus on the aftermath of war, and how damaging it can be, both physically and mentally, to its participants. Because of the era that \"The Deer Hunter\" was released in, Vietnam was a recent event, the focus of the nation, and is therefore used as a more convenient -- and relative -- backdrop (much like \"Apocalypse Now\"). Unlike \"Platoon\" this is not a movie relating specifically to the Vietnam War, in fact less than a half an hour is devoted to the war scenes. It is a character study, and accusations of racism -- although perhaps justified to some extent -- are hardly convincing as the film itself is not concerned with bashing the participants of the war as it is the war itself.It is the film's necessary setup that is often called long and boring and, ironically, unnecessary, but this is essentially where the nature of each character is examined for the audience. To launch directly into the war sequences would be sloppy, and we would have a harder time caring for the characters. Instead, we are given scenes with weddings, discussions, and hunting trips -- normal events. Then, the end, a somber reflection upon the past, chronicles the aftermath of the damaging events in the lives of Michael, Steven, Nicky and their loved ones. Michael has a hard time adapting back to his normal life. It would be hard for anyone, after experiencing such damaging events and images. De Niro made a few post-Vietnam films during the '70s and '80s, the most famous being \"Taxi Driver,\" in which Travis Bickle was totally unable to find his way in life again after the war and resorted to violence in order to justify his existence and release his anger. \"The Deer Hunter\" is similar in approach but reveals more background; this would be a suitable prequel of sorts if the names had been changed.Over the years \"The Deer Hunter\" has surprisingly gained a fairly bad reputation -- most of which stems back to the controversy surroundings its release and protested accolades. Director Michael Cimino's follow-up (\"Heaven's Gate\") was an enormous flop, bankrupting United Artists, and he had a hard time finding work afterwards. His first feature film, \"Thunderbolt and Lightfoot,\" which starred Clint Eastwood and Jeff Bridges, was a buddy road movie that was also a sign of things to come in Cimino' later features, most notably the process of male bonding, which is a huge primal element in this project. Cimino was an extremely talented and visionary director, and it's a shame that the ambition of \"Heaven's Gate\" cost him his career.And furthermore, despite the negativity surrounding \"The Deer Hunter,\" it is still one of the finest works of American cinema, a touching, poignant and ultimately depressing film that asks us if the effects of war extend past the physical and into the realm of human mentality. Yes, I think they do."
    },
    {
      "username": "abelardo64",
      "userUrl": "https://www.imdb.com/user/ur3210707",
      "reviewLink": "https://www.imdb.com/review/rw2199922",
      "warningSpoilers": false,
      "date": "31 January 2010",
      "rate": "10",
      "helpful": "127 out of 157 found this helpful.",
      "title": "A War Like All Wars A Film Like No Other",
      "content": "\"The Deer Hunter\" is 32 years old. How extraordinary to sit through it now. Walking over the politics that divided , somehow, all of its admirers then. \"Great film but...\" How silly to think of it now. Michael (a sensational young Robert De Niro) is as extreme a character as Rocco was in \"Rocco And His Brothers\" His goodness, the one that was always there but that he discovers under the most horrendous circumstances, underlined by Stanley Mayers's \"Cavatina\" permeates the entire film. I remember thinking, when I saw the film for the first time, that I couldn't or wouldn't spend ten minutes with Michael and his friends, the ones we meet at the beginning of the film but by the end I thought of them as brothers and I loved them. I actually loved them. That in itself is a sort of film miracle. John Savage will break your heart, it certainly broke mine and Christopher Walken is absolutely riveting. How strange to tho think that Michael Cimino, still a young man, is nowhere to be seen. Is still a punishment for \"Heaven's Gate\" and \"Indecent Exposure\" or there is something else we don't know about. The Cimino behind \"The Deer Hunter\" is a true master."
    },
    {
      "username": "richardratliff",
      "userUrl": "https://www.imdb.com/user/ur78867282",
      "reviewLink": "https://www.imdb.com/review/rw5201729",
      "warningSpoilers": false,
      "date": "20 October 2019",
      "rate": "10",
      "helpful": "87 out of 108 found this helpful.",
      "title": "War is a gamble.",
      "content": "I am a combat veteran of Afghanistan.We don't know why some of us come back and others do not. War is a gamble.This film deeply touched my soul."
    },
    {
      "username": "gab-14712",
      "userUrl": "https://www.imdb.com/user/ur61859192",
      "reviewLink": "https://www.imdb.com/review/rw3835438",
      "warningSpoilers": true,
      "date": "18 October 2017",
      "rate": "9",
      "helpful": "41 out of 54 found this helpful.",
      "title": "Hard to Watch At Times!",
      "content": "1978's The Deer Hunter is one of the more polarizing movies to come out during the 1970's. It was the first movie with the deeply controversial subject of the Vietnam War to both become a critical and commercial success. However, there were several people who expressed dissent ranging from its portrayal of the Vietnam War to the controversial involvement of Russian roulette to the singing of \"God Bless America.\" I remember not being too impressed with the film the first time I viewed it. I felt it was too long and violent. Years later, I am singing a different tune. It's a difficult film to sit through because of its violence and the effects of PTSD (post-trauma syndrome). But it is a highly engaging and effective film and I regard it as one of the more influential American movies of the 1970's. Not the best, but the most influential because there will be more successful films tackling the Vietnam War on the horizon.You can call this movie a symphony of some sort. I sort this film into three major segments. The first segment is the longest because of its lengthy and effective characterization. We meet three Pennsylvania factory workers: Michael (Robert De Niro), Steven (John Savage), and Nick (Christopher Walken). They enlisted in the army to serve in Vietnam. Steven decides to marry before going off to war and this wedding also serves as the farewell party. This section is eerily reminiscent of the opening act of The Godfather. There is lots of partying and dancing. And we essentially get to know these characters. These men are hard workers who get drunk at the party because they deserve a night for themselves. After the party, the trio of friends along with another friend Stan (John Cazale) go into the mountains to hunt for deer for one last trip. Hence the title of the movie. I found this section to be incredibly effective in character-building. Director Michael Cimino took his time with his part because it was important to understand these men before they go into the horrors of war.The second movement of our symphony is the actual war. Just like that with a loud noise, the film instantly changes its tone. From the foggy mountains of Pennsylvania to the tropical war zone of Vietnam we go. In one of the most terrifying sequences ever made, the three men are taken prisoner and are forced to play Russian roulette while their captors are betting who will win and who will die. Just seeing the men's faces as they are waiting their turn in the rat-infested cages are undeniably scary. One of the film's controversies is that roulette was not actually played in Vietnam. According to Cimino, he read articles saying they did play roulette although any of this has not been confirmed. But it's one hell of a way to add tension to the movie. You can also take this as a symbol for the war overall. Roger Ebert puts it perfectly in his review, \"Anything you can believe about the game, about it's deliberately random violence, about how it touches the sanity of men forced to play it, will apply it to the war as a whole.\" Essentially, this violence stands for the war itself and what these men face. Now our final act of the symphony is what happens after the horrors of the prison camp. Michael becomes a prominent character here as he returns home and is welcomed as a hero by his townsfolk and his girlfriend Linda (Meryl Streep). But Michael does not feel like a hero. Steven is in the hospital after losing his legs and Nick is somewhere in Vietnam still. Michael eventually goes back to find Nick who happened to take his roulette experiences to heart by playing this game professionally. This section is incredibly sad and moving as here we see what exactly war can do to strong-willed men. It was horrible to watch this transformation on screen. To see these characters we got to laugh with in the first part to seeing them play with death in the final act is sad to see. We also get to see an act of patriotism (or is it?) when the survivors join in a ragged rendition of \"God Bless America\" in the very end. This movie has a very strong cast, although the only star at the time was Robert De Niro. De Niro instantly became the film's leader and he played Michael very well. He became a bona fide star after his work in The Godfather: Part Two, and he put that stardom to work here. Christopher Walken had some of the strongest scenes in the movie because of his involvement with the deadly game of Russian roulette. Meryl Streep is one of the greatest actresses ever to grace our screens, and this was one of her first big roles. We end this paragraph with a sad note. This would be the last movie John Cazale would play because he was suffering from terminal cancer and he died before the film was released. He was very good as Stan, but you can tell in the movie that he was really sick.Michael Cimino's The Deer Hunter is a incredible movie about the horror of wars and it effective covers themes ranging from PTSD to male bonding and friendship. It was one of the first movies to successfully cover the Vietnam War, although I'd say this film may not be the most accurate regarding the actual war. I do commend its effort on conveying the themes of general war though. This film was nominated for nine Oscars and it won five of them including Best Picture. Walken took home the statue for his amazing and tense performance as Nick. The film may be controversial and it may be hard to watch, but it's one you'll remember forever. My Grade: A-"
    },
    {
      "username": "ldadvantageinc",
      "userUrl": "https://www.imdb.com/user/ur16001648",
      "reviewLink": "https://www.imdb.com/review/rw2663017",
      "warningSpoilers": true,
      "date": "22 August 2012",
      "rate": "10",
      "helpful": "211 out of 253 found this helpful.",
      "title": "A veteran's impression of \"The Deer Hunter\"",
      "content": "I will not repeat much of the comments in the previous positive reviews, but will stick mostly to how the movie affected me. First off, I am an Army veteran of the Vietnam War. Thus there is much in this picture that deeply moves me. I still can not listen to the theme music piece played by John Williams, \"Cavatina\", without choking up and weeping.I identify much with the characters in this movie. I grew up in a very small town and come from a working class ( Norwegian, Scots-Irish, English) background. Two weeks out of high school and at the age of 17 I enlisted in the Army. Like the men in this movie I came from a tradition of serving one's country in the military. Both my brother, two cousins and my future brother-in-law also served in the Vietnam War.I identify with Michael, played by Robert DeNiro in his sense of honor in going back to 'Nam and trying to bring back his buddy Nick. Additionally I admire Mike when he visits Steven in the VA hospital and brings him back home. Honor is, as mentioned in the movie \"Rob Roy\", a gift a man gives to himself. Michael (and the movie) doesn't waste time on whether the war in Vietnam is right or wrong. Michael just does what he thinks is right with respect to his buddies. Ask any one who has served in the military and they will tell you that you're sense of commitment to your comrades almost takes precedence over your commitment to your country.I do not see this movie as either pro or anti-Vietnam War. To me the movie portrays how war affects three individuals. It is a movie about character, honor, loyalty------what you are when everything around you is falling apart. I will continue to see this movie many times as I hope that the values depicted in it will still be reflected (albeit weakly) in me.In closing, I can not help to remember that the politically anti-Vietnam War movie \"Coming home\" starring Jane Fonda and Jon Voight was also up for the same Oscars. When Jane Fonda was asked what movie would win the Academy award that year, she sneeringly replied that she hoped it wasn't \"The Deer Hunter\". In the years since Jon Voght has transitioned from being a Liberal to a Conservative. Parenthetically, Jane Fonda has never apologized for her pro-Viet Cong actions. At the age of 66, I am still proud that I served my country and volunteered for the US Army and the Vietnam War."
    },
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0159159",
      "warningSpoilers": true,
      "date": "15 March 2002",
      "rate": "",
      "helpful": "110 out of 172 found this helpful.",
      "title": "Goodness. So Heartbreaking, So Sad, So Accurate, So Brilliant.",
      "content": "Outstanding and haunting Best Picture winner of 1978 that still packs a punch nearly 25 years later. Robert DeNiro (Oscar-nominated), Christopher Walken (Oscar-winning for Best Supporting Actor) and John Savage are on their way to fight for their country in Vietnam. The three are in for a rude awakening from their simple lives in a small steel town in Pennsylvania. The terrors of Vietnam will change all. DeNiro, an avid deer hunter, cannot stand to even shoot a gun after he returns. Savage loses his legs and is too ashamed and scared to return home to his new wife and friends. Walken has lost it mentally and stays in Vietnam and develops the taste for Russian roulette. The movie is a trial to sit through in many ways, but it is also an important film that was the first commentary on the topic of Vietnam. Meryl Streep also received her first of a record 12 Oscar nominations as Walken's love interest. John Cazale was deathly ill during the making of the movie and died shortly after the film was completed of terminal cancer. Michael Cimino's amazing Oscar-nominated screenplay and out-of-this-world Oscar-winning direction are right on key. \"The Deer Hunter\" is important film-making that has a strong message about life, death and love. It is a movie that should be experienced by everyone at least once. 5 stars out of 5."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw1779420",
      "warningSpoilers": false,
      "date": "12 December 2007",
      "rate": "9",
      "helpful": "30 out of 43 found this helpful.",
      "title": "One Shot",
      "content": "I can identify a lot with The Deer Hunter because my mother's family were of Ukranian background and my relatives on her side were a whole lot like the people we see here from Clairton, Pennsylvania. They worked in the same factory jobs that these men do and answered the call of their country at war, but in a whole different time. And the grandson of one my uncles recently served in Iraq as a marine.Make no mistake about it, these people for all their personal faults are the backbone of America. They are the folks whose blood gets spilled in the wars we fight. So when they are called it had better not be in an unrighteous or fruitless cause.Robert DeNiro, Christopher Walken, and John Savage are three mill workers from small town Clairton, Pennsylvania. All from Slavic background as my family is and in a time when those of us more educated and more sophisticated and knowing better dodge the draft, these guys enlist and go to Vietnam. The Deer Hunter is about the effects of that war on all of them and all around them.John Savage gets overlooked a lot with both Robert DeNiro being nominated for Best Actor and Christopher Walken winning for Best Supporting Actor, but Savage is the guy most physically damaged, losing a leg as a result of the escape all three make from a Viet Cong prison. He's growing quite accustomed to what he calls the country club of the VA hospital he's in and can't bring himself to come home.Robert DeNiro is a hunter on weekends, as were some in my family. But the sure marksman from before Vietnam, after having to kill people to stay alive, is not about killing defenseless deer any longer. Meryl Streep plays the woman who loves both DeNiro and Walken and she's so totally immersed in her role and her role's ethnic background, I could swear she was one of my relatives.Christopher Walken will blow you away with his performance of the man totally unhinged by his capture with the Viet Cong and the Russian Roulette games they play with the captives. His final confrontation with DeNiro will move you beyond words.Michael Cimino who directed and co-wrote the screenplay got an Oscar for the film and himself and deserved every bit of it. Acclaimed the new genius of the cinema, his next project proved to be an overblown disaster, Heaven's Gate. Not that that film was as bad as it was made out to be, but Cimino's career plummeted and never really got back on track.28 years later I remember the Oscar ceremonies in 1979 when a dying John Wayne presented the Best Picture Oscar for The Deer Hunter. Ironic also because one of the cast member, John Cazale who played one of the friends in Clairton and best remembered for being Freddo Corleone in The Godfather also was dying of cancer while the film was being shot.Although I find it a bit too coincidental that three men from the same small town who join the Army would have the exact same service record, The Deer Hunter isn't really about the Vietnam War. It's about war and what it can do those that serve and to those around them.And this review is dedicated to those that serve."
    },
    {
      "username": "ofumalow",
      "userUrl": "https://www.imdb.com/user/ur0744115",
      "reviewLink": "https://www.imdb.com/review/rw6847949",
      "warningSpoilers": false,
      "date": "25 April 2021",
      "rate": "6",
      "helpful": "28 out of 38 found this helpful.",
      "title": "Devastating at the time, uneven and problematic now",
      "content": "I hadn't seen this movie since it came out 43 years ago, at which point it seemed overwhelming--not perfect, just overwhelming in its scope and intensity. Of course, I was only 17 then, most of the actors were very new to audiences, and much of the content seemed groundbreaking as well as shocking. Seeing it all this time later, inevitably the credibility of the leads as \"ordinary steeltown folk\" would be a bit overshadowed by their familiarity from subsequent decades of stardom. Plus we've had lots of films about the Vietnam War since, and of course the violence is no longer very shocking.But \"The Deer Hunter\" has other problems now--problems it always had, I guess, but which weren't so apparent at the time. The screenplay has scope, yes, but the storytelling just kind of lurches from one incident to another with little connective thread, transitional material or real character development, and the dialogue often sounds improvised, as in kinda-feeble. (Cimino is on the record as saying he told Streep she could improvise dialogue, because in the script her character was basically a complete blank.) There are huge setpieces yet almost no transitions between them,The whole \"Russian Roulette\" thing is problematic not just because it's a gross distortion historically, but because even as a fictive leap of the imagination, it fails-first it's just part of the movie's one-note portrayal of the Viet Cong as monsters, then it's a ludicrous underground civilian pastime that one character even more ludicrously makes his \"living\" at. (Really? That would go on for months? Years? How long can anyone's luck hold out?) The hunting sequences meant to lend some mythic dimension here are just heavy-handed and absurdly action-packed; did no one tell Cimino that 99% of such hunting is patient waiting? The scenes meant to be \"everyday life\"--notably that long, busy wedding party--are so overstuffed with forced joie de vivre and actorish \"business,\" they now feel more mannered than \"natural.\" (And yes, that definitely applies to the always-controversial \"God Bless America,\" which the movie no longer has enough emotional potency to pass off as cathartic rather than a dramatic limb that shouldn't have been gone out on. I'm not a big fan of John Williams' often syrupy score, either--this film needs something edgier.) It's a bit sad that this is John Cazale's last movie, because his typical problem-causing-weakling character is almost completely extraneous here--he only gets in the way, to a degree where one wonders why any of other figures tolerate him.It's an alternately pretentious and broad movie that nonetheless is visually very well-crafted and has some powerful scenes. It's a pity this director didn't have a slower rise to the top, because winning Best Picture etc. Clearly made him oblivious to his shortcomings (mostly in the realm of storytelling), which became catastrophically clear when he was given free rein with \"Heaven's Gate.\" If that movie seems to have been considerably underrated, \"The Deer Hunter\" now looks greatly overrated. They're both impressively scaled, problematic, great-looking, mixed-bag films by a talented director who needed to be kept on a much shorter leash to maximize his strengths and minimize his self-indulgences, and who proved his own worst enemy in recovering from such a drastic reversal of fortunes.\"The Deer Hunter\" remains an interesting film, very effective in individual elements if awfully disjointed as a whole. But it certainly would look a lot better now if it hadn't been greeted as a \"masterpiece\" in the first place. It can no longer live up to a reputation it may never have deserved, but which made sense in the cultural moment of its initial release. What impresses now is film's messy ambitiousness, not so much what it actually achieves. In that latter department, you'd have to say that the best movie Cimino ever made remains his first (and smallest), \"Thunderbolt and Lightfoot.\""
    },
    {
      "username": "movieguy1021",
      "userUrl": "https://www.imdb.com/user/ur1303993",
      "reviewLink": "https://www.imdb.com/review/rw0159381",
      "warningSpoilers": true,
      "date": "18 January 2004",
      "rate": "10",
      "helpful": "142 out of 222 found this helpful.",
      "title": "The Deer Hunter: 10/10",
      "content": "Most young people today need to learn that Robert De Niro was not just the person in Meet the Parents or The Adventures of Rocky and Bullwinkle, but he starred in films like The Deer Hunter, which got him to where he is today. Not only is he a great actor, he always picks good films to act in. And with a strong supporting cast, also, you can't really go wrong with The Deer Hunter. Michael (De Niro), Nick (Christopher Walken), and Steven (John Savage) sign up to go to Vietnam. They leave after a farewell party/wedding party for Stanley and Angela (Rutanya Alda). Once in the midst of the war, they are forced into playing Russian Roulette and eventually they escape, but none of them can forget the experiences from the war. It's sad to see that Michael Cimino fade from view, because his direction here is really memorable and it's what holds the film together. There's about 70 minutes in the beginning of the film that has nothing to do with the rest of the film, but it gets us to know these three main characters, and it seems like you wouldn't care if they even went to Vietnam, because you certainly were intrigued by these three people. And once they're in the perils of war, you feel enough for these three basic people to get through the war. The Russian Roulette scenes are harrowing, even when it's a complete stranger who has the gun to their head. I read that to get the tension on set, a live bullet was put into the gun, but it was checked to make sure that it wasn't the one about to be shot. And, since you've known these people for 90 minutes already, you obviously didn't want them to die, making them all the more nervous. The Deer Hunter is quite unlike another great Vietnam film, Full Metal Jacket. While FMJ just showed the immediate results, this movie showed the results immediately and in the future, back at home. This helped make everything seem more realistic, which it was. For each of the three main characters, the war has changed them greatly, and none for the better. De Niro is great, but the stand out here is Walken, who accurately takes his role and makes it into something memorable. Thankfully, he won best supporting actor. Meryl Streep was nominated as a supporting character, deservedly. However, this movie is not all about the acting, it's about the feeling you get. As one character says, 'I don't know how I feel.' That's exactly how you'll feel after seeing this tour-de-force. My rating: 10/10 Rated R for strong language and violence."
    },
    {
      "username": "Michael_Elliott",
      "userUrl": "https://www.imdb.com/user/ur13134536",
      "reviewLink": "https://www.imdb.com/review/rw3498442",
      "warningSpoilers": false,
      "date": "3 July 2016",
      "rate": "",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Emotionally Draining But Incredibly Powerful and Haunting",
      "content": "The Deer Hunter (1978) **** (out of 4) Michael Cimino's masterpiece about three friend (Robert DeNiro, John Savage, Christopher Walken) whose lives we see before, during and after the Vietnam war.THE DEER HUNTER ended up winning five Academy Awards including Best Picture, Best Director and Best Supporting Actor for Walken. The film was a hit at the box office and won all sorts of critical acclaim but I still think the film is quite underrated as it's one of the most draining and emotional films ever made. It's certainly not a fun or pleasant movie to watch but there's no question that Cimino made something incredibly powerful and at times shocking.The film might have been praised but some threw a lot of criticism at it including some of the Vietnam scenes dealing with the Russian roulette. Many have said that the most powerful scenes in the movie were nothing more than a work of fiction but I find this to be a rather silly complaint because this was a movie and not a documentary. These scenes are some of the most powerful moments in film history so to say the film would have been better off without them is rather stupid. The scenes in Vietnam with the solders being forced to play against one another are among the most intense scenes you will ever see.Another bit of criticism is aimed at Cimino and his decision to make the wedding sequence last for fifty-two minutes. Personally speaking, I think this was a great decision and the other two-thirds of the film wouldn't have been as powerful without such a long opening. Not only do we get to know all of the characters involved but a lot of the stuff that happens here pays off later in the movie. One of the most powerful and telling scenes deals with a soldier who comes to drink at the bar and is confronted by DeNiro. I'm obviously not going to spoil anything but this plays an important part later in the picture on the mental state of his character.Speaking of DeNiro, he once again delivers a marvelous performance and especially since he's the main character in the movie and must play so many different emotions. The actor perfectly nails the character and really brings a lot of heart and soul to the picture. The ensemble cast really does a remarkable job here with Meryl Streep showing what greatness was to come with her. Walken deserved his Oscar for his heartbreaking performance. Savage, George Dzundza, Chuck Aspegren and John Cazale are all equally wonderful as well.Technically speaking the film is quite flawless with some masterful cinematography from Vilmos Zsigmond as well as a haunting and incredibly moving score by Stanley Myers. THE DEER HUNTER is without question one of the most depressing and emotionally draining movies that you'll ever see but it's also a masterpiece and one of the greatest films ever created."
    },
    {
      "username": "mikeand1-1",
      "userUrl": "https://www.imdb.com/user/ur5349913",
      "reviewLink": "https://www.imdb.com/review/rw1085136",
      "warningSpoilers": false,
      "date": "21 May 2005",
      "rate": "10",
      "helpful": "372 out of 490 found this helpful.",
      "title": "It's about character development",
      "content": "A comment re the other comments: A lot of the comments criticize the first half hour as being too long. In my opinion, these comments miss the point of the movie.Of course many of the scenes in the first hour don't advance the narrative. They're not supposed to; they're for character development.The whole point of the movie is to show us how the various characters were affected by the war. It wouldn't have worked nearly as powerfully as it does had the first hour been trimmed down. We have to sense the careless and frat-boy-like immaturity of these young men. That's why the scenes all revolve around frivolity and seemingly senseless boyish behavior; it creates such a stark contrast to the devastated characters of the three who went to war (and the relatively unaffected personalities of those who stayed behind, like Stanley).The strong points of the film are the outstanding performances of nearly every actor in the movie. Yes, there are technical deficiencies in the sound, but it hardly matters. This is nitpicking compared to the overall construction of the film."
    },
    {
      "username": "kevandeb",
      "userUrl": "https://www.imdb.com/user/ur2214582",
      "reviewLink": "https://www.imdb.com/review/rw1268497",
      "warningSpoilers": false,
      "date": "18 January 2006",
      "rate": "10",
      "helpful": "120 out of 184 found this helpful.",
      "title": "Immense poignancy",
      "content": "I cannot fathom the absolute horror that war brings to a persons life, but never has a film depicted it more harrowing than The Deerhunter. At 182 minutes, it seemed to fly by, leaving me wanting more and wishing this would not end. all facets are explored, all people's emotions are laid bare, not just the combatants. If we obviously did not know better, one would have to say this was a British film, as it has all the best elements that British movie making displays. i can eulogise for hundreds of lines, but this really is the ONLY American movie i can think of (others? apart from taxi driver) that is RAW. A strange word i know but the movie oozes a raw edge to it. Immense performances from all concerned, and if i had to say, i believe i have not seen Christopher Walken in a better role. One of the very few films i deservedly give 10/10. A must for any collection and a stunning example of every aspect of film making coming together, albeit for a sombre depiction of life."
    },
    {
      "username": "Danherb",
      "userUrl": "https://www.imdb.com/user/ur2739712",
      "reviewLink": "https://www.imdb.com/review/rw1114944",
      "warningSpoilers": false,
      "date": "30 June 2005",
      "rate": "9",
      "helpful": "54 out of 75 found this helpful.",
      "title": "Touching drama about the ruin of a group of men's friendship by war",
      "content": "\"The Deer Hunter\" is not a film about the Vietnam war, as it is wrongly said in many cases.\"The Deer Hunter\" is a film tells the story of 3 friends within about 5-6 years, during which their friendship is repeatedly put to the test.It is primarily a picture of the contemporary life of a group of people around 30 living in a small American town during the Vietnam war.The first hour of the film portrays the every day life of three friends Mike (De Niro), Steven (Savage) and Nick (Walken), who look forward to Steve's wedding but at the same time have to prepare for their commitment in Vietnam. The main actors (above all De Niro and Walken) perfectly picture the character's inner conflict between their easygoing home town life and the forthcoming assignment in Vietnam. Despite this conflict the characters don't show their concerns to their environment.Particularly Nick is worried about him and his friends leaving his home town and perhaps never coming back, but he only tells his best friend Mike of his thoughts, who is much more resolute and sees their engagement as a strong masculine act.Cimino manages to show the simple irrationality of young men, going to a senseless war from which they might never return for the only purpose of glory and approval, and abandoning their settled and happy life for it. The spectator just can't understand why those young men voluntarily sign for the army and give up everything they have. The passage from the small-town-idyll to the war cruelty is greatly pictured. Cimino does not show the three friends' way to Vietnam or the training, he immediately switches from a happy get-together to the cruel war captivity of the Vietcong. This passage perfectly underlines the contrast and the inexplicability of the three men's actions.Although the passage that is set in Vietnam is only about one third of the whole film long, the war is omnipresent at any time, which is probably the best benefit of the whole film, Cimino does not need to bomb the spectator with pictures of crying children, mutilated soldiers or desert battlefields in order to illustrate the cruelty of war. Far from it! The changed behavior of all characters after the friends' returns tell more about wars' capability of changing someone's life, than anything else.And the fact that the many dreams that these three friends had before they went to Vietnam didn't come true, because of their longing for recognition by becoming an acclaimed veteran can even pluck your heartstrings.Cimino's great directing and the cast's awesome acting provide for a touching and honest drama about the friendship of a group of young men, that is destroyed by the Vietnam war."
    },
    {
      "username": "dbdumonteil",
      "userUrl": "https://www.imdb.com/user/ur1219578",
      "reviewLink": "https://www.imdb.com/review/rw1545773",
      "warningSpoilers": false,
      "date": "15 December 2006",
      "rate": "10",
      "helpful": "116 out of 208 found this helpful.",
      "title": "to call it masterpiece is to state the obvious",
      "content": "Of the first two American films about the Vietnam war with a priceless artistic weight, \"the Deer Hunter\" wins hands down over \"Apocalypse Now\" (1979) although Francis Ford Coppola's work is very potent too.But would it be judicious to pigeonhole Michael Cimino's work in the category of the war movie? Unlike Coppola's visual nightmare, only the central part takes place in Vietnam and the filmmaker barely shoots one fight sequence before Mike (Robert De Niro), Nick (Christopher Walken) and Stevie (John Savage) are prisoners of the enemy and are forced to play Russian roulette in the notorious unbearable scene. Actually \"the Deer Hunter\" is a film straddling two movie genres: the war movie and the social drama. Rather than shooting a political film, Cimino chose to represent us the deadly impact this nightmarish war had on an American community whose hopes and values disappeared.Dividing his work in three parts: before, during, after and thanks to symbolical images, scenes or even eloquent details, Cimino used and honed his own cinematographic language to set out his stalls and the result can only command respect and admiration. Each sequence could be separately taken and carefully studied like the representation of the humdrum but reassuring living standards of the blue-collars with their everyday rituals (Cimino's obsession with rites and customs) revolving around factory, bar, friends and hunting (you have to admire the startling contrast between the dirty little town and the gorgeous, wild landscapes). Archetypal sequences that epitomize life and it reaches its height in the famous, unusually long wedding sequence. Perhaps Cimino wanted to stretch this sequence to make his characters take advantage of this rapture moment. But even during this state of bliss that lives inside them, the imminent tragedy ominously lurks: Mike and Nick gently laugh at an officer who remains dumb and when Stevie and his wife have to drink in a dish, some drops fall on her wedding dress. This sequence also epitomizes the polar opposite to the sequence of the Russian roulette in which death is just around the corner. After the war when Mike comes back to the small town, he's completely altered. Before, a devotee of deer hunting; after his traumatizing experience, he can't kill one. He's unable to talk about about what he went through and for his sidekicks, the experience of a war like this one is incomprehensible. Cimino eschews classical, predictable storytelling and hasn't recourse to psychological study. Nearly everything occurs in gestures and looks while the suggested has a meaty part in the dialogs. Besides, during the whole movie the topic of the war is barely mentioned by the characters. A lyrical whiff blows on the film, dovetailed by Cimino's astounding directing.Cimino was consumed with ambition and went at it hammer and tongs to get his crew completely involved in his project. He was hard on his actors (Robert De Niro has often said that \"the Deer Hunter\" was his most grueling role to date) and was obsessed with absolute control. But the efforts weren't vain at all and gave a heartfelt, invaluable yardstick in war movie, even American cinema which reached the streets when America rose from its ruins. It was also the beginning of the end for Cimino, a filmmaker ahead of his time and on the fringe of cinematographic trends."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1868619",
      "warningSpoilers": true,
      "date": "4 May 2008",
      "rate": "9",
      "helpful": "43 out of 70 found this helpful.",
      "title": "Cimino's film is undeniably powerful in its depiction of Pennsylvania steel worker's initiation into warfare and its after-effects",
      "content": "Opening in Pennsylvania steel town that morning, Steven (John Savage) is going to get married Just a few days later, he and his best friends Michael (Robert De Niro) and Nick (Christopher Walken) will join the Army and go to Vietnam All three are made prisoners of war who finally escape their ordeal, although with several complications The terrible experiences that they are subjected to change their whole life Over the course of more than three-hours of screen time, \"The Deer Hunter\" presents outrageous and impressive scenes of sadistic Vietcong force tossing grenades into shelters filled with helpless women and children, and later forcing American captives to play Russian roulette for their amusement, while the prison guards bet on the result Whatever his intention, Cimino goes courageously forth, staging with power his big end during the fall of Saigon, depicting the trauma of war and the effort of one friend to rescue the other The extreme effects of the conflict provide indelible images, and make us feel the pain, the compulsion, the threat, and the terror of war"
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw3731315",
      "warningSpoilers": true,
      "date": "15 June 2017",
      "rate": "3",
      "helpful": "35 out of 58 found this helpful.",
      "title": "A bloated bore.",
      "content": "Three friends, Mike Vronsky (Robert De Niro), Steven Pushkov (John Savage), and Nick Chebotarevich (Christopher Walken), find their lives affected in different ways by the horrors of war.50 minutes, give or take a few: that's how long the opening wedding sequence takes in Michael Cimino's The Deer Hunter. It starts with the preparation, followed by the ceremony itself, and finishes at the reception where there is much drinking and dancing. It's about as much fun as being at a real wedding where you know none of the guests (other than your partner) and are forced to remain sober because you're the one doing the driving home. You want it all to end as soon as possible, but your other half insists on just one more drink (and another, and another) while she chats with all of her friends.Having bored the viewer to death with the wedding, Cimino then proceeds to numb the senses further with some dreary hunting scenes in the mountains, after which the film finally cuts to Nam for a little war action. Here we are treated to the infamous Russian roulette torture sequence, which is arguably the highlight of the film, both suspenseful and terrifying. But don't worry, we're soon back to the drudgery as the main characters escape capture, Mike returning to his steelworks hometown, Nick remaining in Saigon (to earn cash by taking part in Russian roulette games in seedy gambling dens), and Steven recuperating in a veterans hospital. Eventually, Mike decides to find Nicky and bring him home, which he does—with a bullet in his head, his luck having finally run out.Winner in 5 categories at the 1979 Oscars: Best Picture, Best Actor in a Supporting Role, Best Director, Best Film Editing (seriously?), and Best Sound. Superman The Movie might have only won one Academy Award that same year, for Visual Effects, but I'd rather watch a man fly than hunt deer any day of the week."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2815632",
      "warningSpoilers": true,
      "date": "18 June 2013",
      "rate": "",
      "helpful": "48 out of 81 found this helpful.",
      "title": "Magnum Hopeless",
      "content": "\"The story we tell ourselves about ourselves in order to account for what we are doing, is a lie. The truth lies outside, in what we do.\" - Zizek A near scene-for-scene remake of 1939's \"The Four Feathers\", Michael Cimino's \"The Deer Hunter\" tells the story of several friends (Robert DeNiro, Christopher Walken) from small town Pennsylvania. Early sequences watch as the gang work in a steel mill, congregate and go on hunting expeditions. Cimino's photography, aided by cinematographer Vilmos Zsigmond, is exceptional throughout, but his film quickly nosedives into pretentious, unintentionally funny territory. Cimino indulges in a prolonged wedding sequence (cribbed from Coppola who cribbed from Visconti), filters \"Best Years of Our Lives\" through a Vietnam era prism, has DeNiro run about naked like a Method Actor fishing for Oscars, and treats us to a forced sequence in which our heroes play Chopin on a piano whilst looking REALLY REALLY SERIOUS. This is a deep movie, see.The hell of Industrial America then becomes the hell of the Vietnam War. Here our heroes, now American soldiers, watch North Vietnamese \"savages\" kill civilians. They're then captured by the Vietnamese and made to play Russian Roulette. They survive this ordeal, but Walken's character is pushed into madness and begins to play Russian Roulette for money in a Saigon gambling hall. Symbolically unable to escape the damage done by Vietnam, he spends six years there, gambling with bullets. You'd think the law of averages would catch up with him, but no.\"Don't leave me over there,\" Walken tells his buddy DeNiro, which leads to DeNiro having the longest delayed reaction in the history of cinema. Eight years later he goes back to Saigon in the hopes of finding Walken, a missing person's search which is apparently really easy. They find each other, Walken commits suicide (partially to punish - and prove his love to - \"best man\" DeNiro), the film ends with a funeral and a silly, unearned scene in which our gang sing \"God Bless America\". You can feel Cimino straining with every scene to make a GREAT EPIC. The film won five Oscars.Like most Vietnam war movies, \"Hunter\" hinges on romanticised madness. Deer hunting becomes a metaphor for \"virtuous, humane kills\" and Russian Roulette becomes a metaphor for the madness inducing chaos of Vietnam. As is typical of racist war films, the Vietnamese are portrayed as grinning (their dialogue is not even Vietnamese), Oriental savages (introduced with propagandistic scenes showing the NVA killing babies and women) and the \"reason\" for US defeat is sidestepped by making the Vietnam war itself incomprehensible. Where else but in a wholly irrational country could the US lose a war? Whilst several sequences play with irony (Russian-Americans playing Russian roulette etc), Cimino's tale is one of solemn tragedy. An account of what evil, sadistic, barbaric Vietnamese did to poor, innocent Americans, the film, like \"Apocalypse Now\", oozes macho self pity with a dash of counter-culture disillusionment and strained appeals to high culture (Conrad, Eliot, Chopin songs, Orthodox hymns etc). The film is silly elsewhere, with random helicopter rescues, love triangles, many cheesy \"dramatic\" scenes and exploitative Roulette sequences (why's everyone in Saigaon playing Roulette?) which Cimino shoe-horned from another Las Vegas themed script he was working on. Some critics, like Jonathan Rosenbaum, spotted the film's hokiness right away. Pulitzer Prize winner Peter Arnett would call it a \"simplistic lie\".As with most war movies, the overriding message is \"look what they did to us\". Cimino perpetuates the racist stereotype that sustained much of America's involvement in Indochina, and hides behind designer madness and much irrationality. Compare to Pontecorvo's \"Burn!\", which offered a clear analysis of imperialist expansion, and \"In the Year of the Pig\" and \"Hearts and Minds\", two documentaries which the CIA waged war upon and whose theatres met with bomb threats.In 2012, the Pentagon began The Vietnam War Commemoration Project, a 13 year, 65 million dollar propaganda effort to clean up the image of the Vietnam war. What are they covering up? The fact that the North Vietnamese constituted a political movement with near total local, popular support, that the US artificially divided Vietnam in disregard of Geneva negotiations (becase Eisenhower knew over 80 percent of the population would vote for Ho Chi Minh), that the US put in place and backed psycho puppet leaders, that even the South didn't support the US, that the US did everything it could to prevent unification and scuttle elections, that 4 million Vietnamese died, that more bombs were dropped than in all previous wars combined, that tens of thousands were assassinated by the CIA's Phoenix Program, that nukes were threatened 13 times, that US land-mines still kill Vietnamese to this day (52000 and counting), that millions of gallons of poison, herbicide and chemicals were used, that US campaigns in Cambodia were directly responsible for the rise of the Khmer Rouge under Pol Pot (later supported with 89 million dollars) and the genocide which took place afterwards, that the first Tonkin Gulf incident was started by US aggression, that the second never happened, that over five million villagers were forcibly displaced, that political prisoners were jailed/tortured in \"tiger cages\" and that 90 percent of Northern levees, hospitals, villages, towns and industries were intentionally bombed. The US has similarly destabilised over 80 countries in the past 100 years. And yet here's a film with the NVA torturing small-town Americans.During and after the Iraq war, US soldiers committed suicide at a rate of 1 every 25 hours. This figure doesn't include attempted suicides (roughly 1900 in 2009 alone). In Vietnam, the number of US suicides totalled about 150,000. In real life, these vets were trapped in a double bind, unable to reconcile their belief that their conflict was righteous with their actual deeds; they thus nihilistically self-destructed. Cimino wants you to believe the opposite; that the NVA pushed men to suicide.3/10 – Depressing."
    },
    {
      "username": "AaronCapenBanner",
      "userUrl": "https://www.imdb.com/user/ur23589178",
      "reviewLink": "https://www.imdb.com/review/rw2864999",
      "warningSpoilers": false,
      "date": "7 September 2013",
      "rate": "5",
      "helpful": "18 out of 27 found this helpful.",
      "title": "Heartfelt But Unconvincing.",
      "content": "Michael Cimino directs this long character study & war picture that follows a group of friends from a wedding, to a deer hunting trip, to finally the Vietnam war and its aftermath. Over three hour film details their lives before & after the war, on both the men and their families.Fine cast includes Robert De Nero, Christopher Walken, and Meryl Streep, who all deliver heartfelt and believable performances, but the trouble is that the extended POW sequence involving Russian Roulette just feels so bizarre and extreme, that I had a hard time buying it, especially when one of the characters becomes obsessed with it after their ordeal is over. Somehow, this drags the film down, and by the end, instead of feeling emotionally drained(like many of the audience claimed) the film felt emotionally muted, like it had gone too far afield and lost sight of what it was supposed to be about.Still, a minority view I suppose, since it did win an Academy Award for best picture and director."
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw2304604",
      "warningSpoilers": true,
      "date": "2 September 2010",
      "rate": "1",
      "helpful": "204 out of 389 found this helpful.",
      "title": "Boring, historically inaccurate and FAR too long",
      "content": "Story about three buddies (played by Robert DeNiro, John Savage and Christopher Walken) going off to Vietnam. They're all gung ho about going and aren't prepared for what they experience. They all return home--one mentally affected, one physically handicapped and one dead.This came out in 1978 and was immediately hailed as a masterpiece. It was one of the few movies that dealt with Vietnam realistically (somewhat). It also really hit a lot of Vietnam vets and young guys hard. A friend of mine went to see it and after it was over he was in the mens room and saw 4 guys in their 20s crying nonstop. I saw it around that time. I was in high school and was bored silly. I figured at the time I was too young to appreciate it. I saw it years later and was STILL bored.For starters--it's too long--3 hours. The wedding sequence at the beginning goes on and on and ON. You learn nothing more about the characters than you could have in about 10 minutes. Even after they return home it moves slowly. The Russian roulette sequences (which were VERY hotly debated) never happened in reality. There's no proof at all that it ever happened. Also one character makes a living out of playing Russian roulette???? Come on! The Vietnamese are portrayed as victims or monsters--very black and white. No shadings of character. With the sole exceptions of DeNiro, Savage and Meryl Strepp the acting sucks. Seriously--HOW did Walken get an Oscar for this? DeNiro should have gotten it. And the irony at the end (when they're all singing \"God Bless America\") was SO heavy-handed it was almost comic. Wildly overpraised and overrated. This does not belong in the top 250 on IMDb. A 1 all the way."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3745695",
      "warningSpoilers": false,
      "date": "4 July 2017",
      "rate": "7",
      "helpful": "19 out of 30 found this helpful.",
      "title": "Uneven but often very impressive",
      "content": "Considering the cast, the critical acclaim and accolades 'The Deer Hunter' garnered, and still does garner, part of me was expecting much more. It is a long way from a bad film, in fact it's good and often very impressive, but it's also uneven in places.'The Deer Hunter' is by some way director Michael Cimino's best film, and it contains his best ever directing. That's saying a good deal, considering that only a few years later he would go on to direct the notorious flop 'Heaven's Gate' and his career never really recovered. 'The Deer Hunter' is considered by some one of the finest Vietnam films (don't quite agree, to me there are far better examples), but it is also perhaps the most controversial. Either viewpoint is very easy to understand.Despite its many impressive, outstanding even, elements, 'The Deer Hunter' is uneven. It is a bit too long (and no before anybody sneers, there have been films of similar length and even longer that still manage to be great films, a few among the best ever made), and would have been solved by tighter editing and a little less time on the lengthy wedding sequence, which is compelling with some strong character development but could easily have been trimmed.Parts are disjointed too, with some abrupt scene shifts and a heavy-handed patriotic ending that felt incredibly tacky against the rest of the film. There are deficiencies in the sound quality on top of all this.On the other hand, editing aside, 'The Deer Hunter' is an exceptionally well made film. The cinematography is quite magnificent and the attention to detail in the settings and the rest of the production both sumptuous and rich in atmosphere, the authenticity also remarkable. The music haunts the mind and is very beautiful, the mournful guitar theme unforgettable.Cimino is at his best in the director's chair, while the script provokes thought and the story is often incredibly powerful and moving. The highlight is the justly acclaimed Russian Roulette sequence, which today is genuinely harrowing and will stay with you forever.Robert De Niro has seldom been more restrained and gives an affecting performance. Even better is Christopher Walken, who has never reduced me to tears before and he really wrenches the heart here, making his character a compellingly real one and the most relatable one. John Savage, John Cazale (in his last film before his ultimely death) and a young Meryl Streep are sterling in support.In summary, uneven film but often very impressive with much to admire. 7/10 Bethany Cox"
    },
    {
      "username": "nafps",
      "userUrl": "https://www.imdb.com/user/ur85503622",
      "reviewLink": "https://www.imdb.com/review/rw6372206",
      "warningSpoilers": true,
      "date": "17 December 2020",
      "rate": "4",
      "helpful": "25 out of 38 found this helpful.",
      "title": "Those \"Viet Cong\" Are Speaking Thai...",
      "content": "Thousands of reviews, including by Vietnam War vets, and none of them noticed they were speaking Thai and not Vietnamese? Really? A year or more over there and you don't recognize that? Millions of Americans go to Thailand or Vietnam as tourists, and none of them noticed either?I bring this up because any drama in those war scenes was ruined. It'd be like watching a WWII film where the Nazis spoke French. You just couldn't take the film seriously.Not just that, but all the other war scenes were equally ridiculous. Hand held flame throwers? Nope, they were just used by armored vehicles. Hand held ones blow up easily.A rat cage in the middle of the river? Nope. US infantry as POWs? Unusual. Most were pilots shot down and held in the north.Going straight from the US into combat? Have they never heard of basic training? And friends are not going to be put into the same unit, not unless you have powerful friends to pull strings.Unlike many of the other poor reviews, I don't think the scenes at home were badly done. It shows the closeness of those friends, and how \"ethnic\" whites and working class whites were the only whites that were drafted. Even the long wedding scene I think worked very well.I think most of the higher ratings are looking at this through their personal experience at the time. No one else had yet made a major Vietnam War film and Cimino deserved credit for that.But it's really obvious he needed to talk to vets not to make all these ridiculous mistakes.ETA: I'm glad of the strong reactions to my review, both the downvotes and the higher than I expected number of up votes. Good to know some others feel the same."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0159351",
      "warningSpoilers": false,
      "date": "5 July 2003",
      "rate": "",
      "helpful": "40 out of 71 found this helpful.",
      "title": "Overlong and not as deep as it thinks but still a very good film",
      "content": "Three steel workers from a small town in Pennsylvania prepare to go to war in Vietnam. The night before they go, Steven is married, sparking a large celebration. The next morning they go deer hunting one last time in the woods before they leave. Time passes and the three meet up again in Vietnam as prisoners of war. Brutal mental torture affects them in different ways before they escape and are separated again. Back in Pennsylvania Michael realises the extent to which the war has not only affected him but devastated the lives of his friends in different ways.I have seen this film several times and I'll admit that I always assume that it is a classic film mainly because I saw it twice when I was in my early teens and was blown away by parts of it. I say this because I want to acknowledge that it may not be as great a film as many critics lists believe it to be, but at the same time I still watch it occasionally as I find it to be a moving story and a good film. The plot is moving if it is viewed on it's surface as a tale of three men whose lives are deeply affected by the war. Going past that to deeper themes I always feel that the film doesn't manage to be as deep as it thinks it is, so I try not to linger too long on these.The breakdown of the film gives significantly more time to events in the home town rather than Vietnam. This is as it should be  for many people the war was a fleeting thing that has stayed with them for much longer than they were actually involved. The wedding scene is a little overlong but it does serve as a chance to get to see the characters in their setting before we quickly move to the events that changed them and the people they become. The time in Vietnam is quite short but very memorable (many people who have never seen the film will still know these scenes) and the final hour or so of the film is moving even if it takes things to an extreme to make it's point.The cast make the film work as well, if not more, than the material itself. De Niro is the rock on which it all stands and is pretty good. The only weakness in his performance was that he was the one who had to be `the hero' type who does what he can. Walken gets the lion share of praise for his is the role that changes the most significantly throughout the film. It is easy to forget that he was not anywhere near as famous as De Niro at this time and it is amazing in that regard to see him hold his own. Savage gives a good performance and support is strong in the form of such actors as Cazale, Dzundza and Aspegren. Even Streep gives a performance refreshingly free of sentiment or forced accents.The film is a little overlong and could easily have lost 30 minutes (although not all from one place) to give it a tighter feel. Some scenes feel stretched beyond their useful duration leading to the feel that the film wanted to be 3 hours long, rather than being cut back to 3 hours long. Despite this though I still think this is a good film that is a powerful story at it's heart. I personally don't think it would make my top 50 (were I ever to do one) but I will watch it again."
    },
    {
      "username": "billcr12",
      "userUrl": "https://www.imdb.com/user/ur14295241",
      "reviewLink": "https://www.imdb.com/review/rw2591795",
      "warningSpoilers": false,
      "date": "4 April 2012",
      "rate": "5",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Tedious",
      "content": "Another mistake by the voters of the Academy Awards, The Deer Hunter won best picture for the one hit wonder, director Michael Cimino. It begins with three Pennsylvania steel workers before their adventures in Vietnam. A wedding scene drags on and on to the point of exhaustion ; we get it Mikey, these are regular middle class people celebrating a marriage, learn how to edit. After the wedding of the century, the boys are at war with its usual atrocities and mayhem all around. The three amigos from Pa are captured by the Vietcong and placed in a prisoner of war camp. The evil guards are bored, so they force the American soldiers to play Russian roulette for gambling and entertainment purposes. A cage immersed in water is used to further punish the invaders who finally escape their captors tower up a return to domestic bliss.The third act of a three hour plus marathon, has the boys returning to the USA and the after effects of the horrible experiences of combat. A hunting trip with symbolism and the meaning of life and death is beyond ridiculous. The Deer Hunter is a long and pretentious bore."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6138810",
      "warningSpoilers": false,
      "date": "1 October 2020",
      "rate": "8",
      "helpful": "14 out of 21 found this helpful.",
      "title": "The Deer Hunter Gatherer...",
      "content": "Nothing prepares us for a life in the so called modern world but we partake in the traditions passed on to us through family, friends and colleagues, at home, out socialising and in the workplace. It's called culture and, for the most part, it keeps us safe and secure, as the bonds we develop make us feel a part of the fabric but it's still psychologically a challenge to the hunter gatherers mind - increasingly so today.Put that mind into war, battles, conflict, abuse, threat and it's anyone's guess what might result. Put that mind into the events portrayed here, albeit quite extreme, and you have the basis for a fascinating insight into the cultural and social destruction that conflict can reap through individuals, as well as entire populations, and continue to do so long after the truce has been declared.Mix into the portrayal some of the finest actors of their generation, perhaps of all time, and you have a genuinely timeless anti-war reflection that, in itself, should be enough to dissuade the most sabre rattling politico, who genuinely cares about their citizens, to put their swords away and resolve any differences peacefully. Unfortunately, recent history suggests otherwise."
    }
  ],
  "errorMessage": ""
}