{
  "imDbId": "tt0077416",
  "title": "The Deer Hunter",
  "fullTitle": "The Deer Hunter (1978)",
  "type": "Movie",
  "year": "1978",
  "language": "en",
  "titleInLanguage": "The Deer Hunter",
  "url": "https://en.wikipedia.org/wiki/The_Deer_Hunter",
  "plotShort": {
    "plainText": "The Deer Hunter is a 1978 epic war drama film co-written and directed by Michael Cimino about a trio of Slavic-American steelworkers whose lives were upended after fighting in the Vietnam War. The three soldiers are played by Robert De Niro, Christopher Walken, and John Savage, with John Cazale (in his final role), Meryl Streep, and George Dzundza playing supporting roles. The story takes place in Clairton, Pennsylvania, a working-class town on the Monongahela River south of Pittsburgh, and in Vietnam.\r\nThe film was based in part on an unproduced screenplay called The Man Who Came to Play by Louis A. Garfinkle and Quinn K. Redeker, about Las Vegas and Russian roulette. Producer Michael Deeley, who bought the script, hired writer/director Michael Cimino who, with Deric Washburn, rewrote the script, taking the Russian roulette element and placing it in the Vietnam War. The film went over-budget and over-schedule, and ended up costing $15 million. EMI Films, who produced the film, released the film internationally while Universal Pictures handled its distribution in North America.\r\nThe Deer Hunter received acclaim from critics and audiences, with praise for Cimino's direction, the performances of its cast (particularly from De Niro, Walken, Cazale, and Streep), and its screenplay, realistic themes and tones, and cinematography. It was also successful at the box office, grossing $49 million. At the 51st Academy Awards, it was nominated for nine Academy Awards, and won five: Best Picture, Best Director for Cimino, Best Supporting Actor for Walken, Best Sound, and Best Film Editing. The film marked Meryl Streep's first Academy Award nomination (for Best Supporting Actress).\r\nDespite the film's critical acclaim and Academy Award success, some of the industry's most prominent critics derided what they viewed as The Deer Hunter's simplistic, bigoted, and historically inaccurate depictions of the Viet Cong and of America's position in the Vietnam War. The central theme of the Viet Cong forcing American captives to play Russian Roulette has been widely criticized as having no basis in history, a claim Cimino denied but did not refute with documentary evidence.\r\nIt has been featured on lists of the best films ever made, such as being named the 53rd-greatest American film of all time by the American Film Institute in 2007 in their 10th Anniversary Edition of the AFI's 100 Years...100 Movies list. It was selected for preservation in the United States National Film Registry by the Library of Congress in 1996, as being \"culturally, historically, or aesthetically significant.\"",
    "html": "<p>The Deer Hunter is a 1978 epic war drama film co-written and directed by Michael Cimino about a trio of Slavic-American steelworkers whose lives were upended after fighting in the Vietnam War. The three soldiers are played by Robert De Niro, Christopher Walken, and John Savage, with John Cazale (in his final role), Meryl Streep, and George Dzundza playing supporting roles. The story takes place in Clairton, Pennsylvania, a working-class town on the Monongahela River south of Pittsburgh, and in Vietnam.</p><p>The film was based in part on an unproduced screenplay called The Man Who Came to Play by Louis A. Garfinkle and Quinn K. Redeker, about Las Vegas and Russian roulette. Producer Michael Deeley, who bought the script, hired writer/director Michael Cimino who, with Deric Washburn, rewrote the script, taking the Russian roulette element and placing it in the Vietnam War. The film went over-budget and over-schedule, and ended up costing $15 million. EMI Films, who produced the film, released the film internationally while Universal Pictures handled its distribution in North America.</p><p>The Deer Hunter received acclaim from critics and audiences, with praise for Cimino's direction, the performances of its cast (particularly from De Niro, Walken, Cazale, and Streep), and its screenplay, realistic themes and tones, and cinematography. It was also successful at the box office, grossing $49 million. At the 51st Academy Awards, it was nominated for nine Academy Awards, and won five: Best Picture, Best Director for Cimino, Best Supporting Actor for Walken, Best Sound, and Best Film Editing. The film marked Meryl Streep's first Academy Award nomination (for Best Supporting Actress).</p><p>Despite the film's critical acclaim and Academy Award success, some of the industry's most prominent critics derided what they viewed as The Deer Hunter's simplistic, bigoted, and historically inaccurate depictions of the Viet Cong and of America's position in the Vietnam War. The central theme of the Viet Cong forcing American captives to play Russian Roulette has been widely criticized as having no basis in history, a claim Cimino denied but did not refute with documentary evidence.</p><p>It has been featured on lists of the best films ever made, such as being named the 53rd-greatest American film of all time by the American Film Institute in 2007 in their 10th Anniversary Edition of the AFI's 100 Years...100 Movies list. It was selected for preservation in the United States National Film Registry by the Library of Congress in 1996, as being \"culturally, historically, or aesthetically significant.\"</p>"
  },
  "plotFull": {
    "plainText": "The Deer Hunter is a 1978 epic war drama film co-written and directed by Michael Cimino about a trio of Slavic-American steelworkers whose lives were upended after fighting in the Vietnam War. The three soldiers are played by Robert De Niro, Christopher Walken, and John Savage, with John Cazale (in his final role), Meryl Streep, and George Dzundza playing supporting roles. The story takes place in Clairton, Pennsylvania, a working-class town on the Monongahela River south of Pittsburgh, and in Vietnam.\r\nThe film was based in part on an unproduced screenplay called The Man Who Came to Play by Louis A. Garfinkle and Quinn K. Redeker, about Las Vegas and Russian roulette. Producer Michael Deeley, who bought the script, hired writer/director Michael Cimino who, with Deric Washburn, rewrote the script, taking the Russian roulette element and placing it in the Vietnam War. The film went over-budget and over-schedule, and ended up costing $15 million. EMI Films, who produced the film, released the film internationally while Universal Pictures handled its distribution in North America.\r\nThe Deer Hunter received acclaim from critics and audiences, with praise for Cimino's direction, the performances of its cast (particularly from De Niro, Walken, Cazale, and Streep), and its screenplay, realistic themes and tones, and cinematography. It was also successful at the box office, grossing $49 million. At the 51st Academy Awards, it was nominated for nine Academy Awards, and won five: Best Picture, Best Director for Cimino, Best Supporting Actor for Walken, Best Sound, and Best Film Editing. The film marked Meryl Streep's first Academy Award nomination (for Best Supporting Actress).\r\nDespite the film's critical acclaim and Academy Award success, some of the industry's most prominent critics derided what they viewed as The Deer Hunter's simplistic, bigoted, and historically inaccurate depictions of the Viet Cong and of America's position in the Vietnam War. The central theme of the Viet Cong forcing American captives to play Russian Roulette has been widely criticized as having no basis in history, a claim Cimino denied but did not refute with documentary evidence.\r\nIt has been featured on lists of the best films ever made, such as being named the 53rd-greatest American film of all time by the American Film Institute in 2007 in their 10th Anniversary Edition of the AFI's 100 Years...100 Movies list. It was selected for preservation in the United States National Film Registry by the Library of Congress in 1996, as being \"culturally, historically, or aesthetically significant.\"\r\nPlot\r\nIn late 1968, three friends in a tight-knit Slavic American community in Western Pennsylvania—Mike, Steven and Nick—work in a steel mill and hunt for deer with their co-workers Axel, Stan and John. Mike, Steven and Nick are preparing to leave for military service in Vietnam. Steven is engaged to Angela, who was secretly impregnated by another man. Mike and Nick are close friends who live together and both love Linda, who will be moving into their home to escape from her alcoholic father. While dancing at Steven and Angela's wedding, Linda accepts Nick's spontaneous marriage proposal. Nick implores Mike to ensure he returns from Vietnam. Mike, Nick and their friends take a final deer hunt. Mike kills a deer with a single shot.\r\nIn Vietnam in early 1969, Mike, an airborne green beret, happens upon Nick and Steven in a village, but the three are imprisoned by the Viet Cong in a cage on the River Kwai and forced to participate in games of Russian roulette while the jailers bet. Steven fires his round at the ceiling and is forced into a cage with dead men and rats. Mike convinces his captors to put three bullets in the revolver's cylinder; Nick and Mike then use the pistol to escape.\r\nThe trio floats down the river but Nick's leg is shot; they are rescued by an American helicopter, but Steven falls back into the river. Mike drops down to help Steven while Nick is flown away. Steven's legs were broken in the fall, so Mike carries him until they meet refugees fleeing to Saigon.\r\nNick is treated at a U.S. military hospital. Once released, Nick now suffering from PTSD, wanders into a gambling den. French businessman Julien persuades him to come inside. Upset, Nick interrupts a game of Russian roulette, pulling the trigger on himself. Mike is present as a spectator, but Nick and Julien hurriedly leave.\r\nIn 1970, Mike returns home, but cannot integrate into civilian life. He avoids a welcome-home party, opting to stay alone in a hotel. He visits Linda and learns that Nick has deserted. Mike then visits Angela, who is now the mother of a child, but has slipped into catatonia following the return of Steven, who is an invalid. Stan, Axel and John understand nothing of war or what Mike has gone through. Linda and Mike find comfort in each other's company. Mike is unable to shoot a deer during a hunting trip and is outraged when Stan cavalierly threatens Axel with his pistol. Mike chambers only one round, and triggers an empty chamber at Stan's head.\r\nMike visits Steven at a veterans' hospital; both of Steven's legs have been amputated, and he has lost the use of an arm. Steven refuses to come home, saying he no longer fits in. He tells Mike that he has been regularly receiving large sums of money from Vietnam. Mike intuits that Nick is the source of these payments, and forces Steven home to Angela. Mike returns to Vietnam in search of Nick. Wandering around Saigon, which is now in a state of chaos shortly before its fall, Mike finds Julien and persuades him to take him to the gambling den. Mike finds himself facing Nick, who has become a professional in the macabre game and fails to recognize Mike. Mike attempts to bring Nick back to reason, but Nick, who is now a heroin addict, is indifferent. During a game of Russian roulette, Mike invokes memories of their hunting trips. Nick recalls Mike's \"one shot\" method and smiles before pulling the trigger, killing himself.\r\nMike and his friends attend Nick's funeral, and the atmosphere at their local bar is dim and silent. Moved by emotion, John begins to sing \"God Bless America\" in honor of Nick, as everyone joins in.\r\nCast\r\nRobert De Niro as Staff Sergeant Michael Vronsky (\"Mike\"). Producer Deeley pursued De Niro for The Deer Hunter because he felt that he needed De Niro's star power to sell a film with a \"gruesome-sounding storyline and a barely known director\". \"I liked the script, and had done a lot of prep,\" said De Niro. \"I was impressed.\" De Niro prepared by socializing with steelworkers in local bars and by visiting their homes. Cimino introduced De Niro as his agent, Harry Ufland. No one recognized him. De Niro claims this was his most physically exhausting film. He explained that the scene where Mike visits Steven in the hospital for the first time was the most emotional scene that he was ever involved with. For the film, he received his first one-million-dollar fee. De Niro was a last-minute replacement for Roy Scheider, who dropped out of the production two weeks before the start of filming due to \"creative differences\"; Universal managed to keep Scheider to his three-picture contract by forcing him to do Jaws 2 (1978).\r\nChristopher Walken as Corporal Nikanor Chevotarevich (\"Nick\"). His performance garnered an Academy Award, for Best Supporting Actor.\r\nJohn Savage as Corporal Steven Pushkov.\r\nJohn Cazale as Stanley (\"Stan\"/\"Stosh\"). All scenes involving Cazale, who had terminal cancer, were filmed first. Because of his illness the studio wanted to dismiss him but Streep, with whom he was in a romantic relationship, and Cimino threatened to walk away if they did. He was also uninsurable, and according to Streep, De Niro paid for his insurance because he wanted Cazale in the film. This was Cazale's last film, as he died shortly after filming wrapped. Cazale never saw the finished film.\r\nMeryl Streep as Linda. Prior to The Deer Hunter, Streep was seen briefly in Fred Zinnemann's Julia (1977) and the eight-hour miniseries Holocaust (1978), which she took a role in, in order to help with Cazale's cancer treatment. In the screenplay, Streep's role was negligible. Cimino explained the set-up to Streep and suggested that she write her own lines.\r\nGeorge Dzundza as John Welsh\r\nPierre Segui as Julien Grinda\r\nShirley Stoler as Steven's mother\r\nChuck Aspegren as Peter Axelrod (\"Axel\"). Aspegren was not an actor; he was the foreman at an East Chicago steelworks visited early in pre-production by De Niro and Cimino. They were so impressed with him that they offered him the role. He was the second person to be cast in the film, after De Niro.\r\nRutanya Alda as Angela Ludhjduravic-Pushkov\r\nPaul D'Amato as Sergeant\r\nAmy Wright as Bridesmaid\r\nJoe Grifasi as Bandleader\r\nWhile producer Deeley was pleased with the revised script, he was still concerned about being able to sell the film. \"We still had to get millions out of a major studio,\" wrote Deeley, \"as well as convince our markets around the world that they should buy it before it was finished. I needed someone with the caliber of Robert De Niro.\" De Niro was one of the biggest stars at that time, coming off Mean Streets (1973), The Godfather Part II (1974), and Taxi Driver (1976). In addition to attracting buyers, Deeley felt De Niro was \"the right age, apparently tough as hell, and immensely talented.\"\r\nHiring De Niro turned out to be a casting coup because he knew so many actors in New York. De Niro brought Meryl Streep to the attention of Cimino and Deeley. With Streep came John Cazale. De Niro also accompanied Cimino to scout locations for the steel mill sequence as well as rehearsed with the actors to use the workshops as a bonding process.\r\nEach of the six principal male characters carried a photo in his back pocket depicting them all together as children, to enhance the sense of camaraderie amongst them. Additionally, director Cimino instructed the props department to fashion complete Pennsylvania IDs for each of them, including driver's licenses, medical cards, and various other pieces of paraphernalia, to enhance each actor's sense of his character.\r\nPre-production\r\nThere has been considerable debate, controversy, and conflicting stories about how The Deer Hunter was initially developed and written. Director and co-writer Michael Cimino, writer Deric Washburn, and producers Barry Spikings and Michael Deeley all have different versions of how the film came to be.\r\nDevelopment\r\nIn 1968, the record company EMI formed a new company called EMI Films, headed by producers Barry Spikings and Michael Deeley. Deeley purchased the first draft of a spec script called The Man Who Came to Play, written by Louis A. Garfinkle and Quinn K. Redeker, for $19,000. The spec script was about people who go to Las Vegas to play Russian roulette. \"The screenplay had struck me as brilliant,\" wrote Deeley, \"but it wasn't complete. The trick would be to find a way to turn a very clever piece of writing into a practical, realizable film.\" When the movie was being planned during the mid-1970s, the Vietnam War was still a taboo subject with all major Hollywood studios. According to producer Michael Deeley, the standard response was \"no American would want to see a picture about Vietnam\".\r\nAfter consulting various Hollywood agents, Deeley found writer-director Michael Cimino, represented by Stan Kamen at the William Morris Agency. Deeley was impressed by Cimino's TV commercial work and crime film Thunderbolt and Lightfoot (1974). Cimino was confident that he could further develop the principal characters of The Man Who Came to Play without losing the essence of the original. After Cimino was hired, he was called into a meeting with Garfinkle and Redeker at the EMI office. According to Deeley, Cimino questioned the need for the Russian roulette element of the script, and Redeker made such a passionate case for it that he ended up literally on his knees. Over the course of further meetings, Cimino and Deeley discussed the work needed at the front of the script, and Cimino believed he could develop the stories of the main characters in the first 20 minutes of the film.\r\nScreenplay\r\nCimino worked for six weeks with Deric Washburn on the script.Cimino and Washburn had previously collaborated with Stephen Bochco on the screenplay for Silent Running (1972). According to producer Spikings, Cimino said he wanted to work again with Washburn. According to producer Deeley, he only heard from an office rumor that Washburn was contracted by Cimino to work on the script. \"Whether Cimino hired Washburn as his sub-contractor or as a co-writer was constantly being obfuscated,\" wrote Deeley, \"and there were some harsh words between them later on, or so I was told.\"\r\nCimino's claim\r\nAccording to Cimino, he would call Washburn while on the road scouting for locations and feed him notes on dialogue and story. Upon reviewing Washburn's draft, Cimino said, \"I came back and read it and I just could not believe what I read. It was like it was written by somebody who was ... mentally deranged.\" Cimino confronted Washburn at the Sunset Marquis in LA about the draft, and Washburn supposedly replied that he couldn't take the pressure and had to go home. Cimino then fired Washburn. Cimino later claimed to have written the entire screenplay himself. Washburn's response to Cimino's comments was, \"It's all nonsense. It's lies. I didn't have a single drink the entire time I was working on the script.\"\r\nWashburn's claim\r\nAccording to Washburn, he and Cimino spent three days together in Los Angeles at the Sunset Marquis, hammering out the plot. The script eventually went through several drafts, evolving into a story with three distinct acts. Washburn did not interview any veterans to write The Deer Hunter nor do any research. \"I had a month, that was it,\" he explains. \"The clock was ticking. Write the fucking script! But all I had to do was watch TV. Those combat cameramen in Vietnam were out there in the field with the guys. I mean, they had stuff that you wouldn't dream of seeing about Iraq.\" When Washburn was finished, he says, Cimino and Joann Carelli, an associate producer on The Deer Hunter who went on to produce two more of Cimino's later films, took him to dinner at a cheap restaurant off the Sunset Strip. He recalls, \"We finished, and Joann looks at me across the table, and she says, 'Well, Deric, it's fuck-off time.' I was fired. It was a classic case: you get a dummy, get him to write the goddamn thing, tell him to go fuck himself, put your name on the thing, and he'll go away. I was so tired, I didn't care. I'd been working 20 hours a day for a month. I got on the plane the next day, and I went back to Manhattan and my carpenter job.\"\r\nDeeley's reaction to the revised script\r\nDeeley felt the revised script, now called The Deer Hunter, broke fresh ground for the project. The protagonist in the Redeker/Garfinkle script, Merle, was an individual who sustained a bad injury in active service and was damaged psychologically by his violent experiences, but was nevertheless a tough character with strong nerves and guts. Cimino and Washburn's revised script distilled the three aspects of Merle's personality and separated them out into three distinct characters. They became three old friends who grew up in the same small industrial town and worked in the same steel mill, and in due course were drafted together to Vietnam. In the original script, the roles of Merle (later renamed Mike) and Nick were reversed in the last half of the film. Nick returns home to Linda, while Mike remains in Vietnam, sends money home to help Steven, and meets his tragic fate at the Russian roulette table.\r\nA Writers' Guild arbitration process awarded Washburn sole \"Screenplay by\" credit. Garfinkle and Redeker were given a shared \"Story by\" credit with Cimino and Washburn. Deeley felt the story credits for Garfinkle and Redeker \"did them less than justice.\" Cimino contested the results of the arbitration. \"In their Nazi wisdom,\" added Cimino, \" didn't give me the credit because I would be producer, director and writer.\" All four writers—Cimino, Washburn, Garfinkle, and Redeker—received an Oscar nomination for Best Original Screenplay for the film.\r\nFilming\r\nThe Deer Hunter began principal photography on June 20, 1977. This was the first feature film depicting the Vietnam War to be filmed on location in Thailand. All scenes were shot on location (no sound stages). \"There was discussion about shooting the film on a back lot, but the material demanded more realism,\" says Spikings. The cast and crew viewed large amounts of news footage from the war to ensure authenticity. The film was shot over a period of six months. The Clairton scenes comprise footage shot in eight different towns in four states: West Virginia, Pennsylvania, Washington, and Ohio. The initial budget of the film was $8.5 million.\r\nMeryl Streep accepted the role of the \"vague, stock girlfriend\", in order to remain for the duration of filming with John Cazale, who had been diagnosed with lung cancer. De Niro had spotted Streep in her stage production of The Cherry Orchard and had suggested that she play his girlfriend Linda. Before the beginning of principal photography, Deeley had a meeting with the film's appointed line producer Robert Relyea. Deeley hired Relyea after meeting him on the set of Bullitt (1968) and was impressed with his experience. However, Relyea declined the job, refusing to disclose his reason why. Deeley suspected that Relyea sensed in director Cimino something that would have made production difficult. As a result, Cimino was acting without the day-to-day supervision of a producer.\r\nBecause Deeley was busy overseeing the production of Sam Peckinpah's Convoy (1978), he hired John Peverall to oversee Cimino's shoot. Peverall's expertise with budgeting and scheduling made him a natural successor to Relyea, and Peverall knew enough about the picture to be elevated to producer status. \"John is a straightforward Cornishman who had worked his way up to become a production supervisor,\" wrote Deeley, \"and we employed him as EMI's watchman on certain pictures.\"\r\nThe wedding scenes\r\nThe wedding scenes were filmed at the historic St. Theodosius Russian Orthodox Cathedral in the Tremont neighborhood of Cleveland, Ohio. The wedding took five days to film. St. Theodosius' Father Stephen Kopestonsky was cast as the priest at the wedding. The reception scene was filmed at nearby Lemko Hall. The amateur extras lined up for the crowded wedding-dance sequences drank real liquor and beer. The scenes were filmed in the summer, but were set in the fall. To accomplish a look of fall, individual leaves were removed from deciduous trees. Zsigmond also had to desaturate the colors of the exterior shots, partly in camera and in the laboratory processing.\r\nThe production manager asked each of the Russian immigrant extras to bring to the location a gift-wrapped box to double for wedding presents. The manager figured if the extras did this, not only would the production save time and money, but the gifts would also look more authentic. Once the unit unwrapped and the extras disappeared, the crew discovered to their amusement that the boxes weren't empty but filled with real presents, from china to silverware. \"Who got to keep all these wonderful offerings,\" wrote Deeley \"is a mystery I never quite fathomed.\"\r\nCimino originally claimed that the wedding scene would take up 21 minutes of screen time. In the end, it took 51 minutes. Deeley believes that Cimino always planned to make this prologue last for an hour, and \"the plan was to be advanced by stealth rather than straight dealing.\"\r\nAt this point in the production, nearly halfway through principal photography, Cimino was already over budget, and producer Spikings could tell from the script that shooting the extended scene could sink the project.\r\nThe bar and the steel mill\r\nThe bar was specially constructed in an empty storefront in Mingo Junction, Ohio for $25,000; it later became an actual saloon for local steel mill workers. U.S. Steel allowed filming inside its Cleveland mill, including placing the actors around the furnace floor, only after securing a $5 million insurance policy. Other filming took place in Pittsburgh.\r\nHunting the deer\r\nThe first deer to be shot was depicted in a \"gruesome close-up\", although he was hit with a tranquilizer dart. This was not a whitetail buck, which is native to Pennsylvania, but a red deer which is native to Eurasia. The stag that Michael lets escape was the same one later used on TV commercials for The Hartford.\r\nVietnam and the Russian roulette scenes\r\nThe Viet Cong Russian roulette scenes were shot with real rats and mosquitoes, as the three principals (De Niro, Walken, and Savage) were tied up in bamboo cages erected along the River Kwai. The woman who was given the task of casting the extras in Thailand had much difficulty finding a local to play the vicious-looking individual who runs the game. The first actor hired turned out to be incapable of slapping De Niro in the face. The casting agent then found a local Thai man, Somsak Sengvilai, who held a particular dislike of Americans, and so cast him. De Niro suggested that Walken be slapped by one of the guards without any warning. The reaction on Walken's face was genuine. Producer Deeley has said that Cimino shot the brutal Vietcong Russian roulette scenes brilliantly and more efficiently than any other part of the film.\r\nDe Niro and Savage performed their own stunts in the fall into the river, filming the 30 feet (9.1 m) drop fifteen times in two days. During the helicopter stunt, the skids caught on the rope bridge as the helicopter rose, which threatened to seriously injure De Niro and Savage. The actors gestured and shouted to the crew in the helicopter to warn them. Footage of this is included in the film.\r\nAccording to Cimino, De Niro requested a live cartridge in the revolver for the scene in which he subjects John Cazale's character to an impromptu game of Russian roulette, to heighten the intensity of the situation. Cazale agreed without protest, but obsessively rechecked the gun before each take to make sure that the live round was not next in the chamber.\r\nWhile appearing later in the film, the first scenes shot upon arrival in Thailand were the hospital sequences between Walken and the military doctor. Deeley believed that this scene was \"the spur that would earn him an Academy Award\".\r\nIn the final scene in the gambling den between Mike and Nick, Cimino had Walken and De Niro improvise in one take. His direction to his actors: \"You put the gun to your head, Chris, you shoot, you fall over and Bobby cradles your head.\"\r\nFilming locations\r\nThailand\r\nPatpong, Bangkok, the area used to represent Saigon's red light district.\r\nSai Yok, Kanchanaburi Province\r\nRiver Kwai, prison camp and initial Russian roulette scene.\r\nUS\r\nSt. Theodosius Russian Orthodox Cathedral, in the Tremont neighborhood of Cleveland, Ohio. The name plaque is clearly visible in one scene.\r\nLemko Hall, Cleveland, Ohio. Also located in Tremont, the wedding banquet was filmed here. The name is clearly visible in one scene.\r\nU.S. Steel Central Furnaces in Cleveland, Ohio. Opening sequence steel mill scenes.\r\nMount Baker-Snoqualmie National Forest and Nooksack Falls in the North Cascades range of Washington, deer hunting scenes.Also North Cascades Highway (SR 20), Diablo Lake\r\nSteubenville, Ohio, for some mill and neighborhood shots.\r\nStruthers, Ohio, for external house and long-range road shots. Also including, the town's bowling alley is the Bowladrome Lanes, located at 56 State Street, Struthers, Ohio.\r\nWeirton, West Virginia, for mill and trailer shots.\r\nPost-production\r\nBy this point, The Deer Hunter had cost $13 million and the film still had to go through an arduous post-production. Film editor Peter Zinner was given 600,000 feet (110 mi; 180 km) of printed film to edit, a monumental task at the time. Producers Spikings and Deeley were pleased with the first cut, which ran for three and a half hours. \"We were thrilled by what we saw,\" wrote Deeley, \"and knew that within the three and a half hours we watched there was a riveting film.\"\r\nExecutives from Universal, including Lew Wasserman and Sid Sheinberg, were not very enthusiastic. \"I think they were shocked,\" recalled Spikings. \"What really upset them was 'God Bless America'. Sheinberg thought it was anti-American. He was vehement. He said something like 'You're poking a stick in the eye of America.' They really didn't like the movie. And they certainly didn't like it at three hours and two minutes.\" Deeley wasn't surprised by the Universal response: \"The Deer Hunter was a United Artists sort of picture, whereas Convoy was more in the style of Universal. I'd muddled and sold the wrong picture to each studio.\" Deeley did agree with Universal that the film needed to be shorter, not just because of pacing but also to ensure commercial success. \"A picture under two and a half hours can scrape three shows a day,\" wrote Deeley, \"but at three hours you've lost one third of your screenings and one third of your income for the cinemas, distributors, and profit participants.\"\r\nThom Mount, president of Universal at the time, said, \"This was just a... continuing nightmare from the day Michael finished the picture to the day we released it. That was simply because he was wedded to everything he shot. The movie was endless. It was The Deer Hunter and the Hunter and the Hunter. The wedding sequence was a cinematic event all unto its own.\" Mount says he turned to Verna Fields, Universal's then-head of post-production. \"I sicced Verna on Cimino,\" Mount says. \"Verna was no slouch. She started to turn the heat up on Michael, and he started screeching and yelling.\"\r\nZinner eventually cut the film to 18,000 feet (3.4 mi; 5.5 km). Cimino later fired Zinner when he discovered that Zinner was editing the wedding scenes. Zinner eventually won Best Editing Oscar for The Deer Hunter. Regarding the clashes between him and Cimino, Zinner stated: \"Michael Cimino and I had our differences at the end, but he kissed me when we both got Academy Awards.\" Cimino later commented in The New York Observer, \" was a moron ... I cut Deer Hunter myself.\"\r\nSound design\r\nThe Deer Hunter was Cimino's first film to use Dolby noise-reduction system. \"What Dolby does,\" replied Cimino, \"is to give you the ability to create a density of detail of sound—a richness so you can demolish the wall separating the viewer from the film. You can come close to demolishing the screen.\" It took five months to mix the soundtrack. One short battle sequence—200 feet of film in the final cut—took five days to dub. Another sequence recreated the 1975 American evacuation of Saigon; Cimino brought the film's composer, Stanley Myers, out to the location to listen to the auto, tank, and jeep horns as the sequence was being photographed. The result, according to Cimino: Myers composed the music for that scene in the same key as the horn sounds, so the music and the sound effects would blend with the images to create one jarring, desolate experience.\r\nPreviews\r\nBoth the long and short versions were previewed to Midwestern audiences, although there are differing accounts among Cimino, Deeley, and Spikings as to how the previews panned out. Director Cimino claims he bribed the projectionist to interrupt the shorter version, in order to obtain better reviews of the longer one. According to producer Spikings, Wasserman let EMI's CEO Bernard Delfont decide between the two and chose Cimino's longer cut. Deeley claims that the two-and-a-half-hour version tested had a better response.\r\nSoundtrack\r\nThe soundtrack to The Deer Hunter was released on audio CD on October 25, 1990.\r\nSelected tracks\r\nStanley Myers's \"Cavatina\" (also known as \"He Was Beautiful\"), performed by classical guitarist John Williams, is commonly known as \"The Theme from The Deer Hunter\". According to producer Deeley, he discovered that the piece was originally written for a film called The Walking Stick (1970) and, as a result, had to pay the original purchaser an undisclosed sum.\r\n\"Can't Take My Eyes Off You\", a 1967 hit song, sung by Frankie Valli. It is played in John's bar when all of the friends sing along and at the wedding reception. According to Cimino, the actors sang along to a recording of the song as it was played instead of singing to a beat track, a standard filmmaking practice. Cimino felt that would make the sing-along seem more real.\r\nDuring the wedding ceremonies and party, the Russian Orthodox songs such as \"Slava\", and Russian folk songs such as \"Korobushka\" and \"Katyusha\", are played.\r\nThe final passage from Kamarinskaya by Mikhail Glinka is heard briefly when the men are driving through the mountains. Also, a part of the opening section of the same work is heard during the second hunt when Michael is about to shoot the stag.\r\nRussian Orthodox funeral music is also employed during Nick's funeral scene, mainly \"Vechnaya Pamyat\", which means \"eternal memory\".\r\nRelease\r\nThe Deer Hunter debuted at one theater each in New York and Los Angeles for a week on December 8, 1978. The release strategy was to qualify the film for Oscar consideration and close after a week to build interest. After the Oscar nominations, Universal widened the distribution to include major cities, building up to a full-scale release on February 23, 1979, just following the Oscars. This film was important for helping release patterns for so-called prestige pictures that screen only at the end of the year to qualify for Academy Award recognition. The film eventually grossed $48.9 million at the US box office.\r\nCBS paid $3.5 million for three runs of the film. The network later cancelled the acquisition on the contractually permitted grounds of the film containing too much violence for US network transmission.\r\nAnalysis\r\nControversy over Russian roulette\r\nOne of the most talked-about sequences in the film, the Viet Cong's use of Russian roulette with POWs, was criticized as being contrived and unrealistic since there were no documented cases of Russian roulette in the Vietnam War. Associated Press reporter Peter Arnett, who won a Pulitzer Prize for his coverage of the war, wrote in the Los Angeles Times, \"In its 20 years of war, there was not a single recorded case of Russian roulette ... The central metaphor of the movie is simply a bloody lie.\"\r\nCimino countered that his film was not political, polemical, literally accurate, or posturing for any particular point of view. Nevertheless, he also claimed he had news clippings from Singapore that confirm Russian roulette was used during the war, without specifying which article.\r\nCritics' response\r\nIn his review, Roger Ebert defended the artistic license of Russian roulette, arguing \"it is the organizing symbol of the film: Anything you can believe about the game, about its deliberately random violence, about how it touches the sanity of men forced to play it, will apply to the war as a whole. It is a brilliant symbol because, in the context of this story, it makes any ideological statement about the war superfluous.\"\r\nFilm critic and biographer David Thomson also agrees that the film works despite the controversy: \"There were complaints that the North Vietnamese had not employed Russian roulette. It was said that the scenes in Saigon were fanciful or imagined. It was also suggested that De Niro, Christopher Walken, and John Savage were too old to have enlisted for Vietnam (Savage, the youngest of the three, was thirty). Three decades later, 'imagination' seems to have stilled those worries ... and The Deer Hunter is one of the great American films.\"\r\nIn her review, Pauline Kael wrote \"The Vietcong are treated in the standard inscrutable-evil Oriental style of the Japanese in the Second World War movies ... The impression a viewer gets is that if we did some bad things there we did them ruthlessly but impersonally; the Vietcong were cruel and sadistic.\"\r\nIn his Vanity Fair article \"The Vietnam Oscars\", Peter Biskind wrote that the political agenda of The Deer Hunter was something of a mystery: \"It may have been more a by-product of Hollywood myopia, the demands of the war-film genre, garden-variety American parochialism, and simple ignorance than it was the pre-meditated right-wing road map it seemed to many.\"\r\nCast and crew response\r\nAccording to Christopher Walken, the historical context was not paramount: \"In the making of it, I don't remember anyone ever mentioning Vietnam!\" De Niro added to this sentiment: \"Whether actually happened or not, it's something you could imagine very easily happening. Maybe it did. I don't know. All's fair in love and war.\" Producer Spikings, while proud of the film, regrets the way the Vietnamese were portrayed. \"I don't think any of us meant it to be exploitive,\" Spikings said. \"But I think we were ... ignorant. I can't think of a better word for it. I didn't realize how badly we'd behaved to the Vietnamese people ...\"\r\nProducer Deeley, on the other hand, was quick to defend Cimino's comments on the nature and motives of the film: \"The Deer Hunter wasn't really 'about' Vietnam. It was something very different. It wasn't about drugs or the collapse of the morale of the soldiers. It was about how individuals respond to pressure: different men reacting quite differently. The film was about three steel workers in extraordinary circumstances. Apocalypse Now is surreal. The Deer Hunter is a parable ... Men who fight and lose an unworthy war face some obvious and unpalatable choices. They can blame their leaders.. or they can blame themselves. Self-blame has been a great burden for many war veterans. So how does a soldier come to terms with his defeat and yet still retain his self-respect? One way is to present the conquering enemy as so inhuman, and the battle between the good guys (us) and the bad guys (them) so uneven, as to render defeat irrelevant. Inhumanity was the theme of The Deer Hunter's portrayal of the North Vietnamese prison guards forcing American POWs to play Russian roulette. The audience's sympathy with prisoners who (quite understandably) cracked thus completes the chain. Accordingly, some veterans who suffered in that war found the Russian roulette a valid allegory.\"\r\nDirector Cimino's autobiographical intent\r\nCimino frequently referred to The Deer Hunter as a \"personal\" and \"autobiographical\" film, although later investigation by journalists like Tom Buckley of Harper's revealed inaccuracies in Cimino's accounts and reported background.\r\nCoda of \"God Bless America\"\r\nThe final scene in which all the main characters gather and sing \"God Bless America\" became a subject of heated debate among critics when the film was released. It raised the question of whether this conclusion was meant ironically or not – \"as a critique of patriotism or a paean to it\".\r\nReception\r\nUpon its release, The Deer Hunter received acclaim from critics, who considered it the best American epic since Francis Ford Coppola's The Godfather. The film was praised for its depiction of realistic working-class settings and environment; Cimino's direction; the performances of De Niro, Walken, Streep, Savage, Dzundza and Cazale; the symphonic shifts of tone and pacing in moving from America to Vietnam; the tension during the Russian roulette scenes; and the themes of American disillusionment. The film holds an approval rating of 86% on Rotten Tomatoes based on 127 reviews, with an average score of 8.60/10. The consensus reads: \"Its greatness is blunted by its length and one-sided point of view, but the film's weaknesses are overpowered by Michael Cimino's sympathetic direction and a series of heartbreaking performances from Robert De Niro, Meryl Streep, and Christopher Walken\". On Metacritic, the film has a weighted average score of 86 out of 100 based on reviews from 18 critics, indicating \"universal acclaim\".\r\nRoger Ebert of the Chicago Sun-Times gave the film four out of four stars and called it \"one of the most emotionally shattering films ever made.\" Gene Siskel from the Chicago Tribune praised the film, saying, \"This is a big film, dealing with big issues, made on a grand scale. Much of it, including some casting decisions, suggest inspiration by The Godfather.\" Leonard Maltin also gave the film four stars, calling it a \"sensitive, painful, evocative work\". Vincent Canby of The New York Times called The Deer Hunter \"a big, awkward, crazily ambitious motion picture that comes as close to being a popular epic as any movie about this country since The Godfather. Its vision is that of an original, major new filmmaker.\" David Denby of New York called it \"an epic\" with \"qualities that we almost never see any more—range and power and breadth of experience.\" Jack Kroll of Time asserted it put director Cimino \"right at the center of film culture.\" Stephen Farber pronounced the film in New West magazine as \"the greatest anti-war movie since La Grande Illusion.\"\r\nHowever, The Deer Hunter was not without critical backlash. Pauline Kael of The New Yorker wrote a positive review with some reservations: \" a small minded film with greatness in it ... with an enraptured view of common life ... enraging, because, despite its ambitiousness and scale, it has no more moral intelligence than the Eastwood action pictures.\" Andrew Sarris wrote that the film was \"massively vague, tediously elliptical, and mysteriously hysterical ... It is perhaps significant that the actors remain more interesting than the characters they play.\" Jonathan Rosenbaum disparaged The Deer Hunter as an \"Oscar-laden weepie about macho buddies\" and \"a disgusting account of what the evil Vietnamese did to poor, innocent Americans\". John Simon of New York wrote: \"For all its pretensions to something newer and better, this film is only an extension of the old Hollywood war-movie lie. The enemy is still bestial and stupid, and no match for our purity and heroism; only we no longer wipe up the floor with him—rather, we litter it with his guts.\" In a review of The Deer Hunter for Chicago magazine, Studs Terkel wrote that he was \"appalled by its shameless dishonesty,\" and that \"not since The Birth of a Nation has a non-Caucasian people been portrayed in so barbaric a fashion.\" Cimino's dishonesty \"was to project a sadistic psyche not only onto 'Charlie' but to all the Vietnamese portrayed.\"\r\nAuthor Karina Longworth notes that Streep \"made a case for female empowerment by playing a woman to whom empowerment was a foreign concept—a normal lady from an average American small town, for whom subservience was the only thing she knew\". She states that The Deer Hunter \"evokes a version of dominant masculinity in which male friendship is a powerful force\". It has a \"credibly humanist message\", and that the \"slow study of the men in blissfully ignorant homeland machismo is crucial to it\".\r\nDuring the 29th Berlin International Film Festival in 1979, the Soviet delegation expressed its indignation with the film which, in their opinion, insulted the Vietnamese people in numerous scenes. Other communist states also voiced their solidarity with the \"heroic people of Vietnam\". They protested against the screening of the film and insisted that it violated the statutes of the festival because it in no way contributed to the \"improvement of mutual understanding between the peoples of the world\". The ensuing domino effect led to the walk-outs of the Cubans, East Germans, Hungarians, Bulgarians, Poles and Czechoslovakians, and two members of the jury resigned in sympathy.\r\nTop-ten lists\r\n3rd—Roger Ebert, Chicago Sun-Times. Ebert also placed Deer Hunter on his list of the best films of the 1970s.\r\n3rd—Gene Siskel, Chicago Tribune\r\nAcademy Award-winning film director Miloš Forman and Academy Award-nominated actor Mickey Rourke consider The Deer Hunter to be one of the greatest films of all time.\r\nRevisionism following Heaven's Gate\r\nCimino's next film, Heaven's Gate (1980), debuted to lacerating reviews and took in only $3 million in ticket sales, effectively leaving United Artists bankrupt. The failure of Heaven's Gate led several critics to revise their positions on The Deer Hunter. Canby said in his famous review of Heaven's Gate, \" fails so completely that you might suspect Mr. Cimino sold his soul to the Devil to obtain the success of The Deer Hunter, and the Devil has just come around to collect.\" Andrew Sarris wrote in his review of Heaven's Gate, \"I'm a little surprised that many of the same critics who lionized Cimino for The Deer Hunter have now thrown him to the wolves with equal enthusiasm.\" Sarris added, \"I was never taken in ... Hence, the stupidity and incoherence in Heaven's Gate came as no surprise since very much the same stupidity and incoherence had been amply evident in The Deer Hunter.\" In his book Final Cut: Dreams and Disaster in the Making of Heaven's Gate, Steven Bach wrote, \"critics seemed to feel obliged to go on the record about The Deer Hunter, to demonstrate that their critical credentials were un-besmirched by having been, as Andrew Sarris put it, 'taken in.'\" Film critic Mark Kermode described Deer Hunter as \"a genuinely terrible film\".\r\nHowever, many critics, including David Thomson and A. O. Scott, maintain that The Deer Hunter is still a great film, the power of which has not diminished.\r\nAwards\r\nLead-up to awards season\r\nFilm producer and \"old-fashioned mogul\" Allan Carr used his networking abilities to promote The Deer Hunter. \"Exactly how Allan Carr came into The Deer Hunter's orbit I can no longer remember,\" recalled producer Deeley, \"but the picture became a crusade to him. He nagged, charmed, threw parties, he created word-of-mouth – everything that could be done in Hollywood to promote a project. Because he had no apparent motive for this promotion, it had an added power and legitimacy and it finally did start to penetrate the minds of the Universal's sales people that they actually had in their hands something a bit more significant than the usual.\" Deeley added that Carr's promotion of the film was influential in positioning The Deer Hunter for Oscar nominations.\r\nOn the Sneak Previews special \"Oscar Preview for 1978\", Roger Ebert correctly predicted that The Deer Hunter would win for Best Picture while Gene Siskel predicted that Coming Home would win. However, Ebert incorrectly guessed that Robert De Niro would win for Best Actor for Deer Hunter and Jill Clayburgh would win for Best Actress for An Unmarried Woman while Siskel called the wins for Jon Voight as Best Actor and Jane Fonda as Best Actress, both for Coming Home. Both Ebert and Siskel correctly predicted the win for Christopher Walken receiving the Oscar for Best Supporting Actor.\r\nAccording to producer Deeley, orchestrated lobbying against The Deer Hunter was led by Warren Beatty, whose own picture Heaven Can Wait had multiple nominations. Beatty also used ex-girlfriends in his campaign: Julie Christie, serving on the jury at the Berlin Film Festival where Deer Hunter was screened, joined the walkout of the film by the Russian jury members. Jane Fonda also criticized The Deer Hunter in public. Deeley suggested that her criticisms partly stemmed from the competition between her film Coming Home vying with The Deer Hunter for Best Picture. According to Deeley, he planted a friend of his in the Oscar press area behind the stage to ask Fonda if she had seen The Deer Hunter. Fonda replied she had not seen the film, and to this day she still has not.\r\nAs the Oscars drew near, the backlash against The Deer Hunter gathered strength. When the limos pulled up to the Dorothy Chandler Pavilion on April 9, 1979, they were met by demonstrators, mostly from the Los Angeles chapter of Vietnam Veterans Against the War. The demonstrators waved placards covered with slogans that read \"No Oscars for racism\" and \"The Deer Hunter a bloody lie\" and thrust pamphlets berating Deer Hunter into long lines of limousine windows. Washburn, nominated for Best Original Screenplay, claims his limousine was pelted with stones. According to Variety, \"Police and The Deer Hunter protesters clashed in a brief but bloody battle that resulted in 13 arrests.\"\r\nDe Niro was so anxious that he did not attend the Oscars ceremony. He asked the Academy to allow him to sit out the show backstage, but when the Academy refused, De Niro stayed home in New York. Producer Deeley made a deal with fellow producer David Puttnam, whose film Midnight Express was nominated, that each would take $500 to the ceremony so if one of them won, the winner would give the loser the $500 to \"drown his sorrows in style.\"\r\nComplete list of awards\r\nLegacy\r\nThe Deer Hunter was among the early, and most controversial, major theatrical films to be critical of the American involvement in Vietnam following 1975 when the war officially ended. While the film opened the same year as Hal Ashby's Coming Home, Sidney Furie's The Boys in Company C, and Ted Post's Go Tell the Spartans, it was the first film about Vietnam to reach a wide audience and critical acclaim, culminating in the winning of the Oscar for Best Picture. Other films released later that illustrated the 'hellish', futile conditions of bloody Vietnam War combat included:\r\nFrancis Ford Coppola's Apocalypse Now (1979)\r\nOliver Stone's Platoon (1986)\r\nStanley Kubrick's Full Metal Jacket (1987)\r\nJohn Irvin's Hamburger Hill (1987)\r\nOliver Stone's Born on the Fourth of July (1989)\r\nDavid Thomson wrote in an article titled \"The Deer Hunter: Story of a scene\" that the film changed the way war-time battles were portrayed on film: \"The terror and the blast of firepower changed the war film, even if it only used a revolver. More or less before the late 1970s, the movies had lived by a Second World War code in which battle scenes might be fierce but always rigorously controlled. The Deer Hunter unleashed a new, raw dynamic in combat and action, paving the way for Platoon, Saving Private Ryan and Clint Eastwood's Iwo Jima films.\"\r\nIn a 2011 interview with Rotten Tomatoes, actor William Fichtner retrospectively stated that he and his partner were silenced after seeing the film, stating that \"the human experience was just so pointed; their journeys were so difficult, as life is sometimes. I remember after seeing it, walking down the street — I actually went with a girl on a date and saw The Deer Hunter, and we left the theater and walked for like an hour and nobody said anything; we were just kind of stunned about that.\"\r\nThe deaths of approximately 25 people who died playing Russian roulette were reported as having been influenced by scenes in the movie.\r\nHonors and recognition\r\nIn 1996, The Deer Hunter was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\r\nAmerican Film Institute included the film as #79 in AFI's 100 Years...100 Movies, #30 in AFI's 100 Years...100 Thrills, and #53 in AFI's 100 Years...100 Movies (10th Anniversary Edition).\r\nThe film ranks 467th in the Empire magazine's 2008 list of the 500 greatest movies of all time, noting:\r\nCimino's bold, powerful 'Nam epic goes from blue-collar macho rituals to a fiery, South East Asian hell and back to a ragged singalong of America the Beautiful. De Niro holds it together, but Christopher Walken, Meryl Streep and John Savage are unforgettable.\r\nThe New York Times placed the film on its Best 1000 Movies Ever list.\r\nJan Scruggs, a Vietnam veteran who became a counselor with the U.S. Department of Labor, thought of the idea of building a National Memorial for Viet Nam Veterans after seeing a screening of the film in March 1979, and he established and operated the memorial fund which paid for it. Director Cimino was invited to the memorial's opening.\r\nHome media\r\nThe Deer Hunter has twice been released on DVD in America. The first 1998 issue was by Universal, with no extra features and a non-anamorphic transfer, and has since been discontinued. A second version, part of the \"Legacy Series\", was released as a two-disc set on September 6, 2005, with an anamorphic transfer of the film. The set features a cinematographer's commentary by Vilmos Zsigmond, deleted and extended scenes, and production notes.\r\nThe Region 2 version of The Deer Hunter, released in the UK and Japan, features a commentary track from director Michael Cimino.\r\nThe film was released on HD DVD on December 26, 2006.\r\nStudioCanal released the film on the Blu-ray format in countries other than the United States on March 11, 2009. It was released on Blu-ray in the U.S. on March 6, 2012.\r\nOn May 26, 2020, Shout! Factory released the film on Ultra HD Blu-ray featuring a new Dolby Vision transfer.",
    "html": "<p>The Deer Hunter is a 1978 epic war drama film co-written and directed by Michael Cimino about a trio of Slavic-American steelworkers whose lives were upended after fighting in the Vietnam War. The three soldiers are played by Robert De Niro, Christopher Walken, and John Savage, with John Cazale (in his final role), Meryl Streep, and George Dzundza playing supporting roles. The story takes place in Clairton, Pennsylvania, a working-class town on the Monongahela River south of Pittsburgh, and in Vietnam.</p><p>The film was based in part on an unproduced screenplay called The Man Who Came to Play by Louis A. Garfinkle and Quinn K. Redeker, about Las Vegas and Russian roulette. Producer Michael Deeley, who bought the script, hired writer/director Michael Cimino who, with Deric Washburn, rewrote the script, taking the Russian roulette element and placing it in the Vietnam War. The film went over-budget and over-schedule, and ended up costing $15 million. EMI Films, who produced the film, released the film internationally while Universal Pictures handled its distribution in North America.</p><p>The Deer Hunter received acclaim from critics and audiences, with praise for Cimino's direction, the performances of its cast (particularly from De Niro, Walken, Cazale, and Streep), and its screenplay, realistic themes and tones, and cinematography. It was also successful at the box office, grossing $49 million. At the 51st Academy Awards, it was nominated for nine Academy Awards, and won five: Best Picture, Best Director for Cimino, Best Supporting Actor for Walken, Best Sound, and Best Film Editing. The film marked Meryl Streep's first Academy Award nomination (for Best Supporting Actress).</p><p>Despite the film's critical acclaim and Academy Award success, some of the industry's most prominent critics derided what they viewed as The Deer Hunter's simplistic, bigoted, and historically inaccurate depictions of the Viet Cong and of America's position in the Vietnam War. The central theme of the Viet Cong forcing American captives to play Russian Roulette has been widely criticized as having no basis in history, a claim Cimino denied but did not refute with documentary evidence.</p><p>It has been featured on lists of the best films ever made, such as being named the 53rd-greatest American film of all time by the American Film Institute in 2007 in their 10th Anniversary Edition of the AFI's 100 Years...100 Movies list. It was selected for preservation in the United States National Film Registry by the Library of Congress in 1996, as being \"culturally, historically, or aesthetically significant.\"</p><br/><h3>Plot</h3><p>In late 1968, three friends in a tight-knit Slavic American community in Western Pennsylvania—Mike, Steven and Nick—work in a steel mill and hunt for deer with their co-workers Axel, Stan and John. Mike, Steven and Nick are preparing to leave for military service in Vietnam. Steven is engaged to Angela, who was secretly impregnated by another man. Mike and Nick are close friends who live together and both love Linda, who will be moving into their home to escape from her alcoholic father. While dancing at Steven and Angela's wedding, Linda accepts Nick's spontaneous marriage proposal. Nick implores Mike to ensure he returns from Vietnam. Mike, Nick and their friends take a final deer hunt. Mike kills a deer with a single shot.</p><p>In Vietnam in early 1969, Mike, an airborne green beret, happens upon Nick and Steven in a village, but the three are imprisoned by the Viet Cong in a cage on the River Kwai and forced to participate in games of Russian roulette while the jailers bet. Steven fires his round at the ceiling and is forced into a cage with dead men and rats. Mike convinces his captors to put three bullets in the revolver's cylinder; Nick and Mike then use the pistol to escape.</p><p>The trio floats down the river but Nick's leg is shot; they are rescued by an American helicopter, but Steven falls back into the river. Mike drops down to help Steven while Nick is flown away. Steven's legs were broken in the fall, so Mike carries him until they meet refugees fleeing to Saigon.</p><p>Nick is treated at a U.S. military hospital. Once released, Nick now suffering from PTSD, wanders into a gambling den. French businessman Julien persuades him to come inside. Upset, Nick interrupts a game of Russian roulette, pulling the trigger on himself. Mike is present as a spectator, but Nick and Julien hurriedly leave.</p><p>In 1970, Mike returns home, but cannot integrate into civilian life. He avoids a welcome-home party, opting to stay alone in a hotel. He visits Linda and learns that Nick has deserted. Mike then visits Angela, who is now the mother of a child, but has slipped into catatonia following the return of Steven, who is an invalid. Stan, Axel and John understand nothing of war or what Mike has gone through. Linda and Mike find comfort in each other's company. Mike is unable to shoot a deer during a hunting trip and is outraged when Stan cavalierly threatens Axel with his pistol. Mike chambers only one round, and triggers an empty chamber at Stan's head.</p><p>Mike visits Steven at a veterans' hospital; both of Steven's legs have been amputated, and he has lost the use of an arm. Steven refuses to come home, saying he no longer fits in. He tells Mike that he has been regularly receiving large sums of money from Vietnam. Mike intuits that Nick is the source of these payments, and forces Steven home to Angela. Mike returns to Vietnam in search of Nick. Wandering around Saigon, which is now in a state of chaos shortly before its fall, Mike finds Julien and persuades him to take him to the gambling den. Mike finds himself facing Nick, who has become a professional in the macabre game and fails to recognize Mike. Mike attempts to bring Nick back to reason, but Nick, who is now a heroin addict, is indifferent. During a game of Russian roulette, Mike invokes memories of their hunting trips. Nick recalls Mike's \"one shot\" method and smiles before pulling the trigger, killing himself.</p><p>Mike and his friends attend Nick's funeral, and the atmosphere at their local bar is dim and silent. Moved by emotion, John begins to sing \"God Bless America\" in honor of Nick, as everyone joins in.</p><br/><h3>Cast</h3><ul><li>Robert De Niro as Staff Sergeant Michael Vronsky (\"Mike\"). Producer Deeley pursued De Niro for The Deer Hunter because he felt that he needed De Niro's star power to sell a film with a \"gruesome-sounding storyline and a barely known director\". \"I liked the script, and had done a lot of prep,\" said De Niro. \"I was impressed.\" De Niro prepared by socializing with steelworkers in local bars and by visiting their homes. Cimino introduced De Niro as his agent, Harry Ufland. No one recognized him. De Niro claims this was his most physically exhausting film. He explained that the scene where Mike visits Steven in the hospital for the first time was the most emotional scene that he was ever involved with. For the film, he received his first one-million-dollar fee. De Niro was a last-minute replacement for Roy Scheider, who dropped out of the production two weeks before the start of filming due to \"creative differences\"; Universal managed to keep Scheider to his three-picture contract by forcing him to do Jaws 2 (1978).</li><li>Christopher Walken as Corporal Nikanor Chevotarevich (\"Nick\"). His performance garnered an Academy Award, for Best Supporting Actor.</li><li>John Savage as Corporal Steven Pushkov.</li><li>John Cazale as Stanley (\"Stan\"/\"Stosh\"). All scenes involving Cazale, who had terminal cancer, were filmed first. Because of his illness the studio wanted to dismiss him but Streep, with whom he was in a romantic relationship, and Cimino threatened to walk away if they did. He was also uninsurable, and according to Streep, De Niro paid for his insurance because he wanted Cazale in the film. This was Cazale's last film, as he died shortly after filming wrapped. Cazale never saw the finished film.</li><li>Meryl Streep as Linda. Prior to The Deer Hunter, Streep was seen briefly in Fred Zinnemann's Julia (1977) and the eight-hour miniseries Holocaust (1978), which she took a role in, in order to help with Cazale's cancer treatment. In the screenplay, Streep's role was negligible. Cimino explained the set-up to Streep and suggested that she write her own lines.</li><li>George Dzundza as John Welsh</li><li>Pierre Segui as Julien Grinda</li><li>Shirley Stoler as Steven's mother</li><li>Chuck Aspegren as Peter Axelrod (\"Axel\"). Aspegren was not an actor; he was the foreman at an East Chicago steelworks visited early in pre-production by De Niro and Cimino. They were so impressed with him that they offered him the role. He was the second person to be cast in the film, after De Niro.</li><li>Rutanya Alda as Angela Ludhjduravic-Pushkov</li><li>Paul D'Amato as Sergeant</li><li>Amy Wright as Bridesmaid</li><li>Joe Grifasi as Bandleader</li></ul><p>While producer Deeley was pleased with the revised script, he was still concerned about being able to sell the film. \"We still had to get millions out of a major studio,\" wrote Deeley, \"as well as convince our markets around the world that they should buy it before it was finished. I needed someone with the caliber of Robert De Niro.\" De Niro was one of the biggest stars at that time, coming off Mean Streets (1973), The Godfather Part II (1974), and Taxi Driver (1976). In addition to attracting buyers, Deeley felt De Niro was \"the right age, apparently tough as hell, and immensely talented.\"</p><p>Hiring De Niro turned out to be a casting coup because he knew so many actors in New York. De Niro brought Meryl Streep to the attention of Cimino and Deeley. With Streep came John Cazale. De Niro also accompanied Cimino to scout locations for the steel mill sequence as well as rehearsed with the actors to use the workshops as a bonding process.</p><p>Each of the six principal male characters carried a photo in his back pocket depicting them all together as children, to enhance the sense of camaraderie amongst them. Additionally, director Cimino instructed the props department to fashion complete Pennsylvania IDs for each of them, including driver's licenses, medical cards, and various other pieces of paraphernalia, to enhance each actor's sense of his character.</p><br/><h3>Pre-production</h3><p>There has been considerable debate, controversy, and conflicting stories about how The Deer Hunter was initially developed and written. Director and co-writer Michael Cimino, writer Deric Washburn, and producers Barry Spikings and Michael Deeley all have different versions of how the film came to be.</p><h4>Development</h4><p>In 1968, the record company EMI formed a new company called EMI Films, headed by producers Barry Spikings and Michael Deeley. Deeley purchased the first draft of a spec script called The Man Who Came to Play, written by Louis A. Garfinkle and Quinn K. Redeker, for $19,000. The spec script was about people who go to Las Vegas to play Russian roulette. \"The screenplay had struck me as brilliant,\" wrote Deeley, \"but it wasn't complete. The trick would be to find a way to turn a very clever piece of writing into a practical, realizable film.\" When the movie was being planned during the mid-1970s, the Vietnam War was still a taboo subject with all major Hollywood studios. According to producer Michael Deeley, the standard response was \"no American would want to see a picture about Vietnam\".</p><p>After consulting various Hollywood agents, Deeley found writer-director Michael Cimino, represented by Stan Kamen at the William Morris Agency. Deeley was impressed by Cimino's TV commercial work and crime film Thunderbolt and Lightfoot (1974). Cimino was confident that he could further develop the principal characters of The Man Who Came to Play without losing the essence of the original. After Cimino was hired, he was called into a meeting with Garfinkle and Redeker at the EMI office. According to Deeley, Cimino questioned the need for the Russian roulette element of the script, and Redeker made such a passionate case for it that he ended up literally on his knees. Over the course of further meetings, Cimino and Deeley discussed the work needed at the front of the script, and Cimino believed he could develop the stories of the main characters in the first 20 minutes of the film.</p><h4>Screenplay</h4><p>Cimino worked for six weeks with Deric Washburn on the script.Cimino and Washburn had previously collaborated with Stephen Bochco on the screenplay for Silent Running (1972). According to producer Spikings, Cimino said he wanted to work again with Washburn. According to producer Deeley, he only heard from an office rumor that Washburn was contracted by Cimino to work on the script. \"Whether Cimino hired Washburn as his sub-contractor or as a co-writer was constantly being obfuscated,\" wrote Deeley, \"and there were some harsh words between them later on, or so I was told.\"</p><h4>Cimino's claim</h4><p>According to Cimino, he would call Washburn while on the road scouting for locations and feed him notes on dialogue and story. Upon reviewing Washburn's draft, Cimino said, \"I came back and read it and I just could not believe what I read. It was like it was written by somebody who was ... mentally deranged.\" Cimino confronted Washburn at the Sunset Marquis in LA about the draft, and Washburn supposedly replied that he couldn't take the pressure and had to go home. Cimino then fired Washburn. Cimino later claimed to have written the entire screenplay himself. Washburn's response to Cimino's comments was, \"It's all nonsense. It's lies. I didn't have a single drink the entire time I was working on the script.\"</p><h4>Washburn's claim</h4><p>According to Washburn, he and Cimino spent three days together in Los Angeles at the Sunset Marquis, hammering out the plot. The script eventually went through several drafts, evolving into a story with three distinct acts. Washburn did not interview any veterans to write The Deer Hunter nor do any research. \"I had a month, that was it,\" he explains. \"The clock was ticking. Write the fucking script! But all I had to do was watch TV. Those combat cameramen in Vietnam were out there in the field with the guys. I mean, they had stuff that you wouldn't dream of seeing about Iraq.\" When Washburn was finished, he says, Cimino and Joann Carelli, an associate producer on The Deer Hunter who went on to produce two more of Cimino's later films, took him to dinner at a cheap restaurant off the Sunset Strip. He recalls, \"We finished, and Joann looks at me across the table, and she says, 'Well, Deric, it's fuck-off time.' I was fired. It was a classic case: you get a dummy, get him to write the goddamn thing, tell him to go fuck himself, put your name on the thing, and he'll go away. I was so tired, I didn't care. I'd been working 20 hours a day for a month. I got on the plane the next day, and I went back to Manhattan and my carpenter job.\"</p><h4>Deeley's reaction to the revised script</h4><p>Deeley felt the revised script, now called The Deer Hunter, broke fresh ground for the project. The protagonist in the Redeker/Garfinkle script, Merle, was an individual who sustained a bad injury in active service and was damaged psychologically by his violent experiences, but was nevertheless a tough character with strong nerves and guts. Cimino and Washburn's revised script distilled the three aspects of Merle's personality and separated them out into three distinct characters. They became three old friends who grew up in the same small industrial town and worked in the same steel mill, and in due course were drafted together to Vietnam. In the original script, the roles of Merle (later renamed Mike) and Nick were reversed in the last half of the film. Nick returns home to Linda, while Mike remains in Vietnam, sends money home to help Steven, and meets his tragic fate at the Russian roulette table.</p><p>A Writers' Guild arbitration process awarded Washburn sole \"Screenplay by\" credit. Garfinkle and Redeker were given a shared \"Story by\" credit with Cimino and Washburn. Deeley felt the story credits for Garfinkle and Redeker \"did them less than justice.\" Cimino contested the results of the arbitration. \"In their Nazi wisdom,\" added Cimino, \" didn't give me the credit because I would be producer, director and writer.\" All four writers—Cimino, Washburn, Garfinkle, and Redeker—received an Oscar nomination for Best Original Screenplay for the film.</p><br/><h3>Filming</h3><p>The Deer Hunter began principal photography on June 20, 1977. This was the first feature film depicting the Vietnam War to be filmed on location in Thailand. All scenes were shot on location (no sound stages). \"There was discussion about shooting the film on a back lot, but the material demanded more realism,\" says Spikings. The cast and crew viewed large amounts of news footage from the war to ensure authenticity. The film was shot over a period of six months. The Clairton scenes comprise footage shot in eight different towns in four states: West Virginia, Pennsylvania, Washington, and Ohio. The initial budget of the film was $8.5 million.</p><p>Meryl Streep accepted the role of the \"vague, stock girlfriend\", in order to remain for the duration of filming with John Cazale, who had been diagnosed with lung cancer. De Niro had spotted Streep in her stage production of The Cherry Orchard and had suggested that she play his girlfriend Linda. Before the beginning of principal photography, Deeley had a meeting with the film's appointed line producer Robert Relyea. Deeley hired Relyea after meeting him on the set of Bullitt (1968) and was impressed with his experience. However, Relyea declined the job, refusing to disclose his reason why. Deeley suspected that Relyea sensed in director Cimino something that would have made production difficult. As a result, Cimino was acting without the day-to-day supervision of a producer.</p><p>Because Deeley was busy overseeing the production of Sam Peckinpah's Convoy (1978), he hired John Peverall to oversee Cimino's shoot. Peverall's expertise with budgeting and scheduling made him a natural successor to Relyea, and Peverall knew enough about the picture to be elevated to producer status. \"John is a straightforward Cornishman who had worked his way up to become a production supervisor,\" wrote Deeley, \"and we employed him as EMI's watchman on certain pictures.\"</p><h4>The wedding scenes</h4><p>The wedding scenes were filmed at the historic St. Theodosius Russian Orthodox Cathedral in the Tremont neighborhood of Cleveland, Ohio. The wedding took five days to film. St. Theodosius' Father Stephen Kopestonsky was cast as the priest at the wedding. The reception scene was filmed at nearby Lemko Hall. The amateur extras lined up for the crowded wedding-dance sequences drank real liquor and beer. The scenes were filmed in the summer, but were set in the fall. To accomplish a look of fall, individual leaves were removed from deciduous trees. Zsigmond also had to desaturate the colors of the exterior shots, partly in camera and in the laboratory processing.</p><p>The production manager asked each of the Russian immigrant extras to bring to the location a gift-wrapped box to double for wedding presents. The manager figured if the extras did this, not only would the production save time and money, but the gifts would also look more authentic. Once the unit unwrapped and the extras disappeared, the crew discovered to their amusement that the boxes weren't empty but filled with real presents, from china to silverware. \"Who got to keep all these wonderful offerings,\" wrote Deeley \"is a mystery I never quite fathomed.\"</p><p>Cimino originally claimed that the wedding scene would take up 21 minutes of screen time. In the end, it took 51 minutes. Deeley believes that Cimino always planned to make this prologue last for an hour, and \"the plan was to be advanced by stealth rather than straight dealing.\"</p><p>At this point in the production, nearly halfway through principal photography, Cimino was already over budget, and producer Spikings could tell from the script that shooting the extended scene could sink the project.</p><h4>The bar and the steel mill</h4><p>The bar was specially constructed in an empty storefront in Mingo Junction, Ohio for $25,000; it later became an actual saloon for local steel mill workers. U.S. Steel allowed filming inside its Cleveland mill, including placing the actors around the furnace floor, only after securing a $5 million insurance policy. Other filming took place in Pittsburgh.</p><h4>Hunting the deer</h4><p>The first deer to be shot was depicted in a \"gruesome close-up\", although he was hit with a tranquilizer dart. This was not a whitetail buck, which is native to Pennsylvania, but a red deer which is native to Eurasia. The stag that Michael lets escape was the same one later used on TV commercials for The Hartford.</p><h4>Vietnam and the Russian roulette scenes</h4><p>The Viet Cong Russian roulette scenes were shot with real rats and mosquitoes, as the three principals (De Niro, Walken, and Savage) were tied up in bamboo cages erected along the River Kwai. The woman who was given the task of casting the extras in Thailand had much difficulty finding a local to play the vicious-looking individual who runs the game. The first actor hired turned out to be incapable of slapping De Niro in the face. The casting agent then found a local Thai man, Somsak Sengvilai, who held a particular dislike of Americans, and so cast him. De Niro suggested that Walken be slapped by one of the guards without any warning. The reaction on Walken's face was genuine. Producer Deeley has said that Cimino shot the brutal Vietcong Russian roulette scenes brilliantly and more efficiently than any other part of the film.</p><p>De Niro and Savage performed their own stunts in the fall into the river, filming the 30 feet (9.1 m) drop fifteen times in two days. During the helicopter stunt, the skids caught on the rope bridge as the helicopter rose, which threatened to seriously injure De Niro and Savage. The actors gestured and shouted to the crew in the helicopter to warn them. Footage of this is included in the film.</p><p>According to Cimino, De Niro requested a live cartridge in the revolver for the scene in which he subjects John Cazale's character to an impromptu game of Russian roulette, to heighten the intensity of the situation. Cazale agreed without protest, but obsessively rechecked the gun before each take to make sure that the live round was not next in the chamber.</p><p>While appearing later in the film, the first scenes shot upon arrival in Thailand were the hospital sequences between Walken and the military doctor. Deeley believed that this scene was \"the spur that would earn him an Academy Award\".</p><p>In the final scene in the gambling den between Mike and Nick, Cimino had Walken and De Niro improvise in one take. His direction to his actors: \"You put the gun to your head, Chris, you shoot, you fall over and Bobby cradles your head.\"</p><h4>Filming locations</h4><p>Thailand</p><ul><li>Patpong, Bangkok, the area used to represent Saigon's red light district.</li><li>Sai Yok, Kanchanaburi Province</li><li>River Kwai, prison camp and initial Russian roulette scene.</li></ul><p>US</p><ul><li>St. Theodosius Russian Orthodox Cathedral, in the Tremont neighborhood of Cleveland, Ohio. The name plaque is clearly visible in one scene.</li><li>Lemko Hall, Cleveland, Ohio. Also located in Tremont, the wedding banquet was filmed here. The name is clearly visible in one scene.</li><li>U.S. Steel Central Furnaces in Cleveland, Ohio. Opening sequence steel mill scenes.</li><li>Mount Baker-Snoqualmie National Forest and Nooksack Falls in the North Cascades range of Washington, deer hunting scenes.Also North Cascades Highway (SR 20), Diablo Lake</li><li>Steubenville, Ohio, for some mill and neighborhood shots.</li><li>Struthers, Ohio, for external house and long-range road shots. Also including, the town's bowling alley is the Bowladrome Lanes, located at 56 State Street, Struthers, Ohio.</li><li>Weirton, West Virginia, for mill and trailer shots.</li></ul><br/><h3>Post-production</h3><p>By this point, The Deer Hunter had cost $13 million and the film still had to go through an arduous post-production. Film editor Peter Zinner was given 600,000 feet (110 mi; 180 km) of printed film to edit, a monumental task at the time. Producers Spikings and Deeley were pleased with the first cut, which ran for three and a half hours. \"We were thrilled by what we saw,\" wrote Deeley, \"and knew that within the three and a half hours we watched there was a riveting film.\"</p><p>Executives from Universal, including Lew Wasserman and Sid Sheinberg, were not very enthusiastic. \"I think they were shocked,\" recalled Spikings. \"What really upset them was 'God Bless America'. Sheinberg thought it was anti-American. He was vehement. He said something like 'You're poking a stick in the eye of America.' They really didn't like the movie. And they certainly didn't like it at three hours and two minutes.\" Deeley wasn't surprised by the Universal response: \"The Deer Hunter was a United Artists sort of picture, whereas Convoy was more in the style of Universal. I'd muddled and sold the wrong picture to each studio.\" Deeley did agree with Universal that the film needed to be shorter, not just because of pacing but also to ensure commercial success. \"A picture under two and a half hours can scrape three shows a day,\" wrote Deeley, \"but at three hours you've lost one third of your screenings and one third of your income for the cinemas, distributors, and profit participants.\"</p><p>Thom Mount, president of Universal at the time, said, \"This was just a... continuing nightmare from the day Michael finished the picture to the day we released it. That was simply because he was wedded to everything he shot. The movie was endless. It was The Deer Hunter and the Hunter and the Hunter. The wedding sequence was a cinematic event all unto its own.\" Mount says he turned to Verna Fields, Universal's then-head of post-production. \"I sicced Verna on Cimino,\" Mount says. \"Verna was no slouch. She started to turn the heat up on Michael, and he started screeching and yelling.\"</p><p>Zinner eventually cut the film to 18,000 feet (3.4 mi; 5.5 km). Cimino later fired Zinner when he discovered that Zinner was editing the wedding scenes. Zinner eventually won Best Editing Oscar for The Deer Hunter. Regarding the clashes between him and Cimino, Zinner stated: \"Michael Cimino and I had our differences at the end, but he kissed me when we both got Academy Awards.\" Cimino later commented in The New York Observer, \" was a moron ... I cut Deer Hunter myself.\"</p><h4>Sound design</h4><p>The Deer Hunter was Cimino's first film to use Dolby noise-reduction system. \"What Dolby does,\" replied Cimino, \"is to give you the ability to create a density of detail of sound—a richness so you can demolish the wall separating the viewer from the film. You can come close to demolishing the screen.\" It took five months to mix the soundtrack. One short battle sequence—200 feet of film in the final cut—took five days to dub. Another sequence recreated the 1975 American evacuation of Saigon; Cimino brought the film's composer, Stanley Myers, out to the location to listen to the auto, tank, and jeep horns as the sequence was being photographed. The result, according to Cimino: Myers composed the music for that scene in the same key as the horn sounds, so the music and the sound effects would blend with the images to create one jarring, desolate experience.</p><h4>Previews</h4><p>Both the long and short versions were previewed to Midwestern audiences, although there are differing accounts among Cimino, Deeley, and Spikings as to how the previews panned out. Director Cimino claims he bribed the projectionist to interrupt the shorter version, in order to obtain better reviews of the longer one. According to producer Spikings, Wasserman let EMI's CEO Bernard Delfont decide between the two and chose Cimino's longer cut. Deeley claims that the two-and-a-half-hour version tested had a better response.</p><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">The Deer Hunter</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Stanley Myers</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">1990</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">1978</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Film score</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Capitol</td></tr></tbody></table><p>The soundtrack to The Deer Hunter was released on audio CD on October 25, 1990.</p><h4>Selected tracks</h4><ul><li>Stanley Myers's \"Cavatina\" (also known as \"He Was Beautiful\"), performed by classical guitarist John Williams, is commonly known as \"The Theme from The Deer Hunter\". According to producer Deeley, he discovered that the piece was originally written for a film called The Walking Stick (1970) and, as a result, had to pay the original purchaser an undisclosed sum.</li><li>\"Can't Take My Eyes Off You\", a 1967 hit song, sung by Frankie Valli. It is played in John's bar when all of the friends sing along and at the wedding reception. According to Cimino, the actors sang along to a recording of the song as it was played instead of singing to a beat track, a standard filmmaking practice. Cimino felt that would make the sing-along seem more real.</li><li>During the wedding ceremonies and party, the Russian Orthodox songs such as \"Slava\", and Russian folk songs such as \"Korobushka\" and \"Katyusha\", are played.</li><li>The final passage from Kamarinskaya by Mikhail Glinka is heard briefly when the men are driving through the mountains. Also, a part of the opening section of the same work is heard during the second hunt when Michael is about to shoot the stag.</li><li>Russian Orthodox funeral music is also employed during Nick's funeral scene, mainly \"Vechnaya Pamyat\", which means \"eternal memory\".</li></ul><br/><h3>Release</h3><p>The Deer Hunter debuted at one theater each in New York and Los Angeles for a week on December 8, 1978. The release strategy was to qualify the film for Oscar consideration and close after a week to build interest. After the Oscar nominations, Universal widened the distribution to include major cities, building up to a full-scale release on February 23, 1979, just following the Oscars. This film was important for helping release patterns for so-called prestige pictures that screen only at the end of the year to qualify for Academy Award recognition. The film eventually grossed $48.9 million at the US box office.</p><p>CBS paid $3.5 million for three runs of the film. The network later cancelled the acquisition on the contractually permitted grounds of the film containing too much violence for US network transmission.</p><br/><h3>Analysis</h3><h4>Controversy over Russian roulette</h4><p>One of the most talked-about sequences in the film, the Viet Cong's use of Russian roulette with POWs, was criticized as being contrived and unrealistic since there were no documented cases of Russian roulette in the Vietnam War. Associated Press reporter Peter Arnett, who won a Pulitzer Prize for his coverage of the war, wrote in the Los Angeles Times, \"In its 20 years of war, there was not a single recorded case of Russian roulette ... The central metaphor of the movie is simply a bloody lie.\"</p><p>Cimino countered that his film was not political, polemical, literally accurate, or posturing for any particular point of view. Nevertheless, he also claimed he had news clippings from Singapore that confirm Russian roulette was used during the war, without specifying which article.</p><h4>Critics' response</h4><p>In his review, Roger Ebert defended the artistic license of Russian roulette, arguing \"it is the organizing symbol of the film: Anything you can believe about the game, about its deliberately random violence, about how it touches the sanity of men forced to play it, will apply to the war as a whole. It is a brilliant symbol because, in the context of this story, it makes any ideological statement about the war superfluous.\"</p><p>Film critic and biographer David Thomson also agrees that the film works despite the controversy: \"There were complaints that the North Vietnamese had not employed Russian roulette. It was said that the scenes in Saigon were fanciful or imagined. It was also suggested that De Niro, Christopher Walken, and John Savage were too old to have enlisted for Vietnam (Savage, the youngest of the three, was thirty). Three decades later, 'imagination' seems to have stilled those worries ... and The Deer Hunter is one of the great American films.\"</p><p>In her review, Pauline Kael wrote \"The Vietcong are treated in the standard inscrutable-evil Oriental style of the Japanese in the Second World War movies ... The impression a viewer gets is that if we did some bad things there we did them ruthlessly but impersonally; the Vietcong were cruel and sadistic.\"</p><p>In his Vanity Fair article \"The Vietnam Oscars\", Peter Biskind wrote that the political agenda of The Deer Hunter was something of a mystery: \"It may have been more a by-product of Hollywood myopia, the demands of the war-film genre, garden-variety American parochialism, and simple ignorance than it was the pre-meditated right-wing road map it seemed to many.\"</p><h4>Cast and crew response</h4><p>According to Christopher Walken, the historical context was not paramount: \"In the making of it, I don't remember anyone ever mentioning Vietnam!\" De Niro added to this sentiment: \"Whether actually happened or not, it's something you could imagine very easily happening. Maybe it did. I don't know. All's fair in love and war.\" Producer Spikings, while proud of the film, regrets the way the Vietnamese were portrayed. \"I don't think any of us meant it to be exploitive,\" Spikings said. \"But I think we were ... ignorant. I can't think of a better word for it. I didn't realize how badly we'd behaved to the Vietnamese people ...\"</p><p>Producer Deeley, on the other hand, was quick to defend Cimino's comments on the nature and motives of the film: \"The Deer Hunter wasn't really 'about' Vietnam. It was something very different. It wasn't about drugs or the collapse of the morale of the soldiers. It was about how individuals respond to pressure: different men reacting quite differently. The film was about three steel workers in extraordinary circumstances. Apocalypse Now is surreal. The Deer Hunter is a parable ... Men who fight and lose an unworthy war face some obvious and unpalatable choices. They can blame their leaders.. or they can blame themselves. Self-blame has been a great burden for many war veterans. So how does a soldier come to terms with his defeat and yet still retain his self-respect? One way is to present the conquering enemy as so inhuman, and the battle between the good guys (us) and the bad guys (them) so uneven, as to render defeat irrelevant. Inhumanity was the theme of The Deer Hunter's portrayal of the North Vietnamese prison guards forcing American POWs to play Russian roulette. The audience's sympathy with prisoners who (quite understandably) cracked thus completes the chain. Accordingly, some veterans who suffered in that war found the Russian roulette a valid allegory.\"</p><h4>Director Cimino's autobiographical intent</h4><p>Cimino frequently referred to The Deer Hunter as a \"personal\" and \"autobiographical\" film, although later investigation by journalists like Tom Buckley of Harper's revealed inaccuracies in Cimino's accounts and reported background.</p><h4>Coda of \"God Bless America\"</h4><p>The final scene in which all the main characters gather and sing \"God Bless America\" became a subject of heated debate among critics when the film was released. It raised the question of whether this conclusion was meant ironically or not – \"as a critique of patriotism or a paean to it\".</p><br/><h3>Reception</h3><p>Upon its release, The Deer Hunter received acclaim from critics, who considered it the best American epic since Francis Ford Coppola's The Godfather. The film was praised for its depiction of realistic working-class settings and environment; Cimino's direction; the performances of De Niro, Walken, Streep, Savage, Dzundza and Cazale; the symphonic shifts of tone and pacing in moving from America to Vietnam; the tension during the Russian roulette scenes; and the themes of American disillusionment. The film holds an approval rating of 86% on Rotten Tomatoes based on 127 reviews, with an average score of 8.60/10. The consensus reads: \"Its greatness is blunted by its length and one-sided point of view, but the film's weaknesses are overpowered by Michael Cimino's sympathetic direction and a series of heartbreaking performances from Robert De Niro, Meryl Streep, and Christopher Walken\". On Metacritic, the film has a weighted average score of 86 out of 100 based on reviews from 18 critics, indicating \"universal acclaim\".</p><p>Roger Ebert of the Chicago Sun-Times gave the film four out of four stars and called it \"one of the most emotionally shattering films ever made.\" Gene Siskel from the Chicago Tribune praised the film, saying, \"This is a big film, dealing with big issues, made on a grand scale. Much of it, including some casting decisions, suggest inspiration by The Godfather.\" Leonard Maltin also gave the film four stars, calling it a \"sensitive, painful, evocative work\". Vincent Canby of The New York Times called The Deer Hunter \"a big, awkward, crazily ambitious motion picture that comes as close to being a popular epic as any movie about this country since The Godfather. Its vision is that of an original, major new filmmaker.\" David Denby of New York called it \"an epic\" with \"qualities that we almost never see any more—range and power and breadth of experience.\" Jack Kroll of Time asserted it put director Cimino \"right at the center of film culture.\" Stephen Farber pronounced the film in New West magazine as \"the greatest anti-war movie since La Grande Illusion.\"</p><p>However, The Deer Hunter was not without critical backlash. Pauline Kael of The New Yorker wrote a positive review with some reservations: \" a small minded film with greatness in it ... with an enraptured view of common life ... enraging, because, despite its ambitiousness and scale, it has no more moral intelligence than the Eastwood action pictures.\" Andrew Sarris wrote that the film was \"massively vague, tediously elliptical, and mysteriously hysterical ... It is perhaps significant that the actors remain more interesting than the characters they play.\" Jonathan Rosenbaum disparaged The Deer Hunter as an \"Oscar-laden weepie about macho buddies\" and \"a disgusting account of what the evil Vietnamese did to poor, innocent Americans\". John Simon of New York wrote: \"For all its pretensions to something newer and better, this film is only an extension of the old Hollywood war-movie lie. The enemy is still bestial and stupid, and no match for our purity and heroism; only we no longer wipe up the floor with him—rather, we litter it with his guts.\" In a review of The Deer Hunter for Chicago magazine, Studs Terkel wrote that he was \"appalled by its shameless dishonesty,\" and that \"not since The Birth of a Nation has a non-Caucasian people been portrayed in so barbaric a fashion.\" Cimino's dishonesty \"was to project a sadistic psyche not only onto 'Charlie' but to all the Vietnamese portrayed.\"</p><p>Author Karina Longworth notes that Streep \"made a case for female empowerment by playing a woman to whom empowerment was a foreign concept—a normal lady from an average American small town, for whom subservience was the only thing she knew\". She states that The Deer Hunter \"evokes a version of dominant masculinity in which male friendship is a powerful force\". It has a \"credibly humanist message\", and that the \"slow study of the men in blissfully ignorant homeland machismo is crucial to it\".</p><p>During the 29th Berlin International Film Festival in 1979, the Soviet delegation expressed its indignation with the film which, in their opinion, insulted the Vietnamese people in numerous scenes. Other communist states also voiced their solidarity with the \"heroic people of Vietnam\". They protested against the screening of the film and insisted that it violated the statutes of the festival because it in no way contributed to the \"improvement of mutual understanding between the peoples of the world\". The ensuing domino effect led to the walk-outs of the Cubans, East Germans, Hungarians, Bulgarians, Poles and Czechoslovakians, and two members of the jury resigned in sympathy.</p><h4>Top-ten lists</h4><ul><li>3rd—Roger Ebert, Chicago Sun-Times. Ebert also placed Deer Hunter on his list of the best films of the 1970s.</li><li>3rd—Gene Siskel, Chicago Tribune</li></ul><p>Academy Award-winning film director Miloš Forman and Academy Award-nominated actor Mickey Rourke consider The Deer Hunter to be one of the greatest films of all time.</p><h4>Revisionism following Heaven's Gate</h4><p>Cimino's next film, Heaven's Gate (1980), debuted to lacerating reviews and took in only $3 million in ticket sales, effectively leaving United Artists bankrupt. The failure of Heaven's Gate led several critics to revise their positions on The Deer Hunter. Canby said in his famous review of Heaven's Gate, \" fails so completely that you might suspect Mr. Cimino sold his soul to the Devil to obtain the success of The Deer Hunter, and the Devil has just come around to collect.\" Andrew Sarris wrote in his review of Heaven's Gate, \"I'm a little surprised that many of the same critics who lionized Cimino for The Deer Hunter have now thrown him to the wolves with equal enthusiasm.\" Sarris added, \"I was never taken in ... Hence, the stupidity and incoherence in Heaven's Gate came as no surprise since very much the same stupidity and incoherence had been amply evident in The Deer Hunter.\" In his book Final Cut: Dreams and Disaster in the Making of Heaven's Gate, Steven Bach wrote, \"critics seemed to feel obliged to go on the record about The Deer Hunter, to demonstrate that their critical credentials were un-besmirched by having been, as Andrew Sarris put it, 'taken in.'\" Film critic Mark Kermode described Deer Hunter as \"a genuinely terrible film\".</p><p>However, many critics, including David Thomson and A. O. Scott, maintain that The Deer Hunter is still a great film, the power of which has not diminished.</p><br/><h3>Awards</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"2\">Academy Awards record</th></tr><tr><td>1. Best Actor in a Supporting Role, <span>Christopher Walken</span></td></tr><tr><td>2. Best Director, <span>Michael Cimino</span></td></tr><tr><td>3. Best Film Editing, <span>Peter Zinner</span></td></tr><tr><td>4. Best Picture, <span>Barry Spikings</span>, <span>Michael Deeley</span>, <span>Michael Cimino</span>, John Peverall</td></tr><tr><td>5. Best Sound, Richard Portman, William L. McCaughey, Aaron Rochin, C. Darin Knight</td></tr><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"2\">Golden Globe Awards record</th></tr><tr><td>1. Best Director – Motion Picture, Michael Cimino</td></tr><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"2\">BAFTA Awards record</th></tr><tr><td>1. Best Film Cinematography, <span>Vilmos Zsigmond</span></td></tr><tr><td>2. Best Film Editing, Peter Zinner</td></tr></tbody></table><h4>Lead-up to awards season</h4><p>Film producer and \"old-fashioned mogul\" Allan Carr used his networking abilities to promote The Deer Hunter. \"Exactly how Allan Carr came into The Deer Hunter's orbit I can no longer remember,\" recalled producer Deeley, \"but the picture became a crusade to him. He nagged, charmed, threw parties, he created word-of-mouth – everything that could be done in Hollywood to promote a project. Because he had no apparent motive for this promotion, it had an added power and legitimacy and it finally did start to penetrate the minds of the Universal's sales people that they actually had in their hands something a bit more significant than the usual.\" Deeley added that Carr's promotion of the film was influential in positioning The Deer Hunter for Oscar nominations.</p><p>On the Sneak Previews special \"Oscar Preview for 1978\", Roger Ebert correctly predicted that The Deer Hunter would win for Best Picture while Gene Siskel predicted that Coming Home would win. However, Ebert incorrectly guessed that Robert De Niro would win for Best Actor for Deer Hunter and Jill Clayburgh would win for Best Actress for An Unmarried Woman while Siskel called the wins for Jon Voight as Best Actor and Jane Fonda as Best Actress, both for Coming Home. Both Ebert and Siskel correctly predicted the win for Christopher Walken receiving the Oscar for Best Supporting Actor.</p><p>According to producer Deeley, orchestrated lobbying against The Deer Hunter was led by Warren Beatty, whose own picture Heaven Can Wait had multiple nominations. Beatty also used ex-girlfriends in his campaign: Julie Christie, serving on the jury at the Berlin Film Festival where Deer Hunter was screened, joined the walkout of the film by the Russian jury members. Jane Fonda also criticized The Deer Hunter in public. Deeley suggested that her criticisms partly stemmed from the competition between her film Coming Home vying with The Deer Hunter for Best Picture. According to Deeley, he planted a friend of his in the Oscar press area behind the stage to ask Fonda if she had seen The Deer Hunter. Fonda replied she had not seen the film, and to this day she still has not.</p><p>As the Oscars drew near, the backlash against The Deer Hunter gathered strength. When the limos pulled up to the Dorothy Chandler Pavilion on April 9, 1979, they were met by demonstrators, mostly from the Los Angeles chapter of Vietnam Veterans Against the War. The demonstrators waved placards covered with slogans that read \"No Oscars for racism\" and \"The Deer Hunter a bloody lie\" and thrust pamphlets berating Deer Hunter into long lines of limousine windows. Washburn, nominated for Best Original Screenplay, claims his limousine was pelted with stones. According to Variety, \"Police and The Deer Hunter protesters clashed in a brief but bloody battle that resulted in 13 arrests.\"</p><p>De Niro was so anxious that he did not attend the Oscars ceremony. He asked the Academy to allow him to sit out the show backstage, but when the Academy refused, De Niro stayed home in New York. Producer Deeley made a deal with fellow producer David Puttnam, whose film Midnight Express was nominated, that each would take $500 to the ceremony so if one of them won, the winner would give the loser the $500 to \"drown his sorrows in style.\"</p><h4>Complete list of awards</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"9\"><span>Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Barry Spikings</span>, <span>Michael Deeley</span>, <span>Michael Cimino</span> and John Peverall</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"9\"></td></tr><tr><td><span>Best Director</span></td><td><span>Michael Cimino</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td><span>Robert De Niro</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td><span>Christopher Walken</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td><span>Meryl Streep</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay – Written Directly for the Screen</span></td><td><span>Deric Washburn</span>, Michael Cimino, <span>Louis A. Garfinkle</span> and <span class=\"mw-redirect\">Quinn K. Redeker</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Vilmos Zsigmond</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Peter Zinner</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound</span></td><td><span>Richard Portman</span>, <span>William McCaughey</span>, <span>Aaron Rochin</span> and <span>Darin Knight</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>Best Edited Feature Film</span></td><td>Peter Zinner</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\">American Movie Awards</td><td colspan=\"2\">Best Film</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"5\"></td></tr><tr><td>Best Director</td><td>Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor</td><td>Robert De Niro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor</td><td>Christopher Walken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress</td><td>Meryl Streep</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Blue Ribbon Awards</span></td><td><span>Best Foreign Language Film</span></td><td rowspan=\"3\">Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"9\"><span>British Academy Film Awards</span></td><td><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"9\"></td></tr><tr><td><span>Best Direction</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Leading Role</span></td><td>Robert De Niro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actress in a Leading Role</span></td><td>Meryl Streep</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td>Christopher Walken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Screenplay</span></td><td>Deric Washburn</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>Vilmos Zsigmond</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Editing</span></td><td>Peter Zinner</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Sound</span></td><td>Darin Knight, Jim Klinger and Richard Portman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"6\"><span>Golden Globe Awards</span></td><td colspan=\"2\"><span>Best Motion Picture – Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"6\"></td></tr><tr><td><span>Best Actor in a Motion Picture – Drama</span></td><td>Robert De Niro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor – Motion Picture</span></td><td>Christopher Walken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actress – Motion Picture</span></td><td>Meryl Streep</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director – Motion Picture</span></td><td>Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Screenplay – Motion Picture</span></td><td>Deric Washburn</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Hochi Film Awards</span></td><td><span>Best International Picture</span></td><td>Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Japan Academy Film Prize</span></td><td colspan=\"2\"><span class=\"mw-redirect\">Outstanding Foreign Language Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Kinema Junpo Awards</span></td><td>Best Foreign Director</td><td>Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">Los Angeles Film Critics Association Awards</span></td><td colspan=\"2\"><span>Best Film</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Michael Cimino</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Actor</span></td><td>Robert De Niro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Christopher Walken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>National Film Preservation Board</span></td><td><span>National Film Registry</span></td><td><i>The Deer Hunter</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Inducted</td><td></td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">National Society of Film Critics Awards</span></td><td><span>Best Film</span></td><td><i>The Deer Hunter</i></td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">2nd Place</td><td rowspan=\"5\"></td></tr><tr><td><span>Best Director</span></td><td>Michael Cimino</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td><span>Best Actor</span></td><td>Robert De Niro</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">5th Place</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Christopher Walken</td><td style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">3rd Place</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Meryl Streep</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>New York Film Critics Circle Awards</span></td><td><span>Best Film</span></td><td><i>The Deer Hunter</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\"></td></tr><tr><td><span>Best Actor</span></td><td>Robert De Niro</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Christopher Walken</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress</span></td><td>Meryl Streep</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td colspan=\"2\">Hall of Fame – Motion Picture</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Best Drama Written Directly for the Screen</span></td><td>Deric Washburn, Michael Cimino, Louis Garfinkle and Quinn K. Redeker</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Legacy</h3><p>The Deer Hunter was among the early, and most controversial, major theatrical films to be critical of the American involvement in Vietnam following 1975 when the war officially ended. While the film opened the same year as Hal Ashby's Coming Home, Sidney Furie's The Boys in Company C, and Ted Post's Go Tell the Spartans, it was the first film about Vietnam to reach a wide audience and critical acclaim, culminating in the winning of the Oscar for Best Picture. Other films released later that illustrated the 'hellish', futile conditions of bloody Vietnam War combat included:</p><ul><li>Francis Ford Coppola's Apocalypse Now (1979)</li><li>Oliver Stone's Platoon (1986)</li><li>Stanley Kubrick's Full Metal Jacket (1987)</li><li>John Irvin's Hamburger Hill (1987)</li><li>Oliver Stone's Born on the Fourth of July (1989)</li></ul><p>David Thomson wrote in an article titled \"The Deer Hunter: Story of a scene\" that the film changed the way war-time battles were portrayed on film: \"The terror and the blast of firepower changed the war film, even if it only used a revolver. More or less before the late 1970s, the movies had lived by a Second World War code in which battle scenes might be fierce but always rigorously controlled. The Deer Hunter unleashed a new, raw dynamic in combat and action, paving the way for Platoon, Saving Private Ryan and Clint Eastwood's Iwo Jima films.\"</p><p>In a 2011 interview with Rotten Tomatoes, actor William Fichtner retrospectively stated that he and his partner were silenced after seeing the film, stating that \"the human experience was just so pointed; their journeys were so difficult, as life is sometimes. I remember after seeing it, walking down the street — I actually went with a girl on a date and saw The Deer Hunter, and we left the theater and walked for like an hour and nobody said anything; we were just kind of stunned about that.\"</p><p>The deaths of approximately 25 people who died playing Russian roulette were reported as having been influenced by scenes in the movie.</p><h4>Honors and recognition</h4><p>In 1996, The Deer Hunter was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".</p><p>American Film Institute included the film as #79 in AFI's 100 Years...100 Movies, #30 in AFI's 100 Years...100 Thrills, and #53 in AFI's 100 Years...100 Movies (10th Anniversary Edition).</p><p>The film ranks 467th in the Empire magazine's 2008 list of the 500 greatest movies of all time, noting:</p><blockquote>Cimino's bold, powerful 'Nam epic goes from blue-collar macho rituals to a fiery, South East Asian hell and back to a ragged singalong of America the Beautiful. De Niro holds it together, but Christopher Walken, Meryl Streep and John Savage are unforgettable.</blockquote><p>The New York Times placed the film on its Best 1000 Movies Ever list.</p><p>Jan Scruggs, a Vietnam veteran who became a counselor with the U.S. Department of Labor, thought of the idea of building a National Memorial for Viet Nam Veterans after seeing a screening of the film in March 1979, and he established and operated the memorial fund which paid for it. Director Cimino was invited to the memorial's opening.</p><br/><h3>Home media</h3><p>The Deer Hunter has twice been released on DVD in America. The first 1998 issue was by Universal, with no extra features and a non-anamorphic transfer, and has since been discontinued. A second version, part of the \"Legacy Series\", was released as a two-disc set on September 6, 2005, with an anamorphic transfer of the film. The set features a cinematographer's commentary by Vilmos Zsigmond, deleted and extended scenes, and production notes.</p><p>The Region 2 version of The Deer Hunter, released in the UK and Japan, features a commentary track from director Michael Cimino.</p><p>The film was released on HD DVD on December 26, 2006.</p><p>StudioCanal released the film on the Blu-ray format in countries other than the United States on March 11, 2009. It was released on Blu-ray in the U.S. on March 6, 2012.</p><p>On May 26, 2020, Shout! Factory released the film on Ultra HD Blu-ray featuring a new Dolby Vision transfer.</p><br/>"
  },
  "errorMessage": ""
}