{
  "imDbId": "tt8503618",
  "title": "Hamilton",
  "fullTitle": "Hamilton (2020)",
  "type": "Movie",
  "year": "2020",
  "items": [
    {
      "publisher": "",
      "author": "Chicago Tribune",
      "link": "https://www.chicagotribune.com/entertainment/theater/chris-jones/sc-ent-hamilton-disney-plus-review-0630-20200630-bmnd3v5vozawxlvla36avdrnu4-story.html",
      "rate": "100",
      "content": "Director Thomas Kail’s filmed version of the blockbuster musical Hamilton, available Friday on the Disney Plus streaming service, surely is the greatest translation, democratization and preservation of any Broadway show, ever."
    },
    {
      "publisher": "The Associated Press",
      "author": "Mark Kennedy",
      "link": "https://apnews.com/28d34d8aa0e1fba375a46b92eb313e7b",
      "rate": "100",
      "content": "Kail’s camera captures actors’ intimate faces during key moments in a way impossible for theater-goers and incorporates audience reaction to create an electric filmed version."
    },
    {
      "publisher": "Empire",
      "author": "Helen O'Hara",
      "link": "https://www.empireonline.com/movies/reviews/hamilton/",
      "rate": "100",
      "content": "Entertaining, energetic and unfailingly smart, this is theatre at the highest level, performed by a cast without a weak link. You can’t say no to this."
    },
    {
      "publisher": "Boston Globe",
      "author": "Ty Burr",
      "link": "https://www.bostonglobe.com/2020/06/30/arts/three-cheers-four-stars-hamilton-goes-broadway-screen/",
      "rate": "100",
      "content": "Hamilton stands as a reminder of how hard it is to get a democracy right, and how necessary it is to keep trying, as long as it takes."
    },
    {
      "publisher": "IndieWire",
      "author": "David Ehrlich",
      "link": "https://www.indiewire.com/criticism/movies/hamilton-review-disney-plus-1234570496/",
      "rate": "91",
      "content": "This is Hamilton as you always wanted to see it, and it always will be."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Justin Chang",
      "link": "https://www.latimes.com/entertainment-arts/movies/story/2020-06-30/hamilton-review-lin-manuel-miranda-disney",
      "rate": "90",
      "content": "One of the show’s more obvious lessons is that history is a living, breathing entity, and that the cyclical rise-and-fall narratives of leaders and empires can be studied and recounted in ways that uncover bold new patterns of meaning. This film, a straightforward capture of a momentous work of art, illuminates those patterns in ways both sobering and thrilling."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "David Rooney",
      "link": "https://www.hollywoodreporter.com/movies/movie-reviews/hamilton-review-1301071/",
      "rate": "80",
      "content": "There's a good reason behind every technical choice — closeups and moments of stillness intensify the intimacy of the more introspective songs; nimble camerawork juices up the contentious cabinet battles; wide shots and stunning overheads add to the scope of momentous scenes like the fatal duels that punctuate the story."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Barry Hertz",
      "link": "https://www.theglobeandmail.com/arts/film/reviews/article-disneys-hamilton-is-tremendous-entertainment-perfect-for-the/",
      "rate": "75",
      "content": "This is a tremendously entertaining trip through the births of both America and the musical form, with each institution given a lightly revisionist torque by Miranda, who approaches the material with a scholar’s dedication to detail and a showman’s slick wit."
    },
    {
      "publisher": "New York Post",
      "author": "Johnny Oleksinski",
      "link": "https://nypost.com/2020/06/30/hamilton-review-musical-loses-edge-but-reveals-tenderness/",
      "rate": "75",
      "content": "Hamilton the film is just OK."
    },
    {
      "publisher": "Variety",
      "author": "Peter Debruge",
      "link": "https://variety.com/2020/film/reviews/hamilton-review-lin-manuel-miranda-disney-plus-1234694098/",
      "rate": "70",
      "content": "The film aims to be more intimate, but it frequently deprives audiences of the show’s ingenious spatial design. Still, this original cast is so charismatic — and Miranda’s ultra-dense, dizzyingly clever book and lyrics are so effective — that they maintain our attention even when the edit feels like one of those live sporting events, as a producer sits in the control booth choosing between cameras in the moment, rather than planning out the shoot in advance."
    }
  ],
  "errorMessage": ""
}