{
  "imDbId": "tt8503618",
  "title": "Hamilton",
  "fullTitle": "Hamilton (2020)",
  "type": "Movie",
  "year": "2020",
  "items": [
    {
      "username": "ferguson-6",
      "userUrl": "https://www.imdb.com/user/ur0806494",
      "reviewLink": "https://www.imdb.com/review/rw5882180",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "9",
      "helpful": "90 out of 118 found this helpful.",
      "title": "just superb",
      "content": "Greetings again from the darkness. You know what it's like when people start talking about some great new restaurant that just opened (think back to pre-pandemic)? And then you start to hear your friends and co-workers raving about it ... best 'steamed broccoli' (ok, insert your favorite entrée) I've ever tasted! Having been burned many times with high expectations, you remain skeptical, but make the reservation. Well, that's been me with \"Hamilton.\" For almost 5 years, the hype was just too much. Surely folks were caught up in the frenzy, and peer pressure was such that no one would admit it wasn't all that. So, now I'm here ... throwing myself at the mercy of the Theater Gods. Thanks to Disney Plus, I only needed to invest a little (ok, a lot) of time, rather than a few hundred dollars for a ticket. This is me humbly admitting I was wrong. The show is fantastic, and I only wish my first viewing had been a live performance.Unfortunately (because of what I mentioned above) this can't be a comparison of a live stage performance and the film version. Instead, this will briefly outline what I noticed in the movie. First, and I believe this is key, the original stage director Thomas Kail is back to direct the film. It should be noted that the film version is a blend of a couple of recorded live shows, plus some recorded songs seamlessly edited in. This is the original cast doing what they do best, and the edits are imperceptible. Second, the main cast is filled with dynamic performers. In many stage shows, one or two actors are head and shoulders above the others. Not so here. At a minimum the top seven actors are as skilled and fun to watch as any you've seen. Third, this is a true musical in that the songs drive the story. Some of the early songs require serious concentration to catch the lines, but even if you miss some lyrics, the gist of what's happening is pretty clear. These aren't so much catchy sing-along types, but you'll easily recall the scenes when you hear the songs again at a later date. We see a perfect melding of music-performance-story.Of course most everyone knows that Lin-Manuel Miranda is the creative force behind the show. He credits writer Ron Chernow's book on Alexander Hamilton as the inspiration for the production, but it's Mr. Miranda that appeared on every talk show for a couple of years, and he also performs as Alexander Hamilton. Daveed Diggs has dual roles as the flamboyant Marquis de Lafayette and the equally flamboyant (at least here) Thomas Jefferson. Renee Elise Goldsberry takes over the stage with her powerful voice as Angelica Schuyler, and Chris Jackson is a dominating physical presence as George Washington. Jonathan Groff (from \"Mindhunter\") is absolutely hysterical and unforgettable as King George III, both through song and strut. Everyone will have their favorite performers, and truly they are all exceptional, and I'd like to point out the two that took my breath away. Phillipa Soo as Eliza Hamilton has a pristine voice that will bring tears to many eyes. She may not be as involved with the political elements of the story, but in the most emotional moments, she is front and center. Lastly, the passion Leslie Odom Jr brings to his role as Adam Burr is beyond description. He may be the \"villain\", but he makes Burr accessible and easy to understand ... plus Odom is a terrific singer and performer, and he lights up the stage.It's easy to overlook the dance and stage choreography since it's never over-the-top, but the dancers are terrific and the performers make great use of the single set - although props are regularly brought in and taken away. Perhaps what really makes this click as movie entertainment is the expert use of cameras and editing. We see the full stage when we should, and we are offered close-ups when it's most effective. I do hope to catch the live show at some point, but if my Hamilton experience is limited to this cinematic version, well ... \"that would be enough.\""
    },
    {
      "username": "rebekahrox",
      "userUrl": "https://www.imdb.com/user/ur12332223",
      "reviewLink": "https://www.imdb.com/review/rw5881010",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "8",
      "helpful": "146 out of 197 found this helpful.",
      "title": "Grateful for the captions, the pause button, and Wikipedia.",
      "content": "I started watching this out of curiosity and to say I have seen it, being the cultural touchstone that it is. At first, I was a little detached, not liking the songs too much, and thinking I would probably just skip through to end in a minute. I couldn't stop watching and it really sucked me in. I have to say, I'm not sure I would have enjoyed it at all, live in the theater. I benefited greatly from the captions and the ability to put it on pause to consult Wikipedia from time to time. The lyrics were so clever and really told the story. I ended up very moved and almost cheering at the end. Of course, now that I am familiar with the story, I would love to see it live and would enjoy it immensely. But I would strongly recommend this for a first time viewing. I will definitely re-watch. And probably again and again."
    },
    {
      "username": "guapo_andres",
      "userUrl": "https://www.imdb.com/user/ur66508136",
      "reviewLink": "https://www.imdb.com/review/rw5877339",
      "warningSpoilers": false,
      "date": "3 July 2020",
      "rate": "10",
      "helpful": "290 out of 371 found this helpful.",
      "title": "BEAUTIFUL",
      "content": "I'm a mexican boy who has never got the chance to go to Broadway, all I've seen are bootlegs, and they're fine but not like this. This is a beautiful shot of the great spectacle Hamilton is, the flawless music of Lin Manuel Miranda, the production, the photography, costumes. And the acting, Leslie Odom Jr., Renneè, Miranda and Daveed Diggs shine on their roles, I don't know is this can be nominated for any award, but damn it deserves it"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw5903494",
      "warningSpoilers": false,
      "date": "13 July 2020",
      "rate": "10",
      "helpful": "61 out of 83 found this helpful.",
      "title": "Musical history",
      "content": "'Hamilton' was a major surprise for me when seeing and hearing it. Music is such a big part of my life, being now a semi-professional singer and raised into a musical family, and am a fan of musicals, especially the golden age ones. History was also one of my favourite and best subjects in most of my up and down school life, until it didn't work out in sixth form when my confidence went and my comprehension and drive worsened. So having a musical to combine the two immediately intrigued me, despite not being the biggest fan of the dominant styles here (was raised on classical music and opera personally).That is what was meant when saying that 'Hamilton' was a major surprise. Hearing that a filmed version of a production was coming to Disney+, which has been a much needed distraction, there was no doubt in my mind about seeing it. So that the mix of history and music, the meaningful and relevant lyrics, the brilliant performances and the energy and heart it has can be revisited again. It does play fast and loose with history, blame that on the musical and not the production, sure and the style(s) of music that dominates the score here are not my first choices usually, but actually for its entertainment value, emotional impact and how well crafted it is as an overall whole, 'Hamilton' was a real winner. As was this production. Which was very much needed after suffering through 'Artemis Fowl', a musical surprise adapted masterfully and so accessibly and through a particularly unsettling time in a terrible few years.It, the production that is, looks great. The sumptuous and true to the respective periods costumes especially and the setting is not too elaborate or overblown while still never looking cheap. Personally thought that the production was very well filmed, certainly compared to other filmed productions of musical theatre, opera and ballet seen and have seen many of each (being a major fan of all three). It made me feel like a member of an audience seeing it live, expect seeing it far more accessibly in terms of money and locations. Which is what is so great about these live/streamed performances and they have proven to be invaluable. Of which 'Hamilton' has been a big highlight.Musically, 'Hamilton' is on point. Those that don't like the styles are best staying away unless wanting to see what the hoopla is all about, but as someone that saw it with an open mind and wanting to stretch even more my musical horizons 'Hamilton' made me appreciate hip hop and rap much more because they were so well done in their own way. When they are well done and not too repetitive or preachy, yes it is dependent on how they're executed in my view rather than any bias towards the styles, that is when it is easy to appreciate them and that is what 'Hamilton' excels so well in. Also found it very well accompanied.What also comes over brilliantly is how 'Hamilton' is written. The musical and performance are very song heavy, which some may not like dependent on what your feelings on musicals, hip hop and rap are (some love it, others hate it and it is all down to taste which is fair enough). Found the melodies very clever and easy to remember, amazing considering how many there are and not an easy thing to achieve these days. It was the lyrics though that made a bigger impression on me, these lyrics were vastly entertaining and also at times quite emotional but what is just as admirable are their honesty and how relevant they are. These are lyrics that are likely to connect for many, and from the sounds of it have done. Historically, it is far and loose but that didn't matter for me being somebody that watched not expecting a history lesson. 'Hamilton' does very well at making people more interested in history and the particular time periods depicted, that is from my experience from seeing it with people that felt exactly the same as me. What is great about this production is how it does so well in being true and capturing the spirited energy and heart of the musical itself, which is what filmed adaptations of musicals in my mind should do.Really loved 'Hamilton's' performances. Have seen both love and hate for Lin Manuel Miranda's performance. Personally loved his work here, he was very heavily involved in making 'Hamilton' work, his dilligent efforts very much obvious here, and he gives the equivalent of the performance of his life here. He is charming and has great authority and comic timing and really do disagree that he doesn't have singing ability, he proved in 'Mary Poppins Returns' in my view that he could and he does great in this regard too. Dramatically he is the stuff of legends as is the joy that was Leslie Odom Jr. Daveed Diggs brings tremendous energy in Act 2 especially and Jonathan Groff is absolutely hilarious here. Phillipa Soo and Renee Elise Goldsberry shouldn't be overlooked either, Soo is especially good. Okieriete Onaodowan has great chemistry with Diggs and holds his own against him when they're together, especially as Madison.Concluding, truly brilliant in my view. It won't be for all tastes but even if one is put off by the first twenty minutes if not knowing what to expect my advice really is to stick with it. It is not worth certainly not bragging about turning it off about 15 minutes or something, that is the equivalent of barely seeing it. One of the easiest 10/10's given recently."
    },
    {
      "username": "Gordon-11",
      "userUrl": "https://www.imdb.com/user/ur0035842",
      "reviewLink": "https://www.imdb.com/review/rw5880674",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "",
      "helpful": "48 out of 65 found this helpful.",
      "title": "Really enjoyed it",
      "content": "I am not even a fan of musicals, but this is excellent. The songs are great, as they are upbeat and modern. The production, acting, stage set up and the story are all great. I really enjoyed it."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw5914134",
      "warningSpoilers": false,
      "date": "18 July 2020",
      "rate": "9",
      "helpful": "27 out of 35 found this helpful.",
      "title": "Hamilton",
      "content": "One critic recently wrote a list of three great musicals that must be seen on stage. Hamilton was one of them.To my surprise, I have seen all three of those listed. Mind you I have only seen three musicals live on stage in my life so far. What a coincidence!I went to see Hamilton in London's West End because my kids were keen to see it. They may not know much about American history but they knew the songs by the time we got to the theatre.I did tell them if they were so keen on Hamilton, I would had pointed out where he was buried the last time we visited New York. As I did study American history, I was aware of Hamilton and especially the circumstances of his death.I did enjoy the West End show although you have to concentrate hard on the songs. Not only some of the rap parts go fast. The lyrics convey a lot of information like setting up a constitution or how to win a revolutionary war.This Disney presentation was actually filmed four years ago with the original Broadway cast. It is essentially a stage presentation in front of an audience. I understand that the British version had some slight differences with a bigger role for George III.Like the stage play Amadeus. The setting is the rivalry between Founding Fathers Alexander Hamilton and Aaron Burr. It spans pre revolutionary America to well after independence was gained. I noticed the rivalry was more profound watching it onscreen. This time noting that one of the signature song's, My Shot has a more layered meaning.The set for Hamilton looks remarkably simple and plain. Yet is it so cleverly constructed, some of it requires split second timing from the performers. It was astonishing watching this on television just how slick it all was.As for the cast, Lin-Manuel Miranda has become world famous as he not only plays Hamilton. He wrote the book, songs and music. The more showy role is Daveed Diggs as Talleyrand/Thomas Jefferson. It is Leslie Odom Jr who steals it as the 'Salieli' like Burr. The man who never gets to be in the room where it happens, where the big decisions are made.I was mildly amused that the American audience appreciated Jonathan Groff's King George each time he appeared with his barbed lyrics.Hamilton is a world away from the traditional musicals. This one has a modernity as seen by the music and its casting. Maybe that is a reason why it has proved to be popular with a younger audience. My daughter went back to London some months later to watch it again with her friends."
    },
    {
      "username": "henry8-3",
      "userUrl": "https://www.imdb.com/user/ur0351766",
      "reviewLink": "https://www.imdb.com/review/rw5910725",
      "warningSpoilers": false,
      "date": "16 July 2020",
      "rate": "9",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Hamilton",
      "content": "Musical based on the life of Alexander Hamilton, one of the founding fathers.Utterly beguiling, musically wonderful, terrific cast and often very funny - a superbly filmed version of a superb musical. It's hard to believe how much hard work must have gone into this given the staging, lyrics and musical requirements involved.Jonathan Goff as King George III a real high point."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw5887058",
      "warningSpoilers": false,
      "date": "6 July 2020",
      "rate": "10",
      "helpful": "49 out of 68 found this helpful.",
      "title": "what a treat",
      "content": "How incredible to be able to see this show on TV instead of going to New York and spending $800.After watching it, I wished I had seen it live. A production came to my home town and the last row in the balcony was the aforementioned $800.Anyway, this is a fantastic and memorable show, all the more important for maybe getting a few kids interested in a) historical characters; and b) Broadway/musical theater.The music is not my demographic, but there are many different styles, and I loved some of the songs. The lyrics were clever. I think Lin-Manuel Miranda is a genius.What I love is the originality, the expansiveness, the singing, the choreography, but most of all the incredible energy of the cast and story.For people who have no interest in seeing our forefathers dancing and singing, I say, watch it anyway. I wasn't interested either. It is fabulous."
    },
    {
      "username": "Thanos_Alfie",
      "userUrl": "https://www.imdb.com/user/ur33907744",
      "reviewLink": "https://www.imdb.com/review/rw5908677",
      "warningSpoilers": false,
      "date": "15 July 2020",
      "rate": "8",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Watch it...",
      "content": "\"Hamilton\" is a Biography - Drama musical in which we watch the life story of one of the founding fathers and the first Secretary of the Treasury, Alexander Hamilton. We learn more about him, his work and his life.I enjoyed this musical very much because of the songs, the plot which I found very interesting and of course the direction which was made by Thomas Kail. This Broadway musical is simply one of the best musicals I have ever seen and I am sure that everybody has to watch it.The interpretations of the cast were simply outstanding, especially Lin-Manuel Miranda's who played as Alexander Hamilton and he was simply amazing. Some other interpretations that have to be mentioned were Daveed Diggs' who played as Marquis de Lafayette / Thomas Jefferson, Leslie Odom Junior's who played as Aaron Burr, Chris Jackson who played as George Washington, Phillipa Soo's who played as Eliza Hamilton, Renée Elise Goldsberry's who played as Angelica Schuyler and Jonathan Groff's who played as King George.Finally, I have to say that \"Hamilton\" is an outstanding musical which can be considered as a masterpiece. I highly recommend everyone to watch it because I am sure that it will leave you speechless."
    },
    {
      "username": "cricketbat",
      "userUrl": "https://www.imdb.com/user/ur6201371",
      "reviewLink": "https://www.imdb.com/review/rw5904726",
      "warningSpoilers": false,
      "date": "13 July 2020",
      "rate": "9",
      "helpful": "26 out of 34 found this helpful.",
      "title": "Complex, emotional, and lives up to the hype",
      "content": "There was so much hype surrounding Hamilton that I thought there was no way it could live up to expectations-and yet it does. The songs in this musical production are complex and emotional, and the story explains the history of our founding fathers in an engaging way. Yes, it would probably be better to see it on stage and no, it's not perfect, but I'm glad I was finally able to see Hamilton performed instead of just listening to the soundtrack."
    },
    {
      "username": "southdavid",
      "userUrl": "https://www.imdb.com/user/ur0715971",
      "reviewLink": "https://www.imdb.com/review/rw5888457",
      "warningSpoilers": false,
      "date": "7 July 2020",
      "rate": "8",
      "helpful": "30 out of 40 found this helpful.",
      "title": "All Rise.",
      "content": "Like the rest of the world, I watched \"Hamilton\" on Disney Plus this weekend. Though I have seen a number of stage musicals, I haven't seen \"Hamilton\" yet, so this was my first opportunity to see the highly regarded show and I have to say that it didn't disappoint.Alexander Hamilton (Lin-Manuel Miranda) rises up from extremely humble beginnings to play a key role in the American War of Independence. His life sees him befriend, and then rival, Aaron Burr (Lesile Odom Jr) as both a military leader and then a statesman in the burgeoning country. He marries Eliza Schuyler (Phillipa Soo) but his infidelity proves to be the undoing of his reputation and the end of his progress.So I want to consider the show and the production separately, to give a fair appraisal.First the show. I really enjoyed it. I've always harboured concerns that the style of music might be too much of a deviation from established musicals, but really it isn't. I initially didn't think that any of the songs were as instantly memorable as some other musicals, but in fairness I've been humming bits from several of them since. The first half of the show focuses on his military career and the second as he serves under George Washington establishing financial systems and his family life. My only issue with the show was that several actors play two roles on either side of the interval and I wasn't totally clear that they had changed. There's no one actor that I could single out for special praise, because frankly, everyone is fantastic and it's gratifying to see so many of these particular cast taking Broadway and Hollywood roles.The production is great though. Single stage setting, with two turntables in the middle helping to keep things dynamic. There's a wide establishing shot, from a production with an audience present, that the reactions are taken from. This is cut with a series of closer shots from an onstage camera that must come from a series of audience free runs, which provide another level of depth and intimacy that is otherwise impossible. It's honestly the way that all stage performances need to be shot from now on.No recording is ever going to capture what it's like to see a show live, with a reacting audience but this is as close as we're likely to get and it's wonderful that this particular version has been memorialised forever."
    },
    {
      "username": "sebastianbrown-00139",
      "userUrl": "https://www.imdb.com/user/ur104836697",
      "reviewLink": "https://www.imdb.com/review/rw5878254",
      "warningSpoilers": false,
      "date": "3 July 2020",
      "rate": "10",
      "helpful": "414 out of 514 found this helpful.",
      "title": "This is how musicals should be done for screen",
      "content": "Although many musical adaptations have flopped this may have proved that best way to do it is simply film the play. What you get is one of the best musicals available to watch whenever you like at an affordable price. Great work by everyone involved especially Lin Manuel Miranda."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw5882314",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "8",
      "helpful": "64 out of 93 found this helpful.",
      "title": "How much you enjoy this is highly dependent on your age.",
      "content": "Yesterday, a bazillion folks tuned in to Disney+ to see the debut of \"Hamilton\"...a recording of the Broadway show back in 2016. Because it's not a traditional movie-style musical, it's pretty difficult to compare it to a typical film in the genre. It's also a film whose enjoyment definitely depends on your age. I am in my mid-50s....hardly the age to like hip-hop style music in a musical. But, despite this, I did respect what the show was trying to accomplish--to bring America history to the masses AND to make it more accessible to minorities as most of the parts were played by Black and Hispanic actors and actresses. So, while having the likes of George Washington and Aaron Burr played by black actors isn't historically accurate, it does help make history more inclusive....as did the very modern music. And, as an ex-history teacher, I am thrilled about these things even if I wasn't all that fond of the singing. Well worth seeing....and a nice chance to publicize a few nearly forgotten great Americans."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw5879918",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "10",
      "helpful": "66 out of 96 found this helpful.",
      "title": "A Great Representation",
      "content": "Having seen the play and loving it, I was set for a disappointment. No chance. With the one limitation of being confined to a screen, the portraya was extremely well done. With a minimum of close-ups, the filming of the staging worked well. The sound was very good, few words lost. Since this was the original cast, we got to see the thing at its best. I will leave it to others to get into the plot details. I was intrigued from beginning to end."
    },
    {
      "username": "cliftonofun",
      "userUrl": "https://www.imdb.com/user/ur1409915",
      "reviewLink": "https://www.imdb.com/review/rw5879822",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "8",
      "helpful": "78 out of 111 found this helpful.",
      "title": "Not better than the real thing...but close",
      "content": "I was fortunate enough to see Hamilton 3 times in Chicago, including once from the second row thanks to a friend winning the lottery. How did this compare? WAY better than I expected, honestly. I noticed new moments. I saw the original cast in a new light. I experienced the story like I was onstage. There's nothing quite like being in the theater, but this may be the closest a film crew ever got to capturing theater magic. (I wish the RENT movie had been a recording of a 1996 production...) Hamilton represents a unique moment in American theatre, and I'm grateful someone captured it."
    },
    {
      "username": "garethcrook",
      "userUrl": "https://www.imdb.com/user/ur11040152",
      "reviewLink": "https://www.imdb.com/review/rw5919287",
      "warningSpoilers": false,
      "date": "19 July 2020",
      "rate": "10",
      "helpful": "22 out of 28 found this helpful.",
      "title": "Blimey!!",
      "content": "I know a little bit about America's founding fathers. Not a lot, it's not really taught in the UK. That's not important though. Knowing any history to enjoy this I mean, not America's independence. Musicals aren't my thing either and certainly not musical theatre, which this is with several exclamation points. What we have here is the theatre production, filmed, fairly simply. A few camera angles covering the stage, mostly wide to show off a lovely set, occasional close up to, well to provide some variation in the edit, nothing more. This is the thing, it's a show designed to be enjoyed in the room. There's no set camera positions. The camera is normally your eye from your seat. That's not possible right now though, which is why this exists. So it's not a film. It works though and it's undeniably a spectacle. If you don't like singing and dancing, you might think you're buggered. Honestly though, this is pretty top quality singing and dancing, you're in safe hands. It's fast and fun, the energy dialled all the way up. The mix of humour, hip hop and show tunes will make even the most hardened cynic smile. Alright it's gimmicky, actors spitting bars wearing frock-coats, declaring war, but I guess the rules are different in theatre and it's very effective. In film it's often said that if the actors look like they're having too much fun, the audience aren't. I don't think that applies here either, everybody looks to be having the time of their lives and the live audience, that we hear but don't see, seem to be too. It's pretty lengthy, but there's a lot in there, not least a pretty eventful life story. Alexander Hamilton. Rags to revolutionary. A social climbing agitator, with a love of writing and setting up financial institutions. Weddings, duals, adultery, bribery, a bloody big war and a lot of political manoeuvring. The historical content is top line stuff, covering the basics. They're touch points really, never allowing the story to get too dry, but it manages this without dumbing it down too much and the razor sharp humour helps, \"Immigrants we get the job done\". The cast are wonderful. Daveed Diggs as both Lafayette and Jefferson is the standout for me. There are quieter moments, but there's sequences where it's one bombastic banger after another. Canon fire and scratching, the score gets pretty raucous. I went it with a little trepidation, but Lin-Manuel Miranda has indeed created something marvellous. It. Is. Spine-tinglingly brilliant. I might have to stop saying I don't like musicals."
    },
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw5929380",
      "warningSpoilers": false,
      "date": "24 July 2020",
      "rate": "10",
      "helpful": "53 out of 72 found this helpful.",
      "title": "Best movie in 2020",
      "content": "Best movie in 2020 A really difficult year, but this film managed to forget me everything and make me into another world where everything is beautiful, I wish it were longer"
    },
    {
      "username": "tm-sheehan",
      "userUrl": "https://www.imdb.com/user/ur25552762",
      "reviewLink": "https://www.imdb.com/review/rw5881729",
      "warningSpoilers": false,
      "date": "4 July 2020",
      "rate": "10",
      "helpful": "40 out of 56 found this helpful.",
      "title": "A magnificent production the hypes justified",
      "content": "I thought after all I've heard and read about this musical phenomenon that July 4th would be an appropriate evening to judge for myself and I'm so pleased to say all the hype about Hamilton is true it is truly a fabulous stage show.I could have seen Hamilton on our last trip to New York but two things put me off it's very expensive ticket cost and the gamble that I may not like it . Also I thought it would be an all wrap music show which is not my favourite musical genre but pleased to report the wrap lyrics are very clever and there are many other musical styles in this 2 hour 40 biographical musical.Since then I've become a huge fan and admirer of Hamilton creator Lin-Manuel Miranda the new wunderkind of Broadway and Cinema .Miranda has said that Hamilton reminded him of rapper Tupac Shakur, which is how he came up with the idea for a diverse hip hop musical about Hamilton's life. Miranda worked on \"Hamilton\"- a project that people, including his mentor Stephen Sondheim, told him would never work.Lin -Manuel Miranda based Hamilton the musical on an unlikely source: a dense, 818-page biography of Alexander Hamilton by the historian Ron Chernow many of his lyrics to the show are actually based directly on speeches from the book.His first musical \"In the Heights \" had an Australian Premier and I saw it at the Sydney Opera House in 2019 and loved it as it reminded me of West Side Story. It also has a wrap hip hop score butlike Hamilton features other forms of theatre music like reggae traditional ballads and great orchestrations . Lin -Manuel has recently filmed \"In the Heights \" as a full feature movie to be released in 2021 and word on the street is it's a winner.This version of Hamilton is a filmed version of the original multi eleven Tony Award winning musical directed by Thomas Kail the staging looks simple but it's a very complex and effective series of moveable multi tiered timber scaffolds that frame the stage for the large cast allowing plenty of space for the action and choreography to take place.Whenever I see credits mentioning the same person has composed , written and is starring as well as an executive producer in their own show which is very rare I think they're either a genius, or just a complete egomaniac. In the case of Hamilton Lin- Manuel Miranda is a genius in every category and his masterwork Hamilton truly deserved the 11Tony Awards it won in 2016 just one short of the record breaking 12 Tonys for Mel Brooke's musical The Producers.Hamilton was filmed across three days in 2016, a few weeks before the original cast finished their contracts.The musical's original director, Thomas Kail, assembled a crack team of filmmakers, put them in front of the stage and lovingly captured the story the way it was intended to be: as a piece of theatre.Nine cameras recorded two full performances before live audiences. Between shows, the makers refilmed the production to allow for angles that would be impossible for audiences to see within the theatre including close-ups of intimate and dramatic moments and sweeping overhead shots that capture the entire stage.Hamilton the musical is set in the not so United States of America of 1776 to 1800 and there are definite comparisons to the Political situation in that country today.The musical has been receiving rave critical reviews and sold out tickets to all productions in and outside the United States it broke box office records in London and Broadway is set to do the same in Sydney next year.\"Hamilton\" is the story of America then, told by America now. It features a score that blends hip-hop, jazz, R&B and Broadway, \"Hamilton\" has taken the story of American founding father Alexander Hamilton and created a revolutionary moment in theatre-a musical that has had a profound impact on culture, politics, and education.It's no wonder John Bolton titled his recent book on President Donald Trump \"The Room Where it Happened \" the great song from Act 2 of \" Hamilton \" is titled The Room Where it Happens and takes place when Alexander Hamilton Americas first Secretary to the Treasury is ushered to a Secret Meeting where President Thomas Jefferson and his friend and future President James Maddison agree on an unprecedented compromise to move the Capital city of the new nation to their Southern electorate without consulting the American People or Aaron Burr who was the 3rd Vice President of the U. S. A.The opening number \"Alexander Hamilton \"sets the show off beautifully sung by Lin-Manuel Miranda and the cast then leads to another great action song \"My Shot.\" and a good example of the clever lyrics \"I am not throwing away my shot I am not throwing away my shot Hey yo, I'm just like my country I'm young, scrappy and hungry And I'm not throwing away my shot The whole cast in this original Broadway Production are superb of course Lin -Manuel is wonderful as Alexander Hamilton but this is an ensemble piece .The two Schuyler sisters Angelica Renee Louise Goldsberry and Eliza Phillipa Soo who becomes Eliza Hamilton Alexander's wife sing beautifully and look beautiful in their roles and costumes as does the whole cast by costume designer Paul Tazewell .Some of the most sublime and more emotional moments of Hamilton feature these two talented women especially their first song in Act 1 titled The Schuyler Sisters.The other major male roles Leslie Odam Jnr as Aaron Burr and Daveed Diggs as Marquis de Lafayette add to the drama and comedy of Hamilton and it's hard to imagine a better cast. Other great supporting roles that add so much to Hamilton are Chris Jackson as George Washington and a star turn by Jonathan Groff as King George 111 who has a great song and dance number \" You'll Be Back \"referring to America's separation from England.I've often read that the American musical theatre has over the last one hundred years had 3 pivotal evolutions that have forever influenced the genre forever Jerome Kern's 1927 Showboat which for the first time progressed a dramatic story with a musical score that changed the art of musicals from comedy reviews or light weight romantic librettos .Then the next great change came in 1943 with Rodgers and Hammerstein's groundbreaking musical \"Oklahoma \" which was the first musical that raised the curtain on the solo character Curly singing \"Oh What a Beautiful Morning \" and developing from the earlier Show Boat, epitomising the development of the \"book musical\", a musical play where the songs and dances are fully integrated into a well-made story with serious dramatic goals that are able to evoke genuine emotions.Then in 1957 \"West Side Story\" with the music of Leonard Bernstein and the spectacular Broadway debut Of Stephen Sondheim as lyricist bought gang warfare and a revolutionary contemporary song and instrumentally inventive orchestrations that have become classical milestones of many orchestra and Opera Houses the world . We will see a new film version next year directed by Stephen Spielberg.Hamilton I predict will join these 3 famous musicals in history as a revolutionary and innovative game changer that will help keep the Broadway musical alive and thriving.Is it worth $8.99 a month or $89.99 a year a Disney channel subscription? You'll have to judge that but it's the best seat in the house for a fraction of the cost of a ticket for Hamilton the musical. . I've noticed some great High School professional productions of various musicals and other movies and animated features on Disney so it's a yes for me and I'm not on commission .I've added to my Christmas wish list a ticket to the Australian production of this great musical in Sydney next year at the Lyric Theatre.Composers that have the talent to star in their own musicals are less than a dozen and Lin - Manuel has written and starred in two Washington Heights and Hamilton.Disney Plus Channel paid $75 million for the screening rights for Hamilton and the franchise rights which will create huge dividends for Disney now and into the future.Lin -Manuel reportedly made $ 6.4 million off Hamilton in 2017 alone before this Disney deal. He is a modest multi millionaires owning two luxury pre-war apartments in Upper Manhattan, but otherwise lives a relatively modest lifestyle and still rides the subway. The latest estimate of his net wealth after the Disney deal is $80 million .Broadway made Lin-Manuel Miranda a star, but philanthropy-from disaster relief in Puerto Rico to arts education at home in New York-is truly the family business.This filmed production of a stage musical is definitely the best I've ever seen and I really can't wait to see what our Australian production is like next year."
    },
    {
      "username": "sini-200",
      "userUrl": "https://www.imdb.com/user/ur27129193",
      "reviewLink": "https://www.imdb.com/review/rw5883954",
      "warningSpoilers": false,
      "date": "5 July 2020",
      "rate": "9",
      "helpful": "36 out of 49 found this helpful.",
      "title": "A musical masterpiece",
      "content": "One of the greatest historical musicals ever made, the story, the outfits, the set, the score, the casting - everything absolutely perfect! Songs are incredible. Lin Manuel Miranda is remarkable in this, a living legend. You won't forget a musical like this."
    },
    {
      "username": "questl-18592",
      "userUrl": "https://www.imdb.com/user/ur102601261",
      "reviewLink": "https://www.imdb.com/review/rw5889812",
      "warningSpoilers": false,
      "date": "8 July 2020",
      "rate": "9",
      "helpful": "37 out of 52 found this helpful.",
      "title": "Alexander Hamil-WIN!",
      "content": "This was an exciting thing for me. I, like most people, had heard of Hamilton. It was/is a HUGE phenomenon on Broadway and launched the careers of some incredible people. Miranda is always the fun, quirky, goofy musical wizard that pops up in shows now and then. Leslie Odom Jr. has always had this impishly wicked energy to him. Oh, and lets not forget Daveed Diggs, the up and comer who, after Blindspotting and a couple other things, I would watch in just about anything. Unfortunately, I live light years away from any decent stage so the odds of me seeing this in real life seemed like something that may just never happen. Enter the magical world of Disney and I am given the opportunity to finally experience the phenomenon myself, albeit not in the original form. Of course, with all the build up and all the hype, I was worried it couldn't possibly measure up.Now, to be perfectly honest, I knew next to nothing about this before watching it. I knew that Miranda created it, I knew Diggs was in it and I had some vague notion that it was about Alexander Hamilton, the founding father, and that it was a musical. I know that might seem like a lot and yet when this kicked off I felt completely blindsided by what I got. The music was catchy in a way I hadn't anticipated, to the point that I'm listening to the soundtrack right now as I write this out. The performances were full of life and energy and charisma, every character so wonderfully brought to life with Miranda and the performer's visions. Though, I have to say that Jonathan Groff as King George was an absolute scene stealer every second he was on stage.There are two magic tricks I think Hamilton not only pulls off, but pulls off effortlessly. First, the cast is remarkably diverse. This is never made into a \"thing\" or used as some tool to drive home some clumsy point in the way a lot of movies do, instead they're just people, people who do an exceptional job and I love that. I never once felt like a single person was miscast or not befitting their role and honestly, the fact that they never draw overt attention to it allows each actor to simply play their part exceptionally. Secondly, this draws attention to an imperfect man of great significance in American history that... Yeah, I'm sure I learned about him in school but honestly didn't know all that much about him. The fact that they essentially make something that's one part highly entertaining musical and another part educational and historical piece is wonderful.Negatives? I only really have one and it's sort've minor. There are a LOT of characters portrayed here and a lot of the actors play more than one role and it can be difficult at times to keep things straight. This is a fleeting issue, a few minutes after an actor steps into a new character and it's clear who they are, but there's that initial moment of 'Huh?' that can be briefly distracting. I get the feeling this is just a part of stage shows and I'm just the uncivilized dullard that doesn't know better but it is what it is.Now, as of me writing this, Hamilton is under fire and on the ever-growing cancel list. I don't agree with that. No, it doesn't focus on all of his faults, but Hamilton definitely doesn't portray Alexander as a saint by any means, not in my eyes. I think this absolutely worth watching and forming your own opinion on. Do the actions of the real man that died in 1804 mean that a 2020 musical can't be enjoyed? Can we judge the past with modern sensibilities? These are the deep, philosophical issues that this can bring out and I think these are discussions worth having. Personally, I separate the art from the inspiration and found this to be wildly entertaining. If you don't believe you are able or willing to do that, then your experience may vary wildly and that is perfectly alright by me."
    },
    {
      "username": "jcullen_s",
      "userUrl": "https://www.imdb.com/user/ur102133794",
      "reviewLink": "https://www.imdb.com/review/rw5904997",
      "warningSpoilers": false,
      "date": "14 July 2020",
      "rate": "10",
      "helpful": "24 out of 30 found this helpful.",
      "title": "Hamilton",
      "content": "This is less a review and more so go and watch it right now I've listened to the soundtrack a lot of times and I still got the same reaction to it everytime and the show corsions is incredible the dance choreography is incredible like you look at satisfied and it's in reverse and it's just mind blowing don't even start talking about the music just watch it now"
    },
    {
      "username": "jordyntsmith",
      "userUrl": "https://www.imdb.com/user/ur110095803",
      "reviewLink": "https://www.imdb.com/review/rw5888980",
      "warningSpoilers": false,
      "date": "7 July 2020",
      "rate": "8",
      "helpful": "28 out of 37 found this helpful.",
      "title": "Love It! Don't Spoil It!",
      "content": "I really do enjoy the Hamilton soundtrack and was so excited to actually view the performance! However, in a sense, I do think I listened to the soundtrack too much to the point where I 'know' what happens too well. For watching the musical, I recommend not over-saturating oneself with other Hamilton media.All in all, it is an excellent musical with brilliant writing, excellent performances, and a memorable, multi-layered, story."
    },
    {
      "username": "ZuhayrRoha",
      "userUrl": "https://www.imdb.com/user/ur80531773",
      "reviewLink": "https://www.imdb.com/review/rw5904581",
      "warningSpoilers": false,
      "date": "13 July 2020",
      "rate": "10",
      "helpful": "24 out of 30 found this helpful.",
      "title": "A piece of ART. A true masterpiece.",
      "content": "Man I hated rap music but I fell in love with this Plays Soundtrack,'My Name Is Alexander Hamilton' & 'King George' were my favourites but countless others were pretty close.This is a great example of how to beautifully adapt something for current culture. Their debate being a rap-diss-track battle was so smart. I can't go into length of the greatness of the poetry-rhyming of the lyrics.Many people will learn more about history with this than their school. It has entertainment, drama, flawed characters and numerous artistic merit with themes layered all over it.Making White characters diversify to be self aware about slavery & women rights was a great decision."
    },
    {
      "username": "DKosty123",
      "userUrl": "https://www.imdb.com/user/ur4067661",
      "reviewLink": "https://www.imdb.com/review/rw5880194",
      "warningSpoilers": true,
      "date": "4 July 2020",
      "rate": "9",
      "helpful": "30 out of 42 found this helpful.",
      "title": "Classic Diverse Cast Musical Hip Hopping on Stage",
      "content": "This 2016 movie of the stage show is excellent for a lot of reasons. The cast has a lot to do with that. Every cast member makes their role real and memorable. They do it smoothly. They earn the massive applause they receive for each number. It's easy to see why.This filming of a Broadway Stage show has been done in movie history, but only a few times as effectively. If you go back to silent films, ironically since Disney is producing this, the 1925 silent of Peter Pan (before Disney animated it) was really a film of the broad way stage show of Peter Pan. If you have never seen it, and can tolerate a silent film, you'd be surprised how effective that silent is filming the stage show.The cast pulls out all the stops here and the orchestra is heard but not seen doing excellent score music from the pit. Manuel's story from the real history is well done, and the songs and dancing fits perfectly. As for the politics, yes this show has \"Quid Pro Quo\" in it in 2016, way before it became a famous quote on the news before the Corona Virus. There's another issue mentioned here when on character states that America can't be expected to help every country in conflict in the world. We are really proving that now, so in 2016 while this was addressing Obama's foreign policy, regime change, now it is current because our US media is actively trying to change regimes in the world. The internet has made US media drunk with power, and it's not always for the good.I will say one thing is incomplete here. They mention some of the amazing stuff Hamilton's wife did after he died, but her story needs to be done someplace. She lived 50 years after her husband and did things many women should be proud of.Now as far as Slavery not getting a lot of attention, no story of history can be perfect. In fact, the longest serving slaves in US History are Women. Women could not vote until the 20th Century and it was the 1960's before they were no longer expected to stay home, not work, and be at the mercy of their husbands. Women are smarter though because instead of asking for pity and reparations, they have worked inside the system to improve it and we might be on the verge of a Black Woman Vice-President. (Possibly President as well) It's way over due.History has already been written and no amount of revision or destruction can change history. The fact is we need to look back at history and realize that \"The Future Matters.\" If we fail to do this, we owe women more than we owe anyone else because of the past. I hope someone does a sequel to this and tells the whole story of Mrs. Hamilton. We owe her that."
    },
    {
      "username": "Thekeybaldemasterrises",
      "userUrl": "https://www.imdb.com/user/ur29737283",
      "reviewLink": "https://www.imdb.com/review/rw5877803",
      "warningSpoilers": false,
      "date": "3 July 2020",
      "rate": "10",
      "helpful": "41 out of 55 found this helpful.",
      "title": "\"The Story of America Then, Told by America Now\"",
      "content": "The time has come. The lights go down. King George III welcomes us to the show. Hamilton has finally arrived in a beautiful HD presentation! You've heard of it, you've listened to it more times than you can count, you've bopped to it and belted the words on your friend's aux to their absolute shock/confusion. Now we can FINALLY enjoy it on loop over and over again on a non bootleg copy, that's right NO MORE SLIME TUTORIALS! Considering it's called a \"Hamilton film I would say it's right in my ballpark don't you?? First of all, the show is amazing. It's among the best the stage has to offer in the modern age. The music, the performances, the writing, the production, it's all BEAUTIFUL, if you haven't seen it yet WATCH IT NOW, but what truly makes it SO good? In the words of Lin Manuel Miranda, \"It's a story about America then, as told by America now.\" The Founding Fathers are played by actors of color, among other characters featured in the story. The show is having us leave whatever cultural baggage we have about these historical figures at the door, and embracing this story through the eyes of America NOW. Yes it does leave some factors out, yes it's not all historically accurate, but people need to realize the point isn't to tell an IN DEPTH biographical story of Hamilton, but rather show us how his life and the events that he took part in helped form the foundations and ideals of what this country was built upon. This show is very Patriotic but it reminds me of what America is SUPPOSE TO BE. WHAT IT COULD BE. Much like the young people of my generation going out and marching for the racial injustices in this country, Hamilton was a 20 year old immigrant that fought for the freedom of this land and helped shaped the principles in which we aspire to uphold. This show isn't going to acknowledge our systemic racism roots with people like Washington and Jefferson who factually owned slaves, but it challenges us to contemplate our OWN feelings about this country and where we came from. How far have we come? What has changed and what could WE do better? Could our founding fathers have done more to abolish slavery? Absolutely, but think about what they did try to create and lay the foundations for. Who knows what they could've done if they had more time? It's not meant to idolize these people, it's a piece about the birth of America, and what people like Hamilton did to help a struggling new country find its own identity. When I watch/listen to this show, I believe in that. I believe that America WAS already great, we just lost sight of it and let the wrong people get in charge. If you want to know why, watch Hamilton. The story of an immigrant that fought in a war, and made a name for himself in a ludicrous political game, is a story that will be remembered for generations. Miranda and his team found an incredible medium to tell these people's stories, and that's what it's all about, who tells our story? How will we be remembered? Hamilton's now available on Disney+, I highly suggest you watch it for your 4th of July this weekend and many days after... But as a final reminder don't forget, this is at its heart, live theatre. Hopefully when Covid ends we can actually experience it all together the way we're suppose to, in front of the stage, LIVE. But for now, this will of course do! 10/10."
    }
  ],
  "errorMessage": ""
}