{
  "imDbId": "tt0361748",
  "title": "Inglourious Basterds",
  "fullTitle": "Inglourious Basterds (2009)",
  "type": "Movie",
  "year": "2009",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "https://www.reelviews.net/reelviews/inglourious-basterds",
      "rate": "100",
      "content": "With Inglourious Basterds, Quentin Tarantino has made his best movie since \"Pulp Fiction.\" He has also made what could arguably be considered the most audacious World War II movie of all-time."
    },
    {
      "publisher": "Village Voice",
      "author": "J. Hoberman",
      "link": "",
      "rate": "90",
      "content": "Energetic, inventive, swaggering fun, Quentin Tarantino's Inglourious Basterds is a consummate Hollywood entertainment--rich in fantasy and blithely amoral."
    },
    {
      "publisher": "St. Louis Post-Dispatch",
      "author": "Joe Williams",
      "link": "",
      "rate": "88",
      "content": "With its exploded notions of heroism, torture-rack dramatics and kamikaze gusto, it's a fiendishly entertaining flick."
    },
    {
      "publisher": "Variety",
      "author": "Todd McCarthy",
      "link": "",
      "rate": "80",
      "content": "A violent fairy tale, an increasingly entertaining fantasia in which the history of World War II is wildly reimagined so that the cinema can play the decisive role in destroying the Third Reich."
    },
    {
      "publisher": "Empire",
      "author": "Chris Hewitt (1)",
      "link": "",
      "rate": "80",
      "content": "With a confidence typical of its director, the last line of Inglourious Basterds is, \"This might just be my masterpiece.\" While that may not be true, this is an often dazzling movie that sees QT back on exhilarating form."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "David Edelstein",
      "link": "https://nymag.com/movies/reviews/58313/",
      "rate": "80",
      "content": "Even more than his other genre mash-ups, this is a switchback journey through Tarantino’s twisted inner landscape, where cinema and history, misogyny and feminism, sadism and romanticism collide and split and re-bond in bizarre new hybrids. The movie is an ungainly pastiche, yet on some wacked-out Jungian level it’s all of a piece."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "https://ew.com/article/2009/08/21/inglourious-basterds/",
      "rate": "75",
      "content": "In Tarantino's besotted historical reverie, real-life villains Adolf Hitler and Joseph Goebbels are played as grotesque jokes. The Basterds are played as exaggeratedly tough Jews. The women are femmes fatales.?"
    },
    {
      "publisher": "Film Threat",
      "author": "",
      "link": "",
      "rate": "70",
      "content": "The biggest, weirdest, ugliest cartoon in Inglourious Basterds is Aldo Raine, the Nazi-killing American Lieutenant played by Brad Pitt."
    },
    {
      "publisher": "The Hollywood Reporter",
      "author": "Kirk Honeycutt",
      "link": "",
      "rate": "60",
      "content": "The film is by no means terrible -- its two hours and 32 minutes running time races by -- but those things we think of as being Tarantino-esque, the long stretches of wickedly funny dialogue, the humor in the violence and outsized characters strutting across the screen, are largely missing."
    },
    {
      "publisher": "The New Yorker",
      "author": "David Denby",
      "link": "https://www.newyorker.com/magazine/2009/08/24/americans-in-paris",
      "rate": "50",
      "content": "Inglourious Basterds is not boring, but it’s ridiculous and appallingly insensitive."
    }
  ],
  "errorMessage": ""
}