{
  "imDbId": "tt0361748",
  "title": "Inglourious Basterds",
  "fullTitle": "Inglourious Basterds (2009)",
  "type": "Movie",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Inglourious Basterds",
  "url": "https://en.wikipedia.org/wiki/Inglourious_Basterds",
  "plotShort": {
    "plainText": "Inglourious Basterds is a 2009 war film written and directed by Quentin Tarantino, starring Brad Pitt, Christoph Waltz, Michael Fassbender, Eli Roth, Diane Kruger, Daniel Brühl, Til Schweiger and Mélanie Laurent. The film tells an alternate history story of two plots to assassinate Nazi Germany's leadership—one planned by Shosanna Dreyfus, a young French Jewish cinema proprietor, and the other by the British; but is ultimately conducted solely by a team of Jewish American soldiers led by First Lieutenant Aldo Raine. Christoph Waltz co-stars as Hans Landa, an SS colonel in charge of tracking down Raine's group. The title was inspired by Italian director Enzo G. Castellari's 1978 Euro War film The Inglorious Bastards, though Tarantino's film is not a remake of it.\r\nTarantino wrote the script in 1998, but struggled with the ending and chose instead to direct the two-part film Kill Bill. After directing Death Proof in 2007, Tarantino returned to work on Inglourious Basterds. A co-production of the United States and Germany, the film began principal photography in October 2008 and was filmed in Germany and France with a $70 million production budget. It premiered on May 20, 2009, at the 62nd Cannes Film Festival, and received a wide release in theaters in the United States and Europe in August 2009 by The Weinstein Company and Universal Pictures.\r\nInglourious Basterds grossed over $321.5 million in theaters worldwide, making it Tarantino's highest-grossing film to that point, until it was surpassed in box office by Django Unchained (2012) and Once Upon a Time in Hollywood (2019). The film received generally positive reviews, with Waltz's performance as Hans Landa being singled out for praise, but some criticized the historical liberties taken. It also won multiple awards and nominations, among them eight Academy Award nominations (including Best Picture, Best Director and Best Original Screenplay). For his role as Landa, Waltz won the Cannes Film Festival's Best Actor Award, as well as the BAFTA, Screen Actors Guild, Critics' Choice, Golden Globe, and Academy Award for Best Supporting Actor.",
    "html": "<p>Inglourious Basterds is a 2009 war film written and directed by Quentin Tarantino, starring Brad Pitt, Christoph Waltz, Michael Fassbender, Eli Roth, Diane Kruger, Daniel Brühl, Til Schweiger and Mélanie Laurent. The film tells an alternate history story of two plots to assassinate Nazi Germany's leadership—one planned by Shosanna Dreyfus, a young French Jewish cinema proprietor, and the other by the British; but is ultimately conducted solely by a team of Jewish American soldiers led by First Lieutenant Aldo Raine. Christoph Waltz co-stars as Hans Landa, an SS colonel in charge of tracking down Raine's group. The title was inspired by Italian director Enzo G. Castellari's 1978 Euro War film The Inglorious Bastards, though Tarantino's film is not a remake of it.</p><p>Tarantino wrote the script in 1998, but struggled with the ending and chose instead to direct the two-part film Kill Bill. After directing Death Proof in 2007, Tarantino returned to work on Inglourious Basterds. A co-production of the United States and Germany, the film began principal photography in October 2008 and was filmed in Germany and France with a $70 million production budget. It premiered on May 20, 2009, at the 62nd Cannes Film Festival, and received a wide release in theaters in the United States and Europe in August 2009 by The Weinstein Company and Universal Pictures.</p><p>Inglourious Basterds grossed over $321.5 million in theaters worldwide, making it Tarantino's highest-grossing film to that point, until it was surpassed in box office by Django Unchained (2012) and Once Upon a Time in Hollywood (2019). The film received generally positive reviews, with Waltz's performance as Hans Landa being singled out for praise, but some criticized the historical liberties taken. It also won multiple awards and nominations, among them eight Academy Award nominations (including Best Picture, Best Director and Best Original Screenplay). For his role as Landa, Waltz won the Cannes Film Festival's Best Actor Award, as well as the BAFTA, Screen Actors Guild, Critics' Choice, Golden Globe, and Academy Award for Best Supporting Actor.</p>"
  },
  "plotFull": {
    "plainText": "Inglourious Basterds is a 2009 war film written and directed by Quentin Tarantino, starring Brad Pitt, Christoph Waltz, Michael Fassbender, Eli Roth, Diane Kruger, Daniel Brühl, Til Schweiger and Mélanie Laurent. The film tells an alternate history story of two plots to assassinate Nazi Germany's leadership—one planned by Shosanna Dreyfus, a young French Jewish cinema proprietor, and the other by the British; but is ultimately conducted solely by a team of Jewish American soldiers led by First Lieutenant Aldo Raine. Christoph Waltz co-stars as Hans Landa, an SS colonel in charge of tracking down Raine's group. The title was inspired by Italian director Enzo G. Castellari's 1978 Euro War film The Inglorious Bastards, though Tarantino's film is not a remake of it.\r\nTarantino wrote the script in 1998, but struggled with the ending and chose instead to direct the two-part film Kill Bill. After directing Death Proof in 2007, Tarantino returned to work on Inglourious Basterds. A co-production of the United States and Germany, the film began principal photography in October 2008 and was filmed in Germany and France with a $70 million production budget. It premiered on May 20, 2009, at the 62nd Cannes Film Festival, and received a wide release in theaters in the United States and Europe in August 2009 by The Weinstein Company and Universal Pictures.\r\nInglourious Basterds grossed over $321.5 million in theaters worldwide, making it Tarantino's highest-grossing film to that point, until it was surpassed in box office by Django Unchained (2012) and Once Upon a Time in Hollywood (2019). The film received generally positive reviews, with Waltz's performance as Hans Landa being singled out for praise, but some criticized the historical liberties taken. It also won multiple awards and nominations, among them eight Academy Award nominations (including Best Picture, Best Director and Best Original Screenplay). For his role as Landa, Waltz won the Cannes Film Festival's Best Actor Award, as well as the BAFTA, Screen Actors Guild, Critics' Choice, Golden Globe, and Academy Award for Best Supporting Actor.\r\nPlot\r\nIn 1941, SS-Standartenführer Hans Landa interrogates French farmer Perrier LaPadite, suspecting the LaPadites are hiding a Jewish family, the Dreyfuses, under their floorboards. LaPadite tearfully confirms this to spare his own family, and Landa has the hidden family shot, but allows Shosanna Dreyfus to escape.\r\nThree years later, U.S. Army Lieutenant Aldo Raine recruits Jewish-American soldiers to the \"Basterds\", a commando unit instilling fear among Nazis in occupied France by killing and scalping them. The group includes Sergeant Donny \"The Bear Jew\" Donowitz, rogue German Sergeant Hugo Stiglitz, and translator Corporal Wilhelm Wicki. In Germany, Adolf Hitler interviews a German soldier, who reveals that Raine carved a swastika into his forehead after massacring his squadron.\r\nIn Paris, Shosanna operates a cinema under the name Emmanuelle Mimieux, and meets Fredrick Zoller, a famed German sniper set to star in the Nazi propaganda film Stolz der Nation (Nation's Pride). Infatuated with Shosanna, Zoller convinces Joseph Goebbels to hold the film's premiere at her cinema. Landa, the premiere's head of security, interrogates Shosanna, who plots with her Afro-French lover and projectionist, Marcel, to kill the Nazi leaders in attendance.\r\nBritish Commando Lieutenant Archie Hicox is recruited to lead an attack on the premiere with the Basterds. Disguised as German officers, Hicox, Stiglitz, and Wicki meet with German film star Bridget von Hammersmark, an undercover Allied agent, at a tavern in Nazi-occupied northern France. Hicox inadvertently draws the attention of Wehrmacht Sergeant Wilhelm and Major Dieter Hellström, first with his unusually accented German and then by using a British hand gesture. Their covers blown, a gunfight ensues, killing everyone except Wilhelm and a wounded von Hammersmark. Raine arrives and negotiates for von Hammersmark's release, but she shoots Wilhelm. Raine tortures von Hammersmark, believing she set his men up, but she convinces him she is loyal and reveals Hitler will be attending the premiere. Raine decides to carry out their plan with himself, Donowitz, and Omar Ulmer. Investigating the tavern, Landa finds von Hammersmark's shoe and a napkin with her signature.\r\nRaine, Donowitz, and Ulmer infiltrate the premiere with timed explosives, while Landa confronts von Hammersmark with her missing shoe before strangling her to death. Raine and another Basterd, Smithson Utivich, are discovered and taken prisoner, but Landa has Raine contact his superior to cut a deal: Landa will allow the mission to proceed in exchange for safe passage through the Allied lines, a full pardon, and other privileges.\r\nDuring the screening, Zoller slips away to the projection room and attempts to force himself on Shosanna, leading them to shoot each other dead. As the film reaches its climax, Shosanna's spliced-in footage tells the audience that they are about to be killed by a Jew. Having locked the auditorium, Marcel ignites a pile of flammable film behind the screen, setting the theater ablaze. Ulmer and Donowitz break into the opera box, gunning down Hitler and Goebbels and firing into the crowd until their explosives kill everyone inside the cinema.\r\nLanda and his radio operator drive Raine and Utivich into Allied territory, where they surrender themselves. However, Raine shoots the radio operator before ordering Utivich to scalp him, and carves a swastika into Landa's forehead, professing it to be his \"masterpiece\".\r\nCast\r\nBrad Pitt as Lieutenant Aldo Raine, nicknamed \"Aldo the apache\" due to his trademark of scalping Nazis he defeats, is the battle-hardened commanding officer of the Basterds. Raine is a coal miner and bootlegger from the Great Smoky Mountains of Tennessee,: 499 where he fought against the Ku Klux Klan. He survived a lynching and is a descendant of Jim Bridger and the Bridger family. He was a member of the Devil's Brigade where he was trained in guerrilla warfare.\r\nMélanie Laurent as Shosanna Dreyfus, an 18 year old: 90, 186 French Jewish cinema owner whose family was executed by Landa when she was 15 years old. Shosanna manages to escape due to luck and Landa's decision to not pursue her.: 90–91 Most of The Bride's attributes from Tarantino's Kill Bill come from Tarantino's original development of Shosanna for Inglourious Basterds which he started to work on before Kill Bill. Originally Shosanna was an assassin who had a list of Nazis she would cross off as she killed, whom Tarantino described as a Jewish Joan of Arc. Tarantino later switched the character attributes over to The Bride and later redeveloped Shosanna into the version who appears in the film.: 22:00–24:00\r\nChristoph Waltz as Standartenführer Hans Landa, an eloquent and cultured but deeply ruthless SS officer.\r\nEli Roth as Sergeant Donny Donowitz, also known as \"The Bear Jew\", a brooding member of the Basterds who executes Nazis with his baseball bat. In Tarantino's screenplay Donowitz is likened to Joshua: 167 and his bat to the sword of Gideon.: 170 Roth channeled actor Tony Curtis for his portrayal per Tarantino's direction. Donny is the father of Tarantino-created film producer Lee Donowitz (Saul Rubinek) who appeared in True Romance.\r\nMichael Fassbender as Lieutenant Archie Hicox, a British commando and former film critic who assists the Basterds on their mission in France. Hicox was patterned after actor George Sanders.\r\nDiane Kruger as Bridget Von Hammersmark, a German film star turned spy for Great Britain. Tarantino based Hammersmark on Hungarian actress Ilona Massey. For her portrayal of the character Kruger was inspired by German actress Hildegard Knef.\r\nDaniel Brühl as Fredrick Zoller, a German army sniper whose story is made into a propaganda film. He was inspired by Matthäus Hetzenauer. Tarantino also created Zoller as a Nazi Audie Murphy.: 11:00–13:00\r\nTil Schweiger as Sergeant Hugo Stiglitz, a former German army soldier who murdered numerous Gestapo officers and is recruited by the Basterds.\r\nB. J. Novak as Smithson Utivich, short and slightly built member of the Basterds unit.\r\nGedeon Burkhard as Corporal Wilhelm Wicki, the Austrian-born, deadpan-humored translator of the Basterds unit.\r\nJacky Ido as Marcel, a projector operator at the cinema\r\nOmar Doom as Omar Ulmer, a member of the Basterds unit\r\nSamm Levine as Hirschberg, a member of the Basterds unit\r\nAugust Diehl as Sturmbannführer Dieter Hellstrom\r\nDenis Ménochet as Perrier LaPadite\r\nSylvester Groth as Joseph Goebbels\r\nMartin Wuttke as Adolf Hitler\r\nMike Myers as General Ed Fenech\r\nJulie Dreyfus as Francesca Mondino\r\nRichard Sammel as Sergeant Rachtman\r\nAlexander Fehling as Master Sergeant Wilhelm\r\nRod Taylor as Winston Churchill\r\nSönke Möhring as Private Butz\r\nPaul Rust as Andy Kagan, a member of the Basterds unit\r\nMichael Bacall as Michael Zimmerman, a member of the Basterds unit\r\nCarlos Fidel as Simon Sakowitz, a member of the Basterds unit\r\nKen Duken as \"Mata Hari\" soldier\r\nChristian Berkel as Proprietor Eric\r\nAnne-Sophie Franck as Mathilda\r\nLéa Seydoux as Charlotte LaPadite\r\nTina Rodriguez as Julie LaPadite\r\nLena Friedrich as Suzanne LaPadite\r\nJana Pallaske as Babette\r\nRainer Bock as General Schonherr, a member of the Oberkommando des Heeres\r\nMichael Scheel as General Frank, a member of the Oberkommando des Heeres\r\nBuddy Joe Hooker as Gaspar\r\nChristian Brückner as Kliest\r\nHilmar Eichhorn as Emil Jannings\r\nPatrick Elias as Jakob Dreyfus\r\nEva Löbau as Miriam Dreyfus\r\nSalvadore Brandt as Bob Dreyfus\r\nJasper Linnewedel as Amos Dreyfus\r\nVolker Zack Michalowski as \"Edgar Wallace\" soldier\r\nDirector Enzo G. Castellari also makes a cameo appearance in the film at the movie premiere. He previously cameoed as a German in his own The Inglorious Bastards and reprised the same role in this film, but under a different rank and SS organization. Bo Svenson, who starred in Castellari's The Inglorious Bastards, also has a small cameo in the film as a US colonel in the Nation's Pride movie.\r\nAdditionally Samuel L. Jackson narrates the film, Harvey Keitel voices the Office of Strategic Services Commander, Bela B appears as an usher and Tarantino appears as an American soldier in Nation's Pride and a scalped Nazi. Two characters, Mrs. Himmelstein and Madame Ada Mimieux, played by Cloris Leachman and Maggie Cheung, respectively, were both cut from the final film due to length.\r\nProduction\r\nDevelopment\r\nTarantino spent just over a decade creating the film's script because, as he told Charlie Rose in an interview, he became \"too precious about the page\", meaning the story kept growing and expanding. Tarantino viewed the script as his masterpiece in the making, so felt it had to become the best thing he had ever written. He described an early premise of the film as his \"bunch-of-guys-on-a-mission\" film, \"my Dirty Dozen or Where Eagles Dare or Guns of Navarone kind of thing\".\r\nI'm going to find a place that actually resembles, in one way or another, the Spanish locales they had in spaghetti westerns – a no man's land. With US soldiers and French peasants and the French resistance and German occupation troops, it was kind of a no man's land. That will really be my spaghetti Western but with World War II iconography. But the thing is, I won't be period specific about the movie. I'm not just gonna play a lot of Édith Piaf and Andrews Sisters. I can have rap, and I can do whatever I want. It's about filling in the viscera.\r\n—Quentin Tarantino\r\nBy 2002, Tarantino found Inglourious Basterds to be a bigger film than planned and saw that other directors were working on World War II films. Tarantino had produced three nearly finished scripts, proclaiming that it was \"some of the best writing I've ever done. But I couldn't come up with an ending.\" He moved on to direct the two-part film Kill Bill (2003–2004). After the completion of Kill Bill, Tarantino went back to his first storyline draft and considered making it a mini-series. Instead he trimmed the script, using his script for Pulp Fiction as a guide to length. The revised premise focused on a group of soldiers who escape from their executions and embark on a mission to help the Allies. He described the men as \"not your normal hero types that are thrown into a big deal in the Second World War\".\r\nTarantino planned to begin production in 2005. In November 2004, he delayed production and instead took an acting role in Takashi Miike's Western film Sukiyaki Western Django, and intended to make a kung fu film entirely in Mandarin; this project foundered. He directed Death Proof (2007), part of the double feature Grindhouse, before returning to work on Inglourious Basterds.\r\nThe film's title was inspired by the English-language title of director Enzo G. Castellari's 1978 war film, The Inglorious Bastards. When pushed, Tarantino would not explain the first u in Inglourious, but said, \"The Basterds? That's just the way you say it: Basterds.\" He later stated that the misspelled title is \"a Basquiat-esque touch\". He further commented on Late Show with David Letterman that Inglourious Basterds is a \"Quentin Tarantino spelling\". Tarantino has said that the film's opening scene, in which Landa interrogates the French dairy farmer, is his \"favorite thing\" he's \"ever written\".\r\nCasting\r\nTarantino originally sought Leonardo DiCaprio to be cast as Hans Landa, before deciding to have the character played by a native German-speaking actor. The role ultimately went to Austrian Christoph Waltz who, according to Tarantino, \"gave me my movie\" as he feared the part was \"unplayable\". Pitt and Tarantino had wanted to work together for a number of years, but they were waiting for the right project. When Tarantino was halfway through the film's script, he sensed that Pitt was a strong possibility for the role of Aldo Raine. By the time he had finished writing, Tarantino thought Pitt \"would be terrific\" and called Pitt's agent to ask if he was available.\r\nTarantino asked Adam Sandler to play the role of Donny Donowitz, but Sandler declined due to schedule conflicts with the film Funny People. Eli Roth was cast in the role instead. Roth also directed the film-within-the-film, Nation's Pride, which used 300 extras. The director also wanted to cast Simon Pegg in the film as Lt. Archie Hicox, but he was forced to drop out due to scheduling difficulties with Spielberg's Tintin adaptation. Irish-German actor Michael Fassbender began final negotiations to join the cast as Hicox in August 2008, although he originally auditioned for the role of Landa. B. J. Novak was also cast in August 2008 as Private First Class Smithson Utivich, \"a New York-born soldier of 'slight build'\".\r\nTarantino talked to actress Nastassja Kinski about playing the role of Bridget von Hammersmark and even flew to Germany to meet her, but a deal could not be reached and Tarantino cast Diane Kruger instead. Rod Taylor was effectively retired from acting and no longer had an agent, but came out of retirement when Tarantino offered him the role of Winston Churchill in the film. This would be Taylor's last appearance on film before his death on January 7, 2015. In preparation for the role, Taylor watched dozens of DVDs with footage of Churchill in order to get the Prime Minister's posture, body language, and voice, including a lisp, correct. Taylor initially recommended British actor Albert Finney for the role during their conversation, but agreed to take the part because of Tarantino's \"passion.\" Mike Myers, a fan of Tarantino, had inquired about being in the film since Myers' parents had been in the British Armed Forces. In terms of the character's dialect, Myers felt that it was a version of Received Pronunciation meeting the officer class, but mostly an attitude of \"I'm fed up with this war and if this dude can end it, great because my country is in ruins.\"\r\nTarantino met Mélanie Laurent in three rounds, reading all the characters on the first round. On the second meeting, he shared the lines with her; the third was a face-to-face dinner. During the dinner, he told Laurent, \"Do you know something—there's just something I don't like. It's that you're famous in your country, and I'm really wanting to discover somebody.\" Laurent replied \"No, no, no. ... I'm not so famous.\" After four days, he called to finalize her for the role of Shosanna. Samm Levine was cast as PFC Hirschberg, because, according to Levine, Tarantino was a big fan of Freaks and Geeks, which starred Levine. Filmmaker Tom Tykwer, who translated parts of the film's dialogue into German, recommended Daniel Brühl to Tarantino, who recalled that upon seeing the actor's performance in Good Bye, Lenin!, he declared, \"That's my right there. If Daniel's mother had never met Daniel's father, I don't know if we'd ever have the right Zoller\".\r\nIsabelle Huppert was originally cast in the role of Madame Mimieux before being fired due to creative differences. It was also reported that Catherine Deneuve was considered for the role. According to French musician and actor Johnny Hallyday, Tarantino had originally written a role for him in the film.\r\nFilming\r\nTarantino teamed with The Weinstein Company to prepare what he planned to be his film for production. In July 2008, Tarantino and executive producers Harvey and Bob Weinstein set up an accelerated production schedule to be completed for release at the Cannes Film Festival in 2009, where the film would compete for the Palme d'Or.\r\nThe Weinstein Company co-financed the film and distributed it in the United States, and signed a deal with Universal Pictures to finance the rest of the film and distribute it internationally. Germany and France were scheduled as filming locations and principal photography started in October 2008 on location in Germany.\r\nFilming was scheduled to begin on October 13, 2008, and shooting started that week. Special effects were handled by KNB EFX Group with Greg Nicotero and much of the film was shot and edited in the Babelsberg Studio in Potsdam, Germany, and in Bad Schandau, a small spa town near Germany's border with the Czech Republic.\r\nRoth said that they \"almost got incinerated\", during the theater fire scene, as they projected the fire would burn at 400 °C (752 °F), but it instead burned at 1,200 °C (2,190 °F). He said the swastika was not supposed to fall either, as it was fastened with steel cables, but the steel softened and snapped.\r\nOn January 11, 2013, on the BBC's The Graham Norton Show, Tarantino said that for the scene where Kruger was strangled, he personally strangled the actress, with his own bare hands, in one take, to aid authenticity.\r\nFollowing the film's screening at Cannes, Tarantino stated that he would be re-editing the film in June before its ultimate theatrical release, allowing him time to finish assembling several scenes that were not completed in time for the hurried Cannes première.\r\nMusic\r\nTarantino originally wanted Ennio Morricone to compose the film's soundtrack. Morricone was unable to, because the film's sped-up production schedule conflicted with his scoring of Giuseppe Tornatore's Baarìa. However, Tarantino did use eight tracks composed by Morricone in the film, with four of them included on the CD.\r\nThe opening theme is taken from the pseudo-folk ballad \"The Green Leaves of Summer\", which was composed by Dimitri Tiomkin and Paul Francis Webster for the opening of the 1960 film The Alamo. The soundtrack uses a variety of music genres, including Spaghetti Western and R&B. Prominent in the latter part of the film is David Bowie's theme from the 1982 film Cat People. The soundtrack, the first of Tarantino's not to include dialogue excerpts, was released on August 18, 2009.\r\nRelease\r\nWhen the script's final draft was finished, it was leaked on the Internet and several Tarantino fan sites began posting reviews and excerpts from the script.\r\nThe film's first full teaser trailer premiered on Entertainment Tonight on February 10, 2009, and was shown in US theaters the following week attached to Friday the 13th. The trailer features excerpts of Lt. Aldo Raine talking to the Basterds, informing them of the plan to ambush and kill, torture, and scalp unwitting Nazi servicemen, intercut with various other scenes from the film. It also features the spaghetti-westernesque terms Once Upon A Time In Nazi Occupied France, which was considered for the film's title, and A Basterd's Work Is Never Done, a line not spoken in the final film (the line occurs in the script during the Bear Jew's backstory).\r\nThe film was released on August 19, 2009, in the United Kingdom and France, two days earlier than the US release date of August 21, 2009. It was released in Germany on August 20, 2009. Some European cinemas, however, showed previews starting on August 15. In Poland, the artwork on all advertisements and on DVD packaging is unchanged, but the title was translated non-literally to Bękarty Wojny (Bastards of War), so that Nazi iconography could stylize the letter \"O\". Tarantino didn't misspell the title to differentiate his film from the 1978 movie by the same name. He said it instead was a creative decision which he initially refused to explain, simply saying that \"Basterds\" was spelled as such because \"that's just the way you say it\".\r\nPromotion in Germany and Austria\r\nUniversal Pictures adjusted the film's publicity materials and website in Germany and Austria to comply with both countries' penal laws, as the display of Nazi iconography is restricted there: the swastika was removed from the typography of the title, and the steel helmet had a bullet hole in place of the Nazi symbol. The site's download section was also revised to exclude wallpaper downloads that openly feature the swastika. Though advertising posters and wallpapers may not show Nazi iconography, this restriction does not apply to \"works of art\", according to German and Austrian law, so the film itself was not censored in either Germany or Austria.\r\nHome media\r\nThe film was released on single-disc DVD and a two-disc special-edition DVD and Blu-ray Disc on December 15, 2009, by Universal Studios Home Entertainment in the United States and Australia. It was released on DVD and Blu-ray Disc on December 7, 2009, in the UK. On its first week of release, the film was number two, only behind The Hangover, selling an estimated 1,581,220 DVDs, making $28,467,652 in the United States.\r\nThe German version is 50 seconds longer than the American version. The scene in the tavern has been extended. Although in other countries, the extended scene was released as a bonus feature, the German theatrical, DVD, and Blu-ray versions are the only ones to include the full scene.\r\nReception\r\nBox office\r\nInglourious Basterds grossed $120.5 million in the United States and Canada, and $200.9 million in other territories, for a worldwide gross $321.4 million, against a production budget of $70 million. It became Tarantino's highest-grossing film, both in the US and worldwide, until Django Unchained in 2012.\r\nOpening in 3,165 screens, the film earned $14.3 million on the opening Friday of its North American release, on the way to an opening-weekend gross of $38 million, giving Tarantino a personal best weekend opening and the number one spot at the box office, ahead of District 9. The film fell to number two in its second weekend, behind The Final Destination, with earnings of $20 million, for a 10-day total of $73.8 million.\r\nInglourious Basterds opened internationally at number one in 22 markets on 2,650 screens, making $27.49 million. First place openings included France, taking in $6.09 million on 500 screens. The United Kingdom was not far behind making $5.92 million (£3.8 m) on 444 screens. Germany took in $4.20 million on 439 screens and Australia with $2.56 million (A$2.8 m) on 266 screens.\r\nCritical reception\r\nReview aggregator Rotten Tomatoes reports that 89% of 332 critics have given the film a positive review, with a rating average of 7.8/10. The site's critical consensus reads: \"A classic Tarantino genre-blending thrill ride, Inglourious Basterds is violent, unrestrained, and thoroughly entertaining.\" Metacritic, which assigns a rating on reviews, gives the film a weighted average score of 69 out of 100, based on 36 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.\r\nCritics' initial reactions at the Cannes Film Festival were mixed. The film received an eight- to eleven-minute standing ovation from critics after its first screening at Cannes, although Le Monde, a leading French newspaper, dismissed it, saying \"Tarantino gets lost in a fictional World War II\". Despite this, Anne Thompson of Variety praised the film, but opined that it was not a masterpiece, claiming, \"Inglourious Basterds is great fun to watch, but the movie isn't entirely engaging ... You don't jump into the world of the film in a participatory way; you watch it from a distance, appreciating the references and the masterful mise en scène. This is a film that will benefit from a second viewing\".\r\nCritic James Berardinelli gave the film his first four-star review of 2009, stating, \"With Inglourious Basterds, Quentin Tarantino has made his best movie since Pulp Fiction\", and that it was \"one hell of an enjoyable ride\". Roger Ebert of the Chicago Sun-Times also gave the film a four-star review, writing that \"Quentin Tarantino's Inglourious Basterds is a big, bold, audacious war movie that will annoy some, startle others and demonstrate once again that he's the real thing, a director of quixotic delights.\"\r\nAuthor and critic Daniel Mendelsohn was disturbed by the portrayal of Jewish American soldiers mimicking German atrocities done to European Jews, stating, \"In Inglourious Basterds, Tarantino indulges this taste for vengeful violence by—well, by turning Jews into Nazis\". Peter Bradshaw of The Guardian stated he was \"struck ... by how exasperatingly awful and transcendentally disappointing it is\".\r\nWhile praising Christoph Waltz's performance (\"a good actor new to American audiences\"), David Denby, of The New Yorker, dismissed the film with the following words: \"The film is skillfully made, but it's too silly to be enjoyed, even as a joke. ... Tarantino has become an embarrassment: his virtuosity as a maker of images has been overwhelmed by his inanity as an idiot de la cinémathèque\". Journalist Christopher Hitchens likened the experience of watching the film to \"sitting in the dark having a great pot of warm piss emptied very slowly over your head\".\r\nThe film also met some criticism from the Jewish press. In Tablet, Liel Liebowitz criticizes the film as lacking moral depth. He argues that the power of film lies in its ability to impart knowledge and subtle understanding, but Inglourious Basterds serves more as an \"alternative to reality, a magical and Manichaean world where we needn't worry about the complexities of morality, where violence solves everything, and where the Third Reich is always just a film reel and a lit match away from cartoonish defeat\". Anthony Frosh, writer for the online magazine Galus Australis, has criticized the film for failing to develop its characters sufficiently, labeling the film \"Enthralling, but lacking in Jewish content\". Daniel Mendelsohn was critical of the film's depiction of Jews and the overall revisionist history aspect of the film, writing \"Do you really want audiences cheering for a revenge that turns Jews into carboncopies of Nazis, that makes Jews into \"sickening\" perpetrators? I'm not so sure.\" While Jonathan Rosenbaum equated the film to Holocaust denial, stating \"A film that didn't even entertain me past its opening sequence, and that profoundly bored me during the endlessly protracted build-up to a cellar shoot-out, it also gave me the sort of malaise that made me wonder periodically what it was (and is) about the film that seems morally akin to Holocaust denial, even though it proudly claims to be the opposite of that.\" When challenged on his opinion, Rosenbaum elaborated by stating, \"For me, Inglourious Basterds makes the Holocaust harder, not easier to grasp as a historical reality. Insofar as it becomes a movie convention — by which I mean a reality derived only from other movies — it loses its historical reality.\"\r\nInglourious Basterds was later ranked #62 on a BBC critics' poll of the greatest films since 2000. In 2010, the Independent Film & Television Alliance selected the film as one of the 30 Most Significant Independent Films of the last 30 years.\r\nTop ten lists\r\nInglourious Basterds was listed on many critics' top ten lists.\r\n1st – Mick LaSalle, San Francisco Chronicle\r\n1st – Kyle Smith, New York Post\r\n1st – Noel Murray, The A.V. Club\r\n2nd – Elizabeth Weitzman, New York Daily News\r\n2nd – James Berardinelli, Reelviews\r\n2nd – Owen Gleiberman, Entertainment Weekly\r\n2nd – Scott Foundas, L.A. Weekly\r\n3rd – Rene Rodriguez, Miami Herald\r\n3rd – Nathan Rabin, The A.V. Club\r\n4th – Mark Mohan, Portland Oregonian\r\n5th – Lou Lumenick, New York Post\r\n5th – Peter Hartlaub, San Francisco Chronicle\r\n5th – Roger Ebert, Chicago Sun-Times\r\n5th – Richard Roeper\r\n5th – Frank Scheck, The Hollywood Reporter\r\n7th – Joe Neumaier, New York Daily News\r\n7th – Joe Williams, St. Louis Post-Dispatch\r\n8th – Claudia Puig, USA Today\r\n8th – J. Hoberman, The Village Voice\r\n8th – Kimberly Jones, Austin Chronicle\r\n9th – Marc Savlov, Austin Chronicle\r\n9th – Mike Scott, The Times-Picayune\r\n10th – Keith Uhlich, Time Out New York\r\nAccolades\r\nChristoph Waltz was singled out for Cannes honors, receiving the Best Actor Award at the festival's end. Film critic Devin Faraci of CHUD.com stated: \"The cry has been raised long before this review, but let me continue it: Christoph Waltz needs not an Oscar nomination but rather an actual Oscar in his hands. ... he must have gold\".\r\nThe film received four Golden Globe Award nominations including Best Motion Picture – Drama and Best Supporting Actor for Waltz, who went on to win the award.\r\nThe film also received three Screen Actors Guild Award nominations and went on to win the awards for Best Cast and Best Supporting Actor, which was awarded to Waltz.\r\nThe film was nominated for six BAFTA Awards, including Best Director for Tarantino, winning only one award—Best Supporting Actor for Waltz.\r\nIn February 2010, the film was nominated for eight Academy Awards, including Best Picture, Best Director, Best Supporting Actor for Waltz, and Best Original Screenplay. Waltz was awarded the Academy Award for Best Supporting Actor.",
    "html": "<p>Inglourious Basterds is a 2009 war film written and directed by Quentin Tarantino, starring Brad Pitt, Christoph Waltz, Michael Fassbender, Eli Roth, Diane Kruger, Daniel Brühl, Til Schweiger and Mélanie Laurent. The film tells an alternate history story of two plots to assassinate Nazi Germany's leadership—one planned by Shosanna Dreyfus, a young French Jewish cinema proprietor, and the other by the British; but is ultimately conducted solely by a team of Jewish American soldiers led by First Lieutenant Aldo Raine. Christoph Waltz co-stars as Hans Landa, an SS colonel in charge of tracking down Raine's group. The title was inspired by Italian director Enzo G. Castellari's 1978 Euro War film The Inglorious Bastards, though Tarantino's film is not a remake of it.</p><p>Tarantino wrote the script in 1998, but struggled with the ending and chose instead to direct the two-part film Kill Bill. After directing Death Proof in 2007, Tarantino returned to work on Inglourious Basterds. A co-production of the United States and Germany, the film began principal photography in October 2008 and was filmed in Germany and France with a $70 million production budget. It premiered on May 20, 2009, at the 62nd Cannes Film Festival, and received a wide release in theaters in the United States and Europe in August 2009 by The Weinstein Company and Universal Pictures.</p><p>Inglourious Basterds grossed over $321.5 million in theaters worldwide, making it Tarantino's highest-grossing film to that point, until it was surpassed in box office by Django Unchained (2012) and Once Upon a Time in Hollywood (2019). The film received generally positive reviews, with Waltz's performance as Hans Landa being singled out for praise, but some criticized the historical liberties taken. It also won multiple awards and nominations, among them eight Academy Award nominations (including Best Picture, Best Director and Best Original Screenplay). For his role as Landa, Waltz won the Cannes Film Festival's Best Actor Award, as well as the BAFTA, Screen Actors Guild, Critics' Choice, Golden Globe, and Academy Award for Best Supporting Actor.</p><br/><h3>Plot</h3><p>In 1941, SS-Standartenführer Hans Landa interrogates French farmer Perrier LaPadite, suspecting the LaPadites are hiding a Jewish family, the Dreyfuses, under their floorboards. LaPadite tearfully confirms this to spare his own family, and Landa has the hidden family shot, but allows Shosanna Dreyfus to escape.</p><p>Three years later, U.S. Army Lieutenant Aldo Raine recruits Jewish-American soldiers to the \"Basterds\", a commando unit instilling fear among Nazis in occupied France by killing and scalping them. The group includes Sergeant Donny \"The Bear Jew\" Donowitz, rogue German Sergeant Hugo Stiglitz, and translator Corporal Wilhelm Wicki. In Germany, Adolf Hitler interviews a German soldier, who reveals that Raine carved a swastika into his forehead after massacring his squadron.</p><p>In Paris, Shosanna operates a cinema under the name Emmanuelle Mimieux, and meets Fredrick Zoller, a famed German sniper set to star in the Nazi propaganda film Stolz der Nation (Nation's Pride). Infatuated with Shosanna, Zoller convinces Joseph Goebbels to hold the film's premiere at her cinema. Landa, the premiere's head of security, interrogates Shosanna, who plots with her Afro-French lover and projectionist, Marcel, to kill the Nazi leaders in attendance.</p><p>British Commando Lieutenant Archie Hicox is recruited to lead an attack on the premiere with the Basterds. Disguised as German officers, Hicox, Stiglitz, and Wicki meet with German film star Bridget von Hammersmark, an undercover Allied agent, at a tavern in Nazi-occupied northern France. Hicox inadvertently draws the attention of Wehrmacht Sergeant Wilhelm and Major Dieter Hellström, first with his unusually accented German and then by using a British hand gesture. Their covers blown, a gunfight ensues, killing everyone except Wilhelm and a wounded von Hammersmark. Raine arrives and negotiates for von Hammersmark's release, but she shoots Wilhelm. Raine tortures von Hammersmark, believing she set his men up, but she convinces him she is loyal and reveals Hitler will be attending the premiere. Raine decides to carry out their plan with himself, Donowitz, and Omar Ulmer. Investigating the tavern, Landa finds von Hammersmark's shoe and a napkin with her signature.</p><p>Raine, Donowitz, and Ulmer infiltrate the premiere with timed explosives, while Landa confronts von Hammersmark with her missing shoe before strangling her to death. Raine and another Basterd, Smithson Utivich, are discovered and taken prisoner, but Landa has Raine contact his superior to cut a deal: Landa will allow the mission to proceed in exchange for safe passage through the Allied lines, a full pardon, and other privileges.</p><p>During the screening, Zoller slips away to the projection room and attempts to force himself on Shosanna, leading them to shoot each other dead. As the film reaches its climax, Shosanna's spliced-in footage tells the audience that they are about to be killed by a Jew. Having locked the auditorium, Marcel ignites a pile of flammable film behind the screen, setting the theater ablaze. Ulmer and Donowitz break into the opera box, gunning down Hitler and Goebbels and firing into the crowd until their explosives kill everyone inside the cinema.</p><p>Landa and his radio operator drive Raine and Utivich into Allied territory, where they surrender themselves. However, Raine shoots the radio operator before ordering Utivich to scalp him, and carves a swastika into Landa's forehead, professing it to be his \"masterpiece\".</p><br/><h3>Cast</h3><ul><li>Brad Pitt as Lieutenant Aldo Raine, nicknamed \"Aldo the apache\" due to his trademark of scalping Nazis he defeats, is the battle-hardened commanding officer of the Basterds. Raine is a coal miner and bootlegger from the Great Smoky Mountains of Tennessee,: 499 where he fought against the Ku Klux Klan. He survived a lynching and is a descendant of Jim Bridger and the Bridger family. He was a member of the Devil's Brigade where he was trained in guerrilla warfare.</li><li>Mélanie Laurent as Shosanna Dreyfus, an 18 year old: 90, 186 French Jewish cinema owner whose family was executed by Landa when she was 15 years old. Shosanna manages to escape due to luck and Landa's decision to not pursue her.: 90–91 Most of The Bride's attributes from Tarantino's Kill Bill come from Tarantino's original development of Shosanna for Inglourious Basterds which he started to work on before Kill Bill. Originally Shosanna was an assassin who had a list of Nazis she would cross off as she killed, whom Tarantino described as a Jewish Joan of Arc. Tarantino later switched the character attributes over to The Bride and later redeveloped Shosanna into the version who appears in the film.: 22:00–24:00</li><li>Christoph Waltz as Standartenführer Hans Landa, an eloquent and cultured but deeply ruthless SS officer.</li><li>Eli Roth as Sergeant Donny Donowitz, also known as \"The Bear Jew\", a brooding member of the Basterds who executes Nazis with his baseball bat. In Tarantino's screenplay Donowitz is likened to Joshua: 167 and his bat to the sword of Gideon.: 170 Roth channeled actor Tony Curtis for his portrayal per Tarantino's direction. Donny is the father of Tarantino-created film producer Lee Donowitz (Saul Rubinek) who appeared in True Romance.</li><li>Michael Fassbender as Lieutenant Archie Hicox, a British commando and former film critic who assists the Basterds on their mission in France. Hicox was patterned after actor George Sanders.</li><li>Diane Kruger as Bridget Von Hammersmark, a German film star turned spy for Great Britain. Tarantino based Hammersmark on Hungarian actress Ilona Massey. For her portrayal of the character Kruger was inspired by German actress Hildegard Knef.</li><li>Daniel Brühl as Fredrick Zoller, a German army sniper whose story is made into a propaganda film. He was inspired by Matthäus Hetzenauer. Tarantino also created Zoller as a Nazi Audie Murphy.: 11:00–13:00</li><li>Til Schweiger as Sergeant Hugo Stiglitz, a former German army soldier who murdered numerous Gestapo officers and is recruited by the Basterds.</li><li>B. J. Novak as Smithson Utivich, short and slightly built member of the Basterds unit.</li><li>Gedeon Burkhard as Corporal Wilhelm Wicki, the Austrian-born, deadpan-humored translator of the Basterds unit.</li><li>Jacky Ido as Marcel, a projector operator at the cinema</li><li>Omar Doom as Omar Ulmer, a member of the Basterds unit</li><li>Samm Levine as Hirschberg, a member of the Basterds unit</li><li>August Diehl as Sturmbannführer Dieter Hellstrom</li><li>Denis Ménochet as Perrier LaPadite</li><li>Sylvester Groth as Joseph Goebbels</li><li>Martin Wuttke as Adolf Hitler</li><li>Mike Myers as General Ed Fenech</li><li>Julie Dreyfus as Francesca Mondino</li><li>Richard Sammel as Sergeant Rachtman</li><li>Alexander Fehling as Master Sergeant Wilhelm</li><li>Rod Taylor as Winston Churchill</li><li>Sönke Möhring as Private Butz</li><li>Paul Rust as Andy Kagan, a member of the Basterds unit</li><li>Michael Bacall as Michael Zimmerman, a member of the Basterds unit</li><li>Carlos Fidel as Simon Sakowitz, a member of the Basterds unit</li><li>Ken Duken as \"Mata Hari\" soldier</li><li>Christian Berkel as Proprietor Eric</li><li>Anne-Sophie Franck as Mathilda</li><li>Léa Seydoux as Charlotte LaPadite</li><li>Tina Rodriguez as Julie LaPadite</li><li>Lena Friedrich as Suzanne LaPadite</li><li>Jana Pallaske as Babette</li><li>Rainer Bock as General Schonherr, a member of the Oberkommando des Heeres</li><li>Michael Scheel as General Frank, a member of the Oberkommando des Heeres</li><li>Buddy Joe Hooker as Gaspar</li><li>Christian Brückner as Kliest</li><li>Hilmar Eichhorn as Emil Jannings</li><li>Patrick Elias as Jakob Dreyfus</li><li>Eva Löbau as Miriam Dreyfus</li><li>Salvadore Brandt as Bob Dreyfus</li><li>Jasper Linnewedel as Amos Dreyfus</li><li>Volker Zack Michalowski as \"Edgar Wallace\" soldier</li></ul><p>Director Enzo G. Castellari also makes a cameo appearance in the film at the movie premiere. He previously cameoed as a German in his own The Inglorious Bastards and reprised the same role in this film, but under a different rank and SS organization. Bo Svenson, who starred in Castellari's The Inglorious Bastards, also has a small cameo in the film as a US colonel in the Nation's Pride movie.</p><p>Additionally Samuel L. Jackson narrates the film, Harvey Keitel voices the Office of Strategic Services Commander, Bela B appears as an usher and Tarantino appears as an American soldier in Nation's Pride and a scalped Nazi. Two characters, Mrs. Himmelstein and Madame Ada Mimieux, played by Cloris Leachman and Maggie Cheung, respectively, were both cut from the final film due to length.</p><br/><h3>Production</h3><h4>Development</h4><p>Tarantino spent just over a decade creating the film's script because, as he told Charlie Rose in an interview, he became \"too precious about the page\", meaning the story kept growing and expanding. Tarantino viewed the script as his masterpiece in the making, so felt it had to become the best thing he had ever written. He described an early premise of the film as his \"bunch-of-guys-on-a-mission\" film, \"my Dirty Dozen or Where Eagles Dare or Guns of Navarone kind of thing\".</p><blockquote>I'm going to find a place that actually resembles, in one way or another, the Spanish locales they had in spaghetti westerns – a no man's land. With US soldiers and French peasants and the French resistance and German occupation troops, it was kind of a no man's land. That will really be my spaghetti Western but with World War II iconography. But the thing is, I won't be period specific about the movie. I'm not just gonna play a lot of Édith Piaf and Andrews Sisters. I can have rap, and I can do whatever I want. It's about filling in the viscera.</blockquote><p>—Quentin Tarantino</p><p>By 2002, Tarantino found Inglourious Basterds to be a bigger film than planned and saw that other directors were working on World War II films. Tarantino had produced three nearly finished scripts, proclaiming that it was \"some of the best writing I've ever done. But I couldn't come up with an ending.\" He moved on to direct the two-part film Kill Bill (2003–2004). After the completion of Kill Bill, Tarantino went back to his first storyline draft and considered making it a mini-series. Instead he trimmed the script, using his script for Pulp Fiction as a guide to length. The revised premise focused on a group of soldiers who escape from their executions and embark on a mission to help the Allies. He described the men as \"not your normal hero types that are thrown into a big deal in the Second World War\".</p><p>Tarantino planned to begin production in 2005. In November 2004, he delayed production and instead took an acting role in Takashi Miike's Western film Sukiyaki Western Django, and intended to make a kung fu film entirely in Mandarin; this project foundered. He directed Death Proof (2007), part of the double feature Grindhouse, before returning to work on Inglourious Basterds.</p><p>The film's title was inspired by the English-language title of director Enzo G. Castellari's 1978 war film, The Inglorious Bastards. When pushed, Tarantino would not explain the first u in Inglourious, but said, \"The Basterds? That's just the way you say it: Basterds.\" He later stated that the misspelled title is \"a Basquiat-esque touch\". He further commented on Late Show with David Letterman that Inglourious Basterds is a \"Quentin Tarantino spelling\". Tarantino has said that the film's opening scene, in which Landa interrogates the French dairy farmer, is his \"favorite thing\" he's \"ever written\".</p><h4>Casting</h4><p>Tarantino originally sought Leonardo DiCaprio to be cast as Hans Landa, before deciding to have the character played by a native German-speaking actor. The role ultimately went to Austrian Christoph Waltz who, according to Tarantino, \"gave me my movie\" as he feared the part was \"unplayable\". Pitt and Tarantino had wanted to work together for a number of years, but they were waiting for the right project. When Tarantino was halfway through the film's script, he sensed that Pitt was a strong possibility for the role of Aldo Raine. By the time he had finished writing, Tarantino thought Pitt \"would be terrific\" and called Pitt's agent to ask if he was available.</p><p>Tarantino asked Adam Sandler to play the role of Donny Donowitz, but Sandler declined due to schedule conflicts with the film Funny People. Eli Roth was cast in the role instead. Roth also directed the film-within-the-film, Nation's Pride, which used 300 extras. The director also wanted to cast Simon Pegg in the film as Lt. Archie Hicox, but he was forced to drop out due to scheduling difficulties with Spielberg's Tintin adaptation. Irish-German actor Michael Fassbender began final negotiations to join the cast as Hicox in August 2008, although he originally auditioned for the role of Landa. B. J. Novak was also cast in August 2008 as Private First Class Smithson Utivich, \"a New York-born soldier of 'slight build'\".</p><p>Tarantino talked to actress Nastassja Kinski about playing the role of Bridget von Hammersmark and even flew to Germany to meet her, but a deal could not be reached and Tarantino cast Diane Kruger instead. Rod Taylor was effectively retired from acting and no longer had an agent, but came out of retirement when Tarantino offered him the role of Winston Churchill in the film. This would be Taylor's last appearance on film before his death on January 7, 2015. In preparation for the role, Taylor watched dozens of DVDs with footage of Churchill in order to get the Prime Minister's posture, body language, and voice, including a lisp, correct. Taylor initially recommended British actor Albert Finney for the role during their conversation, but agreed to take the part because of Tarantino's \"passion.\" Mike Myers, a fan of Tarantino, had inquired about being in the film since Myers' parents had been in the British Armed Forces. In terms of the character's dialect, Myers felt that it was a version of Received Pronunciation meeting the officer class, but mostly an attitude of \"I'm fed up with this war and if this dude can end it, great because my country is in ruins.\"</p><p>Tarantino met Mélanie Laurent in three rounds, reading all the characters on the first round. On the second meeting, he shared the lines with her; the third was a face-to-face dinner. During the dinner, he told Laurent, \"Do you know something—there's just something I don't like. It's that you're famous in your country, and I'm really wanting to discover somebody.\" Laurent replied \"No, no, no. ... I'm not so famous.\" After four days, he called to finalize her for the role of Shosanna. Samm Levine was cast as PFC Hirschberg, because, according to Levine, Tarantino was a big fan of Freaks and Geeks, which starred Levine. Filmmaker Tom Tykwer, who translated parts of the film's dialogue into German, recommended Daniel Brühl to Tarantino, who recalled that upon seeing the actor's performance in Good Bye, Lenin!, he declared, \"That's my right there. If Daniel's mother had never met Daniel's father, I don't know if we'd ever have the right Zoller\".</p><p>Isabelle Huppert was originally cast in the role of Madame Mimieux before being fired due to creative differences. It was also reported that Catherine Deneuve was considered for the role. According to French musician and actor Johnny Hallyday, Tarantino had originally written a role for him in the film.</p><h4>Filming</h4><p>Tarantino teamed with The Weinstein Company to prepare what he planned to be his film for production. In July 2008, Tarantino and executive producers Harvey and Bob Weinstein set up an accelerated production schedule to be completed for release at the Cannes Film Festival in 2009, where the film would compete for the Palme d'Or.</p><p>The Weinstein Company co-financed the film and distributed it in the United States, and signed a deal with Universal Pictures to finance the rest of the film and distribute it internationally. Germany and France were scheduled as filming locations and principal photography started in October 2008 on location in Germany.</p><p>Filming was scheduled to begin on October 13, 2008, and shooting started that week. Special effects were handled by KNB EFX Group with Greg Nicotero and much of the film was shot and edited in the Babelsberg Studio in Potsdam, Germany, and in Bad Schandau, a small spa town near Germany's border with the Czech Republic.</p><p>Roth said that they \"almost got incinerated\", during the theater fire scene, as they projected the fire would burn at 400 °C (752 °F), but it instead burned at 1,200 °C (2,190 °F). He said the swastika was not supposed to fall either, as it was fastened with steel cables, but the steel softened and snapped.</p><p>On January 11, 2013, on the BBC's The Graham Norton Show, Tarantino said that for the scene where Kruger was strangled, he personally strangled the actress, with his own bare hands, in one take, to aid authenticity.</p><p>Following the film's screening at Cannes, Tarantino stated that he would be re-editing the film in June before its ultimate theatrical release, allowing him time to finish assembling several scenes that were not completed in time for the hurried Cannes première.</p><h4>Music</h4><p>Tarantino originally wanted Ennio Morricone to compose the film's soundtrack. Morricone was unable to, because the film's sped-up production schedule conflicted with his scoring of Giuseppe Tornatore's Baarìa. However, Tarantino did use eight tracks composed by Morricone in the film, with four of them included on the CD.</p><p>The opening theme is taken from the pseudo-folk ballad \"The Green Leaves of Summer\", which was composed by Dimitri Tiomkin and Paul Francis Webster for the opening of the 1960 film The Alamo. The soundtrack uses a variety of music genres, including Spaghetti Western and R&B. Prominent in the latter part of the film is David Bowie's theme from the 1982 film Cat People. The soundtrack, the first of Tarantino's not to include dialogue excerpts, was released on August 18, 2009.</p><br/><h3>Release</h3><p>When the script's final draft was finished, it was leaked on the Internet and several Tarantino fan sites began posting reviews and excerpts from the script.</p><p>The film's first full teaser trailer premiered on Entertainment Tonight on February 10, 2009, and was shown in US theaters the following week attached to Friday the 13th. The trailer features excerpts of Lt. Aldo Raine talking to the Basterds, informing them of the plan to ambush and kill, torture, and scalp unwitting Nazi servicemen, intercut with various other scenes from the film. It also features the spaghetti-westernesque terms Once Upon A Time In Nazi Occupied France, which was considered for the film's title, and A Basterd's Work Is Never Done, a line not spoken in the final film (the line occurs in the script during the Bear Jew's backstory).</p><p>The film was released on August 19, 2009, in the United Kingdom and France, two days earlier than the US release date of August 21, 2009. It was released in Germany on August 20, 2009. Some European cinemas, however, showed previews starting on August 15. In Poland, the artwork on all advertisements and on DVD packaging is unchanged, but the title was translated non-literally to Bękarty Wojny (Bastards of War), so that Nazi iconography could stylize the letter \"O\". Tarantino didn't misspell the title to differentiate his film from the 1978 movie by the same name. He said it instead was a creative decision which he initially refused to explain, simply saying that \"Basterds\" was spelled as such because \"that's just the way you say it\".</p><h4>Promotion in Germany and Austria</h4><p>Universal Pictures adjusted the film's publicity materials and website in Germany and Austria to comply with both countries' penal laws, as the display of Nazi iconography is restricted there: the swastika was removed from the typography of the title, and the steel helmet had a bullet hole in place of the Nazi symbol. The site's download section was also revised to exclude wallpaper downloads that openly feature the swastika. Though advertising posters and wallpapers may not show Nazi iconography, this restriction does not apply to \"works of art\", according to German and Austrian law, so the film itself was not censored in either Germany or Austria.</p><h4>Home media</h4><p>The film was released on single-disc DVD and a two-disc special-edition DVD and Blu-ray Disc on December 15, 2009, by Universal Studios Home Entertainment in the United States and Australia. It was released on DVD and Blu-ray Disc on December 7, 2009, in the UK. On its first week of release, the film was number two, only behind The Hangover, selling an estimated 1,581,220 DVDs, making $28,467,652 in the United States.</p><p>The German version is 50 seconds longer than the American version. The scene in the tavern has been extended. Although in other countries, the extended scene was released as a bonus feature, the German theatrical, DVD, and Blu-ray versions are the only ones to include the full scene.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Inglourious Basterds grossed $120.5 million in the United States and Canada, and $200.9 million in other territories, for a worldwide gross $321.4 million, against a production budget of $70 million. It became Tarantino's highest-grossing film, both in the US and worldwide, until Django Unchained in 2012.</p><p>Opening in 3,165 screens, the film earned $14.3 million on the opening Friday of its North American release, on the way to an opening-weekend gross of $38 million, giving Tarantino a personal best weekend opening and the number one spot at the box office, ahead of District 9. The film fell to number two in its second weekend, behind The Final Destination, with earnings of $20 million, for a 10-day total of $73.8 million.</p><p>Inglourious Basterds opened internationally at number one in 22 markets on 2,650 screens, making $27.49 million. First place openings included France, taking in $6.09 million on 500 screens. The United Kingdom was not far behind making $5.92 million (£3.8 m) on 444 screens. Germany took in $4.20 million on 439 screens and Australia with $2.56 million (A$2.8 m) on 266 screens.</p><h4>Critical reception</h4><p>Review aggregator Rotten Tomatoes reports that 89% of 332 critics have given the film a positive review, with a rating average of 7.8/10. The site's critical consensus reads: \"A classic Tarantino genre-blending thrill ride, Inglourious Basterds is violent, unrestrained, and thoroughly entertaining.\" Metacritic, which assigns a rating on reviews, gives the film a weighted average score of 69 out of 100, based on 36 critics, indicating \"generally favorable reviews\". Audiences surveyed by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.</p><p>Critics' initial reactions at the Cannes Film Festival were mixed. The film received an eight- to eleven-minute standing ovation from critics after its first screening at Cannes, although Le Monde, a leading French newspaper, dismissed it, saying \"Tarantino gets lost in a fictional World War II\". Despite this, Anne Thompson of Variety praised the film, but opined that it was not a masterpiece, claiming, \"Inglourious Basterds is great fun to watch, but the movie isn't entirely engaging ... You don't jump into the world of the film in a participatory way; you watch it from a distance, appreciating the references and the masterful mise en scène. This is a film that will benefit from a second viewing\".</p><p>Critic James Berardinelli gave the film his first four-star review of 2009, stating, \"With Inglourious Basterds, Quentin Tarantino has made his best movie since Pulp Fiction\", and that it was \"one hell of an enjoyable ride\". Roger Ebert of the Chicago Sun-Times also gave the film a four-star review, writing that \"Quentin Tarantino's Inglourious Basterds is a big, bold, audacious war movie that will annoy some, startle others and demonstrate once again that he's the real thing, a director of quixotic delights.\"</p><p>Author and critic Daniel Mendelsohn was disturbed by the portrayal of Jewish American soldiers mimicking German atrocities done to European Jews, stating, \"In Inglourious Basterds, Tarantino indulges this taste for vengeful violence by—well, by turning Jews into Nazis\". Peter Bradshaw of The Guardian stated he was \"struck ... by how exasperatingly awful and transcendentally disappointing it is\".</p><p>While praising Christoph Waltz's performance (\"a good actor new to American audiences\"), David Denby, of The New Yorker, dismissed the film with the following words: \"The film is skillfully made, but it's too silly to be enjoyed, even as a joke. ... Tarantino has become an embarrassment: his virtuosity as a maker of images has been overwhelmed by his inanity as an idiot de la cinémathèque\". Journalist Christopher Hitchens likened the experience of watching the film to \"sitting in the dark having a great pot of warm piss emptied very slowly over your head\".</p><p>The film also met some criticism from the Jewish press. In Tablet, Liel Liebowitz criticizes the film as lacking moral depth. He argues that the power of film lies in its ability to impart knowledge and subtle understanding, but Inglourious Basterds serves more as an \"alternative to reality, a magical and Manichaean world where we needn't worry about the complexities of morality, where violence solves everything, and where the Third Reich is always just a film reel and a lit match away from cartoonish defeat\". Anthony Frosh, writer for the online magazine Galus Australis, has criticized the film for failing to develop its characters sufficiently, labeling the film \"Enthralling, but lacking in Jewish content\". Daniel Mendelsohn was critical of the film's depiction of Jews and the overall revisionist history aspect of the film, writing \"Do you really want audiences cheering for a revenge that turns Jews into carboncopies of Nazis, that makes Jews into \"sickening\" perpetrators? I'm not so sure.\" While Jonathan Rosenbaum equated the film to Holocaust denial, stating \"A film that didn't even entertain me past its opening sequence, and that profoundly bored me during the endlessly protracted build-up to a cellar shoot-out, it also gave me the sort of malaise that made me wonder periodically what it was (and is) about the film that seems morally akin to Holocaust denial, even though it proudly claims to be the opposite of that.\" When challenged on his opinion, Rosenbaum elaborated by stating, \"For me, Inglourious Basterds makes the Holocaust harder, not easier to grasp as a historical reality. Insofar as it becomes a movie convention — by which I mean a reality derived only from other movies — it loses its historical reality.\"</p><p>Inglourious Basterds was later ranked #62 on a BBC critics' poll of the greatest films since 2000. In 2010, the Independent Film & Television Alliance selected the film as one of the 30 Most Significant Independent Films of the last 30 years.</p><h4>Top ten lists</h4><p>Inglourious Basterds was listed on many critics' top ten lists.</p><ul><li>1st – Mick LaSalle, San Francisco Chronicle</li><li>1st – Kyle Smith, New York Post</li><li>1st – Noel Murray, The A.V. Club</li><li>2nd – Elizabeth Weitzman, New York Daily News</li><li>2nd – James Berardinelli, Reelviews</li><li>2nd – Owen Gleiberman, Entertainment Weekly</li><li>2nd – Scott Foundas, L.A. Weekly</li><li>3rd – Rene Rodriguez, Miami Herald</li><li>3rd – Nathan Rabin, The A.V. Club</li><li>4th – Mark Mohan, Portland Oregonian</li><li>5th – Lou Lumenick, New York Post</li><li>5th – Peter Hartlaub, San Francisco Chronicle</li><li>5th – Roger Ebert, Chicago Sun-Times</li><li>5th – Richard Roeper</li><li>5th – Frank Scheck, The Hollywood Reporter</li><li>7th – Joe Neumaier, New York Daily News</li><li>7th – Joe Williams, St. Louis Post-Dispatch</li><li>8th – Claudia Puig, USA Today</li><li>8th – J. Hoberman, The Village Voice</li><li>8th – Kimberly Jones, Austin Chronicle</li><li>9th – Marc Savlov, Austin Chronicle</li><li>9th – Mike Scott, The Times-Picayune</li><li>10th – Keith Uhlich, Time Out New York</li></ul><h4>Accolades</h4><p>Christoph Waltz was singled out for Cannes honors, receiving the Best Actor Award at the festival's end. Film critic Devin Faraci of CHUD.com stated: \"The cry has been raised long before this review, but let me continue it: Christoph Waltz needs not an Oscar nomination but rather an actual Oscar in his hands. ... he must have gold\".</p><p>The film received four Golden Globe Award nominations including Best Motion Picture – Drama and Best Supporting Actor for Waltz, who went on to win the award.</p><p>The film also received three Screen Actors Guild Award nominations and went on to win the awards for Best Cast and Best Supporting Actor, which was awarded to Waltz.</p><p>The film was nominated for six BAFTA Awards, including Best Director for Tarantino, winning only one award—Best Supporting Actor for Waltz.</p><p>In February 2010, the film was nominated for eight Academy Awards, including Best Picture, Best Director, Best Supporting Actor for Waltz, and Best Original Screenplay. Waltz was awarded the Academy Award for Best Supporting Actor.</p><br/>"
  },
  "errorMessage": ""
}