{
  "imDbId": "tt0107207",
  "title": "In the Name of the Father",
  "fullTitle": "In the Name of the Father (1993)",
  "type": "Movie",
  "year": "1993",
  "items": [
    {
      "publisher": "",
      "author": "Austin Chronicle",
      "link": "https://www.austinchronicle.com/events/film/1994-01-21/in-the-name-of-the-father/",
      "rate": "100",
      "content": "For in relating the true story of Conlon's wrongful conviction and 15-year imprisonment, Sheridan has used the tools of the filmmaker to evoke a visceral echo of Conlon's waking nightmare."
    },
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Jim Sheridan skillfully interweaves a myriad of subplots and themes into a fast-paced, cohesive whole."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "91",
      "content": "Sheridan, however, works with such piercing fervor and intelligence that In the Name of the Father just about transcends its tidy moral design."
    },
    {
      "publisher": "The New York Times",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "And, riskiest of all, the film makers eschewed another grainy documentary go at the subject in favor of a movie drama of one of the most compelling true stories of the modern troubles."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "https://www.washingtonpost.com/wp-srv/style/longterm/movies/videos/inthenameofthefatherrhowe_a09e26.htm",
      "rate": "90",
      "content": "In the Name of the Father is as good a compromise of fact and fiction as you could hope for -- and still call it a movie."
    },
    {
      "publisher": "The New Yorker",
      "author": "",
      "link": "",
      "rate": "90",
      "content": "The picture turns into a kind of stylized morality play about the right and the wrong ways for Irishmen to respond to distorted portraits of their character, and it's terrifically effective."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "80",
      "content": "But the acting's so good it frequently transcends the simplicities of the script, and whenever Day-Lewis or Postlethwaite is on-screen the movie crackles."
    },
    {
      "publisher": "Time",
      "author": "Richard Corliss",
      "link": "",
      "rate": "80",
      "content": "By the end of the movie, whether or not you're a member of Sinn Fein, the Brits' brutality toward the Conlons will get your Irish up."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "75",
      "content": "The movie does a harrowing job of showing how, and why, a man might be made to confess to a bombing he didn't commit."
    },
    {
      "publisher": "The Globe and Mail (Toronto)",
      "author": "Rick Groen",
      "link": "",
      "rate": "63",
      "content": "He gets much of what he wants, but not all of it, and not all of the time - the film is just too eclectic on occasion, a bit jumpy in its tone and its pacing."
    }
  ],
  "errorMessage": ""
}