{
  "imDbId": "tt0107207",
  "title": "In the Name of the Father",
  "fullTitle": "In the Name of the Father (1993)",
  "type": "Movie",
  "year": "1993",
  "items": [
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6152495",
      "warningSpoilers": false,
      "date": "6 October 2020",
      "rate": "8",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Guilty Until Proven Innocent...",
      "content": "You're left wondering how many people over the years have been through the legal system in the UK and have been framed by those we place the ultimate trust within. It really does shake your confidence in a system and the people responsible for implementing it. Daniel Day-Lewis and Pete Postlethwaite bring this story to life with two magnificent performances and allow you to forgive those slight variations that misalign with actual events."
    },
    {
      "username": "Howlin Wolf",
      "userUrl": "https://www.imdb.com/user/ur1046557",
      "reviewLink": "https://www.imdb.com/review/rw0323333",
      "warningSpoilers": false,
      "date": "29 March 2001",
      "rate": "10",
      "helpful": "149 out of 175 found this helpful.",
      "title": "Stunning.",
      "content": "Words cannot accurately describe how affecting this movie is. The story itself is harrowing, but the way in which Day Lewis portrays Gerry Conlon is heartbreaking at times. Several scenes in the film may be hard to take for those with a sensitive nature. Captures the mood and the time perfectly for someone like me, who is not Irish, lives nowhere near Guildford and wasn't even alive at the time of the pub bombings. I really wasn't expecting anything special when I sat down to watch this. I could not have been more wrong. The soundtrack is great without exception too! A total and utter classic."
    },
    {
      "username": "jcanettis",
      "userUrl": "https://www.imdb.com/user/ur2882544",
      "reviewLink": "https://www.imdb.com/review/rw1163424",
      "warningSpoilers": false,
      "date": "2 September 2005",
      "rate": "10",
      "helpful": "143 out of 157 found this helpful.",
      "title": "Extremeley Powerful, With Superb Performances",
      "content": "A film fully deserving to be in IMDb's top 250, Jim Sheridan's \"In The Name of the Father\" is an excellent piece of work. Based on a true and very touching story, the film recounts the story of Gerry Conlon (Day-Lewis) who is wrongly accused as an IRA terrorist. Not only are the police bending the facts to prove their case, but in the process they also implicate members of his friends and family, including his father Giuseppe (Postlethwaithe) whose health condition is rather frail. Gerry is a rebellious and mildly delinquent boy who does not seem to have grown up, and his attitude toward his father is not the appropriate one; however, as they start to go through the ordeal together, Gerry gradually matures, and starts feeling a deep affection and respect for Giuseppe.The story is heart-breaking and shocking at the same time, all the more so when one realizes that these things actually DID happen. Although there have been some minor modifications for the purpose of the film, the backbone of the story is left completely intact.The two protagonists, Daniel Day-Liewis and Pete Postlethwaithe are delivering powerful performances, and they both deserved the Oscar hands-down. However, it would be unfair not to mention that virtually everyone in the film is great in his/her role.Jim Sheridan's direction is also very good, giving the plot a fair and balanced perspective; although the film might initially appear as pro-Irish / anti-English, in fact I consider it as quite objective. Granted, it vividly shows that some key figures in the London police were profoundly biased and manipulated maliciously the case against the Conlons; yet, it also shows that English public attitudes turned highly supportive for the Conlons' freedom when it started to become clear that they were not the culprits for the atrocities they had been charged with. We have always to remember that the film depicts a period of big tensions, with emotions running high to levels of hysteria, so we have to understand the events within this context.Of course, what happened to the Conlons is totally deplorable and unjustifiable; and it is real shame that the people who conspired against them have not been punished yet for their crimes. Still, one should understand the hostile attitude shown by those who were not part of this conspiracy (such as the judge, for example), who were influenced by the climate of terror and the outrage of the public. The Conlons had the terribly bad luck to be at the wrong place, in the wrong time, and with the wrong nationality; the also have the great misfortune to be captured by people who in their quest to show results were shamelessly willing to risk indicting people who could possibly be innocent.\"In the Name of the Father\" is a fantastic film, which one should not miss. 10/10."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0323354",
      "warningSpoilers": false,
      "date": "9 August 2002",
      "rate": "7",
      "helpful": "90 out of 117 found this helpful.",
      "title": "Innocence Is Not An Absolute",
      "content": "Like MIDNIGHT EXPRESS , IN THE NAME OF THE FATHER is a an extremely well made film , but like MIDNIGHT EXPRESS much of it is total invention . Reviewers on this page have already pointed out the numerous errors such as Guiseppe and Gerry Conlon never being imprisoned in the same jail or the \" Guilford four \" and \" Mcguire seven \" trials taking place in completely seperate court cases but no one seems to have pointed out the erroneous backgrounds this film paints of Gerry Conlon and Paul Hill. In their book THE PROVISIONAL IRA authors Patrick Bishop and Eamon Mallie state the facts quite clearly that Paul Hill was a member of the Belfast brigade of the provisonal IRA ( And Hill later did confess to being a member ) while Conlon had been a member of Na Fianna Eireann which is the youth section of the provisionals though Conlon was quickly kicked out ( Literally ) due to his heavy drinking and drug taking . They didn`t meet on the ferry as shown in the film but Conlon bumped into Hill in Southampton where Hill was staying . What was Hill doing in Southampton ? He was on the run from the IRA who wanted to question him about guns going missing and about the possibility of Hill being an informer , something that is always punishable in IRA ranks with death and prior torture . When Conlon returned to Belfast in December 1974 he did drunkenly mention to IRA acquaintances in pubs that he`d met Hill in England and in order to punish Hill for his suspected crimes against the organisation and to take the heat off their own cells active in Britain at the time it was the IRA themselves who deliberately leaked the false information to the intelligence services about Conlon and Hill being involved in the Guilford bombings , not as the film shows a jealous boyfriend . Hill was also later found guilty of the murder of a former soldier though is never shown in the film and it`s this playing hard and loose with the facts that almost threatens to destroy the film . It could have been worse though , there might have been the suggestion that the bombing could have been a mass suicide Well that`s the bad points out of the way . What`s IN THE NAME OF THE FATHER`s good points ? Well Jim Sheridan directs with a real kinetic force especially the early scene where Conlon is pursued by the Brits against a voodoo chile soundscape . Sheridan also gets the very best out of his cast . Emma Thompson is good as the crusading lawyer , Pete Postlethwaite is very good as Guiseppe Conlon , but the outstanding performance is by Daniel Day Lewis as Gerry Conlon . Has anyone noticed the bitter Irony of a film about injustice features one of the greatest injustices commited by the Oscar board voters where they gave that year`s best actor Oscar to a very average performance by Tom Hanks ? No wonder more and more people view the Oscars as a popularity contest . And despite my above criticisms about the facts - or lack of them - IN THE NAME OF THE FATHER can in no way be described as a pro IRA film in the way that THE DEVIL`S OWN or SOME MOTHER`S SON are"
    },
    {
      "username": "genius-15",
      "userUrl": "https://www.imdb.com/user/ur0361107",
      "reviewLink": "https://www.imdb.com/review/rw0323349",
      "warningSpoilers": true,
      "date": "25 July 1999",
      "rate": "",
      "helpful": "62 out of 75 found this helpful.",
      "title": "A Very Sharp Film",
      "content": "What a clever film this was. Quite modest yet remarkably entertaining. Instead of blaring political bias, viewers are treated to a compassionate human drama without the preachings and irritating banter of most other \"social dramas\" (Dog Day Afternoon, All the President's Men, Norma Rae). It's shameful that this film didn't receive at least two academy awards, despite it having been nominated for 7. Now considering that this was the same year that Schindler's List and The Piano, two outstanding dramas, were released, it isnt surprising nor unreasonable that they beat In the Name of the Father for many of the awards.The acting in this film is terrific. Lewis is low key and quite effective as the petty Irish thief Gerry Conlon. Pete Postlethwaite is spectacular as Gerry's father Guiseppe (certainly better than oscar winner tommy lee jones was in the fugitive). Emma Thompson's portrayal of attorney Gareth Pierce received much acclaim, and properly so. Beatie Edney, who had a small part as a wrongfully accused British teenage hippie, was so enamoring that its a wonder we don't see more of her.Of course much of this film is exagerrated and perhaps fabricated for the purposes of entertainment (as all movies which are \"based on a true story\" tend to be) but it's so finely done that it doesn't seem to matter. Some terrific scenes include the beginning, when Gerry and his friends are chased by British soldiers after being mistaken for IRA snipers, the trial in London, the prison scenes (which expose the loneliness and honesty of the characters rather than the crude violence and gang rapes of so many other pathetic prison movies), and of course the powerful ending, where the marvelous dramatic talents of all the actors are evinced in a final crescendo. Be sure to see this film if you haven't, it will definitely stir your emotions and renew your faith in the human spirit. And for those who eschew political films, give it a try anyways, the acting and craftiness outweigh the civic themes."
    },
    {
      "username": "JamesHitchcock",
      "userUrl": "https://www.imdb.com/user/ur2955724",
      "reviewLink": "https://www.imdb.com/review/rw1447755",
      "warningSpoilers": true,
      "date": "14 August 2006",
      "rate": "7",
      "helpful": "15 out of 19 found this helpful.",
      "title": "In the Name of the Father- and of the Son",
      "content": "Although considerable liberties have been taken with historical facts, this film is based upon true events. In 1974 an IRA bomb in a pub in Guildford, England, killed several people. Four young Irish people (\"the Guildford Four\") were convicted and sentenced to life imprisonment. Several others (\"the Maguire Seven\") were convicted of assisting them and sentenced to lengthy prison terms. All were innocent of this crime, and were later exonerated and released from prison when fresh evidence was discovered, particularly evidence that their confessions had been obtained under duress.Although all the main characters are Catholics, some devout, some only nominally so, the title does not have any real religious significance. Rather, it alludes to the film's central relationship, that between Gerry Conlon, one of the \"Four\" and his father Giuseppe, one of the \"Seven\". The two are very different. Gerry is a wild and rebellious young man, unemployed, a petty criminal and a drug-user. He wears his hair long, something fashionable in the early seventies but often regarded by the older generation as the sign of a hooligan. Giuseppe, by contrast, is a conservative figure; deeply religious, hard-working, law-abiding and honest.A key moment comes when Gerry recalls a football match in which he played as a boy. His team won, but instead of congratulating him on his victory, Giuseppe reproached his son for a foul committed during the match. This encapsulates the difference in their characters. For Gerry, winning and success are all that matters. Because he has achieved little success, he has no faith in himself and has always drifted through life. For Giuseppe, adherence to moral values is more important than achieving outward success, and it is these values which enable him to retain his self-respect. Because of these differences in character and outlook, the two men's relationship is a difficult one. Beneath their differences, however, they also have a deep love for one another; Gerry is persuaded to confess to the bombing, after the police have failed to obtain a confession through bullying and violence, by the threat that his father will be killed if he does not. Later, Gerry's love for his father is strengthened by the realisation that although the older man is physically frail, his religious faith and self-belief enable him to cope with the injustice of his plight.Daniel Day-Lewis has been much praised for his performance as Gerry, and he was certainly good, if at times too showy. For me, however, the real star was Pete Postlethwaite as the long-suffering but dignified Giuseppe. The strongest scenes were those between Gerry and Giuseppe; the weakest were those when Gerry, in prison, befriends Joe McAndrew, an IRA man who claims actually to have planted the Guildford bomb. McAndrew is an invented character, and psychologically this did not seem likely; Gerry was, after all, as much a victim of the bomb as those killed and injured by it. Had there been no bomb, there could have been no conviction, wrongful or otherwise, for planting it. Moreover, by associating himself with the IRA's cause, even temporarily, Gerry, although legally innocent, makes himself seem morally guilty.There were other things that did not ring true. I was unsure why Giuseppe's lawyer thought that Inspector Dixon, the policeman who originally investigated the crime, would be responsible for deciding whether her ailing client should receive compassionate parole, or why so much attention was paid to Gerry's alibi that he was in London on the night of the bombing. As the bomb would have had a delayed-action timer, he could easily have returned before it exploded; the \"Horse and Groom\" pub (I used to live in Guildford) is only a short walk from the station, about half an hour by train from London. (The brutal and corrupt Dixon is another invented character; the name may refer ironically to the popular British TV show, \"Dixon of Dock Green\", which featured an honest and decent \"bobby\" named Dixon).It surprises me that some have criticised the film as being \"pro-IRA\". If one were setting out to make a pro-IRA propaganda film, one would not make it about the Guildford bombing, an event in which the IRA cold-bloodedly murdered several innocent civilians without warning. Nor does the film ignore the IRA's violence towards the Irish Catholic community it supposedly represents. At the time of the Guildford bombing, Gerry is living in London, having been forced to flee Northern Ireland by IRA threats; like most terrorist organisations it has a sternly moralistic attitude to all crimes other than those committed by its own members and punishes with mediaeval severity those who, like Gerry, are guilty of petty larcenies. The fact that the \"Four\" and the \"Seven\" were undoubtedly treated unjustly by the British authorities does not retrospectively justify the IRA's crimes of which they were wrongly accused.The film does not attempt to be a comprehensive statement about the Northern Ireland situation- the Unionist community, for example, is not even mentioned. Indeed, given the complexities of that situation, and the even greater complexities of Irish history from which it springs, it would not be possible to make such a statement in a film. Nevertheless, \"In the Name of the Father\" is a very good film, both as a study of father-son relationships and as a warning of the possibilities for injustice inherent in any criminal justice system. 7/10 A goof. In the early scenes, set in 1974, Gerry, while driving along London's Lower Thames Street passes a set of orange and white barriers designed to stop vehicles from entering \"The City\" (London's central financial district). These barriers did not exist in 1974; they were erected following a later IRA bombing campaign"
    },
    {
      "username": "Chrysanthepop",
      "userUrl": "https://www.imdb.com/user/ur3872142",
      "reviewLink": "https://www.imdb.com/review/rw1975316",
      "warningSpoilers": false,
      "date": "14 November 2008",
      "rate": "",
      "helpful": "23 out of 32 found this helpful.",
      "title": "In the Name of the Father and the Truth",
      "content": "Jim Sheridan's astonishingly fantastic 'In the Name of the Father' tells the brutally direct story of a wrongfully accused family who are tortured into making a false confession and imprisoned by the British justice system. Sheridan has a way of telling his stories where he gets straight to the point and does not fear to show the reality of the situation while keeping us viewers at the edge of our seats. The film is based on Gerry Conlan's autobiography where Daniel Day-Lewis plays the central character. Sheridan effectively portrays Gerry and Giuseppe's struggle and fight against injustice and his portrayal of the corrupt British justice system is frightening. Just the idea that people could get away with such things in a country like the UK is chilling and Sheridan skillfully brings that across on screen. Terry George's brilliant screenplay with rich characters and solid dialogues forms a good backbone for the film. I also liked how the humour was infused in a modest dose as not to interfere with the intensity of the story. There are some excellent performances. Daniel Day-Lewis delivers a suitably explosive performance as he breathes fire into the role while Pete Postlethwaite is sublime and equally outstanding as Gerry's father, Giuseppe. Though father and son do have issues to fight over, it is Giuseppe who is Gerry's conscience and Postlethwaite's heartbreaking act really touches the heart. Emma Thompson holds her own and she is simply excellent. The rest of the cast do a superb job (watch out for Tom Wilkinson in a bit role). The soundtrack fits the mood of the film and the cinematography is good, especially in the prison sequences, where it creates that feeling of claustrophobia which gets stronger after Gerry is alone in his cell. I have liked all of Sheridan's ' films that I have seen so far and 'In The Name Of The Father' is another remarkable film from this fine director. It is a difficult movie to watch due to some disturbing themes and scenes (though most of them are rather suggestive it is the idea behind that sends chills down the spine) but it is definitely worth watching."
    },
    {
      "username": "gavin6942",
      "userUrl": "https://www.imdb.com/user/ur1234929",
      "reviewLink": "https://www.imdb.com/review/rw3217491",
      "warningSpoilers": false,
      "date": "9 April 2015",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "History and Court Drama",
      "content": "A man (Daniel Day-Lewis)'s coerced confession to an IRA bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them.This film is a great combination of history and court drama. Sometimes both mix very nicely (as with the Nuremberg trial) and sometimes they do not. Here, we get a nice glimpse at the IRA in Ireland without dwelling on it too much and also get the true story of a family that was wronged by the state for their alleged involvement in terror.Ireland today is not the same place it was a generation ago, but it is not so far removed that this story is \"distant history\" and not important. Heck, Americans should probably know more about it than what they pick up from a U2 song."
    },
    {
      "username": "michelerealini",
      "userUrl": "https://www.imdb.com/user/ur3051873",
      "reviewLink": "https://www.imdb.com/review/rw1187115",
      "warningSpoilers": false,
      "date": "5 October 2005",
      "rate": "9",
      "helpful": "36 out of 47 found this helpful.",
      "title": "Disquieting great film",
      "content": "The movie is based on a true story. Belfast guy Gerry Conlon is suspected of being one of the IRA terrorists responsible for a bomb in Guilford, London, in 1974, which killed several people. He spends 15 years in jail, fighting for his innocence and for truth.After working with Daniel Day Lewis in \"My left foot\", director Jim Sheridan teams again with the actor for this drama. The strong cast is completed by Emma Thomson and Pete Postlewaite. The result is a brilliant, passionate feature which tells about injustice. It's a disquieting film.This is doubtless the most achieved collaboration between the director and the main star. The other pictures as well are very good, but here we have a film of accusation -the story is more involving. Day Lewis performance in \"My left foot\" was awarded with an Oscar, but the actor could have been given the same prize for his play of Gerry Conlon.Strong screenplay, actors and soundtrack -with music of Gavin Friday and Maurice Seezer and songs of Irish stars Bono and Sinead O'Connor."
    },
    {
      "username": "philip_vanderveken",
      "userUrl": "https://www.imdb.com/user/ur3922673",
      "reviewLink": "https://www.imdb.com/review/rw0989655",
      "warningSpoilers": false,
      "date": "1 January 2005",
      "rate": "8",
      "helpful": "48 out of 71 found this helpful.",
      "title": "Perhaps a bit too black and white but still very impressive.",
      "content": "Even though this movie seems a bit too black and white from time to time I must say that it still is an impressive piece of cinema. Too black and white because I sometimes had the feeling that they had left out some parts to make it all a lot easier for the viewer. I can't help believing that Conlon and Hill weren't the nicest guys either, but the movie shows them almost as saints (except for the fact that they steal some lead from the roofs, they never really do anything wrong). Does that mean that this movie isn't any good? Certainly not! It still remains very impressive and the idea that injustice in the name of protecting the country should be allowed is awful and so it is good that at least some movie makers aren't afraid to protest against it.The movie tells the story about Gerry Conlon and his old school friend Paul Hill. They both are small time criminals and because of their own safety they have to live in London for a while. Otherwise they might get shot by the IRA. In London they stay in a community of hippies, but aren't welcomed by everybody. As a bomb explodes in a pub, one of the members from the community goes to the police and accuses them of the crime. They are immediately apprehended, together with Conlon's father, his aunt and her family. What follows is a process full of corruption and false accusations, putting them in jail for many years even though they haven't done anything wrong.The film is very good. It's well acted, well paced and well directed. The story is touching and I never got bored when watching it. Therefor I give it an 8/10."
    },
    {
      "username": "oneflewovertheapocalypse",
      "userUrl": "https://www.imdb.com/user/ur1651004",
      "reviewLink": "https://www.imdb.com/review/rw0323365",
      "warningSpoilers": false,
      "date": "11 April 2004",
      "rate": "",
      "helpful": "39 out of 54 found this helpful.",
      "title": "Powerful and Touching",
      "content": "Name of the Father came out one year before The Shawshank Redemption and is bar none the better film. Shawshank is a great film but Name of the Father has more of human story to it. Daniel Day Lewis is a great actor with more potential now than he did when he won his first Oscar for My Left Foot and since then he has never starred in a film which he has acted badly in. Some of the stories have not been amazing but his acting makes up for it. This was the second time That Daniel Day Lewis and Jim Sheridan have come together to make a film. In all they have done three but Name of the father is by far the best. Pete Postlethwaite is another example of fine acting as he is the best actor in England since who ever was the last greatest actor.Daniel Day Lewis plays Gerry Conlon who is a seventies hippie who doesn't want to grow up. He has had so many troubles at home his fatherGiuseppe played by Postlethwaite decides to pack him off to London for his own safety and not become a lost soul amongst the troubles in Belfast. But when Gerry gets there he might as well wish he never went there in the first place as the trouble from Belfast follows him and before you know it a bomb goes off in a pub near to where he is staying and is not long arrested for the bomb along with his friends and family including his father.From there we are taken into this grieving story of strength, hope, tragedy and family. The story between father and son in jail is more touching and compelling than any love story you will ever see because these two men who have never really seen eye to eye are forced to confront each other's feeling and face up to where they stand in the world. Also Pete Postlewaite reminds me of my own father and my grandfather and yours two. He plays Giuseppe so well so would have thought he was the old guy living next door to you or the man you look up to as a father and spend time with as a granddad. What you have to remind yourself is that the movie is a true story of the Guilford Bombing and the men who paid the price for it. Whether or not you believe Gerry and Giuseppe were guilty of the Guilford Bomb is not the case in the film as it's more about the characters and there trials and tribulations.One film that will always be remembered in my mind about making a difference with your life not matter where you are in the world."
    },
    {
      "username": "evelyn_illa",
      "userUrl": "https://www.imdb.com/user/ur40885399",
      "reviewLink": "https://www.imdb.com/review/rw2842064",
      "warningSpoilers": true,
      "date": "31 July 2013",
      "rate": "10",
      "helpful": "28 out of 31 found this helpful.",
      "title": "Some Reflections On My Country",
      "content": "(English is my second language, so please excuse my language problems:)Yes, I cried when other prisoners threw lighted papers from the window; yes, Daniel-Day Lewis and Pete Postlethwaite were great actors; but other than that, what impressed me most was the complete change of attitudes of the public between the two trials. At first, audience in the court were yelling \"hang these Irish bastards\", they were throwing all their hatred to the Guildford Four, even the judge said \"I wonder why you are not charged as treason\". They were biased, cheated by the prosecutes who fabricated lies to cater to the public, because the loss of 5 lives needed someone to be responsible for. But after 15 years, when the truth was presented, the public went to parade, they plead the court to free the four, they wanted to right the wrong. They were becoming rational, they felt for the innocent, so they acted.But this is not what happens here in China. The government is never transparent to the public, the media is censored so that cases like the Guildford 4 (especially if it is injustice) will never be known to the general public unless you are \"in the business\". Because the public is banning from first-hand information, people are unaware of government's wrongdoings; even if they are aware, there is almost nothing they can do (party monopoly, corruption all lead to this). So they kept silent, pretending nothing ever happened. I once read on a book, saying \"silence is the most terrifying weapon\". Today I have to admit this fact; but I want to say and plea to all my fellow citizens: pretending to be deaf doesn't mean that there is no voice in the society to be heard. They are merely sunk in the indifferent public. So please pay attention to politics, to events taking place in courts. Maybe someday we also will make cardboards with slogans on then and march in streets. Efforts from individuals could gather to really make change."
    },
    {
      "username": "gcd70",
      "userUrl": "https://www.imdb.com/user/ur13887584",
      "reviewLink": "https://www.imdb.com/review/rw1795328",
      "warningSpoilers": true,
      "date": "7 January 2008",
      "rate": "8",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Will stir your soul and disturb you",
      "content": "In 1974 a London pub in the town of Guildford was hit by I.R.A. activists with a terrorists bomb, and no warning was given. Five people were killed and several others maimed and injured in a tragedy which sent shock waves through a then terrified and outraged public who demanded police bring the culprits to justice.Director and co-writer Jim Sheridan (scripting with Terry George) brings us the story of a group of young people from Ireland who were brought forward by police to face the charges of murder that related to the bombing. They were unceremoniously tried and found guilty, then sentenced to between fifteen years and life. Pleading their innocence to an unsympathetic jury and public had got them nowhere, so they were left to fight for their freedom from the inside.As father and son Giuseppe and Gerry Conlon, both Pete Postlethwaite and Daniel Day-Lewis give passionate and outstanding performances as they struggle with both their failed relationship and the battle to prove their innocence. Emma Thompson gives a strong performance too as lawyer Gareth Peirce, the woman who has taken up the appeal. All other cast members are impressive.Sheridan presents a highly charged, emotional drama which tells a horrifying tale in what is a black period in Irish and English history that continues even today. While he perhaps could have shown us more of the people's reaction and the feeling of the time, he instead concentrates on the Conlon's plight and their never ending fight for justice. Due credit must also go to Jim Sheridan for keeping what would have to be an incident and an issue that is close to his heart, very evenly balanced, as both sides are portrayed as equally guilty of terrible and unspeakable acts.Backed up by some very good cinematography, editing and set direction, \"In the Name of the Father\" is certainly a movie that will stir your soul and disturb you. It is truly frightening what men in power are capable of, and even more frightening are the devastating effects they can have on so many people's lives.Saturday, June 18, 1994 - Greater Union MelbourneDirector Jim Sheridan's account of one of the most ruthless bombings undertaken by the IRA is jam-packed with emotion. The tragic, moving story of how the \"Guildford Four\" lost their freedom, and fifteen years of their lives, for something they were never a part of makes for a most upsetting and aggravating film.The powerhouse performances from leads Day-Lewis and Postlethwaite are sensational, as is Emma Thompson's showing as compassionate lawyer Gareth Pierce.Not seeing this film would almost be as grave an injustice as was that which befell these innocent people.Monday, June 12, 1995 - Video"
    },
    {
      "username": "TOMASBBloodhound",
      "userUrl": "https://www.imdb.com/user/ur2326544",
      "reviewLink": "https://www.imdb.com/review/rw1602147",
      "warningSpoilers": false,
      "date": "18 February 2007",
      "rate": "8",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Terrorism hurts everyone.",
      "content": "In watching this fine film, on idea kept running though my mind. That being terrorism often hurts the innocent much more than the declared enemy. In the Name of the Father is a powerful, well-acted drama about terrorism and injustice. And also the love one man feels for his father. Some of the events in this film are factual, and others are not. Despite some liberties taken with history, the film still makes a strong point, however.Daniel Day-Lewis plays Gerry Conlon, a young man falsely accused along with several other friends and family members, of bombing a London pub in 1974. The bombing, performed by the IRA, killed a few persons and wounded several others. Conlon and his friends just happen to be near by when the bombing takes place. Through police torture, Conlon and his best friend confess to the crime, thinking a trial will exonerate them. Trouble is, there had been so many recent bombings that the legal system in Britain was just crying out for a scapegoat. Conlon and four friends are given life sentences. Several members of Conlon's family are also given stiff jail sentences. Even his own father who seems to be the most righteous and kind person imaginable and who never set foot in England at all during the time of the bombing!The film starts out like a shot from a cannon, as we see just how violent and chaotic Blefast was during the early seventies. Just living a normal life looked impossible. If the British troops weren't after you, then the IRA members were. The film also scores when we see Conlon head off to London to presumably make a better life for himself. He and a friend force themselves into a commune and enjoy a brief period of free love and decadence. The film gets very heavy once Conlon is arrested and tortured. And the last hour detailing his time behind bars is just plain somber. We watch his father just sort of waste away with him behind bars while an aggressive lawyer (Emma Thompson) fights to get them out. Pete Postletwaite is exceptional as Gerry's father, and seeing him grow sicker and weak is very difficult for the viewer. The film tries to shift gears down the stretch and show how Conlon has become determined and more radicalized, but these scenes are nothing spectacular. Even the conclusion seems a little anti-climatic, but at least we see some justice finally get done. The acting is very, very good. Lewis is as good as ever, and nobody looks out of their league. There are some historical liberties taken. Gerry and his father never actually lived in the same cell, for instance. Overall, this film will stick with you, though.In watching this film, one cannot help but feel for the victims of terrorism. I have personally not much knowledge of the conflict between the IRA and Britain, except to say that I'm well aware of how long and deep the scars run between the English and Irish peoples. That said, there is simply no excuse for terrorism. Look at how many victims that pub bombing created. Not only those who perished or were injured. That act of terror sent several innocent people to jail and ruined their lives! The British legal system is certainly to blame for sending the wrong people to jail, but would this have even happened if the IRA had not bombed that pub? A similar situation can be seen in the Middle East today. Radical Muslims look to strike out at Western interests, but their actions often hurt scores more other Muslims than any actual Western interests! Will we ever all learn to get along on this planet?8 of 10 stars.The Hound."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw5601952",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Gripping",
      "content": "Powerful drama. I like the bit where they cooked and ate all those sausages o"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3142678",
      "warningSpoilers": false,
      "date": "16 December 2014",
      "rate": "8",
      "helpful": "7 out of 12 found this helpful.",
      "title": "Incredible father and son story",
      "content": "It's 1974. The IRA bombs a pub in Guildford, England. Gerry Conlon (Daniel Day-Lewis) is an aimless petty thief. His father Giuseppe (Pete Postlethwaite) is a straight-arrow soft-spoken man. He and his friend Paul Hill (John Lynch) are in London staying with hippies. They leave the flat when the pub bombing happens. A prostitute drops her keys and Gerry breaks in. The parliament passes the Prevention of Terrorism Act which allows for suspects to be held for 7 days. Gerry, Paul and others are arrested and coerced into false confessions. Giuseppe and other relatives are also implicated. The actual bomber Joe McAndrew (Don Baker) is arrested and tells the police. However the police refuses to admit its mistake. Gerry befriends Joe in prison while ignoring the peaceful faith of his father. Joe becomes the leader of the prison as Giuseppe declines in health. British attorney Gareth Peirce (Emma Thompson) works to free the falsely imprisoned. After Joe burns the lead guard, Gerry saves him and turns on Joe.This is a meticulous telling of a compelling life wrongly convicted. It's a bit up and down at times. The first trial is not the most compelling. The results are preordained and not that compelling. The most compelling is the father son relationship. When Joe get into the middle, it's a great turn in the story. These are two great performances from Daniel Day-Lewis and Pete Postlethwaite. The two of them in prison is a terrific movie filled with emotions and character growth. The final court case is theatrical as heck."
    },
    {
      "username": "dead47548",
      "userUrl": "https://www.imdb.com/user/ur9521536",
      "reviewLink": "https://www.imdb.com/review/rw1790108",
      "warningSpoilers": true,
      "date": "30 December 2007",
      "rate": "10",
      "helpful": "9 out of 13 found this helpful.",
      "title": "A powerful story with one of the best performances of all time.",
      "content": "An emotionally wrenching and immensely powerful true story of an innocent man who is put in prison for fifteen years, after being forced by interrogators to sign a confession out of the threat that they'd kill his father if he didn't, and this man's fight to clear his name and his father's. Due to an incident with the IRA, Gerry Conlon (Daniel Day-Lewis) moves to London and after a chance opportunity to rob a prostitute he returns to his home in Belfast, coincidentally the day after a huge bombing committed by the IRA in London. His best friend, who was with him that night, Paul Hill is arrested and after being forced to confess with a gun in his mouth he lists Conlon and two other friends as members of the IRA. Now known as the Guildford Four, these innocent people were all sentenced to very lengthy jail sentences and, after painful torture, the government plants false accusations on members of Conlons' family including his father Giuseppe (Pete Postlethwaite). Gerry has to deal with pent-up aggression that he has built up against his father for years while also trying to survive in a British prison as an accused IRA member.Even after Joe McAndrew (Don Baker) is arrested and confesses to the police that he was behind the Guildford bombing and the people they have in prison were innocent, Gerry and Giuseppe remain in prison suffering more and more by the day. Eventually Giuseppe begins working with Gareth Pierce (Emma Thompson) to investigate their case and prove the innocence of the Conlons and the other members of the Guildford Four. After Giuseppe dies of natural causes, Gerry gains a new drive to prove their innocence and takes over the task of working with Gareth. The film is a powerful character study of a man put under unimaginable circumstances and has the discipline to rise up and, along with Pierce, prove the innocence of not only himself but of his father and the other three members of the Guildford Four. It's an immensely heart-wrenching, emotional story that had me in tears several times throughout.Highlighting this sensational film is Daniel Day-Lewis who further proves that he is the greatest actor of all time and delivers what I believe is the best performance of his career. Taking on the role of Gerry Conlon requires the ability to subtly flow from a naive, immature young man to a disciplined adult working to clear the name of his father. Along that journey there are several highly emotional scenes that could have felt melodramatic or silly if another actor were portraying the man, but Day-Lewis brings a power to Conlon that no one else could. His brilliance is unparalleled. Pete Postlethwaite and Emma Thompson also deliver fantastic performances that rank among the best of the 90s. In the Name of the Father is a phenomenal film that studies the torture that one man had to go through due to the government and the journey he took to clear his name and the name of his father. It's the best film of 1993, in my eyes and Day-Lewis' portrayal is very high among the best performances of all time."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2858732",
      "warningSpoilers": true,
      "date": "27 August 2013",
      "rate": "9",
      "helpful": "7 out of 14 found this helpful.",
      "title": "Well worth seeing...but I'd sure love to see a follow-up",
      "content": "I am not British nor am I Irish. And, as far as 'the troubles' go, I don't have a very strong opinion one way or another. A lot of crazy stuff went on for so long and there's so much guilt, it's hard to take a side--though I sure hate the idea of terrorism. So, I am not a person with a dog in the fight, so to speak. I just thought I'd mention this so you don't think I had a particular stake in the film.The film is the story of Gerry Conlon, though it also affected his father, the rest of his family and some friends. Back during the heyday of IRA terrorism in the 1970s, the British were obviously very frustrated and were willing to go to some extreme methods to stop it--even if it meant suspending traditional constitutional rights. This is understandable but troubling. But what goes WAY beyond troubling were the methods used by the prosecutors and police to convict a group of people for a bombing--even when it turned out that they knew that the people were probably innocent! The film is essentially a showcase for Daniel Day-Lewis to show off his acting skills. However, the film also had lovely direction and was a first-class project all around. Well worth seeing--and there's a good chance this film might make you feel a little mad."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1494147",
      "warningSpoilers": false,
      "date": "10 October 2006",
      "rate": "6",
      "helpful": "14 out of 33 found this helpful.",
      "title": "An Involving, Sometimes Brutal Story",
      "content": "I might have rated this higher had Emma Thompson had a bigger role. I am a fan of hers, plus I think most people would agree she's an excellent actress, so it was disappointment to see her appear much until the last 15 minutes of the film. That's especially misleading when she gets second or third billing in this movie.Nonetheless, it's an involving true-story of an Irishman, his dad and some of their relatives who are all sent to prison for a bombing they had nothing to do with. Filmmakers LOVE these kind of stories in which they can make their country and police into the bad guys. Here, the British look bad - very bad - as they railroad \"Gerry Conlon\" (Daniel-Day Lewis). The latter makes a convincing hot-headed Irishman, but he's no killer. The tone of the movie softens not in the last half hour as Lewis' character begins to appreciate his father. Until then, it's a rough film that is not always easy to watch and hear because of the accents, some police brutality and corruptness and general group of nasty characters.By the way, despite the billing, Pete Postlewaite is the second star of the film. He doesn't get the recognition he deserves for his acting contribution in this movie."
    },
    {
      "username": "irwina",
      "userUrl": "https://www.imdb.com/user/ur7531212",
      "reviewLink": "https://www.imdb.com/review/rw1192343",
      "warningSpoilers": true,
      "date": "12 October 2005",
      "rate": "10",
      "helpful": "17 out of 21 found this helpful.",
      "title": "'In the Name of the Father': a moving masterpiece",
      "content": "'In the Name of the Father' is a compelling portrayal of the harrowing ordeal faced by Gerry Conlon, his family and friends, who were wrongfully imprisoned for the Guildford Pub bombing in the 1970s. The film is skilfully manipulated to show a myriad of contrasts and juxtapositions, such as when Gerry is being tortured and interrogated in his cell, the police in the hallway are unconcerned as they celebrate someone's birthday with a cake.The framing of shots and camera angles used emphasise the helplessness Gerry and the others experience. There is also a particularly moving scene in which prisoners show their respect when Gerry's father dies by dropping flaming material from their windows, like a waterfall of burning tears.The soundtrack uses music which is carefree or haunting in all the right places, perfectly mirroring the scenes and adding to the mood of the film. The themes of injustice and corruption are heightened through irony in the dialogue, and are representative of the problems faced by Irish Catholics in the 1970s and beyond.'In the Name of the Father' is a beautifully constructed film which is a credit to the actors, direction and production crew.I challenge you not to be moved by this film."
    },
    {
      "username": "hitchcockthelegend",
      "userUrl": "https://www.imdb.com/user/ur16161013",
      "reviewLink": "https://www.imdb.com/review/rw1833129",
      "warningSpoilers": false,
      "date": "4 March 2008",
      "rate": "9",
      "helpful": "5 out of 9 found this helpful.",
      "title": "Stunningly well told story.",
      "content": "In 1974 the Irish Republican Army bombed two public houses in Guildford, England-The Horse & Groom and the Seven Stars. 5 people were killed and 65 people were seriously injured. During the wave of public hatred for all things Irish, the police round up Belfast rogue Gerry Conlon and his mate Paul Hill and interrogate for 7 days with brute force to obtain a confession... This is Gerry Conlon & the Guildford 4's story.This is real powerful stuff that thankfully is directed with careful hands. Director Jim Sheridan is equal in his demonizing of the police and the IRA here because it's crucial for us to focus on the Guildford 4. Focus on the Conlon family, for they are victims of injustice when they have no political, or nationalistic affiliations. He centres in on the relationship between Gerry & his father Guiseppe as they find themselves both wrongly imprisoned. It's that family heartbeat that drives this film on, and it's testament to the makers talents that it never comes across as maudlin, it's all very potent and is the films major axis point.Based on a true story the picture has a finale that will not surprise anyone, but come the last reel you feel emotionally drained, you have come thru the mangler, and myself personally felt both joy and anger in equal measure. Containing brilliant performances from Pete Postelthwaite & Daniel Day Lewis as father & son Conlon respectively, In The Name of The Father is a truly great film that demands not only your head, but also your heart. 9/10"
    },
    {
      "username": "Vartiainen",
      "userUrl": "https://www.imdb.com/user/ur30163554",
      "reviewLink": "https://www.imdb.com/review/rw4582163",
      "warningSpoilers": false,
      "date": "14 January 2019",
      "rate": "6",
      "helpful": "3 out of 4 found this helpful.",
      "title": "About the dangers of giving into your fear and anger",
      "content": "October 1974, London. Young Gerry Conlon (Daniel Day-Lewis) gets arrested by the police. They claim he is an IRA (Irish Republican Army) terrorist and to blame for the bombing in Guildford that killed five people. Gerry maintains that he's innocent, but the police and the people of Britain are hungry for blood. The film is based on real events.As you can imagine, the film is anything but congratulatory towards the society and the justice system of the 70s. The film focuses heavily on Conlon's own personal experiences before and after the bombing, but the film takes it time to get the licks in.Daniel Day-Lewis has earned a reputation as one of the great names in cinema and watching this movie you can certainly see why. It all feels authentic, from the quiet rage to desperation to just giving up, if not outright snapping. I also really liked the performance given by Pete Postlethwaite as Giuseppe, Gerry's father.A heavy movie and makes one appreciate how one has managed to grow in relative peace and quiet. Sure modern Europe has had its own upheavals, but nothing quite like this.If I had to name a negative, I would say that the film is a bit episodic, like many biographical films tend to be. It's better than most I've seen, but the film has to jump around in time a lot and these transitions are not quite as graceful as they perhaps could have been.Still, an interesting movie and a great watch for all fans of historical drama."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2376156",
      "warningSpoilers": false,
      "date": "27 January 2011",
      "rate": "9",
      "helpful": "6 out of 13 found this helpful.",
      "title": "Very moving and exceptionally well acted",
      "content": "In the Name of the Father... what a fine movie! This is a movie that really moved me and continues to do so. It has a stirring story, that carries a great dramatic punch, it is beautifully directed by Jim Sheridan and while a little over two hours it never bored me. The script is lovingly balanced, the film looks beautiful and the emotional punch is definitely there. I loved the acting best of all though. Daniel Day Lewis is highly impressive as Conlon, and while I have seen a few reviews saying Emma Thompson was miscast I thought her performance was fine, if anything I would have liked to have seen more of her. For me, Pete Postlethwaite gives the best performance, he is brilliant as the bemused and hapless father, and if there is a film or role he should be remembered for it is this one. Overall, a perhaps controversial but engaging, moving and wonderfully acted movie. 9/10 Bethany Cox"
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw8806110",
      "warningSpoilers": false,
      "date": "17 January 2023",
      "rate": "7",
      "helpful": "1 out of 1 found this helpful.",
      "title": "A denounce film showing the darker corners of the British legal system",
      "content": "An interesting film in which politics and family life in prison cell share the focus as director Jim Sheridan captures superior acting from Daniel Day Lewis and Pete Postlethwaite , regarding the wrongful conviction of the Guilford Four . Competent story of Gerry Conlon and the Guildford Four illegally imprisoned in 1974 by British officials after a tragic IRA bombing near London . Falsely accused. Wrongly imprisoned. He fought for justice to clear his father's name. In the name of truth... In the name of justice... In the name of love.Stirring and intriguing British Prision movie mostly located into a prison and the facts , of course , speak for themselves . So it is based on real facts , resulting to be a moving and intense flick picture that packs straightforward pace , thriller , tension , sober drama , violence and denounce about the repressive laws existent in the United Kingdom. With an excellent cast , including sensational acting from the magnificent starring Daniel Day Lewis and Pete Postlethwaite . Daniel gives a splendid lesson in how he is able to withstand the weight of the flick by playing an innocent prisoner . And Emma Thompson was accused of pro-IRA sympaties in the British press for her character as the lawyer at law who believed in Conlon's innocence . Adapted from Proved innocent, Conlon's prison memoirs ,reunites Sheridan and Daniel Day-Lewis after My left foot. Not only were the Four , led by Gerry Conlon sentenced to 30-year terms for the bomb of a Guildford pub in 1974 , but Conlon's father served several years of a 12-year term before dying in prison . It's a good film but your attention may wander more than once en route to its explosive and exaggerated finale . There's a long time of the film dealing with prision life , including some atrocities , cruelty and excessive use of force by the guards enjoying impunity for committing any act of violence and torture against the prisoners, these happenings -despite a few thrilling incidents- convey boredom rather than suspense .Provoking and thrilling screenplay by Terry George and Jim Sheridan himself , with some regular stereotypes about prison genre . Appropriate cinematography by cameraman Peter Bizious who photographs splendidly the cold and dark interiors from prison. Sensitive and rousing musical score by Trevor Jones , including a tense leitmotif , adding original songs by U2's Bono and a haunting song theme sung by Sinead O'Connor . This dramatic gripping yarn was stunningly directed by Jim Sheridan . This good professional has directed notable films, such as : Brothers , Get Rich or Die Tryin' , In Amrica , Secret scripture , The field , 11th Hour and My left foot . In 1995 he wrote and produced Some Mother's Son, which was directed by Terry George. In 1997 he wrote, produced and directed The Boxer and in 1999 he produced Agnes Browne, directed by and starring Anjelica Huston. He was also executive producer of Borstal Boy, On The Edge and Bloody Sunday. And he has directed seven actors into Oscar-nominated roles: Brenda Fricker, Samantha Morton, Djimon Hounsou, Pete Postlethwaite, Richard Harris. Emma Thompson, and Daniel Day-Lewis. Rating : 7/10. Above average . Worthwhile watching."
    }
  ],
  "errorMessage": ""
}