{
  "imDbId": "tt0058946",
  "title": "The Battle of Algiers",
  "fullTitle": "The Battle of Algiers (1966)",
  "type": "Movie",
  "year": "1966",
  "items": [
    {
      "publisher": "Village Voice",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "100",
      "content": "A prototype of news-footage realism, the film makes shrewd use of handheld sloppiness, misjudged focus, overexposure, and you-are-there camera upset; the payoff is the scent of authentic panic."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/2004/0109/p17s01-almo.html",
      "rate": "100",
      "content": "Like all masterpieces, it speaks to later ages as powerfully and intelligently as to its own."
    },
    {
      "publisher": "Los Angeles Times",
      "author": "Kenneth Turan",
      "link": "https://www.latimes.com/entertainment-arts",
      "rate": "100",
      "content": "Achieves its success through a combination of attitude and technique, uniting, to exceptional effect, a way of viewing the world morally while looking at it physically."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "https://classifieds.chicagoreader.com/",
      "rate": "100",
      "content": "It's one of the best movies about revolutionary and anticolonial activism ever made, convincing, balanced, passionate, and compulsively watchable as storytelling."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Owen Gleiberman",
      "link": "",
      "rate": "91",
      "content": "Nearly four decades ago, Pontecorvo anatomized the very form of modern terrorist warfare: the hidden cells, the cultish leaders, the brutish cycle of attack and counterattack."
    },
    {
      "publisher": "New York Magazine (Vulture)",
      "author": "Peter Rainer",
      "link": "",
      "rate": "90",
      "content": "What reveals Pontecorvo as an artist, and not simply a propagandist of genius, is the sorrow he tries to stifle but that comes flooding through anyway--the sense that ALL sides in this conflict have lost their souls, and that all men are carrion."
    },
    {
      "publisher": "L.A. Weekly",
      "author": "Ella Taylor",
      "link": "",
      "rate": "90",
      "content": "A classic of politically engaged filmmaking, based on a book by Saadi Yacef, a former FLN leader who also produced the picture and played a version of himself."
    },
    {
      "publisher": "Washington Post",
      "author": "Ann Hornaday",
      "link": "",
      "rate": "90",
      "content": "The greatness of The Battle of Algiers lies in its ability to embrace moral ambiguity without succumbing to it."
    },
    {
      "publisher": "TV Guide Magazine",
      "author": "",
      "link": "",
      "rate": "80",
      "content": "What makes the movie's power creditable is Pontecorvo's ability to present combatants on both sides as multidimensional, nonheroic human beings, even though it's obvious where the director's own sentiments lie. (Review of original release)"
    },
    {
      "publisher": "",
      "author": "Variety",
      "link": "https://variety.com/1965/film/reviews/the-battle-of-algiers-1200421020/",
      "rate": "80",
      "content": "It's a dedicated effort with importance as a 'document.' (Review of original release)"
    }
  ],
  "errorMessage": ""
}