{
  "imDbId": "tt0058946",
  "title": "The Battle of Algiers",
  "fullTitle": "The Battle of Algiers (1966)",
  "type": "Movie",
  "year": "1966",
  "items": [
    {
      "username": "Chris Knipp",
      "userUrl": "https://www.imdb.com/user/ur1501216",
      "reviewLink": "https://www.imdb.com/review/rw0088316",
      "warningSpoilers": true,
      "date": "23 February 2004",
      "rate": "",
      "helpful": "226 out of 242 found this helpful.",
      "title": "No winners",
      "content": "Perhaps no other cinematic depiction of revolt against colonial rule is so detailed, vivid, and specific as the 1965 Battle of Algiers (La battaglia di Algeri, just reissued in a new print and having limited distribution in the US). It's a vivid and very specific recreation of the insurrection against the French in Algiers in the late Fifties that shows how the French systematically eradicated that insurrection. It's also a story repeated with variations in dozens of parts of the globe now, as then. But as I'm not the first to note, it's neither a partisan tract nor a user manual. It was therefore foolish of the Pentagon to watch it recently as if tips on how to control Iraqi `resistance'/'terrorism' were to be found in it, and it has been equally foolish of the Black Panthers or other revolutionaries to watch it seeking tactical information for their struggles. Those tactics did not succeed; but neither did the effort to quell the independence movement: the French won the battle but lost the war. A process that might have proceeded peacefully in a matter of months, takes years to happen. The film documents the sad foolishness of solving conflicts with violence, the maximum loss and suffering on both sides and the protraction of the inevitable outcome. The insurrection The Battle of Algiers describes was effectively quelled through the leadership of the bold, methodical French Colonel Mathieu, who as we see succeeds in eliminating the organizational structure of the resistance, `triangle' by `triangle', using torture to ferret out names and locations of the autonomous `terrorists'/'partisans,' then killing the `head' of the `worm' their structure represents so it can't `regenerate.' Once this happens, after a merciless French campaign following a general strike, the sympathizers in the majority Algerian population are totally demoralized; but two years later a vigorous national independence movement `suddenly,' `spontaneously,' springs forth, and not long afterward France has to grant Algerian independence. It's at this point, rather than at the moment of Mathieu's momentary triumph, that the film ends. Gillo Pontecorvo undertook his masterpiece after prodding from the resistance leader, Saadi Yacef, but he made a film equally sympathetic toward and critical of both sides. We see as much of the French dissection of the situation and repression of it (by the police chief, then Colonel Mathieu) as we see of the `terrorists'/'partisans' planning and execution of their actions. We see Colonel Mathieu as an appealing macho hero with moments of noble fair play, a shades-wearing, cigarette puffing veteran who moves around with clarity, honesty, and panache; he himself has a `partisan' background. The `terrorist'/'rebel' leaders are serious, intensely committed men of various types, from the sophisticated intellectual to the young firebrand. There are no `heroes' here; or, alternately, if you like, they're all `heroes.'Mathieu appears before the press beside the captured `rebel'/'terrorist' leader - an unusual move in itself - and expresses his respect for the man's courage and conviction. The `rebel' leader in this scene is eloquent in defending `terrorist'/'rebellion' methods such as the use of baskets filled with explosives in public places. `Give us your bombs and we'll give you our baskets.' Mathieu for his part effectively explains to the journalists the necessity of torture to short circuit the `rebellion'/'terrorism'. After this explanation, the film, typically systematic at this point, begins showing a series of tortures of Algerians being carried out. The first image we see in the film is the shattered face and body of the small, tortured Algerian man who's broken down and revealed where Ali `La Pointe,' the firebrand, the last remaining leader, is hiding. Then we see the `terrorist'/'terrorist' leader Ali and his closest supporters trapped like deer in their hideaway, their faces soft and beautiful. The splendid black and white photography works like William Klein's Fifties and Sixties images (he's one of the key visual commentators of that period stylistically) to powerfully capture the edgy soulfulness of the North African people and their gritty Casbah milieu. Much of the film's power comes from the way Pontecorvo was able to work, through Saadi Yacef, directly in the Casbah among the real people - as Fernando Meirelles worked in the favelas of Brazil recently with local boys to forge the astonishing City of God.The voices, which are dubbed, as was the fixed Italian filmmaking style, work somewhat less effectively because of obvious disconnects between mouth and sound at times, but the French is so analytical and the Algerians' Arabic so exotic-sounding (even to a student of Arabic) that they work, and the insistent, exciting music composed by Pontecorvo himself in collaboration with Ennio Morricone is a powerful element in the film's relentless forward movement.The fast rhythms of the editing are balanced by the stunning authenticity of the hundreds of Algerian extras who swarm across the screen: it's in the crowd scenes that The Battle of Algiers really sings. There are many superb sequences of street fighting, of people massing at checkpoints, of the French victims innocently assembled in public places; and like an exhilarating coda there is the scene of joyous victory as Algerians celebrate their independence in the last blurry moments. This is a film (again, like City of God) of almost intoxicating -- and nauseating -- violence, complexity, and fervor. Pontecorvo's accomplishment, though, is the way through showing the leaders analyzing and debating the action he freezes any impulse toward partisanship in its tracks. The evenhandedness of the coverage works a Brechtian `Alienation Effect' so you don't get caught up in rooting for one side or the other.The sequence of three pretty Algerian women carrying out an operation is a particularly memorable one -- but only one among many. First they take off their burqas and cut their hair and doll themselves up French style and then they get past the checkpoint into the French quarter to leave handbags full of explosives in a bar, a dance club, and an airport lounge. Again close-ups of faces in the bar and the jive dancers with jaunty jabbing elbows in the club show a brilliant use of image and classic editing: first the innocent, vulnerable faces, then the explosions. Here our sympathies for the French victims are fully awakened. Another sequence of Algerians removing bodies from a building has all the power and sadness of Christ's Passion. There's no point where as in a conventional thriller we feel excitement and sympathy for the perpetrator, because we see the cruelty of the perpetrator and the humanity of the victim every time. The Battle of Algiers is a final triumphant use of Italian cinematic neorealismo. The killing is observed neutrally, but with sadness, as part of a stupid game caused by ignorance and played out compulsively when a political settlement would have been infinitely better - a stupid game observed with astonishing zest. Revived thirty-five years later in a new 35-mm. print, its grainy beauty pristinely vivid, The Battle of Algiers remains a superbly made machine that plays out the addictive game of `terrorism,' repression, torture, revolt, and full-fledged insurrection as effectively now as when it was first issued. Like any classic, it's of its time and of all time. There's a lesson here, but it's not for partisans or colonialists: it's for all people."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw7192897",
      "warningSpoilers": false,
      "date": "3 August 2021",
      "rate": "10",
      "helpful": "32 out of 33 found this helpful.",
      "title": "It's hard to make a good movie, even harder 2 make a good movie wth historical authenticity bt the hardest of all is 2 make a good movie with non-professional actors who had..",
      "content": "..who had lived through the real battle.Director Pontecorvo and cinematographer Marcello Gatti are true geniuses who amazingly filmed the movie in black and white and experimented with various techniques to give the film the look of newsreel and documentary film and that too making it an engrossing n enlightening experience.Although the rebels lost the Battle of Algiers, they won the Algerian War n their freedom from the French colonial regime.This movie showed the impact of colonialism on daily lives.The guy who played Ali is noteworthy, one of the rebel female has a sharp contour cheeks and the character lil Omar will always be remembered.The torture of the rebel prisoners is the most poignant relevance to the recent ongoings worldwide.The ironical aspect is that of the Colonel, who himself suffered torture by the Nazis in a concentration camp, now torturing common civilians to obtain information."
    },
    {
      "username": "JohnDeSando",
      "userUrl": "https://www.imdb.com/user/ur1391596",
      "reviewLink": "https://www.imdb.com/review/rw0088319",
      "warningSpoilers": false,
      "date": "13 May 2004",
      "rate": "",
      "helpful": "106 out of 126 found this helpful.",
      "title": "An unforgettable study of occupation and defeat.",
      "content": "In 1962 after more than 130 years of French colonial rule, Algeria became independent. Gillo Pontecorvo's `Algiers' shows the decade leading to that liberation in a powerful story about Muslims asserting their rights through violence, hiding, and plotting in the Kasbah, a demiworld of narrow, winding, seemingly endless alleys that are the only protection the rebels have from the eyes of the French. The re-release of the 1965 black and white film is a convincing story of a people who do not want to be occupied and will give their lives so their families can one day be free.The story centers on a couple of Muslim leaders, the charismatic Col. of the French forces, and the bombings and shootouts that at one point averaged just over 4 per day. The film's sympathy is for the Muslims, but the Colonel has moments of reflection that could be sympathetic, especially with the revelation that he was a member of the resistance in WWII and may have suffered in a concentration camp. The director shows the influence of Italian neo-realists like Roberto Rossellini (`Paisan') by shooting in documentary style on location, using non-actors (except for the Colonel), and generally avoiding an agitprop angle.But the film's sympathy in the end belongs to the occupied people. When 3 rebel women change appearance to look French, infiltrate, and plant bombs, the irony obvious to American audiences in their current struggle is a tribute to the strength of the narration and characterization and the universal dislike of occupation and subjugation.The torture of the Muslim prisoners is the most poignant relevance to the recent scandal in Iraq. The Colonel's justification for the practice to gain life-saving information is classic `ends-justify-the-means' logic still being used by great nations. In fact, the Pentagon reportedly had seen this film during the first days of the second Iraq War; some say they learned nothing from the film, which is an unforgettable study of occupation and defeat."
    },
    {
      "username": "Tony43",
      "userUrl": "https://www.imdb.com/user/ur2881590",
      "reviewLink": "https://www.imdb.com/review/rw0088312",
      "warningSpoilers": false,
      "date": "30 January 2004",
      "rate": "",
      "helpful": "249 out of 293 found this helpful.",
      "title": "Should be mandatory viewing for every American",
      "content": "\"Battle of Algiers\" is simply one of the greatest films every made. If film making can be about truth as well as fantasy, then a movie that includes a title card telling viewers that there is not one foot of documentary or newsreel footage in it must deserve viewing.\"Battle of Algiers\" contains scenes that seem so real, you suspect that they couldn't have been staged. When three Algerian women come down from the Casbah to plant bombs in the French quarter of the city, you can almost cut the tension with a knife. When the bombs go off, you think they must have been real bombs. And when you see the devastation they leave in their wake, you cannot fail to be moved. The massive rebellion in the streets at the end of the film also seems so real, you sit wondering how many extras must have been injured filming those scenes.\"Battle of Algiers\" combines brilliant photography, crisp direction, an intriguing plot and some very fine acting. Throw in a terrific music score, splendid editing, impressive special effects and the best example ever of docudrama style production and you have a masterpiece of film making.But film making is not nearly as important as human life and no film in general release today says more about America's current involvement in the middle east and many other parts of the world than this picture about the French in Algeria, made more than three decades ago.Every American should view this film, then think about our current occupation of Iraq."
    },
    {
      "username": "Sigmund",
      "userUrl": "https://www.imdb.com/user/ur0108078",
      "reviewLink": "https://www.imdb.com/review/rw0088292",
      "warningSpoilers": false,
      "date": "11 August 1999",
      "rate": "8",
      "helpful": "97 out of 113 found this helpful.",
      "title": "Excellent movie",
      "content": "I ask myself why we never see these kind of movies on TV, instead of airing again and again the same old lethal weapons, jurassic parks, and other similar stuff? This is real cinema, this is why it is considered a form of art!With the metaphysical crudeness of black and white, the dramatical facts of the Algerian rebellion against the French are accounted. The movie has the realistic appearance of a chronicle. And there are tons of intellectual honesty, too. I mean that there are no white hats VS black hats. You can see terrorists troubled as they are about to leave a bomb in a cafe. Policemen who struggle to save an arabian child from being killed by outraged crowd. Most of all, I like the frank words of Colonel Mathieu about the \"bad methods\" he's using during interrogations... Watch the movie and you will know."
    },
    {
      "username": "Bobbyh-2",
      "userUrl": "https://www.imdb.com/user/ur0323948",
      "reviewLink": "https://www.imdb.com/review/rw0088288",
      "warningSpoilers": false,
      "date": "6 September 2001",
      "rate": "",
      "helpful": "82 out of 97 found this helpful.",
      "title": "Great war movie? Yes---and maybe the best POLITICAL movie ever.",
      "content": "I wish I could locate a videocassette of this film--subtitled, not dubbed. The first time I saw it, I was a little put off by what I thought was a pompous disclaimer that \"not one foot\" of documentary footage had been used. But, in light of the finished product, it's a remarkable statement. If a film has better captured the harsh and ugly realities that are an inevitable part of a true revolutionary movement, I never saw it. It is greatly to its credit that one never gets a sense of \"good guys vs. bad guys\" here--only of people trapped in a truly impossible set of circumstances, from which no escape is possible without confrontation and bloodshed. It was depressing to see this movie in Berkeley in the early 70s, and hear the audience cheer the \"heroic\" Algerian revolutionaries while booing the \"villainous\" French, in view of the great pains that had been taken to present a balanced viewpoint. This film is thrilling, heartbreaking, thought-provoking, and beautiful--sometimes by turns and sometimes all at once. If you haven't seen it and it show up anywhere in the vicinityh, drop everything and go--and pray that it's subtitled and not dubbed. (There are dubbed prints and, as is usually the case, dubbing pretty nearly wrecks it.) This is a masterpiece."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6210560",
      "warningSpoilers": false,
      "date": "27 October 2020",
      "rate": "9",
      "helpful": "23 out of 29 found this helpful.",
      "title": "The Hypocrisy of Occupation...",
      "content": "You will struggle to find a better argument to dissuade budding and existing occupiers of territory they have no legitimate claim to embarking on, or continuing with their despotic occupations of populations and their lands. The people of Algiers demonstrate as determined a will to overthrow their oppressors as their oppressors had demonstrated just over a decade previously in their fight to regain their freedom from tyranny. It is however, the gripping presentation of a reality into a thoroughly convincing and believable portrayal of that reality that grabs the audiences attention, giving it longevity, linking it to future conflicts, keeping it relevant. It leaves you questioning what you would have done under the same or similar circumstance, while juggling the difference in semantics between freedom fighter and terrorist and considering the situational similarities that currently exist in the world today."
    },
    {
      "username": "Spuzzlightyear",
      "userUrl": "https://www.imdb.com/user/ur0003136",
      "reviewLink": "https://www.imdb.com/review/rw0088293",
      "warningSpoilers": false,
      "date": "7 September 1999",
      "rate": "10",
      "helpful": "67 out of 90 found this helpful.",
      "title": "A Brilliant War Film...",
      "content": "Just when I thought I was starting to hate every movie in sight, I had the amazing priveledge to watch \"the Battle Of Algiers\" which is this amazing account of the oppression of the Algierian people by the French in the 1950's. When the movie starts, we see 4 people hiding from the French Army. Then all of a sudden, this amazingly haunting music starts, and we're told the story in flashback of how the Algierian people tried to revolt against the French Soldiers.From what I understand, the movie uses no documentary footage, which is amazing as some of the scenes in the movie must have taken a great deal of effort to produce., There are some pretty amazing crowd scenes and the explosion scenes are just breathtaking.Also, I guess some of the actual revolutionaries are in the film as well. They are pretty hard to point out as all of the acting here is amazing, very realistic.So, looking for a war movie? Dammit, don't go for Private Ryan, go to Algiers."
    },
    {
      "username": "ryzzard",
      "userUrl": "https://www.imdb.com/user/ur0561130",
      "reviewLink": "https://www.imdb.com/review/rw0088294",
      "warningSpoilers": false,
      "date": "21 February 2000",
      "rate": "10",
      "helpful": "147 out of 156 found this helpful.",
      "title": "A savage war of peace.",
      "content": "An historian writing about the Algerian war against the French colonial authorities entitled his book \"A Savage War of Peace\". \"The Battle of Algiers\" provides many answers to that enigmatic title. It does not attempt to show us the entire war but centers on the city of Algiers. Even though you are told at the beginning that no documentary footage is used it is at times hard to believe as many of the images you see have a stark and often unsettling reality to them. Considering that this was a co production between Algeria and Italy the film is remarkable in that it does not turn itself a political tirade by taking sides. Instead the camera is a sort of neutral observer allowing us to witness events that spiraled from individual demonstrations to a full scale war of savage intensity. French officers who fought the Nazis a few years before degenerated into the mode of their former enemy while Algerians had no problems exploding bombs that would kill their own people. The camera shows no heros or villains but humanity in its darkest forms. This is a powerful film with superb direction and cinematography. It truly is one of a kind and once seen will never be forgotten."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1884005",
      "warningSpoilers": false,
      "date": "31 May 2008",
      "rate": "10",
      "helpful": "24 out of 33 found this helpful.",
      "title": "Powerful and Impressive Masterpiece",
      "content": "In 1954, the National Liberation Front of Algiers shots many French policemen beginning a movement for the independence of their country; in return, the Chief of Police plants a bomb in the Arab quarter, killing many dwellers. The NLF sends three women with bombs to two bars and the Air France office in the European quarter, killing many people. The French government sends the military forces under the command of the abusive Colonel Mathieu (Jean Martin) that does not respect the human rights and uses torture to destroy the NLF command. In 1962, the Algerians finally achieve their aimed independence.\"La Battaglia di Algeri\" is a powerful and impressive masterpiece about the fight that happened in Algiers in the period between 1954 and 1962 between the Algerian resistance and the French military forces. A couple of months ago I saw \"Mon Colonel\", another magnificent movie about this dark period of the mankind history. In both movies, we see no difference between the methods used by French in Algerian, or the Nazis in World War II, or the South American's dictatorships in the 60's, 70's and 80's, or by the American in Iraq, of the Chinese in Tibet. \"Liberty, Fraternity, Equality for us, but torture and abuse of the human rights for the others\" should be the correct sentence applicable to most nations. Therefore the writing of Machiavelli in \"The Prince\" about the behavior of the \"princes\" along history could be updated to the disrespect of human rights by powerful nations against weakest ones in the name of their best interests. This movie is impressive because it seems to be a documentary, with grainy cinematography and non-professional actors, in a perfect contemporary Neorealism. I am not familiar with the work of director Gillo Pontecorvo, but I really believe that this movie is his masterpiece. My vote is ten.Title (Brazil): \"A Batalha de Argel\" (\"The Battle of Algiers\")"
    },
    {
      "username": "jazzest",
      "userUrl": "https://www.imdb.com/user/ur2457681",
      "reviewLink": "https://www.imdb.com/review/rw0088306",
      "warningSpoilers": false,
      "date": "4 October 2003",
      "rate": "8",
      "helpful": "53 out of 69 found this helpful.",
      "title": "Masterpiece with Historical Accuracy",
      "content": "Capturing a historic incident/moment with extraordinary accuracy makes a film truly beautiful, painful, and masterful. With the tradition of Italian Neo Realism and French New Wave - i.e. shooting in location and casting nonprofessional actors, The Battle of Algiers harshly seals the ugly realities of both French Legion and Algerian Guerillas - i.e. indiscriminate bombs, tortures, and scapegoats. Ennio Morricone composed one of his early successful scores."
    },
    {
      "username": "lastliberal",
      "userUrl": "https://www.imdb.com/user/ur2171244",
      "reviewLink": "https://www.imdb.com/review/rw2220749",
      "warningSpoilers": false,
      "date": "14 March 2010",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "We aren't madmen or sadists, gentlemen. We are soldiers and our only duty is to win.",
      "content": "This film received Oscar nominations in 1967 and 1969. First time I have ever seen that.It was nominated in 1967 for Best Foreign Language Film, losing to A Man and a Woman; and was nominated again in 1969, when Gillo Pontecorvo was nominated for Best Director, and he was nominated along with Franco Solinas for Screenplay.It shows up on many Top Ten lists as it illustrates the timeless march of men fighting for their basic human rights and freedom. It could be a film about the West Bank or Afghanistan, or any other locale where men struggle to be free. It just happened here to occur in Algeria. This is a timeless film about freedom and the horrors of war.One of the interesting aspects of this film is how real it looks and feels. This is done without using stock footage. It was filmed that way, and presents a picture of war that is hard to stomach. It will make all other so-called \"war movies\" seem like cartoons.Jean Martin as Col. Mathieu was outstanding, especially when he was defending the use of Bush-Cheney tactics to defeat the Algerians.One has to realize watching this film that the Algerians didn't like being occupied by the French any more than the French like being occupied by the Nazis or Iraq likes being occupied by America."
    },
    {
      "username": "Epaminondas",
      "userUrl": "https://www.imdb.com/user/ur4453273",
      "reviewLink": "https://www.imdb.com/review/rw0987933",
      "warningSpoilers": true,
      "date": "27 December 2004",
      "rate": "10",
      "helpful": "28 out of 35 found this helpful.",
      "title": "Best historical film ever?",
      "content": "Battle of Algiers might well be the best historical film ever. It stands out as a splendid work of art, as an extremely accurate depiction of a specific time and place, as a political hymn to independence, and as a thought-provoking philosophical reflection on violence, and on the relationship between ends and means.It depicts the crucial years 1956-1957 in the Algerian war of independence from French colonial rule: the leaders of the independentist FLN decide to make Algiers a battlefield through strikes and terrorism in order to shake colonialism and to unite Algerians. The French respond to this urban guerilla with a ruthless control of space, separating European and Arab (the 'casbah') parts of the city, and with a brutal hunt of the FLN leaders through the torture of lesser militants. The French paratroops under gen. Massu, col. Bigeard and cdt. Aussaresses (blended in the film into a synthetic and fictitious character, col. Mathieu) eventually 'win' the battle of Algiers, but they end up 'losing' Algeria, as their repression has only fueled nationalism. The film therefore ends with the vision of Algerian crowds demanding independence ('Istiqlâl') as they march through the streets of Algiers in 1960.While this is an accurate enough analysis of such a complex war (even though interestingly de Gaulle is absent from the film as it intends to show how independence was conquered, not handed from above by French authorities) it is also a metaphor, as the film works on many different levels.It is a masterpiece of editing and cinematography. The combined use of space and music is stunning: when the french paratroops take possession of the Casbah, literally filling up the frame, gaining control of the streets, rooftops, hallways, courtyards, their superbly choreographed movements are underlined by a haunting theme by Morricone & director Pontecorvo. In these sequences he rivals not only Rossellini but Eisenstein.It is also strongly influenced by the New Wave in its manner of filming faces of protagonists. Some of the most beautiful moments in the film (as the beginning in Ali's hiding hole, or the scenes before the explosions in the bars) consist of protagonists' faces, victims, perpetrators, bystanders, shot in close up, in a beautiful black and white, without comment or voice-over: their common humanity is shown as well as the determination, the inner flame of those fighting for independence.I would disagree with other reviewers saying the movie is is unbiased: the film was commissioned and encouraged by the new-born Algerian state, and Yacef Saadi, a leader in the war of independence appears in prominent role. While the violence of both sides is coolly examined, the film justifies that of the Algerians, if only by showing (in a slightly dishonest way) that it always responds to the violence of the French. This question of precedence (who started to be inhuman?), though in the end quite pointless, has long poisoned mutual understanding between French and Algerian memories of the war. Another bias, explained by the FLN financing and staging, is the almost complete absence in the film of the middle ground, those neither in the terrorist FLN or in the paratroops, desiring to live in peace. They have existed, in both sides, as the examples of writer Albert Camus and his friend Mouloud Ferraoun show. This is quite understandable as it might not fit in the epic text depicted in realistic manner by Pontecorvo. However, in the film, the Algerians that are not committed to war are shown to be gangsters and pimps: this is a minor flaw of the film and its only touch of propaganda.All that said, the film is a stunning visual, historical and ethical masterpiece. Sadly and ironically, it capture a fiery desire for liberty at the very time (1965) a military coup by Boumediene overthrew Ben Bella in Algeria, repressing liberties for the decades to come. Most of all, it is one of the most potent depictions of and reflections on violence (in the twin and extreme forms of terrorism and torture) to be seen on screen.The most powerful image of the film remains the vision of a FLN militant broken by torture and forced to confess the hiding place of his chief. His haunted look, exhausted stance, empty eyes, grotesquely dressed in a paratroops' uniform, stand as an indictment of colonialism."
    },
    {
      "username": "mbouchagour",
      "userUrl": "https://www.imdb.com/user/ur60384528",
      "reviewLink": "https://www.imdb.com/review/rw3267225",
      "warningSpoilers": false,
      "date": "29 June 2015",
      "rate": "9",
      "helpful": "45 out of 58 found this helpful.",
      "title": "I can't be objective !",
      "content": "As Algerian, I watched this movie 2 times a year for 20 years, this movie is a part of my story. It helped me to put imagines and sounds to stories I heard from my teachers, cousins, as my grand-parents and my parents still can't talk about that horrible war.By now, as I'm growing old, I understand that this movie is not the 'Truth', it was 'war', and in a war even good people can do horrible things. And I know what I'm talking about as I was there, in Algeria, during the 'Dark Decennial', while we were fighting against our own people whom turned terrorists in the name of Islam.So for those who will watch this film, please just remember not to judge any of the parties : Algerian /or/ French. It was a war and no war is nice, people die, and those who survive will suffer. Films/art are a form of exorcism for that pain we keep silently inside.I like this movie, because I saw tears in the beautiful green eyes of my grand mother every time she watched it and it always gave her a good opportunity to cry for my grand father that she lost during the war. I saw my father crying for his father that he never knew, and saw him also being closer to his mom because. For me, this movie will always be a 'Good movie to watch in Family'"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2965436",
      "warningSpoilers": false,
      "date": "21 February 2014",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Great and important movie",
      "content": "It's from 1954 onwards in Algeria and there's revolution in the air. This docudrama takes on history from both sides. Col. Mathieu leads the french forces. They are using all methods to try to stop this french colony from the hands of the revolutionaries. On the other side, Ali is an illiterate hustler always in trouble with the cops. He is recruited into the revolutionaries after spending 5 months in prison.This is most notable for how realistic this movie is. Taking the era into account, this is taking realism to the next level. It is so real that everybody should be reminded that this is all fictional. This was shot in the real locations, but all of it was staged. It is unflinching in its depiction. That is its greatest asset."
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw3686520",
      "warningSpoilers": false,
      "date": "16 April 2017",
      "rate": "",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Superb Treatment of Difficult Material",
      "content": "Superbly done in all aspects. In years of movie viewing I've never seen staged events look so realistic. I don't know how Pontecorvo and Co. managed it, but they did. I first saw the movie in a packed LA theatre in 1967. The place absolutely rocked when the FLN vowed to continue their struggle— shades of the anti-Vietnam war then shaping up. I guess the colonial French learned their lesson in Vietnam and Algeria, a lesson neo-colonial Americans are still learning. Anyway, there's not much I can add to the hundreds of reviews already in place. That is, except to say that what stayed and still stays with me are the peasant faces, etched by years of hardship. Plus, the native quarters with their claustrophobic passageways that resemble a prison more than a neighborhood. No way Hollywood can duplicate these. Thanks Mr. Pontecorvo and all the others for a world-class lesson in movie making and difficult truths."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw2222053",
      "warningSpoilers": false,
      "date": "16 March 2010",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Much Like Today",
      "content": "As this film unfolds, we have a sense that things are happening before our very eyes. The movie is so documentary-like as to seem like a stationary camera has been set up in the midst of turmoil. The French imperialists are the reason all this is happening. Obviously, years of \"rule\" make the day to day existence hard to change. Do all the Algerians want an overthrow of French rule? Probably not. Maybe not even a majority. As the rebels blow up restaurants and airport waiting rooms, the police are torturing the rebels. It becomes a cesspool of the lowest form of human degradation. And yet, what else can be the answer when a single entity has such a foothold and ultimate military power. As is usually the case, attrition does the job. With our current situation in the Mideast and Afghanistan, will we find ourselves reproducing what happened to the Russians? Unfortunately, there are no easy answers because the fight is against oppression. The kicker is that there is so much human and economic expense involved in these situations that often it takes centuries. We need to ask ourselves what is gained and one cannot put a price on the human soul. This is a masterpiece of movie-making should be seen by any who think revolutions are clean and the enemy is easy to define."
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw1060159",
      "warningSpoilers": false,
      "date": "14 April 2005",
      "rate": "4",
      "helpful": "40 out of 91 found this helpful.",
      "title": "Cold, brutal and hard to connect with",
      "content": "The problem with films like The Battle of Algiers is that while they offer a stark portrait of a true-life event, they also lack any kind of emotion and so connecting with the film is not easy. The film follows the events of the revolution in Algiers, but doesn't give you much of a story as to why it happened and so prior knowledge of the event is required from the viewer. I know practically nothing about Algiers, so this wasn't a very good aspect of the movie for me; and through it's lack of emotional connection; I can't help but think I'd have been better off watching the news or a documentary on the subject. The Battle of Algiers is unpleasant throughout, and we watch as coffee shops are blown up and the French Foreign Legion tortures the locals. Like Henry: Portrait of a Serial Killer, this film begs a question of it's viewer - namely, why are you watching this? However, while Henry had the whole 'slasher' craze on it's side to help answer the question - the events in this film are far more brutal than those in Henry, and are also on a far larger scale. Not to mention far more tragic, as they definitely did actually happen. Couple this with it's lack of an emotional side; and we have the question; indeed, why ARE you watching this? It's not entertainment, that's for sure.The cinematography is very bleak and offers a stark portrayal of the events that the film is depicting. This is the film's major strong point - it looks very nice. None of the cast stands out individually, but the ensemble comes together nicely and the acting is extremely realistic, so much so that what is being depicted could easily be documentary footage. The main backbone of the film's substance focuses on the common 'war has no winners' theme that a hundred films have depicted before and after it; except even this is brought down by it's emotional void. While films such as Lewis Milestone's All Quiet on the Western Front gave you characters to feel for; The Battle of Algiers has none and even though it's message is still felt, it's not as potent as it could, and by rights should, have been. Due to the current state of the world, most notably the current mood in the USA, The Battle of Algiers can easily be used as a benchmark to draw parallels with nowadays, which in a way has given it a new lease of life in today's society. On the whole, I respect this movie for it's technical achievement and the fact that it offers an unbiased account of an important event in history. But I don't like it."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw2677639",
      "warningSpoilers": true,
      "date": "22 September 2012",
      "rate": "10",
      "helpful": "9 out of 16 found this helpful.",
      "title": "Can A Mere Movie From 1966 Influence The 21st Century ? Maybe",
      "content": "What everyone forgets nowadays is that the French contribution to counter insurgency warfare was \" The ink spot strategy \" which was very effective against the Viet Minh in the early stages of the French Indo-China conflict 1946-54 . The same strategy was used most effectively by the British in Malaya in the 1950s where it crushed a communist insurrection , though it was painfully ineffective when the Brits used it in Afghanistan 50 years later . We can all remember the hurtful comments about France being shouted from The White House during Dubya's era but didn't stop the irony - if not out and out hypocrisy - of the same politicians watching this film in order to pick up a few tips on counter insurgency warfare in Iraq and Afghanistan Before tonight I saw this almost 20 years ago and have never forgotten it . What I remembered most was the very even handed dealt out to both sides . This doesn't mean it tries either side as light gray , more like very very dark gray which neither side should be proud of . Based on the grim realities of the time . The French are happy to carry out black ops against the rebellion by blowing up innocent Algerian citizens making out houses are used for bomb factories and brutally torturing interned suspects while the Algerian rebels ( FLN ) blow up innocent civilians at coffee bars and sports stadiums , their victims not being the French military but innocent men woman and children . There are moments that can only be described as surreal irony where for example an Algerian child is stopped from being beaten to death by a French gendarme This is a political film that shows a neutral point of view . In this type of conflict nearly everyone is neutral . Both the French and FLN try and make a headway in to turning the neutral in to being on \" Our side \". Watching it in 2012 however you must be aware of one thing: The FLN are Muslims but they don't want to make a liberated Algeria in to a theocratic Islamic state - they're ( Relatively secular ) nationalists fighting again French colonialism . They're offering the Algerian people freedom from France not freedom from freedom . There's a subtlety to the ideas being put forward by both sides . The French realise not everyone is a terrorist whilst the FLN realise not everything can be solved by violence - revolutions need the will of the people . I could spend all day discussing the complex views put forward but there's a word limit of 1000 words . Just watch it and understand it There's some obvious flaws to the movie . One is that many of the deaths are a bit too bloodless . Another is that we never see what is happening outside of the Algerian capital though the war in the countryside is referred to . Perhaps the biggest complaint is that two years after the main action the story jumps forward where more violent demonstrations take place without the benefit of historical context but if you understand revolution it's because the occupying power hasn't provided any political gains to the wider Algerian population after temporarily beating the FLN . All insurrections are political in nature and if politicians can't bring a political carrot to the table after beating the insurrection to death with a stick then the violence will continue periodically and ultimately end in defeat . I do hope all politicians in charge of a NATO country realise this"
    },
    {
      "username": "rosscinema",
      "userUrl": "https://www.imdb.com/user/ur1590118",
      "reviewLink": "https://www.imdb.com/review/rw1037588",
      "warningSpoilers": true,
      "date": "11 March 2005",
      "rate": "9",
      "helpful": "10 out of 19 found this helpful.",
      "title": "This film attains a level of importance that has never been achieved before",
      "content": "We all go to the movies because we love to be entertained and it's hard to argue that it's the greatest form of entertainment but when serious viewers talk about film in terms of being important you would have to expect this title to be instantly brought up. This film covers the years from 1954 to 1962 in Algeria when the Arab section of Algiers started an uprising to fight the French and gain their own independence. Ali La Pointe (Brahim Haggiag) is a petty thief and hustler and when he gets out of jail he teams up with El-hadi Jaffar (Saadi Yacef) and together they form the Algerian National Liberation Front (FLN) in which they start terrorist attacks.*****SPOILER ALERT***** French authorities bring in Col. Mathieu (Jean Martin) to head the anti-terrorist unit and he uses methods of torture to slowly eliminate the insurrectionists who hide behind walls in apartments in the Casbah. Eventually Col. Mathieu kills Ali and it seems that everything will go back to what they were but two years later the Arabs take to the streets in huge numbers which causes the U.N. to take notice and in 1962 Algeria finally gained it's independence.This was made by Italian filmmaker Gillo Pontecorvo who shot this in the actual locations in Algeria and used mainly non-actors in his cast (Martin is the only professional) and the story is based on a book by Yacef who not only is a survivor of these true events but is cast in an important role. Pontecorvo has created a film that seems so real that he had to have a disclaimer put into the credits stating that no newsreel or documentary footage was used which is incredible because there are so many scenes in which it appears that real events were caught on film. The script does it's best to show both the positive and the negative of both sides of the French and the FLN but it does seem that Pontecorvo leans towards the side of the Arabs. This all takes place in a time when most American viewers were not aware of what terrorism was about and in 1965 it was probably easy to just point at the French and think they should just get out but now in our day and age audiences are a little more sophisticated to the world and it's politics. There are scenes that take place that we will probably never see done again because of the lack of safety especially the shots of the bombs exploding and the (so-called) actors scrambling for their lives. Another point in the film shows a French soldier bursting into an apartment to search it and accidentally stepping on a crying baby! There is no doubt that this is one of the most important films ever made not just because of the subject matter but in the skill that Pontecorvo applies to achieve his vision. In 1965 this may not have been perceived as a truly great film but now 40 years later it's looked at as one of the most important films ever made and one that is studied by military personnel and those in the Pentagon."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw4981410",
      "warningSpoilers": false,
      "date": "7 July 2019",
      "rate": "8",
      "helpful": "4 out of 8 found this helpful.",
      "title": "France's illusion",
      "content": "Told in a brutally realistic style The Battle For Algeria is the ultimate in docudrama. Italian director Gillo Pontecorvo made this film with a bit of distance between the French-Algerian War post World War II. Pontecorvo skillfully uses documentary footage to blend in nicely with the story he shot. You think you are getting an inside look at the war.Looking back this seems so ludicrous. Post the Napoleonic age France's colonial expansion took her to North Africa just across the Mediterranean and between Morocco, Tunisia, and the countries carved out of French Equatorial Africa and French West Africa she had one large chunk of the continent. By degree and somewhat hurried by the end of World War II. Except for Algeria and particularly Algiers it's capital city on the coast. For some inexplicable reason the French took a proprietary interest in the place and would not let it go.No hearts and minds were won by the French among the Moslem population. Especially after use of torture. Why they just didn't let them go with the rest is beyond me.The Algerian story is told from the point of view of freedom figter Braham Hadjaji. The French point of view is covered from high ranking officer Jean Martin. Martin's attitudes are frightening as his sense of propriety concerning Algiers.This is one great film with a lot of lessons to be learned about neo-colonialism."
    },
    {
      "username": "osteodude",
      "userUrl": "https://www.imdb.com/user/ur5281807",
      "reviewLink": "https://www.imdb.com/review/rw1077104",
      "warningSpoilers": false,
      "date": "9 May 2005",
      "rate": "10",
      "helpful": "63 out of 93 found this helpful.",
      "title": "learn from the history it conveys",
      "content": "If one has not seen this film, one cannot begin to imagine Pontecorvo's extraordinary achievement. The acting is so natural and convincing that many viewers and even some critics assumed that the movie was a documentary. Only a master director could have taken this raw acting material and gotten such performances out of it. And despite his leftist viewpoint, Pontecorvo neither ridicules or demonizes the French, as does Michael Moore the Americans in his recent putative documentaries Bowling at Columbine and Farenheit 9-11 - though I do a disservice to Pontecorvo to compare his work to that of Moore.See this movie now that it has been released on DVD in the United States and learn from the history it so brilliantly conveys."
    },
    {
      "username": "christopher-underwood",
      "userUrl": "https://www.imdb.com/user/ur4944007",
      "reviewLink": "https://www.imdb.com/review/rw8497367",
      "warningSpoilers": false,
      "date": "29 August 2022",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "the two hours go fast",
      "content": "Although most of Gillo Portecorvo's films are usually documentaries and in this fantastic one it is clearly reconstructed and with the grainy newsreel looks as if it is real. The two hours go fast and because the story is so well told that we watch the amazing streets and alleys and steps of the wretched white buildings and the Casbah. There is also the rather brutal French occupiers and their torture methods. The Italian style we know as neorealist and it works so well that we think that even of the thousands of people we can hardly imagine it was not really we have actual seen in the streets. It is all so terrible that we begin that maybe the bombings and shootings by the Muslims have our sympathies and we certain have the wonderful music of Morricone."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1385052",
      "warningSpoilers": false,
      "date": "3 June 2006",
      "rate": "10",
      "helpful": "3 out of 6 found this helpful.",
      "title": "as fitting a tip-of-the-hat to Rossellini's post-WW2 work made in the 60's, and them some",
      "content": "A couple of times here and there watching Gillo Pontecorvo's The Battle of Algiers, winner of the 1966 Golden Lion at Venice, I thought off-handedly (maybe with a smidgen of sarcasm), 'this is probably one of the top 5 favorite films of like Rage Against the Machine or something'. It's not without saying though that once the film was over, and watching a bit more on the extra features on the DVD (with other directors shining light on their opinions on the film), that most of what I saw sunk in a little deeper. This is one of the best kinds of documentary-style dramas made in its time and place in the world, and goes a bit further in the right direction from Roberto Rossellini's post-war trilogy. While it's not unlikely to see Pontecorvo's own influence from the neorealist maverick, it's also likely to see how Pontecorvo takes this very emotionally charged, as-factual-as-possible story of Algiers versus France in the mid 1950s with an assured balance of pathos and style. It also works tremendously as a kind of 'statement' movie, without at all pushing it down the viewer's throats. It does have a viewpoint, as do most films, and here and there it definitely does drive home the point of the Algiers' need for freedom from the militant oppression of France.But what struck me most about how Pontecorvo and his collaborators (both screenwriter and producer as the latter of which had complete first hand contact with the events and plays an acting part), is how he approached violence and its effect on an urban climate. Through Pontecorvo's camera, we see the ugly side to both sides, even the one that we should be rooting for. France is the (supposedly unintentional) oppressor here, and in this time frame had made them a colonial power for decades, and in order to sustain order and track down their 'targets' in 1957 they go from complete militarization (shown quite starkly and simply, and like a good would-be neorealist 'as it is if we are right there') to torture tactics. Their acts of violence and brutality are however given the other side of the coin in the scenes where the lieutenant Colonel of the French troops Matthieu (played by the great Jean Martin) talks to the press or lays out his point of view in scenes. Then the other side of the Algiers, those who are fighting back early on in the film with guerrilla-like terrorist tactics go to lengths to make their messages clear through seemingly random but daunting acts of violence. Pontecorvo's point in showing both sides is almost complex while seeming simple- neither side is right when it comes to committing violence against one another in this situation. It's a very powerful statement made that doesn't cut corners, of the truth that still permeates of a first-world power, already very adept in their military powers from past (proud) military conflicts who can't seem to let up from giving the people they say they want to help and provide some leeway in establishing their own government and freedom despite the fervent opposition. Sound familiar?At any rate, the real success behind this message- which could've been done on the flip-side with a lot of pumped melodrama- is by making it a kind of hybrid of doc and fiction. Unlike Memories of Underdevelopment, which would come out 2 years after this in Cuba, it's never exactly certain when the footage is even dramatized or not. And there are two aspects to what Pontecorvo covers in his purely cinematic style that totally serves his content. One is how he deals with crowds, with the dirty city life of the Arab section of Algiers where all the madness, chaos, and just frustration takes place, in range from the scenes of people walking by in burkas to reveal themselves as the \"enemy\" with guns, to those startling sequences of the revolutions and multi-militant post. The other one is how Pontecorvo deals with his 'subjects', as one might call them, as they are all save for one non-actors. Like directors before him (mentioned above) and after (like Fernando Meirelles) the filmmaker here is after the right look on people, and in going almost as a bystander at times getting these people. The guy playing La Pointe- the center of the film (an illiterate petty criminal turned major terrorist)- isn't particularly 'good', but he doesn't need to be. His face tells all. In maybe my favorite scene in the film, when a female from the Algiers section sneaks into a quasi-dance hall in the European section, we get various shots of the faces of the patrons as well as her own. None are professional, which obviously adds to the complexities of this scene. Who's innocent and who's guilty in this world? Sometimes there are some very brutal moments in the film, and then there are others that sometimes even work just as a usual, well, thriller. Here and there I almost felt like I was watching a more recent film without taking into account how it might have influenced a few directors over time. With one of his best early scores via Ennio Morricone, and some uncompromising details with the multiple deaths in the film, The Battle of Algiers does come quite close to being one of those 'essential' films of the 1960's, where a political attitude or need to put onto film a time and place in the world was captured. And if it has at least a little relevance for some military-style situations of the now (and I am not at all anti-US, but the comparisons could be made with bits in the film) its a credit to the filmmakers that its basically the film they wanted to make, with a freedom relatable to the doomed characters on the side of Algiers."
    },
    {
      "username": "jordondave-28085",
      "userUrl": "https://www.imdb.com/user/ur157865736",
      "reviewLink": "https://www.imdb.com/review/rw8898534",
      "warningSpoilers": false,
      "date": "28 February 2023",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Groundbreaking docu-drama",
      "content": "(1966)The Battle of Algiers/ La battaglia di Algeri (In Italian, French, Arabic with English subtitles) POLITICAL DRAMA/ DOCUMENTARYNot so much of a war film as much as a film that \"states\" about actual Algerian history when the French moved into the territory creating hostility! Some of it's themes echoes what is happening in real life, such as between Palestine/ Israel, Northern Ireland/ England to name two when one ethnic group can't settle their differences with another creating extreme radicalism by using physical, perhaps unnecessary 'violence' by using terrorist acts! Like the IRA of Northern Ireland- the Arabs in Algeria also started the FLN (National Liberation Front) either to retaliate or as retribution against the French, using some actual 'news' footage's on specific parts of this film! Groundbreaking and influential because of stating history which is similar to films such as \"Sunday, Bloody, Sunday\", \"The Kite Runner\", \"Cry Freedom\" to name a few! Although, I may have been ignorant about Algerian history and very appreciative to have seen this since it's unbiased, my rating might've been much higher had it shown actual footage's about what French governments or any other had to say 'verbally' about the hostility."
    }
  ],
  "errorMessage": ""
}