{
  "imDbId": "tt0058946",
  "title": "The Battle of Algiers",
  "fullTitle": "The Battle of Algiers (1966)",
  "type": "Movie",
  "year": "1966",
  "language": "en",
  "titleInLanguage": "The Battle of Algiers",
  "url": "https://en.wikipedia.org/wiki/The_Battle_of_Algiers",
  "plotShort": {
    "plainText": "The Battle of Algiers (Italian: La battaglia di Algeri; Arabic: معركة الجزائر, romanized: Maʿrakat al-Jazāʾir) is a 1966 Italian-Algerian war film co-written and directed by Gillo Pontecorvo. It is based on events undertaken by rebels during the Algerian War (1954–1962) against the French government in North Africa, the most prominent being the eponymous Battle of Algiers, the capital of Algeria. It was shot on location in a Roberto Rossellini-inspired newsreel style: in black and white with documentary-type editing to add to its sense of historical authenticity, with mostly non-professional actors who had lived through the real battle. The film's score was composed by Pontecorvo and Ennio Morricone. It is often associated with Italian neorealist cinema.\r\nThe film concentrates mainly on revolutionary fighter Ali La Pointe during the years between 1954 and 1957, when guerrilla fighters of the FLN went into Algiers. Their actions were met by French paratroopers attempting to regain territory. The highly dramatic film is about the organization of a guerrilla movement and the illegal methods, such as torture, used by the French to stop it. Algeria succeeded in gaining independence from the French, which Pontecorvo addresses in the film's epilogue.\r\nThe film has been critically acclaimed. Both insurgent groups and state authorities have considered it to be an important commentary on urban guerrilla warfare. It occupies the 48th place on the Critics' Top 250 Films of the 2012 Sight & Sound poll, as well as 120th place on Empire magazine's list of the \"500 greatest movies of all time\". It was selected to enter the list of the \"100 Italian films to be saved\". A subject of sociopolitical controversy, the film was not screened for five years in France; it was eventually released in 1971.",
    "html": "<p>The Battle of Algiers (Italian: La battaglia di Algeri; Arabic: معركة الجزائر, romanized: Maʿrakat al-Jazāʾir) is a 1966 Italian-Algerian war film co-written and directed by Gillo Pontecorvo. It is based on events undertaken by rebels during the Algerian War (1954–1962) against the French government in North Africa, the most prominent being the eponymous Battle of Algiers, the capital of Algeria. It was shot on location in a Roberto Rossellini-inspired newsreel style: in black and white with documentary-type editing to add to its sense of historical authenticity, with mostly non-professional actors who had lived through the real battle. The film's score was composed by Pontecorvo and Ennio Morricone. It is often associated with Italian neorealist cinema.</p><p>The film concentrates mainly on revolutionary fighter Ali La Pointe during the years between 1954 and 1957, when guerrilla fighters of the FLN went into Algiers. Their actions were met by French paratroopers attempting to regain territory. The highly dramatic film is about the organization of a guerrilla movement and the illegal methods, such as torture, used by the French to stop it. Algeria succeeded in gaining independence from the French, which Pontecorvo addresses in the film's epilogue.</p><p>The film has been critically acclaimed. Both insurgent groups and state authorities have considered it to be an important commentary on urban guerrilla warfare. It occupies the 48th place on the Critics' Top 250 Films of the 2012 Sight & Sound poll, as well as 120th place on Empire magazine's list of the \"500 greatest movies of all time\". It was selected to enter the list of the \"100 Italian films to be saved\". A subject of sociopolitical controversy, the film was not screened for five years in France; it was eventually released in 1971.</p>"
  },
  "plotFull": {
    "plainText": "The Battle of Algiers (Italian: La battaglia di Algeri; Arabic: معركة الجزائر, romanized: Maʿrakat al-Jazāʾir) is a 1966 Italian-Algerian war film co-written and directed by Gillo Pontecorvo. It is based on events undertaken by rebels during the Algerian War (1954–1962) against the French government in North Africa, the most prominent being the eponymous Battle of Algiers, the capital of Algeria. It was shot on location in a Roberto Rossellini-inspired newsreel style: in black and white with documentary-type editing to add to its sense of historical authenticity, with mostly non-professional actors who had lived through the real battle. The film's score was composed by Pontecorvo and Ennio Morricone. It is often associated with Italian neorealist cinema.\r\nThe film concentrates mainly on revolutionary fighter Ali La Pointe during the years between 1954 and 1957, when guerrilla fighters of the FLN went into Algiers. Their actions were met by French paratroopers attempting to regain territory. The highly dramatic film is about the organization of a guerrilla movement and the illegal methods, such as torture, used by the French to stop it. Algeria succeeded in gaining independence from the French, which Pontecorvo addresses in the film's epilogue.\r\nThe film has been critically acclaimed. Both insurgent groups and state authorities have considered it to be an important commentary on urban guerrilla warfare. It occupies the 48th place on the Critics' Top 250 Films of the 2012 Sight & Sound poll, as well as 120th place on Empire magazine's list of the \"500 greatest movies of all time\". It was selected to enter the list of the \"100 Italian films to be saved\". A subject of sociopolitical controversy, the film was not screened for five years in France; it was eventually released in 1971.\r\nSubject\r\nThe Battle of Algiers reconstructs the events that occurred in the capital city of French Algeria between November 1954 and December 1957, during the Algerian War of Independence. The narrative begins with the organization of revolutionary cells in the Casbah. Because of partisan warfare between the Algerian locals and Pied-Noir, in which both sides commit acts of increasing violence, France sends French Army paratroopers to the city to fight against and capture members of the National Liberation Front (FLN). The paratroopers are depicted as neutralizing the whole of the FLN leadership through either assassination or capture. The film ends with a coda depicting nationalist demonstrations and riots, suggesting that although France won the Battle of Algiers, it lost the Algerian War.\r\nThe tactics of the FLN guerrilla insurgency and the French counter insurgency, and the uglier incidents of the war are depicted. Both colonizer and colonized commit atrocities against civilians. The FLN commandeer the Casbah via summary execution of Algerian criminals and suspected French collaborators; they commit terrorism, including actions like the real-life Milk Bar Café bombing, to harass Europeans. The security forces resort to killings and indiscriminate violence against the opposition. French paratroops are depicted as routinely using torture, intimidation, and murder.\r\nPontecorvo and Solinas created several protagonists in their screenplay who are based on historical war figures. The story begins and ends from the perspective of Ali la Pointe (Brahim Haggiag), a petty criminal who is politically radicalized while in prison. He is recruited by FLN commander El-hadi Jafar, played by Saadi Yacef, who was a veteran FLN commander.\r\nLieutenant-Colonel Mathieu, the paratroop commander, is the principal French character. Other characters are the boy Petit Omar, a street urchin who is an FLN messenger; Larbi Ben M'hidi, a top FLN leader who provides the political rationale for the insurgency; and Djamila, Zohra, and Hassiba, three FLN women urban guerrillas who carry out a terrorist attack. The Battle of Algiers also features thousands of Algerian extras. Pontecorvo intended to have them portray the \"Casbah-as-chorus\", communicating with chanting, wailing, and physical effect.\r\nProduction and style\r\nScreenplay\r\nThe Battle of Algiers was inspired by the 1962 book Souvenirs de la Bataille d'Alger, an FLN military commander's account of the campaign, by Saadi Yacef. Yacef wrote the book while he was held as a prisoner of the French, and it served to boost morale for the FLN and other militants. After independence, the French released Yacef, who became a leader in the new government. The Algerian government backed adapting Yacef's memoir as a film. Salash Baazi, an FLN leader who had been exiled by the French, approached Italian director Gillo Pontecorvo and screenwriter Franco Solinas with the project.\r\nTo meet the demands of film, The Battle of Algiers uses composite characters and changes the names of certain persons. For example, Colonel Mathieu is a composite of several French counterinsurgency officers, especially Jacques Massu. Saadi Yacef has said that Mathieu was based more on Marcel Bigeard, although the character is also reminiscent of Roger Trinquier. Accused of portraying Mathieu as too elegant and noble, screenwriter Solinas denied that this was his intention. He said in an interview that the Colonel is \"elegant and cultured, because Western civilization is neither inelegant nor uncultured\".\r\nVisual style\r\nFor The Battle of Algiers, Pontecorvo and cinematographer Marcello Gatti filmed in black and white and experimented with various techniques to give the film the look of newsreel and documentary film. The effect was so convincing that American releases carried a notice that \"not one foot\" of newsreel was used.\r\nPontecorvo's use of fictional realism enables the movie \"to operate along a double-bind as it consciously addresses different audiences.\" The film makes special use of television in order to link western audiences with images they are constantly faced with that are asserted to express the \"truth\". The film seems to be filmed through the point of view of a western reporter, as telephoto lenses and hand-held cameras are used, whilst \"depicting the struggle from a 'safe' distance with French soldiers placed between the crowds and camera.\"\r\nCast\r\nPontecorvo chose to cast non-professional Algerians. He chose people whom he met, picking them mainly on appearance and emotional effect (as a result, many of their lines were dubbed). The sole professional actor of the movie was Jean Martin, who played Colonel Mathieu; Martin was a French actor who had worked primarily in theatre. Pontecorvo wanted a professional actor, but one who would not be familiar to most audiences, as this could have interfered with the movie's intended realism.\r\nMartin had been dismissed several years earlier from the Théâtre National Populaire for signing the manifesto of the 121 against the Algerian War. Martin was a veteran; he had served in a paratroop regiment during the Indochina War and he had taken part in the French Resistance. His portrayal had autobiographical depth. According to an interview with screenwriter Franco Solinas, the working relationship between Martin and Pontecorvo was not always easy. Unsure whether Martin's professional acting style would contrast too much with the non-professionals, Pontecorvo argued about Martin's acting choices.\r\nSaadi Yacef, who plays El-Hadi Jaffar, and Samia Kerbash, who plays Fathia, were both members of the FLN and Pontecorvo is said to have been greatly inspired by their accounts. The actors credited are:\r\nJean Martin as Colonel Philippe Mathieu\r\nSaadi Yacef as El-Hadi Jafar\r\nBrahim Haggiag as Ali La Pointe\r\nTommaso Neri as Captain Dubois\r\nSamia Kerbash as Fathia\r\nUgo Paletti as a Captain\r\nFusia El Kader as Halima\r\nFranco Moruzzi as Mahmoud\r\nMohamed Ben Kassen as Little Omar\r\nSound and music\r\nSound – both music and effects – perform important functions in the movie. Indigenous Algerian drumming, rather than dialogue, is heard during a scene in which female FLN militants prepare for bombings. In addition, Pontecorvo used the sounds of gunfire, helicopters and truck engines to symbolize the French methods of battle, while bomb blasts, ululation, wailing and chanting symbolize the Algerian methods. Gillo Pontecorvo wrote the music for The Battle of Algiers, but because he was classified as a \"melodist-composer\" in Italy, he was required to work with another composer as well; his good friend Ennio Morricone collaborated with him. The solo military drum, which is heard throughout the film, is played by the famous Italian drummer Pierino Munari.\r\nPost-release history and legacy\r\nCritical reception\r\nPontecorvo resisted the temptation to romanticise the protagonists. He portrays the cruelty of attacks committed by both the FLN and the French. The film won the Golden Lion at the Venice Film Festival and was nominated for three Academy Awards (in non-consecutive years, a unique achievement): Best Foreign Language Film in 1967, and Best Screenplay (Gillo Pontecorvo and Franco Solinas) and Best Director (Gillo Pontecorvo) in 1969.\r\nOther awards include The City of Venice Cinema Prize (1966), the International Critics Award (1966), the City of Imola Prize (1966), the Italian Silver Ribbon Prize (director, photography, producer), the Ajace Prize of the Cinema d'Essai (1967), the Italian Golden Asphodel (1966), Diosa de Plata at the Acapulco Film Festival (1966), the Golden Grolla (1966), the Riccione Prize (1966), Best Film of 1967 by Cuban critics (in a poll sponsored by Cuban magazine Cine), and the United Churches of America Prize (1967).\r\nRoger Ebert gave the film 4/4 stars, calling it \"a great film\" that \"exists at this level of bitter reality. It may be a deeper film experience than many audiences can withstand: too cynical, too true, too cruel and too heartbreaking. It is about the Algerian war, but those not interested in Algeria may substitute another war; The Battle of Algiers has a universal frame of reference\". The film occupies the 48th place on the Critics' Top 250 Films of the 2012 Sight & Sound poll, as well as 120th place on Empire magazine's list of the 500 greatest movies of all time. In 2010, Empire also ranked the movie 6th in The 100 Best Films Of World Cinema. It was selected to enter the list of the \"100 Italian films to be saved\".\r\nThe American film director Stanley Kubrick praised the film by stating: \"All films are, in a sense, false documentaries. One tries to approach reality as much as possible, only it’s not reality. There are people who do very clever things, which have completely fascinated and fooled me. For example, The Battle of Algiers. It’s very impressive.\" Also, according to Anthony Frewin, Kubrick's personal assistant, he stated: \"When I started work for Stanley in September 1965 he told me that I couldn’t really understand what cinema was capable of without seeing The Battle of Algiers. He was still enthusing about it prior to his death.\"\r\nThe Greek-French political filmmaker Costa-Gavras listed the film as a influence on his filmmaking.\r\nThe American filmmaker Steven Soderbergh listed the film as an inspiration on his film Traffic noting that the film (along with Costa-Gavras's Z) had \"that great feeling of things that are caught, instead of staged, which is what we were after.\"\r\nThe American actor and filmmaker Ben Affleck listed The Battle of Algiers as a influence for his film Argo.\r\nThe British-American filmmaker Christopher Nolan listed the film as one of his favorites and is credited for inspiring his films such as The Dark Knight Rises and Dunkirk.\r\nThe Palestinian-American academic Edward Said (famous for his work Orientalism) praised The Battle of Algiers (along with Pontecorvo's other film, Burn!) as the two films \"...stand unmatched and unexcelled since they were made in the 60s. Both films together constitute a political and aesthetic standard never again equaled.\"\r\nThe British-Pakistani writer and activist Tariq Ali has placed The Battle of Algiers in his top 10 films list for the Sight and Sound poll of the greatest films of all time.\r\nThe German filmmaker Werner Herzog admired the film and it was one of the few films that was required viewing to his film school students.\r\nThe English filmmaker Ken Loach listed the film as one of his top 10 favorite films of all time and mentioned the film's influence on his filmmaking by saying: “It used non-professional actors. It was not over-dramatic. It was low key. It showed the impact of colonialism on daily lives. These techniques had an important influence on my filmmaking… I saw the film when it came out in 1966. It was one of a number of films that influenced me.\"\r\nOn review aggregation website Rotten Tomatoes, the film holds an approval rating of 99% based on 87 reviews, with an average rating of 9.06/10; the site's consensus reads: \"A powerful, documentary-like examination of the response to an occupying force, The Battle of Algiers hasn't aged a bit since its release in 1966.\" On Metacritic, the film has a weighted average score of 96 out of 100 based on 22 critics, indicating \"universal acclaim\".\r\nIn 2007, the film was ranked at No. 5 by The Guardian's readers' poll on its list of \"40 greatest foreign films of all time\".\r\nNot all reception was positive. In France, Cahiers du cinéma devoted a special feature to the film consisting of five articles by critics, philosophers, and film scholars. Their collective negative assessment of the film was cast in such strong terms that \"it undermined, on moral grounds, the legitimacy of any critic or analyst who did not condemn the film, let alone anyone who dared consider it worthy of filmic attention.\"\r\nBanned in France\r\nGiven national divisions over the Algerian War, the film generated considerable political controversy in France and was banned there for five years, with the official government ban of one year succeeded by the decision of private theater owners to not screen the film for another four. People continued to argue about the grounds of the war and colonialism, and argued anew over how these were portrayed in the film. This film was the first available to Metropole French that directly confronted French imperialism. The director received death threats from persons on the far right sympathetic to the French military view.\r\nPontecorvo stated \"The Algerians put no obstacles in our way because they knew that I'd be making a more or less objective film about the subject. The French authorities, who were very sensitive on the Algerian issue, banned the film for three months.\" Due to repeated threats of violence from fascist groups, the government banned screenings of the film for four years, although Pontecorvo believed he had made a politically neutral film.\r\nThe Battle of Algiers and guerrilla movements\r\nThe release of The Battle of Algiers coincided with the decolonization period and national liberation wars, as well as a rising tide of left-wing radicalism in Western nations in which a large minority showed interest in armed struggle. Beginning in the late 1960s, The Battle of Algiers gained a reputation for inspiring political violence; in particular, the tactics of urban guerrilla warfare and terrorism in the movie supposedly were copied by the Black Panthers, the Provisional Irish Republican Army, the Palestinian Liberation Organization and the Jammu Kashmir Liberation Front. The Battle of Algiers was apparently Andreas Baader's favourite movie.\r\nScreenings worldwide\r\n1960s screening in Argentina\r\nPresident Arturo Frondizi (Radical Civic Union, UCR) directed introduction of the first course on counter-revolutionary warfare in the Higher Military College. By 1963, cadets at the Navy Mechanics School (ESMA) started receiving counter-insurgency classes. In one of their courses, they were shown the movie The Battle of Algiers. Antonio Caggiano, archbishop of Buenos Aires from 1959 to 1975, was associated with this as military chaplain. He introduced the movie approvingly and added a religiously oriented commentary to it. ESMA was later known as a center for the Argentine Dirty War and torture and abuse of insurgents and innocent civilians.\r\nAnibal Acosta, one of the ESMA cadets interviewed 35 years later by French journalist Marie-Monique Robin, described the session:\r\nThey showed us that film to prepare us for a kind of war very different from the regular war we had entered the Navy School for. They were preparing us for police missions against the civilian population, who became our new enemy.\r\n2003 Pentagon screening\r\nDuring 2003, the press reported that United States Department of Defense (the Pentagon) offered a screening of the movie on August 27. The Directorate for Special Operations and Low-Intensity Conflict regarded it as useful for commanders and troops facing similar issues in occupied Iraq.\r\nA flyer for the screening said:\r\nHow to win a battle against terrorism and lose the war of ideas. Children shoot soldiers at point-blank range. Women plant bombs in cafes. Soon the entire Arab population builds to a mad fervor. Sound familiar? The French have a plan. It succeeds tactically, but fails strategically. To understand why, come to a rare showing of this film.\r\nAccording to the Defense Department official in charge of the screening, \"Showing the film offers historical insight into the conduct of French operations in Algeria, and was intended to prompt informative discussion of the challenges faced by the French.\"\r\n2003–2004 theatrical re-release\r\nAt the time of the 2003 Pentagon screening, legal and \"pirate\" VHS and DVD versions of the movie were available in the United States and elsewhere, but the image quality was degraded. A restored print had been made in Italy in 1999. Rialto Pictures acquired the distribution rights to re-release the film again in the United Kingdom in December 2003 as well as in the United States and in France on separate dates in 2004. The film was shown in the Espace Accattone, rue Cujas in Paris, from November 15, 2006, to March 6, 2007.\r\n2004 Criterion DVD edition\r\nOn October 12, 2004, The Criterion Collection released the movie, transferred from a restored print, in a three-disc DVD set. The extras include former US counter-terrorism advisors Richard A. Clarke and Michael A. Sheehan discussing The Battle of Algiers's depiction of terrorism and guerrilla warfare. Directors Spike Lee, Mira Nair, Julian Schnabel, Steven Soderbergh, and Oliver Stone discussed its influence on film. Another documentary in the set includes interviews with FLN commanders Saadi Yacef and Zohra Drif.\r\n2011 Criterion Blu-ray edition\r\nA new high-definition digital transfer, supervised by director of photography Marcello Gatti, was released by Criterion on Blu-ray Disc in 2011.",
    "html": "<p>The Battle of Algiers (Italian: La battaglia di Algeri; Arabic: معركة الجزائر, romanized: Maʿrakat al-Jazāʾir) is a 1966 Italian-Algerian war film co-written and directed by Gillo Pontecorvo. It is based on events undertaken by rebels during the Algerian War (1954–1962) against the French government in North Africa, the most prominent being the eponymous Battle of Algiers, the capital of Algeria. It was shot on location in a Roberto Rossellini-inspired newsreel style: in black and white with documentary-type editing to add to its sense of historical authenticity, with mostly non-professional actors who had lived through the real battle. The film's score was composed by Pontecorvo and Ennio Morricone. It is often associated with Italian neorealist cinema.</p><p>The film concentrates mainly on revolutionary fighter Ali La Pointe during the years between 1954 and 1957, when guerrilla fighters of the FLN went into Algiers. Their actions were met by French paratroopers attempting to regain territory. The highly dramatic film is about the organization of a guerrilla movement and the illegal methods, such as torture, used by the French to stop it. Algeria succeeded in gaining independence from the French, which Pontecorvo addresses in the film's epilogue.</p><p>The film has been critically acclaimed. Both insurgent groups and state authorities have considered it to be an important commentary on urban guerrilla warfare. It occupies the 48th place on the Critics' Top 250 Films of the 2012 Sight & Sound poll, as well as 120th place on Empire magazine's list of the \"500 greatest movies of all time\". It was selected to enter the list of the \"100 Italian films to be saved\". A subject of sociopolitical controversy, the film was not screened for five years in France; it was eventually released in 1971.</p><br/><h3>Subject</h3><p>The Battle of Algiers reconstructs the events that occurred in the capital city of French Algeria between November 1954 and December 1957, during the Algerian War of Independence. The narrative begins with the organization of revolutionary cells in the Casbah. Because of partisan warfare between the Algerian locals and Pied-Noir, in which both sides commit acts of increasing violence, France sends French Army paratroopers to the city to fight against and capture members of the National Liberation Front (FLN). The paratroopers are depicted as neutralizing the whole of the FLN leadership through either assassination or capture. The film ends with a coda depicting nationalist demonstrations and riots, suggesting that although France won the Battle of Algiers, it lost the Algerian War.</p><p>The tactics of the FLN guerrilla insurgency and the French counter insurgency, and the uglier incidents of the war are depicted. Both colonizer and colonized commit atrocities against civilians. The FLN commandeer the Casbah via summary execution of Algerian criminals and suspected French collaborators; they commit terrorism, including actions like the real-life Milk Bar Café bombing, to harass Europeans. The security forces resort to killings and indiscriminate violence against the opposition. French paratroops are depicted as routinely using torture, intimidation, and murder.</p><p>Pontecorvo and Solinas created several protagonists in their screenplay who are based on historical war figures. The story begins and ends from the perspective of Ali la Pointe (Brahim Haggiag), a petty criminal who is politically radicalized while in prison. He is recruited by FLN commander El-hadi Jafar, played by Saadi Yacef, who was a veteran FLN commander.</p><p>Lieutenant-Colonel Mathieu, the paratroop commander, is the principal French character. Other characters are the boy Petit Omar, a street urchin who is an FLN messenger; Larbi Ben M'hidi, a top FLN leader who provides the political rationale for the insurgency; and Djamila, Zohra, and Hassiba, three FLN women urban guerrillas who carry out a terrorist attack. The Battle of Algiers also features thousands of Algerian extras. Pontecorvo intended to have them portray the \"Casbah-as-chorus\", communicating with chanting, wailing, and physical effect.</p><br/><h3>Production and style</h3><h4>Screenplay</h4><p>The Battle of Algiers was inspired by the 1962 book Souvenirs de la Bataille d'Alger, an FLN military commander's account of the campaign, by Saadi Yacef. Yacef wrote the book while he was held as a prisoner of the French, and it served to boost morale for the FLN and other militants. After independence, the French released Yacef, who became a leader in the new government. The Algerian government backed adapting Yacef's memoir as a film. Salash Baazi, an FLN leader who had been exiled by the French, approached Italian director Gillo Pontecorvo and screenwriter Franco Solinas with the project.</p><p>To meet the demands of film, The Battle of Algiers uses composite characters and changes the names of certain persons. For example, Colonel Mathieu is a composite of several French counterinsurgency officers, especially Jacques Massu. Saadi Yacef has said that Mathieu was based more on Marcel Bigeard, although the character is also reminiscent of Roger Trinquier. Accused of portraying Mathieu as too elegant and noble, screenwriter Solinas denied that this was his intention. He said in an interview that the Colonel is \"elegant and cultured, because Western civilization is neither inelegant nor uncultured\".</p><h4>Visual style</h4><p>For The Battle of Algiers, Pontecorvo and cinematographer Marcello Gatti filmed in black and white and experimented with various techniques to give the film the look of newsreel and documentary film. The effect was so convincing that American releases carried a notice that \"not one foot\" of newsreel was used.</p><p>Pontecorvo's use of fictional realism enables the movie \"to operate along a double-bind as it consciously addresses different audiences.\" The film makes special use of television in order to link western audiences with images they are constantly faced with that are asserted to express the \"truth\". The film seems to be filmed through the point of view of a western reporter, as telephoto lenses and hand-held cameras are used, whilst \"depicting the struggle from a 'safe' distance with French soldiers placed between the crowds and camera.\"</p><h4>Cast</h4><p>Pontecorvo chose to cast non-professional Algerians. He chose people whom he met, picking them mainly on appearance and emotional effect (as a result, many of their lines were dubbed). The sole professional actor of the movie was Jean Martin, who played Colonel Mathieu; Martin was a French actor who had worked primarily in theatre. Pontecorvo wanted a professional actor, but one who would not be familiar to most audiences, as this could have interfered with the movie's intended realism.</p><p>Martin had been dismissed several years earlier from the Théâtre National Populaire for signing the manifesto of the 121 against the Algerian War. Martin was a veteran; he had served in a paratroop regiment during the Indochina War and he had taken part in the French Resistance. His portrayal had autobiographical depth. According to an interview with screenwriter Franco Solinas, the working relationship between Martin and Pontecorvo was not always easy. Unsure whether Martin's professional acting style would contrast too much with the non-professionals, Pontecorvo argued about Martin's acting choices.</p><p>Saadi Yacef, who plays El-Hadi Jaffar, and Samia Kerbash, who plays Fathia, were both members of the FLN and Pontecorvo is said to have been greatly inspired by their accounts. The actors credited are:</p><ul><li>Jean Martin as Colonel Philippe Mathieu</li><li>Saadi Yacef as El-Hadi Jafar</li><li>Brahim Haggiag as Ali La Pointe</li><li>Tommaso Neri as Captain Dubois</li><li>Samia Kerbash as Fathia</li><li>Ugo Paletti as a Captain</li><li>Fusia El Kader as Halima</li><li>Franco Moruzzi as Mahmoud</li><li>Mohamed Ben Kassen as Little Omar</li></ul><h4>Sound and music</h4><p>Sound – both music and effects – perform important functions in the movie. Indigenous Algerian drumming, rather than dialogue, is heard during a scene in which female FLN militants prepare for bombings. In addition, Pontecorvo used the sounds of gunfire, helicopters and truck engines to symbolize the French methods of battle, while bomb blasts, ululation, wailing and chanting symbolize the Algerian methods. Gillo Pontecorvo wrote the music for The Battle of Algiers, but because he was classified as a \"melodist-composer\" in Italy, he was required to work with another composer as well; his good friend Ennio Morricone collaborated with him. The solo military drum, which is heard throughout the film, is played by the famous Italian drummer Pierino Munari.</p><br/><h3>Post-release history and legacy</h3><h4>Critical reception</h4><p>Pontecorvo resisted the temptation to romanticise the protagonists. He portrays the cruelty of attacks committed by both the FLN and the French. The film won the Golden Lion at the Venice Film Festival and was nominated for three Academy Awards (in non-consecutive years, a unique achievement): Best Foreign Language Film in 1967, and Best Screenplay (Gillo Pontecorvo and Franco Solinas) and Best Director (Gillo Pontecorvo) in 1969.</p><p>Other awards include The City of Venice Cinema Prize (1966), the International Critics Award (1966), the City of Imola Prize (1966), the Italian Silver Ribbon Prize (director, photography, producer), the Ajace Prize of the Cinema d'Essai (1967), the Italian Golden Asphodel (1966), Diosa de Plata at the Acapulco Film Festival (1966), the Golden Grolla (1966), the Riccione Prize (1966), Best Film of 1967 by Cuban critics (in a poll sponsored by Cuban magazine Cine), and the United Churches of America Prize (1967).</p><p>Roger Ebert gave the film 4/4 stars, calling it \"a great film\" that \"exists at this level of bitter reality. It may be a deeper film experience than many audiences can withstand: too cynical, too true, too cruel and too heartbreaking. It is about the Algerian war, but those not interested in Algeria may substitute another war; The Battle of Algiers has a universal frame of reference\". The film occupies the 48th place on the Critics' Top 250 Films of the 2012 Sight & Sound poll, as well as 120th place on Empire magazine's list of the 500 greatest movies of all time. In 2010, Empire also ranked the movie 6th in The 100 Best Films Of World Cinema. It was selected to enter the list of the \"100 Italian films to be saved\".</p><p>The American film director Stanley Kubrick praised the film by stating: \"All films are, in a sense, false documentaries. One tries to approach reality as much as possible, only it’s not reality. There are people who do very clever things, which have completely fascinated and fooled me. For example, The Battle of Algiers. It’s very impressive.\" Also, according to Anthony Frewin, Kubrick's personal assistant, he stated: \"When I started work for Stanley in September 1965 he told me that I couldn’t really understand what cinema was capable of without seeing The Battle of Algiers. He was still enthusing about it prior to his death.\"</p><p>The Greek-French political filmmaker Costa-Gavras listed the film as a influence on his filmmaking.</p><p>The American filmmaker Steven Soderbergh listed the film as an inspiration on his film Traffic noting that the film (along with Costa-Gavras's Z) had \"that great feeling of things that are caught, instead of staged, which is what we were after.\"</p><p>The American actor and filmmaker Ben Affleck listed The Battle of Algiers as a influence for his film Argo.</p><p>The British-American filmmaker Christopher Nolan listed the film as one of his favorites and is credited for inspiring his films such as The Dark Knight Rises and Dunkirk.</p><p>The Palestinian-American academic Edward Said (famous for his work Orientalism) praised The Battle of Algiers (along with Pontecorvo's other film, Burn!) as the two films \"...stand unmatched and unexcelled since they were made in the 60s. Both films together constitute a political and aesthetic standard never again equaled.\"</p><p>The British-Pakistani writer and activist Tariq Ali has placed The Battle of Algiers in his top 10 films list for the Sight and Sound poll of the greatest films of all time.</p><p>The German filmmaker Werner Herzog admired the film and it was one of the few films that was required viewing to his film school students.</p><p>The English filmmaker Ken Loach listed the film as one of his top 10 favorite films of all time and mentioned the film's influence on his filmmaking by saying: “It used non-professional actors. It was not over-dramatic. It was low key. It showed the impact of colonialism on daily lives. These techniques had an important influence on my filmmaking… I saw the film when it came out in 1966. It was one of a number of films that influenced me.\"</p><p>On review aggregation website Rotten Tomatoes, the film holds an approval rating of 99% based on 87 reviews, with an average rating of 9.06/10; the site's consensus reads: \"A powerful, documentary-like examination of the response to an occupying force, The Battle of Algiers hasn't aged a bit since its release in 1966.\" On Metacritic, the film has a weighted average score of 96 out of 100 based on 22 critics, indicating \"universal acclaim\".</p><p>In 2007, the film was ranked at No. 5 by The Guardian's readers' poll on its list of \"40 greatest foreign films of all time\".</p><p>Not all reception was positive. In France, Cahiers du cinéma devoted a special feature to the film consisting of five articles by critics, philosophers, and film scholars. Their collective negative assessment of the film was cast in such strong terms that \"it undermined, on moral grounds, the legitimacy of any critic or analyst who did not condemn the film, let alone anyone who dared consider it worthy of filmic attention.\"</p><h4>Banned in France</h4><p>Given national divisions over the Algerian War, the film generated considerable political controversy in France and was banned there for five years, with the official government ban of one year succeeded by the decision of private theater owners to not screen the film for another four. People continued to argue about the grounds of the war and colonialism, and argued anew over how these were portrayed in the film. This film was the first available to Metropole French that directly confronted French imperialism. The director received death threats from persons on the far right sympathetic to the French military view.</p><p>Pontecorvo stated \"The Algerians put no obstacles in our way because they knew that I'd be making a more or less objective film about the subject. The French authorities, who were very sensitive on the Algerian issue, banned the film for three months.\" Due to repeated threats of violence from fascist groups, the government banned screenings of the film for four years, although Pontecorvo believed he had made a politically neutral film.</p><h4>The Battle of Algiers and guerrilla movements</h4><p>The release of The Battle of Algiers coincided with the decolonization period and national liberation wars, as well as a rising tide of left-wing radicalism in Western nations in which a large minority showed interest in armed struggle. Beginning in the late 1960s, The Battle of Algiers gained a reputation for inspiring political violence; in particular, the tactics of urban guerrilla warfare and terrorism in the movie supposedly were copied by the Black Panthers, the Provisional Irish Republican Army, the Palestinian Liberation Organization and the Jammu Kashmir Liberation Front. The Battle of Algiers was apparently Andreas Baader's favourite movie.</p><br/><h3>Screenings worldwide</h3><h4>1960s screening in Argentina</h4><p>President Arturo Frondizi (Radical Civic Union, UCR) directed introduction of the first course on counter-revolutionary warfare in the Higher Military College. By 1963, cadets at the Navy Mechanics School (ESMA) started receiving counter-insurgency classes. In one of their courses, they were shown the movie The Battle of Algiers. Antonio Caggiano, archbishop of Buenos Aires from 1959 to 1975, was associated with this as military chaplain. He introduced the movie approvingly and added a religiously oriented commentary to it. ESMA was later known as a center for the Argentine Dirty War and torture and abuse of insurgents and innocent civilians.</p><p>Anibal Acosta, one of the ESMA cadets interviewed 35 years later by French journalist Marie-Monique Robin, described the session:</p><blockquote>They showed us that film to prepare us for a kind of war very different from the regular war we had entered the Navy School for. They were preparing us for police missions against the civilian population, who became our new enemy.</blockquote><h4>2003 Pentagon screening</h4><p>During 2003, the press reported that United States Department of Defense (the Pentagon) offered a screening of the movie on August 27. The Directorate for Special Operations and Low-Intensity Conflict regarded it as useful for commanders and troops facing similar issues in occupied Iraq.</p><p>A flyer for the screening said:</p><blockquote>How to win a battle against terrorism and lose the war of ideas. Children shoot soldiers at point-blank range. Women plant bombs in cafes. Soon the entire Arab population builds to a mad fervor. Sound familiar? The French have a plan. It succeeds tactically, but fails strategically. To understand why, come to a rare showing of this film.</blockquote><p>According to the Defense Department official in charge of the screening, \"Showing the film offers historical insight into the conduct of French operations in Algeria, and was intended to prompt informative discussion of the challenges faced by the French.\"</p><h4>2003–2004 theatrical re-release</h4><p>At the time of the 2003 Pentagon screening, legal and \"pirate\" VHS and DVD versions of the movie were available in the United States and elsewhere, but the image quality was degraded. A restored print had been made in Italy in 1999. Rialto Pictures acquired the distribution rights to re-release the film again in the United Kingdom in December 2003 as well as in the United States and in France on separate dates in 2004. The film was shown in the Espace Accattone, rue Cujas in Paris, from November 15, 2006, to March 6, 2007.</p><h4>2004 Criterion DVD edition</h4><p>On October 12, 2004, The Criterion Collection released the movie, transferred from a restored print, in a three-disc DVD set. The extras include former US counter-terrorism advisors Richard A. Clarke and Michael A. Sheehan discussing The Battle of Algiers's depiction of terrorism and guerrilla warfare. Directors Spike Lee, Mira Nair, Julian Schnabel, Steven Soderbergh, and Oliver Stone discussed its influence on film. Another documentary in the set includes interviews with FLN commanders Saadi Yacef and Zohra Drif.</p><h4>2011 Criterion Blu-ray edition</h4><p>A new high-definition digital transfer, supervised by director of photography Marcello Gatti, was released by Criterion on Blu-ray Disc in 2011.</p><br/>"
  },
  "errorMessage": ""
}