{
  "imDbId": "tt0060196",
  "title": "The Good, the Bad and the Ugly",
  "fullTitle": "The Good, the Bad and the Ugly (1966)",
  "type": "Movie",
  "year": "1966",
  "items": [
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw1405659",
      "warningSpoilers": false,
      "date": "29 June 2006",
      "rate": "10",
      "helpful": "242 out of 270 found this helpful.",
      "title": "For a girl who doesn't enjoy westerns much, this was one of the greatest films ever!",
      "content": "Gosh, The Good, the Bad, and the Ugly, I finally saw this film! Who hasn't heard of it? First off, may I say that Clint Eastwood... what a hottie in his day! :D Sorry, had to get that off my chest. Sergio Leone from what I understood was a huge western film fanatic and in the 60's pretty much most folks had moved onto other genre's. I mean, I would agree that most western's are pretty much the same and stereotypical.Sergio however took a story and added some elements to it such as comedy, drama, and war. The story flows so well and just compliments all of it's characters. By far my favorite character was The Good, played by Clint. He is a bounty hunter who captures The Ugly numerous times just to free him before every hanging and splits the winnings with him. When they learn of a coffin in the desert that has $200,000, they go for it. Of course we have the Bad who is a ruthless killer who also wants in on the doe.The Good, The Bad, and The Ugly is a terrific film and I thank all the IMDb users for their useful comments and that pushed me to finally rent this western classic. Let's give it up for Sergio! 10/10"
    },
    {
      "username": "MadReviewer",
      "userUrl": "https://www.imdb.com/user/ur1125206",
      "reviewLink": "https://www.imdb.com/review/rw0092718",
      "warningSpoilers": false,
      "date": "16 April 2001",
      "rate": "10",
      "helpful": "820 out of 900 found this helpful.",
      "title": "Brutal, brilliant, and one of the best Westerns ever made",
      "content": "A sprawling Western epic that follows the adventures of three gunfighters looking for $200,000 in stolen gold, Sergio Leone's `The Good, the Bad, and the Ugly' is a masterpiece, one that continues to get better and better with each viewing. In a way, it's a morality play, weighing the consequences of good and evil, but it does so in a realistic manner. Sometimes, crime does pay, at least in the short term, and sometimes good does go unrewarded. This film probably signaled the death knell of the traditional John Wayne `White Hat/Black Hat' Western.The three main characters make the film. Lee Van Cleef (`The Bad') is evil personified. Totally ruthless, he'll do whatever it takes to get what he wants. Clint Eastwood (`The Good') is the Man With No Name, not really `good' in a traditional sense . . . but he has a certain sense of honor and tries to do the right thing. (Watch the scene when he gives a dying Confederate soldier a puff of his cigar - powerful, and it sums up everything that the Man With No Name is all about, without saying a single word.) Eli Wallach (`The Ugly') is Tuco, and he's easily the most complex - if not the best - character in the film. All impulse and rage, Tuco spins wildly throughout the movie, stealing, lying, pretending to be Clint Eastwood's best friend in one scene, trying to kill him in another - Tuco truly represents `the ugly' side of people.The movie is long, but there's not a wasted scene in the film. Each one slowly lets the film unfold with a certain style and grace, revealing more about each character and what's going on. The pacing is incredible, as is the direction - Sergio Leone manages to build a lot of uncomfortable tension in the film, keeping the film from ever getting predictable. Any typical Western cliché that you can possibly think of is either given a unique twist or utterly destroyed by Leone's masterful storytelling. Of special mention is Ennio Morricone's score, which is absolutely perfect. Two scenes - one in a Union prison camp, one in the climatic gunfight in the cemetery at the end of the film - are amazing on their own, but they become absolutely astonishing with combined with Morricone's powerful score. This movie is absolutely brilliant. If you haven't seen it yet, I strongly urge to do so. Immediately. (And then, go watch `Unforgiven' . . . in a way, I think that `Unforgiven' is the sequel to `The Good, the Bad, and the Ugly - it's the story of what eventually happened to the Man With No Name.) `The Good, the Bad, and the Ugly' is easily one of the best Westerns ever made. A++"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0092829",
      "warningSpoilers": true,
      "date": "1 January 2004",
      "rate": "10",
      "helpful": "200 out of 238 found this helpful.",
      "title": "Sergio Leone's penultimate Italian-western; a film that gets better with each passing year...",
      "content": "...and though those last several words could also be attributed to Leone's \"Once Upon a Time\" films (West and America) as well as the other pieces in his trilogy of films with Clint Eastwood- Fistful of Dollars and For a Few More Dollars- arguably this is the most ambitious and spellbinding one of the bunch, and one that has inspired (i.e. Quentin Tarantino, Sam Raimi, Robert Rodriguez) and will most likely continue to inspire filmmakers and fans into the 21st century. There's something in The Good, the Bad, and the Ugly that's nearly (or perhaps is) mythical in it's craft, certain scenes come off as being more than relevant and exquisite for that scene/sequence- it transcends into aspects of humanity.For example, in the first part of the film (this is after the extraordinary introductions to Tuco, played by Eli Wallach, Sentenza or 'Angel Eyes', played by Lee Van Cleef, and as Blondie by a 35/36 year old Clint), Joe gets Tuco out of a hanging, which is something of a regular practice for them, but Joe decides to leave his 'buddy' out in the desert to walk the rest of the way back into town. A little later, the situation gets reversed, as Tuco has a horse and water and Joe doesn't, and they both go to cross the desert. Leone decides to not follow Tuco coming back to town as much as he follows in earnest Tuco and Joe going across that desert, as Joe starts to burn and dry up, going towards a story that will soon unfold. There is something to these scenes that I can barely describe, that they're executed in the mind-set of a Western, but in the abstract Leone lets the audience know this is a story that is bold and bigger than life.What makes much of the Good, the Bad, and the Ugly such a huge success is the trust Leone had in his own style he spun into his own after the first two westerns, his trust in his collaborators, and in his leading players as well. I, for one, had to mistakenly figure out that it is near depressing to watch this film on a regular VCR tape due to the pan & scan process. There is such a clear, distinct visual scope that Leone and camera director Tonino Delli Colli achieve that it's practically a must to get the DVD (preferably the extended version, which was Leone's original cut more or less). The editing, too, is unique in many sequences (the climax is the most noted and memorable). The score, with usual collaborator Ennio Morricone, is one of the landmark movie scores, and themes, of not just in the western genre but in all movie history. And the three main players who take on the screen have their own chops to show off: Eastwood, technically, was playing a Joe that took place before Fistful of Dollars, yet by this film had it down to a T (it's still my favorite performance from him, despite having few words and reactions); Cleef's cold, cunning Angel Eyes steals the scenes he's in; ditto for Wallach, who gets under the skin of his co-patriots as much as he sometimes does under the viewer's. If anyone really stays in the mind, at least for me, it's Wallach - especially as he gets the most 'character', and one of the very best scenes is between Tuco and his religious brother. Without that scene, the movie actually wouldn't work quite as well, surprisingly enough. Overall, The Good, the Bad and Ugly, is an entirely satisfying western, at least one of my five favorites ever made, and it's an endearing bravo to all who were involved."
    },
    {
      "username": "murtaza_mma",
      "userUrl": "https://www.imdb.com/user/ur19117722",
      "reviewLink": "https://www.imdb.com/review/rw2025669",
      "warningSpoilers": false,
      "date": "19 February 2009",
      "rate": "10",
      "helpful": "203 out of 225 found this helpful.",
      "title": "The Good, the Better, the Best",
      "content": "The Good, the Bad and the Ugly or the Good, the Better and the Best, as I prefer calling it, is a bizarrely sublime and a uniquely aesthetic masterpiece. The actors in title roles have given such extraordinarily superb performances, that it would be impertinent and disparaging to merely regard their swell work as acting. In fact their brilliant portrayals have immortalized Blondie, Sentenza/ Angel Eyes and the enigmatic Tuco. Lee Van Cleef is fiendishly unforgiving as the merciless Angel Eyes. Clint Eastwood is rugged yet suave, cocky yet adorable as laconic cigar-smoker Blondie, a role that laid the foundations of his illustrious career. But it is Eli Wallach, who steals the show with his captivating portrayal of Tuco, a portrayal that is as entrancing as it is enlightening. Wallach is amusing, capricious, nonchalant, uncanny and yet tenacious as Tuco, perturbed by his insecurities and dampened by his solitude. It is the tacit amicability between Blondie and Tuco and their mutual hostility towards the evil Angel Eyes owing to the vestiges of virtue present in them, redolent of their moribund morality, which gives the story, the impetus and the characters, a screen presence that is not only awe inspiring but also unparalleled.Sergio Leone's magnificent and ingenious direction in synergy with Ennio Morricone's surreal music, Tonino Delli Colli's breathtaking cinematography and Joe D'Augustine's punctilious editing makes the movie, a treat to watch and ineffably unforgettable. Initially aimed to be a tongue-in-cheek satire on run-of-the-mill westerns, The Good, the Bad and the Ugly, continues to stand the test of time in its endeavor to attain apotheosis (if it hasn't attained it yet). It will always be remembered as European cinema's greatest lagniappe, not only to the Western genre, but to the world of cinema.It's a must watch for any movie lover. 10/10"
    },
    {
      "username": "spider89119",
      "userUrl": "https://www.imdb.com/user/ur5890948",
      "reviewLink": "https://www.imdb.com/review/rw1157588",
      "warningSpoilers": false,
      "date": "24 August 2005",
      "rate": "10",
      "helpful": "497 out of 559 found this helpful.",
      "title": "the greatest of the great!",
      "content": "I wasn't sure if I was going to comment on this film because everything has already been said by the hundreds of other people who have posted their thoughts, but I decided that I should really put my two cents in since this is my favorite movie.This film, in my opinion, is not only the greatest spaghetti western of all time. It is the greatest movie of all time. Period. Regardless of genre. I could probably watch it every day, and be perfectly happy doing so.The music is perfection. The way the music drives this movie is absolutely amazing. The musical genius of Morricone and the incredible direction of Sergio Leone is a combination that will probably never be equaled. The theme song will forever be etched in your brain. In fact, it probably already is, even if you haven't seen the movie! The scene where Tuco runs through the graveyard with the song \"Ecstacy of Gold\" is pure poetry. And the showdown at the end with that great music- just incredible.The story is riveting. There is not a single dull moment. The movie is long, but Leone's direction is so good that you will love the fact that you can enjoy this movie for three hours.Lee Van Cleef is my favorite spaghetti western actor, and he is incredible as \"Angel Eyes.\" It is the part he was born to play. Eli Wallach is perfect as Tuco. He really shines in this movie. Some people say he steals the show, and I can see why they think so. Eastwood is excellent as \"Blondie,\" although I don't think Eastwood has as strong of a presence as Van Cleef (I know many will disagree, and that's OK because all three actors are superb in this film so why split hairs?).This movie is hypnotic. It's operatic. It's sad. It's funny. It's gritty. It's violent. It's art. It's action. It's pure entertainment. The film is just so incredible on so many different levels that EVERYONE should see it, regardless of what kinds of movies they are into. And it's so cool that the greatest flick ever just happens to be a spaghetti western. If you haven't seen this movie, stop what you are doing, and go get it now!!"
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw4059544",
      "warningSpoilers": false,
      "date": "11 February 2018",
      "rate": "10",
      "helpful": "136 out of 153 found this helpful.",
      "title": "A Cinematic Masterpiece - And Also The Most Entertaining Western Of All Time",
      "content": "I'll keep this brief: This is simply one of the most entertaining and best looking westerns ever. Director Sergio Leone's unique use of the camera - long, uninterrupted shots in wide angle alternating with extreme close-ups - and Ennio Morricone's unique, wildly inventive soundtrack are blended to perfection. The career-making performances by Eli Wallach (hilarious), Lee Van Cleef (chilling) and Clint Eastwood (cool) are nothing short of iconic, and the film's finale is so good it will send shivers of cinematic joy down your spine. It's a movie of epic proportions; it's funny and violent, but underneath it all there is a strong anti-war message. It's a cinematic masterpiece and one of the most influential movies of all time. Oh, and it's also tons of fun, and you should see it on the biggest screen possible. 10 stars out of 10.Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/"
    },
    {
      "username": "Steffi_P",
      "userUrl": "https://www.imdb.com/user/ur3063013",
      "reviewLink": "https://www.imdb.com/review/rw1529508",
      "warningSpoilers": false,
      "date": "25 November 2006",
      "rate": "10",
      "helpful": "49 out of 55 found this helpful.",
      "title": "\"There are two kinds of people in this world, my friend\"",
      "content": "Sergio Leone always wanted every picture he made to be, in every way, bigger than the one which preceded it. With the Good, the Bad and the Ugly he continued his upward trajectory and rounded off his dollars trilogy in style.This picture was Leone's most stylised and grandiose to date, and brought all the themes and styles he had been developing in his earliest films to perfection. Among the most notable was his characterisation, particularly his all-important introductions of characters. Look at the introductory scenes of the three leads. We first see Tuco bursting out of a window, obviously interrupted in the middle of a meal, and straight away we get his freeze-frame and the title \"the ugly\"  this is a simple character, and needs no further introduction. Angeleyes appears out of the distance, but grows towards us until his face fills the screen. We see him commit two despicable acts of murder and treachery before we get his freeze-frame and title \"the bad\", telling us he is pure evil. Finally, in Blondie's first appearance he steps into the frame from behind the camera, as if he had always been there. He rescues Tuco, but only for his own profit. It's not until we have seen him betray and abandon Tuco that we get his freeze-frame and title \"the good\"  obviously a fairly ironic label given the way he has just acted.Leone's trademark long drawn out face-offs  exaggerated versions of the shootouts of John Ford westerns and the sword duels of Kurosawa's samurai films  are also brought to a peak here. Not only are they now taken to absurd heights of stylisation, they are also spread out and adapted to cover the whole picture, until the point where even two men sitting opposite each other eating a meal and glancing suspiciously at one another is treated like another stand off. In fact, the entire film can be considered one long series of duels.We also see more of the importance Leone attaches to church and family. The Dollars trilogy could be thought to lack emotion, taking place as it does in a world where there are no morals and everyone is out for gold. However the Good, the Bad and the Ugly contains several moments of poignancy, perhaps the most prominent of which is when Tuco confronts his estranged priest brother.Religious iconography and references crops up time and again. Leone loved biblical epics almost as much as he loved westerns, and there is something of the feel of those pictures here in the overwhelming landscapes and eerie, choral music. On top of this the central trio can be read as an allegory for God, the Devil and humanity. This arguably presents rather a cynical view of the Catholic faith  given the treacherous and chequered nature of the \"good\"  but it could be argued to be a typically Italian one. In a country in which the church is so omnipresent and universally accepted, it's sometimes said that God is cursed as much as loved. Having said that, this was clearly never intended as the central theme  Leone wasn't trying to make some grand statement here  it's simply part of the mix of ideas going on in this picture.This brings me onto the war theme. Anti-war sentiments are not directly addressed in this picture, but the way the civil war is woven into the plot makes a powerful statement. For the first half hour we don't see that the war is going on. The central characters aren't concerned with the it  they are only interested in hunting down the gold. However the war encroaches on the plot more and more often, until it moves from background to foreground and takes over the entire picture, culminating in a colossal battle scene. And of course the fact that the film ends in a huge military graveyard is also very significant.I've spent so long talking about the themes and ideas going on in this film I've nearly run out of space to talk about all the genius that has gone into making it so enjoyable. The dialogue is superb, often funny and plenty of it quotable. Technically Leone has perfected his art  he composes a shot like John Ford, edits like Eisenstein, paces like Kurosawa, but all with a degree of his own originality. There is brilliant acting  Eli Wallach steals it as Tuco, probably his best ever performance. It's funny how Lee Van Cleef was cast as a villain here. Van Cleef's early career mostly involved playing mean-looking gang members, but as Leone discovered when casting him as the hero in For a Few Dollars More, while his face said \"bad guy\" his voice and manner could be warm and likable. The good guy Van Cleef obviously proved more popular, as in the dozen or so other spaghetti westerns he made for other directors he was invariably cast as the hero.Just time for a final word on the recent (2003) restored edition. While it's great that several lost scenes have been added, I have to say that very few of them were entirely necessary. The only one of the added scenes I really like is the one in which Angeleyes visits the field hospital  it keeps his story arc going, and also shows an act of compassion from the \"bad\" when he lets the soldier keep the bottle. However the new dubbing for these scenes, strange as it may seem considering today's technology, is mixed absolutely atrociously. On top of this, Clint Eastwood and Eli Wallach are now so elderly, they actually sound less convincing than the guy impersonating the late Lee Van Cleef. As a result the restored segments stick out like sore thumbs, and break up the flow of what is in every other way a perfect motion picture."
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw4245844",
      "warningSpoilers": false,
      "date": "20 July 2018",
      "rate": "10",
      "helpful": "43 out of 47 found this helpful.",
      "title": "The best Western ever made",
      "content": "Filmed in Spain by Italian filmmaker, this is the best Western ever made. With Hollywood actors but fittingly, not made in Hollywood, it was despised by the mainstream at the time, but also recognized for its genius and is the most famous part of the most famous Western trilogy. Building on a rich Italian storytelling and film making tradition, with unforgettable score, this movie has justly taken the place it now holds. If you have not seen it yet, do it. Equally subversive and authentic, this is just one master piece nobody should miss."
    },
    {
      "username": "dr_foreman",
      "userUrl": "https://www.imdb.com/user/ur1052098",
      "reviewLink": "https://www.imdb.com/review/rw1454218",
      "warningSpoilers": false,
      "date": "21 August 2006",
      "rate": "10",
      "helpful": "283 out of 347 found this helpful.",
      "title": "The King of Cool",
      "content": "On a partial first viewing, I didn't like \"The Good, the Bad and the Ugly.\" I thought it was a slow, tedious story about a bunch of unpleasant jerk characters involved in a bog-standard conflict over money. It all seemed very macho and self-consciously cool, and it had obviously inspired all the overrated macho directors I don't like in my own generation - Tarantino, for example, and Robert Rodriguez. In short, I was unimpressed.Years later, I gave the film a second shot, watching it all the way through this time. I loved it. What had changed? For one thing, I took more notice of the technical side of the film. I paid attention to Leone's famous use of close-ups, his selection of memorable character actors, and his wonderful scene-setting. I admired the detailed sets and the sweeping landscapes, the props and the costumes and all those weird, wonderful faces that Leone clearly loved to photograph.I also got hooked by some of the quieter moments that I had skipped over in my first viewing. One of the most effective scenes involves Eli Wallach's character, Tuco, quarreling with his brother when they meet after they've been apart for years. Their argument is great, emotionally charged stuff, made all the more effective by the suggestion that they really do love and care about each other. It's the kind of sensitive, human scene you never get to see in a Tarantino or Rodriguez movie.Before I get too fuzzy-wuzzy, I should also like to point out that, on my second viewing, I LOVED all the action, too. Every gunfight is great, in its own way, and they're all a bit different. The greatest of them all is, of course, the final confrontation between the trio, which is accompanied by some of the most rousing music I've ever heard in a film. And hey, there's even a huge Civil War battle to provide a change of pace from all the small-scale action.Ultimately, \"The Good, the Bad and the Ugly\" is probably just a potboiler of a film, without too much to say about, for example, the human condition. But what a potboiler! It doesn't have to try to be cool - it simply IS cool. In fact, it probably defined heroic coolness for an entire generation. Eli Wallach's performance, Leone's direction and Morricone's music alone are enough to elevate it to classic status - and the fact that everything else in the movie is great, too, helps elevate it to the level of perhaps the greatest action film ever made.And to think, I missed all that the first time through..."
    },
    {
      "username": "steven-f-freeman",
      "userUrl": "https://www.imdb.com/user/ur8111246",
      "reviewLink": "https://www.imdb.com/review/rw1786943",
      "warningSpoilers": false,
      "date": "26 December 2007",
      "rate": "10",
      "helpful": "180 out of 195 found this helpful.",
      "title": "Primal honesty and morality",
      "content": "After many years of barely watching any movies, I treated myself to several classics recently. And this was the best.That I so enjoyed this movie so much came as a shock to me. I literally never before have been able to even sit through a western, which (in my admittedly limited experience) was schlock action starring John Wayne as the taciturn all-American good guy being tough and beating up the outlaws. Watching GBU, I was enthralled for the entire three hours. Twice. And if I had time, I would have watched it a third time. The setting is typically western: a dry, dusty panorama in which men barely co-exist with each other; few wasted words; and lots of action, horses, and gunfighting in a wild west barely governed by incipient institutions of law & order  all shrouded within a morality play of good vs. bad. But what I liked so much is exactly what I hate about John Wayne westerns  the seriousness and honesty with which moral context is considered. In Hollywood, good vs. bad is as thoughtlessly superscripted as the protagonists' white and black hats. In GBU every remnant of moralizing has been ruthlessly cut.Good, Bad, and Ugly are personified in the form of three characters: Bad (\"Sentenza\") is the easiest to understand. He is *very* bad, perhaps not so different from other villains, but much more sharply developed; murderous, sadistic, traitorous, and remorseless. Good (\"Blondie\") and Ugly (\"Tuco\") are more puzzling, but their labels are the key to the movie. Both Blondie and Tuco are outlaws and killers with only the barest hint of morality, but they're not evil in the same way that Sentenza is. Tuco is demonstrative, emotional, loud, wild, and unpredictable; but driven by survival rather than satanic urges. Blondie is cool, calm, rational and controlled  in many ways similar to Sentenza  but whereas Sentenza tortures, maims, kills, and lies for the hell of it, even apparently enjoys it, Blondie simply goes about his business coolly, and shows several poignant hints of empathy, decency, and a sense of justice.GBU takes place during the Civil War and strips away the high-level political struggle of history books, leaving us with the soldier's vantage point of brutality, pointless death, and some individual decency. The politics are indecipherable from this vantage point. GBU hits this point home when our protagonists wind up in a prison camp because the oncoming gray cavalry uniforms turn out to be dust-covered blue. Later, they encounter an army fighting over a worthless bridge, suffering countless pointless deaths and casualties. Because Leone has so rigorously excised traditional off-the-shelf morality, the few instances of humanity are remarkably poignant. One such instance is when Blondie shares his coat and cigar with a dying soldier; another is when prisoners are forced  by Sentenza's orders  to play music to cover up the screams of the tortured. Sentenza apparently enjoyed the irony of beautiful sounds used for such ends; the musicians are, of course, pained by it.That was one of many extraordinarily striking scenes. The honesty of the moral context was what I liked best about the film, but I liked everything else too. Indeed the same primal, ruthless honesty that characterizes the character development pervades the film. The music is unlike anything I'd ever heard  it's an audible version of the arid west and the tensions and lawlessness that characterize the film. Underlying the entire score is one instantly memorable theme starting off with what sounds like a screaming hyena. The story took place in New Mexico, and even though it was filmed in Spain, it really does look like New Mexico; and just as in life in the American west, the wide, breathtaking panorama tends to subordinates dialog. Indeed, it is several minutes into the film before even one word is spoken.The plot was extremely clever  and never predictable. High level suspense is maintained for the full three hours. It was hard to imagine how it could unfold  three uncompromising outlaws in search of one buried treasure; cooperation was not in their nature, but nothing was ever done out of character. Any Western cliché that you can think of is either given a unique twist or destroyed by masterful storytelling. For example there is an utterly irreverent scene in which Tuco meets his brother, a sincere Priest, and turns platitudes upside down. The brother begins with the standard rebuke of the criminal's behavior, but Tuco punches back and says, \"Where we come from there were only two ways out. You lacked the courage to do what I've done.\" The movie is also irreverently funny: For example, Twice Tuco gained the upper hand on Blondie and said:\"There are two kinds of spurs(?), my friend. Those that come in by the door, and (crosses himself) those that come in by the window.\"\"There are two kinds of people in the world, my friend. Those who have a rope around their neck and those who have the job of cutting.\" Later Blondie gained the advantage of Tuco and observed: \"You see in this world there's two kinds of people my friend - those with loaded guns, and those who dig. You dig.\" In addition to all these specific attributes, a unique and strikingly cool style infuses the entire film: long scenes of tense silences  never for an instant boring; and telling, startling close-ups and transitions. Most noteworthy was the film's climax. As the protagonists stand there with their fingers on their holsters, waiting for the first person to go for their gun(s), the transitions start out slowly, and speed up as the tension increases. As I write this, I wish I had my own copy of the film, just so I could see this scene again.Not just a great western, but easily one of the best movies of *any* kind ever made."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8902036",
      "warningSpoilers": false,
      "date": "2 March 2023",
      "rate": "10",
      "helpful": "20 out of 21 found this helpful.",
      "title": "Made me love Western. Brilliant! ⭐",
      "content": "I wasn't aware of the wild taste of Western. This movie made me love Western. I don't know any movie can achieve being this much effective nearly without any drama. Nearly every great movie is carried by some drama between characters.Yes it has a little bit drama. It shows the greediness of humanity just like The Treasue of Sierra Madre. It refletcs conflicts between three different types of men. Also I love how Eastwood's character is nameless in The Man Without Name Trilogy. Sometimes the trilogy also called The Dollar Trilogy.Besides the storyline the techincs are breathtaking.Acting performances are just breathtaking. If you didn't notice that much of acting skills, then you should check Trivias of the movie.The Scores just one of the bests. Morricone just made the most iconic scores. From that time until now, every Western score has his iconic type.Set decoration is about something enormous in this movie. They really did something great with that too.Costume design and makeups are also so good. You can see it in the battle scenes and in the desert scenes.Sound is really good, the only decent thing is Film Editing. Especially in the Extended Versions some flaws appears."
    },
    {
      "username": "Stamp-3",
      "userUrl": "https://www.imdb.com/user/ur0368923",
      "reviewLink": "https://www.imdb.com/review/rw0092656",
      "warningSpoilers": true,
      "date": "29 August 1999",
      "rate": "10",
      "helpful": "100 out of 113 found this helpful.",
      "title": "film making of the highest order",
      "content": "The whole picture is superb, but the closing twenty minutes or so are simply breathtaking. From when the dust clears after the bridge blows, the movie develops a momentum that doesn't let up until the very last shot.The dying soldier; Tuco being blasted from the horse and crashing into the gravestone; Tuco running round and round the graveyard (how was that shot?); the way the three protagonists come together; the shootout; Tuco and Blondie playing out their last confrontation; and then a final wail,the guitars come in one more time and Clint just rides hell for leather out across the desert.It's cliché to say \"they don't make 'em like they used to\" but not only don't \"they\", \"they\" wouldn't have a clue how to make a movie like this any more."
    },
    {
      "username": "Dolf",
      "userUrl": "https://www.imdb.com/user/ur0134559",
      "reviewLink": "https://www.imdb.com/review/rw0092696",
      "warningSpoilers": true,
      "date": "6 January 1999",
      "rate": "10",
      "helpful": "421 out of 500 found this helpful.",
      "title": "The good, the better, the best.",
      "content": "This is without a doubt my all-time favorite western.The beginning of the film is so memorable, with the young, rough good-looks of Eastwood being labeled \"The Good\", the absolutely evil look of Lee Van Cleef being labeled \"The Bad\", and a dirty, unkempt, desperado Eli Wallach with booze and food flying being labeled \"The Ugly\". The ending fight scene with its 3-way showdown is one of the most memorable pieces of film I have ever watched.Leone did a great job with the camera direction in this movie and the acting is impressive. Eastwood, Van Cleef, and Wallach are absolutely fantastic.The only thing that might scare some viewers off is the length of the film. It is long, but you just don't seem to notice it when you are watching the film - you are just too damn busy watching the best classic western of all time.Do yourself a favor and rent this movie if you haven't seen it. If there was ever a perfect western, this is it."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0092811",
      "warningSpoilers": true,
      "date": "3 October 2003",
      "rate": "9",
      "helpful": "44 out of 56 found this helpful.",
      "title": "Sergio Leone's most visionary film...",
      "content": "Sergio Leone is arguably the most visionary director of all time. They say that before he even had a written script he could picture exactly what was to be on screen and the camera's direction in leading his characters. It was Sergio's World - an alternate place in an alternate time that he was free to control. He controlled the audience and his story like no other director.To me, his best film was the one that was on many critics' ten worst films of 1984 list: \"Once Upon a Time in America.\" I love the finished director's cut, the cut of the film Sergio Leone himself wanted and pictured in his mind while filming the movie. Unfortunately, the editor of the film cut everything into a two-hour picture and messed up the timeline for the theatrical release in 1984 - the result was a disastrous motion picture that now, with the director's cut, stands as one of the best of all time. James Woods once said that one of the critics who named it the worst film of 1984 later named it the best film of the decade.\"Once Upon a Time in America\" was Sergio's dream project, one that took him ten years to get on the big screen and ultimately killed him by sucking the life out of him, but \"The Good, the Bad and the Ugly\" (1967) was undoubtably his most visual film. The extreme close-ups, the great way he lets the audience see nothing but what he wants - as far as he saw it, the audience should not wonder what is off-screen; whatever is within the frames is all there is. Compared to \"Once Upon a Time\" it seems a bit more corny and unrealistic - but it is a spaghetti western, and that is simply the point. It stands above the rest as the best spaghetti western of them all.Leone is best remembered for his extreme close-ups. Director Quentin Tarantino once said, among many other things about Leone, his role model, that when he started out he knew not many camera directions, so when he wanted an extreme close-up in a film he'd shout, \"I want a Sergio Leone on this guy!\" Quentin Tarantino has such a respect for Leone that he even suggested the title \"Once Upon a Time in Mexico\" to director Robert Rodriguez, the title, of course, a derivation on \"Once Upon a Time in the West\" and \"Once Upon a Time in America,\" both films of Sergio Leone.\"The Good, the Bad and the Ugly,\" a.k.a. \"Buono, il bruto, il cattivo, il,\" is the final film in the Dollars Trilogy - \"A Fistful of Dollars,\" \"For a Few Dollars More,\" and, of course, \"The Good, the Bad and the Ugly.\" I have yet to see this film's predecessors, but I doubt they are much better than this film. It isn't really about anything per se - it's a showcase of art and camera techniques. It is a showcase for Sergio Leone and a great one at that. I have no real care about the themes or outcomes - I simply enjoy being controlled by a masterful director such as Leone. When there's a director who can literally push in and give the audience specifically what he wants them to see, without the audience feeling cheated, you know you have a great director, because there's a fine line between a selfish director and a visionary director. Leone has a bit of both, so indistinct that it is hard to notice. The same thing was done in Carol Reed's \"The Third Man\" (1949), and the same is done here. And it is pulled off without any objections from the audience.Clint Eastwood is The Good - he rides around the desert kidnapping criminals, giving them to the authorities and claiming reward money, and then freeing the criminals before they are to be hanged. He meets Tuco (Eli Wallach), a.k.a. The Ugly, and does his routine - but The Ugly fights back and, ultimately, kidnaps good ol' Clint, taking him into the desert and practically torturing him in the heat.Then The Good overhears where a stash of gold is hidden from a dying man. The Ugly wants the gold so much that he nurses The Good back to health so that they can go off on a wild goose chase and search for the treasure. But there is already another man searching for the treasure - Angel Eyes, a.k.a. The Bad (Lee Van Cleef), a man whose skills at gunfighting match those of The Good, a true marksman if ever there was such a thing.There's a terrific scene towards the end of \"The Good, the Bad and the Ugly,\" where three men have found the gold buried in a graveyard. At exactly the same time. They each have guns pointed at each other. They could all pull their triggers and die, or kill one of the three and the two could then take the money and split it. Leone zooms in with his extreme close-ups and truly gives the audience a sense of paranoia, a sense of what it would feel like in a circumstance such as that. Sergio Leone is a great director, perhaps the most visionary of all time, and now that his films are turning up again with their intended running times, the realization strikes and sinks in.He's an even better director than we thought he was.5/5 stars -John Ulmer"
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3541111",
      "warningSpoilers": false,
      "date": "9 September 2016",
      "rate": "10",
      "helpful": "41 out of 52 found this helpful.",
      "title": "What got Quentin Tarantino so damn excited...",
      "content": "One of the original Leone \"Italian Westerns\" that quickened the pulse of a young Quentin Tarantino.Sometimes I think I am living in a time warp. I watched all the Leone films in theatres in real time and was mesmerized, gob-smacked, and exhilarated. Now in the far future (2016) I watch QT do his knock-offs, and the young audiences (who have never seen the originals) think his are the originals, and everything else the knockoffs.(Reminds me of the Old King Cole nursery rhyme -- \"pulled out a plum and said What a Good Boy Am I\" -- another reference lost on those living the age of portable devices.) For those who actually care about the history of film: * Leone invented a brand new genre called the Italian western. His first, Fistful of Dollars, recycled a Japanese story (Yojimbo), recycled an American ex-pat whose Hollywood career was officially over (Eastwood) and introduced one of the greatest music composers of the modern film era, Ennio Morricone.* next came For a Few Dollars More, an original story, which locked into film history Leone's trademark use of closeups and sound editing, and brought out of mothballs Lee Van Cleef, one of the greatest \"faces\" in the history of the western. (\"Angel Eyes\" in this one.) * with two international hits under his belt, Leone aimed for the stars and created this movie which marks his legacy. While simultaneously continuing the tradition he started, and using the two stars from his second film, he gave Eli Wallach (an A-list star from the 1950s) the role of his career. Wait there is more. He set the story against the backdrop of the Civil War and manged to make the transitions seamless and brutally compelling. it is simultaneously a violent film and an anti-war film at the same time! (The only film of Leone's that may compete with this one is Once Upon a Time in America, also reviewed by this writer on the IMDb).By modern standards the film is overlong and, had it been produced in America (as was indeed the case with Upon a Time in America), the \"suits\" would have butchered it down to 100 minutes. Luckily for the rest of us, this was an international release, cut-proof, and survives very nicely to the present day in its original form.QT was a young lad when these films appeared but the impact is clear. He used Morricone's music in Kill Bill (his best film in my view) and in my view The Hateful Eight tries to emulate the power of Leone but falls somewhat short.For you youngsters out there, I recommend these films as some of the most entertaining efforts ever set to film, period. Imitated but not duplicated.Astonishing, mind-blowing, unforgettable."
    },
    {
      "username": "a_southern_knight",
      "userUrl": "https://www.imdb.com/user/ur3844483",
      "reviewLink": "https://www.imdb.com/review/rw0092861",
      "warningSpoilers": false,
      "date": "16 August 2004",
      "rate": "",
      "helpful": "537 out of 598 found this helpful.",
      "title": "Westerns don't get any better than this.",
      "content": "This is the third,and arguably the best, of the so-called \"spaghetti western\" trilogy. It is ironic that, at the time the three Sergio Leone westerns were released, they were largely panned by critics as being poor and even laughable imitations of American-made westerns. The fact that they were filmed in Italy and Spain resulted in them receiving their amusing nickname which was intended to degrade them at the time.Somehow, over the quarter century or so since their release, the critics have tended to change their opinions, and now these movies are generally regarded as classics. Perhaps this is because Clint Eastwood was principally known only as the second banana, Rowdy Yates, in the television series \"Rawhide\" when the films were produced but since then has achieved superstardom. But I also think it goes beyond that. I believe the critics decided to take another look at these films and realized that they had been premature in writing them off. Actually, I believe the three films were considerably better than most of what Hollywood produced. In fact, I think that TGTBATU ranks among the best westerns ever produced bringing to mind the magnificent films of John Ford, the undisputed master of that genre, and his protege, the incomparable John Wayne. I have nothing but praise for this film. In fact, I rank it as one of my favorite films of all time. I could write volumes of what is good about this film. But since its qualities have been oft repeated in other viewer reviews, I will focus on what others didn't like about it. Most of the IMDb reviews had only one major complaint: the film is too long. I disagree. In fact, in spite of its nearly three hour length, I was disappointed that it ended. I was so absorbed in the film that I was disheartened to have to return to reality. The combination of story, cinematography, acting and musical score left nothing to be desired other than more of the same! The sequences that seemed to drag on in the opinion of other reviewers were necessary to fully create moods and to drive home important points. For example, the opening sequence might be regarded as needlessly long as Angel Eyes taunts a hapless man over a leisurely meal. But to me, scenes like that are what makes the movie great! The time allows the viewer to fully appreciate the amazing replication of the primitive home and the pitiful life of its dirt-poor inhabitants. I felt as though I was sitting there at the table; I was half tempted to reach for a bowl and spoon to partake of the meal. And all the while the suspense was building towards the inevitable climax. You know it's coming but not when and the length of the scene drives you crazy but makes it all the more satisfying when it does happen. Another example is when Tuco punishes Joe by forcing him to walk through the desert. This is possibly the only time that one might become bored with the film. But again, I think the time for the scene was justified in that we are able to receive the full impact of that experience and enjoy the haunting music at the same time. Joe's subsequent predicament might not have had much credibility had this sequence been abbreviated. In my opinion, one of the essential elements of a great film is creating moods that absorb our attention. This often takes time, lots of time. For example, many of the scenes in the magnificent film \"Dr. Zhivago\" were almost painfully long but they were necessary to create those startling surrealistic moods, and the film would not have been great without them. In many ways, TGTBATU has this same sort of greatness. It is a sweeping epic with very compelling characters and magnificent settings that draws the viewer in and doesn't release him until the closing credits begin to roll. When it's over, you feel that you've been on a long and exciting journey. Such a journey takes time.In summary, if you haven't seen this film, buy it right away. Don't rent it because you will not want to part with it once you've seen it.Then curl up with it on a cold, rainy Sunday afternoon when you are in no hurry to do anything."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw0092682",
      "warningSpoilers": true,
      "date": "12 May 2000",
      "rate": "9",
      "helpful": "81 out of 111 found this helpful.",
      "title": "Sergio Leone was a highly personal filmmaker!",
      "content": "Sergio Leone's film follows the adventures of 3 ruthless outlaws...The 'Good' is Eastwood's unchanging and unshaven 'Stranger With No Name.' An unprincipled killer who stands only for his 45... He is quiet, inexpressive and cool, only seen once with a brief moment of humanity where his classic disinterest contrasts with the real tragedy of the American Civil War...The 'Bad' is an excellent supporting actor, a Western figure... With his long, thin opening eyes, deathly pale face and cruel voice, Lee Van Cleef is the merciless bounty hunter, ironically called 'Angel Eyes,' always ready to kill for a price...The 'Ugly' is Eli Wallach, a wild spirit with devil attitude... Tuco is charming but extremely dangerous...The pairing of Eastwood and Wallach is memorable for its black humor alternating each other's fate, motivated satisfactorily by their excessive desire for collecting the reward money... The quest: a treasure chest containing $200,000 in gold buried in a Confederate grave in Sad Hill Cemetery...\"The Good, the Bad and the Ugly\" had many haunting moments: Complicated bounty-hunter's con-games; the Stranger, in a frantic hurry, trying to load his empty gun before 3 killers sent by Tuco; a torturous walk across the desert in a blazing sun; the epic battle between Union and Confederate soldiers for the control of a strategic bridge where Leone's camera takes a slow ride surveying the magnitude of the Civil War carnage; and the final showdown in a huge graveyard, where each character, naturally, wants the money all to himself...The amusing scenes are provided by Tuco, sitting in bathtub with a lot of foam and one armed man enters his room saying: \"I've been looking for you for 8 months... Now I find you in exactly the position that suits me...\"The memorable scenes are when the Stranger finds himself in a dangerous situation at the hand of Tuco, who is just about to collect his vengeance by hanging his former partner... The stunning scenes when Leone's camera captures the touching moment in which a young man plays sweet romantic songs on his harmonica, while his eyes are streaming tears of disgrace and grief...The unforgettable scenes when the 'Stranger' leaving Tuco with a rope around his neck and the bandit begs for mercy while teetering on a wooden cross...The ultimate confrontation between the forces of good and evil when Leone spreads out long shots adjusting sound with action... Tensions mounts as the three protagonists 'shape in a triangular cinema cliché' Leone gets the audience's imagination with a geometric fight to the death, accompanied by a clear exciting music... Leone's camera captures every straight lines, every nervous energy, every tactical movement, displaying, in huge close-ups, their faces, their power of vision, the slowly progress of their fingers toward their loaded guns, their worried eyes, their sudden need to be quick, to be the fastest draw..."
    },
    {
      "username": "bensonmum2",
      "userUrl": "https://www.imdb.com/user/ur3109237",
      "reviewLink": "https://www.imdb.com/review/rw1408605",
      "warningSpoilers": false,
      "date": "2 July 2006",
      "rate": "9",
      "helpful": "23 out of 29 found this helpful.",
      "title": "\"When you have to shoot, shoot, don't talk.\"",
      "content": "I know some movie fans who consider The Good, the Bad and the Ugly the best movie ever made. While I don't even think it's the best thing Sergio Leone made, it's a solid Spaghetti Western that has all but transcended the sub-genre. There are images, such as Clint Eastwood in the poncho, and music, like the main title theme, that are known by people who have never seen the movie. I also know people who wouldn't be caught dead watching a movie made outside of the USA who love The Good, the Bad and the Ugly. I can't think of another Italian made film, let alone an Italian made Western, that has become so universally known and enjoyed.There are so many moments in The Good, the Bad and the Ugly that I enjoy. One of my favorites is that of Tuco running through the cemetery as Morricone's \"The Ecstasy of Gold\" plays in the background. It literally gives me goosebumps. It's one of those movie moments that I look forward to no matter how many times I've seen them. I'm also a fan of the techniques Leone used in The Good, the Bad and the Ugly. Leone's use of the widescreen shots of the landscape inter-cut with extreme close-ups of faces is brilliant. It adds a sense of intimacy to vastness of the setting that allows the viewer feel like they're part the movie and gain some insight into the characters. It's a technique that very few other filmmakers have the guts to employ.But I sincerely doubt that Leone's film would be so widely and wildly regarded if it weren't for the music of Ennio Morricone. I've already mentioned the main title theme and \"The Ecstasy of Gold\", but these are only two examples found in this amazing score. Can you imagine the final showdown without Morricone's music? I can't think of many instances where music and film go together to create such tension and anticipation. I've already used the word \"brilliant\" to describe Leone, but it's also applicable to Morricone.Finally, The Good, the Bad and the Ugly wouldn't be the same without the three lead actors. Each, at least in this movie, is brilliant (there's that word again) in his own right. Clint Eastwood is \"The Good\". He's \"The Good\" in the sense that he's not as \"bad\" as the other two. Lee Van Cleef is \"The Bad\". He's a ruthless killer who would just as soon shoot you as look at you - as long as the price was right. And then there's Eli Wallach as \"The Ugly\". As good as Eastwood and Van Cleef are, Wallach is really something special. Wallach's Tuco is one of the most crazed, but complicated characters I've seen. It's a special cast for a very special movie."
    },
    {
      "username": "slayer-3",
      "userUrl": "https://www.imdb.com/user/ur0090865",
      "reviewLink": "https://www.imdb.com/review/rw0092595",
      "warningSpoilers": false,
      "date": "28 September 1998",
      "rate": "10",
      "helpful": "234 out of 309 found this helpful.",
      "title": "Classic",
      "content": "Rather than a review of a 30 year old movie, here is my recollection of a 30 year old movie. When was the first time you saw this movie? I remember the first time I saw this movie. Back in the '70s, one night there was 2 things on TV to choose from, this movie or a baseball game. How do I remember a baseball game, it was the night Hank Aaron was going after Babe Ruth's homerun record. Baseball or a movie. Tuned into the the baseball game, flipped to the movie -a western, cool. 'Uh, what is this no one is talking it makes no sense'. After what seemed like an eternity somebody finally spoke, Lee van Cleef. The rest is Movie History. Since then I have seen this movie well over 25 times. Numerous lines that have been etched into my memory. Forget whatever minor flaws this movie has. Put yourself in the movie. Sergio Leon, John Ford these are the people that defined \"The Western\". On a scale of 1-10, The Good, The Bad, and The Ugly is nothing less than a 10. Plop the tape into the VCR, sit back and experience a classic."
    },
    {
      "username": "NachoDaddie",
      "userUrl": "https://www.imdb.com/user/ur0314962",
      "reviewLink": "https://www.imdb.com/review/rw0092647",
      "warningSpoilers": true,
      "date": "28 May 1999",
      "rate": "10",
      "helpful": "441 out of 555 found this helpful.",
      "title": "The world is not black and white",
      "content": "Ok- first, as mentioned in another review, the geographic/historical errors in this film are GLARING. You've got men carrying revolvers that look like old style cap-and-ball pistols, but they're loading them with metallic cartridges- historically about five years early. Eastwood carries a rifle that hasn't been invented yet, Tuco assembles a \"superpistol\" out of a Colt, a Remington, and a Smith and Wesson- impossible. And there was nothing of merit taking place between the North and South during the Civil War in the Southwest. Now, that aside, I must say that this is the Greatest western ever. I first saw this film when I was about ten. I'd never sat through an entire Western befor, even though my Dad watched them constantly. Since then, I've been through film school, watched hundreds of Westerns, learned to appreciate them- but NOTHING matches up to this. The Searchers, Stagecoach, Gunfight at the O.K. Corral, The Gunfighter, High Noon, Shane- all great films, but saddled with the standard American Western morality- the good guy never takes liberties with the eastern schoolmarm, the bad guy wears a black hat, etc. Coming from Italy, TG,TB &TU isn't bound by these conventions. Blondie's the \"good guy\"- but he's also a bounty hunter. He makes a living in a highly immoral way, but is obviously the \"good\"- not because we're told, but from small acts- giving the dying soldier a cigar, making sure the Captain knows to hold on till he hears the bridge blow, the genuine regret he feel for having to let Shorty die. And while Angel Eyes may be the Bad, we at least know he has prinicpals- when he's hired for a job, he always sees the job through. And Tuco may be more immoral than the other two, but he's so savvy and his role so humorous that one can't bring oneself to look upon him disfavorably. In other words, historical inaccuracies aside, TG, TB, & TU maybe one of the most accurate portrayals of the West ever put on film- there are no clear-cut lines of conduct, no black and white, or even grey, but just a swirled palette of various facets of the human condition."
    },
    {
      "username": "keihan",
      "userUrl": "https://www.imdb.com/user/ur0612097",
      "reviewLink": "https://www.imdb.com/review/rw0092695",
      "warningSpoilers": true,
      "date": "26 August 2000",
      "rate": "",
      "helpful": "43 out of 54 found this helpful.",
      "title": "The best cinematic meditation on greed since \"Treasure of the Sierra Madre\"...",
      "content": "Belfast-based comics writer Garth Ennis said it best: \"There are two kinds of people in the world, my friend...those who dig Clint Eastwood movies...and dweebs.\" While I have to admit that my heart belongs to the opening act of \"The Man With No Name\" trilogy, \"A Fistful of Dollars\", there is no denial in my mind that \"The Good, the Bad, and the Ugly\" is actually the better film. Many directors have tried imitating it's style (including Don Siegel's substandard \"Hang 'Em High\" and Eastwood's own first Western offering as star/director in \"High Plains Drifter\"), but none have truly come close to the eccentricities on display here.I have a suspicion that the storyline is actually based on historical fact. Consider this account from Joel Rose's \"The Big Book of Thugs\" under the entry of \"The Reynolds Gang\": They were organized in 1863 by Texans Jim and John Reynolds. They were briefly interned in a Civil War prison camp for Confederate sympathizers and after being released, began making robberies that, according to Jim Reynolds, were to help out Jefferson Davis and the Confederacy. The loot was buried somewhere in the area of Handcart Gulch and Spanish Peaks in Colarado Territory and later, after Jim Reynolds and four members of his gang had been executed by Colonel John M. Chivington of the Union Army, John Reynolds, dying from a fatal wound during a holdup, supposedly whispered out the location of his old gang's ill gotten loot. Unlike the movie version, it was never found.Regardless of whether or not this was the actual basis for TGTBATU, it is nevertheless a film more grounded in history than a lot of it's comtemparies and, indeed, more than a few of it's successors. The Civil War is part of the backdrop, but it does so on a forgotten front of that war, the Western theater. Most high-school history classes would have us believe that nothing happened out West, but plenty did. In fact, the last skirmish of the war, if I'm not mistaken, was in New Mexico and, ironically enough, a Confederate victory.The central of this film is greed. You don't just see it in the quest for the Confederate gold by Blondie, Angel Eyes, and Tuco. There are signs of it everywhere; in the hotel manager talking about how he'll be glad to get the Northerners in town for the money they'll bring in, Bill Carson appealing to Tuco's greed for a single sip of water, the gang of cutthroats who are systematically robbing the Confederate prisoners of their goods. Set up against the harsh desert backdrop, it exposes the ultimate folly of that greed (the best symbol of it perhaps being the cemetary where the gold is buried). A little over a decade before the Reagan era of \"Greed is healthy, greed is good\", this film provides the ultimate rebuttal to that argument. Greed has gotten just as many men killed, if not more, than patriotism ever did. Such a subtext makes \"The Good, the Bad, and the Ugly\" the cinematic child of John Huston's \"Treasure of the Sierra Madre\" and the precursor to Oliver Stone's \"Wall Street\".As great as Leone, Eastwood, Van Cleef, and Wallach are, there is one member of this team that pushs this film into the status of greatness: score writer Ennio Morricone. Not only does he manage to write one of the most recognized theme tunes on the planet, he also adds the extra tension needed to convey the drama with the necessary oomph, the best examples being in Blondie's torturous walk across the desert, Tuco's frantic search through the cemetary (my personal favorite and so good that Lucasarts did a slowed-down version of it for their western shooter, \"Outlaws\"), and, of course, the final three way shoot-out. He still composes scores for many other films to this day, I've been told. A good example of his most recent work would be the 1990 version of \"Hamlet\" starring Mel Gibson and directed by Franco Zefferelli. But I truly doubt that he'll ever be able to top the legendary work he did here."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1456301",
      "warningSpoilers": false,
      "date": "23 August 2006",
      "rate": "10",
      "helpful": "30 out of 43 found this helpful.",
      "title": "Among the finest Westerns, though not for all tastes",
      "content": "While I have given some pretty long reviews to Clint Eastwood's Westerns--particularly the wonderful FISTFUL OF DOLLARS and FOR A FEW DOLLARS MORE, I will only give a brief review of this movie because there are so many reviews already I doubt if my pontificating will actually influence many people. After all, this is widely seen as one of the greatest Westerns ever made and since I liked it immensely, there isn't much need to say more.Well, there are actually a few Westerns I liked a bit more--I am a HUGE fan of THE BIG COUNTRY. But, when it comes to style, originality and the epic proportions of this film, none can match it, though ONCE UPON A TIME IN THE WEST comes very, very close. The acting and script are just fine and the music is intensely weird but effective. Of all the films I have seen with music by Ennio Morricone, this is his most intense and strangest. And it works perfectly in this film, but I also appreciate much of his more restrained work in other films and would never want all Westerns to have such distinctive and bizarre music as in THE GOOD, THE BAD AND THE UGLY--it would just lose its magic and might even tend to overwhelm the film.About the only negatives about this film are the title and it is a pretty violent film that the little ones probably shouldn't watch. There is a lot of blood and violence and you do get to see (yuck) Eli Wallach's butt. As for the title, sure, Lee Van Cleef was truly \"BAD\" and Eli Wallach was cure \"UGLY\", but Clint as \"the GOOD\"? Well, his character was far from good--but of course, who would like the title to be \"The Kinda Good, The Bad And the Ugly\"?! Not to be missed by any serious fan or the genre."
    },
    {
      "username": "tedg",
      "userUrl": "https://www.imdb.com/user/ur0643062",
      "reviewLink": "https://www.imdb.com/review/rw0092719",
      "warningSpoilers": true,
      "date": "26 April 2001",
      "rate": "",
      "helpful": "24 out of 34 found this helpful.",
      "title": "Roy Rogers meets the Vatican meets Kurosawa",
      "content": "Spoilers herein.This film revolves around threes of various types and pairings among those threes. The grouping of three that is of interest to me are the cinematic influences behind this film: Hollywood westerns, Italian iconic painting, Japanese starkness in representation. These Italian westerns are important. Most movies are about other movies, but this one affected much of what followed. The western vocabulary was mature and popular well before movies, and with the detective story drove the first revolution in modern mass publishing. Its simple abstractions were converted to film (then radio and TeeVee) without change: the boy scout cowboy in the usually white hat, often singing. (In fact the modern pop country music borrows from this simple vocabulary and reference to the `genuine.') But all that, including the country music bit is pretty flat, stupid and dull.Italian cinema is based on a similar set of national icons, specifically religious icons. It is a more visual, visceral painterly vocabulary. Equally simple in stereotypes, but instead there are religiously based connections that give the impression of depth. Symbology is expected, even demanded. To this add postwar notions of irony which permeated European popular art. So the good guy was still good, but in a twisted way -- the twists shifting according to the chaos he encountered.In the US, John Ford was creating soft lush panoramas that would subliminally inspire a generation of environmentally aware viewers, but something more important came rushing in from Japan: Kurosawa. His films are abstract, directly evolved from Japanese watercolor narratives. These are also lush and beautiful, but not soft -- instead dusty, gritty, sometimes cruel. This world is not placid, merely a machine to test color and honor.In the Eastwood/Leone films, these three influences were deliberately enfolded. And a whole world's visual vocabulary shifted. In the US, we have since reinvented a part of our national character to ally with these images. (America's love affair with guns is a recent phenomenon.) How powerful cinema can be!This film may be recommended by others for entertainment value or something similar. That's fine, but I think it should be seen to help you understand the default world you are handed, so that you can put it into perspective -- to see that much of it is man-made."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8744929",
      "warningSpoilers": false,
      "date": "19 December 2022",
      "rate": "9",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Several Fistfuls of Cadavers...",
      "content": "It's a story of three people on the run, from themselves, from poverty and from the gun, all chasing golden riches, in their saddle weary breeches, one-upmanship prevents, being outdone. Angel Eyes is a hardened mercenary, always finishes a job, he won't miscarry, has his sights set on a bounty, buried in, a cemetery, but two others will become, adversaries. Tuco is a cunning, cagey outlaw, never satisfied, wanting a few dollars more, devious and double crossing, scornful, sneering, often scoffing, wears a noose more than he'd like, below his jaw. Blondie plays it cool most of the time, makes his living freeing Tuco for his crimes, with his cigar and his poncho, he's an independent honcho, though a walk around the desert leaves him begrimed.Three outstanding performances in a film that stands the test of time and just gets better and better."
    }
  ],
  "errorMessage": ""
}