{
  "imDbId": "tt0060196",
  "title": "The Good, the Bad and the Ugly",
  "fullTitle": "The Good, the Bad and the Ugly (1966)",
  "type": "Movie",
  "year": "1966",
  "language": "en",
  "titleInLanguage": "The Good, the Bad and the Ugly",
  "url": "https://en.wikipedia.org/wiki/The_Good,_the_Bad_and_the_Ugly",
  "plotShort": {
    "plainText": "The Good, the Bad and the Ugly (Italian: Il buono, il brutto, il cattivo, literally \"The good, the ugly, the bad\") is a 1966 Italian epic spaghetti Western film directed by Sergio Leone and starring Clint Eastwood as \"the Good\", Lee Van Cleef as \"the Bad\", and Eli Wallach as \"the Ugly\". Its screenplay was written by Age & Scarpelli, Luciano Vincenzoni, and Leone (with additional screenplay material and dialogue provided by an uncredited Sergio Donati), based on a story by Vincenzoni and Leone. Director of photography Tonino Delli Colli was responsible for the film's sweeping widescreen cinematography, and Ennio Morricone composed the film's score, including its main theme. It was an Italian-led production with co-producers in Spain, West Germany, and the United States. Most of the filming took place in Spain.\r\nThe film is known for Leone's use of long shots and close-up cinematography, as well as his distinctive use of violence, tension, and highly stylised gunfights. The plot revolves around three gunslingers competing to find a fortune in a buried cache of Confederate gold amid the violent chaos of the American Civil War (specifically the Battle of Glorieta Pass of the New Mexico Campaign in 1862) while participating in many battles, confrontations, and duels along the way. The film was the third collaboration between Leone and Clint Eastwood, and the second with Lee Van Cleef.\r\nThe Good, the Bad and the Ugly was marketed as the third and final installment in the Dollars Trilogy, following A Fistful of Dollars and For a Few Dollars More. The film was a financial success, grossing over $38 million at the worldwide box office, and is credited with having catapulted Eastwood into stardom. Due to general disapproval of the spaghetti Western genre at the time, critical reception of the film following its release was mixed, but it gained critical acclaim in later years, becoming known as the \"definitive spaghetti Western\".",
    "html": "<p>The Good, the Bad and the Ugly (Italian: Il buono, il brutto, il cattivo, literally \"The good, the ugly, the bad\") is a 1966 Italian epic spaghetti Western film directed by Sergio Leone and starring Clint Eastwood as \"the Good\", Lee Van Cleef as \"the Bad\", and Eli Wallach as \"the Ugly\". Its screenplay was written by Age & Scarpelli, Luciano Vincenzoni, and Leone (with additional screenplay material and dialogue provided by an uncredited Sergio Donati), based on a story by Vincenzoni and Leone. Director of photography Tonino Delli Colli was responsible for the film's sweeping widescreen cinematography, and Ennio Morricone composed the film's score, including its main theme. It was an Italian-led production with co-producers in Spain, West Germany, and the United States. Most of the filming took place in Spain.</p><p>The film is known for Leone's use of long shots and close-up cinematography, as well as his distinctive use of violence, tension, and highly stylised gunfights. The plot revolves around three gunslingers competing to find a fortune in a buried cache of Confederate gold amid the violent chaos of the American Civil War (specifically the Battle of Glorieta Pass of the New Mexico Campaign in 1862) while participating in many battles, confrontations, and duels along the way. The film was the third collaboration between Leone and Clint Eastwood, and the second with Lee Van Cleef.</p><p>The Good, the Bad and the Ugly was marketed as the third and final installment in the Dollars Trilogy, following A Fistful of Dollars and For a Few Dollars More. The film was a financial success, grossing over $38 million at the worldwide box office, and is credited with having catapulted Eastwood into stardom. Due to general disapproval of the spaghetti Western genre at the time, critical reception of the film following its release was mixed, but it gained critical acclaim in later years, becoming known as the \"definitive spaghetti Western\".</p>"
  },
  "plotFull": {
    "plainText": "The Good, the Bad and the Ugly (Italian: Il buono, il brutto, il cattivo, literally \"The good, the ugly, the bad\") is a 1966 Italian epic spaghetti Western film directed by Sergio Leone and starring Clint Eastwood as \"the Good\", Lee Van Cleef as \"the Bad\", and Eli Wallach as \"the Ugly\". Its screenplay was written by Age & Scarpelli, Luciano Vincenzoni, and Leone (with additional screenplay material and dialogue provided by an uncredited Sergio Donati), based on a story by Vincenzoni and Leone. Director of photography Tonino Delli Colli was responsible for the film's sweeping widescreen cinematography, and Ennio Morricone composed the film's score, including its main theme. It was an Italian-led production with co-producers in Spain, West Germany, and the United States. Most of the filming took place in Spain.\r\nThe film is known for Leone's use of long shots and close-up cinematography, as well as his distinctive use of violence, tension, and highly stylised gunfights. The plot revolves around three gunslingers competing to find a fortune in a buried cache of Confederate gold amid the violent chaos of the American Civil War (specifically the Battle of Glorieta Pass of the New Mexico Campaign in 1862) while participating in many battles, confrontations, and duels along the way. The film was the third collaboration between Leone and Clint Eastwood, and the second with Lee Van Cleef.\r\nThe Good, the Bad and the Ugly was marketed as the third and final installment in the Dollars Trilogy, following A Fistful of Dollars and For a Few Dollars More. The film was a financial success, grossing over $38 million at the worldwide box office, and is credited with having catapulted Eastwood into stardom. Due to general disapproval of the spaghetti Western genre at the time, critical reception of the film following its release was mixed, but it gained critical acclaim in later years, becoming known as the \"definitive spaghetti Western\".\r\nPlot\r\nIn 1862, during the American Civil War, a mercenary known as \"Angel Eyes\" interrogates former Confederate soldier Stevens, whom Angel Eyes is contracted to kill, about Jackson, a fugitive who stole a cache of Confederate gold. Learning Jackson's new alias \"Bill Carson,\" Angel Eyes kills Stevens and then his employer Baker so he can find the gold himself. Bandit Tuco Ramirez is rescued from bounty hunters by a nameless drifter who is called \"Blondie\" by Tuco. Blondie delivers Tuco to the local sheriff to collect his $2,000 bounty. As Tuco is about to be hanged, Blondie severs Tuco's noose by shooting it and setting him free. The two escape on horseback and split the bounty. They repeat the process in other towns until Blondie grows weary of Tuco's complaints and strands him in the desert.\r\nBent on revenge, and after one failed attempt with his gang, Tuco finally catches up with Blondie and force-marches him across the desert until Blondie collapses from dehydration. A runaway horse-drawn hospital ambulance arrives with several dead Confederate soldiers and a near-death Bill Carson, who promises Tuco $200,000 in Confederate gold, buried in a grave in Sad Hill Cemetery, in exchange for help. When Tuco returns with water, Carson has died and Blondie is slumped next to him, revealing that Carson recovered and told him the name on the grave before dying. Tuco poses as a Confederate soldier and takes Blondie to a nearby frontier mission to recover. At the mission, Tuco reunites with his brother, Pablo, who left his family when Tuco was young to become a priest. Their meeting does not go well; they become hostile and engage in a physical confrontation. Tuco and Blondie subsequently leave the monastery.\r\nThe duo decides to search for the gold together. Tuco yells Confederate-supportive statements to a group of soldiers but they turn out to be members of a Union patrol, the blue color of their uniforms having been obscured by dust. Blondie and Tuco are taken to a prison camp that Angel Eyes has infiltrated as a Union sergeant in his search for Bill Carson. Tuco poses as Carson and is taken away for questioning. He reveals the name of the cemetery under torture and is sent away to be hanged. Knowing Blondie would not reveal the name on the grave, Angel Eyes recruits him into his search. Tuco escapes his fate by killing Angel Eyes' henchman and soon finds himself in an evacuated town, where Blondie, Angel Eyes, and his gang have also arrived.\r\nBlondie finds Tuco and the pair kill Angel Eyes' men, though Angel Eyes escapes. They travel toward Sad Hill before ending up on the Union side of a military siege over a strategic bridge. Blondie decides to destroy the bridge to disperse the two armies to allow access to the cemetery. As they wire the bridge with explosives, Tuco suggests they share information. Tuco reveals the name of the cemetery, while Blondie says \"Arch Stanton\" is the name on the grave. After the bridge is demolished the armies disperse. Tuco steals a horse and rides to Sad Hill to claim the gold for himself. Tuco finds Arch Stanton's grave and begins digging, where Blondie encourages him at gunpoint to continue. Angel Eyes arrives and holds Blondie at gunpoint. Blondie states that he lied about the name on Stanton's grave and appears to write the real name of the grave on a rock before challenging Tuco and Angel Eyes to a three-way duel.\r\nThe trio stares each other down. Everyone eventually draws with Blondie killing Angel Eyes, while Tuco discovers that his gun was unloaded by Blondie the night before. Blondie reveals that the gold is actually in the grave beside Arch Stanton's, marked \"Unknown\". Tuco is initially elated to find bags of gold, but Blondie holds him at gunpoint and orders him into a hangman's noose beneath a tree. Blondie binds Tuco's hands and forces him to stand atop an unsteady grave marker while he takes his half of the gold and rides away. As Tuco screams for mercy, Blondie returns into sight. He severs the rope with a rifle shot, leaving Tuco alive to furiously curse him while Blondie disappears over the horizon.\r\nCast\r\nThe trio\r\nClint Eastwood as 'Blondie' (the Man with No Name): The Good, a taciturn, confident bounty hunter, teams up with Tuco, and Angel Eyes temporarily, to find the buried gold. Blondie and Tuco have an ambivalent partnership. Tuco knows the name of the cemetery where the gold is hidden, but Blondie knows the name of the grave where it is buried, forcing them to work together to find the treasure. Despite this greedy quest, Blondie's pity for the dying soldiers in the chaotic carnage of the war is evident. \"I've never seen so many men wasted so badly,\" he remarks. He also comforts a dying soldier by laying his coat over him and letting him smoke his cigar. Rawhide had ended its run as a series in 1966, and at that point, neither A Fistful of Dollars nor For a Few Dollars More had been released in the United States. When Leone offered Clint Eastwood a role in his next movie, it was the only big film offer he had, but Eastwood still needed to be convinced to do it. Leone and his wife traveled to California to persuade him. Two days later, he agreed to make the film upon being paid $250,000 and getting 10% of the profits from the North American markets—a deal with which Leone was not happy. In the original Italian script for the film, he is named \"Joe\" (his nickname in A Fistful of Dollars), but is referred to as Blondie in the Italian and English dialogue.\r\nEli Wallach as Tuco Benedicto Pacífico Juan María Ramírez (known as \"The Rat\" according to Blondie): The Ugly, a fast-talking, comically oafish yet also cunning, cagey, resilient, and resourceful Mexican bandit, is wanted by the authorities for a long list of crimes. The director originally considered Gian Maria Volonté (who portrayed the villains in both the preceding films) for the role of Tuco, but felt that the role required someone with \"natural comic talent\". In the end, Leone chose Eli Wallach, based on his role in How the West Was Won (1962), in particular, his performance in \"The Railroads\" scene. In Los Angeles, Leone met Wallach, who was skeptical about playing this type of character again, but after Leone screened the opening credit sequence from For a Few Dollars More, Wallach said: \"When do you want me?\" The two men got along famously, sharing the same bizarre sense of humor. Leone allowed Wallach to make changes to his character in terms of his outfit and recurring gestures. Both Eastwood and Van Cleef realized that the character of Tuco was close to Leone's heart, and the director and Wallach became good friends. They communicated in French, which Wallach spoke badly and Leone spoke well. Van Cleef observed, \"Tuco is the only one of the trio the audience gets to know all about. We meet his brother and find out where he came from and why he became a bandit. But Clint and Lee's characters remain mysteries.\" In the theatrical trailer, Angel Eyes is referred to as The Ugly and Tuco, The Bad. This is due to a translation error; the original Italian title translates to \"The Good, the Ugly, the Bad\".\r\nLee Van Cleef as 'Angel Eyes': The Bad, a ruthless, confident, borderline-sadistic mercenary, takes pleasure in killing and always finishes a job for which he is paid, usually tracking and assassination. Originally, Leone wanted Enrico Maria Salerno (who had dubbed Eastwood's voice for the Italian versions of the Dollars Trilogy films) or Charles Bronson to play Angel Eyes, but the latter was already committed to playing in The Dirty Dozen (1967). Leone thought about working with Lee Van Cleef again: \"I said to myself that Van Cleef had first played a romantic character in For a Few Dollars More. The idea of getting him to play a character who was the opposite of that began to appeal to me.\" In the original working script, Angel Eyes was named \"Banjo\", but is referred to as \"Sentenza\" (meaning \"Sentence\" or \"Judgement\") in the Italian version. Eastwood came up with the name Angel Eyes on the set, for his gaunt appearance and expert marksmanship.\r\nSupporting cast\r\nAl Mulock as Elam, a one-armed bounty hunter\r\nAldo Giuffrè as alcoholic Union Captain Clinton\r\nAldo Sambrell as a member of Angel Eyes' gang\r\nBenito Stefanelli as a member of Angel Eyes' gang\r\nAntonio Casale as Jackson/Bill Carson\r\nLivio Lorenzon as Baker\r\nEnzo Petito as The Gun Shop Owner\r\nJohn Bartha as Sheriff\r\nJosé Terrón as Thomas \"Shorty\" Larson\r\nLorenzo Robledo as Clem\r\nLuigi Pistilli as Father Pablo Ramírez\r\nMario Brega as Corporal Wallace\r\nAntonio Molino Rojo as Captain Harper\r\nRada Rassimov as Maria\r\nJesús Guzmán as Pardue the Hotel Owner\r\nRicardo Palacios as Barista a Socorro\r\nAntonio Casas as Stevens\r\nAntoñito Ruiz as Stevens's youngest son\r\nRomán Ariznavarreta as Bounty Hunter\r\nSergio Mendizábal as Blonde Bounty Hunter\r\nProduction\r\nPre-production\r\nAfter the success of For a Few Dollars More, executives at United Artists approached the film's screenwriter, Luciano Vincenzoni, to sign a contract for the rights to the film and the next one. Producer Alberto Grimaldi, Sergio Leone and he had no plans, but with their blessing, Vincenzoni pitched an idea about \"a film about three rogues who are looking for some treasure at the time of the American Civil War\". The studio agreed but wanted to know the cost for this next film. At the same time, Grimaldi was trying to broker his own deal, but Vincenzoni's idea was more lucrative. The two men struck an agreement with UA for a million-dollar budget, with the studio advancing $500,000 upfront and 50% of the box-office takings outside of Italy. The total budget was eventually $1.2 million.\r\nLeone built upon the screenwriter's original concept to \"show the absurdity of war ... the Civil War, which the characters encounter. In my frame of reference, it is useless, stupid: it does not involve a 'good cause'.\" An avid history buff, Leone said, \"I had read somewhere that 120,000 people died in Southern camps such as Andersonville. I was not ignorant of the fact that there were camps in the North. You always get to hear about the shameful behavior of the losers, never the winners.\" The Batterville Camp where Blondie and Tuco are imprisoned was based on steel engravings of Andersonville. Many shots in the film were influenced by archival photographs taken by Mathew Brady and Alexander Gardner. As the film took place during the Civil War, it served as a prequel for the other two films in the trilogy, which took place after the war.\r\nWhile Leone developed Vincenzoni's idea into a script, the screenwriter recommended the comedy-writing team of Agenore Incrucci and Furio Scarpelli to work on it with Leone and Sergio Donati. According to Leone, \"I couldn't use a single thing they'd written. It was the grossest deception of my life.\" Donati agreed, saying, \"There was next to nothing of them in the final script. They only wrote the first part. Just one line.\" Vincenzoni claims that he wrote the screenplay in eleven days, but he soon left the project after his relationship with Leone soured. The three main characters all contain autobiographical elements of Leone. In an interview he said, \" has no spirit, he's a professional in the banalest sense of the term. Like a robot. This isn't the case with the other two. On the methodical and careful side of my character, I'd be nearer il Biondo (Blondie), but my most profound sympathy always goes towards the Tuco side ... He can be touching with all that tenderness and all that wounded humanity.\" Film director Alex Cox suggests that the cemetery-buried gold hunted by the protagonists may have been inspired by rumors surrounding the anti-Communist Gladio terrorists, who hid many of their 138 weapons caches in cemeteries.\r\nEastwood received a percentage-based salary, unlike in the first two films, from which he received a straight fee. When Lee Van Cleef was again cast for another Dollars film, he joked, \"the only reason they brought me back was that they forgot to kill me off in For a Few Dollars More\".\r\nThe film's working title was I due magnifici straccioni (The Two Magnificent Tramps). It was changed just before shooting began when Vincenzoni thought up Il buono, il brutto, il cattivo (The Good, the Ugly, the Bad), which Leone loved. In the United States, United Artists considered using the original Italian translation, River of Dollars, or The Man With No Name, but decided on The Good, the Bad and the Ugly.\r\nFilming\r\nProduction began at the Cinecittà studio in Rome again in mid-May 1966, including the opening scene between Eastwood and Wallach when Blondie captures Tuco for the first time and sends him to jail. The production then moved on to Spain's plateau region near Burgos in the north, which doubled for the Southwestern United States, and again shot the western scenes in Almería in the south of Spain. This time, the production required more elaborate sets, including a town under cannon fire, an extensive prison camp, and an American Civil War battlefield; and for the climax, several hundred Spanish soldiers were employed to build a cemetery with several thousand gravestones and wooden crosses to resemble an ancient Roman circus. The scene where the bridge was blown up had to be filmed twice because all three cameras were destroyed in the first take by the explosion. Eastwood remembers, \"They would care if you were doing a story about Spaniards and Spain. Then they'd scrutinize you very tough, but the fact that you're doing a Western that's supposed to be laid in Southwest America or Mexico, they couldn't care less what your story or subject is.\" Top Italian cinematographer Tonino Delli Colli was brought in to shoot the film and was prompted by Leone to pay more attention to light than in the previous two films; Ennio Morricone composed the score once again. Leone was instrumental in asking Morricone to compose a track for the final Mexican stand-off scene in the cemetery, asking him to compose what felt like \"the corpses were laughing from inside their tombs\", and asked Delli Colli to create a hypnotic whirling effect interspersed with dramatic extreme close-ups, to give the audience the impression of a visual ballet. Filming concluded in July 1966.\r\nEastwood was not initially pleased with the script and was concerned he might be upstaged by Wallach. \"In the first film, I was alone,\" he told Leone. \"In the second, we were two. Here we are three. If it goes on this way, in the next one I will be starring with the American cavalry.\" As Eastwood played hard-to-get in accepting the role (inflating his earnings up to $250,000, another Ferrari and 10% of the profits in the United States when eventually released there), he was again encountering publicist disputes between Ruth Marsh, who urged him to accept the third film of the trilogy, and the William Morris Agency and Irving Leonard, who were unhappy with Marsh's influence on the actor. Eastwood banished Marsh from having any further influence in his career, and he was forced to sack her as his business manager via a letter sent by Frank Wells. For some time after, Eastwood's publicity was handled by Jerry Pam of Gutman and Pam. Throughout filming, Eastwood regularly socialized with actor Franco Nero, who was filming Texas, Adios at the time.\r\nWallach and Eastwood flew to Madrid together, and between shooting scenes, Eastwood would relax and practice his golf swing. Wallach was almost poisoned during filming when he accidentally drank from a bottle of acid that a film technician had set next to his soda bottle. Wallach mentioned this in his autobiography and complained that while Leone was a brilliant director, he was very lax about ensuring the safety of his actors during dangerous scenes. For instance, in one scene, where he was to be hanged after a pistol was fired, the horse underneath him was supposed to bolt. While the rope around Wallach's neck was severed, the horse was frightened a little too well. It galloped for about a mile with Wallach still mounted and his hands bound behind his back. The third time Wallach's life was threatened was during the scene where Mario Brega and he—who are chained together—jump out of a moving train. The jumping part went as planned, but Wallach's life was endangered when his character attempts to sever the chain binding him to the (now dead) soldier. Tuco places the body on the railroad tracks, waiting for the train to roll over the chain and sever it. Wallach, and presumably the entire film crew, were not aware of the heavy iron steps that jutted one foot out of every box car. If Wallach had stood up from his prone position at the wrong time, one of the jutting steps could have decapitated him.\r\nThe bridge in the film was constructed twice by sappers of the Spanish army and rigged for on-camera explosive demolition. On the first occasion, an Italian camera operator signaled that he was ready to shoot, which was misconstrued by an army captain as the similar-sounding Spanish word meaning \"start\". Nobody was injured in the resulting explosion. The army rebuilt the bridge while other shots were filmed. As the bridge was not a prop, but a rather heavy and sturdy functional structure, powerful explosives were required to destroy it. Leone said that this scene was, in part, inspired by Buster Keaton's silent film The General.\r\nAs an international cast was employed, actors performed in their native languages. Eastwood, Van Cleef, and Wallach spoke English and were dubbed into Italian for their debut release in Rome. For the American version, the lead acting voices were used, but supporting cast members were dubbed into English. The result is noticeable in the bad synchronization of voices to lip movements on screen; none of the dialogue is completely in sync because Leone rarely shot his scenes with synchronized sound. Various reasons have been cited for this: Leone often liked to play Morricone's music over a scene and possibly shout things at the actors to get them in the mood. Leone cared more for visuals than dialogue (his English was limited at best). Given the technical limitations of the time, recording the sound cleanly would have been difficult in most of the extremely wide shots Leone frequently used. Also, it was standard practice in Italian films at this time to shoot silently and post-dub. Whatever the actual reason, all dialogue in the film was recorded in postproduction.\r\nBy the end of filming, Eastwood had finally had enough of Leone's perfectionist directorial traits. Leone insisted, often forcefully, on shooting scenes from many different angles, paying attention to the most minute of details, which often exhausted the actors. Leone, who was obese, prompted amusement through his excesses, and Eastwood found a way to deal with the stresses of being directed by him by making jokes about him and nicknamed him \"Yosemite Sam\" for his bad temper. After the film was completed, Eastwood never worked with Leone again, later turning down the role of Harmonica in Once Upon a Time in the West (1968), for which Leone had personally flown to Los Angeles to give him the script. The role eventually went to Charles Bronson. Years later, Leone exacted his revenge upon Eastwood during the filming of Once Upon a Time in America when he described Eastwood's abilities as an actor as being like a block of marble or wax and inferior to the acting abilities of Robert De Niro, saying, \"Eastwood moves like a sleepwalker between explosions and hails of bullets, and he is always the same—a block of marble. Bobby, first of all, is an actor, and Clint first of all is a star. Bobby suffers and Clint yawns.\" Eastwood later gave a friend the poncho he wore in the three films, where it was hung in a Mexican restaurant in Carmel, California.\r\nCinematography\r\nIn its depiction of violence, Leone used his signature long drawn and close-up style of filming, which he did by mixing extreme face shots and sweeping long shots. By doing so, Leone managed to stage epic sequences punctuated by extreme eyes and face shots, or hands slowly reaching for a holstered gun. This builds up the tension and suspense by allowing the viewers to savor the performances and character reactions, creating a feeling of excitement, as well as giving Leone the freedom to film beautiful landscapes. Leone also incorporated music to heighten the tension and pressure before and during the film's many gunfights.\r\nIn filming the pivotal gunfights, Leone largely removes dialogue to focus more on the actions of the characters, which was important during the film's iconic Mexican standoff. This style can also be seen in one of the film's protagonists, Blondie (The Man with No Name), which is described by critics as more defined by his actions than his words. All three characters can be seen as anti-heroes, killing for their personal gain. Leone also employed trick shooting, such as Blondie shooting the hat off a person's head and severing a hangman's noose with a well-placed shot, in many of the film's noted shootouts.\r\nMusic\r\nThe score is composed by frequent Leone collaborator Ennio Morricone. The Good, the Bad and the Ugly broke previous conventions on how the two had previously collaborated. Instead of scoring the film in the post-production stage, they decided to work on the themes together before shooting had started, this was so that the music helped inspire the film instead of the film inspiring the music. Leone even played the music on set and coordinated camera movements to match the music. The unique vocals of Edda Dell'Orso can be heard permeating throughout the composition \"The Ecstasy of Gold\". The distinct sound of guitarist Bruno Battisti D'Amorio can be heard in the compositions 'The Sundown' and 'Padre Ramirez'. Trumpet players Michele Lacerenza and Francesco Catania can be heard on 'The Trio'. The only song to have a lyric is 'The Story of a Soldier, the words of which were written by Tommie Connor. Morricone's unmistakable original compositions, containing gunfire, whistling (by John O'Neill), and yodeling permeate the film. The main theme, resembling the howling of a coyote (which blends in with an actual coyote howl in the first shot after the opening credits), is a two-pitch melody that is a frequent motif, and is used for the three main characters. A different instrument was used for each: flute for Blondie, ocarina for Angel Eyes, and human voices for Tuco. The score complements the film's American Civil War setting, containing the mournful ballad, \"The Story of a Soldier\", which is sung by prisoners as Tuco is being tortured by Angel Eyes. The film's climax, a three-way Mexican standoff, begins with the melody of \"The Ecstasy of Gold\" and is followed by \"The Trio\" (which contains a musical allusion to Morricone's previous work on For a Few Dollars More).\r\n\"The Ecstasy of Gold\" is the title of a song used within The Good, The Bad and the Ugly. Composed by Morricone, it is one of his most established works within the film's score. The song has long been used within popular culture. The song features the vocals of Edda Dell'Orso, an Italian female vocalist. Alongside vocals, the song features musical instruments such as the piano, drums, and clarinets. The song is played in the film when the character Tuco is ecstatically searching for gold, hence the song's name, \"The Ecstasy of Gold\". Within popular culture, the song has been utilized by such artists as Metallica, who have used the song to open up their live shows and have even covered the song. Other bands such as the Ramones have featured the song in their albums and live shows. The song has also been sampled within the genre of Hip Hop, most notably by rappers such as Immortal Technique and Jay-Z. The Ecstasy of Gold has also been used ceremoniously by the Los Angeles Football Club to open home games.\r\nThe main theme, also titled \"The Good, the Bad and the Ugly\", was a hit in 1968 with the soundtrack album on the charts for more than a year, reaching No. 4 on the Billboard pop album chart and No. 10 on the black album chart. The main theme was also a hit for Hugo Montenegro, whose rendition was a No. 2 Billboard pop single in 1968.\r\nIn popular culture, the American new wave group Wall of Voodoo performed a medley of Ennio Morricone's movie themes, including the theme for this movie. The only known recording of it is a live performance on The Index Masters. Punk rock band the Ramones played this song as the opening for their live album Loco Live as well as in concerts until their disbandment in 1996. The British heavy metal band Motörhead played the main theme as the overture music on the 1981 \"No sleep 'til Hammersmith\" tour. American heavy metal band Metallica has run \"The Ecstasy of Gold\" as prelude music at their concerts since 1985 (except 1996–1998), and in 2007 recorded a version of the instrumental for a compilation tribute to Morricone. XM Satellite Radio's The Opie & Anthony Show also opens every show with \"The Ecstasy of Gold\". The American punk rock band The Vandals' song \"Urban Struggle\" begins with the main theme. British electronica act Bomb the Bass used the main theme as one of several samples on their 1988 single \"Beat Dis\", and used sections of dialogue from Tuco's hanging on \"Throughout The Entire World\", the opening track from their 1991 album Unknown Territory. This dialogue along with some of the mule dialogue from Fistful of Dollars was also sampled by Big Audio Dynamite on their 1986 single Medicine Show. The main theme was also sampled/re-created by British band New Order for the album version of their 1993 single \"Ruined in a Day\". A song from the band Gorillaz is named \"Clint Eastwood\", and features references to the actor, along with a repeated sample of the theme song; the iconic yell featured in The Good, the Bad and the Ugly's score is heard at the beginning of the music video.\r\nThemes\r\nLike many of his films, director Sergio Leone noted that the film is a satire of the western genre. He has noted the film's theme of emphasis on violence and the deconstruction of Old West romanticism. The emphasis on violence is seen in how the three leads (Blondie, Angel Eyes, and Tuco) are introduced to various acts of violence. With Blondie, it is seen in his attempt to free Tuco which results in a gun battle. Angel Eyes is set up in a scene in which he carries out a hit on a former Confederate soldier called Stevens. After getting the information he needs from Stevens he is given money to kill Baker (his employer). He then proceeds to kill Stevens and his son. Upon returning to Baker he kills him too (fulfilling his title as 'The Bad'). Tuco is set up in a scene in which three bounty hunters try to kill him. In the film's opening scene three bounty hunters enter a building in which Tuco is hiding. After the sound of gunfire is heard Tuco escapes through a window. We then get a shot of the three corpses (fulfilling his title as 'The Ugly'). They are all after gold and will stop at nothing until they get it. The film deconstructs Old West Romanticism by portraying the characters as antiheroes. Even the character considered by the film as 'The Good' can still be considered as not living up to that title in a moral sense. Critic Drew Marton describes it as a \"baroque manipulation\" that criticizes the American Ideology of the Western, by replacing the heroic cowboy popularized by John Wayne with morally complex antiheroes.\r\nNegative themes such as cruelty and greed are also given focus and are traits shared by the three leads in the story. Cruelty is shown in the character of Blondie in how he treats Tuco throughout the film. He is seen to sometimes be friendly with him and in other scenes double-cross him and throw him to the side. It is shown in Angel Eyes through his attitudes in the film and his tendency for committing violent acts throughout the film. For example, when he kills Stevens he also kills his son. It is also seen when he is violently torturing Tuco later in the film. It is shown in Tuco how he shows concern for Blondie when he is heavily dehydrated but in truth, he is only keeping him alive to find the gold. It is also shown in his conversation with his brother which reveals that a life of cruelty is all he knows. Richard Aquila writes \"The violent antiheroes of Italian westerns also fit into a folk tradition in southern Italy that honored mafioso and vigilante who used any means to combat corrupt government of church officials who threatened the peasants of the Mezzogiorno\".\r\nGreed is shown in the film through its main core plotline of the three characters wanting to find the $200,000 that Bill Carson has said is buried in a grave in Sad Hill Cemetery. The main plot concerns their greed as there is a series of double crossings and changing allegiances to get the gold. Russ Hunter writes that the film will \"stress the formation of homosocial relationships as being functional only in the pursuit of wealth\". This all culminates in the film's final set-piece which takes place in the cemetery. After the death of Angel Eyes, Tuco is strung up with a rope precariously placed around his neck as Blondie leaves with his share of the money.\r\nMany critics have also noticed the film's anti-war theme. Taking place in the American Civil War, the film takes the viewpoint of people such as civilians, bandits, and most notably soldiers, and presents their daily hardships during the war. This is seen in the film's rugged and rough aesthetic. The film has an air of dirtiness that can be attributed to the Civil War and in turn, it affects the actions of people, showing how the war deep down has affected the lives of many people. A scene in the extended version presents Angel Eyes arriving in an embattled Confederate outpost. Angel Eyes shows compassion towards the agonizing soldiers, pointing out that even 'The Bad' is shocked by the horrors of the war.\r\nAs Brian Jenkins states \"A union cordial enough to function peacefully could not be reconstructed after a massive blood-letting that left the North crippled by depopulation and debt and the south devastated\". Although not fighting in the war, the three gunslingers gradually become entangled in the battles that ensue (similar to The Great War, a film that screenwriters Luciano Vincenzoni and Age & Scarpelli had contributed to). An example of this is how Tuco and Blondie blow up a bridge to disperse two sides of the battle. They need to clear a way to the cemetery and succeed in doing so. It is also seen in how Angel Eyes disguises himself as a union sergeant so he can attack and torture Tuco to get the information he needs, intertwining himself in the battle in the process.\r\nRelease\r\nThe Good, the Bad and the Ugly opened in Italy on 23 December 1966.\r\nIn the United States, A Fistful of Dollars was released 18 January 1967; For a Few Dollars More was released 10 May 1967 (17 months); and The Good, the Bad and the Ugly was released 29 December 1967 (12 months). Thus, all three of Leone's Dollars Trilogy films were released in the United States during the same year. The original Italian domestic version was 177 minutes long, but the international version was shown at various lengths. Most prints, specifically those shown in the United States, had a runtime of 161 minutes, 16 minutes shorter than the Italian premiere version, but others, especially British prints, ran as short as 148 minutes.\r\nBox office\r\nIn Italy, the film grossed $6.3 million at the time. In the United States and Canada, the film grossed $25.1 million. It also grossed $7.5 million in other international territories, for a total of $38.9 million grossed worldwide.\r\nCritical reception\r\nOn review aggregator Rotten Tomatoes, The Good, the Bad and the Ugly holds an approval rating of 97% based on 75 reviews, with an average rating of 8.8/10. The website's critical consensus reads, \"Arguably the greatest of the spaghetti westerns, this epic features a compelling story, memorable performances, breathtaking landscapes, and a haunting score.\" Metacritic, which uses a weighted average, assigned the film a score of 90 out of 100 based on 7 reviews, indicating \"universal acclaim.\"\r\nUpon release, The Good, the Bad and the Ugly received criticism for its depiction of violence. Leone explains that \"the killings in my films are exaggerated because I wanted to make a tongue-in-cheek satire on run-of-the-mill westerns... The west was made by violent, uncomplicated men, and it is this strength and simplicity that I try to recapture in my pictures.\" To this day, Leone's effort to reinvigorate the timeworn Western is widely acknowledged.\r\nCritical opinion of the film on initial release was mixed, as many reviewers at that time looked down on \"Spaghetti Westerns\". In a negative review in The New York Times, a critic Renata Adler said that the film \"must be the most expensive, pious and repellent movie in the history of its peculiar genre.\" Charles Champlin of the Los Angeles Times wrote that the \"temptation is hereby proved irresistible to call The Good, The Bad and the Ugly, now playing citywide, The Bad, The Dull, and the Interminable, only because it is.\" Roger Ebert, who later included the film in his list of Great Movies, retrospectively noted that in his original review he had \"described a four-star movie, but only gave it three stars, perhaps because it was a 'Spaghetti Western' and so could not be art.\"\r\nHome media\r\nOn January 28, 1998, the film was released on DVD by MGM Home Video. Its release from MGM contained 14 minutes of scenes that were cut from the film's North American release, including a scene which explains how Angel Eyes came to be waiting for Blondie and Tuco at the Union prison camp.\r\nIn 2002, the film was restored with the 14 minutes of scenes cut for US release re-inserted into the film. Clint Eastwood and Eli Wallach were brought back in to dub their characters' lines more than 35 years after the film's original release. Voice actor Simon Prescott substituted for Lee Van Cleef who had died in 1989. Other voice actors filled in for actors who had since died. In 2004, MGM released this version in a two-disc special edition DVD.\r\nDisc 1 contains an audio commentary with writer and critic Richard Schickel. Disc 2 contains two documentaries, \"Leone's West\" and \"The Man Who Lost The Civil War\", followed by the featurette \"Restoring 'The Good, the Bad, and the Ugly'\"; an animated gallery of missing sequences titled \"The Socorro Sequence: A Reconstruction\"; an extended Tuco torture scene; a featurette called \"Il Maestro\"; an audio featurette named \"Il Maestro, Part 2\"; a French trailer; and a poster gallery.\r\nThis DVD was generally well received, though some purists complained about the re-mixed stereo soundtrack with many completely new sound effects (notably, the gunshots were replaced), with no option for the original soundtrack. At least one scene that was re-inserted had been cut by Leone before the film's release in Italy but had been shown once at the Italian premiere. According to Richard Schickel, Leone willingly cut the scene for pacing reasons; thus, restoring it was contrary to the director's wishes. MGM re-released the 2004 DVD edition in their \"Sergio Leone Anthology\" box set in 2007. Also included were the two other \"Dollars\" films, and Duck, You Sucker!. On 12 May 2009, the extended version of the film was released on Blu-ray. It contains the same special features as the 2004 special edition DVD, except that it includes an added commentary by film historian Sir Christopher Frayling.\r\nThe film was re-released on Blu-ray in 2014 using a new 4K remaster, featuring improved picture quality and detail but a change of color timing, resulting in the film having a more yellow hue than on previous releases. It was re-released on Blu-ray and DVD by Kino Lorber Studio Classics on 15 August 2017, in a new 50th Anniversary release that featured both theatrical and extended cuts, as well as new bonus features, and an attempt to correct the yellow color timing from the earlier disc. On 27 April 2021, Kino released an Ultra HD Blu-ray version of the theatrical cut, using the same scan from the 2014 remaster, but with extensive color correction.\r\nDeleted scenes\r\nThe following scenes were originally deleted by distributors from the British and American theatrical versions of the film but were restored after the release of the 2004 Special Edition DVD.\r\nDuring his search for Bill Carson, Angel Eyes stumbles upon an embattled Confederate outpost after a massive artillery bombardment. Once there, after witnessing the wretched conditions of the survivors, he bribes a Confederate soldier (Víctor Israel, dubbed by Tom Wyner) for clues about Bill Carson.\r\nAfter being betrayed by Blondie, surviving the desert on his way to civilization, and assembling a good revolver from the parts of worn-out guns being sold at a general store, Tuco meets with members of his gang in a distant cave, where he conspires with them to hunt and kill Blondie.\r\nThe sequence with Tuco and Blondie crossing the desert has been extended: Tuco mentally tortures a severely dehydrated Blondie by eating and bathing in front of him.\r\nTuco, transporting a dehydrated Blondie, finds a Confederate camp whose occupants tell him that Father Ramirez's monastery is nearby.\r\nTuco and Blondie discuss their plans when departing in a wagon from Father Ramirez's monastery.\r\nA scene where Blondie and Angel Eyes are resting by a creek when a man appears and Blondie shoots him. Angel Eyes asks the rest of his men to come out of hiding. When the five men come out, Blondie counts them (including Angel Eyes), and concludes that six is the perfect number, implying one for each bullet in his gun.\r\nThe sequence with Tuco, Blondie, and Captain Clinton has been extended: Clinton asks for their names, which they are reluctant to give.\r\nThe footage below is all featured within supplementary features of the 2004 DVD release\r\nAdditional footage of the sequence where Tuco is tortured by Angel Eyes's henchman was discovered. The original negative of this footage was deemed too badly damaged to be used in the theatrical cut.\r\nLost footage of the missing Socorro Sequence where Tuco continues his search for Blondie in a Texican pueblo while Blondie is in a hotel room with a Mexican woman (Silvana Bacci) is reconstructed with photos and unfinished snippets from the French trailer. Also, in the documentary \"Reconstructing The Good, the Bad, and the Ugly\", what looks to be footage of Tuco lighting cannons before the Ecstasy of the Gold sequence appears briefly. None of these scenes or sequences appear in the 2004 re-release but are featured in the supplementary features.\r\nLegacy\r\nRe-evaluation\r\nDespite the initial negative reception by some critics, the film has since accumulated very positive feedback. It is listed in Time's \"100 Greatest Movies of the Last Century\" as selected by critics Richard Corliss and Richard Schickel. The Good, the Bad and the Ugly has been described as European cinema's best Western, and Quentin Tarantino has called it \"the best-directed film of all time\" and \"the greatest achievement in the history of cinema\". This was reflected in his votes for the 2002 and 2012 Sight & Sound magazine polls, in which he voted for The Good, the Bad and the Ugly as his choice for the best film ever made. Its main music theme from the soundtrack is regarded by Classic FM as one of the most iconic themes of all time. Variety magazine ranked the film number 49 on their list of the 50 greatest movies. In 2002, Film4 held a poll of the 100 Greatest Movies, on which The Good, the Bad and the Ugly was voted in at number 46. Premiere magazine included the film on their 100 Most Daring Movies Ever Made list. Mr. Showbiz ranked the film #81 on its 100 Best Movies of All Time list.\r\nEmpire magazine added The Good, the Bad and the Ugly to their Masterpiece collection in the September 2007 issue, and their poll of \"The 500 Greatest Movies\", The Good, the Bad and the Ugly was voted in at number 25. In 2014, The Good the Bad and the Ugly was ranked the 47th greatest film ever made on Empire's list of \"The 301 Greatest Movies Of All Time\" as voted by the magazine's readers. It was also placed on a similar list of 1000 movies by The New York Times. In 2014, Time Out polled several film critics, directors, actors and stunt actors to list their top action films. The Good, The Bad and the Ugly placed 52nd on their list. An article on the BBC website considers the 'lasting legacy of the film, and describes the trio scene as \"one of the most riveting and acclaimed feature films sequences of all time\".\r\nIn popular culture\r\nThe film's title has entered the English language as an idiomatic expression. Typically used when describing something thoroughly, the respective phrases refer to upsides, downsides, and the parts that could, or should have been done better, but were not.\r\nQuentin Tarantino paid homage to the film's climactic standoff scene in his 1992 film Reservoir Dogs.\r\nThe film was novelized in 1967 by Joe Millard as part of the \"Dollars Western\" series based on the \"Man with No Name\". The South Korean western movie The Good, the Bad, the Weird (2008) is inspired by the film, with much of its plot and character elements borrowed from Leone's film. In his introduction to the 2003 revised edition of his novel The Dark Tower: The Gunslinger, Stephen King said the film was a primary influence for the Dark Tower series, with Eastwood's character inspiring the creation of King's protagonist, Roland Deschain.\r\nIn 1975, Willie Colón with Yomo Toro and Hector Lavoe, released an album titled The Good, the Bad, the Ugly. The album cover featured the three in cowboy attire.\r\nImpact on Western genre\r\nWhile the Dollars Trilogy was not the beginning of the so-called Spaghetti Western cycle in Italy, many in the US saw it as the beginning of an Italian invasion of the most recognizably American film genre. Christopher Frayling argues that, on the whole, Americans had become \"bored with an exhausted Hollywood genre\". He notes that Pauline Kael, for example, had appreciated how non-American films of the time \"could exploit the conventions of the Western genre, while debunking its morality\". Along with Peter Bondanella and others, Frayling argues that such revisionism was the key to Leone's success and, to some degree, to that of the Spaghetti Western genre as a whole. The Good, the Bad and the Ugly, like the later Once Upon A Time In The West, belongs to multiple Western sub-genres: Epic Western, Outlaw (Gunfighter) Film, Revisionist Western and Spaghetti Western.\r\nThe Good, The Bad and The Ugly has been called the definitive Spaghetti Western – colloquially, these are Westerns produced and directed by Italians, often in collaboration with other European countries, especially Spain and West Germany. The name 'Spaghetti Western' originally was a pejorative term, given by foreign critics to these films because they thought they were inferior to American westerns. Most of the films were made with low budgets, but several still managed to be innovative and artistic, although at the time they did not get much recognition, even in Europe. The genre is unmistakably a Catholic genre, with a visual style strongly influenced by the Catholic iconography of, for instance, the crucifixion or the last supper. The outdoor scenes of many Spaghetti Westerns, especially those with a relatively higher budget, were shot in Spain, in particular the Tabernas desert of Almería and Colmenar Viejo and Hoyo de Manzanares. In Italy, the region of Lazio was a favorite location.\r\nThe genre expanded and became an international sensation with the success of Sergio Leone's A Fistful of Dollars, an adaptation of Akira Kurosawa's samurai film Yojimbo. But a handful of westerns were made in Italy before Leone redefined the genre, and the Italians were not the first to make westerns in Europe in the sixties. But it was Leone who defined the look and attitude of the genre with his first western and the two that soon were to follow: For a Few Dollars More and The Good, the Bad and the Ugly. Together these films are called the Dollars Trilogy. Leone's portrayal of the west, in the latter, was not concerned with ideas of the frontier or good vs. evil but rather interested in how the world is unmistakably more complicated than that, and how the western world is one of kill or be killed. These films featured knifings, beatings, shootouts, or other violent action every five to ten minutes. \"The issue of morality belongs to the American western,\" explains Italian director Ferdinando Baldi. \"The violence in our movies is more gratuitous than in American films. There was very little morality because often the protagonist was a bad guy.\" Eastwood's character is a violent and ruthless killer who murders opponents for fun and profit. Behind his cold and stony stare is a cynical mind powered by a dubious morality. Unlike earlier cowboy heroes, Eastwood's character constantly smokes a small cigar and hardly ever shaves. He wears a flat-topped hat and Mexican poncho instead of more traditional western costuming. He never introduces himself when he meets anyone, and nobody ever asks his name. Furthermore, Spaghetti Westerns redefined the western genre to fit the everchanging times of the 1960s and '70s. Rather than portraying the traditional mythic West as an exotic and beautiful land of opportunity, hope, and redemption, they depicted a desolate and forsaken West. In these violent and troubled times, Spaghetti Westerns, with their antiheroes, ambiguous morals, brutality, and anti-Establishment themes, resonated with audiences. The film's gratuitous violence, surrealistic style, gloomy look, and eerie sound captured the era's melancholy. It is this new approach to the genre that defined the revisionist western of the late '70s and early '80s; a movement started by this moral ambiguity of the Spaghetti Westerns, as well as a westerns placement in the context of historical events; both attributes defined and set by The Good, the Bad, and The Ugly.\r\nThese films were undeniably stylish. With grandiose wide shots and close-ups that peered into the eyes and souls of the characters, The Good, The Bad, and The Ugly, had the defining cinematographic techniques of the Spaghetti Western. This was Leone's signature technique, using long drawn shots interspersed with extreme close-ups that build tension, as well as develop characters. However, Leone's movies were not just influenced by style. As Quentin Tarantino notes:\r\nThere was also realism to them: those shitty Mexican towns, the little shacks — a bit bigger to accommodate the camera — all the plates they put the beans on, the big wooden spoons. The films were so realistic, which had always seemed to be missing in the westerns of the 1930s, '40s, and '50s, in the brutality and the different shades of grey and black. Leone found an even darker black and off-white. There is realism in Leone's presentation of the Civil War in The Good, the Bad and the Ugly that was missing from all the Civil War movies that happened before him. Leone's film, and the genre that he defined within it, shows a west that is more violent, less talky, more complex, more theatrical, and just overall more iconic through the use of music, appearing operatic as the music is an illustrative ingredient of the narrative.\r\nWith a greater sense of operatic violence than their American cousins, the cycle of spaghetti westerns lasted just a few years, but it has been said to have rewritten the genre.\r\nProposed sequel\r\nThe Good, the Bad and the Ugly is the last film in the Dollars Trilogy, and thus, does not have an official sequel. However, screenwriter Luciano Vincenzoni stated on numerous occasions that he had written a treatment for a sequel, tentatively titled Il buono, il brutto, il cattivo n. 2 (The Good, the Bad and the Ugly 2). According to Vincenzoni and Eli Wallach, the film would have been set 20 years after the original and would have followed Tuco pursuing Blondie's grandson for the gold. Clint Eastwood expressed interest in taking part in the film's production, including acting as narrator. Joe Dante and Leone were also approached to direct and produce the film respectively. The project was ultimately vetoed by Leone, as he did not want the original film's title or characters to be reused, nor did he want to be involved in another Western film.",
    "html": "<p>The Good, the Bad and the Ugly (Italian: Il buono, il brutto, il cattivo, literally \"The good, the ugly, the bad\") is a 1966 Italian epic spaghetti Western film directed by Sergio Leone and starring Clint Eastwood as \"the Good\", Lee Van Cleef as \"the Bad\", and Eli Wallach as \"the Ugly\". Its screenplay was written by Age & Scarpelli, Luciano Vincenzoni, and Leone (with additional screenplay material and dialogue provided by an uncredited Sergio Donati), based on a story by Vincenzoni and Leone. Director of photography Tonino Delli Colli was responsible for the film's sweeping widescreen cinematography, and Ennio Morricone composed the film's score, including its main theme. It was an Italian-led production with co-producers in Spain, West Germany, and the United States. Most of the filming took place in Spain.</p><p>The film is known for Leone's use of long shots and close-up cinematography, as well as his distinctive use of violence, tension, and highly stylised gunfights. The plot revolves around three gunslingers competing to find a fortune in a buried cache of Confederate gold amid the violent chaos of the American Civil War (specifically the Battle of Glorieta Pass of the New Mexico Campaign in 1862) while participating in many battles, confrontations, and duels along the way. The film was the third collaboration between Leone and Clint Eastwood, and the second with Lee Van Cleef.</p><p>The Good, the Bad and the Ugly was marketed as the third and final installment in the Dollars Trilogy, following A Fistful of Dollars and For a Few Dollars More. The film was a financial success, grossing over $38 million at the worldwide box office, and is credited with having catapulted Eastwood into stardom. Due to general disapproval of the spaghetti Western genre at the time, critical reception of the film following its release was mixed, but it gained critical acclaim in later years, becoming known as the \"definitive spaghetti Western\".</p><br/><h3>Plot</h3><p>In 1862, during the American Civil War, a mercenary known as \"Angel Eyes\" interrogates former Confederate soldier Stevens, whom Angel Eyes is contracted to kill, about Jackson, a fugitive who stole a cache of Confederate gold. Learning Jackson's new alias \"Bill Carson,\" Angel Eyes kills Stevens and then his employer Baker so he can find the gold himself. Bandit Tuco Ramirez is rescued from bounty hunters by a nameless drifter who is called \"Blondie\" by Tuco. Blondie delivers Tuco to the local sheriff to collect his $2,000 bounty. As Tuco is about to be hanged, Blondie severs Tuco's noose by shooting it and setting him free. The two escape on horseback and split the bounty. They repeat the process in other towns until Blondie grows weary of Tuco's complaints and strands him in the desert.</p><p>Bent on revenge, and after one failed attempt with his gang, Tuco finally catches up with Blondie and force-marches him across the desert until Blondie collapses from dehydration. A runaway horse-drawn hospital ambulance arrives with several dead Confederate soldiers and a near-death Bill Carson, who promises Tuco $200,000 in Confederate gold, buried in a grave in Sad Hill Cemetery, in exchange for help. When Tuco returns with water, Carson has died and Blondie is slumped next to him, revealing that Carson recovered and told him the name on the grave before dying. Tuco poses as a Confederate soldier and takes Blondie to a nearby frontier mission to recover. At the mission, Tuco reunites with his brother, Pablo, who left his family when Tuco was young to become a priest. Their meeting does not go well; they become hostile and engage in a physical confrontation. Tuco and Blondie subsequently leave the monastery.</p><p>The duo decides to search for the gold together. Tuco yells Confederate-supportive statements to a group of soldiers but they turn out to be members of a Union patrol, the blue color of their uniforms having been obscured by dust. Blondie and Tuco are taken to a prison camp that Angel Eyes has infiltrated as a Union sergeant in his search for Bill Carson. Tuco poses as Carson and is taken away for questioning. He reveals the name of the cemetery under torture and is sent away to be hanged. Knowing Blondie would not reveal the name on the grave, Angel Eyes recruits him into his search. Tuco escapes his fate by killing Angel Eyes' henchman and soon finds himself in an evacuated town, where Blondie, Angel Eyes, and his gang have also arrived.</p><p>Blondie finds Tuco and the pair kill Angel Eyes' men, though Angel Eyes escapes. They travel toward Sad Hill before ending up on the Union side of a military siege over a strategic bridge. Blondie decides to destroy the bridge to disperse the two armies to allow access to the cemetery. As they wire the bridge with explosives, Tuco suggests they share information. Tuco reveals the name of the cemetery, while Blondie says \"Arch Stanton\" is the name on the grave. After the bridge is demolished the armies disperse. Tuco steals a horse and rides to Sad Hill to claim the gold for himself. Tuco finds Arch Stanton's grave and begins digging, where Blondie encourages him at gunpoint to continue. Angel Eyes arrives and holds Blondie at gunpoint. Blondie states that he lied about the name on Stanton's grave and appears to write the real name of the grave on a rock before challenging Tuco and Angel Eyes to a three-way duel.</p><p>The trio stares each other down. Everyone eventually draws with Blondie killing Angel Eyes, while Tuco discovers that his gun was unloaded by Blondie the night before. Blondie reveals that the gold is actually in the grave beside Arch Stanton's, marked \"Unknown\". Tuco is initially elated to find bags of gold, but Blondie holds him at gunpoint and orders him into a hangman's noose beneath a tree. Blondie binds Tuco's hands and forces him to stand atop an unsteady grave marker while he takes his half of the gold and rides away. As Tuco screams for mercy, Blondie returns into sight. He severs the rope with a rifle shot, leaving Tuco alive to furiously curse him while Blondie disappears over the horizon.</p><br/><h3>Cast</h3><h4>The trio</h4><ul><li>Clint Eastwood as 'Blondie' (the Man with No Name): The Good, a taciturn, confident bounty hunter, teams up with Tuco, and Angel Eyes temporarily, to find the buried gold. Blondie and Tuco have an ambivalent partnership. Tuco knows the name of the cemetery where the gold is hidden, but Blondie knows the name of the grave where it is buried, forcing them to work together to find the treasure. Despite this greedy quest, Blondie's pity for the dying soldiers in the chaotic carnage of the war is evident. \"I've never seen so many men wasted so badly,\" he remarks. He also comforts a dying soldier by laying his coat over him and letting him smoke his cigar. Rawhide had ended its run as a series in 1966, and at that point, neither A Fistful of Dollars nor For a Few Dollars More had been released in the United States. When Leone offered Clint Eastwood a role in his next movie, it was the only big film offer he had, but Eastwood still needed to be convinced to do it. Leone and his wife traveled to California to persuade him. Two days later, he agreed to make the film upon being paid $250,000 and getting 10% of the profits from the North American markets—a deal with which Leone was not happy. In the original Italian script for the film, he is named \"Joe\" (his nickname in A Fistful of Dollars), but is referred to as Blondie in the Italian and English dialogue.</li><li>Eli Wallach as Tuco Benedicto Pacífico Juan María Ramírez (known as \"The Rat\" according to Blondie): The Ugly, a fast-talking, comically oafish yet also cunning, cagey, resilient, and resourceful Mexican bandit, is wanted by the authorities for a long list of crimes. The director originally considered Gian Maria Volonté (who portrayed the villains in both the preceding films) for the role of Tuco, but felt that the role required someone with \"natural comic talent\". In the end, Leone chose Eli Wallach, based on his role in How the West Was Won (1962), in particular, his performance in \"The Railroads\" scene. In Los Angeles, Leone met Wallach, who was skeptical about playing this type of character again, but after Leone screened the opening credit sequence from For a Few Dollars More, Wallach said: \"When do you want me?\" The two men got along famously, sharing the same bizarre sense of humor. Leone allowed Wallach to make changes to his character in terms of his outfit and recurring gestures. Both Eastwood and Van Cleef realized that the character of Tuco was close to Leone's heart, and the director and Wallach became good friends. They communicated in French, which Wallach spoke badly and Leone spoke well. Van Cleef observed, \"Tuco is the only one of the trio the audience gets to know all about. We meet his brother and find out where he came from and why he became a bandit. But Clint and Lee's characters remain mysteries.\" In the theatrical trailer, Angel Eyes is referred to as The Ugly and Tuco, The Bad. This is due to a translation error; the original Italian title translates to \"The Good, the Ugly, the Bad\".</li><li>Lee Van Cleef as 'Angel Eyes': The Bad, a ruthless, confident, borderline-sadistic mercenary, takes pleasure in killing and always finishes a job for which he is paid, usually tracking and assassination. Originally, Leone wanted Enrico Maria Salerno (who had dubbed Eastwood's voice for the Italian versions of the Dollars Trilogy films) or Charles Bronson to play Angel Eyes, but the latter was already committed to playing in The Dirty Dozen (1967). Leone thought about working with Lee Van Cleef again: \"I said to myself that Van Cleef had first played a romantic character in For a Few Dollars More. The idea of getting him to play a character who was the opposite of that began to appeal to me.\" In the original working script, Angel Eyes was named \"Banjo\", but is referred to as \"Sentenza\" (meaning \"Sentence\" or \"Judgement\") in the Italian version. Eastwood came up with the name Angel Eyes on the set, for his gaunt appearance and expert marksmanship.</li></ul><h4>Supporting cast</h4><ul><li>Al Mulock as Elam, a one-armed bounty hunter</li><li>Aldo Giuffrè as alcoholic Union Captain Clinton</li><li>Aldo Sambrell as a member of Angel Eyes' gang</li><li>Benito Stefanelli as a member of Angel Eyes' gang</li><li>Antonio Casale as Jackson/Bill Carson</li><li>Livio Lorenzon as Baker</li><li>Enzo Petito as The Gun Shop Owner</li><li>John Bartha as Sheriff</li><li>José Terrón as Thomas \"Shorty\" Larson</li><li>Lorenzo Robledo as Clem</li><li>Luigi Pistilli as Father Pablo Ramírez</li><li>Mario Brega as Corporal Wallace</li><li>Antonio Molino Rojo as Captain Harper</li><li>Rada Rassimov as Maria</li><li>Jesús Guzmán as Pardue the Hotel Owner</li><li>Ricardo Palacios as Barista a Socorro</li><li>Antonio Casas as Stevens</li><li>Antoñito Ruiz as Stevens's youngest son</li><li>Román Ariznavarreta as Bounty Hunter</li><li>Sergio Mendizábal as Blonde Bounty Hunter</li></ul><br/><h3>Production</h3><h4>Pre-production</h4><p>After the success of For a Few Dollars More, executives at United Artists approached the film's screenwriter, Luciano Vincenzoni, to sign a contract for the rights to the film and the next one. Producer Alberto Grimaldi, Sergio Leone and he had no plans, but with their blessing, Vincenzoni pitched an idea about \"a film about three rogues who are looking for some treasure at the time of the American Civil War\". The studio agreed but wanted to know the cost for this next film. At the same time, Grimaldi was trying to broker his own deal, but Vincenzoni's idea was more lucrative. The two men struck an agreement with UA for a million-dollar budget, with the studio advancing $500,000 upfront and 50% of the box-office takings outside of Italy. The total budget was eventually $1.2 million.</p><p>Leone built upon the screenwriter's original concept to \"show the absurdity of war ... the Civil War, which the characters encounter. In my frame of reference, it is useless, stupid: it does not involve a 'good cause'.\" An avid history buff, Leone said, \"I had read somewhere that 120,000 people died in Southern camps such as Andersonville. I was not ignorant of the fact that there were camps in the North. You always get to hear about the shameful behavior of the losers, never the winners.\" The Batterville Camp where Blondie and Tuco are imprisoned was based on steel engravings of Andersonville. Many shots in the film were influenced by archival photographs taken by Mathew Brady and Alexander Gardner. As the film took place during the Civil War, it served as a prequel for the other two films in the trilogy, which took place after the war.</p><p>While Leone developed Vincenzoni's idea into a script, the screenwriter recommended the comedy-writing team of Agenore Incrucci and Furio Scarpelli to work on it with Leone and Sergio Donati. According to Leone, \"I couldn't use a single thing they'd written. It was the grossest deception of my life.\" Donati agreed, saying, \"There was next to nothing of them in the final script. They only wrote the first part. Just one line.\" Vincenzoni claims that he wrote the screenplay in eleven days, but he soon left the project after his relationship with Leone soured. The three main characters all contain autobiographical elements of Leone. In an interview he said, \" has no spirit, he's a professional in the banalest sense of the term. Like a robot. This isn't the case with the other two. On the methodical and careful side of my character, I'd be nearer il Biondo (Blondie), but my most profound sympathy always goes towards the Tuco side ... He can be touching with all that tenderness and all that wounded humanity.\" Film director Alex Cox suggests that the cemetery-buried gold hunted by the protagonists may have been inspired by rumors surrounding the anti-Communist Gladio terrorists, who hid many of their 138 weapons caches in cemeteries.</p><p>Eastwood received a percentage-based salary, unlike in the first two films, from which he received a straight fee. When Lee Van Cleef was again cast for another Dollars film, he joked, \"the only reason they brought me back was that they forgot to kill me off in For a Few Dollars More\".</p><p>The film's working title was I due magnifici straccioni (The Two Magnificent Tramps). It was changed just before shooting began when Vincenzoni thought up Il buono, il brutto, il cattivo (The Good, the Ugly, the Bad), which Leone loved. In the United States, United Artists considered using the original Italian translation, River of Dollars, or The Man With No Name, but decided on The Good, the Bad and the Ugly.</p><h4>Filming</h4><p>Production began at the Cinecittà studio in Rome again in mid-May 1966, including the opening scene between Eastwood and Wallach when Blondie captures Tuco for the first time and sends him to jail. The production then moved on to Spain's plateau region near Burgos in the north, which doubled for the Southwestern United States, and again shot the western scenes in Almería in the south of Spain. This time, the production required more elaborate sets, including a town under cannon fire, an extensive prison camp, and an American Civil War battlefield; and for the climax, several hundred Spanish soldiers were employed to build a cemetery with several thousand gravestones and wooden crosses to resemble an ancient Roman circus. The scene where the bridge was blown up had to be filmed twice because all three cameras were destroyed in the first take by the explosion. Eastwood remembers, \"They would care if you were doing a story about Spaniards and Spain. Then they'd scrutinize you very tough, but the fact that you're doing a Western that's supposed to be laid in Southwest America or Mexico, they couldn't care less what your story or subject is.\" Top Italian cinematographer Tonino Delli Colli was brought in to shoot the film and was prompted by Leone to pay more attention to light than in the previous two films; Ennio Morricone composed the score once again. Leone was instrumental in asking Morricone to compose a track for the final Mexican stand-off scene in the cemetery, asking him to compose what felt like \"the corpses were laughing from inside their tombs\", and asked Delli Colli to create a hypnotic whirling effect interspersed with dramatic extreme close-ups, to give the audience the impression of a visual ballet. Filming concluded in July 1966.</p><p>Eastwood was not initially pleased with the script and was concerned he might be upstaged by Wallach. \"In the first film, I was alone,\" he told Leone. \"In the second, we were two. Here we are three. If it goes on this way, in the next one I will be starring with the American cavalry.\" As Eastwood played hard-to-get in accepting the role (inflating his earnings up to $250,000, another Ferrari and 10% of the profits in the United States when eventually released there), he was again encountering publicist disputes between Ruth Marsh, who urged him to accept the third film of the trilogy, and the William Morris Agency and Irving Leonard, who were unhappy with Marsh's influence on the actor. Eastwood banished Marsh from having any further influence in his career, and he was forced to sack her as his business manager via a letter sent by Frank Wells. For some time after, Eastwood's publicity was handled by Jerry Pam of Gutman and Pam. Throughout filming, Eastwood regularly socialized with actor Franco Nero, who was filming Texas, Adios at the time.</p><p>Wallach and Eastwood flew to Madrid together, and between shooting scenes, Eastwood would relax and practice his golf swing. Wallach was almost poisoned during filming when he accidentally drank from a bottle of acid that a film technician had set next to his soda bottle. Wallach mentioned this in his autobiography and complained that while Leone was a brilliant director, he was very lax about ensuring the safety of his actors during dangerous scenes. For instance, in one scene, where he was to be hanged after a pistol was fired, the horse underneath him was supposed to bolt. While the rope around Wallach's neck was severed, the horse was frightened a little too well. It galloped for about a mile with Wallach still mounted and his hands bound behind his back. The third time Wallach's life was threatened was during the scene where Mario Brega and he—who are chained together—jump out of a moving train. The jumping part went as planned, but Wallach's life was endangered when his character attempts to sever the chain binding him to the (now dead) soldier. Tuco places the body on the railroad tracks, waiting for the train to roll over the chain and sever it. Wallach, and presumably the entire film crew, were not aware of the heavy iron steps that jutted one foot out of every box car. If Wallach had stood up from his prone position at the wrong time, one of the jutting steps could have decapitated him.</p><p>The bridge in the film was constructed twice by sappers of the Spanish army and rigged for on-camera explosive demolition. On the first occasion, an Italian camera operator signaled that he was ready to shoot, which was misconstrued by an army captain as the similar-sounding Spanish word meaning \"start\". Nobody was injured in the resulting explosion. The army rebuilt the bridge while other shots were filmed. As the bridge was not a prop, but a rather heavy and sturdy functional structure, powerful explosives were required to destroy it. Leone said that this scene was, in part, inspired by Buster Keaton's silent film The General.</p><p>As an international cast was employed, actors performed in their native languages. Eastwood, Van Cleef, and Wallach spoke English and were dubbed into Italian for their debut release in Rome. For the American version, the lead acting voices were used, but supporting cast members were dubbed into English. The result is noticeable in the bad synchronization of voices to lip movements on screen; none of the dialogue is completely in sync because Leone rarely shot his scenes with synchronized sound. Various reasons have been cited for this: Leone often liked to play Morricone's music over a scene and possibly shout things at the actors to get them in the mood. Leone cared more for visuals than dialogue (his English was limited at best). Given the technical limitations of the time, recording the sound cleanly would have been difficult in most of the extremely wide shots Leone frequently used. Also, it was standard practice in Italian films at this time to shoot silently and post-dub. Whatever the actual reason, all dialogue in the film was recorded in postproduction.</p><p>By the end of filming, Eastwood had finally had enough of Leone's perfectionist directorial traits. Leone insisted, often forcefully, on shooting scenes from many different angles, paying attention to the most minute of details, which often exhausted the actors. Leone, who was obese, prompted amusement through his excesses, and Eastwood found a way to deal with the stresses of being directed by him by making jokes about him and nicknamed him \"Yosemite Sam\" for his bad temper. After the film was completed, Eastwood never worked with Leone again, later turning down the role of Harmonica in Once Upon a Time in the West (1968), for which Leone had personally flown to Los Angeles to give him the script. The role eventually went to Charles Bronson. Years later, Leone exacted his revenge upon Eastwood during the filming of Once Upon a Time in America when he described Eastwood's abilities as an actor as being like a block of marble or wax and inferior to the acting abilities of Robert De Niro, saying, \"Eastwood moves like a sleepwalker between explosions and hails of bullets, and he is always the same—a block of marble. Bobby, first of all, is an actor, and Clint first of all is a star. Bobby suffers and Clint yawns.\" Eastwood later gave a friend the poncho he wore in the three films, where it was hung in a Mexican restaurant in Carmel, California.</p><h4>Cinematography</h4><p>In its depiction of violence, Leone used his signature long drawn and close-up style of filming, which he did by mixing extreme face shots and sweeping long shots. By doing so, Leone managed to stage epic sequences punctuated by extreme eyes and face shots, or hands slowly reaching for a holstered gun. This builds up the tension and suspense by allowing the viewers to savor the performances and character reactions, creating a feeling of excitement, as well as giving Leone the freedom to film beautiful landscapes. Leone also incorporated music to heighten the tension and pressure before and during the film's many gunfights.</p><p>In filming the pivotal gunfights, Leone largely removes dialogue to focus more on the actions of the characters, which was important during the film's iconic Mexican standoff. This style can also be seen in one of the film's protagonists, Blondie (The Man with No Name), which is described by critics as more defined by his actions than his words. All three characters can be seen as anti-heroes, killing for their personal gain. Leone also employed trick shooting, such as Blondie shooting the hat off a person's head and severing a hangman's noose with a well-placed shot, in many of the film's noted shootouts.</p><h4>Music</h4><p>The score is composed by frequent Leone collaborator Ennio Morricone. The Good, the Bad and the Ugly broke previous conventions on how the two had previously collaborated. Instead of scoring the film in the post-production stage, they decided to work on the themes together before shooting had started, this was so that the music helped inspire the film instead of the film inspiring the music. Leone even played the music on set and coordinated camera movements to match the music. The unique vocals of Edda Dell'Orso can be heard permeating throughout the composition \"The Ecstasy of Gold\". The distinct sound of guitarist Bruno Battisti D'Amorio can be heard in the compositions 'The Sundown' and 'Padre Ramirez'. Trumpet players Michele Lacerenza and Francesco Catania can be heard on 'The Trio'. The only song to have a lyric is 'The Story of a Soldier, the words of which were written by Tommie Connor. Morricone's unmistakable original compositions, containing gunfire, whistling (by John O'Neill), and yodeling permeate the film. The main theme, resembling the howling of a coyote (which blends in with an actual coyote howl in the first shot after the opening credits), is a two-pitch melody that is a frequent motif, and is used for the three main characters. A different instrument was used for each: flute for Blondie, ocarina for Angel Eyes, and human voices for Tuco. The score complements the film's American Civil War setting, containing the mournful ballad, \"The Story of a Soldier\", which is sung by prisoners as Tuco is being tortured by Angel Eyes. The film's climax, a three-way Mexican standoff, begins with the melody of \"The Ecstasy of Gold\" and is followed by \"The Trio\" (which contains a musical allusion to Morricone's previous work on For a Few Dollars More).</p><p>\"The Ecstasy of Gold\" is the title of a song used within The Good, The Bad and the Ugly. Composed by Morricone, it is one of his most established works within the film's score. The song has long been used within popular culture. The song features the vocals of Edda Dell'Orso, an Italian female vocalist. Alongside vocals, the song features musical instruments such as the piano, drums, and clarinets. The song is played in the film when the character Tuco is ecstatically searching for gold, hence the song's name, \"The Ecstasy of Gold\". Within popular culture, the song has been utilized by such artists as Metallica, who have used the song to open up their live shows and have even covered the song. Other bands such as the Ramones have featured the song in their albums and live shows. The song has also been sampled within the genre of Hip Hop, most notably by rappers such as Immortal Technique and Jay-Z. The Ecstasy of Gold has also been used ceremoniously by the Los Angeles Football Club to open home games.</p><p>The main theme, also titled \"The Good, the Bad and the Ugly\", was a hit in 1968 with the soundtrack album on the charts for more than a year, reaching No. 4 on the Billboard pop album chart and No. 10 on the black album chart. The main theme was also a hit for Hugo Montenegro, whose rendition was a No. 2 Billboard pop single in 1968.</p><p>In popular culture, the American new wave group Wall of Voodoo performed a medley of Ennio Morricone's movie themes, including the theme for this movie. The only known recording of it is a live performance on The Index Masters. Punk rock band the Ramones played this song as the opening for their live album Loco Live as well as in concerts until their disbandment in 1996. The British heavy metal band Motörhead played the main theme as the overture music on the 1981 \"No sleep 'til Hammersmith\" tour. American heavy metal band Metallica has run \"The Ecstasy of Gold\" as prelude music at their concerts since 1985 (except 1996–1998), and in 2007 recorded a version of the instrumental for a compilation tribute to Morricone. XM Satellite Radio's The Opie & Anthony Show also opens every show with \"The Ecstasy of Gold\". The American punk rock band The Vandals' song \"Urban Struggle\" begins with the main theme. British electronica act Bomb the Bass used the main theme as one of several samples on their 1988 single \"Beat Dis\", and used sections of dialogue from Tuco's hanging on \"Throughout The Entire World\", the opening track from their 1991 album Unknown Territory. This dialogue along with some of the mule dialogue from Fistful of Dollars was also sampled by Big Audio Dynamite on their 1986 single Medicine Show. The main theme was also sampled/re-created by British band New Order for the album version of their 1993 single \"Ruined in a Day\". A song from the band Gorillaz is named \"Clint Eastwood\", and features references to the actor, along with a repeated sample of the theme song; the iconic yell featured in The Good, the Bad and the Ugly's score is heard at the beginning of the music video.</p><br/><h3>Themes</h3><p>Like many of his films, director Sergio Leone noted that the film is a satire of the western genre. He has noted the film's theme of emphasis on violence and the deconstruction of Old West romanticism. The emphasis on violence is seen in how the three leads (Blondie, Angel Eyes, and Tuco) are introduced to various acts of violence. With Blondie, it is seen in his attempt to free Tuco which results in a gun battle. Angel Eyes is set up in a scene in which he carries out a hit on a former Confederate soldier called Stevens. After getting the information he needs from Stevens he is given money to kill Baker (his employer). He then proceeds to kill Stevens and his son. Upon returning to Baker he kills him too (fulfilling his title as 'The Bad'). Tuco is set up in a scene in which three bounty hunters try to kill him. In the film's opening scene three bounty hunters enter a building in which Tuco is hiding. After the sound of gunfire is heard Tuco escapes through a window. We then get a shot of the three corpses (fulfilling his title as 'The Ugly'). They are all after gold and will stop at nothing until they get it. The film deconstructs Old West Romanticism by portraying the characters as antiheroes. Even the character considered by the film as 'The Good' can still be considered as not living up to that title in a moral sense. Critic Drew Marton describes it as a \"baroque manipulation\" that criticizes the American Ideology of the Western, by replacing the heroic cowboy popularized by John Wayne with morally complex antiheroes.</p><p>Negative themes such as cruelty and greed are also given focus and are traits shared by the three leads in the story. Cruelty is shown in the character of Blondie in how he treats Tuco throughout the film. He is seen to sometimes be friendly with him and in other scenes double-cross him and throw him to the side. It is shown in Angel Eyes through his attitudes in the film and his tendency for committing violent acts throughout the film. For example, when he kills Stevens he also kills his son. It is also seen when he is violently torturing Tuco later in the film. It is shown in Tuco how he shows concern for Blondie when he is heavily dehydrated but in truth, he is only keeping him alive to find the gold. It is also shown in his conversation with his brother which reveals that a life of cruelty is all he knows. Richard Aquila writes \"The violent antiheroes of Italian westerns also fit into a folk tradition in southern Italy that honored mafioso and vigilante who used any means to combat corrupt government of church officials who threatened the peasants of the Mezzogiorno\".</p><p>Greed is shown in the film through its main core plotline of the three characters wanting to find the $200,000 that Bill Carson has said is buried in a grave in Sad Hill Cemetery. The main plot concerns their greed as there is a series of double crossings and changing allegiances to get the gold. Russ Hunter writes that the film will \"stress the formation of homosocial relationships as being functional only in the pursuit of wealth\". This all culminates in the film's final set-piece which takes place in the cemetery. After the death of Angel Eyes, Tuco is strung up with a rope precariously placed around his neck as Blondie leaves with his share of the money.</p><p>Many critics have also noticed the film's anti-war theme. Taking place in the American Civil War, the film takes the viewpoint of people such as civilians, bandits, and most notably soldiers, and presents their daily hardships during the war. This is seen in the film's rugged and rough aesthetic. The film has an air of dirtiness that can be attributed to the Civil War and in turn, it affects the actions of people, showing how the war deep down has affected the lives of many people. A scene in the extended version presents Angel Eyes arriving in an embattled Confederate outpost. Angel Eyes shows compassion towards the agonizing soldiers, pointing out that even 'The Bad' is shocked by the horrors of the war.</p><p>As Brian Jenkins states \"A union cordial enough to function peacefully could not be reconstructed after a massive blood-letting that left the North crippled by depopulation and debt and the south devastated\". Although not fighting in the war, the three gunslingers gradually become entangled in the battles that ensue (similar to The Great War, a film that screenwriters Luciano Vincenzoni and Age & Scarpelli had contributed to). An example of this is how Tuco and Blondie blow up a bridge to disperse two sides of the battle. They need to clear a way to the cemetery and succeed in doing so. It is also seen in how Angel Eyes disguises himself as a union sergeant so he can attack and torture Tuco to get the information he needs, intertwining himself in the battle in the process.</p><br/><h3>Release</h3><p>The Good, the Bad and the Ugly opened in Italy on 23 December 1966.</p><p>In the United States, A Fistful of Dollars was released 18 January 1967; For a Few Dollars More was released 10 May 1967 (17 months); and The Good, the Bad and the Ugly was released 29 December 1967 (12 months). Thus, all three of Leone's Dollars Trilogy films were released in the United States during the same year. The original Italian domestic version was 177 minutes long, but the international version was shown at various lengths. Most prints, specifically those shown in the United States, had a runtime of 161 minutes, 16 minutes shorter than the Italian premiere version, but others, especially British prints, ran as short as 148 minutes.</p><h4>Box office</h4><p>In Italy, the film grossed $6.3 million at the time. In the United States and Canada, the film grossed $25.1 million. It also grossed $7.5 million in other international territories, for a total of $38.9 million grossed worldwide.</p><h4>Critical reception</h4><p>On review aggregator Rotten Tomatoes, The Good, the Bad and the Ugly holds an approval rating of 97% based on 75 reviews, with an average rating of 8.8/10. The website's critical consensus reads, \"Arguably the greatest of the spaghetti westerns, this epic features a compelling story, memorable performances, breathtaking landscapes, and a haunting score.\" Metacritic, which uses a weighted average, assigned the film a score of 90 out of 100 based on 7 reviews, indicating \"universal acclaim.\"</p><p>Upon release, The Good, the Bad and the Ugly received criticism for its depiction of violence. Leone explains that \"the killings in my films are exaggerated because I wanted to make a tongue-in-cheek satire on run-of-the-mill westerns... The west was made by violent, uncomplicated men, and it is this strength and simplicity that I try to recapture in my pictures.\" To this day, Leone's effort to reinvigorate the timeworn Western is widely acknowledged.</p><p>Critical opinion of the film on initial release was mixed, as many reviewers at that time looked down on \"Spaghetti Westerns\". In a negative review in The New York Times, a critic Renata Adler said that the film \"must be the most expensive, pious and repellent movie in the history of its peculiar genre.\" Charles Champlin of the Los Angeles Times wrote that the \"temptation is hereby proved irresistible to call The Good, The Bad and the Ugly, now playing citywide, The Bad, The Dull, and the Interminable, only because it is.\" Roger Ebert, who later included the film in his list of Great Movies, retrospectively noted that in his original review he had \"described a four-star movie, but only gave it three stars, perhaps because it was a 'Spaghetti Western' and so could not be art.\"</p><h4>Home media</h4><p>On January 28, 1998, the film was released on DVD by MGM Home Video. Its release from MGM contained 14 minutes of scenes that were cut from the film's North American release, including a scene which explains how Angel Eyes came to be waiting for Blondie and Tuco at the Union prison camp.</p><p>In 2002, the film was restored with the 14 minutes of scenes cut for US release re-inserted into the film. Clint Eastwood and Eli Wallach were brought back in to dub their characters' lines more than 35 years after the film's original release. Voice actor Simon Prescott substituted for Lee Van Cleef who had died in 1989. Other voice actors filled in for actors who had since died. In 2004, MGM released this version in a two-disc special edition DVD.</p><p>Disc 1 contains an audio commentary with writer and critic Richard Schickel. Disc 2 contains two documentaries, \"Leone's West\" and \"The Man Who Lost The Civil War\", followed by the featurette \"Restoring 'The Good, the Bad, and the Ugly'\"; an animated gallery of missing sequences titled \"The Socorro Sequence: A Reconstruction\"; an extended Tuco torture scene; a featurette called \"Il Maestro\"; an audio featurette named \"Il Maestro, Part 2\"; a French trailer; and a poster gallery.</p><p>This DVD was generally well received, though some purists complained about the re-mixed stereo soundtrack with many completely new sound effects (notably, the gunshots were replaced), with no option for the original soundtrack. At least one scene that was re-inserted had been cut by Leone before the film's release in Italy but had been shown once at the Italian premiere. According to Richard Schickel, Leone willingly cut the scene for pacing reasons; thus, restoring it was contrary to the director's wishes. MGM re-released the 2004 DVD edition in their \"Sergio Leone Anthology\" box set in 2007. Also included were the two other \"Dollars\" films, and Duck, You Sucker!. On 12 May 2009, the extended version of the film was released on Blu-ray. It contains the same special features as the 2004 special edition DVD, except that it includes an added commentary by film historian Sir Christopher Frayling.</p><p>The film was re-released on Blu-ray in 2014 using a new 4K remaster, featuring improved picture quality and detail but a change of color timing, resulting in the film having a more yellow hue than on previous releases. It was re-released on Blu-ray and DVD by Kino Lorber Studio Classics on 15 August 2017, in a new 50th Anniversary release that featured both theatrical and extended cuts, as well as new bonus features, and an attempt to correct the yellow color timing from the earlier disc. On 27 April 2021, Kino released an Ultra HD Blu-ray version of the theatrical cut, using the same scan from the 2014 remaster, but with extensive color correction.</p><h4>Deleted scenes</h4><p>The following scenes were originally deleted by distributors from the British and American theatrical versions of the film but were restored after the release of the 2004 Special Edition DVD.</p><ul><li>During his search for Bill Carson, Angel Eyes stumbles upon an embattled Confederate outpost after a massive artillery bombardment. Once there, after witnessing the wretched conditions of the survivors, he bribes a Confederate soldier (Víctor Israel, dubbed by Tom Wyner) for clues about Bill Carson.</li><li>After being betrayed by Blondie, surviving the desert on his way to civilization, and assembling a good revolver from the parts of worn-out guns being sold at a general store, Tuco meets with members of his gang in a distant cave, where he conspires with them to hunt and kill Blondie.</li><li>The sequence with Tuco and Blondie crossing the desert has been extended: Tuco mentally tortures a severely dehydrated Blondie by eating and bathing in front of him.</li><li>Tuco, transporting a dehydrated Blondie, finds a Confederate camp whose occupants tell him that Father Ramirez's monastery is nearby.</li><li>Tuco and Blondie discuss their plans when departing in a wagon from Father Ramirez's monastery.</li><li>A scene where Blondie and Angel Eyes are resting by a creek when a man appears and Blondie shoots him. Angel Eyes asks the rest of his men to come out of hiding. When the five men come out, Blondie counts them (including Angel Eyes), and concludes that six is the perfect number, implying one for each bullet in his gun.</li><li>The sequence with Tuco, Blondie, and Captain Clinton has been extended: Clinton asks for their names, which they are reluctant to give.</li></ul><p>The footage below is all featured within supplementary features of the 2004 DVD release</p><ul><li>Additional footage of the sequence where Tuco is tortured by Angel Eyes's henchman was discovered. The original negative of this footage was deemed too badly damaged to be used in the theatrical cut.</li><li>Lost footage of the missing Socorro Sequence where Tuco continues his search for Blondie in a Texican pueblo while Blondie is in a hotel room with a Mexican woman (Silvana Bacci) is reconstructed with photos and unfinished snippets from the French trailer. Also, in the documentary \"Reconstructing The Good, the Bad, and the Ugly\", what looks to be footage of Tuco lighting cannons before the Ecstasy of the Gold sequence appears briefly. None of these scenes or sequences appear in the 2004 re-release but are featured in the supplementary features.</li></ul><br/><h3>Legacy</h3><h4>Re-evaluation</h4><p>Despite the initial negative reception by some critics, the film has since accumulated very positive feedback. It is listed in Time's \"100 Greatest Movies of the Last Century\" as selected by critics Richard Corliss and Richard Schickel. The Good, the Bad and the Ugly has been described as European cinema's best Western, and Quentin Tarantino has called it \"the best-directed film of all time\" and \"the greatest achievement in the history of cinema\". This was reflected in his votes for the 2002 and 2012 Sight & Sound magazine polls, in which he voted for The Good, the Bad and the Ugly as his choice for the best film ever made. Its main music theme from the soundtrack is regarded by Classic FM as one of the most iconic themes of all time. Variety magazine ranked the film number 49 on their list of the 50 greatest movies. In 2002, Film4 held a poll of the 100 Greatest Movies, on which The Good, the Bad and the Ugly was voted in at number 46. Premiere magazine included the film on their 100 Most Daring Movies Ever Made list. Mr. Showbiz ranked the film #81 on its 100 Best Movies of All Time list.</p><p>Empire magazine added The Good, the Bad and the Ugly to their Masterpiece collection in the September 2007 issue, and their poll of \"The 500 Greatest Movies\", The Good, the Bad and the Ugly was voted in at number 25. In 2014, The Good the Bad and the Ugly was ranked the 47th greatest film ever made on Empire's list of \"The 301 Greatest Movies Of All Time\" as voted by the magazine's readers. It was also placed on a similar list of 1000 movies by The New York Times. In 2014, Time Out polled several film critics, directors, actors and stunt actors to list their top action films. The Good, The Bad and the Ugly placed 52nd on their list. An article on the BBC website considers the 'lasting legacy of the film, and describes the trio scene as \"one of the most riveting and acclaimed feature films sequences of all time\".</p><h4>In popular culture</h4><p>The film's title has entered the English language as an idiomatic expression. Typically used when describing something thoroughly, the respective phrases refer to upsides, downsides, and the parts that could, or should have been done better, but were not.</p><p>Quentin Tarantino paid homage to the film's climactic standoff scene in his 1992 film Reservoir Dogs.</p><p>The film was novelized in 1967 by Joe Millard as part of the \"Dollars Western\" series based on the \"Man with No Name\". The South Korean western movie The Good, the Bad, the Weird (2008) is inspired by the film, with much of its plot and character elements borrowed from Leone's film. In his introduction to the 2003 revised edition of his novel The Dark Tower: The Gunslinger, Stephen King said the film was a primary influence for the Dark Tower series, with Eastwood's character inspiring the creation of King's protagonist, Roland Deschain.</p><p>In 1975, Willie Colón with Yomo Toro and Hector Lavoe, released an album titled The Good, the Bad, the Ugly. The album cover featured the three in cowboy attire.</p><h4>Impact on Western genre</h4><p>While the Dollars Trilogy was not the beginning of the so-called Spaghetti Western cycle in Italy, many in the US saw it as the beginning of an Italian invasion of the most recognizably American film genre. Christopher Frayling argues that, on the whole, Americans had become \"bored with an exhausted Hollywood genre\". He notes that Pauline Kael, for example, had appreciated how non-American films of the time \"could exploit the conventions of the Western genre, while debunking its morality\". Along with Peter Bondanella and others, Frayling argues that such revisionism was the key to Leone's success and, to some degree, to that of the Spaghetti Western genre as a whole. The Good, the Bad and the Ugly, like the later Once Upon A Time In The West, belongs to multiple Western sub-genres: Epic Western, Outlaw (Gunfighter) Film, Revisionist Western and Spaghetti Western.</p><p>The Good, The Bad and The Ugly has been called the definitive Spaghetti Western – colloquially, these are Westerns produced and directed by Italians, often in collaboration with other European countries, especially Spain and West Germany. The name 'Spaghetti Western' originally was a pejorative term, given by foreign critics to these films because they thought they were inferior to American westerns. Most of the films were made with low budgets, but several still managed to be innovative and artistic, although at the time they did not get much recognition, even in Europe. The genre is unmistakably a Catholic genre, with a visual style strongly influenced by the Catholic iconography of, for instance, the crucifixion or the last supper. The outdoor scenes of many Spaghetti Westerns, especially those with a relatively higher budget, were shot in Spain, in particular the Tabernas desert of Almería and Colmenar Viejo and Hoyo de Manzanares. In Italy, the region of Lazio was a favorite location.</p><p>The genre expanded and became an international sensation with the success of Sergio Leone's A Fistful of Dollars, an adaptation of Akira Kurosawa's samurai film Yojimbo. But a handful of westerns were made in Italy before Leone redefined the genre, and the Italians were not the first to make westerns in Europe in the sixties. But it was Leone who defined the look and attitude of the genre with his first western and the two that soon were to follow: For a Few Dollars More and The Good, the Bad and the Ugly. Together these films are called the Dollars Trilogy. Leone's portrayal of the west, in the latter, was not concerned with ideas of the frontier or good vs. evil but rather interested in how the world is unmistakably more complicated than that, and how the western world is one of kill or be killed. These films featured knifings, beatings, shootouts, or other violent action every five to ten minutes. \"The issue of morality belongs to the American western,\" explains Italian director Ferdinando Baldi. \"The violence in our movies is more gratuitous than in American films. There was very little morality because often the protagonist was a bad guy.\" Eastwood's character is a violent and ruthless killer who murders opponents for fun and profit. Behind his cold and stony stare is a cynical mind powered by a dubious morality. Unlike earlier cowboy heroes, Eastwood's character constantly smokes a small cigar and hardly ever shaves. He wears a flat-topped hat and Mexican poncho instead of more traditional western costuming. He never introduces himself when he meets anyone, and nobody ever asks his name. Furthermore, Spaghetti Westerns redefined the western genre to fit the everchanging times of the 1960s and '70s. Rather than portraying the traditional mythic West as an exotic and beautiful land of opportunity, hope, and redemption, they depicted a desolate and forsaken West. In these violent and troubled times, Spaghetti Westerns, with their antiheroes, ambiguous morals, brutality, and anti-Establishment themes, resonated with audiences. The film's gratuitous violence, surrealistic style, gloomy look, and eerie sound captured the era's melancholy. It is this new approach to the genre that defined the revisionist western of the late '70s and early '80s; a movement started by this moral ambiguity of the Spaghetti Westerns, as well as a westerns placement in the context of historical events; both attributes defined and set by The Good, the Bad, and The Ugly.</p><p>These films were undeniably stylish. With grandiose wide shots and close-ups that peered into the eyes and souls of the characters, The Good, The Bad, and The Ugly, had the defining cinematographic techniques of the Spaghetti Western. This was Leone's signature technique, using long drawn shots interspersed with extreme close-ups that build tension, as well as develop characters. However, Leone's movies were not just influenced by style. As Quentin Tarantino notes:</p><blockquote>There was also realism to them: those shitty Mexican towns, the little shacks — a bit bigger to accommodate the camera — all the plates they put the beans on, the big wooden spoons. The films were so realistic, which had always seemed to be missing in the westerns of the 1930s, '40s, and '50s, in the brutality and the different shades of grey and black. Leone found an even darker black and off-white. There is realism in Leone's presentation of the Civil War in The Good, the Bad and the Ugly that was missing from all the Civil War movies that happened before him. Leone's film, and the genre that he defined within it, shows a west that is more violent, less talky, more complex, more theatrical, and just overall more iconic through the use of music, appearing operatic as the music is an illustrative ingredient of the narrative.</blockquote><p>With a greater sense of operatic violence than their American cousins, the cycle of spaghetti westerns lasted just a few years, but it has been said to have rewritten the genre.</p><br/><h3>Proposed sequel</h3><p>The Good, the Bad and the Ugly is the last film in the Dollars Trilogy, and thus, does not have an official sequel. However, screenwriter Luciano Vincenzoni stated on numerous occasions that he had written a treatment for a sequel, tentatively titled Il buono, il brutto, il cattivo n. 2 (The Good, the Bad and the Ugly 2). According to Vincenzoni and Eli Wallach, the film would have been set 20 years after the original and would have followed Tuco pursuing Blondie's grandson for the gold. Clint Eastwood expressed interest in taking part in the film's production, including acting as narrator. Joe Dante and Leone were also approached to direct and produce the film respectively. The project was ultimately vetoed by Leone, as he did not want the original film's title or characters to be reused, nor did he want to be involved in another Western film.</p><br/>"
  },
  "errorMessage": ""
}