{
  "imDbId": "tt0027977",
  "title": "Modern Times",
  "fullTitle": "Modern Times (1936)",
  "type": "Movie",
  "year": "1936",
  "language": "en",
  "titleInLanguage": "Modern Times (film)",
  "url": "https://en.wikipedia.org/wiki/Modern_Times_(film)",
  "plotShort": {
    "plainText": "Modern Times is a 1936 American part-talkie satirical romantic black comedy film written and directed by Charlie Chaplin in which his iconic Little Tramp character, his last performance as the character, struggles to survive in the modern, industrialized world. The movie stars Chaplin, Paulette Goddard, Henry Bergman, Tiny Sandford and Chester Conklin.\r\nModern Times has won many awards and honors. It was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2003, it was screened \"out of competition\" at the Cannes Film Festival.",
    "html": "<p>Modern Times is a 1936 American part-talkie satirical romantic black comedy film written and directed by Charlie Chaplin in which his iconic Little Tramp character, his last performance as the character, struggles to survive in the modern, industrialized world. The movie stars Chaplin, Paulette Goddard, Henry Bergman, Tiny Sandford and Chester Conklin.</p><p>Modern Times has won many awards and honors. It was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2003, it was screened \"out of competition\" at the Cannes Film Festival.</p>"
  },
  "plotFull": {
    "plainText": "Modern Times is a 1936 American part-talkie satirical romantic black comedy film written and directed by Charlie Chaplin in which his iconic Little Tramp character, his last performance as the character, struggles to survive in the modern, industrialized world. The movie stars Chaplin, Paulette Goddard, Henry Bergman, Tiny Sandford and Chester Conklin.\r\nModern Times has won many awards and honors. It was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2003, it was screened \"out of competition\" at the Cannes Film Festival.\r\nPlot\r\nThe Tramp works on an assembly line, where he suffers greatly due to the stress and pace of the repetitive work. He eventually suffers a nervous breakdown and runs amok, getting stuck within a machine and throwing the factory into chaos; he is then sent to the hospital. Following his recovery, the now unemployed Tramp is mistakenly arrested in a Communist demonstration. In jail, he accidentally ingests smuggled cocaine, and in his subsequent delirium, he avoids being put back in his cell. When he returns, he stumbles upon a jailbreak and knocks the convicts unconscious for which he is hailed as a hero and given special treatment. When he is informed that he will soon be released due to his heroic actions, he argues unsuccessfully that he prefers life in jail.\r\nUpon release, he applies for a new job with a shipbuilder but leaves after causing an accident. Soon after, he runs into an orphaned girl, Ellen (Paulette Goddard), who is fleeing the police after stealing a loaf of bread. Determined to go back to jail and to save her from arrest, the Tramp tells the police that he is the thief and asks to be arrested, but a witness reveals his deception and he is freed. He then eats an enormous amount of food at a cafeteria without paying to get arrested, and once again encounters Ellen in a paddy wagon after he is put in it. It soon crashes however, and she convinces him to escape with her. The Tramp then gets a job as a night watchman at a department store, and encounters three burglars led by \"Big Bill,\" a fellow worker from the factory, who explains that they are hungry and desperate. After sharing drinks with them, he wakes up the next morning during opening hours and is arrested once again for failing to call the police on the burglars and for sleeping in the store’s clothes on a desk, shocking a customer and the storekeeper.\r\nDays later, Ellen takes him to a run-down shack to live in. The next morning, he reads about an old factory’s re-opening and lands a job as a mechanic's assistant. The other workers then suddenly decide to go on strike, and tell the Tramp to leave with them. Outside the factory, he accidentally launches a brick at a policeman and is arrested again.\r\nHe is released two weeks later, and learns that Ellen is now a café dancer. She gets him a job as a singer and waiter, but he goes about his duties clumsily. During his floor show, he loses his cuffs, which bear the lyrics to his song, but he rescues the act by improvising the lyrics using gibberish and by pantomiming. When police arrive to arrest Ellen for her earlier escape, the two are forced to flee again, and Ellen despairs that their struggles are all pointless, but the Tramp reassures her. At a bright dawn, they walk down the road towards an uncertain but hopeful future.\r\nCast\r\nCharlie Chaplin as a factory worker (The Tramp)\r\nPaulette Goddard as Ellen Peterson \"The Gamin\"\r\nHenry Bergman as the Café proprietor\r\nStanley \"Tiny\" Sandford as Big Bill\r\nChester Conklin as a Mechanic\r\nAl Ernest Garcia as the President of the Electro Steel Corp.\r\nStanley Blystone as Gamin's father\r\nRichard Alexander as the prison cellmate\r\nCecil Reynolds as a Minister\r\nMira McKinney as the Minister's wife\r\nMurdock MacQuarrie as J. Widdecombe Billows, inventor\r\nWilfred Lucas as the Juvenile Officer\r\nEdward LeSaint as Sheriff Couler\r\nFred Malatesta as the Café head waiter\r\nSammy Stein as the turbine operator\r\nHank Mann as burglar with Big Bill\r\nLouis Natheaux as burglar with Big Bill\r\nGloria DeHaven as Gamin's sister (uncredited)\r\nGloria Delson as Gamin's sister (uncredited)\r\nJuana Sutton as woman with buttoned bosom\r\nTed Oliver as Billow's assistant\r\nBobby Barber as Worker (uncredited)\r\nHeinie Conklin as Worker (uncredited)\r\nHarry Wilson as Worker (uncredited)\r\nFred Shields as Speaker on Phonograph Record (uncredited)\r\nProduction\r\nDuring a European tour promoting City Lights, Chaplin got the inspiration for Modern Times from both the lamentable conditions of the continent through the Great Depression, along with a conversation with Mahatma Gandhi in which they discussed modern technology. Chaplin did not understand why Gandhi generally opposed it, though he granted that \"machinery with only consideration of profit\" had put people out of work and ruined lives.\r\nChaplin began preparing the film in 1934 as his first \"talkie\", and went as far as writing a dialogue script and experimenting with some sound scenes. However, he soon abandoned these attempts and reverted to a silent format with synchronized sound effects and sparse dialogue. The dialogue experiments confirmed his long-standing conviction that the universal appeal of his \"Little Tramp\" character would be lost if the character ever spoke on screen. Most of the film was shot at \"silent speed\", 18 frames per second, which when projected at \"sound speed\", 24 frames per second, made the slapstick action appear even more frenetic. The duration of filming was long for the time, beginning on October 11, 1934, and ending on August 30, 1935.\r\nChaplin biographer Jeffrey Vance has noted: “Chaplin recognized that Modern Times was the valedictory for the Tramp and deliberately included many gags and sequences as a loving farewell to the character and an homage to the visual comedy tradition.\"\r\nThis film also famously uses matte painting in the harrowing skating scene where Charlie skates blindfolded, not realizing he's constantly near the edge and very likely could fall down. The illusory drop has been matte-painted, and Chaplin was never in actual danger while filming this scene — in reality, he skated on a plain floor, with a ledge for him to discern when to stop. This can be observed in the fact that, at one moment, Chaplin's back wheel briefly disappeared behind the painting. This most likely escaped the eyes of Chaplin, which could be the reason he left it in.\r\nThe reference to drugs seen in the prison sequence is somewhat daring for the time (since the production code, established in 1930, forbade the depiction of illegal drug use in films); Chaplin had made drug references before in one of his most famous short films, Easy Street, released in 1917.\r\nMusic\r\nAccording to the official documents, the music score was composed by Chaplin himself, and arranged with the assistance of Alfred Newman, who had collaborated with Chaplin on the music score of his previous film City Lights. Newman and Chaplin had a falling out near the end of the Modern Times soundtrack recording sessions, leading to Newman's angry departure.\r\nThe romance theme was later given lyrics, and became the pop standard \"Smile\", first recorded by Nat King Cole. A cover of this song by Jimmy Durante was also used in the trailer for the 2019 film Joker, in which the lead character also watches scenes from a showing of Modern Times after sneaking into a movie theatre.\r\nModern Times was the first film where Chaplin's voice is heard as he performs Léo Daniderff's comical song \"Je cherche après Titine\". Chaplin's version is also known as \"The Nonsense Song\", as his character sings it in gibberish. The lyrics are nonsensical but appear to contain words from French and Italian; the use of deliberately half-intelligible wording for comic effect points the way towards Adenoid Hynkel's speeches in The Great Dictator.\r\nAccording to film composer David Raksin, Chaplin wrote the music as a young man wanting to make a name for himself. He would sit, often in the washroom, humming tunes and telling Raksin to \"take this down\". Raksin's job was to turn the humming into a score and create timings and synchronization that fit the situations. Chaplin was a violinist and had some musical knowledge, but he was not an orchestrator and was unfamiliar with synchronization. Along with Edward B. Powell, Raksin did receive screen credit for the music arrangements. Raksin later created scores for films including Laura and The Day After.\r\nAnalysis of themes\r\nAnalyzing Modern Times leads us to get a deeper understanding of what Chaplin was trying to achieve by creating and producing this film. The film explores several themes relating to how the times were during the release of this movie, including man vs machine, the powerlessness of the poor, and concern for unemployment, poverty, and crime. Chaplin displays the subject with the absence of words, emphasizing the significance of extreme body movements and various music clips to convey this story.\r\nOne of the main themes in Modern Times is the conflict of man vs machine. The beginning of the film presents the protagonist’s physical struggle with the factory machine, and desperate attempts to keep pace with the machinery’s rapid speed. Analyzing this deeper, we discover what Chaplin is trying to interpret through his own comical and extreme body movements. It begins to depict the dehumanizing effects of industrialization and automation on the working class. The Tramp struggles to adapt to the modern industrial world and faces numerous challenges while working on an assembly line. Another scene that conveys meaning is when Al Ernest Garcia is presented with a machine that can feed workers hands-free while they continue to work, discarding lunchtime. It is made to seem as if we are physically tied down to our work and there is nothing we can do because of the looming existence of unemployment.\r\nAnother theme in the film, the looming presence of the powerlessness of the poor portrays a society that is highly stratified, with the wealthy and powerful exploiting the poor and working class for their own gain. In this film, those representing power are the factory owners and police, who use their position and authority to control the lives of those below them, the workers and the unemployed. This can be depicted through the film, as the owner of the factory was the only one who had a voice in the factory, giving the scene that they would be able to control, watch and take the power of the workers away at any second.\r\nUnemployment, poverty, and crime are also issues that are explored in the film. The protagonist, like others during the Great Depression, is struggling to find work after he is fired from his dreadful job. His experiences outside of the factory highlight the challenges and desperation there is that come with unemployment. Struggling to make ends meet despite his best efforts, for example, the house he created that was falling apart, portrays the pervasive theme of poverty. The film creates links between poverty and crime, having the protagonist be fired from his job, accused of theft, chased by the police, and end up in jail.\r\nFinally, the significance of extreme body movements that were displayed by Chaplin and the absence of words in Modern Times is definitely noteworthy. The film relies heavily on physical comedy and exaggerated body movements to convey the story, as there is very little dialogue. This approach allows the film to transcend language barriers and communicate its message through visual and physical humor. Additionally, the absence of words emphasizes the dehumanizing effect of industrialization and automation on the working class, as their voices and opinions are silenced.\r\nReception\r\nModern Times is often hailed as one of Chaplin's greatest achievements, and it remains one of his most popular films. It holds an approval rating of 98% on Rotten Tomatoes based on 108 reviews, with a weighted average of 9.4/10. The website's critical consensus reads, \"A slapstick skewering of industrialized America, Modern Times is as politically incisive as it is laugh-out-loud hilarious.\" Metacritic reports an aggregated score of 96/100 based on 4 critics, indicating \"universal acclaim\".\r\nNaming it the Best Film of the 30s Decade, Flickside writes: \"Chaplin's Modern Times is a thoughtful critique on the anxieties of modernization dealt with pathos and humour.\" Contemporary reviews were very positive. Frank Nugent of The New York Times wrote: \"'Modern Times' has still the same old Charlie, the lovable little fellow whose hands and feet and prankish eyebrows can beat an irresistible tattoo upon an audience's funnybone or hold it still, taut beneath the spell of human tragedy ... Time has not changed his genius.\" Variety called it \"grand fun and sound entertainment\". Film Daily wrote: \"Charlie Chaplin has scored one of his greatest triumphs.\" John Mosher of The New Yorker wrote that Chaplin \"manufactures some superb laughs ... In all, it's a rambling sketch, a little at loose ends at times, sometimes rather slight in effect, and now and then secure in its rich, old-fashioned funniness.\" Burns Mantle called the film \"another hilariously rowdy success\".\r\nWriting for The Spectator in 1936, Graham Greene strongly praised the film, noting that, although there had always been a bit of a dated feel to his previous works, Chaplin \"has at last definitely entered the contemporary scene\". Greene noted that, whereas prior Chaplin films had featured \"fair and featureless\" heroines, the casting of Paulette Goddard suggested that his female characters might be presented with more personality than previously. He also voiced concern that the film would be considered to be a Communist film when in reality Chaplin's message was predominantly apolitical: \" presents, he doesn't offer political solutions.\"\r\nFrench philosophers Jean-Paul Sartre, Simone de Beauvoir and Maurice Merleau-Ponty named their journal, Les Temps modernes, after it.\r\nModern Times earned $1.8 million in North American theatrical rentals during its release, becoming one of the top-grossing films of 1936. It was the most popular film at the British box office in 1935–36.\r\nThe iconic depiction of Chaplin working frantically to keep up with an assembly line inspired later comedy routines including Disney's Der Fuehrer's Face (Donald Duck alternately assembling artillery shells and saluting portraits of Adolf Hitler) and an episode of I Love Lucy titled \"Job Switching\" (Lucy and Ethel trying to keep up with an ever-increasing volume of chocolate candies, eventually stuffing them in their mouths, hats, and blouses). The opening of a fantasy sequence in the film, in which the unemployed factory worker trips over a footstool upon entering the living room of his \"dream home\" with the Gamin, inspired a similar opening to The Dick Van Dyke Show.\r\nThis was Chaplin's first overtly political-themed film, and its unflattering portrayal of industrial society generated controversy in some quarters upon its initial release. Writing in The Liberal News, the official magazine of the British Liberal Party, in October 1936, Willoughby Dewar observed that Modern Times \"should be seen by every Young Liberal. It is, among other things, a piece of first-class Liberal propaganda.\" In Nazi Germany, propaganda minister Joseph Goebbels banned the film from being shown because of its alleged advocacy of communism.\r\nThe film exhibits slight similarities to a lesser known 1931 French film directed by René Clair entitled À nous la liberté (Liberty for Us) – the assembly line sequence is an instance in that both films depict it, but in different ways. The German film company Tobis Film, hungry for cash, sued Chaplin following the film's release but to no avail. They sued again after World War II (considered revenge for Chaplin's anti-Nazi statements in The Great Dictator). This time, they settled with Chaplin out of court. Clair, a friend and huge admirer of Chaplin who was flattered that the film icon would depict a similar subject, was deeply embarrassed that Tobis Film would sue Chaplin, and was never part of the case.\r\nThe film did attract criticism for being almost completely silent, despite the movie industry having long since embraced the talking picture. Chaplin famously feared that the mystery and romanticism of the Tramp character would be ruined if he spoke, and also that it would alienate his fans in non-English speaking territories. His future films, however, would be fully fledged \"talkies\" – although without the character of the Little Tramp.\r\nChaplin biographer Jeffrey Vance has written of the reception and legacy of this classic comedy:\r\nModern Times is perhaps more meaningful now than at any time since its first release. The twentieth-century theme of the film, farsighted for its time—the struggle to eschew alienation and preserve humanity in a modern, mechanized world—profoundly reflects issues facing the twenty-first century. The Tramp's travails in Modern Times and the comedic mayhem that ensues should provide strength and comfort to all who feel like helpless cogs in a world beyond control. Through its universal themes and comic inventiveness, Modern Times remains one of Chaplin's greatest and most enduring works. Perhaps more important, it is the Tramp's finale, a tribute to Chaplin's most beloved character and the silent-film era he commanded for a generation.\r\nThe film is recognized by American Film Institute in these lists:\r\n1998: AFI's 100 Years ... 100 Movies – #81\r\n2000: AFI's 100 Years ... 100 Laughs – #33\r\n2007: AFI's 100 Years ... 100 Movies (10th Anniversary Edition) – #78\r\nThe Village Voice ranked Modern Times at No. 62 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. In January 2002, the film was voted at No. 58 on the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics. The film was voted at No. 74 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In the 2012 Sight & Sound polls, it was ranked the 63rd-greatest film ever made in the critics' poll and 20th in the directors' poll. In the earlier 2002 version of the list the film ranked 35th among critics. In 2015, Modern Times ranked 67th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. The film was voted at No. 12 on the list of The 100 greatest comedies of all time by a poll of 253 film critics from 52 countries conducted by the BBC in 2017. In 2021 the film ranked 49th on Time Out magazine's list of The 100 best movies of all time.\r\nRestoration\r\nA digitally restored version of the film was released in 2003. The French company MK2 searched the world for good copies of the original footage, cut them together and processed each of the 126,000 frames, removing scratches and dust, and ensuring optimal image stability and balanced black and white tone levels. The restored version was first shown at the Cannes Film Festival in 2003.",
    "html": "<p>Modern Times is a 1936 American part-talkie satirical romantic black comedy film written and directed by Charlie Chaplin in which his iconic Little Tramp character, his last performance as the character, struggles to survive in the modern, industrialized world. The movie stars Chaplin, Paulette Goddard, Henry Bergman, Tiny Sandford and Chester Conklin.</p><p>Modern Times has won many awards and honors. It was one of the first 25 films selected by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\". In 2003, it was screened \"out of competition\" at the Cannes Film Festival.</p><br/><h3>Plot</h3><p>The Tramp works on an assembly line, where he suffers greatly due to the stress and pace of the repetitive work. He eventually suffers a nervous breakdown and runs amok, getting stuck within a machine and throwing the factory into chaos; he is then sent to the hospital. Following his recovery, the now unemployed Tramp is mistakenly arrested in a Communist demonstration. In jail, he accidentally ingests smuggled cocaine, and in his subsequent delirium, he avoids being put back in his cell. When he returns, he stumbles upon a jailbreak and knocks the convicts unconscious for which he is hailed as a hero and given special treatment. When he is informed that he will soon be released due to his heroic actions, he argues unsuccessfully that he prefers life in jail.</p><p>Upon release, he applies for a new job with a shipbuilder but leaves after causing an accident. Soon after, he runs into an orphaned girl, Ellen (Paulette Goddard), who is fleeing the police after stealing a loaf of bread. Determined to go back to jail and to save her from arrest, the Tramp tells the police that he is the thief and asks to be arrested, but a witness reveals his deception and he is freed. He then eats an enormous amount of food at a cafeteria without paying to get arrested, and once again encounters Ellen in a paddy wagon after he is put in it. It soon crashes however, and she convinces him to escape with her. The Tramp then gets a job as a night watchman at a department store, and encounters three burglars led by \"Big Bill,\" a fellow worker from the factory, who explains that they are hungry and desperate. After sharing drinks with them, he wakes up the next morning during opening hours and is arrested once again for failing to call the police on the burglars and for sleeping in the store’s clothes on a desk, shocking a customer and the storekeeper.</p><p>Days later, Ellen takes him to a run-down shack to live in. The next morning, he reads about an old factory’s re-opening and lands a job as a mechanic's assistant. The other workers then suddenly decide to go on strike, and tell the Tramp to leave with them. Outside the factory, he accidentally launches a brick at a policeman and is arrested again.</p><p>He is released two weeks later, and learns that Ellen is now a café dancer. She gets him a job as a singer and waiter, but he goes about his duties clumsily. During his floor show, he loses his cuffs, which bear the lyrics to his song, but he rescues the act by improvising the lyrics using gibberish and by pantomiming. When police arrive to arrest Ellen for her earlier escape, the two are forced to flee again, and Ellen despairs that their struggles are all pointless, but the Tramp reassures her. At a bright dawn, they walk down the road towards an uncertain but hopeful future.</p><br/><h3>Cast</h3><ul><li>Charlie Chaplin as a factory worker (The Tramp)</li><li>Paulette Goddard as Ellen Peterson \"The Gamin\"</li><li>Henry Bergman as the Café proprietor</li><li>Stanley \"Tiny\" Sandford as Big Bill</li><li>Chester Conklin as a Mechanic</li><li>Al Ernest Garcia as the President of the Electro Steel Corp.</li><li>Stanley Blystone as Gamin's father</li><li>Richard Alexander as the prison cellmate</li><li>Cecil Reynolds as a Minister</li><li>Mira McKinney as the Minister's wife</li><li>Murdock MacQuarrie as J. Widdecombe Billows, inventor</li><li>Wilfred Lucas as the Juvenile Officer</li><li>Edward LeSaint as Sheriff Couler</li><li>Fred Malatesta as the Café head waiter</li><li>Sammy Stein as the turbine operator</li><li>Hank Mann as burglar with Big Bill</li><li>Louis Natheaux as burglar with Big Bill</li><li>Gloria DeHaven as Gamin's sister (uncredited)</li><li>Gloria Delson as Gamin's sister (uncredited)</li><li>Juana Sutton as woman with buttoned bosom</li><li>Ted Oliver as Billow's assistant</li><li>Bobby Barber as Worker (uncredited)</li><li>Heinie Conklin as Worker (uncredited)</li><li>Harry Wilson as Worker (uncredited)</li><li>Fred Shields as Speaker on Phonograph Record (uncredited)</li></ul><br/><h3>Production</h3><p>During a European tour promoting City Lights, Chaplin got the inspiration for Modern Times from both the lamentable conditions of the continent through the Great Depression, along with a conversation with Mahatma Gandhi in which they discussed modern technology. Chaplin did not understand why Gandhi generally opposed it, though he granted that \"machinery with only consideration of profit\" had put people out of work and ruined lives.</p><p>Chaplin began preparing the film in 1934 as his first \"talkie\", and went as far as writing a dialogue script and experimenting with some sound scenes. However, he soon abandoned these attempts and reverted to a silent format with synchronized sound effects and sparse dialogue. The dialogue experiments confirmed his long-standing conviction that the universal appeal of his \"Little Tramp\" character would be lost if the character ever spoke on screen. Most of the film was shot at \"silent speed\", 18 frames per second, which when projected at \"sound speed\", 24 frames per second, made the slapstick action appear even more frenetic. The duration of filming was long for the time, beginning on October 11, 1934, and ending on August 30, 1935.</p><p>Chaplin biographer Jeffrey Vance has noted: “Chaplin recognized that Modern Times was the valedictory for the Tramp and deliberately included many gags and sequences as a loving farewell to the character and an homage to the visual comedy tradition.\"</p><p>This film also famously uses matte painting in the harrowing skating scene where Charlie skates blindfolded, not realizing he's constantly near the edge and very likely could fall down. The illusory drop has been matte-painted, and Chaplin was never in actual danger while filming this scene — in reality, he skated on a plain floor, with a ledge for him to discern when to stop. This can be observed in the fact that, at one moment, Chaplin's back wheel briefly disappeared behind the painting. This most likely escaped the eyes of Chaplin, which could be the reason he left it in.</p><p>The reference to drugs seen in the prison sequence is somewhat daring for the time (since the production code, established in 1930, forbade the depiction of illegal drug use in films); Chaplin had made drug references before in one of his most famous short films, Easy Street, released in 1917.</p><br/><h3>Music</h3><p>According to the official documents, the music score was composed by Chaplin himself, and arranged with the assistance of Alfred Newman, who had collaborated with Chaplin on the music score of his previous film City Lights. Newman and Chaplin had a falling out near the end of the Modern Times soundtrack recording sessions, leading to Newman's angry departure.</p><p>The romance theme was later given lyrics, and became the pop standard \"Smile\", first recorded by Nat King Cole. A cover of this song by Jimmy Durante was also used in the trailer for the 2019 film Joker, in which the lead character also watches scenes from a showing of Modern Times after sneaking into a movie theatre.</p><p>Modern Times was the first film where Chaplin's voice is heard as he performs Léo Daniderff's comical song \"Je cherche après Titine\". Chaplin's version is also known as \"The Nonsense Song\", as his character sings it in gibberish. The lyrics are nonsensical but appear to contain words from French and Italian; the use of deliberately half-intelligible wording for comic effect points the way towards Adenoid Hynkel's speeches in The Great Dictator.</p><p>According to film composer David Raksin, Chaplin wrote the music as a young man wanting to make a name for himself. He would sit, often in the washroom, humming tunes and telling Raksin to \"take this down\". Raksin's job was to turn the humming into a score and create timings and synchronization that fit the situations. Chaplin was a violinist and had some musical knowledge, but he was not an orchestrator and was unfamiliar with synchronization. Along with Edward B. Powell, Raksin did receive screen credit for the music arrangements. Raksin later created scores for films including Laura and The Day After.</p><br/><h3>Analysis of themes</h3><p>Analyzing Modern Times leads us to get a deeper understanding of what Chaplin was trying to achieve by creating and producing this film. The film explores several themes relating to how the times were during the release of this movie, including man vs machine, the powerlessness of the poor, and concern for unemployment, poverty, and crime. Chaplin displays the subject with the absence of words, emphasizing the significance of extreme body movements and various music clips to convey this story.</p><p>One of the main themes in Modern Times is the conflict of man vs machine. The beginning of the film presents the protagonist’s physical struggle with the factory machine, and desperate attempts to keep pace with the machinery’s rapid speed. Analyzing this deeper, we discover what Chaplin is trying to interpret through his own comical and extreme body movements. It begins to depict the dehumanizing effects of industrialization and automation on the working class. The Tramp struggles to adapt to the modern industrial world and faces numerous challenges while working on an assembly line. Another scene that conveys meaning is when Al Ernest Garcia is presented with a machine that can feed workers hands-free while they continue to work, discarding lunchtime. It is made to seem as if we are physically tied down to our work and there is nothing we can do because of the looming existence of unemployment.</p><p>Another theme in the film, the looming presence of the powerlessness of the poor portrays a society that is highly stratified, with the wealthy and powerful exploiting the poor and working class for their own gain. In this film, those representing power are the factory owners and police, who use their position and authority to control the lives of those below them, the workers and the unemployed. This can be depicted through the film, as the owner of the factory was the only one who had a voice in the factory, giving the scene that they would be able to control, watch and take the power of the workers away at any second.</p><p>Unemployment, poverty, and crime are also issues that are explored in the film. The protagonist, like others during the Great Depression, is struggling to find work after he is fired from his dreadful job. His experiences outside of the factory highlight the challenges and desperation there is that come with unemployment. Struggling to make ends meet despite his best efforts, for example, the house he created that was falling apart, portrays the pervasive theme of poverty. The film creates links between poverty and crime, having the protagonist be fired from his job, accused of theft, chased by the police, and end up in jail.</p><p>Finally, the significance of extreme body movements that were displayed by Chaplin and the absence of words in Modern Times is definitely noteworthy. The film relies heavily on physical comedy and exaggerated body movements to convey the story, as there is very little dialogue. This approach allows the film to transcend language barriers and communicate its message through visual and physical humor. Additionally, the absence of words emphasizes the dehumanizing effect of industrialization and automation on the working class, as their voices and opinions are silenced.</p><br/><h3>Reception</h3><p>Modern Times is often hailed as one of Chaplin's greatest achievements, and it remains one of his most popular films. It holds an approval rating of 98% on Rotten Tomatoes based on 108 reviews, with a weighted average of 9.4/10. The website's critical consensus reads, \"A slapstick skewering of industrialized America, Modern Times is as politically incisive as it is laugh-out-loud hilarious.\" Metacritic reports an aggregated score of 96/100 based on 4 critics, indicating \"universal acclaim\".</p><p>Naming it the Best Film of the 30s Decade, Flickside writes: \"Chaplin's Modern Times is a thoughtful critique on the anxieties of modernization dealt with pathos and humour.\" Contemporary reviews were very positive. Frank Nugent of The New York Times wrote: \"'Modern Times' has still the same old Charlie, the lovable little fellow whose hands and feet and prankish eyebrows can beat an irresistible tattoo upon an audience's funnybone or hold it still, taut beneath the spell of human tragedy ... Time has not changed his genius.\" Variety called it \"grand fun and sound entertainment\". Film Daily wrote: \"Charlie Chaplin has scored one of his greatest triumphs.\" John Mosher of The New Yorker wrote that Chaplin \"manufactures some superb laughs ... In all, it's a rambling sketch, a little at loose ends at times, sometimes rather slight in effect, and now and then secure in its rich, old-fashioned funniness.\" Burns Mantle called the film \"another hilariously rowdy success\".</p><p>Writing for The Spectator in 1936, Graham Greene strongly praised the film, noting that, although there had always been a bit of a dated feel to his previous works, Chaplin \"has at last definitely entered the contemporary scene\". Greene noted that, whereas prior Chaplin films had featured \"fair and featureless\" heroines, the casting of Paulette Goddard suggested that his female characters might be presented with more personality than previously. He also voiced concern that the film would be considered to be a Communist film when in reality Chaplin's message was predominantly apolitical: \" presents, he doesn't offer political solutions.\"</p><p>French philosophers Jean-Paul Sartre, Simone de Beauvoir and Maurice Merleau-Ponty named their journal, Les Temps modernes, after it.</p><p>Modern Times earned $1.8 million in North American theatrical rentals during its release, becoming one of the top-grossing films of 1936. It was the most popular film at the British box office in 1935–36.</p><p>The iconic depiction of Chaplin working frantically to keep up with an assembly line inspired later comedy routines including Disney's Der Fuehrer's Face (Donald Duck alternately assembling artillery shells and saluting portraits of Adolf Hitler) and an episode of I Love Lucy titled \"Job Switching\" (Lucy and Ethel trying to keep up with an ever-increasing volume of chocolate candies, eventually stuffing them in their mouths, hats, and blouses). The opening of a fantasy sequence in the film, in which the unemployed factory worker trips over a footstool upon entering the living room of his \"dream home\" with the Gamin, inspired a similar opening to The Dick Van Dyke Show.</p><p>This was Chaplin's first overtly political-themed film, and its unflattering portrayal of industrial society generated controversy in some quarters upon its initial release. Writing in The Liberal News, the official magazine of the British Liberal Party, in October 1936, Willoughby Dewar observed that Modern Times \"should be seen by every Young Liberal. It is, among other things, a piece of first-class Liberal propaganda.\" In Nazi Germany, propaganda minister Joseph Goebbels banned the film from being shown because of its alleged advocacy of communism.</p><p>The film exhibits slight similarities to a lesser known 1931 French film directed by René Clair entitled À nous la liberté (Liberty for Us) – the assembly line sequence is an instance in that both films depict it, but in different ways. The German film company Tobis Film, hungry for cash, sued Chaplin following the film's release but to no avail. They sued again after World War II (considered revenge for Chaplin's anti-Nazi statements in The Great Dictator). This time, they settled with Chaplin out of court. Clair, a friend and huge admirer of Chaplin who was flattered that the film icon would depict a similar subject, was deeply embarrassed that Tobis Film would sue Chaplin, and was never part of the case.</p><p>The film did attract criticism for being almost completely silent, despite the movie industry having long since embraced the talking picture. Chaplin famously feared that the mystery and romanticism of the Tramp character would be ruined if he spoke, and also that it would alienate his fans in non-English speaking territories. His future films, however, would be fully fledged \"talkies\" – although without the character of the Little Tramp.</p><p>Chaplin biographer Jeffrey Vance has written of the reception and legacy of this classic comedy:</p><blockquote>Modern Times is perhaps more meaningful now than at any time since its first release. The twentieth-century theme of the film, farsighted for its time—the struggle to eschew alienation and preserve humanity in a modern, mechanized world—profoundly reflects issues facing the twenty-first century. The Tramp's travails in Modern Times and the comedic mayhem that ensues should provide strength and comfort to all who feel like helpless cogs in a world beyond control. Through its universal themes and comic inventiveness, Modern Times remains one of Chaplin's greatest and most enduring works. Perhaps more important, it is the Tramp's finale, a tribute to Chaplin's most beloved character and the silent-film era he commanded for a generation.</blockquote><p>The film is recognized by American Film Institute in these lists:</p><ul><li>1998: AFI's 100 Years ... 100 Movies – #81</li><li>2000: AFI's 100 Years ... 100 Laughs – #33</li><li>2007: AFI's 100 Years ... 100 Movies (10th Anniversary Edition) – #78</li></ul><p>The Village Voice ranked Modern Times at No. 62 in its Top 250 \"Best Films of the Century\" list in 1999, based on a poll of critics. In January 2002, the film was voted at No. 58 on the list of the \"Top 100 Essential Films of All Time\" by the National Society of Film Critics. The film was voted at No. 74 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In the 2012 Sight & Sound polls, it was ranked the 63rd-greatest film ever made in the critics' poll and 20th in the directors' poll. In the earlier 2002 version of the list the film ranked 35th among critics. In 2015, Modern Times ranked 67th on BBC's \"100 Greatest American Films\" list, voted on by film critics from around the world. The film was voted at No. 12 on the list of The 100 greatest comedies of all time by a poll of 253 film critics from 52 countries conducted by the BBC in 2017. In 2021 the film ranked 49th on Time Out magazine's list of The 100 best movies of all time.</p><br/><h3>Restoration</h3><p>A digitally restored version of the film was released in 2003. The French company MK2 searched the world for good copies of the original footage, cut them together and processed each of the 126,000 frames, removing scratches and dust, and ensuring optimal image stability and balanced black and white tone levels. The restored version was first shown at the Cannes Film Festival in 2003.</p><br/>"
  },
  "errorMessage": ""
}