{
  "imDbId": "tt0078788",
  "title": "Apocalypse Now",
  "fullTitle": "Apocalypse Now (1979)",
  "type": "Movie",
  "year": "1979",
  "items": [
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "https://www.rogerebert.com/reviews/apocalypse-now-1979",
      "rate": "100",
      "content": "Remember the weird beauty of the massed helicopters lifting over the trees in the long shot, and the insane power of Wagner's music, played loudly during the attack, and you feel what Coppola was getting at: Those moments as common in life as art, when the whole huge grand mystery of the world, so terrible, so beautiful, seems to hang in the balance."
    },
    {
      "publisher": "Seattle Post-Intelligencer",
      "author": "William Arnold",
      "link": "",
      "rate": "100",
      "content": "As powerful as the movie remains and as much as I enjoyed this new cut, I have to say that the additional footage -- material that Coppola felt he had to excise 20 years ago to reach a commercial length -- has turned out to be something of a mixed blessing."
    },
    {
      "publisher": "New Times (L.A.)",
      "author": "Gregory Weinkauf",
      "link": "http://www.newtimesla.com/",
      "rate": "100",
      "content": "Coppola and Murch have balanced their new edit with grace notes of sweetness, elegance and eroticism, and the payoff is grand, providing both a reprieve from the multiple blitzkriegs and a break in the monotony of the cruise up the Nung."
    },
    {
      "publisher": "Mr. Showbiz",
      "author": "Michael Atkinson",
      "link": "",
      "rate": "100",
      "content": "No other movie released this year is as much of a filmgoing necessity as Francis Ford Coppola's Apocalypse Now Redux."
    },
    {
      "publisher": "Time Out London",
      "author": "Tom Huddleston",
      "link": "",
      "rate": "100",
      "content": "As befits both its tortuous hand-to-mouth genesis and the devastating conflict it reflects, this is a film of pure sensation, dazzling audiences with light and noise, laying bare the stark horror – and unimaginable thrill – of combat. And therein lies the true heart of darkness: if war is hell and heaven intertwined, where does morality fit in? And, in the final apocalyptic analysis, will any of it matter?"
    },
    {
      "publisher": "",
      "author": "Total Film",
      "link": "https://www.gamesradar.com/x-men-apocalypses-olivia-munn-wants-to-join-genius-deadpool-for-the-x-force-movie/",
      "rate": "100",
      "content": "Francis Ford Coppola went into the jungle to make his surreal ’Nam epic and almost lost his mind during one of the most protracted and accident-prone shoots in history. Thankfully the hallucinogenic results justified the means."
    },
    {
      "publisher": "The Guardian",
      "author": "Peter Bradshaw",
      "link": "https://www.theguardian.com/film/2011/may/26/apocalypse-now-review",
      "rate": "100",
      "content": "A film that needs to be seen on the big screen."
    },
    {
      "publisher": "Empire",
      "author": "Angie Errigo",
      "link": "https://www.empireonline.com/movies/reviews/apocalypse-now-review/",
      "rate": "100",
      "content": "Flawed but staggering cinema, the unforgettable Apocalypse Now setpieces are extraordinary."
    },
    {
      "publisher": "New York Daily News",
      "author": "Kathleen Carroll",
      "link": "https://www.nydailynews.com/entertainment/movies/apocalypse-brings-vietnam-war-home-1979-review-article-1.2321548",
      "rate": "88",
      "content": "Coppola, with his bravura style of direction, has created a movie of harrowing intensity and staggering power. But if you accept the belief that art should enlighten and illuminate as well as arouse the emotions, I’m afraid that Apocalypse Now does not qualify as great art."
    },
    {
      "publisher": "Washington Post",
      "author": "Gary Arnold",
      "link": "https://www.washingtonpost.com/archive/lifestyle/1979/10/03/mangled-revelations-apocalypse-at-last/92ebb83d-730a-47c5-95e2-0171530f4e4a/?utm_term=.5bf4a5442d8b",
      "rate": "40",
      "content": "The finished film remains a mess of tangled, turgid continuity and florid, mock-operatic style -- at best a collection of production numbers and set pieces waiting in rain for a story capable of accumulating suspense and meaning."
    }
  ],
  "errorMessage": ""
}