{
  "imDbId": "tt0078788",
  "title": "Apocalypse Now",
  "fullTitle": "Apocalypse Now (1979)",
  "type": "Movie",
  "year": "1979",
  "items": [
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0166364",
      "warningSpoilers": false,
      "date": "27 March 2004",
      "rate": "",
      "helpful": "89 out of 104 found this helpful.",
      "title": "Redux: still brilliant - but now with new strengths and weaknesses",
      "content": "In an updating of `Hearts of Darkness' a soldier is given a mission to travel up a river During the Vietnam war in order to terminate the command of Colonel Kurtz. Kurtz is operating without orders and is leading a group of natives in brutal violent strikes against the enemy. Despite his history of brilliance and decoration he has clearly gone mad. Willard joins a military boat and travels up river to his destiny. However the further he travels the more madness appears to have become the norm.That Redux was going to be anything less than brilliant was never in doubt: it was never going to be so different from the original that it would destroy or significantly damage the reputation or impact that the film has. What was in question to my mind was whether or not Coppola should have just left well enough alone. I have seen the documentary about the making of the original film, wherein Coppola derides many of his scenes and decides to cut them out of his movie even as he finishes shooting them - the plantation scene being one of the key ones that he felt just didn't work. It was for this reason that I was interested to see what the additions and rejigging of scenes had done to the film.The strengths of Redux is that Apocalypse Now was never about the straight story, it was more about the journey Willard undertakes rather than a build up to a traditional conclusion - while the ending is big, it is no more or less important that anything that has gone before it. So for that reason it is a good thing that, simply put, there is now more of the journey to be enjoyed! `49 minutes of new material' my dvd cover screams at me; combine this with the movement of scenes and certainly it does have the feel of a different (albeit familiar) film rather than just a bit of spit and polish with some new CGI effects (yes ET, I'm looking at you). However this increased material also brings with it the problems that not all the material compliments the film in terms of total quality.None of the added scenes or sequential movements are bad or even average, they are all interesting, but some just don't seem to really fit. The plantation scene has some great dialogue (that strikes a real chord so recently post-Iraq) and it makes it's points but it just didn't seem to fit. I can see what Coppola was trying to do and, if you watch Hearts Of Darkness, you can see that it frustrates him that it doesn't work, but he got it right first time, it doesn't fit despite it's standalone merits. Likewise the playboy bunny scene intrigued me as I tried to get more from the bunny's semi-speech about being made to do things and the theme of objectification, but again it didn't totally work and seemed out of place.Despite these two major scenes not totally fitting, they are still interesting and, if you came for the journey, then that is what matters and they present themselves as a flawed part of that journey - but a part of that journey nonetheless. Some of the smaller additions actually contribute a lot more to the film. Little moments in the boat show Willard to be more relaxed as a man than the original did - and this greatly benefits my understanding and appreciation of his character. How he interacts with the rest of the crew is also improved. Other minor additions to existing scenes serve to enhance them, but improvement in some areas is difficult when it comes to this film.I won't go into details on cast, performances and the themes of the film as I have already done that in my other review. Suffice to say that, if you loved Apocalypse Now then Redux will likely both enhance your enjoyment and slightly irritate you at the same time. The film easily stands up to the longer running time - as another user said, I could easily give the five hour version a stab (well, maybe once!) as the journey is the all. The additions may not be without flaw, but then that's why they were higher on the editing hierarchy than the rest of the stuff! However they add interest and minutes to the journey - both of which are good things.Overall, it is very difficult to take `one of the best films ever madeT ' and make it better - and Coppola hasn't done that here, but he hasn't damaged it either. It isn't a brand new film and it doesn't mess around with the original so much that it could be called a different film - so I won't compare the two as to which is `better'. Suffice to say that, while I don't totally agree that you `can't have too much of a good thing', certainly an extra 49 minutes is gratefully received where it doesn't damage or cheapen but only seeks to enhance and support."
    },
    {
      "username": "notoriousCASK",
      "userUrl": "https://www.imdb.com/user/ur31221670",
      "reviewLink": "https://www.imdb.com/review/rw4101488",
      "warningSpoilers": true,
      "date": "23 March 2018",
      "rate": "10",
      "helpful": "335 out of 365 found this helpful.",
      "title": "This Is the End...",
      "content": "Apocalypse now is not only the best war film ever made but it's also one of the best films of all time as it won the prestigious Palme d'Or at Cannes and it's constantly recognized as a benchmark in cinematic history. Based on the novel \"Hearts of darkness\" by Joseph Conrad this film is not so much about the Vietnam war, it is about war in general and serves as a deep study into the dark places of the human soul and how war can affect the individual. Apocalypse now depicts a timeless story about a universal human struggle, the duality of man, consisting of morality, the savage primordial instinct and what every person chooses to base his actions upon.The film has a simple premise, US Army Captain Benjamin Willard (Martin Sheen) is ordered on a dangerous mission into Cambodia through a river, to assassinate a renegade, Colonel Kurtz (Marlon Brando), who has gone insane and set himself up as a god among the local native tribe. It's an accessible premise, allowing for the film to be consumed by even the most casual movie watchers, and yet this film is anything but shallow. It's a journey into madness and hysteria, an observation into the darkness of humanity. I could write a book analyzing this film, there's just so much to talk about. My interpretation is that the river is not only the passage to find Kurtz but also the descent into madness and a reflection to the character's inner journey towards evil that is accomplished through the main theme of the movie, dehumanization. The journey through the river is also reminiscent of Dante's perilous journey through unspeakable surroundings and horrors. There are three major stops before Kurtz and each stop on the river furthers the dehumanization that war has brought, as well as implanting a new type of evil to the characters.The first stop is with lieutenant Kilgore. That stop shows that Kilgore and his soldiers have been consumed by the love of war after they dehumanized the enemy. Their love of war has blinded them so much that they see no negative and can't comprehend the consequences the war will bring. In one scene of the movie, the \"heroic\" marching of the helicopters to lay wrath upon their enemies, Captain Kilgore uses Wagner's Ride of the Valkyries to pump his soldiers and scare his enemies and like the mythical creatures Valkyries, he is the decider of who lives and who dies on the battle. At this stage, although everyone has removed any shred of humanity from the enemy, they still understand the innocent.The second stop is the USO show where we see the loss of morality as well as the dehumanization of the innocent. At this stop we see that a soldier dehumanized everyone aside from himself, becoming very selfish and losing any compassion for anyone but themselves. The soldiers that have passed through this stop would be willing to put anyone at risk for their instant gratification. Now as the characters go deeper into the river metaphorically they go deeper into themselves to explore their own evils which are becoming more apparent. The last stop before Kurtz is the Do-long Bridge and it's at this point that a soldier has gone too far, he's experienced so much trauma and so much evil that he lost grip with his own sanity and thus he dehumanized himself and can't return to a normal state of mind.The final stop on the journey is Kurtz, at this point only Willard and Kurtz have passed the madness stage and they are competing for the heart of darkness, the ultimate evil that we all have the capacity to have. Kurtz is in possession of the heart of darkness as he associates evil with strength. Bypassing the madness stage he's able to see the world for what it truly is, filled with hypocrites and he decides to bury his hatred and simply act on instinct. Willard at the end of the film rises from the river reborn as a new man ready to obtain the heart himself. He kills Kurtz and leaves the compound with his heart corrupted. In the end Willard has a choice, succumb to evil and stay in the compound having taken Kurtz's place as the leader of the savages or abandoning them into their fates...throwing his weapon, he emerges from the bottomless pit he had fallen through the heart of darkness and by saving Lance and choosing not to exterminate the tribe, he has completed his personal journey and tested his soul to the very limit. Both of them at any point could have just stopped but they didn't, they wanted to explore the depths of their souls and just how much further they could go.The film presents this study of the human psyche through Carmine Coppola's eerie score, hypnotic images, and some haunting scenes, essentially taking the viewer into the depths of hell. It's here where Coppola succeeds the most. His ability to create a living \"hell\" is so amazing, and it perfectly captures the mindset of the soldiers. It provides a commentary on war and religion, making the subtext even vaster. The film is weirdly beautiful and a true picture of the evil and hell from within ourselves.The cinematography by Vittorio Storaro is phenomenal and it provides a hallucinatory feeling throughout the film's runtime - from the faces of the losing minds covered in endless sweat, and the sight of figures within the shadows to a dark trenched riverbank - everything is captured in a stunning manner, conveying the hellish imagery and still taking the viewer's breath away. Coppola's direction transcends itself, the camerawork is at its absolute best when it comes to the use of lighting and shadows, most notable during Col. Kurtz's first appearance. The troubled production obviously didn't hurt the film at all, and most likely increased the dark quality it portrays. Apocalypse Now is beautifully haunting, utterly hellish, terrifyingly intelligent, and magnificently wrought, it slowly pushes you into the horror and absurdity of war, but also its meaningfulness and beauty. Not only is this one of the best films ever made, it's a psychoanalytical journey into places none of us would dare to venture to on our own. It is Francis Ford Coppola's magnum opus as he sacrificed everything to make it work. Rightfully deserving its place as one of the greatest on the cinematic pantheon, immortal for its contribution to cinema, and a truly unforgettable experience, Apocalypse Now is cinema at its most complete, crystalline and pure."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw0166378",
      "warningSpoilers": false,
      "date": "23 June 2004",
      "rate": "10",
      "helpful": "505 out of 694 found this helpful.",
      "title": "My All Time Favourite Movie",
      "content": "I first saw APOCALYPSE NOW in 1985 when it was broadcast on British television for the first time . I was shell shocked after seeing this masterpiece and despite some close competition from the likes of FELLOWSHIP OF THE RING this movie still remains my all time favourite nearly 20 years after I first saw it This leads to the problem of how I can even begin to comment on the movie . I could praise the technical aspects especially the sound , editing and cinematography but everyone else seems to have praised ( Rightly too ) these achievements to high heaven while the performances in general and Robert Duvall in particular have also been noted , and everyone else has mentioned the stark imagery of the Dou Long bridge and the montage of the boat traveling upriver after passing through the border How about the script ? Francis Ford Coppola is best known as a director but he's everyway a genius as a screenwriter as he was as a director , I said \" was \" in the past tense because making this movie seems to have burned out every creative brain cell in his head , but his sacrifice was worth it . In John Milius original solo draft we have a script that's just as insane and disturbing as the one on screen , but Coppola's involvement in the screenplay has injected a narrative that exactly mirrors that of war . Check how the screenplay starts off all jingoistic and macho with a star turn by Bill Kilgore who wouldn't have looked out of place in THE GREEN BERETS but the more the story progresses the more shocking and insane everything becomes , so much so that by the time reaches Kurtz outpost the audience are watching another film in much the same way as the characters have sailed into another dimension . When Coppola states \" This movie isn't about Vietnam - It is Vietnam \" he's right . What started off as a patriotic war to defeat communist aggression in the mid 1960s had by the film's setting ( The Manson trial suggests it's 1970 ) had changed America's view of both the world and itself and of the world's view of America It's the insane beauty of APOCALYPSE NOW that makes it a masterwork of cinema and says more in its running time about the brutality of conflict and the hypocrisy of politicians ( What did you do in the Vietnam War Mr President ? ) than Michael Moore could hope to say in a lifetime . I've not seen the REDUX version but watching the original print I didn't feel there was anything missing from the story which like all truly great films is very basic . In fact the premise can lend itself to many other genres like a western where an army officer has to track down and kill a renegade colonel who's leading an injun war party , or a sci-fi movie where a UN assassin is to eliminate a fellow UN soldier who's leading a resistance movement on Mars , though this is probably down to Joseph Conrad's original source novelMy all time favourite movie and it's very fitting that I chose this movie to be my one thousandth review at the IMDb"
    },
    {
      "username": "mark.waltz",
      "userUrl": "https://www.imdb.com/user/ur0968789",
      "reviewLink": "https://www.imdb.com/review/rw6515042",
      "warningSpoilers": true,
      "date": "22 January 2021",
      "rate": "10",
      "helpful": "24 out of 30 found this helpful.",
      "title": "The most anti-war pro-war film ever made.",
      "content": "Coming out on the cusp of several other big award winning Vietnam war films (\"Coming Home\" and \"The Deer Hunter\" which could not have been any more different), this is the most avant garde of them all. While another stack of Vietnam war films came out nearly a decade later, this is perhaps the most controversial. Unlike his son Charlie Sheen's character in \"Platoon\" Martin Sheen's captain here isn't just a recruit facing his own apocalypse from going into combat for the first time. He's experienced, trusted and smart, and that's just one of the reasons he's chosen for the special mission of going deep into the Vietnam jungle to take out one of his own, an American officer who seems to have defected, declared himself to be lord of that jungle and most likely incurably insane.Director Francis Ford Coppola has declared this to not be anti-war even though he doesn't indicate his own feelings. He claims that this shows why the human psyche constantly gets into wars and uses the Joseph Conrad novel \"Hearts of Darkness\" as his source, changing it to the Vietnam war and exploiting the cruelty and violence, some of it obviously necessary as the attacks on the Viet Cong camps at the start of a day indicate. It's easy to hate those in charge of this action for killing children, and when a young Vietnamese girl tosses something into the helicopter and runs off before it bursts into an inferno can temporarily change how you see this mission before realizing why it had to be done.In all truth, seeing the nearly 40 year old Martin Sheen here, I did confuse him at first with son Charlie, then 22, in \"Platoon\". Martin looks way younger than his years so it's frightening to see him foisted into this mission to which there's no easy way to accomplish it. The look of disgust on his face while looking on at the impish antics of those on the river boat escorting him downstream is unforgettable. He's obviously already seen horrors that explain the opening scene where he's on a drug trip as the Doors song \"The End\" plays over it.The subject of the assassination plot is the Colonel played by Marlon Brando in what is basically the highest paid cameo in film history, equivalent to what he had done right before this for \"Superman\". Brando's the one weak element of this film, photographed strangely and often difficult to understand. Perhaps he thought that would add to his character's insanity. Sheen spends time looking at pictures of the younger Brando, altered in photos to appear to be in a military setting.Since the top billed Brando doesn't appear until later in the film, it's the supporting cast surrounding Sheen that you will remember which includes Robert Duvall, Dennis Hopper, Laurence Fishburne, Frederic Forrest and a young Harrison Ford, basically a cameo but an important scene along G.D. Spradlin. There are a few women in the cast outside the extras playing members of the Viet Cong, and one disturbing scene has a young prostitute at work asking a soldier looking on why he's there, only to heat, \"I'm next.\"So this glorifies war while also giving an indication of how evil it is and how soul crushing it can be. Sheen's quiet performance seems to emote this, and that gives his performance real power. Many of the battle scenes are at night with screaming voices sounding like ghosts crying out for mercy. This is the type of film that will make you feel guilty when you either cheer or laugh, but that's a part of what makes this film stand the test of time. As a 16 year old watching this in the theater, I felt different emotions than I do 41 years later, not the fear of that sheltered existence of a teenager, but the anger of a mature man still debating why we need to feel the urge to kill. That's the power of cinema when it's done right and why this film is important on so many levels."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1988547",
      "warningSpoilers": false,
      "date": "11 December 2008",
      "rate": "9",
      "helpful": "99 out of 135 found this helpful.",
      "title": "Coppola conveyed the drama and spectacle of this truly outstanding film",
      "content": "After the success of the first two 'Godfather' films in 1972 and 1974 respectively, Francis Ford Coppola embarked on an ambitious attempt to bring home the reality of the war in Vietnam, which had concluded with the fall of Saigon to the Vietcong in 1975 The plot was loosely based on the book 'Heart of Darkness,' a story by Joseph Conrad about Kurtz, a trading company agent in the African jungle who has acquired mysterious powers over the natives Coppola retains much of this, including such details as the severed heads outside Kurtz's headquarters and his final words, \"The horror the horror \" In the film, Sheen plays an army captain given the mission to penetrate into Cambodia, and eliminate, with \"extreme prejudice,\" a decorated officer who has become an embarrassment to the authorities On his journey up the river to the renegade's camp he experiences the demoralization of the US forces, high on dope or drunk with power Although, as a result of cuts forced on Coppola, the film was accused of incoherence when first released, it was by the most serious attempt to get to grips with the experience of Vietnam and a victorious reinvention of the war film genre In 1980 the film won an Oscar for Best Cinematography and Best Sound \"Apocalypse Now\" was re-released in 2001 with fifty minutes restored As a result, the motion picture can now be seen as the epic masterpiece it is"
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw1597434",
      "warningSpoilers": false,
      "date": "12 February 2007",
      "rate": "9",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Take the long ride to perdition.",
      "content": "There are films we watch because they are good, even though they are painful for us. This is a film I saw one time. At that time I thought to myself, this is enough. It was painful to make that journey down the river, wondering what was around every corner. Then we meet the products of our own id impulses, as we are the enemy, our souls have been brought down to this. At the end of the river is the man who came before us, and we see the uselessness of the journey. It is the Heart of Darkness. There are death masters like Robert Duvall. There are those who can only hope to survive, but the war is the master. The Doors music as the napalm settles gently on the treetops and across the ground, sweeps us up gently. Meanwhile it is consuming the flesh of the Vietnamese people, as well as an occasional American soldier. The ancient Romans could not envision peace without war. We and much of the world seem to have embraced those tenets put forth some two thousand years ago. This film gets into the marrow."
    },
    {
      "username": "surfisfun",
      "userUrl": "https://www.imdb.com/user/ur71501643",
      "reviewLink": "https://www.imdb.com/review/rw4022498",
      "warningSpoilers": false,
      "date": "3 January 2018",
      "rate": "10",
      "helpful": "97 out of 133 found this helpful.",
      "title": "skip Redux version, watch original first",
      "content": "Top 20 war moviein Redux they added long scenes that changed tempo of movie. The one at the plantation didn't work well in context. What a great film!"
    },
    {
      "username": "jokeco68",
      "userUrl": "https://www.imdb.com/user/ur4431399",
      "reviewLink": "https://www.imdb.com/review/rw0982725",
      "warningSpoilers": false,
      "date": "21 December 2004",
      "rate": "10",
      "helpful": "695 out of 837 found this helpful.",
      "title": "In my opinion, Coppola's best work",
      "content": "My favourite movie of all time. This was a flawed piece of work by Coppola and seeing the documentary 'Heart of Darkness' made it even more compelling. Coppola at this point was king of Hollywood after making 'the Godfather' and 'GodfatherII' and had developed the ego necessary to even dare try to make a movie like 'Apocalypse Now'. Through sheer arrogance he went to the Phillipines with a partial script and thought he would know what he would do when he got there. Just as Captain Willard thought he would know what to do once he got to Col. Kurtz's compound. And just like Willard, he DIDN'T know what he was going to do once he got there. This is such a masterpiece of American cinema, beautifully photographed and the river is such a perfect metaphor and backdrop for the story. What I like most about 'Apocalypse Now' is that it offers no answers or conclusions. Consequently, because of this open-endedness, it infuriates some viewers who like their movies to be much more obvious. This movie defies categorization. Some call it a war movie which it isn't at all, really it is more of a personal study of man. The best pic about Vietnam is 'Platoon' in my opinion and if a viewer is seeking a retelling of the Vietnam War go there first for answers. Coppola should be commended for his take on the bureaucracy of war which he conveys quite effectively with the meeting with Gen.Corman and Lucas (Harrison Ford) and the Playmate review. The sheer audacity of Kilgore makes him an unforgettable character and the dawn attack will always be a Hollywood classic.It is an almost psychedelic cruise to a very surreal ending which makes it a movie not accessible to everyone. Very challenging to watch but rewarding as well. I could offer my explanations on each scene but that would be totally pointless. This movie is intended for interpretation and contemplation as opposed to immediate gratification.A little footnote, definitely if your a first-time viewer of Apocalypse Now, watch the original version first, the 'Redux' version is, I think, more intended for the hardcore fan and is more of a curiosity than a 'new and improved' version of the movie"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0166197",
      "warningSpoilers": false,
      "date": "6 January 2000",
      "rate": "10",
      "helpful": "38 out of 53 found this helpful.",
      "title": "In my top five favorite films ever made",
      "content": "Apocalypse Now is not only my personal favorite work by Francis Ford Coppolla, it's also one of the great visions ever put onto cinema. It makes what was horrific, strange, and ironically exciting and mysterious about the Vietnam War into this mad tale of obsession, death, loss, and the dark side of humanity. While the stories behind the production of the film made it notorious and rather risky back in 1979, it works on its own terms and represents not just Coppola's genius but others in the Zoetrope team as well. It also paints a sometimes lurid, ultra-violent, bleak and curious view of what war does to people, both in the lower ranks, the big-guns, and those who go too far \"up the river\".Many have also been perplexed by Marlon Brando's performance in the film, but it's actually one of his very best turns on screen, albeit improvised and close to running off the rails. His few moments on screen (even in the somewhat unnecessary scene plopped into the Redux version) there's enough conviction in what he's saying- and what perhaps isn't said- that makes the trip down the river worthwhile on an intellectual and poetic level. And making up the bulk of the film are delirious turns by Robert Duvall (a Oscar nominated turn he should've won), Martin Sheen as the Captain with almost too much to ponder in an ever increasing state of everything but him being insane; character actors like Sam Bottoms, Frederic Forrest and 14 year-old Laurence Fishburne have some of the best work they've ever done. And it goes without saying that Dennis Hopper comes close to stealing any scene he's in, for better or worse, with the most to say in rambling, yet coherent words.Every time I watch this film (and mostly the original version which is what first drew me in completely as opposed to the very good if muddled Redux version) I am astounded with how operatic everything is, and how the variations on the madness and chaos of Vietnam is put together. Of course one can give adulation to Coppola for this as he completed it without totally going off the deep end or possibly dying, and his talents are pulled to their richest peaks here as a storyteller and director of actors. But it can't be said enough how much I can't get enough of Vittorio Storaro's cinematography, which has in part come close to perfect for this kind of epic film. The music is perfectly eerie and insidious, with the Doors song used for one of my favorite iconic scenes in the movies (both of them). Walter Murch's editing- which apparently was what saved the film from being a four-hour disaster- makes the action move when it needs to and for individual shots to get their due. And even the production design is remarkable and, to the extent it goes to, original in its partial translation of both Conrad's fiction and the unfortunate realities of life on the river.If you haven't seen it yet, in short, get off your ass and get a copy; it might cause a kind of shell-shock for a viewer after first taking it all in, but it has some of the purest, most rewarding bits of cinema ever to come out of that all-too-brief American new-wave of the 1970's."
    },
    {
      "username": "Vartiainen",
      "userUrl": "https://www.imdb.com/user/ur30163554",
      "reviewLink": "https://www.imdb.com/review/rw3232591",
      "warningSpoilers": false,
      "date": "5 May 2015",
      "rate": "7",
      "helpful": "43 out of 60 found this helpful.",
      "title": "Crumbles under its own weight",
      "content": "I have nothing but respect for Francis Ford Coppola. He is deservedly one of the greatest directors of all time and his style of film-making is pretty much inimitable. Yet I can't really say I enjoyed this movie. At least not the Redux version I saw.First the good parts. It's a damn beautiful film. The mood, as they slowly drift up the Vietnamese river, keeps building and building and you can smell the heat and wetness in the air, feel the sweat dripping down your back, hear the hollow echoing screaming around you. The script was heavily inspired by the classic novella Heart of Darkness and that's exactly the mood and atmosphere they achieved.The acting is also topnotch, with one glaring exception, and I've never seen Charlie Sheen do a more convincing role than here. You can almost see the cracks in their souls as the heaviness of the war settles around them as they are pulled from combat and send to face almost certain deaths as they hunt their elusive quarry.It's a well-made film. Everything from camera-work to sets to directing works, and works so well, but the fact remains that's it's just too long. At least the Redux version. You can only stretch the atmosphere and suspense for so long until you start to look at the clock. That's partly the purpose and to this film's credit, any other film would have crumbled way sooner, but crumble it does, eventually.I also have problems with Marlon Brando's performance. Apparently the man showed up hugely overweight, completely unprepared and pretty much being as unprofessional as you can be. And it shows. The final third of the film throws the suspense straight out of the window and pretty much the only question left is \"Brando, what happened, man?\" I can see why people love this film. It's a haunting take on war, has amazing atmosphere, vivid imagery, memorable characters and as a whole there are very few movies like it. Personally I lost interest after the halfway point, but that's just me."
    },
    {
      "username": "FilmOtaku",
      "userUrl": "https://www.imdb.com/user/ur2339662",
      "reviewLink": "https://www.imdb.com/review/rw0941343",
      "warningSpoilers": true,
      "date": "4 October 2004",
      "rate": "8",
      "helpful": "131 out of 192 found this helpful.",
      "title": "The horror . The horror",
      "content": "'Apocalypse Now Redux', Francis Ford Coppola's war opus is probably the most beautiful war film I have ever seen. Capt. Benjamin Willard (Martin Sheen) is a Vietnam soldier who is tapped to head a very dangerous and highly classified mission into Cambodia to 'terminate the position' of Col. Kurtz (Marlon Brando), a highly ranked and highly regarded army man who seemingly has gone completely insane and defected from the army, setting up his own little society and helped by a cultish following of soldiers. Escorting him up the river to Cambodia is a handful of navy men, and along the way, they encounter several interesting people (most notably is Robert Duvall's Kilgore, a badass lieutenant colonel with a few screws loose) and some horrifying situations. 'Apocalypse' is less historical war film than a philosophical and psychological study. It is more 'Full Metal Jacket' than 'Platoon'. The running time of 'Apocalypse' is over three hours, but the film is so wonderfully paced and compelling that when the end of the film arrived, I was actually surprised at the amount of time that had passed. The beautiful cinematography is surely what stood out the most for me, however. After seeing this film, I am convinced that Coppola is one of the masters of light and photography in film history. The 'Godfather' films were all tinged with an almost sepia tone, and shadows created the feeling of a Baroque composition. With 'Apocalypse', there is an incredible usage of natural light, and the shadows, particularly in the scenes involving Brando and Sheen, almost become a living character, they are so pervasive and effective. Another gorgeous scene was when Cpt. Willard and Jay Hicks (Frederic Forrest) were in the jungle looking for mangoes, and come across a tiger. The sheer enormity of the surrounding foliage (leaves as big as a house) made the characters almost Lilliputian, but the colorization of the scene was incredible. While everything else was almost a muted grey, the leaves were an incredibly vibrant green, an effect that was particularly striking. Another really minor positive moment in the film was the great scene when the helicopters carrying Duvall and company attack the small village while playing Wagner. This could have just been an ultra-dramatic underlying soundtrack to the scene, but instead Coppola turns the song into an actual part of the scene, with Duvall mentioning that he likes to play it while they are approaching to 'scare the hell out of them'. The performances in 'Apocalypse' are first class. Much has been made of the amount of money Brando earned for the film, and the amount of trouble he caused. Regardless of this, he turned out a powerful performance for a relatively short amount of screen time. Sheen is completely outstanding - this is the first time I have seen him really unleash in a film  and Duvall is a lot of fun to watch as the loony Kilgore. 'Apocalypse Now' is a film that is so pervasive in pop culture by now (most know several choice lines from the film, 'I love the smell of napalm in the morning' et al) but I knew little enough about it that there were plenty of surprises left to experience. I have not seen the original cut of 'Apocalypse Now' so I cannot compare it to this newer cut, but this is a film that should most certainly be experienced. 8/10--Shelly"
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw8738709",
      "warningSpoilers": false,
      "date": "16 December 2022",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "War, What is it Good For...",
      "content": "Colonel Kurtz has disappeared within the jungle, with his troupe of fighting fiends ready to rumble, you've been tasked to take him out, but first you have to search and scout, along a river where the residents are disgruntled (to put it mildly). Lots of bloodshed, bullets, ballistics, then flow, there's napalm too that conjures up impressive glow, many lives are lost and taken, in this hell where you're forsaken, but don't ask why, because nobody really knows.Still a spectacular piece of filmmaking that demonstrates on many levels the destruction, physical and mental that armed conflict causes, and yet we perpetually fail to learn from past events."
    },
    {
      "username": "dk777",
      "userUrl": "https://www.imdb.com/user/ur80922659",
      "reviewLink": "https://www.imdb.com/review/rw8602744",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A Surreal Journey Into Darkness",
      "content": "Apocalypse Now is an interesting film, not because it is supposedly an anti-war film, but because it is surreal and shows an interesting journey into madness.Martin Sheen gives us an insight into his character here and we see the senselessness of the whole situation and how easy it is to lose yourself in certain situations.We follow his journey and the various events that befall him and a small group of soldiers in a patrol boat traveling deep into the jungle. On their way, really bizarre things happen.Along the way, we also see Robert Duvall in the role of a completely insane officer, whose episodic role has a profound impact on the film.The film should essentially be anti-war, but it didn't strike me as such, but simply as a film about the fate of various people who found themselves in unusual situations.Their whole mission doesn't really make sense, and in the end they accomplished nothing, but that's the point. Everything was really in vain.The direction is excellent, the music is perfectly integrated into the film and matches the tone of the film.For me, this is a film about the loss of reason and the journey to madness. If civilization completely collapses, and somewhere it has already collapsed a long time ago, this is roughly what we can expect, madness and insanity.I watched three versions of the film and I liked the Redux version the best.An interesting and brutal journey into madness and darkness."
    },
    {
      "username": "ramstar22",
      "userUrl": "https://www.imdb.com/user/ur1519707",
      "reviewLink": "https://www.imdb.com/review/rw1150058",
      "warningSpoilers": true,
      "date": "14 August 2005",
      "rate": "10",
      "helpful": "265 out of 333 found this helpful.",
      "title": "The Dark Side of Man",
      "content": "Francis Ford Coppola's \"Apocalypse Now\" is not a Vietnam War film. Do not confuse it with one. It is set to the back drop of the war, but it is a metaphorical exposition on the deteriorating effects that war has on the human psyche. It is also one of the most audacious films ever made, produced, or even conceived (second to the Lord of the Rings trilogy. To call it a masterpiece would be an understatement of proportions as ambitious as the film's production levels.Opening with no credits and following a memorable first scene playing to the tune of the Doors \"The End\" as Martin Sheen's Captain Benjamin L. Willard hallucinates to images of helicopters and napalm, the plot is essentially laid out in the first 15 minutes. Willard's mission is to \"terminate... with extreme prejudice\" Colonel Kurtz (Marlon Brando) who has invariably gone AWOL in the far reaches of the Cambodian jungle and, as told by his general, is \"out there operating without any decent restraint, totally beyond the pale of any acceptable human conduct. And he is still in the field commanding troops.\" Kurtz is a delusional Colonel now being worshipped by a large group of followers who have dubbed him a god. For Willard, this covert operation seems somewhat more manageable than actual combat, yet, the journey he is about to take will be a personal quest that will challenge the limits of his human behavior.Teaming up with a small crew, they embark down the vast reaches of the river in a rickety boat. Along the way, Willard educates himself on all things Kurtz. During Sheen's raspy voice over, he details his thoughts on the abundance of material he reads. Kurtz was a highly decorated and respected Green Beret. He was a normal man with a family, until a part of him succumbed to the horrors of human brutality and he led himself down the path that Willard is being led. The descent into the jungle is marked by a mesmerizing aura that echoes the battles being fought not to far away. Eventually the power of the experience weights on the group as drugs and a sort of solitary confinement attacks their senses. But Willard seems unfazed and desensitized in his quest to find Kurtz. As he reads about this mythic figure, he is drawn to the man's power and why he has become what he has become. We know that Willard's slow decay will parallel that of Kurtz's.Marlon Brando has been revered for decades. His presence: unmatchable. His genius: undeniable. But for those unacquainted with his acting prowess and unaccustomed to his physical nuance, Brando can be perceived, in the eyes of an uncompromising film-goer, as a hack. He is most certainly not. Brando was difficult to work with, hard to interpret and impossible to understand, but his talent for unintelligible rants and unparalleled monologues is irrefutable. The man obviously knew what he was doing even if we didn't. His Colonel Kurtz is a being of limitless delusions and continual profundity.If the film is any indication of the journeys into hell than Francis Ford Coppola's actual experience with making this masterpiece is a true life account of one man's fanatical struggle to produce a movie. It is reported that during the film's 200 plus day principle photography schedule, Coppola contemplated suicide. The film was not only an undeniable struggle to make; it is a grueling film to watch. Coppola's sweat and blood seep through the pores of the steamy locals and his dedication filters through the orifices of Martin Sheen's haunted soldier Willard.I can not help but feel a warm sense of nostalgia for this type of film. At the dawn of all that was original and unprecedented, films that challenged as well as stimulated were commonplace. Audacity aside, Apocalypse Now is pure film-making. My respect and admiration for Mr. Coppola is of the highest order. But I shudder at the return to what has become the norm for today's standards for film: a lack of innovation. It is not simply the unoriginality of the world of cinema today; it is the fact that nobody seems to care to tell a story anymore or to tell one with heart. But we still have the great ones like Coppola's masterpiece, a film which bathed in its ability to give us something deeper than that which we could comprehend.That depth in Apocalypse Now is the step into madness. The killing can disturb. The loss of innocence can unhinge. But it is the damage from within; the countless barrages of images that distress, unnerve and detach us from our everyday world and the memories that plague our deepest thoughts that eventually segregates us from humanity and propels us into the realm of the instinctual, the savage and the animalistic. If the thought of killing does not provide sustenance, the act of killing provides man with its fundamental catharsis."
    },
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw0166320",
      "warningSpoilers": true,
      "date": "27 August 2003",
      "rate": "10",
      "helpful": "31 out of 47 found this helpful.",
      "title": "\"The horror...the horror\" is the reality of war and its effects...",
      "content": "Spoilers. This review has been edited due to word limit.`The horror. The horror.' Marlon Brando, Apocalypse Now (1979) and Apocalypse Now Redux (2001)The sentence which is as famous as `Here's looking at you, kid,' or `Are you talkin' to me?' or `May the Force be with you,' or `I'll be back,' means a little more than some one-liners. When it is spoken it lingers in the air with an importance and meaning that does not go unnoticed. What might drive some viewers nuts is that they may never find an answer to the horror unless they re-watch the film and try to pay close observation to every single frame.What, exactly, does this line of dialogue mean? The horror spoken of is the reality of war. The reality of moral men being so easily corrupted that they turn on their inborn instincts and kill fellow beings without any sign of guilt. When Capt. Willard (Martin Sheen) stands before the dying Col. Kurtz (Marlon Brando) at the end of the film, `The horror.the horror.' is the realization of Willard's corruptness. He has mercilessly killed a man in cold blood as part of his assignment. This isn't a typical Hollywood ending. In most cases a character gains something, whether it be emotionally, physically, mentally or all three. But Willard both gains and loses. He gains the knowledge that he has lost his morals. And that is a shocking ending.`Apocalypse Now' is Francis Ford Coppola's tribute to the artistic side of filmmaking. This film is wholly different from `The Godfather.' It is hallucinogenic, visually dazzling, and an ode to the guilty side of human nature. At first it seems realistic, and then it becomes strange, and then symbolic, and, by the end, original in its own unique perspective of the spiritual side of warfare. This is not as much a film about the Vietnam War as it is a film about the war within us.At first it does appear to be another war film. Captain Willard (Sheen) is assigned by an Army Lieutenant (a young Harrison Ford) to assassinate a renegade American Colonel named Kurtz (Brando), who is hiding out somewhere in Vietnam with a hoard of troops who more or less act as his slaves.Willard carries out his mission `with extreme prejudice,' heading out on a boat along with four soldiers, including the boat captain, Chief (Albert Hall), Chef (Frederic Forest), and a very young `Larry' Fishburne (who later went on to appear as Morpheus in `The Matrix').\"Apocalypse Now\" is in a many ways a modern update of Homer's Odyssey. As our main character, Willard, carries on his journey, he meets an array of original and strange characters, including Lt. Col. Kilgore (Robert Duvall), who has a strange fetish for surfing, and a stoned photographer (Dennis Hopper), whose lively gestures and mannerisms can be compared to those of the very much lesser Jeremy Davies in \"The Million Dollar Hotel,\" one of the worst films I have ever seen. Davies failed to make any connection with an audience; Hopper does. He is like the poetic vibe between Willard and Kurtz; he is like an interpreter going back and forth and speaking in foreign languages. In this case, he is translating Kurtz to Willard, although I'm not so sure Kurtz needs a translation of Willard.Many films are lucky enough to have one or two memorable scenes or lines. \"Apocalypse Now\" has many. Kilgore descending upon a Vietnam village playing Wagner's \"Ride of the Valkyries\" remains one of the most remembered scenes in all of film history. There is sharpness to it, a brutality to it, an ironic tone to it, and also a sense of playfulness. When Kilgore kneels down on that beach and says, `I love the smell of napalm in the morning.it smells like victory,' we all crack a smile.I won't lie to you: `Apocalypse Now' is a strange film. It isn't exactly the easiest thing to analyze. The end may frustrate some viewers if they don't understand Marlon Brando's significant speeches. But what it all comes down to, what really matters, is that this film is about the dark nature of the human psyche. The horror is the realization of war and its effects, not the war itself. Kurtz says, `You have a right to kill me. But you have no right to judge me.' Brando's character, Kurtz, is left to the audience to judge. To many naïve viewers he may appear as a crazy loon whose power got to his head. But that isn't what Francis Ford Coppola is trying to get across. By fighting in Vietnam, Kurtz has realized just how great he had it, and how bad some others had it. By walking through devastated villages he eventually comes to realize that we are the naïve ones, living our lives in a fool's paradise. We are totally naïve to our surroundings and possible misfortunes until they hit. By seeing how unlucky some Vietnamese are, Kurtz realizes just how easily he could be struck by something. Just how easily he could end up like the people around him. And he also realizes that the people who did this are people who have abandoned their morals and left them at the door. Many people think the horror is one thing. It is two. For Kurtz, the horror is the reality of how naïve he was and the reality of the war's impact upon men. And after Willard murders Kurtz, and hears Kurtz's dying words, he realizes it too. He realizes the effects of war. To see so many soldiers with no sense of right or wrong makes him realize the horror of what war can do to a man. And what it has done to him. The horror.5/5 stars -"
    },
    {
      "username": "Wuchakk",
      "userUrl": "https://www.imdb.com/user/ur4409266",
      "reviewLink": "https://www.imdb.com/review/rw2979374",
      "warningSpoilers": false,
      "date": "14 March 2014",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "One of the greatest films ever made",
      "content": "The original \"Apocalypse Now\" is an awe-inspiring masterpiece and is my all-time favorite film. Memorable scenes abound, starting with the mind-blowing opening with Willard (Martin Sheen) having a mental breakdown in his sweltering Saigon hotel room to the tune of The Doors' \"The End.\"Speaking of Sheen, people overlook the fact that he expertly carries the film. His haunting commentary is one of the most effective narrations in cinematic history and hooks the viewer into the nightmare-adventure.I could go on and on about the noteworthy scenes, but I'll resist, except to comment on Col. Kurtz: Was he really insane or actually a bold genius? General Corman informs Willard: \"He's out there operating without any decent restraint, totally beyond the pale of any acceptable human conduct. And he is still in the field commanding troops.\" And, yet, Kurtz was accomplishing what the US military couldn't or wouldn't do because of political complications and niceties. I bring this up because, as I've aged, I've come to see that I'M Kurtz in some ways -- operating \"out there\" beyond the parameters and restrictions typically linked to my work.The script was written by John Milius with alterations by Coppola as he shot the film whilst the narration was written by Michael Herr. The meaning of the story is obvious: The trip up the river led by Capt. Willard exposes him to two extreme viewpoints of war represented by the two colonels he encounters on his long journey, both of whose names start with 'K,' which is no accident:Lt. COL. KILGORE (Duvall) is a romantic who embraces war as a lifestyle and even feeds off it, i.e. Glorifies it. The fact that he's a romantic can be observed in the air-raid on the village where he literally plays Wagner as a prologue. He feeds off the war to the extent that he \"loves the smell of napalm in the morning.\" War is just another day to him so why not go surfing? Since he lives off of the war there's no way it can kill him or even give him a scratch. Kilgore naturally has the support of the top brass because he's part of the system and plays the game of war.COL. KURTZ (Brando), by contrast, sees through this hypocrisy. He realizes that being in a state of war is humanity gone mad. It's living horror and therefore must be ended through the quickest means possible at whatever cost. He refuses to play the game of war as he expertly takes out double agents, etc. Of course the brass can't have this so they put out a hit on Kurtz via Willard. The existential Kurtz becomes increasingly disillusioned -- even crazy -- after jumping ship from the system and now has no sanctuary. Death is the only way out. His consolation is that Willard will tell his son the truth.The \"Redux\" version was put together by Coppola and released in 2001 with the addition of 49 minutes of material that he originally cut, not to mention placing Clean's surfing scene later in the story.Coppola made the right decisions with his original 1979 edit of the film (2 hours, 33 minutes) since the extra footage of \"Redux\" tends to drag the film down with 1 or 2 scenes being dubiously scripted, e.g. The theft of Kilgore's surf board. Not every idea that is birthed during the creative process is worthy of the final product and \"Redux\" illustrates this. Thus the new footage of \"Redux\" should've arguably been relegated to the \"deleted scenes\" section.That said, I've warmed up to \"Redux\" and feel it's a worthy version of the film, but only if you've watched the Theatrical Cut and want more. \"Redux\" successfully fleshes out the characters and gives them more dimension, especially Willard and Kurtz. Plus the sequence involving Kurtz reading a couple of TIME magazine articles illustrates beyond any shadow of doubt that he wasn't insane and that the brass simply slandered him as crazy in order to justify the assassination of a decorated American officer.Coppola's preferred cut of the film is the \"Final Cut,\" released in 2019, which runs a half hour longer than the Theatrical Cut. In other words, it trims the fat off of \"Redux.\" There's also a \"First Assembly\" version, a bootleg, that runs 4 hours, 49 minutes.The film was shot in the Philippines.GRADE: A+"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2504818",
      "warningSpoilers": true,
      "date": "18 October 2011",
      "rate": "9",
      "helpful": "34 out of 54 found this helpful.",
      "title": "As long as you realize it's FICTION, you're okay...",
      "content": "My biggest complaint about \"Apocalypse Now\" is that many who view it might think this is exactly like the Vietnam War. Instead, it's almost like a non-funny spoof--satirizing it instead of showing an actual view of the war. The film shoves a decade of surreal incidents and some completely fictional ones along with incorporating Joseph Conrad's book \"Heat of Darkness\" and the Herzog film \"Aguirre: The Wrath of God\" into this vision. The results are pretty amazing...just NOT the actual Vietnam War. In other words, there was too much craziness for one movie--but it did make for exciting and compelling viewing nevertheless.The first 2/3 of the film is very much like \"Aguirre\", as it shows a group of misfits taking a CIA operative (Martin Sheen) upriver into Cambodia on a secret assassination mission. Along the way, TONS of insane little vignettes are shoved into the movie--some of which are patently ridiculous. Now I must say that when the film was released, some of the more surreal and ridiculous scenes were removed--such as the Playboy bunny scenes which simply make no logical sense. But the reason so much illogic is shoved into the film is that the filmmaker, Francis Ford Coppola, was NOT trying to make a true depiction of the war. I wish some of this craziness had been toned down a bit--after all, I am a retired history teacher and love truly accurate depictions. But this film is highly fictionalized and Coppola surely wasn't trying to make a documentary.The final portion is basically right out of \"Heart of Darkness\"--with massive changes here and there (such as the purpose of the visit to Kurtz). Now if you haven't read this book, I do NOT recommend you do so. Believe me, it is one of the more difficult and tedious books I've ever read (yes, English professors, I know you will hit me with lots of 'not helpfuls' because I said this). And, while over the top in many ways, at least it was entertaining--something that could never be said about the book (which, by the way, was not a war story and was set in the Belgian Congo). In fact, an English teacher friend of mine admitted, after I pressured him, that the book was insufferable.So is the film any good? Sure. Very well done. But remember, it's NOT a work of non-fiction. Now I am NOT defending the Vietnam War (it was screwed up in every way and was one of the dumbest moments in US history) but just don't want the gullible to assume it's fact. For at least a closer view of the reality of the war, try watching \"Full Metal Jacket\". But, for a crazy, surreal and mesmerizing view, give \"Apocalypse Now\" a look. It's like nothing you've ever seen before...FYI--It should surprise no one that this is a VERY adult movie--especially the \"Redux\" release of 2001. Tons of violence, strong language and graphic nudity are in this film, so don't watch it with your mother-in-law or the kids!!"
    },
    {
      "username": "BA_Harrison",
      "userUrl": "https://www.imdb.com/user/ur0945066",
      "reviewLink": "https://www.imdb.com/review/rw3373486",
      "warningSpoilers": false,
      "date": "17 December 2015",
      "rate": "5",
      "helpful": "34 out of 54 found this helpful.",
      "title": "The REDUX version",
      "content": "'This is the end' sings Jim Morrison as choppers criss-cross the screen. No, Jim, it's just the beginning. The beginning of a 202-minute, drug-fuelled Vietnam war epic that follows a group of US soldiers upriver, deep into enemy territory, where they witness madness, come to realise the futility of their conflict, and are reminded of the heart of darkness that beats in all men. And like their mission, it's extremely hard going at times.Directed by Francis Ford Coppola, this wild '70s classic starts off brilliantly, with war weary Captain Willard (Martin Sheen) being sent on a covert mission to assassinate renegade Colonel Kurtz (Marlon Brando), whose behaviour and methods are proving an embarrassment to the US army. An early set-piece—an air attack on a Vietcong village to the strains of Wagner's Ride of the Valkyries—is hugely impressive, boding well for the rest of the film. The genius continues with Robert Duvall's unforgettable performance as bonkers Lieutenant Colonel Bill Kilgore, while a jungle encounter with a tiger, and a visit by some Playboy playmates to boost moral only add to the fun.Unfortunately, once the group of soldiers arrive at a French plantation, Apocalypse Now Redux becomes as bloated and unintelligible as its out-of-shape, mumbling star Brando: the action slows down to a snail's pace, and the vast amount of narcotics consumed by cast and crew becomes more than evident, the film turning into a dull psychedelic haze of drug-fuelled weirdness. Dennis Hopper, as a crazed photo journalist, is particularly spaced out, acting like he's single-handedly snorted the entire cocaine supply of the Philippines. This half of the film, as Hopper might say, is a real drag, man.If I ever decide to watch Apocalypse Now again, which I think is unlikely, I'll be sure to watch the original theatrical version. Many think it is better; even if that isn't the case, it's definitely shorter.7.5/10 for everything that happens before the plantation scene; 2.5/10 for the rest. So that's an average of 5/10."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2932510",
      "warningSpoilers": false,
      "date": "1 January 2014",
      "rate": "10",
      "helpful": "15 out of 22 found this helpful.",
      "title": "Iconic, Original, Impossible to Forget",
      "content": "Captain Willard (Martin Sheen) is given an assignment to eliminate renegade and possibly insane Colonel Kurtz (Marlon Brando). He takes a Navy PBR and her crew up the Nung River to find Kurtz's base in Cambodia.This is a vision of nightmare that I could never forget. More than any other movie, there are scenes here that are seared into my memory. Rarely do I give 10/10. This is one movie where I gave a 10 without reservations. There are more iconic, original and impressive scenes here than any modern movie. There is no CGI, just real movie making. Director Francis Ford Coppola used his reputation after the two Godfather movies, and risked it all for this movie. You can tell he left it all on the screen."
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw5960931",
      "warningSpoilers": false,
      "date": "2 August 2020",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Apocalypse Now",
      "content": "I have seen Apocalypse Now so many times over the decades, with various different cuts that Francis Coppola has released. I even once went over parts of the Grand Canyon on a helicopter with Wagner's The Ride of the Valkyries blaring out. It was like experiencing a moment of the movie.Co written by John Milius, one of the most right wing guys in Hollywood. Apocalypse Now is not really anti war, it sat too much on the fence with the Vietnamese being cannon fodder. The Vietnam War had only ended a few years before the film started production. Major film studios were in no mood to be too overtly critical about the war. That will happen in the 1980s with Oliver Stone.Coppola uses Joseph Conrad's novel Heart of Darkness as a metaphorical journey. A war that started off with good intentions by the Americans. Help the Vietnamese and save them from communism. You have Colonel Kilgore's (Robert Duvall) gung ho performance that involves Napalm and surfing. It then ends with Colonel Kurtz (Marlon Brando) a once brilliant soldier literally gone mad.Coppola said of the movie's production \"My film is not about Vietnam, it is Vietnam.\" A typhoon had destroyed the film set in the Philippines. Martin Sheen was encouraged to get drunk for his opening scenes and promptly had a near fatal heart attack. An overweight Marlon Brando turned up on the film set without reading the script. It lead Coppola to shoot Brando with light and shadows to hide his girth.Captain Willard (Martin Sheen) a Special Ops officer is sent on a secret mission into Cambodia to kill Colonel Kurtz who has gone rogue. He has set up his own military unit with a local tribe using savage methods.Willard goes up river in a small navy patrol boat to Cambodia. A journey where they meet oddballs, a party of Playboy Playmates entertaining the troops, a trip to a French plantation (Special Editions), a journey that becomes increasingly dark, dangerous and nightmarish. Willard particularly does not care much for the crew of the patrol boat.Apocalypse Now is an audacious dazzling epic that becomes a journey into madness. I dread to think how much of the Philippine jungle was firebombed during the making of the film. Coppola was at the height of his powers after his success with the two Godfather films. There is wonderful craftsmanship on display. Also wilful disregard for animal life with the slaughter of the water buffalo in the climax. Sorry Francis, your excuse about that scene is lame.There are supporting roles from Harrison Ford playing Colonel George Lucas to Dennis Hopper playing a wacky journalist in Kurtz's compound. Even Scott Glen has a small non vocal appearance and Laurence Fishburne was only 14 years old when he played one of the crewmen of the patrol boat. The heart of the movie is Sheen. He looks young and innocent but is also suffering from his own traumas and cynicism before he embarks on his mission."
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw1863143",
      "warningSpoilers": false,
      "date": "24 April 2008",
      "rate": "10",
      "helpful": "67 out of 103 found this helpful.",
      "title": "Lives Up To Its Title",
      "content": "From all of the Vietnam war movies this is probably the most frightening and disturbing and that is really saying a lot with so many spectacular ones that have come out. It has this freakish feel to it. Everything is so chaotic in the movie it scares you. It is not like it shows a lot of different things compared to the other Vietnam war movies. What does push to such a high level is the: The directing was spectacular here. Francis Ford Coppola shows of his talent in his last epic movie. Unlike other directors he makes you feel as if you are in the war. Most others just display and show you the horrors of war. Coppola though makes you feel confused, shocked and scared. These feelings of war are usually told to us from a movie or story. This is something that I have only experienced very few times while watching a film. The writing was of course amazing too. It brought you write into the middle of the movie. It never made me bored and this movie is three hours. The cinematography goes hand in hand with the directing which very much added to the freakish experience of watching this film showing all the chaos around you even when everything seems calm.The acting was bone-chilling. Just look at Marlon Brando also giving his last great performance playing a deluded, out of whack colonel. When ever I think of a crazy gone made soldier I think Marlon Brando in Apocalpyse Now. With Brando n this film you don't want to look into his eyes. Like the movie he was freakish. To me this performance is as memorable as the one he gave in The Godfather. Martin Sheen gave a very deep performance and probably the best one of his career making you see everything through his eyes all the craziness he is experiencing and yet wanting him to get to his goal. It is just a wonder why these two did not get Oscar nominations. Robert Duvall was able to show part of that craziness with his ludicrous battle strategies, among those playing music to tell the enemy he is coming. Also Duvall's character asking one of the soldiers to surf in the middle of a battle was just shocking but believable. Other great supporting performances were given by a young Laurence Fishburne, Sam Bottoms and Frederic Forest who all summed up the attitudes of many of the soldiers at that time without becoming a cliché. Also for once cameos were put into good use having Dennis Hopper and Harrison Ford who I both love.I would definitely recommend people to watch this movie. It has a message and everyone involved in the making of it is at their best. There is nothing more I could ask of this movie with its great acting, directing, writing, cinematography and great ending. Watch and you will see why it lives up to its title Apocalpyse Now."
    },
    {
      "username": "ccthemovieman-1",
      "userUrl": "https://www.imdb.com/user/ur4445210",
      "reviewLink": "https://www.imdb.com/review/rw1262727",
      "warningSpoilers": false,
      "date": "11 January 2006",
      "rate": "9",
      "helpful": "51 out of 95 found this helpful.",
      "title": "Sheen Shines In This Unique Classic",
      "content": "Well, I've watched this movie for over 25 years now and it's still almost as interesting as when I first saw it. It is definitely one of the most unique films ever made.I still think Martin Sheen got \"dissed\" big-time in the billing, too. He dominates the film yet gets lesser billing than Marlon Brando, who only appears in the last 30 minutes of this 2 hours, 17 minutes film (theatrical version). How unfair is that?Sheen is fantastic in here, especially his narration, which runs throughout. It's one of the best narrations, if not THE best, I have ever heard in a movie. His voice is just haunting as he relates his thoughts on this incredible, nightmare-like adventure. I never fail to appreciate his work in this movie.The other thing that strikes me about the film over the years are the number of memorable scenes, ones I have never forgotten, such as......Sheen losing it in his hotel room in the movie's first scene; Robert Duvall and the totally out-of-place surfing scenes and then the ensuing attack with Wagner's dramatic classical music blaring out of the helicopters; The Playboy bunny entertaining the troops; Frederic Forrest being freaked out seeing a tiger close up in the jungle; the weird scenes on the long riverboat ride; the appearance of hippie journalist Dennis Hopper greeting the crew in Cambodia and then Brando's bizarre character. It goes on and on with strange scenes.That's not to say I enjoyed everything. No, there are a few very unpleasant scenes, such as the one in which an ox is sliced in half (can't watch that anymore), an innocent family is slaughtered on a small boat by Sheen's young stoned-out crew, and the crew is a little too goofy at times. Then, there is the huge amount of profanity, led by way too many f-words.So, there is a lot of good and a lot of bad things in this movie for almost anyone who watches this One thing for sure: it is a film you WILL remember!"
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw1932809",
      "warningSpoilers": false,
      "date": "19 August 2008",
      "rate": "",
      "helpful": "16 out of 25 found this helpful.",
      "title": "This was a valued rug",
      "content": "Francis Ford Coppola, once the most praised and powerful director in Hollywood, entered the Southeast Asian jungle to make a movie. Armed with Joseph Conrad's \"Heart of Darkness\", a small army of technicians, and a 15 million dollar budget, he emerged ten months later with thousands of hours of footage, two nearly dead actors and a nervous breakdown.The cause of all this personal trauma was \"Apocalypse Now\", a film in which Martin Sheen is sent up a river and into the jungles of Vietnam to find Colonel Walter Kurtz (Marlon Brando), a Special Forces officer who has gone insane.Conrad's message was that savagery and apathy can wipe out the fragile gains of civilization within a single generation. A thin line stands between civilization and total collapse. Inject a little bit of barbarism, a little bit of chaos, and everything falls apart. Coppola's film tries to build on this, and states that America's inability to relinquish the trappings of civilization (ie- to get out of the boat), ensured its defeat. We lost because we weren't, as a nation, prepared to commit genocide. We committed horrors, but we weren't prepared to go all the way.The biggest problem with \"Apocalypse Now\" is that it was written by John Milius, the pro-war, gun toting ultra conservative whom the Coen Brother's based their character Walter Sobchak (from \"The Big Lebowski\") on. At the end of Milius' script, Kurtz and Willard team up to fight America. They represent the warrior savage, free from hypocrisy but lost in the darkness.Coppola, of course, found Milius' script largely silly. He removed Milius' violent ending and went in search of something more powerful. For some grand statement on war and human nature. But he found none. How could he? You can't paddle down a straight line for 10 months and then suddenly expect to reach a new destination.Throughout the film, \"Apocalypse Now\" tells us one thing, but shows us something else. The Colonel Kilgores of the picture actually fight the war, whilst the powerful warrior God, Col Kurtz, does little beside chopping the limbs off natives or hiding in the shadows. Milius' script saw Kurtz as the hero. A wise and seasoned rebel warrior who sticks his fingers up to the hypocritical veneer of civilization, but Coppola seems unwilling to go down that route. Coppola's \"redux\" cut of the film, though badly paced, is more interesting. It adds a French plantation scene which attempts to contrast the French period of colonial rule with America's war in Vietnam. The problem with this is that US involvement in Vietnam and the Colonial mindset of nineteenth century Europe, as seen in \"Heart of Darkness\", are completely different. American policy wasn't inspired by colonial aims but by ideological ones. The American experience in Vietnam was the opposite of Conrad's colonial experience. No wonder Coppola couldn't find a suitable ending. There isn't one. Late in the film, Kurtz accuses his country of hypocrisy. They are unwilling to fully embrace the darkness. If he were given a small army of savages, he says, then the war would be over tomorrow. The implication is that the Vietnamese were nothing more than barbaric savages who should be dealt with, not civility, but primal brutality.Worse yet, Coppola's \"war\" is one of gorgeous cinematography and exciting spectacle. When a Vietnamese village is raided, it feels more like the Death Star trench run than a savage massacre. Killgore himself is a figure of fun rather than the monster he should be. Milius' script painted a much darker character (hence kill and gore).Still, \"Apocalypse Now\" may contain no truths about Vietnam or war in general, but it is a film absolutely dripping with passion. Like \"Aguirre, the Wrath of God\", \"Apocalypse Now\" is very much a Werner Herzog film. Herzog was a mad artist who wanted to lift a boat over a mountain. Why lift the boat over the mountain? No reason. He simply wanted to do it in the name of art!Same thing with Coppola. He wanted to do \"somthing\" great. He went into the jungle, went insane and came out with a couple thousand hours of mad footage. What is the merit of this footage? The merit is in surviving the journey. In making it down the river and back out again.And so what we have is a film about its creators. A film about the madness of the white man. The madness of the director. The madness of the crew. Ironically, the film's madness is all a result of indulgence. The indulgence of a staggering budget, studio leeway, accessible drugs, limitless resources and a giant ego. It's the shallowest kind of insanity. The insanity of unlimited power and a lack of boundaries.8/10 - \"Apocalypse Now\" ultimately amounts to nothing more than a series of memorable set-pieces. These set pieces don't enrich one another or gel in any way. It's an incomplete film, and even Coppola admits that he didn't quite know what he was doing or tying to say. The film goes up the river but doesn't know why.Far more interesting is \"Hearts of Darkness: A Filmmaker's Apocalypse\", a documentary shot in tandem with the film. As a study in ego-maniacal madness it's far more powerful than Coppola's film. Narrated by Coppola's wife, it's also very intimate and perceptive. It's also interesting to see how much Coppola relied on Brando's improvisational skills, hoping desperately that the great actor would whip up some kind of climax out of thin air. Brando, of course, was just in it for the huge pay cheque.Though a failure, this film is worth multiple viewings."
    },
    {
      "username": "classicalsteve",
      "userUrl": "https://www.imdb.com/user/ur7383416",
      "reviewLink": "https://www.imdb.com/review/rw2009774",
      "warningSpoilers": false,
      "date": "19 January 2009",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Incredible Adaption of Conrad's \"The Heart of Darkness\" -- Possibly Coppola's Masterpiece",
      "content": "Movies seem to fall into two categories: films that reinforce existing societal values and beliefs, and those that challenge them. This film is a 180-degree shift from the idealistic rhetoric portrayed in offerings like \"The Longest Day\" and \"The Green Berets\" which seem more like Disney fantasies by comparison. The \"Apocalypse Now!\" project, the production and resulting film, is \"Heart of Darkness\" updated into a psychological horror story of the late 20th century post-modernist variety. The cast and crew who worked on it probably could relate to the terrifying places the human mind can achieve. This is the plight of Joseph Conrad's original character Kurtz who came into literary being in 1901 and subsequently referenced in TS Eliot's \"The Hollow Men\" (Mistah Kurtz, he dead) of 1925. Although neither a straight telling of Conrad's \"Heart of Darkness\" (1901) nor a first-hand account of the Vietnam experience, \"Apocalypse Now!\" stands as a masterpiece which pushed on the envelope of cinematic potential. \"Apocalypse\" is not just about the \"horrors\" of war per se, like \"Platoon\" and \"The Deer Hunter\", but the darker sensibilities of human nature as revealed through the raw and demeaning confrontations of violent conflict on a mass scale. Apocalypse Now! is not so much seen as experienced.The bulk of the movie is the journey of a trained secret assassin, Captain Benjamin Willard (Martin Sheen in a tour-de-force performance), aboard a US military boat traversing an unnamed river into the heart of Vietnam and Cambodia where few westerners would ever tread. His mission is to terminate Colonel Kurtz (Marlon Brando), a career army Special Forces Division officer who was the darling of the US Military until he went AWOL and renegade in the deep uncharted jungles between Vietnam, Laos and Cambodia. The official classified report is that the colonel has gone insane but as events play out, something else has happened to him that is far more terrifying than simply insanity. Sheen's mission is to terminate the colonel with the American public none the wiser.The movie is rather episodic. The journey along the river is made up of several vignettes as Sheen and his crew meet different self-contained \"aspects\" of the war at the ground level. American audiences of the 1970's had probably never seen this kind of film-making before, with the possible exception of \"The Deer Hunter\" which was released in the previous year. The first, and one of the most notable, is an helicopter battalion led by Col Kilgore (Robert Duvall in an Oscar-nominated performance) who is a cross between General Robert E Lee and Richard Wagner. He loves to play \"Ride of the Valkyries\" from Wagner's \"The Ring\" when he bombards helpless villages. His line \"I love the smell of Napalm in the morning\" is one of those oft-quoted lines from the annals of cinema. Other encounters include an amphitheater where enlisted privates will be entertained by the likes of Hugh Heffner and Playboy bunnies.Despite all the production catastrophes that impeded getting this footage into the can, the remarkable aspect of this film is its pacing. The original release (not the later Redux version) does a fine of job of building until the viewer is emotionally prepared to deal with the climactic confrontation between Willard and Kurtz. The strange discourse between Willard and Kurtz is worth the price of admission alone. And some of the shots of both Sheen and Brando in certain places are some of the starkest and terrifying images ever produced on film. Not even the likes of Clive Barker, Wes Craven or David Cronenberg have anything on Coppola in terms of horrific imagery. Brando's Kurtz in one scene in particular is so utterly terrifying it makes most other horror movies seem tame by comparison, which comes from the recognition that the horror is not from without but from within.Without giving too much away, Coppola's solution to the climactic moment stands as one of the most innovative of cinematic revelations. According to the documentary \"Hearts of Darkness\", Coppola feared that the inevitable final scene would lapse into melodrama, and the atmosphere of the movie's darker hues would be compromised. He wasn't sure how he could make it work until his wife encouraged the director to witness the ceremonial sacrifice of an ox as practiced by the native people with whom Coppola was using as extras in the scenes with Kurtz at \"his\" village. After the viewing, Coppola had his ending, and it is one of the most simultaneously disturbing and beautiful sequences in the history of American film-making. Love it or hate it, no western viewer will be the same after seeing this scene.This film is not for all tastes just as Conrad's original novel is not the kind of book that will be read on airplanes. It's not just the violence and the pointlessness of violence that are difficult for most American viewers to absorb. It's the naked unveiling of aspects of the human condition that seem so removed from suburban American life that make this film difficult for the average movie-goer to handle, which is as it should be. Coppola did not make a family picture. However, if the viewer can understand its larger point, there is a lot to be gotten out of Apocalypse Now!. If you're looking for a film experience to reaffirm pre-existing attitudes about American sensibility and heroism, better stick with John Wayne. But if you're willing to be taken into places you've never been, even beyond \"the evils of war\" rhetoric, \"Apocalypse Now\" will take you into a world you thought you'd never visited before, and the disturbing part of it is that you may recognize it."
    }
  ],
  "errorMessage": ""
}