{
  "imDbId": "tt0078788",
  "title": "Apocalypse Now",
  "fullTitle": "Apocalypse Now (1979)",
  "type": "Movie",
  "year": "1979",
  "language": "en",
  "titleInLanguage": "Apocalypse Now",
  "url": "https://en.wikipedia.org/wiki/Apocalypse_Now",
  "plotShort": {
    "plainText": "Apocalypse Now is a 1979 American epic war film produced and directed by Francis Ford Coppola. The screenplay, co-written by Coppola, John Milius and Michael Herr, is loosely based on the 1899 novella Heart of Darkness by Joseph Conrad, with the setting changed from late 19th-century Congo to the Vietnam War. The film follows a river journey from South Vietnam into Cambodia undertaken by Captain Willard (Martin Sheen), who is on a secret mission to assassinate Colonel Kurtz (Marlon Brando), a renegade Special Forces officer who is accused of murder and presumed insane. The ensemble cast also features Robert Duvall, Frederic Forrest, Albert Hall, Sam Bottoms, Laurence Fishburne and Dennis Hopper.\r\nMilius became interested in adapting Heart of Darkness for a Vietnam War setting in the late 1960s, and initially began developing the film with Coppola as producer and George Lucas as director. After Lucas became unavailable, Coppola took over directorial control, and was influenced by Werner Herzog's Aguirre, the Wrath of God (1972) in his approach to the material. Initially set to be a five-month shoot in the Philippines starting in March 1976, a series of problems lengthened it to over a year. These problems included expensive sets being destroyed by severe weather, Brando showing up on set overweight and completely unprepared, and Sheen having a breakdown and suffering a near-fatal heart attack on location. After photography was finally finished in May 1977, the release was postponed several times while Coppola edited over a million feet of film. Much of these difficulties are chronicled in the documentary Hearts of Darkness: A Filmmaker's Apocalypse (1991).\r\nApocalypse Now was honored with the Palme d'Or at the Cannes Film Festival, where it premiered unfinished. When it was finally released on August 15, 1979, by United Artists, it performed well at the box office, grossing $40 million domestically and eventually over $100 million worldwide. Initial reviews were mixed; while Vittorio Storaro's cinematography was widely acclaimed, several critics found Coppola's handling of the story's major themes anticlimactic and intellectually disappointing. The film was nominated for eight Academy Awards, including Best Picture, Best Director (Coppola), and Best Supporting Actor (Duvall); it went on to win Best Cinematography and Best Sound.\r\nApocalypse Now is today considered one of the greatest films ever made; for instance, it ranked 14th and 19th in Sight & Sound's greatest films poll in 2012 and 2022 respectively. In 2000, the film was selected for preservation in the National Film Registry by the U.S. Library of Congress as \"culturally, historically or aesthetically significant\".",
    "html": "<p>Apocalypse Now is a 1979 American epic war film produced and directed by Francis Ford Coppola. The screenplay, co-written by Coppola, John Milius and Michael Herr, is loosely based on the 1899 novella Heart of Darkness by Joseph Conrad, with the setting changed from late 19th-century Congo to the Vietnam War. The film follows a river journey from South Vietnam into Cambodia undertaken by Captain Willard (Martin Sheen), who is on a secret mission to assassinate Colonel Kurtz (Marlon Brando), a renegade Special Forces officer who is accused of murder and presumed insane. The ensemble cast also features Robert Duvall, Frederic Forrest, Albert Hall, Sam Bottoms, Laurence Fishburne and Dennis Hopper.</p><p>Milius became interested in adapting Heart of Darkness for a Vietnam War setting in the late 1960s, and initially began developing the film with Coppola as producer and George Lucas as director. After Lucas became unavailable, Coppola took over directorial control, and was influenced by Werner Herzog's Aguirre, the Wrath of God (1972) in his approach to the material. Initially set to be a five-month shoot in the Philippines starting in March 1976, a series of problems lengthened it to over a year. These problems included expensive sets being destroyed by severe weather, Brando showing up on set overweight and completely unprepared, and Sheen having a breakdown and suffering a near-fatal heart attack on location. After photography was finally finished in May 1977, the release was postponed several times while Coppola edited over a million feet of film. Much of these difficulties are chronicled in the documentary Hearts of Darkness: A Filmmaker's Apocalypse (1991).</p><p>Apocalypse Now was honored with the Palme d'Or at the Cannes Film Festival, where it premiered unfinished. When it was finally released on August 15, 1979, by United Artists, it performed well at the box office, grossing $40 million domestically and eventually over $100 million worldwide. Initial reviews were mixed; while Vittorio Storaro's cinematography was widely acclaimed, several critics found Coppola's handling of the story's major themes anticlimactic and intellectually disappointing. The film was nominated for eight Academy Awards, including Best Picture, Best Director (Coppola), and Best Supporting Actor (Duvall); it went on to win Best Cinematography and Best Sound.</p><p>Apocalypse Now is today considered one of the greatest films ever made; for instance, it ranked 14th and 19th in Sight & Sound's greatest films poll in 2012 and 2022 respectively. In 2000, the film was selected for preservation in the National Film Registry by the U.S. Library of Congress as \"culturally, historically or aesthetically significant\".</p>"
  },
  "plotFull": {
    "plainText": "Apocalypse Now is a 1979 American epic war film produced and directed by Francis Ford Coppola. The screenplay, co-written by Coppola, John Milius and Michael Herr, is loosely based on the 1899 novella Heart of Darkness by Joseph Conrad, with the setting changed from late 19th-century Congo to the Vietnam War. The film follows a river journey from South Vietnam into Cambodia undertaken by Captain Willard (Martin Sheen), who is on a secret mission to assassinate Colonel Kurtz (Marlon Brando), a renegade Special Forces officer who is accused of murder and presumed insane. The ensemble cast also features Robert Duvall, Frederic Forrest, Albert Hall, Sam Bottoms, Laurence Fishburne and Dennis Hopper.\r\nMilius became interested in adapting Heart of Darkness for a Vietnam War setting in the late 1960s, and initially began developing the film with Coppola as producer and George Lucas as director. After Lucas became unavailable, Coppola took over directorial control, and was influenced by Werner Herzog's Aguirre, the Wrath of God (1972) in his approach to the material. Initially set to be a five-month shoot in the Philippines starting in March 1976, a series of problems lengthened it to over a year. These problems included expensive sets being destroyed by severe weather, Brando showing up on set overweight and completely unprepared, and Sheen having a breakdown and suffering a near-fatal heart attack on location. After photography was finally finished in May 1977, the release was postponed several times while Coppola edited over a million feet of film. Much of these difficulties are chronicled in the documentary Hearts of Darkness: A Filmmaker's Apocalypse (1991).\r\nApocalypse Now was honored with the Palme d'Or at the Cannes Film Festival, where it premiered unfinished. When it was finally released on August 15, 1979, by United Artists, it performed well at the box office, grossing $40 million domestically and eventually over $100 million worldwide. Initial reviews were mixed; while Vittorio Storaro's cinematography was widely acclaimed, several critics found Coppola's handling of the story's major themes anticlimactic and intellectually disappointing. The film was nominated for eight Academy Awards, including Best Picture, Best Director (Coppola), and Best Supporting Actor (Duvall); it went on to win Best Cinematography and Best Sound.\r\nApocalypse Now is today considered one of the greatest films ever made; for instance, it ranked 14th and 19th in Sight & Sound's greatest films poll in 2012 and 2022 respectively. In 2000, the film was selected for preservation in the National Film Registry by the U.S. Library of Congress as \"culturally, historically or aesthetically significant\".\r\nPlot\r\nIn 1969, during the Vietnam War, U.S. Army Special Forces Colonel Walter E. Kurtz has apparently gone insane and is waging a brutal guerrilla war against NVA and PLAF forces without permission from his commanders. At an outpost in Cambodia, he commands American and Montagnard troops, who see him as a demigod. Burnt-out MACV-SOG operative Captain Benjamin L. Willard is summoned to I Field Force headquarters in Nha Trang. He is ordered to \"terminate Kurtz's command ... with extreme prejudice\".\r\nAmbivalent, Willard joins a U.S. Navy river patrol boat (PBR) commanded by Chief Petty Officer Phillips, with crewmen Lance, \"Chef\" and \"Mr. Clean\" to quietly navigate up the Nùng River to Kurtz's outpost. Before reaching the coastal mouth of the Nùng, they rendezvous with the 1st Squadron, 9th Cavalry Regiment—a helicopter-borne air assault unit commanded by Lieutenant Colonel Bill Kilgore—to discuss safe passage. Kilgore is initially uncooperative as he has not received word about their mission through normal channels, but he becomes more engaged after discovering that Lance is a well-known surfer. The commander is an avid surfer himself and agrees to escort them through the Nùng's Viet Cong-held coastal mouth. The helicopter squadron, playing \"Ride of the Valkyries\" on loudspeakers, raids at dawn with a napalm strike. Before Kilgore can lure Lance out to surf on the newly conquered beach, Willard gathers the sailors to the PBR to continue their mission.\r\nTension arises as Willard believes himself in command of the PBR, while the Chief prioritizes routine patrol objectives over Willard's. Slowly making their way upriver, Willard partially reveals his mission to the Chief to assuage his concerns about why his mission should proceed. As Willard studies Kurtz's dossier, he is struck by the mid-career sacrifice Kurtz made by leaving a prestigious Pentagon assignment to join Special Forces, with no prospect of advancing beyond the rank of colonel.\r\nAt a remote U.S. Army outpost, Willard and Lance seek information on what is upriver and receive a dispatch bag containing official and personal mail. Unable to find any commanding officer, Willard orders the Chief to continue. Willard learns via the dispatch that another MACV-SOG operative, Special Forces Captain Richard Colby, was sent on an earlier mission identical to Willard's and has since joined Kurtz.\r\nLance activates a smoke grenade while under the influence of LSD, attracting enemy fire, causing Mr. Clean's death. Further upriver, Chief is impaled by a spear thrown by Montagnards and attempts to kill Willard by forcing the spear point at him protruding from his own chest before Willard subdues him. Willard reveals his mission to Chef, who is now in charge of the PBR.\r\nThe PBR arrives at Kurtz's outpost, an abandoned Angkor Empire temple compound teeming with Montagnards and strewn with hanged corpses and severed heads. Willard, Chef and Lance are greeted by an American photojournalist, who praises Kurtz's genius. They encounter a near-catatonic Colby. Willard sets out with Lance to find Kurtz, leaving Chef with orders to call in an airstrike on the outpost if the two do not return.\r\nIn the camp, Willard is bound and brought before Kurtz in a darkened temple. Kurtz places Chef's severed head onto Willard's lap, preventing the airstrike. Willard is released and Kurtz lectures him on his theories of war, praising the ruthlessness of the Viet Cong. Kurtz discusses his family and asks that Willard tell his son about him after his death.\r\nThat night, as the Montagnards ceremonially slaughter a water buffalo, Willard attacks Kurtz with a machete. Mortally wounded, Kurtz utters \"The horror ... the horror\" and dies. All in the compound see Willard departing, carrying a collection of Kurtz's writings, and bow down to him. Willard gathers Lance, boards the PBR, and heads back down river, away from the now leaderless Montagnards.\r\nCast\r\nMarlon Brando as Colonel Walter Kurtz, a highly decorated United States Army Special Forces officer with the 5th Special Forces Group who goes rogue. He runs his own military unit based in Cambodia and is feared as much by the U.S. military as by the North Vietnamese, Viet Cong and Khmer Rouge.\r\nRobert Duvall as Lieutenant Colonel William \"Bill\" Kilgore, commander of 1st Squadron, 9th Cavalry Regiment and surfing fanatic. His character is a composite of several characters including Colonel John Stockton, General James F. Hollingsworth and George Patton IV, also a West Point officer whom Robert Duvall knew. Duvall reports that he was upset that a scene where Kilgore saves the life of a Vietnamese baby during the beach assault was cut by Coppola, as he felt that it added to the complexity of his character.\r\nMartin Sheen as U.S. Army Captain Benjamin Willard, a veteran assassin who is serving his third tour in Vietnam. The soldier who escorts him at the start of the film recites that Willard is from the 505th Battalion, of the elite 173rd Airborne Brigade, assigned to MACV-SOG. The opening scene—which features Willard staggering around his hotel room, culminating in him punching a mirror—was filmed on Sheen's 36th birthday when he was heavily intoxicated. The mirror that he broke was not a prop and caused his hand to bleed profusely, but he insisted on continuing the scene, despite Coppola's concerns. Sheen has said this performance where he writhes and smears himself in blood was spontaneous and was an exorcism of his longstanding alcoholism. Sheen's brother Joe Estevez stood in for Willard in some scenes and performed the character's voiceover narrations while his son Charlie appears in the film as an extra. Both went uncredited.\r\nFrederic Forrest as Engineman 3rd Class Jay \"Chef\" Hicks, a tightly wound former chef from New Orleans who is horrified by his surroundings.\r\nAlbert Hall as Chief Petty Officer George Phillips. The Chief runs a tight ship and frequently clashes with Willard over authority.\r\nSam Bottoms as Gunner's Mate 3rd Class Lance B. Johnson, a former professional surfer from Orange County, California. In the bridge scene, he mentions having taken LSD. As the film progresses Lance scene by scene becomes more and more strung out on drugs to the point that his grip on reality fades to almost nothing, and he becomes completely silent in the last act of the film. At the same time he becomes entranced by the Montagnard tribe and participates in the sacrifice ritual.\r\nLaurence Fishburne as Gunner's Mate 3rd Class Tyrone \"Mr. Clean\" Miller, the cocky seventeen-year-old South Bronx-born crewmember. Fishburne was only 14 when shooting began in March 1976, as he had lied about his age to get the role. The production took so long, he was 18 by the time of its release.\r\nDennis Hopper as an American photojournalist, a manic disciple of Kurtz who greets Willard. According to the DVD commentary of Redux, the character is based on Sean Flynn, a famed news correspondent who disappeared in Cambodia in 1970. The character may also have been partially inspired by the British-Australian photojournalist Tim Page.\r\nG. D. Spradlin as Lieutenant General R. Corman, military intelligence (G-2), an authoritarian officer who fears Kurtz and wants him removed. The character is named after filmmaker Roger Corman, for whom Coppola had previously directed his early works.\r\nJerry Ziesmer as Jerry Moore, a C.I.A. agent who sits in on Willard's initial briefing. His only line in the film is \"terminate with extreme prejudice\". Ziesmer was also the film's assistant director.\r\nHarrison Ford as Colonel G. Lucas, aide to Corman and a general information specialist who gives Willard his orders. The character is named for George Lucas, who had directed Ford in American Graffiti and Star Wars, and with whom Coppola had founded American Zoetrope in 1969.\r\nScott Glenn as Captain Richard M. Colby, previously assigned Willard's current mission before he defected to Kurtz's private army and sent a message to his wife, intercepted by the U.S. Army, telling her that he was never coming back and to sell everything they owned, including their children.\r\nJames Keane as Kilgore's Gunner, a man ready to battle to the tune of Ride of the Valkyries.\r\nKerry Rossall as Mike from San Diego, a soldier who surfs against incoming attacks.\r\nColleen Camp, Cynthia Wood and Linda Beatty as Playboy Playmates. Wood was the 1974 Playmate of the Year, and Beatty was the August 1976 Playmate of the Month.\r\nBill Graham as Agent, the announcer in charge of the Playmates' show.\r\nFrancis Ford Coppola (cameo) as a TV news director filming beach combat; he shouts \"Don't look at the camera, go by like you're fighting!\" Cinematographer Vittorio Storaro plays the cameraman by Coppola's side.\r\nR. Lee Ermey (uncredited) as a helicopter pilot. Ermey was himself a former USMC drill instructor and Vietnam War veteran, and later achieved fame for his role as Gunnery Sergeant Hartman in the 1987 film Full Metal Jacket.\r\nAdaptation\r\nAlthough inspired by Joseph Conrad's Heart of Darkness, the film deviates extensively from its source material. The novella, based on Conrad's experience as a steamboat captain in Africa, is set in the Congo Free State during the 19th century. Kurtz and Marlow (whose corresponding character in the movie is Capt. Willard) work for a Belgian trading company that brutally exploits its native African workers.\r\nAfter arriving at Kurtz's outpost, Marlow concludes that Kurtz has gone insane and is lording over a small tribe as a god. The novella ends with Kurtz dying on the trip back and the narrator musing about the darkness of the human psyche: \"the heart of an immense darkness\".\r\nIn the novella, Marlow is the pilot of a river boat sent to collect ivory from Kurtz's outpost, only gradually becoming infatuated with Kurtz. In fact, when he discovers Kurtz in terrible health, Marlow makes an effort to bring him home safely. In the film, Willard is an assassin dispatched to kill Kurtz. Nevertheless, the depiction of Kurtz as a god-like leader of a tribe of natives and his malarial fever, Kurtz's written exclamation \"Exterminate all the brutes!\" (which appears in the film as \"Drop the bomb. Exterminate them all!\") and his last words \"The horror! The horror!\" are taken from Conrad's novella.\r\nCoppola argues that many episodes in the film—the spear and arrow attack on the boat, for example—respect the spirit of the novella and in particular its critique of the concepts of civilization and progress. Other episodes adapted by Coppola, the Playboy Playmates' (Sirens) exit, the lost souls, \"take me home\" attempting to reach the boat and Kurtz's tribe of (white-faced) natives parting the canoes (gates of Hell) for Willard, (with Chef and Lance) to enter the camp are likened to Virgil and \"The Inferno\" (Divine Comedy) by Dante. While Coppola replaced European colonialism with American interventionism, the message of Conrad's book is still clear.\r\nIt is often speculated that Coppola's interpretation of the Kurtz character was modeled after Tony Poe, a highly decorated Vietnam-era paramilitary officer from the CIA's Special Activities Division. Poe's actions in Vietnam and in the \"Secret War\" in neighboring Laos, in particular his highly unorthodox and often savage methods of waging war, show many similarities to those of the fictional Kurtz; for example, Poe was known to drop severed heads from helicopters into enemy-controlled villages as a form of psychological warfare and use human ears to record the number of enemies his indigenous troops had killed. He would send these ears back to his superiors as proof of the efficacy of his operations deep inside Laos. Coppola denies that Poe was a primary influence and says the character was loosely based on Special Forces Colonel Robert B. Rheault, who was the actual head of 5th Special Forces Group (May to July 1969), and whose 1969 arrest over the murder of suspected double agent Thai Khac Chuyen in Nha Trang generated substantial contemporary news coverage, in the Green Beret Affair, including making public the phrase \"terminate with extreme prejudice\", which was used prominently in the movie.\r\nIt is considered that the character of Lieutenant Colonel Bill Kilgore is based on several characters, including John B. Stockton, commander of the 1st Squadron, 9th Cavalry Regiment in Vietnam, and legendary infantry general James F. Hollingsworth.\r\nUse of T.S. Eliot's poetry\r\nIn the film, shortly before Colonel Kurtz dies, he recites part of T. S. Eliot's poem \"The Hollow Men\". The poem is preceded in printed editions by the epigraph \"Mistah Kurtz – he dead\", a quotation from Conrad's Heart of Darkness.\r\nTwo books seen opened on Kurtz's desk in the film are From Ritual to Romance by Jessie Weston and The Golden Bough by Sir James Frazer, the two books that Eliot cited as the chief sources and inspiration for his poem \"The Waste Land\". Eliot's original epigraph for \"The Waste Land\" was this passage from Heart of Darkness, which ends with Kurtz's final words:\r\nDid he live his life again in every detail of desire, temptation, and surrender during that supreme moment of complete knowledge? He cried in a whisper at some image, at some vision, – he cried out twice, a cry that was no more than a breath – \"The horror! The horror!\"\r\nWhen Willard is first introduced to Dennis Hopper's character, the photojournalist describes his own worth in relation to that of Kurtz with: \"I should have been a pair of ragged claws/Scuttling across the floors of silent seas\", from \"The Love Song of J. Alfred Prufrock\". Additionally, Dennis Hopper's character paraphrases the end of \"The Hollow Men\" to Martin Sheen's character: \"This is the way the fucking world ends! Not with a bang, but with a whimper.\"\r\nProduction\r\nDevelopment\r\nWhile working as an assistant for Francis Ford Coppola on The Rain People in 1967, filmmaker John Milius was encouraged by his friends George Lucas and Steven Spielberg to write a Vietnam War film. Milius had wanted to volunteer for the war, and was disappointed when he was rejected for having asthma. He came up with the idea for adapting the plot of Joseph Conrad's Heart of Darkness to the Vietnam War setting. He had read the novel as a teenager and was reminded about it when his college English professor, Irwin Blacker of USC, mentioned the several unsuccessful attempts to adapt it into a movie. Blacker challenged his class by saying, \"No screenwriter has ever perfected a film adaption of Joseph Conrad's Heart of Darkness.\"\r\nCoppola gave Milius $15,000 to write the screenplay with the promise of an additional $10,000 if it were green-lit. Milius claims that he wrote the screenplay in 1969. He wanted to use Conrad's novel as \"a sort of allegory. It would have been too simple to have followed the book completely.\" Some sources state that Milius' original title was The Psychedelic Soldier, but Milius disputed this in a 2010 interview, claiming Apocalypse Now was always the intended title.\r\nMilius based the character of Willard and some of Kurtz's on a friend of his, Fred Rexer. Rexer claimed to have experienced, first-hand, the scene relayed by Brando's character wherein the arms of villagers are hacked off by the Viet Cong; and that Kurtz was based on Robert B. Rheault, head of Special Forces in Vietnam. Scholars have never found any evidence to corroborate Rexer's claim, nor any similar Viet Cong behavior, and consider it an urban legend. The title Apocalypse Now was inspired by a button badge popular with hippies during the 1960s that said \"Nirvana Now\".\r\nAt one point, Coppola told Milius, \"Write every scene you ever wanted to go into that movie\", and he wrote ten drafts, amounting to over a thousand pages. He was influenced by an article by Michael Herr, \"The Battle for Khe Sanh\", which referred to drugs, rock 'n' roll, and people calling airstrikes down on themselves. He was also inspired by such films as Dr. Strangelove.\r\nMilius says the classic line \"Charlie don't surf\" was inspired by a comment Ariel Sharon made during the Six-Day War, when he went skin diving after capturing enemy territory and announced, \"We're eating their fish\". He says the line \"I love the smell of napalm in the morning\" just came to him.\r\nWarner Bros.-Seven Arts acquired the screenplay in 1969 but put it into turnaround. Milius had no desire to direct the film himself and felt that Lucas was the right person for the job. Lucas worked with Milius for four years developing the film, while working on other films, including his script for Star Wars. He approached Apocalypse Now as a black comedy, and intended to shoot it after making THX 1138, with principal photography to start in 1971. Lucas's friend and producer Gary Kurtz traveled to the Philippines, scouting suitable locations. They intended to shoot the film both in the rice fields between Stockton and Sacramento, California, and on-location in South Vietnam, on a $2 million budget, cinéma vérité style, using 16 mm cameras, and real soldiers, while the war was still going on. However, due to the studios' safety concerns and Lucas's involvement with American Graffiti and Star Wars, Lucas decided to put the project on hold.\r\nPre-production\r\nCoppola was drawn to Milius's script, which he described as \"a comedy and a terrifying psychological horror story\", and acquired the rights. In the spring of 1974, he discussed with friends and co-producers Fred Roos and Gray Frederickson the idea of producing the film. He asked Lucas, then Milius, to direct it, but both were involved with other projects. (Lucas had gotten the go-ahead to make Star Wars.) Coppola was determined to make the film and pressed ahead himself. He envisioned it as a definitive statement on the nature of modern war, the contrasts between good and evil, and the impact of American culture on the rest of the world. He said he wanted to take the audience \"through an unprecedented experience of war and have them react as much as those who had gone through the war\".\r\nIn 1975, Coppola hoped for cooperation from the United States Army and scouted military locations in Georgia and Florida; but the Army was not interested. While promoting The Godfather Part II in Australia, Coppola and his producers scouted possible locations for Apocalypse Now in Cairns in northern Queensland, as it had jungle resembling Vietnam's, and in Malaysia. He decided to make the film in the Philippines for its access to American military equipment and cheap labor. Production coordinator Fred Roos had already made two low-budget films there for Monte Hellman, and had friends and contacts there. Frederickson went to the Philippines and had dinner with President Ferdinand Marcos to formalize support for the production and to allow them to use some of the country's military equipment. Coppola spent the last few months of 1975 revising Milius's script and negotiating with United Artists to secure financing for the production. Milius claimed it would be the \"most violent film ever made\". According to Frederickson, the budget was estimated between $12 and 14 million. Coppola's American Zoetrope obtained $7.5 million from United Artists for domestic distribution rights and $8 million from international sales, on the assumption that the film would star Marlon Brando, Steve McQueen and Gene Hackman.\r\nCasting\r\nSteve McQueen was Coppola's first choice to play Willard, but McQueen did not want to leave America for three months and Coppola was unwilling to pay his $3 million fee. When McQueen dropped out in February 1976, Coppola had to return $5 million of the $21 million he had raised. Al Pacino was also offered the role, but he too did not want to be away that long, and was afraid of falling ill in the jungle as he had done in the Dominican Republic during the shooting of The Godfather Part II. Jack Nicholson, Robert Redford and James Caan were approached to play either Kurtz or Willard. Keith Carradine, Nick Nolte, and Frederic Forrest were also considered for Willard. In a 2015 The Hollywood Reporter interview, Clint Eastwood revealed that Coppola offered him the role of Willard, but much like McQueen and Pacino, he did not want to be away from America for a long time. He also revealed that McQueen tried to convince him to play Willard; McQueen wanted to play Kurtz because he would have to work for only two weeks.\r\nCoppola also offered the role of Colonel Kurtz to Orson Welles and Lee Marvin, both of whom turned it down.\r\nCoppola and Roos had been impressed by Martin Sheen's screen test for Michael in The Godfather and he became their top choice to play Willard, but he had already accepted another project. Harvey Keitel was cast in the role based on his work in Martin Scorsese's Mean Streets. By early 1976, Coppola had persuaded Marlon Brando to play Kurtz, for a fee of $2 million for a month's work on location in September 1976. Brando also received 10% of the gross theatrical rental and 10% of the TV sale rights, earning him around $9 million.\r\nHackman was set to play Wyatt Khanage, who later became Kilgore, played by Robert Duvall. Dennis Hopper was cast as a war correspondent and observer of Kurtz; when Coppola heard Hopper talking nonstop on location, he remembered putting \"the cameras and the Montagnard shirt on him, and the scene where he greets them on the boat\". James Caan was the first choice to play Colonel Lucas, but Caan wanted too much money for what was considered a minor part, and Harrison Ford was cast instead.\r\nBefore departing for principal photography, Coppola took out an advertisement in the trade press declaring Keitel, Duvall and others as the \"first choices\" for the film. It also listed other actors who did not appear in the film, including Harry Dean Stanton, Robby Benson and Michael Learned.\r\nSam Bottoms, Larry Fishburne and Albert Hall all signed seven-year deals, with Coppola including acting training of their choice in their deal. Bottoms was infected with hookworm while filming in the Philippines, and the parasite \"wrecked his liver\".\r\nPrincipal photography\r\nOn March 1, 1976, Coppola and his family flew to Manila and rented a large house there for the planned four-month shoot. Sound and photographic equipment had been coming in from California since late 1975. John Ashley assisted with production in the Philippines. The film was due to be released on Coppola's 38th birthday, April 7, 1977.\r\nShooting began on March 20, 1976. Within a few days, Coppola was unhappy with Harvey Keitel's take on Willard, saying that the actor \"found it difficult to play him as a passive onlooker\". With Brando not due to film until three months later, as he did not want to work while his children were on school vacation, Keitel left the project in April and quit the seven-year deal he had signed as well. Coppola returned to Los Angeles and replaced Keitel with Martin Sheen, who arrived in the Philippines on April 24. Only four days of reshoots were reportedly required after the change.\r\nTyphoon Olga wrecked 40–80% of the sets at Iba and on May 26, 1976, production was closed down. Dean Tavoularis remembers that it \"started raining harder and harder until finally it was literally white outside, and all the trees were bent at forty-five degrees\". Some of the crew were stranded in a hotel and the others were in small houses that were immobilized by the storm. The Playboy Playmate set was destroyed, ruining a month's scheduled shooting. Most of the cast and crew returned to the United States for six to eight weeks. Tavoularis and his team stayed on to scout new locations and rebuild the Playmate set in a different place. Also, the production had bodyguards watching constantly at night and one day the entire payroll was stolen. According to Coppola's wife, Eleanor, the film was six weeks behind schedule and $2 million over budget; Coppola filed a $500,000 insurance claim for typhoon damage and took out a loan from United Artists on the condition that if the film did not generate theatrical rentals of over $40 million, he would be liable for the overruns. Despite the increasing costs, Coppola promised the University of the Philippines Film Center 1% of the profits, up to $1 million, for a film study trust fund.\r\nCoppola flew back to the U.S. in June 1976. He read a book about Genghis Khan to get a better handle on the character of Kurtz. When filming commenced in July 1976, Marlon Brando arrived in Manila very overweight and began working with Coppola to rewrite the ending. The director downplayed Brando's weight by dressing him in black, photographing only his face, and having another, taller actor double for him to portray him as an almost mythical character.\r\nAfter Christmas 1976, Coppola viewed a rough assembly of the footage but still needed to improvise an ending. He returned to the Philippines in early 1977 and resumed filming.\r\nOn March 5 of that year, Sheen, then only 36, had a near-fatal heart attack and struggled for a quarter of a mile to reach help. By then the film was so over-budget, Sheen worried that funding would be halted if word about his condition reached investors, and he claimed that he'd suffered heat stroke instead. Until he returned to the set on April 19, his brother Joe Estevez filled in for him and provided voiceovers for his character. Coppola later admitted that he could no longer tell which scenes were of Joe or Martin. A major sequence in a French plantation cost hundreds of thousands of dollars but was cut from the final film. Rumors began to circulate that Apocalypse Now had several endings, but Richard Beggs, who worked on the sound elements, said, \"There were never five endings, but just the one, even if there were differently edited versions\". These rumors came from Coppola departing frequently from the original screenplay. Coppola admitted that he had no ending because Brando was too fat to play the scenes as written in the original script. With the help of Dennis Jakob, Coppola decided the ending could be \"the classic myth of the murderer who gets up the river, kills the king, and then himself becomes the king – it's the Fisher King, from The Golden Bough\". Principal photography ended on May 21, 1977, after 238 days.\r\nPost-production and audio\r\nThe budget had doubled to over $25 million, and Coppola's loan from United Artists to fund the overruns had been extended to over $10 million. UA took out a $15 million life insurance policy on Coppola. By June 1977, Coppola had offered his car, house, and The Godfather profits as security to finish the film. When Star Wars became a gigantic hit, Coppola sent a telegram to George Lucas asking for money. The release date was pushed back to spring 1978.\r\nJapanese composer Isao Tomita was signed to provide an original score, with Coppola desiring the film's soundtrack to sound like Tomita's electronic adaptation of The Planets by Gustav Holst. Tomita went as far as to accompany the film crew in the Philippines, but label contracts ultimately prevented his involvement. In the summer of 1977, Coppola told Walter Murch that he had four months to assemble the sound. Murch realized that the script had originally been narrated but Coppola abandoned the idea during filming. Murch thought that there was a way to assemble the film without narration but that it would take ten months, and decided to give it another try. He put it back in, recording it all himself. By September, Coppola told his wife that he felt \"there is only about a 20% chance can pull the film off\". He convinced United Artists executives to delay the premiere from May to October 1978. Author Michael Herr received a call from Zoetrope in January 1978 and was asked to work on the film's narration based on his well-received book about Vietnam, Dispatches. He said that the narration already written was \"totally useless\" and spent a year creating a new narration, with Coppola giving him very definite guidelines.\r\nMurch had problems trying to make a stereo soundtrack for Apocalypse Now because sound libraries had no stereo recordings of weapons. The sound material brought back from the Philippines was inadequate because the small location crew lacked the time and resources to record jungle sounds and ambient noises. Murch and his crew fabricated the mood of the jungle on the soundtrack. Apocalypse Now used novel sound techniques for a movie, as Murch insisted on recording the most up-to-date gunfire and employed the Dolby Stereo 70 mm Six Track system for the 70 mm release, which used two channels of sound behind the audience as well as three channels from behind the movie screen. The 35 mm release used the new Dolby Stereo optical stereo system, but due to limitations of the technology at the time, the 35 mm release that played in most theaters did not include surround sound. In May 1978, Coppola postponed the opening until spring of 1979. The cost overruns had reached $18 million, for which Coppola was personally liable, but he had retained rights to the picture in perpetuity.\r\nControversies\r\nA water buffalo was slaughtered with a machete for the climactic scene in a ritual performed by a local Ifugao tribe, which Coppola had previously witnessed with his wife Eleanor (who filmed the ritual later shown in the documentary Hearts of Darkness) and film crew. Although it was an American production subject to American animal cruelty laws, such scenes filmed in the Philippines were not policed or monitored; the American Humane Association gave the film an \"unacceptable\" rating.\r\nReal human corpses were bought from a man who turned out to be a grave-robber. The police questioned the film crew, holding their passports, and soldiers took the bodies away. Instead, extras were used to pose as corpses in the film.\r\nDuring filming, Dennis Hopper and Marlon Brando did not get along, leading Brando to refuse to be on the set at the same time as Hopper.\r\nRelease\r\nIn April 1979, Coppola screened a \"work in progress\" for 900 people; it was not well received. That year, he was invited to screen Apocalypse Now at the Cannes Film Festival. United Artists was not keen on showing an unfinished version to so many members of the press. However, since his 1974 film The Conversation had won the Palme d'Or, Coppola agreed to screen Apocalypse Now with the festival only a month away.\r\nThe week before Cannes, Coppola arranged three sneak previews of a 139-minute cut in Westwood, Los Angeles on May 11 attended by 2,000 paying customers, some of whom lined up for over 6 hours. Other cuts shown in 1979 ran 150 and 165 minutes. The film was also shown at the White House for Jimmy Carter on May 10. Coppola allowed critics to attend the L.A. screenings and believed they would honor an embargo not to review the work in progress. On May 14, Rona Barrett previewed the film on television on Good Morning America and called it \"a disappointing failure\". This prompted Variety to believe the embargo had been broken, and it published its review the following day, saying it was \"worth the wait\", calling it a \"brilliant and bizarre film\". They also noted that it was the first \"70mm presentation without credits\", for which Coppola had obtained permission from the various guilds (Screen Actors Guild, Directors Guild, and Writers Guild of America) and instead provided a printed program with credits. The title appeared scrawled on a wall on a temple in the last third of the film. Daily Variety reported that the first, 8 p.m. screening was received with \"limited, if enthusiastic, applause\".\r\nCannes screening\r\nAt Cannes, Zoetrope technicians worked during the night before the screening to install additional speakers to achieve Murch's 5.1 soundtrack. A three-hour version of Apocalypse Now was screened as a work in progress at the 1979 Cannes Film Festival on Saturday, May 19, 1979 and met with prolonged applause. It was the first work in progress ever shown in competition at the festival. At the subsequent press conference, Coppola criticized the media for releasing premature reviews and for attacking him and the production during their problems filming in the Philippines. He said, \"We had access to too much money, too much equipment, and little by little we went insane\", and \"My film is not about Vietnam, it is Vietnam\". His comments upset newspaper critic Rex Reed, who reportedly stormed out of the conference. Apocalypse Now won the Palme d'Or for best film, along with Volker Schlöndorff's The Tin Drum – a decision reportedly greeted with \"some boos and jeers from the audience\".\r\nTheatrical release\r\nOn August 15, 1979, Apocalypse Now was released in North America in only three theaters equipped to play the Dolby Stereo 70 mm prints with stereo surround sound: the Ziegfeld Theatre in New York City, the Cinerama Dome in Los Angeles and the University Theatre in Toronto. The film, without credits, ran 147 minutes and tickets were $5, a new high for L.A.\r\nIt ran exclusively in these three locations for four weeks before opening in an additional 12 theaters on October 3, 1979. On October 10, 1979, the 35 mm version, with credits, was released in over 300 theatres.\r\nThe film had a $9 million advertising campaign, bringing its total costs to $45 million.\r\nAlternative and varied endings\r\nAt the time of the film's release, discussion and rumors circulated about its supposed various endings. Coppola said the original ending was written in haste, where Kurtz convinced Willard to join him and together they repelled the air strike on the compound. Coppola said he never fully agreed with Kurtz and Willard dying in fatalistic explosive intensity, preferring to end the film in a more positive way.\r\nWhen Coppola originally organized the ending, he considered two significant versions. One had Willard leading Lance by the hand as everyone in Kurtz's base threw down their weapons; Willard then piloted the PBR slowly away from Kurtz's compound, and this final shot was superimposed over the face of a stone idol, which then faded to black. The other version had the base spectacularly blown to bits in an air strike, killing everyone left within it.\r\nThe original 1979 70mm exclusive theatrical release ended with Willard's boat, the stone statue, and the fade to black with no credits, save for '\"Copyright 1979 Omni Zoetrope\"' at its very end. This mirrored the lack of opening titles and supposedly stemmed from Coppola's original intention to \"tour\" the film as one would a play: The credits appeared on printed programs provided before the screening began.\r\nThere have been, to date, many variations of the end credit sequence, beginning with the 35 mm general release, where Coppola elected to show the credits superimposed over shots of the jungle exploding into flames. The explosions were from the detonations of the sets. Rental prints circulated with this ending, and can be found in the hands of a few collectors. Some versions had the subtitle \"A United Artists release\", while others had \"An Omni Zoetrope release\". The network television version of the credits ended with \"... from MGM/UA Entertainment Company\" (as it made its network debut shortly after the merger of MGM and UA). Another variation of the end credits can be seen on both YouTube and as a supplement on the current Lionsgate Blu-ray.\r\nWhen Coppola later heard that the audiences interpreted this as an air strike called by Willard, he pulled the film from its 35 mm run and added credits on a black screen. The \"air strike\" footage continued to circulate in repertory theaters well into the 1980s, and was included in the 1980s LaserDisc release. In the DVD commentary, Coppola explains that the images of explosions were not intended as part of the story, but were simply a graphic background he had added for the credits.\r\nCoppola explained he had shot the explosion footage during demolition of the sets, whose destruction and removal were required by the Philippine government. He filmed the demolition with cameras fitted with different film stocks and lenses to capture the explosions at different speeds. He wanted to do something with the dramatic footage and decided to add them to the credits.\r\nRe-release\r\nThe film was re-released on August 28, 1987, in six cities, to capitalize on the success of Platoon, Full Metal Jacket, and other Vietnam War movies. New 70 mm prints were shown in Los Angeles, San Francisco, San Jose, Seattle, St. Louis and Cincinnati —cities where the film had done well in 1979. It was given the same kind of release as the exclusive 1979 engagement, with no logo or credits, and audiences were given a printed program.\r\nReception\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, Apocalypse Now holds an approval rating of 98% based on 98 reviews, with an average rating of 9.00/10. The website's critics consensus reads: \"Francis Ford Coppola's haunting, hallucinatory Vietnam War epic is cinema at its most audacious and visionary.\" Metacritic, which uses a weighted average, assigned the film a score of 94 out of 100 based on 15 critics, indicating \"universal acclaim\".\r\nUpon its release, Apocalypse Now received mixed reviews. In his original review, Roger Ebert wrote: \"Apocalypse Now achieves greatness not by analyzing our 'experience in Vietnam', but by re-creating, in characters and images, something of that experience.\" and named it \"The best film of 1979\". Ebert concluded by writing: \"What's great in the film, and what will make it live for many years and speak to many audiences, is what Coppola achieves on the levels Truffaut was discussing: the moments of agony and joy in making cinema. Some of those moments occur at the same time; remember again the helicopter assault and its unsettling juxtaposition of horror and exhilaration. Remember the weird beauty of the massed helicopters lifting above the trees in the long shot, and the insane power of Wagner's music, played loudly during the attack, and you feel what Coppola was getting at: Those moments as common in life as art, when the whole huge grand mystery of the world, so terrible, so beautiful, seems to hang in the balance.\" Ebert added Coppola's film to his list of The Great Movies, stating: \"Apocalypse Now is the best Vietnam film, one of the greatest of all films, because it pushes beyond the others, into the dark places of the soul. It is not about war so much as about how war reveals truths we would be happy never to discover.\"\r\nIn his review for the Los Angeles Times, Charles Champlin wrote: 'as a noble use of the medium and as a tireless expression of national anguish, it towers over everything that has been attempted by an American filmmaker in a very long time.' Other reviews were less positive; Frank Rich, writing for Time said: 'While much of the footage is breathtaking, Apocalypse Now is emotionally obtuse and intellectually empty.' Vincent Canby argued: 'Mr. Coppola himself describes it as 'operatic', but ... Apocalypse Now is neither a tone poem nor an opera. It's an adventure yarn with delusions of grandeur, a movie that ends — in the all-too-familiar words of the poet Mr. Coppola drags in by the bootstraps — not with a bang, but a whimper.'\r\nCommentators have debated whether Apocalypse Now is an anti-war or pro-war film. Some evidence of the film's anti-war message includes the purposeless brutality of the war, the absence of military leadership, and the imagery of machinery destroying nature. Advocates of a pro-war stance view these same elements as a glorification of war and the assertion of American supremacy. According to Frank Tomasulo, 'the US foisting its culture on Vietnam', including the destruction of a village so that soldiers could surf, affirms the film's pro-war message. Anthony Swofford recounted how his marine platoon watched Apocalypse Now before being sent to Iraq in 1990 to get excited for war. Nidesh Lawtoo illustrates the ambiguity of the film by focusing on the contradictory responses the movie in general – and the \"Ride of the Valkyries\" scene in particular – triggered in a university classroom. According to Coppola, the film may be considered anti-war, but is even more anti-lie: '... the fact that a culture can lie about what's really going on in warfare, that people are being brutalized, tortured, maimed, and killed, and somehow present this as moral is what horrifies me, and perpetuates the possibility of war'. In 2019, however, Coppola told Kevin Perry of The Guardian that he hesitated to call the film anti-war, stating \"... an anti-war film, I always thought, should be like The Burmese Harp – something filled with love and peace and tranquillity and happiness. It shouldn't have sequences of violence that inspire a lust for violence. Apocalypse Now has stirring scenes of helicopters attacking innocent people. That's not anti-war.\"\r\nIn May 2011, a new restored digital print of Apocalypse Now was released in UK cinemas, distributed by Optimum Releasing. Total Film magazine gave the film a five-star review, stating: 'This is the original cut rather than the 2001 'Redux' (be gone, jarring French plantation interlude!), digitally restored to such heights you can, indeed, get a nose full of the napalm.'\r\nBox office\r\nApocalypse Now performed well at the box office when it opened on August 15, 1979. It initially opened in three theaters in New York City, Toronto, and Hollywood, grossing $322,489 in its first five days. It grossed over $40 million domestically, with a worldwide total of over $100 million.\r\nLegacy\r\nToday, the movie is regarded by many as a masterpiece of the New Hollywood era. Roger Ebert considered it the finest film on the Vietnam War and included it on his list for the 2002 Sight & Sound poll for the greatest movie of all time. In the 2002 Sight & Sound director's poll of the \"greatest films of all time\", it was ranked No. 19. It is on the American Film Institute's 100 Years...100 Movies list at number 28, but dropped to number 30 on their 10th anniversary list. Kilgore's quote, \"I love the smell of napalm in the morning\", written by Milius, was number 12 on the AFI's 100 Years ... 100 Movie Quotes list and was also voted the greatest movie speech of all time in a 2004 poll. In 2006, Writers Guild of America ranked the screenplay, by John Milius and Francis Ford Coppola, the 55th greatest ever. It is number 7 on Empire's 2008 list of the 500 greatest movies of all time. Empire re-ranked it at #20 in their 2014 list of The 301 Greatest Movies of All Time, and again at #22 on their 2018 list of The 100 Greatest Movies. It was voted No. 66 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In 2010, The Guardian named Apocalypse Now \"the best action and war film of all time\". In 2016, The Hollywood Reporter ranked it 11th among 69 winners of the Palme d'Or. The New York Times included it on its Best 1000 Movies Ever list. Entertainment Weekly ranked it as having one of the \"10 Best Surfing Scenes\" in cinema.\r\nIn 2002, Sight and Sound magazine invited several critics to name the best film of the last 25 years, and Apocalypse Now was named number one. It was also listed as the second-best war film by viewers on Channel 4's 100 Greatest War Films, and was the second-best war movie of all time based on the Movifone list (after Schindler's List) and the IMDb War movie list (after The Longest Day). It is ranked number 1 on Channel 4's 50 Films to See Before You Die. In a 2004 poll of UK film fans, Blockbuster listed Kilgore's eulogy to napalm as the best movie speech. The helicopter attack scene with the Ride of the Valkyries soundtrack was chosen as the most memorable film scene ever by Empire magazine. (The scene is recalled in one of the last acts of the 2012 video game Far Cry 3, when the music is played while the character shoots from a helicopter. It was likewise adapted for the Cat's Eye anime episode \"From Runan Island with Love\" and the Battle of Italica scene in Gate: Jieitai Kano Chi nite, Kaku Tatakaeri.)\r\nIn 2009, the London Film Critics' Circle voted Apocalypse Now the best film of the last 30 years. It was also included in BBC's 2015 list of the 100 greatest American films.\r\nIn 2011, actor Charlie Sheen, son of the film's leading actor Martin, started playing clips from the film on his live tour and played the film in its entirety during post-show parties. One of Sheen's films, the 1993 comedy Hot Shots! Part Deux, includes a brief scene where Charlie is riding a boat up a river in Iraq while on a rescue mission and passes Martin, as Captain Willard, going the other way. As they pass, each man shouts to the other \"I loved you in Wall Street!\", referring to the 1987 film that featured both of them. Additionally, the promotional material for Hot Shots! Part Deux included a mockumentary that aired on HBO titled Hearts of Hot Shots! Part Deux—A Filmmaker's Apology, a parody of the 1991 documentary Hearts of Darkness: A Filmmaker's Apocalypse about the making of Apocalypse Now.\r\nThe film is credited with creating the Philippines surfing culture around the town of Baler, where the helicopter attack and surfing sequences were filmed.\r\nOn January 25, 2017, Coppola announced that he was seeking funding through Kickstarter for a horror role-playing video game based on Apocalypse Now. It was later canceled by Montgomery Markland, the game's director, as revealed on its official Tumblr page.\r\nThe Sympathizer, a Pulitzer Prize-winning novel by Vietnamese-American author Viet Thanh Nguyen, features a subplot that Nguyen describes as a critique of Apocalypse Now. He told the New York Times that \"Apocalypse Now is an important work of art, but that doesn't mean I'm going to bow down before it. I'm going to fight with it because it fought with me.\" He said that the film centered on American perspectives of the war rather than Vietnamese experiences. He was especially critical of the scene where all the passengers of a boat were unjustly killed by the traveling party: \"People just like me were being slaughtered. I felt violated.\"\r\nThe Seiko 6105 and its subsequent reissues have been nicknamed the \"Captain Willard\", in reference to its use by the eponymous character.\r\nAwards and honors\r\nAFI's 100 Years...100 Movies – No. 28\r\nAFI's 100 Years...100 Movie Quotes: \"I love the smell of napalm in the morning.\" – No. 12\r\n\"I love the smell of napalm in the morning.\" – No. 12\r\nAFI's 100 Years...100 Movies (10th Anniversary Edition) – No. 30\r\nOther versions\r\nApocalypse Now Redux\r\nIn 2001, Coppola released Apocalypse Now Redux in cinemas and subsequently on DVD. This is an extended version that restores 49 minutes of scenes cut from the original film. Coppola has continued to circulate the original version as well: the two versions are packaged together in the Complete Dossier DVD, released on August 15, 2006, and in the Blu-ray edition released on October 19, 2010.\r\nThe longest section of added footage in the Redux version is the \"French Plantation\" sequence, a chapter involving the de Marais family's rubber plantation, a holdover from the colonization of French Indochina, featuring Coppola's two sons Gian-Carlo and Roman as children of the family. Around the dinner table, a young French child recites a poem by Charles Baudelaire entitled L'albatros. The French family patriarch is not satisfied with the child's recitation. The child is sent away. These scenes were removed from the 1979 cut, which premiered at Cannes. In behind-the-scenes footage in Hearts of Darkness, Coppola expresses his anger, on the set, at the technical limitations of the scenes, the result of shortage of money. At the time of the Redux version, it was possible to digitally enhance the footage to accomplish Coppola's vision. In the scenes, the French family patriarchs argue about the positive side of colonialism in Indochina and denounce the betrayal of the military men in the First Indochina War. Hubert de Marais argues that French politicians sacrificed entire battalions at Điện Biên Phủ, and tells Willard that the US created the Viet Cong (as the Viet Minh) to fend off Japanese invaders.\r\nOther added material includes extra combat footage before Willard meets Kilgore, a scene in which Willard's team steals Kilgore's surfboard (which sheds some light on the hunt for the mangoes), a follow-up scene to the dance of the Playboy Playmates, in which Willard's team finds the Playmates stranded after their helicopter has run out of fuel (trading two barrels of fuel for two hours with the Bunnies), and a scene of Kurtz reading from a Time magazine article about the war, surrounded by Cambodian children.\r\nA deleted scene titled \"Monkey Sampan\" shows Willard and the PBR crew suspiciously eyeing an approaching sampan juxtaposed to Montagnard villagers joyfully singing \"Light My Fire\" by The Doors. As the sampan gets closer, Willard realizes there are monkeys on it and no helmsman. Finally, just as the two boats pass, the wind turns the sail and exposes a naked dead Viet Cong (VC) nailed to the sail boom. His body is mutilated and looks as though the man had been flogged and castrated. The singing stops. As they pass on by, Chief notes out loud, \"That's comin' from where we goin', Captain.\" The boat then slowly passes the giant tail of a shot down B-52 bomber as the noise of engines high in the sky is heard. Coppola said that he made up for cutting this scene by having the PBR pass under an aircraft tail in the final cut.\r\nFirst Assembly\r\nA 289-minute First Assembly circulates as a video bootleg, containing extra material not included in either the original theatrical release or the \"redux\" version. This cut of the film does not feature Carmine Coppola's score, instead using several Doors tracks.\r\nApocalypse Now Final Cut\r\nIn April 2019, Coppola showed Apocalypse Now Final Cut for the 40th anniversary screening at the Tribeca Film Festival. This new version is Coppola's preferred version of the film and has a runtime of three hours and three minutes, with Coppola having cut 20 minutes of the added material from Redux; the scenes deleted include the second encounter with the Playmates, parts of the plantation sequence, and Kurtz's reading of Time magazine. It is also the first time the film has been restored from the original camera negative at 4K; previous transfers were made from an interpositive. It was released in autumn 2019, along with an extended cut of The Cotton Club. It also had a release in select IMAX theaters on August 15 and 18, 2019, in a collaboration between IMAX and Lionsgate.\r\nHome media\r\nLionsgate released a 6-disc 40th anniversary edition on August 27, 2019. It includes two 4K Ultra HD Blu-ray discs and four standard Blu-ray discs, containing the theatrical version, Redux, and the Final Cut featuring 4K restorations from the original camera negative. Previous extras (including the Hearts of Darkness documentary) have been re-used for this release, along with brand new content including a Tribeca Film Festival Q&A with Francis Ford Coppola and Steven Soderbergh and never-before-seen B-roll footage.\r\nDocumentaries\r\nHearts of Darkness: A Filmmaker's Apocalypse (American Zoetrope/Cineplex Odeon Films) (1991) Directed by Eleanor Coppola, George Hickenlooper, and Fax Bahr\r\nApocalypse Now – The Complete Dossier DVD (Paramount Home Entertainment) (2006). Disc 2 extras include:\r\nThe Post Production of Apocalypse Now: Documentary (four featurettes covering the editing, music, and sound of the film through Coppola and his team) \"A Million Feet of Film: The Editing of Apocalypse Now\" (18 minutes). Written and directed by Kim Aubry. \"The Music of Apocalypse Now\" (15 minutes) \"Heard Any Good Movies Lately? The Sound Design of Apocalypse Now\" (15 minutes) \"The Final Mix\" (3 minutes)\r\n\"A Million Feet of Film: The Editing of Apocalypse Now\" (18 minutes). Written and directed by Kim Aubry.\r\n\"The Music of Apocalypse Now\" (15 minutes)\r\n\"Heard Any Good Movies Lately? The Sound Design of Apocalypse Now\" (15 minutes)\r\n\"The Final Mix\" (3 minutes)",
    "html": "<p>Apocalypse Now is a 1979 American epic war film produced and directed by Francis Ford Coppola. The screenplay, co-written by Coppola, John Milius and Michael Herr, is loosely based on the 1899 novella Heart of Darkness by Joseph Conrad, with the setting changed from late 19th-century Congo to the Vietnam War. The film follows a river journey from South Vietnam into Cambodia undertaken by Captain Willard (Martin Sheen), who is on a secret mission to assassinate Colonel Kurtz (Marlon Brando), a renegade Special Forces officer who is accused of murder and presumed insane. The ensemble cast also features Robert Duvall, Frederic Forrest, Albert Hall, Sam Bottoms, Laurence Fishburne and Dennis Hopper.</p><p>Milius became interested in adapting Heart of Darkness for a Vietnam War setting in the late 1960s, and initially began developing the film with Coppola as producer and George Lucas as director. After Lucas became unavailable, Coppola took over directorial control, and was influenced by Werner Herzog's Aguirre, the Wrath of God (1972) in his approach to the material. Initially set to be a five-month shoot in the Philippines starting in March 1976, a series of problems lengthened it to over a year. These problems included expensive sets being destroyed by severe weather, Brando showing up on set overweight and completely unprepared, and Sheen having a breakdown and suffering a near-fatal heart attack on location. After photography was finally finished in May 1977, the release was postponed several times while Coppola edited over a million feet of film. Much of these difficulties are chronicled in the documentary Hearts of Darkness: A Filmmaker's Apocalypse (1991).</p><p>Apocalypse Now was honored with the Palme d'Or at the Cannes Film Festival, where it premiered unfinished. When it was finally released on August 15, 1979, by United Artists, it performed well at the box office, grossing $40 million domestically and eventually over $100 million worldwide. Initial reviews were mixed; while Vittorio Storaro's cinematography was widely acclaimed, several critics found Coppola's handling of the story's major themes anticlimactic and intellectually disappointing. The film was nominated for eight Academy Awards, including Best Picture, Best Director (Coppola), and Best Supporting Actor (Duvall); it went on to win Best Cinematography and Best Sound.</p><p>Apocalypse Now is today considered one of the greatest films ever made; for instance, it ranked 14th and 19th in Sight & Sound's greatest films poll in 2012 and 2022 respectively. In 2000, the film was selected for preservation in the National Film Registry by the U.S. Library of Congress as \"culturally, historically or aesthetically significant\".</p><br/><h3>Plot</h3><p>In 1969, during the Vietnam War, U.S. Army Special Forces Colonel Walter E. Kurtz has apparently gone insane and is waging a brutal guerrilla war against NVA and PLAF forces without permission from his commanders. At an outpost in Cambodia, he commands American and Montagnard troops, who see him as a demigod. Burnt-out MACV-SOG operative Captain Benjamin L. Willard is summoned to I Field Force headquarters in Nha Trang. He is ordered to \"terminate Kurtz's command ... with extreme prejudice\".</p><p>Ambivalent, Willard joins a U.S. Navy river patrol boat (PBR) commanded by Chief Petty Officer Phillips, with crewmen Lance, \"Chef\" and \"Mr. Clean\" to quietly navigate up the Nùng River to Kurtz's outpost. Before reaching the coastal mouth of the Nùng, they rendezvous with the 1st Squadron, 9th Cavalry Regiment—a helicopter-borne air assault unit commanded by Lieutenant Colonel Bill Kilgore—to discuss safe passage. Kilgore is initially uncooperative as he has not received word about their mission through normal channels, but he becomes more engaged after discovering that Lance is a well-known surfer. The commander is an avid surfer himself and agrees to escort them through the Nùng's Viet Cong-held coastal mouth. The helicopter squadron, playing \"Ride of the Valkyries\" on loudspeakers, raids at dawn with a napalm strike. Before Kilgore can lure Lance out to surf on the newly conquered beach, Willard gathers the sailors to the PBR to continue their mission.</p><p>Tension arises as Willard believes himself in command of the PBR, while the Chief prioritizes routine patrol objectives over Willard's. Slowly making their way upriver, Willard partially reveals his mission to the Chief to assuage his concerns about why his mission should proceed. As Willard studies Kurtz's dossier, he is struck by the mid-career sacrifice Kurtz made by leaving a prestigious Pentagon assignment to join Special Forces, with no prospect of advancing beyond the rank of colonel.</p><p>At a remote U.S. Army outpost, Willard and Lance seek information on what is upriver and receive a dispatch bag containing official and personal mail. Unable to find any commanding officer, Willard orders the Chief to continue. Willard learns via the dispatch that another MACV-SOG operative, Special Forces Captain Richard Colby, was sent on an earlier mission identical to Willard's and has since joined Kurtz.</p><p>Lance activates a smoke grenade while under the influence of LSD, attracting enemy fire, causing Mr. Clean's death. Further upriver, Chief is impaled by a spear thrown by Montagnards and attempts to kill Willard by forcing the spear point at him protruding from his own chest before Willard subdues him. Willard reveals his mission to Chef, who is now in charge of the PBR.</p><p>The PBR arrives at Kurtz's outpost, an abandoned Angkor Empire temple compound teeming with Montagnards and strewn with hanged corpses and severed heads. Willard, Chef and Lance are greeted by an American photojournalist, who praises Kurtz's genius. They encounter a near-catatonic Colby. Willard sets out with Lance to find Kurtz, leaving Chef with orders to call in an airstrike on the outpost if the two do not return.</p><p>In the camp, Willard is bound and brought before Kurtz in a darkened temple. Kurtz places Chef's severed head onto Willard's lap, preventing the airstrike. Willard is released and Kurtz lectures him on his theories of war, praising the ruthlessness of the Viet Cong. Kurtz discusses his family and asks that Willard tell his son about him after his death.</p><p>That night, as the Montagnards ceremonially slaughter a water buffalo, Willard attacks Kurtz with a machete. Mortally wounded, Kurtz utters \"The horror ... the horror\" and dies. All in the compound see Willard departing, carrying a collection of Kurtz's writings, and bow down to him. Willard gathers Lance, boards the PBR, and heads back down river, away from the now leaderless Montagnards.</p><br/><h3>Cast</h3><ul><li>Marlon Brando as Colonel Walter Kurtz, a highly decorated United States Army Special Forces officer with the 5th Special Forces Group who goes rogue. He runs his own military unit based in Cambodia and is feared as much by the U.S. military as by the North Vietnamese, Viet Cong and Khmer Rouge.</li><li>Robert Duvall as Lieutenant Colonel William \"Bill\" Kilgore, commander of 1st Squadron, 9th Cavalry Regiment and surfing fanatic. His character is a composite of several characters including Colonel John Stockton, General James F. Hollingsworth and George Patton IV, also a West Point officer whom Robert Duvall knew. Duvall reports that he was upset that a scene where Kilgore saves the life of a Vietnamese baby during the beach assault was cut by Coppola, as he felt that it added to the complexity of his character.</li><li>Martin Sheen as U.S. Army Captain Benjamin Willard, a veteran assassin who is serving his third tour in Vietnam. The soldier who escorts him at the start of the film recites that Willard is from the 505th Battalion, of the elite 173rd Airborne Brigade, assigned to MACV-SOG. The opening scene—which features Willard staggering around his hotel room, culminating in him punching a mirror—was filmed on Sheen's 36th birthday when he was heavily intoxicated. The mirror that he broke was not a prop and caused his hand to bleed profusely, but he insisted on continuing the scene, despite Coppola's concerns. Sheen has said this performance where he writhes and smears himself in blood was spontaneous and was an exorcism of his longstanding alcoholism. Sheen's brother Joe Estevez stood in for Willard in some scenes and performed the character's voiceover narrations while his son Charlie appears in the film as an extra. Both went uncredited.</li><li>Frederic Forrest as Engineman 3rd Class Jay \"Chef\" Hicks, a tightly wound former chef from New Orleans who is horrified by his surroundings.</li><li>Albert Hall as Chief Petty Officer George Phillips. The Chief runs a tight ship and frequently clashes with Willard over authority.</li><li>Sam Bottoms as Gunner's Mate 3rd Class Lance B. Johnson, a former professional surfer from Orange County, California. In the bridge scene, he mentions having taken LSD. As the film progresses Lance scene by scene becomes more and more strung out on drugs to the point that his grip on reality fades to almost nothing, and he becomes completely silent in the last act of the film. At the same time he becomes entranced by the Montagnard tribe and participates in the sacrifice ritual.</li><li>Laurence Fishburne as Gunner's Mate 3rd Class Tyrone \"Mr. Clean\" Miller, the cocky seventeen-year-old South Bronx-born crewmember. Fishburne was only 14 when shooting began in March 1976, as he had lied about his age to get the role. The production took so long, he was 18 by the time of its release.</li><li>Dennis Hopper as an American photojournalist, a manic disciple of Kurtz who greets Willard. According to the DVD commentary of Redux, the character is based on Sean Flynn, a famed news correspondent who disappeared in Cambodia in 1970. The character may also have been partially inspired by the British-Australian photojournalist Tim Page.</li><li>G. D. Spradlin as Lieutenant General R. Corman, military intelligence (G-2), an authoritarian officer who fears Kurtz and wants him removed. The character is named after filmmaker Roger Corman, for whom Coppola had previously directed his early works.</li><li>Jerry Ziesmer as Jerry Moore, a C.I.A. agent who sits in on Willard's initial briefing. His only line in the film is \"terminate with extreme prejudice\". Ziesmer was also the film's assistant director.</li><li>Harrison Ford as Colonel G. Lucas, aide to Corman and a general information specialist who gives Willard his orders. The character is named for George Lucas, who had directed Ford in American Graffiti and Star Wars, and with whom Coppola had founded American Zoetrope in 1969.</li><li>Scott Glenn as Captain Richard M. Colby, previously assigned Willard's current mission before he defected to Kurtz's private army and sent a message to his wife, intercepted by the U.S. Army, telling her that he was never coming back and to sell everything they owned, including their children.</li><li>James Keane as Kilgore's Gunner, a man ready to battle to the tune of Ride of the Valkyries.</li><li>Kerry Rossall as Mike from San Diego, a soldier who surfs against incoming attacks.</li><li>Colleen Camp, Cynthia Wood and Linda Beatty as Playboy Playmates. Wood was the 1974 Playmate of the Year, and Beatty was the August 1976 Playmate of the Month.</li><li>Bill Graham as Agent, the announcer in charge of the Playmates' show.</li><li>Francis Ford Coppola (cameo) as a TV news director filming beach combat; he shouts \"Don't look at the camera, go by like you're fighting!\" Cinematographer Vittorio Storaro plays the cameraman by Coppola's side.</li><li>R. Lee Ermey (uncredited) as a helicopter pilot. Ermey was himself a former USMC drill instructor and Vietnam War veteran, and later achieved fame for his role as Gunnery Sergeant Hartman in the 1987 film Full Metal Jacket.</li></ul><br/><h3>Adaptation</h3><p>Although inspired by Joseph Conrad's Heart of Darkness, the film deviates extensively from its source material. The novella, based on Conrad's experience as a steamboat captain in Africa, is set in the Congo Free State during the 19th century. Kurtz and Marlow (whose corresponding character in the movie is Capt. Willard) work for a Belgian trading company that brutally exploits its native African workers.</p><p>After arriving at Kurtz's outpost, Marlow concludes that Kurtz has gone insane and is lording over a small tribe as a god. The novella ends with Kurtz dying on the trip back and the narrator musing about the darkness of the human psyche: \"the heart of an immense darkness\".</p><p>In the novella, Marlow is the pilot of a river boat sent to collect ivory from Kurtz's outpost, only gradually becoming infatuated with Kurtz. In fact, when he discovers Kurtz in terrible health, Marlow makes an effort to bring him home safely. In the film, Willard is an assassin dispatched to kill Kurtz. Nevertheless, the depiction of Kurtz as a god-like leader of a tribe of natives and his malarial fever, Kurtz's written exclamation \"Exterminate all the brutes!\" (which appears in the film as \"Drop the bomb. Exterminate them all!\") and his last words \"The horror! The horror!\" are taken from Conrad's novella.</p><p>Coppola argues that many episodes in the film—the spear and arrow attack on the boat, for example—respect the spirit of the novella and in particular its critique of the concepts of civilization and progress. Other episodes adapted by Coppola, the Playboy Playmates' (Sirens) exit, the lost souls, \"take me home\" attempting to reach the boat and Kurtz's tribe of (white-faced) natives parting the canoes (gates of Hell) for Willard, (with Chef and Lance) to enter the camp are likened to Virgil and \"The Inferno\" (Divine Comedy) by Dante. While Coppola replaced European colonialism with American interventionism, the message of Conrad's book is still clear.</p><p>It is often speculated that Coppola's interpretation of the Kurtz character was modeled after Tony Poe, a highly decorated Vietnam-era paramilitary officer from the CIA's Special Activities Division. Poe's actions in Vietnam and in the \"Secret War\" in neighboring Laos, in particular his highly unorthodox and often savage methods of waging war, show many similarities to those of the fictional Kurtz; for example, Poe was known to drop severed heads from helicopters into enemy-controlled villages as a form of psychological warfare and use human ears to record the number of enemies his indigenous troops had killed. He would send these ears back to his superiors as proof of the efficacy of his operations deep inside Laos. Coppola denies that Poe was a primary influence and says the character was loosely based on Special Forces Colonel Robert B. Rheault, who was the actual head of 5th Special Forces Group (May to July 1969), and whose 1969 arrest over the murder of suspected double agent Thai Khac Chuyen in Nha Trang generated substantial contemporary news coverage, in the Green Beret Affair, including making public the phrase \"terminate with extreme prejudice\", which was used prominently in the movie.</p><p>It is considered that the character of Lieutenant Colonel Bill Kilgore is based on several characters, including John B. Stockton, commander of the 1st Squadron, 9th Cavalry Regiment in Vietnam, and legendary infantry general James F. Hollingsworth.</p><h4>Use of T.S. Eliot's poetry</h4><p>In the film, shortly before Colonel Kurtz dies, he recites part of T. S. Eliot's poem \"The Hollow Men\". The poem is preceded in printed editions by the epigraph \"Mistah Kurtz – he dead\", a quotation from Conrad's Heart of Darkness.</p><p>Two books seen opened on Kurtz's desk in the film are From Ritual to Romance by Jessie Weston and The Golden Bough by Sir James Frazer, the two books that Eliot cited as the chief sources and inspiration for his poem \"The Waste Land\". Eliot's original epigraph for \"The Waste Land\" was this passage from Heart of Darkness, which ends with Kurtz's final words:</p><blockquote>Did he live his life again in every detail of desire, temptation, and surrender during that supreme moment of complete knowledge? He cried in a whisper at some image, at some vision, – he cried out twice, a cry that was no more than a breath – \"The horror! The horror!\"</blockquote><p>When Willard is first introduced to Dennis Hopper's character, the photojournalist describes his own worth in relation to that of Kurtz with: \"I should have been a pair of ragged claws/Scuttling across the floors of silent seas\", from \"The Love Song of J. Alfred Prufrock\". Additionally, Dennis Hopper's character paraphrases the end of \"The Hollow Men\" to Martin Sheen's character: \"This is the way the fucking world ends! Not with a bang, but with a whimper.\"</p><br/><h3>Production</h3><h4>Development</h4><p>While working as an assistant for Francis Ford Coppola on The Rain People in 1967, filmmaker John Milius was encouraged by his friends George Lucas and Steven Spielberg to write a Vietnam War film. Milius had wanted to volunteer for the war, and was disappointed when he was rejected for having asthma. He came up with the idea for adapting the plot of Joseph Conrad's Heart of Darkness to the Vietnam War setting. He had read the novel as a teenager and was reminded about it when his college English professor, Irwin Blacker of USC, mentioned the several unsuccessful attempts to adapt it into a movie. Blacker challenged his class by saying, \"No screenwriter has ever perfected a film adaption of Joseph Conrad's Heart of Darkness.\"</p><p>Coppola gave Milius $15,000 to write the screenplay with the promise of an additional $10,000 if it were green-lit. Milius claims that he wrote the screenplay in 1969. He wanted to use Conrad's novel as \"a sort of allegory. It would have been too simple to have followed the book completely.\" Some sources state that Milius' original title was The Psychedelic Soldier, but Milius disputed this in a 2010 interview, claiming Apocalypse Now was always the intended title.</p><p>Milius based the character of Willard and some of Kurtz's on a friend of his, Fred Rexer. Rexer claimed to have experienced, first-hand, the scene relayed by Brando's character wherein the arms of villagers are hacked off by the Viet Cong; and that Kurtz was based on Robert B. Rheault, head of Special Forces in Vietnam. Scholars have never found any evidence to corroborate Rexer's claim, nor any similar Viet Cong behavior, and consider it an urban legend. The title Apocalypse Now was inspired by a button badge popular with hippies during the 1960s that said \"Nirvana Now\".</p><p>At one point, Coppola told Milius, \"Write every scene you ever wanted to go into that movie\", and he wrote ten drafts, amounting to over a thousand pages. He was influenced by an article by Michael Herr, \"The Battle for Khe Sanh\", which referred to drugs, rock 'n' roll, and people calling airstrikes down on themselves. He was also inspired by such films as Dr. Strangelove.</p><p>Milius says the classic line \"Charlie don't surf\" was inspired by a comment Ariel Sharon made during the Six-Day War, when he went skin diving after capturing enemy territory and announced, \"We're eating their fish\". He says the line \"I love the smell of napalm in the morning\" just came to him.</p><p>Warner Bros.-Seven Arts acquired the screenplay in 1969 but put it into turnaround. Milius had no desire to direct the film himself and felt that Lucas was the right person for the job. Lucas worked with Milius for four years developing the film, while working on other films, including his script for Star Wars. He approached Apocalypse Now as a black comedy, and intended to shoot it after making THX 1138, with principal photography to start in 1971. Lucas's friend and producer Gary Kurtz traveled to the Philippines, scouting suitable locations. They intended to shoot the film both in the rice fields between Stockton and Sacramento, California, and on-location in South Vietnam, on a $2 million budget, cinéma vérité style, using 16 mm cameras, and real soldiers, while the war was still going on. However, due to the studios' safety concerns and Lucas's involvement with American Graffiti and Star Wars, Lucas decided to put the project on hold.</p><h4>Pre-production</h4><p>Coppola was drawn to Milius's script, which he described as \"a comedy and a terrifying psychological horror story\", and acquired the rights. In the spring of 1974, he discussed with friends and co-producers Fred Roos and Gray Frederickson the idea of producing the film. He asked Lucas, then Milius, to direct it, but both were involved with other projects. (Lucas had gotten the go-ahead to make Star Wars.) Coppola was determined to make the film and pressed ahead himself. He envisioned it as a definitive statement on the nature of modern war, the contrasts between good and evil, and the impact of American culture on the rest of the world. He said he wanted to take the audience \"through an unprecedented experience of war and have them react as much as those who had gone through the war\".</p><p>In 1975, Coppola hoped for cooperation from the United States Army and scouted military locations in Georgia and Florida; but the Army was not interested. While promoting The Godfather Part II in Australia, Coppola and his producers scouted possible locations for Apocalypse Now in Cairns in northern Queensland, as it had jungle resembling Vietnam's, and in Malaysia. He decided to make the film in the Philippines for its access to American military equipment and cheap labor. Production coordinator Fred Roos had already made two low-budget films there for Monte Hellman, and had friends and contacts there. Frederickson went to the Philippines and had dinner with President Ferdinand Marcos to formalize support for the production and to allow them to use some of the country's military equipment. Coppola spent the last few months of 1975 revising Milius's script and negotiating with United Artists to secure financing for the production. Milius claimed it would be the \"most violent film ever made\". According to Frederickson, the budget was estimated between $12 and 14 million. Coppola's American Zoetrope obtained $7.5 million from United Artists for domestic distribution rights and $8 million from international sales, on the assumption that the film would star Marlon Brando, Steve McQueen and Gene Hackman.</p><h4>Casting</h4><p>Steve McQueen was Coppola's first choice to play Willard, but McQueen did not want to leave America for three months and Coppola was unwilling to pay his $3 million fee. When McQueen dropped out in February 1976, Coppola had to return $5 million of the $21 million he had raised. Al Pacino was also offered the role, but he too did not want to be away that long, and was afraid of falling ill in the jungle as he had done in the Dominican Republic during the shooting of The Godfather Part II. Jack Nicholson, Robert Redford and James Caan were approached to play either Kurtz or Willard. Keith Carradine, Nick Nolte, and Frederic Forrest were also considered for Willard. In a 2015 The Hollywood Reporter interview, Clint Eastwood revealed that Coppola offered him the role of Willard, but much like McQueen and Pacino, he did not want to be away from America for a long time. He also revealed that McQueen tried to convince him to play Willard; McQueen wanted to play Kurtz because he would have to work for only two weeks.</p><p>Coppola also offered the role of Colonel Kurtz to Orson Welles and Lee Marvin, both of whom turned it down.</p><p>Coppola and Roos had been impressed by Martin Sheen's screen test for Michael in The Godfather and he became their top choice to play Willard, but he had already accepted another project. Harvey Keitel was cast in the role based on his work in Martin Scorsese's Mean Streets. By early 1976, Coppola had persuaded Marlon Brando to play Kurtz, for a fee of $2 million for a month's work on location in September 1976. Brando also received 10% of the gross theatrical rental and 10% of the TV sale rights, earning him around $9 million.</p><p>Hackman was set to play Wyatt Khanage, who later became Kilgore, played by Robert Duvall. Dennis Hopper was cast as a war correspondent and observer of Kurtz; when Coppola heard Hopper talking nonstop on location, he remembered putting \"the cameras and the Montagnard shirt on him, and the scene where he greets them on the boat\". James Caan was the first choice to play Colonel Lucas, but Caan wanted too much money for what was considered a minor part, and Harrison Ford was cast instead.</p><p>Before departing for principal photography, Coppola took out an advertisement in the trade press declaring Keitel, Duvall and others as the \"first choices\" for the film. It also listed other actors who did not appear in the film, including Harry Dean Stanton, Robby Benson and Michael Learned.</p><p>Sam Bottoms, Larry Fishburne and Albert Hall all signed seven-year deals, with Coppola including acting training of their choice in their deal. Bottoms was infected with hookworm while filming in the Philippines, and the parasite \"wrecked his liver\".</p><h4>Principal photography</h4><p>On March 1, 1976, Coppola and his family flew to Manila and rented a large house there for the planned four-month shoot. Sound and photographic equipment had been coming in from California since late 1975. John Ashley assisted with production in the Philippines. The film was due to be released on Coppola's 38th birthday, April 7, 1977.</p><p>Shooting began on March 20, 1976. Within a few days, Coppola was unhappy with Harvey Keitel's take on Willard, saying that the actor \"found it difficult to play him as a passive onlooker\". With Brando not due to film until three months later, as he did not want to work while his children were on school vacation, Keitel left the project in April and quit the seven-year deal he had signed as well. Coppola returned to Los Angeles and replaced Keitel with Martin Sheen, who arrived in the Philippines on April 24. Only four days of reshoots were reportedly required after the change.</p><p>Typhoon Olga wrecked 40–80% of the sets at Iba and on May 26, 1976, production was closed down. Dean Tavoularis remembers that it \"started raining harder and harder until finally it was literally white outside, and all the trees were bent at forty-five degrees\". Some of the crew were stranded in a hotel and the others were in small houses that were immobilized by the storm. The Playboy Playmate set was destroyed, ruining a month's scheduled shooting. Most of the cast and crew returned to the United States for six to eight weeks. Tavoularis and his team stayed on to scout new locations and rebuild the Playmate set in a different place. Also, the production had bodyguards watching constantly at night and one day the entire payroll was stolen. According to Coppola's wife, Eleanor, the film was six weeks behind schedule and $2 million over budget; Coppola filed a $500,000 insurance claim for typhoon damage and took out a loan from United Artists on the condition that if the film did not generate theatrical rentals of over $40 million, he would be liable for the overruns. Despite the increasing costs, Coppola promised the University of the Philippines Film Center 1% of the profits, up to $1 million, for a film study trust fund.</p><p>Coppola flew back to the U.S. in June 1976. He read a book about Genghis Khan to get a better handle on the character of Kurtz. When filming commenced in July 1976, Marlon Brando arrived in Manila very overweight and began working with Coppola to rewrite the ending. The director downplayed Brando's weight by dressing him in black, photographing only his face, and having another, taller actor double for him to portray him as an almost mythical character.</p><p>After Christmas 1976, Coppola viewed a rough assembly of the footage but still needed to improvise an ending. He returned to the Philippines in early 1977 and resumed filming.</p><p>On March 5 of that year, Sheen, then only 36, had a near-fatal heart attack and struggled for a quarter of a mile to reach help. By then the film was so over-budget, Sheen worried that funding would be halted if word about his condition reached investors, and he claimed that he'd suffered heat stroke instead. Until he returned to the set on April 19, his brother Joe Estevez filled in for him and provided voiceovers for his character. Coppola later admitted that he could no longer tell which scenes were of Joe or Martin. A major sequence in a French plantation cost hundreds of thousands of dollars but was cut from the final film. Rumors began to circulate that Apocalypse Now had several endings, but Richard Beggs, who worked on the sound elements, said, \"There were never five endings, but just the one, even if there were differently edited versions\". These rumors came from Coppola departing frequently from the original screenplay. Coppola admitted that he had no ending because Brando was too fat to play the scenes as written in the original script. With the help of Dennis Jakob, Coppola decided the ending could be \"the classic myth of the murderer who gets up the river, kills the king, and then himself becomes the king – it's the Fisher King, from The Golden Bough\". Principal photography ended on May 21, 1977, after 238 days.</p><h4>Post-production and audio</h4><p>The budget had doubled to over $25 million, and Coppola's loan from United Artists to fund the overruns had been extended to over $10 million. UA took out a $15 million life insurance policy on Coppola. By June 1977, Coppola had offered his car, house, and The Godfather profits as security to finish the film. When Star Wars became a gigantic hit, Coppola sent a telegram to George Lucas asking for money. The release date was pushed back to spring 1978.</p><p>Japanese composer Isao Tomita was signed to provide an original score, with Coppola desiring the film's soundtrack to sound like Tomita's electronic adaptation of The Planets by Gustav Holst. Tomita went as far as to accompany the film crew in the Philippines, but label contracts ultimately prevented his involvement. In the summer of 1977, Coppola told Walter Murch that he had four months to assemble the sound. Murch realized that the script had originally been narrated but Coppola abandoned the idea during filming. Murch thought that there was a way to assemble the film without narration but that it would take ten months, and decided to give it another try. He put it back in, recording it all himself. By September, Coppola told his wife that he felt \"there is only about a 20% chance can pull the film off\". He convinced United Artists executives to delay the premiere from May to October 1978. Author Michael Herr received a call from Zoetrope in January 1978 and was asked to work on the film's narration based on his well-received book about Vietnam, Dispatches. He said that the narration already written was \"totally useless\" and spent a year creating a new narration, with Coppola giving him very definite guidelines.</p><p>Murch had problems trying to make a stereo soundtrack for Apocalypse Now because sound libraries had no stereo recordings of weapons. The sound material brought back from the Philippines was inadequate because the small location crew lacked the time and resources to record jungle sounds and ambient noises. Murch and his crew fabricated the mood of the jungle on the soundtrack. Apocalypse Now used novel sound techniques for a movie, as Murch insisted on recording the most up-to-date gunfire and employed the Dolby Stereo 70 mm Six Track system for the 70 mm release, which used two channels of sound behind the audience as well as three channels from behind the movie screen. The 35 mm release used the new Dolby Stereo optical stereo system, but due to limitations of the technology at the time, the 35 mm release that played in most theaters did not include surround sound. In May 1978, Coppola postponed the opening until spring of 1979. The cost overruns had reached $18 million, for which Coppola was personally liable, but he had retained rights to the picture in perpetuity.</p><h4>Controversies</h4><p>A water buffalo was slaughtered with a machete for the climactic scene in a ritual performed by a local Ifugao tribe, which Coppola had previously witnessed with his wife Eleanor (who filmed the ritual later shown in the documentary Hearts of Darkness) and film crew. Although it was an American production subject to American animal cruelty laws, such scenes filmed in the Philippines were not policed or monitored; the American Humane Association gave the film an \"unacceptable\" rating.</p><p>Real human corpses were bought from a man who turned out to be a grave-robber. The police questioned the film crew, holding their passports, and soldiers took the bodies away. Instead, extras were used to pose as corpses in the film.</p><p>During filming, Dennis Hopper and Marlon Brando did not get along, leading Brando to refuse to be on the set at the same time as Hopper.</p><br/><h3>Release</h3><p>In April 1979, Coppola screened a \"work in progress\" for 900 people; it was not well received. That year, he was invited to screen Apocalypse Now at the Cannes Film Festival. United Artists was not keen on showing an unfinished version to so many members of the press. However, since his 1974 film The Conversation had won the Palme d'Or, Coppola agreed to screen Apocalypse Now with the festival only a month away.</p><p>The week before Cannes, Coppola arranged three sneak previews of a 139-minute cut in Westwood, Los Angeles on May 11 attended by 2,000 paying customers, some of whom lined up for over 6 hours. Other cuts shown in 1979 ran 150 and 165 minutes. The film was also shown at the White House for Jimmy Carter on May 10. Coppola allowed critics to attend the L.A. screenings and believed they would honor an embargo not to review the work in progress. On May 14, Rona Barrett previewed the film on television on Good Morning America and called it \"a disappointing failure\". This prompted Variety to believe the embargo had been broken, and it published its review the following day, saying it was \"worth the wait\", calling it a \"brilliant and bizarre film\". They also noted that it was the first \"70mm presentation without credits\", for which Coppola had obtained permission from the various guilds (Screen Actors Guild, Directors Guild, and Writers Guild of America) and instead provided a printed program with credits. The title appeared scrawled on a wall on a temple in the last third of the film. Daily Variety reported that the first, 8 p.m. screening was received with \"limited, if enthusiastic, applause\".</p><h4>Cannes screening</h4><p>At Cannes, Zoetrope technicians worked during the night before the screening to install additional speakers to achieve Murch's 5.1 soundtrack. A three-hour version of Apocalypse Now was screened as a work in progress at the 1979 Cannes Film Festival on Saturday, May 19, 1979 and met with prolonged applause. It was the first work in progress ever shown in competition at the festival. At the subsequent press conference, Coppola criticized the media for releasing premature reviews and for attacking him and the production during their problems filming in the Philippines. He said, \"We had access to too much money, too much equipment, and little by little we went insane\", and \"My film is not about Vietnam, it is Vietnam\". His comments upset newspaper critic Rex Reed, who reportedly stormed out of the conference. Apocalypse Now won the Palme d'Or for best film, along with Volker Schlöndorff's The Tin Drum – a decision reportedly greeted with \"some boos and jeers from the audience\".</p><h4>Theatrical release</h4><p>On August 15, 1979, Apocalypse Now was released in North America in only three theaters equipped to play the Dolby Stereo 70 mm prints with stereo surround sound: the Ziegfeld Theatre in New York City, the Cinerama Dome in Los Angeles and the University Theatre in Toronto. The film, without credits, ran 147 minutes and tickets were $5, a new high for L.A.</p><p>It ran exclusively in these three locations for four weeks before opening in an additional 12 theaters on October 3, 1979. On October 10, 1979, the 35 mm version, with credits, was released in over 300 theatres.</p><p>The film had a $9 million advertising campaign, bringing its total costs to $45 million.</p><h4>Alternative and varied endings</h4><p>At the time of the film's release, discussion and rumors circulated about its supposed various endings. Coppola said the original ending was written in haste, where Kurtz convinced Willard to join him and together they repelled the air strike on the compound. Coppola said he never fully agreed with Kurtz and Willard dying in fatalistic explosive intensity, preferring to end the film in a more positive way.</p><p>When Coppola originally organized the ending, he considered two significant versions. One had Willard leading Lance by the hand as everyone in Kurtz's base threw down their weapons; Willard then piloted the PBR slowly away from Kurtz's compound, and this final shot was superimposed over the face of a stone idol, which then faded to black. The other version had the base spectacularly blown to bits in an air strike, killing everyone left within it.</p><p>The original 1979 70mm exclusive theatrical release ended with Willard's boat, the stone statue, and the fade to black with no credits, save for '\"Copyright 1979 Omni Zoetrope\"' at its very end. This mirrored the lack of opening titles and supposedly stemmed from Coppola's original intention to \"tour\" the film as one would a play: The credits appeared on printed programs provided before the screening began.</p><p>There have been, to date, many variations of the end credit sequence, beginning with the 35 mm general release, where Coppola elected to show the credits superimposed over shots of the jungle exploding into flames. The explosions were from the detonations of the sets. Rental prints circulated with this ending, and can be found in the hands of a few collectors. Some versions had the subtitle \"A United Artists release\", while others had \"An Omni Zoetrope release\". The network television version of the credits ended with \"... from MGM/UA Entertainment Company\" (as it made its network debut shortly after the merger of MGM and UA). Another variation of the end credits can be seen on both YouTube and as a supplement on the current Lionsgate Blu-ray.</p><p>When Coppola later heard that the audiences interpreted this as an air strike called by Willard, he pulled the film from its 35 mm run and added credits on a black screen. The \"air strike\" footage continued to circulate in repertory theaters well into the 1980s, and was included in the 1980s LaserDisc release. In the DVD commentary, Coppola explains that the images of explosions were not intended as part of the story, but were simply a graphic background he had added for the credits.</p><p>Coppola explained he had shot the explosion footage during demolition of the sets, whose destruction and removal were required by the Philippine government. He filmed the demolition with cameras fitted with different film stocks and lenses to capture the explosions at different speeds. He wanted to do something with the dramatic footage and decided to add them to the credits.</p><h4>Re-release</h4><p>The film was re-released on August 28, 1987, in six cities, to capitalize on the success of Platoon, Full Metal Jacket, and other Vietnam War movies. New 70 mm prints were shown in Los Angeles, San Francisco, San Jose, Seattle, St. Louis and Cincinnati —cities where the film had done well in 1979. It was given the same kind of release as the exclusive 1979 engagement, with no logo or credits, and audiences were given a printed program.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, Apocalypse Now holds an approval rating of 98% based on 98 reviews, with an average rating of 9.00/10. The website's critics consensus reads: \"Francis Ford Coppola's haunting, hallucinatory Vietnam War epic is cinema at its most audacious and visionary.\" Metacritic, which uses a weighted average, assigned the film a score of 94 out of 100 based on 15 critics, indicating \"universal acclaim\".</p><p>Upon its release, Apocalypse Now received mixed reviews. In his original review, Roger Ebert wrote: \"Apocalypse Now achieves greatness not by analyzing our 'experience in Vietnam', but by re-creating, in characters and images, something of that experience.\" and named it \"The best film of 1979\". Ebert concluded by writing: \"What's great in the film, and what will make it live for many years and speak to many audiences, is what Coppola achieves on the levels Truffaut was discussing: the moments of agony and joy in making cinema. Some of those moments occur at the same time; remember again the helicopter assault and its unsettling juxtaposition of horror and exhilaration. Remember the weird beauty of the massed helicopters lifting above the trees in the long shot, and the insane power of Wagner's music, played loudly during the attack, and you feel what Coppola was getting at: Those moments as common in life as art, when the whole huge grand mystery of the world, so terrible, so beautiful, seems to hang in the balance.\" Ebert added Coppola's film to his list of The Great Movies, stating: \"Apocalypse Now is the best Vietnam film, one of the greatest of all films, because it pushes beyond the others, into the dark places of the soul. It is not about war so much as about how war reveals truths we would be happy never to discover.\"</p><p>In his review for the Los Angeles Times, Charles Champlin wrote: 'as a noble use of the medium and as a tireless expression of national anguish, it towers over everything that has been attempted by an American filmmaker in a very long time.' Other reviews were less positive; Frank Rich, writing for Time said: 'While much of the footage is breathtaking, Apocalypse Now is emotionally obtuse and intellectually empty.' Vincent Canby argued: 'Mr. Coppola himself describes it as 'operatic', but ... Apocalypse Now is neither a tone poem nor an opera. It's an adventure yarn with delusions of grandeur, a movie that ends — in the all-too-familiar words of the poet Mr. Coppola drags in by the bootstraps — not with a bang, but a whimper.'</p><p>Commentators have debated whether Apocalypse Now is an anti-war or pro-war film. Some evidence of the film's anti-war message includes the purposeless brutality of the war, the absence of military leadership, and the imagery of machinery destroying nature. Advocates of a pro-war stance view these same elements as a glorification of war and the assertion of American supremacy. According to Frank Tomasulo, 'the US foisting its culture on Vietnam', including the destruction of a village so that soldiers could surf, affirms the film's pro-war message. Anthony Swofford recounted how his marine platoon watched Apocalypse Now before being sent to Iraq in 1990 to get excited for war. Nidesh Lawtoo illustrates the ambiguity of the film by focusing on the contradictory responses the movie in general – and the \"Ride of the Valkyries\" scene in particular – triggered in a university classroom. According to Coppola, the film may be considered anti-war, but is even more anti-lie: '... the fact that a culture can lie about what's really going on in warfare, that people are being brutalized, tortured, maimed, and killed, and somehow present this as moral is what horrifies me, and perpetuates the possibility of war'. In 2019, however, Coppola told Kevin Perry of The Guardian that he hesitated to call the film anti-war, stating \"... an anti-war film, I always thought, should be like The Burmese Harp – something filled with love and peace and tranquillity and happiness. It shouldn't have sequences of violence that inspire a lust for violence. Apocalypse Now has stirring scenes of helicopters attacking innocent people. That's not anti-war.\"</p><p>In May 2011, a new restored digital print of Apocalypse Now was released in UK cinemas, distributed by Optimum Releasing. Total Film magazine gave the film a five-star review, stating: 'This is the original cut rather than the 2001 'Redux' (be gone, jarring French plantation interlude!), digitally restored to such heights you can, indeed, get a nose full of the napalm.'</p><h4>Box office</h4><p>Apocalypse Now performed well at the box office when it opened on August 15, 1979. It initially opened in three theaters in New York City, Toronto, and Hollywood, grossing $322,489 in its first five days. It grossed over $40 million domestically, with a worldwide total of over $100 million.</p><br/><h3>Legacy</h3><p>Today, the movie is regarded by many as a masterpiece of the New Hollywood era. Roger Ebert considered it the finest film on the Vietnam War and included it on his list for the 2002 Sight & Sound poll for the greatest movie of all time. In the 2002 Sight & Sound director's poll of the \"greatest films of all time\", it was ranked No. 19. It is on the American Film Institute's 100 Years...100 Movies list at number 28, but dropped to number 30 on their 10th anniversary list. Kilgore's quote, \"I love the smell of napalm in the morning\", written by Milius, was number 12 on the AFI's 100 Years ... 100 Movie Quotes list and was also voted the greatest movie speech of all time in a 2004 poll. In 2006, Writers Guild of America ranked the screenplay, by John Milius and Francis Ford Coppola, the 55th greatest ever. It is number 7 on Empire's 2008 list of the 500 greatest movies of all time. Empire re-ranked it at #20 in their 2014 list of The 301 Greatest Movies of All Time, and again at #22 on their 2018 list of The 100 Greatest Movies. It was voted No. 66 on the list of \"100 Greatest Films\" by the prominent French magazine Cahiers du cinéma in 2008. In 2010, The Guardian named Apocalypse Now \"the best action and war film of all time\". In 2016, The Hollywood Reporter ranked it 11th among 69 winners of the Palme d'Or. The New York Times included it on its Best 1000 Movies Ever list. Entertainment Weekly ranked it as having one of the \"10 Best Surfing Scenes\" in cinema.</p><p>In 2002, Sight and Sound magazine invited several critics to name the best film of the last 25 years, and Apocalypse Now was named number one. It was also listed as the second-best war film by viewers on Channel 4's 100 Greatest War Films, and was the second-best war movie of all time based on the Movifone list (after Schindler's List) and the IMDb War movie list (after The Longest Day). It is ranked number 1 on Channel 4's 50 Films to See Before You Die. In a 2004 poll of UK film fans, Blockbuster listed Kilgore's eulogy to napalm as the best movie speech. The helicopter attack scene with the Ride of the Valkyries soundtrack was chosen as the most memorable film scene ever by Empire magazine. (The scene is recalled in one of the last acts of the 2012 video game Far Cry 3, when the music is played while the character shoots from a helicopter. It was likewise adapted for the Cat's Eye anime episode \"From Runan Island with Love\" and the Battle of Italica scene in Gate: Jieitai Kano Chi nite, Kaku Tatakaeri.)</p><p>In 2009, the London Film Critics' Circle voted Apocalypse Now the best film of the last 30 years. It was also included in BBC's 2015 list of the 100 greatest American films.</p><p>In 2011, actor Charlie Sheen, son of the film's leading actor Martin, started playing clips from the film on his live tour and played the film in its entirety during post-show parties. One of Sheen's films, the 1993 comedy Hot Shots! Part Deux, includes a brief scene where Charlie is riding a boat up a river in Iraq while on a rescue mission and passes Martin, as Captain Willard, going the other way. As they pass, each man shouts to the other \"I loved you in Wall Street!\", referring to the 1987 film that featured both of them. Additionally, the promotional material for Hot Shots! Part Deux included a mockumentary that aired on HBO titled Hearts of Hot Shots! Part Deux—A Filmmaker's Apology, a parody of the 1991 documentary Hearts of Darkness: A Filmmaker's Apocalypse about the making of Apocalypse Now.</p><p>The film is credited with creating the Philippines surfing culture around the town of Baler, where the helicopter attack and surfing sequences were filmed.</p><p>On January 25, 2017, Coppola announced that he was seeking funding through Kickstarter for a horror role-playing video game based on Apocalypse Now. It was later canceled by Montgomery Markland, the game's director, as revealed on its official Tumblr page.</p><p>The Sympathizer, a Pulitzer Prize-winning novel by Vietnamese-American author Viet Thanh Nguyen, features a subplot that Nguyen describes as a critique of Apocalypse Now. He told the New York Times that \"Apocalypse Now is an important work of art, but that doesn't mean I'm going to bow down before it. I'm going to fight with it because it fought with me.\" He said that the film centered on American perspectives of the war rather than Vietnamese experiences. He was especially critical of the scene where all the passengers of a boat were unjustly killed by the traveling party: \"People just like me were being slaughtered. I felt violated.\"</p><p>The Seiko 6105 and its subsequent reissues have been nicknamed the \"Captain Willard\", in reference to its use by the eponymous character.</p><br/><h3>Awards and honors</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Awards and Nominations received by Apocalypse Now</caption><tbody><tr><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th></tr><tr><td rowspan=\"8\"><span>52nd Academy Awards</span></td><td><span>Best Picture</span></td><td><span>Francis Ford Coppola</span>, <span>Fred Roos</span>, <span>Gray Frederickson</span>, and Tom Sternberg</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor in a Supporting Role</span></td><td><span>Robert Duvall</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Writing – Screenplay Based on Material from Another Medium</span></td><td><span>John Milius</span> and Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Art Direction</span></td><td>Art Direction: <span>Dean Tavoularis</span> and <span>Angelo P. Graham</span>; Set Decoration: <span>George R. Nelson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td><span>Vittorio Storaro</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Film Editing</span></td><td><span>Richard Marks</span>, Walter Murch, <span>Gerald B. Greenberg</span> and <span>Lisa Fruchtman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound</span></td><td><span>Walter Murch</span>, <span>Mark Berger</span>, <span>Richard Beggs</span>, and <span>Nat Boxer</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>1979 Cannes Film Festival</span></td><td><span>Palme d'Or</span></td><td><i>Apocalypse Now</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"9\"><span>33rd British Academy Film Awards</span></td><td><span>Best Film</span></td><td><i>Apocalypse Now</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Actor</span></td><td>Martin Sheen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Robert Duvall</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Direction</span></td><td>Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Best Original Film Music</span></td><td><span>Carmine Coppola</span> and Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Cinematography</span></td><td>Vittorio Storaro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Editing</span></td><td>Richard Marks, Walter Murch, Gerald B. Greenberg, and Lisa Fruchtman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Production Design</span></td><td>Dean Tavoularis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Soundtrack</span></td><td>Nathan Boxer, Richard Cirincione, Walter Murch</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>5th César Awards</span></td><td><span>Best Foreign Film (Meilleur film étranger)</span></td><td>Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>David di Donatello</span> Awards</td><td><span>Best Foreign Director (Migliore Regista Straniero)</span></td><td>Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>32nd Directors Guild of America Awards</span></td><td><span>Outstanding Directorial Achievement in Motion Pictures</span></td><td>Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>37th Golden Globe Awards</span></td><td><span>Best Motion Picture – Drama</span></td><td>Francis Ford Coppola, Fred Roos, Gray Frederickson, and Tom Sternberg</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Director</span></td><td>Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actor</span></td><td>Robert Duvall</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Original Score</span></td><td>Carmine Coppola and Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>22nd Annual Grammy Awards</span></td><td><span>Best Original Score Written for a Motion Picture</span></td><td>Carmine Coppola and Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>1979 National Society of Film Critics Awards</span></td><td><span>Best Supporting Actor</span></td><td><span>Frederic Forrest</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>32nd Writers Guild of America Awards</span></td><td><span class=\"mw-redirect\">Best Drama Written Directly for the Screen</span></td><td>John Milius and Francis Ford Coppola</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>London Film Critics' Circle</span> Awards</td><td><span>Film of the Year</span></td><td>Francis Ford Coppola</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><ul><li>AFI's 100 Years...100 Movies – No. 28</li><li>AFI's 100 Years...100 Movie Quotes: \"I love the smell of napalm in the morning.\" – No. 12</li><li>\"I love the smell of napalm in the morning.\" – No. 12</li><li>AFI's 100 Years...100 Movies (10th Anniversary Edition) – No. 30</li></ul><br/><h3>Other versions</h3><h4>Apocalypse Now Redux</h4><p>In 2001, Coppola released Apocalypse Now Redux in cinemas and subsequently on DVD. This is an extended version that restores 49 minutes of scenes cut from the original film. Coppola has continued to circulate the original version as well: the two versions are packaged together in the Complete Dossier DVD, released on August 15, 2006, and in the Blu-ray edition released on October 19, 2010.</p><p>The longest section of added footage in the Redux version is the \"French Plantation\" sequence, a chapter involving the de Marais family's rubber plantation, a holdover from the colonization of French Indochina, featuring Coppola's two sons Gian-Carlo and Roman as children of the family. Around the dinner table, a young French child recites a poem by Charles Baudelaire entitled L'albatros. The French family patriarch is not satisfied with the child's recitation. The child is sent away. These scenes were removed from the 1979 cut, which premiered at Cannes. In behind-the-scenes footage in Hearts of Darkness, Coppola expresses his anger, on the set, at the technical limitations of the scenes, the result of shortage of money. At the time of the Redux version, it was possible to digitally enhance the footage to accomplish Coppola's vision. In the scenes, the French family patriarchs argue about the positive side of colonialism in Indochina and denounce the betrayal of the military men in the First Indochina War. Hubert de Marais argues that French politicians sacrificed entire battalions at Điện Biên Phủ, and tells Willard that the US created the Viet Cong (as the Viet Minh) to fend off Japanese invaders.</p><p>Other added material includes extra combat footage before Willard meets Kilgore, a scene in which Willard's team steals Kilgore's surfboard (which sheds some light on the hunt for the mangoes), a follow-up scene to the dance of the Playboy Playmates, in which Willard's team finds the Playmates stranded after their helicopter has run out of fuel (trading two barrels of fuel for two hours with the Bunnies), and a scene of Kurtz reading from a Time magazine article about the war, surrounded by Cambodian children.</p><p>A deleted scene titled \"Monkey Sampan\" shows Willard and the PBR crew suspiciously eyeing an approaching sampan juxtaposed to Montagnard villagers joyfully singing \"Light My Fire\" by The Doors. As the sampan gets closer, Willard realizes there are monkeys on it and no helmsman. Finally, just as the two boats pass, the wind turns the sail and exposes a naked dead Viet Cong (VC) nailed to the sail boom. His body is mutilated and looks as though the man had been flogged and castrated. The singing stops. As they pass on by, Chief notes out loud, \"That's comin' from where we goin', Captain.\" The boat then slowly passes the giant tail of a shot down B-52 bomber as the noise of engines high in the sky is heard. Coppola said that he made up for cutting this scene by having the PBR pass under an aircraft tail in the final cut.</p><h4>First Assembly</h4><p>A 289-minute First Assembly circulates as a video bootleg, containing extra material not included in either the original theatrical release or the \"redux\" version. This cut of the film does not feature Carmine Coppola's score, instead using several Doors tracks.</p><h4>Apocalypse Now Final Cut</h4><p>In April 2019, Coppola showed Apocalypse Now Final Cut for the 40th anniversary screening at the Tribeca Film Festival. This new version is Coppola's preferred version of the film and has a runtime of three hours and three minutes, with Coppola having cut 20 minutes of the added material from Redux; the scenes deleted include the second encounter with the Playmates, parts of the plantation sequence, and Kurtz's reading of Time magazine. It is also the first time the film has been restored from the original camera negative at 4K; previous transfers were made from an interpositive. It was released in autumn 2019, along with an extended cut of The Cotton Club. It also had a release in select IMAX theaters on August 15 and 18, 2019, in a collaboration between IMAX and Lionsgate.</p><br/><h3>Home media</h3><p>Lionsgate released a 6-disc 40th anniversary edition on August 27, 2019. It includes two 4K Ultra HD Blu-ray discs and four standard Blu-ray discs, containing the theatrical version, Redux, and the Final Cut featuring 4K restorations from the original camera negative. Previous extras (including the Hearts of Darkness documentary) have been re-used for this release, along with brand new content including a Tribeca Film Festival Q&A with Francis Ford Coppola and Steven Soderbergh and never-before-seen B-roll footage.</p><br/><h3>Documentaries</h3><p>Hearts of Darkness: A Filmmaker's Apocalypse (American Zoetrope/Cineplex Odeon Films) (1991) Directed by Eleanor Coppola, George Hickenlooper, and Fax Bahr</p><p>Apocalypse Now – The Complete Dossier DVD (Paramount Home Entertainment) (2006). Disc 2 extras include:</p><ul><li>The Post Production of Apocalypse Now: Documentary (four featurettes covering the editing, music, and sound of the film through Coppola and his team) \"A Million Feet of Film: The Editing of Apocalypse Now\" (18 minutes). Written and directed by Kim Aubry. \"The Music of Apocalypse Now\" (15 minutes) \"Heard Any Good Movies Lately? The Sound Design of Apocalypse Now\" (15 minutes) \"The Final Mix\" (3 minutes)</li><li>\"A Million Feet of Film: The Editing of Apocalypse Now\" (18 minutes). Written and directed by Kim Aubry.</li><li>\"The Music of Apocalypse Now\" (15 minutes)</li><li>\"Heard Any Good Movies Lately? The Sound Design of Apocalypse Now\" (15 minutes)</li><li>\"The Final Mix\" (3 minutes)</li></ul><br/>"
  },
  "errorMessage": ""
}