{
  "imDbId": "tt5311514",
  "title": "Your Name.",
  "fullTitle": "Your Name. (2016)",
  "type": "Movie",
  "year": "2016",
  "items": [
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3631865",
      "warningSpoilers": false,
      "date": "2 February 2017",
      "rate": "10",
      "helpful": "368 out of 400 found this helpful.",
      "title": "could be the greatest love story of all time",
      "content": "In truth, the most competitive area of fiction is not invasions from outer space or talking dogs or impossible missions but rather the most basic narrative of all, the love story.And this is also the most overcrowded field, and the most difficult to do right.This film, this story, is extraordinary. It reminds me of MY SASSY GIRL, a love story from Asia that captured the imagination of the world and has almost become a franchise, it's been copied so many times.It also brings to mind Richard Matheson's classic BID TIME RETURN, another love story for the ages that uses time juxtaposition. (Done as the movie SOMEWHERE IN TIME, 1980).I already gave this the highest rating on the IMDb.The animation is stunning and complimentary to this one-of-a-kind tale.All things considered, I would like to avoid the ongoing arguments about which Japanese animation studio is better, or worse, than the other.I prefer to simply be grateful that Japanese anime exists at all, because I cannot imagine any other country producing something this moving, this powerful, in graphic form.((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3595213",
      "warningSpoilers": false,
      "date": "9 December 2016",
      "rate": "10",
      "helpful": "209 out of 238 found this helpful.",
      "title": "Once seen, never forgotten- truly magnificent",
      "content": "'Your Name' is not just one of the best animes in recent years (and there have been some very good ones), but one of the best animes ever from personal opinion.Will go even further, saying it's one of the best animated films in recent years, one of the best animated or otherwise films of the year and that it rivals the masterworks of Miyazaki. This is a huge compliment, for any anime, animated film or even any film, and a bold claim that still stands. Much of it is to do with how 'Your Name's' stayed with me and the impact it's had, a film once seen but never forgotten.The animation in 'Your Name' is stunning, so beautifully and intricately drawn with immaculate attention to detail in the backgrounds and a simply breath-taking array of ethereal but also atmospheric colours. The music fits the film's atmosphere with no problem at all and also works wonders as a soundtrack on its own, serving superbly as music on its own.Meanwhile, the script is thought-provoking and touching, with much to say and explored expertly and neatly with no heavy-handedness. The storytelling engages throughout, sucks one into its world and never lets go of the immersing and is enormously heartfelt, really investing in the characters' chemistry and their love for each other. Pacing is deliberate, but never drags due to the emotional impact and how well realised the characters are, even when noticeably slower in the second half.Characters, and the film's themes, are brilliantly written and developed, and the voice acting is emotive and fit the characters with no qualms.In summary, a truly magnificent film all round that will be remembered for years to come. Deserves all the raves it's gotten, and deserving of even more. 10/10 Bethany Cox"
    },
    {
      "username": "jbbianchino",
      "userUrl": "https://www.imdb.com/user/ur47156081",
      "reviewLink": "https://www.imdb.com/review/rw4056344",
      "warningSpoilers": false,
      "date": "8 February 2018",
      "rate": "10",
      "helpful": "446 out of 474 found this helpful.",
      "title": "Forget Disney! We have movies like Your Name.",
      "content": "Your Name is just a good movie. This movie felt long, but not too long. All the way through, I was asking what would happen next. It was clever, emotional, and left me crying after the movie. The twist was done really well, and I almost wanted to pause the movie. Also, the animation is gorgeous. You get to see detailed images from many angles and perspectives, and there were hundreds of animators! The credits didn't start out with the cast like it usually would. The first thing you saw after a black screen was hundreds of names of animators and designers. I watched this movie again and I still felt my muscles ready to let tears out. I would not recommend this movie any less than the next guy, so what are you waiting for? Get a couple of friends and watch Your Name!"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3854060",
      "warningSpoilers": true,
      "date": "10 November 2017",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Your Name",
      "content": "This delightful Japanese animation follows two strangely interlinked lives; Mitsuha, a high school girl living in a rural area of Japan, and Taki, a similarly aged boy in Tokyo. They have never met but they somehow start switching places in their dreams. At first each thinks they are having strange but very realistic dreams but the following day as the 'dream' fades they are surprised when friends and family tell them that they had been behaving oddly the day before; not recognising anybody and not knowing where they are meant to be then each finds a note from the other. They continue to swap days until suddenly it stops Taki can't recall many details but he has a memory of the place Mitsuha lived and is drawn to find her. Armed with a sketch of the location he finds the village and learns a shocking truth it had been destroyed in a natural disaster three years previously and Mitsuha was amongst the five hundred people who died! He is determined to find a way to swap places again so he can save her.Anybody who has seen previous films from director Makoto Shinkai will immediately recognise the beautiful style of the artwork, with incredibly detailed backgrounds. Of course a good film must do more than 'look good' and this succeeds there too; the first half is a fun introduction to the characters and their situation. This is done with plenty of humour; the fact that they find themselves in bodies of the opposite gender is quickly handled in an amusing but not a crude manner. There are lots of delightful details such as while swapped they talk in different dialects and Taki talks like a girl of course this is better appreciated if you speak Japanese but is explained so non-Japanese speakers (like me) can realise that it is happening. The events that take place half way through the film come as quite a surprise and suddenly change to tone of the film. As Taki tries to find a way to save Mitsuha and her village it is far from obvious that he will be successful. Overall I'd certainly recommend this to older fans of good animation; the content isn't really unsuitably for younger viewers but it would probably be a bit confusing.These comments are based on watching the film in Japanese with English subtitles; an English dub is also available on the DVD I bought."
    },
    {
      "username": "SpoilerAlertReviews",
      "userUrl": "https://www.imdb.com/user/ur9021307",
      "reviewLink": "https://www.imdb.com/review/rw3587694",
      "warningSpoilers": false,
      "date": "27 November 2016",
      "rate": "10",
      "helpful": "92 out of 106 found this helpful.",
      "title": "Cosmically enchanting, touching and visually beautiful.",
      "content": "It's been a while since I've seen something outside of Studio Ghibli, being the most recent When Marnie Was There. I'm not familiar with Makoto Shinkai's work but this certainly encourages me to watch the rest of his catalog. I knew nothing about the film until only the day before seeing it, instantly attracted to the poster and the mini synopsis of two high school teens from opposite sides of the country, who periodically switch in their dreams. Gladly I didn't read anymore into it and just went to watch it as there's so much more to the intriguing story at face value. It's a little confusing at times bouncing between the two characters, but that doesn't deter the enjoyment and wonderment of the film. We follow quiet country school girl Mitsuha voiced by Mone Kamishiraishi, going about her daily chores and traditions in a village shrouded by folklore and superstition with mayor-elect pushing for advancement. All this while we also follow rough-and-ready city boy, Taki, voiced by Ryûnosuke Kamiki, who is no stranger to voice acting, starring in Spirited Away at the age of eight and later in Howl's Moving Castle. The two become celestially bound to one another without fully understanding how, or even knowing who each other are, which leads them both on an adventure of discovery, comical annoyance and eventual romance. It's perfectly balanced between the two even with a number of interesting side characters, each adding something to the intricacies of the plot and supplying a lot of the light-hearted comedy. The scenery and animation is stunning, vibrant and beautifully breathtaking; with blinding lens flares and gorgeous landscapes that fill the entirely screen. It's superbly paced, perfectly edited so not to make a mess of the constant jumps. The score by the Japanese rock band, Radwimps is simply amazing, perfect for the film with a mixture of teeny pop/rock and pleasant instrumentals, with surprising tracks like \"Kataware Doki\" using soft pianos and strings. It's a score Final Fantasy composer, Nobuo Uematsu would be proud of. There are some films that are not meant to be for live action, showcasing the stunning craftsmanship and elegant talent of the skilled animators and artists, this being one of those films. The actual anime capturing the magical essence of the heartfelt story that I don't believe can be replicated as good live. Cosmically enchanting, touching and visually beautiful. Certainly the best anime I've seen this year. Running Time: 9 The Cast: 9 Performance: 9 Direction: 10 Story: 10 Script: 10 Creativity: 10 Soundtrack: 9 Job Description: 10 The Extra Bonus Points: 10 for being such a wonderful, beautiful, romantic story, magical in every sense. Would I buy the Bluray?: Definitely 96% 10/10"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3709302",
      "warningSpoilers": true,
      "date": "16 May 2017",
      "rate": "9",
      "helpful": "43 out of 50 found this helpful.",
      "title": "You wonder HOW the Academy didn't nominate this lovely picture...",
      "content": "A few months ago when they announced the Oscar nominations for 2017, I was very surprised to see the French film, \"The Red Turtle\", among the nominees for Best Animated Feature. After all, this strange film featured a plot involving a man who falls in love with a woman who used to be a turtle.and has also earned less than a million dollars at the box office worldwide. At the same time, the Japanese animated film, \"Your Name.\", earned over $350,000,000setting box office records throughout Asia for a Japanese animated movie. It has even earned more than any of the films from the terrific Studio Ghibli.home of the legendary Hayao Miyazaki!Fortunately, \"Your Name.\" is now playing in select markets throughout the United States and I was in Philadelphia this week.where I jumped at a chance to finally see this record-breaking yet inexplicably snubbed movie. If it's playing near you, I suggest you consider also seeing this lovely and rather adult picture. Now when I say 'rather adult', I do not mean it has any objectionable content. However, parents should understand that just because it is a cartoon does not mean that younger children should see it. They simply could not be expected to follow the plot, as the film is complex and clearly designed for teens and adults.As to the story, for some time it's a tad confusing.and that's okay as it will eventually all come together. It seems that Mitsuha and Taki are somehow psychically linked. When Taki goes to sleep, he finds himself as Mitsuha.which is a bit embarrassing for him since he is a teenage guy and Mitsuha is a teenage girl! But why.why is he experiencing Mitsuha's life? And, the strange part is that he soon learns that what he's experiencing happened several years ago!! And what does a comet have to do with this as well? How can Taki's strange dreams possibly save Mitusha and her small village? I'd say more, but don't want to reveal too much about the story.The quality of this film is very, very nice. I would not say that the animation is quite as good as a typical Ghibli picture, but it is close. But what makes this a delightful film are that it never tries to be cute or formulaic.it's a wholly unique viewing experience. It also is very well written and kept my interesteven though I was suffering jetlag! I saw the film in Japanese with subtitles, though the theater and many others are showing an English dubbed version as well. So, in this case, I actually had the choice which I wanted to seewhich was very unusual."
    },
    {
      "username": "Xstal",
      "userUrl": "https://www.imdb.com/user/ur4103165",
      "reviewLink": "https://www.imdb.com/review/rw6219038",
      "warningSpoilers": false,
      "date": "30 October 2020",
      "rate": "8",
      "helpful": "16 out of 17 found this helpful.",
      "title": "As Deep as the Mariana Trench...",
      "content": "... and as intricately woven from an abstract and mysterious loom. Using spectacular animation to draw in the viewer and steal their attention this story of finding love, of finding it in yourself and others, may well have you occasionally scratching your head. Don't worry, you're not alone, but there are plenty of resources online that can help you recompile what you've just consumed in order to make more sense of this beautiful, enchanting and imaginative Japanese composition."
    },
    {
      "username": "malcydon",
      "userUrl": "https://www.imdb.com/user/ur61747040",
      "reviewLink": "https://www.imdb.com/review/rw3541256",
      "warningSpoilers": false,
      "date": "10 September 2016",
      "rate": "10",
      "helpful": "243 out of 296 found this helpful.",
      "title": "Yes, yes and yes!",
      "content": "Absolutely fantastic! Recommended for everyone.Just watch it.Amazing characters, scenery, city life and town life, story. Everything is just wow. So fine! The suspension, the empathy, the scenes. The thoughts. It's playful and pleasant, but serious and funny at the same time. It makes you want to feel it and live it, while you just keep cheering for everything.This 1.5 hours was one of the most well spent time in my life. It was so good, that I actually sit down and wondered why we can't we live like that? Why can't we be in that village? In that anime Tokyo?Every minute is a time well-spent. It's a time SO well spent, that I was afraid when it's going to end. I literally just realized that this would be the end of an anime. Than this would be the end of an hour long movie.I was so afraid when it's going to end. It borough such a beautiful and marvelous utopia before my eyes, with all it's mistakes, conflicts. That I actually wanted to live there. I actually realized however, that I'm not good of a person to be worthy of such utopia.However it is very close to reality. Every time something out of order happens, you remember. This is a certain reality. People can die, be ashamed, punished. Everything can end in a tragedy. But when something wrong happens, nobody really cares.. and I was like: \"Why? Why aren't you moving? Are you not afraid for your lives?\" Than I remembered.. this is a certain utopia. Even for the people who live in it. Nothing bad happen to them, nothing really could. They are peaceful, good people, in a modern world. Nothing bad happened in the last 3 generation, why would anything happen now?This movie gave me a new set of feelings, viewpoints, happiness, thoughts and desires, I might have lacked or just not realized before. I'm really glad I watched it. It was a piece from my dreams."
    },
    {
      "username": "itsnemra",
      "userUrl": "https://www.imdb.com/user/ur60531163",
      "reviewLink": "https://www.imdb.com/review/rw3540622",
      "warningSpoilers": false,
      "date": "9 September 2016",
      "rate": "10",
      "helpful": "216 out of 244 found this helpful.",
      "title": "I am speechless.",
      "content": "So the movie is named \"Your name?\" and its a perfect title, it doesn't reveal anything about the content and yet it caught my interest. I tend to watch animated movies because they have so much more to offer at the same time it is a tougher competition.The story line is really good, why? Well it you are open minded it will be pretty easy to follow and accept what is going on, question about how and why get answered by themselves if you believe it is possible. Regarding the animation it give you what your mainstream point of view of Japans architecture, nature, culture and society, all from how they dress to the body language etc. The music, sound effects and voice actor/actress amplifies the emotions and guides you from start till end. There are plenty of a messages and it makes me thing about me and everything living around me, where I come from and where I am going. Regarding the character development its spot on, no more information was needed then what was provided, we are limited but at the same time free to make our own thought.I wish to say thank you to everyone who have supported and/or worked with this piece of art, they should feel really proud of themselves, it is an honor that you shared it with us (the viewers). Thank you!"
    },
    {
      "username": "yuschaa",
      "userUrl": "https://www.imdb.com/user/ur68430481",
      "reviewLink": "https://www.imdb.com/review/rw3550527",
      "warningSpoilers": false,
      "date": "25 September 2016",
      "rate": "9",
      "helpful": "96 out of 115 found this helpful.",
      "title": "What seems to be a silly premise evolved into something even more trifling. But with its unbearable charm, it worked astonishingly well.",
      "content": "Your Name (Kimi No Na Wa) tells the story of two teenagers with vastly different backgrounds. One is a boy who lived in Tokyo and has the word \"city\" described all around him. One is a girl who lived in rural town far from technology and anything interesting. One morning, somehow, they found out that they have swapped bodies. Together, they must help each other find solution in daily life problems, and solve the mystery of the reason why this whole conundrum started.This may sound like your typical body-swap romantic comedy situation, but you may find yourself on the wrong side of the spectrum as this movie takes you into an incredible journey. With a storytelling so divine, complex, yet understandable, this movie captures the essence of what romantic comedy movies have lost nowadays, a heart and a charm to lure you in.Japanese animation movies tend to have a bit of a stereotype, but the movie successfully shown very little of that. Transitioning from one scene to the other effortlessly, Radwimps deserves an incredible applause for their talents in the movie, as every song and every score fits perfectly to the scene currently shown.Although the movie does end in a predictable way, the voyage to that predictable end is more than enough to keep you satisfied. There are some usage of stock characters and several clichés throughout, something that maybe will drive some of the audiences away or cloud their judgment. But beside all that, the story is still original and well executed.What seems to be a silly premise evolved into something even more trifling. But with its unbearable charm, it worked astonishingly well."
    },
    {
      "username": "muknenesti",
      "userUrl": "https://www.imdb.com/user/ur101175632",
      "reviewLink": "https://www.imdb.com/review/rw4756919",
      "warningSpoilers": false,
      "date": "1 April 2019",
      "rate": "9",
      "helpful": "188 out of 208 found this helpful.",
      "title": "Unforgettable",
      "content": "May I ask you a favor?Please boycott the inevitable American remake. I know that Kimi No Na Wa made a lot of money so therefore I know automatically that the remake will come and it will be a Hollywood con job (think Ghost In The Shell SHUDDER).Kimi No Na Wa to me is an extremely well written and well thought story with amazing visuals. The bond between the characters, even in animation was something else. It was beautiful.The world does not need an American remake."
    },
    {
      "username": "twf-37243",
      "userUrl": "https://www.imdb.com/user/ur84931318",
      "reviewLink": "https://www.imdb.com/review/rw4047205",
      "warningSpoilers": false,
      "date": "29 January 2018",
      "rate": "",
      "helpful": "372 out of 410 found this helpful.",
      "title": "One of the greatest human stories ever...",
      "content": "From an anime nonetheless.Much has been said about this great animation and most of it is true. It is beautiful, tender, modern (watch the film and you will understand) and makes human love interesting again.With that said, it is too bad that Hollywood has picked this up. Not that I will be watching that remake, but I cringe already at the thought of Hollywood hack and remake specialist giving this an American swirl. All the cliches of bad remaking and safe corporate changes will be applied. Aaaarrrggghh"
    },
    {
      "username": "kevinxip",
      "userUrl": "https://www.imdb.com/user/ur68216670",
      "reviewLink": "https://www.imdb.com/review/rw3555057",
      "warningSpoilers": false,
      "date": "3 October 2016",
      "rate": "10",
      "helpful": "154 out of 182 found this helpful.",
      "title": "One of the Greatest movies i watched in my entire life.",
      "content": "I have followed Makoto Shinkai's older works and most of them really have a bad ending, though still good, but this movie's sweet. He really know how to play with our emotion, especially for his work's fans who have followed his works, i'm hoping its not a bad ending during the entire movie.But man, this work is a true masterpiece. When i looked at Makoto's older works, I suddenly think, he had the potential to beat Miyazaki's spirited away, and there he goes. I'm not saying this is better than spirited away, they had a different genre and makoto had his own stunning style.How this piece of animation would turn my emotion really hard? Even Spirited Away, When Marnie was There, and 5cm per second can't do that. This is a movie that you must watch before you die, really."
    },
    {
      "username": "DoubleCshinobi",
      "userUrl": "https://www.imdb.com/user/ur35558159",
      "reviewLink": "https://www.imdb.com/review/rw3523583",
      "warningSpoilers": false,
      "date": "11 August 2016",
      "rate": "10",
      "helpful": "355 out of 401 found this helpful.",
      "title": "Phenomenal",
      "content": "Kimi no Nawa is up there with the quality of work Studio Ghibli makes. It's a journey in a world breathing with atmosphere, mystery, and visual wonder. A journey about growth and resilience in the face of overwhelming odds. A journey about human emotion that transcends space and time, as we watch our two protagonists struggle relentlessly against fate. A journey that might just be one of the most captivating anime movie experiences I've had in years. Director Makoto Shinkai's artistry is something people tend to love or hate, but this film is solid proof to all of his disdainful critics that his movies were never \"just eye candy\". They explore the nature of life and relationships in quiet ways rarely seen or discussed, which is why most of them are not fast-paced or action packed...and why they are so beautiful. But even if you're not a fan of this kind of style with its major use of metaphorical imagery and mixture of subtle and explosive emotions, definitely give Kimi no Nawa a chance. This is by far his most ambitious, original movie in many ways. For instance, there's an actual mystical element to the story apart from his previous films that are set purely on realism. The pacing is a lot faster and intense. There's a surprising amount of humor in the script, making the chemistry between the characters more light-hearted and comically entertaining than expected. All of this is done through a narrative vision so emotional, so brilliantly realized, that I'm pretty sure everyone at the Anime Expo world premiere screening was tearing up, including me. Without spoiling, what mainly drives this film's story is the dynamics of our main characters' relationship. The way these two interact is just so unique and lovable. The premise itself allows them to bond on a more personal level, far more intriguing than the usual teenage love story where boy meets girl, boy likes girl, boy gets girl. Eventually, you become so invested in their strange relationship, that when all the action goes down, it's no longer just suspenseful - it's almost heartbreaking. Editing and sound design play a HUGE role in this immersion. There's rarely a single dull moment because of how gripping and emotionally driven the timing of every cut is. The sound design combined with a beautiful music score is outstanding - subtle and moving when creating atmosphere, powerful at times of dramatic conflict. In fact, the same can be said for pretty much all of the visual aesthetics - which if I haven't already mentioned, are amazing. This is a prime example of astonishingly jaw-dropping animation combined with powerful storytelling.Kimi no Nawa is not just any anime movie. It has the potential to be viewed and studied as art cinema. It's so beautifully crafted and meticulously detailed, I feel like I didn't even cover 80% of its greatness in this review. To do that, I would have to make a spoiler analysis review, and to do that, I would probably have to see the movie again, maybe a couple more times before I can fully appreciate this nearly flawless masterpiece. I know I sound like I'm fanboying, but as a film student and anime fan for many years, I'm being fully honest here - if Director Makoto Shinkai keeps this kind of quality up, he is going to be an even bigger name in the anime industry for years to come. Remember Your Name long enough until it's available in your country, if you're not seeing it in Japan theaters. Because trust me, you're not going to forget it. 10/10"
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw4089279",
      "warningSpoilers": false,
      "date": "12 March 2018",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Wistful, poignant and ultimately uplifting; beautifully animated and wonderfully inventive.",
      "content": "There's a distinct and slightly jarring protagonist switch just far enough in for you to really notice it, but it's a testament to 'Your Name (2016)' that - though it could have been ironed out relatively easily with some structural smoothing or a slightly simpler two-handed approach - this is perhaps its only real issue and it isn't even all that detrimental, considering that it allows us to develop a proper emotional connection to both leads from an internal perspective, actually mirroring the fantastical conceit driving the beautifully animated and wonderfully inventive narrative. The piece is a joy to watch and takes a number of turns that are genuinely unexpected. It's a wistful, soulful and poignant experience that's also an entertaining and, ultimately, uplifting one. It does seem to say something quite profound while always managing to delight and mystify with its deftly handled story and properly stirring themes. 8/10"
    },
    {
      "username": "boclani",
      "userUrl": "https://www.imdb.com/user/ur49615147",
      "reviewLink": "https://www.imdb.com/review/rw3595066",
      "warningSpoilers": false,
      "date": "8 December 2016",
      "rate": "10",
      "helpful": "47 out of 57 found this helpful.",
      "title": "why YOUR NAME is the best animated movie of the last five years",
      "content": "Your Name is a journey about growth and having the ability to bounce back when thrown against overpowering hardships. It's a journey that focuses on human emotion that are larger than time and space. It's a journey of where we watch our protagonists struggle again and again against destiny. And it's one of the greatest animated journeys you will ever experience.Watch the review at https://www.youtube.com/watch?v=p7v32c900F4 and / or read along hereYour Name follows a girl from the country and a boy from the city who have never met that switch bodies when they dream. This movie may seem like your romantic-comedy body-swap situation. But it will surprise you how in depth the gets. The storytelling here is top notch, because you understand everything, but when you think about it, the concept gets quite confusing, but because of the brilliant direction my Shinkai, he somehow makes it understandable. The two protagonists are the driving force of the film instead of Shinkai's normal eye candy visual sell outs. Within the great writing are actually some very funny and memorable conversations. The comedy works well to add another layer to the great chemistry between the protagonists. Props to the actors.It was just so fun watching the dynamic feelings of these two and I loved how the two genders figured each other out while inhabiting the others' body. I was a little confused when a lot of the first act is dedicated to the girl, without really seeing the movie from the boy she's swapping with, his view. But the movie surprised me when something happened to the girl and we see the boy for most of the rest of the movie. So actually the screen time for both protagonists were quite similar. That blew me away.If you delve deep into his work Shinkai tends to break the forth wall often in the way he portrays emotions. He, in a way, makes you reflect upon your own life, and all his movies are really, really relatable. He makes you look back on dark times, times you don't really want to think about again and he says a different messages every movie. A big part of the film was it's editing and sound design. This all helped with the immersion. Every scene is dripping with hidden details covered in immense beauty sugar coated with an outstanding soundtrack played by Radwimps.And although the end is predictable, it did what 5 Centimetres Per Second didn't do. It left me satisfied. What seemed like a stupid idea turned into Your Name. And it's not just another Japanese animation. There are so many scenes where it feels like the Shinkai just pulls the rug from underneath you, like the movie doesn't always follow the normal routine. I felt so many emotions in this movie.It grips you in that way and shows that every second in the movie and in life is important.This movie takes every awesome element that Shinkai has ever used in his films and are all constrained into this movie. This film has jaw dropping photo-realistic visuals with beautiful Japanese voice work, great cinematography, laugh out loud comedy, gripping story, insane twists, looming soundtrack, heart racing action, unforgettable quotes.But the best part about this movie is that it has very few mistakes. Everything is in the film for a reason. Still, I don't feel like I've covered most of the points of why this movie was so good without spoiling anything. But I can say that when I watched it, it was something special. Looking around at other reviews and forums, I have a feeling, that this will be regarded as one of the best animated movies ever made.A+10 / 10Watch more reviews like this at https://www.youtube.com/channel/UCfNozbWd9SJYYwLK2zYn_AA"
    },
    {
      "username": "pyrocitor",
      "userUrl": "https://www.imdb.com/user/ur3728510",
      "reviewLink": "https://www.imdb.com/review/rw3793037",
      "warningSpoilers": false,
      "date": "29 August 2017",
      "rate": "9",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Hold onto that feeling",
      "content": "Just a small town girl, living in a lonely world. Just a city boy... No, wait. Hear me out. Granted, it's initially hard to sell Your Name - a meet cute anime twist on Freaky Friday - as a worthwhile recipient of its considerable, well-deserved hype, rather than a big screen, big budget rendition of Fruits Basket. But the hype is real. Inauspicious or not, writer/director Makoto Shinkai's film is somewhat of a genre-bending game changer - a film so special that the struggle to properly do justice to it leaves me resorting to inelegantly cherrypicking from a slew of contemporary allusions (the elegant loneliness of Murakami; the mischievous whimsy of Wong-Kar Wai; an Eternal Sunshine of the Spotless Mind interwoven with The Breakfast Club with the most imperceptible pinch of your average buddy cop comedy comedy for spice), while it is still far more than the sum of their parts. In short, it's one of the most unexpected, simple but profound, entrancing, and poetically beautiful films to cross screens in years. It's as fun as it is melancholy, as unforgettable as it is sweetly unassuming. Even better - it's that rare anime where comparisons to Studio Ghibli aren't simply lip service, but actually warranted in terms of exquisite, painstaking heart and attention to detail. Yes, really. But such lofty praise is actually far from the spirit of a film that goes about its remarkable business with a cheeky subtlety. Shinkai wisely plays off the initial silliness of his concept, with the early body swap sequences staying rooted in lighter, bawdier humour, playfully portrayed with a springy, sassy wit keeping even the broadest moments no less human and adorable for their broadness. The conceit itself is kept indifferently vague, apart from the haziest of nods to traditional spirituality - it's not the 'how' that matters here anywhere near as much as the 'what.' Similarly, there's a clearly delineated dichotomy between the two protagonists' 'tradition vs. modernity' milieus (with larger, extrapolating themes of supplanting history and cultural longing spanning generations to be teased out by those keen enough), but Shinkai is content to let the contrast sit, rather than milking it for shoehorned theme, or garish social commentary. More than anything, the film captures that ethereal but omnipresent sense of vague dissatisfaction, longing, and persistent but directionless striving that is bound to feel almost achingly familiar to any given audience member, regardless of age, nationality, or standing in life. Shinkai takes a distressingly familiar sense of ennui, and infuses it with a melancholy grace, a feeling accentuated hugely by the film's simply gorgeous, sweeping artwork, infusing panoramas of mountain-dwarfed Japanese countrysides and bustling Tokyo skyscrapers with an unbelievable level of composition and care. When the film glissandos into a third-act twist that is as devastating as it is unpredictable for all but the most eagle-eyed of viewers, it transcends into a piece of larger-than-life folklore, conjuring an almost feverishly heightened viewership that redefines magnetic, before culminating with a quiet grace note that ties up the emotional knot in ways both elegiac and unforgettably uplifting. It may sound like a perennial squall of emotional peaks and valleys, but Shinkai surfs it with nonchalant poise, with his rock-steady pacing lending the film an almost uncanny gestalt. Upon the arrival of the closing credits, don't be surprised to hear a wet gasp, equal parts tearful and jubilant, erupting from your throat, unsolicited. You won't be alone in doing so. If there are any imperceptible faults to be found, it's that Shinkai's perhaps inevitable leaning on anime tropes do, at times, dip the film into conventions it would normally nimbly leap over. The occasional conflict-expanding plot device or bombastic musical interlude, particularly in gearing up for the film's climax, strain convention in ways that are only startling in their inconsistency with the film's customary elegance, while lead actors Mone Kamishiraishi and Ryûnosuke Kamiki, while both lending credibly commanding voices, are as hyperbolic as they come in their grunts, gasps, and other verbalizations reacting to their bizarre circumstances. Still, these are the faintest blemishes on the face of a truly beautiful, touching film, that truly demonstrates that the affective potential of traditional animation still has many wrinkles of uncanny power yet to unfurl. So do yourself a favour: believe the hype. Invest in Your Name. If you have any space amidst the ensuing deluge of feelings, you may just thank yourself you did. -9.5/10"
    },
    {
      "username": "pere-25366",
      "userUrl": "https://www.imdb.com/user/ur64640683",
      "reviewLink": "https://www.imdb.com/review/rw3789123",
      "warningSpoilers": false,
      "date": "25 August 2017",
      "rate": "10",
      "helpful": "22 out of 28 found this helpful.",
      "title": "One of the most beautiful films I've ever seen",
      "content": "This film will leave you speechless - it is quite simply one of the most beautifully crafted films I've ever seen. The animation is breathtaking and possibly the most beautiful animation ever put to screen. There really are no words to capture exactly how it makes you feel because this is simply a film that will move you in inexplicable ways. Sit down, enter the world that Makoto Shinkai has presented to us and soak in all of the magic. Un-be-lievable experience!"
    },
    {
      "username": "bup-53144",
      "userUrl": "https://www.imdb.com/user/ur82041029",
      "reviewLink": "https://www.imdb.com/review/rw3850228",
      "warningSpoilers": false,
      "date": "5 November 2017",
      "rate": "9",
      "helpful": "259 out of 299 found this helpful.",
      "title": "A Beautiful Heartwarming Story - With A Social Conscience",
      "content": "In a world dominated by stupid sequels, prequels and remakes it is film/anime like this that restores hope in today's entertainment.Not only it is emotional and feels real, it delivers a relevant message. I love the imagination and palette but also appreciate that it aims to remind us of social issues that we should be paying attention to.The only reason I don't give our heroes and their story a 10/10 is that I still feel a couple of Miyazaki movies (like Kiki, Chihiro and the racoon dogs) were just that much better and showed a little more imagination.Whatever the case I live in fear of the Hollywood announced remake by Hollywood hack JJ Abrams who has never shown any talent or vision. As with others I will ignore and boycott that coming insult and always cherish kimi no na wa."
    },
    {
      "username": "matthewssilverhammer",
      "userUrl": "https://www.imdb.com/user/ur19752191",
      "reviewLink": "https://www.imdb.com/review/rw4155416",
      "warningSpoilers": false,
      "date": "6 May 2018",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One of my favorite animes ever.",
      "content": "This thing is romantic, funny, mysterious, tragic, compelling, effortless, and purely wonderful, all of which could've easily fallen apart if the ending wasn't so absolutely perfect. I think, because of the confident way the story is told, a second viewing would really make it soar."
    },
    {
      "username": "JanePhilpot",
      "userUrl": "https://www.imdb.com/user/ur90217233",
      "reviewLink": "https://www.imdb.com/review/rw4242676",
      "warningSpoilers": false,
      "date": "18 July 2018",
      "rate": "",
      "helpful": "153 out of 184 found this helpful.",
      "title": "The Japanese Sure Know How To Unleash",
      "content": "Beauty, Mystery and Creativity, don't they?I am scared for the day Jar Jar Abrams and Kathleen Kennedy get hold of this and make the hero a Disney princess and bore all our pants off.before Disney gives Kimi No Na Wa the Ghost In The Shell treatment get hold of this original and beautiful film. I guarantee you the girl is not Melissa McCarthy and doesn't have body issues."
    },
    {
      "username": "wgk-07214",
      "userUrl": "https://www.imdb.com/user/ur96703839",
      "reviewLink": "https://www.imdb.com/review/rw4527299",
      "warningSpoilers": false,
      "date": "22 December 2018",
      "rate": "",
      "helpful": "117 out of 144 found this helpful.",
      "title": "Worthy Of The Hype",
      "content": "An orgasm for the mind and of course the eyes.This animation is an instant classic. I recommend watching it whether an adolescent or an adult...By the way, Hollywood has commissioned Mr. Rip Off Jar Jar Abrams to remake it. OH HELL NO!!! BOYCOTT THAT!!!!!!!!!!"
    },
    {
      "username": "pekiworgen",
      "userUrl": "https://www.imdb.com/user/ur67964983",
      "reviewLink": "https://www.imdb.com/review/rw3541325",
      "warningSpoilers": false,
      "date": "10 September 2016",
      "rate": "10",
      "helpful": "111 out of 133 found this helpful.",
      "title": "Must watch",
      "content": "I started watching this movie with high expectations,but somehow this movie managed to be exceed them.Movie didn't just look amazing,which is expected from Makoto Shinkai,but story is amazing as well,it manages to keep attention of viewer from start to finish,and as movie progress it just gets better and better.I think that everyone that loves movies should watch this.Even if someone doesn't like animated movies they should give this movie a try.Also i love how some little things that at first seem meaningless at the end of movie get amazing meaning. Personally i think this is best work that Makoto Shinkai made by far,its above all of his previous works,and doesn't have flaws that some of his other works had."
    },
    {
      "username": "yannickd",
      "userUrl": "https://www.imdb.com/user/ur6738400",
      "reviewLink": "https://www.imdb.com/review/rw3539982",
      "warningSpoilers": false,
      "date": "7 September 2016",
      "rate": "10",
      "helpful": "265 out of 293 found this helpful.",
      "title": "Beautiful",
      "content": "I went in to see Kimi no Na ha without knowing anything about the movie. I had simply been intrigued by the movie poster with the comet as a background to two high school students living in wildly different environments - and the excellent reviews on its Friday release convinced me to see it just the day after.Not knowing anything about the movie made me relish every single moment of it. The two main characters would, it seems, never have the occasion to meet each other, but through a mysterious circumstance are led to share some of their waking hours with each other. At first, the movie struck a compelling, funny and nostalgic view at high school life in Japan, love, friendship, puberty, teenage angst and some elements of mysticism. It felt like a very fresh and charming sentimental love comedy with a dash of depth and teenage angst. And it already utterly captured me at that point.Yet midway, the movie veers resolutely into dramatic, and more mystical territory, while managing to keep the lighthearted tone it had reached during the first half at just the right moments. Together with one of the main characters, I was shocked and powerless upon learning of one aspect that had eluded both protagonists, as well as the audience. At the same time, a trope often used in science-fiction got thrown into the mix and the stakes suddenly get much higher, making me look back to the first half of the movie and thinking \"wwwooooowww I get it now\", while following the paths of the protagonists, which, just like the Kumi Himo (thread making?) that Miyamizu Shrine makes, represent time itself. Meeting, diverging, tangling, getting cut, doubling back. The second half of the film is a perfect adventure, full of suspense, humor, hope, and yes, tears. And at some points, it gets close to tragedy (one scene in a train left a huge lump in my throat). In some respect it reminded me of Spirited Away (my long time favorite animation movie), in which both main characters grow thanks to the other, and whose paths had crossed and would cross again, beyond memory or reality.Saying more would spoil the movie, so I have been very, very vague. Suffice it to say the movie made me laugh, cry, get the goosebumps, and got me to the edge of my seat at some points. It really had great storytelling, pacing, characters, and emotions throughout. I loved it.The visuals were also gorgeous. Absolutely gorgeous. Tokyo is more real than the real Tokyo, and the director, animators, background artists, and computer artists seem to have devilish fun playing with lighting and getting some of the most beautiful scenes and moments I can recall in an animation movie.I should mention the music as well, which was very, very good. I know RADWIMPS (I went to see them live a couple of years back), but was surprised at the tone they achieved, and how well it fit with the movie - the music, along with the visuals, really help in getting a full immersion into the story.However, some of the most hilarious jokes in the movie seem to be untranslatable to English - in particular the \"dialects\" of the main characters, as well as a specific moment that makes use of several of the ways that Japanese people use to refer to themselves, depending on context and sex (watashi, watakushi, boku, ore). So I'm looking forward to seeing how those scenes will be handled in the translation!I have since seen the movie one more time, bought the OST, and bought and read the novelization (which is almost like the movie, but does give more insight into each character's thoughts and thought processes.). Highly recommended!"
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw3856041",
      "warningSpoilers": true,
      "date": "12 November 2017",
      "rate": "",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Perfectly balances all the elements, providing plenty in all of them (SUGGESTIVE SPOILERS)",
      "content": "I came to Your Name only knowing that it was a body-swap film, and that it was supposed to be good. Beyond that I did not know much at all. I cannot remember if I was told it was a comedy, or merely assumed it was a comedy on the basis that all bodyswap films seem to play that element to the maximum. Regardless, I did not know much about it.The film opens very much in the genre that I expected, and we spend the first half of the film in this vein; two teenagers in different parts of Japan swap bodies every so often - a boy and girl. After a while it becomes a routine, and they leave each other notes on their telephones to help the visitor play out the lives correctly. In this half the film is lively, funny, sweet, and enjoyable for what it does with the characters in terms of establishing them but also swapping them around. The middle of the film sees a change to this direction, and instead the root of the jumping, and more detail of the situation, is laid out. At this point there is much more mystery, urgency, and drama to the story as it unfolds. It does this in a way that in no way discards what has gone before, but uses our charmed investment to make the second half work even better. It does this all the way to an ending which seems like nothing to describe it, but yet left me with tears in my eyes.The character creation and the spot-on judgment of tone are two key elements in making it work, but of course not only. Animation is great throughout and the music, although a little corny perhaps, plays off the emotions in the story well - again a factor in me having something in my eye at the end. I'm not sure a second watch will have quite the same impact on me as the first time did, but I will watch it again. It is a great little film - worthy of the praise it received on release in Europe, and worth watching even if you have zero interest in subtitled or animated films."
    }
  ],
  "errorMessage": ""
}