{
  "imDbId": "tt5311514",
  "title": "Your Name.",
  "fullTitle": "Your Name. (2016)",
  "type": "Movie",
  "year": "2016",
  "language": "en",
  "titleInLanguage": "Your Name",
  "url": "https://en.wikipedia.org/wiki/Your_Name",
  "plotShort": {
    "plainText": "Your Name (Japanese: 君の名は。, Hepburn: Kimi no Na wa) is a 2016 Japanese animated romantic fantasy film written and directed by Makoto Shinkai, produced by CoMix Wave Films and distributed by Toho. In depicts the story of high school students Taki Tachibana and Mitsuha Miyamizu, who suddenly begin to swap bodies despite having never met, unleashing chaos on each other's lives.\r\nIt features the voices of Ryunosuke Kamiki and Mone Kamishiraishi, with animation direction by Masashi Ando, character design by Masayoshi Tanaka, and its orchestral score and soundtrack composed by Radwimps. A light novel of the same name, also written by Shinkai, was published a month prior to the film's premiere. It was inspired by Japan's frequency for natural disasters.\r\nYour Name premiered at the 2016 Anime Expo in Los Angeles on July 3, 2016, and was theatrically released in Japan on August 26, 2016; it was released internationally by several distributors across 2017. The film received widespread critical acclaim, with praise for its story, animation, music, visuals, and emotional weight. Grossing US$382 million worldwide, it became the third highest-grossing Japanese film of all time, breaking numerous box office records, unadjusted for inflation.\r\nIt received several accolades, including the Best Animated Feature at the 2016 Los Angeles Film Critics Association Awards and the Japan Academy Prize for Animation of the Year. A live-action remake is in development by Paramount Pictures.",
    "html": "<p>Your Name (Japanese: 君の名は。, Hepburn: Kimi no Na wa) is a 2016 Japanese animated romantic fantasy film written and directed by Makoto Shinkai, produced by CoMix Wave Films and distributed by Toho. In depicts the story of high school students Taki Tachibana and Mitsuha Miyamizu, who suddenly begin to swap bodies despite having never met, unleashing chaos on each other's lives.</p><p>It features the voices of Ryunosuke Kamiki and Mone Kamishiraishi, with animation direction by Masashi Ando, character design by Masayoshi Tanaka, and its orchestral score and soundtrack composed by Radwimps. A light novel of the same name, also written by Shinkai, was published a month prior to the film's premiere. It was inspired by Japan's frequency for natural disasters.</p><p>Your Name premiered at the 2016 Anime Expo in Los Angeles on July 3, 2016, and was theatrically released in Japan on August 26, 2016; it was released internationally by several distributors across 2017. The film received widespread critical acclaim, with praise for its story, animation, music, visuals, and emotional weight. Grossing US$382 million worldwide, it became the third highest-grossing Japanese film of all time, breaking numerous box office records, unadjusted for inflation.</p><p>It received several accolades, including the Best Animated Feature at the 2016 Los Angeles Film Critics Association Awards and the Japan Academy Prize for Animation of the Year. A live-action remake is in development by Paramount Pictures.</p>"
  },
  "plotFull": {
    "plainText": "Your Name (Japanese: 君の名は。, Hepburn: Kimi no Na wa) is a 2016 Japanese animated romantic fantasy film written and directed by Makoto Shinkai, produced by CoMix Wave Films and distributed by Toho. In depicts the story of high school students Taki Tachibana and Mitsuha Miyamizu, who suddenly begin to swap bodies despite having never met, unleashing chaos on each other's lives.\r\nIt features the voices of Ryunosuke Kamiki and Mone Kamishiraishi, with animation direction by Masashi Ando, character design by Masayoshi Tanaka, and its orchestral score and soundtrack composed by Radwimps. A light novel of the same name, also written by Shinkai, was published a month prior to the film's premiere. It was inspired by Japan's frequency for natural disasters.\r\nYour Name premiered at the 2016 Anime Expo in Los Angeles on July 3, 2016, and was theatrically released in Japan on August 26, 2016; it was released internationally by several distributors across 2017. The film received widespread critical acclaim, with praise for its story, animation, music, visuals, and emotional weight. Grossing US$382 million worldwide, it became the third highest-grossing Japanese film of all time, breaking numerous box office records, unadjusted for inflation.\r\nIt received several accolades, including the Best Animated Feature at the 2016 Los Angeles Film Critics Association Awards and the Japan Academy Prize for Animation of the Year. A live-action remake is in development by Paramount Pictures.\r\nPlot\r\nIn 2013, Mitsuha Miyamizu is a high school girl living in the rural town of Itomori, Japan. Bored of the town, she wishes to be a Tokyo boy in her next life. One day, she inexplicably begins to switch bodies intermittently with Taki Tachibana, a high school boy in Tokyo. Thus, when they wake up as each other on some mornings, they must live through the other's respective activities and social interactions for the day. They learn they can communicate with each other by leaving messages on paper, phones, and sometimes on each other's skin. Mitsuha (in Taki's body) sets Taki up on a date with coworker Miki Okudera, while Taki (in Mitsuha's body) causes Mitsuha to become popular at school. One day, Taki (in Mitsuha's body) accompanies Mitsuha's grandmother Hitoha and younger sister Yotsuha to leave the ritual alcohol kuchikamizake, made by the sisters, as an offering at the Shinto shrine located on a mountaintop outside the town. It is believed to represent the body of the village guardian god ruling over human connections and time. Taki reads a note from Mitsuha about the comet Tiamat, expected to pass nearest to Earth on the day of the autumn festival. The next day, Taki wakes up in his body and goes on a date with Miki, who tells him she enjoyed the date but also that she can tell he is preoccupied with thoughts of someone else. Taki attempts to call Mitsuha on the phone, but cannot reach her as the body-switching ends.\r\nTaki, Miki, and their friend Tsukasa travel to Gifu by train on a trip to Hida in search of Mitsuha. However, Taki does not know the name of Itomori, relying on his sketches of the surrounding landscape from memory. A restaurant owner in Takayama is from Itomori and recognizes the town in the sketch. He takes Taki and his friends to the ruins of Itomori, which has been destroyed and where 500 residents were killed when Tiamat unexpectedly fragmented as it passed by Earth three years earlier. Taki sees Mitsuha's messages disappearing from his phone, and his memories of her begin to gradually fade, realizing the two were also separated by time, as he is in 2016. Taki finds Mitsuha's name in the record of fatalities. While Miki and Tsukasa return to Tokyo, Taki journeys to the shrine, hoping to reconnect with Mitsuha and warn her about Tiamat. There, Taki drinks Mitsuha's kuchikamizake and then lapses into a vision, where he glimpses Mitsuha's past. He also recalls that he encountered Mitsuha on a train when she came to Tokyo the day before the event to find him, though Taki did not recognize her, as the body-switching was yet to occur in his timeframe. Before leaving the train in embarrassment, Mitsuha had handed him her hair ribbon, which he has since worn on his wrist as a good-luck charm.\r\nTaki wakes up in Mitsuha's body at her house on the morning of the festival. Hitoha deduces what has happened and tells him the body-switching ability has been passed down in her family as caretakers of the shrine. Taki convinces Tessie and Sayaka, two of Mitsuha's friends, to get the townspeople to evacuate Itomori, by disabling the electrical substation and broadcasting a false emergency alert. Taki heads to the shrine, realizing that Mitsuha must be in his body there, while Mitsuha wakes up in Taki's body. At sunset, the two sense each other's presence on the mountaintop but are separated due to contrasting timeframes and cannot see each other. When twilight falls, they return to their own bodies and see each other in person. After Taki returns Mitsuha's ribbon, they attempt to write their names on each other's palms so that they will remember each other. However, before Mitsuha can write hers, twilight passes, and they revert to their respective timeframes. When the evacuation plan fails, Mitsuha has to convince her father, Toshiki, the mayor of Itomori, to evacuate everyone. Before doing so, Mitsuha notices her memories of Taki are fading away and discovers he wrote \"I love you\" on her hand instead of his own name. After Tiamat crashes, Taki returns to his own timeframe and remembers nothing.\r\nFive years later, Taki, having graduated from university, is searching for a job. He senses he has lost something vital that he cannot identify, and feels inexplicable interest in the events surrounding Tiamat, now eight years in the past: Itomori was destroyed, but all of its people survived as they had evacuated just in time. Mitsuha has since moved to Tokyo. Sometime later, Taki and Mitsuha glimpse each other when their respective trains pass each other and are instantly drawn to seek one another, disembarking and racing to find the other, finally meeting at the stairs of Suga Shrine. Taki calls out to Mitsuha, saying that he feels he knows her, and she responds likewise. Having finally found what each had long searched for, they shed tears of happiness and simultaneously ask each other for their name.\r\nProduction\r\nThe idea for this story came to Shinkai after he visited Yuriage, Natori, Miyagi Prefecture in July 2011, after the Great East Japan Earthquake occurred. He said, \"This could have been my town.\" He said that he wanted to make a movie in which the positions of the people in Yuriage would be swapped with the viewers. The sketches that Shinkai drew during this visit have been shown in exhibitions.\r\nIn Makoto Shinkai's proposal sent to Toho on September 14, 2014, the film was originally titled Yume to Shiriseba (夢と知りせば, If I Knew It Was a Dream), derived from a passage in a waka poem attributed to Ono no Komachi. Its title was later changed to Kimi no Musubime (きみの結びめ, Your Connection) and Kimi wa Kono Sekai no Hanbun (きみはこの世界のはんぶん, You Are Half of This World) before becoming Kimi no Na Wa. On December 31, 2014, Shinkai announced that he had been spending his days writing storyboard for this film.\r\nInspiration for the story came from works including Shūzō Oshimi's Inside Mari, Rumiko Takahashi's Ranma ½, the Heian period novel Torikaebaya Monogatari, and Greg Egan's short story The Safe-Deposit Box. Shinkai also cited Interstellar (2014) by Christopher Nolan as an influence.\r\nWhile the town of Itomori, one of the film's settings, is fictional, the film drew inspirations from real-life locations that provided a backdrop for the town. Such locations include the city of Hida in Gifu Prefecture and its library, Hida City Library.\r\nMusic\r\nYojiro Noda, the lead vocalist of the Japanese rock band Radwimps, composed the theme music of Your Name. Director Makoto Shinkai requested him to compose its music \"in a way that the music will (supplement) the dialogue or monologue of the characters\". Your Name features the following songs performed by Radwimps:\r\n\"Yumetōrō\" (夢灯籠, Yumetōrō, lit. \"Dream Lantern\")\r\n\"Zenzenzense\" (前前前世, Zenzenzense, lit. \"Past Past Past Life\")\r\n\"Sparkle\" (スパークル, Supākuru)\r\n\"Nandemonaiya\" (なんでもないや, Nandemonaiya, lit. \"It's Nothing\")\r\nThe soundtrack of the film was well received by both audiences and critics alike and is acknowledged as being one of the factors behind its success at the box office. The film's soundtrack was the runner-up in the \"Best Soundtrack\" category at the 2016 Newtype Anime Awards, and the song \"Zenzenzense\" was the runner-up in the \"Best Theme Song Category\".\r\nRelease\r\nThe film premiered at the 2016 Anime Expo convention in Los Angeles, California on July 3, 2016, and later was released theatrically in Japan on August 26, 2016. The film was released in 92 countries. In order to qualify for the Academy Awards, the film was released for one week (December 2–8, 2016) in Los Angeles.\r\nIn Southeast Asian countries, this movie was screened as well. Purple Plan streamed an English and Chinese subtitled trailer for the film and premiered the film in Singapore on November 3 and in Malaysia on November 8, with daily screenings onwards. PVR decides to debut Your Name as the opening film of the Makoto Shinkai Film Festival on May 19, 2023, in India. M Pictures released it on November 10 in Thailand, and earned 22,996,714 baht (about US$649,056) in four days. Indonesian film distributor Encore Films announced that it would premiere the film in Indonesia on December 7. Cinema chain CGV Blitz also revealed that it would screen the film. Pioneer Films screened the film in the Philippines on December 14 and it immediately became the country's highest-grossing animated movie for the year. In Hong Kong, the film opened on November 11, and earned HK$6,149,917 (about US$792,806) in three days. The film premiered in Taiwan on October 21 and earned NT$64 million (about US$2 million) in its first week while staying in the first position in the box office earnings ranking. As of October 31, it has earned NT$52,909,581 (about US$1.666 million) in Taipei alone. It was released in Chinese theatres by Huaxia Film Distribution on December 2, 2016.\r\nThe film was released in Australian cinemas on limited release on November 24, 2016, by Madman Entertainment in both its original Japanese and an English dub. Madman also released the film in New Zealand on December 1, 2016. The film was screened in France on December 28. The film was also released in the United Kingdom on November 18, 2016, distributed by Anime Limited. The film was released in North American theaters on April 7, 2017, distributed by Funimation. In Germany the film was screened in over 150 cinemas in January 2018, with the first day being completely sold out. It reached the Top 10 movies that weekend. Due to the high demand, additional screening days were arranged.\r\nHome media\r\nYour Name was released in 4K UHD Blu-ray, Blu-ray, and DVD on July 26, 2017, in Japan by Toho Pictures. The release was offered in Regular, Special, and Collector's editions. Funimation announced on July 1 at Anime Expo 2017 that the film would be released on Blu-ray and DVD by the end of 2017 but did not specify a date. At Otakon 2017, they announced they are releasing the movie in both Standard and Limited Edition Blu-Ray and DVD Combo Packs on November 7, 2017. In its first week, the Blu-ray standard edition sold 202,370 units, the collector's edition sold 125,982 units and the special edition sold 94,079 units. The DVD Standard Edition placed first, selling 215,963. Your Name is the first anime to place three Blu-ray Disc releases in the top 10 of Oricon's overall Blu-ray Disc chart for 2 straight weeks. In 2017, the film generated ¥6,532,421,094 ($58,238,797) in media revenue from physical home video, soundtrack and book sales in Japan.\r\nOverseas, the film grossed over $10.5 million from DVD and Blu-ray sales in the United States as of April 2022. In the United Kingdom, it was 2017's second best-selling foreign language film on home video (below Operation Chromite) and again 2018's second best-selling foreign language film (below My Neighbor Totoro).\r\nTelevision broadcast\r\nThe Japanese television broadcast of Your Name was premiered on November 4, 2017, through satellite television broadcaster Wowow. In addition, a special program dedicated to Makoto Shinkai as well as his previous works were also broadcast on the same channel. It also received a Japanese terrestrial television premiere on January 3, 2018, via TV Asahi and the initial broadcast received a 17.4% audience rating.\r\nYour Name has made its first premiere on Philippine television through free-to-air broadcaster ABS-CBN as well as its HD television service on February 18, 2018, but in edited form due to being cut for commercials with a short runtime of 75 minutes. According to Kantar Media statistics, the first free-to-air broadcast of the film received an audience rating of 9.2% while the AGB Nielsen NUTAM statistics, it received a 3.1% audience rating. On April 9, 2020, as part of its Holy Week presentation, the film was aired again with minor cuts for content and longer runtime of 102 minutes (excluding commercials in its 2-hour timeslot) and it immediately became a trending topic through social media platforms whereas Makoto Shinkai himself thanked the viewers of the ABS-CBN broadcast of the film.\r\nReception\r\nBox office\r\nYour Name became a huge commercial success, especially in Japan, where it grossed ¥25.17 billion. The film achieved the second-largest gross for a domestic film in Japan, behind Spirited Away, and the fourth-largest ever, behind Titanic and Frozen. It is the first anime not directed by Hayao Miyazaki to earn more than $100 million (~￥10 billion) at the Japanese box office. It topped the box office in Japan for a record-breaking 12 non-consecutive weekends. It held the number-one position for nine consecutive weekends before being toppled by Death Note: Light Up the New World in the last weekend of October. It returned to the top for another three weeks before finally being dethroned by Hollywood blockbuster Fantastic Beasts and Where to Find Them.\r\nThe success of the film also extended beyond Japan. In China, it became the highest-grossing Japanese film in the world's second-largest movie market on December 17, 2016. It has grossed $81.3 million in China and is the highest-grossing 2D animated film in the country. Its opening screened in over 7,000 theaters. It made an estimated $10.9 million on its opening day from 66,000 screenings and attracting over 2.77 million admissions, the biggest 2D animated opening in the country. It also held the record for the highest-grossing non-Hollywood foreign film in China, up until it was surpassed by two Indian films, Dangal and Secret Superstar, in May 2017 and February 2018, respectively.\r\nThe film was number-one on its opening five days in South Korea, with 1.18 million admissions and a gross of $8.2 million, becoming the first Japanese film since Howl's Moving Castle to reach number one in the country. The film eventually drew 3.81 million admissions in South Korea and grossed $23.6 million, making it the highest-grossing anime film in South Korea until it was surpassed by The First Slam Dunk and Suzume in 2023.\r\nIn Thailand it grossed ฿44.1 million ($1.23 million). As of December 26, the film has grossed US$771,945 in Australia. and US$95,278 in New Zealand. On a December 20 blog post, the Australian distributor Madman stated that the film had made over AU$1,000,000 in the Australian box office alone before closing its limited release run.\r\nIn the United States and Canada, the film grossed $5,017,246. In the United Kingdom, it grossed £500,000 ($675,000) in 2016, making it the year's fifth highest-grossing non-English and non-Hindi film in the UK.\r\nCritical response\r\nThe review aggregator website Rotten Tomatoes reports that 98% of critics have given the film a positive review based on 116 reviews, with an average rating of 8.2/10. The site's critics consensus reads, \"As beautifully animated as it is emotionally satisfying, Your Name adds another outstanding chapter to writer-director Makoto Shinkai's filmography.\" On Metacritic, the film has a score of 79 out of 100 based on 26 critics, indicating \"generally favorable reviews\".\r\nMark Schilling of The Japan Times gave the film a rating of 4 out of 5 and praised the film's animation for its \"blend of gorgeous, realistic detail and emotionally grounded fantasy\". He also described the film's \"over-deliver\" of \"the comedy of adolescent embarrassment and awkwardness\" and its ending for being \"To the surprise of no one who has ever seen a Japanese seishun eiga (youth drama)\". Reception outside of Japan was also very positive. Mark Kermode called the film his ninth favourite film to be released in the United Kingdom in 2016. US reviews were mostly positive. The New York Times described it as \"a wistfully lovely Japanese tale\", while David Sims of The Atlantic said it was \"a dazzling new work of anime\". Furthermore, The Boston Globe had a positive opinion of the film, saying that it was \"pretty but too complicated\". Mike Toole from Anime News Network listed it as the third-best anime film of all time. John Musker and Ron Clements, directors of the Disney animated films The Great Mouse Detective, The Little Mermaid, Aladdin, Hercules, Treasure Planet, The Princess and the Frog, and Moana, praised the film for its beauty and uniqueness.\r\nDespite the praise he received, Makoto Shinkai insisted that the film is not as good as it could have been: \"There are things we could not do, Masashi Ando wanted to keep working but had to stop us for lack of money ... For me, it's incomplete, unbalanced. The plot is fine but the film is not at all perfect. Two years was not enough.\"\r\nLegacy\r\nNekotufu, the creator of the manga series Onimai: I'm Now Your Sister!, cited Your Name as an influence, saying that the popularity of the film motivated the creation of the series. According to Crunchyroll, the phenomenal success of Your Name helped push non-Ghibli anime into a more mainstream place in Japan, and changed trends in not only how anime films were made but also how they were promoted.\r\nAccolades\r\nAdaptations\r\nBooks\r\nYour Name is a Japanese light novel written by Makoto Shinkai. It is a novelization of the animated film of the same name, which was directed by Shinkai. It was published in Japan by Kadokawa on June 18, 2016, a month prior to the film premiere. By September 2016, the light novel had sold around 1,029,000 copies. An official visual guide was also released. The novel sold over 1.3 million copies, while the novel and visual guide sold over 2.5 million copies combined.\r\nLive-action film\r\nOn September 27, 2017, producer J. J. Abrams and screenwriter Eric Heisserer announced that they were working on a live-action remake of Your Name to be released by Paramount Pictures and Bad Robot Productions, alongside the original film's producers, Toho, who will handle the film's distribution in Japan. The film was being written by Eric Heisserer, who revealed that the Japanese right holders want it to be made from the western point of view. In February 2019, Marc Webb signed on to direct the remake. The film will be about a young Native American woman living in a rural area and a young man from Chicago who discover they are magically and intermittently swapping bodies. In September 2020, Deadline Hollywood reported that Lee Isaac Chung had taken over as both writer and director, working off a draft penned by Emily V. Gordon, with Abrams and Genki Kawamura co-producing. In July 2021, Chung departed from the project, citing scheduling issues. On October 31, 2022, Carlos López Estrada was announced to write and direct the remake, replacing Webb and Chung.",
    "html": "<p>Your Name (Japanese: 君の名は。, Hepburn: Kimi no Na wa) is a 2016 Japanese animated romantic fantasy film written and directed by Makoto Shinkai, produced by CoMix Wave Films and distributed by Toho. In depicts the story of high school students Taki Tachibana and Mitsuha Miyamizu, who suddenly begin to swap bodies despite having never met, unleashing chaos on each other's lives.</p><p>It features the voices of Ryunosuke Kamiki and Mone Kamishiraishi, with animation direction by Masashi Ando, character design by Masayoshi Tanaka, and its orchestral score and soundtrack composed by Radwimps. A light novel of the same name, also written by Shinkai, was published a month prior to the film's premiere. It was inspired by Japan's frequency for natural disasters.</p><p>Your Name premiered at the 2016 Anime Expo in Los Angeles on July 3, 2016, and was theatrically released in Japan on August 26, 2016; it was released internationally by several distributors across 2017. The film received widespread critical acclaim, with praise for its story, animation, music, visuals, and emotional weight. Grossing US$382 million worldwide, it became the third highest-grossing Japanese film of all time, breaking numerous box office records, unadjusted for inflation.</p><p>It received several accolades, including the Best Animated Feature at the 2016 Los Angeles Film Critics Association Awards and the Japan Academy Prize for Animation of the Year. A live-action remake is in development by Paramount Pictures.</p><br/><h3>Plot</h3><p>In 2013, Mitsuha Miyamizu is a high school girl living in the rural town of Itomori, Japan. Bored of the town, she wishes to be a Tokyo boy in her next life. One day, she inexplicably begins to switch bodies intermittently with Taki Tachibana, a high school boy in Tokyo. Thus, when they wake up as each other on some mornings, they must live through the other's respective activities and social interactions for the day. They learn they can communicate with each other by leaving messages on paper, phones, and sometimes on each other's skin. Mitsuha (in Taki's body) sets Taki up on a date with coworker Miki Okudera, while Taki (in Mitsuha's body) causes Mitsuha to become popular at school. One day, Taki (in Mitsuha's body) accompanies Mitsuha's grandmother Hitoha and younger sister Yotsuha to leave the ritual alcohol kuchikamizake, made by the sisters, as an offering at the Shinto shrine located on a mountaintop outside the town. It is believed to represent the body of the village guardian god ruling over human connections and time. Taki reads a note from Mitsuha about the comet Tiamat, expected to pass nearest to Earth on the day of the autumn festival. The next day, Taki wakes up in his body and goes on a date with Miki, who tells him she enjoyed the date but also that she can tell he is preoccupied with thoughts of someone else. Taki attempts to call Mitsuha on the phone, but cannot reach her as the body-switching ends.</p><p>Taki, Miki, and their friend Tsukasa travel to Gifu by train on a trip to Hida in search of Mitsuha. However, Taki does not know the name of Itomori, relying on his sketches of the surrounding landscape from memory. A restaurant owner in Takayama is from Itomori and recognizes the town in the sketch. He takes Taki and his friends to the ruins of Itomori, which has been destroyed and where 500 residents were killed when Tiamat unexpectedly fragmented as it passed by Earth three years earlier. Taki sees Mitsuha's messages disappearing from his phone, and his memories of her begin to gradually fade, realizing the two were also separated by time, as he is in 2016. Taki finds Mitsuha's name in the record of fatalities. While Miki and Tsukasa return to Tokyo, Taki journeys to the shrine, hoping to reconnect with Mitsuha and warn her about Tiamat. There, Taki drinks Mitsuha's kuchikamizake and then lapses into a vision, where he glimpses Mitsuha's past. He also recalls that he encountered Mitsuha on a train when she came to Tokyo the day before the event to find him, though Taki did not recognize her, as the body-switching was yet to occur in his timeframe. Before leaving the train in embarrassment, Mitsuha had handed him her hair ribbon, which he has since worn on his wrist as a good-luck charm.</p><p>Taki wakes up in Mitsuha's body at her house on the morning of the festival. Hitoha deduces what has happened and tells him the body-switching ability has been passed down in her family as caretakers of the shrine. Taki convinces Tessie and Sayaka, two of Mitsuha's friends, to get the townspeople to evacuate Itomori, by disabling the electrical substation and broadcasting a false emergency alert. Taki heads to the shrine, realizing that Mitsuha must be in his body there, while Mitsuha wakes up in Taki's body. At sunset, the two sense each other's presence on the mountaintop but are separated due to contrasting timeframes and cannot see each other. When twilight falls, they return to their own bodies and see each other in person. After Taki returns Mitsuha's ribbon, they attempt to write their names on each other's palms so that they will remember each other. However, before Mitsuha can write hers, twilight passes, and they revert to their respective timeframes. When the evacuation plan fails, Mitsuha has to convince her father, Toshiki, the mayor of Itomori, to evacuate everyone. Before doing so, Mitsuha notices her memories of Taki are fading away and discovers he wrote \"I love you\" on her hand instead of his own name. After Tiamat crashes, Taki returns to his own timeframe and remembers nothing.</p><p>Five years later, Taki, having graduated from university, is searching for a job. He senses he has lost something vital that he cannot identify, and feels inexplicable interest in the events surrounding Tiamat, now eight years in the past: Itomori was destroyed, but all of its people survived as they had evacuated just in time. Mitsuha has since moved to Tokyo. Sometime later, Taki and Mitsuha glimpse each other when their respective trains pass each other and are instantly drawn to seek one another, disembarking and racing to find the other, finally meeting at the stairs of Suga Shrine. Taki calls out to Mitsuha, saying that he feels he knows her, and she responds likewise. Having finally found what each had long searched for, they shed tears of happiness and simultaneously ask each other for their name.</p><br/><h3>Production</h3><p>The idea for this story came to Shinkai after he visited Yuriage, Natori, Miyagi Prefecture in July 2011, after the Great East Japan Earthquake occurred. He said, \"This could have been my town.\" He said that he wanted to make a movie in which the positions of the people in Yuriage would be swapped with the viewers. The sketches that Shinkai drew during this visit have been shown in exhibitions.</p><p>In Makoto Shinkai's proposal sent to Toho on September 14, 2014, the film was originally titled Yume to Shiriseba (夢と知りせば, If I Knew It Was a Dream), derived from a passage in a waka poem attributed to Ono no Komachi. Its title was later changed to Kimi no Musubime (きみの結びめ, Your Connection) and Kimi wa Kono Sekai no Hanbun (きみはこの世界のはんぶん, You Are Half of This World) before becoming Kimi no Na Wa. On December 31, 2014, Shinkai announced that he had been spending his days writing storyboard for this film.</p><p>Inspiration for the story came from works including Shūzō Oshimi's Inside Mari, Rumiko Takahashi's Ranma ½, the Heian period novel Torikaebaya Monogatari, and Greg Egan's short story The Safe-Deposit Box. Shinkai also cited Interstellar (2014) by Christopher Nolan as an influence.</p><p>While the town of Itomori, one of the film's settings, is fictional, the film drew inspirations from real-life locations that provided a backdrop for the town. Such locations include the city of Hida in Gifu Prefecture and its library, Hida City Library.</p><br/><h3>Music</h3><p>Yojiro Noda, the lead vocalist of the Japanese rock band Radwimps, composed the theme music of Your Name. Director Makoto Shinkai requested him to compose its music \"in a way that the music will (supplement) the dialogue or monologue of the characters\". Your Name features the following songs performed by Radwimps:</p><ul><li>\"Yumetōrō\" (夢灯籠, Yumetōrō, lit. \"Dream Lantern\")</li><li>\"Zenzenzense\" (前前前世, Zenzenzense, lit. \"Past Past Past Life\")</li><li>\"Sparkle\" (スパークル, Supākuru)</li><li>\"Nandemonaiya\" (なんでもないや, Nandemonaiya, lit. \"It's Nothing\")</li></ul><p>The soundtrack of the film was well received by both audiences and critics alike and is acknowledged as being one of the factors behind its success at the box office. The film's soundtrack was the runner-up in the \"Best Soundtrack\" category at the 2016 Newtype Anime Awards, and the song \"Zenzenzense\" was the runner-up in the \"Best Theme Song Category\".</p><br/><h3>Release</h3><p>The film premiered at the 2016 Anime Expo convention in Los Angeles, California on July 3, 2016, and later was released theatrically in Japan on August 26, 2016. The film was released in 92 countries. In order to qualify for the Academy Awards, the film was released for one week (December 2–8, 2016) in Los Angeles.</p><p>In Southeast Asian countries, this movie was screened as well. Purple Plan streamed an English and Chinese subtitled trailer for the film and premiered the film in Singapore on November 3 and in Malaysia on November 8, with daily screenings onwards. PVR decides to debut Your Name as the opening film of the Makoto Shinkai Film Festival on May 19, 2023, in India. M Pictures released it on November 10 in Thailand, and earned 22,996,714 baht (about US$649,056) in four days. Indonesian film distributor Encore Films announced that it would premiere the film in Indonesia on December 7. Cinema chain CGV Blitz also revealed that it would screen the film. Pioneer Films screened the film in the Philippines on December 14 and it immediately became the country's highest-grossing animated movie for the year. In Hong Kong, the film opened on November 11, and earned HK$6,149,917 (about US$792,806) in three days. The film premiered in Taiwan on October 21 and earned NT$64 million (about US$2 million) in its first week while staying in the first position in the box office earnings ranking. As of October 31, it has earned NT$52,909,581 (about US$1.666 million) in Taipei alone. It was released in Chinese theatres by Huaxia Film Distribution on December 2, 2016.</p><p>The film was released in Australian cinemas on limited release on November 24, 2016, by Madman Entertainment in both its original Japanese and an English dub. Madman also released the film in New Zealand on December 1, 2016. The film was screened in France on December 28. The film was also released in the United Kingdom on November 18, 2016, distributed by Anime Limited. The film was released in North American theaters on April 7, 2017, distributed by Funimation. In Germany the film was screened in over 150 cinemas in January 2018, with the first day being completely sold out. It reached the Top 10 movies that weekend. Due to the high demand, additional screening days were arranged.</p><h4>Home media</h4><p>Your Name was released in 4K UHD Blu-ray, Blu-ray, and DVD on July 26, 2017, in Japan by Toho Pictures. The release was offered in Regular, Special, and Collector's editions. Funimation announced on July 1 at Anime Expo 2017 that the film would be released on Blu-ray and DVD by the end of 2017 but did not specify a date. At Otakon 2017, they announced they are releasing the movie in both Standard and Limited Edition Blu-Ray and DVD Combo Packs on November 7, 2017. In its first week, the Blu-ray standard edition sold 202,370 units, the collector's edition sold 125,982 units and the special edition sold 94,079 units. The DVD Standard Edition placed first, selling 215,963. Your Name is the first anime to place three Blu-ray Disc releases in the top 10 of Oricon's overall Blu-ray Disc chart for 2 straight weeks. In 2017, the film generated ¥6,532,421,094 ($58,238,797) in media revenue from physical home video, soundtrack and book sales in Japan.</p><p>Overseas, the film grossed over $10.5 million from DVD and Blu-ray sales in the United States as of April 2022. In the United Kingdom, it was 2017's second best-selling foreign language film on home video (below Operation Chromite) and again 2018's second best-selling foreign language film (below My Neighbor Totoro).</p><h4>Television broadcast</h4><p>The Japanese television broadcast of Your Name was premiered on November 4, 2017, through satellite television broadcaster Wowow. In addition, a special program dedicated to Makoto Shinkai as well as his previous works were also broadcast on the same channel. It also received a Japanese terrestrial television premiere on January 3, 2018, via TV Asahi and the initial broadcast received a 17.4% audience rating.</p><p>Your Name has made its first premiere on Philippine television through free-to-air broadcaster ABS-CBN as well as its HD television service on February 18, 2018, but in edited form due to being cut for commercials with a short runtime of 75 minutes. According to Kantar Media statistics, the first free-to-air broadcast of the film received an audience rating of 9.2% while the AGB Nielsen NUTAM statistics, it received a 3.1% audience rating. On April 9, 2020, as part of its Holy Week presentation, the film was aired again with minor cuts for content and longer runtime of 102 minutes (excluding commercials in its 2-hour timeslot) and it immediately became a trending topic through social media platforms whereas Makoto Shinkai himself thanked the viewers of the ABS-CBN broadcast of the film.</p><br/><h3>Reception</h3><h4>Box office</h4><p>Your Name became a huge commercial success, especially in Japan, where it grossed ¥25.17 billion. The film achieved the second-largest gross for a domestic film in Japan, behind Spirited Away, and the fourth-largest ever, behind Titanic and Frozen. It is the first anime not directed by Hayao Miyazaki to earn more than $100 million (~￥10 billion) at the Japanese box office. It topped the box office in Japan for a record-breaking 12 non-consecutive weekends. It held the number-one position for nine consecutive weekends before being toppled by Death Note: Light Up the New World in the last weekend of October. It returned to the top for another three weeks before finally being dethroned by Hollywood blockbuster Fantastic Beasts and Where to Find Them.</p><p>The success of the film also extended beyond Japan. In China, it became the highest-grossing Japanese film in the world's second-largest movie market on December 17, 2016. It has grossed $81.3 million in China and is the highest-grossing 2D animated film in the country. Its opening screened in over 7,000 theaters. It made an estimated $10.9 million on its opening day from 66,000 screenings and attracting over 2.77 million admissions, the biggest 2D animated opening in the country. It also held the record for the highest-grossing non-Hollywood foreign film in China, up until it was surpassed by two Indian films, Dangal and Secret Superstar, in May 2017 and February 2018, respectively.</p><p>The film was number-one on its opening five days in South Korea, with 1.18 million admissions and a gross of $8.2 million, becoming the first Japanese film since Howl's Moving Castle to reach number one in the country. The film eventually drew 3.81 million admissions in South Korea and grossed $23.6 million, making it the highest-grossing anime film in South Korea until it was surpassed by The First Slam Dunk and Suzume in 2023.</p><p>In Thailand it grossed ฿44.1 million ($1.23 million). As of December 26, the film has grossed US$771,945 in Australia. and US$95,278 in New Zealand. On a December 20 blog post, the Australian distributor Madman stated that the film had made over AU$1,000,000 in the Australian box office alone before closing its limited release run.</p><p>In the United States and Canada, the film grossed $5,017,246. In the United Kingdom, it grossed £500,000 ($675,000) in 2016, making it the year's fifth highest-grossing non-English and non-Hindi film in the UK.</p><h4>Critical response</h4><p>The review aggregator website Rotten Tomatoes reports that 98% of critics have given the film a positive review based on 116 reviews, with an average rating of 8.2/10. The site's critics consensus reads, \"As beautifully animated as it is emotionally satisfying, Your Name adds another outstanding chapter to writer-director Makoto Shinkai's filmography.\" On Metacritic, the film has a score of 79 out of 100 based on 26 critics, indicating \"generally favorable reviews\".</p><p>Mark Schilling of The Japan Times gave the film a rating of 4 out of 5 and praised the film's animation for its \"blend of gorgeous, realistic detail and emotionally grounded fantasy\". He also described the film's \"over-deliver\" of \"the comedy of adolescent embarrassment and awkwardness\" and its ending for being \"To the surprise of no one who has ever seen a Japanese seishun eiga (youth drama)\". Reception outside of Japan was also very positive. Mark Kermode called the film his ninth favourite film to be released in the United Kingdom in 2016. US reviews were mostly positive. The New York Times described it as \"a wistfully lovely Japanese tale\", while David Sims of The Atlantic said it was \"a dazzling new work of anime\". Furthermore, The Boston Globe had a positive opinion of the film, saying that it was \"pretty but too complicated\". Mike Toole from Anime News Network listed it as the third-best anime film of all time. John Musker and Ron Clements, directors of the Disney animated films The Great Mouse Detective, The Little Mermaid, Aladdin, Hercules, Treasure Planet, The Princess and the Frog, and Moana, praised the film for its beauty and uniqueness.</p><p>Despite the praise he received, Makoto Shinkai insisted that the film is not as good as it could have been: \"There are things we could not do, Masashi Ando wanted to keep working but had to stop us for lack of money ... For me, it's incomplete, unbalanced. The plot is fine but the film is not at all perfect. Two years was not enough.\"</p><h4>Legacy</h4><p>Nekotufu, the creator of the manga series Onimai: I'm Now Your Sister!, cited Your Name as an influence, saying that the popularity of the film motivated the creation of the series. According to Crunchyroll, the phenomenal success of Your Name helped push non-Ghibli anime into a more mainstream place in Japan, and changed trends in not only how anime films were made but also how they were promoted.</p><br/><h3>Accolades</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"background:#ccc; text-align:center;\"><th colspan=\"8\" style=\"background: LightSteelBlue;\">List of awards and nominations</th></tr><tr style=\"background:#ccc; text-align:center;\"><th>Year</th><th>Award</th><th>Category</th><th>Recipient(s)</th><th>Result</th></tr><tr><td rowspan=\"13\">2016</td><td>49th <span>Sitges Film Festival</span></td><td>Best Animated Feature Length Film</td><td rowspan=\"4\"><i>Your Name</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>60th <span>BFI London Film Festival</span></td><td>Best Film</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">18th Bucheon International Animation Festival</td><td>Best Animated Feature Special Distinction Prize</td><td rowspan=\"4\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Animated Feature Audiences Prize</td></tr><tr><td>29th <span>Tokyo International Film Festival</span></td><td>Arigato Award</td><td>Makoto Shinkai</td></tr><tr><td rowspan=\"3\">6th <span>Newtype Anime Awards</span></td><td>Best Picture (Film)</td><td rowspan=\"2\"><i>Your Name</i></td></tr><tr><td>Best Soundtrack</td><td rowspan=\"2\" style=\"background:#CDE; vertical-align:middle; text-align:center;\" class=\"table-draw\">Runner-up</td></tr><tr><td>Best Theme Song Category</td><td><i>ZenZenZense</i></td></tr><tr><td>41st <span>Hochi Film Award</span></td><td>Best Picture</td><td rowspan=\"2\"><i>Your Name</i></td><td rowspan=\"2\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">29th <span>Nikkan Sports Film Award</span></td><td>Best Film</td></tr><tr><td>Best Director</td><td>Makoto Shinkai</td><td rowspan=\"2\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>2016 Los Angeles Film Critics Association Awards</span></td><td><span>Best Animated Film</span></td><td rowspan=\"10\"><i>Your Name</i></td></tr><tr><td><span>Women Film Critics Circle</span> 2016</td><td>Best Animated Female</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"27\">2017</td><td>20th <span>Japan Media Arts Festival</span></td><td>Grand Prize of Animation Division</td><td rowspan=\"6\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span>Japan Expo Awards</span></td><td>Daruma d’Or</td></tr><tr><td>Daruma for Best Picture</td></tr><tr><td>Daruma for Best Direction</td></tr><tr><td>Daruma for Best Screenplay</td></tr><tr><td>Daruma for Best Soundtrack</td></tr><tr><td>37th <span>Nihon SF Taisho Award</span></td><td>Grand Prize</td><td rowspan=\"5\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>44th Annie Awards</span></td><td><span class=\"mw-redirect\">Best Animated Feature — Independent</span></td></tr><tr><td>Outstanding Achievement, Directing in an Animated Feature Production</td><td>Makoto Shinkai</td></tr><tr><td><span>21st Satellite Awards</span></td><td><span>Best Animated or Mixed Media Feature</span></td><td rowspan=\"4\"><i>Your Name</i></td></tr><tr><td>48th <span class=\"mw-redirect\">Seiun Awards</span></td><td>Best Media</td></tr><tr><td>71st <span>Mainichi Film Awards</span></td><td><span>Best Animated Film</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\">59th <span>Blue Ribbon Awards</span></td><td>Best Film</td><td rowspan=\"2\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Director</td><td>Makoto Shinkai</td></tr><tr><td><span class=\"mw-redirect\">Special Award</span></td><td><i>Your Name</i></td><td rowspan=\"2\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">40th Japan Academy Prize</span></td><td><span class=\"mw-redirect\">Excellent Animation of the Year</span></td><td rowspan=\"2\"><i>Your Name</i></td></tr><tr><td><span class=\"mw-redirect\">Animation of the Year</span></td><td rowspan=\"2\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Director of the Year</span></td><td rowspan=\"2\">Makoto Shinkai</td></tr><tr><td><span class=\"mw-redirect\">Screenplay of the Year</span></td><td rowspan=\"6\" style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Achievement in Music</td><td>Radwimps</td></tr><tr><td>36th Anima Festival</td><td>Audience Award for Best Animated Feature</td><td><i>Your Name</i></td></tr><tr><td rowspan=\"3\"><span>11th Seiyu Awards</span></td><td>Best Actor</td><td>Ryunosuke Kamiki</td></tr><tr><td>Best Actress</td><td>Mone Kamishiraishi</td></tr><tr><td>Synergy Award</td><td rowspan=\"6\"><i>Your Name</i></td></tr><tr><td><span>11th Asia Pacific Screen Awards</span></td><td>Best Animated Feature Film</td><td rowspan=\"4\" style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>7th AACTA Awards</span></td><td>Best Asian Film</td></tr><tr><td><span>San Francisco Film Critics Circle Awards 2017</span></td><td>Best Animated Feature</td></tr><tr><td rowspan=\"2\">2018</td><td><span>44th Saturn Awards</span></td><td><span>Best Animated Film</span></td></tr><tr><td><span>2nd Crunchyroll Anime Awards</span></td><td>Best Animated Film</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Adaptations</h3><h4>Books</h4><p>Your Name is a Japanese light novel written by Makoto Shinkai. It is a novelization of the animated film of the same name, which was directed by Shinkai. It was published in Japan by Kadokawa on June 18, 2016, a month prior to the film premiere. By September 2016, the light novel had sold around 1,029,000 copies. An official visual guide was also released. The novel sold over 1.3 million copies, while the novel and visual guide sold over 2.5 million copies combined.</p><h4>Live-action film</h4><p>On September 27, 2017, producer J. J. Abrams and screenwriter Eric Heisserer announced that they were working on a live-action remake of Your Name to be released by Paramount Pictures and Bad Robot Productions, alongside the original film's producers, Toho, who will handle the film's distribution in Japan. The film was being written by Eric Heisserer, who revealed that the Japanese right holders want it to be made from the western point of view. In February 2019, Marc Webb signed on to direct the remake. The film will be about a young Native American woman living in a rural area and a young man from Chicago who discover they are magically and intermittently swapping bodies. In September 2020, Deadline Hollywood reported that Lee Isaac Chung had taken over as both writer and director, working off a draft penned by Emily V. Gordon, with Abrams and Genki Kawamura co-producing. In July 2021, Chung departed from the project, citing scheduling issues. On October 31, 2022, Carlos López Estrada was announced to write and direct the remake, replacing Webb and Chung.</p><br/>"
  },
  "errorMessage": ""
}