{
  "imDbId": "tt0095765",
  "title": "Cinema Paradiso",
  "fullTitle": "Cinema Paradiso (1988)",
  "type": "Movie",
  "year": "1988",
  "language": "en",
  "titleInLanguage": "Cinema Paradiso",
  "url": "https://en.wikipedia.org/wiki/Cinema_Paradiso",
  "plotShort": {
    "plainText": "Cinema Paradiso (Italian: Nuovo Cinema Paradiso, Italian pronunciation:, literally \"New Paradise Cinema\") is a 1988 coming-of-age drama film written and directed by Giuseppe Tornatore. Set in a small Sicilian town, the film centers on the friendship between a young boy and an aging projectionist who works at the titular movie theatre. This Italian-French co-production stars Philippe Noiret, Jacques Perrin, Leopoldo Trieste, Marco Leonardi, Agnese Nano and Salvatore Cascio. The film score was composed by Ennio Morricone and his son, Andrea, marking the beginning of a collaboration between Tornatore and Morricone that lasted until Morricone's death on 6 July 2020.\r\nCredited with revitalizing Italy's film industry, Cinema Paradiso has been cited as one of the greatest films of all time. It was a commercial success, and won several awards, including the Academy Award for Best Foreign Language Film and the Cannes Film Festival's Grand Prix. It was nominated for 11 BAFTA Awards and won five; including Best Actor for Philippe Noiret, Best Supporting Actor for Salvatore Cascio, Best Original Screenplay, and Best Foreign Language Film.",
    "html": "<p>Cinema Paradiso (Italian: Nuovo Cinema Paradiso, Italian pronunciation:, literally \"New Paradise Cinema\") is a 1988 coming-of-age drama film written and directed by Giuseppe Tornatore. Set in a small Sicilian town, the film centers on the friendship between a young boy and an aging projectionist who works at the titular movie theatre. This Italian-French co-production stars Philippe Noiret, Jacques Perrin, Leopoldo Trieste, Marco Leonardi, Agnese Nano and Salvatore Cascio. The film score was composed by Ennio Morricone and his son, Andrea, marking the beginning of a collaboration between Tornatore and Morricone that lasted until Morricone's death on 6 July 2020.</p><p>Credited with revitalizing Italy's film industry, Cinema Paradiso has been cited as one of the greatest films of all time. It was a commercial success, and won several awards, including the Academy Award for Best Foreign Language Film and the Cannes Film Festival's Grand Prix. It was nominated for 11 BAFTA Awards and won five; including Best Actor for Philippe Noiret, Best Supporting Actor for Salvatore Cascio, Best Original Screenplay, and Best Foreign Language Film.</p>"
  },
  "plotFull": {
    "plainText": "Cinema Paradiso (Italian: Nuovo Cinema Paradiso, Italian pronunciation:, literally \"New Paradise Cinema\") is a 1988 coming-of-age drama film written and directed by Giuseppe Tornatore. Set in a small Sicilian town, the film centers on the friendship between a young boy and an aging projectionist who works at the titular movie theatre. This Italian-French co-production stars Philippe Noiret, Jacques Perrin, Leopoldo Trieste, Marco Leonardi, Agnese Nano and Salvatore Cascio. The film score was composed by Ennio Morricone and his son, Andrea, marking the beginning of a collaboration between Tornatore and Morricone that lasted until Morricone's death on 6 July 2020.\r\nCredited with revitalizing Italy's film industry, Cinema Paradiso has been cited as one of the greatest films of all time. It was a commercial success, and won several awards, including the Academy Award for Best Foreign Language Film and the Cannes Film Festival's Grand Prix. It was nominated for 11 BAFTA Awards and won five; including Best Actor for Philippe Noiret, Best Supporting Actor for Salvatore Cascio, Best Original Screenplay, and Best Foreign Language Film.\r\nPlot\r\nIn 1988 Rome, Salvatore Di Vita, a famous film director, returns home late one evening, where his girlfriend sleepily tells him that his mother called to say someone named Alfredo has died. Salvatore shies from committed relationships and has not been to his home village of Giancaldo, Sicily in thirty years. As his girlfriend asks him who Alfredo was, Salvatore is not able to fall asleep and flashes back to his childhood.\r\nA few years after World War II, eight-year-old Salvatore is the mischievous, intelligent son of a war widow. Nicknamed Toto, he discovers a love for films and spends every free moment at the local movie house, named Cinema Paradiso. Although they initially start off on tense terms, he develops a friendship with the middle-aged projectionist, Alfredo, who often lets him watch movies from the projection booth. During the shows, the audience can be heard booing because there are missing sections, causing the films to suddenly jump, bypassing scenes with romantic kisses or embraces. The local priest, owner of the cinema, had ordered these sections to be censored, and the deleted scenes are cut from the film reels by Alfredo and piled on the projection room floor, where Alfredo keeps them until he can splice them back in for the film to be sent to the next town.\r\nAlfredo eventually teaches Salvatore how to operate the film projector. One day, Cinema Paradiso catches fire as Alfredo is projecting The Firemen of Viggiù after hours, on the wall of a nearby house. Salvatore saves Alfredo's life, but not before a reel of nitrate film explodes in Alfredo's face, leaving him permanently blind. The movie house is rebuilt by a town citizen, Ciccio Spaccafico, who invests a big football lottery winning. Salvatore, still a child, is hired as the new projectionist, as he is the only person who knows how to run the machines.\r\nAbout a decade later, Salvatore, now in high school, is still operating the projector at the \"Nuovo Cinema Paradiso\". His relationship with the blind Alfredo has strengthened, and Salvatore often looks to him for help – advice that Alfredo often dispenses by quoting classic films. Salvatore has been experimenting with filming, using a home movie camera; doing this he has met, and captured on film, a girl named Elena Mendola, daughter of a wealthy banker, and has fallen in love with her. Salvatore woos – and wins – Elena's heart, only to lose her due to her father's disapproval.\r\nAs Elena and her family move away, Salvatore leaves town for compulsory military service (even if, as a war orphan, he should be exempted from it). His attempts to write to Elena are fruitless; his letters are returned as undeliverable. Upon his return from the military, Alfredo urges Salvatore to leave Giancaldo permanently, counseling that the town is too small for Salvatore to ever find his dreams. Moreover, the old man tells him, once Salvatore leaves, he must pursue his destiny wholeheartedly, never looking back and never returning, even to visit; he must never give in to nostalgia or even write or think about them. They tearfully embrace, and Salvatore leaves town to pursue his future as a filmmaker.\r\nOnce back in present time, Salvatore realizes that he is very satisfied with his life from a professional point of view but not from a personal one, so decides to return home to attend Alfredo's funeral. Though the town has changed greatly, he now understands why Alfredo thought it was important that he leave. Alfredo's widow tells him that the old man followed Salvatore's successes with pride and he left him something: an unlabeled film reel and the old stool that Salvatore once stood on to operate the projector. Salvatore learns that Cinema Paradiso is to be demolished to make way for a parking lot. At the funeral, he recognizes the faces of many people who attended the cinema when he was the projectionist.\r\nSalvatore comes back to Rome, watches Alfredo's reel and discovers it comprises all the romantic scenes that the priest had ordered Alfredo to cut from the movies; Alfredo had spliced the sequences together to form a single unreduced film of aching desire and lustful frenzy. In the final scenes, Salvatore makes peace with his past with tears in his eyes.\r\nCast\r\nPhilippe Noiret as Alfredo\r\nSalvatore Cascio as child Salvatore Di Vita Marco Leonardi as teenage Salvatore Jacques Perrin as adult Salvatore\r\nMarco Leonardi as teenage Salvatore\r\nJacques Perrin as adult Salvatore\r\nAgnese Nano as Elena Mendola Brigitte Fossey as adult Elena (extended cut only)\r\nBrigitte Fossey as adult Elena (extended cut only)\r\nAntonella Attili as Maria Di Vita Pupella Maggio as old Maria\r\nPupella Maggio as old Maria\r\nEnzo Cannavale as Spaccafico\r\nIsa Danieli as Anna\r\nLeopoldo Trieste as Father Adelfio\r\nRoberta Lena as Lia\r\nNino Terzo as Peppino's father\r\nLeo Gullotta as the Usher\r\nTano Cimarosa as the Blacksmith\r\nNicola Di Pinto as the Village Idiot\r\nProduction\r\nCinema Paradiso was shot in director Tornatore's hometown Bagheria, Sicily, as well as Cefalù on the Tyrrhenian Sea. The town square in the film is Piazza Umberto I in the village of Palazzo Adriano, about 30 miles to the south of Palermo. The ‘Paradiso’ cinema was built here, at Via Nino Bixio, overlooking the octagonal Baroque fountain, which dates from 1608.\r\nTold largely in flashback of a successful film director Salvatore to his childhood years, it also tells the story of the return to his native Sicilian village for the funeral of his old friend Alfredo, the projectionist at the local \"Cinema Paradiso\". Ultimately, Alfredo serves as a wise father figure to his young friend who only wishes to see him succeed, even if it means breaking his heart in the process.\r\nSeen as an example of \"nostalgic postmodernism\", the film intertwines sentimentality with comedy, and nostalgia with pragmaticism. It explores issues of youth, coming of age, and reflections (in adulthood) about the past. The imagery in the scenes can be said to reflect Salvatore's idealised memories of his childhood. Cinema Paradiso is also a celebration of films; as a projectionist, young Salvatore (a.k.a. Totò) develops a passion for films that shapes his life path in adulthood.\r\nReleases\r\nThe film exists in multiple versions. It was originally released in Italy at 155 minutes, but poor box office performance in its native country led to its being shortened to 124 minutes for international release; it was an instant success. This international version won the Special Jury Prize at the 1989 Cannes Film Festival and the 1989 Best Foreign Language Film Oscar. In 2002, the director's cut 173-minute version was released (known in the U.S. as Cinema Paradiso: The New Version), although this was the original version and was the film's premiere at the Europa Cinema Festival, 29 September 1988, in Bari.\r\nDirector's cut\r\nIn the 173-minute version of the film, after the funeral, Salvatore notices an adolescent girl who resembles the teenage Elena. He follows the teen as she rides her scooter to her home, which allows Salvatore to contact his long-lost love Elena, who is revealed to be the girl's mother. Salvatore calls her in hopes of rekindling their romance; she initially rejects him, but later reconsiders and goes to see Salvatore, who was contemplating his rejection at a favorite location from their early years. Their meeting ultimately leads to a lovemaking session in her car. He learns that she had married an acquaintance from his school years, who became a local politician of modest means. Afterwards, feeling cheated, he strives to rekindle their romance, and while she clearly wishes it were possible, she rejects his entreaties, choosing to remain with her family and leave their romance in the past.\r\nDuring their evening together, a frustrated Salvatore asks Elena why she never contacted him or left word of where her family was moving to. He learns that the reason they lost touch was because Alfredo asked her not to see him again, fearing that Salvatore's romantic fulfillment would only destroy what Alfredo sees as Salvatore's destiny – to be successful in the cinema world. Alfredo tried to convince her that if she loved Salvatore, she should leave him for his own good. Elena explains to Salvatore that, against Alfredo's instruction, she had secretly left a note with an address where she could be reached and a promise of undying love and loyalty. Salvatore realizes that he never found that note, and thus lost his true love for more than thirty years. The next morning, Salvatore returns to the decaying Cinema Paradiso and frantically searches through the piles of old film invoices pinned to the wall of the projection booth. There, on the reverse side of one of the dockets, he finds the handwritten note Elena had left thirty years earlier.\r\nThe film ends with Salvatore returning to Rome and, with teary eyes, viewing the film reel that Alfredo left.\r\nHome media\r\nA special edition of Cinema Paradiso was released on DVD by Umbrella Entertainment on September 4, 2006. The DVD is compatible with all region codes and includes special features such as the theatrical trailer, the Director's Cut version, scenes from the Director's Cut, the Ennio Morricone soundtrack and a documentary on Giuseppe Tornatore.\r\nAn Academy Award edition of Cinema Paradiso was released on DVD by Umbrella Entertainment on February 1, 2009. It is also compatible with all region codes and includes different special features such as Umbrella Entertainment trailers, cast and crew biographies and the Director's filmography.\r\nOn July 1, 2011, Umbrella Entertainment released the film on Blu-ray. Arrow released a remastered special edition Blu-ray of the film, with both theatrical and extended cuts, in 2017.\r\nIn June 2020, Arrow Films announced a 4K UHD Blu-ray release with both of the aforementioned cuts due for September of that year, although only the 124-minute theatrical cut will be a 4K UHD presentation, the 174-minute Director’s Cut will be included as a Blu-ray presentation only.\r\nReception\r\nCinema Paradiso was a critical and box-office success, making Tornatore internationally known, and is regarded by many as a classic. It is particularly renowned for the 'kissing scenes' montage at the film's end. Winning the Academy Award for Best Foreign Film in 1989, the film is often credited with reviving Italy's film industry, which later produced Mediterraneo and Life Is Beautiful. Film critic Roger Ebert gave it three and a half stars out of four and four stars out of four for the extended version, declaring \"Still, I'm happy to have seen it--not as an alternate version, but as the ultimate exercise in viewing deleted scenes.\" Oddly, despite giving a higher rating to the extended version, Ebert maintained that the theatrical version was superior: \"I must confess that the shorter version of Cinema Paradiso is a better film than the longer.\"\r\nReview aggregator Rotten Tomatoes reports that 90% of critics have given the film a positive review based on 80 reviews, with an average score of 8.00/10. The critics consensus reads, \"Cinema Paradiso is a life-affirming ode to the power of youth, nostalgia, and the the movies themselves.\" The film also holds a score of 80 based on 21 reviews on Metacritic, indicating \"generally favorable reviews\". The film was ranked #27 in Empire magazine's \"The 100 Best Films Of World Cinema\" in 2010. The famed \"kissing scene\" montage at the end of the film was used in \"Stealing First Base\", an episode of The Simpsons that aired on 21 March 2010, during its twenty-first season. The scene used Morricone's \"Love Theme\" and included animated clips of famous movie kisses, including scenes used in Cinema Paradiso as well as contemporary films not shown in the original film. American progressive metal band Dream Theater 1992 album Images and Words' song \"Take the Time\" features in the lyrics the sentence spoken by Alfredo after the fire, \"ora che ho perso la vista, ci vedo di più! (I can see much clearer now I'm blind)\".\r\nThe film was released twice in Italy before its Cannes win and flopped at the box office both times. After the Cannes win it was re-released and performed steadily however, following its Academy Award success, it was released again and performed better, grossing $5.3 million in Italy. In France, the film ran for over a year, grossing over $19 million. In the United States and Canada, it grossed $12.3 million.\r\nAwards and nominations\r\n1989: Cannes Film Festival Grand Prix du Jury (tied with Trop belle pour toi)\r\nGrand Prix du Jury (tied with Trop belle pour toi)\r\n1989: Golden Globe Awards Best Foreign Language Film\r\nBest Foreign Language Film\r\n1989: Academy Awards Best Foreign Language Film\r\nBest Foreign Language Film\r\n1990: César Awards César Award for Best Poster: Jouineau Bourduge\r\nCésar Award for Best Poster: Jouineau Bourduge\r\n1991: BAFTA AwardsBAFTA Award for Best Film Not in the English Language Best Actor: Philippe Noiret Best Actor in a Supporting Role: Salvatore Cascio Best Original Screenplay: Giuseppe Tornatore Best Film Music: Ennio Morricone and Andrea Morricone\r\nBAFTA Award for Best Film Not in the English Language\r\nBest Actor: Philippe Noiret\r\nBest Actor in a Supporting Role: Salvatore Cascio\r\nBest Original Screenplay: Giuseppe Tornatore\r\nBest Film Music: Ennio Morricone and Andrea Morricone",
    "html": "<p>Cinema Paradiso (Italian: Nuovo Cinema Paradiso, Italian pronunciation:, literally \"New Paradise Cinema\") is a 1988 coming-of-age drama film written and directed by Giuseppe Tornatore. Set in a small Sicilian town, the film centers on the friendship between a young boy and an aging projectionist who works at the titular movie theatre. This Italian-French co-production stars Philippe Noiret, Jacques Perrin, Leopoldo Trieste, Marco Leonardi, Agnese Nano and Salvatore Cascio. The film score was composed by Ennio Morricone and his son, Andrea, marking the beginning of a collaboration between Tornatore and Morricone that lasted until Morricone's death on 6 July 2020.</p><p>Credited with revitalizing Italy's film industry, Cinema Paradiso has been cited as one of the greatest films of all time. It was a commercial success, and won several awards, including the Academy Award for Best Foreign Language Film and the Cannes Film Festival's Grand Prix. It was nominated for 11 BAFTA Awards and won five; including Best Actor for Philippe Noiret, Best Supporting Actor for Salvatore Cascio, Best Original Screenplay, and Best Foreign Language Film.</p><br/><h3>Plot</h3><p>In 1988 Rome, Salvatore Di Vita, a famous film director, returns home late one evening, where his girlfriend sleepily tells him that his mother called to say someone named Alfredo has died. Salvatore shies from committed relationships and has not been to his home village of Giancaldo, Sicily in thirty years. As his girlfriend asks him who Alfredo was, Salvatore is not able to fall asleep and flashes back to his childhood.</p><p>A few years after World War II, eight-year-old Salvatore is the mischievous, intelligent son of a war widow. Nicknamed Toto, he discovers a love for films and spends every free moment at the local movie house, named Cinema Paradiso. Although they initially start off on tense terms, he develops a friendship with the middle-aged projectionist, Alfredo, who often lets him watch movies from the projection booth. During the shows, the audience can be heard booing because there are missing sections, causing the films to suddenly jump, bypassing scenes with romantic kisses or embraces. The local priest, owner of the cinema, had ordered these sections to be censored, and the deleted scenes are cut from the film reels by Alfredo and piled on the projection room floor, where Alfredo keeps them until he can splice them back in for the film to be sent to the next town.</p><p>Alfredo eventually teaches Salvatore how to operate the film projector. One day, Cinema Paradiso catches fire as Alfredo is projecting The Firemen of Viggiù after hours, on the wall of a nearby house. Salvatore saves Alfredo's life, but not before a reel of nitrate film explodes in Alfredo's face, leaving him permanently blind. The movie house is rebuilt by a town citizen, Ciccio Spaccafico, who invests a big football lottery winning. Salvatore, still a child, is hired as the new projectionist, as he is the only person who knows how to run the machines.</p><p>About a decade later, Salvatore, now in high school, is still operating the projector at the \"Nuovo Cinema Paradiso\". His relationship with the blind Alfredo has strengthened, and Salvatore often looks to him for help – advice that Alfredo often dispenses by quoting classic films. Salvatore has been experimenting with filming, using a home movie camera; doing this he has met, and captured on film, a girl named Elena Mendola, daughter of a wealthy banker, and has fallen in love with her. Salvatore woos – and wins – Elena's heart, only to lose her due to her father's disapproval.</p><p>As Elena and her family move away, Salvatore leaves town for compulsory military service (even if, as a war orphan, he should be exempted from it). His attempts to write to Elena are fruitless; his letters are returned as undeliverable. Upon his return from the military, Alfredo urges Salvatore to leave Giancaldo permanently, counseling that the town is too small for Salvatore to ever find his dreams. Moreover, the old man tells him, once Salvatore leaves, he must pursue his destiny wholeheartedly, never looking back and never returning, even to visit; he must never give in to nostalgia or even write or think about them. They tearfully embrace, and Salvatore leaves town to pursue his future as a filmmaker.</p><p>Once back in present time, Salvatore realizes that he is very satisfied with his life from a professional point of view but not from a personal one, so decides to return home to attend Alfredo's funeral. Though the town has changed greatly, he now understands why Alfredo thought it was important that he leave. Alfredo's widow tells him that the old man followed Salvatore's successes with pride and he left him something: an unlabeled film reel and the old stool that Salvatore once stood on to operate the projector. Salvatore learns that Cinema Paradiso is to be demolished to make way for a parking lot. At the funeral, he recognizes the faces of many people who attended the cinema when he was the projectionist.</p><p>Salvatore comes back to Rome, watches Alfredo's reel and discovers it comprises all the romantic scenes that the priest had ordered Alfredo to cut from the movies; Alfredo had spliced the sequences together to form a single unreduced film of aching desire and lustful frenzy. In the final scenes, Salvatore makes peace with his past with tears in his eyes.</p><br/><h3>Cast</h3><ul><li>Philippe Noiret as Alfredo</li><li>Salvatore Cascio as child Salvatore Di Vita Marco Leonardi as teenage Salvatore Jacques Perrin as adult Salvatore</li><li>Marco Leonardi as teenage Salvatore</li><li>Jacques Perrin as adult Salvatore</li><li>Agnese Nano as Elena Mendola Brigitte Fossey as adult Elena (extended cut only)</li><li>Brigitte Fossey as adult Elena (extended cut only)</li><li>Antonella Attili as Maria Di Vita Pupella Maggio as old Maria</li><li>Pupella Maggio as old Maria</li><li>Enzo Cannavale as Spaccafico</li><li>Isa Danieli as Anna</li><li>Leopoldo Trieste as Father Adelfio</li><li>Roberta Lena as Lia</li><li>Nino Terzo as Peppino's father</li><li>Leo Gullotta as the Usher</li><li>Tano Cimarosa as the Blacksmith</li><li>Nicola Di Pinto as the Village Idiot</li></ul><br/><h3>Production</h3><p>Cinema Paradiso was shot in director Tornatore's hometown Bagheria, Sicily, as well as Cefalù on the Tyrrhenian Sea. The town square in the film is Piazza Umberto I in the village of Palazzo Adriano, about 30 miles to the south of Palermo. The ‘Paradiso’ cinema was built here, at Via Nino Bixio, overlooking the octagonal Baroque fountain, which dates from 1608.</p><p>Told largely in flashback of a successful film director Salvatore to his childhood years, it also tells the story of the return to his native Sicilian village for the funeral of his old friend Alfredo, the projectionist at the local \"Cinema Paradiso\". Ultimately, Alfredo serves as a wise father figure to his young friend who only wishes to see him succeed, even if it means breaking his heart in the process.</p><p>Seen as an example of \"nostalgic postmodernism\", the film intertwines sentimentality with comedy, and nostalgia with pragmaticism. It explores issues of youth, coming of age, and reflections (in adulthood) about the past. The imagery in the scenes can be said to reflect Salvatore's idealised memories of his childhood. Cinema Paradiso is also a celebration of films; as a projectionist, young Salvatore (a.k.a. Totò) develops a passion for films that shapes his life path in adulthood.</p><br/><h3>Releases</h3><p>The film exists in multiple versions. It was originally released in Italy at 155 minutes, but poor box office performance in its native country led to its being shortened to 124 minutes for international release; it was an instant success. This international version won the Special Jury Prize at the 1989 Cannes Film Festival and the 1989 Best Foreign Language Film Oscar. In 2002, the director's cut 173-minute version was released (known in the U.S. as Cinema Paradiso: The New Version), although this was the original version and was the film's premiere at the Europa Cinema Festival, 29 September 1988, in Bari.</p><h4>Director's cut</h4><p>In the 173-minute version of the film, after the funeral, Salvatore notices an adolescent girl who resembles the teenage Elena. He follows the teen as she rides her scooter to her home, which allows Salvatore to contact his long-lost love Elena, who is revealed to be the girl's mother. Salvatore calls her in hopes of rekindling their romance; she initially rejects him, but later reconsiders and goes to see Salvatore, who was contemplating his rejection at a favorite location from their early years. Their meeting ultimately leads to a lovemaking session in her car. He learns that she had married an acquaintance from his school years, who became a local politician of modest means. Afterwards, feeling cheated, he strives to rekindle their romance, and while she clearly wishes it were possible, she rejects his entreaties, choosing to remain with her family and leave their romance in the past.</p><p>During their evening together, a frustrated Salvatore asks Elena why she never contacted him or left word of where her family was moving to. He learns that the reason they lost touch was because Alfredo asked her not to see him again, fearing that Salvatore's romantic fulfillment would only destroy what Alfredo sees as Salvatore's destiny – to be successful in the cinema world. Alfredo tried to convince her that if she loved Salvatore, she should leave him for his own good. Elena explains to Salvatore that, against Alfredo's instruction, she had secretly left a note with an address where she could be reached and a promise of undying love and loyalty. Salvatore realizes that he never found that note, and thus lost his true love for more than thirty years. The next morning, Salvatore returns to the decaying Cinema Paradiso and frantically searches through the piles of old film invoices pinned to the wall of the projection booth. There, on the reverse side of one of the dockets, he finds the handwritten note Elena had left thirty years earlier.</p><p>The film ends with Salvatore returning to Rome and, with teary eyes, viewing the film reel that Alfredo left.</p><br/><h3>Home media</h3><p>A special edition of Cinema Paradiso was released on DVD by Umbrella Entertainment on September 4, 2006. The DVD is compatible with all region codes and includes special features such as the theatrical trailer, the Director's Cut version, scenes from the Director's Cut, the Ennio Morricone soundtrack and a documentary on Giuseppe Tornatore.</p><p>An Academy Award edition of Cinema Paradiso was released on DVD by Umbrella Entertainment on February 1, 2009. It is also compatible with all region codes and includes different special features such as Umbrella Entertainment trailers, cast and crew biographies and the Director's filmography.</p><p>On July 1, 2011, Umbrella Entertainment released the film on Blu-ray. Arrow released a remastered special edition Blu-ray of the film, with both theatrical and extended cuts, in 2017.</p><p>In June 2020, Arrow Films announced a 4K UHD Blu-ray release with both of the aforementioned cuts due for September of that year, although only the 124-minute theatrical cut will be a 4K UHD presentation, the 174-minute Director’s Cut will be included as a Blu-ray presentation only.</p><br/><h3>Reception</h3><p>Cinema Paradiso was a critical and box-office success, making Tornatore internationally known, and is regarded by many as a classic. It is particularly renowned for the 'kissing scenes' montage at the film's end. Winning the Academy Award for Best Foreign Film in 1989, the film is often credited with reviving Italy's film industry, which later produced Mediterraneo and Life Is Beautiful. Film critic Roger Ebert gave it three and a half stars out of four and four stars out of four for the extended version, declaring \"Still, I'm happy to have seen it--not as an alternate version, but as the ultimate exercise in viewing deleted scenes.\" Oddly, despite giving a higher rating to the extended version, Ebert maintained that the theatrical version was superior: \"I must confess that the shorter version of Cinema Paradiso is a better film than the longer.\"</p><p>Review aggregator Rotten Tomatoes reports that 90% of critics have given the film a positive review based on 80 reviews, with an average score of 8.00/10. The critics consensus reads, \"Cinema Paradiso is a life-affirming ode to the power of youth, nostalgia, and the the movies themselves.\" The film also holds a score of 80 based on 21 reviews on Metacritic, indicating \"generally favorable reviews\". The film was ranked #27 in Empire magazine's \"The 100 Best Films Of World Cinema\" in 2010. The famed \"kissing scene\" montage at the end of the film was used in \"Stealing First Base\", an episode of The Simpsons that aired on 21 March 2010, during its twenty-first season. The scene used Morricone's \"Love Theme\" and included animated clips of famous movie kisses, including scenes used in Cinema Paradiso as well as contemporary films not shown in the original film. American progressive metal band Dream Theater 1992 album Images and Words' song \"Take the Time\" features in the lyrics the sentence spoken by Alfredo after the fire, \"ora che ho perso la vista, ci vedo di più! (I can see much clearer now I'm blind)\".</p><p>The film was released twice in Italy before its Cannes win and flopped at the box office both times. After the Cannes win it was re-released and performed steadily however, following its Academy Award success, it was released again and performed better, grossing $5.3 million in Italy. In France, the film ran for over a year, grossing over $19 million. In the United States and Canada, it grossed $12.3 million.</p><h4>Awards and nominations</h4><ul><li>1989: Cannes Film Festival Grand Prix du Jury (tied with Trop belle pour toi)</li><li>Grand Prix du Jury (tied with Trop belle pour toi)</li><li>1989: Golden Globe Awards Best Foreign Language Film</li><li>Best Foreign Language Film</li><li>1989: Academy Awards Best Foreign Language Film</li><li>Best Foreign Language Film</li><li>1990: César Awards César Award for Best Poster: Jouineau Bourduge</li><li>César Award for Best Poster: Jouineau Bourduge</li><li>1991: BAFTA AwardsBAFTA Award for Best Film Not in the English Language Best Actor: Philippe Noiret Best Actor in a Supporting Role: Salvatore Cascio Best Original Screenplay: Giuseppe Tornatore Best Film Music: Ennio Morricone and Andrea Morricone</li><li>BAFTA Award for Best Film Not in the English Language</li><li>Best Actor: Philippe Noiret</li><li>Best Actor in a Supporting Role: Salvatore Cascio</li><li>Best Original Screenplay: Giuseppe Tornatore</li><li>Best Film Music: Ennio Morricone and Andrea Morricone</li></ul><br/>"
  },
  "errorMessage": ""
}