{
  "imDbId": "tt0268978",
  "title": "A Beautiful Mind",
  "fullTitle": "A Beautiful Mind (2001)",
  "type": "Movie",
  "year": "2001",
  "items": [
    {
      "publisher": "Time",
      "author": "Richard Schickel",
      "link": "",
      "rate": "100",
      "content": "The result is mainstream moviemaking at its highest, most satisfying level."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Edward Guthmann",
      "link": "",
      "rate": "100",
      "content": "Inspiring and largely unsentimental, this is as much a love story as a tale of courage."
    },
    {
      "publisher": "Chicago Tribune",
      "author": "Michael Wilmington",
      "link": "",
      "rate": "88",
      "content": "Though the role might seem a real stretch for an actor who just won an Oscar for his Charlton Heston turn as Maximus in \"Gladiator,\" he and the movie ace the test."
    },
    {
      "publisher": "Boston Globe",
      "author": "Jay Carr",
      "link": "",
      "rate": "88",
      "content": "The film makes more apparent than ever that Howard is quite underrated as a filmmaker, possibly because he's been hidden in full view in the mainstream for so long."
    },
    {
      "publisher": "Entertainment Weekly",
      "author": "Lisa Schwarzbaum",
      "link": "",
      "rate": "83",
      "content": "Crowe sometimes summons up one of the most powerful depictions of mental illness I have ever seen with barely an eyelid flicker separating manifestations of sickness from utterly sane displays of creative concentration."
    },
    {
      "publisher": "Slate",
      "author": "David Edelstein",
      "link": "",
      "rate": "80",
      "content": "As Nash gets closer to Crowe's own age (and level of dissipation), the performance settles down and becomes first credible and then overwhelming. This is a stupendous piece of acting."
    },
    {
      "publisher": "Philadelphia Inquirer",
      "author": "Steven Rea",
      "link": "https://www.inquirer.com/entertainment/?id=40181&amp;reviewId=3365",
      "rate": "75",
      "content": "What began as a bold and thrilling story descends into Hollywood cliché. But Crowe and Connelly's work rises above the mush. They make A Beautiful Mind go."
    },
    {
      "publisher": "Wall Street Journal",
      "author": "Joe Morgenstern",
      "link": "",
      "rate": "70",
      "content": "Howard, and the screenwriter, Akiva Goldsman, have used the book as nothing more than their jumping-off point for an erratic work of fiction that's part mystery thriller and part Hollywood schmaltz."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "50",
      "content": "Instead of an originally conceived movie that reflects Nash's troubled but brilliant mind, we have one of those formulaically rendered Important Subject movies -- the kind that seem exclusively designed for Best Picture nominations."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "https://www.csmonitor.com/2001/1228/p15s1-almo.html",
      "rate": "50",
      "content": "While it's a splendidly acted film, A Beautiful Mind is also a wasted opportunity."
    }
  ],
  "errorMessage": ""
}