{
  "imDbId": "tt0046268",
  "title": "The Wages of Fear",
  "fullTitle": "The Wages of Fear (1953)",
  "type": "Movie",
  "year": "1953",
  "items": [
    {
      "username": "dfranzen70",
      "userUrl": "https://www.imdb.com/user/ur0543054",
      "reviewLink": "https://www.imdb.com/review/rw3501763",
      "warningSpoilers": false,
      "date": "9 July 2016",
      "rate": "8",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Tense, fearless",
      "content": "In The Wages of Fear, four men in a remote South American town have the enviable task of transporting a metric buttload (technical term) of nitroglycerin across mountainous roads in poor condition. It's a taut, superbly suspenseful thriller, guided with a steady hand by director Henri-Georges Clouzot, who would go on to direct the classic Diabolique in 1955.Yves Montand, in a rare dramatic role, plays Mario, the ostensible protagonist of our tale. He's been stuck in this backwater for some time, but it costs a lot of money to get out – plane fares are through the roof, and there's no train, and there's no neighboring village. In short, you're stuck there until you can buy a ticket – and pay for a passport, of course.Mario spends his days looking for work, wooing tavern worker Linda, and despairing about the lack of work. There's an American oil company in town, but they're no longer hiring. His monotonous lifestyle is interrupted by the arrival of fellow expat Jo (Charles Vanel), a tough-looking older man who quickly wins Mario's favor at the expense of the rest of the men in town.The oil company, in fact, has its own problem – one of their large derricks has exploded, causing a huge oil fire. Company man Bill O'Brien decides to send two trucks loaded with nitro from the town up the mountain to the derrick. (The eventual idea is to set off charges, which will somehow contain or extinguish the fire.) O'Brien has no trouble scaring up volunteers for the task, since the men of the town are largely unemployed. Four men will be selected to take the two trucks. Only one truck is needed; the second is truly just in case there's an accident with the first one. The men will receive $2000 when the work is finished, more than enough to secure passage out of the backwater.Mario and Jo are chosen, as are Mario's roommate Luigi (Folco Lulli) and German expat Bimba (Peter van Eyck). The two trucks depart early in the morning, full of gas and of nitro. Danger awaits.Theirs is not an easy task. The road is full of ruts. In one place, the wooden deck that trucks use to make a sharp turn up the mountain has been damaged from disuse. It's hot and muggy. And one has to be very, very careful, as even the smallest bump might set the whole shebang off. There's also tension among the four drivers – Luigi is unhappy that Mario is spending more time with Jo than with him, Mario is unhappy with what he perceives as Jo's cowardice. Bimba seems to get along with everyone, though.The whole time I was watching this movie, I was certain not all four were going to make it. I will not spoil what is now a sixty-three-year-old movie, but I was still genuinely surprised by the ending. This ain't no fairy tale or sitcom. This is a movie about desperation, redemption, sacrifice, and comeuppance. It's not necessarily about justice.The Wages of Fear is a singularly terrific movie from start to finish, exquisitely shot and expertly written. Its money maker is its tension, something present here in spades. The writing is impeccable; even personality changes make perfect sense within the film's context. There are intricacies within a straightforward plot. This is a must see for lovers of thrillers."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1524504",
      "warningSpoilers": false,
      "date": "19 November 2006",
      "rate": "9",
      "helpful": "65 out of 73 found this helpful.",
      "title": "A gripping action film and a powerful study of failure",
      "content": "\"The Wages of Fear\" was awarded by unanimous verdict the Grand Prix at 1953 Cannes Film Festival where it won over 27 films, some of which were made by Jacques Tati, Alfred Hitchcock, and Luis Buñuel. Cluozot's own screenplay (based a novel by George Arnaud) focuses on four down-and-out European adventurers (Yves Montand, Folco Lulli, Peter Van Eyck, Charles Vanel) who stuck nearly penniless in a festering town in an unnamed South American country. An oil company need a load of highly dangerous and explosive nitroglycerin to be delivered to a remote well fire 300 miles away burning out of control. The route is through jungles and over crude and treacherous mountains and those men are desperate enough to take the chance. None of these men is heroic or generous, they are in for the money. The four were chosen by the managers of oil company because \"if something happens to them, no one would care, they have nobody to worry about them\". Henri-Georges Clouzot's view on humanity is not particularly optimistic but he finds a way to make a viewer care about disenchanted but desperate characters. Thanks to Clouzot's ability to create not only a gripping action film but a powerful study of failure, the four men will stay for long time in our memory."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4178839",
      "warningSpoilers": false,
      "date": "26 May 2018",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Enthralling, nail-biting drama",
      "content": "In a remote South American town, four men are hired by an American oil company to transport two truckloads of nitroglycerin to an oil field, to put out a fire. It's a very hazardous task - the nitroglycerin can explode for the slightest reason, the road is treacherous and the journey is a long one. However, the money is very good and their current situation in the town is rather dire - they will do anything to improve their situation. Great thriller-drama by French director HG Clouzot. Starts slowly and even once the hazardous journey is in progress, it doesn't seem that brilliant. However, Clouzot builds the tension and from a point it is absolutely nail-biting stuff. The scene with the boulder has to be one of the most tense movie scenes I've watched in my life. A good character-drama too - the way the characters develop and the relationships between the four change adds a new dimension to the drama and makes for very engaging viewing.Not perfect though. Some events and plot devices don't make much sense, though aren't crucial to the movie. The ending felt quite silly and contrived. A similar result but with a more plausible, less predictable, less stupid way of getting there would have seen the movie get a perfect score."
    },
    {
      "username": "Infofreak",
      "userUrl": "https://www.imdb.com/user/ur0381265",
      "reviewLink": "https://www.imdb.com/review/rw0050232",
      "warningSpoilers": false,
      "date": "3 February 2003",
      "rate": "",
      "helpful": "61 out of 77 found this helpful.",
      "title": "A brilliant thriller. One of the most suspenseful and exciting movies ever made!",
      "content": "Clouzot rarely gets the attention he deserves. He made not one, but two of the greatest thrillers of all time, 'Les Diaboliques' and 'The Wages Of Fear', both perfect examples of how to make genuinely suspenseful movies that build up an amazing amount of tension. Most so-called thrillers made in Hollywood these days are thrillers in name only and could learn a lesson or two from these movie classics. 'The Wages Of Fear' could even be described as an action movie, but it is a CHARACTER DRIVEN action movie, and that's what makes it so special. Modern audiences with MTV attention spans might find the plot a little slow, but I think the first half of the movie, which deals with the motley collection of exiles in a poor Latin American town, is not only fascinating in itself, but really makes a massive impact on the second half. By taking his time introducing the characters and exploring their relationships and possible motivations, Clouzet adds depth and meaning to the rest of the exciting story, something very rarely achieved in this type of movie since. The cast, every single one of them, are flawless. The four leads, Mario, the fairly decent guy played by yves Montand, his new best friend the shifty M. Jo (Charles Vanel), his old pal the kind hearted Luigi (Folco Lulli), and the enigmatic Bimba (Peter van Eyck), are all brilliant. Great performances, taut and imaginative direction, crisp and impressive cinematography, and a handful of the most riveting sequences ever committed to film make 'Wages Of Fear' a truly unforgettable experience. Suspense movies don't come much better than this! Simply a masterpiece."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1127592",
      "warningSpoilers": false,
      "date": "16 July 2005",
      "rate": "9",
      "helpful": "18 out of 23 found this helpful.",
      "title": "it starts off slow and ends with a bang!",
      "content": "The first quarter of this movie was not particularly exciting but did set the stage for the rest of the movie. So, if you initially feel bored--STICK WITH IT!!! The plot is so incredibly simple that it seems like it must be a pretty boring picture: an oil company in South America needs to transport shipments of nitroglycerin 300 miles to an oil fire ASAP. However, due to the rotten condition of the roads and equipment, the trip seems like certain death, so they get some hungry out of work guys to do this. It doesn't sound very interesting, I'm sure, but it is. The writing, editing, pacing, acting and direction are PERFECT during this LONG trip. So many times, I found myself tensing up or moving in my seat as each near-death event occurred. The only negative? Well, the ending might be a bit of a letdown for some (though, in hindsight, I liked it despite being a bit of an anticlimax)."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw3864971",
      "warningSpoilers": true,
      "date": "22 November 2017",
      "rate": "7",
      "helpful": "14 out of 17 found this helpful.",
      "title": "\"Well, now you've been warned. You're taking your lives in your own hands.\"",
      "content": "As a kid watching TV shows and movies in The Fifties, I can't tell you how many I ran across that had nitroglycerine as part of the plot. There were at least a couple of Westerns along with straight dramas, but it didn't seem to matter the genre. A souped up hot rod carrying four quarts of nitro that just happened to be hanging around was used by the main character to destroy \"The Giant Gila Monster\" in a campy 1959 monster flick.Whatever the fascination with nitroglycerine, and it had to be it's unpredictability, the idea of carrying around a ton of it was the premise of this film, \"The Wages of Fear\". Actually, it was two trucks carrying a ton of nitro between them, I guess to heighten the drama and provide twice as much in the way of nerve shattering tension. The thing is, unlike a host of reviewers who hold the picture in the highest regard, I really didn't get a whole lot out of the movie.For starters, the first forty five minutes or so was used to introduce characters and situations that eventually had nothing to do with the outcome of the story. Yves Montand portrayed his character Mario well enough, but the guy was just a reprobate for the most part. He consistently berated the lovely saloon gal Linda (Vera Clouzot), and actually threw her in the dirt when he drove off on the mission to deliver the goods. Same thing with his partner Jo (Charles Vanel), who started the picture as one of film's ruggedest macho men, and turned into a cream puff when the going got tough. I just didn't understand how characters would just suddenly switch their basic personas as the story progressed.Then there's the adventure on the road. Maybe I missed it, but what was the rationale for that wooden bridge turnabout that both drivers had trouble with? Was it that the size of the trucks wouldn't allow for a smooth ninety degree turn? Even so, after the first mishap with the truck driven by Bimba (Peter van Eyck), why would Mario feel compelled to back his truck right to the very edge of the unstable platform? It didn't make sense to me.And then, showing his contempt for Jo, Mario runs him over in that manic oil pit scene. I have to admit, that was the stunner for this viewer. That scene had both actors earning their paycheck, and it rivals the clay pit scene in \"The Defiant Ones\" with Sidney Poitier and Tony Curtis for sheer insanity, in another Fifties action flick. Both are just hellacious, you be the judge.Except for that scene, most of the rest of the story didn't hold the same amount of interest for me. When the truck with Bimba and Luigi (Folco Lulli) blew up, I thought that it would have been better served if there was a close-up of the two men in the truck hitting a rut and offering a grimace just before fading to black and then showing the explosion. That would have better sealed their fate; I had to wonder why no one thought of it.With all that, I don't mean to imply this was a terrible picture. It's watchable enough, but just doesn't seem to measure up to the accolades it's given as an IMDb Top 250 film. But that's the case for a lot of others as well, so in this case, maybe it's just me. On another day I might have seen it in an entirely different light."
    },
    {
      "username": "DennisLittrell",
      "userUrl": "https://www.imdb.com/user/ur0226855",
      "reviewLink": "https://www.imdb.com/review/rw0050220",
      "warningSpoilers": false,
      "date": "7 May 2002",
      "rate": "10",
      "helpful": "130 out of 175 found this helpful.",
      "title": "Macho naturalism extraordinaire",
      "content": "This is an extraordinary movie. From the opening scene showing the squalor of a Latin American town with filth and vultures in the street and naked children begging for food amid the oppressive, fly-stirred heat, to the finale on a winding mountain road, it is just plain fascinating. True, some of the action does not bear close scrutiny. One does not siphon nitroclycerine nor does one avoid potholes or bumps in the road by driving at forty miles per hour. No matter. Let's allow a little license. And the title doesn't entirely make sense because the wages of sin are death, but the wages of those who followed their fear and did not seek to drive a nitroclycerine truck over 300 miles of bad road are life. Again, no matter.This is such an original movie, every scene like little or nothing you've ever seen before (and for sure will never see again), that the little inconsistencies and some stretching of what is possible are not important. This is man against nature, man against himself reduced to a simple task. It is life in the raw. One mistake and you are dead.Yves Montand has the lead as Mario, a Frenchman stranded in this god-forsaken town with only one way out: get enough money to pay for airfare. Charles Vanel is the older, tin-horn dandy who ends up with a case of the shakes. Peter Van Eyck is the man with the nerves of steel who finds this little adventure a piece of cake after forced labor in the salt mines for the Nazis. And Folco Lulli is Luigi, the happy, singing baker who hopes to return to Italy with the two thousand dollars they are paying him to drive the nitro-loaded truck.This is a film depicting the primitive nature of a macho mentality. There's a lot of posturing. Every event is a potential test of manhood. Status and privilege are flouted. The weak and the poor do not inherit the earth.Henri-Georges Clouzet directs and somehow manages to come up with a work of genius. One wonders how. The story, on the face of it, would seem to belong in the slush pile of a ten-cent pulp fiction mag from the 1930's. The acting is good, very good in places, but not great. The cinematography is straightforward, but nonetheless very effective. It is lean and focused always, showing us what needs to be seen without drawing attention to itself: the invisible style, which is the best. Clouzet's direction is characterized by a vivid depiction of things that we can feel: the mud and filth in the streets, the desperation and the boredom, the cruelty and meanness of men, the oil on their bodies, the singular fact of a ton of nitro in the back seat so that every move is a neuron-exposing adventure. I think that the visceral experience from beginning to end and the fine pacing are the essence of what makes this a great film.Clouzet's wife, Vera Clouzet, plays Linda who first appears scrubbing the floor in an open-air bistro. She is rather extraordinary herself, finely made up and creamy white like a star of the silent film era. She grovels a lot, especially for Mario. She provides the counter-point, the contrast for the testosterone action of the movie.No student of film should miss this. It would be like missing Citizen Kane or Dr. Strangelove or especially The Treasure of the Sierra Madre, which it vaguely and strangely resembles. \"La salaire de la peur\" is, regardless of its flaws, one of the best ever made.(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)"
    },
    {
      "username": "howard.schumann",
      "userUrl": "https://www.imdb.com/user/ur0491610",
      "reviewLink": "https://www.imdb.com/review/rw0050231",
      "warningSpoilers": false,
      "date": "4 November 2002",
      "rate": "",
      "helpful": "44 out of 59 found this helpful.",
      "title": "Riveting and Involving",
      "content": "In the opening scene of Wages of Fear (1953), director Georges Henri-Clouzot provides an inkling of the kind of claustrophobic ride we are in for. In a steamy, impoverished Latin American town called Las Piedras, insects grope clumsily in the dust, struggling to escape the strings that children have tied to them. People from all over the world congregate in the streets and bars and the air is thick with choking dust. Clouzot makes clear the desperation of the residents, \"It's like prison,\" explains one of them. \"Easy to get in, but escape is impossible.\" The Southern Oil Company (SOC - same initials as Standard Oil) runs the town and enjoys its profits while the villagers are compelled to work odd jobs just to stay alive. After a fire breaks out at one of the oil fields killing many workers, the anti-union American boss seeks experienced drivers from among the townspeople to put out the fire. It is here that the anti-American flavor runs thick and where much of this part of the film was originally excised for American audiences (but has since been restored). Four men, desperate to escape their trap, agree to drive a truck loaded with nitroglycerine 300 miles over treacherous mountain roads in the hot sun for the sum of $2000 each. Transporting the nitroglycerine for them is a way out of hopelessness -- either through a big paycheck or through sudden death, with the latter appearing the more probable. Though sadly past the point in time when we can still be shocked over gangster capitalism and men selling out for money, the story is nonetheless compelling. The four who are chosen to go on this fool's errand include Mario, a young Corsican played by Yves Montand in a role that brought him widespread attention. He is carrying on an affair with a local servant girl, Linda (Vera Clouzot) who is in love with him. His treatment of her, however, is atrocious and reflects the attitude of the male-dominated society they live in. Also picked to drive one of the trucks is Jo, an aging Parisian small-time crook (Charles Vanel), Luigi (Folco Lulli), an Italian with less than a year to live, and an ex-nazi pilot (Peter van Eyck). This unlikely group will play a cat-and-mouse game with death for the remainder of the film.Clouzot depicts several incidents that bring the tension to the boiling point. In the first one, the trucks must travel at least 40 mph over a pot-holed stretch of road to prevent the vibrations from setting off the nitroglycerine. The second involves a sharp, narrow turn that requires the trucks to back up onto an unstable, rotten wooden platform causing it to buckle. Almost immediately afterwards, the trucks are stopped by a huge boulder in the middle of the road and must siphon off some of the nitroglycerine to blow it up. Finally, Mario must deftly maneuver the truck over a depression of spilled oil with the wheels stuck in reverse. As the long treacherous journey unfolds, roles are reversed between Mario and Jo as Mario becomes the strong dominant one and Jo, in Charles Vanel's brilliant performance, becomes shaken, fearful, and docile. Their relationship becomes the highlight of the film as the two become mutually dependent on each other for survival and comfort. I found Wages of Fear to be an involving experience that kept me riveted throughout, though I did sense that there would not be a two and a half-hour film unless somebody survived. Although the unexpected plot twists were gripping, the best part of the film for me was the revelation of each character when faced with fear. It reminded me of the \"Treasure of the Sierra Madre\", a film that also showed men discovering the truth about themselves and others while pursuing their dream of wealth. Wages of Fear lived up to its accolades, but for me the discordant ending clashed both with the tone of the film and with my experience of the universe not as arbitrary or capricious but as filled with meaning and purpose."
    },
    {
      "username": "Vartiainen",
      "userUrl": "https://www.imdb.com/user/ur30163554",
      "reviewLink": "https://www.imdb.com/review/rw3735240",
      "warningSpoilers": false,
      "date": "20 June 2017",
      "rate": "7",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Intense, hair-raising experience",
      "content": "The setting is a dead end South American village in the middle of nowhere. Its only distinguishing feature being an American oilfield some distance away from the village. But then an accident causes a fire to spread into the oil and the only way to stop it is to literally blow it out. With nitroglycerin. The only problem being that they don't have the safety equipment needed to transport the nitro from the village. But \"luckily\" such villages have no shortage of men at the end of their ropes, willing to do anything for a final paycheck.And that's essentially The Wages of Fear in a nutshell. It's about human desperation and about ever-mounting stakes as the tension keeps rising and rising. Every little tremor or stone on the road could send all four men into the sky in a fiery explosion of primordial forces. And even though you're safely hunkered on your coach, behind the reality line of a TV screen, you can't help but sweat in anguish alongside these men. The film is that well shot.That being said, it takes its sweet time getting there. The first portion of the film is spent getting to know the village and these four wretched souls. And while they are interesting personalities, played by talented actors, it still drags quite a bit. And that's partly because at that point you don't have much of an idea where the film is going. Most of the loose threads get tied up towards the end, but a good half of the film is a jumbled mess.But that other part where they're actually transporting the explosives is so good that it more than makes up for the weaker first half. Recommended for all fans of intense."
    },
    {
      "username": "lasttimeisaw",
      "userUrl": "https://www.imdb.com/user/ur3967726",
      "reviewLink": "https://www.imdb.com/review/rw4215258",
      "warningSpoilers": false,
      "date": "25 June 2018",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "THE WAGES OF FEAR denotes a hefty import of Clouzot's unrivaled cinematic legacy, that reinvented narrative cinema with its high-octane vicariousness",
      "content": "A 4K-restoration screening in the Shanghai International Film Festival, Clouzot's pièce-de-résistance is a vehement testimonial of his aptitude in orchestrating white-knuckle thrills and chills, meanwhile, it is also a scorching dissection of human's abject fear and cruelty. Set up in the boondocks of Las Piedras, allegedly Venezuela, a posse of foreign deadbeats is vegetating under the blistering sun, jobless and hankering for a plane ticket to leave the purgatory, they are churlish opportunists and rowdy bar brawlers, among them stands the French ladies' man Mario (a sexpot Montand), who toys with the affection of the barmy barmaid Linda (Mme Clouzot in her film debut), and has no qualms about jilting his benevolent Italian roommate Luigi (Lulli, truly the salt-of-the-earth type), to hobnob with his blow-in compatriot, the ex-gangster Jo (Vanel), fancying an easy way out, but the truth is, Jo is also at the end of his rope. A perilous job opportunity emerges when the American corporation Southern Oil Company needs to transport nitroglycerin to extinguish a massive fire in the oil fields, four drivers are chosen to drive two trucks in conveyance of the highly explosive products in a 300-mile rugged haul, with no safety precautions at hand The sideswipe of American capitalistic avarice and callousness is pretty much in your face, yet, for these hardscrabble expatriates, $2,000 is an offer too tempting to refuse, after some backhanded maneuver Jo gets the last spot to drive with Mario, while Luigi is paired with Bimba (Van Eyck, stolid and unbelievably cool), a taciturn German who endures a dark past.Henceforth, Clouzot viz. the Gallic Hitchcock takes audience on an ensorceling edge-of-the-seat road trip where one single substantial bump can cause their trucks to be blown up to smithereens, like a ticking bomb hanging over our heads. Compelling set pieces, a gripping turn on the precipice, and detonating an obstructing rock, one mobile, one static, are textbook paragon of tension-building and suspense-eliciting, not to mention the effect graced by Georges Auric's captivating accidental music.However, physical obstacles aside, it is the mental exertion that takes a heavy toll en route, Jo, the hard-nosed, savvy spiv, gradually yields to the mounting fear and his cowardice starts to turn Mario from his toady to a hectoring boss, sending contempt and verbal abuse to a humiliated Jo, up to a merciless last-ditch attempt knowingly leaving him mortally wounded, here Clouzot's astutely differentiates true grit from Dutch courage, and examines the phallocratic pride with utter acumen, its reverberations is astounding, much also owing to the two protagonists' unyielding tours-de-force, especially Vanel, completely devotes himself to the grueling condition (that petrol wallowing sequence is awestruck), and more credibly, he tenaciously enlivens Jo's transformation from a despicable wide boy to a resigned old geezer, for whose aftermath we feel deeply sympathetic. Our compassion towards Montand's Mario also undergoes a sea change when the plot thickens, his raffish charm morphs into an admirable determination midway, until his ruthless color takes the upper hand, Montand perfectly showcases his marquee idol charisma, and his baptism-of-fire triumph is unqualifiedly hard-earned, but Clouzet ratchets up the morbid irony in its dizzy ending, as augured by its opening, the quartet's fate is hanging on the same thread, negligible, expendable and inescapable.Incontrovertibly, THE WAGES OF FEAR is a daunting progenitor for late comers to emulate but impossibly to surpass, denotes a hefty import of Clouzot's unrivaled cinematic legacy, that reinvented narrative cinema with its high-octane vicariousness."
    },
    {
      "username": "Spleen",
      "userUrl": "https://www.imdb.com/user/ur0035229",
      "reviewLink": "https://www.imdb.com/review/rw0050219",
      "warningSpoilers": false,
      "date": "2 December 2001",
      "rate": "10",
      "helpful": "67 out of 95 found this helpful.",
      "title": "The kind of film that instantly announces that it's the best of its kind",
      "content": "This is richer, tenser, more atmospheric, and in all ways a better film than Clouzot's next one, \"Les Diabolique\" - which is saying a lot. I've never understood why Clouzot isn't more highly regarded. Indeed, for a long time I simply couldn't believe that he wasn't.One charge that hangs over his head is misogyny. With regards to \"Les Diabolique\" this is simply ridiculous; with regards to \"The Wages of Fear\", I can see how one could harbour the uncomfortable feeling that there is, perhaps, something in it. But what, really, does the evidence amount to? The fact that one of the heroes is inexcusably cruel to his girlfriend? It's not as if the film endorses this, or invites us to take pleasure in it, or even, for that matter, allows us to. The characters are all flawed, and the film doesn't seek to deny it. It does, however, make an attempt to explain it. That town in the middle of nowhere is, we feel, really in the MIDDLE of nowhere; it must be the dustiest and most demoralising place on Earth. After a while we feel as if we could start kicking someone, just to break the monotony.There's no doubt that the initial monotony gives the rest of the film half its strength. William Wyler once said that if you want to surprise or shock an audience the best thing you can do is bore them half to death beforehand - and although I can think of absolutely no reason why this should be so, allowing for a little exaggeration, it's true. The seemingly aimless opening sequences help make every single frame, from the moment the nitro-glycerin is mentioned, electric.So much is, in retrospect, amazing. There's the way Clouzot manages to show us the humanity in these seemingly squalid people. (Even the oil magnate, just when we think he's the world's most heartless capitalist, reveals he has a heart with an unexpected remark, and yet the remark doesn't feel at all out of character - it's the kind of masterful characterisation film-goers live for.) Then there's the obstacles these drivers must face. All are memorable; most are so perfectly realised they deserve to be called mythic."
    },
    {
      "username": "dtb",
      "userUrl": "https://www.imdb.com/user/ur0292400",
      "reviewLink": "https://www.imdb.com/review/rw1066538",
      "warningSpoilers": false,
      "date": "24 April 2005",
      "rate": "9",
      "helpful": "74 out of 95 found this helpful.",
      "title": "The Wages of Fear Vs. Sorcerer",
      "content": "Georges Arnaud's novel LE SALAIRE DE LA PEUR has been filmed twice, by Henri-Georges Clouzot as THE WAGES OF FEAR (1953) and by William Friedkin as SORCERER (1977). While both films are worth seeing, the earlier version is the one regarded as a classic, and rightly so. Although SORCERER goes into more detail about the political climate and the various misdeeds that led the four desperate protagonists to the South American hellhole where they accept high-paying but life-risking jobs driving nitroglycerin through treacherous terrain, WAGES... distinguishes the men's personalities better, giving the audience more rooting interest in them. Both films have excellent casts, with charismatic leads in Yves Montand (WAGES...) and Roy Scheider (SORCERER), plus WAGES... also provides feminine charm in the form of beguiling Vera Clouzot as the café waitress who loves Montand. Both films have tense action sequences as well, but somehow for all the staging and skillful editing, SORCERER's action scenes seem strangely slow, slogging along in the mud just like the protagonists in their less-than-state-of-the-art trucks. Both versions have enough good things in them to be worth a look, but if you only have the time and resources to check out one of them, it's WAGES... that really pays off!"
    },
    {
      "username": "evanston_dad",
      "userUrl": "https://www.imdb.com/user/ur4532636",
      "reviewLink": "https://www.imdb.com/review/rw2252577",
      "warningSpoilers": false,
      "date": "20 May 2010",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "To Fear Is to Be Human, But Not for These Guys",
      "content": "Four unsavory down-and-outs whiling away their hours in a poverty-stricken South American village accept the fool's errand of transporting two truckloads of nitroglycerin across terrible roads to an oil company accident site. Once some preliminary character development is disposed of and the men are on their way, the movie settles into one hell of a nail-biter, sort of a French, 1950s inversion of \"Speed\" -- if they go too fast, or make one false move, they go up in flames.The first hour of \"The Wages of Fear\" is a marvel of production design. Director Clouzot packs his frame with things to look at, and the village, though built specifically for the movie, reeks of authenticity. The mise-en-scene alone is fascinating to watch -- some incidental action going on in the background of one shot (like a hothead smacking his girlfriend) is then picked up as the principal action in the next scene. And the Blu-Ray looks terrific; every mud puddle and heat-dazed fly is clear as a bell.The second half of the film is pure suspense. It's a study in male machismo and one-upsmanship. The oldest member of the group, who struts around like Mr. Big Shot in the town when he has nothing to fear, crumples like a baby when faced with the prospect of death for real. But the movie doesn't let us be disdainful of him. As he says at one point, he's scared because he has enough life experience to know what death is, unlike the young hotshots who think to be frightened is to be weak.Clouzot doesn't seem to have a rosy outlook on life, if the film's fatalistic ending is any indication. Or maybe he's just making the point that life is futile for men who approach it in a certain way.\"The Wages of Fear\" feels way ahead of its time, both in style and substance. I had trouble believing that it was actually made in 1953.Grade: A"
    },
    {
      "username": "barleeku",
      "userUrl": "https://www.imdb.com/user/ur4676743",
      "reviewLink": "https://www.imdb.com/review/rw1190062",
      "warningSpoilers": false,
      "date": "6 October 2005",
      "rate": "10",
      "helpful": "116 out of 143 found this helpful.",
      "title": "One of the greatest movies ever made",
      "content": "This movie is astonishing, a gritty story filmed in an ultra-real style that relies simply on the beauty of lighting and film to achieve its stunning effects. It seems from another world, which in a way, it is. The acting is superb: Montand's Mario is full of jerky movements and intense impulses but always maintains his Gallic savoir-faire, while Charles Vanel as Jo brings, at first at least, a type of macho to the screen that modern movie-makers simply do not comprehend. The rest of the cast, especially the camp chief, Luigi, and Peter van Eyck as Bimba are incredible, as is Vera Clouzot who is incomprehensibly but believably upbeat and innocent - and totally gorgeous - in the midst of the hellhole of a town they're all stuck in. Clouzot's directing is flawless - I don't think anyone has ever squeezed more tension with just a few essential scene elements. The trucks wheeze and grunt as well as they ever have in the movies - the only comparison is Spielberg's early gem, \"The Duel\", but Clouzot's automotive cinematics outdo even Spielberg. The stripped down existentialism of the characters, the starkness of their shared dilemma, the grim and grimy scenery, and the cinematography itself are all of a piece. The latter is what elevates this movie to the very top rank, including some of the most dramatic and effective black and white shooting I've ever seen. Yet it never becomes mannered or gratuitous - it is orchestrated with the rise - and rise! - of tension in the film. The final scene takes on a surreal as opposed to ultra-realistic quality that has its own logic. One last word about the acting - we don't see anything like it anymore. The self-conscious mannerism of method acting (which has had its own triumphs) and the toxic awareness of everyone from the actors to the audience, the camera, directors, etc. that each actor is a celebrity and potential artiste, has ruined that conviction that actors were once larger than life people before they went on-screen, that they came to acting as an outcome of living rough, unadorned, and yet imaginative lives as opposed to shooting for fame and fortune and celebrity within an artificial corporate star-making incubator."
    },
    {
      "username": "Nazi_Fighter_David",
      "userUrl": "https://www.imdb.com/user/ur0176092",
      "reviewLink": "https://www.imdb.com/review/rw1237988",
      "warningSpoilers": true,
      "date": "11 December 2005",
      "rate": "8",
      "helpful": "35 out of 52 found this helpful.",
      "title": "A great depiction of greed with the corrupting influence of capitalism disguised as an adventure film...",
      "content": "In Clouzot, relationships are arenas of conflict: violent, callous, and often destined to sink into a whirlpool of deceit and destructive cruelty Clouzot forms with \"The Wages of Fear\" two teams of four desperate European expatriates who agree to drive two trucks of nitroglycerine across miles of rocky mountain matched with craters to a site of an oil refinery fire so that the oil company can then blow the pipeline and put out the blaze... The audaciously slow, atmospheric opening establishes both characters and the malignant influence of US oil interests in a dusty South American village, before the odyssey begins The tension never stumbles: friendship falls prey to financial greed, honor to a sweaty fear of sudden death"
    },
    {
      "username": "Prismark10",
      "userUrl": "https://www.imdb.com/user/ur4569900",
      "reviewLink": "https://www.imdb.com/review/rw4261081",
      "warningSpoilers": false,
      "date": "31 July 2018",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The road to danger",
      "content": "In a shanty town somewhere in Latin America, men come from all over the world to run away and hide. Jobs are scarce and hunger is common. They are free to walkabout but soon realise that the town is one big prison as any of the men lack money to get a ticket to fly out of here.Salvation comes in the form of an oil field fire several hundred miles away. The task is to drive two trucks packed with nitroglycerine explosives to put it out, but the roads are treacherous one nasty bump and the truck can go boom. Hopefully one of the trucks can make it through, the prize is $2000 each to any of the drivers make it to the oil field fire and deliver their cargo.Corsican Mario and the much older Jo drive the heaviest truck. Mario flirts with the waitress in the local bar. Jo is a new arrival on the run from Paris with a reputation as a gangster. However once they start their treacherous journey, Jo gets the shakes and is frightened. It is Mario who is determined to finish the journey.Director Henri-Georges Clouzot made a classic film of men putting their lives at risk for money but it is also a character study as well. Mario is at first in awe of Jo as he arrives in the small town. Jo persuades Mario to get on this venture and he will show him the ropes. When the drive begins, Mario is initially frightened but gets the upper hand and starts to bully Jo around as age has finally caught up with him and Jo is scared.The film starts off in a leisurely manner as we see these disparate group of men, bored, causing trouble at the local bar. The tension soon mounts as four of the men begin their dangerous journey."
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw1102927",
      "warningSpoilers": false,
      "date": "14 June 2005",
      "rate": "9",
      "helpful": "10 out of 14 found this helpful.",
      "title": "An intense lesson in suspense",
      "content": "Henri-Georges Clouzot is probably most famous for his atmospheric mystery drama 'Les Diaboliques', but just as good is this film; Wages of Fear. The film gives a commentary on the things that people will do for money, and it follows a treacherous journey across South America for two two-men teams of truckers transporting nitroglycerine across the continent for an American oil company, on the promise of $2000 when they reach their destination. The men taking this task on know very well what the risks are, but they decide to do it anyway just because they need the dough. Rather than just feeding us this premise, however, the great maestro has opted to make sure that we fully understand the situation that our protagonists are in. The first hour of the film just sees the main characters in their native village, scrimping and slowly killing themselves just to make enough money to live on. These guys have to drink lemonade when they go to their local drinking establishment, and this image of themselves is putting them on the back foot further still, as no one in the town will employ the people that they see as tramps. This back building gives the audience something that the main crux of the story wouldn't have otherwise; and that's understanding from the audience.Once the action starts properly, Clouzot really lets rips with his awesome directorial talent. Like he did with Les Diaboliques two years later; he really shows that he knows the meaning of suspense. The nitroglycerine loaded trucks in the movie could explode with the slightest vibration, and once again Clouzot makes sure that you understand the situation. The movie firmly balances itself on a short string, and any minute the leads could go up in flames; which gives the action a very potent degree of tension and suspense at all times, even when there isn't all that much going on. There are some very good stunts in the movie, however, and things such as the oil lake and the huge boulder in the middle of the road represent the best of them. The characters are both well introduced and well rounded, and Clouzot has given each of the four main men in the film their own distinctive character and because of the extensive situation building that the director gave us towards the start of the movie, we always care for them; which helps the movie no end when it comes to the more touching moments of the story. On the whole, this is a GREAT motion picture. It's a lesson in suspense and it's a film that anyone who considers themselves to be a fan of thrillers should see."
    },
    {
      "username": "rooprect",
      "userUrl": "https://www.imdb.com/user/ur2904674",
      "reviewLink": "https://www.imdb.com/review/rw5551443",
      "warningSpoilers": false,
      "date": "14 March 2020",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Watching a truck drive at 6 mph will have your pulse going 120 bpm",
      "content": "My title is not an exaggeration. If you thought OJ Simpson's slow speed chase was insane, you need to change the batteries in your pacemaker and check out \"Wages of Fear\". This 1953 French classic tells the story of a bunch of guys who are stuck in a squalid South American village--a sort of Casablaca-esque purgatory--and will do anything to get out, even if it means getting themselves blown sky high. Slow and lazy for the first half (deliberately), the plot eventually reveals itself to be about a suicide mission to haul a zillion gallons of nitroglycerine across 300 miles of harsh terrain that would make the Coyote & Roadrunner take an early retirement.Yes, nitro is that stuff that you don't want to look at the wrong way or it may send you to the moon. \"Wages of Fear\" ultimately reveals itself to be a gripping character study of how people keep their wits, or come unravelled, when subjected to pure terror... with of course the reward of heaven dangling just out of reach. So again we see this subtle allegory of purgatory, hell and heaven which I'm sure was the intent of director Henri-Georges Clouzot.An interesting point of historical note is that when this film was released in the USA, around 15 minutes of its 150 min running time were cut. According to the Criterion mini-documentary \"Censored\", these cuts were largely due to the \"anti-American\" themes (the tyrannical oil corporation that exploits the lives of locals for the sake of a buck) as well as subtle themes of spiritual cynicism (the beautifully poetic \"fence\" monologue which symbolizes the absence of God/afterlife). By today's standards these censored scenes are prime time tv, but back in the 50s this movie was feared by US censors as being godless pinko propaganda. That might put a smirk on your face as you're watching this flick. But definitely look for the full 150ish minute version of this film, not the 130 min censored cut.But really, for the entire second half there will be no smirking, only tense gritting of teeth as you watch these rolling nuke trucks inch across the South American jungle. The hazards they encounter, as well as their ingenious attempts to survive them, are extremely creative and expertly filmed with the sort of suspense that would make Hitchcock lose his breath.Content advisory stuff: There's a scene in the beginning where a fine tarantula specimen gets squashed. After rewinding and rewatching the scene in slo-mo a dozen times, I'm almost certain that our unfortunate arachnid was a fake prop. If anyone knows differently please mention it in a review. The same scene shows a naked woman from behind, at a distance. Later in the film is a scene that shows a topless native woman from a distance--it's very artistic. Language is tame throughout the movie with maybe 1 or 2 instances of \"merde\" (the sh- word). While there is violence, none of it is shown explicitly on camera (some of it is disturbing, though). And unless you're a 1950s American censorship bureaucrat, there's nothing politically incendiary other than the notion that the almighty dollar is the root of much misery.\"Wages of Fear\" is a well crafted, poetic, suspenseful film that certainly deserves its classic status in the history of cinema. Not unlike the classic Bogart/Lupino film \"They Drive by Night\" (1940), this film proves that a seemingly simple story about a bunch of truck drivers can really get your gears going."
    },
    {
      "username": "frank_olthoff",
      "userUrl": "https://www.imdb.com/user/ur1233114",
      "reviewLink": "https://www.imdb.com/review/rw0050214",
      "warningSpoilers": false,
      "date": "3 July 2001",
      "rate": "",
      "helpful": "59 out of 77 found this helpful.",
      "title": "An unforgettable bit of existentialism on exposed celluloid",
      "content": "Whoever it may be to rightly claim that he invented the action thriller genre (Méliès, I suppose), Henri-Georges Clouzot's \"Le salaire de la peur\" is an indispensable milestone on the exciting route to the best films of that kind in the 70's, 80's and nowadays. In its tenseness, as symbolized by the danger of explosion of the lorries' loads, it has hardly been surpassed.The plot is perfectly worked out from start to end, the leading players act in some of their best parts ever, the (almost) absence of music supports the brutal realism and the consequent choice of authentic outdoor settings contributed a lot to the film's deserved success. Historically, it ranges between neorealismo and nouvelle vague, and yet it is its pure action and suspense that make it worth watching for younger audiences who wouldn't go in for just the artistic way. - Only flaw I can see is the curious, rather artificial change in Vanel's character which has no comprehensible motivation, at least for me whenever I see it.Apart from that, Clouzot's wife Véra (also well-known from his \"Les diaboliques\") plays to the \"most breathtaking angles\" gallery when she bows down to scrub the floor of Dario Moreno's gin joint. It's a man's world after all and there are male perspectives on human survival only. Well, it's existentialism, mates. Altogether, the black and white photography is gripping. The gun scene between Lulli and Vanel is one of the best montages in film history, and there is more excellent editing in \"Salaire\" (including the finale) that completely fits the hot atmosphere."
    },
    {
      "username": "grillrobert",
      "userUrl": "https://www.imdb.com/user/ur2571376",
      "reviewLink": "https://www.imdb.com/review/rw0956025",
      "warningSpoilers": false,
      "date": "2 November 2004",
      "rate": "",
      "helpful": "97 out of 121 found this helpful.",
      "title": "magnifique!",
      "content": "This movie is a true masterpiece in every way! When I rented the DVD and read the story it sounded familiar, because I had watched the newer version before in color with Roy Scheider, which was good as well. But watching the original film truly blew me away. This movie is well made in every detail. It puts a lot of detail-work in the creation of the characters, and once you think that is over and the \"regular action-part\" starts, it becomes even better and the story takes a 90 degree turn! After I had finished watching the entire movie, I needed at least 5 minutes just to \"digest\" it and rethink this fantastic film. If you got a chance to watch it, don't miss it! It is entertaining from the first to the last minute!"
    },
    {
      "username": "ravenus",
      "userUrl": "https://www.imdb.com/user/ur1808184",
      "reviewLink": "https://www.imdb.com/review/rw0941208",
      "warningSpoilers": true,
      "date": "3 October 2004",
      "rate": "8",
      "helpful": "19 out of 25 found this helpful.",
      "title": "Excellent human thriller",
      "content": "I've often heard of Clouzot referred to as the 'French Hitchcock' although this film seems to share more of a cousin hood with the work of John Houston.Wages of Fear is about how a bunch of immigrants in Latin America, for money, take on the reckless task of transporting a large consignment of explosive nitroglycerin across 300-miles of obstacle-riddled paths, every moment aware that a single concussion could ignite the entire shipment, blowing them all to bits.The film begins with the setting of the locale and introduction of its principal characters - the regular irregulars Mario and Luigi (just realized the striking similarity to Nintendo's famous plumber duo, hmm), the mafioso type new entrant Jo who strikes up a friendship with the raffish Mario becoming his mentor but antagonizes the rest of the townsfolk with his bossy attitude, Mario's mistress Linda who naively worships him but is in turn kept as a pleasure item. The town is a dead-end rife with poverty and unemployment, its only industry being the Southern Oil Corporation (SOC) a Yankee enterprise. The residents are too demoralized to even consider escape to better climes. Like Mario explains to Jo in the course of a brilliantly spliced sequence of jump-cuts that covers the entire aspect of the town, \"It's like prison. Easy to get in, but escape is impossible.\"A major fire at the oil-wells calls for immediate shipment of explosive to isolate the blaze, but it's too late to bring in the specialized transportation. The company offers a payment of $2000 each for 4 locals who will carry the hazardous shipment in ordinary trucks. Mario, Jo, Luigi and a Jew Bimba take on the job, the promise of money to help them escape from the town sufficient even to temporarily offset the fear of death. Thus begins the arduous, tension-ridden journey that occupies most of this 148-min film. The trucks must move above a certain minimum speed to minimize vibrations (a ruse reused in 1994's Speed). On the way they face various blocks including a rickety wooden bridge the trucks must back up over. Mid-journey one of the trucks blows up. Mario and Jo who are in the other truck must overcome their horror at the catastrophe and cross further hurdles including a lake of oil created by the bursting of a pipeline.In the course of the journey we see a reversal in the roles of Jo and Mario. Initially Mario looks up to Jo, in awe of his cool and worldly-wise manner. But Jo is soon revealed to be in reality a scared old man for whom Mario has only a contemptuous pity. This character drama makes for engrossing viewing and in no small measure due to the excellent performances, especially Charles Vanel as Jo.The story moves smoothly thanks to very precise cutting, and some of the nighttime photography, as also the scene at the oil lake, is worth mentioning. Clouzot obviously has a sure hand over the bulk of the proceedings although he slips up in a couple of places: The oil company is portrayed in a rather ham-fisted (and badly acted) way as this evil uncaring monolith that would gladly blame dead employees for disasters to avoid compensation and resort to thoroughly unethical means to get its job done. Most of the supporting characters are cardboard. Also, some of the miniature work is painfully obvious, although that'd be likely a limitation of technical facilities available to the crew. The ending of the film is finely executed but seems all too contrived to give you your daily dose of irony.In the end, this remains a taut and finger-licking good old-school thriller, which bothers to provide characters interesting enough for us to care about their life and death."
    },
    {
      "username": "dbdumonteil",
      "userUrl": "https://www.imdb.com/user/ur1219578",
      "reviewLink": "https://www.imdb.com/review/rw0050241",
      "warningSpoilers": false,
      "date": "13 February 2004",
      "rate": "10",
      "helpful": "11 out of 19 found this helpful.",
      "title": "the road of hell",
      "content": "A director of several terrific detective movies made in the forties such as \"le corbeau\" (1943), you can consider Henri Georges Clouzot as one of the best French film-makers specialized in suspense. Here, he broaches a new topic for him: the adventure movie with \"le salaire de la peur\" (1953) and this is a stunning movie.You can divide the movie into two obvious parts. The first one focuses on this bunch of men who lives in this Mexican small town cut disconnected from the world, even the time. If this part is a little uninteresting (but essential in the way that Clouzot emphasizes on their boredom and the mission to carry nitroglycérine with trucks to an oil well is an unexpected opportunity for them), on the other hand, the second part justifies the vision of the movie. When the four men have accepted the mission, they aren't out of the woods: there are a lot of dangerous situations where death can arrive at any moment. Clouzot manages to maintain the interest thanks to an asset whose he is the master: the suspense.A brilliant and absorbing movie still just as good as it was more than fifty years ago."
    },
    {
      "username": "ma-cortes",
      "userUrl": "https://www.imdb.com/user/ur3270789",
      "reviewLink": "https://www.imdb.com/review/rw5899998",
      "warningSpoilers": false,
      "date": "12 July 2020",
      "rate": "7",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Very good , though overlong , thrilling movie about four unfortunate truckers undertaking an extremely dangerous assignment",
      "content": "Splendid and famous movie by Henry-Georges Clouzot and remade by William Friedkin as ¨Sorcerer¨ in 1977 . Dealing with four distressed men (Yves Montand , Charles Vanel , Folco Lulli , Peter Van Eyck) who undertake a risked journey throughout the Amazon jungle by transporting a hazardous cargo . As an American company : ¨Southern Oil Company¨ controls a desolate Central American town whose citizens desperately want money to live , so desperately that four are willing to attempt a suicide mission to deliver nitroglycerine to put out a well-fire raging 300 miles away . As the company's cynical head has offered 2000 dollars to each man , enough to finance theit getaway from the hell-hole they live in .Exciting and thrilling movie which so entrapped us in following the misfortunes of the four men desperate enough to undertake a suicidal journey with a cargo of nitroglycerine along the dangerous jungle and cliffside roads . Multi-dimensional , twisted and complex drama concentrates on character development for the first half . The film contains nail-biting scenes as the cliff frames when a truck is hooked or the petroleum hole , crucial to the movie's greatness . Main role is grittily played by Yves Montand giving a wonderful acting . The remainder of the roles remain perfectly developed such as Charles Vanel , Folco Lulli , Peter Van Eyck and special appearance by Vera Clouzot , George Clouzot's wife .It packs a strirring and moving musical score by Georges Auric . As well as evocative and atmospheric black/white cinematography shot on location by cameraman Armand Thirard and in a finely restored version . The motion picture based on a novel written by Georges Arnaud was competently directed by Henry Georges Clouzot . He started his film career as a screenwriter and then Henri-Georges Clouzot switched over to directing in 1942 with Tout pour l'amour and The Murderer Lives at Number 21 . His films are typically relentless suspense thrillers , similar to Alfred Hitchcock's but with far less light relief . He had the distinction of having his film The craven (1943) prohibited by both the German forces occupying France and the Free French forces fighting them, but for different reasons . He shot to international fame with Jenny Lamour (1947) and especially Wages of fear (1953) and consolidated that success with other films as Race for Life (1956) , Les espions (1957) , La prisonnière (1968) . He beat Alfred Hitchcock in buying the rights to \"Les Diaboliques\"(1955) with a margin of just a few hours , but continuous ill health caused large gaps in his output , and several projects had to be abandoned until his death . Rating : 7.5/10 . Better than average . And it had a good remake by William Friedkin with Roy Scheider , Bruno Cremer , Francisco Rabal and Amidou."
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw6395298",
      "warningSpoilers": false,
      "date": "24 December 2020",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "You haven't seen suspense until you've seen this.",
      "content": "The name of the game in 'The Wages Of Fear (1953)' is suspense: pure adrenaline-pumping, white-knuckled, edge-of-your-seat suspense. Of course, its hugely extended set-pieces aren't the only thing that make the movie great. There's a surprising amount of solid character work, especially when it comes to one particular character who ends up revealing himself to be the total opposite of what he is initially set up to be. It's a remarkable transition and it showcases some really solid acting skills (you've never seen anyone act scared until you've seen this). After a relatively slow opening that makes a point of portraying the lacklustre employment prospects of the town that our unconventional characters are stuck in, the piece kicks into gear and gets a handful of its players started on a journey that turns every bump in the road, every shift in suspension, every pebble in their path into deadly obstacles. This situation is milked for all it's worth; it grips you and never lets you go, forcing your heart into your mouth more times than you can count. It's soaked in dread, too. The film is definitely one of the - if not the - most suspenseful that I've ever seen. Frankly, it's a masterpiece. Though its first half is fairly slow, nowhere near as compelling as its second and showcases a couple of major characters who display some blatant sexism and racism, the affair is ultimately an affecting and memorable thrill ride. It's one of the best of its kind. 8/10"
    },
    {
      "username": "Rodrigo_Amaro",
      "userUrl": "https://www.imdb.com/user/ur20748638",
      "reviewLink": "https://www.imdb.com/review/rw2864137",
      "warningSpoilers": false,
      "date": "5 September 2013",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "One of the best thrillers ever made",
      "content": "\"Le Salaire de le Peur\" (\"The Wages of Fear\") is a harrowing journey of four men going down in bumpy roads, miserable places, won over by the most difficult obstacles, a long way performing their jobs transporting a great load of dynamite to be used on a burning oil well. It's a job, it pays well, those guys are the best in it but it's a hard, dangerous and exhausting service that can cost their lives. All the way, almost like descending to hell. This is the road to hell. It's a story about the battle between courage and cowardice and how fear can take over even the bravest of souls. This is Henri-Georges Clouzot masterpiece along with the equally brilliant \"Les Diaboliques\", both featuring a tension that rises into an endless crescent that never leaves you at ease.I saw \"Sorcerer\" (the American remake), read Georges Arnaud's novel and watched this film. To me, they all stand on the same level. They're incredibly good, very exciting but they're not great. Arnaud focus more on the mission's perils rather than the characters and sometimes the story doesn't turn to other interesting possibilities; neither Clouzot or Friedkin films are the book, lacking of some of its good ideas but developing some new ones.\"Sorcerer\" is an adventure about mercenaries looking for money and thrilling experiences while \"The Wages of Fear\" is a human drama about desperate people risking their lives to earn a living in the only possible way, and therefore more realistic than its remake. But Clouzot is a master in creating scary and real danger at practically every frame. A bar fight against local power man; the training closely observed by their patrons with conductors sabotaging each other; a truck making a difficult turn in a place that threats to collapse at any moment; the fear in the drivers eyes and hands, maneuvering as if each turn could be the last. The director delivers one of the most inspired and frightening moments of all time (not present in the book) when a giant stone stands on their way and the solution found to remove it to use part of the explosives. Heart couldn't handle very well that scene so perfectly made, with no soundtrack, very few dialogs and a constant action. And you relate very easily with the characters struggle, amazingly performed by Yves Montand (and I could never imagine him in such role, one of his earliest), Charles Vanel, Peter van Eyck and Folco Lulli, similar in being all afraid of what they're doing but their fears are expressed in many different ways. Some panic, some control it, others disguise from time to time trying to look adventurous. The difficulties I had with this were the erratic and long introduction of each character, too many humored bits that weren't so effective (those could have been easily trimmed down) and the ending - not in the sense of being a let down but its goofy presentation seems awkward. The treatment given to the theme, the heart of the matter which is their mission and the rest (even the romance involving Montand and the girl, which is slightly distractive but useful) achieves a positive result. Certainly a movie of a different level and exciting even today. 21st Century flicks can only aspire to be something like this. Call me crazy, but Hollywood can even try again with a remake but this time read the novel, make wise choices and you might reach something similar or better. There's themes that can be explored in a very interesting way to make it a more challengeable film and adventurous. 9/10"
    }
  ],
  "errorMessage": ""
}