{
  "imDbId": "tt0112471",
  "title": "Before Sunrise",
  "fullTitle": "Before Sunrise (1995)",
  "type": "Movie",
  "year": "1995",
  "items": [
    {
      "publisher": "ReelViews",
      "author": "James Berardinelli",
      "link": "",
      "rate": "100",
      "content": "Before Sunrise speaks as much to the mind as to the heart, and much of what it says is likely to strike a responsive chord -- a rare and special accomplishment for any motion picture."
    },
    {
      "publisher": "San Francisco Chronicle",
      "author": "Mick LaSalle",
      "link": "https://www.sfgate.com/movies/article/An-Extraordinary-Day-Dawns-Before-Sunrise-3334882.php",
      "rate": "100",
      "content": "It's a lovely and wistful celebration of youth, time and moments of connection -- and about the experience of living in the midst of a simple, perfect day that you know you'll remember for the rest of your life."
    },
    {
      "publisher": "Chicago Reader",
      "author": "Jonathan Rosenbaum",
      "link": "",
      "rate": "90",
      "content": "Richard Linklater goes Hollywood (1995) -- triumphantly and with an overall intelligence, sweetness, and romantic simplicity that reminds me of wartime weepies like The Clock."
    },
    {
      "publisher": "Austin Chronicle",
      "author": "Marjorie Baumgarten",
      "link": "https://www.austinchronicle.com/events/film/1995-01-27/before-sunrise/",
      "rate": "89",
      "content": "Watching and listening to these two is a charming experience; their conversation has the ring of veracity, and rarely does the viewer's interest stray."
    },
    {
      "publisher": "Washington Post",
      "author": "Hal Hinson",
      "link": "",
      "rate": "80",
      "content": "Though Linklater allows the movie to wander, he never allows the pace to slacken, and more often than not he finds some unexpected bit of found poetry or cultural kitsch to make the digressions worthwhile."
    },
    {
      "publisher": "Chicago Sun-Times",
      "author": "Roger Ebert",
      "link": "",
      "rate": "75",
      "content": "Before Sunrise is so much like real life - like a documentary with an invisible camera - that I found myself remembering real conversations I had experienced with more or less the same words."
    },
    {
      "publisher": "San Francisco Examiner",
      "author": "Barbara Shulgasser",
      "link": "https://www.sfgate.com/news/article/Modern-Roman-Holiday-alive-and-well-in-Vienna-3152598.php",
      "rate": "75",
      "content": "Delpy and Hawke begin to grow on you and Linklater and his actors achieve a point midway through the film when the characters are so attractive and smart and emotionally daring that you'll be happy to spend the night with them."
    },
    {
      "publisher": "Christian Science Monitor",
      "author": "David Sterritt",
      "link": "",
      "rate": "75",
      "content": "Ethan Hawke and Julie Delpy are attractive stars, but what's most appealing about the picture is the value it puts on sharing ideas and feelings through language."
    },
    {
      "publisher": "The New York Times",
      "author": "Elvis Mitchell",
      "link": "",
      "rate": "70",
      "content": "What Mr. Linklater does best here is to come up with conversational gambits that have just the right fancifulness to suit this situation."
    },
    {
      "publisher": "Washington Post",
      "author": "Desson Thomson",
      "link": "",
      "rate": "60",
      "content": "Sunrise feels more like an absorbing experiment than a supple success."
    }
  ],
  "errorMessage": ""
}