{
  "imDbId": "tt0112471",
  "title": "Before Sunrise",
  "fullTitle": "Before Sunrise (1995)",
  "type": "Movie",
  "year": "1995",
  "items": [
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw1050018",
      "warningSpoilers": false,
      "date": "30 March 2005",
      "rate": "10",
      "helpful": "232 out of 267 found this helpful.",
      "title": "A Perfect Chemistry, In One of the Most Beautiful Romances I Have Ever Seen",
      "content": "While traveling by train through Europe, the American Jesse (Ethan Hawke) and the French Celine (Julie Delpy) meet each other and decide to spend the night together in Austria. On the next morning, Jesse returns to United States of America, and Celine to Paris. \"Before Sunrise\" is one of my favorite romances, indeed one of the most beautiful love stories I have ever seen. It is a low budget movie with a very simple and real storyline, but the chemistry between Ethan Hawke and Julie Delpy is perfect, and the dialogs are stunning. The direction is amazing, transmitting the feelings of Celine and Jesse to the viewer. I have just completed my review number 1,000 in IMDb, and I choose \"Before Sunrise\" for this significant number because it is a very special film for me. I cannot understand why this movie was not nominated to the Oscar, with such a magnificent screenplay, direction and performances. Yesterday I have probably watched this movie for the third or fourth time, and I still love it. My vote is ten.Title (Brazil): \"Antes do Amanhecer\" (\"Before Sunrise\")"
    },
    {
      "username": "The_Void",
      "userUrl": "https://www.imdb.com/user/ur2248099",
      "reviewLink": "https://www.imdb.com/review/rw1018523",
      "warningSpoilers": false,
      "date": "11 February 2005",
      "rate": "9",
      "helpful": "298 out of 343 found this helpful.",
      "title": "Casablanca for the 1990's - pure cinematic gold",
      "content": "Before Sunrise is romance for the slacker generation. Richard Linklater's romantic drama is an offbeat telling of a dream come true for most people. The film depicts romance in all it's glory, but without any of the pitfalls that befall most couples; and in short the film is about two people that have a relationship that's as close to perfection as relationships will ever come to - with just one problem, the problem of time. While most relationships wind down with time, this one keeps going strong throughout and time itself is the only thing that wears out. Before Sunrise is certainly not the typical sentimental 'Hollywood romance', which is another aspect that puts this film leagues ahead of the pretenders. The story follows two people, Jesse; an American and Celine; a French girl that meet on a train into Vienna. They instantly connect, and after telling her his awful idea for a television show and almost getting off the train, Jesse asks Celine to join him for the day in the picturesque city of Vienna...Before Sunrise works principally for two reasons - realistic acting and an immense script that builds the characters through their thoughts and feelings and thus allows us to get to know them as we do the people in real life. This allows the characters to be free, and it's easy to believe that these are real people and not just actors working from a script. This also allows us to feel for the characters for who they are, and not merely because they're the protagonists. This kind of realism is hard to capture as, at the end of the day, we as the audience know that they're watching a film and not observing real life; but Before Sunrise represents one of the truest to life exhibitions of realism ever to be seen on screen. A truly great script cannot work on it's own, and needs great actors to deliver it to an extent that does it justice, and although I'm not a fan of either Julie Deply or Ethan Hawke; on viewing this film, there is nothing you can do but give them both respect. I don't know whether they were in character or just playing themselves, but when a film is this good; it hardly matters.In a film like this, it is the writing that's the most important thing, and contained within the script are several observations about life, most of which I personally could relate to. This represents what Richard Linklater has achieved with this script as not only does it create and build the characters, but it also manages to expose what true love is, along with several other aspects of life. The fact that not all the anecdotes are relatable to me personally again represents the brilliance of writing. Everyone is different, and so different parts of the script will appeal to different people. There could be certain aspects about one person that one person loves and another hates; and that's the case with the musings in this script. Adding to the beauty of the film is the city of Vienna. The city itself isn't really important to the film as this is a story that could have taken place just about anywhere - but it makes for some lovely visuals and the upbeat, energetic romance that blossoms throughout the movie is matched by the beauty of the location.Before Sunrise is simultaneously beautiful and captivating. Richard Linklater has created something that is rare in the world of cinema; a film that captures the beauty of life without ever going over the top or being overly sentimental. Before Sunrise is what it is. And what it is, is pure cinematic brilliance."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3217507",
      "warningSpoilers": false,
      "date": "9 April 2015",
      "rate": "8",
      "helpful": "25 out of 27 found this helpful.",
      "title": "refreshing first date",
      "content": "American tourist Jesse (Ethan Hawke) meets French student Celine (Julie Delpy) on the train. He talks her into getting off and walk around in Vienna. They walk the night away.I really love this movie when it first came out. There was no hint of the following sequels. It's just a great charming first date movie. The leads have great chemistry. They are both charming and lovely. This is a lot of first-date talk. It doesn't get tie down by artificial plot elements. There is nothing to drive the plot. There is no Holy Grail. There is no quest. There is no destination. There are just two people talking and trying to connect. It stops and starts. They meet two oddly funny Germans who invite them to their play. In a more conventional movie, they would actually go to this play. They forget to go and that's kind of the point. Their journey meanders without much direction. There are also great scenes of long continuous takes. Director Linklater just let the actors go on forever on the streetcar. The whole movie feels refreshing."
    },
    {
      "username": "Sickfrog",
      "userUrl": "https://www.imdb.com/user/ur0019730",
      "reviewLink": "https://www.imdb.com/review/rw0356354",
      "warningSpoilers": false,
      "date": "14 August 1998",
      "rate": "10",
      "helpful": "430 out of 476 found this helpful.",
      "title": "Love Still Exists.",
      "content": "This has to be one of the most sincere and touching boy-meets-girl movies ever made. While \"Rebel Without a Cause\" and \"Say Anything\" deliver nice portrayals, this movies strips down useless subplots and Hollywood divergences. This movie focuses purely on watching the budding of a beautiful romance. You never doubt for a second that the film will lead towards the romantic pairing of these two people. You almost immediately sense the synergy and the chemistry between Jesse and Celine, and it is simply pure joy to watch them find it. This movie is mostly all dialogue -based. But, every conversation between these too is greatly intriguing. What makes this pairing so romantic is how real it is. How in all that conversation, while often having no real bearing on anything critical, you can sense the nuances as these two become more fond and trusting of each other. This is exactly they way you would dream that you meet that special someone. And what makes it so true is that it is not even too fantastic to believe. This could be what would happen if you had been confident enough to strike up a conversation with that person you noticed somewhere random. And what puts the icing on this film is the magnificent backdrop of Vienna in which this film takes place. It just adds to the feeling of romantic nirvana that the film suggests. And no matter how many times I watch this film, I don't think I will ever tire of that."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw0356405",
      "warningSpoilers": false,
      "date": "8 February 2001",
      "rate": "10",
      "helpful": "144 out of 187 found this helpful.",
      "title": "One of the best films of the 1990s",
      "content": "I had never heard of this film before a couple of weeks ago, but its concept interested me when I heard it: an American man meets a European woman on his last night in Europe and they spend the night together talking. It sparked my interest, but I never expected it to be this great. Before Sunrise is a masterpiece, and it's also one of the most romantic films on record. To my surprise, it completely lacked the cynicism of the 1990s. It's impossible to really talk too much about it, since there is no real plot, so to speak (although there are plenty of thoroughly interesting things you could talk about; it is sort of like My Dinner With Andre, where there is a conversation, but it's not JUST the conversation that matters), but let me just say, see it. SEE IT!"
    },
    {
      "username": "Look Closer",
      "userUrl": "https://www.imdb.com/user/ur0643915",
      "reviewLink": "https://www.imdb.com/review/rw0356449",
      "warningSpoilers": false,
      "date": "24 May 2002",
      "rate": "",
      "helpful": "626 out of 675 found this helpful.",
      "title": "Why we go the movies...",
      "content": "What an incredibly brave and honest look at relationships. I've have never seen a film so precisely and brilliantly capture this kind of emotion and transfer it to the screen the way Before Sunrise does. What a crime that neither Ethan Hawke or Julie Delpy was nominated for any major acting awards, actually screw that! What a crime it was that they didn't both sweep every major acting award altogether and that Richard Linklater didn't get any recognition for the screenwriting or brilliant directing of his wonderful actors! Loved the ending (as much as it pained me at the same time), loved how after it all they go back and show every location that the couple shared together. Loved how the dialogue never wavers, never addressing the relationship directly but allows us to indirectly see a geniune bond forming through the body language, facial expressions, and the dialogue, ooooohhh the dialogue. Every bit of it plucked right from those top ten late night conversations we've all had with close friends whether it was serious or in jest. And respect to Linklater for keepin it real, the movie was rated R cause of a couple minor swear words? Could of easily been removed without really desecrating the film but he keeps it in anyways. Screw you hollywood, your 'romantic comedies', your Freddie Prinze Jr.'s, your 'take the glasses off the girl and now she's pretty' movies. This is real romance! This is what I come to the movies for, to think, to be provoked and to be swept away by the magic that only cinema can provide. Before Sunrise has single-handedly reminded me about why I goto the movies......"
    },
    {
      "username": "Superunknovvn",
      "userUrl": "https://www.imdb.com/user/ur1390493",
      "reviewLink": "https://www.imdb.com/review/rw0356480",
      "warningSpoilers": false,
      "date": "25 April 2004",
      "rate": "10",
      "helpful": "138 out of 171 found this helpful.",
      "title": "Wonderful love story",
      "content": "\"Before Sunrise\" is a wonderful love story and has to be among my Top 5 favorite movies ever. Dialog and acting are great. I love the characters and their ideas and thoughts. Of course, the romantic Vienna, introduced in the movie does not exist (you won't find a poet sitting by the river in the middle of the night) and it isn't possible to get to all the places in only one night, either (especially if you're a stranger and it's your first night in Vienna). But that's not the point. The relationship of the two characters is much more important and this part of the story is not at all unrealistic. Although, nothing ever really happens, the movie never gets boring. The ending is genuinely sad without being \"Titanic\" or something. Even if you don't like love stories you should watch this film! I'm a little skeptic about the sequel that is going to be released in summer. The first part is perfect as it is, in my opinion."
    },
    {
      "username": "Galina_movie_fan",
      "userUrl": "https://www.imdb.com/user/ur1098460",
      "reviewLink": "https://www.imdb.com/review/rw1714918",
      "warningSpoilers": false,
      "date": "19 August 2007",
      "rate": "9",
      "helpful": "44 out of 53 found this helpful.",
      "title": "\"Isn't everything we do in life a way to be loved a little more?\"",
      "content": "Sweet and charming, funny and poignant, plot less but meaningful, \"Before Sunrise\" (1995), the third movie of Richard Linklater, is dedicated to everyone who ever been in love, is in love, or never been in love but still dreams of it and hopes to find it. It is one of the very rare movies that is/should/will be equally interesting to teenagers, their parents and even grandparents. It seems a very simple little movie with no spectacular visual effects, car chases, or long and steamy sex scenes. Two young people in their early 20s, two college students (American tourist Ethan Hawke who is returning home after the summer in Europe and the French student Julie Delpy who goes to Paris to attend the classes in Sorbonne) meet on a train. They are attracted to each other instantly even before they start talking, they hop off the train in Vienna where they walk around exploring the city all night. They talk and fall in love. That's it, that's the movie. It could've been boring and silly but instead, it is a lovely, believable, clever, and moving romance that only gets better with each viewing (at least, for this viewer). High praise and my sincere gratitude go to the director and writers for delivering two charming characters, superb writing, always interesting and witty dialogs, two awesome performances, and the atmosphere of magic that falling in love is. Julie Delpy, who looks like a Botticelli's angel, is great in portraying smart, independent, and incredibly attractive young woman."
    },
    {
      "username": "whpratt1",
      "userUrl": "https://www.imdb.com/user/ur0663392",
      "reviewLink": "https://www.imdb.com/review/rw0356476",
      "warningSpoilers": false,
      "date": "16 October 2003",
      "rate": "10",
      "helpful": "120 out of 159 found this helpful.",
      "title": "EXTREMELY DEEP & WONDERFUL LOVE STORY !",
      "content": "It was by accident that I was scanning the TV channels and found this wonderful film about two beautiful human beings who become attracted to each other in a very innocent and virgin like approach to each other. Ethan Hawke (Jesse) \"Tape\" '01 and Julie Delpy (Celine) \"ER\" 94 TV Series (Nicole). This gal and guy, will warm your very heart and soul and make you think deeply into your past relationships and how you really wish you had followed your hearts strings with a guy or gal you deep down loved and lost track of over the years. Jesse and Celine have great conversation, and deep eye contact with a great magnetic explosion between the two of them. I am looking forward to the SEQUEL to this film in 2004 and if you have viewed this film, you will feel the same way."
    },
    {
      "username": "Arcturus1980",
      "userUrl": "https://www.imdb.com/user/ur3860711",
      "reviewLink": "https://www.imdb.com/review/rw2818028",
      "warningSpoilers": true,
      "date": "22 June 2013",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "An enthralling romance",
      "content": "I discovered this film soon after its video release on a movie channel one early morning in my mid-teens. More of an action or comedy or action comedy type movie fan at that time, Before Sunrise planted the seeds of my incurable romanticism. My every viewing reaffirms a naturalistic charm that has not and will not wane. I do not go for naturalism invariably. For instance, John Cassavetes' A Woman Under the Influence. No thank you. Not my scene. But my what refreshing naturalism in this trilogy, even when to the point of awkwardness. A very big thanks to Richard Linklater for fleshing out this absolute gem of a film. Very wise of him too to co-write it with a woman, Kim Krizan. Though uncredited, it is worth noting that Delpy and Hawke each had a hand in rewriting this film with Linklater.Knowing from my own experience how easy it is to meet people on trains, I marvel at the thought of how many real life variations there have been and will be of this story. By a most auspicious concatenation of circumstances, Ethan Hawke's Jesse and Julie Delpy's Celine find themselves sitting across from one another on a train from Budapest. They get to talking and detrain in Vienna after some clever convincing from gumptious Jesse. He is to fly back to the US in the morning, while she can spare the time before continuing on home to Paris.They roam about the city together feeling as if in a mutual \"dream world\" removed from the ordinary flow of life, all the while engaged in a stream of consciousness dialogue that could lead one to construe them both as self-indulgent; however, that would be a fruitless interpretation. Voluble they may be, but they are sincerely striving for enlightenment individually and mutually. We are social creatures, and though they need not necessarily be romantic relationships, we only really know ourselves in relation to others. Before Sunrise is all about the exhilaration of really meeting and connecting with someone, an experience certainly heightened here by the sexual element. The listening booth scene strikes a deep chord with me in this regard: innocently stealing glances while playing Kath Bloom's \"Come Here\" (an excellent song choice), it is their first instance of sexual tension, and moreover, the body language is to be appreciated, as it will be throughout the trilogy.As for the other characters, the part-time actors (played by Karl Bruckschwaiger and Tex Rubinowitz) amuse as they describe their play translated as \"Bring Me the Horns of Wilmington's Cow.\" Fortunately given a miss. I like the inclusion of the palm reader (played by Erni Mangold) who imparts her own intrapersonal/interpersonal advice. I especially like the street poet (played by Dominik Castell) whose poem (\"Delusion Angel\" written by David Jewell) likewise concerns a world out of one's control and the value of a real connection with someone. Both interactions present a sardonic Jesse complemented by a more trustful Celine.In the poignant final montage we look at now familiar locations minus the protagonists, and I for one get the sense of a strikingly indifferent universe. We have seen the \"see you in six months\" thing in Love Affair of 1939 and its 1957 remake An Affair to Remember (good films to my mind), but this trilogy makes a World Series winning grand slam home run of it. Too inexperienced to really grasp the rarity of their connection, they opt not to exchange contact information so as to avoid a fizzling out of the relationship. It begs for a sequel if ever a film did.For all the convoluted brilliance of Before Sunset and Before Midnight, those films ultimately capture the spirit of this one. Celine summed up the essence of Before Sunrise and the trilogy with these lines bettered by nothing in cinema: \"You know, I believe if there's any kind of God, it wouldn't be in any of us, not you or me, but just this little space in between. If there's any kind of magic in this world, it must be in the attempt of understanding someone sharing something. I know, it's almost impossible to succeed but who cares really? The answer must be in the attempt.\""
    },
    {
      "username": "lady_writer",
      "userUrl": "https://www.imdb.com/user/ur0499470",
      "reviewLink": "https://www.imdb.com/review/rw0356383",
      "warningSpoilers": false,
      "date": "8 March 2000",
      "rate": "",
      "helpful": "292 out of 328 found this helpful.",
      "title": "The beauty is the simplicity of magnificent human emotion.",
      "content": "'Before Sunrise' is not a film to be scrutinised, nor studied. The absolute beauty of it lies in its perfection as a simple love story - of two lives suddenly thrown together in the midst of reality, and the ensuing night of simple love that follows. Every individual at some time in life dreams of the connection that is portrayed in this film between Jesse and Celine, and few ever find it. 'Before Sunrise' simply and elegantly demonstrates how the most fundamental passions of human emotion can envelope two complete strangers. The beauty of this film is that the story is the most important element. The ending is both provocative and emotional - scenes of the night previously seen in darkness are now portrayed in lonely daylight as the sun rises and the story closes on these two characters.I saw this film by accident one night late on television. I have never forgotten it. So well is it made that the audience never question if this could ever really happen in life, reality being so absolutely characterised in it.'Before Sunrise' is simply the story of two strangers bound in Vienna's lonely night splendour - one night of love in all its glory, one superb piece of film making."
    },
    {
      "username": "Pjtaylor-96-138044",
      "userUrl": "https://www.imdb.com/user/ur26820801",
      "reviewLink": "https://www.imdb.com/review/rw4214422",
      "warningSpoilers": false,
      "date": "24 June 2018",
      "rate": "6",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Essentially, it's a hundred-minute conversation; it's loose and meandering but fairly enjoyable.",
      "content": "'Before Sunrise (1995)' essentially has no plot and, though that's the point as the intention is to be a romance with all the extraneous 'Hollywood' elements removed, this leads to an experience that feels loose, aimless and meandering. It's experimental and laid-back by design but isn't the most gripping of narrative pieces because of it. It certainly feels less a character-study of its two leads and more a vehicle for Linklater, Krizan, Delpy and Hawke (the latter two of whom contributed heavily to the script uncredited) to express some of their most unique of ideas. These come constantly, seeming like stories they've told to friends or theories they have about life, love and religion, and, while they can be interesting (genuinely thought-provoking in cases), they don't really develop the characters and seem sort of out of place within the story. It's difficult to explain why most of that stuff doesn't seem to work, but it just doesn't feel fully genuine in most cases. It doesn't feel like it comes from the characters or express their budding romance, though this sort of talk certainly forms the basis for most relationships. Still, it isn't all unsuccessful. There is certainly some charm to the picture, once it picks up steam. In the end, the experiment seems to have worked. It was creatively refreshing for all involved and evokes memories of wandering around a holiday destination talking about nothing for hours. There's even some impressive long takes and the 'unscripted' feel is admirable considering it was all scripted down to the letter. This all leads to a sort of inane, carefree and somewhat nostalgic - if limited - enjoyment of a hundred-minute conversation told with cinematic language. 6/10."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1620941",
      "warningSpoilers": false,
      "date": "19 March 2007",
      "rate": "10",
      "helpful": "31 out of 44 found this helpful.",
      "title": "the kind of conversations we all have in reality, yet projected here in a purely cinematic fold",
      "content": "Before Sunrise has many remarkable things going on, almost too many to fit into one review like this, but it's suffice to say that it's one of the most observant character studies of the nineties, maybe even in all of contemporary cinema, to be observant not about love, per-say, so much as it's about a human connection. How does one fall in love at first sight? No one does, at least that's deep down the consensus that Linklater wants to show with his film. And *yet* there is the possibility of as intense a connection, of a bond that can form in those that are young and with many ideas that can be expressed articulately and with a breadth of cynicism and is somehow very tender and true at the same time. Linklater here gives us the story of Celine and Jessie, a French girl and an American boy who get off the same train heading to Vienna, and on the way there start to talking about things, at first arbitrary, then personal (Jessie seeing death for the first time in his great grandfather). Jessie persuades Celine to go along with him on a night out on the 'town', in Vienna, until his plane the next morning.Before Sunrise gives Jessie and Celine, in the midst of the gorgeous Vienna scenery and locales to go on and on about subjects that have a lot of importance, and in a sense is about the act of having conversations, of what it's like to watch people having one leading into another and another. Here it's often about relationships and commitments, as Jessie and Celine tell stories sometimes somewhat inconsequential, or seemingly so, and another that may tell a lot about their essential qualities. We hear confessions of desires for other loves, or what weren't really loves, of being part of a family or part of an upbringing that may or may not inform how you'll love your life, of what it means to believe or not believe in some religious form, or just to have some connection to any faith and the soul (I loved the bit about the quakers in the church), and sometimes laced with cynicism or skepticism. Jessie may be more responsible for that last part, but what's fascinating about the film is that it's never exactly cynical itself, just commenting upon cynicism that lays in the concerns of men and women at that age of their lives.Meanwhile, it's always great to see Ethan Hawke and Julie Delpy in these roles, where they're not incessantly annoying in that 90s Generation-X mode, but are the kinds of people where if not in the central conceit of the film, which isn't a bad one at all but a necessary one, one might think to find walking along the streets of a city somewhere. The conceit is that of an old romantic picture ala Brief Encounter, only here intimacy is expressed in the central characters either between each other, where sweet asides are actually acceptable (\"I have to tell you a secret\", Jessie says, and then leans in for a kiss, ho-ho), or in the little moments that pop up with other people along the way. I loved the scene with the poet, where it's very cinematic a thing to suddenly find a random romantic bit player in the midst of a romantic picture with such beautiful words at his disposal, or with the palm reader and how the reactions from Jessie and Celine are that we might share, but really are seeing them do it first-hand. All the while Hawke and Delpy embody the roles interestingly- we can see how neuroses are being formed already for their adult lives- as it may lead off into the future...Featuring splendid cinematography and a script with an ear for natural wit and a true sense of what it means to have a moment of happiness, however self-contained, as it may lead into something more. Who's to say you can't suddenly be attached to someone, if only for less than 24 hours, and be that much more attached than a married couple? This is perhaps Linklater's thesis, but there's more to it than just that. It's a very dense film, and one that will have me calling back to it repeatedly. One scene especially, which is both cheesy and brilliant is when the two of them are talking 'on the phone' in front of each other mimicking their expositions might go to the other's friend. A+"
    },
    {
      "username": "Fpi",
      "userUrl": "https://www.imdb.com/user/ur8719213",
      "reviewLink": "https://www.imdb.com/review/rw1608175",
      "warningSpoilers": false,
      "date": "27 February 2007",
      "rate": "9",
      "helpful": "48 out of 59 found this helpful.",
      "title": "One of those few movies that actually - ACTUALLY - feel like real life",
      "content": "This movie is intelligent. That is, more than most other movies, it transcends the least common denominator - stupid people will probably not appreciate it. The story also relies heavily on dialogue. It has some parallels to Lost in Translation, although Before Sunrise is much brighter, somehow less abstract, and simply a lot better.The script, the characters and even the slightly surreal atmosphere feel totally realistic. The actors play absolutely brilliantly. Rarely have I seen a movie where the script and the acting has melted this perfectly together.The dialogue moves into very personal issues, with the risk of becoming a little over the top. It does, however, stay on the right side almost all the time, although I found a few moments a little awkward and embarrassing. Balancing on this fine line demands outrageously talented actors. Sometimes, it yields great results, and overall this movie is simply stupendous! Only very, very rarely is \"love\" in films depicted in a way that I find trustworthy and realistic. Every time that is achieved, the result is fantastic. I think the stunning and apparently timeless beauty of the female lead actress helped quite a bit in this respect. She still looks stunning in this film, 12 years after.This is simply a gem of a movie that you can't miss. One of the best movies I have seen from the 1990s!"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw2850022",
      "warningSpoilers": false,
      "date": "12 August 2013",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Beginning",
      "content": "Who'd have thunk back then, that this would spawn a trilogy? My guess is nobody. But the first movie was strong enough to have followers and believers in it. Apart from the setting and the two magnificent actors, we get treated to some wonderful dialog. Some great scenery as well and the one subject that rules most of our lives -> Love.Represented not only by a male and female, but also two different cultures. But it still never feels like this is a cliché or tries to get some cheap shots in to make you laugh. This feels genuine and as viewers we can and should appreciate that. So while this is not necessary watching, you should take a look at this before ... watching the sequels!"
    },
    {
      "username": "rooprect",
      "userUrl": "https://www.imdb.com/user/ur2904674",
      "reviewLink": "https://www.imdb.com/review/rw1304133",
      "warningSpoilers": false,
      "date": "1 March 2006",
      "rate": "3",
      "helpful": "114 out of 196 found this helpful.",
      "title": "Annoying frat boy hits on French girl. For 12 hours.",
      "content": "Annoying frat boy hits on French girl. For 12 hours. But the worst part is that the French girl goes along with it. For 12 hours. And we are forced to go along with it. For 2 hours. This is the kind of movie that makes you want to smack someone.Perhaps it wouldn't have been so bad if there had been some sort of chemistry between Ethan Hawke and Julie Delpy. I mean, after all, even annoying frat boys can fall in love. But no. The two are so incompatibly different that, despite what the script says, none of the flirtations are believable. I imagine the minute the director yelled \"cut\", Julie would spin around and head straight for her trailer. Ethan would go soak his head. The problem is that the director never yells \"cut\". Instead we are subjected to watching the awkward, contrived and stiff ramblings of these two people who have nothing in common except for the script.I saw what the director was trying to do. He was trying to capture the poetry of life through long, continuous shots and mundane dialogue. He was trying to show us how wonderful the simplicity of everyday life can be. But there is nothing artistic or poetic about the shots, the dialogue or the emotion on screen. The whole thing feels like an awkward date you just cant wait to ditch.\"Before Sunrise\" is like \"When Harry Met Sally\", except without the humour, the charm, the witty style, the plot or the music. In essence, there is no reason to watch this movie. If you do watch this movie, make sure you're not sitting near anyone or you might get smacked.Before sunrise? Heh, I think I'll sleep in."
    },
    {
      "username": "olafra",
      "userUrl": "https://www.imdb.com/user/ur2329980",
      "reviewLink": "https://www.imdb.com/review/rw1022822",
      "warningSpoilers": false,
      "date": "17 February 2005",
      "rate": "10",
      "helpful": "199 out of 241 found this helpful.",
      "title": "one of my favorite movies",
      "content": "I want Céline and Jessie go further in their relationship, I want to tell them that they were made for each other, that in a lot of moment in the film we want they to die for each other. Their story is what we ever wanted and probably most of us never reached. This is about love but not stupid things like in \"notting hills\" or those kind of movie. This is life and i did believe in them, i did believe they were falling... This was so clever and touching. I have just finished to view it a minute ago and i m still there... I want to go to Vienna. I want to see them as soon as possible again.I have to say i was now becoming misanthropist and felt like if love was just a fake, a concept, but with this movie i realized that maybe somewhere, somehow and some when, something could really happen.I'm french and didn't know very well July Delpy despite Kieslowski \"three colors : white\"... Now i have to see her other works because she looks like an angel and got a perfect acting.i saw \"before sunset\" (the sequel in Paris) a few days before i saw \"before sunrise\" and their is no matter. They are both masterpieces. proof that you don't need to impress the eyes with technology to get pure feelings. I'm sorry for my English which i m trying to best.Franck in France"
    },
    {
      "username": "Platypuschow",
      "userUrl": "https://www.imdb.com/user/ur57590728",
      "reviewLink": "https://www.imdb.com/review/rw3754806",
      "warningSpoilers": false,
      "date": "15 July 2017",
      "rate": "3",
      "helpful": "20 out of 30 found this helpful.",
      "title": "Before Sunrise: Don't see the appeal",
      "content": "Ethan Hawke and Julie Delpy meet in this critically acclaimed feature presently at time of writing sat at no.214 on IMDb's top 250 movies. They meet, they chat and that's basically the concept of the film.I'm all for \"Talkies\" but when they have a plot, a purpose, an aim. This seems to lack that and all the core basics a movie must have such as a beginning a middle and an end.Performances are great, the movie is visually appealing but that's as far as it personally goes for me.It's like 90 minutes of having a camera in the Big Brother house and just listening to them waffle on. Only difference is that here the subjects are capable of using words with more than 2 syllable's and aren't desperate Z list celebrity wannabes.Boring, lifeless and I simply don't see the appeal. Out of morbid curiosity I'm sure I'll get round to seeing it's 2 sequels but since I watched Sharknado 2 & 3 that's really not saying much."
    },
    {
      "username": "Keemshave",
      "userUrl": "https://www.imdb.com/user/ur88267634",
      "reviewLink": "https://www.imdb.com/review/rw4967757",
      "warningSpoilers": false,
      "date": "30 June 2019",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Beautiful.",
      "content": "It'll blow you away with its realism. This film presents the awkward, spontaneous, and genuine moments that real relationships have. It felt as if was watching two real people fall in love. Loved every minute of it...the philosophical conversations fascinated me. 1000% my favorite romance movie of all time because of its realism. This is a truly fantastical film that inspires you to find love."
    },
    {
      "username": "daoldiges",
      "userUrl": "https://www.imdb.com/user/ur14885345",
      "reviewLink": "https://www.imdb.com/review/rw4201037",
      "warningSpoilers": false,
      "date": "12 June 2018",
      "rate": "6",
      "helpful": "10 out of 13 found this helpful.",
      "title": "BEFORE Sunrise Please",
      "content": "I'd both read and heard some really positive reviews of Before Sunrise and was looking forward to it. In large part I also feel there are some special elements to this film - the idea of meeting and being captivated by a stranger on a train and spending one magical, impactful night together, some really thoughtful and interesting dialogue, and an honesty of expression between the two main characters, all good and appreciated. However, I do have one major issue with this film, that it didn't know when to end. Unlike the two lead characters who at the films conclusion know not to force anything or attempt to take things too far, the director unfortunately extend things beyond their natural reaches to the film detriment. I sincerely think that with some prudent editing down this film could have been much stronger. I'm happy for those reviewers that were touched by this film and hold it in such high regard, sadly I am not one of them."
    },
    {
      "username": "benegesserit20",
      "userUrl": "https://www.imdb.com/user/ur30233708",
      "reviewLink": "https://www.imdb.com/review/rw2649022",
      "warningSpoilers": true,
      "date": "25 July 2012",
      "rate": "4",
      "helpful": "67 out of 101 found this helpful.",
      "title": "The most overrated movie I've ever seen",
      "content": "Before anyone could accuse me of not liking this film because I'm not romantic let me tell you that I love romance. The more disgusting it is the more I like it. I liked the basic idea of two strangers falling in love in a nice Vienna scenery. But even beautiful Vienna couldn't save this movie. Well, American guy and French girl meet on a Budapest-Paris train (I'm not sure if there ever was a direct Budapest-Paris train, but whatever, there are direct Budapest-Vienna trains and that's pretty much enough for us). The boy convinces the girl to get off the train with him in Vienna and spend the rest of the day with him. Sounds sweet, right? From now on the movie is nothing but talking and talking and talking. Which wouldn't exactly be bad but in 9 scenes out of 10 they are talking so many deep-wannabe nonsense that made me have a slight nausea from about the 15th minute. I would have loved this movie much better with some likable, not-so-smart-ass characters. Maybe I will give a try to the sequel Before Sunset (God save me it's also an 8, I hope it's a much deserved 8). But before that I need some time to recover."
    },
    {
      "username": "Shaolin_Apu",
      "userUrl": "https://www.imdb.com/user/ur5132807",
      "reviewLink": "https://www.imdb.com/review/rw1139856",
      "warningSpoilers": false,
      "date": "1 August 2005",
      "rate": "10",
      "helpful": "27 out of 39 found this helpful.",
      "title": "Frame of Casablanca (1942)'s Love Story",
      "content": "There are many people in our lives that we meet only once in our lifetime, but for some reason or another we remember those persons for the rest of our lives. These once in a lifetime friendships occur between people with long distances between and there are always some natural reasons for why we don't meet these people anymore. We don't always even know their names, as we are never presented to each other, and sometimes we even forget to ask what their names are. It's funny how common humanity makes occasional friends and we like to keep it as such, because reuniting might spoil fond memories, or we don't know do they. We are too afraid to check that out.The movie 'Before Sunrise' just caught me watching it. I never had intention to watch it through, but because the discussion between the couple seemed interesting, I gave a look for the rest of the film. I didn't know what to expect from it, but nor did the young couple. They had time to discuss with each other until the sunrise and anything could happen before they had to separate. I believe this film has had good reviews because the situation is something that everybody on this planet has at least once or twice lived through. It makes us all think about all those people we have met only once in our lives."
    },
    {
      "username": "Chrysanthepop",
      "userUrl": "https://www.imdb.com/user/ur3872142",
      "reviewLink": "https://www.imdb.com/review/rw2021020",
      "warningSpoilers": false,
      "date": "10 February 2009",
      "rate": "",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Sublime Poetry",
      "content": "'Before Sunrise' is an example of cinema at its purest, simplest and most sincere form. How can I start describing it? Shall I start with the dazzling locations? The beautiful score? The stupendous screenplay? The breathtaking dialogues? The vivacious cinematography? The terrific direction? The excellent performances? Linklater is clearly a very versatile director. The way he's put everything in this film together is outstanding. Even though I'm familiar with Europe, the way he portrays the locations makes me want to visit those places. Throughout the film we see Jesse and Celine walk through the streets of Vienna and Linklater wonderfully returns to the same places in the end and even though both the characters have left for their respective current destinations the one feels their essence as if walking down memory lane.The development of the bond between Celine and Jesse is shown in a very subtle form. We can easily see how they are falling in love by noticing the way they look at each other, the way they talk to each other and the way they touch each other. The dialogues are sheer magic. The exceptional combination of humour, philosophy, spontaneity and subtlety brings a uniqueness about its treatment and yet it feels fascinatingly familiar. A charismatic Ethan Hawke and luminous Julie Delpy deliver natural performances. There is a sizzling chemistry and it is very easy to lose sight of the fact that they were acting. I feel both these two extraordinary actors are criminally underrated.The soundtrack marvelously stays in tune with the film. The cinematography guides us through the city as we walk along with Celine and Jesse, participating as silent observers without them being aware.'Before Sunrise' is sublime poetry. It is a must have for my DVD collection and the soundtrack for my CD collection. I will surely be revisiting it many more times as I know there will be something new to discover during each viewing."
    },
    {
      "username": "Davalon-Davalon",
      "userUrl": "https://www.imdb.com/user/ur3656525",
      "reviewLink": "https://www.imdb.com/review/rw3013143",
      "warningSpoilers": false,
      "date": "10 May 2014",
      "rate": "1",
      "helpful": "35 out of 56 found this helpful.",
      "title": "Incomprehensible",
      "content": "I simply do not understand the \"10 star reviews\" on this film. A young man and woman meet on a train. They start talking and the man convinces the woman to get off the train and walk around Vienna with him until it's time to catch his plane back to America instead of her original plan, which was to take the train back to Paris.This initially somewhat charming \"inciting incident\" is then followed for what seems like 24 excruciating hours of babbling and rambling discourse that sounds like it was made up on the spot. I didn't care about either one of these people, although the female character initially seemed much, much more intelligent and balanced than the male character. And yet she too got into the blab-fest and started to drive me insane. The man was judgmental and critical and dismissive of almost everything and I did not find anything about him remotely likable.If you think it is interesting to watch people playing pinball machines, walking through cemeteries, drinking beer out of bottles, wandering up and down streets, all while making peculiarly mundane commentary and observations and comments about life, you'll have a blast. If that sounds like a cure for insomnia, you'll be sound asleep about 10 minutes in to it.Absolutely deadly."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw5740787",
      "warningSpoilers": false,
      "date": "16 May 2020",
      "rate": "",
      "helpful": "6 out of 8 found this helpful.",
      "title": "wise embroidery",
      "content": "Its basic virtue is to reflect a realistic fantasie of many from us. Pieces of familiar details from dreams, movies, books, expectations, projects, summer stories of the teenager years are together, in a beautiful puzzle. And , the secongd great virtue it is to be just what to expect. After decades, the freshness of youth and acting of Julie Delpy and Ethan Hawke is another fundamental good point. And , sure, it is unfair to ignore Vienna as the perfect frame or the episodes of fortuneteller or poet or red wine bottle .Short, a wise embroidery of dreams and emotions. One of the best."
    }
  ],
  "errorMessage": ""
}